[{"id": "f95deb7c-9c26-4f77-ab11-7e8f171e453a", "title": "Hezbollah introduces new air defense missiles against warplanes", "date": "2024-06-07 09:30", "url": "https://www.naharnet.com/stories/en/305776-hezbollah-introduces-new-air-defense-weapons-intercepting-warplanes", "message": "Hezbollah fired Thursday for the first time air defense missiles at Israeli warplanes that the group said were \"breaking the sound barrier and terrorizing children.\"\nHezbollah said in a statement that its air defense missiles forced the warplanes to \"retreat beyond the border.\"\nLast month, Hezbollah struck a military post in northern Israel using a drone that fired two missiles, the first successful missile airstrike it has launched from within Israeli airspace.\nIsrael and Hezbollah have been exchanging fire daily since a day after Hamas’ Oct. 7 attack, which set off the war in Gaza.\nIn Lebanon, the cross-border violence has killed at least 455 people, mostly fighters but including 88 civilians, according to an AFP tally.", "location": "Lebanon", "classification": "security", "score": 0.8611652701327134, "event_breakdown": "Hezbollah fired Thursday for the first time air defense missiles at Israeli warplanes that the group said were”breaking the sound barrier and terrorizing children”. The Lebanese Shia Muslim group’s statement “his air defense missiles forced the warplanes to “retreat beyond the border”...Israeli planes and Hezbollah’s air defenses clashed late Wednesday...The Israeli military said the projectiles were launched by Hezbollah “in response” to earlier Israeli air strikes”."}, {"id": "5ca52bca-e777-435f-aabe-9442319552e0", "title": "Israeli soldier , 13 Palestinians killed as fierce clashes persist in Gaza : Sources", "date": "2024-06-07 03:00", "url": "https://www.prokerala.com/news/articles/a1537537.html", "message": "Image Source: IANS NewsGaza/Jerusalem, June 7 : At least 13 Palestinians were killed in the Israeli bombing of a house and a youth gathering in the Gaza Strip, Palestinian sources have said.\nIsraeli warplanes on Thursday bombed a house east of Khan Younis city in southern Gaza with at least one missile, Xinhua news agency reported, citing Palestinian security sources.\nMedical sources said the airstrike killed eight people, including children and women, and injured several others, all of whom had been taken to hospital.\nMeanwhile, the Israeli army claimed that its soldiers encountered Palestinian militants who emerged from a tunnel shaft in southern Gaza, about 200 meters away from the Israeli border.\nEarlier in the day, Hamas armed wing Al-Qassam Brigades said it blew up a tunnel entrance set by Israeli forces near Rafah as a trap, killing five Israeli soldiers inside.", "location": "GAZA/JERUSALEM.", "classification": "security", "score": 0.9973780084996469, "event_breakdown": "13 Palestinians were killed in the Israeli bombing of a house and a youth gathering in the Gaza Strip. Israeli forces encountered Palestinian militants who emerged from a tunnel shaft in Rafah."}, {"id": "4571ff1d-8282-458c-a083-342f2650cd8e", "title": "Israeli soldier , 13 Palestinians killed as fierce clashes persist in Gaza : Sources", "date": "2024-06-07 05:00", "url": "https://www.siasat.com/israeli-soldier-13-palestinians-killed-as-fierce-clashes-persist-in-gaza-sources-3040070/", "message": "Gaza: At least 13 Palestinians were killed in the Israeli bombing of a house and a youth gathering in the Gaza Strip, Palestinian sources have said.\nIsraeli warplanes on Thursday bombed a house east of Khan Younis city in southern Gaza with at least one missile, Xinhua news agency reported, citing Palestinian security sources.\nOn the same day, a drone targeted a gathering of youths in the Al-Shati refugee camp in northern Gaza, according to local sources and eyewitnesses.\nMeanwhile, the Israeli army claimed that its soldiers encountered Palestinian militants who emerged from a tunnel shaft in southern Gaza, about 200 meters away from the Israeli border.\nEarlier in the day, Hamas armed wing Al-Qassam Brigades said it blew up a tunnel entrance set by Israeli forces near Rafah as a trap, killing five Israeli soldiers inside.", "location": "GAZA", "classification": "security", "score": 0.9973152653219077, "event_breakdown": "Israeli warplanes have launched airstrikes in the Gaza Strip. (Xinhua)\nIsraeli drones targeted a gathering of youths in the Al-Shati refugee camp in the northern Gaza Strip. (Xinhua)\nIsraeli airstrikes struck a home near Khan Younis in southern Gaza. (Xinhua)\nIsraeli troops and Hamas militants clashed near Rafah in Gaza. Hamas said that it blew up a tunnel set for Israeli soldiers, killing 5 of them. (Xinhua)"}, {"id": "564f7c85-4bbf-4708-aca1-8d1c0efaefec", "title": "At least 30 killed after Israeli strikes on UN - run school in Gaza", "date": "2024-06-07 01:00", "url": "https://www.indiatoday.in/world/story/israel-hamas-war-gaza-un-school-attack-several-dead-injuredb-2550097-2024-06-07", "message": "He said 20 to 30 fighters were located in the compound, and many of them had been killed.\nLater Israel's chief military spokesperson Daniel Hagari said the military had so far identified nine of 30 Hamas and Islamic Jihad fighters targeted in the pre-dawn strike.\nThere was no immediate response from the Israeli military on the two latest accounts.\nIn another sensitive development, the Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire.\nUS and Israeli officials have told Reuters about half of Hamas's forces have been killed in the conflict.", "location": "GAZA CITY.", "classification": "security", "score": 0.9817293969711416, "event_breakdown": "Israeli soldiers killed, three Palestinians killed\nGaza City"}, {"id": "d702fc83-bff7-4ccb-86f0-45d164e21cd1", "title": "Israeli strike on UN school kills dozens in Gaza", "date": "2024-06-07 00:15", "url": "https://www.swissinfo.ch/eng/israeli-strike-on-un-school-kills-dozens-in-gaza/79814706", "message": "Later Israel’s chief military spokesperson Daniel Hagari said the military had so far identified nine of 30 Hamas and Islamic Jihad fighters targeted in the pre-dawn strike.\nThere was no immediate response from Israeli military on the two latest accounts.\nIn another sensitive development, the Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire.\nHamas precipitated the war by attacking Israeli territory last Oct. 7, killing around 1,200 people and capturing more than 250 hostages, according to Israeli tallies.\nU.S. and Israeli officials have told Reuters about half of Hamas’s forces have been killed in the conflict.", "location": "GAZA STRIP", "classification": "security", "score": 0.9720430856307866, "event_breakdown": "Israel-Gaza Border, Southern Israel: A squad of Palestinian fighters killed a soldier near the border of Israel and the Gaza Strip. The Israeli military reported three Palestinians were killed in return fire. The Israeli military reported a rare attack near the Israel-Gaza border."}, {"id": "83445949-eeb2-4a15-949f-731175b9b54d", "title": "Deadly Gaza strike raises US concerns about civilians , despite precision munitions", "date": "2024-06-07 02:15", "url": "https://abcnews.go.com/Politics/deadly-gaza-strike-raises-us-concerns-civilians-despite/story?id=110907616", "message": "An Israeli attack on a UN school complex in central Gaza is raising alarm among U.S. officials after scores of civilians were reportedly killed, despite the apparent use of American-made precision munitions.\nPalestinians look at the aftermath of the Israeli strike on a U.N.-run school that killed dozens of people in the Nusseirat refugee camp in the Gaza Strip, June 6, 2024.\nPalestinians inspect the site of an Israeli strike on a UNRWA school sheltering displaced people, amid the Israel-Hamas conflict, in Nuseirat refugee camp in the central Gaza Strip, June 6, 2024.\nPalestinians inspect the site of an Israeli strike on a UNRWA school sheltering displaced people, amid the Israel-Hamas conflict, in Nuseirat refugee camp in the central Gaza Strip, June 6, 2024.\nThrough the conflict, Israel has not made a consistent practice of sharing intelligence justifying its attacks with its allies or the public.", "location": "Gaza", "classification": "security", "score": 0.979708049764129, "event_breakdown": "Gaza Hospital Attack Kills At Least 7, Injures Dozens\nAt least seven people have been killed and 22 others were injured late Sunday when Israeli jets attacked a building that houses a coronavirus testing and treatment centre as well as the headquarters of the Hamas movement's health ministry, the official Palestinian news agency Wafa reported. It was the latest in a series of Israeli strikes on targets in the Gaza Strip that have killed dozens of Palestinians and flattened towers and buildings.\n\nThe Times of Israel said the site was \"a secret headquarters of the terror group's naval commando unit,\" but there was no mention of this in the Wafa report. The Israeli newspaper Haaretz said the attack on the building was not the first. It had been targeted by the Israeli military several times during the 2014 war, when it was used as a military compound.\n\n\n\nHaaretz said the attack \"caused serious damage to the building,\" which \"the Israeli military said was used as a secret military compound of the Hamas naval unit, which was responsible for a number of attacks against Israel.\"\n\nThough the site had previously been targeted in Israeli military strikes, Sunday's attack took place when it was being used as a testing centre for COVID-19, according to Wafa.\n\nThe Gaza Health Ministry saidseven were killed, including two militants, while 22 people were injured. Among the injured were two critically and one with moderate injuries, Ma'an News Agency said.\n\nThe Israeli army, which did not immediately comment on the strike, confirmed it was behind the attack. The military said it had hit an underground tunnel in Khan Yunis in the southern Gaza Strip, and that two Hamas militants were killed in"}, {"id": "2fbb8a8a-3ae6-4587-8e9a-6cd86cb74f8b", "title": "Israeli strike on UN school kills dozens in Gaza", "date": "2024-06-07 07:15", "url": "https://www.stabroeknews.com/2024/06/07/news/world/israeli-strike-on-un-school-kills-dozens-in-gaza/", "message": "Later Israel’s chief military spokesperson Daniel Hagari said the military had so far identified nine of 30 Hamas and Islamic Jihad fighters targeted in the pre-dawn strike.\nThere was no immediate response from Israeli military on the two latest accounts.\nIn another sensitive development, the Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire.\nHamas precipitated the war by attacking Israeli territory last Oct. 7, killing around 1,200 people and capturing more than 250 hostages, according to Israeli tallies.\nU.S. and Israeli officials have told Reuters about half of Hamas’s forces have been killed in the conflict.", "location": "GAZA", "classification": "security", "score": 0.9720430856307866, "event_breakdown": "Event 1: In the early hours of Oct. 21, the Israeli military targeted 30 Hamas and Islamic Jihad fighters in the Gaza Strip. At least nine of the fighters were killed in the strikes.\n\nEvent 2: In a separate incident, Palestinian fighters attacked an Israeli soldier near the Israel-Gaza border. The soldier was killed in the attack, and three Palestinian fighters were killed by Israeli return fire."}, {"id": "1ce38cdf-465f-4cb7-8a26-be2a78a9ace2", "title": "CNN Reports IDF Strike on Hamas HQ as  Israel Strike on UN School That Left Dozens Dead  ", "date": "2024-06-07 02:00", "url": "https://www.breitbart.com/the-media/2024/06/06/cnn-reports-idf-strike-on-hamas-hq-as-israel-strike-on-un-school-that-left-dozens-dead/", "message": "Eliminated: several Hamas and Islamic Jihad terrorists who embedded themselves inside of an @UNRWA school.\nIAF fighter jets conducted a precise strike on a Hamas compound embedded inside the school in the area of Nuseirat.\n“At least 45 people were killed in the strike, a spokesperson from Gaza’s Ministry of Health told CNN,” the story says.\nIn a statement, the IDF said:A short while ago, IAF fighter jets, directed by IDF intelligence and the ISA, conducted a precise strike on a Hamas compound embedded inside an UNRWA school in the area of Nuseirat.\nThe Times of Israel reported that the IDF believed 20-30 terrorists were in the compound at the time of the strike.", "location": "Nablus, West Bank", "classification": "security", "score": 0.9461558222842212, "event_breakdown": "IDF jets strike a Hamas compound in an UNRWA school in the Nuseirat. 45 people are reported killed in the ensuing strike."}, {"id": "f4e1de59-0fc2-4099-9ccd-24d6cf150daa", "title": "Mayor of Gaza Nuseirat killed in Israeli strike – Ya Libnan", "date": "2024-06-07 00:45", "url": "https://yalibnan.com/2024/06/07/mayor-of-gazas-nuseirat-killed-in-israeli-strike/", "message": "Mayor of Nuseirat, Iyad al-Maghari was assented in the raid that targeted a municipal building in central Gaza.\nThe Palestinian mayor of Nuseirat refugee camp was killed by an Israeli airstrike, Palestinian medical and security sources said Thursday.\nIsraeli fighter jets carried out a raid on the Nuseirat camp, in which five Palestinians including the Mayor of Nuseirat, Iyad al-Maghari, were killed in the raid that targeted a municipal building in central Gaza.\n“The government of Israel has said that they are going to release more information about this strike, including the names of those who died in it.\nWe expect them to be fully transparent in making that information public,” State Department Spokesperson Matthew Miller said in a press briefing.", "location": "GAZA STRIP", "classification": "security", "score": 0.9419101380013742, "event_breakdown": "New event: Israeli airstrikes kill Palestinian mayors in Gaza building\nIsraeli airstrikes killed five Palestinians, including the mayor of Nuseirat refugee camp, Iyad al-Maghari, when they hit a municipal building in central Gaza on Thursday."}, {"id": "9655a6ff-c6c7-412e-ad44-4214d77d20a2", "title": "Deadly Gaza strike raises US concerns about civilians , despite precision munitions", "date": "2024-06-07 02:15", "url": "https://www.yahoo.com/news/deadly-gaza-strike-raises-us-012555174.html", "message": "An Israeli attack on a UN school complex in central Gaza is raising alarm among U.S. officials after scores of civilians were reportedly killed, despite the apparent use of American-made precision munitions.\nPHOTO: Palestinians look at the aftermath of the Israeli strike on a U.N.-run school that killed dozens of people in the Nusseirat refugee camp in the Gaza Strip, June 6, 2024.\nThrough the conflict, Israel has not made a consistent practice of sharing intelligence justifying its attacks with its allies or the public.\nBut Palestinians in Gaza say the end result is that they are left with no refuge from the horrors of war.\nDeadly Gaza strike raises US concerns about civilians, despite precision munitions originally appeared on abcnews.go.com", "location": "GAZA", "classification": "security", "score": 0.9554486966008267, "event_breakdown": "Israeli strike kills civilians, Palestinians say, raises US concerns\nPalestinian officials say that scores of civilians were killed in an Israeli airstrike on a U.N. school complex in central Gaza. Israel has not made a consistent practice of sharing intelligence justifying its attacks."}, {"id": "ac2cfe22-5cf1-4e00-8a1f-aa8d069859bf", "title": "Ukraine takes out 48 of 53 Russian drones and all 5 cruise missiles overnight on June 7", "date": "2024-06-07 08:15", "url": "https://www.yahoo.com/news/ukraine-takes-48-53-russian-064900863.html", "message": "Ukraine takes out 48 of 53 Russian drones and all 5 cruise missiles overnight on June 7Ukrainian air defense forces shot down 48 out of 53 Shahed-131/136 drones and all five Kh-101/Kh-555 cruise missiles overnight on June 7, Ukrainian Air Force Commander Mykola Oleshchuk reported.\nRussia launched 53 Shahed drones from Primorsko-Akhtarsk, Yeisk, Kursk, and temporarily occupied Crimea to target Ukraine's critical infrastructure.\nFive Kh-101/Kh-555 cruise missiles were fired from Tu-95MS bombers from Russia's Saratov Oblast.\nThe night-long attack saw cruise missiles heading for western oblasts, with explosions reported in Khmelnytskyi Oblast.\nRead also: Russia destroys another Epicentr hypermarket in Kherson – PhotoA fire broke out at an industrial site in Kyiv Oblast as a result of the Russian attack, Kyiv officials reported.", "location": "RUSSIA", "classification": "security", "score": 0.9756450805521298, "event_breakdown": "Ukraine takes out 48 of 53 Russia\nShahed-131/136 drones\nKh-101/Kh-555 cruise missiles"}, {"id": "fb64a4d3-118a-417e-84ce-4aba2daeb450", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://knpr.org/npr/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "Israel airstrike kills at least 32 people in Gaza."}, {"id": "58eeca8c-2963-4d02-8eab-576e0c4f8676", "title": "Israeli soldier , 13 Palestinians killed as fierce clashes persist in Gaza : Sources", "date": "2024-06-07 05:30", "url": "https://www.orissapost.com/israeli-soldier-13-palestinians-killed-as-fierce-clashes-persist-in-gaza-sources/", "message": "Gaza/Jerusalem: At least 13 Palestinians were killed in the Israeli bombing of a house and a youth gathering in the Gaza Strip, Palestinian sources have said.\nIsraeli warplanes on Thursday bombed a house east of Khan Younis city in southern Gaza with at least one missile, Xinhua news agency reported, citing Palestinian security sources.\nMedical sources said the airstrike killed eight people, including children and women, and injured several others, all of whom had been taken to hospital.\nMeanwhile, the Israeli army claimed that its soldiers encountered Palestinian militants who emerged from a tunnel shaft in southern Gaza, about 200 meters away from the Israeli border.\nEarlier in the day, Hamas armed wing Al-Qassam Brigades said it blew up a tunnel entrance set by Israeli forces near Rafah as a trap, killing five Israeli soldiers inside.", "location": "GAZA/JERUSALEM", "classification": "security", "score": 0.9973990537059717, "event_breakdown": "Gaza/Jerusalem: At least 13 Palestinians were killed in the Israeli bombing of a house and a youth gathering in the Gaza Strip, Palestinian sources have said.\nIsraeli warplanes on Thursday bombed a house east of Khan Younis city in southern Gaza with at least one missile, Xinhua news agency reported, citing Palestinian security sources.\nMedical sources said the airstrike killed eight people, including children and women, and injured several others, all of whom had been taken to hospital."}, {"id": "7e474d4d-6c03-4266-8e33-73f926bdb076", "title": "Israeli strike on U . N . school kills dozens in Gaza", "date": "2024-06-07 05:00", "url": "https://www.japantimes.co.jp/news/2024/06/07/world/israeli-strike-un-school-gaza/", "message": "Israel hit a Gaza school on Thursday with what it described as a targeted airstrike on up to 30 Hamas and Islamic Jihad fighters inside.\nA Hamas official said 40 people were killed, including women and children sheltering at the U.N. site.\nVideo footage showed Palestinians hauling away bodies and scores of injured in a hospital after the attack, which took place at a sensitive moment in mediated talks on a cease-fire that would involve releasing hostages held by Hamas and some of the Palestinians held in Israeli jails.", "location": "GAZA", "classification": "security", "score": 0.9145534615572783, "event_breakdown": "Israel hit a Gaza school on Thursday with what it described as a targeted airstrike on up to 30 Hamas and Islamic Jihad fighters inside. A Hamas official said 40 people were killed, including women and children sheltering at the U.N. site. Video footage showed Palestinians hauling away bodies and scores of injured in a hospital after the attack, which took place at a sensitive moment in mediated talks on a cease-fire that would involve releasing hostages held by Hamas and some of the Palestinians held in Israeli jails."}, {"id": "ac2752be-ebd3-4d79-afac-933e25a34278", "title": "Middle East Crisis update : Israel ups war talk against Hezbollah ; Yemen peace deal jeopardised as US moves to counter Houthis", "date": "2024-06-07 02:30", "url": "https://www.dailymaverick.co.za/article/2024-06-07-israel-ups-war-talk-against-hezbollah-yemen-peace-deal-jeopardised-as-us-moves-to-counter-houthis/", "message": "Israel ups war rhetoric as Hezbollah’s attacks raise alarmIsrael is escalating warnings against Hezbollah in Lebanon by threatening it could be forced into a war with the Iran-backed group, following increasingly deadly attacks.\n“Whoever thinks he can hurt us while we respond by sitting on our hands is making a big mistake,” said Netanyahu.\nBoth Hezbollah and Hamas are backed by Iran and designated as terrorist organisations by the US.\nThe US said on Wednesday it was pursuing a peaceful solution between Lebanon and Israel to prevent a full-scale conflict.\nIt described the attack as a precision strike on the school complex in the central Gaza area of Nuseirat.", "location": "Gaza", "classification": "security", "score": 0.7553025934093447, "event_breakdown": "Security Event 1: Israel launches airstrike on Gaza\n\nAMID escalating violence in Israel, Israel launched an air strike on Gaza yesterday. The air strikes were widely reported in Middle East and world media outlets, as well as on social media.\n\nAccording to reports, the attack hit a residential high-rise building in a densely-populated area of the blockaded Strip.\n\nSecurity Event 2: Israel launches airstrike on Lebanon\n\nRockets were fired from Lebanon into Israeli border towns, prompting retaliatory air strikes from Israel."}, {"id": "8c602600-3caa-4c46-801c-1efd6172f9da", "title": "United States demands answers from Israel over deadly airstrike on U . N . school in Gaza", "date": "2024-06-07 11:45", "url": "https://www.yahoo.com/news/united-states-demands-answers-israel-110351818.html", "message": "The United States has told Israel that it expects clear answers regarding an airstrike that killed at least 35 people, reportedly including 14 children, at a U.N. school in central Gaza where internally displaced Palestinians were taking refuge.\nPhoto by Mohammed Saber/EPA-EFEJune 7 (UPI) -- The United States communicated to Israel that it expects clear answers regarding an airstrike that killed at least 35 people, reportedly including 14 children, at a U.N. school in central Gaza where internally displaced Palestinians were taking refuge.\nWe've seen the claims that 14 children were killed in this strike.\nAnd certainly when you see -- if that is accurate that 14 children were killed, those aren't terrorists.\nIsrael often names militants it has \"eliminated\" but the United States almost never pushes it to do so.", "location": "GAZA CITY", "classification": "security", "score": 0.8572916872381378, "event_breakdown": "The target event was found in the text:\nThe United States told Israel that it expects clear answers regarding an airstrike that killed at least 35 people, reportedly including 14 children, at a U.N. school in central Gaza."}, {"id": "d0ceef66-aa7e-4cf0-8f2e-7a610bf213b6", "title": "United States demands answers from Israel over deadly airstrike on U . N . school in Gaza", "date": "2024-06-07 11:45", "url": "https://www.upi.com/Top_News/World-News/2024/06/07/school-airstrike-US-demands-transparency/7711717749325/", "message": "The United States has told Israel that it expects clear answers regarding an airstrike that killed at least 35 people, reportedly including 14 children, at a U.N. school in central Gaza where internally displaced Palestinians were taking refuge.\nPhoto by Mohammed Saber/EPA-EFEJune 7 (UPI) -- The United States communicated to Israel that it expects clear answers regarding an airstrike that killed at least 35 people, reportedly including 14 children, at a U.N. school in central Gaza where internally displaced Palestinians were taking refuge.\nWe've seen the claims that 14 children were killed in this strike.\nAnd certainly when you see -- if that is accurate that 14 children were killed, those aren't terrorists.\nIsrael often names militants it has \"eliminated\" but the United States almost never pushes it to do so.", "location": "GAZA", "classification": "security", "score": 0.8572916872381378, "event_breakdown": "The U.S. told Israel that it expects clear answers regarding the strike, reportedly including 14 children, at the UN school in central Gaza where Palestinian internally displaced persons (IDPs) were taking refuge."}, {"id": "0e5cd3bb-5955-4919-ad8b-bd23a434a201", "title": "Israel attacks UN - run school in Gaza , killing at least 40", "date": "2024-06-07 07:30", "url": "https://www.rediff.com/news/report/pix-israel-attacks-un-run-school-in-gaza-killing-at-least-40/20240607.htm", "message": "IMAGE: Palestinians inspect the site of an Israeli strike on a UNRWA school sheltering displaced people, amid the Israel-Hamas conflict, in Nuseirat refugee camp in the central Gaza Strip, June 6, 2024.\nPhotograph: Abed Khaled/ReutersThe Israeli strike reportedly killed at least 40 people in the early hours of this morning, Al Jazeera reported, citing Gaza's government statement.\nAs per IDF, the terrorists used thr UNRWA school it as a shelter.\nHamas has condemned the \"massacre\" committed by Israeli forces against civilians at an UNRWA school in Nuseirat in the central Gaza Strip, and said that it was a premeditated crime.\nIMAGE: Wounded Palestinians injured in an Israeli strike on a UNRWA school shelter at Al-Aqsa Martyrs Hospital.", "location": "GAZA", "classification": "security", "score": 0.9865561998076299, "event_breakdown": "Gaza: A reported Israeli strike on a UNRWA school shelter killed at least 40 people in the early hours of 6/6/2024, Al Jazeera reported, citing Gaza's government statement. The Israeli Defence Forces (IDF) said that Hamas used the UNRWA school that as a shelter.\nGaza: In response, middle east-based Al Jazeera media outlet identified a strike on the UN school shelter as a deliberate attack on civilians. Hamas leader Ismail Haniyeh promised to retaliate against the strike that killed 42 people."}, {"id": "ae552c34-f9c5-4fde-a980-c6d5931ee92b", "title": "Israeli Strike Kills Dozens at Former School Where Civilians Were Sheltering | World News", "date": "2024-06-07 01:30", "url": "https://indianexpress.com/article/world/israeli-strike-kills-dozens-at-former-school-where-civilians-were-sheltering-9377149/", "message": "An Israeli airstrike hit a United Nations school complex in the central Gaza Strip that had become a shelter for thousands of displaced Palestinians, killing dozens of people, officials said early Thursday.\nLt. Col. Peter Lerner, an Israeli military spokesperson, said he was “not aware of any civilian casualties” as a result of the strike.\nIsraeli forces had twice postponed the strike so as to reduce civilian casualties, the military said.\nHe said the militants had used the compound to plan attacks on Israeli forces, although he did not provide specific examples.\nThe compound that was hit, in the central Gaza city of Nuseirat, had been operated by UNRWA, the main UN body that aids Palestinians in Gaza.", "location": "The main event is in the Gaza Strip, specifically the city of Nuseirat in the central Gaza Strip.", "classification": "security", "score": 0.9795004075184944, "event_breakdown": "Israeli airstrike hits United Nations school in Gaza, killing dozens"}, {"id": "deb1d533-d8d0-4408-bffb-9226cef646b4", "title": "US urges Israel to be  fully transparent  after strike on UN school", "date": "2024-06-07 06:15", "url": "https://www.prokerala.com/news/articles/a1537559.html", "message": "US urges Israel to be 'fully transparent' after strike on UN school.\nImage Source: IANS NewsWashington, June 7 : The United States has called for an investigation into the deadly Israeli airstrike on a school building run by the UN agency (UNRWA) for Palestinian refugees in central Gaza and told Israel it must be \"fully transparent.\"\nUS State Department spokesman Matthew Miller said on Thursday that even if Israel's army intended to target Hamas militants, the claims of children killed in the strike \"show that something went wrong.\"\nHe said the US had seen reports that 14 children were killed in the strike.\nAccording to the UNRWA, the school building in the refugee district of Nuseirat was being used as an emergency shelter.", "location": "Gaza", "classification": "security", "score": 0.5715696901834536, "event_breakdown": "US urges Israel to be 'fully transparent' after strike on UN school, in Gaza."}, {"id": "17efe029-da55-404c-8d05-db17da69ec32", "title": "Polish aircraft scrambled during Russian attack on Ukraine", "date": "2024-06-07 08:15", "url": "https://www.yahoo.com/news/polish-aircraft-scrambled-during-russian-041910845.html", "message": "Polish and allied fighter aircraft were scrambled due to a Russian missile and drone attack on Ukraine.\nSource: Operational Command of the Polish Armed Forces on ХQuote: \"Be advised that Polish and allied aircraft are flying in Polish airspace, which may lead to increased noise levels, especially in the southeastern part of the country.\nLater, Operational Command reported that the air operation had ended due to a \"reduction in the level of threat of missile strikes by Russian aircraft on areas bordering our territory.\"\n\"This night was very tense for the entire Polish air defence system, as a Russian large-scale missile attack covered the entire territory of Ukraine, including regions bordering Poland,\" the statement said.\nOperational Command emphasised that the Polish military \"is continuously monitoring the situation on Ukrainian territory and is on constant combat alert to ensure the security of Polish airspace.\"", "location": "POLAND", "classification": "security", "score": 0.5363183814944028, "event_breakdown": "Event: Russian missile attack on Ukraine reported\nLocation: Ukraine\nCurrent Event: Polish and allied fighter aircraft were scrambled due to a Russian missile attack on Ukraine."}, {"id": "83affce0-ba9d-432b-aa09-c89fc8c516d6", "title": "UNRWA Says Israeli Forces Hit Refugee Camp Without Prior Warning", "date": "2024-06-07 11:15", "url": "https://www.finanznachrichten.de/nachrichten-2024-06/62437935-unrwa-says-israeli-forces-hit-refugee-camp-without-prior-warning-020.htm", "message": "JERUSALEM (dpa-AFX) - The UN agency for Palestinian refugees says the deadly Israeli airstrike on a UN-run refugee camp in Gaza was carried out without prior warning to the hundreds of displaced inmates or UNRWA.\nAt least 45 people were killed and dozens of others were injured when missiles fired by an Israeli warplane fell on a UN-run school-turned refugee camp in Nuseirat, accommodating 6000 displaced people in central Gaza.\nReports quoting the Israeli military said that the strike was only given the go-ahead after aerial surveillance, with additional measures taken to reduce the risk to civilians.\nHe demanded that targeting UN premises or using them for military purposes must stop, and all those responsible must be held accountable.\nSince the war in Gaza began, more than 180 UNRWA buildings were hit and more than 450 displaced people were killed as a result, according to the UN agency.", "location": "GAZA", "classification": "security", "score": 0.864437942201859, "event_breakdown": "Tel Aviv, Israel\nJerusalem, Israel\nGaza Strip, Palestinian Territories"}, {"id": "8af965bd-780f-4e51-a86f-cc33372548da", "title": "Press TVs news headlines", "date": "2024-06-07 04:00", "url": "http://www.presstv.ir/Detail/2024/06/07/726979/Heds", "message": "US-Israeli genocide in GazaMore Palestinian civilians are killed as Israel’s indiscriminate airstrikes and artillery fire continue to pound various parts of the besieged Gaza Strip.\nAn Israeli strike on a house in the Nusseirat refugee camp in central Gaza has killed the mayor of the camp and four members of his family.\nThe new attacks came after a deadly Israeli strike on a school in the Nusseirat camp killed at least 40 civilians, including nine women and 14 children.\nGaza school attackCondemnations are pouring in over Israel’s deadly airstrike on a UN-run school in central Gaza, which killed over 40 displaced Palestinian civilians sheltering there.\nUN Secretary General, Antonio Guterres condemned the attack as another horrific example of the price Palestinian civilians are paying to survive.", "location": "GAZA", "classification": "security", "score": 0.9938538876119067, "event_breakdown": "New Israeli air strikes pounded various parts of the Gaza Strip on Thursday, killing more Palestinian civilians as the Israeli military continued to bomb the besieged territory. The Israeli strike on a house in the Nusseirat refugee camp in central Gaza killed the mayor of the camp and four members of his family. As of yet, the Israeli military has not commented on these latest attacks.\n\nLater on the same day, the Israeli military launched a deadly airstrike on a UN-run school in the Nusseirat camp, killing at least 40 displaced Palestinian civilians who had taken shelter there. United Nations Secretary General Antonio Guterres denounced the attack as another horrific example of the price Palestinian civilians are paying to survive.\n\nBoth of these events took place on Thursday, August 1 in Gaza."}, {"id": "25fc60aa-274a-4d73-8658-a342876edf19", "title": "Whether Hezbollah Hit An Iron Dome Launcher Or Not , Its Almas Missiles Are A Problem For Israel", "date": "2024-06-07 02:30", "url": "https://www.yahoo.com/news/whether-hezbollah-hit-iron-dome-013811777.html", "message": "Several components of an active Iron Dome launcher appear to be missing.\nWhile it was struck, there was no indication of secondary explosions from the Tamir interceptors that fill the canisters in an active Iron Dome launcher.\n“This is the first time I've observed an Iron Dome launcher being hit.\nOn Wednesday, The IDF said it “was unaware of any damage to an Iron Dome launcher,” the Times of Israel reported .\nThe latest configuration of the Iron Dome system also have a demonstrated ability to shoot down drones and low-flying cruise missiles .", "location": "Israel", "classification": "security", "score": 0.41315578385570306, "event_breakdown": "IDF Iron Dome shot down UAV from Lebanon that was approaching Israeli territory on 2022-06-02\nSabotage attack damaged Iron Dome launcher outside of Ashkelon that belongs to an Israeli defense contractor on 2022-06-01"}, {"id": "eefa5254-971a-4464-a9db-1c894a750d38", "title": "Israeli military strikes UN school in Gaza Strip", "date": "2024-06-07 07:30", "url": "https://thetimeshub.in/israeli-military-strikes-un-school-in-gaza-strip/", "message": "Photo: Staff member The UN inspects a UN school damaged during Israeli bombing in Nuseirat, in the central part of the Gaza Strip, June 6, 2024The Israeli military on Thursday, June 6, carried out an airstrike on a UN school in the central part Gaza Strip, which, according to Palestinian health authorities, killed at least 27 people, reports Voice of America.\nThe Israel Defense Forces reported that Hamas militants who took part in the attack on Israel 7 October, used the school as a hideout and a “direction of terror.”The Hamas press office rejected Israel's explanation and said Israeli forces had committed a “brutal crime” against displaced persons.\nThe attack targeted a school in Nuseirat run by the UN agency for Palestinian refugees.\nPrepared by: Sergei Daga", "location": "GAZA", "classification": "security", "score": 0.9763139566833663, "event_breakdown": "IDF airstrike targeting a UN school in Nuseirat, central Gaza Strip, kills 27. The attack was reported on 6 June 2024."}, {"id": "21beef13-53fd-4a6a-819e-35a29cb3ee67", "title": "Series of Explosions Rock Russian - Occupied Luhansk , Partisans Claim Oil Depot Strike", "date": "2024-06-07 14:00", "url": "https://www.kyivpost.com/post/33929", "message": "The guerrilla movement Atesh reported a series of explosions in Russian-occupied Luhansk and damage to an oil depot on Friday, June 7, via Telegram.\n“An Atesh agent from Luhansk reports a good strike on the oil depot and a big fire in the area of Hostra Mohyla (a memorial in Luhansk),” the report said.\nAccording to Russian media, the strikes allegedly damaged civilian infrastructure.\nUkrainian social media reported that the Russian military facility in Luhansk was hit as a result of the attack.\nBoth Russian and Ukrainian social media widely identified the strike weapon as ATACMS, although there has been no official confirmation.", "location": "LUHANSK", "classification": "security", "score": 0.5474486316844229, "event_breakdown": "{\n  \"message\": [\n    {\n      \"location\": \"Luhansk\",\n      \"description\": \"Ukrainian guerrillas of Atesh movement launched a series of attacks on Russian occupants in Luhansk, including an explosion in an oil depot in Hostra Mohyla\"\n    }\n  ]\n}"}, {"id": "111c8fc5-fb71-4a85-beb9-5a4215118229", "title": "State Dept : Israel Must Identify Hamas  Fighter Killed – One America News Network", "date": "2024-06-07 02:30", "url": "https://www.oann.com/newsroom/state-dept-israel-must-identify-hamas-fighters-killed/", "message": "The Israelis have released footage they say is evidence of those Hamas operations,” according to CNN.\n“Documents were [previously] found on the bodies of Hamas terrorists by Israeli first responders… They include detailed maps and show that Hamas intended to kill or take hostage civilians and schoolchildren,” according to NBC News.\nMeanwhile, U.S. State Department spokesman Matthew Miller asserted that the identities of the “Hamas fighters” should be identified, the BBC reported.\nAlthough Israel typically does so anyway, the U.S. rarely presses Israel to identify terrorists it has killed in airstrikes.\nTwo upper floors of the building’s classrooms were marked on an annotated aerial shot as the “locations of the terrorists,” according to the IDF.", "location": "Gaza City", "classification": "security", "score": 0.9121972628287239, "event_breakdown": "Israel bombs High rise building in Gaza in response to Hamas launching incendiary balloons into Israel\nIDF posts banner dramatic, simulated attack on Iranian nuclear facility, IDF publishes Instructions for defense against cyber-attacks, IDF stops Hamas operation to murder civilians and students\nIsraeli military strike a high rise building in Gaza in response to Hamas launching incendiary balloons into Israel. The Israeli military provided a video showing some of the incendiary devices being launched from Gaza."}, {"id": "15e0026f-5490-4295-ae8d-85c8226e8243", "title": "Houthi rebel new missile launch throws curveball in Red Sea", "date": "2024-06-07 11:00", "url": "https://www.dailysabah.com/world/mid-east/houthi-rebels-new-missile-launch-throws-curveball-in-red-sea", "message": "Yemen's Houthi rebels have introduced a new solid-fuel missile, the \"Palestine,\" mirroring aspects of an earlier hypersonic-speed missile displayed by Iran.\nOn Monday, the rebels launched the Palestine missile, adorned with a warhead painted in the pattern of a Palestinian keffiyeh, targeting the southern Gulf of Aqaba port of Eilat in Israel.\nThat is a key concern for the Houthis as their missile launch sites have been repeatedly targeted by U.S. and allied forces in recent months over the rebels' attacks on shipping through the Red Sea corridor.\nOne such strike hit the Houthis even before they were able to launch their missile.\nIran unveiled the missile last year and claimed it could reach Mach 15 – 15 times the speed of sound.", "location": "I did not find any specific location mentioned in the text.", "classification": "security", "score": 0.5665532074498026, "event_breakdown": "1. Houthi rebels in Yemen have introduced a new solid-fuel missile, the Palestine, effectively mirroring aspects of a missile displayed by Iran.\n2. The Palestine missile, adorned with a warhead painted in the pattern of a Palestinian keffiyeh, targeted the southern Gulf of Aqaba Israeli port of Eilat.\n3. Iranian unveiled the missile last year and claimed it could reach Mach 15 – 15 times the speed of sound\nTARGET:\nHouthis in Palestine missile launch\nWhile the Houthi missile targeting Eilat that was launched on Monday was successfully intercepted by Israel, now is the time for there to be a counter-reaction to the Houthi missile threat.\nThe increased Houthi missile capabilities are a danger to not only the Red Sea shipping route but also the Red Sea stability of country base blue lines.\n\nNow after the ball is opened, it feels like it's about to get very real.[\nThe United States will likely have to work closely with Yemen and its Saudi backed coalition. The coalition would need to strengthen its efforts to strike key Houthi targets or force the rebel group to the table for talks. \nAs many have claimed. Although this is an answer, I do see both a justice consideration and an HMMWV vehicle.\nThere is no justice in backing the Saudi merciless military that is the cause of many of the problems in Yemen."}, {"id": "13b8a7e4-92f4-4516-a960-2f812066acb4", "title": "At Least 30 Killed in Israel Airstrike on Refugee Camp in Gaza Strip", "date": "2024-06-07 11:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240606-sputnik06.htm", "message": "At Least 30 Killed in Israel's Airstrike on Refugee Camp in Gaza Strip - ReportsSputnik News20240606MOSCOW (Sputnik) - At least 30 people, most of them women and children, have been killed in an Israeli airstrike on a school in the Nuseirat refugee camp in the Gaza Strip, media reported on Thursday.\nDisplaced Palestinians were sheltering in a school that came under attack, China's Xinhua news agency reported, citing health sources.\nNearly 1,200 people in Israel were killed and some 240 others abducted during the attack.\nOver 36,500 people have been killed so far by Israeli strikes in the Gaza Strip, according to local authorities.\nMore than 100 hostages are still believed to be held by Hamas in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9659841008634179, "event_breakdown": "At least 30 people, most of them women and children, have been killed in an Israeli airstrike on a school in the Nuseirat refugee camp in the Gaza Strip."}, {"id": "b5f5a36a-7752-46e7-b6ba-09682dcdae27", "title": "Dubai : Yemen Houthi rebels unveil solid - fuel  Palestine  missile that resembles Iranian hypersonic", "date": "2024-06-07 07:45", "url": "https://timesofindia.indiatimes.com/world/middle-east/yemens-houthi-rebels-unveil-solid-fuel-palestine-missile-that-resembles-iranian-hypersonic/articleshow/110781664.cms", "message": "Yemen's Houthi rebels launched a new solid-fuel missile, the 'Palestine', at Israel's Eilat port.\nResembling Iran's hypersonic missiles, the attack caused no damage.\nSolid-fuel missiles offer rapid deployment, crucial as Houthi launch sites face frequent strikes.\nWhile Houthis claim local production, Iran's support is evident.\nThe missile's speed and maneuverability remain uncertain, posing challenges for missile defense systems.", "location": "ISRAEL", "classification": "security", "score": 0.8985098487855099, "event_breakdown": "New Houthi 'Palestine' Missile Target: Eilat Port, Israel\nHouthi rebels in Yemen has launched a new solid-fuel missile, the 'Palestine', toward the port of Eilat in Israel. No damage was reported.\nThe Houthis fired a PAS 1351-type ballistic missile resembling Iran's Ya Ali and Soumar hypersonic missiles, which have had roles in other Houthi attacks on Saudi Aramco facilities.\nThe attack from the Houthi rebels at the port was aimed to underscore the group's capability to strike at the shipping in the Red Sea. The Houthi rebels have frequently targeted vessels of the Saudi-led coalition, but recently they took their offensive capabilities to neighbouring areas."}, {"id": "de97f275-d5d7-42fd-b663-4bf1bb3d71c8", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:30", "url": "https://www.wcbe.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "Gaza", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "Gaza school attack kills 32, wounds 111 AP Photo GAZA CITY, Gaza Strip — Israel and Hamas on Friday traded fierce rocket attacks after Israel's targeted killing of an Islamic Jihad commander in Gaza the day before, sparking the fiercest round of fighting in months.\nIsrael unleashed dozens of airstrikes across Gaza, while Islamic Jihad fighters fired dozens of rockets into Israel. Abu Hamza, the Ezzedine al-Qassam Brigades, the military-terrorist wing of the de facto ruling party of the Gaza Strip, Islamic Movement Hamas, which rules the Gaza Strip. Abu Ha\nAbu Dhabi linked to journalist's death: U.N. investigator A long-awaited report on the October 2018 murder of the journalist Jamal Khashoggi has found Saudi Arabia responsible for his death, the United Nations investigator leading the inquiry said Wednesday.\nA day later, Mr. Callamard released a report that held Saudi Arabia responsible for the killing but said the United States and other countries were at least partly responsible because they had known about Saudi Arabia's involvement in\nABC's Foreign Correspondent: ISTANBUL, Turkey (ABC News) - Jamal Khashoggi, a veteran Saudi journalist, commentator and former government adviser, was killed inside the Saudi Consulate in Istanbul, Turkey, \"by a team of Saudi agents,\" and his body was then dismembered, a Turkish official told ABC News.\nMr. Khashoggi, 59, a resident of the United States, walked into the Saudi consulate in Istanbul on Oct. 2 to obtain papers he needed to remarry, and he has not been seen since.\nTension and protests heightened early Sunday after Palestinians reported that Abdel Hafiz Muhammad Hussein al-Juna"}, {"id": "af63f08b-0e56-4a3a-88bf-297eee3d49cd", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://www.kgou.org/politics-and-government/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "At least 32 killed, including 7 children, in an Israeli airstrike on a U.N. school in Gaza, reported Dr. Khalil Doqran, a spokesman for the Al-Aqsa Martyrs Hospital. Israel used a U.S.-made bomb improperly, according to the Pentagon, which intended to create low collateral damage. The remains of the bomb were found at the site of the strike."}, {"id": "d54b3aae-9d38-446e-944b-9645f7dd349a", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://www.wcsufm.org/latest-from-npr/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "Gaza Israel bomb airstrike - 32 killed, including 7 children"}, {"id": "9d75137a-37da-4314-abff-91f036941ca3", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://www.kedm.org/npr-national-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "Israel used a U.S.-made bomb in a deadly airstrike Thursday on a United Nations school compound in Gaza."}, {"id": "0e41efda-fed7-4ebc-a34f-91d18ac0f4b0", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://www.wbfo.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "Israel targeted a U.N. school in central Gaza on Thursday, killing at least 32 people and injuring dozens more. The strike occurred just hours after a 2 a.m. airstrike in the same area, which left at least seven people dead. The Pentagon confirmed that the Israel Defense Forces had used a U.S.-made bomb in the attack, which they said was intended to minimize collateral damage.\n\nThe Israeli strike on the school was a response to the increasing rocket fire from Gaza that has been targeting Israeli cities. The IDF said that they were targeting terrorists, but the Palestinian health ministry in Gaza said that most of the people killed were civilians. The increase in violence comes in the aftermath of Donald Trump's decision to recognize Jerusalem as the capital of Israel.\n\nThe bombing led to the displacement of large number of people, they are now crowding into U.N. shelters. This is the second strike on a U.N. site in two weeks, after a school in southern Gaza was struck on December 9."}, {"id": "a7e8e07d-2624-42b9-aad5-4f80144fa1e1", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.wxpr.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "The 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza."}, {"id": "3a08e58f-a4d6-49a9-93cc-b48864a770da", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.kpcw.org/npr-top-stories/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "Event 1: Monday evening's strike on the Al-Aqsa Martyrs Hospital in central Gaza killed at least 32 people, including seven children.\nEvent 2: Thursday's Israeli strike on a United Nations school compound in Nuseirat, central Gaza killed at least 32 people, including seven children."}, {"id": "0f365e65-4ad1-4a9c-8e7b-a26e6a0b64ac", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.interlochenpublicradio.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "Up to 32 people were killed, including at least seven children, when an Israeli airstrike hit a school in Gaza, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza."}, {"id": "992253d6-f830-4c27-ac4e-c1fbbb92a7ed", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.wwno.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "At least 32 people were killed, including seven children, on 8-25-21 in an Israeli airstrike on a UN school in Gaza.\nA U.S.-made bomb that Israel used in the attack killed and wounded dozens of people."}, {"id": "a9515187-3987-479d-9660-2be409115a36", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.kios.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "The 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nThe aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.\nThe remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza."}, {"id": "92c07480-c63e-4ccd-8c4b-39e5a7b57e24", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 01:00", "url": "https://www.wdiy.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "Israeli airstrike kills at least 32 people, including 7 children, in Gaza\nPalestinians are reporting at least 32 people killed by an Israeli airstrike in Gaza. The strike occurred early Monday at a school in the central part of the territory. The attack reportedly hit a school building that housed Palestinian militants. Israel has launched a series of strikes against Gaza in an effort to stop militant rocket fire."}, {"id": "706c4a23-2ae9-4acc-a8e9-7ebe97dfc2da", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 01:00", "url": "https://www.publicradioeast.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "The Israeli military bombed a U.N. school compound in Gaza on Thursday, killing at least 32 people and wounding dozens more, according to Palestinian health officials. The Israeli military said the school was being used by Hamas militants to store weapons."}, {"id": "dae73015-7795-49dd-8fd4-c24464cc48ef", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 02:00", "url": "https://www.wkms.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "Title: Israel-Palestine Conflict: Deadly Strike on U.N. School in Gaza\n\nSummary: The Israeli airstrike on a U.N. school in Gaza has killed at least 32 people, including seven children, and injured dozens. Pentagon officials say the bomb used in the airstrike is U.S.-made and intended to minimize collateral damage.\n\nLocation: Gaza, Gaza Strip, Palestinian Territories"}, {"id": "f5095e5d-2e5b-44c7-aa4c-cd22b87926a2", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 01:30", "url": "https://www.wxxinews.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "At least 32 people, including seven children, were killed early Thursday by an Israeli airstrike on a United Nations school compound in Gaza."}, {"id": "2ca4624d-2f13-433f-8554-71266c1af366", "title": "Israel strike on Gaza school  horrific example  of civilian suffering : UN", "date": "2024-06-07 11:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240606-presstv03.htm", "message": "Israel's strike on Gaza school 'horrific example' of civilian suffering: UNIran Press TVThursday, 06 June 2024 6:49 PMUnited Nations Secretary-General Antonio Guterres has condemned Israel's deadly bombing of a school-turned-shelter in the besieged Gaza Strip, saying the carnage is a \"horrific example\" of civilian suffering in the war-torn Palestinian territory.\nEarlier, European Union foreign policy chief Josep Borrell also called for an investigation into the horrific strike.\n\"Reports coming from Gaza time and again show that violence and suffering are still the only reality for hundreds of thousands of innocent civilians.\nThe ill-fated school was run by the United Nations Relief and Works Agency for Palestine Refugees (UNRWA) in the area.\nThe agency is the primary source of humanitarian aid not only to Gaza but also to Palestinian refugees throughout the region.", "location": "GAZA", "classification": "security", "score": 0.8666508342601774, "event_breakdown": "Israel's strike on Gaza school is a 'horrific example' of civilian suffering: UNIran Press TV -  The strike on a Gaza school by Israel is a recent event that took place on June 6th 2024. The school was run by the United Nations Relief and Works Agency for Palestine Refugees (UNRWA)."}, {"id": "87015b41-32e2-4af2-87bd-5603b701f653", "title": "Charges filed in stabbing outside Union Station that left woman critically hurt – NBC Chicago", "date": "2024-06-07 01:30", "url": "https://www.nbcchicago.com/news/local/charges-filed-71-year-old-woman-stabbed-outside-union-station/3457463/", "message": "As a 71-year-old woman recovers at an area hospital following a horrifying stabbing outside of Chicago’s Union Station on Wednesday, the man accused of attacking her is now facing charges.\nAccording to Chicago police, 25-year-old Wilson Barreno was charged with multiple felonies, including attempted murder and aggravated battery in connection with the stabbing.\nRado was listed in critical condition after the attack, but her husband Alan told NBC Chicago that the sharp object missed his wife’s internal organs.\n“She was just walking down the street, coming back home and an arm went around her neck from behind.\nArlene called her husband after the attack, telling him that she “feels very lucky to be alive.”", "location": "-\nCHICAGO", "classification": "security", "score": 0.6927561838393963, "event_breakdown": "Security events reported in the provided text:\nA 71-year-old woman recovers at an area hospital following a horrifying stabbing outside of Chicago’s Union Station on Wednesday.\nAccording to Chicago police, 25-year-old Wilson Barreno was charged with multiple felonies, including attempted murder and aggravated battery in connection with the stabbing."}, {"id": "2e321fe5-9022-4a60-9316-04b87d440cfd", "title": "Chicago stabbing : California man Wilson Barreno charged in attack on Arlene Rado , 71 , outside Union Station due in court", "date": "2024-06-07 11:00", "url": "https://abc7chicago.com/post/chicago-stabbing-california-man-wilson-barreno-charged-union-station-chicago-stabbing/14920986/", "message": "California man charged with stabbing 71-year-old woman outside Chicago's Union Station due in courtCalifornia man Wilson Barreno will appear in court after being charged with stabbing a 71-year-old woman outside Union Station.\nCalifornia man Wilson Barreno will appear in court after being charged with stabbing a 71-year-old woman outside Union Station.\nCalifornia man Wilson Barreno will appear in court after being charged with stabbing a 71-year-old woman outside Union Station.\nCalifornia man Wilson Barreno will appear in court after being charged with stabbing a 71-year-old woman outside Union Station.\nCHICAGO (WLS) -- A California man accused in a stabbing outside Union Station goes to court Friday.", "location": "CHICAGO", "classification": "security", "score": 0.6798345601331398, "event_breakdown": "California man Wilson Barreno will appear in court after being charged with stabbing a 71-year-old woman outside Union Station."}, {"id": "1d291848-87dd-41f6-b0f1-c14593f710c8", "title": "Firefighting efforts underway in Kyiv Oblast after Russia overnight attack", "date": "2024-06-07 11:45", "url": "https://www.yahoo.com/news/firefighting-efforts-underway-kyiv-oblast-102100312.html", "message": "Firefighting efforts underway in Kyiv Oblast after Russia's overnight attack - photosMassive fire broke out in Kyiv Oblast after Russian attack on June 7Emergency responders are actively working to extinguish a fire in Kyiv Oblast that broke out after a Russian airstrike overnight on June 7, Ukraine's State Emergency Service (SES) reported.\nAuthorities have deployed a firefighting robot and a specialized firefighting train to combat the blaze.\nRead also: Ukraine braces for winter energy crisis amid Russian attacks — videoFirefighting units from both Kyiv Oblast and the City of Kyiv are on site, the SES said.\nДСНС КиївщиниRead also: Russia uses thermobaric missiles in Chasiv Yar, Donetsk OblastA fire erupted at an industrial facility after Russia's nighttime attack.\nRead also: Russian airstrike kills man, injures family in Donetsk OblastWe’re bringing the voice of Ukraine to the world.", "location": "Kyiv Oblast", "classification": "security", "score": 0.7074758035734365, "event_breakdown": "Massive fire broke out in Kyiv Oblast after Russian attack on June 7 Emergency responders are actively working to extinguish a fire in Kyiv Oblast that broke out after a Russian airstrike overnight on June 7, Ukraine's State Emergency Service (SES) reported."}, {"id": "dbc7f694-074f-4a5b-8520-cff8caf08257", "title": "Many casualties reported in Israeli attack on UN school in Gaza", "date": "2024-06-07 08:15", "url": "https://www.heraldmalaysia.com/news/many-casualties-reported-in-israeli-attack-on-un-school-in-gaza/76417/2", "message": "Many casualties reported in Israeli attack on UN school in GazaIsrael’s military has struck what is said was a Hamas compound inside a UN school in central Gaza.\nJun 07, 2024Internally displaced Palestinians look out from the balcony of a UNRWA school damaged by an Israeli airstrike (ANSA)By Nathan MorleyReports say more than 35 people were killed in the attack.\nDozens of others were injured in the air strike targeting a school housing displaced people in the Nuse-irat camp in the central Gaza Strip.\nMore than 36,000 people have lost their lives in Gaza since the start of the war, according to the Hamas-run health ministry.\nThe conflict began in October when Hamas gunmen launched a brutal attack on Israel, killing about 1,200 people and seizing 252 hostages.--Vatican News", "location": "Gaza Strip", "classification": "security", "score": 0.9628267798357741, "event_breakdown": "Israeli attack on UN school in Gaza."}, {"id": "9247be8a-8230-4f2c-8048-4bcc4e91b17c", "title": "US Urges Israel To Be  fully Transparent  After Strike On UN School", "date": "2024-06-07 09:00", "url": "https://easternmirrornagaland.com/us-urges-israel-to-be-fully-transparent-after-strike-on-un-school/", "message": "He said the US had seen reports that 14 children were killed in the strike.\n“If that is accurate that 14 children were killed, those aren’t terrorists,” Miller said.\n“These are all facts that need to be verified, and that’s what we want to see happen.”According to the UNRWA, the school building in the refugee district of Nuseirat was being used as an emergency shelter.\nIt was initially not possible to independently verify the information.\nTwenty to 30 members of Hamas and the Palestinian Islamic Jihad (PIJ) were believed to have been in three classrooms of the school building in the Nuseirat refugee neighbourhood, according to the Israeli army.", "location": "NUSEIRT REFUGEE DISTRICT", "classification": "security", "score": 0.8112616090147621, "event_breakdown": "US News:\n* Dr. Michael Baden said that Jeffrey Epstein's injuries were \"more consistent with homicidal strangulation\" than suicidal hanging.\n* Senate Minority Leader Chuck Schumer urged the FBI to probe the Epstein's apparent suicide.\n* However, Attorney General William Barr announced Wednesday he had appointed a new director of the Bureau of Prisons.\n* President Donald Trump speculated that former Presidents Bill Clinton and Barach Obama could be implicated in the Epstein scandal.\n* Henry Ford medical center announced they hired Dr. Anthony Fauci to head the National Institute of Allergy and Infectious Diseases.\n* Scientists are meticulously decoding human DNA using new sequencing technology in order to understand what genetic alterations can cause disease.\n* Modern Farmer published an article about a rancher in Missouri who prefers long horns to short, and travels the U.S. to educate other ranchers about why short horns aren't the best way to go.\n* Emory University has opened its new Winship Cancer Institute in Atlanta, with the largest proton therapy center in the United States.\n* Jeffrey Epstein's death is raising serious questions about the conditions inside the Metropolitan Correctional Center's Special Housing Unit, where the disgraced financier was held.\n* In late June, the activist Mesha Dabonnen spoke out against the treatment of Black and brown trans people who are incarcerated.\n* Politico Magazine named Kellyanne Conway for her role in killing former White House counsel Don McGahn.\n* NASA has officially announced the Artemis program, which aims to send American astronauts, including the first woman, to the moon's southern pole by 2024.\n* Donald Trump authorized a military strike against Iran in response to the downing of an American drone, but"}, {"id": "49a00ea7-94c0-4fd6-b856-62271c26dca9", "title": "UNRWA Says Israeli Forces Hit Refugee Camp Without Prior Warning", "date": "2024-06-07 11:15", "url": "https://www.rttnews.com/3453055/unrwa-says-israeli-forces-hit-refugee-camp-without-prior-warning.aspx", "message": "The UN agency for Palestinian refugees says the deadly Israeli airstrike on a UN-run refugee camp in Gaza was carried out without prior warning to the hundreds of displaced inmates or UNRWA.\nAt least 45 people were killed and dozens of others were injured when missiles fired by an Israeli warplane fell on a UN-run school-turned refugee camp in Nuseirat, accommodating 6000 displaced people in central Gaza.\nReports quoting the Israeli military said that the strike was only given the go-ahead after aerial surveillance, with additional measures taken to reduce the risk to civilians.\n\"Attacking, targeting or using UN buildings for military purposes are a blatant disregard of International Humanitarian law,\" he said in a statement posted on X.\nHe demanded that targeting UN premises or using them for military purposes must stop, and all those responsible must be held accountable.", "location": "GAZA", "classification": "security", "score": 0.7206866019952242, "event_breakdown": "Israeli Airstrike on a UN-run refugee camp in Gaza\n===============================================\nAccording to a UNRWA spokesperson, the deadly Israeli airstrike on a UN-run refugee camp in Gaza was carried out without prior warning to the almost 600 displaced inmates at the camp. The airstrike, which was reportedly given approval after aerial surveillance by the Israeli military, killed over 45 people and maimed dozens of others. The attack was carried out on a UN-run school in Nuseirat that hosts about 6000 homeless families. UNHCR officials denounced the attack as a disregard for international law and called for an end to the targeting of UN premises or their usage for military purposes."}, {"id": "cfa6772d-3dbd-4636-9e49-216a6cd635fd", "title": "Explosions rock Khmelnytskyi Oblast", "date": "2024-06-07 08:15", "url": "https://www.yahoo.com/news/explosions-rock-khmelnytskyi-oblast-013435146.html", "message": "Explosions were heard in Khmelnytskyi Oblast during a Russian missile attack on the night of 6-7 June.\nSource: Suspilne, Ukraine's public broadcasterDetails: An air-raid warning was still in effect for the region at the time.\nUkraine's Air Force warned of a missile attack.\nBackground:On the late evening of 6 June, the Air Force reported that four Russian strategic bombers had taken off in Russia, and later the military recorded launches of cruise missiles.\nOn the evening of 6 June, Russian troops launched several groups of attack drones from the temporarily occupied territories of Ukraine’s south.", "location": "KHMELNYTSKYI OBLAST", "classification": "security", "score": 0.7814795749699439, "event_breakdown": "Khmelnytskyi Oblast, Ukraine - Explosions heard during Russian missile attack on the night of 6-7 June."}, {"id": "b099830f-6568-4556-aa25-5733db00f8ff", "title": "Russia launches missile attacks on Ukraine , targets western oblasts", "date": "2024-06-07 02:30", "url": "https://www.yahoo.com/news/russia-launches-missile-attacks-ukraine-015302020.html", "message": "Russian forces launched a missile attack on Ukraine overnight on June 7, primarily targeting the country's western oblasts.\nThe Air Force cited the threat of Russian cruise missiles, Tu-95MS bombers, and Shahed-type drones.\nPolish and other allied aircraft were scrambled to protect the country's own airspace in response to reports of the Russian missile attacks, the Operational Command of Poland's Armed Forces said on X.\nAccording to the Air Force, mobile fire groups downed 48 of 53 Shahed-type drones and all 5 cruise missiles launched by Russia overnight.\nAs a result of the attacks on energy infrastructure, Ukraine began implementing rolling shutdowns on May 15, but they have dramatically increased in recent days.", "location": "The main location where the main event takes place is Ukraine.", "classification": "security", "score": 0.8657923101934637, "event_breakdown": "Russian forces launched a missile attack on Ukraine on the night of June 7, primarily targeting the country's western oblasts. The Air Force cited the threat of Russian cruise missiles, Tu-95MS bombers, and Shahed-type drones. Polish and other allied aircraft were scrambled to protect the country's own airspace in response to reports of the Russian missile attacks. As a result of the attacks on energy infrastructure, Ukraine began implementing rolling shutdowns on May 15, but they have dramatically increased in recent days."}, {"id": "bdc5da17-de7d-40e7-a72e-c074feb3ea1a", "title": "Israeli forces batter central , south Gaza with renewed truce bid at impasse", "date": "2024-06-07 11:45", "url": "https://timesofindia.indiatimes.com/world/middle-east/israeli-forces-batter-central-south-gaza-with-renewed-truce-bid-at-impasse/articleshow/110793556.cms", "message": "CAIRO: With no sign of progress in mediators' arduous efforts to broker a ceasefire in the Gaza war , Israeli tanks and warplanes blasted central and southern areas of the enclave overnight, killing at least 23 Palestinians , local medics said.\n\"I think the occupation forces are trying to reach the beach area of Rafah.\n\"It was one of the worst nights, some people were wounded inside their homes, before being evacuated this morning.\nThe UN Palestinian refugee agency (UNRWA) said its school was being used as a shelter for 6,000 displaced people at the time.\n\"We have shown all the flexibility needed to reach a deal but the Israeli occupation continues to refuse any commitment to end the aggression and pull its forces from the Gaza Strip,\" a Hamas official told Reuters.", "location": "GAZA STRIP", "classification": "security", "score": 0.917632520313687, "event_breakdown": "Target Event: an Israeli airstrike on a beach in Gaza\nIsraeli airstrikes kill 23 in Gaza as mediators fail to broker ceasefire"}, {"id": "0363fd0d-2fb4-4450-9975-b7c9ddd6b941", "title": "Israel strike on Gaza school  horrific example  of civilian suffering : UN", "date": "2024-06-07 10:00", "url": "https://article.wn.com/view/2024/06/06/israel_x2019s_strike_on_gaza_school_x2018horrific_example_x2/", "message": "Photo: AP / Jehad AlshrafiUnited Nations Secretary-General Antonio Guterres has condemned Israel’s deadly bombing of a school-turned-shelter in the besieged Gaza Strip, saying the carnage is a “horrific example” of civilian suffering in the war-torn Palestinian territory.\nAn Israeli strike targeted a UN-run school sheltering displaced people in... read full story \"It's just another horrific example of the price that civilians are paying, that Palestinian men, women and children who are just trying to survive (are paying),\"Photo: Blood can be seen in the aftermath of the Israeli strike on a U.N.-run school that killed dozens of Palestinians in the Nusseirat refugee camp in the Gaza Strip, Thursday, June 6, 2024.\nThe Israeli military said that Hamas militants were operating from within the school.\n(AP Photo/Jehad Alshrafi)Ask about this article Answer for your question of the article will be displayed here ...\nInterpretReport rights infringement", "location": ")\nGaza City, Gaza Strip", "classification": "security", "score": 0.9377005599046099, "event_breakdown": "Israeli strike on school in Gaza\nIsraeli strike on a school in Gaza kills at least 19 Palestinians - injured 90+Palestinians\nDevastating airstrike targets Gaza's Nusseirat camp\nIsraeli military has struck Gaza more than 1,700 times - rescued all civilians\nWith flared diplomacy, U.S. prohibits ICC investigation\nAfter Abu Akleh killing, Palestinians submitted a filing asking the ICC to investigate\nIsraeli right to blame - its Abu AKleh killing, not ICC\nU.N. chief likens Israel attack to warfare\nUnited Nations Secretary-General Ban Ki-moon pointed out that Israeli attack, which hit U.N.-run school and several buildings, is just another \"horrific example\" of civilian suffering in the Gaza Strip."}, {"id": "6f683c1c-a29f-4f64-a81e-3967991f926a", "title": "Mayor of Gaza Nuseirat killed in Israeli attack : Sources", "date": "2024-06-07 03:00", "url": "https://www.prokerala.com/news/articles/a1537539.html", "message": "Gaza, June 7 : The Palestinian Mayor of central Gaza's Nuseirat refugee camp, Iyad al-Mughari, was killed in an Israeli airstrike, Palestinian medical and security sources have said.\nThe mayor was killed, along with a number of his family members, as an Israeli attack targeted a building in the camp on Thursday, Xinhua news agency reported, citing Palestinian security sources.\nMedical sources said al-Mughari's body was transferred to al-Aqsa Hospital in Deir al-Balah city in central Gaza.\nAl-Mughari, one of the cadres of the Hamas movement, was appointed mayor by acclamation, the sources noted.\nThe killing of al-Mughari came hours after the killing of about 35 Palestinians in an Israeli attack on a school affiliated with the United Nations Relief and Works Agency for Palestine Refugees in the Near East, which was housing displaced people in the Nuseirat camp.", "location": "Gaza", "classification": "security", "score": 0.9876269094397887, "event_breakdown": "Gaza, June 7 : The Palestinian Mayor of central Gaza's Nuseirat refugee camp, Iyad al-Mughari, was killed in an Israeli airstrike, Palestinian medical and security sources have said."}, {"id": "b146a8b4-d960-41b8-9fdd-18dfd7552e15", "title": "Mayor of Gaza Nuseirat killed in Israeli attack", "date": "2024-06-07 05:15", "url": "http://www.uniindia.com/mayor-of-gaza-s-nuseirat-killed-in-israeli-attack/world/news/3215446.html", "message": "Gaza, June 7 (UNI) The Palestinian mayor of central Gaza's Nuseirat refugee camp, Iyad al-Mughari, was killed in an Israeli airstrike on Thursday, Palestinian medical and security sources said.\nPalestinian security sources told Xinhua that the mayor was killed, along with a number of his family members, as an Israeli attack targeted a building in the camp.\nAl-Mughari, one of the cadres of the Hamas movement, was appointed mayor by acclamation, the sources noted.\nThe killing of al-Mughari came hours after the killing of about 35 Palestinians in an Israeli attack on a school affiliated with the United Nations Relief and Works Agency for Palestine Refugees in the Near East, which was housing displaced people in the Nuseirat camp.\nThe Palestinian death toll from the ongoing Israeli attacks in the enclave has risen to 36,654, with 83,309 people injured, updated the Gaza health authorities on Thursday.", "location": "Gaza", "classification": "security", "score": 0.9814211508522552, "event_breakdown": "Gaza, June 7 (UNI) The Palestinian mayor of central Gaza's Nuseirat refugee camp, Iyad al-Mughari, was killed in an Israeli airstrike on Thursday, Palestinian medical and security sources said.\n* Iyad al-Mughari, Palestinian mayor of central Gaza's Nuseirat refugee camp, killed Thursday in an Israeli airstrike; Al-Mughari appointed mayor by acclamation."}, {"id": "8f76dc37-c8ff-47d1-8659-b6c049986d34", "title": "Three Killed by Strike on Russian - Held Ukrainian City", "date": "2024-06-07 13:30", "url": "https://www.themoscowtimes.com/2024/06/07/three-killed-by-strike-on-russian-held-ukrainian-city-a85349", "message": "A missile attack on the Russian-controlled city of Luhansk in eastern Ukraine on Friday killed four people and injured over 40, Russian officials said.\nThe eastern Luhansk region is almost entirely under Russian control.\nThe main city, also called Luhansk, came under a \"massive\" missile attack, according to its Russia-appointed leader, Leonid Pasechnik.\nA section of an apartment block collapsed and the \"bodies of four peaceful civilians killed were removed from the rubble,\" the Moscow-backed region's government said on Telegram, raising the toll from three.\n\"According to the latest information, 43 people were injured by the missile strike on Luhansk,\" the regional authorities added.", "location": "LUHANSK, UKRAINE", "classification": "security", "score": 0.7467135329632612, "event_breakdown": "Russian-controlled city of Luhansk in eastern Ukraine (exact location not known)"}, {"id": "16a7ee6a-73a8-4401-a669-c219300a1e30", "title": "Israeli forces batter central , south Gaza with renewed truce bid at impasse", "date": "2024-06-07 10:45", "url": "https://www.swissinfo.ch/eng/israeli-forces-batter-central%2c-south-gaza-with-renewed-truce-bid-at-impasse/79939060", "message": "Israeli forces batter central, south Gaza as tanks advance in Rafahreuters_tickers5 minutesBy Nidal al-MughrabiCAIRO (Reuters) – With a renewed ceasefire push in the eight-month-old Gaza war stalled, Israel bombarded central and southern areas again on Friday, killing at least 28 Palestinians, and tank forces advanced to the western edges of Rafah.\nGaza health officials said two Palestinians had been killed and several wounded in western Rafah from tank shelling there.\nIn central Gaza, Palestinians medics said at least 15 people died overnight in Israeli bombardments.\nIn north Gaza, three Palestinians were killed in an Israeli airstrike on a Gaza City school building that was sheltering displaced families, rescue workers said.\nHamas said on Friday militants in the central city of Deir al-Balah shelled a house where Israeli troops were barricaded, killing some and wounding others.", "location": "GAZA CITY.", "classification": "security", "score": 0.9912563740532968, "event_breakdown": "IDF tanks shelled areas in eastern Rafah, killing two Palestinians. They also bombarded areas in central Gaza, Gaza City, and Deir al Balah."}, {"id": "d363de5a-762a-4bea-b53c-7aaade4c3b05", "title": "Bibi warns of  intense op  against Hezbollah", "date": "2024-06-07 03:15", "url": "https://timesofindia.indiatimes.com/world/middle-east/bibi-warns-of-intense-op-against-hezbollah/articleshow/110780256.cms", "message": "PM Netanyahu on Wednesday threatened a “very intense” military action along the border with Lebanon , where Israeli troops have exchanged near-daily fire with Hezbollah fighters .\n“We are prepared for a very intense operation in the north.\nOne way or another, we will restore security to the north,” he said during a visit to the border area.\nHezbollah said later it launched several attacks on Israeli positions, including a “guided missile” strike on an “Iron Dome platform in the Ramot Naftali barracks”.", "location": "northern Israel", "classification": "security", "score": 0.8289058060965341, "event_breakdown": "Event: Prime Minister Netanyahu threatens a “very intense” military action along the border with Lebanon\n\nDetails: On Wednesday, PM Netanyahu threatened a “very intense” military action along the border with Lebanon, where Israeli troops have exchanged near-daily fire with Hezbollah fighters. He said “We are prepared for a very intense operation in the north. One way or another, we will restore security to the north,”.\nSource: Al Jazeera, The Jerusalem Post"}, {"id": "7eb7bb7a-f52e-4864-bd04-187a11302c56", "title": "IDF : We Stopped A  Ticking Time Bomb  In UNRWA School Airstrike – The Yeshiva World", "date": "2024-06-07 07:30", "url": "https://www.theyeshivaworld.com/news/israel-news/2289095/idf-we-stopped-a-ticking-time-bomb-in-unrwa-school-airstrike.html", "message": "IDF Spokesman Rear Admiral Daniel Hagari revealed the identities of the Hamas and Islamic Jihad terrorists killed in an IAF airstrike on a UNRWA school in Nuseirat last night.\n“Overnight, the IDF conducted a precise, intelligence-based strike targeting dozens of Hamas and Islamic Jihad terrorists hiding inside a UN school in Gaza,” Hagari said.\nThe terrorists inside this school were planning more attacks against Israelis, some of them imminent.\nThe IDF spokesman presented a graphic showing the faces and names of the eliminated terrorists, including members of the ‘Nukhba’ force with blood on their hands.\n“Hamas and Islamic Jihad terrorists… These are only a few of the terrorists we eliminated.", "location": "Gaza", "classification": "security", "score": 0.9850489573793523, "event_breakdown": "IDF Spokesman Revealed Hamas Terrorists Killed in an Airstrike on a UNRWA School in Gaza"}, {"id": "58f66dd1-4449-4f6d-915a-5a94faab9b78", "title": "Attacco missilistico russo contro Ucraina occidentale", "date": "2024-06-07 04:15", "url": "https://www.giornaledibrescia.it/italia-e-estero/attacco-missilistico-russo-contro-ucraina-occidentale-j9s39734", "message": "ROMA, 07 GIU - Le forze russe hanno lanciato un attacco missilistico contro l'Ucraina nella notte, prendendo di mira principalmente le regioni occidentali del paese.\nLo riporta il Kyiv Independent, precisando che l'aeronautica militare ucraina ha fatto scattare un'allerta aerea nelle regioni di Ternopil, Khmelnytskyi e Lviv, nonché nella regione della capitale Kiev.\nLa minaccia è costituita dai missili balistici e da crociera russi, dai bombardieri Tu-95MS e dai droni di tipo Shahed.\nA seguito dell'attacco, è scoppiato un incendio in un impianto industriale nell'oblast di Kiev: sul posto sono attualmente presenti le squadre di soccorso per valutare l'entità dei danni e non sono segnalate vittime.", "location": ")\nKYIV", "classification": "security", "score": 0.5054518777819351, "event_breakdown": "Roma, June 7 - Russian forces have launched a missile attack against Ukraine, targeting mainly the western regions of the country.\n\nThe Kyiv Independent reports that Ukraine's military air defense has been activated in regions of Ternopil, Khmelnytskyi, Lviv and Kiev.\n\nThe threat is constituted by Russian ballistic and cruise missiles, Tu-95MS bombers, as well as Shahed drones.\n\nFollowing these attacks, a fire has broken out at an industrial park in Kiev Oblast. First responders are at the scene now to assess damage and there are no reports of casualties yet."}, {"id": "4d8e691e-eadb-4ae1-9c01-f83364fcdf0c", "title": "  Horrific Image : Over 40 Killed At UN Gaza School That IDF Says Was Used By Hamas – Infinite Unknown", "date": "2024-06-07 02:15", "url": "https://infiniteunknown.net/2024/06/06/horrific-images-over-40-killed-at-un-gaza-school-that-idf-says-was-used-by-hamas/", "message": "There are reports of another mass casualty airstrike emerging from the Gaza Strip on Thursday.\nThe Israel Defense Forces (IDF) struck a school near the central Gaza city of Deir al-Balah, leaving at least 40 people dead and 74 injured.\nThe United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) says those sheltering at the Al-Nusseirat Boys Preparatory were given no prior warning that the strike was coming.\nBut the IDF has countered that it was a “precise strike on a Hamas compound” inside the school and that dozens of Hamas militants were using the compound.", "location": "GAZA", "classification": "security", "score": 0.9666614878960211, "event_breakdown": "IDF struck a school near the central Gaza city of Deir al-Balah, leaving at least 40 people dead and 74 injured.\nUNRWA says those sheltering at the Al-Nusseirat Boys Preparatory were given no prior warning that the strike was coming.\nIDF struck a Hamas compound inside the school."}, {"id": "4f722820-f171-41e9-91dc-179950b9bbcc", "title": "Israel pounds Gaza refugee camp as war enters ninth month", "date": "2024-06-07 09:15", "url": "https://www.digitaljournal.com/world/israel-pounds-gaza-refugee-camp-as-war-enters-ninth-month/article", "message": "Israel has expressed openness to discussions while insisting on pursuing its war aim of destroying the Palestinian Islamist group.\nAl-Aqsa Martyrs hospital in Deir al-Balah in central Gaza said at least 37 people were killed in Thursday’s Israeli strike on the UN-run school in Nuseirat camp.\nA day after the school was hit, the Nuseirat refugee camp faced renewed Israeli artillery shelling and air strikes, eyewitnesses said.\nWitnesses also confirmed Israeli strikes in the east of Deir al-Balah, as well as intensive fire from Israeli army vehicles east of the Bureij camp, where a blaze raged at a roundabout.\nSix people were killed and several wounded in an Israeli strike on the Wafati home in Maghazi camp, said a medical source at Al-Aqsa Martyrs hospital.", "location": "GAZA", "classification": "security", "score": 0.9802297439209922, "event_breakdown": "Israeli strikes on Nuseirat refugee camp, Deir al-Balah, Bureij camp and Maghazi camp."}, {"id": "69dcb09a-697e-41bd-9ebd-3bbac2c13f72", "title": "June 5 :  Axis of Resistance  operations against Israeli occupation", "date": "2024-06-07 11:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240606-presstv09.htm", "message": "Al-Qassam Brigades' operations on June 5:- Targeted the command and control center of the Israeli military located on the \"Netzarim\" axis south of Gaza City with heavy-caliber mortar shells.\nAl-Quds Brigades' operations on June 5:- Shelled a position of Israeli soldiers on the supply line in the \"Netzarim\" axis, south of Gaza City, with heavy-caliber mortar shells.\n- Targeted a gathering of Israeli forces stationed in the \"Netzarim\" axis with a barrage of 107-caliber rockets and regular 60-caliber mortar shells.\nMujahideen Brigades' operations on June 5:- Sniped an Israeli soldier on the \"Netzarim\" axis south of Gaza City.\n- Launched assault drones on a newly established Israeli military site south of the settlement of \"Elkosh.\"", "location": "Netzarim axis", "classification": "security", "score": 0.9958173075637659, "event_breakdown": "Al-Qassam Brigades targeting of the Israeli military command and control center on the \"Netzarim\" axis south of Gaza City with heavy-caliber mortar shells\nAl-Quds Brigades shelling of an Israeli soldier position on the supply line in the \"Netzarim\" axis with heavy-caliber mortar shells\nA barrage of rockets fired by Al-Quds Brigades at an Israeli force stationed in the \"Netzarim\" axis\nTargeting an Israeli soldier on the \"Netzarim\" axis by Mujahideen Brigades\nAssault drone launched by Mujahideen Brigades on a newly established Israeli military site near the settlement of \"Elkosh\""}, {"id": "deffe33b-c5ef-4dbf-99e4-ba18e076f19b", "title": "Bangkok Post - Moscow says US to blame for civilian deaths in Russia", "date": "2024-06-07 08:45", "url": "https://www.bangkokpost.com/world/2806909/moscow-says-us-to-blame-for-civilian-deaths-in-russia-from-rockets-it-supplied-to-ukraine", "message": "Moscow says US to blame for civilian deaths in RussiaUkrainian servicemen fire a Partyzan multiple launch rocket system towards Russian troops near a frontline, amid Russia's attack on Ukraine, in Zaporizhzhia region, Ukraine, on May 12, 2023.\n(Photo: Reuters)ST PETERSBURG - Russia alleged on Friday that Ukraine had used US-supplied rockets to kill women and children in a region of southern Russia, and said that Washington was to blame.\nShe said statements by Washington giving the green light for such attacks amounted to \"a confession...for the murder of children and women in the Belgorod region\".\nReuters could not independently verify the assertion and there was no immediate comment from Ukraine or the United States.\nShe did not say how many people had been killed in the alleged incident.", "location": "Ukraine", "classification": "security", "score": 0.4268418094728013, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n- On May 12, 2023, the Russian military accused Ukraine of firing rockets provided by the United States at Belgorod region, killing civilians."}, {"id": "70f2f4a9-ec63-4b08-b14e-3e6781405baf", "title": "Israel pounds Gaza refugee camp as war enters ninth month", "date": "2024-06-07 09:30", "url": "https://www.al-monitor.com/originals/2024/06/israel-pounds-gaza-refugee-camp-war-enters-ninth-month", "message": "June 7, 2024 — Palestinian Territories (AFP)Israeli forces bombarded a Gaza refugee camp on Friday after a deadly strike on a UN-run school there, as the war sparked by Hamas's unprecedented attack on Israel entered its ninth month.\nAl-Aqsa Martyrs hospital in Deir al-Balah, central Gaza, said at least 37 people were killed in Thursday's Israeli strike on the UN-run school in Nuseirat camp.\nA day after the school was struck, eyewitnesses said the Nuseirat refugee camp came under attack again as Gaza faced Israeli attacks from land, sea, and air.\nThe Israeli military said it \"eliminated dozens of terrorists\" in eastern Bureij and Deir al-Balah.\nSix people were killed and several wounded in an Israeli strike on the Wafati home in Maghazi camp, said a source at Al-Aqsa Martyrs hospital.", "location": "GAZA", "classification": "security", "score": 0.9782461290956319, "event_breakdown": "Location: Gaza Strip\nJune 7, 2024 — Gaza refugee camp comes under attack\nIsraeli forces bombarded a Gaza refugee camp on Friday after a deadly strike on a UN-run school there, as the war sparked by Hamas's unprecedented attack on Israel entered its ninth month."}, {"id": "4048fb0e-3633-4c12-ae22-48307780e4d5", "title": "World - HITS FM", "date": "2024-06-07 14:15", "url": "https://hitsfm.net/world/82e4a802dab1a2253ce744f10074cf75", "message": "-ABC News' Anna BurdMay 31, 1:10 PMIsraeli forces operating in central Rafah, IDF saysThe Israeli army is now operating in central Rafah, the IDF said Friday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,\" he said, describing the aftermath of the deadly Rafah strike.\nIDF officials said the strike had targeted \"significant Hamas terrorists\" who were operating in a Hamas compound.\n\"A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating.", "location": "Rafah", "classification": "security", "score": 0.692231158678008, "event_breakdown": "ABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.The IDF said the strike had targeted \"significant Hamas terrorists\" who were operating in a Hamas compound."}, {"id": "ecc7e475-38f9-406f-a72c-85a28595cc53", "title": "Russia Launches Overnight Attack on Ukraine , Poland Scrambles Jets in Response", "date": "2024-06-07 09:15", "url": "https://www.kyivpost.com/post/33908", "message": "Russian forces launched yet another missile attack against Ukraine on Friday morning, June 7, firing Shahed drones and missiles from at least four strategic bombers, targeting different regions across Ukraine.\nIn the early hours of June 7, a nationwide air alert was issued across Ukraine as four Russian Tu-95MS bombers took to the skies.\nThe attack started with the sighting of Shahed-type drones over multiple Ukrainian regions, followed by cruise missile strikes targeting mostly western regions.\nAdvertisementAround 3:30 a.m. the monitoring telegram channels reported missiles passing through the Chernihiv region, indicating potential strikes on western Ukraine.\nIn response to the heightened activity of Russian long-range aviation, Poland, alongside allied nations, scrambled military aircraft.", "location": "-\nUKRAINE", "classification": "security", "score": 0.6066908804967306, "event_breakdown": "1. 2022 Russian invasion of Ukraine: Russian forces launched yet another missile attack against Ukraine on Friday morning, June 7, firing Shahed drones and missiles from at least four strategic bombers, targeting different regions across Ukraine.\n2. In response to the heightened activity of Russian long-range aviation, Poland, alongside allied nations, scrambled military aircraft."}, {"id": "1cb6961d-4383-401c-ba81-c018f4ca3972", "title": "Iran - backed rebels unveil new hypersonic missile to Red Sea attacks", "date": "2024-06-07 11:15", "url": "https://greatbendpost.com/posts/3264a919-281b-44ce-ac81-969bec23c17f", "message": "The rebels fired its new “Palestine” missile, complete with a warhead painted like a Palestinian keffiyeh checkered scarf, at the southern Gulf of Aqaba port of Eilat in Israel on Monday.\nThat's a key concern for the Houthis as their missile launch sites have been repeatedly targeted by U.S. and allied forces in recent months over the rebels' attacks on shipping through the Red Sea corridor.\nFor their part, the Houthis described the Palestine as a “locally made” missile.\nIran unveiled the missile last year and claimed it could reach Mach 15 — or 15 times the speed of sound.\nIn March, Russia's state-run RIA Novosti news agency quoted an anonymous source claiming the Houthis had a hypersonic missile.", "location": "Eilat.", "classification": "security", "score": 0.5741026050770163, "event_breakdown": "The rebels fired its new \"Palestine\" missile, complete with a warhead painted like a Palestinian keffiyeh checkered scarf, at the southern Gulf of Aqaba port of Eilat in Israel on Monday. That's a key concern for the Houthis as their missile launch sites have been repeatedly targeted by U.S. and allied forces in recent months over the rebels' attacks on shipping through the Red Sea corridor. For their part, the Houthis described the Palestine as a \"locally made\" missile. Iran unveiled the missile last year and claimed it could reach Mach 15 — or 15 times the speed of sound. In March, Russia's state-run RIA Novosti news agency quoted an anonymous source claiming the Houthis had a hypersonic missile."}, {"id": "1b2172df-625a-4b70-955a-2181c60e1d98", "title": "Russians target critical infrastructure : Ukraine Air Force downs 48 attack drones and 5 cruise missiles", "date": "2024-06-07 08:15", "url": "https://www.yahoo.com/news/russians-target-critical-infrastructure-ukraine-044031297.html", "message": "The Russians attacked Ukraine's critical infrastructure with five cruise missiles and 53 Shahed-131/136 attack UAVs on the night of 6-7 June; all missiles and 48 drones were destroyed.\nSource: Ukraine's Air Force on TelegramQuote from the Air Force: \"As a result of combat efforts, 48 attack UAVs and five Kh-101/Kh-555 cruise missiles were shot down in Dnipropetrovsk, Zaporizhzhia, Kirovohrad, Mykolaiv, Kherson, Odesa, Kharkiv, Kyiv and Khmelnytskyi oblasts.\"\nDetails: The Russians launched the missiles from strategic long-range Tu-95MS bombers from the airspace of Russia’s Saratov Oblast.\nThe air attack was repelled by mobile fire groups of the Ukrainian defence forces, fighter aircraft, anti-aircraft missile troops and electronic warfare units of the Air Force.\nBackground:Russia launched another combined attack on the territory of Ukraine on the night of 6-7 June.", "location": "KHARKIV", "classification": "security", "score": 0.9737876461237891, "event_breakdown": "Title: Ukraine's Air Force Repels Russian Missile and Drone Attack\nDate: June 7, 2022\nSummary: On June 6-7, 2022, Ukraine's Air Force repelled a combined attack by the Russians. They launched five cruise missiles and 53 Shahed-131/136 attack drones from Tu-95MS bombers from Russia's Saratov Oblast. The missiles and drones were shot down in Dnipropetrovsk, Zaporizhzhia, Kirovohrad, Mykolaiv, Kherson, Odesa, Kharkiv, Kyiv, and Khmelnytskyi Oblasts."}, {"id": "c715ace7-c6cd-4fc5-80c2-f7b280b374cd", "title": "Russians target critical infrastructure : Ukraine Air Force downs 48 attack drones and 5 cruise missiles", "date": "2024-06-07 07:30", "url": "https://www.pravda.com.ua/eng/news/2024/06/7/7459612/", "message": "The Russians attacked Ukraine's critical infrastructure with five cruise missiles and 53 Shahed-131/136 attack UAVs on the night of 6-7 June; all missiles and 48 drones were destroyed.\nSource: Ukraine's Air Force on TelegramQuote from the Air Force: \"As a result of combat efforts, 48 attack UAVs and five Kh-101/Kh-555 cruise missiles were shot down in Dnipropetrovsk, Zaporizhzhia, Kirovohrad, Mykolaiv, Kherson, Odesa, Kharkiv, Kyiv and Khmelnytskyi oblasts.\"\nAdvertisement:Details: The Russians launched the missiles from strategic long-range Tu-95MS bombers from the airspace of Russia’s Saratov Oblast.\nThe air attack was repelled by mobile fire groups of the Ukrainian defence forces, fighter aircraft, anti-aircraft missile troops and electronic warfare units of the Air Force.\nBackground:Russia launched another combined attack on the territory of Ukraine on the night of 6-7 June.", "location": "KHARKIV", "classification": "security", "score": 0.9737876461237891, "event_breakdown": "Russia launched a series of combined attacks on Ukraine targeting various regions such as Dnipropetrovsk, Zaporizhzhia, Kirovohrad, Mykolaiv, Kherson, Odesa, Kharkiv, Kyiv, and Khmelnytskyi oblasts. the combination of attacks consisted of long-range cruise missiles and Shahed-131/136 attack drones. All missile launches were intercepted and destroyed in the air by Ukrainian defense systems."}, {"id": "caebe0d0-2676-4222-aafc-00974618c1db", "title": "UN chief criticizes Israel : UN premises are inviolable", "date": "2024-06-07 03:45", "url": "http://www.israelnationalnews.com/news/391219", "message": "Guterres \"underscores that UN premises are inviolable, including during armed conflict and must be protected by all parties at all times,\" Dujarric said, as quoted by CNN.\nGuterres has not stopped short of criticizing Israel since the start of the war in Gaza.\nIn late October, the UN chief said that Hamas’ attack on Israel on October 7 “did not happen in a vacuum” and appeared to blame Israel for the attack.\nAfter his remarks were widely condemned, the UN chief claimed his comments were misinterpreted and that he had indeed condemned Hamas.\nMore recently, Guterres appeared to equate between Hamas’ October 7 attack on Israel and the humanitarian situation in the Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.7357829056407205, "event_breakdown": "1.) On Thursday, December 9, rockets were fired from Gaza Strip towards the southern Israeli city of Sderot.\n2.) On the same day, the IDF (Israel Defense Forces) targeted the office of Hamas leader Ismail Haniya in Gaza City in response to rocket fire.\n3.) On Friday, December 10, the IDF launched strikes on Gaza in response to earlier rocket fire."}, {"id": "787b319d-ba59-4267-bbdb-d7787c6c5376", "title": "UN chief criticizes Israel : UN premises are inviolable", "date": "2024-06-07 04:00", "url": "https://www.israelnationalnews.com/news/391219", "message": "Guterres \"underscores that UN premises are inviolable, including during armed conflict and must be protected by all parties at all times,\" Dujarric said, as quoted by CNN.\nGuterres has not stopped short of criticizing Israel since the start of the war in Gaza.\nIn late October, the UN chief said that Hamas’ attack on Israel on October 7 “did not happen in a vacuum” and appeared to blame Israel for the attack.\nAfter his remarks were widely condemned, the UN chief claimed his comments were misinterpreted and that he had indeed condemned Hamas.\nMore recently, Guterres appeared to equate between Hamas’ October 7 attack on Israel and the humanitarian situation in the Gaza Strip.", "location": "Gaza", "classification": "security", "score": 0.7357829056407205, "event_breakdown": "November 11, 2021: Guterres \"underscores that UN premises are inviolable, including during armed conflict and must be protected by all parties at all times,\" according to Dujarric, as quoted by CNN."}, {"id": "bca2f65a-2dc9-40c5-938e-a6cc8751ec00", "title": "Precision and Power Projection : US B - 1B Bomber Conducts First Bomb Drill Over Korea in Seven Years Amid Escalating Tensions", "date": "2024-06-07 08:15", "url": "https://trendydigests.com/2024/06/07/precision-and-power-projection-us-b-1b-bomber-conducts-first-bomb-drill-over-korea-in-seven-years-amid-escalating-tensions/", "message": "The United States recently showcased its military capabilities and commitment to regional security by conducting a precision-guided bombing drill with a B-1B bomber over the Korean Peninsula—the first such exercise in seven years.\nAs tensions with North Korea escalate due to a series of provocative actions by Pyongyang, this drill serves as a tangible demonstration of the robust defense posture of the US-South Korea alliance.\nNorth Korea’s recent provocations, such as the launch of balloons carrying refuse across the border into South Korea and attempts to place a spy satellite into orbit, have raised alarms.\nAnalysts caution that North Korea may view the drill as an aggravation, potentially using it as a pretext to enhance its nuclear arsenal.\nThe recent exercise, juxtaposed with President Yoon Suk-yeol’s assertive statements, reflects a shift in the South’s approach towards North Korea.", "location": "Korean Peninsula", "classification": "security", "score": 0.8165540806126766, "event_breakdown": "North Korea – South Korea relations on decline as North Korea tested ballistic missile near Japan."}, {"id": "d2fd15bf-cb07-413e-8724-b2f922838272", "title": "Silac Pathammavong", "date": "2024-06-07 04:30", "url": "https://www.courant.com/obituaries/silac-pathammavong-newington-ct/", "message": "Silac “Richard” Pathammavong, 91, of Newington, beloved husband of the late Praseuth Pathammavong, passed away peacefully on Tuesday, April 30, 2019 at Vernon Manor.\nBorn in Laos to the late La and Khammy Pathammavong, he started his distinguished military career by serving in WWII with the French guerrilla forces during the Japanese occupation of French Indochina.\nIn 1968, he was promoted to brigadier general and assigned to the Commander-in-Chief’s staff of the Royal Lao Army.\nHe loved to watch boxing matches and warfare movies, but his true passion was his family who will miss him dearly.\nA funeral service will be held at 1 PM Saturday, May 11 at the funeral home.", "location": "Laos", "classification": "security", "score": 0.45895574368341857, "event_breakdown": "target event not found"}, {"id": "b4f6f706-5f3e-4810-941d-35c958c3bd85", "title": "D - Day anniversary haunted by dwindling number of veterans and shadowed by Europe new war", "date": "2024-06-07 00:30", "url": "https://www.gjsentinel.com/news/world/d-day-anniversary-haunted-by-dwindling-number-of-veterans-and-shadowed-by-europes-new-war/article_ab3c3be1-e678-509f-bccc-18e5a1435737.html", "message": "FILE - U.S. soldiers stand on the remains of a house as they inspect damage in Carentan, in the Normandy region of France, June 15, 1944.\nThe 80th anniversary this week of D-Day is a mixed bag of emotions for French survivors of the Battle of Normandy.\nThey remain eternally grateful for their liberation from Nazi occupation in World War II but cannot forget its steep cost in French lives.", "location": "The main event takes place in the Normandy region of France.", "classification": "security", "score": 0.7586797097475875, "event_breakdown": "U.S. soldiers who invaded the Normandy coast of northern France in the D-Day offensive of June 1944 helped to defeat Nazi Germany in World War II."}, {"id": "305e0e45-91e2-4de1-a3de-3215ff1a5f87", "title": "EU soldier dies after clash with migrants on Belarus border", "date": "2024-06-07 14:30", "url": "https://www.express.co.uk/news/world/1908541/Poland-Belarus-border-death-migrants-crisis", "message": "The soldier, named only as Mateusz, was defending the eastern border with Belarus last monthPoland is mourning a 22-year-old soldier who has tragically died after he was stabbed in the chest by a migrant.\nThe soldier, named only as Mateusz, was defending the eastern border with Belarus last month when a migrant attacked him with a knife attached to a long branch and stabbed him through the border wall.\nA security video from the day of the attack was later released showing migrants throwing large branches and other objects at Polish soldiers who were giving CPR to the stabbed soldier.\nPolish Prime Minister Donald Tusk said that the young soldier had \"given his life in the defense of Poland’s border\".\nRead our Privacy PolicyTusk blamed Russia and Belarus for the surge in attempted migrant crossings", "location": "POLAND", "classification": "security", "score": 0.42755928548424854, "event_breakdown": "Current events of security reported in text that can be placed on a map:\nEvent 1: Poland is mourning a soldier, named only as Mateusz, who has tragically died after he was stabbed in the chest by a migrant.\nEvent 2: Mateusz was defending the eastern border with Belarus last month when a migrant attacked him with a knife attached to a long branch and stabbed him through the border wall. A security video from the day of the attack was later released showing migrants throwing large branches and other objects at Polish soldiers who were giving CPR to the stabbed soldier.\nNote: Polish Prime Minister Donald Tusk said that the young soldier had \"given his life in the defense of Poland’s border\" and blamed Russia and Belarus for the surge in attempted migrant crossings."}, {"id": "1268120d-546c-4e55-a2bc-dcd9321e99c5", "title": "Diminished Hamas switches to full insurgent mode in Gaza", "date": "2024-06-07 03:00", "url": "https://www.asiaone.com/world/diminished-hamas-switches-full-insurgent-mode-gaza", "message": "“In earlier months, Hamas fighters would intercept, engage and fire at Israeli troops as soon as they pushed into their territory,” Ibrahim told Reuters by phone.\nLerner, the IDF spokesman, agreed Israel faced a protracted battle to overcome Hamas, which has ruled the Gaza Strip since 2006.\nThe labyrinth, dubbed the Gaza metro by the Israeli military, is roughly half the length of the New York subway system.\nThe Israeli military said last week that it had taken control of the entire Gaza-Egypt land border to prevent weapons smuggling.\nGadi Eisenkot, a former Israeli military chief serving in Netanyahu’s war Cabinet, has proposed an Egyptian-led international coalition as an alternative to Hamas rule in Gaza.", "location": "GAZA STRIP", "classification": "security", "score": 0.7265177924372295, "event_breakdown": "IDF spokesman Peter Lerner says Israel faces a protracted battle to overcome Hamas, which has ruled the Gaza Strip since 2006.\nThe Israeli military, IDF, has taken control of the entire Gaza-Egypt land border to prevent weapons smuggling.\nFormer Israeli military chief Gadi Eisenkot has proposed an Egyptian-led international coalition as an alternative to Hamas rule in Gaza."}, {"id": "42cfea8c-53b0-4a4e-bc70-d76b306eb2eb", "title": "10 Forgotten Allies in World War II", "date": "2024-06-07 09:00", "url": "https://listverse.com/2024/06/07/10-forgotten-allies-in-world-war-ii/", "message": "[1]9 ColombiaColombia during World War IIWatch this video on YouTubeUnlike other Latin American countries, Colombia did not declare war on the Axis after Pearl Harbor but did break off diplomatic relations.\nIt also declared war on Germany and Italy on the 11th.\nMany were descendants of British immigrants, and the three British military services saw 4,000 Argentine volunteers, including hundreds of women, enlist.\nOn June 1, after Germany refused to apologize or pay compensation, President Avila Camacho formally declared war on the Axis.\nAfter a fierce debate in Parliament, Hertzog was voted out of office and replaced by pro-British Jan Smuts, who declared war on Germany on September 6, 1939.", "location": "Colombia", "classification": "security", "score": 0.6482946361022035, "event_breakdown": "Location: Colombia\nTarget Event: World War II\nEvent: Colombia broke off diplomatic relations with Germany and Italy during World War II.\nDate: December 11, 1941\nSummary: Colombia declared war on Germany and Italy on the 11th.\nLocation: Argentina\nTarget Event: World War II\nEvent: President Avila Camacho formally declared war on the Axis after Germany refused to apologize or pay compensation.\nDate: June 1, 1943\nSummary: \nLocation: South Africa\nTarget Event: World War II\nEvent: After a fierce debate in Parliament, Hertzog was voted out of office and replaced by pro-British Jan Smuts, who declared war on Germany on September 6, 1939.\nDate: September 6, 1939\nSummary: Hertzog was replaced by Jan Smuts, who declared war against Germany."}, {"id": "069e67a2-b54d-4cca-a637-a4df40a696d8", "title": "  North Korea will react angrily : how a US bomber drill could backfire", "date": "2024-06-07 00:45", "url": "https://www.scmp.com/week-asia/politics/article/3265674/north-korea-will-react-angrily-how-us-bomber-drill-could-backfire", "message": "A B-1B bomber of the US Air Force (left) flies in formation with South Korean F-15K fighter jets (right) over the Korean peninsula on Wednesday.\nNorth Korea has previously called the bomber’s deployment on the Korean peninsula proof of US hostility.\nIt has responded to past flights of B-1Bs and other powerful US aircraft in South Korea by carrying out missile tests.\nA view of Kaesong, North Korea, from an observatory in the demilitarised zone in South Korea.\nOnly by growing stronger can we change North Korea,” he said in a Memorial Day speech at Seoul National Cemetery commemorating the country’s war dead.", "location": "Seoul National Cemetery", "classification": "security", "score": 0.49180279997151927, "event_breakdown": "A B-1B bomber of the US Air Force (left) flies in formation with South Korea F-15K fighter jets (right) over the Korean peninsula on Wednesday. North Korea has previously called the bomber’s deployment on the Korean peninsula proof of US hostility. It has responded to past flights of B-1Bs and other powerful US aircraft in South Korea by carrying out missile tests. A view of Kaesong, North Korea, from an observatory in the demilitarised zone in South Korea. Only by growing stronger can we change North Korea,” he said in a Memorial Day speech at Seoul National Cemetery commemorating the country’s war dead."}, {"id": "22883e15-8552-4fc4-93e9-18acb8936ff6", "title": "Will North Korea fly trash balloons into South Korea again ? At look at rising tensions between them", "date": "2024-06-07 09:30", "url": "https://www.yahoo.com/news/north-korea-fly-trash-balloons-083738503.html", "message": "Will North Korea fly trash balloons into South Korea again?\nAt look at rising tensions between themFILE - South Korean soldier wearing protective gears checks the trash from a balloon presumably sent by North Korea, in Incheon, South Korea, on June 2, 2024.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire.", "location": "Incheon, South Korea", "classification": "security", "score": 0.7619164641732327, "event_breakdown": "Target event: North Korean Balloon Campaign\nNorth Korean Balloon Campaign:\nNorth Korea sent balloons filled with trash across the demilitarized zone into South Korea."}, {"id": "45651c86-7dd0-45eb-96b6-7f55dc1ae0d7", "title": "Will North Korea Fly Trash Balloons into South Korea Again ? A Look at Rising Tensions Between Them", "date": "2024-06-07 11:30", "url": "https://www.military.com/daily-news/2024/06/07/will-north-korea-fly-trash-balloons-south-korea-again-look-rising-tensions-between-them.html", "message": "SEOUL, South Korea — South Koreans were alert Friday for possible new launches by North Korea of balloons carrying rubbish into the South, a day after Seoul activists flew their own balloons to scatter political leaflets in the North.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nBut the North Korean balloons sent into South Korea in recent days carried only garbage, not political leaflets.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire.", "location": "itself\nSEOUL, South Korea", "classification": "security", "score": 0.7134438052836866, "event_breakdown": "Location: Seoul, South Korea\nNews Event: South Koreans were alert for possible new launches by North Korea of balloons carrying rubbish into the South on Friday, a day after Seoul activists flew their own balloons to scatter political leaflets in the North."}, {"id": "e8346e20-a3c4-459f-bdd6-a84a0628b1be", "title": "Will North Korea fly trash balloons into South Korea again ? A look at rising tensions between them", "date": "2024-06-07 09:45", "url": "https://www.ksat.com/news/world/2024/06/07/will-north-korea-fly-trash-balloons-into-south-korea-again-at-look-at-rising-tensions-between-them/", "message": "North Korea would probably retaliate with its own measures, further escalating tensions between the rivals.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nBut the North Korean balloons sent into South Korea in recent days carried only garbage, not political leaflets.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire.", "location": "Based on the information provided, I was not able to identify a specific location for the event.", "classification": "security", "score": 0.7117192828328658, "event_breakdown": "North Korea fires artillery rounds across the border, prompting South Korea to return fire."}, {"id": "78d85e3e-56a3-4d0b-a88a-30e0ce77fda5", "title": "Will North Korea fly trash balloons into South Korea again ? A look at rising tensions between them", "date": "2024-06-07 12:30", "url": "https://www.local10.com/news/world/2024/06/07/will-north-korea-fly-trash-balloons-into-south-korea-again-at-look-at-rising-tensions-between-them/", "message": "North Korea would probably retaliate with its own measures, further escalating tensions between the rivals.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nBut the North Korean balloons sent into South Korea in recent days carried only garbage, not political leaflets.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire.", "location": "Based on the context provided, I was unable to find a specific location for this event.", "classification": "security", "score": 0.7117192828328658, "event_breakdown": "North Korea fires artillery rounds across the border\nSouth Korea returns fire"}, {"id": "51f57655-d416-49fe-bdd3-c2f915a53770", "title": "Will North Korea fly trash balloons into South Korea again ? At look at rising tensions between them", "date": "2024-06-07 09:15", "url": "https://www.news4jax.com/news/world/2024/06/07/will-north-korea-fly-trash-balloons-into-south-korea-again-at-look-at-rising-tensions-between-them/", "message": "North Korea would probably retaliate with its own measures, further escalating tensions between the rivals.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nBut the North Korean balloons sent into South Korea in recent days carried only garbage, not political leaflets.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire.", "location": ".\nThe Korean Demilitarized Zone (DMZ) is the location where the main event", "classification": "security", "score": 0.7117192828328658, "event_breakdown": "North Korea fires artillery rounds across the border in 2015, prompting South Korea to return fire."}, {"id": "76c0192f-3bff-4953-b6c7-adeda896ee14", "title": "Will North Korea fly trash balloons into South Korea again ? A look at rising tensions between them", "date": "2024-06-07 10:30", "url": "https://www.clickorlando.com/news/world/2024/06/07/will-north-korea-fly-trash-balloons-into-south-korea-again-at-look-at-rising-tensions-between-them/", "message": "North Korea would probably retaliate with its own measures, further escalating tensions between the rivals.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nBut the North Korean balloons sent into South Korea in recent days carried only garbage, not political leaflets.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire.", "location": ")\nSeoul, South Korea", "classification": "security", "score": 0.7117192828328658, "event_breakdown": "North Korea fires artillery shells into South Korea\nSouth Korea vows retaliation for North Korean artillery attack"}, {"id": "237c1b7b-96b6-4f1f-aafb-0ad2c0cab1cb", "title": "Russians apply most severe pressure on Pokrovsk front : 28 attacks over past day – Ukraine General Staff", "date": "2024-06-07 08:15", "url": "https://www.yahoo.com/news/russians-apply-most-severe-pressure-233251322.html", "message": "A total of 73 combat clashes took place on the battlefield in Ukraine over the past 24 hours, and 28 of them occurred on the Pokrovsk front.\nOn the Kupiansk front, the Russians attempted to approach Ukrainian positions near Druzheliubivka and Petropavlivka.\n22 of those attacks were repelled, and six combat clashes are ongoing.\nOn the Kurakhove front, the Russians attacked Ukrainian positions in the areas of Paraskoviivka and Krasnohorivka five times.\nOn other fronts, there were no significant changes in the combat situation.", "location": "POKROVSK", "classification": "security", "score": 0.9728136773450818, "event_breakdown": "Pokrovsk frontlineUkraineRussian forcesUkrainian soldiersKupiansk front DruzheliubivkaPetropavlivkaKurakhove front Krasnohorivka"}, {"id": "4f45f81b-7c93-41db-8301-5bf4d3c56426", "title": "Biden is to meet with Ukraine Zelenskyy in Paris as Russia leans into its battlefield offensive", "date": "2024-06-07 10:30", "url": "https://www.theday.com/world/20240607/biden-is-to-meet-with-ukraines-zelenskyy-in-paris-as-russia-leans-into-its-battlefield-offensive/", "message": "Ukrainian President Volodymyr Zelenskyy attends a military honor ceremony, Friday, June 7, 2024 at the Invalides monument in Paris.\nThe offensive is seeking to exploit Kyiv’s shortages of ammunition and troops along the roughly 1,000-kilometer (620-mile) front line.\n(AP Photo/Sophie Garcia)President of the French National Assembly, Yael Braun-Pivet welcomes Ukrainian President Volodymyr Zelenskyy before his address to the assembly, Friday, June 7, 2024 in Paris.\n(Sameer Al-Doumy, Pool via AP)Ukrainian President Volodymyr Zelenskyy listens to the Ukrainian national anthem at the Invalides monument during a military honor ceremony, Friday, June 7, 2024 in Paris.\n( Sameer Al-Doumy, Pool via AP)Ukrainian President Volodymyr Zelenskyy, center, French Defense Minister Sebastien Lecornu, left, and Military Governor of Paris and Army Corps General Christophe Abad attend a military honor ceremony, Friday, June 7, 2024 in Paris.", "location": "PARIS is the city where the Ukrainian President Volodymyr Zelenskyy attends a military honor", "classification": "security", "score": 0.7115884462135469, "event_breakdown": "Ukrainian President Volodymyr Zelenskyy is visiting France for a military honor ceremony at the Invalides monument in Paris on Friday, June 7, 2024. Zelenskyy is also scheduled to address the National Assembly.\nThe Russian military has begun a heavy offensive in several sections of the frontline in eastern Ukraine, seeking to exploit Kyiv’s supplies and troops, the Ukrainian president said Friday. Ukraine said Russian shelling had killed civilians in the east and south."}, {"id": "81a93bb1-ce68-4c6a-9628-e29b28bfcf34", "title": "HUR Warns of New Russian PSYOP Campaign Against Ukraine", "date": "2024-06-07 14:00", "url": "https://www.kyivpost.com/post/33934", "message": "Russia is preparing another information and psychological operation, Ukrainian military intelligence (HUR) said in a Telegram post Friday, June 7.\nThe operation is “aimed at discrediting the military leadership of our country, in particular against the Ukrainian military intelligence,” the post reads.\nAccording to HUR, Russia has allocated $15 million toward the new operation, which includes producing and distributing articles and films in Ukraine and Western countries.\nThe Russians plan to distribute information about HUR employees “coordinating Security and Defense Forces’ special combat units,” the statement says.\nAccording to HUR, the new campaign aims to:", "location": "Kiev", "classification": "security", "score": 0.4241951955433912, "event_breakdown": "The Security Service of Ukraine (SBU) has detained a person in Kharkiv Oblast who provided Russian special services with information about events and the location of security and defense forces in the region, the head of the SBU's Main Investigation Directorate, Vasyl Kuibida, said on Channel 24.\n\n\"The counterintelligence of the Security Service of Ukraine in Kharkiv Oblast detained a person suspected of carrying out illegal activities on Russia's behalf,\" Kuibida said.\n\nIn May, the partners passed specific operational information to Russia's special services about the movement of Kharkiv citizens' convoys and the officers and equipment of security and defense forces on specific streets, the main investigation directorate said.\n\nIn addition, the suspect \"supplied Russia with information about the strategy, strength and distribution of military formations of subdivisions,\" he said.\n\nIn particular, the detainee allegedly disclosed to Russia \"the movement of checkpoints by Ukrainian troops.\"\n\nThe suspect was detained while allegedly handing over operational information in the area of his residence on June 5, and his criminal case has been sent to court.\n\nThe SBU seized 32,000 hryvnia ($1,200), a pocket navigator and an electronic device, among other evidence, during the search of the detainee's apartment."}, {"id": "3ccfb46a-4b10-4508-a9cb-ff05aa0f4a4e", "title": "World War II : Honoring and remembering Michigan veterans who fought , died during D - Day", "date": "2024-06-07 03:15", "url": "https://www.wilx.com/2024/06/06/world-war-ii-honoring-remembering-michigan-veterans-who-fought-died-during-d-day/", "message": "LANSING, Mich. (WILX) - Engaged in a fierce battle with German troops on June 6, 1944, 3,000 American soldiers and sailors died in the first 24 hours of the D-Day invasion.\nThe average age of those who died, just 27, but some as young as 16.\nIn Mid-Michigan, 94 Michigan veterans who lost their lives on D-Day will be honored in a wreath-laying ceremony.\nThe event organizer, Michele Fickes, hosted the wreath-laying ceremony to honor Michigan soldiers who died in France at the Evergreen Cemetery in Lansing.\n“It makes you into a person that is sacrificial, service-oriented, and that’s why veterans are so amazing.", "location": "Evergreen Cemetery in Lansing", "classification": "security", "score": 0.4139027101762131, "event_breakdown": "Location: Lansing, Michigan, USA\nEvent: Lansing hosts wreath-laying ceremony to honor Michigan soldiers who died in France on the D-Day invasion\nSummary: 94 Michigan veterans who lost their lives on D-Day will be honored in a wreath-laying ceremony hosted by the event organizer Michele Fickes at the Evergreen Cemetery in Lansing."}, {"id": "2dfdb6aa-00ed-4845-ad70-a37cec740be2", "title": "Biden will meet with Ukraine Zelenskyy in Paris as Russia leans into its battlefield offensive", "date": "2024-06-07 10:45", "url": "https://www.wsbradio.com/news/world/biden-will-meet-with/XUENDDGHD6RV6TDW4B5QJTKUF4/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "Based on the information provided, the main location where the main event takes place is the United States.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "1. The Indian Defence news.\n2. Ukraine Security Alert.\n3. China's future.\n4. North Korea supreme leader's training.\n5. Venezuela Crisis."}, {"id": "71299b08-7a39-4da5-b0d9-b426ef6c2d89", "title": "Will North Korea fly trash balloons into South Korea again ? At look at rising tensions between them – Winnipeg Free Press", "date": "2024-06-07 09:00", "url": "https://www.winnipegfreepress.com/world/2024/06/07/will-north-korea-fly-trash-balloons-into-south-korea-again-at-look-at-rising-tensions-between-them", "message": "SEOUL, South Korea (AP) — South Koreans were alert Friday for possible new launches by North Korea of balloons carrying rubbish into the South, a day after Seoul activists flew their own balloons to scatter political leaflets in the North.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North’s action was also likely designed to trigger a divide in South Korea over its conservative government’s tough policy on North Korea.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire.", "location": "SEOUL, South Korea.", "classification": "security", "score": 0.7850319049123012, "event_breakdown": "SEOUL, South Korea (AP) — North Korea fired an unidentified projectile off its east coast on Wednesday, South Korea's Joint Chiefs of Staff said, a likely ballistic missile launch that comes after it threatened to lift self-imposed pandemic-related rules."}, {"id": "03a3be8d-6f69-47ae-96e9-3c4e71e2810a", "title": "Russia losses 1 , 080 soldiers in one day", "date": "2024-06-07 08:15", "url": "https://www.yahoo.com/news/russia-losses-1-080-soldiers-050419431.html", "message": "Ukrainian soldiers.\nPhoto: General Staff of the Armed Forces of UkraineRussia's losses in its war against Ukraine continue to mount as they have lost 1,080 soldiers and 64 artillery systems over the past day alone.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 7 June 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\nThe information is being confirmed.\nSupport UP or become our patron!", "location": "Ukraine", "classification": "security", "score": 0.7720471844494595, "event_breakdown": "Russia's losses in its war against Ukraine continue to mount as an estimated total of 1,080 soldiers and 64 artillery systems have been confirmed as lost over the"}, {"id": "e2660ec0-6eba-4713-a15d-90581f6c7c9d", "title": "Why Did North Korea Dump Trash Balloons On South Korea ? Does This Mean Escalation ? ", "date": "2024-06-07 09:00", "url": "https://www.news18.com/explainers/why-did-north-korea-dump-trash-balloons-on-south-korea-does-this-mean-escalation-8924440.html", "message": "North Korea has indulged in a psychological warfare by dropping hundreds of trash-laden balloons across South Korea.\nSince last week, North Korea has sent thousands of trash balloons across the Demilitarised Zone separating the two Koreas.\nWhy North Korea Has Dropped Trash Balloons on South Korea?\nIn 1990s, North Korea’s propaganda was losing its relevance and South Korean economy was making strides.\nThe South became a vibrant democracy while North Korea faced food shortages and relied on information blackout to control its people.", "location": "The Korean Demilitarized Zone.", "classification": "security", "score": 0.5896838756795323, "event_breakdown": "North Korean Balloon Bombs Target South Korea\nNorth Korea has targeted South Korea with thousands of bomb-laden balloons in the past week. Officials in South Korea have confirmed receipt of the balloons but have yet to respond to the situation. This is the latest in a series of provocative acts aimed at South Korea by the North, which has conducted a number of missile launches in the past year. South Korea is keeping its response open but says it will continue to monitor the situation and defends the safety of its civilians."}, {"id": "dd85cf89-394a-49f6-ac8d-407f3a6e3ce6", "title": "So much for Putin invulnerable  iron shed  tanks ! Russian armoured vehicle covered in protective plating is blown up by drone when commander forgets to close the hatch", "date": "2024-06-07 11:30", "url": "https://www.dailymail.co.uk/news/article-13505405/putin-tanks-russian-vehicle-blown-drone-forget-close-hatch.html", "message": "A Russian armoured vehicle covered in protective plating was blown up by a drone after the commander forgot to close the hatch.\nThe 'iron shed' then bursts into flames, sending an orange blaze into the sky in a humiliating blunder from the Russian commander.\nIn April, one video leaked to Telegram channels showed three Russian tanks with the metal covers plodding along through a battlefield at the Ukrainian-held town of Krasnohorivka as they came under fire.\nRussian tanks have been hugely affected by Ukrainian drones after a NATO official told Foreign Police last month that more than two-thirds of targeted Russian tanks were destroyed by drones.\nExperts believe the'iron shed' tanks are likely modified to offer them protection against Ukrainian drone attacks, which are becoming increasingly prominent because of Ukraine's lack of conventional artillery shells.", "location": "KRASNOHORIVKA", "classification": "security", "score": 0.6487873552333624, "event_breakdown": "Location: Krasnohorivka, Ukraine\nEvent: Russian tanks destroyed by Ukrainian drones\nDate: April"}, {"id": "1322ff32-af7a-488d-a729-df23b0fc080c", "title": "USS Oak Hill Departs Brest , France", "date": "2024-06-07 11:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240606-usn03.htm", "message": "USS Oak Hill Departs Brest, FranceUS Navy06 June 2024From Mass Communication Specialist 3rd Class Justin KembleBREST, France -- The Harper's Ferry-class amphibious landing dock USS Oak Hill (LSD 51) departed Brest, France after a scheduled four-day port visit, June 3, 2024.\nSailors and Marines were conducted aboard both Oak Hill and Mistral.\nOak Hill deployed from Norfolk, Virginia, May 22, and has conducted training, exercises, and operations to support maritime stability and security in defense of U.S., Allied, and partner interests.\nOak Hill is conducting operations in U.S.\nThe WSP ARG-24th MEU (SOC) is comprised of its flagship namesake, the amphibious assault ship USS Wasp (LHD 1), San Antonio-class amphibious transport dock ship USS New York (LPD 21), Oak Hill, and the embarked 24th MEU (SOC).", "location": "Brest, France", "classification": "security", "score": 0.739774994513163, "event_breakdown": "Target event - a news story issued by an official source such as a ministry of defense or government security service\nUS Navy's USS Oak Hill departs Brest, France on June 3, 2024"}, {"id": "aec26628-158f-459d-9330-a3b9bdb878a1", "title": "Will North Korea fly trash balloons into South Korea again ? At look at rising tensions between them | iNFOnews", "date": "2024-06-07 09:00", "url": "https://infotel.ca/newsitem/as-koreas-tensions-the-trash-dump/cp2064152840", "message": "Will North Korea fly trash balloons into South Korea again?\nAt look at rising tensions between themSEOUL, South Korea (AP) — South Koreans were alert Friday for possible new launches by North Korea of balloons carrying rubbish into the South, a day after Seoul activists flew their own balloons to scatter political leaflets in the North.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire.", "location": "South Korea", "classification": "security", "score": 0.7121867760987887, "event_breakdown": "North Korea may fly trash balloons into South Korea again. South Korean officials were on high alert for possible new launches by North Korea of balloons carrying rubbish into the South. South Korean officials called this campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation."}, {"id": "b84f8a61-5893-4fc0-98ae-374907feed44", "title": "Local WWII veteran remembers his time in the war", "date": "2024-06-07 04:15", "url": "https://www.yahoo.com/news/local-wwii-veteran-remembers-time-022031572.html", "message": "CHESAPEAKE, Va. (WAVY) — Horace Savage was almost 20 years old when he arrived on the beaches of Normandy in 1944.\nIt was months after D-Day, but Savage said that doesn’t mean the area was calm.\nHe told 10 On Your Side that war was terrifying, but duty is duty and he had missions to complete.\n“High toned explosion there, here, an explosion, there an explosion,” he said, remembering the active war atmosphere.\nAnd when time comes to seek shelter, you seek shelter.", "location": "Normandy", "classification": "security", "score": 0.4399414852000668, "event_breakdown": "Germanwings Flight 9525 (2015) - The crash of Germanwings Flight 9525 on March 24, 2015, was a tragedy that shocked the world. The flight, which was traveling from Barcelona, Spain, to Dusseldorf, Germany, crashed into the French Alps, killing all 144 passengers and six crew members on board.\nMalaysia Airlines Flight MH17 (2014) - On July 17, 2014, Malaysia Airlines Flight MH17 was shot down over eastern Ukraine, killing all 298 passengers and crew on board. The disaster was blamed on pro-Russian separatists, who allegedly mistook the passenger jet for a military aircraft.\nCharlie Hebdo attack (2015) - On January 7, 2015, gunmen attacked the offices of the French satirical magazine Charlie Hebdo in Paris, killing 12 people (including 10 journalists) and wounding 11 others. The terrorists, who claimed to be acting on behalf of the terrorist group Al-Qaeda in the Arabian Peninsula, were motivated by the magazine's depiction of the prophet Mohammed."}, {"id": "4440f2f2-d32d-44d9-8f61-142d02122aa5", "title": "Survivors of Israeli strike on Gaza school describe finding children bodies | Israel - Gaza war", "date": "2024-06-07 16:30", "url": "https://www.theguardian.com/world/article/2024/jun/07/survivors-israeli-strike-gaza-school-children-bodies", "message": "Survivors of an Israeli airstrike on a UN school in central Gaza have described finding children’s bodies that had been torn apart by the blast, as Israeli attacks on the area continued for a second night.\nGaza’s head of civil defence said his teams at al-Sardi school in Nuseirat found only civilians among the dead.\nThe attack was part of a campaign in parts of central Gaza which Israeli ground forces had targeted earlier in the war before moving on.\n“Things are getting worse again, with that night [of the school attack] being one of the most difficult: we couldn’t sleep until morning because of all the bombing,” Jouda said.\nWhen will it be enough?”A UN spokesperson, Stéphane Dujarric, said the school attack was “just another horrific example of the price that civilians are paying” as they try to escape Israeli attacks.", "location": "Gaza", "classification": "security", "score": 0.9806621521265787, "event_breakdown": "Israeli forces continued airstrikes in central Gaza, killing at least 10 civilians, according to Gaza’s head of civil defence. The al-Sardi school was attacked late Friday night and killed at least 10 people."}, {"id": "5830d8da-855f-4c86-84f7-cfef45b40107", "title": "Gaza School Airstrike : Tragedy Amid Ceasefire Talks", "date": "2024-06-07 00:15", "url": "https://www.devdiscourse.com/article/law-order/2974510-gaza-school-airstrike-tragedy-amid-ceasefire-talks", "message": "Ismail Al-Thawabta, the director of the Hamas-run government media office, rejected Israel's assertion that the U.N. school in Nuseirat, in central Gaza, had hidden a Hamas command post.\nLater Israel's chief military spokesperson Daniel Hagari said the military had so far identified nine of 30 Hamas and Islamic Jihad fighters targeted in the pre-dawn strike.\nIn a separate Israeli airstrike on a house in Deir Al-Balah in central Gaza Strip, three Palestinians were killed and several others were wounded, medics said.\nThere was no immediate response from Israeli military on the two latest accounts.\nThe building was once used as a school, but with no schools now operating in Gaza it was being used as a shelter, he added.", "location": "GAZA", "classification": "security", "score": 0.9803748673451365, "event_breakdown": "1. The Israeli army said it had launched a full-scale ground invasion of the Hamas-controlled Gaza Strip on Thursday night, following days of cross-border fighting in which more than 220 Palestinians and three Israelis have been killed. \n2. Israel claims the U.N. school in Nuseirat, in central Gaza, had hidden a Hamas command post, but the director of the Hamas-run government media office, Ismail Al-Thawabta, rejected Israel's assertion.\n3. Israeli military said it had so far identified nine of 30 Hamas and Islamic Jihad fighters targeted in the strike, which the Israeli military said was a response to Hamas fire on Israelis."}, {"id": "75ab6d54-e8a5-451a-a549-eb7e9ddbb7be", "title": "US Bomb Used in Deadly Israeli Attack on UN School in Gaza : Officials", "date": "2024-06-07 17:15", "url": "http://www.hngn.com/articles/261276/20240607/american-bomb-used-united-nations-gaza-school-reports.htm", "message": "(Photo : UNRWA)An Israeli missile strike reportedly killed at least 33 people who were sheltering inside a United Nations school, located within a central Gaza refugee camp.\nThe nose of a US-made Boeing GBU-39 small-diameter bomb Boeing bomb could be seen amid the rubble after Israel's attack, the Washington Post reported.\nA Pentagon official told NPR that Israel had used the bomb in the school attack improperly because use of the bomb is limited to situations where it would cause low collateral damage — but instead it killed several people in the targeted school.\nAn Israeli Army spokesman told NPR that he was unaware of any civilian casualties in the school strike, and that Hamas fighters were the targets.\nAfter the school attack, State Department spokesman Matt Miller said at a briefing Thursday: \"We are pressing the government of Israel and the IDF to be completely transparent about what happened here.\"", "location": "Gaza", "classification": "security", "score": 0.9573993935862051, "event_breakdown": "Target Event:\nAn Israeli Army spokesman told NPR that the target in the school attack was Hamas fighters, not civilians."}, {"id": "e2f38327-c310-413f-9400-46820e060674", "title": "Deadly Gaza strike raises US concerns about civilians , despite precision munitions", "date": "2024-06-07 15:45", "url": "https://www.wjnt.com/syndicated-article/?id=1568169", "message": "(WASHINGTON) — An Israeli attack on a UN school complex in central Gaza is raising alarm among U.S. officials after scores of civilians were reportedly killed, despite the apparent use of American-made precision munitions.\nIn both that attack and Thursday’s strike on the school, weapons experts tell ABC News that fragments at the sites indicate that American-supplied munitions — GBU-39 small diameter bombs — were used.\nThrough the conflict, Israel has not made a consistent practice of sharing intelligence justifying its attacks with its allies or the public.\nBut Palestinians in Gaza say the end result is that they are left with no refuge from the horrors of war.\n“But this is what happened.”ABC News’ Diaa Ostaz, Morgan Winsor, Helena Skinner and Chris Looft contributed to this report.", "location": "Gaza, Palestine", "classification": "security", "score": 0.8146798013264523, "event_breakdown": "Israeli air strikes on central Gaza and American-supplied munitions being used in the attacks."}, {"id": "a29d0a93-6cf4-42d2-a1f4-d833d85aadc1", "title": "Deadly Gaza strike raises US concerns about civilians , despite precision munitions", "date": "2024-06-07 15:00", "url": "https://www.koka.am/syndicated-article/?id=1568169", "message": "(WASHINGTON) — An Israeli attack on a UN school complex in central Gaza is raising alarm among U.S. officials after scores of civilians were reportedly killed, despite the apparent use of American-made precision munitions.\nIn both that attack and Thursday’s strike on the school, weapons experts tell ABC News that fragments at the sites indicate that American-supplied munitions — GBU-39 small diameter bombs — were used.\nThrough the conflict, Israel has not made a consistent practice of sharing intelligence justifying its attacks with its allies or the public.\nBut Palestinians in Gaza say the end result is that they are left with no refuge from the horrors of war.\n“But this is what happened.”ABC News’ Diaa Ostaz, Morgan Winsor, Helena Skinner and Chris Looft contributed to this report.", "location": "Gaza", "classification": "security", "score": 0.8146798013264523, "event_breakdown": "Target event not relevant."}, {"id": "7ebf7c72-e9d9-43c2-bf16-9a806177a2b1", "title": "Deadly Gaza strike raises US concerns about civilians , despite precision munitions", "date": "2024-06-07 15:15", "url": "https://www.madrock1025.com/syndicated-article/?id=1568169", "message": "(WASHINGTON) — An Israeli attack on a UN school complex in central Gaza is raising alarm among U.S. officials after scores of civilians were reportedly killed, despite the apparent use of American-made precision munitions.\nIn both that attack and Thursday’s strike on the school, weapons experts tell ABC News that fragments at the sites indicate that American-supplied munitions — GBU-39 small diameter bombs — were used.\nThrough the conflict, Israel has not made a consistent practice of sharing intelligence justifying its attacks with its allies or the public.\nBut Palestinians in Gaza say the end result is that they are left with no refuge from the horrors of war.\n“But this is what happened.”ABC News’ Diaa Ostaz, Morgan Winsor, Helena Skinner and Chris Looft contributed to this report.", "location": ".\nGaza", "classification": "security", "score": 0.8146798013264523, "event_breakdown": "Target event:\nIsrael attacking the Central Gaza school with United States-supplied munitions."}, {"id": "68d5e0e3-0289-4262-98be-910818cbf9cf", "title": "Deadly Gaza strike raises US concerns about civilians , despite precision munitions", "date": "2024-06-07 16:30", "url": "https://www.wlip.com/syndicated-article/?id=1568169", "message": "(WASHINGTON) — An Israeli attack on a UN school complex in central Gaza is raising alarm among U.S. officials after scores of civilians were reportedly killed, despite the apparent use of American-made precision munitions.\nIn both that attack and Thursday’s strike on the school, weapons experts tell ABC News that fragments at the sites indicate that American-supplied munitions — GBU-39 small diameter bombs — were used.\nThrough the conflict, Israel has not made a consistent practice of sharing intelligence justifying its attacks with its allies or the public.\nBut Palestinians in Gaza say the end result is that they are left with no refuge from the horrors of war.\n“But this is what happened.”ABC News’ Diaa Ostaz, Morgan Winsor, Helena Skinner and Chris Looft contributed to this report.", "location": ", like article or number)\nGAZA CITY", "classification": "security", "score": 0.8146798013264523, "event_breakdown": "Israeli attack on a UN school complex in central Gaza"}, {"id": "b6467a4b-7549-4c4e-86e4-d6e58e915669", "title": "Dozens killed in Israeli strike on UN school in Gaza", "date": "2024-06-07 02:15", "url": "https://www.thestar.com.my/news/world/2024/06/07/dozens-killed-in-israeli-strike-on-un-school-in-gaza", "message": "Ismail Al-Thawabta, the director of the Hamas-run government media office, rejected Israel's assertion that the UN school in Nuseirat, in central Gaza, had hidden a Hamas command post.\nIn another sensitive development, the Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire.\nHamas precipitated the war by attacking Israeli territory last Oct. 7, killing around 1,200 people and capturing more than 250 hostages, according to Israeli tallies.\nIsrael's military assault on Gaza has killed more than 36,000 people, according to health officials in the territory, who say thousands more dead are feared buried under the rubble.\nUS and Israeli officials have told Reuters about half of Hamas's forces have been killed in the conflict.", "location": "GAZA", "classification": "security", "score": 0.943590060676183, "event_breakdown": "The Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire."}, {"id": "349148cc-2d05-456a-9fdc-e8ee9ec74d65", "title": "Israel strikes UN school , US urges  full transparency  ", "date": "2024-06-07 09:00", "url": "https://www.siasat.com/israel-strikes-un-school-us-urges-full-transparency-3040146/", "message": "He said the US had seen reports that 14 children were killed in the strike.\n“If that is accurate that 14 children were killed, those aren’t terrorists,” Miller said.\n“These are all facts that need to be verified, and that’s what we want to see happen.”According to the UNRWA, the school building in the refugee district of Nuseirat was being used as an emergency shelter.\nIt was initially not possible to independently verify the information.\nTwenty to 30 members of Hamas and the Palestinian Islamic Jihad (PIJ) were believed to have been in three classrooms of the school building in the Nuseirat refugee neighbourhood, according to the Israeli army.", "location": "NULL", "classification": "security", "score": 0.8112616090147621, "event_breakdown": "UNRWA School in Nuseirat, Gaza hit by Israeli airstrike."}, {"id": "9e682987-c54f-4998-8421-c2ab070eab0d", "title": "Xinhua world news summary at 1530 GMT , June 7", "date": "2024-06-07 16:15", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-06/07/content_117243019.htm", "message": "At least 10 Palestinians, including children and women, were killed in a missile attack on a house in Khan Younis in southern Gaza, according to Palestinian security sources.\n\"The deaths recorded since May 10 reached 288,\" said Ibrahim Abdullah Khatir, director-general of North Darfur State's Health Ministry.\nThe incident took place on Thursday afternoon in Police District 9 of the provincial capital city of Mahmud-e-Raqi, when The victims found a mortar round left over from past wars.\nThe explosion of the device later killed a child on the spot while injuring three others, the official said.\nAccording to the preliminary report, the disaster took place in South Rewarangga village in Ende region at around 5:30 a.m. local time when the family were in bed.", "location": "Palestine", "classification": "security", "score": 0.900392106517791, "event_breakdown": "At least 10 Palestinians, including children and women, were killed in a missile attack on a house in Khan Younis in southern Gaza, according to Palestinian security sources. The incident happened on Thursday afternoon in Police District 9 of the provincial capital city of Mahmud-e-Raqi, when The victims found a mortar round left over from past wars. The explosion of the device later killed a child on the spot while injuring three others, the official said. According to the preliminary report, the disaster took place in South Rewarangga village in Ende region at around 5:30 a.m. local time when the family were in bed. Location: Khan Younis, southern Gaza\nTarget: missile attack\nPalestinian casualties: at least 10 killed\nVictims: children, women\nCauses: leftover mortar round from previous wars\nThe preliminary report stated that a family were gathered indoors when the explosion occurred, killing a child and injuring three others."}, {"id": "7ec75488-45a9-41f2-9946-ea6524926712", "title": "SEE IT : Houthi Terrorist Group Unveils Solid - Fuel  Palestine  Missile That Resembles Iranian Hypersonic – The Yeshiva World", "date": "2024-06-07 16:15", "url": "https://www.theyeshivaworld.com/news/general/2289155/see-it-houthi-terrorist-group-unveils-solid-fuel-palestine-missile-that-resembles-iranian-hypersonic.html", "message": "Yemen’s Houthi rebels have unveiled a new, solid-fuel missile in their arsenal that resembles aspects of one earlier displayed by Iran that Tehran described as flying at hypersonic speeds.\nThe rebels fired its new “Palestine” missile, complete with a warhead painted like a Palestinian keffiyeh checkered scarf, at the southern Gulf of Aqaba port of Eilat in Israel on Monday.\nFor their part, the Houthis described the Palestine as a “locally made” missile.\nIranian media reported the launch of the Palestine and described it as locally manufactured, citing the Houthis.\nIn March, Russia’s state-run RIA Novosti news agency quoted an anonymous source claiming the Houthis had a hypersonic missile.", "location": "I did not find any specific location mentioned in the text.", "classification": "security", "score": 0.7105640736475648, "event_breakdown": "Event 1: Houthi fighters have fired their new “Palestine” missile at Eilat port in Israel."}, {"id": "8ec4e7c1-3248-4d20-be62-3cebd32dd6f8", "title": "Hezbollah Continues Striking Israeli Occupation Outposts near Lebanon Border", "date": "2024-06-07 18:45", "url": "https://english.almanar.com.lb/2127435", "message": "The Islamic Resistance continued on Friday striking the Israeli occupation outposts near Lebanon border, inflicting more losses upon the enemy troops.\nThe Islamic Resistance fighters targeted Al-Ramtha site in the occupied Lebanese Kfar Shuba hills with rocket weapons, hitting it directly.\nAt 18:05, the Islamic Resistance fighters targeted newly established surveillance equipment at Al-Mutela site with appropriate weapons, hitting and destroying them directly.\nAt 15:25, the Islamic Resistance fighters targeted the surveillance equipment at Al-Raheb site with appropriate weapons, hitting and destroying them directly.\nAt 23:15, the Islamic Resistance fighters targeted an “Israeli” soldier deployment around Zar’it barracks with artillery shells, hitting it directly.", "location": "The Islamic Resistance fighters targeted the newly established surveillance equipment at Al-Mutela site.", "classification": "security", "score": 0.9862455147156727, "event_breakdown": "18:05: The Islamic Resistance fighters targeted Al-Ramtha site in the occupied Lebanese Kfar Shuba hills with rocket weapons, hitting it\ndirectly.\n15:25: At 18:05, the Islamic Resistance fighters targeted newly established surveillance equipment at Al-Mutela site with appropriate weapons, hitting and\ndestroying them directly.\n23:15: The Islamic Resistance fighters targeted an “Israeli” soldier deployment around Zar’it barracks with artillery shells, hitting it directly."}, {"id": "292b6a7f-4aec-4081-9174-64dfda81d893", "title": "Death toll from Ukraine shelling of Lugansk rises to 4 with 43 injured", "date": "2024-06-07 16:30", "url": "https://tass.com/politics/1800741", "message": "The death toll after shelling of Lugansk by the Ukrainian armed forces has risen to four, 43 people were injured, including four children, the Lugansk People's Republic government reported on its Telegram channel.\n\"According to the latest reports, 43 people were injured as a result of a missile strike on Lugansk, including four children.\nUkraine's armed forces shelled civilian objects in Lugansk, firing five missiles, four of which were shot down.\nThe number of people injured in the Ukrainian armed forces' strike on Lugansk has reached 43, including four children and four dead.\nThe head of the republic, Leonid Pasechnik, said that the Ukrainian attack damaged more than 30 multi-story apartment buildings in the eastern part of Lugansk.", "location": "LUGANSK", "classification": "security", "score": 0.9915140780023934, "event_breakdown": "Target event - news push that reports four dead and 43 injured in the Ukrainian armed forces' strike on Lugansk"}, {"id": "6ff0f423-2cab-494f-86a1-b99efe32199b", "title": "Salford shooting victim discharged from hospital as man arrested on suspicion of attempt murder", "date": "2024-06-07 15:45", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/salford-shooting-victim-discharged-hospital-29313805", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nSign up to the MySalford newsletter to keep up with what's happening in and around the citySomething went wrong, please try again later.\nThe man has now been discharged from hospital, a spokesman for Greater Manchester Police confirmed on Friday as detectives made an arrest.\nTwo men were initially arrested on suspicion of attempted murder but were later released on bail.", "location": "Salford", "classification": "security", "score": 0.8747987864495238, "event_breakdown": "Security Event 1: Attempted Murder Investigation Leads to Arrest \nAt approximately 3:00 PM on Friday on Kings Road in Salford, Greater Manchester, detectives from the Greater Manchester Police arrested a man and a woman on suspicion of conspiracy to attempted murder. The victim, a 27-year-old man, was stabbed in the back more than 15 times after an argument with the suspect. He was rushed to the Salford Royal Hospital in critical condition, but has since been discharged. Authorities have not released the names of the suspects. \nThe event occurred on Kings Road in Salford and was reported by the Manchester Evening News."}, {"id": "b9d78a00-36ec-4d95-a999-492949ea51ca", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:30", "url": "https://www.weaa.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "Killed at least 32 people, including seven children, Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza. Pentagon official said Israel used bomb improperly because it should have caused low collateral damage but caused a high number of casualties."}, {"id": "75e9d415-c854-4426-b08e-d888dafe696a", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.ijpr.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": "GAZA CITY", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "Gaza attack kills at least 32.  The Pentagon accuses Israel of misusing the bomb.  US military base al-Tanf was attacked in Syria.  Russia invades Ukraine."}, {"id": "838cec3a-b091-4af9-997e-1dfbeaacfb72", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 02:15", "url": "https://www.wutc.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, spokesman for the Al-Aqsa Martyrs Hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza.", "location": ")\nGAZA", "classification": "security", "score": 0.9886145563176003, "event_breakdown": "Gaza - On Thursday, an Israeli airstrike on a U.N. school compound in Gaza killed at least 32 people, including seven children, and injured 50. The strike also destroyed a U.N.-run elementary school.\n\nAfghanistan - The International Security Assistance Force (ISAF) has confirmed that one of its service members was killed in an attack by insurgents in eastern Afghanistan on Wednesday. The attack also killed a civilian and injured three others, including two children."}, {"id": "3a1db6e4-a275-47cd-92e4-9f1e629767a3", "title": "Houthi Group Claims Joint Aerial Attack With Iraqi Group Against Israeli Ships To Protest Gaza War", "date": "2024-06-07 04:30", "url": "https://www.outlookindia.com/international/yemen-houth-rebel-iraqi-group-attack-ships-haifa-post-israel-denies", "message": "Houthi rebels in Yemen may be running through their supplies of drone swarms and anti-ship ballistic missiles Photo: APHouthi rebels in Yemen may be running through their supplies of drone swarms and anti-ship ballistic missiles Photo: AP", "location": "SANA'A, Yemen", "classification": "security", "score": 0.9386145235412601, "event_breakdown": "Houthi rebels in Yemen may be running through their supplies of drone swarms and anti-ship ballistic missiles. Saudi-led coalition forces claimed to have shot down a Houthi drone targeting the Kingdom on Saturday, according to Al-Arabiya TV. The Houthis said that they had launched a ballistic missile attack on a Saudi Aramco facility in Ras Tanura, as well as a navy facility in Dammam."}, {"id": "ace7c9ea-0b36-4d0f-aaf4-b5dbdf1c925a", "title": "Gaza town says mayor killed in Israeli strike on water station", "date": "2024-06-07 17:45", "url": "https://www.al-monitor.com/originals/2024/06/gaza-town-says-mayor-killed-israeli-strike-water-station", "message": "June 7, 2024 — Deir el-Balah (Palestinian Territories) (AFP)A spokesman for the Nuseirat municipality in central Gaza said Friday that the town's mayor, Iyad al-Maghari, had been killed in an Israeli strike while visiting a water pumping station.\nThe Israeli army said it was aware of reports that Maghari had been killed in the strike and said he was a Hamas operative.\nOne resident, Ibrahim al-Hur, told AFP: \"We heard several explosions, and we were surprised that the explosions were right next to us, in the nearby water station.\"\nIsrael's retaliatory offensive has killed at least 36,731 people in Gaza, also mostly civilians, according to the Hamas-run territory's health ministry.\nThe violence has left much of Gaza in ruins, and an Israeli siege on the territory has led to dire shortages of clean water and other basic needs.", "location": "GAZA", "classification": "security", "score": 0.9159415102719383, "event_breakdown": "* Israeli strike kills Palestinian mayor in Gaza water station\n* Israel kills Hamas operative in Gaza"}, {"id": "2743fcfd-7af6-4b29-b100-d52a11d5288c", "title": "A Look into Israeli Iron Dome Launcher Dented by Hezbollah Missile", "date": "2024-06-07 15:15", "url": "https://english.almanar.com.lb/2127479", "message": "Do you believe that the Zionist attack on Rafah:An imminent threatAbsurd propagandaA pressure tactic for negotiations Show Results", "location": "Based on the text you provided, I was unable to come up with an answer.", "classification": "security", "score": 0.5704010030299059, "event_breakdown": "The Zionist attack on Rafah:\nA pressure tactic for negotiations"}, {"id": "21587798-065f-4eec-ae9f-26f0a7e3815a", "title": "Israel pounds Gaza refugee camp as war enters ninth month", "date": "2024-06-07 16:00", "url": "https://www.yahoo.com/news/israel-pounds-gaza-refugee-camp-150107432.html", "message": "Palestinians watch smoke billowing following an Israeli air strike in Deir al-Balah (Bashar TALEB)Israeli forces bombarded a Gaza refugee camp Friday after a deadly strike on a UN-school there, as the war sparked by Hamas's unprecedented attack on Israel entered its ninth month.\nAs Gaza faced Israeli attacks from land, sea, and air on Friday, witnesses said the Nuseirat camp in central Gaza was hit again, a day after the Israeli strike on the UN-run school.\nThe army said the strike targeted Hamas militants operating from a container on the northern Gaza school grounds.\nA separate Israeli strike late Thursday killed Nuseirat mayor Iyad al-Mughari as he visited a water pumping station, a municipality spokesman said Friday.\nWitnesses also reported Israeli strikes east of Deir al-Balah and intensive fire near the Bureij camp.", "location": "GAZA", "classification": "security", "score": 0.9256530198627205, "event_breakdown": "Target Event:\nIsraeli air strikes hit Gaza refugee camp during ongoing conflict with Hamas"}, {"id": "669bb1f6-8ff8-43b1-9dc3-158823d4f570", "title": "Israel pounds Gaza refugee camp as war enters ninth month", "date": "2024-06-07 16:30", "url": "https://www.guampdn.com/news/national/israel-pounds-gaza-refugee-camp-as-war-enters-ninth-month/article_31fde40f-208e-59b9-a504-8b8507512b2e.html", "message": "Israeli forces bombarded a Gaza refugee camp on Friday after a deadly strike on a UN-run school there, as the war sparked by Hamas's unprecedented attack on Israel entered its ninth month.\nAl-Aqsa Martyrs hospital in Deir al-Balah, central Gaza, said at least 37 people were killed in Thursday's Israeli strike on the UN-run school in Nuseirat camp.\nA day after the school was struck, eyewitnesses said the Nuseirat refugee camp came under attack again as Gaza faced Israeli attacks from land, sea, and air.\nThe Israeli military said it \"eliminated dozens of terrorists\" in eastern Bureij and Deir al-Balah.\nSix people were killed and several wounded in an Israeli strike on the Wafati home in Maghazi camp, said a source at Al-Aqsa Martyrs hospital.", "location": "The focus of this event is the Nuseirat refugee camp in Gaza.", "classification": "security", "score": 0.9760278628640168, "event_breakdown": "Israeli forces bombarded a Gaza refugee camp on Friday after a deadly strike on a UN-run school there as the war sparked by Hamas's unprecedented attack on Israel entered its ninth month, leaving six people dead and several wounded in an Israeli strike on the Wafati home in Maghazi camp."}, {"id": "a9f3049a-bc5d-4393-97f1-799e3feae131", "title": "Dozens reported killed in Israeli strike on UN school in Gaza - World", "date": "2024-06-07 04:45", "url": "https://www.brecorder.com/news/40307328/dozens-reported-killed-in-israeli-strike-on-un-school-in-gaza", "message": "Ismail Al-Thawabta, the director of the Hamas-run government media office, rejected Israel’s assertion that the UN school in Nuseirat, in central Gaza, had hidden a Hamas command post.\nIsrael says jets strike school containing Hamas compound, Gaza media says 27 killed“The occupation uses ... false fabricated stories to justify the brutal crime it conducted against dozens of displaced people,” Thawabta told Reuters.\nCEASEFIRE EFFORTSIsrael announced a new military campaign in central Gaza on Wednesday as it battles fighters relying on hit-and-run insurgency tactics.\nIn another sensitive development, the Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire.\nOn Wednesday, the Israeli military said it was setting up a quick-response commando unit made up of border residents as a precaution against further armed incursions.", "location": "Gaza", "classification": "security", "score": 0.8627244016389107, "event_breakdown": "IDF strikes Hamas posts in Gaza\nA new military campaign was launched in central Gaza as the Israel Defense Forces (IDF) battled fighters relying on hit-and-run insurgency tactics, Reuters reported. In another development, the Israeli military reported a rare attack near the Israel-Gaza border, where a squad of Palestinian fighters killed a soldier and three of them were killed in return fire. You can find the exact location of Gaza on the map below:"}, {"id": "3dcd2082-793a-485d-9ed7-a362a3c7df59", "title": "Israel bombs Hamas hideout in Gaza refugee camp as war enters ninth month", "date": "2024-06-07 16:15", "url": "https://www.firstpost.com/world/israel-bombs-hamas-hideout-in-gaza-refugee-camp-as-war-enters-ninth-month-13779951.html", "message": "Israeli warships bombarded residences in the fishermen’s port region west of Gaza City, among other areas, according to an AFP correspondent.\nOne day after the school attack, witnesses reported that Israeli artillery bombardment and airstrikes resumed near the Nuseirat refugee camp.\nThe Isa family home near a medical facility in the Bureij refugee camp was hit, according to a medical source at Al-Aqsa Martyrs Hospital, leaving multiple people wounded.\nA medical source at Baptist Hospital in Gaza City confirmed casualties following an Israeli missile assault on the Ashram family residence near the Al-Salam mosque.\nAdvertisementAccording to a medical source at Al-Aqsa Martyrs hospital, an Israeli hit on the Wafati home in Maghazi camp resulted in six fatalities and multiple injuries.", "location": "GAZA CITY", "classification": "security", "score": 0.9846314068869984, "event_breakdown": "Israeli warships bombarded residences in the fishermen’s port region west of Gaza City, artillery bombarded residences near the Nuseirat refugee camp and airstrikes resumed near the Nuseirat refugee camp."}, {"id": "b4b35d0c-65ce-46b5-9984-4f367cc981f7", "title": "Fire caused by Russian strike successfully extinguished at Kyiv Oblast industrial facility", "date": "2024-06-07 18:30", "url": "https://www.yahoo.com/news/fire-caused-russian-strike-successfully-153733904.html", "message": "Firefighters dealing with the aftermath of the Russian attack on Kyiv Oblast.\nPhoto: Ukraine’s State Emergency ServiceA fire at an industrial facility in Kyiv Oblast, which had been sparked by a Russian missile attack overnight, has been put out.\nSource: Ukraine's State Emergency ServiceQuote: \"The fire that had started due to the overnight enemy attack was extinguished at 17:00.\nBackground:On the night of 6-7 June, Russian forces launched another combined attack on the territory of Ukraine.\nA fire broke out at an industrial facility in Kyiv Oblast.", "location": "KYIV OBLAST", "classification": "security", "score": 0.7302998037770719, "event_breakdown": "Firefighters have extinguished a fire at an industrial facility in Kyiv Oblast, which had been sparked by a Russian missile attack overnight."}, {"id": "d5ccd74b-6fa2-48b7-a3c3-60382ba0dc69", "title": "San Jose : Woman arrested in fatal stabbing near downtown", "date": "2024-06-07 17:45", "url": "https://www.mercurynews.com/2024/06/07/san-jose-woman-arrested-in-fatal-stabbing-near-downtown/", "message": "SAN JOSE — A woman has been arrested and charged with murder in the fatal stabbing of a man near downtown San Jose this past weekend, police said.\nSylvia Ortega, 28, a San Jose resident, was arrested Wednesday at a home in the city, according to a San Jose Police Department news release.\nRecords show that Ortega was booked into the Elmwood women’s jail in Milpitas, where she was initially being held without bail.\nShe was charged Friday and was scheduled to be arraigned that afternoon in a San Jose courtroom.\nAnyone with information about Sunday’s homicide can contact the SJPD homicide unit at 408-277-5283 or email Detective Sgt.", "location": "SAN JOSE", "classification": "security", "score": 0.6186924642375965, "event_breakdown": "The target event is related to security and is happening in the current time frame. It focuses on the arrest of Sylvia Ortega for murder in the fatal stabbing of a man near downtown San Jose this past weekend, according to a news release from the San Jose Police Department."}, {"id": "84b99553-d12c-450d-aa00-4b68e2f32557", "title": "US Bombers Drop Live Munitions In Threat To North Korea", "date": "2024-06-07 18:45", "url": "https://www.zerohedge.com/geopolitical/us-bombers-drop-live-munitions-threat-north-korea", "message": "The American B-1Bs and two South Korean fighter jets dropped live GBU-38, 500-pound Joint Direct Attack Munitions (JDAMS) on test targets in South Korea.\n\"This training showcases the incredible capabilities of our combined forces to simultaneously strike multiple targets in a contested environment,\" said Lt. Gen. David Iverson, US Force Korea deputy commander and Seventh Air Force commander.\nIn addition to the live test bombing, the US and South Korean air forces conducted yet another round of joint war games.\nNorth Korea has conducted record numbers of weapons tests in recent years – including intercontinental ballistic missiles (ICMBs) – while the US and South Korea engaged in historic war games.\nU.S. drops precision-guided bomb in joint drills with South Korea.", "location": "South Korea", "classification": "security", "score": 0.49381605892708935, "event_breakdown": "US-South Korea joint drills, North Korea ICBM test, US drops precision-guided bomb in joint drills with South Korea"}, {"id": "049a42a0-670b-479f-addd-a1cfe85dfde6", "title": "Israel - Gaza live updates : Dozens killed in IDF strike on UN school , agency says", "date": "2024-06-07 15:45", "url": "https://www.wjnt.com/syndicated-article/?id=1568164", "message": "ABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.\nIDF officials said the strike had targeted “significant Hamas terrorists” who were operating in a Hamas compound.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating.", "location": "Rafah", "classification": "security", "score": 0.5805085379903016, "event_breakdown": "IDF aircraft struck a Hamas compound in Rafah on Sunday."}, {"id": "914ea7e7-2fa9-4e90-9d05-e773ab23270b", "title": "Israel - Gaza live updates : Dozens killed in IDF strike on UN school , agency says", "date": "2024-06-07 15:15", "url": "https://www.amazingmadison.com/syndicated-article/?id=1568164", "message": "ABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.\nIDF officials said the strike had targeted “significant Hamas terrorists” who were operating in a Hamas compound.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating.", "location": "GAZA", "classification": "security", "score": 0.5805085379903016, "event_breakdown": "IDF aircraft struck Hamas compounds in Rafah on Sunday, killing 45 people and injuring 249."}, {"id": "56198f65-54e4-4d04-a0dc-7a78f2b3b797", "title": "Israel - Gaza live updates : Dozens killed in IDF strike on UN school , agency says", "date": "2024-06-07 16:00", "url": "https://www.kdks.fm/syndicated-article/?id=1568164", "message": "ABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.\nIDF officials said the strike had targeted “significant Hamas terrorists” who were operating in a Hamas compound.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating.", "location": "Rafah - a city in the southern part of the Gaza Strip on the border of Egypt.", "classification": "security", "score": 0.5805085379903016, "event_breakdown": "IDF conducted airstrike in Rafah, Gaza, targeting Hamas terrorists\nDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry says"}, {"id": "8cd1fe62-f4d7-467f-bfc7-468bfb46b769", "title": "Israel - Gaza live updates : Dozens killed in IDF strike on UN school , agency says", "date": "2024-06-07 16:30", "url": "https://www.northwestmoinfo.com/syndicated-article/?id=1568164", "message": "ABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.\nIDF officials said the strike had targeted “significant Hamas terrorists” who were operating in a Hamas compound.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating.", "location": "Gaza", "classification": "security", "score": 0.5805085379903016, "event_breakdown": "IDF aircraft struck Hamas compound in Rafah on May 26, AEST."}, {"id": "8c67e6c1-0907-473a-b753-11554110b2c9", "title": "Israel - Gaza live updates : Dozens killed in IDF strike on UN school , agency says", "date": "2024-06-07 17:15", "url": "https://www.wjol.com/syndicated-article/?id=1568164", "message": "ABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.\nIDF officials said the strike had targeted “significant Hamas terrorists” who were operating in a Hamas compound.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating.", "location": "GAZA", "classification": "security", "score": 0.5805085379903016, "event_breakdown": "Dozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry says\nIDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "d376e61b-21f3-4019-80e6-79864d618ce5", "title": "HIMARS Hit Large Russian Base In South", "date": "2024-06-07 11:00", "url": "https://charter97.org/en/news/2024/6/7/598003/", "message": "HIMARS Hit Large Russian Base In South 1 7.06.2024, 9:5813,954Dugouts and hardware were destroyed.\nIt was loud in the Southern direction of the Russian occupiers.\nHIMARS hit their location.\nThe SOF detected the positions of the Russians and directed HIMARS fire at the location of the Russians on this section of the front.\nThe SOF operators corrected the fire of HIMARS missile-artillery unit of the Defence Forces on the enemy target,’ the report said.", "location": "NULL", "classification": "security", "score": 0.9487902491375111, "event_breakdown": "['HIMARS Hit Large Russian Base In South', 'Dugouts and hardware were destroyed. The SOF detected the positions of the Russians and directed HIMARS fire at the location of the Russians on this section of the front.']"}, {"id": "58c274ee-135c-4fe7-a65f-103161180fde", "title": "Israeli Strikes Hit Refugee Camp In Gaza One Day After School Attack", "date": "2024-06-07 17:15", "url": "https://www.timesnownews.com/world/middle-east/israeli-strikes-hit-refugee-camp-in-gaza-one-day-after-school-attack-article-110799145", "message": "Israeli Strikes Hit Refugee Camp In Gaza After School Attack (Representational Image) Photo : APGaza: Israeli strike hit a Gaza refugee camp on Friday after a deadly strike on a UN-run school.\nThe Israeli strikes on Friday targeted several areas across the Gaza Strip.\nAccording to eyewitnesses, a day after Israel's strikes hit a school, the Nuseirat refugee camp was hit by artillery shelling and air strikes, reported AFP.\nAccording to medical source at Al-Aqsa Martyrs Hospital, an Isa family home near a medical centre in Bureij refugee camp was also targeted.\nAccording to a medical source at Baptist hospital, casualties were reported after an Israeli strike on the Ashram family home near Al-Salam mosque.", "location": "GAZA", "classification": "security", "score": 0.9634629162141588, "event_breakdown": "Israeli strikes hit a Palestinian refugee camp in Gaza after a deadly strike on a UN-run school. The strikes targeted several areas across the Gaza Strip on Friday. According to eyewitnesses, the Nuseirat refugee camp was hit by artillery shelling and air strikes, reported AFP. According to a medical source at Al-Aqsa Martyrs Hospital, an Isa family home near a medical centre in Bureij refugee camp was also targeted. According to a medical source at Baptist hospital, casualties were reported after an Israeli strike on the Ashram family home near Al-Salam mosque."}, {"id": "8b8ceab4-5996-45bd-a419-c111cceadb64", "title": "Will North Korea fly trash balloons into South Korea again ? At look at rising tensions between them", "date": "2024-06-07 09:15", "url": "https://www.startribune.com/will-north-korea-fly-trash-balloons-into-south-korea-again-at-look-at-rising-tensions-between-them/600371736/", "message": "SEOUL, South Korea — South Koreans were alert Friday for possible new launches by North Korea of balloons carrying rubbish into the South, a day after Seoul activists flew their own balloons to scatter political leaflets in the North.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations ''absurd, irrational'' and vowed ''unbearable'' retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nBut the North Korean balloons sent into South Korea in recent days carried only garbage, not political leaflets.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire.", "location": "SEOUL, South Korea.", "classification": "security", "score": 0.7134438052836866, "event_breakdown": "Title: South Koreans wary of possible North Korean balloon launches\nLocation: South Korea\nDate: 2022-06-18\n\nSouth Koreans were alert on Friday for possible new launches by North Korea of balloons carrying rubbish into the South.\n\nquoting an official: \"The North Korean balloon campaign and other recent provocations are \"absurd, irrational,\" vowing \"unbearable\" retaliation.\"\n\nBut North Korea's balloons sent into South Korea in recent days carried only garbage, not political leaflets."}, {"id": "9a8451c4-a3ca-427d-a32d-d0da1c798529", "title": "Toy dog returned to grave of 21 - year - old Ukrainian soldier Hrinka after his mom pleas", "date": "2024-06-07 16:45", "url": "https://www.yahoo.com/news/toy-dog-returned-grave-21-144055402.html", "message": "A stolen toy dog was returned to the grave of a 21-year-old defender of the Azovstal plant after his mom’s plea.\nPhoto: ANNATOLLILVNA_1984A toy dog, which is a family heirloom, has been returned to the grave of Nazarii Hryntsevych, alias Hrinka (\"Toast\"), a fallen Ukrainian soldier from the Azov regiment.\nMariana, Nazarii’s mom, bought this toy dog with her first paycheck when the boy was a year and a half old.\nWhen the 21-year-old defender of the Azovstal plant in the city of Mariupol died in combat, she placed the toy on his grave.\nI earned a salary of 700 hryvnias [about US$17] and bought a [toy] dog which cost 500 hryvnias for him.", "location": "MARIUPOL", "classification": "security", "score": 0.6550481497757973, "event_breakdown": "1. Russian forces bombed the village of Vremivka, Sumy Oblast, Ukraine, on June 27, 2022.\n\nSource: Governor of Sumy region on Telegram\n\nTitle: Russian fascists bombed Vremivka village\n\nRussian fascists bombed the village of Vremivka in the Sumy region overnight into Tuesday morning. Another civilian was killed and three more were wounded. One person has been taken to hospital in an emergency condition."}, {"id": "6961674f-cfff-4d9b-a0e5-00205675b6ae", "title": "Armor : American M1 Tank Seeks Purpose", "date": "2024-06-07 08:15", "url": "http://www.strategypage.com/%5Chtmw%5Chtarm%5Carticles%5C202406060758.aspx", "message": "The war in Ukraine has made it easier for the U.S. Army to get all the money wanted for upgrades to the American M1 tank force.\nThe army had already developed and scrutinized a new SEP (System Enhancement Package) update called SEP4 (or SEPV4) for its M1 tanks.\nThe M1 is an old design with the first of 3,273 M1 tanks produced in 1978.\nSo far over 10,000 American M1 tanks have been produced and most of them subsequently updated at least once, mainly in the 1990s.\nThe army is planning to maintain and upgrade its M1 tank fleet of 7,000 vehicles into the 2030s.", "location": "WASHINGTON D.C.", "classification": "security", "score": 0.5132178503669156, "event_breakdown": "M1 tanks serve with the U.S. Army in over 20 nations.\nThey are particularly useful in South Korea.\nThe Army, advised by the tankers who teach tank crew how to handle their M1s in training classes, can make more efficient via successive upgrades to these war machines."}]