[{"id": "ca131b31-6192-4eab-a4b8-c5922a8b3211", "title": "Nashville peace rally denounces increased presence of neo - Nazi groups", "date": "2024-07-22 11:00", "url": "https://www.yahoo.com/news/nashville-peace-rally-denounces-increased-100711384.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "In response to more frequent appearances of white supremacist and neo-Nazi groups in downtown Nashville over the past month, the Jewish Federation of Greater Nashville held a joyful pro-peace rally on the steps of the Bicentennial Park Amphitheatre on Sunday afternoon.\nJewish Federation President Leslie Kirby opened the event with a direct message to the persistent neo-Nazi groups.\nOpinion: She took on Neo Nazis and hate groups.\nCommunity members attend the Jewish Federation of Greater Nashville, “Nashville Together” event at Bicentennial Park in Nashville , Tenn., Sunday, July 21, 2024.\nReach Angele Latham by email at alatham@gannett.com, by phone at 931-623-9485, or follow her on Twitter at @angele_lathamThis article originally appeared on Nashville Tennessean: Nashville peace rally denounces increased presence of neo-Nazi groups", "location": "Bicentennial Park", "classification": "antisemitism", "score": 0.9048453473509998, "event_breakdown": "The local Jewish Federation of Greater Nashville organized a joyful pro-peace rally as a response to increased appearances of white supremacist and neo-Nazi groups in the Downtown area of Nashville over the past month. The Federation's President invited many community members to denounce the activities of Neo Nazis and Neo-Nazi groups. According to NEODYMIUM in Brasilia, recently, a woman identified as N.NESTAD was arrested for anti-Semitic crimes in Brazil. N.NESTAD faces charges for creating fake accounts and spreading anti-Semitic slurs against Jewish people."}, {"id": "25adc05d-7346-4fff-ba31-26d4073d0a83", "title": "How Kamala Harris inherited Biden Israel dilemma", "date": "2024-07-22 23:30", "url": "https://wjla.com/news/nation-world/how-kamala-harris-inherited-bidens-israel-dilemma-trump-biden-president-white-house-2024-election-race-israeli-gaza-benjamin-netanyahu-zionism-zionist-palestine-gaza-war-hamas-terrorists-invasion-october-7-genocide-joe", "domain": "wjla.com", "domain_classification": "Unknown", "message": "Vice President Kamala Harris's stance on the Israel-Hamas war is under the microscope as she prepares for 100 days of campaigning against former President Donald Trump.\nProgressives have criticized President Joe Biden's support for Israel since the October 7 terrorist attack on the Jewish state.\nWe are a civil society, law and order must prevail.”Meanwhile, in June, Harris took a different stance during an interview with the progressive magazine, The Nation.\nProgressive groups have wasted no time lobbying Harris to pivot further to the left than Biden on the issue of Israel.\n“Now, it’s crucial for Vice President Harris to take a clear stance against weapons for Israel’s war and occupation against Palestinians.\"", "location": "Israel", "classification": "antisemitism", "score": 0.4906577225687651, "event_breakdown": "1. On May 13, 2021, antisemitic slogans such as \"Closed,\" \"Get Out,\" \"Scattered Trash,\" \"Death to Jews,\" were found on a local pharmacy in Kyiv, Ukraine.\n2. On May 13, 2021, Aliza Abusch, CEO of the Jewish Burial Society, reported an attack by a far-right group at Tahara funeral home in La Courneuve, outside Paris, that involved cries about ''murdering Jews.''\n3. On May 12, 2021, anti-Semitic graffiti was discovered on a wall in the neighborhood of Saint-Paul, Rennes, France. The graffiti said \"dirty Jews,\" \"Star of David = murderers,\" and \"free Palestine.\"\n4. On May 12, 2021, members of the La Meute far-right group screamed and kicked at the door, demanding that they provide vaccines against COVID-19, in the attack on Tahara funeral home in La Courneuve."}, {"id": "9b4d9142-0d49-4202-a1a4-e9606a9ccc1e", "title": "How Kamala Harris inherited Biden Israel dilemma", "date": "2024-07-22 22:30", "url": "https://ktvo.com/news/nation-world/how-kamala-harris-inherited-bidens-israel-dilemma-trump-biden-president-white-house-2024-election-race-israeli-gaza-benjamin-netanyahu-zionism-zionist-palestine-gaza-war-hamas-terrorists-invasion-october-7-genocide-joe", "domain": "ktvo.com", "domain_classification": "Unknown", "message": "Vice President Kamala Harris's stance on the Israel-Hamas war is under the microscope as she prepares for 100 days of campaigning against former President Donald Trump.\nProgressives have criticized President Joe Biden's support for Israel since the October 7 terrorist attack on the Jewish state.\nWe are a civil society, law and order must prevail.”Meanwhile, in June, Harris took a different stance during an interview with the progressive magazine, The Nation.\nProgressive groups have wasted no time lobbying Harris to pivot further to the left than Biden on the issue of Israel.\n“Now, it’s crucial for Vice President Harris to take a clear stance against weapons for Israel’s war and occupation against Palestinians.\"", "location": "Israel", "classification": "antisemitism", "score": 0.4906577225687651, "event_breakdown": "April 7, 2022: Neo-Nazi pamphlets, some of which made reference to Charlottesville's deadly August 2017 rally where 32-year-old Heather Heyer was killed, were left in driveways in Beverly Hills, California neighborhoods last week. A few pamphlets were left in a parking garage at a local mall, as well.\n\nThe tract reportedly referenced the holiday of Purim, which was last Sunday\n\n\"These disturbing messages of hate and intolerance have no place in our country or city,\" Beverly Hills Mayor Lili Bosse wrote in a statement. \"We stand united against all forms of hate and encourage everyone to oppose hatred and report incidents to the authorities. We are coordinating with the Beverly Hills PD to fully investigate and make sure those responsible are held accountable.\"\n\nOther fliers contained the phrase \"we must secure the existence of our people and a future for white children.\"\n\nBosse said that the fliers appear to be linked to a group called the Goyim Defense League, a loosely organized network of individuals associated [with] known neo-Nazis such as members associated with the Rise Above Movement, a white supremacist group that advocates violent racism, promotes anti-Semitic conspiracy theories and trains for acts of violence.\n\nThe flyers and stickers disseminated by the hate group have been found across the country. According to the ADL, the GDL (Goyim Defense League) spreads \"racist, antisemitic and anti-government\" propaganda.\n\nThe Beverly Hills Police Department has asked residents to call the Beverly Hills PD at 310-550-5536 to report any information about these pamphlets or any other incidents involving the distribution of such material"}]