[{"id": "741c3a9d-4077-432e-ac21-391ecbaa65e1", "title": "Anti - Palestinian discrimination investigation opens at UNC following complaint", "date": "2024-06-04 03:45", "url": "https://www.dailytarheel.com/article/2024/06/university-title-vi-investigation-anti-palestinian-discrimination", "message": "Khalili wrote that this email failed to acknowledge Israel's violence against Palestinians and address Islamophobia or Palestinians by name, while it did address antisemitism and Israel.\nA counter protester, UNC religious studies professor, began shouting “Nazis” at the protestors supporting Palestine and was escorted away by UNC Police.\nKhalili wrote that while the incident was reported to UNC’s Equal Opportunity and Compliance Office, all complaints were dismissed.\nSUBSCRIBE NOWProposed remediesWithin the complaint, Khalili called for the OCR to review and establish ongoing monitoring of the actions UNC takes in response to complaints of discrimination against Palestinian students.\nAn investigation into the discrimination of Jewish students at the University is also currently being conducted by the OCR.", "location": "NULL", "classification": "antisemitism", "score": 0.8516231289866031, "event_breakdown": "1. On May 12, 2022, four Jewish students were attacked while surfing in Malibu, California. The attackers were reportedly yelling antisemitic slurs.2. On May 22, 2022, a group of protestors supporting the Boycott, Divestment, and Sanctions (BDS) movement against Israel gathered in New York City. The protestors reportedly called for the destruction of the State of Israel.3. On May 22, 2022, a group of protestors supporting the BDS movement against Israel gathered in Los Angeles, California. The protestors reportedly called for the destruction of the State of Israel.4. On May 22, 2022, a group of protestors supporting the BDS movement against Israel gathered in Chicago, Illinois. The protestors reportedly called for the destruction of the State of Israel.5. On May 22, 2022, a group of protestors supporting the BDS movement against Israel gathered in Seattle, Washington. The protestors reportedly called for the destruction of the State of Israel."}, {"id": "d8525af3-4af2-441b-8f62-26718fd23479", "title": "Terrorism and the Israel - Palestine conflict", "date": "2024-06-04 08:15", "url": "https://independentaustralia.net/politics/politics-display/terrorism-and-the-israel-palestine-conflict,18653", "message": "The history of the Israel-Palestine conflict makes clear that we have not learned from the horrors of the past, Dermot Daley writes.\nThe world recoiled at the use of explosives on civilian targets within the UK to create fear and awe.\nWhen, in 1948, a new Jewish State was created in Palestine – as with the 1917 Balfour Declaration – the existing populace was not consulted.\nPoliticians have rushed forward to claim that the actions of Hamas and the IDF cannot be compared.\nWe urgently need to redefine what constitutes terrorism and we must wash the blood off our hands and publicly step up as defenders of true justice.", "location": "Palestine", "classification": "antisemitism", "score": 0.6172971384148763, "event_breakdown": "Target Event: A news push that reports a current event of antisemitism that is happening in the UK and Europe.\nEvent Report:\nA news push that reports a current event of antisemitism that is happening in the UK and Europe:\nOn March 19, 2022, in Scotland, UK, individuals shouted antisemitic comments to a Jewish family while they were walking outside. Two adults and three children were verbally abused, including the family being called the \"Synagogue of Satan\". The victims reported the incident to the police, but their concern is that nothing will be done."}, {"id": "cdadcbde-9c44-48ea-8497-d15a32859e79", "title": "Community rallies for A . S . divestment resolution with market and march", "date": "2024-06-04 04:15", "url": "https://dailynexus.com/2024-06-03/community-rallies-for-a-s-divestment-resolution-with-market-and-march/", "message": "The efforts preluded a vote within the Associated Student Senate on a divestment resolution, rallying campus support for the University to cut ties to military contractors.\n“The People’s Market for Gaza” took place from 4-5 p.m. at People’s Park in Isla Vista with roughly 50 attendees.\nFrom People’s Park, organizers lead a procession of roughly 100 people toward the front of Embarcadero Hall.\nProtestors chanted at the guests, “Students, students we won’t rest, until UCSB Divests,” before continuing to Loma Pelona Center for the Senate meeting.\nEvent organizers gave instructions to event participants to sign up for public comment for the Senate meeting that night where senators would vote on a divestment resolution.", "location": "-\nPeople's Park in Isla Vista", "classification": "antisemitism", "score": 0.5541910970444839, "event_breakdown": "1. On Saturday, Feb. 3, a crowd of about 50 people gathered outside an H&M in midtown Manhattan to protest a recent advertisement showing a black child in a sweatshirt with the words “coolest monkey in the jungle” written across its front. Demonstrators called the slogan racist and accused the retailer of racism for its continued distribution of the hoodie online.\n2. Vandals struck two of a bas-relief of donor portraits at the Illinois Holocaust Museum and Education Center in Skokie. The vandals scratched out the donor names and wrote phrases including “people will forget,” “$,” and “seeker.” Police are continuing to investigate the incident.\n3. Leaving the “Boycott Israeli Blood Diamonds” leaflet at this store will draw a lot of attention to this issue."}, {"id": "109eb0bc-ffe5-4a3d-8320-f2791b43d137", "title": "Jewish writers boycotted during Israel - Hamas war - The Jerusalem Post", "date": "2024-06-04 10:45", "url": "https://www.jpost.com/international/article-804434", "message": "Does this little slice of the literary world even matter?It does.\nThe anti-Israel sentiment in the literary world could have a searing effect on Jewish literature.\nBut Jewish authors are still feeling unsafe.\nThey are endangering that which the literary world is supposed to hold most dear: the free exchange of ideas.\nIn a literary world allegedly dedicated to free speech, what great works of literature will be lost with this censorship?", "location": "Literary world", "classification": "antisemitism", "score": 0.41926838706563124, "event_breakdown": "1. On February 27, 2023, an unidentified individual threw an object through the glass front door of the Lethbridge Jewish Community Centre in the Canadian province of Alberta.\n2. On June 19, 2023, a Molotov cocktail was thrown at a synagogue in the San Diego County city of Poway, California.\n3. On October 3, 2023, swastikas and other antisemitic graffiti were scrawled on the walls of the Colorado Springs Jewish Community Center in Colorado.\n4. On December 10, 2023, eggs were thrown at a synagogue in the Cook County city of Chicago, Illinois.\n5. On February 17, 2024, an unidentified individual threw a rock through the front window of a synagogue in the Nassau County city of New Hyde Park, New York.\n6. On June 14, 2024, a synagogue in the Los Angeles County city of Northridge, California, was defaced with antisemitic graffiti.\n7. On November 11, 2024, an antisemitic symbol was spray-painted on the front door of a Jewish community center in the Miami-Dade city of North Miami Beach, Florida.\n8. On April 10, 2025, a synagogue in the Cache County city of Logan, Utah, was vandalized with antisemitic graffiti.\n9. On July 2, 2025, unidentified individuals spray-painted swastikas and other antisemitic graffiti at a synagogue"}]