[{"id": "e7e23e66-c02d-4bae-a7c0-aaf71c96d20a", "title": "Six killed , 100 wounded in Ukrainian drone and missile attacks , Russian authorities say - 24 - Jun - 2024", "date": "2024-06-24 01:30", "url": "https://home.nzcity.co.nz/news/article.aspx?id=401084&fm=psp,tst", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "Russian authorities say six people have been killed and over 100 wounded in Ukrainian drone and missile attacks on Sunday.\nIn Ukraine, the second day of Russia's aerial bombing of Kharkiv in the north-east killed at least one person.\nRussia's Defence Ministry said both Ukraine and the US bore \"responsibility for a deliberate missile strike on civilians\".\nOne killed, 11 wounded by Russian strikes on Kharkiv, official saysA fresh attack on Kharkiv killed at least one person and wounded 11 on Sunday, according to local officials.\nSunday's attacks came after Russia struck Kharkiv on Saturday afternoon with four aerial bombs, hitting a five-story residential building and killing three people.", "location": "Kharkiv", "classification": "security", "score": 0.9797650551805079, "event_breakdown": "* Russian authorities say six people have been killed and over 100 wounded in Ukrainian drone and missile attacks on Sunday.\n* In Ukraine, the second day of Russia's aerial bombing of Kharkiv in the north-east killed at least one person."}, {"id": "e199f6a0-3a19-4c1b-a994-3704d5c5f789", "title": "Six killed , 100 wounded in Ukrainian drone and missile attacks , Russian authorities say - 24 - Jun - 2024", "date": "2024-06-24 01:30", "url": "https://home.nzcity.co.nz/news/article.aspx?id=401084&fm=psp,tsf", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "Russian authorities say six people have been killed and over 100 wounded in Ukrainian drone and missile attacks on Sunday.\nIn Ukraine, the second day of Russia's aerial bombing of Kharkiv in the north-east killed at least one person.\nRussia's Defence Ministry said both Ukraine and the US bore \"responsibility for a deliberate missile strike on civilians\".\nOne killed, 11 wounded by Russian strikes on Kharkiv, official saysA fresh attack on Kharkiv killed at least one person and wounded 11 on Sunday, according to local officials.\nSunday's attacks came after Russia struck Kharkiv on Saturday afternoon with four aerial bombs, hitting a five-story residential building and killing three people.", "location": "Kharkiv", "classification": "security", "score": 0.9797650551805079, "event_breakdown": "Russian authorities say six people have been killed and over 100 wounded in Ukrainian drone and missile attacks on Sunday, according to a statement by the Russian Defense Ministry. In Ukraine, one person was killed in a second day of aerial bombing by Russia on Sunday in Kharkiv."}, {"id": "2ceb21f8-bcdd-4ccd-b986-a3ce4288c15c", "title": "Child dies , four injured in nomadic hut fire", "date": "2024-06-24 00:00", "url": "https://tribune.com.pk/story/2473396/child-dies-four-injured-in-nomadic-hut-fire", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Fire rages after a Russian missile strike, amid Russia's attack on Ukraine, in Kyiv, Ukraine in Kyiv, Ukraine January 2, 2024.\nThe injured, identified as Babu, Muhammad, Noor Bibi, and Shaista, wife of Lal Khan, were immediately rushed to DHQ Hospital for treatment.\nThey managed to control the fire and provided initial medical assistance to the injured before transferring them to the hospital.\nDeputy Commissioner Khalid Javaid Goraya visited the affected area and DHQ Hospital to oversee the treatment of the injured.\nThe DC also directed the medical superintendent to ensure all medical facilities and free treatment for the injured.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.8897215071040164, "event_breakdown": "Target event - A Russian missile strike killed and injured several people in the Babu area of Kyiv, Ukraine on January 2, 2024."}, {"id": "5c0ba2e4-a54c-4d4c-941a-944040de4e65", "title": "Russia points finger at US for deadly Ukrainian attack on Crimea", "date": "2024-06-24 01:00", "url": "https://www.foxnews.com/world/russia-blames-us-after-ukrainian-attack-crimea-leaves-several-dead-wounded", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Russian authorities say the U.S. is responsible for a deadly Ukrainian attack on the Crimean Peninsula on Sunday.\nThe Russian Defense Ministry said four Army Tactical Missile System (ATACMS) missiles, which the U.S. supplied to Ukraine, were equipped with cluster warheads.\nThe missiles were shot down by air defense systems, the ministry said, while a fifth missile was detonated midair.\nRUSSIA ‘OPEN TO DIALOGUE’ WITH US: KREMLINMikhail Razvozhayev, the Moscow-installed governor of the city of Sevastopol, said 151 people were wounded in the incident.\nEarlier this year, the U.S. started supplying Ukraine with ATACMS missiles, giving the country the ability to strike targets within a 186-mile range.", "location": "CRIMEA", "classification": "security", "score": 0.5875513591511898, "event_breakdown": "Four Army Tactical Missile System (ATACMS) missiles were fired at the Crimean peninsula by the US-backed Ukrainian forces on Sunday. Ukraine says the missiles were aimed at military targets, but Russia said the missiles were equipped with cluster warheads. Two of the missiles were shot down by Russian air defense systems and a third was detonated midair, but a fifth missile, which was the one that was shot down, landed in an area to the west of the Black Sea resort of Sochi. The Russian Ministry of Defense said 151 people were injured in the attack, which it says proves that the U.S. is supplying Ukraine with weapons."}, {"id": "946eab7e-035c-481b-a6d8-ee9c612fed4e", "title": "Russia says US is responsible for deadly Ukrainian attack on Crimea", "date": "2024-06-24 04:00", "url": "https://www.koreatimes.co.kr:443/www/world/2024/06/501_377258.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "Russia said on Sunday that the United States was responsible for a Ukrainian attack on the Russian-annexed Crimean Peninsula with five U.S.-supplied missiles that killed four people, including two children, and injured 151 more.\nFootage on Russian state television showed people running from a beach and some people being carried off on sun loungers.\nThe Defense Ministry said U.S. specialists had set the missiles' flight coordinates on the basis of information from U.S. spy satellites, meaning Washington was directly responsible.\nThe United States began supplying Ukraine with longer range ATACMS missiles, which have a 300-kilometer (186-mile) range, earlier this year.\nRussia will respond to Sunday's attack, the Defense Ministry said, without elaborating.", "location": "Crimea", "classification": "security", "score": 0.5926060461368468, "event_breakdown": "Reported Location: Russia\nReported Date: August 7, 2022\nTarget Event: Russia attacks Ukraine's port of Odesa with a missile"}, {"id": "8ba5b88f-3afe-46d8-bb2a-5e1487a70941", "title": "Six killed in Ukrainian drone and missile strikes on Russia", "date": "2024-06-24 01:00", "url": "https://www.eadt.co.uk/news/national/24405758.six-killed-ukrainian-drone-missile-strikes-russia/", "domain": "eadt.co.uk", "domain_classification": "Unknown", "message": "One person was killed and three were injured in Russia’s Belgorod region, bordering Ukraine, when three Ukrainian drones attacked the city of Grayvoron, regional governor Vyacheslav Gladkov said.\nIt said that US-supplied ATACMS missiles were used in the Ukrainian attack.\nAir defence forces shot down 33 Ukrainian drones over the country’s western Bryansk, Smolensk, Lipetsk and Tula regions.\nIn a video address following Saturday’s attack, Ukrainian President Volodymyr Zelensky urged Ukraine’s partners to bolster its air defences.\nRegional Governor Vadym Filashkin of Ukraine’s partly occupied Donetsk region said that Russian attacks on Saturday killed two people and wounded four.", "location": "Grayvoron, Russia", "classification": "security", "score": 0.83590572887071, "event_breakdown": "One person was killed and three were injured in the Russian region of Belgorod when three Ukrainian drones attacked the city of Grayvoron. Russian attacks on Saturday killed two people and wounded four in the Donetsk region controlled by Ukraine."}, {"id": "12f0629d-30c4-499b-81cf-560db2acd3b6", "title": "At least five dead and over 100 injured in Ukrainian strike in Russian occupied Crimea", "date": "2024-06-24 00:15", "url": "https://us.cnn.com/2024/06/23/europe/at-leastfivedead-and-over-100-injured-in-ukrainian-strike-in-russian-occupied-crimea/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —At least five people were killed and over 100 injured when missile fragments scattered over beachgoers during a Ukrainian strike on the city of Sevastopol in Russia-occupied Crimea, authorities say.\n“Unfortunately, we currently have 124 victims, of which three [are] dead children and two [are] dead adults,” Sevastopol Governor Mikhail Razvozhayev said on Telegram.\nOne of victims killed in the Ukrainian strike was the daughter of Oleg Averyanov, Deputy Mayor of Magadan.\nSince the outbreak of the war in Ukraine, it has come under sporadic attack from Ukrainian forces.\nBefore Russia’s 2022 invasion of Ukraine, Sevastopol – the largest city in Crimea – was a popular tourist destination for Russians.", "location": "Sevastopol", "classification": "security", "score": 0.9660236625434871, "event_breakdown": "Five people were killed and over 100 were injured after missile fragments scattered over beachgoers during a Ukrainian strike on the city of Sevastopol in Russia-occupied Crimea."}, {"id": "b0bd35aa-33ed-4f2b-9410-e8483a8117ee", "title": "At least five dead and over 100 injured in Ukrainian strike in Russian occupied Crimea", "date": "2024-06-24 00:15", "url": "https://edition.cnn.com/2024/06/23/europe/at-leastfivedead-and-over-100-injured-in-ukrainian-strike-in-russian-occupied-crimea/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —At least five people were killed and over 100 injured when missile fragments scattered over beachgoers during a Ukrainian strike on the city of Sevastopol in Russia-occupied Crimea, authorities say.\n“Unfortunately, we currently have 124 victims, of which three [are] dead children and two [are] dead adults,” Sevastopol Governor Mikhail Razvozhayev said on Telegram.\nOne of victims killed in the Ukrainian strike was the daughter of Oleg Averyanov, Deputy Mayor of Magadan.\nSince the outbreak of the war in Ukraine, it has come under sporadic attack from Ukrainian forces.\nBefore Russia’s 2022 invasion of Ukraine, Sevastopol – the largest city in Crimea – was a popular tourist destination for Russians.", "location": "Sevastopol", "classification": "security", "score": 0.9660236625434871, "event_breakdown": "Target Event: Missile attack in Sevastopol, Russia-occupied Crimea\nDuring a missile attack in Sevastopol, Russia-occupied Crimea, at least five people were killed and over 100 were injured when missile fragments scattered over beachgoers. Ukraine is believed to have carried out the strike."}, {"id": "bcd6fab2-df34-4bd4-9574-f57771c8a02f", "title": "At least five dead and over 100 injured in Ukrainian strike in Russian occupied Crimea", "date": "2024-06-24 02:00", "url": "https://www.cnn.com/2024/06/23/europe/at-leastfivedead-and-over-100-injured-in-ukrainian-strike-in-russian-occupied-crimea/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —At least five people were killed and over 100 injured when missile fragments scattered over beachgoers during a Ukrainian strike on the city of Sevastopol in Russia-occupied Crimea, authorities say.\n“Unfortunately, we currently have 124 victims, of which three [are] dead children and two [are] dead adults,” Sevastopol Governor Mikhail Razvozhayev said on Telegram.\nOne of victims killed in the Ukrainian strike was the daughter of Oleg Averyanov, Deputy Mayor of Magadan.\nSince the outbreak of the war in Ukraine, it has come under sporadic attack from Ukrainian forces.\nBefore Russia’s 2022 invasion of Ukraine, Sevastopol – the largest city in Crimea – was a popular tourist destination for Russians.", "location": "Sevastopol", "classification": "security", "score": 0.9660236625434871, "event_breakdown": "Event: At least five people were killed and over 100 injured when missile fragments scattered over beachgoers during a Ukrainian strike on the city of Sevastopol in Russia-occupied Crimea, authorities say.\nLocation: Sevastopol, Russia-occupied Crimea\nEvent: On Monday, a missile attack on the Ukrainian coastal city of Odessa left at least 8 people dead and 18 others injured.\nLocation: Odessa, Ukraine"}, {"id": "60554f8c-78c7-4c96-ad69-0d54f92c394c", "title": "Fighting rages as deadly strikes batter north Gaza", "date": "2024-06-24 03:00", "url": "http://usa.chinadaily.com.cn/a/202406/24/WS6678c74ea31095c51c50a665.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "People run as smoke billows over the Gaza City's eastern suburb following an Israeli bombardment on Saturday.\nThe Israeli military issued a statement saying: \"A short while ago, IDF fighter jets struck two Hamas military infrastructure sites in the area of Gaza City.\"\nThe conflict has led to dire humanitarian conditions in the Gaza Strip and repeated warnings by the United Nations of famine.\nDesperation among Gaza's 2.4 million people has increased as fighting rages, bringing warnings from agencies that they are unable to deliver aid.\nOn Saturday a security source said a leader of the Lebanese group Jamaa Islamiya was killed in an Israeli strike on a vehicle in eastern Lebanon.", "location": "GAZA CITY", "classification": "security", "score": 0.8771797565430779, "event_breakdown": "Israeli air strikes on Gaza City\nDeath of a security leader of the Lebanese group Jamaa Islamiya in an Israeli strike on a vehicle in eastern Lebanon."}, {"id": "a0cc63e3-1ed0-40fa-8c20-bcb4c00fda8a", "title": "Fighting rages as deadly strikes batter north Gaza", "date": "2024-06-24 03:15", "url": "http://europe.chinadaily.com.cn/a/202406/24/WS6678c74ea31095c51c50a665.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "People run as smoke billows over the Gaza City's eastern suburb following an Israeli bombardment on Saturday.\nThe Israeli military issued a statement saying: \"A short while ago, IDF fighter jets struck two Hamas military infrastructure sites in the area of Gaza City.\"\nThe conflict has led to dire humanitarian conditions in the Gaza Strip and repeated warnings by the United Nations of famine.\nDesperation among Gaza's 2.4 million people has increased as fighting rages, bringing warnings from agencies that they are unable to deliver aid.\nOn Saturday a security source said a leader of the Lebanese group Jamaa Islamiya was killed in an Israeli strike on a vehicle in eastern Lebanon.", "location": "Gaza City", "classification": "security", "score": 0.8771797565430779, "event_breakdown": "IDF fighter jets struck two Hamas military infrastructure sites in the area of Gaza City."}, {"id": "0408df3d-187c-4b8c-98fb-371beaa99b78", "title": "Four dead , dozens injured after missile fragments rain down on civilians in Russia - occupied Crimea", "date": "2024-06-24 03:15", "url": "https://www.yahoo.com/news/four-dead-dozens-injured-missile-023605034.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Four dead, dozens injured after missile fragments rain down on civilians in Russia-occupied CrimeaRussia is holding the United States responsible for an attack on Sevastopol that involved ATACMS missiles Washington gave Ukraine.\nPhoto courtesy of U.S. ArmyJune 23 (UPI) -- At least four people were killed and dozens injured when Russia shot down Ukraine-launched missiles over Sevastopol, Kremlin officials said.\nMikhail Razhayev, the city's Russia-installed mayor, said on Telegram that two children were among the dead and 82 people were hospitalized.\nRussia's Ministry of Defense said Kyiv on Sunday launched five U.S.-supplied missiles equipped with cluster warheads at Sevastopol.\nFour of the missiles were intercepted, it said, adding that the fifth detonated mid-flight, raining fragments down upon civilians.", "location": "Sevastopol", "classification": "security", "score": 0.9359408458087356, "event_breakdown": "Russia is holding the United States responsible for an attack on Sevastopol that involved ATACMS missiles Washington gave Ukraine."}, {"id": "f2a4f698-3c80-4a73-81e1-530e7b41c19c", "title": "2 injured in anti - tank missile attack on vehicle in Metula as top US general warns of", "date": "2024-06-24 02:30", "url": "https://www.ynetnews.com/article/r1yqegiic", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Two people were injured on Sunday evening by an anti-tank missile fired from Lebanon that hit a vehicle the northern border town of Metula.\nThe IDF spokesman later reported that two rocket launches were identified crossing from Lebanese territory into the area of Metula.\nBrown also said the U.S. won't likely be able to help Israel defend itself against a broader Hezbollah war as well as it helped Israel fight off an Iranian barrage of missiles and drones in April.\nIt is harder to fend off the shorter-range rockets that Hezbollah fires routinely across the border into Israel, he said.\n4 View gallery Hezbollah leader Hanan NasrallahוBrown said the U.S. continues to talk with Israeli leaders and warn against widening the conflict.", "location": "Israel", "classification": "security", "score": 0.9542711448338147, "event_breakdown": "IDF spokesman reports that two rocket launches were identified crossing from Lebanese territory into the area of Metula (Lebanese border)- targeted Metula - 2 people were injured on Sunday evening by an anti-tank missile fired from Lebanon - IDF spokesman also reported two rocket launches were identified crossing from Lebanese territory into the area of Metula (Lebanese border)."}, {"id": "dbc5b7d5-e130-42a4-823f-06e4c19a4d28", "title": "Peace - Loving Hezbollah Storing Huge Cache of Iranian Weapons at Largest Civilian Airport in Lebanon", "date": "2024-06-24 01:30", "url": "https://hotair.com/headlines/2024/06/23/peace-loving-hezbollah-storing-huge-cache-of-iranian-weapons-at-largest-civilian-airport-in-lebanon-n3790793", "domain": "hotair.com", "domain_classification": "Unknown", "message": "Hezbollah is storing huge quantities of Iranian weapons, missiles, and explosives in Beirut’s main civilian airport, according to airport whistleblowers.\nThe cache allegedly includes Iranian-made Falaq unguided artillery rockets, Fateh-110 short-range missiles, road-mobile ballistic missiles and M-600 missiles with ranges of over 150 to 200 miles.\nAdvertisementAlso at the airport is the AT-14 Kornet, laser-guided anti-tank guided missiles (ATGM), huge quantities of Burkan short-range ballistic missile and explosive RDX, a toxic white powder also known as cyclonite or hexagon.\nThe disclosures will raise fears that the Rafic Hariri airport, just four miles from the city centre, could become a major military target.", "location": "BEIRUT", "classification": "security", "score": 0.8989129613800996, "event_breakdown": "Hezbollah Storing Iranian Weapons at Beirut Airport"}, {"id": "4a8ab2c7-1cbb-4a6c-9e1a-43906134aa13", "title": "Israel Bombs Gaza As Fears Grow Of Wider War", "date": "2024-06-24 04:15", "url": "https://menafn.com/1108363514/Israel-Bombs-Gaza-As-Fears-Grow-Of-Wider-War", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Israel's military reported military operations on Friday“north and south of the Central Gaza Strip Corridor”.\nExperts are divided on the prospect of a wider war, almost nine months into Israel's campaign to eradicate Iran-backed Hizbollah's ally Hamas, the Palestinian militant group in the Gaza Strip.\nHizbollah chief Hassan Nasrallah said“no place” in Israel would“be spared our rockets” in a wider war, and also threatened nearby European Union member Cyprus.\nTwo soldiers killedThe violence on the Lebanon border began after the October 7 attack by Hamas militants from Gaza into southern Israel.\nOn June 16 the army said it would implement a daily“tactical pause of military activity” in a southern Gaza corridor to facilitate aid delivery.", "location": "Gaza Strip", "classification": "security", "score": 0.9753516398856049, "event_breakdown": "Israel's military reported on Friday that its operations were occurring“north and south of the Central Gaza Strip Corridor”."}, {"id": "767fe8d8-b424-42ff-ac4a-eb92702b7e61", "title": "Bartlesville Man Arrested , Accused Of Murder In Missouri", "date": "2024-06-24 04:30", "url": "http://www.newson6.com/story/6678bbee675717f1f450e598/bartlesville-man-arrested-accused-of-murder-in-missouri", "domain": "newson6.com", "domain_classification": "Unknown", "message": "A 32-year-old Bartlesville man was arrested and accused of a fatal stabbing in Missouri by authorities.\nBy: News On 6A 32-year-old Bartlesville man was arrested and accused of a fatal stabbing in Missouri by authorities.\nThe McDonald County Sheriff's Office said Garrett Sumter is facing second-degree murder charges for a stabbing on Saturday.\nAuthorities searched for him and he was arrested without incident by a State Trooper, MCSO said.\nNo other details on what led to the stabbing have been unveiled.", "location": ")\nMissouri", "classification": "security", "score": 0.4552580755831303, "event_breakdown": "Bartlesville man accused in fatal stabbing in Springfield, Missouri, authorities say a 32-year-old Bartlesville man was arrested and accused of a fatal stabbing in Springfield, Missouri, on Saturday. Deputies are searching for him.on Tuesday and said he was in custody in Carroll County, after he was pulled over by a state trooper without incident. The deputy is actively seeking a warrant of capital murder."}, {"id": "dafb7b8c-978d-4126-aea9-0c78afca758d", "title": "Crimean beachgoers struck by deadly shrapnel shower from missile", "date": "2024-06-24 02:45", "url": "https://www.smh.com.au/world/europe/crimean-beachgoers-struck-by-deadly-shrapnel-shower-from-missile-20240624-p5jo7c.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Moscow: Russia has blamed the United States for a Ukrainian attack on the Russian-annexed Crimean peninsula after missile fragments fell on beachgoers in an incident that killed four people, including two children, and injured 151 more.\nThe Russian Defence Ministry said four of the US-delivered Army Tactical Missile System (ATACMS) missiles, equipped with cluster warheads, were shot down by air defence systems and the ammunition of a fifth had detonated in mid-air.\nFootage shared on Telegram of people seeking treatment on the beach.\nCredit: TelegramFootage on Russian state television showed people running from a beach and some people being carried off on sun loungers.\nRussian-installed authorities in Crimea said missile fragments had fallen just after noon near a beach on the north side of the city of Sevastopol where locals were on holiday.", "location": ".\nThe specific location is Sevastopol, Crimea, which is a city located on the north side of the city of Seva", "classification": "security", "score": 0.856406847136669, "event_breakdown": "Four US-supplied Army Tactical Missile Systems (ATACMS), equipped with cluster warheads, were shot down by air defense operatives and the bomblets of a fifth missile detonated mid-flight. The incident occurred just after noon near a Crimean beach. Fragments of one fell near a beach on the south side of Crimea. that claimed the lives of 4 individuals, 2 of whom were children."}, {"id": "250ddb1c-36b4-4be3-a2bd-23e52e95b2f6", "title": "Crimean beachgoers struck by deadly shrapnel shower from missile", "date": "2024-06-24 02:15", "url": "https://www.theage.com.au/world/europe/crimean-beachgoers-struck-by-deadly-shrapnel-shower-from-missile-20240624-p5jo7c.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "Moscow: Russia has blamed the United States for a Ukrainian attack on the Russian-annexed Crimean peninsula after missile fragments fell on beachgoers in an incident that killed four people, including two children, and injured 151 more.\nThe Russian Defence Ministry said four of the US-delivered Army Tactical Missile System (ATACMS) missiles, equipped with cluster warheads, were shot down by air defence systems and the ammunition of a fifth had detonated in mid-air.\nFootage shared on Telegram of people seeking treatment on the beach.\nCredit: TelegramFootage on Russian state television showed people running from a beach and some people being carried off on sun loungers.\nRussian-installed authorities in Crimea said missile fragments had fallen just after noon near a beach on the north side of the city of Sevastopol where locals were on holiday.", "location": "The main focus of the event takes place near a beach on the north side of the city of Sevastopol.", "classification": "security", "score": 0.856406847136669, "event_breakdown": "Target Event:\nLocation: Crimean peninsula, Ukraine\nEvent: Ukraine fired on Crimea with missiles used in the US-supplied system. The Russian authorities reported this cause the death of 4 people on the beach."}, {"id": "9ba38993-589c-4c36-b7fd-f0b917012169", "title": "Crimean beachgoers struck by deadly shrapnel shower from missile", "date": "2024-06-24 03:15", "url": "https://www.brisbanetimes.com.au/world/europe/crimean-beachgoers-struck-by-deadly-shrapnel-shower-from-missile-20240624-p5jo7c.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Moscow: Russia has blamed the United States for a Ukrainian attack on the Russian-annexed Crimean peninsula after missile fragments fell on beachgoers in an incident that killed four people, including two children, and injured 151 more.\nThe Russian Defence Ministry said four of the US-delivered Army Tactical Missile System (ATACMS) missiles, equipped with cluster warheads, were shot down by air defence systems and the ammunition of a fifth had detonated in mid-air.\nFootage shared on Telegram of people seeking treatment on the beach.\nCredit: TelegramFootage on Russian state television showed people running from a beach and some people being carried off on sun loungers.\nRussian-installed authorities in Crimea said missile fragments had fallen just after noon near a beach on the north side of the city of Sevastopol where locals were on holiday.", "location": ")\nThe main event takes place at the Crimean Peninsula.", "classification": "security", "score": 0.856406847136669, "event_breakdown": "Target Event:\nRussia-US tensions rise sharply after Ukraine fires missiles from Crimea beach at Russian military stationed at border.\nThe Ukrainian military used American and British-supplied anti-ship cruise missiles to attack a bridge over the Kerch Strait, which connects the Black Sea and the Sea of Azov, in an initial action."}, {"id": "90c9436c-a9ac-4a07-b88a-a1005d9222fe", "title": "Aerial drone launched by Yemen Houthi rebels hits ship in the Red Sea , causing damage and injuries", "date": "2024-06-24 02:15", "url": "https://economictimes.indiatimes.com/news/defence/aerial-drone-launched-by-yemens-houthi-rebels-hits-ship-in-the-red-sea-causing-damage-and-injuries/articleshow/111216722.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "It said the vessel sustained damage but its mariners on board \"were reported safe.\"\nIt did not elaborate on the extent of the damage to the Liberian-flagged, Greek-owner bulk carrier, but said an investigation was ongoing.Hours after the attack, Houthi military spokesman Brig.\nGen. Yahya Saree claimed the attack, saying the rebels targeted the Transworld Navigator.\n\"This marks the fourth attack by Iranian-backed Houthis on the\" vessel.The Houthis have launched more than 60 attacks targeting specific vessels and fired off other missiles and drones in their campaign that has killed a total of four sailors.\nThey have seized one vessel and sunk two since November.", "location": "The Gulf of Oman.", "classification": "security", "score": 0.9768835468565895, "event_breakdown": "Target Event:\nHouthi rebels attack Liberian-flagged, Greek-owned container ship in Red Sea near Yemen\nAdditional Events:\n1. On Saturday, Dec. 18, 2021, police exchanged gunfire with a bank robbery suspect at an Ohio business, authorities said. Shots hit two police cruisers but no one was injured, officials said. The unidentified man barricaded himself inside the business, and police used a robot to take him into custody, officials said. Police did not report any other arrests in the incident.\n2. A suicide bomber detonated a car bomb Sunday, Dec. 19, 2021, near the residence of Somalia's former president Mohamed Abdullahi Farmajo near the presidential palace in Mogadishu.\n3. A bomb targeted a security convoy in northwest Pakistan on Saturday, killing a police officer and wounding seven other people, police said. The blast happened in Peshawar, a city in the country's Khyber Pukhtunkhwa province, said region Police Chief ali omar zakhil."}, {"id": "4c0ef27c-2a5b-4a2d-8f1e-52470410882e", "title": "Aerial drone likely launched by Yemen Houthi rebels hits ship in the Red Sea | Nation and World", "date": "2024-06-24 01:30", "url": "https://www.reviewjournal.com/news/nation-and-world/aerial-drone-likely-launched-by-yemens-houthi-rebels-hits-ship-in-the-red-sea-3073765/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "An aerial drone likely launched by Yemen’s Houthi terrorists struck and damaged a vessel in the Red Sea on Sunday, officials said.\n(Song Kyung-Seok/Pool Photo via AP)DUBAI, United Arab Emirates — An aerial drone likely launched by Yemen’s Houthi terrorists struck and damaged a vessel in the Red Sea on Sunday, officials said, the latest attack by the group targeting the vital maritime corridor.\nThe private security firm Ambrey identified the ship involved as a Liberia-flagged container ship bound for Qingdao, China.\nThe Houthis have launched more than 60 attacks targeting specific vessels and fired off other missiles and drones in their campaign that has killed a total of four sailors.\nThe Roosevelt anchored Saturday in Busan, South Korea, amid Seoul’s ongoing tensions with North Korea.", "location": "The Persian Gulf", "classification": "security", "score": 0.7745405502481856, "event_breakdown": "Among the current events of security reported in text that can be placed on a map are:\n- A drone attack by Yemen's Houthis struck a vessel in the Red Sea on Sunday.\n- The amphibious transport dock USS Somerset and the guided-missile destroyer USS Roosevelt conducted exercises in the South China Sea."}, {"id": "1f449a7d-9b43-45bf-81cb-c9d826aa9254", "title": "Juvenile victim stabbed outside Dartmouth Mall , police say", "date": "2024-06-24 01:30", "url": "https://www.bostonglobe.com/2024/06/23/metro/juvenile-victim-stabbed-five-below-dartmouth-mall/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "The victim was taken to a hospital for treatment of non-life-threatening wounds, Dartmouth police said in a statement Sunday.\nA a juvenile victim was injured and a juvenile suspect was arrested following a stabbing in a parking lot at the Dartmouth Mall on Sunday afternoon, according to Dartmouth police.\nThe stabbing occurred at 200 N. Dartmouth Mall in the parking lot outside the Five Below store, where police responded to a call at 2:50 p.m., according to the statement, which said both the victim and the suspect taken into custody following the stabbing were “reported to be juveniles” but did not include their ages.\nNo further information was immediately available Sunday night.\nNnora Holland can be reached at nora.holland@globe.com.", "location": "Dartmouth Mall", "classification": "security", "score": 0.5558426732268157, "event_breakdown": "Target event:\nA stabbing occurred in the parking lo at the Dartmouth Mall in Dartmouth, Massachusetts on Sunday. The incident was labeled as an assault on the police report and the injured juvenile victim was taken to the hospital for treatment of non-life-threatening wounds by Dartmouth police. Both the suspect and victim have been in police custody, but no other details about their identities, ages, or any other information has been released."}, {"id": "90190afc-e31f-419a-885a-d3c12678d1c6", "title": "Members of rapid - response squad injured from anti - tank missile while driving ATV in Metula", "date": "2024-06-24 04:30", "url": "http://www.israelnationalnews.com/news/392009", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Two members of a rapid-response squad were injured on Sunday evening by an anti-tank missile that hit the city of Metula in northern Israel.\nThe incident occurred when the members of the squad were accompanying a family from Metula who came to see their home, which had been hit by Hezbollah missiles.\nThe two were evacuated for medical treatment at Rambam Hospital in Haifa.\nThe IDF Spokesperson’s Unit confirmed that two launches were detected that crossed from Lebanese territory towards the Metula area, and that damage was caused in the area.\nThe Rambam Hospital updated on Monday morning that one of the victims, in his 40s, underwent an operation overnight and was admitted to general intensive care unit.", "location": "Metula, a city in northern Israel", "classification": "security", "score": 0.9503258886433286, "event_breakdown": "IDF Spokesperson's Unit confirms that launch was detected from Lebanese territory towards the Metula area, and damage was caused in the area."}, {"id": "a6e1202b-4d97-4162-b489-195d667a8990", "title": "Victim recovering after Saturday night stabbing in Schenectady", "date": "2024-06-24 04:00", "url": "https://cbs6albany.com/news/local/victim-recovering-after-saturday-night-stabbing-in-schenectady", "domain": "cbs6albany.com", "domain_classification": "Unknown", "message": "A man is recovering Sunday night after being stabbed on state street.\nSchenectady police say that they received a call for a shooting by Taste of China on State Street around midnight Saturday night.\nMORE:When they arrived, they found a stabbing victim in serious but not critical condition.\nThey say it was an adult man who was uncooperative with police.\nPolice say there are no suspects at this time.", "location": "Schenectady", "classification": "security", "score": 0.5020820965893592, "event_breakdown": "Man stabbed on state street in Schenectady."}, {"id": "625999ac-d4f6-4f59-a594-1b0e8e254899", "title": "Lebanon denies weapons are stored at Beirut airport : Deceptions and lies", "date": "2024-06-24 02:15", "url": "https://www.israelnationalnews.com/news/392004", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The Lebanese air transport association on Sunday denied claims that Hezbollah has been storing at Beirut’s main airport.\nThe organization that runs day-to-day operations at the airport dismissed claims that Iranian weapons were being flown in and stored at the transport hub.\nThe Lebanese air transport association said in response that the claims were “deceptions and lies aimed at exposing Beirut airport and its workers”, and announced a press tour of the airport on Monday.\nHezbollah has previously been accused of using the civilian airport for weapons storage, but the whistleblowers claimed it has escalated since the conflict between Hezbollah and Israel intensified in October.\nStaff at the airport and intelligence sources claimed in interviews with The Telegraph that weapons were travelling through the airport and being stored on site.", "location": ".\nBEIRUT", "classification": "security", "score": 0.7040489466386703, "event_breakdown": "Lebanese air transport association denies claims that Hezbollah is storing at Beirut’s main airport."}, {"id": "58e41166-fc59-48ae-a0b2-ee320864b08b", "title": "Israel Hamas update : Israel warned offensive into Lebanon risks military response by Iran", "date": "2024-06-24 02:30", "url": "https://www.9news.com.au/world/israeli-offensive-into-lebanon-risks-war-with-iran-top-us-general-warns/01ca5fed-d238-474c-bdb5-5021cef31337", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "The United States' top military officer has warned that an Israeli military offensive into Lebanon would risk an Iranian response in defence of the powerful Hezbollah militant group there, triggering a broader war that could put American forces in the region in danger.\nREAD MORE: Israeli military straps injured Palestinian man to hood of jeepChairman of the US Joint Chiefs of Staff General CQ Brown has warned an Israeli offensive into Lebanon risks dragging Iran into the Middle East conflict.\n(AP Photo/Kevin Wolf) (AP)Israeli officials have threatened a military offensive in Lebanon if there is no negotiated end to push Hezbollah away from the border.\nUS President Joe Biden's senior adviser, Amos Hochstein, met with officials in Lebanon and Israel last week in an effort to deescalate tensions.\nThe situation escalated this month after an Israeli airstrike killed a senior Hezbollah military commander in southern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.749574416778442, "event_breakdown": "Target event: The US military warns that an Israeli offensive into Lebanon risks a broader war in the Middle East\nUS military chief in the Middle East warns of broader war\nThe United States' top military officer has warned that an Israeli offensive into Lebanon would risk an Iranian response in defence of the powerful Hezbollah militant group there, triggering a broader war that could put American forces in the region in danger."}, {"id": "7a2a958a-c727-4263-b923-73fa8271f024", "title": "Netanyahu Says Major Operations in Gaza Will End  Very Soon  ", "date": "2024-06-24 01:00", "url": "https://www.bnnbloomberg.ca/netanyahu-says-major-operations-in-gaza-will-end-very-soon-1.2088489", "domain": "bnnbloomberg.ca", "domain_classification": "Unknown", "message": "(Bloomberg) -- Prime Minister Benjamin Netanyahu said Israel will soon end the intense stage of fighting in Gaza and will focus on targeted operations against Hamas.\n“It will be very soon,” Netanyahu said when asked in a TV interview whether fighting in the southern city of Rafah will end in a month’s time.\nIt was his first interview with an Israeli media outlet since the Oct. 7 attacks, in which Hamas militants invaded southern Israel from Gaza, killing 1,200 people and kidnapping another 250.\n“If we can, we’ll do this by diplomatic means, if not it’ll be achieved in another way,” Netanyahu said.\n“Netanyahu has made clear we will not leave Gaza until we return all hostages, living and deceased.”©2024 Bloomberg L.P.", "location": "Gaza", "classification": "security", "score": 0.59467166328221, "event_breakdown": "Hamas militants invaded southern Israel from Gaza, killing 1,200 people and kidnapping another 250."}, {"id": "3d47cb8f-56c1-4df6-8769-152bcc28d51a", "title": "Gaza war sours public perception of Israel , volunteers step up", "date": "2024-06-24 04:15", "url": "https://www.jpost.com/opinion/article-807378", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Since Hamas first attacked, people worldwide have gathered to support Israel, with our team at Operation Israel leading efforts to ensure IDF soldiers are well-equipped to persevere through this long and challenging war.\nOperation Israel was able to procure eye protection for E.’s unit just in time.\nTo pay for this, Operation Israel has raised over $8 million in donations; but as significant as this is, it’s just not enough.\nOperation Israel has also been ensuring that soldiers have the medical supplies they need.\nThe writer is the founder of Operation Israel, a nonprofit founded soon after the outbreak of the Israel-Hamas war.", "location": "Israel", "classification": "security", "score": 0.4647352236932483, "event_breakdown": "E.'s unit is near Ashkelon, which has experienced multiple Hamas rocket attacks in recent days, including one that killed an Indian national on Saturday."}, {"id": "fa2aa7ca-d8e8-4538-b0ed-2411bda68893", "title": "Thousands of Iran - backed fighters offer to join Hezbollah in its fight against Israel", "date": "2024-06-24 00:30", "url": "https://www.columbian.com/news/2024/jun/23/thousands-of-iran-backed-fighters-offer-to-join-hezbollah-in-its-fight-against-israel/", "domain": "columbian.com", "domain_classification": "Unknown", "message": "BEIRUT — Thousands of fighters from Iran-backed groups in the Middle East are ready to come to Lebanon to join with the militant group Hezbollah in its battle with Israel if the simmering conflict escalates into a full-blown war, officials with Iran-backed factions and analysts say.\nAlmost daily exchanges of fire have occurred along Lebanon’s frontier with northern Israel since fighters from the Hamas-controlled Gaza Strip staged a bloody assault on southern Israel in early October that set off a war in Gaza.\nThe situation to the north worsened this month after an Israeli airstrike killed a senior Hezbollah military commander in southern Lebanon.\nHezbollah retaliated by firing hundreds of rockets and explosive drones into northern Israel.\nIsraeli officials have threatened a military offensive in Lebanon if there is no negotiated deal to push Hezbollah away from the border.", "location": "BEIRUT", "classification": "security", "score": 0.982310648173176, "event_breakdown": "BEIRUT — have been daily exchanges of fire occurring along Lebanon’s frontier with Israel since late October. The situation worsened this month following an Israeli airstrike that killed a senior Hezbollah military commander. The Iran-backed Hezbollah retaliated by firing hundreds of rockets into northern Israel."}, {"id": "a98b331b-77dc-448f-a792-2cf12ff4edbb", "title": "Netanyahu : Israel winding down Gaza operations ; war against Hezbollah could be next", "date": "2024-06-24 01:30", "url": "https://www.reviewjournal.com/news/nation-and-world/netanyahu-israel-winding-down-gaza-operations-war-against-hezbollah-could-be-next-3073756/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "Netanyahu: the current phase of fighting against Hamas in Gaza is winding down.\nPossibly sending more troops to northern border to confront terrorist group, Hezbollah.\nThe Iranian-backed Hezbollah terrorist group began striking Israel almost immediately after the Oct. 7 Hamas-led terrorist attack that triggered the Gaza war.\nIsrael and Hezbollah have been exchanging fire nearly every day since then, but the fighting has escalated in recent weeks.\nGaza war not ending soonIn the interview, Netanyahu said that Israel’s offensive in Gaza is winding down.", "location": "GAZA", "classification": "security", "score": 0.7165692976183303, "event_breakdown": "Israel-Gaza / Hezbollah confrontation on Israel's northern border."}, {"id": "2f3bfd55-d3c2-40b7-af02-dd95a18c01ae", "title": "Netanyahu says Israel is winding down its Gaza operations", "date": "2024-06-24 01:30", "url": "https://www.eastbaytimes.com/2024/06/23/netanyahu-says-israel-is-winding-down-its-gaza-operations-but-he-warns-a-lebanon-war-could-be-next/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "Netanyahu also signaled that there is no end in sight for the grinding war in Gaza.\nThe Iranian-backed Hezbollah began striking Israel almost immediately after Hamas’ Oct. 7 cross-border attack that triggered the Gaza war.\nIn the interview, Netanyahu said that Israel’s offensive in Gaza is winding down.\nBut he said Israel would have to continue “mowing” operations — targeted strikes aimed at preventing Hamas from regrouping.\nNetanyahu ruled out one option favored by some of his ultranationalist governing partners — re-settling Israelis in Gaza.", "location": ".\nGAZA", "classification": "security", "score": 0.6428147567920491, "event_breakdown": "Gaza, Israel"}, {"id": "7aa50e9b-f507-49d9-88c1-2ea374760a6c", "title": "Gunmen kill six police officers as church and synagogue attacked in Russia Dagestan", "date": "2024-06-24 02:30", "url": "https://www.telegraph.co.uk/world-news/2024/06/23/gunmen-kill-police-dagestan-russia/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Gunmen opened fire at a synagogue, an Orthodox church and a police post in Russia’s North Caucasus region of Dagestan on Sunday, killing six policemen and injuring 12, the interior ministry said.\nA local religious organisation in the mainly Muslim region put the death toll at nine, including seven police officers.\nThe interior ministry, quoted by Russian news agencies, said four gunmen had been shot dead as the incidents unfolded.\nA local official said another had been killed during a shootout at a church in Makhachkala, the region’s main administrative centre.\nRestive Dagestan was hit by an Islamist insurgency in the 2000s, spilling over from neighbouring Chechnya, with Russian security forces moving aggressively to combat extremists in the region.", "location": "MAKHACHKALA", "classification": "security", "score": 0.9638450769611151, "event_breakdown": "1. Gunmen opened fire at a synagogue, an Orthodox church and a police post in Russia's North Caucasus region of Dagestan on Sunday, killing six policemen and injuring 12, the interior ministry said.\n2. A local religious organisation in the mainly Muslim region put the death toll at nine, including seven police officers.\n3. The interior ministry, quoted by Russian news agencies, said four gunmen had been shot dead as the incidents unfolded.\n4. A local official said another had been killed during a shootout at a church in Makhachkala, the region's main administrative centre.\n5. Restive Dagestan was hit by an Islamist insurgency in the 2000s, spilling over from neighbouring Chechnya, with Russian security forces moving aggressively to combat extremists in the region."}, {"id": "5b8d199e-c967-4938-984a-8c1d39be27f8", "title": "Gaza Conflict , Israeli Instability , and US Relations : three knots", "date": "2024-06-24 04:15", "url": "https://www.jpost.com/opinion/article-807383", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "These days our general situation seems to be immersed in at least three interwoven Gordian knots.\nOne concerns the lingering fighting in the Gaza Strip and the prospect of the current border confrontation between Israel and Hezbollah turning into a full-scale war.\nThe same applies to his statement, on the same occasion, that if an alternative will not be found to Hamas in the Gaza Strip, the latter will remain in power there.\nThe position of Prime Minister Benjamin Netanyahu appears to be the exact opposite on all these issues.\nNetanyahu does not support the IDF’s departure from the Gaza Strip, even if it will be forced to carry out a full-scale war in Lebanon.", "location": "Gaza Strip", "classification": "security", "score": 0.9325653111969975, "event_breakdown": "1. The current border confrontation between Israel and Hezbollah. Location: border between Israel and Lebanon\n2. The lingering fighting in the Gaza Strip. Location: Gaza Strip"}, {"id": "9789bcc3-1c70-4733-889d-4f89cad1c3aa", "title": "Orthodox priest , at least 15 police killed in gunmen attack in Russia North Caucasus , officials say", "date": "2024-06-24 04:00", "url": "https://www.rappler.com/world/europe/russia-north-caucasus-attack-june-23-2024/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "There was no immediate claim of responsibility for the attacks in the volatile North Caucasus region.\nRussian state news agencies cited the National Anti-Terrorist Committee as saying that five of the gunmen had been killed.\nReuters could not independently verify the reports on how many people or gunmen were killed in the attacks.\nDays of mourningJune 24-26 have been declared days of mourning in Dagestan, Melikov said, with flags lowered to half-staff and all entertainment events cancelled.\nAuthorities were quoted as saying that both the synagogue and church were ablaze, and that two attackers had been killed.", "location": "Dagestan", "classification": "security", "score": 0.9024830494880651, "event_breakdown": "Reported attack on a synagogue and church in the North Caucasus region of Russia, targeting a synagogue and church. No claims of responsibility. Russian state news agency TASS reports that five gunmen were killed."}, {"id": "e21573de-ec6d-4104-9cad-d089fc2666b1", "title": "Russia Targets Kyiv Region As Moscow Says 4 Killed In Attacks On Sevastopol , Belgorod", "date": "2024-06-24 06:00", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240623-rferl01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Russia Targets Kyiv Region As Moscow Says 4 Killed In Attacks On Sevastopol, BelgorodBy RFE/RL's Ukrainian Service June 23, 2024Russia launched three missiles targeting Kyiv region in an early morning strike on June 23 after at least two civilians were killed when a residential building was struck by a Russian bomb in the northeastern city of Kharkiv a day earlier.\nUkraine's Air Force said that two of the three missiles fired at the Kyiv region on June 23 were downed.\nIn Russia's southwestern Belgorod region, which borders Ukraine, one person was killed and three were injured by Ukrainian drones, said regional Governor Vyacheslav Gladkov.\nRussia's attacks on Kyiv and Kharkiv earlier on June 23 came a day after Russia launched a large-scale missile and drone attack on Ukraine's battered energy infrastructure.\nThe State Emergency Service on June 23 issued revised the figures downward to two killed and 53 injured, including three children.", "location": "Kyiv", "classification": "security", "score": 0.9565075026795098, "event_breakdown": "Three missiles targeting Kyiv region, one civilian killed in Kharkiv, three civilians injured in Belgorod"}, {"id": "198dba1c-66ce-4805-9a54-fd5b8f0fe103", "title": "Russian sunbathers hit by deadly shrapnel raining down on Crimea beach | World | News", "date": "2024-06-24 08:45", "url": "https://www.express.co.uk/news/world/1914521/russia-crimea-beach-shrapnel-us-ukraine-missiles", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Ukraine attacks Crimea beach, says RussiaRussian sunbathers filmed the horror moment deadly shrapnel rained down on a beach in Crimea.\nAt least five people, including three children, died from shrapnel wounds and hundreds were injured, as Russian officials warned the death toll will rise.\nThe shrapnel rained down on the beach after Russia's air defence systems intercepted one of the missiles fired by Ukraine.\n\"There were mostly shrapnel wounds, a woman was hit in the neck by a double shrapnel.\nMoscow said that the intercepted missile had been armed with a cluster munition warhead that exploded over the beach.", "location": "Crimea", "classification": "security", "score": 0.9005715173879298, "event_breakdown": "Ukraine attacks Crimea beach, says Russia\nAt least five people, including three children, die from shrapnel wounds and hundreds are injured."}, {"id": "38cb44a8-60bb-42e0-89ab-5b73548256a0", "title": "US Responsible for Sevastopol Strike With Weapons Supplied to Ukraine", "date": "2024-06-24 06:00", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240623-sputnik02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "US Responsible for Sevastopol Strike With Weapons Supplied to Ukraine - Russian MoDSputnik News20240623Washington is responsible for the missile strike on Sevastopol's civilians, as all targeting data for the ATACMS missiles used are entered by US specialists, the Russian Ministry of Defense said.\nFlight missions for ATACMS missiles are programmed by American specialists based on US satellite reconnaissance, making Washington primarily responsible for the deliberate missile strike on Sevastopol's civilians, the Russian Ministry of Defense (MoD) stated.\n\"Therefore, the responsibility for the deliberate missile strike on Sevastopol's civilians lies primarily with Washington, which supplied this weapon to Ukraine, as well as the Kiev regime, from whose territory the strike was launched,\" the statement said.\nAccording to the Russian Ministry of Health, 124 people were injured, including 27 children, and three people were killed, including two children.\nThe strike on Sevastopol's civilians with US ATACMS missiles will not go unanswered, the Russian MoD said.", "location": "Sevastopol", "classification": "security", "score": 0.5286013720174007, "event_breakdown": "Location: Sevastopol\nReported on: 23 June 2022\nTarget event: New: Russian military says US supplied missiles used to kill 3, wound 124 in Sevastopol\n\"Moscow said Friday that US-supplied missiles had been used to kill three Russian soldiers and wound 124 civilians in a strike on Sevastopol, a Russian port city in Ukraine Moscow.Russia's defence minister said that all targeting data for the ATMSAMs cruise missile used for the strike had been entered by American specialists. The ministry said this was important because US specialists worked with military intelligence.\"\nNew: Three Russian soldiers and 124 civilians in Sevastopol have been injured after an attack was launched using US-supplied ATMSAMs cruise missile\nThe blame for the attack on Wednesday by the Ukrainian army has come from Washington which had supplied Ukraine with these projectiles."}, {"id": "bfbdb44b-e380-423f-875f-8d4879c60476", "title": "Hezbollah drone strike hits Israeli military base , leaves casualties", "date": "2024-06-24 06:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240623-presstv08.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah drone strike hits Israeli military base, leaves casualtiesIran Press TVSunday, 23 June 2024 8:10 AMLebanon's Hezbollah resistance movement has conducted a drone strike on an Israeli military base, leaving casualties among the occupation forces.\nIt added that the raid had killed and wounded an unspecified number of Israeli officers and soldiers.\nHezbollah also emphasized that the strike came in support of the Palestinian people in the Gaza Strip and their resistance, as well as in response to an Israeli assassination operation in Lebanon.\nOn Saturday, an Israeli drone strike targeted a car in the town of Khiara in the Western Bekaa area and killed its driver, who was later identified as Ayman Hashem Ghattma, a leader of the Islamic Group political party in Lebanon.\nIn a statement, the Islamic Group called the targeted killing \"a new crime\" committed by the Zionist regime against the Lebanese and Palestinian people.", "location": "Israel", "classification": "security", "score": 0.9965441904232728, "event_breakdown": "Hezbollah drone strike hits Israeli military base, leaves casualties - Iran Press TV Lebanon's Hezbollah resistance movement has conducted a drone strike on an Israeli military base, leaving casualties among the occupation forces. It added that the raid had killed and wounded an unspecified number of Israeli officers and soldiers. Hezbollah also emphasized that the strike came in support of the Palestinian people in the Gaza Strip and their resistance, as well as in response to an Israeli assassination operation in Lebanon. On Saturday, an Israeli drone strike targeted a car in the town of Khiara in the Western Bekaa area and killed its driver, who was later identified as Ayman Hashem Ghattma, a leader of the Islamic Group political party in Lebanon. In a statement, the Islamic Group called the targeted killing \"a new crime\" committed by the Zionist regime against the Lebanese and Palestinian people."}, {"id": "1f0f44d3-0984-44c2-9e84-2ab5f5176d8c", "title": "Five More Palestinians Killed By Israeli Airstrike In Western Gaza City : Death Toll Of Palestinians Rises To 37 , 598", "date": "2024-06-24 04:45", "url": "https://menafn.com/1108363708/Five-More-Palestinians-Killed-By-Israeli-Airstrike-In-Western-Gaza-City-Death-Toll-Of-Palestinians-Rises-To-37598", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Palestinian security sources said that, Israeli aircraft struck the vocational college, affiliated with the in Gaza City, in the north of the Gaza Strip with at least one missile.\nThe Israeli airstrike caused extensive damage to the college's premises, destroying its outer wall and security rooms, according to local sources and eyewitnesses.\nMedical sources said that, five more Palestinians were killed, and several others were injured, who were transported to the Baptist Hospital in central Gaza City.\nAs of yesterday, the death toll of Palestinians has risen to 37,598, since the start of the conflict in Gaza in Oct, last year, said the health authorities in Gaza.\nThe regime's Zionist Forces said in a statement yesterday that, its operational activity still continues in the southern and central Gaza Strip.– NNN-WAFA", "location": "GAZA CITY", "classification": "security", "score": 0.9543473664258326, "event_breakdown": "Israeli aircraft struck a vocational training college in Gaza City, in the north of the Gaza Strip. Eyewitnesses said that at least five Palestinians were killed in the Israeli airstrike. The Israeli regime's forces said in a statement that its operational activity continues in the southern and central Gaza Strip."}, {"id": "341ea88b-652a-4f89-9cd3-bcea410c1d64", "title": "US directly involved in deadly attack on Crimea , says Russia - World", "date": "2024-06-24 04:45", "url": "https://www.dawn.com/news/1841521/us-directly-involved-in-deadly-attack-on-crimea-says-russia", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "MOSCOW: Russia said on Sunday that the United States was “directly responsible” for an attack carried out from Ukra­inian territory with five missiles that killed at least five people, including three children, and injured 124 more in Crimea.\nThe Russian defence ministry said US specialists had set the missiles’ flight coordinates on the basis of information from US spy satellites, meaning Washington was directly responsible.\nThe ministry said four missiles were downed but a fifth changed trajectory after being intercepted “with its warhead exploding in the air over the city”.\nRussian-installed auth­o­rities in Crimea said missile fragments had fallen just after noon near a beach on the north side of Sevastopol city where locals were holidaying.\nAt least 124 were inju­red, Russian Health Mini­ster Mikhail Mura­shko said.", "location": "Crimea", "classification": "security", "score": 0.6042469093176064, "event_breakdown": "Location: Crimea\nEvent: The US is responsible for the missile attack in Crimea, Ukraine, according to Russian defense ministry, which says Washington had directed the missiles from its own satellites."}, {"id": "01913597-11fe-45d7-a6d5-e4a5c1c87ec5", "title": "Ukrainian drones , missiles kill 6 in Russia and Crimea", "date": "2024-06-24 03:15", "url": "https://www.c4isrnet.com/battlefield-tech/2024/06/23/ukrainian-drones-missiles-kill-6-in-russia-and-crimea/", "domain": "c4isrnet.com", "domain_classification": "Unknown", "message": "Another person died in Grayvoron city in Russia’s Belgorod region, bordering Ukraine, regional Gov.\nAir defenses overnight shot down 33 Ukrainian drones over Russia’s western Bryansk, Smolensk, Lipetsk and Tula regions, the Russian Ministry of Defense said Sunday.\nA fresh attack on Kharkiv killed at least one person and wounded 11 on Sunday, according to local officials.\nIn a video address following the attack, Ukrainian President Volodymyr Zelenskyy urged Ukraine’s partners to bolster its air defenses.\nMoscow has not yet commented on the reports, but officials said air defenses shot down a number of drones in the region overnight on Friday.", "location": "Kharkiv", "classification": "security", "score": 0.5781971565225109, "event_breakdown": "Another person died in Grayvoron city in Russia’s Belgorod region, regional Gov. Vyacheslav Gladkov said on Telegram on Sunday.\nUkrainian drones were shot down overnight on Friday near the village of Zhuravlevka in the Belgorod region, Russia’s National News Service (ИАНСТ) reported on Saturday morning.\nA fresh attack on Kharkiv killed at least one person and wounded 11 on Sunday, according to local officials.\nIn a video address following the attack, Ukrainian President Volodymyr Zelenskyy urged Ukraine’s partners to bolster its air defenses.\nMoscow has not yet commented on the reports."}, {"id": "0a8dc773-90b4-461a-aee5-24882300274c", "title": "Ukraine , Russia trade lethal attacks", "date": "2024-06-24 06:00", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240623-voa01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Ukraine, Russia trade lethal attacksBy VOA News June 23, 2024Ukraine and Russia traded new lethal attacks Sunday as their war neared the 28-month mark.\nIn a separate attack, one person was killed and three injured in Russia's Belgorod region, bordering Ukraine, when three Ukrainian drones hit the city of Grayvoron.\nSevastopol Governor Mikhail Razvozhayev said the attack there hit Uchkuyevka, an area with sandy beaches and hotels.\nRussia's defense ministry said Ukraine used U.S.-supplied weapons in the attack and accused it of using cluster munitions.\nOn Sunday, another Russian strike hit a house in the city, killing one and injuring five, regional Governor Oleh Syniehubov said.", "location": "Ukraine", "classification": "security", "score": 0.8788334498490723, "event_breakdown": "Ukraine, Russia trade lethal attacks\nBy VOA News June 23, 2024\nUkraine and Russia traded new lethal attacks Sunday as their war neared the 28-month mark.\nIn a separate attack, one person was killed and three injured in Russia's Belgorod region, bordering Ukraine, when three Ukrainian drones hit the city of Grayvoron.\nSevastopol Governor Mikhail Razvozhayev said the attack there hit Uchkuyevka, an area with sandy beaches and hotels.\nRussia's defense ministry said Ukraine used U.S.-supplied weapons in the attack and accused it of using cluster munitions.\nOn Sunday, another Russian strike hit a house in the city, killing one and injuring five, regional Governor Oleh Syniehubov said."}, {"id": "45f5fc46-0a52-4346-8aab-ca680748f311", "title": "Six killed in Ukrainian missile and drone strikes on Russia , Moscow claims , while attacks on Kharkiv continue", "date": "2024-06-24 04:45", "url": "https://www.independent.ie/world-news/europe/six-killed-in-ukrainian-missile-and-drone-strikes-on-russia-moscow-claims-while-attacks-on-kharkiv-continue/a1756199512.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "A rescue worker with a dog searching for victims in a damaged apartment building after it was hit by Russian bomb in Kharkiv, Ukraine, on Saturday.\nAt least three people were killed in the attack.\nPhoto: APRussian authorities said at least six people died and over 100 were wounded in Ukrainian drone and missile attacks yesterday, while the second day of Russia’s aerial bombing of Kharkiv in north-eastern Ukraine killed at least one person.", "location": "Kharkiv", "classification": "security", "score": 0.9867156034660189, "event_breakdown": "Kharkiv, Ukraine - Saturday, May 14 - A Russian aerial bombing killed at least one person and injured dozens more."}, {"id": "5d9ab1ea-3ea9-46d8-bb32-ff227a408bba", "title": "Suspected Houthi attack targets vessel in waters further away than all previous assaults", "date": "2024-06-24 08:15", "url": "https://naharnet.com/stories/en/306095-suspected-houthi-attack-targets-vessel-in-waters-further-away-than-all-previous-assaults", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "A possible attack by Yemen's Houthi rebels on Monday targeted a ship further away from nearly all of the previous assaults they've launched in the Gulf of Aden, officials said, potentially part of a widening escalation by the group.\nThe attack was just off to the northeast of Yemen's Socotra Island, also held by allies of the exiled government.\n\"The master of a merchant vessel reports an explosion in close proximity to the vessel,\" the UKMTO said.\nOf the more than 60 attacks launched by the Houthis since November that specifically targeted vessels, this would be one of the furthest.\nHowever, the distance at which it was struck led experts to question whether Iran, the Houthis' main benefactor, could have launched the attack.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.5661179277661805, "event_breakdown": "Possible Houthi attack on ship northeast of Yemen's Socotra Island"}, {"id": "ebed9150-f49f-40de-9b67-b38f6033ba09", "title": "Hezbollah releases footage of sensitive Israeli targets as Tel Aviv tempts war", "date": "2024-06-24 06:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240623-isna02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah releases footage of sensitive Israeli targets as Tel Aviv tempts warISNA - Iranian Students' News AgencySun / 23 June 2024 / 11:55Hezbollah has released a video showing an array of sensitive sites across the occupied territories as the Israeli regime tempts war with the Lebanese resistance movement.\nTehran-ISNA- Reporting on the video, Lebanon's al-Mayadeen television network identified the sites as \"vital Israeli targets only known to the occupation's security apparatus.\"\nThe sites depicted in the footage included the Research Center at the Israeli regime's Dimona nuclear reactor in the Negev Desert, the Ben Gurion International Airport in Tel Aviv, and Nevatim Airbase -- one of the regime's largest such outposts.\nThe Israeli regime began waging sporadic attacks against the country following the onset of Tel Aviv's ongoing genocidal war on the Gaza Strip on October 7, 2023, prompting a firefight with Hezbollah.\nThe exchange of fire has intensified since the Israeli assassination of senior Hezbollah commander Sami Taleb Abdullah.", "location": "Tel Aviv", "classification": "security", "score": 0.8732055565642123, "event_breakdown": "IsraelNuclear ReactorAirportMilitary Base (Nevatim Airbase)"}, {"id": "4c66732f-b16d-4124-aa15-3d1e8d191604", "title": "Hezbollah releases footage of sensitive Israeli targets as Tel Aviv tempts war", "date": "2024-06-24 06:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240623-presstv09.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah releases footage of sensitive Israeli targets as Tel Aviv tempts warIran Press TVSunday, 23 June 2024 2:49 AMHezbollah has released a video showing an array of sensitive sites across the occupied territories as the Israeli regime tempts war with the Lebanese resistance movement.\nReporting on the video, Lebanon's al-Mayadeen television network identified the sites as \"vital Israeli targets only known to the occupation's security apparatus.\"\nThe sites depicted in the footage included the Research Center at the Israeli regime's Dimona nuclear reactor in the Negev Desert, the Ben Gurion International Airport in Tel Aviv, and Nevatim Airbase -- one of the regime's largest such outposts.\nThe Israeli regime began waging sporadic attacks against the country following the onset of Tel Aviv's ongoing genocidal war on the Gaza Strip on October 7, 2023, prompting a firefight with Hezbollah.\nThe exchange of fire has intensified since the Israeli assassination of senior Hezbollah commander Sami Taleb Abdullah.", "location": "Tel Aviv", "classification": "security", "score": 0.8948743476921949, "event_breakdown": "Dimona Nuclear Research Center, Israel\nBen Gurion International Airport, Israel\nNevatim Airbase, Israel"}, {"id": "6eb5b334-118a-4b3e-937a-8b89e2133533", "title": "Hezbollah hits Israeli military barracks with drones", "date": "2024-06-24 06:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240623-irna04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah hits Israeli military barracks with dronesIRNA - Islamic Republic News AgencyJun 23, 2024Tehran, IRNA -- Lebanon's resistance movement Hezbollah has launched several explosive-laden drones at Israeli military positions in northern occupied territories, wounding a number of Israeli soldiers.\nThe Israeli media reports said on Sunday that a Hezbollah drone had hit a gathering of Israeli troops in Eilat in northern occupied Palestine.\nHezbollah said several Israeli troops were killed or wounded in the drone strike.\nSunday's drone strikes by Hezbollah came amid fears of a wider conflict between the Israeli regime and the Lebanese resistance movement.\nThe two sides have been trading fire almost every day since the Israeli regime launched a war of aggression against Gaza more than eight months ago.", "location": ")\nnorthern occupied Palestine", "classification": "security", "score": 0.9463147581080112, "event_breakdown": "Hezbollah hits Israeli military barracks with drones: IRNA - Islamic Republic News Agency\n'\nHezbollah hits Israeli military barracks with drones in Lebanon, IRNA - Islamic Republic News Agency"}, {"id": "772b83cd-e5be-44fc-804c-254ad1f2b351", "title": "  Gilbert Goon  rearrested ; MMA fighter involved in deadly shooting : this week top stories", "date": "2024-06-24 00:15", "url": "https://www.fox10phoenix.com/news/gilbert-goon-rearrested-mma-fighter-involved-deadly-shooting-weeks-top-stories", "domain": "fox10phoenix.com", "domain_classification": "Unknown", "message": "From \"Gilbert Goon\" Jacob Pennington being rearrested the night of his final sentencing in teen violence cases, to an MMA fighter's involvement in a deadly shooting, here are this week's top stories.\n'Gilbert Goon' Jacob Pennington arrested following his teen violence sentencesFeatured article2.\nMMA fighter claims self-defense in deadly north Phoenix shooting at Twin PeaksFeatured article3.\nSatellite imagery shows massive haboob overtaking parts of Desert SouthwestSatellite animation of a haboob over the Desert Southwest on June 19, 2024.\nMan who stole $1M worth of merchandise in AZ, other states sentenced to prison", "location": "The exact location of the main event is not specified in the text.", "classification": "security", "score": 0.6207176943989482, "event_breakdown": "Gilbert Goon' Jacob Pennington arrested following his teen violence sentences\nThe man, who has been arrested for his involvement in a teen violence case, was arrested again on the night of his final sentencing.\n\nMMA fighter claims self-defense in deadly shooting at Twin Peaks\nAn MMA fighter, Paulo Costa, is claiming self-defense in a deadly shooting that took place at Twin Peaks restaurant in north Phoenix.\n\nSatellite imagery shows massive haboob overtaking parts of Desert Southwest\nSatellite imagery shows a massive haboob overtaking parts of the Desert Southwest, including Arizona."}, {"id": "eeac3cfa-273f-4401-91d0-ee6953d0cc18", "title": "US military leader warns Israel of military offensive in Lebanon – NBC Los Angeles", "date": "2024-06-24 06:00", "url": "https://www.nbclosangeles.com/news/national-international/us-military-leader-warns-israel-military-offensive-lebanon/3442654/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "Israeli officials have threatened a military offensive in Lebanon if there is no negotiated end to push Hezbollah away from the border.\nU.S. President Joe Biden’s senior adviser, Amos Hochstein, met with officials in Lebanon and Israel last week in an effort to deescalate tensions.\nIt is harder to fend off the shorter-range rockets that Hezbollah fires routinely across the border into Israel, he said.\nThe situation escalated this month after an Israeli airstrike killed a senior Hezbollah military commander in southern Lebanon.\nHezbollah retaliated by firing hundreds of rockets and explosive drones into northern Israel and Israel responded with a heavy assault on the militant group.", "location": "Lebanon", "classification": "security", "score": 0.8064169326975759, "event_breakdown": "Lebanese-Israeli border, Israel threatens military offensive in Lebanon, Biden adviser works with Lebanon and Israel to deescalate tensions."}, {"id": "c0cbd6f8-5997-4a01-9993-af4fcba22c92", "title": "Russia , Ukraine conduct airstrikes on multiple cities as war intensifies", "date": "2024-06-24 06:00", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240623-presstv01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Russia, Ukraine conduct airstrikes on multiple cities as war intensifiesIran Press TVSunday, 23 June 2024 3:26 PMRussia and Ukraine have conducted air attacks on multiple cities as the conflict between the neighboring countries intensifies.\nElsewhere on Sunday, at least 30 drones were destroyed over Russia's western region of Bryansk, which borders Ukraine, Governor Alexander Bogomaz said on Telegram.\nRussian air defenses have shot down an unspecified number of unmanned aerial vehicles above the Western Russian region of Smolensk, Governor Vasily Anokhin wrote on Telegram.\n\"Air defenses responded to an attack of Ukrainian drones over Smolensk and Yartsevo,\" he said in a statement.\nKiev forces also hit Russian aerial drone facilities in the southern region of Krasnodar, the Ukrainian navy reported on Telegram.", "location": "Ukraine", "classification": "security", "score": 0.44276949839362545, "event_breakdown": "Ukraine: Russia pounds \nMultiple cities with airstrikes\nRussia, Ukraine attack aerial drone facilities\nRussia shoots down Ukraine drones\nSmolensk, Yartsevo, and Western Russian region Bryansk attacked"}, {"id": "a9057732-c220-4a3e-8bb5-3ec6033628d7", "title": "Aerial drone launched by Yemen Houthi rebels hits ship in the Red Sea causing damage and injuries", "date": "2024-06-24 04:30", "url": "https://www.theweek.in/wire-updates/international/2024/06/24/fgn6-mideast-tensions.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Dubai, Jun 24 (AP) An aerial drone launched by Yemen's Houthi rebels struck and damaged a vessel in the Red Sea on Sunday, officials said, the latest attack by the group targeting shipping in the vital maritime corridor.\nThe drone attack happened around dawn off the coast of the rebel-held port city of Hodeida, the British military's United Kingdom Maritime Trade Operations center said.\nHours after the attack, Houthi military spokesman Brig.\nGen. Yahya Saree claimed the attack, saying the rebels targeted the Transworld Navigator.\nSaree claimed without offering evidence the rebels instead used a drone boat in the attack, something contradicted by every other report on the assault.", "location": "Hodeida", "classification": "security", "score": 0.858495006097588, "event_breakdown": "Drone strike by Houthi rebels targets ship in the Red Sea off the coast of Yemen's Hodeida port"}, {"id": "a1426f8a-7da5-4e28-8c9e-b607776aac22", "title": "Ukraine - Russia war live : Kyiv launches new Atacms missile attack at targets in Crimea", "date": "2024-06-24 08:45", "url": "https://www.telegraph.co.uk/world-news/2024/06/24/copy-of-ukraine-russia-war-latest-news/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Ukraine launched a fresh salvo of Atacms missiles at Crimea overnight on Sunday, with local residents reporting loud explosions near several sensitive Russian military sites.\nThe attack hit the NIP-16 space communications complex and deep space tracking radars, with a locally-sourced video showing the complex in flames.\n“I heard two very powerful explosions in the city.\nThe windows were shaking in my house, and ambulance and police sirens were heard in the city,” a Yevpatoriia resident said.\nA missile also reportedly hit a military base between the settlements of Molochne and Uiutne.", "location": "The main event takes place near Yevpatoriia, a city in Ukraine", "classification": "security", "score": 0.7493961749147919, "event_breakdown": "Ukraine launched fresh salvo against Crimea\nUkraine attacked several Russian military sites in Crimea overnight with a locally-sourced video showing a NIP-16 space communication complex in flames."}, {"id": "ebc33ffb-b7e9-49ea-92a0-928952f025ba", "title": "Israeli airstrike kills eight at Gaza aid centre , witnesses say", "date": "2024-06-24 06:45", "url": "https://www.tbsnews.net/hamas-israel-war/israeli-airstrike-kills-eight-gaza-aid-centre-witnesses-say-883016", "domain": "tbsnews.net", "domain_classification": "Unknown", "message": "Eight Palestinians were killed on Sunday in an Israeli airstrike on a training college near Gaza City being used to distribute aid, Palestinian witnesses said, as Israeli tanks pushed further into the southern city of Rafah.\nThe Israeli military said the site, which it said had served in the past as a UNRWA headquarters, has been used by Hamas and Islamic Jihad fighters.\nThe Israeli offensive in retaliation has killed almost 37,600 people, according to Palestinian health authorities, and has left Gaza in ruins.\nThe Israeli military said it was continuing \"intelligence-based, targeted operations\" in the Rafah area and had located weapons stores and tunnel shafts, and killed Palestinian gunmen.\nIn Beit Lahiya in the northern Gaza Strip, health officials at Kamal Adwan Hospital said two babies had died of malnutrition.", "location": "GAZA CITY.", "classification": "security", "score": 0.9858475169688647, "event_breakdown": "-Israeli airstrikes on a training college near Gaza City being used to distribute aid.\n-Israeli tanks pushing further into the southern city of Rafah."}, {"id": "b230b701-4d4f-4859-a79d-d98fda13e6db", "title": "An Israel Offensive into Lebanon Risks an Iranian Military Response , Top US Military Leader Says", "date": "2024-06-24 00:00", "url": "https://www.newsmax.com/world/globaltalk/israel-offensive-lebanon/2024/06/23/id/1169829/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "Israeli officials have threatened a military offensive in Lebanon if there is no negotiated end to push Hezbollah away from the border.\nU.S. President Joe Biden’s senior adviser, Amos Hochstein, met with officials in Lebanon and Israel last week in an effort to deescalate tensions.\nIt is harder to fend off the shorter-range rockets that Hezbollah fires routinely across the border into Israel, he said.\nThe situation escalated this month after an Israeli airstrike killed a senior Hezbollah military commander in southern Lebanon.\nHezbollah retaliated by firing hundreds of rockets and explosive drones into northern Israel and Israel responded with a heavy assault on the militant group.", "location": "Lebanon", "classification": "security", "score": 0.8064169326975759, "event_breakdown": "Israeli officials have threatened a military offensive in Lebanon if Hezbollah does not move away from the border, he said. The U.S. is trying to deescalate tensions."}, {"id": "9b09f3ca-233c-4d76-8d7a-03c28b7a1d5a", "title": "Lebanese minister denies Hezbollah weapons at Beirut airport", "date": "2024-06-24 04:15", "url": "https://www.bssnews.net/international/196399", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "BEIRUT, June 24, 2024 (BSS/AFP) - Lebanon's transport minister denied on Sunday that Hezbollah was storing weapons at Beirut airport, as fears grow of all-out war between the militant group and Israel.\n\"I am holding this press conference to clarify that everything that has been written in The Telegraph is false and to say that there are no weapons entering or leaving Beirut airport,\" Hamieh told journalists.\nHe spoke from Beirut International Airport, located in an area south of the capital where Hezbollah is influential.\nIsrael has for years accused Hezbollah of keeping precision rockets and missiles in different installations throughout Lebanon, including on a site near Beirut airport.\nCross-border exchanges and tension have escalated over the past two weeks after an Israeli air strike killed a senior Hezbollah commander.", "location": "BEIRUT.", "classification": "security", "score": 0.9275512590888274, "event_breakdown": "1. BEIRUT. June 24, 2024 (BSS/AFP) - Lebanon's transport minister Hamieh denies that Hezbollah is storing weapons at Beirut airport. Fears of all-out war between the militant group and Israel is growing. (location: Beirut/Lebanon)"}, {"id": "0a1d51ea-337f-4645-81a6-8c073965f2fe", "title": "1 dead in fatal bodega stabbing in Queens , suspect at large : NYPD", "date": "2024-06-24 04:45", "url": "https://www.yahoo.com/news/1-dead-fatal-bodega-stabbing-021449878.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "QUEENS, N.Y. (PIX11) — Police are still investigating a fatal stabbing that happened inside a bodega in Jamaica, Queens, on Saturday that left one person dead.\nWitnesses say the altercation between two men started outside a Dollar General before one of them ran across the street and entered the bodega where the deadly stabbing happened.\nShe was closing the Dollar General store on Jamaica Ave and 169th Street in Jamaica when she heard a commotion outside.\nThe two men and the victim were throwing objects at each other before one of them got close enough to stab him.\nHis dad, Maurice, adds, “People are scared to come to Jamaica Avenue because there is a crime, you know, and crime is no good.”Authorities say the suspect fled eastbound on Jamaica Avenue wearing a gray shirt.", "location": "JAMAICA", "classification": "security", "score": 0.7096998807152207, "event_breakdown": "Security Event 1: Fatal Stabbing at Bodega in Jamaica, Queens\nOne person is dead after a stabbing at a bodega on Jamaica Ave and 169th Street in Jamaica, Queens. A dispute between two men started as a commotion outside a Dollar General, and one of the two men stabbed the victim. The suspect fled eastbound on Jamaica Ave."}, {"id": "3e8a193b-2fff-4fe0-ae48-10da9d27c35a", "title": "  Get a Job  Germans Tell Ukrainians There – Ukraine at War Update for June 24", "date": "2024-06-24 02:00", "url": "https://www.kyivpost.com/post/34741", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "“Such actions will not be left without a response,” the Russian Ministry of Defense said.\nThe day before, Russia had launched air strikes on Ukraine’s second-largest city, Kharkiv, killing two people and injuring some 50 others.\nAlso, it attacked Kyiv with cruise missiles launched from the Sea of Azov, injuring two and destroying residences.\nThe Ukrainian Air Force said it had shot down two of the three Kalibr missiles bearing down on the capital.\n“We need stronger cooperation commitments for asylum seekers when it comes to employment.", "location": "Kyiv, Ukraine", "classification": "security", "score": 0.82190452877126, "event_breakdown": "Target Event: Russia- Ukraine conflict:\nRussia-Ukraine conflict has been ongoing for a long time. Russia has attacked Ukraine with air strikes and many people have been killed, including civilians. In response to these attacks, Ukraine has called on civilians to help fight the Russian forces. There are also reports that Russia is considering directly attacking NATO countries, which would potentially trigger a military conflict with the western forces."}, {"id": "906d8eef-397d-4152-b8f2-5b961380848e", "title": "Likely Yemen Houthi rebel attack targets ship in Gulf of Aden as Eisenhower reportedly heads home", "date": "2024-06-24 08:15", "url": "https://naharnet.com/stories/en/306080-likely-yemen-houthi-rebel-attack-targets-ship-in-gulf-of-aden-as-eisenhower-reportedly-heads-home", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "A commercial ship traveling through the Gulf of Aden saw explosions near the vessel, authorities said Saturday, likely the latest attack by Yemen's Houthi rebels attempting to target the shipping lane.\nMeanwhile, U.S. officials reportedly ordered the USS Dwight D. Eisenhower, the aircraft carrier leading America's response to the Houthi attacks, to return home.\nThe captain of the ship targeted late Friday saw \"explosions in the vicinity of the vessel,\" the British military's United Kingdom Maritime Trade Operations center said.\nThe report said an aircraft carrier operating in the Pacific would be taking the Eisenhower's place.\nThe closest American aircraft carrier known to be operating in Asia is the USS Theodore Roosevelt.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.7186370458719493, "event_breakdown": "Location: Gulf of Aden\nEvent: Houthi rebels attack commercial ships\nCarrier Operating in Pacific to take over from where Eisenhower left\nLocation: Pacific ocean\nEvent: USS Theodore Roosevelt to replace USS Eisenhower\nThese events are related to the current security situation."}, {"id": "249fce5a-e874-4cb1-a6f4-d969e74d02a9", "title": "Hezbollah Continues Attacks On Israel , Jewish State Expected To Shut Them Down ; Concerns About American Forces , Direct Iran Involvement", "date": "2024-06-24 03:45", "url": "https://www.klove.com/news/us-and-world/hezbollah-continues-attacks-on-israel-jewish-state-expected-to-shut-them-down-concerns-about-american-forces-direct-iran-involvement-50797", "domain": "klove.com", "domain_classification": "Unknown", "message": "Israeli officials have threatened a military offensive in Lebanon if there is no negotiated end to push Hezbollah away from the border.\nU.S. President Joe Biden’s senior adviser, Amos Hochstein, met with officials in Lebanon and Israel last week in an effort to deescalate tensions.\nIt is harder to fend off the shorter-range rockets that Hezbollah fires routinely across the border into Israel, he said.\nThe situation escalated this month after an Israeli airstrike killed a senior Hezbollah military commander in southern Lebanon.\nHezbollah retaliated by firing hundreds of rockets and explosive drones into northern Israel and Israel responded with a heavy assault on the militant group.", "location": "Lebanon", "classification": "security", "score": 0.8064169326975759, "event_breakdown": "Israeli officials have threatened a military offensive in Lebanon, U.S. President Joe Biden's senior adviser Amos Hochstein met with officials in Lebanon and Israel last week in an effort to deescalate tensions, Hezbollah fired hundreds of rockets."}, {"id": "827243ff-0441-4115-9160-59021cfcdef5", "title": "An Israel offensive into Lebanon risks an Iranian military response , top US military leader says", "date": "2024-06-24 01:30", "url": "https://www.news-gazette.com/news/nation-world/an-israel-offensive-into-lebanon-risks-an-iranian-military-response-top-us-military-leader-says/article_a470dfa7-7b5f-5f54-b0f2-982eff967447.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "An Israel offensive into Lebanon risks an Iranian military response, top US military leader saysThe top U.S. military officer says that an Israeli military offensive into Lebanon will risk an Iranian response in defense of Hezbollah, triggering a broader war that could put U.S. forces in danger", "location": "Lebanon", "classification": "security", "score": 0.7347026363872112, "event_breakdown": "IDF launches airstrikes on Lebanon in response to Hezbollah rocket attack"}, {"id": "dd785a97-801d-41ec-ac2f-0935107f0f7d", "title": "Hizbollah targets Israeli barracks after Islamist commander death", "date": "2024-06-24 00:30", "url": "http://www.jordantimes.com/news/region/hizbollah-targets-israeli-barracks-after-islamist-commanders-death", "domain": "jordantimes.com", "domain_classification": "Unknown", "message": "Israel and the powerful Iran-backed group, a Hamas ally, have exchanged near-daily cross-border fire since the Gaza war erupted on October 7.\nThe Israeli military meanwhile said in a statement that a drone had \"crossed from Lebanon and fell in the area of Beit Hillel\", adding that \"no injuries were reported\".\nHizbollah later said it had struck with a \"squadron of assault drones\" the \"headquarters of the newly created 91st Division in Ayelet Hashahar\" near the northern Israeli city of Safed.\nHizbollah chief Hassan Nasrallah responded with threats that no part of Israel would be spared in the event of an all-out war.\nIsraeli authorities say at least 15 soldiers and 11 civilians have been killed in the country’s north.", "location": "The most relevant location for the events described in the text is \"Israel\". This is the location in which the exchange of", "classification": "security", "score": 0.9491575052045177, "event_breakdown": "Israel and the powerful Iran-backed group, a Hamas ally, have exchanged near-daiJondfireightlier, a Palestinian gunman opened fire in the Tel Aviv suburb of Bnei Brak, killing at least three people and injuring several, before being shot dead by the police.\nZoom in: On Thursday morning, The events occured at the al-Manara roundabout in the city of Jenin and targeted Israeli buses passing through the area, the Israeli military said in a statement."}, {"id": "e0cd07fa-ba41-4619-9838-6cdcd314a8a5", "title": "War in Middle East on brink of expanding , says Borrell", "date": "2024-06-24 07:45", "url": "https://www.rte.ie/news/middle-east/2024/0624/1456334-middle-east-conflict/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "European foreign policy chief Josep Borrell has said that the Middle East was close to seeing the conflict expanding into Lebanon just days after Lebanon's Iran-backed Hezbollah threatened EU member Cyprus.\nHezbollah began attacking Israel shortly after Hamas' 7 October assault sparked the war in Gaza, and the sides have been trading blows in the months since then.\nEarlier in June, Hezbollah targeted Israeli towns and military sites with the largest volleys of rockets and drones in the hostilities so far, after an Israeli strike killed the most senior Hezbollah commander yet.\nIn a statement, the Israeli military said the strike targeted Mohammad Salah, who it said was responsible for developing Hamas weaponry.\nThe Israeli offensive in retaliation has killed almost 37,600 people, according to Palestinian health authorities, and has left Gaza in ruins.", "location": "GAZA", "classification": "security", "score": 0.9002328006220457, "event_breakdown": "Target Event: The European Union's top diplomat has said that the Middle East is close to seeing the conflict expanding into Lebanon just days after Lebanon's Iran-backed Hezbollah threatened EU member Cyprus.\nOther Relevant Events:\nNot relevant."}, {"id": "16d269fd-6572-443a-a44e-5154725cb122", "title": "Russian Army Loses 1 , 300 More Soldiers In Ukraine Over Past Day", "date": "2024-06-24 06:45", "url": "https://menafn.com/1108363848/Russian-Army-Loses-1300-More-Soldiers-In-Ukraine-Over-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Russia's overall combat losses in Ukraine between February 24, 2022 and June 24, 2024 amounted to about 535,660 troops, including 1,300 killed or wounded in action in the past 24 hours.\nThe General Staff of the of Ukraine said this in a post on , Ukrinform reports.\nIn addition, Ukraine's defense forces destroyed 8,031 (+12) Russian tanks, 15,413 (+15) armored fighting vehicles, 14,246 (+51) artillery systems, 1,108 multiple rocket launchers, 863 anti-aircraft warfare systems, and 2,323 (+2) missiles.\nThe Russian also lost 359 warplanes, 326 helicopters, 11,382 (+27) tactical unmanned aerial systems, 28 warships/cutters, 1 submarine, 19,304 (+56) vehicles and fuel tankers, and 2,397 (+20) pieces of special equipment.\nThe latest reports on enemy losses are being verified.", "location": "Ukraine", "classification": "security", "score": 0.7638250002048406, "event_breakdown": "Current Ukrainian Security Events:\n\nRussia's overall combat losses in Ukraine between February 24, 2022 and June 24, 2024 amounted to about 535,660 troops, including 1,300 killed or wounded in action in the past 24 hours. These losses are listed on the map as red markings on the Russian Federation border.\n\nThis reporting is confirmed by the General Staff of the Ukraine."}, {"id": "84064dda-ef02-4d62-a4a1-408af9496063", "title": "Okinawa memorials memorialize island WWII Japanese loss", "date": "2024-06-24 04:00", "url": "https://www.stripes.com/theaters/asia_pacific/2024-06-23/okinawa-peace-memorial-hateruma-malaria-wwii-14278631.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "A man prays front of a new monument commemorating wartime malaria victims on Hateruma Island, Japan, on June 15, 2024.\nOn Hateruma island, the southernmost inhabited island in Japan, a monument went up March 31 in memory of the island’s wartime malaria victims.\nIn the Yaeyama islands, where the U.S. troops did not land, many people were killed by bombardment and malaria, according to Yaeyama Peace Memorial Museum’s website.\nOf the evacuees, 1,587 contracted malaria and 477 died of the disease, according to a Yaeyama Peace Memorial Museum spokeswoman.\nNearly 200 names were added this year to the Cornerstone of Peace at Okinawa Peace Memorial Park in Itoman, Okinawa, Japan, on June 19, 2024.", "location": "The main event is the memorial on Hateruma island in Japan.", "classification": "security", "score": 0.4587017435434556, "event_breakdown": "* A man prays front of a new monument commemorating wartime malaria victims on Hateruma Island, Japan, on June 15, 2024.\n\n* A monument went up March 31 in memory of the island’s wartime malaria victims."}, {"id": "e29f73a4-bcd1-4aff-9c1c-9d42ab3cfc1f", "title": "CRPF Jawan From Kerala Among 2 Killed In Naxal Attack In Chhattisgarh", "date": "2024-06-24 08:45", "url": "https://menafn.com/1108364109/CRPF-Jawan-From-Kerala-Among-2-Killed-In-Naxal-Attack-In-Chhattisgarh", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- AsiaNet News) Two Central Reserve Force (CRPF) personnel, one of whom was a Malayali, were killed on Sunday in Chhattisgarh's Sukma district when Naxalites detonated a truck using an improvised explosive device (IED).\nThe deceased Keralite, Vishnu R, 35, hailed from Palode in Thiruvananthapuram.\nThe security personnel were traveling in a truck and on motorcycles.\nNaxalites triggered an IED blast targeting the truck, which resulted in the deaths of constable Shailendra (29) and the driver, Vishnu R (35).\nThe late Vishnu was the son of Raghuvar and Ajitha, residing at Anizham House, Palode Farm Junction.", "location": "Chhattisgarh", "classification": "security", "score": 0.9931101437678329, "event_breakdown": "CRPF personnel killed in Chhattisgarh's Sukma district in Naxalite attack."}, {"id": "12cbc668-9cd7-4f6a-85b4-6f6a65b6bd45", "title": "Change in wind direction prompts worry about more North Korean trash balloon launches toward South", "date": "2024-06-24 07:15", "url": "https://www.wsls.com/news/2024/06/24/change-in-wind-direction-prompts-worry-about-more-north-korean-trash-balloon-launches-toward-south/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "In this photo provided by Fighters For A Free North Korea, North Korean defector Park Sang-hak, left, and a member of Fighters For A Free North Korea hold balloons bearing anti-North Korean propaganda leaflets in Paju, near the border with North Korea, South Korea, Thursday, June 20, 2024.\nSouth Korean Joint Chiefs of Staff spokesperson Lee Sung Joon told reporters Monday that the military is closely monitoring North Korean moves because northerly or northwesterly winds, favorable for North Korean balloon launches, were forecast on Monday.\nThe South Korean military didn't say how it would respond if North Korea conducts a new round of balloon launches.\nNorth Korea has reacted to past South Korean loudspeaker broadcasts and civilian balloon activities by firing rounds across the border, prompting South Korea to return fire, according to South Korea.\nEarlier Monday, South Korea, the United States and Japan issued a joint statement strongly condemning expanding military cooperation between Russia and North Korea.", "location": "Paju.", "classification": "security", "score": 0.5135635662621988, "event_breakdown": "Joint Chiefs of Staff"}, {"id": "366b2e78-420a-4627-95dc-11d840aed4f6", "title": "Change in wind direction prompts worry about more North Korean trash balloon launches toward South", "date": "2024-06-24 08:45", "url": "https://indianexpress.com/article/world/trash-balloon-north-korea-wind-direction-warfare-9411451/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "South Korean Joint Chiefs of Staff spokesperson Lee Sung Joon told reporters Monday that the military is closely monitoring North Korean moves because northerly or northwesterly winds, favorable for North Korean balloon launches, were forecast on Monday.\nNorth Korea said its balloon campaign was a tit-for-tat action against South Korean activists who flew political leaflets critical of its leadership across the border.\nA balloon believed to have been sent by North Korea, carrying various objects including what appeared to be trash, is pictured in Incheon, South Korea.\nThe South Korean military didn't say how it would respond if North Korea conducts a new round of balloon launches.\nNorth Korea has reacted to past South Korean loudspeaker broadcasts and civilian balloon activities by firing rounds across the border, prompting South Korea to return fire, according to South Korea.", "location": "South Korea", "classification": "security", "score": 0.4935684383323111, "event_breakdown": "North Korean missile activity, South Korean joint Chiefs of Staff spokesperson Lee Sung Joon\nNorth Korean balloon launch"}, {"id": "4a5be53f-ec4b-448c-ab02-bb1373f61e70", "title": "Hello Kitty , parasites : Inside North Korea trash balloons according to South", "date": "2024-06-24 08:45", "url": "https://www.asiaone.com/asia/hello-kitty-parasites-inside-north-korea-trash-balloons-according-south", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "North Korea has flown balloons carrying trash since late May, with hundreds landing in South Korea.\nSouth Korea deployed military explosives units and chemical and biological warfare teams to inspect the objects.\nNorth Korea, which suffers a chronic food shortage, depended on South Korea for massive shipments of chemical fertiliser until such aid was suspended in 2007 as Pyongyang accelerated weapons development.\nLast week, the North warned it would send more balloons carrying trash.\nALSO READ: South Korea to suspend military pact with North over trash balloons", "location": ")\nSouth Korea", "classification": "security", "score": 0.7483590086467814, "event_breakdown": "North Korea has flown balloons carrying trash since late May, with hundreds landing in South Korea. South Korea deployed military explosives units and chemical and biological warfare teams to inspect the objects."}, {"id": "afaa1c5c-342c-498a-a8ff-05d57c042165", "title": "Trash Balloons : North Korea Unconventional Retaliation", "date": "2024-06-24 09:15", "url": "https://www.devdiscourse.com/article/business/2993256-trash-balloons-north-koreas-unconventional-retaliation", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "North Korea has flown balloons carrying trash since late May, with hundreds landing in South Korea.\nSouth Korea deployed military explosives units and chemical and biological warfare teams to inspect the objects.\nNorth Korea has said the balloons were retaliation for a propaganda campaign by North Korean defectors and activists in the South who regularly send over balloons carrying food, medicine, money and leaflets criticising the North's leaders.\nNorth Korea, which suffers a chronic food shortage, depended on South Korea for massive shipments of chemical fertilizer until such aid was suspended in 2007 as Pyongyang accelerated weapons development.\nLast week, the North warned it would send more balloons carrying trash.", "location": "The main location where the main event takes place is South Korea.", "classification": "security", "score": 0.8025943228840862, "event_breakdown": "North Korea has flown balloons carrying trash, landing them in South Korea, as retaliation for a propaganda campaign by North Korean defectors and activists in the South."}, {"id": "c7c48a9e-0ba1-4a5e-8436-433072ced803", "title": "Netanyahu says Israel is winding down its Gaza operations . But he warns a Lebanon war could be next", "date": "2024-06-24 08:45", "url": "https://www.stripes.com/theaters/middle_east/2024-06-24/israel-gaza-operations-netanyahu-14280158.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "The comments threatened to further heighten the tensions between Israel and Hezbollah at a time when they appear to be moving closer to war.\nNetanyahu also signaled that there is no end in sight for the grinding war in Gaza.\nThe Iranian-backed Hezbollah began striking Israel almost immediately after Hamas’ Oct. 7 cross-border attack that triggered the Gaza war.\nIn the interview, Netanyahu said that Israel’s offensive in Gaza is winding down.\nNetanyahu ruled out one option favored by some of his ultranationalist governing partners — re-settling Israelis in Gaza.", "location": "Gaza", "classification": "security", "score": 0.6181710490705985, "event_breakdown": "1. Gaza war: Israel's offensive in Gaza is winding down. Netanyahu also signalled that there is no end in sight for the grinding war in Gaza.\n2. Hezbollah's targeting of Israel: The Iranian-backed Hezbollah began striking Israel almost immediately after Hamas' Oct. 7 cross-border attack that triggered the Gaza war."}, {"id": "4b6b9f3a-6b0c-4720-bde8-c6c7f2745e30", "title": "Naxal attack in Chhattisgarh : 2 CRPF jawans killed in IED blast in Sukma district – Indian Defence Research Wing", "date": "2024-06-24 07:15", "url": "https://idrw.org/naxal-attack-in-chhattisgarh-2-crpf-jawans-killed-in-ied-blast-in-sukma-district/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Naxal attack in Chhattisgarh: 2 CRPF jawans killed in IED blast in Sukma district| BySOURCE: ANITwo jawans of the Central Reserve Police Force (CRPF) were killed on Sunday in an IED blast planted by Naxalites between Silger and Tekulagudem, under the limits of Jagargunda Police Station in the Sukma district of Chhattisgarh.\nThe killed security personnel were identified as Vishnu R (35), hailing from Thiruvananthapuram, Kerala while the other jawan was identified as Shailendra (29) who hailed from Kanpur, Uttar Pradesh.\nThe security personnel were part of the Commando Battalion for Resolute Action (CoBRA) 201 battalion.\nThe IED was planted by Naxalites on the way from Camp Silger to Tekalgudem to cause harm to the security forces.\nThe four Naxals killed included a zonal commander, a sub-zonal commander as well as an area commander.", "location": "Sukma district, Chhattisgarh", "classification": "security", "score": 0.9943869713009202, "event_breakdown": "Naxal attack in Chhattisgarh: 2 CRPF jawans killed in IED blast in Sukma district."}, {"id": "6277a24a-4fb0-47e7-bcac-fc8b8fe8fbfa", "title": "Bangkok Post - A miraculous escape", "date": "2024-06-24 04:45", "url": "https://www.bangkokpost.com/life/arts-and-entertainment/2816605/a-miraculous-escape", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "More than 200 Thai students were studying in the Philippines when the Pacific War broke out on Dec 8, 1941.\nProf Francis Bowes Sayre, the US High Commissioner to the Philippines, a close friend of Siam, played a role in making sure Thai students would not be interned.\nPacha Osathanond, the assistant to the American superintendent of the Thai students, was having lunch when he saw these bomber formations over Manila.\nThe Thai students witnessed Imperial Japanese Army soldiers, riding bicycles, capture Manila on Jan 2, 1942.\nThe Aden Maru returned to Manila before the ship left for Saigon with only the Thai students on board.", "location": "Manila", "classification": "security", "score": 0.657944273854339, "event_breakdown": "Relevant events from the provided text:\n- Japanese soldiers capture Manila, Jan 2, 1942\n- Thai students witness Japanese soldiers riding bicycles capture Manila, Jan 2, 1942"}, {"id": "7aa45ae9-c9cb-4cfa-a49d-b63593ce343a", "title": "Student filmmakers shine spotlight on Apshinge military heritage with  Chhava  ", "date": "2024-06-24 08:00", "url": "https://news.webindia123.com/news/Articles/Business/20240624/4208616.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "The feature-length documentary 'Chhava', produced by Worldwide Photoworks, received a thunderous applause at its debut showing.\n'Chhava' takes audiences on a moving journey to Apshinge (Military), a place where the spirit of service and sacrifice fills every household.\nThe screening was an undeniable success, drawing a diverse crowd of over 400 villagers that ranged from cinephiles and historians to veterans and active military personnel.\nAnand Suryavanshi, a Kargil War hero said, \"This documentary brings out stories that are seldom heard but immensely powerful.\nOur students have done a magnificent job in capturing the essence of Apshinge's legacy, and the response tonight is overwhelming.\"", "location": "APshinge", "classification": "security", "score": 0.5018168000267738, "event_breakdown": "Title: 'Chhava' Documentary Premiered at Apshinge, Maharashtra\n\nDate: [current year]\n\nDescription: The feature-length documentary 'Chhava' produced by Worldwide Photoworks received a standing ovation at its premier showing at Apshinge, Maharashtra. The story of a village of heroes filled with the spirit of service and sacrifice was a moving tribute."}, {"id": "9232de24-afa8-42c4-a867-99e0ffb789f5", "title": "A US Navy aircraft carrier has arrived in South Korea just days after Russia and North Korea signed a defense pact", "date": "2024-06-24 07:00", "url": "https://www.businessinsider.in/defense/news/a-us-navy-aircraft-carrier-has-arrived-in-south-korea-just-days-after-russia-and-north-korea-signed-a-defense-pact/articleshow/111211986.cms", "domain": "businessinsider.in", "domain_classification": "Unknown", "message": "A US aircraft carrier has arrived in South Korea for military exercises.\nIts arrival comes days after Russia and North Korea agreed to an unprecedented defense pact.\nA US Navy aircraft carrier has arrived in South Korea at an opportune moment.\nThe Roosevelt previously participated in a two-day joint exercise with Japan and South Korea in April in the East China Sea.\nAfter the aircraft carrier finishes its exercises, it'll depart for the Middle East, where it will replace the Dwight D. Eisenhower Carrier Strike Group.", "location": ".\nKOREA", "classification": "security", "score": 0.5278123699767747, "event_breakdown": "Carrier Strike Group 9, U.S. Navy\n1. An aircraft carrier, and the ships in its strike group, had arrived in South Korea to participate in military exercises.\n2. The carrier previously conducted an exercise with South Korea and Japan."}, {"id": "1e413950-2f8e-4dc6-a86d-2a0b398d2d19", "title": "Suicide Squad Isekai Anime Unveils Opening Sequence And More Cast ; READ", "date": "2024-06-24 06:00", "url": "https://www.pinkvilla.com/entertainment/anime/suicide-squad-isekai-anime-unveils-opening-sequence-and-more-cast-read-1319671", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "As the name suggests, the anime is based on Suicide Squad from the world of DC Comics.\nNew Villains in Suicide Squad Isekai4 new villains were seen in the Opening theme of Suicide Squad Isekai.\nIt will be interesting to see which one among the Suicide Squad he antagonizes.\nThe Suicide Squad is faced with an ultimatum where they have 72 hours until the bombs on their neck explode.\nALSO READ: Suicide Squad Isekai Episode Schedule: Release Dates, Where to Watch, Plot & More", "location": "The exact location is not mentioned in the text.", "classification": "security", "score": 0.6674104900313307, "event_breakdown": "New Villains in Suicide Squad Isekai\nThe Suicide Squad is faced with an ultimatum where they have 72 hours until the bombs on their neck explode."}, {"id": "ce4a8b02-1caf-4959-8e41-9c8709381484", "title": "Orthodox priest , multiple police killed in gunmen attack in Russia North Caucasus , officials say", "date": "2024-06-24 03:15", "url": "https://economictimes.indiatimes.com/news/international/world-news/orthodox-priest-multiple-police-killed-in-gunmen-attack-in-russias-north-caucasus-officials-say/articleshow/111216778.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelGunmen opened fire at a synagogue, an Orthodox church and a police post in attacks across two cities in Russia's North Caucasus region of Dagestan on Sunday, killing an Orthodox priest and multiple police officers, the region's head said.The death toll from Sunday's attacks in the southern Russian region of Dagestan has risen to 19 people, Russia's investigative committee said on Monday.\n\"This is a day of tragedy for Dagestan and the whole country,\" Sergei Melikov, governor of the Dagestan region , said in a video published early on Monday on the Telegram messaging app.Melikov said that more than 19 police officers \"fell victim\" to what he said was a \" terrorist attack \",\" but he did not specify how many of the police were killed and how many were injured.\nRussia's Interfax agency reported that at least 19 police officers were killed.The simultaneous attacks across the cities of Makhachkala and Derbent came three months after 145 people were killed in an attack claimed by the Islamic State on a concert hall near Moscow, Russia's worst terrorist attack in years.There was no immediate claim of responsibility for the attacks in the volatile North Caucasus region.\nA spokesman for the Russian Orthodox Church said on Telegram that the priest, Nikolai Kotelnikov, was \"brutally murdered\".Six of the gunmen were shot and killed as the incidents unfolded, Melikov said.\nAuthorities were quoted as saying that both the synagogue and church were ablaze, and that two attackers had been killed.Russian media cited the head of the country's federation of Jewish communities as calling for people to avoid reacting to \"provocations\".In Israel, the Foreign Ministry said the synagogue in Derbent had been burned to the ground and shots had been fired at a second synagogue in Makhachkala.", "location": "Dagestan", "classification": "security", "score": 0.8611104805183736, "event_breakdown": "Security attack at synagogue in Derbent, Dagestan. Gunmen opened fire at a synagogue, an Orthodox church and a police post in attacks across two cities in Russia's North Caucasus region of Dagestan on Sunday, killing an Orthodox priest and multiple police officers. Security attack in Makhachkala, Dagestan. A spokesman for the Russian Orthodox Church said on Telegram that the priest, Nikolai Kotelnikov, was \"brutally murdered\"."}, {"id": "227dfdba-8764-44b3-9f14-2b938188c70f", "title": "Thousands of Iran - Backed Fighters Ready to Join Hezbollah in War Against Israel", "date": "2024-06-24 07:15", "url": "http://www.hngn.com/articles/261648/20240623/foreign-fighters-iran-ready-join-hezbollah-war-israel-lebanon-border-hassan-nasrallah.htm", "domain": "hngn.com", "domain_classification": "Unknown", "message": "Thousands of Iran-backed foreign fighters are reportedly poised to join forces with Hezbollah if its ongoing conflict with Israel along the Lebanese border escalates into all-out war.\nSome of the groups have already launched attacks against Israel and its allies since the war between Israel and Hamas erupted on Oct. 7, AP said.\nQassim Qassir, an expert on Hezbollah, told AP that the combat being waged now primarily involved firing missiles and didn't require an influx of militants.\nThe vast majority of the Lebanese casualties were Hezbollah fighters but 70 casualties involved civilians and noncombatants, AP said.\nIsrael and Hezbollah last engaged in large-scale combat in summer of 2006, when they fought a 34-day war that killed about 1,200 people in Lebanon and 140 in Israel.", "location": "Lebanon", "classification": "security", "score": 0.8703360945268458, "event_breakdown": "Iran-backed foreign fighters poised to join forces with Hezbollah along the Lebanese border"}, {"id": "cbdb0f96-4ef1-49b8-8497-d7bd9bec80e7", "title": "Russians Attack Odesa - Fire Breaks Out At Hit Site , Casualties Reported", "date": "2024-06-24 10:15", "url": "https://menafn.com/1108364573/Russians-Attack-Odesa-Fire-Breaks-Out-At-Hit-Site-Casualties-Reported", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) On the morning of June 24, Russian attacked civilian infrastructure in Odesa, causing casualties.\nThe head of the Odesa Regional State Administration, Oleh Kiper, reported this on Telegram , Ukrinform reports.\nAccording to him, as a result of the Russian attack, civilian infrastructure in Odesa was hit.\nRussian army launches ballistic missile attack on coastal area ofregionEarlier, the mayor of the city, Hennadii Trukhanov, reported about the explosion during the air raid on Telegram.\nAs reported, Russian troops shelled 23 settlements in the Kherson region yesterday, killing one person and injuring eight.", "location": "ODESSA", "classification": "security", "score": 0.9789568707456137, "event_breakdown": "Russian army attacks Odesa, Ukraine on June 24th, 2022, killing 1 person and injuring 8 others."}, {"id": "7a57eaa0-e322-4c8d-b98b-46221792eeb4", "title": "Israel  intense  operations in Gaza  about to end  with attention to move to Hezbollah : Netanyahu", "date": "2024-06-24 03:15", "url": "https://www.washingtonexaminer.com/news/world/3056079/israels-intense-operations-gaza-end-attention-move-hezbollah-netanyahu/", "domain": "washingtonexaminer.com", "domain_classification": "Unknown", "message": "Israel’s “intense” phase of war with Hamas in Gaza is “about to end,” Israeli Prime Minister Benjamin Netanyahu said on Sunday, signaling that the Jewish state’s attention will likely turn to the country’s north amid threats from Hezbollah.\n“The intense phase of the fighting against Hamas is about to end,” Netanyahu told Channel 14, an Israeli television station.\n“It doesn’t mean that the war is about to end, but the war in its intense phase is about to end in Rafah.\nAfter the end of the intense phase, we will be able to redeploy some forces to the north, and we will do that.\nThe level of threats between Israel and Hezbollah intensified following last week’s killing by Israel of Hezbollah’s most senior commander.", "location": "GAZA", "classification": "security", "score": 0.4163263354108826, "event_breakdown": "Event 1: Israel's \"intense\" phase of war with Hamas in Gaza is \"about to end\".\nPrime Minister of Israel Benjamin Netanyahu said on Sunday that Israel is looking to redeploys forces to the north after fighting the intense phase of war against Hamas in Gaza"}, {"id": "099062fa-b794-44bf-8ed3-d21672e90fbd", "title": "Russia Says US Is Responsible for Deadly Ukrainian Attack on Crimea", "date": "2024-06-24 12:45", "url": "https://www.theepochtimes.com/world/russia-says-us-is-responsible-for-deadly-ukrainian-attack-on-crimea-5674181", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "MOSCOW—Russia said on Sunday that the United States was responsible for a Ukrainian attack on Crimean peninsula with five U.S.–supplied missiles that killed four people, including two children, and injured 151 more.\nFootage on Russian state television showed people running from a beach and some people being carried off on sun loungers.\nThe United States began supplying Ukraine with longer range ATACMS missiles, which have a 300-kilometre (186-mile) range, earlier this year.\nRussia will respond to Sunday’s attack, the Defense Ministry said, without elaborating.\nThe Kremlin said President Vladimir Putin had been “in constant contact with the military” since the attack.", "location": "Ukraine", "classification": "security", "score": 0.4407253029626973, "event_breakdown": "Five dead and 150 injured in Ukrainian attack on Crimea with U.S.-supplied missiles."}, {"id": "6394ec94-fe0f-45f5-a25d-d858b1453018", "title": "Top U . S . General Warns  Harder for U to Assist Israel in Confrontation With Hezbollah - Israel News", "date": "2024-06-24 13:30", "url": "https://www.haaretz.com/israel-news/2024-06-24/ty-article/top-u-s-general-warns-harder-for-us-to-assist-israel-in-confrontation-with-hezbollah/00000190-495e-d768-adf8-4dfe4dd50000", "domain": "haaretz.com", "domain_classification": "Local - Middle East", "message": "Brown told reporters before stopping in Cape Verde on his way to regional defense talks in Botswana.\nAnd I would just say I would see Iran be more inclined to provide greater support to Hezbollah,\" Brown said.\nThe Iran-backed terror organization, Hezbollah, began attacking Israel shortly after Hamas' October 7 massacre sparked the war in Gaza.\nHezbollah has said it will continue its attacks until there is a ceasefire in Gaza.\nEarlier in June, Hezbollah targeted Israeli towns and military sites with the largest volleys of rockets and drones in the hostilities so far, after an Israeli strike killed the most senior Hezbollah commander yet.", "location": "Israel", "classification": "security", "score": 0.5011344099823897, "event_breakdown": "Event 1: Hezbollah started attacking Israel on October 7, 2021, after Hamas' massacre sparked a ware in Gaza\nEvent 2: Hezbollah fired the largest volleys of rockets and drones targeting Israeli towns and military sites on June 1, 2022, after an Israeli strike killed the most senior Hezbollah commander yet."}, {"id": "1104316e-5bbb-4be3-88a9-715f93cfb92b", "title": "Russia appears to be placing military facilities near civilian areas in Crimea to deter Ukrainian strikes , experts say", "date": "2024-06-24 12:45", "url": "https://www.yahoo.com/news/russia-appears-placing-military-facilities-113859834.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia appears to be placing military facilities near civilian areas in Crimea to deter Ukrainian strikes, experts sayRussia appears to be placing military facilities near civilian areas in Crimea to deter Ukrainian strikes, experts sayRussia accused Ukraine of injuring civilians in an ATACMS attack on Crimea on Sunday.\nRussia is likely placing military facilities near civilians to deter Ukrainian strikes, experts say.\nRussia is likely placing military facilities near civilian areas in Crimea to try to deter further Ukrainian strikes, military analysts said.\nPlacing potential military targets near civilian infrastructure is a strategy Russia has leveraged in the past, with the Zaporizhzhia nuclear power plant and schools in occupied Ukraine used to shield Russian military equipment, the ISW reported.\nHowever, in doing so, Russia is likely breaking its own International Humanitarian Law, which says that military command must refrain from placing military targets close to or in highly populated areas.", "location": "Crimea", "classification": "security", "score": 0.9440183309613563, "event_breakdown": "1. Russia is likely placing military facilities near civilian areas in Crimea to deter Ukrainian strikes, military analysts said. 2. Russia has accused Ukraine of injuring civilians in an ATACMS attack on Crimea on Sunday."}, {"id": "576996ae-6eeb-4086-bb61-a3972a6193cb", "title": "Suspected Yemen Houthi attack targets vessel in waters further away than many previous assaults", "date": "2024-06-24 10:15", "url": "https://www.clickorlando.com/news/world/2024/06/24/suspected-yemen-houthi-attack-targets-vessel-in-waters-further-away-than-many-previous-assaults/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "The attack was just off to the northeast of Yemen's Socotra Island, also held by allies of the exiled government.\n“The master of a merchant vessel reports an explosion in close proximity to the vessel,” the UKMTO said.\n“The crew are reported safe and the vessel is proceeding to its next port of call.”It offered no other immediate information about the attack.\nOf the more than 60 attacks launched by the Houthis since November that specifically targeted vessels, this would be one of the furthest.\nHowever, the distance at which it was struck led experts to question whether Iran, the Houthis' main benefactor, could have launched the attack.", "location": "SANA'A, Yemen", "classification": "security", "score": 0.7415407500701102, "event_breakdown": "Houthi rebels attacked a merchant vessel off the coast of Yemen's Socotra Island on Wednesday, June 22, the UKMTO said. There were no reports of injuries."}, {"id": "c66b1e3c-a989-4a03-9562-260c1e9c280d", "title": "Suspected Yemen Houthi attack targets vessel in waters further away than many previous assaults", "date": "2024-06-24 12:15", "url": "https://isp.netscape.com/news/world/story/0001/20240624/3c1756a60efb061960b6eda1bc580834", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Suspected Yemen Houthi attack targets vessel in waters further away than many previous assaultsDUBAI, United Arab Emirates (AP) — A possible attack by Yemen's Houthi rebels on Monday targeted a ship further away from nearly all of the previous assaults they've launched in the Gulf of Aden, officials said, potentially part of a widening escalation by the group.\nThe attack was just off to the northeast of Yemen's Socotra Island, also held by allies of the exiled government.\n“The master of a merchant vessel reports an explosion in close proximity to the vessel,” the UKMTO said.\n“The crew are reported safe and the vessel is proceeding to its next port of call.”It offered no other immediate information about the attack.\nOf the more than 60 attacks launched by the Houthis since November that specifically targeted vessels, this would be one of the furthest.", "location": "Based on the information provided, it appears that the attack took place in the Gulf of Aden, specifically in the waters northeast of Yemen's", "classification": "security", "score": 0.724815413222204, "event_breakdown": "Target event - A possible Houthi rebel attack on a ship in the Gulf of Aden, off the coast of Yemen. The vessel is off to the east of the Socotra Islands. The vessel's crew is safe, and the vessel is proceeding to its next port of call. The event was reported by the United Kingdom Marine Trade Organization."}, {"id": "0d55ab1f-a2bf-421f-be60-5ef0f13e24a9", "title": "South Korea completes deployment of KUH - 1 Surion to army", "date": "2024-06-24 11:00", "url": "https://www.flightglobal.com/helicopters/south-korea-completes-deployment-of-kuh-1-surion-to-army/158873.article", "domain": "flightglobal.com", "domain_classification": "Unknown", "message": "South Korea has completed the deployment of the Korea Aerospace Industries (KAI) KUH-1 Surion utility helicopter to the country’s army.\nThe programme involved four production contracts that saw “about 200” examples produced for the army, according to the Defense Acquisition Program Administration (DAPA).\nFollowing the type’s development from 2006, the army received its first Surion in 2012, with deliveries completed this month.\nIn army service the type performs a range of missions, including assault, cargo airlift, and command and control.\nCirium fleets data indicates that in addition to the army, variants are in service with the marines, coastguard, the South Korean police, and other agencies.", "location": "South Korea", "classification": "security", "score": 0.6027585370478115, "event_breakdown": "Event 1: On April 18, South Korea completed the deployment of KAI KUH-1 Surion utility helicopters to their Army. The aircraft will be used for assault, cargo airlift, and command and control missions."}, {"id": "8cbf35e3-953c-4e1a-90b8-ddf3e061197f", "title": "Four Killed In Ukraine Missile Attack On Crimea , Russia Says | New Spotlight Magazine", "date": "2024-06-24 05:00", "url": "https://www.spotlightnepal.com/2024/06/24/four-killed-ukraine-missile-attack-crimea-russia-says/", "domain": "spotlightnepal.com", "domain_classification": "Unknown", "message": "Russia-installed authorities of Sevastopol in Ukraine's southern region of Crimea say a Ukrainian missile strike on the port city has left four people dead and 144 others wounded.\nThe Russian defense ministry says in a statement that the attack shortly after midday on Sunday involved five ATACMS missiles supplied by the United States to Ukraine.\nThe ministry says Washington is mostly responsible for the deliberate missile strike as it delivered the weapons to Ukraine.\nThe Army Tactical Missile System, or ATACMS, is reportedly capable of precision strikes.\nUS media outlets report that missiles launched by the system have a range of about 300 kilometers.", "location": ".\nSIMFEROPOL, Crimea", "classification": "security", "score": 0.6772874979521253, "event_breakdown": "Target event - Miltary assult in russia ukraine\nFour people reported killed in Sevastopol, Ukraine by Ukrainian missile strike, 144 others reported wounded."}, {"id": "b0688b73-7848-402e-81e6-1a62697dcef4", "title": "Israel Offensive in Lebanon Could Increase Risk of Broader War", "date": "2024-06-24 12:45", "url": "https://chronicle.lu/category/international-news/50376-israel-offensive-in-lebanon-could-increase-risk-of-broader-war-us-general", "domain": "chronicle.lu", "domain_classification": "Unknown", "message": "Brown, the chairman of the Joint Chiefs of Staff, did not predict Israel's next steps and acknowledged Israel's right to defend itself.\nBut he cautioned that a Lebanon offensive \"can drive up the potential for a broader conflict.\"\n\"Hezbollah is more capable than Hamas as far as overall capability, number rockets and the like.\nIran-backed Hezbollah began attacking Israel shortly after Hamas' 7 October assault sparked the war in Gaza, and the sides have been trading blows in the months since then.\nBrown's remarks came as Israeli Defence Minister Yoav Gallant headed to Washington on Sunday to discuss the next phase of the Gaza war and escalating hostilities on the border with Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.5547117235020366, "event_breakdown": "Israel's Defence Minister headed to Washington on Sunday to discuss the next phase of the Gaza war and escalating hostilities on the border with Lebanon."}, {"id": "dd9c95f7-4912-4b4e-a6eb-fc3c14eab802", "title": "Russian Foreign Ministry Summons US Ambassador Over Attack on Sevastopol", "date": "2024-06-24 13:30", "url": "https://sputnikglobe.com/20240624/russian-foreign-ministry-summons-us-ambassador-over-attack-on-sevastopol-1119093785.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240624/russian-foreign-ministry-summons-us-ambassador-over-attack-on-sevastopol-1119093785.htmlRussian Foreign Ministry Summons US Ambassador Over Attack on SevastopolRussian Foreign Ministry Summons US Ambassador Over Attack on SevastopolSputnik InternationalThe Russian Foreign Ministry said on Monday that it had summoned US Ambassador to Russia Lynne Tracy to express a demarche in connection with Kiev's missile attack on Sevastopol.\n2024-06-24T09:51+00002024-06-24T09:51+00002024-06-24T13:07+0000russiasevastopolrussian foreign ministryarmy tactical missile system (atacms)kievwashingtonusambassadorshipus ambassadordeadly ukrainian attack on sevastopolhttps://cdn1.img.sputnikglobe.com/img/07e8/03/14/1117438850_0:133:3012:1827_1920x0_80_0_0_cdab946e2be725047d12c5b44a190278.jpg\"During a conversation at the Russian Foreign Ministry on June 24 with the summoned head of the US diplomatic mission in Russia, Lynne Tracy, a demarche was made in connection with the new bloody crime of the Kiev regime, sponsored and armed by Washington, which launched a targeted missile attack on the civilian population of Sevastopol, accompanied by numerous casualties, including children,\" the ministry said in a statement.\nWashington’s actions encouraging the pro-Nazi authorities of Ukraine to take military action will not go unpunished, the ministry said, adding that there will be response measures.\nThe attack killed at least four people and injured more than 150 others.\nhttps://sputnikglobe.com/20240623/why-us-and-ukraine-deliberately-chose-russias-sevastopol-for-terror-attack-1119081063.htmlsevastopolkievwashingtonSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 602024Sputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Newsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Sputnik Internationalrussian foreign ministry, us ambassador, attack on sevastopol", "location": "Sevastopol", "classification": "security", "score": 0.6123136669190762, "event_breakdown": "The Russian Foreign Ministry summoned US Ambassador over attack on Sevastopol."}, {"id": "2c7c260f-1eba-408f-885b-7b304300755c", "title": "Fatal Step For Lukashenka", "date": "2024-06-24 10:45", "url": "https://charter97.org/en/news/2024/6/24/600133/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Fatal Step For Lukashenka 21 OLEKSANDR LEVCHENKO24.06.2024, 10:2234,100Is there a possibility of Belarus' direct entry into the war?\nMilitary units and subunits of operational commands, special operations forces, missile troops and artillery, air force and air defence forces are taking part in the inspection.\nThen Lukashenka said that Belarus did not want to wage war and did not want a foreign land, but was preparing for war.\nIn addition, the Belarusian Armed Forces have two artillery brigades, four anti-aircraft missile brigades and three anti-aircraft missile regiments, one missile and one rocket-artillery brigade.\nA step towards war could be fatal for official Minsk, and it would make Ukraine's position much more difficult.", "location": "RUSSIA", "classification": "security", "score": 0.6169390995251328, "event_breakdown": "Location: Belarus\nMilitary units, special operations forces, missile troops and artillery, air force and air defence forces are participating in inspections.\nLocation: Belarus\nThe Belarusian Armed Forces have two artillery brigades, four anti-aircraft missile brigades and three anti-aircraft missile regiments, one missile and one rocket-artillery brigade."}, {"id": "976a28c6-1986-403e-ae88-b7201964a622", "title": "Crimean beachgoers struck by deadly shrapnel shower from missile", "date": "2024-06-24 09:45", "url": "https://www.watoday.com.au/world/europe/crimean-beachgoers-struck-by-deadly-shrapnel-shower-from-missile-20240624-p5jo7c.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "Moscow: Russia has blamed the United States for a Ukrainian attack on the Russian-annexed Crimean peninsula after missile fragments fell on beachgoers in an incident that killed four people, including two children, and injured 151 more.\nThe Russian Defence Ministry said four of the US-delivered Army Tactical Missile System (ATACMS) missiles, equipped with cluster warheads, were shot down by air defence systems and the ammunition of a fifth had detonated in mid-air.\nFootage shared on Telegram of people seeking treatment on the beach.\nCredit: TelegramFootage on Russian state television showed people running from a beach and some people being carried off on sun loungers.\nRussian-installed authorities in Crimea said missile fragments had fallen just after noon near a beach on the north side of the city of Sevastopol where locals were on holiday.", "location": "Crimea", "classification": "security", "score": 0.856406847136669, "event_breakdown": "Four people were killed and 151 injured in a Ukrainian missile attack near the city of Sevastopol on June 17, 2022. The Ukrainian attack included US-supplied Army Missile Tactical System (ATACMS) missiles with cluster warheads."}, {"id": "bde8287f-96da-4341-80a7-aa6e67a1e78e", "title": "Aerial drone launched by Yemen Houthi rebels hits ship in the Red Sea , causing damage and injuries", "date": "2024-06-24 09:45", "url": "https://www.dailyexcelsior.com/aerial-drone-launched-by-yemens-houthi-rebels-hits-ship-in-the-red-sea-causing-damage-and-injuries/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "Dubai, Jun 24 : An aerial drone launched by Yemen’s Houthi rebels struck and damaged a vessel in the Red Sea on Sunday, officials said, the latest attack by the group targeting shipping in the vital maritime corridor.\nThe drone attack happened around dawn off the coast of the rebel-held port city of Hodeida, the British military’s United Kingdom Maritime Trade Operations center said.\nHours after the attack, Houthi military spokesman Brig.\nGen. Yahya Saree claimed the attack, saying the rebels targeted the Transworld Navigator.\nSaree claimed without offering evidence the rebels instead used a drone boat in the attack, something contradicted by every other report on the assault.", "location": "Hodeida", "classification": "security", "score": 0.8726491216042619, "event_breakdown": "Dubai, Jun 24 : An aerial drone launched by Yemen’s Houthi rebels struck and damaged a vessel in the Red Sea on Sunday, officials said, the latest attack by the group targeting shipping in the vital maritime corridor. The attack happened around dawn off the coast of the rebel-held port city of Hodeida, the British military's United Kingdom Maritime Trade Operations center said. Hours after the attack, Houthi military spokesman Brig. Gen. Yahya Saree claimed the attack, saying the rebels targeted the Transworld Navigator. Saree claimed without offering evidence the rebels instead used a drone boat in the attack, something contradicted by every other report on the assault."}, {"id": "3c2bbe79-dce4-4392-b038-a5c13dbb5567", "title": "At least 15 officers killed in Dagestan attack", "date": "2024-06-24 07:15", "url": "https://www.albawaba.com/news/least-15-officers-killed-dagestan-attack-1573711", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA - According to local reports, at least 15 police officers have been killed in a shooting attack on two Orthodox churches and a synagogue in two cities in Dagestan.\nUPDATEThe death toll has risen to 19, with four additional civilians reportedly killed.\n\"According to preliminary data, 15 law enforcement officers were killed, as well as four civilians, including an Orthodox priest,\" the Investigative Committee said about Sunday's attack, adding that five perpetrators had also been \"liquidated\".\nA priest and several other civilians were also killed when gunmen opened fire on places of worship in the cities of Derbent and Makhachkala, which are about 120 kilometers apart.\nHead of Dagestan, Sergey Melikov, stated that six militants were also killed following the attacks on churches, synagogues and police posts in the cities of Derbent and the regional capital Makhachkala.", "location": "Dagestan", "classification": "security", "score": 0.9936601366126895, "event_breakdown": "[\nA mass shooting took place in Dagestan on January 19, 2020, killing 19 people including policemen and civilians.\n]"}, {"id": "6ab8051b-e762-43c3-9368-f1c1ac9bf081", "title": "Lebanon denies weapons are stored at Beirut airport : Deceptions and lies", "date": "2024-06-24 04:30", "url": "http://www.israelnationalnews.com/news/392004", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The Lebanese air transport association on Sunday denied claims that Hezbollah has been storing at Beirut’s main airport.\nThe organization that runs day-to-day operations at the airport dismissed claims that Iranian weapons were being flown in and stored at the transport hub.\nThe Lebanese air transport association said in response that the claims were “deceptions and lies aimed at exposing Beirut airport and its workers”, and announced a press tour of the airport on Monday.\nHezbollah has previously been accused of using the civilian airport for weapons storage, but the whistleblowers claimed it has escalated since the conflict between Hezbollah and Israel intensified in October.\nStaff at the airport and intelligence sources claimed in interviews with The Telegraph that weapons were travelling through the airport and being stored on site.", "location": "BEIRUT", "classification": "security", "score": 0.7040489466386703, "event_breakdown": "['Lebanese air transport association denies Hezbollah weapons storage in Beirut airport', 'The Lebanese air transport association has denied claims that Hezbollah has been storing at Beirut's main airport. The organization that runs day-to-day operations at the airport dismissed claims that Iranian weapons were being flown in and stored at the transport hub.']"}, {"id": "c289eb24-1a9f-4d69-acfe-40c8a91f93e0", "title": "Russian Missile Strike in Odesa : Civilian Infrastructure Hit , Injuries Reported", "date": "2024-06-24 13:30", "url": "https://www.devdiscourse.com/article/science-environment/2993417-russian-missile-strike-in-odesa-civilian-infrastructure-hit-injuries-reported", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "A Russian missile attack on the southern Ukrainian city of Odesa struck civilian infrastructure and injured at least three people, including a 19-year-old boy, on Monday morning, regional governor Oleh Kiper said.\nThe attack damaged a storage facility where some 50 people were working, military and regional authorities said.\nThe air force said it had prevented one of two cruise missiles launched by Russia from reaching the target.\nKiper said on national television that around 5,000 square metres had been damaged in the attack and that a fire had spread over 3,000 square metres.\nOdesa has been a frequent target of Russian forces in the 28-month-long full-scale invasion, with many attacks aimed at the city's port facilities.", "location": "ODESSA", "classification": "security", "score": 0.9779515991982346, "event_breakdown": "Target event not found."}, {"id": "447070f0-5fe5-42bf-9018-645bbd052837", "title": "An Israel offensive into Lebanon risks an Iranian military response , top US military leader says", "date": "2024-06-24 01:30", "url": "https://www.durangoherald.com/articles/an-israel-offensive-into-lebanon-risks-an-iranian-military-response-top-us-military-leader-says/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "Israeli officials have threatened a military offensive in Lebanon if there is no negotiated end to push Hezbollah away from the border.\nU.S. President Joe Biden’s senior adviser, Amos Hochstein, met with officials in Lebanon and Israel last week in an effort to deescalate tensions.\nIt is harder to fend off the shorter-range rockets that Hezbollah fires routinely across the border into Israel, he said.\nThe situation escalated this month after an Israeli airstrike killed a senior Hezbollah military commander in southern Lebanon.\nHezbollah retaliated by firing hundreds of rockets and explosive drones into northern Israel and Israel responded with a heavy assault on the militant group.", "location": "Lebanon", "classification": "security", "score": 0.8064169326975759, "event_breakdown": "1. Senior U.S. officials Amos Hochstein and Hady Amr visited Israel and Lebanon on May 22, 2022.\n2. Chinese Foreign Minister Wang Yi visited Iran on May 24, 2022.\n3. Europe's top diplomat Josep Borrell met Israel's Prime Minister Naftali Bennett in Jerusalem on May 26, 2022.\n4. Top diplomats of the United States and Israel met in Rome on May 28, 2022.\n5. Russian Foreign Minister Sergei Lavrov visited Amman for a meeting with Jordanian Foreign Minister Ayman Safadi on May 30, 2022.\n6. Iranian Ambassador to Sanaa Saeed Khatibzadeh met with Ansar Allah leader Abdulmalik al-Houthi in Sanaa on June 5, 2022.\n7. British Secretary of Defense Ben Wallace visited Ukraine on June 9, 2022.\n8. The NATO Secretary General Jens Stoltenberg and Russian Foreign Minister Sergey Lavrov had a phone conversation on June 8, 2022.\n9. Taliban top official Abdul Qahar Balkhi met with Qatari Deputy Prime Minister and Minister of Foreign Affairs Mohammad bin Abdulrahman Al-Thani in Kabul on June 13, 2022."}, {"id": "e2dc206e-7f6b-4dd0-8acc-dda266587b48", "title": "The IDF on track to dismantle Hamas last brigade in Rafah", "date": "2024-06-24 13:30", "url": "https://www.thejc.com/news/israel/the-idf-on-track-to-dismantle-hamass-last-brigade-in-rafah-wwqvgf07", "domain": "thejc.com", "domain_classification": "Unknown", "message": "The Israel Defence Forces is pursuing a phased approach in its ongoing offensive against Hamas’s last stronghold in Rafah, Gaza.\nAccording to Israeli military assessments, Hamas’s final functioning brigade will be dismantled in Rafah within weeks.\nAccording to an IDF source, of Hamas’s four Rafah battalions, only two are currently functional.\nOn June 20, the IDF reported that the Nahal infantry brigade, operating under the 162nd Division, had discovered large quantities of hidden weapons and tunnel shafts within and under civilian residences in Rafah.\nOn June 22, the Israeli Air Force attempted to eliminate Hamas’s head of operations, Raed Sa’ad, in a strike in Gaza City.", "location": "Rafah, Gaza", "classification": "security", "score": 0.9673458520915398, "event_breakdown": "Current events in security reported in text that can be placed on a map include:\n\n* The Israel Defence Forces pursuing a phased approach in its ongoing offensive against Hamas’s last stronghold in Rafah, Gaza.\n* According to Israeli military assessments, Hamas’s final functioning brigade will be dismantled in Rafah within weeks.\n* The Israeli Air Force attempted to eliminate Hamas’s head of operations, Raed Sa’ad, in a strike in Gaza City."}, {"id": "67f9b6c7-6448-4712-9e75-c5debe5cd6e4", "title": "Trash war : What inside the balloons that North Korea is sending across the border ? ", "date": "2024-06-24 13:00", "url": "https://www.firstpost.com/explainers/trash-war-whats-inside-the-balloons-that-north-korea-is-sending-across-the-border-13785601.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "The matter has escalated after North Korea has been sending trash-laden balloons towards its neighbour.\n“North Korea is again floating (suspected) balloons carrying trash towards the South,” reported news agency AFP quoting the Joint Chiefs of Staff.\nWhy is North Korea sending trash balloons across the border?\nExperts say there are now no legal grounds for the government to stop activists from sending balloons into North Korea.\nIn response to North Korea’s trash balloons, South Korea completely suspended a 2018 military deal with the North, which was meant to reduce tensions between the neighbours.", "location": "South and North Korea.", "classification": "security", "score": 0.7287111467566431, "event_breakdown": "North Korea sending trash balloons towards South Korea (location: between North Korea and South Korea)"}, {"id": "96b52d00-0678-4660-951d-43a07f9bf0f5", "title": "10 countries you probably never knew existed", "date": "2024-06-24 10:45", "url": "https://www.pulse.ng/lifestyle/10-countries-you-probably-never-knew-existed/f3fhlne", "domain": "pulse.ng", "domain_classification": "Unknown", "message": "Here are ten countries that you probably never knew existed, along with reasons why they don't exist anymore.\nEast Germany (1949-1990)ADVERTISEMENTThe German Democratic Republic (GDR), or East Germany, was established after World War II, when Germany was divided into East and West.\nControlled by the Soviet Union, East Germany became a socialist state.\nThe fall of the Berlin Wall in 1989 paved the way for German reunification, and by 1990, East Germany ceased to exist​.\nThe empire collapsed at the end of World War I, leading to the formation of several independent countries​​.", "location": "BERLIN", "classification": "security", "score": 0.5252020748910852, "event_breakdown": "Event 1: Kenya attack - On January 15, 2019, Al-Shabaab gunmen attacked the DusitD2 hotel in Nairobi, Kenya. The attack lasted until January 16 and resulted in 21 fatalities.\n\nEvent 2: Yemen missile attack - On January 19, 2019, a Houthi rebel ballistic missile attack struck the port city of Al-Mocha in Yemen, killing at least three people and wounding several others.\n\nEvent 3: Niger attack - On January 9, 2019, terrorists affiliated with the terror group Boko Haram attacked the village of Ngalewa near the Niger-Mali border, killing at least nine people and injuring several others.\n\nEvent 4: Afghanistan attack - On January 19, 2019, a suicide bomber detonated his explosives near a compound used by a provincial governor in eastern Afghanistan, killing at least four people and wounding several others.\n\nEvent 5: Pakistan attack - On January 5, 2019, a suicide bomb attack on a Sufi shrine in Quetta, Pakistan, killed at least 13 people and wounded several others. The attack was claimed by the Islamic State.\n\nEvent 6: Nigeria attack - On December 25, 2019, gunmen attacked the St. Francis Catholic Church in Owo, Nigeria, killing dozens of people .\n\nEvent 7: Iraq attack - On December 9, 2019, a suicide bombing"}, {"id": "c8aa09ff-6a67-462d-931d-1526a815d35f", "title": "ISW Reveals Who Could Be Behind Attack On Dagestan", "date": "2024-06-24 10:45", "url": "https://charter97.org/en/news/2024/6/24/600137/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "ISW Reveals Who Could Be Behind Attack On Dagestan 24.06.2024, 8:1828,542The militants have released a statement.\nA complex and coordinated attack on churches, synagogues and law enforcement structures in the Republic of Dagestan on June 23 was likely carried out by the North Caucasus branch of the Islamic State (IS) under the name of Vilayat Kavkaz.\nThis is the assessment of the events in Dagestan given by analysts of the Institute for the Study of War (ISW), commenting on the attack on an Orthodox church and two synagogues in Derbent and Makhachkala, where unknown persons opened fire.\nHowever, Al-Azaim did not take responsibility for the attack itself, and the mention of the Caucasus strongly suggests that it was Vilayat Caucasus that was responsible for the attack, ISW believes.\nHowever, the efforts and response of the Russian authorities after the attack on Crocus City Hall instead focused on baselessly blaming Ukraine and NATO for the attack.", "location": "MAKHACHKALA", "classification": "security", "score": 0.9510162371718784, "event_breakdown": "Location: Dagestan, Russia\nTarget event: Complex and coordinated attack on churches, synagogues and law enforcement structures in the Republic of Dagestan on June 23\nAdditional info: The attack was likely carried out by the North Caucasus branch of the Islamic State (IS) under the name of Vilayat Kavkaz."}, {"id": "6284fe74-13cf-4a11-b37b-b396604756af", "title": "Netanyahu announces winding down of operations in Gaza , transfer of Israel troops to Lebanon border", "date": "2024-06-24 09:00", "url": "https://news.am/eng/news/830694.html", "domain": "news.am", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu said Sunday that the current phase of fighting against Hamas in Gaza is winding down, setting the stage for Israel to send more troops to its northern border to confront the Lebanese Hezbollah group, reports AP.\nBut he said fewer troops would be needed in Gaza, freeing up forces to battle Hezbollah.\n“First and foremost, for defense,” he added, but also to allow tens of thousands of displaced Israelis to return home.\nNetanyahu said he hoped a diplomatic solution to the crisis could be found, but vowed to solve the problem “in a different way” if needed.\nIn the interview, Netanyahu said that Israel’s offensive in Gaza is winding down, but added that Israel would have to continue “mowing” operations—targeted strikes aimed at preventing Hamas from regrouping.", "location": "GAZA", "classification": "security", "score": 0.6733894116121156, "event_breakdown": "1- Israeli Prime Minister Benjamin Netanyahu said that the current phase of fighting against Hamas in Gaza is winding down.\n2- Netanyahu said that the Israeli military will focus on confronting the Lebanese Hezbollah group next."}, {"id": "94727a54-2083-4ea4-a77f-e9e8ed95d1cd", "title": "Fact Check : This Civil War Veteran Allegedly Survived Decades After Being Shot in the Forehead . We Checked the Records", "date": "2024-06-24 00:15", "url": "https://www.yahoo.com/news/fact-check-civil-war-veteran-230000474.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Claim:Civil War veteran Jacob Miller lived more than 50 years after surviving a musket ball shot to the forehead.\nRating:Rating: TrueThe story of Civil War soldier Jacob Miller (spelled \"Millar\" in some instances), is seemingly miraculous, if nothing else.\nAccording to NPS records, Miller served as a private with the 6th Regiment of the Indiana Infantry in the Union Army.\nSnopes contacted the National Archives and Records Administration (NARA) in Washington, D.C., for access to Miller's records.\nSnopes has examined other claims involving the Civil War, which can be viewed in our archive.", "location": "Indianapolis", "classification": "security", "score": 0.46839964133223433, "event_breakdown": "Civil War veteran Jacob Miller survived a musket ball shot to the forehead and lived more than 50 years."}, {"id": "6f69f463-eaae-4763-852f-77d6cf76c9c0", "title": "Russia summons US ambassador to Moscow over Sevastopol attack", "date": "2024-06-24 13:30", "url": "https://www.bssnews.net/international/196504", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "MOSCOW, June 24, 2024 (BSS/TASS) - US Ambassador to Moscow Lynne Tracy was summoned to the Russian Foreign Ministry over Sunday's deadly attack on Sevastopol on Monday.\nResponse measures will definitely follow,\" the Russian Foreign Ministry underscored.\nUkraine attacked civilian infrastructure in Sevastopol using ATACMS tactical missiles equipped with cluster munitions on Sunday.\nFour people, including two children, were killed in the attack, with over 150 others being injured, Sevastopol Governor Mikhail Razvozhayev said.\nJune 24 was designated as a day of mourning in Sevastopol and Crimea.", "location": "MOSCOW", "classification": "security", "score": 0.7673874722041678, "event_breakdown": "Location: Sevastopol, Russia\nTarget event: Ukraine attacked Sevastopol on Sunday using ATACMS tactical missiles equipped with cluster munitions, killing four people and injuring over 150 others."}, {"id": "57a54bc3-a05a-45dc-8ea7-c4e9b1546e38", "title": "EU adopts 14th package of sanctions against Russia", "date": "2024-06-24 12:45", "url": "https://georgiatoday.ge/eu-adopts-14th-package-of-sanctions-against-russia/", "domain": "georgiatoday.ge", "domain_classification": "Unknown", "message": "The EU adopted a 14th package of sanctions against Russia.\nThe package contains important new energy-related measures targeting liquified natural gas (LNG), and measures targeting vessels which support Russia’s war.\nAs regards LNG, the package prohibits all future investments in, and exports to, LNG projects under construction in Russia.\nMoreover, the package prohibits the import of Russian LNG into specific terminals which are not connected to the EU gas pipeline network.\nThe package also finetunes the import ban on Russian diamonds already agreed in the 12th sanctions package.", "location": "BRUSSELS", "classification": "security", "score": 0.4815473257423758, "event_breakdown": "14th package of sanctions against Russia - targets liquified natural gas (LNG)"}, {"id": "85aeab37-df31-4535-ad93-64c70a1f31c5", "title": "Could 4th drug war conviction be the  last tokhang case  in court ? ", "date": "2024-06-24 04:00", "url": "https://www.rappler.com/newsbreak/in-depth/bonifacio-case-4th-conviction-drug-war-could-be-last/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "Mary Ann sat in silence as she awaited the verdict of Caloocan City Regional Trial Court (RTC) Branch 121.\nBefore the judge arrived, Mary Ann let go of the tears she was holding back and cried in her son’s shoulder.\nOnly the 4th convictionHuman rights groups estimated that around 30,000 were killed under Duterte’s drug war, if vigilante killings were to be included.\nAside from challenges in probes, only a few drug war families push to file complaints because of fear.\nThe drug war families pin their hopes on the court, which currently probes the drug war killings.", "location": "Caloocan City", "classification": "security", "score": 0.5054103657109622, "event_breakdown": "Caloocan City Regional Trial Court Branch 121\nDuterte’s drug war"}, {"id": "b8d76118-2905-4395-b59c-b7e4357e00d2", "title": "Roger Waters , Yusuf / Cat Stevens and Lowkey perform in London :  Tonight is for Palestine  ", "date": "2024-06-24 00:15", "url": "https://www.wsws.org/en/articles/2024/06/23/mcjv-j23.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Pink Floyd founder Roger Waters joined Yusuf/Cat Stevens and rapper Lowkey in a “Stand Up for Palestine” concert at London’s St Pancras New Church on Friday night.\nAll not only oppose the direct perpetrator of these atrocities, Israel, but the complicity of British imperialism and of the Labour Party led by Sir Keir Starmer.\nRoger Waters performing at the Tonight is for Palestine eventIt is for this reason that Waters has become a hate figure in ruling circles and the target of a vile slander campaign denouncing him as an antisemite.\nLowkey, accompanied by a pianist and two talented back-up singers, performed the most overtly political material of the evening.\nWe insist that building a new anti-war movement demands an irrevocable break with the Labour Party, and the building of a mass revolutionary party of the working class.", "location": "London", "classification": "security", "score": 0.8040231733023353, "event_breakdown": "Target event not found."}, {"id": "3d0e22d0-eede-47e4-89ee-985918f98f8d", "title": "Third Estonian volunteer killed in action in Ukraine", "date": "2024-06-24 04:00", "url": "https://www.yahoo.com/news/third-estonian-volunteer-killed-action-022438756.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Martin Jaager, an Estonian citizen who served in Ukraine's defense forces, was killed in combat in the Luhansk region, Estonian news outlet Postimees reported on June 23.\nJaager was killed on June 22 near the village of Raigorodka, close to the border of the Kharkiv and Luhansk Oblasts.\nHe was the third Estonian to die defending Ukraine, and was a member of the Third Assault Division.\nHe joined the defense forces in Ukraine over a year ago, and had served in various units before joining the Third Assault Division a month prior to his death.\nIn March 2023, Ivo Juurak was the first Estonian volunteer who was killed in action in Ukraine, followed by Tanel Kriggul in September.", "location": "LUHANSK REGION", "classification": "security", "score": 0.9030135245657132, "event_breakdown": "Martin Jaager, an Estonian citizen, was killed in combat in the Luhansk region of Ukraine on June 22nd. Jaager was previously reported to have been killed in Ukraine on June 22nd."}, {"id": "bda16d9f-0a0b-402f-86ee-2517886a705c", "title": "Catholic prelate in Japan calls for reevaluation of defense policies", "date": "2024-06-24 09:45", "url": "https://www.heraldmalaysia.com/news/catholic-prelate-in-japan-calls-for-reevaluation-of-defense-policies/76727/1", "domain": "heraldmalaysia.com", "domain_classification": "Unknown", "message": "Catholic prelate in Japan calls for reevaluation of defense policiesThe bishop of the Diocese of Naha in southern Japan challenged the prevailing notions of peace and defense, criticizing policies that prioritize national security over genuine human safety and coexistence.\nIn his message for the Okinawa Memorial Day on June 23, Bishop Wayne Francis Berndt warned that such policies could escalate into conflicts akin to genocide.\nBishop Berndt criticized the use of the term “defense,” which often justifies aggressive actions causing significant human suffering.\nOkinawa Memorial Day, observed annually on June 23 in Japan’s Okinawa Prefecture, commemorates those lost in the Battle of Okinawa.\nInitially established in 1961 by the Government of the Ryukyu Islands during the occupation of Japan, Okinawa Memorial Day was intended to honor and pray for the relatives killed in the battle.", "location": "Okinawa, Japan", "classification": "security", "score": 0.6187904009968422, "event_breakdown": "Event 1: Catholic prelate in Japan calls for reevaluation of defense policies.\nEvent 2: Bishop Wayne Francis Berndt warned against policies that prioritize national security over genuine human safety and coexistence.\nEvent 3: Okinawa Memorial Day is observed annually on June 23 in Japan’s Okinawa Prefecture."}, {"id": "ebf95627-11f5-48a3-afdf-57969af3ad6c", "title": "Russia Blames U . S . for Deadly Ukraine Missile Strike on Crimean Beach", "date": "2024-06-24 18:15", "url": "https://www.breitbart.com/politics/2024/06/23/russia-blames-u-s-for-deadly-ukraine-missile-strike-on-crimean-beach/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Another person died in Grayvoron city in Russia’s Belgorod region, bordering Ukraine, regional Gov.\nRussia’s Defense Ministry said both Ukraine and the U.S. bore “responsibility for a deliberate missile strike on civilians.” It said that U.S.-supplied ATACMS missiles were used in the Ukranian attack.\nA fresh attack on Kharkiv killed at least one person and wounded 11 on Sunday, according to local officials.\nTwo people were wounded by falling debris when two Russian missiles were shot down over the Kyiv region overnight, Ukraine´s air force commander Mykola Oleschuk said.\nVadym Filashkin of Ukraine’s partly occupied Donetsk region said that Russian attacks on Saturday killed two people and wounded four.", "location": "RUSSIA", "classification": "security", "score": 0.9293871898553319, "event_breakdown": "Another person died in Grayvoron city in Russia’s Belgorod region, bordering Ukraine, regional Gov. Vyacheslav Gladkov said on Sunday. He stated that a fuel depot in the city was hit by an attack from Ukrainian territory.\nRussia’s Defense Ministry said both Ukraine and the U.S. bore “responsibility for a deliberate missile strike on civilians.” It said that U.S.-supplied ATACMS missiles were used in the Ukranian attack.\nA fresh attack on Kharkiv killed at least one person and wounded 11 on Sunday, according to local officials. These developments reported new events in the security category, and these events can be placed on a map."}, {"id": "754c2f17-ddfe-43bf-bbff-30f15da3b9ce", "title": "Eight killed in fire at Moscow research centre", "date": "2024-06-24 19:15", "url": "https://www.aol.co.uk/news/workers-jump-deaths-burning-moscow-175058633.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "06:49 PM BSTUnconfirmed reports: Seven dead in fireBaza, a Telegram channel with links to the Russian security services, reports that at least seven people were killed in the research building fire outside Moscow.\n“The ducts were positioned in such a way that they accelerated the fire.”06:05 PM BSTFire is now ‘localised’, according to reportsThe fire at the research centre near Moscow is being contained, according to Russian media.\nWe’ll continue to bring you all the latest updates from the fire at the research centre near Moscow.\n05:42 PM BSTBurning building linked to Western-sanctioned research instituteThe eight-storey building that is currently burning near Moscow is linked to a Western-sanctioned scientific research institute in the Moscow region, according to local authorities.\nAndrei Vorobyov, the governor of the Moscow region, said the fire had engulfed a building belonging to the Platan research institute.", "location": "MOSCOW", "classification": "security", "score": 0.5496744738710646, "event_breakdown": "06:49 PM BST - Seven people were killed in a building fire in the Russian city of Baza, which is linked to a fire at a Russian scientific research institute.\n06:05 PM BST - A fire at an institute in Moscow that has been linked to the Western-sanctioned research institute is now contained."}, {"id": "38a624e0-8a95-4b47-8f37-18a7cb1dc45d", "title": "Eisenhower Aircraft Carrier Group Heads Home After Months Battling Houthis in Red Sea", "date": "2024-06-24 17:15", "url": "https://www.theepochtimes.com/world/eisenhower-aircraft-carrier-group-heads-home-after-months-battling-houthis-in-red-sea-5674228", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "The Houthis, designated a terrorist organization by the United States, have harassed the Red Sea shipping lane for months with missiles and explosive-laden drones.\nThe Eisenhower Carrier Strike Group and its sailors have, in turn, intercepted dozens of Houthi missiles and drones, shielding numerous commercial ships in their journeys through the Red Sea.\nThe strike group saw its Red Sea deployment extended twice as the Houthis continued their attacks.\nCENTCOM reported that the Eisenhower Carrier Strike Group logged more than 30,000 flight hours and sailed more than 55,000 miles as part of its deployment.\nNevertheless, the Eisenhower Carrier Strike Group’s Red Sea mission had been one of the most intense periods of sea combat for the U.S. Navy since World War II.", "location": "The Eisenhower Carrier Strike Group's Red Sea mission", "classification": "security", "score": 0.5203509224670011, "event_breakdown": "![The Eisenhower Carrier Strike Group in the Red Sea](https://i.imgur.com/RqQtjXS.jpg)\n* The Eisenhower Carrier Strike Group, as well as its sailors, have intercepted dozens of Houthi missiles and drones in the Red Sea. The carrier group saw its deployment extended twice as the Houthis continued their attacks.\n* The Eisenhower Carrier Strike Group deployed more than 30,000 flight hours and sailed over 55,000 miles as part of its deployment.\n* The Eisenhower Carrier Strike Group's mission in the Red Sea has been one of the most intense periods of sea combat since World War II."}, {"id": "03c0aedd-db62-4890-8744-b99823751a47", "title": "Russia says US - made missiles used in deadly Crimea attack", "date": "2024-06-24 17:00", "url": "https://www.yahoo.com/news/russia-says-us-made-missiles-152432896.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Russian Foreign Ministry on Monday claimed U.S.-made missiles were used in a deadly weekend attack on Russia-annexed Crimea.\nIt added U.S.-supplied ATACMS missiles were used in the attack, which reportedly killed four people and injured more than 150 others.\nWestern-supplied weaponry has been used by Ukrainian forces throughout Kyiv’s war with Russia, which began more than three years ago.\nWestern allies have previously declared Crimea, which Russia annexed from Ukraine in 2014, is a fair target for Ukraine, the AP noted.\nThose killed in Sunday’s attack included two children who were hit by falling debris from Ukrainian missiles shot down near Sevastopol, a port city in Crimea, the AP reported, citing Russian officials.", "location": "SIMFEROPOL", "classification": "security", "score": 0.8226539148479014, "event_breakdown": "Russian Foreign Ministry claims U.S.-made missiles were used in a deadly weekend attack on Russia-annexed Crimea. Russian authorities say four people were killed in the attack and more than 150 were injured."}, {"id": "6e20a1df-97f2-4d7a-9bc3-686edfdb7165", "title": "Suspected Yemen Houthi Attack Targets Vessel in Waters Further Away than Many Previous Assaults", "date": "2024-06-24 15:30", "url": "https://www.military.com/daily-news/2024/06/24/suspected-yemen-houthi-attack-targets-vessel-waters-further-away-many-previous-assaults.html", "domain": "military.com", "domain_classification": "Unknown", "message": "The attack was just off to the northeast of Yemen's Socotra Island, also held by allies of the exiled government.\n“The master of a merchant vessel reports an explosion in close proximity to the vessel,” the UKMTO said.\n“The crew are reported safe and the vessel is proceeding to its next port of call.”It offered no other immediate information about the attack.\nOf the more than 60 attacks launched by the Houthis since November that specifically targeted vessels, this would be one of the furthest.\nIn May, a Portuguese-flagged container ship came under attack by a drone in the far reaches of the Arabian Sea in an attack claimed by the Houthis.", "location": "YEMEN", "classification": "security", "score": 0.8403957066044945, "event_breakdown": "Houthis attack merchant vessel northeast of Yemen's Socotra Island"}, {"id": "9887fe4b-8206-492e-90de-5e1245e73e13", "title": "Air Power That Turned The Tide At 18 , 000 Feet", "date": "2024-06-24 17:45", "url": "https://banglanews24.today/%E0%A6%B8%E0%A6%82%E0%A6%AC%E0%A6%BE%E0%A6%A6/air-power-that-turned-the-tide-at-18000-feet/20249/", "domain": "banglanews24.today", "domain_classification": "Unknown", "message": "‘Air Force Enters’The Chiefs of Staff Committee (COSC) was headed by General VP Malik.\nHe writes that before his return from overseas, Air Chief Marshal AY Tipnis was not ready to use air power.\nThe bunkers were camouflaged, and the Air Force never conducted precision strikes at 18,000 feet.\nIn 1999, the Indian Air Force conducted Exercise Trishul in the Himalayas, many weeks before the Kargil conflict, flying over 5,000 sorties for high-altitude operations.\n250 kg and 500 kg dumb bombs were dropped, and the relentless bombing of peaks in the Tiger Hill complex began.", "location": "NULL", "classification": "security", "score": 0.5586429376332428, "event_breakdown": "Air Force launched Operation Safed Sagar in Kargil region, involved in precision strikes at 18,000 feet\nAir Force Enters in Kargil conflict\nExercise Trishul in the Himalayas"}, {"id": "a5b6e877-348d-43f8-bbdd-f5a8b7393d41", "title": "Russia Summons the American Ambassador over a Deadly Attack That Moscow Says Used US - made Missiles", "date": "2024-06-24 16:45", "url": "https://www.newsmax.com/world/globaltalk/russia-ukraine-war-us-missiles/2024/06/24/id/1169880/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "The Russian Foreign Ministry summoned the American ambassador on Monday to protest what it says was the use of U.S.-made advanced missiles in a Ukrainian attack on Russian-annexed Crimea that reportedly killed four people and wounded more than 150.\nThe Associated Press could not independently verify Russia's claims about the missiles used.\nBut as Ukraine has at times struggled to hold the line against Russia’s bigger and better-equipped military, Western leaders have gradually relented and granted more support.\nRussian authorities said that the dead in Sunday’s attack included two children who were hit by falling debris from Ukrainian missiles that were shot down over a coastal area in Sevastopol, a port city in Crimea.\nRussia said the missiles were U.S.-made ATACMS, a long-range, guided missile.", "location": "SIMFEROPOL", "classification": "security", "score": 0.5090368822496665, "event_breakdown": "Title: Russian Officials Summon U.S. Ambassador Over Ukrainian Missile Attack\n\nTarget Location: The port city of Sevastopol in the Russian-annexed region of Crimea\n\nEvent: The Russian Foreign Ministry summoned the U.S. ambassador to Moscow to protest what it alleged was the use of advanced U.S.-made missiles in a Ukrainian attack on Russian-annexed Crimea on Sunday. The alleged attack killed four people and injured more than 150, according to Russian officials. Russia said U.S.-made ATACMS long-range, guided missiles were used in the attack, which it said killed two Russian soldiers and two civilians. Ukraine has denied launching a missile attack on Crimea."}, {"id": "6199f2c0-6318-4527-8c92-fbf858c08f74", "title": "Russia summons the American ambassador over a deadly attack that Moscow says used US - made missiles", "date": "2024-06-24 15:30", "url": "https://www.startribune.com/russia-summons-the-american-ambassador-over-a-deadly-attack-that-moscow-says-used-us-made-missiles/600375652/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "The Russian Foreign Ministry summoned the American ambassador on Monday to protest what it says was the use of U.S.-made advanced missiles in a Ukrainian attack on Russian-annexed Crimea that reportedly killed four people and wounded more than 150.\nThe Associated Press could not independently verify Russia's claims about the missiles used.\nBut as Ukraine has at times struggled to hold the line against Russia's bigger and better-equipped military, Western leaders have gradually relented and granted more support.\nRussia said the missiles were U.S.-made ATACMS, a long-range, guided missile.\nMeanwhile, the Russian Defense Ministry on Monday reported striking a ''major logistical hub'' of the Ukrainian military that held Western-supplied missiles and other weapons.", "location": "The main focus of the given text is Ukraine.", "classification": "security", "score": 0.4161233287543101, "event_breakdown": "Location: Russia\nRussia struck a major logistical hub in the western Ukrainian region of Lviv, which held Western-supplied missiles and other weapons, according to the Russian Defense Ministry on Monday. Russia also reported that it struck an anti-aircraft system located near the Odessa airport in Ukraine."}, {"id": "1293d19d-0b80-4841-9ae3-5918e7f13bfe", "title": "EU Approves New Sanctions To Limit  Russia Criminal Actions Against Ukraine  ", "date": "2024-06-24 10:00", "url": "https://www.rferl.org/a/eu-sanctions-russia-criminal-actions-ukraine/33006775.html", "domain": "rferl.org", "domain_classification": "Unknown", "message": "Russia has said the United States was responsible for a Ukrainian missile strike on the Russian-occupied Crimean Peninsula on June 23 and summoned U.S.\nThe Russian Defense Ministry said that the June 23 strike involved five longer-range missiles that the United States began supplying to Ukraine this year.\n\"Of course, the involvement of the United States in the fighting, as a result of which peaceful Russians are dying, cannot but have consequences,\" Peskov said.\nSince Russia's full-scale invasion of Ukraine in 2022, Kyiv has vowed to restore control of its territory and has targeted key Russian military and naval installations in Crimea.\nThere are more than 200 Russian military sites on Crimea, including air bases, naval installations, training grounds, air defense and rocket forces, as well as signals and communications facilities.", "location": "CAUCASUS", "classification": "security", "score": 0.8143056560182317, "event_breakdown": "Short Report:\nThe Russian Ministry of Defense accused Washington of being involved in the missile launch by Ukrainian forces from a plane with the aim of blowing up five longer-range missiles that the United States began supplying to Ukraine this year."}, {"id": "45b47d3e-5f28-48b4-aad3-5399bf81ba64", "title": "Hezbollah Strikes Inflict More Losses on Israeli Occupation Army near Lebanon Border", "date": "2024-06-24 18:15", "url": "https://english.almanar.com.lb/2138864", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "This was in response to the assassination carried out by the Israeli enemy in the town of Al-Khiara.\nThis was in response to the assassination carried out by the “Israeli” enemy in the town of Al-Khiara.\nAt 17:15, the Islamic Resistance fighters targeted Al-Ramtha site in the occupied Lebanese Kfar Shuba hills with rocket weapons, hitting it directly.\nAt 17:25, the Islamic Resistance fighters targeted Al-Samaqa site in the occupied Lebanese Kfar Shuba hills with rocket weapons, hitting it directly.\nA screen capture showing Hezbollah drone strike on Beit Hillel Israeli site in May 2024.", "location": "Kfar Shuba hills", "classification": "security", "score": 0.9878251830145215, "event_breakdown": "At 17:15, the Islamic Resistance fighters targeted Al-Ramtha site in the occupied Lebanese Kfar Shuba hills with rocket weapons, hitting it directly. At 17:25, the Islamic Resistance fighters targeted Al-Samaqa site in the occupied Lebanese Kfar Shuba hills with rocket weapons, hitting it directly."}, {"id": "aa917d85-a849-4201-bb8c-bbda3a481c80", "title": "Russian Strike in East Ukraine Kills 5 , Wounds Dozens", "date": "2024-06-24 19:15", "url": "https://www.themoscowtimes.com/2024/06/24/russian-strike-in-east-ukraine-kills-five-wounds-dozens-a85507", "domain": "themoscowtimes.com", "domain_classification": "Unknown", "message": "Russian strikes on the eastern Ukrainian city of Pokrovsk killed five people and wounded dozens more on Monday, the governor of the Donetsk region said.\nOver recent weeks, Moscow has concentrated its firepower on the eastern industrial region of Donetsk, which the Kremlin claims is part of Russia.\nRussian forces have been advancing towards Pokrovsk over recent months, since they captured the fortress town of Avdiivka in February.\nFilashkin said separately that a 62-year-old man had been killed in a Russian attack on the town of Kurakhove, south of Pokrovsk.\nRussia claimed to have annexed Donetsk in late 2022, along with three other regions of Ukraine it had partially occupied.", "location": "POKRovsk", "classification": "security", "score": 0.7675236972155196, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n- Russian strikes on the eastern Ukrainian city of Pokrovsk killed five people and wounded dozens more on Monday, the governor of the Donetsk region said.\n- Filashkin said separately that a 62-year-old man had been killed in a Russian attack on the town of Kurakhove, south of Pokrovsk."}, {"id": "41837808-8993-4d68-817f-f68477a54f50", "title": "As tanks push further into Rafah , Israeli forces kill senior Gaza health official", "date": "2024-06-24 16:15", "url": "https://tribune.com.pk/story/2473592/as-tanks-push-further-into-rafah-israeli-forces-kill-senior-gaza-health-official", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Palestinian inspects the damages at Al-Daraj clinic which was hit in an Israeli strike in Gaza City June 24, 2024.\nPHOTO: REUTERSAn Israeli air strike at a medical clinic in Gaza City killed the director of Gaza's Ambulance and Emergency Department, the enclave's health ministry said, while Israel's military said the strike had killed a senior Hamas armed commander.\nThe health ministry said the killing of Hani al-Jaafarawi brought the number of medical staff killed by Israeli fire since Oct 7 to 500.\nMourners attend the funeral of Palestinian Hani Al-Jaafarwi, the director of ambulance and emergency services at the ministry of health, who was killed in an Israeli strike on Al-Daraj clinic, in Gaza City.\nThe Israeli offensive in retaliation has killed almost 37,600 people, according to Palestinian health authorities, and has left Gaza in ruins.", "location": "GAZA CITY", "classification": "security", "score": 0.9378363913019966, "event_breakdown": "Israeli air strikes hit a medical facility over the weekend, killing a senior Hamas commander. Israel's military said the strike had killed Hani al-Jaafarawi, who was said to be the director of Gaza's Ambulance and Emergency Department. However, his health ministry said the number of medical staff killed by Israeli fire since October 7 has reached 500."}, {"id": "e7740783-718b-41f1-8021-ee88f1226612", "title": "With another setback for cease - fire talks , worries of full - scale war for Israel and Lebanon escalate", "date": "2024-06-24 19:15", "url": "https://abcnews.go.com/International/wireStory/setback-cease-fire-talks-worries-full-scale-war-111377919", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Israel and Hezbollah each have lessons from their last war, in 2006, a monthlong conflict that ended in a draw.\nA United Nations resolution ending the war called for withdrawal of Israeli forces from Lebanon and a demilitarized zone on Lebanon’s side of the border.\nIran-backed Hezbollah initially seemed caught off-guard by Hamas’ Oct. 7 attack on Israel, a regional ally, but began firing rockets into northern Israel the following day.\nIn a war with Hezbollah, there would be no point in additional evacuations since the militia’s rockets and missiles can reach all of Israel.\nA full-scale war would likely spread to multiple fronts, escalating the involvement of Iranian proxies in Syria, Iraq and Yemen — and perhaps draw in Iran itself.", "location": "Lebanon", "classification": "security", "score": 0.8459211680413187, "event_breakdown": "Israel and Hezbollah strike each other in Syria, with Hezbollah firing anti-tank missiles at Israeli military vehicles, killing two Israeli soldiers. Hezbollah is blamed, and Israel strikes targets in Lebanon."}, {"id": "d7caf852-ed59-4121-8109-9a75001f1d79", "title": "With another setback for cease - fire talks , worries of full - scale war for Israel and Lebanon escalate", "date": "2024-06-24 19:30", "url": "https://www.clickondetroit.com/news/world/2024/06/24/with-another-setback-for-cease-fire-talks-worries-of-full-scale-war-for-israel-and-lebanon-escalate/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Recommended VideosIsrael and Hezbollah each have lessons from their last war, in 2006, a monthlong conflict that ended in a draw.\nThe 2006 war, six years after Israeli forces that had occupied southern Lebanon withdrew, erupted after Hezbollah captured two Israeli soldiers and killed several others in a cross-border raid.\nA United Nations resolution ending the war called for withdrawal of Israeli forces from Lebanon and a demilitarized zone on Lebanon’s side of the border.\nIn a war with Hezbollah, there would be no point in additional evacuations since the militia’s rockets and missiles can reach all of Israel.\nLebanon has no such network, and shelters would be of little use against massive “bunker buster” bombs Israel has dropped in some parts of Gaza.", "location": "Lebanon", "classification": "security", "score": 0.953653292824778, "event_breakdown": "Israel and Hezbollah have reinforced their militaries since the group waged a monthlong conflict with Israel in 2006.\n\nOn Friday, Hezbollah leader Nasrallah said his group would strike Israel with missile barrages if it was attacked. Israel has accused the group of firing missiles from Syria at Israeli soldiers.\n\nLebanon’s President Michel Aoun has said Israel’s threats against Hezbollah were “part of its ongoing psychological campaign”.\n\nLate last month, a senior Israeli defence official said new intelligence showed that Hezbollah has taken “on-the-ground measures” in recent weeks to beef up its forces and openly display its arsenal in Syria.\n\nHezbollah-affiliated Al-Manar TV said the group last week said it held three days of military manoeuvres where its units fired multiple rocket launchers.\n\nOn Thursday evening, Hezbollah placed a mock-up of an Israeli Merkava tank on a Beirut roundabout that had been renamed in its leader’s honour.\n\nIsrael-based analyst Amir Rapaport said Hezbollah has gained “significant experience and knowledge” since 2006, thanks to fighting in Syria and having an “ample” weapons supply.\nLocations: Lebanon, Israel\nCurrent event: Nasrallah says Hezbollah will strike Israel with missiles"}, {"id": "98308ba0-6f07-49af-b63b-92ae916aa945", "title": "Former Wresting Star Arrested During Violent Gas Station Stabbing : REPORT", "date": "2024-06-24 18:15", "url": "https://dailycaller.com/2024/06/24/former-wresting-star-arrested-stabbing-gas-station/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "Police arrested former wrestling star and WCW Tag Team Champion winner 2 Cold Scorpio on June 15, for allegedly violently stabbing a man during an altercation at a gas station, according to TMZ.\nFormer ECW Wrestler, 2 Cold Scorpio was arrested for stabbing a man during a gas station fight, which he claims he was acting in self defence.\nHe said the altercation went on for several moments, during which time he stabbed the man multiple times, according to TMZ.\n58 year old 2 Cold Scorpio hitting a PERFECT Moonsault last night 💯 pic.twitter.com/EDcDnZxKFR — Dark Puroresu Flowsion (@PuroresuFlow) April 21, 2024Scaggs made bond and pleaded not guilty to the charges.\n(RELATED: ‘Hawaii 5-0’ Star Taylor Wily Dead At 56)Scaggs wrestled as 2 Cold Scorpio as well as Flash Funk, and held a number of championship belts.", "location": "gas station", "classification": "security", "score": 0.5453215362398407, "event_breakdown": "- 2 Cold Scorpio arrested on June 15 for allegedly stabbing a man during an altercation at a gas station.\n- 2 Cold Scorpio is a former member of the ECW wrestling stable."}, {"id": "07523734-4029-4cfb-b83b-b0341ab058a9", "title": "Aerial Drone Launched By Yemen Houthi Rebels Hits Ship In The Red Sea , Causing Damage And Injuries – The Yeshiva World", "date": "2024-06-24 18:15", "url": "https://www.theyeshivaworld.com/news/general/2292463/aerial-drone-launched-by-yemens-houthi-rebels-hits-ship-in-the-red-sea-causing-damage-and-injuries.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "An aerial drone launched by Yemen’s Houthi rebels struck and damaged a vessel in the Red Sea on Sunday, officials said, the latest attack by the group targeting shipping in the vital maritime corridor.\nThe drone attack happened around dawn off the coast of the rebel-held port city of Hodeida, the British military’s United Kingdom Maritime Trade Operations center said.\nHours after the attack, Houthi military spokesman Brig.\nGen. Yahya Saree claimed the attack, saying the rebels targeted the Transworld Navigator.\nSaree claimed without offering evidence the rebels instead used a drone boat in the attack, something contradicted by every other report on the assault.", "location": "Based on the information provided, the most specific location for the event appears to be the port city of Hodeida, Yemen", "classification": "security", "score": 0.8726491216042619, "event_breakdown": "Target event - A drone launched by Yemen’s Houthi rebels struck and damaged a vessel in the Red Sea off Hodeida, British officials said on Sunday."}, {"id": "e7c64b56-179a-422f-a442-aaf49da337bf", "title": "Aerial drone launched by Yemen Houthi rebels hits ship in the Red Sea , causing damage and injuries", "date": "2024-06-24 17:30", "url": "https://www.columbian.com/news/2024/jun/24/aerial-drone-launched-by-yemens-houthi-rebels-hits-ship-in-the-red-sea-causing-damage-and-injuries/", "domain": "columbian.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — An aerial drone launched by Yemen’s Houthi rebels struck and damaged a vessel in the Red Sea on Sunday, officials said, the latest attack by the group targeting shipping in the vital maritime corridor.\nThe drone attack happened around dawn off the coast of the rebel-held port city of Hodeida, the British military’s United Kingdom Maritime Trade Operations center said.\nHours after the attack, Houthi military spokesman Brig.\nGen. Yahya Saree claimed the attack, saying the rebels targeted the Transworld Navigator.\nSaree claimed without offering evidence the rebels instead used a drone boat in the attack, something contradicted by every other report on the assault.", "location": ")\nHODEIDA, YEMEN", "classification": "security", "score": 0.8932426996720779, "event_breakdown": "The following current events of security reported in the given text can be placed on a map:\n\n1. An aerial drone launched by Yemen's Houthi rebels struck and damaged a vessel in the Red Sea on Sunday, officials said, the latest attack by the group targeting shipping in the vital maritime corridor. The attack happened around dawn off the coast of the rebel-held port city of Hodeida.\n2. Taliban fighters entered the capital of Kabul on Sunday and sought the unconditional surrender of the central government. Three Afghan officials told The Associated Press that the Taliban were in the Afghan capital."}, {"id": "648da586-1a30-4635-9b6c-79732214ed96", "title": "Russia blames US for deadly missile attack on Crimea", "date": "2024-06-24 17:30", "url": "https://www.thecitizen.co.tz/tanzania/news/international/russia-blames-us-for-deadly-missile-attack-on-crimea-4668156", "domain": "thecitizen.co.tz", "domain_classification": "Unknown", "message": "Russia on Sunday said the United States had responsibility for a Ukrainian missile attack on Russian-annexed Crimea, which it said killed four people, including two children, and wounded over 100.\nA missile exploded above a beach area of the city of Sevastopol, firing shrapnel at people relaxing there, Russian-appointed officials said.\nSevastopol governor Mikhail Razvozhayev initially said in a Telegram video the attack had killed three children and two adults, and wounded nearly 120 people.\nSevastopol regularly comes under fire from Ukraine but Sunday's attack was unusually deadly.\nRazvozhayev said the attack hit Uchkuyevka, an area with sandy beaches and hotels.", "location": "The focus of this event appears to be the city of Sevastopol, which is a Russian military-governed city", "classification": "security", "score": 0.9475968801457121, "event_breakdown": "Reported Ukrainian missile attack on Russian-annexed Crimea killed at least four people, including two children, and wounded over 100 others. The missile reportedly exploded above a beach area of Sevastopol. Russian-appointed officials blamed the attack on the United States, which has not commented."}, {"id": "2e8687a1-1879-4b19-87d3-ee13b3860360", "title": "NYC triple stabbing in East Village leaves 1 dead ; man in custody", "date": "2024-06-24 13:00", "url": "https://www.fox5ny.com/news/east-village-stabbing-nyc-crime", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "A NYC triple stabbing left one person dead, as well as two others injured, in the East Village, the NYPD said.\nThe stabbing happened on Sunday around 5:45 p.m. near Avenue A and East 14th Street.\nAll three were taken to NYC Health+Hospitals/Bellevue, where the 38-year-old man was pronounced dead, police said.\nThe 51-year-old is listed in critical condition, while the 32-year-old is listed in stable condition.\nA 30-year-old man was taken into custody at the scene, police said.", "location": "East Village", "classification": "security", "score": 0.8871010378865211, "event_breakdown": "NYC Triple Stabbing in East Village\nOn Sunday, around 5:45 p.m., a 38-year-old man was killed and two others injured in a triple stabbing in the East Village. The stabbing occurred near Avenue A and East 14th Street. The 51-year-old is in critical condition, while the 32-year-old is in stable condition. A 30-year-old man was taken into custody at the scene."}, {"id": "a755ff7a-2e88-441d-a4cd-8da7621c8381", "title": "Dagestani official sacked after sons implicated in Sunday deadly attacks – POLITICO", "date": "2024-06-24 15:45", "url": "https://www.politico.eu/article/death-toll-rises-in-attacks-on-religious-sites-russia-dagestan-region-official-sacked/", "domain": "politico.eu", "domain_classification": "Unknown", "message": "Police raided Omarov’s home on Sunday evening and took him in for questioning as media reported that two of his sons had been among the gunmen.\nOmarov also was expelled from the regional chapter of ruling United Russia party, while his profile was deleted from the official website.\nAmong the victims was a 66-year-old Russian Orthodox priest whose throat was slit, according to a local official.\nThe regional Health Ministry also reported that at least 46 people were taken to hospital with injuries.\nThree days of mourning have been declared in Dagestan, with large events and television programs canceled across the North Caucasus region.", "location": "Dagestan", "classification": "security", "score": 0.6509558262729436, "event_breakdown": "{\"event\": \"Russia - Police detained a man suspected of organizing an attack in Makhachkala.\"}"}, {"id": "50916c8b-04c3-4134-8553-e06ccc3788b3", "title": "With another setback for cease - fire talks , worries of full - scale war for Israel and Lebanon escalate", "date": "2024-06-24 19:00", "url": "https://www.newsday.com/news/nation/lebanon-israel-hezbollah-gaza-war-iran-conflict-u79372", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Israel and Hezbollah each have lessons from their last war, in 2006, a monthlong conflict that ended in a draw.\nIsraeli security forces examine the site hit by a rocket fired from Lebanon, in Kiryat Shmona, northern Israel, Wednesday, March 27, 2024.\nA United Nations resolution ending the war called for withdrawal of Israeli forces from Lebanon and a demilitarized zone on Lebanon’s side of the border.\nSpanish U.N. peacekeepers stand on a hill overlooking the Lebanese border villages with Israel in Marjayoun town on Wednesday, Jan. 10, 2024.\nIn a war with Hezbollah, there would be no point in additional evacuations since the militia’s rockets and missiles can reach all of Israel.", "location": "Lebanon", "classification": "security", "score": 0.9355068286264794, "event_breakdown": "Israel: troops are currently deployed to the Lebanese border to prevent further escalation.\nLebanon: Spanish U.N. peacekeepers have been deployed to the Lebanese border villages with Israel to monitor any potential violations of the ceasefire."}, {"id": "181598cd-5af7-4031-882c-6956e51c0ac6", "title": "An Israel offensive into Lebanon risks an Iranian military response , top US military leader says", "date": "2024-06-24 03:15", "url": "https://www.wsbradio.com/news/world/an-israel-offensive/K5ZTVYHMSFDJFJWSNE47HWEAFM/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "UNITED STATES OF AMERICA", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "1. There has been a terrorist attack in Kabul, Afghanistan, which has resulted in at least 25 people being killed and 40 more being wounded. The Islamic State group has claimed responsibility. Location: Kabul, Afghanistan\n2. There has been a military coup in Sudan that has resulted in the overthrow of the transitional government and the arrest of many of its leaders. Location: Khartoum, Sudan\n3. There has been a series of bomb blasts in Maiduguri, Nigeria, which has resulted in several deaths and injuries. The terrorist group Boko Haram has claimed responsibility. Location: Maiduguri, Nigeria\n4. There has been a mass shooting at a school in Moscow, Russia, which has left at least 1 person dead and several more wounded. The shooter is a 17-year-old male student. Location: Moscow, Russia\n5. There has been a terrorist attack in Barcelona, Spain, which has killed at least 13 people and left more than 100 injured. The Islamic State group has claimed responsibility. Location: Barcelona, Spain\nI'm sorry, no current events related to security have been found that meet the specified criteria."}, {"id": "6841b256-bae6-4d7f-9cf6-ad879b6c147e", "title": "Netanyahu vows to send troops to Lebanon border as Rafah offensive winds down amid fears of all - out war with Hezbollah", "date": "2024-06-24 10:00", "url": "https://www.dailymail.co.uk/news/article-13562307/Netanyahu-vows-send-troops-Lebanon-border-Rafah-offensive-winds-amid-fears-war-Hezbollah.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "The Israeli prime minister said that fighting against Hamas terrorists in the southern Gaza city is nearly over, without giving a specific timeframe.\nHe told Israel's Channel 14 that 'after the end of the intense phase' in the Gaza Strip, Israel would 'redeploy some forces to the north... primarily for defensive purposes'.\nHis comments come amid growing concerns over recent weeks that daily exchanges of cross-border fire between Israel and Iran-backed Hezbollah could spiral into all-out war.\nIn Gaza, Israeli forces kept striking targets and battling Hamas.\nThe Israeli military said its jets struck militants who \"operated from within buildings that previously served as an UNRWA headquarters\"There was no immediate comment from UNRWA, whose facilities have come under attack before.", "location": "Gaza", "classification": "security", "score": 0.7901682028382794, "event_breakdown": "The Israeli prime minister has said that fighting against Hamas terrorists in the southern Gaza Strip is nearly over. His comments come after Israeli forces kept striking targets and battling Hamas in the strip. The Israeli military has also struck militants who operated from within buildings that previously served as a UNWRA headquarters."}, {"id": "57533ce3-3cff-4982-990c-cb8bb39dc158", "title": "An Israel offensive into Lebanon risks an Iranian military response , top US military leader says", "date": "2024-06-24 02:45", "url": "https://www.whec.com/national-world/an-israel-offensive-into-lebanon-risks-an-iranian-military-response-top-us-military-leader-says/", "domain": "whec.com", "domain_classification": "Unknown", "message": "Israeli officials have threatened a military offensive in Lebanon if there is no negotiated end to push Hezbollah away from the border.\nU.S. President Joe Biden’s senior adviser, Amos Hochstein, met with officials in Lebanon and Israel last week in an effort to deescalate tensions.\nIt is harder to fend off the shorter-range rockets that Hezbollah fires routinely across the border into Israel, he said.\nThe situation escalated this month after an Israeli airstrike killed a senior Hezbollah military commander in southern Lebanon.\nHezbollah retaliated by firing hundreds of rockets and explosive drones into northern Israel and Israel responded with a heavy assault on the militant group.", "location": "Lebanon", "classification": "security", "score": 0.8064169326975759, "event_breakdown": "Israeli officials threatened a military offensive in Lebanon if Hezbollah does not pull its forces back from the border. The U.S. worked to deescalate tensions, fearing a confrontation between its ally Israel and the Iran-backed terrorist group."}, {"id": "577db653-90c1-4c10-a674-ea36caf7fa2b", "title": "Who was Dasari Gopikrishna , the 32 - year - old from Andhra Pradesh killed in US supermarket shooting ? ", "date": "2024-06-24 08:30", "url": "https://www.firstpost.com/explainers/indian-killed-in-us-super-market-shooting-incident-who-was-dasari-gopikrishna-from-andhra-pradesh-13785454.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "A shooting at a supermarket in US’ Arkansas left dozens injured and killed around four people, including Indian student Dasari Gopikrishna.\nX/@satyaagrahindiaIn a heartbreaking incident, Dasari Gopikrishna, a 32-year-old Indian student from Andhra Pradesh, was fatally shot during a mass shooting in Arkansas, United States.\nThe 32-year-old Dasari Gopikrishna hailed from Bapatla district of Andhra Pradesh and had only recently gone to the US eight months ago in pursuit of a better livelihood.\n🚨Another firing in America.. - A 32-year-old Indian student, Dasari Gopikrishna was killed randomly while working at a supermarket in USA.\nDeeply saddened to learn that a young Dasari Gopikrishna from Bapatla has succumbed to injuries sustained in a shooting incident in Texas, USA.", "location": "HARRISON, ARKANSAS", "classification": "security", "score": 0.8850152553232763, "event_breakdown": "Target shooting mass June 1, 2022 Arkansas, US: a mass shooting at a supermarket in Arkansas left dozens of people injured and killed four people, including Indian student Dasari Gopikrishna.Violent attacks and aggression by a religious extremism in Arkansas, US."}, {"id": "96677178-e7b7-48d0-ab5b-87b83a3565d3", "title": "Ukraine makes its own targeting decisions , Pentagon says", "date": "2024-06-24 17:30", "url": "https://www.swissinfo.ch/eng/ukraine-makes-its-own-targeting-decisions%2c-pentagon-says/81676678", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Ukraine makes its own targeting decisions, Pentagon says2 minutesWASHINGTON (Reuters) – The Pentagon said on Monday that Ukraine makes its own targeting decisions after the Kremlin directly blamed the United States for an attack on Crimea that it said was carried out with U.S.-supplied ATACMS missiles and that killed at least four people and injured 151.\n“Ukraine makes its own targeting decisions and conducts its own military operations,” Major Charlie Dietz, a Pentagon spokesperson, said.\n“That certainly includes the thousands of innocent Ukrainians who have been killed by Russian forces since this Russian war of aggression began,” the spokesperson said.\nRussia said the United States had supplied the weapons, while U.S. military specialists had aimed the weapons and provided data for them.\nThe attack, Russia told Tracy, would “not go unpunished.", "location": "WASHINGTON", "classification": "security", "score": 0.6291264258114688, "event_breakdown": "Target event: Russia said the United States had supplied the weapons, while U.S. military specialists had aimed the weapons and provided data for them.\nNew:\nWashington, USA. On Monday, the Pentagon said Ukraine makes its own targeting decisions and conducts its own military operations, including in the thousands of innocent Ukrainians killed since Russia began its war of aggression."}, {"id": "a1958052-7258-4f6f-bd3d-f12f0842d21a", "title": "Tampa police arrest man on murder charge in Seminole Heights stabbing", "date": "2024-06-24 17:45", "url": "https://www.tampabay.com/news/crime/2024/06/24/seminole-heights-stabbing-east-hillsborough-avenue-murder-arrest/", "domain": "tampabay.com", "domain_classification": "Unknown", "message": "Tampa police have arrested a man in connection to a fatal stabbing behind a shuttered Wendy’s restaurant in Seminole Heights this month.\nPolice on Saturday arrested Eddy Caron, 57, of Tampa on a first-degree murder charge in the June 12 stabbing of David A. Malzone, 52, records show.\nAccording to Caron’s arrest affidavit, police were called to 1501 E. Hillsborough Ave. about 5:15 p.m. that day about a man, later determined to be Malzone, bleeding from his neck behind the Wendy’s.\nWhen the woman walked back through the parking lot about eight minutes later, another witness asked if she’d seen the attack.\nAbout 10 seconds later, the video shows Caron emerging from the break in the fence and riding his bike east on Giddens.", "location": "Tampa", "classification": "security", "score": 0.4989703860685538, "event_breakdown": "Police have arrested a 57-year-old Tampa man on a first-degree murder charge in relation to a fatal stabbing behind a shuttered Wendy’s restaurant in Seminole Heights on June 12. Eddy Caron was arrested on Saturday, June 18, according to police."}, {"id": "f7a1c7dc-f21e-4142-82b7-2a6100a08af9", "title": "Houthis claim attacks on ships in Red Sea , Indian Ocean", "date": "2024-06-24 03:45", "url": "https://www.canberratimes.com.au/story/8673005/houthis-claim-attacks-on-ships-in-red-sea-indian-ocean/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "\"Today, at 4am (Sanaa time) the crew reported minor injuries and moderate damage to the ship, but the vessel has continued underway,\" CENTCOM said in a statement, adding that there were no injuries on US or coalition vessels.", "location": "SANAA", "classification": "security", "score": 0.8661503987657526, "event_breakdown": "New Security Events:\nNone"}, {"id": "70d5253c-f5fd-4cea-b88a-1cf1d5802239", "title": "Seven killed , dozens missing after gunmen attack in northern Nigeria", "date": "2024-06-24 00:30", "url": "https://www.myjoyonline.com/seven-killed-dozens-missing-after-gunmen-attack-in-northern-nigeria/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "Residents said gunmen on motorbikes arrived in Maidabino village in Danmusa local government area of Katsina, and started shooting sporadically, forcing residents to flee.\nHassan Aliyu told Reuters by phone that the attack took residents by surprise and dozens of women and children were confirmed missing.\n\"They killed seven people, including burning two children,\" Aliyu said.\nAuwalu Ismail, another resident, said the gunmen first blocked all roads leading to Maidabino before the attack.\nKatsina state police spokesperson Abubakar Aliyu Sadiq confirmed the attack and the seven deaths but would not say whether anyone was missing.", "location": "Danmusa local government area of Katsina.", "classification": "security", "score": 0.7246223545315981, "event_breakdown": "Security Incident in Maidabino village, Katsina, Nigeria, on February 25, 2023."}, {"id": "4eb1a5fe-67f7-464e-b5a4-64a688ccfdae", "title": "The Kremlin will exploit the Dagestan terror attacks", "date": "2024-06-24 17:30", "url": "https://www.newstatesman.com/world/europe/2024/06/the-kremlin-will-exploit-the-dagestan-terror-attacks", "domain": "newstatesman.com", "domain_classification": "Unknown", "message": "Sergei Melikov meeting with locals as he visits the Orthodox Church where a priest was killed during an attack, in Derbent, Republic of Dagestan on 24 June 2024.\nThe cathedral’s priests, who had been marking the Orthodox festival of Pentecost, locked themselves inside the building until tactical units arrived.\nSergei Melikov, the head of the predominantly Muslim region, visited the site of the attacks on Monday and declared three days of public mourning.\nBut instead of admitting the obvious – that Russia is facing a growing problem with Islamist violence – Melikov attempted to implicate Ukraine.\n“The war is coming to our homes,” Melikov declared in a video posted on the social media platform Telegram.", "location": "Dagestan", "classification": "security", "score": 0.5698761487319315, "event_breakdown": "Target event: Event reported in text: Sergei Melikov meeting with locals as he visits the Orthodox Church where a priest was killed during an attack, in Derbent, Republic of Dagestan on 24 June 2024.\nCurrent event of security reported in text: Sergei Melikov meeting with locals as he visits the Orthodox Church where a priest was killed during an attack, in Derbent, Republic of Dagestan on 24 June 2024."}, {"id": "4f3892c1-32b0-4071-a7b2-791d5ddea430", "title": "Seven killed , dozens missing after gunmen attack in northern Nigeria", "date": "2024-06-24 06:45", "url": "http://www.channelafrica.co.za/sabc/home/channelafrica/news/details?id=e9c40fed-ee41-462f-920d-a74982bcaf57&title=Seven%20killed,%20dozens%20missing%20after%20gunmen%20attack%20in%20northern%20Nigeria", "domain": "channelafrica.co.za", "domain_classification": "Unknown", "message": "At least seven people were killed and 100 kidnapped on Saturday night when gunmen attacked a rural community in Nigeria's northwestern Katsina State, residents and police said this Sunday.\nHassan Aliyu told Reuters by phone that the attack took residents by surprise and dozens of women and children were confirmed missing.\n\"They killed seven people, including burning two children,\" Aliyu said.\nAuwalu Ismail, another resident, said the gunmen first blocked all roads leading to Maidabino before the attack.\nKatsina State police Spokesperson Abubakar Aliyu Sadiq confirmed the attack and the seven deaths but would not say whether anyone was missing.", "location": "KATSINA", "classification": "security", "score": 0.625459746390597, "event_breakdown": "Target event: New security event reported in Nigeria\nAt least seven people were killed and 100 others were kidnapped on Saturday night when gunmen attacked a rural community in northwestern Nigeria. The Katsina State police confirmed that the attack occurred, but would not say whether anyone was missing. The attack was first reported by residents Hassan Aliyu and Auwalu Ismail."}, {"id": "988f7c3d-ecf3-4646-a0fc-dd049f156e11", "title": "Gunmen Attack Synagogues and Churches In Russia , Leaving At Least 9 Dead And 25 Injured", "date": "2024-06-24 01:00", "url": "https://www.oann.com/newsroom/gunmen-attack-synagogues-and-churches-in-russia-leaving-at-least-9-dead-and-25-injured/", "domain": "oann.com", "domain_classification": "Unknown", "message": "Among the dead are seven law enforcement officers, a priest, and a church security guard.\nFour “militants” have also been killed, according to the Russian news agency TASS.\n“According to the information I received, Father Nikolay was killed in the church in Derbent; they slit his throat.\nThe head of the “Dagestan Lights” police department, Mavludin Khidirnabiev, was among the law enforcement officials slain, as per the telegram from the Dagestan Ministry of Internal Affairs.\nThe two synagogues were the target of “a combined attack,” according to the Israeli foreign ministry.", "location": "Derbent, Russia", "classification": "security", "score": 0.8216347814206387, "event_breakdown": "Map title: Security-related events reported in Derbent, Russia\n\nEvent 1: Seven law enforcement officers, a priest, and a church security guard were killed in a mass shooting at a mosque in Derbent, Russia. Four militants were also killed.\n\nEvent 2: A combined attack targeted two synagogues in Derbent, Russia."}, {"id": "db2dfd8e-8820-4e09-8453-db24035acca8", "title": "Israel offensive into Lebanon risks Iranian military response , top US military leader says", "date": "2024-06-24 10:45", "url": "https://www.naharnet.com/stories/en/306089-israel-offensive-into-lebanon-risks-iranian-military-response-top-us-military-leader-says", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "The top U.S. military officer has warned that any Israeli military offensive into Lebanon would risk an Iranian response in defense of the powerful Hezbollah militant group there, triggering a broader war that could put U.S. forces in the region in danger.\nIsraeli officials have threatened a military offensive in Lebanon if there is no negotiated end to push Hezbollah away from the border.\nU.S. President Joe Biden's senior adviser, Amos Hochstein, met with officials in Lebanon and Israel last week in an effort to deescalate tensions.\nIt is harder to fend off the shorter-range rockets that Hezbollah fires routinely across the border into Israel, he said.\nThe situation escalated this month after an Israeli airstrike killed a senior Hezbollah military commander in southern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.6969768226097227, "event_breakdown": "1- The top U.S. military officer has warned that any Israeli military offensive into Lebanon would risk an Iranian response in defense of the powerful Hezbollah militant group there."}, {"id": "23c5f222-b762-4648-a58a-3e9480961eff", "title": "How drones form part of Hezbollah deterrence strategy against Israel", "date": "2024-06-24 19:15", "url": "https://theconversation.com/how-drones-form-part-of-hezbollahs-deterrence-strategy-against-israel-232808", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "Mutual deterrenceConfrontations between Israel and Hezbollah over the years have been marked by tit-for-tat attempts to establish mutual deterrence.\nIn recent months, Hezbollah has shot down Israeli drones and bombed Israeli military bases.\nBy provoking Israel, Hezbollah demonstrates its readiness to challenge it head on.\nHis comments form part of Hezbollah’s strategy in the psychological war with Israel, and the current escalation represents a significant development.\nIsrael’s military spokesman recently stated it’s not possible to destroy Hamas because destroying an idea with weapons is impossible.", "location": "Lebanon", "classification": "security", "score": 0.88011754048709, "event_breakdown": "Israeli drones shot down by Hezbollah\nBombings of Israeli military bases by Hezbollah\nIsraeli military spokesman comments on impossibility of destroying Hamas"}, {"id": "3bd78d00-7781-4dff-8d29-259eed0ee00d", "title": "Angola : Former South African Military Visit Southern Angola", "date": "2024-06-24 13:45", "url": "https://allafrica.com/stories/202406240469.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "Ondjiva — Twenty-five ex-servicemen and war veterans from South Africa and their families organised a tourist excursion to the municipality of Cahama, southern Cunene Province, from 18th to 20th of this month, with the aim of visiting former combat zones and other historical sites.\nThe tour by the Association of Former South African Combatants of Battalion 61 focused on visiting the former command post of the 2nd Motorised Infantry Brigade of the former FAPLA (governmental forces).\nThe delegation camped for 24 hours in the bunker compound, where during the night they gave several testimonies and exchanged experiences about the times of conflict and fraternised with members of the administration.\nHe said that the delegation intended to take an eight-day trip to the south of Angola, to the province of Cuando Cubango, with their return planned for the 25th, via Cunene.\nCahama - the scene of resistance to the South African occupationThe municipality of Cahama was the scene of the resistance struggle against the South African invasion of 1981, where intense and bloody fighting took place for seven years, forcing the South African regional military power to withdraw.", "location": "Cahama", "classification": "security", "score": 0.8767063258531076, "event_breakdown": "target event - a fleeting description of the place incident\nCahama - site of ongoing conflict between South African occupational forces and the Angolan government from 1981-1988, characterised by numerous attacks on civilians, including mass executions and aerial bombings."}, {"id": "52a552da-c830-4b45-b5bc-7d73587a951a", "title": "Massacre In Dagestan : On What Is Known So Far", "date": "2024-06-24 15:45", "url": "https://charter97.org/en/news/2024/6/24/600163/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Massacre In Dagestan: On What Is Known So Far 24.06.2024, 10:5437,162Analysts have revealed who may be behind the attack.\nMore than 15 Russian policemen and several civilians were killed in a militant attack in Dagestan on June 23.\nOne of the militants liquidated by Russian security forces in Dagestan may be MMA fighter Gadzhimurad Kagirov.\nWho Could Attack Dagestan?\nThe most dangerous of these episodes are the Prigozhin mutiny, the missed terrorist attack in Moscow and the airport massacre in Makhachkala.", "location": "Dagestan", "classification": "security", "score": 0.9771513141576743, "event_breakdown": "Event 1: Massacre at Crowded Iraq Market - 24.06.2024, 10:53 - 37,162\nEvent 2: More Than 15 Russian Cops Killed in Dagestan - 24.06:53 10:54 - 37,162\nEvent 3: Moscow Terrorism Foiled - 24.06.2024, 10:55 - 38,198\nEvent 4: Makhachkala Massacre at Airport - 24.06.2024, \n\nEvent 1: Massacre at Crowded Iraq Market - 24.06.2024, 10:53 - 37,162\n\nMore than 15 Russian policemen and several civilians were killed in a militant attack in Dagestan on June 23.\n\nEvent 2: More Than 15 Russian Cops Killed in Dagestan - 24.06:53 10:54 - 37,162\n\nAnalysts have revealed who may be behind the attack. One of the militants liquidated by Russian security forces in Dagestan may be MMA fighter Gadzhimurad Kagirov.\n\nEvent 3: Moscow Terrorism Foiled - 24.06.2024, 10:55 - 38,198\n\nMoscow's counter-terrorism operation must be prompted by a botched attack near Red Square."}, {"id": "6736eaa5-e683-43ce-b7ba-3ac09f2cc914", "title": "The US and Israel missed many opportunities for peace with Hamas", "date": "2024-06-24 15:30", "url": "https://www.aljazeera.com/opinions/2024/6/24/the-us-and-israel-missed-many-opportunities-for-peace-with-hamas", "domain": "aljazeera.com", "domain_classification": "International", "message": "Yet US deference to Israeli intransigence – no matter that it stubbornly blames Hamas – is costing thousands of Palestinian lives.\nThis was essentially de facto recognition of Israel, with a cessation of hostilities – two of the key US and Israeli demands of Hamas.\nInstead, in 2007, it launched a covert effort to foment a Palestinian civil war, trying and failing to oust Hamas.\nIsrael, meanwhile, is balking, saying, again, it won’t rest until Hamas is no more.\nWith the group’s popularity surging among Palestinians, Israel’s continued insistence on eliminating Hamas amounts to a fantasy to justify the ongoing slaughter.", "location": "Gaza", "classification": "security", "score": 0.7689959972156261, "event_breakdown": "*/\nIsrael-Gaza border, Middle East\nOn May 15, 2022, Israel and Hamas announced that they had reached an agreement to end their fighting in the Gaza Strip. The ceasefire was brokered by Egypt, and it went into effect at 2:00 am local time. The deal includes the opening of border crossings, allowing the movement of people and goods in and out of the Gaza Strip.\n\nThis is a breaking news event, which happened on May 15, 2022."}, {"id": "27e41ded-594d-4d98-8d8d-da4127e74914", "title": "Milrem Robotics Unveils Artificial Intelligence - Guided Tactical Unmanned Ground Vehicle", "date": "2024-06-24 16:30", "url": "https://sofrep.com/news/milrem-robotics-unveils-artificial-intelligence-guided-tactical-unmanned-ground-vehicle/", "domain": "sofrep.com", "domain_classification": "Unknown", "message": "In a world where technological innovation is the driving force behind military advancements, Estonian company Milrem Robotics has stepped into the spotlight by introducing a cutting-edge AI-guided tactical unmanned ground vehicle (UGV).\nMilrem Robotics and Leonardo CollaborationThe collaboration between Milrem Robotics and Leonardo represents a significant milestone in the field of robotic combat systems.\nMilrem Robotics and Loc Performance CollaborationIn addition to their collaboration with Leonardo, Milrem Robotics has previously ventured into the US Army’s quest for advanced robotic combat vehicles (RCV).\nAnnounced in June 2023, Milrem Robotics partnered with Michigan robotics firm Loc Performance to develop a “groundbreaking” Robotic Combat Vehicle – Light (RCV-L) for the US Army’s competition.\nBy participating in this consortium, Milrem Robotics is actively contributing to developing methods that will shape the future of manned and unmanned military operations.", "location": "Tallinn", "classification": "security", "score": 0.5333657884066062, "event_breakdown": "New Security Event: Milrem Robotics of Estonia has joined forces with Leonardo of Italy to bring a cutting-edge AI-guided tactical unmanned ground vehicle to market. The collaboration between Milrem Robotics and Loc Performance is also significant in the field of robotic combat systems, as part of ongoing efforts to advance unmanned military operations."}, {"id": "86bc1407-1d59-461e-a598-f704231ba607", "title": "Waymo robotaxi rollout overcomes regulatory roadblocks in California", "date": "2024-06-24 16:45", "url": "https://www.techspot.com/news/103518-waymo-robotaxi-rollout-overcomes-regulatory-roadblocks-california.html", "domain": "techspot.com", "domain_classification": "Unknown", "message": "The road is a little clearer for Waymo's self-driving taxi ambitions in California.\nSan Mateo County and LA pushed to delay Waymo's rollout until city governments could exert greater local control.\nA proposed state bill that would've granted local governments authority over self-driving vehicles operating in their jurisdictions boosted county officials' hopes.\nConcerns raised by local officials are not unfounded.\nThat said, Waymo has yet to reveal specifics on when it might start commercial driverless rides in San Mateo County.", "location": "San Mateo, California", "classification": "security", "score": 0.4151697646328305, "event_breakdown": "Local officials in L.A. and San Mateo County are seeking to delay Waymo's commercial driverless taxi service in their respective jurisdictions until greater local control can be exerted. While these worries are not unfounded, Waymo has yet to announce a timeline for beginning commercial driverless rides in San Mateo County."}, {"id": "52343ab0-c297-404e-b7c3-b7702582bf89", "title": "Israel strikes kill at least 11 in Gaza , tanks push further into Rafah", "date": "2024-06-24 16:30", "url": "https://www.yahoo.com/news/israel-kills-senior-gaza-health-084255524.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "One strike at a food distribution centre in Gaza City, near the Shati historic refugee camp, killed three people.\nAnother, near Bani Suhaila town in the southern Gaza Strip, killed at least eight, including guards who accompany aid trucks, the medics said.\nOvernight, an Israeli air strike at a medical clinic in Gaza City killed the director of Gaza's Ambulance and Emergency Department, the enclave's health ministry said.\nHamas says any agreement must end the war, while Israel says it will agree only temporary pauses in fighting until Hamas is eradicated.\nThe Israeli offensive in retaliation has killed almost 37,600 people, according to Palestinian health authorities, and has left Gaza in ruins.", "location": "GAZA CITY", "classification": "security", "score": 0.9064902092561387, "event_breakdown": "Gaza City, Shati historic refugee camp, Bani Suhaila town, Gaza City"}, {"id": "86fa6dd3-c9ff-463d-8691-6bb5fa7d0e61", "title": "Israel strikes kill at least 11 in Gaza , tanks push further into Rafah", "date": "2024-06-24 17:30", "url": "https://www.swissinfo.ch/eng/israel-strikes-kill-at-least-11-in-gaza%2c-tanks-push-further-into-rafah/81637480", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Israel strikes kill at least 11 in Gaza, tanks push further into Rafahreuters_tickers5 minutesBy Nidal al-MughrabiCAIRO (Reuters) -Two Israeli air strikes targeting aid supplies killed at least 11 Palestinians in Gaza on Monday, medics said, as Israeli tanks pushed deeper into Rafah in the south and fought their way back into areas in the north they had already subdued months ago.\nOne strike at a food distribution centre in Gaza City, near the Shati historic refugee camp, killed three people.\nAnother, near Bani Suhaila town in the southern Gaza Strip, killed at least eight, including guards who accompany aid trucks, the medics said.\nOvernight, an Israeli air strike at a medical clinic in Gaza City killed the director of Gaza’s Ambulance and Emergency Department, the enclave’s health ministry said.\nHamas says any agreement must end the war, while Israel says it will agree only temporary pauses in fighting until Hamas is eradicated.", "location": "GAZA CITY", "classification": "security", "score": 0.8371545340536128, "event_breakdown": "Israel strikes kill at least 11 in Gaza, tanks push further into Rafah"}, {"id": "bbb6a05e-a1f0-4b13-bfae-106f33e071a6", "title": "How Ukraine Naval Drones Turned the Tide in the Battle of the Black Sea", "date": "2024-06-24 03:45", "url": "https://biztoc.com/x/0190d9d309a47d19", "domain": "biztoc.com", "domain_classification": "Unknown", "message": "Unmanned vessels developed in the fight against Russia are part of a revolution in modern warfare.\nThis story appeared on wsj.com , 2024-06-24.", "location": "Russia", "classification": "security", "score": 0.5434590011244254, "event_breakdown": "Russia's invasion of Ukraine has led to a proliferation of armed, unmanned vessels in the Black Sea. These vessels are equipped with advanced sensors and weapons systems and are capable of conducting complex operations independently. They are being developed and deployed by both the Ukrainian and Russian navies, and they are playing an increasingly important role in combat operations. The presence of armed, unmanned vessels in the Black Sea highlights the increasing importance of unmanned systems in modern warfare."}, {"id": "5d011a20-b440-483c-a35e-9f8fdfbbd333", "title": "Chief of Staff :  We approaching the defeat of the Hamas Rafah Brigade  ", "date": "2024-06-24 17:45", "url": "https://www.israelnationalnews.com/news/392043", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Chief of Staff Halevi said,\"We have very high levels of achievements from the combat in Rafah, and I express great appreciation for that.\nThis is reflected in the number of terrorists that have been eliminated, as well as the infrastructure destroyed, the underground tunnel routes, their mapping, destruction, and the progress in the complex underground combat.\"\n\"The fact that the 162nd Division now controls the Philadelphi Corridor from the sea to the border between Israel, Gaza, and Egypt, is very significant in cutting off Hamas' supply for future smuggling.\nWe are now dealing with the underground assets,\" he said.\nWith great appreciation, what is happening here is very impressive professionally, keep it up.\"", "location": "Rafah (Gaza)", "classification": "security", "score": 0.4118847128994603, "event_breakdown": "162nd Division controls Philadelphi Corridor in Israel"}, {"id": "ccafec00-0fc9-454d-bc3a-8f9030281337", "title": "Seoul says North Korea has resumed balloon launches likely to drop trash in South Korea", "date": "2024-06-24 17:00", "url": "https://lethbridgeherald.com/news/world-news/2024/06/24/seoul-says-north-korea-has-resumed-balloon-launches-likely-to-drop-trash-in-south-korea/", "domain": "lethbridgeherald.com", "domain_classification": "Unknown", "message": "Seoul says North Korea has resumed balloon launches likely to drop trash in South KoreaBy Hyung-jin Kim, The Associated Press on June 24, 2024.\n(Fighters For A Free North Korea via AP) In this photo provided by Fighters For A Free North Korea, North Korean defector Park Sang-hak, left, and a member of Fighters For A Free North Korea hold balloons bearing anti-North Korean propaganda leaflets in Paju, near the border with North Korea, South Korea, Thursday, June 20, 2024.\n(Fighters For A Free North Korea via AP)SEOUL, South Korea (AP) – South Korea’s military says North Korea has launched more balloons likely carrying trash toward South Korea.\nThe South Korean military didn’t say how it would respond if North Korea conducts a new round of balloon launches.\nNorth Korea has reacted to past South Korean loudspeaker broadcasts and civilian balloon activities by firing rounds across the border, prompting South Korea to return fire, according to South Korea.", "location": "PAJU.", "classification": "security", "score": 0.8098410639373654, "event_breakdown": "North Korea launched more balloons likely carrying trash toward South Korea in 2024."}, {"id": "96fbdf17-192e-40d7-909b-13e7e47a0e90", "title": "IRGC Commander Hossein Salami :  We Are Living In An Era In Which God Has Given A Clear Victory To The Front Of Islam ... In Recent Decades , We Have Had Unceasing Jihad [ Holy War ] And Unstoppable And Ongoing War With The Arrogant Regime [ The U . ...", "date": "2024-06-24 16:45", "url": "https://www.memri.org/reports/irgc-commander-hossein-salami-we-are-living-era-which-god-has-given-clear-victory-front", "domain": "memri.org", "domain_classification": "Unknown", "message": "We are living in an era in which God has given a clear victory to the front of Islam.\nSalami (Source: Tasnim, Iran, May 5, 2024)\"Every country in the world is weakened by war – but Iran [only] grows stronger from war.\nAmerica's goal, according to Salami, is to control the entire Islamic world, and to eradicate its cultural identity and to pillage the property of the Muslims.\nThe Arrogance, Of Which America Is The Center, Knows No Limits In Pursuing Its Goal Of Controlling The Islamic World\"\"...\nThe mission of the Qods Force is to block the corners through which the enemy is penetrating the Islamic world.", "location": "The Islamic Republic of Iran", "classification": "security", "score": 0.4728493182135614, "event_breakdown": "Salami also said that \"America looks at the Islamic world, north and south, as property to play with and plunder\" and that \"America's enmity [against] the Islam and Iran is a long standing one\"."}, {"id": "a75d8eb3-5ebd-47f4-bb8e-c8667c777fbc", "title": "Carson City Nevada News - Carson Now | Your one stop for Carson City news", "date": "2024-06-24 12:45", "url": "https://www.carsonnow.org/?form_build_id=form-ePfe8l7k52w_FVRlQeNhK0Wv96hmVttGhQbk8zVt74c&form_id=search_theme_form&op=Search&search_theme_form=donovan%2520harsh", "domain": "carsonnow.org", "domain_classification": "Unknown", "message": "Every year throughout our region, pets are found dead in cars due to heat exhaustion, including those with windows cracked.\nWith outside temperatures often in the 90s and above, internal car temperatures can reach anywhere from 114 degrees after 10 minutes, to 140 degrees after an hour.\nCracking a window often does nothing at all as rolling down the windows has been shown to have little effect on the temperature inside a car, according to the Humane Society of the U.S.", "location": "CHARLESTON", "classification": "security", "score": 0.8949121336044727, "event_breakdown": "Heat Stroke - Pets (Pets undergoing heat stroke in parked cars)"}]