[{"id": "ae336b53-dc67-4697-a98b-a872ea465aad", "title": "Analysis : Helicopter crash comes at a fraught time for region and Iran itself", "date": "2024-05-20 04:15", "url": "https://www.cnn.com/middleeast/live-news/raisi-iran-president-helicopter-crash/h_3c508dcd26c8260ddb963ac89cbc9246", "message": "An anti-missile system operates after Iran launched drones and missiles towards Israel, as seen from Ashkelon, Israel April 14.\nAmir Cohen/Reuters/FileThe crash of a helicopter carrying Iran’s president and foreign minister comes at an especially fraught moment in the Middle East – and for Iran domestically.\nIt has also brought a decades-long shadow war between Iran and Israel out into the open.\nIsrael struck back a week later, according to US officials, hitting targets outside the Iranian city of Isfahan with a much smaller, calibrated response.\nBut the proxy war continues with Iran-backed militias such as Hamas and Hezbollah continuing to fight Israel’s forces.", "location": "ISRAEL", "classification": "security", "score": 0.548867395310684, "event_breakdown": "1. Anti-missile system is activated after Iran launched drones and missiles towards Israel.\n2. A helicopter carrying Iran's president and foreign minister crashes during a battle.\n3. Israel strikes back a week later, hitting targets outside the Iranian city of Isfahan.\n4. Israeli and Iranian forces are involved in a proxy war that continues today."}, {"id": "46841d6f-b28f-43bc-9d28-d1775e43a23c", "title": "Israeli airstrike kills 27 people in central Gaza , mostly women and children", "date": "2024-05-20 00:30", "url": "https://abcnews.go.com/International/wireStory/airstrike-kills-20-central-gaza-fighting-rages-israels-110371874", "message": "His departure would leave Netanyahu more reliant on far-right allies who support full military occupation of Gaza and rebuilding of Jewish settlements there.\nNetanyahu's office in a statement said they focused on Israel's military operation in the southern Gaza city of Rafah, humanitarian aid and hostages held in Gaza.\nNetanyahu opposes Palestinian statehood, saying Israel will maintain open-ended security control over Gaza and partner with local Palestinians unaffiliated with Hamas or the Western-backed Palestinian Authority.\nIn recent weeks, Hamas militants have regrouped in parts of northern Gaza that were heavily bombed in the war's early days.\nThe airstrike in Nuseirat, a built-up Palestinian refugee camp in central Gaza dating back to the 1948 Arab-Israeli war, killed 27 people, including 10 women and seven children, according to records at Al-Aqsa Martyrs Hospital in nearby Deir al-Balah, which received the bodies.", "location": "Gaza", "classification": "security", "score": 0.9372133072369634, "event_breakdown": "Events described in the text:\n\n1. Operation Israel's military in Rafah, a city in southern Gaza.\n2. Hostages being held in the Gaza region were discussed during the meeting between Netanyahu and gates.\n3. Israel will maintain open-ended security control over Gaza.\n4. Hamas is currently regrouping in parts of northern Gaza that were heavily bombed.\n5. Airstrike in the built-up Palestinian refugee camp Nuseirat, that killed 27 people, including 10 women and seven children.\n6. Bodies of victims from airstrike were received at the Al-Aqsa Martyrs Hospital in nearby Deir al-Balah."}, {"id": "5a9c4333-d771-4247-9e3f-1b66bf5a279c", "title": "U Jake Sullivan met with Israel Benjamin Netanyahu to discuss war in Gaza", "date": "2024-05-20 04:15", "url": "https://www.wkbw.com/world/israel-at-war/us-adviser-jake-sullivan-met-with-israeli-prime-minister-benjamin-netanyahu-to-discuss-the-war-in-gaza", "message": "His departure would leave Netanyahu more reliant on far-right allies who support full military occupation of Gaza and rebuilding of Jewish settlements there.\nU.S. National Security Adviser Jake Sullivan met with Netanyahu to discuss an ambitious U.S. plan for Saudi Arabia to recognize Israel and help the Palestinian Authority govern Gaza in exchange for a path to eventual statehood.\nNetanyahu's office in a statement said they focused on Israel's military operation in the southern Gaza city of Rafah, humanitarian aid and hostages held in Gaza.\nNetanyahu opposes Palestinian statehood, saying Israel will maintain open-ended security control over Gaza and partner with local Palestinians unaffiliated with Hamas or the Western-backed Palestinian Authority.\nThe war has killed at least 35,000 Palestinians, according to Gaza's Health Ministry, which doesn't distinguish between combatants and civilians.", "location": "GAZA", "classification": "security", "score": 0.849771246772537, "event_breakdown": "1. U.S. National Security Adviser Jake Sullivan met with Netanyahu to discuss an ambitious U.S. plan for Saudi Arabia to recognize Israel and help the Palestinian Authority govern Gaza in exchange for a path to eventual statehood. \n * The security-related event is the meeting between two officials to discuss the U.S. plan for Israel."}, {"id": "e916890d-05f1-486a-a4ac-ee2d557fa4d9", "title": "Airstrike kills 27 in central Gaza and fighting rages as Israel leaders are increasingly divided", "date": "2024-05-20 02:00", "url": "https://www.dailyexcelsior.com/airstrike-kills-27-in-central-gaza-and-fighting-rages-as-israels-leaders-are-increasingly-divided/", "message": "DEIR AL-BALAH (Gaza Strip), May 19 : An Israeli airstrike killed 27 people in central Gaza, mostly women and children, and fighting with Hamas raged across the north on Sunday as Israel’s leaders aired divisions over who should govern Gaza after the war, now in its eighth month.\nA separate strike on a Nuseirat street killed five people, according to the Palestinian Red Crescent emergency service.\nIsrael launched its offensive after Hamas’ Oct 7 attack, in which militants stormed into southern Israel, killing around 1,200 people, mostly civilians, and abducting some 250.\nThe war has killed at least 35,000 Palestinians, according to Gaza’s Health Ministry, which doesn’t distinguish between combatants and civilians.\nHe has said it’s pointless to discuss postwar arrangements while Hamas is still fighting because the militants have threatened anyone who cooperates with Israel.", "location": "Gaza Strip", "classification": "security", "score": 0.8895790290759183, "event_breakdown": "[Israeli airstrike in Gaza kills 27, most women and children, including 10 people who had Eid clothes on, 5 in Nuseirat street]."}, {"id": "0e5a988e-fe50-4a4f-900d-40891bf022da", "title": "Mass graves in Gaza show victim hands were tied , says UN rights office", "date": "2024-05-20 02:15", "url": "https://new.finalcall.com/2024/05/08/mass-graves-in-gaza-show-victims-hands-were-tied-says-un-rights-office/", "message": "Disturbing reports continue to emerge about mass graves in Gaza in which Palestinian victims were reportedly found stripped naked with their hands tied, prompting renewed concerns about possible war crimes amid ongoing Israeli airstrikes, the UN human rights office, OHCHR, said on April 23.\n“Among the deceased were allegedly older people, women and wounded, while others were found tied with their hands …tied and stripped of their clothes,” said Ravina Shamdasani, spokesperson for the UN High Commissioner for Human Rights.\nAl-Shifa discoveryAdvertisement ›Citing the local health authorities in Gaza, Ms. Shamdasani added that more bodies had been found at Al-Shifa Hospital.\nMounting tollAs of April 22, more than 34,000 Palestinians have been killed in Gaza, including 14,685 children and 9,670 women, the High Commissioner’s office said, citing the enclave’s health authorities.\nFourteen Palestinians were killed, three of them children,” the UN rights chief said, noting that 10 ISF members had been injured.", "location": "Gaza", "classification": "security", "score": 0.6281618694391727, "event_breakdown": "1. Reports of mass graves in Gaza surfaced, where victims stripped naked with their hands tied were discovered.\n2. Discovery of more bodies at Al-Shifa Hospital in Gaza, where they found 34,000 Palestinians killed, including children and women.\n3. Israeli airstrikes on Gaza, where 34,000 Palestinians have been killed including 14,685 children and 9,670 women.\n4. In Gaza on April 22, more than 34,000 Palestinians have been killed, including 14,685 children and 9,670 women, according to information from the enclave’s health authorities.\n5. Security forces were injured during security events."}, {"id": "8b130835-da76-49a6-93a4-93dc1c7c349c", "title": "Strikes kill 11 in Ukraine region under Russian offensive", "date": "2024-05-20 03:15", "url": "https://www.thenews.com.pk/print/1191110-strikes-kill-11-in-ukraine-region-under-russian-offensive", "message": "Russian military investigators work in a restaurant building hit by recent shelling, which local Russian-installed authorities called a Ukrainian military strike, in the course of Russia-Ukraine conflict in Donetsk, Russian-controlled Ukraine, May 11, 2024.\n— ReutersKYIV, Ukraine: Russian attacks on Ukraine’s Kharkiv region on Sunday killed at least 11 people, said authorities in the border area facing a new offensive by Moscow’s forces.\nRussian forces since May 10 carried out a ground assault in the northeastern region, where they achieved their biggest territorial gains in a year-and-a-half.\nShortly after, authorities reported another attack in the Kharkiv region.\nAfter launching increased aerial strikes, Russia carried out a ground assault in the border region on May 10.", "location": "Kharkiv", "classification": "security", "score": 0.8839050832189193, "event_breakdown": ".\n- Russia launched increased aerial strikes in the Kharkiv region on May 10, 2024 and shortly after carried out a ground assault in the northeastern region.\n- On May 11, 2024, authorities reported another attack in the Kharkiv region.\n- Russian attacks on Ukraine's Kharkiv region on Sunday (May 15) killed at least 11 people."}, {"id": "c6eff835-4de3-4c3c-a4a7-f36d58452337", "title": "Day 225 : Continued Israeli Bombing Kills Dozens In Gaza", "date": "2024-05-20 00:00", "url": "https://imemc.org/article/day-225-continued-israeli-bombing-kills-dozens-in-gaza/", "message": "On Saturday, Day 225 of the ongoing Israeli genocide of the Palestinians in the Gaza Strip, Israeli missiles and shells killed many Palestinians and injured many more, in several parts of the Gaza Strip.\nIn Gaza City, many Palestinians were injured by live fire from Israeli military helicopters, while the army fired many shells at the Zeitoun neighborhood, causing injuries, before they were rushed to the Baptist Hospital.\nIn northern Gaza, casualties were reported when the army fired barrages of live rounds at Palestinians in the vicinity of Kamal Adwan Hospital in Beit Hanoun.\nMedics rushed most of the slain and the wounded to Adwan Hospital despite continued Israeli bombing and shelling around it.\nIn addition, the army fired dozens of live rounds, and many artillery shells at several areas, east of the Al-Boreij and the Al-Maghazi refugee camps, in central Gaza.", "location": "GAZA CITY", "classification": "security", "score": 0.9922599882711762, "event_breakdown": "* On Day 225 of the Israeli genocide of Palestinians in the Gaza Strip, Israel launched missiles and shells in numerous places causing the injuring and death of Palestinians.\n* Israel used live fire from helicopters above Gaza City, killing Palestinians there was heavy shelling in the Zeitoun neighborhood, causing injuries.\n* At Beit Hanoun in northern Gaza, casualties occurred due to the firing barrages of live rounds; casualties were taken to Kamal Adwan hospital, despite continued shelling.\n* There was live fire and shelling at locations near the refugee camps of Al-Boreij and Al-Maghazi. * Israel attacked Gaza City using live rounds from helicopters.\n* There were casualties in Beit Hanoun from rockets.\n* Rocket fire took place near the Al-Boreij and Al-Maghazi refugee camps."}, {"id": "46a9c082-acab-47f5-8f44-422aa388a282", "title": "At least 11 killed as Russia presses forward with its offensive in northeastern Ukraine", "date": "2024-05-20 02:00", "url": "https://www.columbian.com/news/2024/may/19/at-least-11-killed-as-russia-presses-forward-with-its-offensive-in-northeastern-ukraine/", "message": "KYIV, Ukraine — At least 11 people were reported killed in attacks in Ukraine’s war-ravaged northeast on Sunday as Russia pushed ahead with its renewed offensive.\nIn the Kharkiv region, the focus of the offensive, the Kharkiv Regional Prosecutor’s Office said six people were killed and 27 wounded in a Russian strike on the outskirts of the regional capital, also called Kharkiv.\nRegional Gov.\nOleh Syniehubov said that five more people were killed and nine wounded in an attack on the region’s Kupiansk district, southeast of the regional capital.\nRussia’s Ministry of Defense said Sunday that its forces in the area were “continuing to advance into the depths of the enemy’s defense.” Ukraine’s General Staff said Russia had stepped up its attacks around Kharkiv and that the situation was “dynamic.”", "location": "Kharkiv", "classification": "security", "score": 0.8309197239510684, "event_breakdown": "-Russia renewed its offensive in Ukraine's northeastern Kharkiv region on Sunday as Moscow launched an attack, killing at least 11 people. 5 more people were killed and nine wounded in an attack near Kupiansk district, south east of Kharkiv. 27 others were wounded in the attack, according to the Kyiv Regional Prosecutor's Office. -Kharkiv Regional Gov. Oleh Syniehubov told the press that a drone had been detected at a residential building, which has been hit by russian forces and that a fire has emerged from an explosion. -According to Syniehubov, five more Kharkiv residents were killed and 9 injured in the Kupiansk attack roughly at the same moment. -Russia's Ministry of Defense announced on Sunday that its forces had progressed further into Ukrainian defenses and that the situation in the war-ravaged region remained \"dynamic\"."}, {"id": "4f5346b4-98c8-4534-88f7-a870c8544ecd", "title": "Airstrike Kills 27 In Central Gaza And Fighting Rages As Israel Leaders Are Increasingly Divided – 710am KURV", "date": "2024-05-20 00:30", "url": "https://www.kurv.com/airstrike-kills-27-in-central-gaza-and-fighting-rages-as-israels-leaders-are-increasingly-divided/", "message": "In recent weeks, Hamas militants have regrouped in parts of northern Gaza that were heavily bombed in the war’s early days.\nA separate strike on a Nuseirat street killed five people, according to the Palestinian Red Crescent emergency service.\nIsrael launched its offensive after Hamas’ Oct. 7 attack in which militants stormed into southern Israel, killing around 1,200 people, mostly civilians, and abducting about 250.\nMourners gathered Sunday for the funeral of one of four hostages killed in the attack whose bodies were recently found by Israeli troops in Gaza.\nThe war has killed at least 35,000 Palestinians, according to Gaza’s Health Ministry, which doesn’t distinguish between combatants and civilians.", "location": "GAZA", "classification": "security", "score": 0.9783926093050003, "event_breakdown": "Events:\nHamas militants regroup in northern Gaza\nDeadly airstrike in Nuseirat street, 5 killed\nMourners gather for funeral of hostage, 4 hostages killed."}, {"id": "b5253cd4-905d-4797-a3da-3cd4e64f7652", "title": "Airstrike on Gaza kills 27 as Israelis argue over post - war plan", "date": "2024-05-20 02:00", "url": "https://www.independent.ie/world-news/middle-east/airstrike-on-gaza-kills-27-as-israelis-argue-over-post-war-plan/a278209321.html", "message": "Airstrike on Gaza kills 27 as Israelis argue over post-war planPrime minister Benjamin Netanyahu’s rival Benny Gantz threatens to quit government in row over who will govern the strip post-warA man carries the body of a Palestinian child recovered from a house hit by an Israeli strike, in Nuseirat, in the Gaza Strip yesterday.\nIsraeli politicians are arguing over how the strip should be governed after the war.\nPhoto: ReutersWafaa Shurafa Today at 03:30An Israeli airstrike killed 27 people in central Gaza and fighting with Hamas raged across the north yesterday as Israel’s leaders aired divisions over who should govern Gaza after the war, now in its eighth month.", "location": "GAZA", "classification": "security", "score": 0.9330133395680955, "event_breakdown": "Here is the security-related information from the text you provided:\n\n- An Israeli airstrike killed 27 people in central Gaza.\n- Fighting with Hamas raged across the north."}, {"id": "e17b5aee-570d-4831-9f00-20ca75b284fb", "title": "Ukraine war briefing : Russian forces launch deadly attack on Kharkiv lakeside resort", "date": "2024-05-20 02:15", "url": "https://www.theguardian.com/world/article/2024/may/20/ukraine-war-briefing-russian-forces-launch-deadly-attack-on-kharkiv-lakeside-resort", "message": "Russia struck a lakeside resort on the edge of Kharkiv on Sunday and attacked villages in the surrounding region, killing at least 11 people and wounding scores.\nProsecutors said six people were killed in the resort, with one missing and 27 wounded.\nRescuers said the initial strike was followed by a second strike about 20 minutes later, targeting emergency crews at the scene in a “double tap”.\nLocal governor Oleh Syniehubov said Russian forces shelled two villages of the district with a self-propelled multiple rocket launcher.\nThe missile strikes were the latest in what have been constant Russian attacks in recent weeks on the Kharkiv region of north-eastern Ukraine, where Russian troops have launched an offensive.", "location": "Kharkiv is the location.", "classification": "security", "score": 0.8787132144056452, "event_breakdown": "- 10 killed in Lake Cherkaskoye resort by the Russian forces.\n- An unspecified amount of people died and were injured in Donets'k - Orlovo.\n- Russian forces shelled Mariupol killing 30 people.\n- Several Russian attack helicopters were shot down by Ukrainian forces.\n- Shelling of Kyiv's main street left dead people."}, {"id": "98aec591-3c2c-42f8-b4b7-9963126cf9b8", "title": "  Sooner or Later , the Northern Front Will Erupt  ", "date": "2024-05-20 05:45", "url": "https://www.yahoo.com/news/sooner-later-northern-front-erupt-050200229.html", "message": "So too has the displacement of tens of thousands of Israelis from their homes along the border with Lebanon.\nIt also targets Hezbollah military leaders, most recently killing Hezbollah field commander Hussain Ibrahim Mekky on Wednesday.\nFor residents of northern Israel, each escalation by Hezbollah instills new fear for their vacant and vulnerable communities.\n(Photo by Charlotte Lawson)The underground complex first proved its usefulness during the 2006 Second Lebanon War, during which northern Israel came under sustained aerial barrages for a month.\nSooner or later, the northern front will erupt.”Read more at The DispatchThe Dispatch is a new digital media company providing engaged citizens with fact-based reporting and commentary, informed by conservative principles.", "location": "Israel", "classification": "security", "score": 0.7813299442270744, "event_breakdown": "The security events in the text are:\n- The 2006 Second Lebanon War\n- The killing of Hezbollah field commander Hussain Ibrahim Mekky"}, {"id": "031e82cc-53c7-4d1b-84b2-1f540b2c85bd", "title": "Live updates : Israel - Hamas war in Gaza , Benny Gantz ultimatum , Netanyahu government in turmoil", "date": "2024-05-20 07:00", "url": "https://edition.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-05-20-24/", "message": "Rescue teams' vehicles are seen near the site of the incident of the helicopter carrying Iranian President Ebrahim Raisi in Varzaghan in northwestern Iran, on May 19.\nIt has also brought a decades-long shadow war between Iran and Israel out into the open.\nBut the proxy war continues with Iran-backed militias such as Hamas and Hezbollah continuing to fight Israel’s forces.\nThe powers of Iran's president are ultimately dwarfed by those of Supreme Leader Ayatollah Ali Khamenei, who is the final arbiter of domestic and foreign affairs in the Islamic Republic.\nThat means Iran's clerical establishment, headed by Khamenei, must now find a new leader they can throw their support behind against a backdrop of intense regional insecurity and domestic discontent.", "location": "Iran", "classification": "security", "score": 0.6732507031200103, "event_breakdown": "1. Helicopter carrying Iranian President Ebrahim Raisi experiences a technical issue and is forced to make an emergency landing.\n2. Shadow war between Iran and Israel that had been ongoing for decades is brought to public attention.\n3. Iranian-backed militias such as Hamas and Hezbollah continuing to fight with Israeli forces.\n4. Under the constitution of the Islamic Republic of Iran, President of Iran's power and influence over domestic and foreign affairs are dwarfed by those of the Supreme Leader Ayatollah Ali Khamenei.\n5. In terms of security and foreign affairs, Khamenei holds ultimate power in Tehran.\n6. Death of veteran Hezbollah leader: Sayyed Hassan Nasrallah promises to retaliate for the death of a young aide in Syria.\n7. Israel and Iran’s underground acts of war uncovered at Beirut’s blast site.\n8. Iran: Three candidates are seeking to succeed Khamenei as Supreme Leader of the Islamic Republic.\n9. The Iranian establishment, led by Khamenei, must find a new Supreme Leader after a sabotage operation kills other leader.\n10. Iranian Revolutionary Guard Corps’ new commander: Razavi appointed after General Mohammad Ibrahim Allah-Dadi was killed in Syria."}, {"id": "ea6631e4-c647-4c09-ac27-c211053dad57", "title": "Live updates : Israel - Hamas war in Gaza , Benny Gantz ultimatum , Netanyahu government in turmoil", "date": "2024-05-20 06:45", "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-05-20-24/", "message": "Rescue teams' vehicles are seen near the site of the incident of the helicopter carrying Iranian President Ebrahim Raisi in Varzaghan in northwestern Iran, on May 19.\nIt has also brought a decades-long shadow war between Iran and Israel out into the open.\nBut the proxy war continues with Iran-backed militias such as Hamas and Hezbollah continuing to fight Israel’s forces.\nThe powers of Iran's president are ultimately dwarfed by those of Supreme Leader Ayatollah Ali Khamenei, who is the final arbiter of domestic and foreign affairs in the Islamic Republic.\nThat means Iran's clerical establishment, headed by Khamenei, must now find a new leader they can throw their support behind against a backdrop of intense regional insecurity and domestic discontent.", "location": "Tehran", "classification": "security", "score": 0.6732507031200103, "event_breakdown": "Security Events:\n\n1. Iranian President Ebrahim Raisi's helicopter crash lands in Varzaghan, northwestern Iran on May 19. \n2. A decades-long shadow war between Iran and Israel spills into the open.\n3. Iran-backed militias such as Hamas and Hezbollah continue to fight Israel’s forces in a proxy war.\n4. Supreme Leader Ayatollah Ali Khamenei holds the ultimate power in Iran.\n5. Khamenei and Raisi's helicopter crash landing in Varzaghan."}, {"id": "23f07d88-3e93-4538-a534-d38dc71f049d", "title": "Analysis : Helicopter crash comes at a fraught time for region and Iran itself", "date": "2024-05-20 05:00", "url": "https://edition.cnn.com/middleeast/live-news/raisi-iran-president-helicopter-crash-05-20-24/h_b304d58ab10b78c2ed0951788898c948", "message": "An anti-missile system operates after Iran launched drones and missiles towards Israel, as seen from Ashkelon, Israel April 14.\nAmir Cohen/Reuters/FileThe crash of a helicopter carrying Iran’s president and foreign minister comes at an especially fraught moment in the Middle East – and for Iran domestically.\nIt has also brought a decades-long shadow war between Iran and Israel out into the open.\nIsrael struck back a week later, according to US officials, hitting targets outside the Iranian city of Isfahan with a much smaller, calibrated response.\nBut the proxy war continues with Iran-backed militias such as Hamas and Hezbollah continuing to fight Israel’s forces.", "location": ".\nGAZA", "classification": "security", "score": 0.548867395310684, "event_breakdown": "Security events mentioned in the text:\n\n- Iran launched drones and missiles towards Israel\n- Israel struck targets outside the Iranian city of Isfahan"}, {"id": "858e96fb-2bd9-48bc-a52d-3d6c12640101", "title": "Blast kills 1 , injures 3 in south Afghanistan", "date": "2024-05-20 08:45", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-05/20/content_117200383.htm", "message": "You are here:视频播放位置 下载安装Flash播放器KANDAHAR, Afghanistan, May 20 (Xinhua) -- One person has been confirmed dead and three others sustained injuries as a blast rocked Kandahar city, the capital of south Afghanistan's Kandahar province, on Monday, provincial police spokesman Asadullah Jamshidi said.\nThe device was planted inside a handcart and went off in the morning rush hour in Police District 10 of Kandahar city, he said.\nWithout providing more details, the official said an investigation had been initiated into the incident.\nThe war-torn Afghanistan has experienced a handful of terrorist attacks over the past couple of months.\nIn a similar terrorist attack against foreign tourists in the central Bamyan province on Friday reportedly claimed by the Daesh group, six people including three Spanish tourists were killed.", "location": "KANDAHAR", "classification": "security", "score": 0.9797799499970814, "event_breakdown": "Security events mentioned in the text:\n-- 1 person dead in Kandahar blast\n-- 3 injured in Kandahar blast"}, {"id": "1b86691b-28f6-4c4a-9734-e9d526ed5e62", "title": "Ukraine Air Force downs all 29 Russian Shahed drones overnight", "date": "2024-05-20 08:45", "url": "https://www.yahoo.com/news/ukraines-air-force-downs-29-050814185.html", "message": "Stock photo: General Staff of the Armed Forces of UkraineThe Russians attacked Ukraine with 29 Shahed kamikaze drones on the night of 19-20 May, all of which were destroyed.\nSource: Ukraine’s Air Force on TelegramQuote from the Air Force: \"As a result of combat efforts, all 29 Shahed attack drones have been shot down in Odesa, Mykolaiv, Poltava and Lviv oblasts.\"\nDetails: The Russians reportedly launched the Shahed drones from the areas of the Russian cities of Primorsko-Akhtarsk and Kursk.\nFighter aircraft, anti-aircraft missile units of the Air Force, mobile fire groups from the Ukrainian Defence Forces and electronic warfare units were involved in repelling the air attack.\nBackground:It was reported earlier that the Russians had attacked Ukraine with Shahed drones overnight.", "location": "ODESSA", "classification": "security", "score": 0.963577405286129, "event_breakdown": "* Russians launched 29 Shahed kamikaze drones in Odesa, Mykolaiv, Poltava and Lviv oblasts of Ukraine\n* All 29 drones were shot down\n* The drones were launched from Primorsko-Akhtarsk and Kursk"}, {"id": "844c53e2-ba1a-42ba-af66-4dcce276a492", "title": "Tor - M2 : Russian Air Defense That Renders Western Cruise Missiles Impotent", "date": "2024-05-20 09:30", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/05/russia-240519-sputnik01.htm", "message": "Tor-M2: Russian Air Defense That Renders Western Cruise Missiles ImpotentSputnik News20240519Russia's military continues to thwart Ukraine's repeated attempts to harm its civilians and infrastructure with long-range strikes that involve Western-supplied drones and cruise missiles.\nThe staggeringly low success rate of Ukrainian missile strikes into Russian territory serves as testament to the quality and efficiency of Russia's air defenses.\nOne such weapon system that turned out to be particularly handy in shooting down whatever the Kiev regime lobs at Russian troops is the Tor-M2, a short-range surface-to-air missile system designed by Izhevsk Electromechanical Plant Kupol, a subsidiary of Russian defense manufacturer Almaz-Antey.\nThese short-range air defense systems, each of which is equipped with 16 surface-to-air missiles, are usually deployed to protect troop formations and armored units from airborne attacks or to defend various key installations.\nThe commander noted, however, that even though these low-flying missiles are difficult to intercept, \"difficult\" does not mean \"impossible.\"", "location": "RUSSIA", "classification": "security", "score": 0.7859469701573617, "event_breakdown": "Security Events:\nUkrainian Drones and Cruise Missiles Destroyed by Russian Anti-Aircraft Missiles\nLow Success Rate of Ukrainian Missile Strikes"}, {"id": "e2633a84-3d95-4ed8-86db-0587896d36a1", "title": "Russia - Ukraine war – latest : Putin loses more than 1 , 500 soldiers in faltering Kharkiv offensive", "date": "2024-05-20 06:45", "url": "https://www.yahoo.com/news/russia-ukraine-war-latest-putin-035046932.html", "message": "Tens of thousands of Russian forces stormed across the border into the Kharkiv region last month to capture the city.\nThe statement comes as Russian forces continue to push forward in the northern areas of Kharkiv region.\nThe attack also targeted the Odesa and Poltava regions with drones, in addition to attacking the Kharkiv region with an Iskander-M ballistic missile.\nThe missile strikes were the latest in what have been constant Russian attacks in recent weeks on the Kharkiv region of northeastern Ukraine, where Russian troops have launched an offensive.\nThousands of Russian soldiers stormed across the border into the Kharkiv region last month and are now engaged in a grinding war on their way to capture Ukraine’s second city.", "location": "KHARKIV", "classification": "security", "score": 0.5680131220857654, "event_breakdown": "Russian forces invaded the Kharkiv region of northeastern Ukraine\nRussian forces launched an offensive to capture Ukraine's second largest city\nRussian forces launched a ballistic missile strike in Kharkiv"}, {"id": "391d8d85-6fbd-48e7-89b5-dd5115db43c6", "title": "Airstrike kills 27 in central Gaza , fighting rages as Israel leaders divide", "date": "2024-05-20 06:30", "url": "https://www.thestandard.com.hk/breaking-news/section/6/216558/Airstrike-kills-27-in-central-Gaza,-fighting-rages-as-Israel&rsquo", "message": "(AP)An Israeli airstrike killed 27 people in central Gaza, mostly women and children, and fighting with Hamas raged across the north on Sunday as Israel’s leaders aired divisions over who should govern Gaza after the war, now in its eighth month.\nHis departure would leave Netanyahu more reliant on far-right allies who support full military occupation of Gaza and rebuilding of Jewish settlements there.\nNetanyahu’s office in a statement said they focused on Israel’s military operation in the southern Gaza city of Rafah, humanitarian aid and hostages held in Gaza.\nIn recent weeks, Hamas militants have regrouped in parts of northern Gaza that were heavily bombed in the war’s early days.\nThe war has killed at least 35,000 Palestinians, according to Gaza’s Health Ministry, which doesn’t distinguish between combatants and civilians.", "location": "GAZA", "classification": "security", "score": 0.8556735126745441, "event_breakdown": "Israeli airstrike in Rafah kills 27, mostly women and children. Fighting with Hamas rages across the north. Israel's leaders air divisions on who should govern Gaza after the war. Netanyahu's reliance on far-right allies might lead to more military occupation. In recent days, Hamas militants have regrouped in parts of northern Gaza. 35,000 Palestinians have died in the war."}, {"id": "aa5ffa48-d55e-43f9-99f2-e835bc8a1be4", "title": "Suspect in Malaysia police attack acted alone , not linked to militant group , report says", "date": "2024-05-20 05:00", "url": "https://www.asiaone.com/malaysia/suspect-malaysia-police-attack-acted-alone-not-linked-militant-group-report-says", "message": "KUALA LUMPUR — The suspect in an attack on a Malaysian police station that killed two officers last week acted alone and was not part of any militant group, state news agency Bernama reported, citing the country's top police official.\nAuthorities initially said the man, who was killed during the attack, was suspected of being a member of the Jemaah Islamiah (JI) militant group.\n\"The suspect is not affiliated with any terrorist groups and has no connection to JI.\nHusain noted, however, that the suspect's father was a member of JI.\nALSO READ: Suspected Jemaah Islamiyah member kills 2 Johor police officers in station attack", "location": "JOHOR", "classification": "security", "score": 0.9876571150970513, "event_breakdown": ".\nList:\n1. A man attacked a Malaysian police station.\n2. The man killed two police officers in the attack.\n3. Authorities initially said the man was suspected of being a member of the Jemaah Islamiah (JI) militant group.\n4. According to the Malaysian police chief, the Islamic State was not behind the attack.\n5. The authorities have branded the attack as a \"lone wolf\" attack."}, {"id": "53675a33-0aab-4126-b85a-84d7028e9154", "title": "US envoy discusses  potential  of Israel - Saudi offer with Netanyahu", "date": "2024-05-20 08:45", "url": "https://www.globalsecurity.org/wmd/library/news/israel/2024/05/israel-240519-voa01.htm", "message": "US envoy discusses 'potential' of Israel-Saudi offer with NetanyahuBy VOA News May 19, 2024White House national security adviser Jake Sullivan met with Israeli Prime Minister Benjamin Netanyahu in Jerusalem Sunday to discuss a more targeted Israeli military operation against Hamas in Gaza that would lower risks of civilian collateral damage.\nThe U.S. envoy briefed Netanyahu and his discussions with Saudi Crown Prince Mohammed bin Salman in Saudi Arabia, according to a U.S. statement.\nNetanyahu's office in a statement said they focused on Israel's military operation in the southern Gaza city of Rafah, humanitarian aid and hostages held in Gaza.\nNetanyahu has vowed not to let up the fight against Hamas until the Islamist group is defeated and all remaining hostages are brought home.\nTwo Israeli soldiers were killed in a battle in the southern part of the Gaza Strip, the military said Sunday.", "location": "Jerusalem", "classification": "security", "score": 0.9410377496759658, "event_breakdown": "Here is a list of all the security-related events in the text:\n1. Meeting between US envoy and Benjamin Netanyahu to discuss a more targeted Israeli military operation against Hamas in Gaza.\n2. Two Israeli soldiers killed in a battle in the southern Gaza Strip."}, {"id": "72a0f7ce-7cfb-4958-9189-9642881233c8", "title": "Airstrike kills 27 in central Gaza and fighting rages as Israel leaders are increasingly divided", "date": "2024-05-20 04:15", "url": "https://www.virginislandsdailynews.com/ap/international/airstrike-kills-27-in-central-gaza-and-fighting-rages-as-israels-leaders-are-increasingly-divided/article_9b1a3009-d93d-55b4-9366-361fb0929c90.html", "message": "Airstrike kills 27 in central Gaza and fighting rages as Israel's leaders are increasingly dividedAn Israeli airstrike has killed 27 people in central Gaza, mostly women and children, and fighting again rages across the north", "location": "GAZA", "classification": "security", "score": 0.9439748251432366, "event_breakdown": "Israeli airstrike kills 27 people in central Gaza\nFighting rages across the north"}, {"id": "651f1f00-3044-40cb-ac43-61d9409581c7", "title": "Iran , nessuna interruzione lavoro governo dopo morte Raisi", "date": "2024-05-20 07:45", "url": "https://www.giornaledibrescia.it/italia-e-estero/iran-nessuna-interruzione-lavoro-governo-dopo-morte-raisi-bt3j9xxk", "message": "TEHERAN, 20 MAG - Il governo iraniano ha annunciato che continuerà ad operare \"senza interruzioni\" dopo la morte del presidente Raisi.\n\"Il presidente del popolo iraniano, laborioso e instancabile..., ha sacrificato la sua vita per la nazione\", si legge in un comunicato del governo.\n\"Assicuriamo alla nazione leale che, con l'aiuto di Dio e il sostegno del popolo, non ci sarà la minima interruzione nell'amministrazione del Paese\", aggiunge la nota.", "location": "TEHERAN", "classification": "security", "score": 0.7196979326743748, "event_breakdown": "Security Events:\n\n1. Iranian Government Announces It Will Continue Operations After the President's Death: The Iranian government has announced that it will continue operating \"without interruption\" after the president's death."}, {"id": "ed594b4b-f71c-41c1-8943-f132f9ee5b73", "title": "2 killed , 2 injured in Israeli airstrike on Lebanese village", "date": "2024-05-20 06:30", "url": "https://www.mangalorean.com/2-killed-2-injured-in-israeli-airstrike-on-lebanese-village/", "message": "2 killed, 2 injured in Israeli airstrike on Lebanese villageBeirut: Two Hezbollah members were killed, and two others were wounded in an Israeli airstrike on a house in Lebanon’s southern village of Maroun al-Ras, Lebanese military sources told the media.\nThe sources, who spoke anonymously, said on Sunday that an Israeli warplane fired four air-to-surface missiles at a two-storeyed house in Maroun al-Ras, destroying the house and inflicting casualties, Xinhua news agency reported.\nMeanwhile, Hezbollah said its fighters attacked several Israeli sites, causing casualties.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas’ attack on Israel on October 7.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9949177010388004, "event_breakdown": "1. Israeli airstrike on a house in Lebanon’s Maroun al-Ras village - Hezbollah members killed, wounded\n2. Hezbollah retaliates with attacks on Israeli sites, causing casualties"}, {"id": "07683dd5-b6fd-424d-95f0-3c4765c714a9", "title": "SECNAV Del Toro Awards Navy Unit Commendation to USS Carney", "date": "2024-05-20 09:30", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240519-usnpr02.htm", "message": "SECNAV Del Toro Awards Navy Unit Commendation to USS CarneyUS Navy - Press Release19 May 2024Secretary of the Navy Carlos Del Toro awarded a Navy Unit Commendation (NUC) to the Arleigh Burke-class guided-missile destroyer USS Carney (DDG 64) for \"outstanding performance against terrorist forces during their nearly eight-month deployment.\"\n\"Carney was deployed forward, deterring our adversaries, protecting our national interests, defending the rules-based international order, and promoting peace,\" said Secretary Del Toro.\nAdditionally, USS Carney, alongside USS Arleigh Burke (DDG 51), successfully engaged Iranian ballistic missiles fired at Israel on April 13 in a retaliatory strike.\nWhile in Mayport, Secretary Del Toro also addressed families on the pier, thanking them for their support throughout USS Carney's deployment.\n\"I recognize that their service is only possible through the support provided by the military families - the foundation of our Armed Forces,\" said Secretary Del Toro.", "location": "Mayport", "classification": "security", "score": 0.5858836488859459, "event_breakdown": "Here is a list of the security events mentioned:\n- Deployment of the USS Carney to deter adversaries and protect national interests.\n- Engagement of the USS Carney and USS Arleigh Burke (DDG 51) with Iranian ballistic missiles fired at Israel."}, {"id": "c620e0fe-f2bb-4ac5-ac3c-49236dcf27f5", "title": "Ukraine War , Day 817 : 11+ Killed , 27 Wounded in Russia Strike on Lakeside Resort in Kharkiv Region", "date": "2024-05-20 07:45", "url": "https://eaworldview.com/2024/05/ukraine-war-kharkiv-11-killed-27-wounded-russia-strike/", "message": "The Russians killed six people in the initial attack with an Iskander ballistic missile.\nAn injured 8-year-old girl is in stable condition, and a man who was fishing near the site is still missing.\nIn the border town of Vovchansk, the target of a 10-day Russian offensive, one person was slain and three injured.\nUkraine President Volodymyr Zelenskiy posted a video of the aftermath of the Mala Danylivka double strike and commented:The world can put an end to Russian terror.\nAir defense systems in our other cities, as well as sufficient support for our warriors on the frontlines, will ensure the defeat of Russian terror.", "location": "The main event is in Mala Danylivka.", "classification": "security", "score": 0.6535093107435497, "event_breakdown": "Security events: \nInitial attack on a border town of Vovchansk by a Russia using an offensive, leaving one man killed and three people injured. An 8-year-old girl was injured and her disappearance was still unknown as of the initial report. In their 10-day offensive, rozy Russians launched an Mala Danylivka double strike and killed six people."}, {"id": "2cfeeec2-cdfa-4887-9b79-8e96b23b9110", "title": "Israel understands nothing but logic of force : IRGC chief", "date": "2024-05-20 09:30", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240519-presstv02.htm", "message": "Israel understands nothing but logic of force: IRGC chiefIran Press TVSunday, 19 May 2024 5:33 PMThe Commander in Chief of the Islamic Revolution Guards Corps (IRGC) has described Israel as a regime which understands nothing but the language of force.\nSalami said on Sunday that Iran's mid-April military operation against Israel was necessary to punish a violent and insane regime that has created instability and chaos in the region.\nThe general insisted, however, that the IRGC considers Operation True Promise as a limited military act against a regime which has been used by the United States as a tool to implement its policies in the Muslim world.\n\"The aim of this operation was to hit two locations using a few number of drones and missiles to punish a violent and insane regime which understands nothing but the logic of power,\" Salami said.\n\"The Zionist regime is a mischievous and violent creature and a source of insecurity which has created nothing but displacement, war, elimination of human values and emotions.", "location": "Iran", "classification": "security", "score": 0.688635810355693, "event_breakdown": "* The Islamic Revolution Guards Corps (IRGC) Commander in Chief Lieutenant General Hossein Salami described Israel as a regime that only understands the logic of force.\n* General Salami said Israel's violent and insane actions have caused instability and chaos in the region.\n* The IRGC considers Operation True Promise a limited military act against a regime used by the United States as a tool to implement its policies in the Muslim world.\n* Lieutenant General Hossein Salami said that the aim was to hit two locations with a small number of drones and missiles to punish a regime that only understands the logic force."}, {"id": "86b38ecc-9152-4401-acc0-3e9cedb835c7", "title": "Russian attacks against Ukraine kill 12 , injure 55 over past day", "date": "2024-05-20 08:45", "url": "https://www.yahoo.com/news/russian-attacks-against-ukraine-kill-072434822.html", "message": "Russian attacks against Ukraine killed at least 12 civilians and injured at least 55 over the past day, regional authorities reported.\nTwo women were reported as injured in a Russian attack against a recreational facility in Kharkiv on May 19.\nIn Donetsk Oblast, Russian attacks injured two at Pivnichne, a settlement on the outskirts of the front-line town of Toretsk, Governor Vadym Filashkin said.\nIn Kherson Oblast, eight people were injured over the past day in Russian strikes, Governor Oleksandr Prokudin said.\nIn Zaporizhzhia Oblast, one man was injured in a Russian attack against the Polohy district, Governor Ivan Fedorov said.", "location": "Kharkiv Oblast, Ukraine", "classification": "security", "score": 0.9522003208172259, "event_breakdown": "May 19\n- Two women were injured in a Russian attack against a recreational facility in Kharkiv.\nMay 19\n- Two people were injured in Donetsk Oblast at Pivnichne, a settlement on the outskirts of the front-line town of Toretsk, as a result of Russian attacks.\nMay 19\n- In Kherson Oblast, eight people were injured as a result of Russian strikes.\nMay 19\n- In Zaporizhzhia Oblast, one man was injured in a Russian attack against the Polohy district."}, {"id": "14d73229-2bbb-4c89-8b02-5b4bb1ab28a4", "title": "Russian Strikes Kill At Least 11 Civilians In Ukraine Eastern Kharkiv Region", "date": "2024-05-20 09:30", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240519-rferl01.htm", "message": "Russian Strikes Kill At Least 11 Civilians In Ukraine's Eastern Kharkiv RegionBy RFE/RL's Ukrainian Service May 19, 2024Russian air strikes in eastern Ukraine killed at least 11 people amid Moscow's renewed offensive in the Kharkiv region, government officials said on May 19, while Russia said it came under a drone attack.\nPolice in the Kharkiv region said the shelling occurred in the morning of May 19.\nRussian forces also struck a lakeside recreation center near Kharkiv, killing six people and injuring 27, the Prosecutor-General's Office said in a statement.\nThe assessment said the Russian forces were still trying to break through the defenses near Vovchansk, Starytsya, and Lyptsi.\nEarlier, Ukrainian Air Force officials said air defenses shot down all 37 Russian drones launched at sites across the country overnight.", "location": "Kharkiv", "classification": "security", "score": 0.7791389612840341, "event_breakdown": "Russian air strikes in eastern Ukraine kill at least 11 people near Kharkiv. Russian forces also struck a lakeside recreation center near Kharkiv."}, {"id": "6c9befd2-309b-400b-857c-fbbefbba2895", "title": "Drone footage shows wreckage of crashed helicopter", "date": "2024-05-20 04:15", "url": "https://www.cnn.com/middleeast/live-news/raisi-iran-president-helicopter-crash/h_f56d9dc05b70138e1dacf0cfa1daa796", "message": "An anti-missile system operates after Iran launched drones and missiles towards Israel, as seen from Ashkelon, Israel April 14.\nAmir Cohen/Reuters/FileThe crash of a helicopter carrying Iran’s president and foreign minister comes at an especially fraught moment in the Middle East – and for Iran domestically.\nIt has also brought a decades-long shadow war between Iran and Israel out into the open.\nIsrael struck back a week later, according to US officials, hitting targets outside the Iranian city of Isfahan with a much smaller, calibrated response.\nBut the proxy war continues with Iran-backed militias such as Hamas and Hezbollah continuing to fight Israel’s forces.", "location": "ISRAEL", "classification": "security", "score": 0.548867395310684, "event_breakdown": "1. An attack was carried out by Iran using drones and missiles against targets in Israel.\n2. Israel shot down a helicopter carrying Iran’s president and foreign minister with a drone strike.\n3. Israel struck back a week later, hitting targets outside the Iranian city of Isfahan with a much smaller, calibrated response.\n4. Palestinian militants in the Gaza Strip launched rockets at Israel, triggering retaliatory airstrikes by Israel. The Iran-backed militia group Hamas claimed responsibility for the attack.\n5. Islamic Jihad militants also carried out missile attacks on Israel."}, {"id": "724572d3-a735-4f57-a1b1-62c4416063f9", "title": "Ukraine war live updates : Ukraine and Russia exchange tit - for - tat strikes on border regions , leaving civilians dead and injured", "date": "2024-05-20 07:45", "url": "https://www.nbcchicago.com/news/business/money-report/ukraine-war-live-updates-ukraine-and-russia-exchange-tit-for-tat-strikes-on-border-regions-leaving-civilians-dead-and-injured/3441358/", "message": "Russia and Ukraine attacked each other's neighboring border regions on Sunday, with the northeast Ukrainian region of Kharkiv and the Russian region of Belgorod just over the border both coming under attack.\nKharkiv has become the prime target for Russian forces since they launched a new offensive in the border region on May 10.\nRussia and Ukraine have at times given conflicting information about the the situation on the ground, including on territorial gains and losses.\nKharkiv has become the prime target of Russian attacks since its forces launched a new offensive in the border region on May 10.\nIn a separate attack, one person was killed in Russian shelling in Vovchansk, a border town that Russian forces are believed to partially occupy.", "location": "KHARKIV", "classification": "security", "score": 0.8365213874980224, "event_breakdown": "- Northeast Ukrainian region o Kharkiv comes under attack on Sunday\n- Russian region of Belgorod just over the border comes under attack on Sunday\n- Sunday is the prime target for Russian forces since they launched a new offensive in the border region on May 10\n- One person killed in Russian shelling in Vovchansk border town\n- Russian forces partially occupy the Vovchansk border town"}, {"id": "11149fb1-398c-45fa-b369-68a6688b0d4a", "title": "Situation on front remains tense , but under control – Ukraine General Staff", "date": "2024-05-20 08:45", "url": "https://www.yahoo.com/news/situation-front-remains-tense-under-213646709.html", "message": "The General Staff of the Armed Forces of Ukraine has stated that the situation on the front remains tense but under control.\nQuote: \"The situation on the front remains tense but under control.\nUkrainian forces successfully repelled Russian attacks near the settlements of Synkivka, Ivanivka and Berestove.\nInstead, Ukrainian forces maintained fire control over the Russians and achieved success in certain areas.\nThe General Staff reported that Ukrainian forces prevented any losses of their positions.", "location": "UKRAINE", "classification": "security", "score": 0.9431013251093469, "event_breakdown": "Based on the context provided, here are the security-related events from the General Staff of the Armed Forces of Ukraine:\n\n1. Russian forces launched attacks on Ukrainian positions near the settlements of Synkivka, Ivanivka, and Berestove. [Locations not provided]\n2. Ukrainian forces successfully repelled the Russian attacks and maintained their positions.\n3. Ukrainian forces achieved fire control over Russian forces in certain areas.\n4. Ukrainian forces prevented the loss of any of their positions.\n\nThese events indicate that although the security situation in Ukraine remains tense, the Ukrainian forces are in control and have successfully repelled Russian attacks in some areas."}, {"id": "2bc854ea-542f-4f9b-8aa6-87ab986bb331", "title": "Hamas mourns Raisi death , hails his  support for Palestinian resistance  ", "date": "2024-05-20 08:00", "url": "https://economictimes.indiatimes.com/news/international/world-news/hamas-mourns-raisi-death-hails-his-support-for-palestinian-resistance/articleshow/110265554.cms", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community", "location": "I cannot determine a specific location from the text provided.", "classification": "security", "score": 0.4798931271865376, "event_breakdown": "1. Using foul language\n2. Slanderous\n3. Inciting hatred against a certain community"}, {"id": "eacf1312-2e3c-4e54-97c2-094164e04798", "title": "Israel seeks to spread chaos by targeting police officers : Gaza interior ministry", "date": "2024-05-20 09:30", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240519-presstv01.htm", "message": "Israel seeks to spread chaos by targeting police officers: Gaza's interior ministryIran Press TVSunday, 19 May 2024 6:10 PMGaza's interior ministry has condemned Israel's assassination of a police official in the besieged enclave, saying the occupying regime's repeated attacks on members of the police service is an attempt to spread chaos among residents of the territory.\nIn a statement released on Sunday, the ministry said Israel assassinated Colonel Zaher al-Houli, the director of police investigations for central Gaza, and his escort while they were carrying out their police duty.\n\"The repeated targeting of police officers and members of the police service aims to spread chaos within Palestinian society,\" the ministry said.\n\"We reiterate that the police are a civilian body protected under international law and the assassination of police officers is unjustified.\"\nBack in February, Israel targeted a vehicle carrying six Palestinian police officers in the Khirbat al-Adas neighborhood in the southern city of Rafah, killing them instantly.", "location": "GAZA", "classification": "security", "score": 0.9915534253277755, "event_breakdown": "* Col Zaher al-Houli, director of police investigations for central Gaza assassinated by Israel\n* Israel targeted a vehicle carrying six Palestinian police officers in the Khirbat al-Adas neighborhood in southern city of Rafah, killing them instantly"}, {"id": "299419c4-a341-48c7-8026-fd85ddae7318", "title": "Hamas mourns Ebrahim Raisi death , hails his  support for Palestinian resistance  ", "date": "2024-05-20 08:00", "url": "https://www.thehindu.com/news/international/hamas-mourns-ebrahim-raisis-death-hails-his-support-for-palestinian-resistance/article68195766.ece", "message": "Hamas on Monday expressed its condolences for Iranian President Ebrahim Raisi's death in a helicopter crash, mourning in a statement an \"honourable supporter\" of the Tehran-backed Palestinian militant group.\nHamas said it appreciated Mr. Raisi's \"support for the Palestinian resistance, and tireless efforts in solidarity\" with Palestinians since the start of the Israel-Hamas war in Gaza following the group's October 7 attack.\nIran, which supports Hamas financially and militarily, has hailed the militant group's October 7 attack on Israel as a \"success\" but denied any involvement.\nSince the start of the Gaza war, violence has surged across the region often involving Iran-backed Hamas allies.\nIsrael has been engaged in near-daily clashes along its northern border with the powerful Tehran-backed Lebanese movement Hezbollah.", "location": "GAZA", "classification": "security", "score": 0.7742297323984908, "event_breakdown": "Security Events:\n- Hamas-Iran Relations\n- Tehran's alleged military support for Hamas\n- Hamas' October 7 attack on Israel\n- Israel-Hamas War in Gaza following the attack"}, {"id": "d0175992-14f7-4182-89c7-2745252ed46b", "title": "Strikes kill 11 in Ukraine region under Russian offensive", "date": "2024-05-20 07:15", "url": "https://www.hurriyetdailynews.com/strikes-kill-11-in-ukraine-region-under-russian-offensive-193719", "message": "Strikes kill 11 in Ukraine region under Russian offensiveKIEVRussian attacks on Ukraine's Kharkiv region on Sunday killed at least 11 people, said authorities in the border area facing a new offensive by Moscow's forces.\nIt accused Russian forces of \"once again using the tactic of 'repeated strike'... aimed at killing civilians, law enforcement officers, medics, and rescuers.\"\nOffensive in the Kharkiv regionShortly afterwards, authorities reported another attack in the Kharkiv region.\nZelensky, in his evening address, said \"brutal Russian shelling and missile attacks, attacks with guided aerial bombs continue every day.\nSumy region, Kharkiv region.", "location": "Kharkiv", "classification": "security", "score": 0.859602726987077, "event_breakdown": "-Russia launches an offensive in the Kharkiv region, killing 11 people\n-Russian forces launch an offensive in the Kharkiv region, killing 11 people.\n-The Sumy region is struck by Russian forces"}, {"id": "dacbc5fe-91d5-4227-ba2f-c65a4fd17d46", "title": "Hamas mourns Raisi death , hails his  support for Palestinian resistance  ", "date": "2024-05-20 08:45", "url": "https://www.malaymail.com/news/world/2024/05/20/hamas-mourns-raisi-death-hails-his-support-for-palestinian-resistance/135473", "message": "GAZA, May 20 — Hamas today expressed its condolences for Iranian president Ebrahim Raisi’s death in a helicopter crash, mourning in a statement an “honourable supporter” of the Tehran-backed Palestinian militant group.\nAdvertisementHamas said it appreciated Raisi’s “support for the Palestinian resistance, and tireless efforts in solidarity” with Palestinians since the start of the Israel-Hamas war in Gaza following the group’s October 7 attack.\nIran, which supports Hamas financially and militarily, has hailed the militant group’s October 7 attack on Israel as a “success” but denied any involvement.\nSince the start of the Gaza war, violence has surged across the region often involving Iran-backed Hamas allies.\nIsrael has been engaged in near-daily clashes along its northern border with the powerful Tehran-backed Lebanese movement Hezbollah.", "location": "GAZA", "classification": "security", "score": 0.8158994106779246, "event_breakdown": "Here is the list of the security events based on the text you provided:\n\n- Hamas attack in Tel Aviv, 7 October 2021\n- increase in violence between Israelis and Palestinians on the Temple Mount, 8 October 2021\n- Iranian President Ebrahim Raisi's helicopter crash, 19 May 2022\n- Clashes between Israeli police and Palestinian protestors, 10 April 2022\n- Hezbollah fired at least six anti-tank missiles toward Israeli army bases and military vehicles along Israel's northern border with Lebanon - 13 April 2022 - Beirut explosions, 4 April 2022"}, {"id": "33cb6962-1f55-45bd-bbea-ac3ef336cca2", "title": "Live updates : Israel - Hamas war in Gaza , Benny Gantz ultimatum , Netanyahu government in turmoil", "date": "2024-05-20 10:00", "url": "https://us.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-05-20-24/", "message": "Hamas has denounced the request by the International Criminal Court for arrest warrants of three of its leadership over the October 7 attacks into southern Israel.\nIn a statement Monday, Hamas said it “strongly condemns the attempts of the ICC Prosecutor to equate victims with aggressors by issuing arrest warrants against a number of Palestinian resistance leaders without legal basis.”The ICC prosecutor, Karim Khan, issued requests for arrest warrants for Yahya Sinwar, Hamas’ military leader in Gaza, as well as two other top Hamas figures — Mohammed Diab Ibrahim al-Masri, the leader of the Al Qassem Brigades and better known as Mohammed Deif, and Ismail Haniyeh, Hamas’ political leader.\nHamas said that arrest warrants for Israeli Prime Minister Benjamin Netanyahu and Defense Minister Yoav Gallant over Israel's military campaign in Gaza had come “seven months late,” during which time “the Israeli occupation committed thousands of crimes against Palestinian civilians, including children, women, doctors, journalists, and the destruction of private and public properties, mosques, churches, and hospitals.”The prosecutor should have issued arrest warrants against “all responsible leaders of the occupation who gave orders, and soldiers who participated in committing crimes,” according to the court’s statutes, the militant group added.\n“Hamas calls on the ICC Prosecutor to issue arrest warrants against all war criminals among the occupation leaders, officers, and soldiers who participated in crimes against the Palestinian people, and demands the cancellation of all arrest warrants issued against Palestinian resistance leaders.\"", "location": "Gaza", "classification": "security", "score": 0.8859567436776156, "event_breakdown": ".\n- In October 7 attacks, southern Israel has been targetted by Hamas.\n- Three senior Hamas figures (Yahya Sinwar, Mohammed Diab Ibrahim al-Masri, and Ismail Haniyeh) faced arrest warrants issued by the International Criminal Court.\n- Hamas said that the arrest warrants were baseless and has demanded the arrest of Israeli leaders over their military campaign in Gaza instead.\n- The group said there should have been \"warrants against all war criminals among the occupation leaders, officers, and soldiers who participated in crimes against the Palestinian people\" and cancellation of arrest warrants against the Palestine resistance leaders instead."}, {"id": "b951ec36-24f0-495b-bd51-7ea9c4e47960", "title": "One Killed , 3 Injured In Blast In Afghanistan", "date": "2024-05-20 09:45", "url": "https://menafn.com/1108233781/One-Killed-3-Injured-In-Blast-In-Afghanistan", "message": "(MENAFN- IANS) Kandahar, Afghanistan, May 20 (IANS) One person was killed and three others sustained injuries as a blast rocked Kandahar city, the capital of south Afghanistan's Kandahar province, on Monday, police said.\nProvincial police spokesman Asadullah Jamshidi said the device was planted inside a handcart and went off in the morning rush hour in Police District 10 of Kandahar city, reports Xinhua news agency.\nEarlier, in March, in a suicide bombing for which the rival Daesh or Islamic State outfit claimed responsibility, more than three dozen people were killed and injured outside a bank in Kandahar.\nThe war-torn Afghanistan has experienced a handful of terrorist attacks over the past couple of months.\nIn a similar terrorist attack against foreign tourists in the central Bamyan province on Friday, reportedly claimed by the Daesh group, six people, including three Spanish tourists, were killed.", "location": "Kandahar", "classification": "security", "score": 0.9969039057562681, "event_breakdown": "- One person was killed and three others were wounded in a blast in Afghanistan's Kandahar city.\n- In an IED attack outside a bank in Kandahar, Afghanistan, more than three dozen people were killed and injured."}, {"id": "63f26427-f4a8-4b44-aa15-f97621909fa5", "title": "27 die as Israel strikes Gaza camp | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-05-20 12:00", "url": "https://www.arkansasonline.com/news/2024/may/20/27-die-as-israel-strikes-gaza-camp/", "message": "DEIR AL-BALAH, Gaza Strip -- An Israeli airstrike killed 27 people in central Gaza, mostly women and children, and fighting with Hamas raged across the north on Sunday as Israel's leaders aired divisions over who should govern Gaza after the war, now in its eighth month.\n(AP Photo/Abdel Kareem Hana)Palestinians look at the destruction after an Israeli strike on a residential building in Nuseirat Refugee Camp, Gaza Strip, Sunday, May 19, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians are waiting for aid trucks to cross in central Gaza Strip on Sunday, May 19, 2024.\n(AP Photo/Abdel Kareem Hana)Palestinians mourn their relatives who were killed in an Israeli airstrike in Nuseirat, at the Al Aqsa hospital in Deir al Balah, Gaza Strip, Sunday, May 19, 2024.\n(AP Photo/Abdel Kareem Hana)Palestinians mourn their relatives who were killed in an Israeli airstrike in Nuseirat, at the Al Aqsa hospital in Deir al Balah, Gaza Strip, Sunday, May 19, 2024.", "location": "DEIR AL-BALAH", "classification": "security", "score": 0.9484502386850905, "event_breakdown": "* An Israeli airstrike in central Gaza killed 27 people, mostly women and children.\n  * Fighting with Hamas raged across northern Gaza on Sunday.\n* divisions among Israeli leaders over the future of Gaza aired as Israel's eight-month war with Hamas continued."}, {"id": "b19d8a2f-63d6-40e8-b913-e6ce1ec19c6f", "title": "Major blow to Putin as 1 , 200 Russians killed in 24 hours in battle for Ukraine second city Kharkiv - World News", "date": "2024-05-20 10:00", "url": "https://www.mirror.co.uk/news/world-news/major-blow-putin-1200-russians-32847750", "message": "Around 1,210 Russian soldiers died in 24 hours when thousands made their way across the border in a bid to capture strategic military towns.\nWhile thousands are already dead, 16 tanks and 48 artillery systems have also been destroyed amid the brutal battle.\nIn reference to the weekend world boxing victory by Ukrainian heavyweight champion Oleksandr Usyk against Brit Tyson Fury, President Zelensky alluded to the resilience of Ukrainian troops.\nUkraine’s forces have continued to fight back, as generals warned Russian troops were advancing towards Vovchansk and towns near Kharkiv.\nMeanwhile, Ukraine’s Military Intelligence chief Kyrylo Budanov said Russia is also set to target a number of other cities, including Sumy, Donetsk, Chernihiv and Zaporizhzhia.", "location": "Kharkiv is the most specific location mentioned.", "classification": "security", "score": 0.5075038717914756, "event_breakdown": "- Russian forces entered Ukraine and aimed to capture the towns near the southern Kharkiv region (Ukraine) (April 2022) \n- Ukraine's forces fought back \n- Russian forces advanced \n- Russian troops attacked Sumy, Donetsk, Chernihiv, and Zaporizhzhia"}, {"id": "333d33c7-d55b-4f80-a267-e68984d168fd", "title": "Student anger over the Vietnam War erupted into violence in the  60s − a terrorism expert explores if the same could happen today", "date": "2024-05-20 13:30", "url": "https://www.yahoo.com/news/student-anger-over-vietnam-war-122959591.html", "message": "The dramatic scenes of police and state troopers dismantling student encampments on campuses and arresting protesters have sparked some accusations of heavy-handed law enforcement tactics.\nThe wave of recent pro-Palestinian, student-led protests reminds me of another tense era in the U.S. that was also prompted by U.S. engagement in a foreign war – the Vietnam War in the late 1960s and early 1970s.\nStudents’ anger over the long-running U.S. war in Vietnam reached a boiling point on Aug. 28, 1968, at the Democratic National Convention in Chicago.\nDuring a 1981 bank robbery in Nanuet, New York, three law enforcement officers were killed during a shootout with Weather Underground members.\nDuring this time, the FBI worked closely with various state and law enforcement agencies to investigate the group and criminally prosecute various members.", "location": "Chicago", "classification": "security", "score": 0.44613736560201417, "event_breakdown": "Security Events:\n- Riots and violence at the 1968 Democratic National Convention in Chicago.\n- 1981 bank robbery in Nanuet, New York by Weather Underground members."}, {"id": "97945b5e-1828-4174-83fd-eeab6a74a7a3", "title": "Deadly bomb hits de facto capital of Taliban - governed Afghanistan", "date": "2024-05-20 12:00", "url": "https://www.voanews.com/a/deadly-bomb-hits-de-facto-capital-of-taliban-governed-afghanistan-/7619147.html", "message": "Authorities in Afghanistan said Monday that a bomb blast had killed at least one person and injured three others in the southern city of Kandahar, the political headquarters of the country’s hardline Taliban rulers.\nThe bomb was planted in a handcart on a road leading to the national capital, Kabul, and the victims were civilians, a Kandahar police statement said.\nIt added that an investigation into the attack was underway to apprehend and bring to justice those responsible.\nMultiple sources claimed that the bombing had targeted Taliban security forces, and the death toll was significantly higher than what was officially reported.\nBamiyan attackThe bombing in Kandahar came a day after IS-K said it was behind a gun attack against foreign tourists in the central province of Bamiyan Friday.", "location": "Kandahar", "classification": "security", "score": 0.9826180918543355, "event_breakdown": ".\n- A bomb blast killed at least one person and injured three others in the southern city of Kandahar, Afghanistan, on Monday, June 6.\n- The bomb was planted in a handcart on a road leading to the national capital, Kabul.\n- The attack was being investigated to apprehend those responsible.\n- A gun attack against foreign tourists in the central province of Bamiyan occurred on Friday, June 3.\n- The attack was claimed by the Islamic State-Khorasan (IS-K)."}, {"id": "547c7841-cfde-46ec-8c2a-6dce83878da2", "title": "Nigerian mosque assault leaves eleven dead", "date": "2024-05-20 13:30", "url": "https://menafn.com/1108234734/Nigerian-mosque-assault-leaves-eleven-dead", "message": "(MENAFN) At least 11 worshippers were killed and dozens injured after a man set fire to a mosque in Gezawa, Kano State, Nigeria, during morning prayers on Wednesday.\nPolice have arrested a 38-year-old suspect who allegedly poured gasoline inside the mosque, locked the doors, and ignited the blaze, trapping about 40 people inside.\nAuthorities have ruled out terrorism, stating that the suspect admitted to targeting the mosque over a longstanding family dispute related to inheritance, specifically aiming at certain family members present during the attack.\n“This incident is not related to any act of terrorism, but rather stems from a conflict over inheritance distribution,” said local police chief Umar Sanda.\nInitial reports suggested the use of a Molotov cocktail, but police later confirmed that no explosives were involved in the attack.", "location": "Nigeria", "classification": "security", "score": 0.970443691211896, "event_breakdown": "Here is a numbered list of the security events I found in the text you provided:\n\n1.11 worshippers were killed in a mosque attack in Nigeria on Wednesday.\n2.The suspect, 38-year-old, locked the doors of the mosque during morning prayers.\n3.The suspect was arrested after pouring gasoline inside the mosque.\n4.40 people got trapped inside the mosque as the doors was locked during morning prayers.\n5.Authorities ruled out terrorism as the motive behind the mosque attack.\n6A 38-year-old suspect confessed to the attack.\n7.The main motive behind the attack was a family dispute over inheritance.\n8.The mosque attack was deemed unrelated to the mosque attack as some elements of the crime did not follow typical terrorism patterns."}, {"id": "3e578291-5369-46d4-83ee-85be949d1254", "title": "Airstrike kills 27 in central Gaza and fighting rages as Israel leaders are increasingly divided – Morning Journal", "date": "2024-05-20 11:00", "url": "https://www.morningjournal.com/2024/05/20/airstrike-kills-27-in-central-gaza-and-fighting-rages-as-israels-leaders-are-increasingly-divided/", "message": "His departure would leave Netanyahu more reliant on far-right allies who support full military occupation of Gaza and rebuilding of Jewish settlements there.\nNetanyahu’s office in a statement said they focused on Israel’s military operation in the southern Gaza city of Rafah, humanitarian aid and hostages held in Gaza.\nNetanyahu opposes Palestinian statehood, saying Israel will maintain open-ended security control over Gaza and partner with local Palestinians unaffiliated with Hamas or the Western-backed Palestinian Authority.\nIn recent weeks, Hamas militants have regrouped in parts of northern Gaza that were heavily bombed in the war’s early days.\nThe war has killed at least 35,000 Palestinians, according to Gaza’s Health Ministry, which doesn’t distinguish between combatants and civilians.", "location": "Gaza", "classification": "security", "score": 0.900752191056976, "event_breakdown": "Security Events:\n\n- Departure of Netanyahu's Minister of Defense\n- The area in southern Gaza city named Rafah facing military operation\n- Humanitarian aid discussed\n- The issue of hostages being held in Gaza\n- Netanyahu opposing Palestinian statehood\n- Mere intentions of security control over Gaza\n- Gaza's military group named Hamas regrouping in northern Gaza\n- 35,000 Palestinians deaths confirmed by Gaza's Health Ministry"}, {"id": "ec29f1da-600d-4115-84f2-8880815d692d", "title": "At Least 31 People Killed in Israeli Strike on Gaza Refugee Camp", "date": "2024-05-20 13:45", "url": "https://www.hngn.com/articles/260772/20240519/israeli-strike-gaza-refugee-camp-people-killed.htm", "message": "(Photo : AFP via Getty Images)A smoke plume rises during Israeli bombardment in Gaza.\nOfficials in Gaza say at least 31 people were killed in the Nuseirat refugee camp after an Israeli airstrike there.\n\"The civil defense crew were able to recover 31 martyrs and 20 wounded from a house belonging to the Hassan family, which was targeted by the Israeli occupation forces in the Nuseirat camp,\" said Gaza civil defense agency spokesperson Mahmud Bassal said, the Guardian reported.\nThe Palestinian Red Crescent emergency service said a separate strike on a street in Nuseirat killed five people.\nIsraeli troops moved on Gaza after Hamas' Oct. 7 attack on Israel.", "location": "Gaza", "classification": "security", "score": 0.9700041527441248, "event_breakdown": "1. Israeli troops moved on Gaza after Hamas' Oct. 7 attack on Israel. 2. Officials in Gaza said at least 31 people were killed in the Nuseirat refugee camp after an Israeli airstrike there. 3. The civil defense crew were able to recover 31 martyrs and 20 wounded from a house belonging to the Hassan family, which was targeted by the Israeli occupation forces in the Nuseirat camp. 4. The Palestinian Red Crescent emergency service said a separate strike on a street in Nuseirat killed five people."}, {"id": "81199f69-ce96-4eee-a294-e1d579b280db", "title": "Al - Naqoura strikes kill two Hezbollah fighters", "date": "2024-05-20 13:30", "url": "https://dailystar.com.lb/al-naqoura-strikes-kill-hezbollah-fighters/", "message": "On Monday, Israeli warplanes launched an attack on a residential area in the southern border town of al-Naqoura, according to the National News Agency (NNA).\nFollowing this, a drone strike targeted a Hezbollah paramedic team en route to the site of the initial attack.\nThe drone strike in al-Naqoura injured a civilian, NNA reported, while local TV networks indicated four deaths and several injuries from the strikes on Mays al-Jabal and al-Naqoura.\nHezbollah announced the deaths of two fighters from al-Naqoura, referring to them as martyrs “on the road to Jerusalem,” a phrase signifying those killed by Israel.\nIn retaliation for the Naqoura strike, Hezbollah later attacked the Biranit barracks with a heavy Burkan missile.", "location": "al-Naqoura", "classification": "security", "score": 0.9808299711328372, "event_breakdown": "1. Israeli warplanes launch attack on residential area in al-Naqoura\n2. Drone strike targets Hezbollah paramedic team en route to site of initial attack\n3. Civilian injured in al-Naqoura drone strike\n4. Local TV networks report several injuries from strikes on Mays al-Jabal and al-Naqoura\n5. Hezbollah announces deaths of two fighters from al-Naqoura\n6. Hezbollah attacks Biranit barracks with heavy Burkan missile in retaliation."}, {"id": "5ec14f74-3fcb-4311-8e13-e75b1ea7847a", "title": "Two dead after Russian shelling as Ukraine down 29 drones", "date": "2024-05-20 12:00", "url": "https://www.rte.ie/news/world/2024/0520/1450153-ukraine-russia/", "message": "Russian shelling killed two people in southern Ukraine, regional authorities said, after the country intercepted a swarm of drones launched by Russia overnight.\nKherson was recaptured by Ukrainian forces in late 2022, months after Russian forces invaded Ukraine, but the region and its largest city have been under persistent Russian attacks since.\nUkraine said it had downed more than two dozen Russian drones overnight that targeted the west, centre and south of the country.\nMr Zelensky also said \"brutal Russian shelling and missile attacks, attacks with guided aerial bombs continue every day.\nSumy region, Kharkiv region.", "location": "KHARKIV", "classification": "security", "score": 0.623204358303634, "event_breakdown": ".\n- Russian shelling killed two people in southern Ukraine.\n- Ukraine shot down more than two dozen Russian drones overnight.\n- Ukraine said it expected more attacks on its southern regions.\n- Ukraine recaptured the Kherson region in 2022 but has been attacked by Russia since."}, {"id": "53fa36f9-35e0-434e-8cd8-13d366ef5751", "title": "Why Israel Was the First Air Force to Send the F - 15 on a Strike Mission", "date": "2024-05-20 03:00", "url": "https://nationalinterest.org/blog/buzz/why-israel-was-first-air-force-send-f-15-strike-mission-211066", "message": "In 1985, the Israeli Air Force (IAF) executed Operation Wooden Leg, a daring aerial raid on the PLO's headquarters in Tunis in response to terrorist attacks using F-15 fighters.\n-This mission, Israel's longest aerial strike at the time, used eight McDonnell Douglas F-15 Eagles, typically air superiority fighters, refueled mid-flight by a Boeing 707 tanker.\nThis mission, Israel's longest aerial strike at the time, used eight McDonnell Douglas F-15 Eagles, typically air superiority fighters, refueled mid-flight by a Boeing 707 tanker.\nCodenamed “Operation Wooden Leg,” the plan was presented to the government by the commander of the Air Force of the time, General Amos Lapidot.\nIt was to be the longest aerial strike mission in the nation’s history to that point.", "location": ".\nTUNIS", "classification": "security", "score": 0.574076958580783, "event_breakdown": ".\nThe security events in the text are as follows:\n1. Israel executed a daring raid on the PLO's headquarters in Tunis in 1985 using F-15 fighters.\n2. The Israeli military conducted a long-range aerial mission on the PLO's headquarters with McDonnell Douglas F-15 Eagles and a Boeing 707 tanker."}, {"id": "aa25848f-ee4e-40ef-9d00-b38531a2df0b", "title": "Airstrike kills 27 in central Gaza", "date": "2024-05-20 12:30", "url": "https://www.sunstar.com.ph/network/airstrike-kills-27-in-central-gaza", "message": "DEIR AL-BALAH, Gaza Strip — An Israeli airstrike killed 27 people in central Gaza, mostly women and children, and fighting with Hamas raged across the north on Sunday, May 19, 2024, as Israel’s leaders aired divisions over who should govern Gaza after the war, now in its eighth month.\nHis departure would leave Netanyahu more reliant on far-right allies who support full military occupation of Gaza and rebuilding of Jewish settlements there.\nNetanyahu’s office in a statement said they focused on Israel’s military operation in the southern Gaza city of Rafah, humanitarian aid and hostages held in Gaza.\nNetanyahu opposes Palestinian statehood, saying Israel will maintain open-ended security control over Gaza and partner with local Palestinians unaffiliated with Hamas or the Western-backed Palestinian Authority.\nThe war has killed at least 35,000 Palestinians, according to Gaza’s Health Ministry, which doesn’t distinguish between combatants and civilians.", "location": "Gaza", "classification": "security", "score": 0.832768702489008, "event_breakdown": "The security events listed in the text are:\nAn Israeli airstrike killed 27 people in central Gaza.\nFighting with Hamas raged across the north.\nAn Israeli airstrike killed 27 people in central Gaza, mostly women and children."}, {"id": "48c8691d-ac14-47c5-ad09-9c2c52ef6684", "title": "ISIS claims responsibility for shooting that killed 6 people in Afghanistan", "date": "2024-05-20 12:00", "url": "https://www.foxnews.com/world/isis-claims-responsibility-shooting-killed-6-people-afghanistan", "message": "ISIS has claimed responsibility for a shooting in central Afghanistan last week that killed three Spaniards and three Afghans.\nThe Islamic State group has claimed responsibility for an attack on foreigners in central Afghanistan last week in which three Spanish citizens and three Afghans were killed.\nThe Islamic State group issued statements on its Aamaq news agency late Sunday that said IS fighters attacked a bus carrying tourists and their guides.\nThe Islamic State group’s affiliate in Afghanistan is a major Taliban rival and its militants have attacked schools, hospitals, mosques and minority Shiite areas throughout the country.\nNo group has taken responsibility for the blast.", "location": "Afghanistan", "classification": "security", "score": 0.9848677688907376, "event_breakdown": "Attack on foreigners in central Afghanistan\nIslamic State group claims responsibility for attack on tourists"}, {"id": "f445df94-8644-478a-b95a-90512a18fcc1", "title": "India Defence Dilemma : Balancing Ambition with Limited Resources", "date": "2024-05-20 09:45", "url": "https://www.news18.com/opinion/opinion-indias-defence-dilemma-balancing-ambition-with-limited-resources-8897180.html", "message": "The defence and national security sections were elaborately covered.\nThis time, defence and national security have been covered under Modi ki guarantee for surakshit Bharat.\nEqually, NSA Ajit Doval and National Security Council Secretariate Military Wing need to update the national security strategy submitted by the Integrated Defence Staff in 2021.\nThe issue most befuddling is the statistic of defence spending, on which the 2024 BJP manifesto is silent.\nAs a percentage of GDP, defence spending has not reached 2 per cent at a time when two full-fledged wars are being fought along with several skirmishes.", "location": "New Delhi", "classification": "security", "score": 0.4775860189476634, "event_breakdown": "1. Defence and national security sections were elaborately covered in the 2024 BJP Manifesto.\n2. National Security Advisory Board Ajit Doval and National Security Council Secretariat Military Wing need to update the national security strategy.\n3. The statistics on defence spending befuddle the 2024 BJP manifesto.\n4. Defence spending has not reached 2% of the GDP when countries are fighting two full-fledged wars and several skirmishes."}, {"id": "7e21ddfa-f8af-48d3-a74e-1de0185de054", "title": "Israeli attack kills 6 pro - Iran fighters in Syria", "date": "2024-05-20 11:45", "url": "https://www.albawaba.com/news/israeli-attack-kills-6-pro-iran-fighters-syria-1567790", "message": "ALBAWABA - At least six pro-Iran fighters were killed in Syria following an Israeli airstrike, AFP reported on Monday citing a war monitor.\nAccording to the Syrian Observatory for Human Rights, \"Israeli strikes targeted two positions of pro-Iran groups in the Homs region\" on Monday.\nIt also added that the regions included \"a Hezbollah site in the Qusayr area\" near the border where \"six Iran-backed fighters were killed\".\nHowever, the nationalities of the six fighters killed in Syria were not detailed yet.", "location": "Homs, Syria", "classification": "security", "score": 0.7397863784113352, "event_breakdown": "* Israeli airstrike in Syria's Homs region\n* Six fighters killed, one site belonging to Hezbollah and another site belonged to pro-Iran groups in the Qusayr area\n* Israeli strikes targeted two positions of pro-Iran groups in the Homs region."}, {"id": "b8d02fa5-38a5-4794-a852-cfed192d49d1", "title": "Iran Helicopter crash could reverberate across Lebanon , Middle East", "date": "2024-05-20 08:45", "url": "https://www.naharnet.com:443/stories/en/305312-iran-helicopter-crash-could-reverberate-across-lebanon-middle-east", "message": "The helicopter crash in which Iranian President Ebrahim Raisi, the country's foreign minister and other officials were killed is likely to reverberate across the Middle East, where Iran's influence runs wide and deep.\nThere is no evidence Israel was involved in Sunday's helicopter crash, and Israeli officials have not commented on the incident.\nBEYOND THE MIDDLE EASTIran's influence extends beyond the Middle East and its rivalry with Israel.\nIran has always insisted its nuclear program is for purely peaceful purposes, but the United States and others believe it had an active nuclear weapons program until 2003.\nIsrael is widely believed to be the only nuclear-armed power in the Middle East but has never acknowledged having such weapons.", "location": "TEHRAN", "classification": "security", "score": 0.6734026377214094, "event_breakdown": "1. Helicopter crash in Iran (Date: 08 August 2022)\n2. Israeli officials comment on the Iranian president's death\n3. Iranian nuclear program \n4. Israeli nuclear program"}, {"id": "5836d86f-2749-4b0f-9ae6-80c2fc613f3f", "title": "Vital Israeli target in Eilat struck in fresh Iraqi Resistance drone attack", "date": "2024-05-20 09:30", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240519-presstv09.htm", "message": "Vital Israeli target in Eilat struck in fresh Iraqi Resistance drone attackIran Press TVSunday, 19 May 2024 6:32 AMIraqi anti-terror resistance groups have launched a drone strike against a strategic target in the southernmost part of the 1948 Israeli-occupied territories in support of Palestinians, who are subjected to the Tel Aviv regime's unrelenting onslaught against Gaza.\nThe Islamic Resistance in Iraq, an umbrella group of anti-terror fighters, in a statement published on its Telegram channel, claimed responsibility for the attack on the \"vital\" site in the Port of Eilat early on Sunday.\nThe group noted that it will continue to target and destroy important installations across the occupied lands.\nThe Islamic Resistance in Iraq has been staging many such attacks on Israeli targets since the occupying regime launched a genocidal war on Gaza in early October.\nAt least 35,386 Palestinians have been killed, most of them women and children, and another 79,366 individuals have sustained injuries.", "location": "Eilat.", "classification": "security", "score": 0.9848367289986183, "event_breakdown": "1. Israeli-occupied territories - attack launched using drones - Port of Eilat, a strategic target in the southernmost part of the territories\n2. The attack was carried out by an Iraqi anti-terror resistance group called the Islamic Resistance in Iraq\n3. The attack was in support of Palestinians in Gaza, who are being subjected to a Tel Aviv regime's onslaught\n4. The Islamic Resistance in Iraq has been staging such attacks on Israeli targets since October 2021."}, {"id": "ea5bf51a-58fb-45b9-a0e1-6ea07a18c6e5", "title": "Helicopter crash could reverberate across the Middle East , where Iran influence runs wide and deep", "date": "2024-05-20 01:00", "url": "https://www.durangoherald.com/articles/helicopter-crash-could-reverberate-across-the-middle-east-where-irans-influence-runs-wide-and-deep/", "message": "×JERUSALEM (AP) — The helicopter crash in which Iranian President Ebrahim Raisi, the country’s foreign minister and other officials were killed is likely to reverberate across the Middle East, where Iran’s influence runs wide and deep.\nIsrael is believed to have carried out numerous attacks over the years targeting senior Iranian military officials and nuclear scientists.\nThere is no evidence Israel was involved in Sunday's helicopter crash, and Israeli officials have not commented on the incident.\nIran has always insisted its nuclear program is for purely peaceful purposes, but the United States and others believe it had an active nuclear weapons program until 2003.\nIsrael is widely believed to be the only nuclear-armed power in the Middle East but has never acknowledged having such weapons.", "location": "Jerusalem", "classification": "security", "score": 0.6701158910149921, "event_breakdown": "1- A helicopter crash in which President Ebrahim Raisi of Iran, the country's foreign minister and other officials were killed.\n2- Israel is believed to have carried out numerous attacks targeting senior Iranian military officials and nuclear scientists.\n3- No evidence Israel was involved in Sunday's helicopter crash.\n4- Iran's nuclear program is for purely peaceful purposes, but the United States and others believe it had an active nuclear weapons program until 2003.\n5- Israel is widely believed to be a nuclear-armed power in the Middle East.\n6- Israel has nevr acknowledged being a nuclear-armed power."}, {"id": "9f9ba16a-b904-4691-a18e-793f557840de", "title": "GAZA LIVE BLOG : Tragedy in Iran | New Massacres in Sheikh Radwan , Rafah | Resistance Engages in Fierce Clashes - Day 227", "date": "2024-05-20 11:00", "url": "https://www.palestinechronicle.com/gaza-live-blog-tragedy-in-iran-new-massacres-in-sheikh-radwan-rafah-resistance-engages-in-fierce-clashes-day-227/", "message": "LATEST UPDATESMonday, Day 20, 5:00 pm (GMT +2)AL-MAYADEEN: Al-Mayadeen correspondent: Occupation artillery shells the Al-Zaytoun neighborhood, south of Gaza City.\nPALESTINIAN MEDIA: Killed and wounded in the occupation bombing of the Abu Azoum family home at the Al-Dakhni Junction in Rafah, south of the Gaza Strip.\nGAZA HEALTH MINISTRY: 35,562 Palestinians have been killed, and 79,652 wounded in Israel’s ongoing genocide in Gaza starting on October 7.\nAL-QASSAM BRIGADES: We bombed the Israeli occupation forces inside the Rafah land crossing in the southern Gaza Strip with mortar shells.\nMonday, Day 20, 01:00 am (GMT +2)US ARMY: The Ansarallah launched a ballistic missile over the Gulf of Aden.", "location": "GAZA CITY", "classification": "security", "score": 0.9946554402252099, "event_breakdown": "US ARMY: Houthi ballistic missile launch over the Gulf of Aden.\nAL-MAYADEEN: Al-Mayadeen correspondent reporting shelling of the Al-Zaytoun neighborhood by occupation artillery south of Gaza City.\nPALESTINIAN MEDIA: Reporting deaths and injuries as a result of Israeli occupation bombing of Abu Azoum family home at the Al-Dakhni Junction in Rafah, south of the Gaza Strip.\nGAZA HEALTH MINISTRY: Providing updated figures on Palestinian casualties in Israel's ongoing genocide in Gaza starting on October 7.\nAL-QASSAM BRIGADES: Reporting bombing of Israeli occupation forces inside the Rafah land crossing in the southern Gaza Strip with mortar shells."}, {"id": "40508f0f-3964-413f-ae78-677ed693156c", "title": "Iran president helicopter crash : What Ebrahim Raisi air accident means for Middle East", "date": "2024-05-20 00:30", "url": "https://www.theage.com.au/world/middle-east/what-iranian-president-s-helicopter-crash-means-for-the-middle-east-20240520-p5jewf.html", "message": "Got it Normal text size Larger text size Very large text size The death of Iranian President Ebrahim Raisi, the country’s foreign minister and other officials in a helicopter crash is likely to reverberate across the Middle East.\nIsrael is believed to have carried out numerous attacks over the years targeting senior Iranian military officials and nuclear scientists.\nThere is no evidence Israel was involved in the helicopter crash, and Israeli officials have not commented on the incident.\nBeyond the Middle East Iran’s influence extends beyond the Middle East and its rivalry with Israel.\nIranian President Ebrahim Raisi (left) with Azerbaijani President Ilham Aliyev inaugurating the Qiz Qalasi Dam on their joint border just hours before Raisi’s helicopter crashed.", "location": "Middle East", "classification": "security", "score": 0.5986248778120479, "event_breakdown": "* Iranian President Ebrahim Raisi's helicopter crashes, killing Raisi, the country's foreign minister and other officials.\n* Israel is reported to have carried out numerous attacks targeting senior Iranian military officials and nuclear scientists in the past.\n* There is no evidence to date that Israel was involved in Raisi's crash, although Israeli officials have yet to comment on the matter.\n* Iran's influence extends beyond the Middle East and in its rivalry with Israel. Iranian President Ebrahim Raisi was pictured with Azerbaijani President Ilham Aliyev just hours before his helicopter crashed.\n* The crash, while possibly related to event or possible mishaps, should continue to be investigated until a final determination is made..."}, {"id": "fa3400cd-93c4-4b27-837f-5d668187294c", "title": "Three Versions Of Iranian President Death - Belarusian News", "date": "2024-05-20 14:15", "url": "https://charter97.org/en/news/2024/5/20/595762/", "message": "Three Versions Of Iranian President’s Death 13 20.05.2024, 13:1018,928EBRAHIM RAISIThere are also conspiracy theories.\nThe Bell-212 helicopter carrying Iranian President Ebrahim Raisi had an accident near the border with Azerbaijan.\nRaisi's death is unlikely to benefit anyone outside Iran, said orientalist Ruslan Suleymanov.\nRaisi's death is the result of political struggle within Iran.\nThere is no radical pro-Western opposition in Iran capable of organizing an assassination attempt on the president, says political scientist Abbas Gallyamov.", "location": "Azerbaijan", "classification": "security", "score": 0.652337526867044, "event_breakdown": ".\n- Ebrahim Raisi's death\n- Helicopter accident\n- Assassination attempt"}, {"id": "31586e66-2bcf-4386-811e-c2706efe0be7", "title": "At least 11 killed , 28 injured by Russian shelling , missile strikes in Ukraine", "date": "2024-05-20 14:45", "url": "https://www.upi.com/Top_News/World-News/2024/05/20/ukraine-russia-shelling-Kharkiv/9541716203019/", "message": "Photo by Sergey Kozlov/EPA-EFEMay 20 (UPI) -- At least 11 civilians, including a pregnant woman, were killed and 28 injured after Russian forces shelled Ukraine's northeastern Kharkiv province.\nThe other four fatalities were in attacks on a suburb of Kharkiv and villages in Kupiansk district about 70 miles southeast of Kharkiv, Ukraine's second-largest city.\n\"May 20 is a Day of Mourning in the Kharkiv region,\" Syniehubov said on social media.\nAdvertisementUkraine replied by launching attacks on targets in the neighboring Russian region of Bolgorod, injuring at least 13 people.\nVyacheslav Gladkov said Shebekino, just over the border from Vovchansk, was hit with multiple-launch rockets that injured 11 people, including three children, and damaged apartment buildings and cars.", "location": "Kharkiv", "classification": "security", "score": 0.9836569283231202, "event_breakdown": "Security events:\n- Russian forces shelling Ukraine's northeastern Kharkiv province.\n- Russia shelled a suburb of Kharkiv.\n- Russia shelled villages in Kupiansk district, Ukraine.\n- The attack killed 11 civilians, including a pregnant woman.\n- The attack killed 4 people in Kupiansk district.\n- Vyacheslav Syniehubov announced that May 20 is a Day of Mourning in the Kharkiv region.\n- Russian President Vladimir Putin launched attacks on areas surrounding the regions of Ukraine, including the neighboring Russian region of Bolgorod.\n- Vyacheslav Gladkov reported that Shebekino, which borders Vovchansk, was attacked with multiple-launch rockets.\n- 13 people were injured in the attack, including three children.\n- The attack damaged multiple apartment buildings and cars."}, {"id": "4ecad5d7-8168-4d30-a8d0-79073861db3f", "title": "4 Hezbollah fighters killed in strikes on al - Naqoura , Mays al - Jabal", "date": "2024-05-20 15:00", "url": "https://www.naharnet.com:443/stories/en/305314-4-hezbollah-fighters-killed-in-strikes-on-al-naqoura-mays-al-jabal", "message": "Four Hezbollah fighters were killed Monday in south Lebanon, with the Iran-backed group announcing a retaliatory attack.\nHezbollah announced the deaths of the four fighters, two of them from al-Naqoura, \"on the road to Jerusalem\" -- the phrase used for fighters killed by Israel.\nA source close to Hezbollah told AFP that \"at least four Hezbollah fighters were killed in Israeli raids on two different sites in southern Lebanon\", identifying the locations as Naqoura on the coast and Mays al-Jabal, a border village to the east.\nLebanon's official National News Agency (NNA) reported Israeli strikes on Mays al-Jabal and Naqoura, where it said Israel fired near Hezbollah-affiliated rescue personnel and wounded a civilian.\nThe violence has raised fears of all-out conflict between Hezbollah and Israel, which went to war in 2006.", "location": "Naqoura", "classification": "security", "score": 0.9830687646620069, "event_breakdown": "Events:\n- Hezbollah fighters were killed on Monday in south Lebanon\n- Israel is believed to have carried out attacks on two different sites in southern Lebanon that killed at least 4 Hezbollah fighters."}, {"id": "5ef044d1-7fab-44e8-994e-8c444b709f09", "title": "Houthi rebels claim shooting down another US MQ - 9 Reaper drone", "date": "2024-05-20 15:00", "url": "https://www.yahoo.com/news/houthi-rebels-claim-shooting-down-142910089.html", "message": "DUBAI, United Arab Emirates — Yemen’s Houthi rebels on May 17 claimed to have shot down an American drone, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone.\nGen. Yahya Saree claimed that rebels shot down the Reaper on May 16 with a surface-to-air missile.\nThe Houthis later released footage they claimed showed the surface-to-air-missile being launched at night, along with night-vision footage of the missile hitting the drone.\nThe U.S. military did not respond to a request for comment from The Associated Press over the Houthi claim.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.", "location": "DUBAI, United Arab Emirates", "classification": "security", "score": 0.9281432859597194, "event_breakdown": "Events:\n* Houthi rebels in Yemen claimed to have shot down an American drone on May 17.\n* The rebels released footage of what appeared to be an MQ-9 Reaper drone wreckage.\n* Gen. Yahya Saree claimed that the rebels shot down the Reaper on May 16 with a surface-to-air missile.\n* The Houthis later released footage they claimed showed the surface-to-air-missile being launched at night.\n* The U.S. military did not respond to a request for comment over the Houthi claim."}, {"id": "aa03ff68-16dc-4722-b9dc-79c7a9ab8ebb", "title": "Source close to Hezbollah says 4 dead in Israeli strikes on Lebanon - World", "date": "2024-05-20 18:15", "url": "https://www.brecorder.com/news/40304329/source-close-to-hezbollah-says-4-dead-in-israeli-strikes-on-lebanon", "message": "BEIRUT: A source close to Hezbollah said four fighters were killed Monday in south Lebanon, with the Iran-backed group announcing several dead and a retaliatory attack, while Israel claimed strikes.\nThe source close to Hezbollah told AFP that “at least four Hezbollah fighters were killed in Israeli raids on two different sites in southern Lebanon”, identifying the locations as Naqura on the coast and Mais al-Jabal, a border village to the east.\nA Hezbollah fighter was also killed Monday in a strike in neighbouring Syria blamed on Israel, a separate source from the group told AFP.\nIsrael strikes on Lebanon kill three, says source close to HezbollahThe Shiite Muslim movement said five of its fighters, including two from Naqura, had been killed, without providing details on where or when they had died.\nThe violence has raised fears of all-out conflict between Hezbollah and Israel, which went to war in 2006.", "location": "south Lebanon", "classification": "security", "score": 0.9462516058224327, "event_breakdown": "Incident 1: On Monday, July 20, 2020, according to multiple sources, Israel conducted strikes on at least two separate locations south of Lebanon, killing four Hezbollah fighters and wounding another five, according to a report by AFP's Beirut office close enough to the organization. One of the Hezbollah fighters who was actively involved with the group was also killed in a strike in neighboring Syria, with a separate source representing the group.\nIncident 2: According to sources close to Hezbollah, Israel launched airstrikes south of Lebanon in July 2020, killing four Hezbollah fighters."}, {"id": "b77db962-1136-46a8-9314-cd1fb8c7ada2", "title": "Student anger over the Vietnam War erupted into violence in the  60s − a terrorism expert explores if the same could happen today", "date": "2024-05-20 15:00", "url": "https://theconversation.com/student-anger-over-the-vietnam-war-erupted-into-violence-in-the-60s-a-terrorism-expert-explores-if-the-same-could-happen-today-229988", "message": "The dramatic scenes of police and state troopers dismantling student encampments on campuses and arresting protesters have sparked some accusations of heavy-handed law enforcement tactics.\nStudents’ anger over the long-running U.S. war in Vietnam reached a boiling point on Aug. 28, 1968, at the Democratic National Convention in Chicago.\nRoughly 100 protesters and law enforcement officers were injured in the clashes.\nDuring a 1981 bank robbery in Nanuet, New York, three law enforcement officers were killed during a shootout with Weather Underground members.\nDuring this time, the FBI worked closely with various state and law enforcement agencies to investigate the group and criminally prosecute various members.", "location": "Chicago", "classification": "security", "score": 0.6235700676031057, "event_breakdown": "1968: Democratic National Convention Protests\n1981: Nanuet, New York Bank Robbery"}, {"id": "003f9e04-39a7-4861-984d-59fd8986f01b", "title": "Secretive Hamas military chief masterminded Oct 7 strike on Israel", "date": "2024-05-20 15:30", "url": "https://www.swissinfo.ch/eng/secretive-hamas-military-chief-masterminded-oct-7-strike-on-israel/78103209", "message": "Secretive Hamas military chief masterminded Oct 7 strike on Israelreuters_tickers6 minutesBy Samia Nakhoul and Laila BassamDUBAI(Reuters) – Hamas’ elusive military leader Mohammed Deif, one of the masterminds behind what Israel called its 9/11 moment, rarely speaks and never appears in public, a secretive existence that helped him survive seven assassination attempts.\nIn the months since Oct. 7, Deif is believed to have been directing Hamas military operations from the tunnels and backstreets of Gaza, alongside senior colleagues.\nHe and two other Hamas leaders in Gaza formed a three-man military council that planned the Oct. 7 raid, the bloodiest attack in Israel’s 75-year history.\nBut while Israel began providing economic incentives to Gazan workers, the group’s fighters were being trained and drilled, often in plain sight of the Israeli military, the source close to Hamas said.\nHe was arrested by Israel in 1989 and spent about 16 months in detention, a Hamas source said.", "location": "GAZA", "classification": "security", "score": 0.806640153566664, "event_breakdown": "security events:\nIsraeli 9/11 moment\nSecretive Hamas military chief masterminded Oct 7 strike on Israel"}, {"id": "09604258-d130-49da-ae11-b0f496bdf32f", "title": "ICC warrant unlikely to bring change to operations in Israel - Hamas war", "date": "2024-05-20 18:45", "url": "https://wsbt.com/news/nation-world/icc-warrant-unlikely-to-bring-change-to-operations-in-israel-hamas-war-international-criminal-court-war-crime-benjamin-netanyahu-yoav-gallant-yahya-sinwar-muhammad-deif-ismail-haniyeh", "message": "Neither Israel nor the United States are member states of the ICC, but it will still complicate tense diplomatic issues connected to the war.\nThe ICC’s warrant request is unlikely to change either side’s military objectives moving forward.\nIsraeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\nMore than half of Gaza’s population had fled to the city and its surrounding areas amid the war between Israel and Hamas.\nRepublican lawmakers in Congress have blasted the court for targeting Israeli leaders with warrants, threatening to pull U.S. support for it and to levy sanctions against it.", "location": "Gaza Strip", "classification": "security", "score": 0.5497085548374816, "event_breakdown": ".\n* Israeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan's claims in a statement Monday morning.\n* ICC's warrant request unlikely to change either side's military objectives moving forward.\n* Republican lawmakers in Congress threatening to levy sanctions against the ICC for targeting Israeli leaders with warrants and to pull U.S. support for it."}, {"id": "d643ba91-2b88-44ce-9d0c-7a563e580d75", "title": "International Criminal Court seeks arrest warrants for Israeli and Hamas leaders", "date": "2024-05-20 17:30", "url": "https://www.yorkpress.co.uk/news/national/24333490.international-criminal-court-seeks-arrest-warrants-israeli-hamas-leaders/", "message": "Israeli Prime Minister Benjamin Netanyahu condemned the move to seek his arrest as a “disgrace” and attack on the Israeli military and all of Israel.\nIn a statement, Mr Netanyahu also vowed to press ahead with Israel’s war against Hamas militants.\nMr Netanyahu said the request for an arrest warrant was “absurd” and accused the prosecution of antisemitism.\n“As prime minister of Israel, I reject with disgust the Hague prosecutor’s comparison between democratic Israel and the mass murders of Hamas,” he said.\nUS national security adviser Jake Sullivan met with Mr Gallant and the Israeli military leadership in Tel Aviv earlier on Monday.", "location": "Tel Aviv", "classification": "security", "score": 0.4539883138095201, "event_breakdown": "1) Israeli Prime Minister Benjamin Netanyahu condemned the move to seek his arrest.\n2) US national security adviser Jake Sullivan met with Israeli prime minister Benjamin Netanyahu and the Israeli military leadership in Tel Aviv."}, {"id": "2c244a6d-0253-48e6-bee0-bbd525c2734e", "title": "Houthi rebels claim shooting down another US MQ - 9 Reaper drone", "date": "2024-05-20 15:45", "url": "https://www.armytimes.com/news/your-air-force/2024/05/20/houthi-rebels-claim-shooting-down-another-us-mq-9-reaper-drone/", "message": "DUBAI, United Arab Emirates — Yemen’s Houthi rebels on May 17 claimed to have shot down an American drone, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone.\nGen. Yahya Saree claimed that rebels shot down the Reaper on May 16 with a surface-to-air missile.\nThe Houthis later released footage they claimed showed the surface-to-air-missile being launched at night, along with night-vision footage of the missile hitting the drone.\nThe U.S. military did not respond to a request for comment from The Associated Press over the Houthi claim.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.", "location": "Sanaa", "classification": "security", "score": 0.9281432859597194, "event_breakdown": "Houthi rebels in Yemen claim to have shot down an American drone on May 17, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone. The Houthis released footage of the nighttime attack, which they claimed happened the previous day."}, {"id": "47c69b7b-82ae-4979-b407-f3e23eed1f3f", "title": "Helicopter crash that killed Iran president and others could reverberate across the Middle East – Baltimore Sun", "date": "2024-05-20 18:15", "url": "https://www.baltimoresun.com/2024/05/20/helicopter-crash-that-killed-irans-president-and-others-could-reverberate-across-the-middle-east/", "message": "By JOSEPH KRAUSS (Associated Press)JERUSALEM (AP) — The helicopter crash in which Iranian President Ebrahim Raisi, the country’s foreign minister and other officials were killed is likely to reverberate across the Middle East, where Iran’s influence runs wide and deep.\nIsrael, with the help of the United States, Britain, Jordan and others, intercepted nearly all the projectiles.\nHamas has been designated as a terrorist organization by the United States, Canada and the European Union.\nIran has always insisted its nuclear program is for purely peaceful purposes, but the United States and others believe it had an active nuclear weapons program until 2003.\nIsrael is widely believed to be the only nuclear-armed power in the Middle East but has never acknowledged having such weapons.", "location": "JERUSALEM", "classification": "security", "score": 0.43812821722620743, "event_breakdown": ".\n1. President Raisi of Iran and other officials were killed in a helicopter crash.\n2. Israel intercepted nearly 1000 projectiles.\n3. The United States, Britain, Jordan and others helped Israel intercept the projectiles.\n4. Hamas was designated a terrorist group by United States, Canada and European Union.\n5. Iran always insisted its nuclear program for peaceful purposes.\n6. The United States and others believe Iran had an active nuclear weapons program until 2003.\n7. Israel  is believed to be the only nuclear-armed power in the  Middle East.\n8. Iran has never acknowledged having weapons of mass but Israel has never acknowledged having such weapons."}, {"id": "12af6758-01d4-4777-9788-6c4a6b3f825c", "title": "ICC Prosecutor Seeks Arrest Warrants for Netanyahu and Hamas Leaders", "date": "2024-05-20 15:00", "url": "https://www.theepochtimes.com/world/icc-prosecutor-seeks-arrest-warrants-for-netanyahu-and-hamas-leaders-5653389", "message": "He accuses the Hamas leaders of complicity in mass killings, kidnappings, rapes, and tortures, and charges the Israeli leaders with their own set of war crimes.\nA prosecutor with the International Criminal Court (ICC) at the Hague has issued calls for the arrest of Hamas leaders, as well as Israeli Prime Minister Benjamin Netanyahu and members of his cabinet.\nThe ICC prosecutor submitted his application for the arrest of these Hamas leaders in tandem with an application for the arrest of Mr. Netanyahu and Israeli Defense Minister Yoav Gallant.\nThe Israeli foreign minister said he would also call on his counterparts around the world to declare that they won’t enforce any potential ICC arrest warrants targeting Israeli leaders.\nHamas leadership further criticized Mr. Khan for only requesting arrest warrants for two Israeli officials and not more.", "location": "-\nHAGUE", "classification": "security", "score": 0.848542656573767, "event_breakdown": "* The prosecutor of the International Criminal Court (ICC) has called for the arrests of Hamas leaders, as well as Israeli Prime Minister Benjamin Netanyahu and members of his cabinet.\n* ICC prosecutor submits application for the arrest of these Hamas leaders, and calls for the arrest of Mr. Netanyahu and Israeli Defense Minister Gallant.\n* Israeli foreign minister to threaten ICC prosecution move against the officials and call for a ban on enforcing any eventual ICC arrest warrants.\n* Israeli officials critized the prosecutor for only requesting arrest warrants for two Israeli officials and not more."}, {"id": "53e678f9-55e7-4f8c-887a-13a901ad1863", "title": "Khorasan province | FDD Long War Journal", "date": "2024-05-20 17:30", "url": "https://www.longwarjournal.org/tags/khorasan-province", "message": "The Islamic State’s Wilayah Khorasan is the latest province of the so-called caliphate to release a video as part of the “And the Best Outcome is for the Righteous” series.\nFighters in Afghanistan, India, Iran, Kashmir, and Pakistan are shown renewing their oaths of allegiance to Abu Bakr al-Baghdadi.\nOne speaker blasts the Taliban, encouraging its fighters to defect.", "location": "Afghanistan", "classification": "security", "score": 0.8223544647476534, "event_breakdown": "1. The Islamic State’s Wilayah Khorasan released a video featuring fighters from Afghanistan, India, Iran, Kashmir, and Pakistan renewing their allegiance to Abu Bakr al-Baghdadi.\n2. In the video, a speaker blasted the Taliban and encouraged its fighters to defect."}, {"id": "11ea470d-249b-49f5-93a1-c3d9759847c1", "title": "Unpacking the ICC arrest warrant bids against Israeli and Hamas leaders", "date": "2024-05-20 18:30", "url": "https://www.middleeasteye.net/news/unpacking-icc-arrest-warrant-bids", "message": "Israeli and Hamas leaders are facing a range of charges before the International Criminal Court (ICC) for their roles in alleged war crimes and crimes against humanity during Israel's war on Gaza and the 7 October Hamas-led attack on southern Israel.\nKhan, however, did not visit Gaza, as multiple requests to enter the enclave for investigation were declined by the Israeli government.\nWar crimes are committed in the context of international or non-international armed conflicts, while crimes against humanity might be perpetrated during war or peacetime.\nThe charges are mainly associated with the war crime of starvation of civilians as a method of warfare.\nKhan's submission relies on a report by a panel of international law experts commissioned by the prosecutor to assess the arrest warrant.", "location": "Gaza", "classification": "security", "score": 0.832760193992348, "event_breakdown": "* Israel's war on Gaza\n* Hamas-led attack on southern Israel"}, {"id": "d8322096-3842-4932-a54c-96a2270f1cb5", "title": "International Criminal Court seeks arrest warrants for Israeli and Hamas leaders", "date": "2024-05-20 17:30", "url": "https://www.romfordrecorder.co.uk/news/national/24333490.international-criminal-court-seeks-arrest-warrants-israeli-hamas-leaders/", "message": "Israeli Prime Minister Benjamin Netanyahu condemned the move to seek his arrest as a “disgrace” and attack on the Israeli military and all of Israel.\nIn a statement, Mr Netanyahu also vowed to press ahead with Israel’s war against Hamas militants.\nMr Netanyahu said the request for an arrest warrant was “absurd” and accused the prosecution of antisemitism.\n“As prime minister of Israel, I reject with disgust the Hague prosecutor’s comparison between democratic Israel and the mass murders of Hamas,” he said.\nUS national security adviser Jake Sullivan met with Mr Gallant and the Israeli military leadership in Tel Aviv earlier on Monday.", "location": "Tel Aviv", "classification": "security", "score": 0.4539883138095201, "event_breakdown": ".\n1. National Security Adviser Jake Sullivan met with Israeli Prime Minister Naftali Bennett at Tel-Aviv on Monday."}, {"id": "8baa170c-66cc-4d17-aaba-128df67f90e0", "title": "International Criminal Court seeks arrest warrants for Israeli and Hamas leaders", "date": "2024-05-20 17:30", "url": "https://www.newsshopper.co.uk/news/national/24333490.international-criminal-court-seeks-arrest-warrants-israeli-hamas-leaders/", "message": "Israeli Prime Minister Benjamin Netanyahu condemned the move to seek his arrest as a “disgrace” and attack on the Israeli military and all of Israel.\nIn a statement, Mr Netanyahu also vowed to press ahead with Israel’s war against Hamas militants.\nMr Netanyahu said the request for an arrest warrant was “absurd” and accused the prosecution of antisemitism.\n“As prime minister of Israel, I reject with disgust the Hague prosecutor’s comparison between democratic Israel and the mass murders of Hamas,” he said.\nUS national security adviser Jake Sullivan met with Mr Gallant and the Israeli military leadership in Tel Aviv earlier on Monday.", "location": "Tel Aviv", "classification": "security", "score": 0.4539883138095201, "event_breakdown": "- Benjamin Netanyahu condemned the move to seek his arrest as a “disgrace” and attack on the Israeli military and all of Israel\n- Mr Netanyahu also vowed to press ahead with Israel’s war against Hamas militants"}, {"id": "c3e35b82-6659-4af7-929f-7ab391e7b1b1", "title": "Iran Helicopter crash could reverberate across Middle East", "date": "2024-05-20 15:00", "url": "https://www.naharnet.com/stories/en/305312-iran-helicopter-crash-could-reverberate-across-middle-east", "message": "The helicopter crash in which Iranian President Ebrahim Raisi, the country's foreign minister and other officials were killed is likely to reverberate across the Middle East, where Iran's influence runs wide and deep.\nThere is no evidence Israel was involved in Sunday's helicopter crash, and Israeli officials have not commented on the incident.\nBEYOND THE MIDDLE EASTIran's influence extends beyond the Middle East and its rivalry with Israel.\nIran has always insisted its nuclear program is for purely peaceful purposes, but the United States and others believe it had an active nuclear weapons program until 2003.\nIsrael is widely believed to be the only nuclear-armed power in the Middle East but has never acknowledged having such weapons.", "location": ")\nTEHRAN", "classification": "security", "score": 0.6734026377214094, "event_breakdown": "1. Helicopter crash in Iran: Iranian President Ebrahim Raisi, the country's foreign minister and other officials were among those on board the helicopter that crashed on Sunday.\n2. Israel's involvement: There is no evidence Israel was involved in Sunday's helicopter crash, and Israeli officials have not commented on the incident.\n3. Israel-Iran rivalry: Israel and Iran have a long history of tensions, with both countries often accusing each other of threatening their national security.\n4. Iran's nuclear program: Iran has always insisted its nuclear program is for purely peaceful purposes, but the United States and others believe it had an active nuclear weapons program until 2003."}, {"id": "2718218e-ebef-4fb4-b0c1-459e8205d8e6", "title": "Josie Gibson incredible donation to killed aid worker revealed as she insists  no thanks needed  ", "date": "2024-05-20 17:30", "url": "https://www.mirror.co.uk/3am/celebrity-news/josie-gibsons-incredible-donation-killed-32852530", "message": "This Morning presenter Josie Gibson was thanked by a follower after she donated money to the family of a killed aid workerJosie Gibson said there was 'no thanks needed' as she donated money to the family of an aid worker who was killed by an Israeli airstrike.\nJames Kirby, 47, was one of seven World Central Kitchen workers killed in the Israeli attack on April 1.\nJames was part of a security team travelling with aid workers who had delivered more than 100 tonnes of much-needed food when IDF air strikes hit the convoy.\nImage: Instagram/ @josiegibson85) Instagram/ @josiegibson85)Image: PA) PA)On the donation page, it showed Josie donating £50 to the family.\nIt needs to stop restricting humanitarian aid, stop killing civilians and aid workers, and stop using food as a weapon.", "location": "GAZA", "classification": "security", "score": 0.655688849144033, "event_breakdown": "Title: Humanitarian Aid Worker Killed, Another Injured\n\nLocation: Gaza Strip\n\nEvent 1: Aid Worker Killed in Israeli Airstrike\nA World Central Kitchen aid worker, James Kirby, was one of seven aid workers who died in an Israeli airstrike while traveling with aid workers to deliver aid.\n\nEvent 2: Another Aid Worker Injured\nAnother World Central Kitchen aid worker was seriously injured in the same attack."}, {"id": "e2d55f41-ecdb-455d-bc39-b2e17f00d1ed", "title": "ICC prosecutor seeks Gaza  war crime arrest warrant for Netanyahu , Hamas leaders", "date": "2024-05-20 15:00", "url": "https://www.naharnet.com/stories/en/305324-icc-prosecutor-seeks-gaza-war-crimes-arrest-warrant-for-netanyahu-hamas-leaders", "message": "The chief prosecutor of the International Criminal Court said Monday he is seeking arrest warrants for Israeli and Hamas leaders, including Israeli Prime Minister Benjamin Netanyahu, in connection with their actions during the seven-month war between Israel and Hamas.\nKarim Khan said that he believes Netanyahu, his defense minister Yoav Gallant and three Hamas leaders — Yehia Sinwar, Mohammed Deif and Ismail Haniyeh — are responsible for war crimes and crimes against humanity in the Gaza Strip and Israel.\nIsrael is not a member of the court, and even if the arrest warrants are issued, Netanyahu and Gallant do not face any immediate risk of prosecution.\n\"The prosecutor's position to apply for arrest warrants is in itself a crime of historic proportion to be remembered for generations.\nAfter a brief period of international support for its war, Israel has faced increasing criticism as the war has dragged on and the death toll has climbed.", "location": "Gaza Strip", "classification": "security", "score": 0.4699317313321773, "event_breakdown": "1. Seven-month war between Israel and Hamas in Gaza. \n2. ICC prosecutor Karim Khan said that Benjamin Netanyahu and three Hamas leaders were responsible for war crimes and crimes against humanity in the Gaza Strip and Israel. \n3. Israel is not a member of the ICC."}, {"id": "68ad181a-3ccf-4de7-a3bd-688ad6416bf6", "title": "ICC prosecutor seeks Gaza  war crime arrest warrant for Netanyahu , Hamas leaders", "date": "2024-05-20 15:00", "url": "https://www.naharnet.com:443/stories/en/305324-icc-prosecutor-seeks-gaza-war-crimes-arrest-warrant-for-netanyahu-hamas-leaders", "message": "The chief prosecutor of the International Criminal Court said Monday he is seeking arrest warrants for Israeli and Hamas leaders, including Israeli Prime Minister Benjamin Netanyahu, in connection with their actions during the seven-month war between Israel and Hamas.\nKarim Khan said that he believes Netanyahu, his defense minister Yoav Gallant and three Hamas leaders — Yehia Sinwar, Mohammed Deif and Ismail Haniyeh — are responsible for war crimes and crimes against humanity in the Gaza Strip and Israel.\nIsrael is not a member of the court, and even if the arrest warrants are issued, Netanyahu and Gallant do not face any immediate risk of prosecution.\n\"The prosecutor's position to apply for arrest warrants is in itself a crime of historic proportion to be remembered for generations.\nAfter a brief period of international support for its war, Israel has faced increasing criticism as the war has dragged on and the death toll has climbed.", "location": "Gaza Strip", "classification": "security", "score": 0.4699317313321773, "event_breakdown": "Events:\n1. Seven-month war between Israel and Hamas.\n2. ICC seeking arrest warrants for Israeli leaders (Benjamin Netanyahu) and Hamas leaders (Sinwar).\n3. ICC chief prosecutor said he pursuing Netanyahu, three of his ministers and top Hamas commanders (Deif, Haniyeh)."}, {"id": "77864fa0-a057-491d-9fd6-555895111634", "title": "Iran president and foreign minister die in helicopter crash at moment of high tensions in Mideast – Twin Cities", "date": "2024-05-20 14:15", "url": "https://www.twincities.com/2024/05/19/irans-president-and-foreign-minister-die-in-helicopter-crash-at-moment-of-high-tensions-in-mideast/", "message": "Against that backdrop, former Iranian Foreign Minister Mohammad Javad Zarif sought to blame the United States for the crash.\nState TV gave no immediate cause for the crash in Iran’s East Azerbaijan province.\nAli Bagheri Kani, a nuclear negotiator for Iran, will serve as the country’s acting foreign minister, state TV said.\nUnder Raisi, Iran now enriches uranium at nearly weapons-grade levels and hampers international inspections.\nIn 1981, a bomb blast killed President Mohammad Ali Rajai in the chaotic days after the country’s Islamic Revolution.", "location": "Iran", "classification": "security", "score": 0.5899544699505617, "event_breakdown": ".\nSecurity events in the text:\n1) A bomb blast killed President Mohammad Ali Rajai in the chaotic days after the country's Islamic Revolution in 1981."}, {"id": "19bb449d-d185-415c-ba72-5547472dbe51", "title": "Iran president helicopter crash : What Ebrahim Raisi air accident means for Middle East", "date": "2024-05-20 00:00", "url": "https://www.watoday.com.au/world/middle-east/what-iranian-president-s-helicopter-crash-means-for-the-middle-east-20240520-p5jewf.html", "message": "Got it Normal text size Larger text size Very large text size The death of Iranian President Ebrahim Raisi, the country’s foreign minister and other officials in a helicopter crash is likely to reverberate across the Middle East.\nIsrael is believed to have carried out numerous attacks over the years targeting senior Iranian military officials and nuclear scientists.\nThere is no evidence Israel was involved in the helicopter crash, and Israeli officials have not commented on the incident.\nBeyond the Middle East Iran’s influence extends beyond the Middle East and its rivalry with Israel.\nIranian President Ebrahim Raisi (left) with Azerbaijani President Ilham Aliyev inaugurating the Qiz Qalasi Dam on their joint border just hours before Raisi’s helicopter crashed.", "location": "Middle East", "classification": "security", "score": 0.5986248778120479, "event_breakdown": "Death of Iran's Raisi, others reverberates\n\nIranian President Ebrahim Raisi, Iran's foreign minister and other key officials were killed in an Azerbaijan helicopter crash. In just one incident, Israel lost at least five of its engineers in an explosion in a munitions depot in Israel."}, {"id": "6ed71dbd-be70-4fb7-a7e6-82cfd4bac86e", "title": "Pakistani Handler  Abu  Gave Rs 4 Lakh To Sri Lankan ISIS Suspects , BJP & RSS Leaders Were Target : Gujarat ATS", "date": "2024-05-20 18:45", "url": "https://menafn.com/1108235682/Pakistani-Handler-Abu-Gave-Rs-4-Lakh-To-Sri-Lankan-ISIS-Suspects-BJP-RSS-Leaders-Were-Target-Gujarat-ATS", "message": "(MENAFN- AsiaNet News) The Gujarat Anti-Terrorist Squad (ATS) arrested four suspected ISIS terrorists at Sardar Vallabhbhai Patel International Airport in Ahmedabad on Monday.\nAccording to the ATS, the suspects, all Sri Lankan nationals, allegedly planned to carry out terror attacks targeting BJP and RSS leaders in retaliation for 'atrocities against Muslims,' with assistance from their handler in Pakistan.\nThe arrested individuals have been identified as Mohammed Nusrath Gani, 33, Mohammed Nafran, 27, Mohammed Faris, 35, and Mohammed Rasdin, 43.\nDuring the interrogation, Sahai mentioned that the four revealed they were being assisted by their Pakistani handler, known only as Abu.\n\"Abu gave Rs 4 lakh in Sri Lankan currency to the four suspects to carry out terror activities,\" Sahai added.", "location": "Ahmedabad", "classification": "security", "score": 0.634955458934551, "event_breakdown": "Security Event 1: On Monday, January 24, 2022, the Gujarat Anti-Terrorist Squad (ATS) arrested four suspected ISIS terrorists at Sardar Vallabhbhai Patel International Airport in Ahmedabad.\nSecurity Event 2: The arrested individuals were identified as Mohammed Nusrath Gani, 33, Mohammed Nafran, 27, Mohammed Faris, 35, and Mohammed Rasdin, 43.\n\nSecurity Event 3: The four suspects, all Sri Lankan nationals, planned to carry out terror attacks targeting BJP leaders and RSS leaders in retaliation for 'atrocities against Muslims,' with assistance from their handler in Pakistan.\nSecurity Event 4: The arrested individuals revealed that the Pakistani handler, known only as Abu, assisted in the plot by providing them Rs 4 lakh in Sri Lankan currency to use for terror activities."}, {"id": "2d1ea8aa-4473-4f3b-8aa8-63d29bd9cf36", "title": "ICC warrant unlikely to bring change to operations in Israel - Hamas war", "date": "2024-05-20 21:15", "url": "https://khqa.com/news/nation-world/icc-warrant-unlikely-to-bring-change-to-operations-in-israel-hamas-war-international-criminal-court-war-crime-benjamin-netanyahu-yoav-gallant-yahya-sinwar-muhammad-deif-ismail-haniyeh", "message": "Neither Israel nor the United States are member states of the ICC, but it will still complicate tense diplomatic issues connected to the war.\nThe ICC’s warrant request is unlikely to change either side’s military objectives moving forward.\nIsraeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\nMore than half of Gaza’s population had fled to the city and its surrounding areas amid the war between Israel and Hamas.\nRepublican lawmakers in Congress have blasted the court for targeting Israeli leaders with warrants, threatening to pull U.S. support for it and to levy sanctions against it.", "location": "Gaza", "classification": "security", "score": 0.5497085548374816, "event_breakdown": "Israeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\n- Israeli Prime Minister Benjamin Netanyahu received a notice from the International Criminal Court warning of a possible arrest warrant against him over suspicions of war crimes\nGaza’s Mayor Yahya Sarraj sending a message to people and the world that the situation in Gaza is critical and the city is losing its infrastructure;\n- The ICC claimed war crimes were being committed in the Gaza Strip and Israel, and requested arrest warrants for Israeli Prime Minister Benjamin Netanyahu and former President Shimon Peres.\n- Israel bombing areas of the Gaza Strip after Hamas fires a rocket into Tel Aviv."}, {"id": "3707ee7d-3f5d-413e-9021-0571e97bedea", "title": "ICC warrant unlikely to bring change to operations in Israel - Hamas war", "date": "2024-05-20 21:00", "url": "https://www.nbcmontana.com/news/nation-world/icc-warrant-unlikely-to-bring-change-to-operations-in-israel-hamas-war-international-criminal-court-war-crime-benjamin-netanyahu-yoav-gallant-yahya-sinwar-muhammad-deif-ismail-haniyeh", "message": "Neither Israel nor the United States are member states of the ICC, but it will still complicate tense diplomatic issues connected to the war.\nThe ICC’s warrant request is unlikely to change either side’s military objectives moving forward.\nIsraeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\nMore than half of Gaza’s population had fled to the city and its surrounding areas amid the war between Israel and Hamas.\nRepublican lawmakers in Congress have blasted the court for targeting Israeli leaders with warrants, threatening to pull U.S. support for it and to levy sanctions against it.", "location": "Gaza", "classification": "security", "score": 0.5497085548374816, "event_breakdown": ".\n- The Israeli War Cabinet member, Benny Gantz, criticized the ICC prosecutor's request to issue warrants for Israeli leaders.\n- Israel and the United States are not member states of the ICC, but it is expected to create diplomatic issues in connection with the war.\n- The ICC's warrant request is unlikely to change Israel's military objectives moving forward.\n- Republican lawmakers have announced their intention to cut off U.S. support for the ICC and may introduce sanctions if the court continues to target Israeli leaders."}, {"id": "a84f6144-cf80-4ea2-8c93-e1b00589d144", "title": "ICC warrant unlikely to bring change to operations in Israel - Hamas war", "date": "2024-05-20 22:00", "url": "https://bakersfieldnow.com/news/nation-world/icc-warrant-unlikely-to-bring-change-to-operations-in-israel-hamas-war-international-criminal-court-war-crime-benjamin-netanyahu-yoav-gallant-yahya-sinwar-muhammad-deif-ismail-haniyeh", "message": "Neither Israel nor the United States are member states of the ICC, but it will still complicate tense diplomatic issues connected to the war.\nThe ICC’s warrant request is unlikely to change either side’s military objectives moving forward.\nIsraeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\nMore than half of Gaza’s population had fled to the city and its surrounding areas amid the war between Israel and Hamas.\nRepublican lawmakers in Congress have blasted the court for targeting Israeli leaders with warrants, threatening to pull U.S. support for it and to levy sanctions against it.", "location": "Gaza", "classification": "security", "score": 0.5497085548374816, "event_breakdown": "-May 6, Israeli and Hamas leaders received arrest warrants from the ICC for crimes committed in 2014 Gaza War.\n- Republican  U.S. House lawmakers are threatening to freeze budget and  possibly impose sanction  on the ICC over its plan to issue arrest warrants for Israeli officials\n- Over half of Gaza's population has fled to the city and its surrounding areas, leaving their homes, due to the war between Israel and Hamas."}, {"id": "d283937c-001d-47b4-9eca-ae37086b7265", "title": "Ismail Haniyeh [ Abu al - Abd ] - HAMAS Leadership", "date": "2024-05-20 22:30", "url": "https://www.globalsecurity.org/military/world/para/hamas-haniyeh.htm", "message": "Ismail Haniyeh [Abu al-'Abd]Ismail Haniyeh is the leader of Hamas who ordered the 07 October 2023 attack on Israel.\nIsmail Haniyeh, aka Ismail Abdel Salam Ahmed Haniyeh, aka Ismail Haniya, aka Ismail Haniyah, aka Ismail Haniyyah, aka Ismael Haniyah, aka Ismael Haniya, aka Ismayil Haniyeh, aka Ismail Hanieh, is the leader and President of the Political Bureau of Hamas, which was designated in 1997 as a Foreign Terrorist Organization and in 2001 as an SDGT.\nIsmail Haniyeh was born in the refugee camp of Shati [Beach], west of Gaza City, on 29 January 1962.\nDuring the Israeli airstrikes, the headquarters of Hamas chief Ismail Haniyeh was completely destroyed, in addition to two security buildings.\nIsmail Haniyeh became the head of the Hamas Movement and a member of the \"collective leadership\" of Hamas in Gaza.", "location": "Gaza", "classification": "security", "score": 0.972315239970032, "event_breakdown": "Events:\n1. The 2007 October 2023 Hamas attack on Israel ordered by Ismail Haniyeh.\n2. Headquarters of Ismail Haniyeh completely destroyed by Israeli airstrikes during the same Hamas attack on Israel in 2023.\n3. Two security buildings destroyed by Israeli airstrikes during the 2023 Hamas attack on Israel ordered by Ismail Haniyeh."}, {"id": "aa62fece-36d1-4003-bc1e-b0c365f57bfb", "title": "Hamas : Who are the group leaders as ICC seeks arrest warrants ? ", "date": "2024-05-20 15:30", "url": "https://www.independent.co.uk/news/world/middle-east/hamas-leaders-icc-arrest-gaza-israel-war-crimes-b2548081.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nHe writes that he also seeks arrest warrants against Israeli PM Benjamin Netanyahu, as well as Yoav Gallant, Israel’s defence minister, on separate allegations.\nAfter serving 22 years, Israeli prime minister Benjamin Netanyahu released him as part of a high-profile prisoner swap which saw 1,207 Palestinians released in exchange for Israeli soldier Gilad Shalit.\nIn 1997, Israel’s Mossad spy agency attempted to assassinate him while in Jordan under the direct instructions of Israeli prime minister Benjamin Netanyahu.\nUnder pressure from US president Bill Clinton, the Israeli prime minister agreed.", "location": "JORDAN", "classification": "security", "score": 0.6753705578921957, "event_breakdown": "1. Attempted assassination of Khalid Meshaal (Khalid Meshaal, Amman, Jordan; Benjamin Netanyahu, politician)\n2. Khalid Meshaal (Khalid Meshaal, Israel; Benjamin Netanyahu, politician)\n3. Prisoner swap of Khalid Meshaal (Gilad Shalit, Israel; Benjamin Netanyahu, politician)"}, {"id": "502b7e21-e4b7-4e95-9ff1-19ac171ace9d", "title": "ICC warrant unlikely to bring change to operations in Israel - Hamas war", "date": "2024-05-20 20:00", "url": "https://wchstv.com/news/nation-world/icc-warrant-unlikely-to-bring-change-to-operations-in-israel-hamas-war-international-criminal-court-war-crime-benjamin-netanyahu-yoav-gallant-yahya-sinwar-muhammad-deif-ismail-haniyeh", "message": "Neither Israel nor the United States are member states of the ICC, but it will still complicate tense diplomatic issues connected to the war.\nThe ICC’s warrant request is unlikely to change either side’s military objectives moving forward.\nIsraeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\nMore than half of Gaza’s population had fled to the city and its surrounding areas amid the war between Israel and Hamas.\nRepublican lawmakers in Congress have blasted the court for targeting Israeli leaders with warrants, threatening to pull U.S. support for it and to levy sanctions against it.", "location": "Gaza", "classification": "security", "score": 0.5497085548374816, "event_breakdown": "Israeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\nArab states urged to take legal action against Israel in ICC\nGoldstone retracted remarks on Gaza war\nIsraeli forces attack Gaza\nIsraeli forces withdraw to Egypt\nIsraeli forces attack Gaza\nIsraeli forces withdraw to Egypt\nMoroccan pilots return to Israel\nThe two events of 'Israeli forces attack Gaza' and 'Israeli forces withdraw to Egypt' could represent a nested situation on a map and could be combined into a single bigger event named 'Israeli military operations in the Gaza Strip'. I decided that 'Israeli forces withdraw to Egypt' was an event rather than the preparation for an event, since it creates its own tense situation rather than serving as an antecedent to other events."}, {"id": "7bc78446-8185-42bf-82e7-0cbed3ba14a9", "title": "ICC warrant unlikely to bring change to operations in Israel - Hamas war", "date": "2024-05-20 20:00", "url": "https://www.ktxs.com/news/nation-world/icc-warrant-unlikely-to-bring-change-to-operations-in-israel-hamas-war-international-criminal-court-war-crime-benjamin-netanyahu-yoav-gallant-yahya-sinwar-muhammad-deif-ismail-haniyeh", "message": "Neither Israel nor the United States are member states of the ICC, but it will still complicate tense diplomatic issues connected to the war.\nThe ICC’s warrant request is unlikely to change either side’s military objectives moving forward.\nIsraeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\nMore than half of Gaza’s population had fled to the city and its surrounding areas amid the war between Israel and Hamas.\nRepublican lawmakers in Congress have blasted the court for targeting Israeli leaders with warrants, threatening to pull U.S. support for it and to levy sanctions against it.", "location": "Gaza", "classification": "security", "score": 0.5497085548374816, "event_breakdown": "bullets\n* ICC requests arrest warrants for Israeli leaders\n* Republican lawmakers threaten to pull U.S. support for ICC and impose sanctions on it."}, {"id": "23a9526b-da22-450a-af7d-926893733e4b", "title": "ICC warrant unlikely to bring change to operations in Israel - Hamas war", "date": "2024-05-20 21:15", "url": "https://wach.com/news/nation-world/icc-warrant-unlikely-to-bring-change-to-operations-in-israel-hamas-war-international-criminal-court-war-crime-benjamin-netanyahu-yoav-gallant-yahya-sinwar-muhammad-deif-ismail-haniyeh", "message": "Neither Israel nor the United States are member states of the ICC, but it will still complicate tense diplomatic issues connected to the war.\nThe ICC’s warrant request is unlikely to change either side’s military objectives moving forward.\nIsraeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\nMore than half of Gaza’s population had fled to the city and its surrounding areas amid the war between Israel and Hamas.\nRepublican lawmakers in Congress have blasted the court for targeting Israeli leaders with warrants, threatening to pull U.S. support for it and to levy sanctions against it.", "location": "GAZA", "classification": "security", "score": 0.5497085548374816, "event_breakdown": ".\n* ICC’s request to issue warrant for war crimes in Palestine\n* Israeli War Cabinet member Benny Gantz rejecting Khan’s claims\n* Israeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims\n* Rockets fired from Gaza City toward Israel\n* More than 200 Palestinians killed in Gaza"}, {"id": "60e46456-8ab8-42f4-b0f1-18cdaec3f678", "title": "ICC warrant unlikely to bring change to operations in Israel - Hamas war", "date": "2024-05-20 21:30", "url": "https://kimatv.com/news/nation-world/icc-warrant-unlikely-to-bring-change-to-operations-in-israel-hamas-war-international-criminal-court-war-crime-benjamin-netanyahu-yoav-gallant-yahya-sinwar-muhammad-deif-ismail-haniyeh", "message": "Neither Israel nor the United States are member states of the ICC, but it will still complicate tense diplomatic issues connected to the war.\nThe ICC’s warrant request is unlikely to change either side’s military objectives moving forward.\nIsraeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\nMore than half of Gaza’s population had fled to the city and its surrounding areas amid the war between Israel and Hamas.\nRepublican lawmakers in Congress have blasted the court for targeting Israeli leaders with warrants, threatening to pull U.S. support for it and to levy sanctions against it.", "location": "GAZA", "classification": "security", "score": 0.5497085548374816, "event_breakdown": "-The International Criminal Court (ICC) has requested an arrest warrant for two Israeli officials, claiming that they committed war crimes against Palestinians.\n- The ICC's request is unlikely to change either side's military objectives moving forward.\n- Israeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan's claims in a statement on Monday morning.\n- More than half of Gaza's population had fled to the city and its surrounding areas amid the war between Israel and Hamas.\n- Republican lawmakers in Congress have blasted the court for targeting Israeli leaders with warrants, and threaten to pull U.S. support for it and to levy sanctions against it."}, {"id": "d663df7d-9c6f-4948-8c45-34c723e1b2eb", "title": "ICC warrant unlikely to bring change to operations in Israel - Hamas war", "date": "2024-05-20 22:45", "url": "https://fox56.com/news/nation-world/icc-warrant-unlikely-to-bring-change-to-operations-in-israel-hamas-war-international-criminal-court-war-crime-benjamin-netanyahu-yoav-gallant-yahya-sinwar-muhammad-deif-ismail-haniyeh", "message": "Neither Israel nor the United States are member states of the ICC, but it will still complicate tense diplomatic issues connected to the war.\nThe ICC’s warrant request is unlikely to change either side’s military objectives moving forward.\nIsraeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\nMore than half of Gaza’s population had fled to the city and its surrounding areas amid the war between Israel and Hamas.\nRepublican lawmakers in Congress have blasted the court for targeting Israeli leaders with warrants, threatening to pull U.S. support for it and to levy sanctions against it.", "location": "Gaza", "classification": "security", "score": 0.5497085548374816, "event_breakdown": "* ICC request a warrant for the arrest of Israeli Prime Minister Benjamin Netanyahu for alleged war crimes during the recent war between Israel and Hamas.\n* The ICC’s mandate is to bring to justice those responsible for war crimes, crimes against humanity, and genocide.\n* War erupted between Israel and Hamas, a militant group, in May 2021 after weeks of rising Israeli-Palestinian tension and clashes in Jerusalem.\n* The war killed more than 250 Palestinians in Gaza, as well as 13 people in Israel from rocket attacks.\n* Israel launched thousands of airstrikes that heavily damaged Gaza's infrastructure and some 2,000 residential buildings were destroyed.\n* The fighting also left more than 1,500 Palestinians wounded, including some 400 women and children.\n* Some 9,000 rockets and missiles were fired from the Gaza Strip into Israeli territory, killing 12 civilians and injuring hundreds, as well as causing significant property damage.\n* In addition to targeting civilian infrastructure, the rockets targeted cities and towns far from Gaza's borders, reaching as far as Tel Aviv and Jerusalem."}, {"id": "ee360338-30f1-4ad8-bb91-086b4d9f80d4", "title": "ICC warrant unlikely to bring change to operations in Israel - Hamas war", "date": "2024-05-20 22:30", "url": "https://mynews4.com/news/nation-world/icc-warrant-unlikely-to-bring-change-to-operations-in-israel-hamas-war-international-criminal-court-war-crime-benjamin-netanyahu-yoav-gallant-yahya-sinwar-muhammad-deif-ismail-haniyeh", "message": "Neither Israel nor the United States are member states of the ICC, but it will still complicate tense diplomatic issues connected to the war.\nThe ICC’s warrant request is unlikely to change either side’s military objectives moving forward.\nIsraeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\nMore than half of Gaza’s population had fled to the city and its surrounding areas amid the war between Israel and Hamas.\nRepublican lawmakers in Congress have blasted the court for targeting Israeli leaders with warrants, threatening to pull U.S. support for it and to levy sanctions against it.", "location": "GAZA", "classification": "security", "score": 0.5497085548374816, "event_breakdown": "* Israeli military strikes in Gaza\n* Hamas firing rockets into Israel\n* Benny Gantz and Benjamin Netanyahu's comments on ICC investigators\n* ICC request for arrest warrants for Israeli leaders\n* Republican lawmakers' threat to cut U.S. support for the ICC and impose sanctions on it."}, {"id": "072431d6-01bc-41e2-aa0b-1ff5610d952e", "title": "Helicopter crash that killed Iran president likely to reverberate across Middle East", "date": "2024-05-20 20:00", "url": "https://www.theweek.in/news/world/2024/05/20/helicopter-crash-that-killed-irans-president-likely-to-reverberate-across-middle-east.html", "message": "The helicopter crash in which Iranian President Ebrahim Raisi, the country's foreign minister and other officials were killed is likely to reverberate across the Middle East, where Iran's influence runs wide and deep.\nIsrael is believed to have carried out numerous attacks over the years targeting senior Iranian military officials and nuclear scientists.\nThere is no evidence Israel was involved in Sunday's helicopter crash, and Israeli officials have not commented on the incident.\nIran has always insisted its nuclear program is for purely peaceful purposes, but the United States and others believe it had an active nuclear weapons program until 2003.\nIsrael is widely believed to be the only nuclear-armed power in the Middle East but has never acknowledged having such weapons.", "location": "Iran", "classification": "security", "score": 0.6651725247320209, "event_breakdown": "Here is an event that is related to the topic, but I can't come up with other events:\n\n1.2006 Israeli strike on the alleged Syrian nuclear reactor\n\nUnfortunately, I am unable to find any other related events based on the given information."}, {"id": "1c6e94fc-49f5-4eb1-a735-f21db02a12eb", "title": "Letters : Critics always overlook why Israel has to fight", "date": "2024-05-20 20:00", "url": "https://www.nola.com/opinions/letters-critics-always-overlook-why-israel-has-to-fight/article_72736378-0976-11ef-91e3-5f6136e88b23.html", "message": "Holding Israeli flags people stand in front of trucks carrying humanitarian aid as they try to stop them to enter in the Gaza Strip in an area near the Kerem Shalom border crossing between Israel and Gaza, in southern Israel, in Kerem Shalom, Thursday, May 9, 2024.", "location": "Kerem Shalom", "classification": "security", "score": 0.9785071512006841, "event_breakdown": "Based on the text provided, here are the list of security events related to the situation at the Kerem Shalom border crossing between Israel and Gaza:\n\n1. People standing in front of trucks carrying humanitarian aid as they try to stop them from entering the Gaza Strip.\n2. Protests near the Kerem Shalom border crossing between Israel and Gaza."}, {"id": "cf3fc3b5-ff7b-4116-8364-88593d88df33", "title": "War monitor says Israeli strikes kill six pro - Iran fighters in Syria", "date": "2024-05-20 20:45", "url": "https://www.citizen.co.za/news/news-world/war-monitor-says-israeli-strikes-kill-six-pro-iran-fighters-in-syria/", "message": "War monitor says Israeli strikes kill six pro-Iran fighters in SyriaThe Syrian Observatory for Human Rights said \"Israeli strikes targeted two positions of pro-Iran groups in the Homs region\".\n(Photo by JACK GUEZ / AFP)A war monitor said at least six pro-Iran fighters were killed Monday in Israeli strikes in Syria near the Lebanese border, in an area where Lebanon’s powerful Hezbollah group holds sway.\nA Hezbollah source told AFP that at least one fighter from the group was killed in Israeli strikes in the Qusayr area.\nIsrael rarely comments on individual strikes in Syria but has repeatedly said it will not allow its arch-enemy Iran to expand its presence there.\nOn May 9, Israeli strikes on Syria targeted facilities belonging to Iraq’s Al-Nujaba armed movement, the Observatory and the pro-Iran group said, with Damascus saying an unidentified building was attacked.", "location": "Homs region", "classification": "security", "score": 0.9665196894762689, "event_breakdown": "* Six pro-Iran fighters were killed in Israeli strikes in the Syria-Homs region\n* At least one Hezbollah fighter was killed in Israeli strikes in the Qusayr area"}, {"id": "e69b9b5f-2ed3-4fc9-b6ca-1788f06552f4", "title": "Colombia : Cauca under attack by FARC dissidents | The City Paper Bogotá", "date": "2024-05-20 23:00", "url": "https://thecitypaperbogota.com/news/cauca-under-attack-by-farc-dissidents/", "message": "In a rapidly deteriorating security situation in southwest Colombia, FARC dissidents of the Estado Mayor Central (EMC) attacked the town of Morales and destroyed the local police station.\nWe will not tolerate the continued intimidation of the population with terrorist attacks,” stated Petro on his “X” account.\nIn audios revealed by the Semana news outlet, the Colombian Army also confirmed that a National Police helicopter was hit by FARC dissidents.\nOn Monday morning as the attack was taking place in Morales, another terrorist attack was recorded in Jamundí, Valle del Cauca.\nGiven the seriousness of the security situation in Cauca, President Petro and Defense Minister Velásquez appointed Major General Luis Emilio Cardozo as the new Commander of the Army.", "location": "Morales", "classification": "security", "score": 0.9162218475529448, "event_breakdown": "Events:\n- FARC dissidents of the Estado Mayor Central (EMC) attacked the town of Morales and destroyed the local police station.\n- Colombian Army confirmed that FARC dissidents hit a National Police helicopter.\n- Another terrorist attack was recorded in Jamundí, Valle del Cauca, on Monday morning.\n- Major General Luis Emilio Cardozo was appointed by the President Petro and Defense Minister Velásquez as the new Commander of the Army as the seriousness of the security situation in Cauca."}, {"id": "37119126-36fd-48f0-8a0a-4bb8adbb17da", "title": "Binyamin Netanyahu expresses  disgust  at International Criminal Court seeking his arrest warrant – The Irish Times", "date": "2024-05-20 23:00", "url": "https://www.irishtimes.com/world/middle-east/2024/05/20/netanyahu-says-international-criminal-court-seeking-his-arrest-warrant-a-scandal/", "message": "International Criminal Court prosecutor Karim Khan announced he is seeking arrest warrants for the Israeli PM, defence chief and three Hamas leaders.\n(Reuters)The chief prosecutor of the International Criminal Court (ICC), Karim Khan, has said he is seeking arrest warrants for Israeli prime minister Binyamin Netanyahu and defence minister Yoav Gallant, along with Hamas leaders Yahya Sinwar, Ismail Haniyeh and Mohammed Deif.\nMr Khan said Hamas leaders were “criminally responsible” for the killing of hundreds of Israeli civilians on October 7th, and the taking of at least 245 hostages.\nThe ICC is the world’s first permanent international war crimes court.\n“I reject with disgust the comparison of the prosecutor in The Hague between democratic Israel and the mass murderers of Hamas,” Mr Netanyahu said.", "location": "Palestine", "classification": "security", "score": 0.7162832178056946, "event_breakdown": "Security events:\n\n- Israelis killed by Hamas on October 7th.\n- 245 Israelis taken hostage by Hamas."}]