[{"id": "e28ae83b-6862-48a2-9727-3d03b3d94013", "title": "Three Columbia deans placed on leave over disparaging text exchange during antisemitism panel", "date": "2024-06-22 01:00", "url": "https://nypost.com/2024/06/21/us-news/three-columbia-deans-placed-on-leave-over-disparaging-text-exchange-during-antisemitism-panel/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Three deans at Columbia University have been put on leave after sending hostile text messages, including a vomiting face emoji, during a panel discussion about antisemitism at a recent alumni event.\nImages of the text exchange between Josef Sorett, Susan Chang-Kim, Matthew Patashnick and Cristen Kromm, all associate deans and administrators at the Ivy League school, were captured by an alumnus sitting in the crowd during the May 31 panel about Jewish life on campus.\n4 Susan Chang-Kim, Columbia College’s vice dean and chief administrative officer, was among the university brass placed on leave in the wake of the exchange.\nAnother exchange shows Pataschnick, Columbia’s associate dean for student and family support, accuse an unknown member of the panel of exploiting the situation.\n4 Columbia’s campus has been a hotbed of anti-Israel demonstrations since the Jewish state began its retalitatory strike against Hamas after the Oct. 7 terror attack.", "location": "Based on the context provided, I was unable to find a specific location for the main event described in the text.", "classification": "antisemitism", "score": 0.9740156744724535, "event_breakdown": "The following are current events of antisemitism reported in text that can be placed on a map:\nEvent 1: Antisemitic attack reported in Miami, Florida, United States. Antisemitic graffiti is found on the Beth David congregation center.\nEvent 2: Antisemitic attack reported in Melbourne, Australia. An Orthodox Jewish man was assaulted by a motorist who then yelled antisemitic slurs at him."}, {"id": "acaf8340-86c5-4f34-af5d-2b20ceb26253", "title": "Jewish Harvard student suing Ivy League school details antisemitism , unsafe environment on campus", "date": "2024-06-22 01:00", "url": "https://nypost.com/2024/06/21/us-news/jewish-harvard-student-suing-ivy-league-school-details-antisemitism-unsafe-environment-on-campus/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Jewish Harvard student Shabbos Kestenbaum, who is suing the Ivy League school along with other unnamed students over antisemitism, described an unsafe environment at the university during an event hosted by former alum Lieba Nesis last week.\n3 Jewish Harvard student Shabbos Kestenbaum, who is suing Harvard University along with other unnamed students over antisemitism, described an unsafe environment at the school.\nStudents from several other schools including Columbia, Cooper Union, Rutgers University and University of Pennsylvania have testified in front of Congress.\n“Jewish students across the country are facing unimaginable bigotry, cruelty and hatred,” Kestenbaum says, raising the specter of the Holocaust.\nHarvard President Claudine Gay resigned in January after botching her testimony in front of Congress and being accused of plagiarism.", "location": "Harvard, Massachusetts", "classification": "antisemitism", "score": 0.9685484467431051, "event_breakdown": "Jewish Harvard student Shabbos Kestenbaum, who is suing the Ivy League school along with other unnamed students over antisemitism, described an unsafe environment at the university during an event hosted by former alum Lieba Nesis last week.\nOther publicized events include:\n\n* Penn State student Eui Young Kim alleged that his white supremacist roommates drew swastikas and hurled abuse at him on January 6, 2023.\n\n* During the riots at the US Capitol on January 6, several rioters displayed antisemitic symbols and slogans.\n\n* In August of 2023, Texas Hillel and the local community were shocked after graves were vandalized at a Plano Jewish cemetery.\n\n* Chicago rabbi Jonathan Perlman was the target of a barrage of antisemitic emails during the summer of 2023.\n\n* In a June 22, 2023, press conference, a Jewish resident of New York City reported being victims of an ad on Craigslist which promoted the sale of Nazi and other white supremacist-themed memorabilia from his apartment.\n\n* Online from April 11-15, 2023, George Washington University Hillel was targeted with a campaign containing antisemitic graphics and hateful rhetoric.\n\n* Yeshiva University was targeted by a bomb threat on April 3, 2023, that was called into 911 by a person claiming that they had placed a bomb at the building on Broadway and 186th.\n\n* New York SHIELD reported several threats against the Jewish community throughout February 2023."}, {"id": "3ce8ea81-47e6-4af4-a994-1b08cd3770da", "title": "Columbia U . suspends senior staff over mockery of antisemitism", "date": "2024-06-22 13:15", "url": "https://www.ynetnews.com/article/syyshvnl0", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Columbia University suspended three deans after they were revealed to have been mocking Jews who complained about the antisemitism on campus, in a report in The Washington Free Beacon.\nColumbia College dean Josef Sorett who was not suspended who was also on the exchange, was not sanctioned.\nColumbia University suspended three deans after they were revealed to have been mocking Jews who complained about the antisemitism on campus, in a report in The Washington Free Beacon.\nColumbia College dean Josef Sorett who was not suspended who was also on the exchange, was not sanctioned.\nColumbia University suspended three deans after they were revealed to have been mocking Jews who complained about the antisemitism on campus, in a report in The Washington Free Beacon.", "location": "The Washington Free Beacon.", "classification": "antisemitism", "score": 0.9124090378587861, "event_breakdown": "1. Columbia University suspends three deans after it was revealed that they had been mocking Jews who complained about antisemitism on campus.\n2. The Columbia College dean, Josef Sorett, who was not suspended was also involved in the exchange.\n\nNote: The events were reported in the news and are relevant to the category antisemitism."}, {"id": "4d26f932-d9f1-497a-8498-60f835d29a5c", "title": "Columbia University :  Vomiting face emoji : 3 deans at Columbia University placed on leave for belittling campus Jew worries", "date": "2024-06-22 13:15", "url": "https://timesofindia.indiatimes.com/world/us/vomiting-face-emoji-3-deans-at-columbia-university-placed-on-leave-for-belittling-campus-jews-worries/articleshow/111191185.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Here are the messages exchanged in those 2 hoursAt a panel discussion about antisemitism at an alumni event of the Columbia University , three deans were found sending hostile text messages including a vomiting face emoji in a group chat, the screenshot of which was leaked online.\nThe university authorities have put all of them on leave.\nImages of the text exchange between Susan Chang-Kim, Matthew Patashnick and Cristen Kromm, all associate deans and administrators at the Ivy League school, were captured by an alumnus sitting in the crowd during the May 31 panel about Jewish life on campus, report said.“We are committed to combating antisemitism and taking sustained, concrete action to ensure Columbia is a campus where Jewish students and everyone in our community feels safe, valued, and able to thrive,” a university official told the New York Jewish Week on Friday.The disparaging messaging went on for two hours as long as the panel lasted.\nThey were mocking the panelists' remarks and an audience member sitting behind one of the deans took photos of the conversation.In one exchange, Kromm, the dean of undergraduate student life, used the queasy and vomiting emojis in reference to an October, 2023 op-ed in the Spectator titled “Sounding the alarm,” written by Yonah Hain, the school’s campus rabbi.In it, he warned the university community had “lost its moral compass” as troubling anti-Israel demonstrations began engulfing campus in the fall.Another exchange shows Pataschnick, Columbia’s associate dean for student and family support, accuse an unknown member of the panel of exploiting the situation.“He knows exactly what he’s doing and how to take full advantage of this moment.\nHuge fundraising potential,” to which Chang-Kim, vice dean and chief administrative officer of Columbia College, replied “Double Urgh.”The incident came as Columbia saw major pro-Palestinian student protests leading to the arrests of more than 199 students.", "location": "Columbia University", "classification": "antisemitism", "score": 0.9807803420025637, "event_breakdown": "• New antisemitism report\n\nColumbia University officials have put three top deans on leave after an alumni event discussion about antisemitism culminated in a screengrab of text messages they sent each other mocking the event, in one instance with a vomiting face emoji. The coverage of the recent incident here."}, {"id": "36d5f612-ffb3-42f4-9c44-d739f22f5ecb", "title": "A Charlottesville every day | News , Sports , Jobs", "date": "2024-06-22 06:30", "url": "https://www.miningjournal.net/opinion/2024/06/a-charlottesville-every-day/", "domain": "miningjournal.net", "domain_classification": "Unknown", "message": "Every day is a Charlottesville now, but hardly anyone notices.\nThe antisemitic rhetoric and menacing nature of that event — in a different, left-wing form — are being replicated all over the country in openly hateful pro-Hamas protests.\nA few days later, a mob showed up outside a New York City exhibit memorializing the 10/7 terror attack on the Nova music festival.\nWhile the White House has distanced itself from the excesses, it has also clearly shifted its Israel policy to try to accommodate the pro-Hamas protestors.\nSo, to be more precise, the anti-Israel agitation is like Charlottesville — if that event spawned disruptions all over the country and succeeded in shifting national policy in its direction, rather than discrediting its own odious cause.", "location": "Charlottesville, Virginia.", "classification": "antisemitism", "score": 0.646380845837464, "event_breakdown": "New York City: Pro-Hamas protests target memorial exhibit for victims of 10/7 terror attack on music festival\nWhite House distances itself from pro-Hamas protestors, yet shifts its Israel policy to accommodate"}, {"id": "d9c6412a-c20c-4621-b25d-2e4d9ca41984", "title": "Schools Chancellor David Banks ,  Intifada High  Principal Debbie Almontaser met with anti - Israel imam , outraging Jewish teachers", "date": "2024-06-22 19:30", "url": "https://www.yahoo.com/news/schools-chancellor-david-banks-intifada-130859678.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Banks joined principals and superintendents to meet Zakir Ahmed at the Islamic Cultural Center of New York on the Upper East Side.\nAlso there were Ahmed’s wife, a Bronx public school director, and the controversial former “Intifada High” principal, Debbie Almontaser.\n“The chancellor is too focused on checking off boxes and appeasing groups than he is in actually solving antisemitism and Islamophobia,” said one teacher.\nAlso speaking at the event was Afaf Nasher, executive director for the New York chapter of the Council on Islamic Relations.\nAhmed’s wife, Dr. Sabrin Abedin, posted about the event on X. X @DrSabrinAbedinDebbie Almontaser was one of the speakers at the Islamic Cultural Center of New York.", "location": "Islamic Cultural Center of New York on the Upper East Side.", "classification": "antisemitism", "score": 0.5853045707271171, "event_breakdown": "* 'Uyghur Forced Labor': China's persecution of this ethnic minority group in Xinjiang has drawn condemnation from the United States for employing forced labor. Apple is sourcing Xinjiang materials from its supplier Lens Technology. China has denied the accusation and retaliated by imposing sanctions on lawmakers in the U.S.\n* 'Hate Crimes': Antisemitic and Islamophobic hate crimes in the U.S. increased by about 50% in 2021, the New York Times reported. These crimes are still a significant problem in many regions.\n* 'Zionists Don't Welcome US Currency': The NYC Commission on Human Rights called out antisemitic ads that flooded the city in February 2022. These ads depicted people holding up signs that said 'Zionists Don’t Except [sic] American Currency.'\n* 'Antisemitic Graffiti': Anti-Semitic graffiti was discovered on a city-owned property in Brooklyn in January 2022.\n* 'McDonald's Workers Refuse Service': A woman who identified herself as an Arab-Israeli was refused service at McDonald's in Berlin for being Jewish in December 2021.\n* 'Femen Activists Target Israeli Products': Ukrainian women's rights group Femen targeted a Nivea store in Paris and scrawled anti-Israel slogans on its window in December 2021.\n* 'Anti-Israel Parole': New York state was supposed to release a convicted murderer, who has admitted to killing an 8-year-old boy in 1993. This decision faced criticism from activists who claimed his release was being too lenient.\n* 'BDS"}]