[{"id": "ab9f6c85-75be-46e1-8e8c-7db181ca3117", "title": "Would Josh Shapiro stances on Israel help or hurt Kamala Harri ticket ? ", "date": "2024-07-26 01:15", "url": "https://www.inquirer.com/politics/election/josh-shapiro-israel-kamala-harris-20240725.html", "domain": "inquirer.com", "domain_classification": "Unknown", "message": "Governor of Pennsylvania Josh Shapiro speaks during a rally against antisemitism at Congregation Rodeph Shalom in Philadelphia on Sunday, Dec. 10, 2023.\nRead moreTwo days after Hamas attacked southern Israel on Oct. 7, Gov.\nJosh Shapiro took the stage at a rally in Wynnewood, a Jewish stronghold in his home Montgomery County, and vowed to be a champion for Israel.\nWhether Shapiro’s full-throated support of Israel would help or hurt a Democratic ticket presents a complex question.\nHow Israel got linked to the VP raceShapiro’s position on Israel has come under a microscope since being identified as a prospective running mate for Harris.", "location": "PHILADELPHIA", "classification": "antisemitism", "score": 0.844705166475726, "event_breakdown": "Two days of antisemitic incidents were reported in Philadelphia following the Israel-Hamas ceasefire, including locals shouting “Jews back to Auschwitz” at a Jewish male driver in Center City."}, {"id": "bce3b6e0-9fc1-4fc4-a290-1f560b2113a9", "title": "Hope for the Middle East : American universities have a role", "date": "2024-07-26 09:15", "url": "https://www.dallasnews.com/opinion/commentary/2024/07/26/hope-for-the-middle-east-american-universities-have-a-role/", "domain": "dallasnews.com", "domain_classification": "Unknown", "message": "AdvertisementWithin a week, visions of a more peaceful, stable Middle East were shattered as the tragedy had irreversibly reshaped Israeli society and the broader region.\nI arrived in Tel Aviv on the evening of May 13 to find Israelis still grieving the attacks.\nDizengoff, an iconic public square frequented by local youth and tourists alike, has been repurposed into a public memorial for the hostages.\nEven Texas has seen several anti-Israel protests at institutions such as Baylor University, the University of Texas and Texas A&M University.\nAnd yet, universities must have a role to play in stimulating civil discourse, particularly for complex issues relating to international conflict.", "location": "Tel Aviv", "classification": "antisemitism", "score": 0.40987579529231166, "event_breakdown": "Dizengoff, an iconic public square in Tel Aviv, has been repurposed into a public memorial for the hostages. Even in universities across Texas like Baylor University, the University of Texas at Austin and Texas A&M University, there have been anti-Israel protests."}, {"id": "ad233635-ba73-457d-8e21-d5668ce8a9aa", "title": "  Call Kamala : Doug Emhoff describes  whirlwind  moment he learned of Biden race exit", "date": "2024-07-26 15:30", "url": "https://www.yahoo.com/news/call-kamala-doug-emhoff-describes-143613650.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Kamala Harris, left, and Doug Emhoff, speak at her campaign headquarters in Wilmington, Delaware on 22 July 2024.\nKamala Harris, left, and Doug Emhoff, speak at her campaign headquarters in Wilmington, Delaware on 22 July 2024.\nI need you.’”Related: Kamala Harris and Doug Emhoff face online wave of sexist, racist attacksEmhoff, an entertainment business litigation lawyer by trade, who is Jewish, is engaged in a Biden administration antisemitism task force to combat what he was called an “epidemic of hate” in the US.\n“We’ve just been hustling; I’ve barely even seen her or talked to her since this all happened,” he told the outlet.\nAt the Thursday event for Black gay and queer men, Emhoff promised that Harris would “be there” for the LGBTQ+ community moving forward.", "location": "Wilmington, Delaware", "classification": "antisemitism", "score": 0.7478243063118235, "event_breakdown": "1. Target event: Biden administration antisemitism task force\nBiden administration antisemitism task force to combat antisemitism in the United States."}]