[{"id": "717cbf5e-ecfc-4dd7-a101-3784226ac939", "title": "President Biden hopes Iran backs down from conflict with Israel - after Hezbollah fires rocket barrage from Lebanon", "date": "2024-08-04 05:45", "url": "https://www.iwradio.co.uk/news/sky-news/president-biden-hopes-iran-backs-down-from-conflict-with-israel-after-hezbollah-fires-rocket-barrage-from-lebanon/", "domain": "iwradio.co.uk", "domain_classification": "Unknown", "message": "Iran has pledged to avenge his death, with its proxies already escalating attacks against Israel.\nThe assassination came a day after the Israeli military claimed to have killed a senior commander of Lebanese militant group Hezbollah in Beirut.\nHamas said all nine of those killed in the two Israeli attacks in the West Bank were fighters.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\n(c) Sky News 2024: President Biden hopes Iran backs down from conflict with Israel - after", "location": "Israel", "classification": "security", "score": 0.9461200233314851, "event_breakdown": "Iran vows revenge and Israel pushes on with airstrikes\nIsraeli forces launch suspected airstrikes in Syria, drawing Iranian retaliation\nPalestinians among those killed in suspected Israel strikes in West Bank\nHamas says 9 of its men killed in attack in Israel\n39,550 Palestinians recorded dead in Gaza, according to officials"}, {"id": "bdf41fb2-05ab-424b-a154-39c432f10d04", "title": "Known Details about Haniyeh Assassination : A Bomb was smuggled and planted a few Months ago in the Apartment", "date": "2024-08-04 02:30", "url": "https://sarajevotimes.com/known-details-about-haniyehs-assassination-a-bomb-was-smuggled-and-planted-a-few-months-ago-in-the-apartment/", "domain": "sarajevotimes.com", "domain_classification": "Unknown", "message": "The bomb was hidden in the apartment about two months ago, some sources claimed.\nIranian officials and Hamas stated on Wednesday that Israel was responsible for the assassination, a view shared by several U.S. officials who wished to remain anonymous.\nTwo Iranian officials who described the nature of the assassination said they did not know how or when the explosive was placed in the room.\nIsrael decided to carry out the assassination outside Qatar, where Haniyeh and other senior members of Hamas’s political leadership reside.\nThe deadly explosion early Wednesday shattered windows and brought down part of the wall of the complex, according to photos and statements by Iranian officials.", "location": "Qatar", "classification": "security", "score": 0.8715257406917788, "event_breakdown": "Qatar"}, {"id": "b23e346a-b71c-47ad-85fc-218bb977941c", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 05:45", "url": "https://www.channelnewsasia.com/world/israel-hamas-war-fear-conflict-spread-middle-east-retaliation-4525466", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "BEIRUT, Lebanon: Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Palestinian militant group Hamas in Gaza.\nIsrael, accused by Hamas, Iran and others of carrying out the attack, has not directly commented on it.\nIran said on Saturday it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.", "location": "BEIRUT", "classification": "security", "score": 0.9057091328978484, "event_breakdown": "Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel, spurring fears of a regional war.\nIsrael, accused by Hamas, Iran and others of carrying out the attack, has not directly commented on it."}, {"id": "6b01f51d-8ad7-442a-92fa-a23f31733a1f", "title": "Israel And Allies Mobilise Under  Abraham Alliance  As Fears Of Iranian Retaliation Grow", "date": "2024-08-04 06:00", "url": "https://www.news18.com/world/israel-prepares-for-potential-iranian-strike-coordinates-with-allies-us-and-uk-8989524.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "However, he stressed that the unprecedented scale of US support for Israel since October 7 should leave Iran, Hezbollah, and other groups with no doubt about US resolve.\nIsrael, accused by Hamas, Iran and others of carrying out the attack, has not directly commented on it.\nIran said on Saturday it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nSoon after, Hezbollah announced it had fired dozens of Katyusha rockets at the northern Israeli settlement of Beit Hillel.", "location": "Israel", "classification": "security", "score": 0.8201475073741427, "event_breakdown": "Event 1: US bolstering its military in the Middle East\nEvent 2: Hezbollah firing dozens of Katyusha rockets at Beit Hillel settlement"}, {"id": "e15469e3-310d-422f-adee-15ddf038558e", "title": "Israeli strike on Gaza school sheltering refugees kills 15", "date": "2024-08-04 02:00", "url": "https://www.odt.co.nz/news/world/israeli-strike-gaza-school-sheltering-refugees-kills-15", "domain": "odt.co.nz", "domain_classification": "Unknown", "message": "A Palestinian woman inspects the site of a former school, which was destroyed in an Israeli air strike.\nGAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "location": "GAZA STRIP", "classification": "security", "score": 0.9841586031364296, "event_breakdown": "Gaza Airstrike Kills 15 Displaced Persons\nA school sheltering internally displaced persons in Gaza City's Sheikh Radwan neighborhood was targeted in an airstrike launched by the Israeli military. At least 15 people died in the explosion. The school was reportedly being used as a command center for Hamas."}, {"id": "81ed188b-a31e-4885-b269-93b001c007f6", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 01:45", "url": "https://www.wbal.com/us-sends-more-fighter-jets-and-ships-to-middle-east-ahead-of-possible-iranian-retaliation/", "domain": "wbal.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region.", "location": "The Middle East", "classification": "security", "score": 0.6158011264167934, "event_breakdown": "Title: Carrier Deployment to Middle East\nLocation: Middle east\nDescription: Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Rooservelt that would head home following a short-term deployment to the Middle East. Austin also ordered the deployment of an additional fighter squadron to the Middle East to reinforce our defensive air support capability. Currently deployed to the western Pacific, it is unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt."}, {"id": "e0070f5e-a722-4ebf-a5de-d28679de8531", "title": "Israeli strike kills at least 10 Palestinians in Gaza school sheltering displaced , Hamas says", "date": "2024-08-04 01:45", "url": "https://www.moneycontrol.com/news/world/israeli-strike-kills-at-least-10-palestinians-in-gaza-school-sheltering-displaced-hamas-says-12786293.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "associated byFollow us on:Israeli strike kills at least 10 Palestinians in Gaza school sheltering displaced, Hamas says", "location": "GAZA", "classification": "security", "score": 0.862735031718241, "event_breakdown": "Israeli airstrike on a school in Gaza kills at least 10 Palestinians, Hamas says."}, {"id": "a56128b9-d504-4989-82d2-a58c48be8195", "title": "10 Palestinians killed in Israeli airstrike on school in Gaza", "date": "2024-08-04 05:45", "url": "https://www.thestatesman.com/world/10-palestinians-killed-in-israeli-airstrike-on-school-in-gaza-1503327944.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "At least 10 Palestinians were killed and dozens of others wounded in an Israeli airstrike on a school in Gaza City, said Palestinian security and medical sources.\nAn Israeli jet bombed with one missile a school housing displaced people in Sheikh Radwan neighbourhood, north of Gaza City, Palestinian security sources told Xinhua news agency on Saturday.\nThe bombing killed 10 people and injured dozens of others, and the number of victims is expected to increase, Palestinian medical sources said.\nAdvertisementThe Israel Defense Forces said in a statement on Saturday that it targeted a Hamas command and control complex that was used to produce weapons and was previously used as a school in Gaza City, Xinhua news agency reported.\nThe complex was used as a “hideout for Hamas terrorists, and planning was carried out inside this complex to commit terrorist attacks against Israel,” the statement added.", "location": "GAZA CITY", "classification": "security", "score": 0.890531764313704, "event_breakdown": "Israeli airstrike on a school in Gaza City."}, {"id": "3fb4442f-c0ca-4a9d-b9a6-552a2b1f2931", "title": "10 Palestinians Killed In Israeli Airstrike On School In Gaza", "date": "2024-08-04 00:00", "url": "https://menafn.com/1108513929/10-Palestinians-Killed-In-Israeli-Airstrike-On-School-In-Gaza", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Gaza, Aug 4 (IANS) At least 10 Palestinians were killed and dozens of others wounded in an Israeli on a school in Gaza City, said Palestinian security and medical sources.\nAn Israeli jet bombed with one missile a school displaced people in Radwan neighbourhood, north of Gaza City, Palestinian security sources told Xinhua news agency on Saturday.\nThe bombing killed 10 people and dozens of others, and the number of is expected to increase, Palestinian medical sources said.\nThe Israel Defense Forces said in a statement on Saturday that it targeted a Hamas command and control complex that was used to produce weapons and was previously used as a school in Gaza City, Xinhua news agency reported.\nThe complex was used as a \"hideout for Hamas terrorists, and planning was carried out inside this complex to commit terrorist attacks against Israel,\" the statement added.", "location": "GAZA CITY", "classification": "security", "score": 0.8751136731905131, "event_breakdown": "Gaza City, Palestinian security sources told Xinhua news agency on Saturday.The bombing killed 10 people and dozens of others, and the number of is expected to increase, Palestinian medical sources said."}, {"id": "a8f801a5-ac4a-41d4-883a-7635807d7fb9", "title": "Hezbollah rockets pour into Israel North - The Jerusalem Post", "date": "2024-08-04 03:00", "url": "https://www.jpost.com/breaking-news/article-813144", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Some cities and towns where the sirens were heard included Kiryat Shmona, Metualla, Beit Hillel, HaGoshrim, and Kfar Yuval.\nSocial media footage showed a barrage of rockets crossing into the Upper Galilee from Lebanon in the early hours of Sunday as dozens of rockets were launched at the area.\nIron dome anti-missile system fires interception missiles as rockets fired from Lebanon, as it seen over Kiryat Shmona, March 5, 2024.\nHeightened tensions in the Middle EastThe barrage comes as tension remains high between Israel and Lebanon's Hezbollah after Israel killed Hezbollah's military commander, Fuad Shukr, last week.\nIsrael's strike on Shukr came following a Hezbollah rocket launch last Saturday, which resulted in the deaths of 12 children from the Druze town of Majdal Shams.", "location": "Kiryat Shmona", "classification": "security", "score": 0.46844058515642867, "event_breakdown": "IDF claims of thwarted Hezbollah attack near Metula;  Alarms heard in Hermon, Kfar Yuval, Shlomi\nAnother rocket attack alarms in Golan Height;  projectile identified as errant Syrian rocket\nRocket sirens sound in Upper Galilee;  Iron Dome intercepts projectiles"}, {"id": "e6826f3c-6ff2-4577-a7fa-a0b19615713a", "title": "32 Killed As al - Shabab Attacks Somali Beach", "date": "2024-08-04 06:00", "url": "https://leadership.ng/32-killed-as-al-shabab-attacks-somali-beach/", "domain": "leadership.ng", "domain_classification": "Unknown", "message": "At least 32 people have been killed and many more wounded in a suicide bombing and gun attack on a popular beach in Somalia’s capital, Mogadishu, according to officials.\nAl-Shabab, an al-Qaeda-linked armed group, claimed responsibility for the attack on Lido Beach late on Friday via an affiliated radio station.\nThe assault began when a suicide bomber blew himself up at the entrance of Beach View Hotel.\nA witness told The Associated Press news agency in a phone call that he saw an attacker wearing an explosive vest moments before the man “blew himself up next to the Beach View Hotel”.\nMohamud Moalim also said some of his friends who were with him at the hotel were killed, and others were wounded.", "location": "Mogadishu", "classification": "security", "score": 0.9923388233759803, "event_breakdown": "1. a suicide bombing and gun attack on a popular beach in Somalia’s capital, Mogadishu,\n2. a suicide car bomb at a police training academy in the capital of Mogadishu, Somalia."}, {"id": "13be9fbd-18ba-4152-92c0-9ed694010606", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship", "date": "2024-08-04 04:30", "url": "https://abcnews.go.com/International/wireStory/suspected-missile-attack-yemens-houthi-rebels-hits-container-112548896", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A suspected missile attack by Yemen’s Houthi rebels struck a container ship traveling through the Gulf of Aden, likely the first assault by the group since Israeli airstrikes targeted themDUBAI, United Arab Emirates -- A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nDetails reported by the two organizations suggested the vessel targeted was the Liberian-flagged container ship Groton, which had left Fujairah in the United Arab Emirates bound for Jeddah, Saudi Arabia.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.9907192239788927, "event_breakdown": "Potential missile strike by Houthi rebels in Yemen's Hodeida province targeting a coalition military base. The attack comes in response to coalition airstrikes on Houthi positions in the area, and is the second such strike on the Hodeida base in a week. The coalition has not yet commented on the attack."}, {"id": "9715d982-c98e-4680-91c3-918d5daec8ff", "title": "Suspected missile attack by Yemen Houthi strikes container ship ; first assault in 2 weeks – Firstpost", "date": "2024-08-04 02:30", "url": "https://www.firstpost.com/world/suspected-missile-attack-by-yemens-houthi-strikes-container-ship-first-assault-in-two-weeks-13800620.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Reuters FileA suspected missile attack by Yemen’s Houthi rebels struck a container ship travelling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometres (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nOther missiles and drones have been either intercepted by a US-led coalition in the Red Sea or splashed down before reaching their targets.\nMeanwhile Saturday, the US military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.", "location": "The most relevant specific location mentioned in the provided context is \"Gulf of Aden.\"", "classification": "security", "score": 0.8852524731032623, "event_breakdown": "Houthi rebels in Yemen are believed to have struck a container ship with a missile in the Gulf of Aden, according to authorities. US military's Central Command said it had destroyed a Houthi missile and its launcher in Yemen on Saturday during the same time frame."}, {"id": "dca88c04-1c1d-4699-a0e9-0afb6ec22b91", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in two weeks", "date": "2024-08-04 05:45", "url": "https://www.newindianexpress.com/world/2024/Aug/04/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-two-weeks", "domain": "newindianexpress.com", "domain_classification": "Unknown", "message": "However, it can take the rebels hours or even days before they acknowledge an assault.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nThe Houthis also have launched drones and missiles toward Israel, including an attack July 19 that killed one person and wounded 10 others in Tel Aviv.\nIn the time since, there has not been a reported attack on shipping through the Red Sea corridor, which links Asia and the Middle East onto Europe through the Suez Canal.", "location": ".\nBased on the context provided, I was unable to come up with an answer.", "classification": "security", "score": 0.904803558184074, "event_breakdown": "Security event in the Red Sea: Houthi rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors. Other missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nSecurity event in Tel Aviv, Israel: The Houthis have also launched drones and missiles toward Israel, including an attack July 19 that killed one person and wounded 10 others."}, {"id": "6a72254e-9e5b-4976-a8e1-f7e77aa8f69f", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 05:45", "url": "https://www.clickondetroit.com/news/world/2024/08/04/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "DUBAI – A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.9675711748966941, "event_breakdown": "Event1: A suspected missile attack by Yemen’s Houthi rebels targeted a container ship traveling through the Gulf of Aden, as per authorities on November 28th, 2021."}, {"id": "2baf9279-61c2-4d5f-89e5-7160f0a65788", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 05:30", "url": "https://www.local10.com/news/world/2024/08/04/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "local10.com", "domain_classification": "Unknown", "message": "DUBAI – A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.9675711748966941, "event_breakdown": "Hamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "392af48c-ca5b-459d-bf02-0ec4e51f1924", "title": "Middle East conflict : Iran - backed Hezbollah fires  dozen of rockets at Israel", "date": "2024-08-04 02:30", "url": "https://www.telegraph.co.uk/world-news/2024/08/04/israel-iran-hamas-hezbollah-war-latest/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Hezbollah says it has launched “dozens” of rockets from Lebanon, as fears grow that a full-scale war with Israel could soon break out following the assassination of Hamas’s political leader in Tehran.\nThe Iran-backed group said it was acting in response to Israel’s attacks on Kfar Kela and Deir Siriane in Lebanon which, it said, had injured civilians there.\nIt comes amid reports that 50 rockets have been fired from southern Lebanon towards upper Galilee alone, according to Israeli media.\nThe crisis in the Middle East has intensified following the assassination of Ismail Haniyeh, Hamas’ top leader, a day after an Israeli strike in Beirut killed senior Hezbollah commander Fuad Shukr.\nThe escalating tensions have prompted Britain, the US and Australia to tell their citizens to evacuate Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9389851218233481, "event_breakdown": "Event 1: Hezbollah said it had launched \"dozens\" of rockets from Lebanon, as fears grow that a full-scale war with Israel could soon break out following the assassination of Hamas’s top leader in Tehran.\nEvent 2: 50 rockets were reportedly fired from southern Lebanon towards upper Galilee alone, according to Israeli media."}, {"id": "9c7fafff-049b-4219-9e9a-e3d6f6dd0caa", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 05:45", "url": "http://lasvegassun.com/news/2024/aug/03/suspected-missile-attack-by-yemens-houthi-rebels-h/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Suspected missile attack by Yemen’s Houthi rebels hits container ship in first attack in 2 weeksDUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.", "location": "ADEN", "classification": "security", "score": 0.981922993945453, "event_breakdown": "Suspected missile attack by Yemen’s Houthi rebels hits container ship in first attack in 2 weeks - A suspected missile attack by Yemen's Houthi rebels hit a 225 kilometers (140 miles) southeast of Aden in the Gulf of Aden. It was likely the first assault by the Houthi group since Israeli airstrikes targeted them.\nU.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen."}, {"id": "0af020a5-0cfd-4c72-adbf-d83493a585e5", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 05:45", "url": "https://www.wsls.com/news/world/2024/08/04/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "DUBAI – A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.", "location": "The main event is the attack on the property of the Houthi rebels in Yemen.", "classification": "security", "score": 0.9675711748966941, "event_breakdown": "1. Houthi Rebels Fire Missile at Container Ship off Yemen\nDUBAI - A suspected missile attack by Yemen's Houthi rebels hit a cargo ship traveling through the Gulf of Aden, authorities say. The Saturday attack happened southeast of Aden. No injuries were reported. The rebels have killed four sailors in their more than 70 attacks on ships with missiles and drones."}, {"id": "42552422-8201-4c44-8231-d4cb824c0df6", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 00:45", "url": "https://www.juneesoutherncross.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/?cs=6417", "domain": "juneesoutherncross.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack.", "location": ".\nTULKARM", "classification": "security", "score": 0.9853099717677823, "event_breakdown": "Two West Bank airstrikes by the Israeli military hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "7168e2eb-fdb7-442b-9028-5674347c96ad", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 00:45", "url": "https://www.juneesoutherncross.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/?cs=6409", "domain": "juneesoutherncross.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack.", "location": "West Bank", "classification": "security", "score": 0.9853099717677823, "event_breakdown": "1. Israeli military hits Hamas bases with fighter jet and artillery in response to incendiary balloons launched into Israel from Gaza\n2. President Macron  speaks out on Mali attack\n3. Police called to 'community tension' in Albert Lea\n4. FBI searches Colorado home to find more remains of woman\n5. Kenya says it has killed top Al-Shabaab commander"}, {"id": "6ee88bd5-2b99-4db4-9381-9abde7fb6cd8", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 00:45", "url": "https://www.newcastleherald.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack.", "location": "TULKARM", "classification": "security", "score": 0.9853099717677823, "event_breakdown": "Israeli military airstrikes targeting militants in the West Bank."}, {"id": "0a08494b-722d-4d0b-94ae-d78be31f0abe", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 02:00", "url": "https://www.batemansbaypost.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/?cs=14264", "domain": "batemansbaypost.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack.", "location": "West Bank", "classification": "security", "score": 0.9853099717677823, "event_breakdown": "First airstrike hits vehicle in West Bank, near Tulkarm: Israeli military. The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "df2726b4-06aa-4a7c-9854-bd580a69b940", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks – Winnipeg Free Press", "date": "2024-08-04 03:00", "url": "https://www.winnipegfreepress.com/business/2024/08/03/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen’s Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.\nIn the time since, Israel has killed at least 39,550 Palestinians in the Gaza Strip and 590 in the Israeli-occupied West Bank, Palestinian health officials say.", "location": "Dubai, United Arab Emirates", "classification": "security", "score": 0.9862337541291486, "event_breakdown": "1. A suspected missile attack by Yemen’s Houthi rebels struck a container ship traveling through the Gulf of Aden on Friday night, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\n2. The U.S. military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen on Saturday night. Iran-backed rebels said they fired six ballistic missiles targeting Saudi Arabia's capital, Riyadh, and southern areas."}, {"id": "125f4824-61fe-471d-8e6d-0e91aec9a00c", "title": "Hezbollah Launches Barrage Of Rockets At Israel , Sparks Fears Of War In The Region", "date": "2024-08-04 02:00", "url": "https://menafn.com/1108513957/Hezbollah-Launches-Barrage-Of-Rockets-At-Israel-Sparks-Fears-Of-War-In-The-Region", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Iran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and the Palestinian group Hamas in Gaza.\nIran said on Saturday that it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nSoon after, Hezbollah announced it had fired dozens of Katyusha rockets at the northern Israeli settlement of Beit Hillel.\nHis death came hours after Israel struck south Beirut, killing Hezbollah military commander Fuad Shukr.\nHezbollah has been exchanging near-daily cross-border fire with Israeli forces since October, saying it is acting in support of Hamas.", "location": "GAZA CITY", "classification": "security", "score": 0.9557006293256329, "event_breakdown": "On Saturday, Israel Defense Forces struck south Beirut, killing Hezbollah military commander Fuad Shukr, and in retaliation, Hezbollah said it had fired dozens of Katyusha rockets at the settlement of Beit Hillel."}, {"id": "52b31b45-3e04-41d8-b5b7-ec031a5f006f", "title": "Fresh Attack Hit Merchant Vessel Off Yemen", "date": "2024-08-04 01:45", "url": "https://menafn.com/1108513950/Fresh-Attack-Hit-Merchant-Vessel-Off-Yemen", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) SANAA, Aug 4 (NNN-SABA) – A merchant vessel in the Gulf of Aden, off Yemen, was struck by a second attack yesterday, just hours after an earlier attack on the same ship, according to Britain's Maritime Trade Operations (UKMTO).\nThe vessel was sailing 125 nautical miles east of Aden, when the incident occurred, the UKMTO said on social media.\nThe company's security officer reported that, the vessel was hit by a missile.\nHe stated, there was no fire, water ingress, or oil leak, adding that, the vessel is proceeding to its next of call, and authorities are investigating.\nEarlier, the UKMTO reported another attack on the same vessel, quoting the ship's master as saying, an explosion occurred in proximity, causing no damage.– NNN-SABA", "location": ".\nThe specific location is Gulf of Aden.", "classification": "security", "score": 0.9327400805232858, "event_breakdown": "Reported that a merchant vessel in the Gulf of Aden, off Yemen, was struck by a second attack yesterday, just hours after an earlier attack on the same ship."}, {"id": "5518d2c8-65f7-4eb0-a0ca-a4b342902f38", "title": "A woman was killed and 3 others were wounded in a stabbing attack in Israel", "date": "2024-08-04 06:30", "url": "https://www.ksat.com/news/world/2024/08/04/a-woman-was-killed-and-3-others-were-wounded-in-a-stabbing-attack-in-israel/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Recommended VideosTensions have soared across the region since Hamas' Oct. 7 attack ignited the war in Gaza last year.\nIsrael is bracing for retaliation after the killing of a senior Hezbollah commander in a strike in Lebanon and Hamas' top political leader in an attack in Iran's capital last week.\nThe rescuers said the wounded were found in three different locations, each about 500 meters (yards) apart.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October, triggering the ongoing war.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state.", "location": "GAZA", "classification": "security", "score": 0.7170012684845147, "event_breakdown": "Relevant Events:\n* Tensions have soared across the region since Hamas' Oct. 7 attack ignited the war in Gaza last year.\n* Israel is bracing for retaliation after the killing of a senior Hezbollah commander in a strike in Lebanon.\n* Hamas' top political leader was killed in an attack by Israel in Iran's capital last week."}, {"id": "d2a16a2a-24df-4049-98b5-5b1fe0b8050a", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 01:45", "url": "https://www.wjol.com/syndicated-article/?id=1577376", "domain": "wjol.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region.", "location": ")\nSince the deployment of the USS Abraham Lincoln was ordered, the carrier would replace the USS Roosevelt in the Middle East.", "classification": "security", "score": 0.6158011264167934, "event_breakdown": "[\n\"The United States is deploying the USS Abraham Lincoln to the Middle East as Defense Secretary Lloyd Austin ordered the USS Theodore Roosevelt to be replaced on a short-term deployment.\",\n\"Additionally, the US is deploying an additional fighter squadron to the Middle East to reinforce their defensive air support capability. \",\n\"Two other destroyers, also part of a ballistic missile defense mission, are currently operating in the eastern Mediterranean.\",\n]"}, {"id": "3f639965-0f26-43ad-98cb-3e149f2acc0c", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 00:30", "url": "https://www.mycentraloregon.com/2024/08/03/us-sends-more-fighter-jets-and-ships-to-middle-east-ahead-of-possible-iranian-retaliation/", "domain": "mycentraloregon.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region.", "location": "The Middle East", "classification": "security", "score": 0.6158011264167934, "event_breakdown": "Title: US to Keep Carrier in Middle East, Deploys Additional Fighter Squadron\n\nTarget Event: The US plans to maintain its aircraft carrier presence in the Middle East, as well as to deploy an additional fighter squadron to boost its defensive air support capabilities in the region.\n\nExplanation:\nThe US Department of Defense confirmed on Saturday, 22 January 2022, that the USS Abraham Lincoln will replace USS Theodore Roosevelt in the Middle East. It marked the latest in a string of warship deployments to the region since late December, in response to a perceived threat posed by Iran.\n\nOn Saturday, 29 January 2022, the US Department of Defense released a statement saying that Defense Secretary Lloyd Austin had ordered the USS Abraham Lincoln to replace USS Theodore Roosevelt in the Middle East. The move came as the latter sailed back from the region to the Gulf, as part of a short-term deployment that was ordered to replenish the carrier in the region."}, {"id": "6a9120a4-32b9-4c2b-817c-d4ff218da6a1", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 00:30", "url": "https://www.wlip.com/syndicated-article/?id=1577376", "domain": "wlip.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region.", "location": "The Middle East", "classification": "security", "score": 0.6158011264167934, "event_breakdown": "* The United States will maintain an aircraft carrier presence in the Middle East, with the USS Abraham Lincoln replacing the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\n* Defense Secretary Lloyd Austin ordered an additional fighter squadron deployed to the Middle East \"reinforcing our defensive air support capability.\"\n* There are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region."}, {"id": "dc2a60e6-d2a0-4ae1-aeb3-609bdb08a307", "title": "Israeli strikes kill 15 Palestinians in Gaza school , nine West Bank militants", "date": "2024-08-04 01:30", "url": "https://www.timesofearth.com/2024/08/04/israeli-strikes-kill-15-palestinians-in-gaza-school-nine-west-bank-militants/", "domain": "timesofearth.com", "domain_classification": "Unknown", "message": "GAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City’s Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nEgypt’s foreign minister, Badr Abdelatty, stressed in a phone call with Iran’s acting foreign minister, Ali Bagheri Kani, that recent developments in the region were “unprecedented, very dangerous” and threatening to stability, Egypt’s government said.", "location": "GAZA STRIP", "classification": "security", "score": 0.9729419473328861, "event_breakdown": "GAZA STRIKES\nIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City’s Sheikh Radwan neighbourhood, as reported by the Hamas-run-government media office. The Israeli Defence Forces (IDF) claimed the school was being used as a command centre for Hamas."}, {"id": "490fd468-6593-4f58-841d-26ac452dd834", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 00:30", "url": "https://www.gjsentinel.com/news/national/fears-of-middle-east-war-grow-after-hamas-leaders-killing/article_2f7df98d-542b-58a9-b9d6-a9f514c0bc5d.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "An Israeli Navy corvette patrols along the coast of the northern port city of Haifa, as Iran said it expects Lebanon's Hezbollah movement to hit deeper inside Israel", "location": "itself\nHaifa", "classification": "security", "score": 0.8287467717626702, "event_breakdown": "Israeli Navy corvette patrols along the coast of the northern port city of Haifa."}, {"id": "bc1e2336-15ac-49c7-90bd-3bba1d04df93", "title": "Iran Revolutionary Guards say Hamas leader Ismail Haniyeh was killed by US - backed Israel ; Vow revenge", "date": "2024-08-04 06:00", "url": "https://www.businessinsider.in/international/news/irans-revolutionary-guards-say-hamas-leader-ismail-haniyeh-was-killed-by-us-backed-israel-vow-revenge/articleshow/112258499.cms", "domain": "businessinsider.in", "domain_classification": "Unknown", "message": "Tehran [Iran], August 4 (ANI): Iran's Revolutionary Guards (IRGC) have said that Hamas leader Ismail Haniyeh was killed by Israel using a short-range projectile with a warhead and plans to take revenge \"at the appropriate time.\nThe Hamas leader and his bodyguard were killed in an Iranian government guest house in Tehran in the early hours of July 31.\nIsrael, which is at war with Hamas in the Gaza Strip, has neither acknowledged nor denied killing Haniyeh.\nEarlier on Wednesday, he also ordered Iran to strike Israel directly, in retaliation for the killing of Hamas leader.\nThey also discussed Iran's call for an extraordinary meeting of the Organization of Islamic Cooperation (OIC) member states over the assassination of the Hamas leader, IRNA reported.", "location": "Tehran", "classification": "security", "score": 0.9440055768997216, "event_breakdown": "Target event: Reports that Hamas leader Ismail Haniyeh was killed by Israel using a short-range projectile with a warhead and plans to take revenge \"at the appropriate time\"."}, {"id": "ce66669b-a3a4-453b-a4cf-70ca845083eb", "title": "Iran says Hamas chief killed by  short - range projectile  ", "date": "2024-08-04 05:45", "url": "https://www.thestatesman.com/world/iran-says-hamas-chief-killed-by-short-range-projectile-1503327940.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "Iran’s Islamic Revolution Guards Corps (IRGC) has said that Hamas Politburo Chief Ismail Haniyeh was assassinated by a “short-range projectile loaded with an almost 7-kg warhead”.\n“Given the conducted investigations, the terrorist operation has been carried out through firing from outside the guests’ residence a short-range projectile loaded with an almost 7 kg warhead, causing an intense explosion,” the IRGC said on Saturday in its third statement about Haniyeh’s assassination in an alleged Israeli attack in the Iranian capital Tehran, according to the armed force’s official news outlet Sepah News.\nThe statement added the “terrorist” attack had been designed and carried out by Israel with the US government’s support, Xinhua news agency reported.\nAdvertisementThe IRGC stressed that “the revenge for Haniyeh’s blood will be definite,” adding the “adventurist and terrorist” Israel would receive a “decisive response to this crime, which is a harsh punishment, at the appropriate time and place and with the appropriate quality”.\nHaniyeh, who had been invited to attend the swearing-in ceremony of Iranian President Masoud Pezeshkian on Tuesday, was killed along with his bodyguard early Wednesday when their residence in Tehran was hit.", "location": "Tehran, Iran", "classification": "security", "score": 0.6251459012643463, "event_breakdown": "Israel allegedly behind assassination of Hamas Politburo Chief Ismail Haniyeh in Tehran."}, {"id": "44a4c439-5bbd-4da0-8f98-431357592d78", "title": "Israelis fear for hostages as Netanyahu celebrates  crushing blow against enemies", "date": "2024-08-04 00:00", "url": "https://edition.cnn.com/2024/08/03/middleeast/israel-awaits-iran-attack-gaza-war-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "Tel Aviv, Israel CNN —As Prime Minister Benjamin Netanyahu celebrates what he sees as major victories against Hamas and Hezbollah this week, the mood in Tel Aviv is far from celebratory.\nOn Wednesday, Netanyahu said that his country “struck crushing blows” to the “the three H’s” – Hamas, the Houthis and Hezbollah, all Iranian-backed, all fierce Israeli foes.\nHamas also blamed Israel for the assassination of their political leader, Ismail Haniyeh, who was killed on Wednesday in Tehran.\nNetanyahu’s tone stands at odds with the mood on the ground in Tel Aviv, including among families of the hostages still in Gaza.\nPolls have repeatedly shown that most Israelis prioritize the release of hostages over continued war.", "location": ".\nTel Aviv, Israel", "classification": "security", "score": 0.7219840604174397, "event_breakdown": "Tel Aviv, Israel: Benjamin Netanyahu said that his country \"struck crushing blows\" to Hamas and Hezbollah this week. Hamas also blamed Israel for the assassination of their politcal leader, Ismael Haniyeh, who was killed on Wednesday in Tehran.\nAs Benjamin Netanyahu celebrates what he sees as major victories against Hamas and Hezbollah this week, the mood in Tel Aviv is far from celebratory. Polls have repeatedly shown that most Israelis prioritize the release of hostages over continued war."}, {"id": "9b4a0545-e35b-4117-a80b-b8aad496ab24", "title": "Event honoring men killed in Somalia held in Westmoreland County", "date": "2024-08-04 02:30", "url": "https://www.wpxi.com/news/local/event-honoring-men-killed-somalia-held-westmoreland-county/3KD2VQVHLJAITBCJ5UXRPOP4ZY/", "domain": "wpxi.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "The above text did not provide a specific location for the event.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "It looks like there are no current events of security reported in text that can be placed on a map. Check back soon as current events are constantly being updated."}, {"id": "681e5de5-04dc-4b41-96e8-925ef190807e", "title": "Houston firefighters receive first paychecks from $650 million back pay settlement", "date": "2024-08-04 05:30", "url": "https://www.fox26houston.com/news/houston-firefighters-first-paychecks-650-million-back-pay-settlement", "domain": "fox26houston.com", "domain_classification": "Unknown", "message": "Houston firefighters are seeing a light at the end of the tunnel after a years-long battle with the City of Houston.\nThe Houston Profession Firefighters' Association is receiving $650 million in settlement money from the City of Houston.\n\"I’m hoping for all firefighters that today is just a day of healing for the Houston Fire Department,\" said Jason Wells of the Houston Fire Department.\nThe Houston Professional Firefighter’s Association’s legal battle with the City of Houston is coming to a close.\nSUGGESTED: Houston settles 8-year firefighters’ pay dispute with agreement approval\"This is the closure of the long-waged war against Houston firefighters and their families, and today marks a day of a new era,\" said Marty Lancton, the union president of the Houston Professional Firefighters Association.", "location": "Houston, Texas", "classification": "security", "score": 0.520288198090896, "event_breakdown": "Event: Houston Firefighters Receive $650 Million Settlement\nDate: 2023-05-24\nLocation: Houston, Texas, USA\nSummary: Firefighters in Houston are set to receive a $650 million settlement after battling the city for years over fair pay."}, {"id": "7b7e6767-0a39-4b95-b907-ff170df8ca7e", "title": "Israel - Iran , Mossad , Hezbollah : Abraham Alliance vs Axis Of Resistance : Players In Israel - Iran Shadow War", "date": "2024-08-04 05:30", "url": "https://www.ndtv.com/world-news/israel-iran-mossad-hezbollah-abraham-alliance-vs-axis-of-resistance-players-in-israel-iran-shadow-war-6259187", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "In a speech to the United States Congress last month, Israel's Prime Minister Benjamin Netanyahu envisioned a new regional coalition in the Middle East, termed the \"Abraham Alliance\".\nThe Abraham AllianceThe Abraham Accords, initiated in September 2020, normalised relations between Israel and several Arab nations, including the United Arab Emirates (UAE), Bahrain, Morocco, and Sudan.\nNetanyahu's vision for the Abraham Alliance builds on these accords, seeking a coalition that could include current and future diplomatic partners of Israel.\nThese groups have engaged in longstanding conflicts with Israel, receiving financial and military support from Iran.\nTehran has provided substantial military support, including approximately 80,000 fighting personnel, to bolster Assad's forces.", "location": "WASHINGTON D.C.", "classification": "security", "score": 0.48860291729428157, "event_breakdown": "Middle East: In a speech to the United States Congress last month, Israel's Prime Minister Benjamin Netanyahu envisioned a new regional coalition in the Middle East, termed the \"Abraham Alliance\". Netanyahu's vision for the Abraham Alliance seeks to build upon the Abraham Accords, which normalised relations between Israel and several Arab nations, including the United Arab Emirates, Bahrain, Morocco, and Sudan. (Abraham Alliance)\n\nSyria: There are ongoing clashes in northwestern Syria between pro-government forces and rebel groups. This situation is the result of the Syrian government's ongoing efforts to regain control of rebel-held territories. (Syrian Government vs. Rebels)\n\nIran: The United States announced on 21st April that it was deploying bombers, aircraft carriers, and fighter jets to the Middle East in response to troubling indications about Iran's intentions. (US Deploys Aircraft Carrier In Response to Iran)\n\nSyria: On 11 April, the United States announced that they are stepping up \"lethal aid\" to the Syrian opposition amid rising tensions in the eight-year-old civil war. (US Steps Up Aid to Opposition in Syria)\n\nSyria: Russia has warned that if the US launches an attack in Syria, it could be one of the worst conflicts ever. Russia also says that if the US does launch an attack, it will shoot down any missiles fired by US-led coalition. (Major Conflict In Syria If US Attacks, Russia Warns)\n\nBahrain: The Bahrain government deployed its air and ground forces to restore the order after a large-scale attack on security forces. (Bahrain Deploys Forces to Restore Order"}, {"id": "c05a3f66-8516-41d3-b639-1f8c0a889013", "title": "  Baltic Tiger  drill tests Berlin - to - Tallinn flow of reinforcements", "date": "2024-08-04 05:45", "url": "https://www.defensenews.com/global/europe/2022/11/10/baltic-tiger-drill-tests-berlin-to-tallinn-flow-of-reinforcements/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "It was the first time the German Air Force and Navy had trained together on such missions, and outside of their own nation, officials noted.\nMembers of the Air Force’s “Friesland” airfield protection unit were deployed, providing snipers, fire support, air mobility protection and close target reconnaissance.\nA handful of U.K. Royal Air Force, Belgian Air Force, and Danish Army personnel also participated.\nAir Defender 2023, a joint aerial drill between the U.S. Air National Guard and the German Air Force, is scheduled to take place next June.\nThe German Air Force wants to use all available air bases for this exercise, Gerhartz told reporters during Baltic Tiger.", "location": "NULL", "classification": "security", "score": 0.6484712968062595, "event_breakdown": "Possible Security Events:\n- German Air Force - Baltic Tiger 2023: German Air Force and Navy conducted joint training missions outside of Germany."}, {"id": "10aa67b3-2481-4ea0-aa56-f952094227d3", "title": "Ukrainian Air Defenses Shoot Down Five Enemy Shahed Uavs Overnight", "date": "2024-08-04 06:00", "url": "https://menafn.com/1108514260/Ukrainian-Air-Defenses-Shoot-Down-Five-Enemy-Shahed-Uavs-Overnight", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The forces and means of the mobile firing groups of the Defense Forces and EW units of the Air Force of Ukraine shot down five enemy Shahed-131/136 UAVs in the Kherson, Dnipropetrovsk, Kirovohrad and Zaporizhzhia regions.\nUkrainian Air Force Commander, Lieutenant General Mykola Oleshchuk said this in a post on Telegram , Ukrinform reports.\n\"On the night of August 4, 2024, the enemy attacked the Kharkiv region with two S-300 anti-aircraft guided missiles, the Poltava region with two Kh-59 guided missiles from the airspace of the Kursk region, and launched five Shahed combat UAVs from Russia's Primorsko-Akhtarsk,\" the post says.\nshares video showing Russian fortifications, military infrastructure being destroyed near Sumy regioAs reported, Russia attacked Ukraine with combat drones.", "location": "Ukraine", "classification": "security", "score": 0.9586269720426928, "event_breakdown": "Russian military formations, which were previously defeated by the Ukrainian army. The Ministry of Defense notes that if the Russians have not left their positions, they will beKyiv Region, Ukraine - Tuesday, April 26, 2022: Two reconnaissance and attack drones - PD-1 UAVs - destroyed .pdf\nThere is no downloadable attachment in the last URL you provided. Could you please provide a different source?"}, {"id": "8e27f4be-c08f-4cd7-a4bc-177059c3ab2a", "title": "Indian Army Mulls Massive Expansion of K - 9 Vajra Fleet Amidst Evolving Threat Scenario – Indian Defence Research Wing", "date": "2024-08-04 03:00", "url": "https://idrw.org/indian-army-mulls-massive-expansion-of-k-9-vajra-fleet-amidst-evolving-threat-scenario/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Indian Army Mulls Massive Expansion of K-9 Vajra Fleet Amidst Evolving Threat Scenario| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGThe Indian Army is on the cusp of significantly bolstering its artillery firepower with the acquisition of an additional 100 K-9 Vajra self-propelled howitzers (SPH).\nHowever, the evolving geopolitical landscape, particularly the ongoing conflict in Ukraine, has prompted the Army to reassess its artillery requirements.\nThe increasing emphasis on mobility and survivability on the modern battlefield has led to a potential surge in demand for self-propelled artillery systems.\nConsequently, the Army is now contemplating an even more ambitious target of procuring up to 400 K-9 Vajra SPHs, necessitating an additional order of 200 units.\nThe initial batch of K-9 Vajra SPHs was optimized for desert warfare, primarily targeting the western border with Pakistan.", "location": "EAST RUTHERFORD, NEW JERSEY", "classification": "security", "score": 0.6263136856213153, "event_breakdown": "Indian Army Mulls Massive Expansion of K-9 Vajra Fleet Amidst Evolving Threat Scenario\nThe Indian Army is on the cusp of significantly bolstering its artillery firepower with the acquisition of an additional 100 K-9 Vajra self-propelled howitzers (SPH).\n1. India: The Indian Army is contemplating acquiring 400 K-9 Vajra self-propelled howitzers (SPHs) at an estimated cost of Rs 19,000 crore to tackle evolving threat scenarios.\n2. Indian Army (India): In the context of ongoing conflict in Ukraine and changing geopolitical conditions, the Indian"}, {"id": "1b9dadbc-0591-4ca2-8efe-5abf13652a2b", "title": "Hamas to shoulder blame for no progress on Gaza deal Netanyahu office adviser - World", "date": "2024-08-04 02:30", "url": "https://tass.com/world/1824993", "domain": "tass.com", "domain_classification": "Unknown", "message": "The radical movement Hamas should be blamed that the Cairo talks on a Gaza deal are not making progress, as Israel has not put forward any new demands, Dmitry Gendelman, an adviser to Israeli Prime Minister Benjamin Netanyahu’s office, told TASS.\nThe lack of progress is solely because of Hamas,\" he said.\n\"Those who suggest giving in to Hamas’ demands in order to get applause in the studios are reducing the chances of the hostages’ release,\" the office said.\nThe plan envisages a complete ceasefire and the release of Israeli hostages held by Hamas in exchange for the release of hundreds of Palestinian inmates from Israeli prisons.\nIn response, Israel launched a military operation in Gaza to eradicate Hamas’ military and political structure and to release all the hostages.", "location": "GAZA", "classification": "security", "score": 0.6847448754114105, "event_breakdown": "1. Cairo talks on a Gaza deal made slow progress.\nHamas was blamed by Israel for this lack of progression."}, {"id": "912079bc-6a30-4242-9512-707e37ae86c5", "title": "Agent Zo : The woman who parachuted into Nazi - occupied Poland", "date": "2024-08-04 00:00", "url": "https://www.bbc.com/news/articles/cneej0r2n7go", "domain": "bbc.com", "domain_classification": "International", "message": "So who was the woman who went by the name of Zo, and what inspired her to acts of such defiance and bravery?\n\"It's really ironic,\" says Clare Mulley, historian and author of a new book, Agent Zo.\nAt one point, Mulley says, Zo leapt from the door of a moving train to evade an officer who had joined her in the carriage.\nFor Polish war hero Kazimierz Bilski, there was one thing for it.\nThe government-in-exile \"just can't believe that women should be given military legal status\", Mulley explains, and Zo was branded \"an insane feminist\".", "location": "LONDON", "classification": "security", "score": 0.6338953802189858, "event_breakdown": "Event 1: Clare Mulley, historian and author of a new book, Agent Zo, says Zo leapt from the door of a moving train to evade an officer who had joined her in the carriage.\nLocation: Poland\nTarget Event: Clare Mulley, historian and author of a new book, Agent Zo, talks about Zo leaping from the door of a moving train to evade an officer."}, {"id": "8cfe5b2e-2bce-4da6-be4d-3ab9c8e30d87", "title": "Economic aftershocks of war on Gaza felt across region experts", "date": "2024-08-04 02:30", "url": "http://jordantimes.com/news/local/economic-aftershocks-war-gaza-felt-across-region-%E2%80%94-experts", "domain": "jordantimes.com", "domain_classification": "Unknown", "message": "“Though not over, the war on Gaza has, to differing degrees, impacted several economies in the Arab region.\n“The postwar needs of the Gaza Strip will be enormous: All universities are destroyed, most hospitals are severely damaged, etc.\nAlso, the war on Gaza necessitates extraordinary efforts at rebuilding and the reconstruction would be much larger than for most other recent disasters,” Khouri added.\nKhouri also said that countries mostly affected by the war are Jordan, Egypt, Lebanon and the West Bank.\nKhoury also that the war on Gaza has had significant impacts on Jordan and the broader regional economy, affecting multiple sectors and exacerbating existing economic challenges.", "location": "GAZA STRIP", "classification": "security", "score": 0.48678694580178394, "event_breakdown": "Target event:\nThe current event of security reported in text that can be placed on a map is:\nThe war on Gaza has had significant impacts on Jordan and the broader regional economy, affecting multiple sectors and exacerbating existing economic challenges."}, {"id": "29b30fc1-60e1-4a7d-9021-16b2b676794a", "title": "Hezbollah fires dozens of rockets at Israel as full - blown war fears explode", "date": "2024-08-04 08:45", "url": "https://www.express.co.uk/news/world/1931818/hezbollah-fires-rockets-israel", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "The IDF said 'most' of the missiles were intercepted by Israel's Iron Dome defence system.\nHezbollah says it's fired “dozens” of rockets from Lebanon amid fears a full-blown war could break out between the two countries.\nIsrael had been bracing for a response from Iran and its proxies after the killing of Hamas’s political leader in Tehran.\nIsraeli media now reports that 50 rockets have been launched from southern Lebanon in the direction of upper Galilee alone.\nDramatic video showed Israel's Iron Dome air defence system being triggered to take out the incoming rockets, with the Israel Defence Forces (IDF) confiming that \"most\" of the 30 \"projectiles\" sent towards Israel on Satuday night were intercepted.", "location": "Galilee", "classification": "security", "score": 0.7173580198720859, "event_breakdown": "Event 1: Hezbollah fires 'dozens' of rockets from Lebanon towards Israel\nEvent 2: 50 rockets are launched from southern Lebanon in the direction of upper Galilee\nEvent 3: Iron Dome air defence system is triggered by incoming rockets from Lebanon\nEvent 4: IDF confirms that \"most\" of the 30 \"projectiles\" sent from Lebanon towards Israel on Saturday were intercepted"}, {"id": "a39ef67d-756b-4fd7-9712-1dbf2bedaa7f", "title": "15 Killed In Israeli Airstrike On Gaza School Being Used As Shelter", "date": "2024-08-04 08:45", "url": "https://www.ndtv.com/world-news/15-killed-in-israeli-airstrike-on-gaza-school-being-used-as-shelter-6259495", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "In the Gaza Strip, at least 15 people were killed in the Israeli strike on a school.\nGAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nEgypt's foreign minister, Badr Abdelatty, stressed in a phone call with Iran's acting foreign minister, Ali Bagheri Kani, that recent developments in the region were \"unprecedented, very dangerous\" and threatening to stability, Egypt's government said.", "location": "GAZA STRIP", "classification": "security", "score": 0.9691087392066503, "event_breakdown": "GAZA STRIP:\nAt least 15 people were killed in the Israeli strike on a school."}, {"id": "955c65cb-309b-42c7-9965-34576236d87d", "title": "Haniyeh assassination gambit", "date": "2024-08-04 07:15", "url": "https://tribune.com.pk/story/2485294/haniyeh-assassination-gambit", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Hamas and Iranian officials blamed Israel, but the government of Prime Minister Benjamin Netanyahu did not comment on the assassination.\nThe US has claimed that it was “not involved in, or aware of” the assassination of Ismail Haniyeh, who it had designated as a global terrorist.\nBy killing Haniyeh, Israel has all but killed the hopes for a negotiated end to its brutal military campaign in the Gaza Strip.\nBy targeting Haniyeh in Tehran, Israel sought to humiliate the Islamic Republic and convey a message to the “Axis” leaders that they are not safe even in their safest sanctuary.\nHaniyeh’s assassination in a high security zone in the heart of capital Tehran has already exposed chinks in Iran’s armoury.", "location": "Tehran, Iran", "classification": "security", "score": 0.8847816198668045, "event_breakdown": "US denies involvement in Israeli assassination of Ismail Haniyeh in Tehran."}, {"id": "a6bc7dd3-a3f7-4c82-9345-d892e9a3fd68", "title": "US urges citizens to leave Lebanon on  any available ticket  - International", "date": "2024-08-04 07:00", "url": "https://www.dailymirror.lk/international/US-urges-citizens-to-leave-Lebanon-on-any-available-ticket/107-288716", "domain": "dailymirror.lk", "domain_classification": "Unknown", "message": "BBC - The US embassy in Beirut has urged its citizens to leave Lebanon on “any ticket available”, amid soaring tensions in the Middle East.\nJordan's Foreign Ministry has also issued advice to its citizens, telling those in Lebanon to leave immediately and warning others not to travel there.\nIt said that several airlines have suspended and cancelled flights, and many have sold out, but “commercial transportation options to leave Lebanon remain available\".\nThe UK said it was sending extra military personnel, consular staff and border force officials to help with any evacuations - but urged UK citizens to leave Lebanon “while commercial flights are running\".\nMany fear Iran’s retaliation on this occasion could take a similar form.", "location": "Lebanon", "classification": "security", "score": 0.48063112953584075, "event_breakdown": "Location: Beirut, Lebanon\nThe US embassy in Beirut has urged its citizens to leave immediately on ‘any ticket available'.\nLocation: Lebanon\nJordan's Foreign Ministry has urged its citizens to leave and warned others not to travel there"}, {"id": "41b77fea-e2a8-43cd-9f1b-731387f8db68", "title": "What Does An All - out War Between Israel And Hezbollah Mean For Middle East ? What Are The Risks ? ", "date": "2024-08-04 07:00", "url": "https://www.news18.com/explainers/what-does-an-all-out-war-between-israel-and-hezbollah-mean-for-middle-east-what-are-the-risks-8989605.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "On Saturday, Hezbollah said it launched dozens of rockets on Moshav Beit Hillel in Israel injuring civilians there, The Times of Israel reported.\nMore than 400 people have been killed in Lebanon and 30 have been killed in Israel, as per a report by The Conversation.\nResident of Haifa in the north of Israel fear Hezbollah attacks, while people living in south Lebanon fear IDF attacks.\nAlso, Israel is the only country in the Middle East with nuclear power, which it does not acknowledge.\nIran could launch missile or armed drone strikes against Israeli military sites or infrastructure.", "location": "LEBANON", "classification": "security", "score": 0.8994425255353685, "event_breakdown": "Event 1: Hezbollah launches rockets on Moshav Beit Hillel, Israel on Saturday, injuring civilians\nEvent 2:  IDF attacks in south Lebanon\nEvent 3:  IDF attacks on targets in Lebanon\nEvent 4:  IDF attacks on targets in Syria"}, {"id": "1c085c5f-481e-4843-80ec-d0e35c289507", "title": "Israeli strikes kill 15 Palestinians in Gaza school , nine fighters in West Bank", "date": "2024-08-04 06:45", "url": "https://dunyanews.tv/en/World/828535-israeli-strikes-kill-15-palestinians-in-gaza-school-nine-fighters-in-", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Israeli strikes kill 15 Palestinians in Gaza school, nine fighters in West BankWorld World Israeli strikes kill 15 Palestinians in Gaza school, nine fighters in West BankThe school is sheltering displaced people in Gaza City's Sheikh Radwan neighbourhood, the Hamas saidFollow on Published On: Sun, 04 Aug 2024 09:36:31 PKTCAIRO/RAMALLAH (Reuters) – An Israeli airstrike on a school sheltering displaced people in Gaza City killed at least 15 Palestinians on Saturday, hours after two strikes in the occupied West Bank killed nine fighters, including a local Hamas commander, Hamas said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide fighters and manufacture weapons.\nEarlier on Saturday, Israeli strikes in the enclave killed six people in a house in the southern area of Rafah and two others in Gaza City, Gaza health officials said.\nThe Israeli military said its forces had struck and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "location": "GAZA CITY", "classification": "security", "score": 0.9710147042207302, "event_breakdown": "Israeli strikes kill 15 Palestinians in Gaza school on Saturday, August 4\nIsraeli strikes kill nine fighters in the occupied West Bank on Saturday, August 4\nIsraeli airstrikes on a house in the southern area of Rafah and two others in Gaza City, killing six people, on August 4"}, {"id": "20ad26ff-e460-40b7-a159-8040da737705", "title": "Israeli strikes kill 15 Palestinians in Gaza school , nine West Bank militants", "date": "2024-08-04 06:45", "url": "https://www.thestandard.com.hk/breaking-news/section/6/219045/Israeli-strikes-kill-15-Palestinians-in-Gaza-school,-nine-West-Bank-militants", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "Palestinians inspect the site of Israeli strikes on a school sheltering displaced people, amid Israel-Hamas conflict, in Gaza City, August 3, 2024.\n(Reuters)An Israeli airstrike on a school sheltering displaced persons in Gaza City killed at least 15 Palestinians on Saturday, hours after two strikes in the occupied West Bank killed nine militants including a local Hamas commander, Hamas said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "location": "GAZA CITY", "classification": "security", "score": 0.9861110179685596, "event_breakdown": "New event: On August 3, 2024, Israeli airstrikes on a school sheltering displaced persons in Gaza City killed at least 15 Palestinians, after strikes in the occupied West Bank killed nine militants including a local Hamas commander."}, {"id": "ee1f63ba-1c29-4723-8174-81c0554e98fc", "title": "15 Displaced Civilians Killed In Israeli Strike On Gaza School", "date": "2024-08-04 08:45", "url": "https://menafn.com/1108514432/15-Displaced-Civilians-Killed-In-Israeli-Strike-On-Gaza-School", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) An Israeli on a school sheltering displaced persons in Gaza City killed at least 15 Palestinians yesterday, hours after two strikes in the occupied West killed nine, Palestinian resistance movement Hamas said.\nThe Israeli military said the first of two West Bank hit a vehicle in a town near the city of Tulkarm.\nIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nEarlier yesterday, Israeli strikes in the enclave killed six people in a house in the southern area of Rafah and two others in Gaza City, Gaza health officials said.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "location": "GAZA CITY.", "classification": "security", "score": 0.9912270699997194, "event_breakdown": "Event 1: A school sheltering displaced persons in Gaza City was hit by an Israeli military strike, killing at least 15 Palestinians, according to the Hamas government media office."}, {"id": "74ca6581-1065-4fd1-96ea-64188d8dddeb", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 02:30", "url": "https://www.yahoo.com/news/suspected-missile-attack-yemens-houthi-015345114.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.9714136902752326, "event_breakdown": "1. DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities reported Sunday, likely the first assault by the group since Israeli airstrikes targeted them there.\n2. The U.S. Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\n3. The attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously. The rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\n4. Meanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\n5. The attack took place as Israeli warplanes targeted a ballistic missile launcher in Al Jawf, Yemen, a few miles from the border of Saudi Arabia. The IDF said its strikes thwarted the Iranian attack in parallel with two others by Palestinian militant groups Hamas and Islamic Jihad."}, {"id": "908152fd-8e7d-4cfa-b98c-15308236df03", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 07:15", "url": "https://finance.yahoo.com/news/suspected-missile-attack-yemens-houthi-015345143.html", "domain": "finance.yahoo.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.", "location": "YEMEN", "classification": "security", "score": 0.9714136902752326, "event_breakdown": "Dubai, United Arab Emirates (AP) - A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the gulf, Yemeni authorities said Sunday. The incident was the first attack since Israeli airstrikes targeted the group.\nThe attack on the ship Saturday occurred off the coast of Aden in the Gulf of Aden. The area has seen multiple Houthis attacks in previous years.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in thier broadside that have killed four sailors."}, {"id": "3e56bb48-1566-4a30-b583-495339dcf69f", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 04:30", "url": "https://www.moneycontrol.com/news/world/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks-12786316.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "associated byFollow us on:Suspected missile attack by Yemen's Houthi rebels hits container ship in first attack in 2 weeks", "location": "NULL", "classification": "security", "score": 0.8755667277070212, "event_breakdown": "The following current events reported in text that can be placed on a map have been identified:\n\n1. Suspected missile attack by Yemen's Houthi rebels hits container ship in first attack in 2 weeks. Location: Red Sea.\n\nThese recent events have been reported in the media and can be plotted on a map."}, {"id": "5f99bcd0-9d8d-4e3d-aebb-8fd671c1e615", "title": "Fears of Middle East war grow", "date": "2024-08-04 07:00", "url": "https://www.omanobserver.om/article/1157160/world/region/fears-of-middle-east-war-grow", "domain": "omanobserver.om", "domain_classification": "Unknown", "message": "Beirut - Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Hamas in Gaza.\nIsrael, accused by Hamas, Iran and others of carrying out the attack, has not directly commented on it.\nIran said on Saturday it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.", "location": "BEIRUT", "classification": "security", "score": 0.8461282471681383, "event_breakdown": "Events:\nSecurity Tensions escalate in Beirut as Iran and allies prepare their response to the assassination of the Hamas leader.\nSecurity Israel is accused of killing Hamas leader amidst culmination of a near 10 month Israel-Hamas war.\nSecurity The Pentagon bolsters military presence in the Middle-East to protect US personnel and defend Israel."}, {"id": "3024b1df-baf7-4c1e-a195-9bbef43a2ed4", "title": "Fears Of Middle East War Grow After Haniyeh Killing", "date": "2024-08-04 08:45", "url": "https://menafn.com/1108514431/Fears-Of-Middle-East-War-Grow-After-Haniyehs-Killing", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) Middle East tensions soared yesterday as Iran and its allies readied their response to the assassination of Hamas's leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Palestinian group Hamas.\nIran said it expects Hezbollah to hit deeper inside Israel and to no longer be confined to military targets.\nWith such talk growing, the Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nThe New York Times, citing unnamed sources, reported that the explosion which killed Haniyeh was a bomb that was covertly smuggled into the guesthouse where he was staying in Tehran two months ago.", "location": "Tehran, Iran.", "classification": "security", "score": 0.8039781714883953, "event_breakdown": "Middle East tensions soared yesterday as Iran and its allies readied their response to the assassination of Hamas's leader, blamed on Israel, spurring fears of a regional war."}, {"id": "6e2b820c-cacd-44e2-bdf3-049a5fd0e767", "title": "Blinken Says U . S . not responsible for Haniyeh killing ; That Too Bad", "date": "2024-08-04 09:00", "url": "https://www.israelnationalnews.com/news/394057", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Secretary of State Antony Blinken denied any American responsibility for the assassination of Hamas political chief Ismail Haniyeh.\nDon't Fear Assassinating TerroristsNor should assassinating terror leaders be something from which the United States shies away.\nIf any explanation is due, it should be whether or not the United States had the intelligence that Israelis did.\nBlinken's statement that the United States was not responsible for Haniyeh's death was truly cringe-worthy, an expression of weakness that further diminishes the United States in the eyes of its enemies.\nThe only unfortunate aspect of Haniyeh's demise was that Israel beat the United States to it.", "location": "-\nGaza", "classification": "security", "score": 0.770956215239308, "event_breakdown": "Target Event: Assassination of Ismail Haniyeh\nEvent:  Hamas political chief Ismail Haniyeh was assassinated.\nEvent:  Palestinians blame Israel for the assassination.\nEvent:  However, Israel has not admitted responsibility for the assassination.\nEvent:  The United States denies any American responsibility for the assassination of Ismail Haniyeh."}, {"id": "09e7f8ec-76c7-4d9c-a943-3ef677d24c06", "title": "Strikes on Gaza kill 12 , stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 08:45", "url": "https://www.voanews.com/a/strikes-on-gaza-kill-12-and-stabbing-in-israel-kills-2-as-fears-of-wider-war-spike/7729191.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.859497134748717, "event_breakdown": "-Israeli air strikes killed no civilians in the Gaza Strip overnight, a Palestinian journalist said on Tuesday, in the first such attack since a four-day truce in the Israeli-Gaza war last week.\n-Arab protesters clashed with Israeli police in Jerusalem in the early hours of Tuesday morning, in a continuation of a protest wave over access to a sensitive holy site sacred to both Muslims and Jews.\n-Israeli warplanes bombed multiple targets in Gaza early Monday in response to rocket fire from the enclave, the Israeli military and witnesses said, in the first flare-up since a ceasefire reached last Thursday."}, {"id": "0ad51541-2775-40c7-a026-f35d8e8b6b6e", "title": "Strikes on Gaza kill 12 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 08:30", "url": "https://www.theweek.in/wire-updates/international/2024/08/04/fgn13-israel-hamas-war.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.859497134748717, "event_breakdown": "Gaza, Israel, Lebanon, Iran, West Bank"}, {"id": "722a8b2d-8169-4822-99a2-8bbd5edb09d6", "title": "Woman in 70s killed , 3 injured in a stabbing attack in Israel", "date": "2024-08-04 07:30", "url": "https://www.firstpost.com/world/woman-in-70s-killed-3-injured-in-a-stabbing-attack-in-israel-13800666.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Israel’s Magen David Adom rescue service later confirmed that the woman had died read moreIsraeli police and medics say a woman in her 70s was killed and three other people were wounded in a stabbing attack in a suburb of Tel Aviv.\nThe police said the attacker was a resident of the West Bank, suggesting that Sunday’s attack was carried out by a Palestinian militant.\nAdvertisementTensions have soared across the region since Hamas’ Oct. 7 attack ignited the war in Gaza last year.\nIsrael’s Magen David Adom rescue service later confirmed that the woman had died.\nIt said a 70-year-old man was in critical condition, a 68-year-old man was in severe condition and a 26-year-old man was in moderate condition.", "location": "BEIT SHEMESH", "classification": "security", "score": 0.7648872144049139, "event_breakdown": "Israel: Woman Killed in Suburb Stabbing Attack \nPolice say the person stabbed was a West Bank resident, suggesting a Palestinian militant was behind the stabbing."}, {"id": "41f6228f-25fc-4d63-aa91-4d98d05833ec", "title": "A woman was killed and 3 others were wounded in a stabbing attack in Israel", "date": "2024-08-04 07:00", "url": "https://abcnews.go.com/International/wireStory/woman-killed-3-wounded-stabbing-attack-israel-112550718", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nThe continuous strikes and counterstrikes have grown in severity in recent months, raising fears of an even more destructive regional war.", "location": "GAZA", "classification": "security", "score": 0.6507289948609891, "event_breakdown": "Hamas leads attacks on Israel\nPalestinian militants kill civilians in Israel"}, {"id": "18c9ebfc-5043-4cc7-9447-9f4b1a125378", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 08:45", "url": "https://www.swindonadvertiser.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "swindonadvertiser.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nA separate strike flattened a house in northern Gaza, killing at least eight people, including three children, their parents and their grandmother, according to the ministry.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9588933729931158, "event_breakdown": "1. Tensions have soared after nearly 10 months of war in Gaza.\n2. Two senior militants were killed in separate strikes in Lebanon and Iran last week.\n3. A woman in her 70s and an 80-year-old man were killed in a stabbing attack in Israel on Tuesday.\n4. The house was flattened in the northern Gaza by a seperate strike, killing at least eight people."}, {"id": "b48860ba-5f35-4a2f-9cfa-b88897aac33d", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 07:15", "url": "https://timesofmalta.com/article/fears-middle-east-war-grow-hamas-leader-killing.1096297", "domain": "timesofmalta.com", "domain_classification": "Unknown", "message": "Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and the Palestinian militant group Hamas in Gaza.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nHis death came hours after Israel struck south Beirut, killing Hezbollah military commander Fuad Shukr.\nHezbollah has been exchanging near-daily cross-border fire with Israeli forces since October, saying it is acting in support of Hamas.", "location": "GAZA", "classification": "security", "score": 0.9161562274162744, "event_breakdown": "1.\"Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel, spurring fears of a regional war.\"Location: Middle East\nEvent: Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel.Spurred fears: Fears of a regional war.\n2.\"The Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\"Location: Middle East\nEvent: The Pentagon is bolstering its military presence in the Middle East.Purpose: To protect US personnel and defend Israel."}, {"id": "51a1dd8c-8ab9-4710-8535-fa3e1e4ac602", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 08:30", "url": "https://www.oxfordmail.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nA separate strike flattened a house in northern Gaza, killing at least eight people, including three children, their parents and their grandmother, according to the ministry.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9588933729931158, "event_breakdown": "Israel - A 19-year-old Palestinian stabbed and wounded two Israelis in a West Bank settlement on Wednesday before being shot dead by security forces, the Israeli military said. The attack took place near the entrance to a mall in the Israeli settlement of Ariel, about 25 kilometers (15 miles) east of the city of Nablus in the northern West Bank.\nEgypt - Egyptian officials say three roadside bombs hit a military police convoy near Egypt's border with the Gaza Strip, wounding 10 soldiers. The military said the attack Tuesday took place in the town of al-Arish. The area, in the northern Sinai Peninsula, is a stronghold of an Islamic State-led insurgency. Iraq - A triple suicide bombing in a market south of Baghdad has killed at least 30 people. Authorities say at least 50 others were wounded in the attack Wednesday morning. The spike in violence has been growing since the Islamic State group was largely defeated in Iraq in 2017. Local elections for senior leadership positions are underway and so far turnout has been low.\nA 19-year-old Palestinian stabbed and wounded two Israelis in a West Bank settlement on Wednesday before being shot dead by security forces. The attack took place near the entrance to a mall in the Israeli settlement of Ariel, about 25 kilometers (15 miles) east of the city of Nablus in the northern West Bank.\n\nThree roadside bombs hit an Egyptian military police convoy near Egypt's border with the Gaza Strip on Tuesday, wounding 10 soldiers. The triple suicide bombing in a market south of Baghdad killed at least 30 people. The surge in violence has been growing since the Islamic State group was largely defeated in Iraq in 2017."}, {"id": "a1ec329f-03ad-48d8-98d6-0fd03fead3d3", "title": "US Introducing F - 22 Raptors to Challenge Iran Terror Axis in the Middle East | The Jewish Press - JewishPress . com | David Israel | 29 Tammuz 5784 – Sunday , August 4 , 2024", "date": "2024-08-04 07:00", "url": "https://www.jewishpress.com/news/us-news/us-introducing-f-22-raptors-to-challenge-iran-terror-axis-in-the-middle-east/2024/08/04/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: Air Force Tech.\nAnthony NelsonOn Friday, Defense Secretary Lloyd J. Austin III ordered an increase in military presence in the Middle East.\nThe Pentagon announced that additional combat aircraft and missile-equipped warships will be deployed to the region.\nEven with the arrival of the more recent F-35 Lightning II, the F-22 Raptor continues to be a dominant force in air-superiority missions.\nIts cutting-edge sensors and robust combat capabilities have maintained its status as a top-tier fighter jet.", "location": "NULL", "classification": "security", "score": 0.4733620872494137, "event_breakdown": "Middle East: Defense Secretary Lloyd J. Austin III ordered an increase in military presence in the Middle East on Friday. The Pentagon announced that additional combat aircraft and missile-equipped warships will be deployed to the region."}, {"id": "38f15439-9f1a-4a87-a7a7-24e4a1090ba7", "title": "Air Force commander : Ukraine destroys over 8 , 000 Russian air targets since Feb . 24 , 2022", "date": "2024-08-04 08:30", "url": "https://www.yahoo.com/news/air-force-commander-ukraine-destroys-080447699.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Ukrainian Air Force has destroyed over 8,000 Russian air targets since the start of the full-scale invasion in February 2022, Air Force Commander Mykola Oleshchuk reported on Aug. 4.\n\"In two and a half years, the Air Force has destroyed over 8,000 enemy air targets: hundreds of airplanes and helicopters, thousands of cruise missiles and drones.\nIn his statement, Oleshchuk also congratulated Ukrainian soldiers on the national Air Force Day, marked on the first Sunday of August in Ukraine.\n\"During the full-scale invasion, for their personal courage and dedication demonstrated in defending the state sovereignty and territorial integrity of Ukraine, 4,475 Air Force servicemen have been awarded state honors.\nRead also: Russia’s Su-57 – hype vs. reality\"The Air Force, shoulder to shoulder with the air defense of all the Defense Forces of Ukraine, repels the attacks.", "location": "Ukraine", "classification": "security", "score": 0.7371410968910493, "event_breakdown": "The Ukrainian Air Force has destroyed over 8,000 Russian air targets since the start of the full-scale invasion in February 2022, Air Force Commander Mykola Oleshchuk reported on Aug. 4.\nIn his statement, Oleshchuk also congratulated Ukrainian soldiers on the national Air Force Day, marked on the first Sunday of August in Ukraine."}, {"id": "1d7be1b7-251f-4bdb-9abc-8fbb1c0b0c53", "title": "Russia loses 1 , 150 soldiers , five tanks and 59 artillery systems", "date": "2024-08-04 07:00", "url": "https://www.yahoo.com/news/russia-loses-1-150-soldiers-045050099.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Stock photo: General Staff of the Armed Forces of UkraineRussia has lost 1,150 soldiers, five tanks and 59 artillery systems in the war against Ukraine over the past day.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 4 August 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 582,910 (+1,150) military personnel;8,411 (+5) tanks;16,255 (+17) armoured combat vehicles;16,276 (+59) artillery systems;1,138 (+3) multiple-launch rocket systems;911 (+3) air defence systems;363 (+0) fixed-wing aircraft;326 (+0) helicopters;13,103 (+41) strategic and tactical UAVs;2,412 (+2) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;22,006 (+80) vehicles and tankers;2,734 (+11) special vehicles and other equipment.\nSupport UP or become our patron!", "location": ")\nThe main event described in the text takes place at various locations in Ukraine, including Kyiv and other areas. As the main focus", "classification": "security", "score": 0.8466613122433476, "event_breakdown": "Russia has lost 1,150 soldiers, five tanks and 59 artillery systems in the war against Ukraine over the past day."}, {"id": "596ab756-9d27-484b-ad7e-d8d003738cf7", "title": "Russia attacks Ukraine with 4 missiles and 5 UAVs overnight : Ukrainian defenders destroy all drones", "date": "2024-08-04 07:00", "url": "https://www.yahoo.com/news/russia-attacks-ukraine-4-missiles-041440518.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces targeted Ukraine with four missiles and five attack UAVs on the night of 3-4 August.\nUkrainian air defence units shot down all Russian drones.\nQuote: \"On the night of 3-4 August 2024, the enemy launched two S-300 anti-aircraft missiles on Kharkiv Oblast, two Kh-59 [air-to-surface] missiles on Poltava Oblast from the airspace of Kursk Oblast [Russia] and five Shahed attack drones from the area of [the city of] Primorsko-Akhtarsk, Russia.\"\nDetails: Oleshchuk noted that five Shahed-131/136 UAVs had been shot down by military assets and personnel from mobile firing groups of Ukraine's defence forces and electronic warfare units of the Air Force in Kherson, Dnipropetrovsk, Kirovohrad and Zaporizhzhia oblasts.\nSupport UP or become our patron!", "location": "Ukraine", "classification": "security", "score": 0.9721126299392395, "event_breakdown": "Target event: On 4 August 2024, Russian forces targeted Ukraine with four missiles and five attack UAVs. Ukrainian air defence units shot down all Russian drones."}, {"id": "3510a478-9730-4ae2-9b7f-762c525e72df", "title": "Israel - Iran war looms over Mideast : Will  Abraham Alliance  face off against  Axis of Resistance ? ", "date": "2024-08-04 07:15", "url": "https://economictimes.indiatimes.com/news/defence/israel-iran-war-looms-over-mideast-will-abraham-alliance-face-off-against-axis-of-resistance/articleshow/112260529.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "What is Abraham Alliance?\nThis proposal seeks to build on the Abraham Accords, normalisation agreements brokered during the Trump administration between Israel and several Arab states.Netanyahu introduced the Abraham Alliance as a response to recent coordinated actions against Iranian aggression.\n\"This alliance would be a natural extension of the Abraham Accords,\" Netanyahu stated.\n\"Iran and several allied groups, known collectively as the \"axis of resistance,\" have supported Hamas since the group launched its October 7 attack on Israel.\nHezbollah, or \"Party of God\" in Arabic, was established during Lebanon's civil war from 1975-1990 after Israel invaded Beirut in 1982.", "location": "Israel", "classification": "security", "score": 0.6056507855969613, "event_breakdown": "1. October 7 attack on Israel\n2. Iranian aggression"}, {"id": "5e598053-29c1-40a5-b831-d6c5a3b8c778", "title": "Putin willingness to hand over weapons to Houthis is way to divert Western support for Ukraine – ISW", "date": "2024-08-04 07:00", "url": "https://www.yahoo.com/news/putins-willingness-hand-over-weapons-005630922.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Putin's willingness to hand over weapons to Houthis is way to divert Western support for Ukraine – ISWResearchers at the Institute for the Study of War (ISW) have indicated that Russia’s willingness to supply weapons to the Yemeni Houthis reveals President Vladimir Putin’s strategy to compel the West to retract its support for Ukraine.\nThis move also underscores Russia’s reliance on Iran for precision weapons and components.\nCNN sources disclosed that at least three Russian military officers visited Yemen in late July 2024, possibly to advise the Houthis and assist them in live-fire exercises, which were later cancelled by the Houthis.\nPutin's willingness to consider supporting the Houthis as they attack Israel and international shipping is part of deepening Russian-Iranian military cooperation and Russia's increasing reliance on Iran for high-precision weapons and components.\nRussian authorities continue efforts to financially incentivize Russian military service in Ukraine.", "location": "MOSCOW", "classification": "security", "score": 0.6325314538707701, "event_breakdown": "New War: Russia attacks Ukraine with support of Iran\nOn February 24, 2022, Russia attacked Ukraine. Putin has been shoring up support for the attack, and Iran has been at the forefront of those actions. Russia has reportedly been buying oil and gas from Iran, and has reportedly shipped precision weapons and components from Iran, which means that they’re going to use that equipment during Putin’s assault on Ukraine. In response, The West has not only deployed more weapons and is defending Ukraine with extreme prejudice."}, {"id": "65306d33-8fe5-488c-a04e-26c859261738", "title": "Russian Army Loses 1 , 150 More Soldiers In Ukraine Over Past Day", "date": "2024-08-04 06:45", "url": "https://menafn.com/1108514309/Russian-Army-Loses-1150-More-Soldiers-In-Ukraine-Over-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The Russian army's combat losses in Ukraine from February 24, 2022 to August 4, 2024 amount to nearly 582,910 invaders, including another 1,150 killed or wounded in action in the past day.\nThe General Staff of the of Ukraine said this in a post on , according to Ukrinform.\nThe Ukrainian defenders have also destroyed 8,411 enemy tanks (+5 in the past day), 16,255 armored combat vehicles (+17), 16,276 artillery systems (+59), 1,138 multiple launch rocket systems (+3), 911 air defense systems (+3), 363 aircraft, 326 helicopters, 13,103 unmanned aerial vehicles (+41), 2,412 cruise missiles (+2), 28 warships/cutters, 1 submarine, 22,006 motor vehicles (+80), and 2,734 special equipment units (+11).\nAs reported by Ukrinform, the Ukrainian air defenses shot down five enemy Shahed-131/136 UAVs over the Kherson, Dnipropetrovsk, Kirovohrad and Zaporizhzhia regions.", "location": "Ukraine", "classification": "security", "score": 0.6956705833653919, "event_breakdown": "The Russian army's combat losses in Ukraine from February 24, 2022 to August 4, 2024 amount to nearly 582,910 invaders, including another 1,150 killed or wounded in action in the past day.\n\nThe Ukrainian defenders have also destroyed 8,411 enemy tanks (+5 in the past day), 16,255 armored combat vehicles (+17), 16,276 artillery systems (+59), 1,138 multiple launch rocket systems (+3), 911 air defense systems (+3), 363 aircraft, 326 helicopters, 13,103 unmanned aerial vehicles (+41), 2,412 cruise missiles (+2), 28 warships/cutters, 1 submarine, 22,006 motor vehicles (+80), and 2,734 special equipment units (+11).\n\nThe Ukrainian air defenses shot down five enemy Shahed-131/136 UAVs over the Kherson, Dnipropetrovsk, Kirovohrad and Zaporizhzhia regions."}, {"id": "fb8b732d-1181-4486-8cd4-ab405aa5e8a8", "title": "IDF soldier seriously wounded in combat in southern Gaza", "date": "2024-08-04 07:00", "url": "https://www.jpost.com/breaking-news/article-813152", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "An IDF soldier was wounded seriously in combat in the southern Gaza Strip on Saturday, the military said on Sunday morning.\nThe soldier belonged to the 9th Battalion in the Armored Corps.\nHe was transferred to the hospital for further medical treatment, the IDF added.", "location": "Gaza", "classification": "security", "score": 0.7857401741081365, "event_breakdown": "Relevant events:\nAn IDF soldier was wounded seriously in combat in the southern Gaza Strip on Saturday, the military said on Sunday morning."}, {"id": "b313117f-3047-44c9-9707-32b1316ea2a2", "title": "BERNAMA - Govt Must Address Uncontrolled Vaping Among School Students", "date": "2024-08-04 08:30", "url": "https://www.bernama.com/en/general/news.php?id=2325294", "domain": "bernama.com", "domain_classification": "Unknown", "message": "KUALA LUMPUR, Aug 4 (Bernama) -- Alliance for a Safe Community chairman Tan Sri Lee Lam Thye has called on the government to address the issue of uncontrolled vaping among school students with urgency.\nLee emphasised the need for nationwide school initiatives to combat vaping through awareness campaigns and concrete actions.\nHe expressed concern over recent reports of students vaping in school toilets and unused classroomsbootstrap slideshow “In a recent incident, six students at a secondary school in Selangor were found vomiting after sharing a vape.\nbootstrap slideshow He urged school authorities and students to support the Education Ministry's efforts to combat vaping, emphasising the effectiveness of peer-to-peer education programmes, where students who have quit vaping share their experiences.\nLee stressed the importance of involving parents and guardians in informational sessions to shape children’s attitudes and behaviors towards vaping.", "location": "Selangor", "classification": "security", "score": 0.45766176745450937, "event_breakdown": "Location: Kuala Lumpur, Malaysia\nEvent: Alliance for a Safe Community chairman Tan Sri Lee Lam Thye has called on the government to address the issue of uncontrolled vaping among school students with urgency. Lee emphasized the need for nationwide school initiatives to combat vaping through awareness campaigns and concrete actions."}, {"id": "d9bda593-9462-4075-8c9d-8e9de19c9163", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González", "date": "2024-08-04 07:45", "url": "https://www.houstonpublicmedia.org/npr/2024/08/04/g-s1-15275/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalez/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "Pablo González, a journalist from Spain who had been based in Poland, was freed in the largest prisoner swap since the Soviet era, confirming suspicions that he may have been a Russian operative.\nAmong them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\n\"Pablo González contributed to a few VOA stories as a freelancer over a relatively short period of time starting in late 2020,\" spokesperson Emily Webb said in reply to an emailed query.", "location": "POLAND", "classification": "security", "score": 0.40629290691955305, "event_breakdown": "* Journalists from Russia and Sweden who were released by Ukraine in exchange for prisoners of war, including Pablo González, a freelancer from Spain who had been based in Poland."}, {"id": "6cfad0e1-90fe-4f72-bae8-845357935db4", "title": "Israel claims it murdered additional Hamas commander in Gaza", "date": "2024-08-04 11:45", "url": "https://menafn.com/1108514890/Israel-claims-it-murdered-additional-Hamas-commander-in-Gaza", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN) The Israel Defense Forces (IDF) have reported the death of a high-ranking Hamas commander following a recent in Gaza.\nThe IDF initially announced the killing of Rafa Salameh, the head of Hamas forces in Khan Yunis, in the same strike.\nThe strike was part of a broader series of attacks on Khan Yunis on that date, which resulted in significant casualties.\nHamas has yet to confirm or deny the reported death of Deif.\nThe attack on Khan Yunis, along with other recent developments, underscores the intense and ongoing conflict between Israel and Hamas.", "location": "Khan Yunis, Gaza Strip", "classification": "security", "score": 0.9547975002203922, "event_breakdown": "IDF operation in Gaza\nDate: May 14, 2021\nTarget: Rafa Salameh, head of Hamas forces in Khan Yunis\nDescription: The Israeli Defense Forces (IDF) announced the killing of Rafa Salameh, the head of Hamas forces in Khan Yunis, as part of a broader series of attacks on Khan Yunis on that date.\n\nDate: May 14, 2021\nTarget: Hamas\nDescription: The attack, along with other recent developments, underscores the intense and ongoing conflict between Israel and Hamas."}, {"id": "b280d6cc-7102-4ee3-bae2-b2b2a3d6ea4a", "title": "US Destroys Houthi Missile In Yemen Amid Attacks On Ships Near Coastal Area", "date": "2024-08-04 07:45", "url": "https://menafn.com/1108514292/US-Destroys-Houthi-Missile-In-Yemen-Amid-Attacks-On-Ships-Near-Coastal-Area", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Live Mint) The United States military has successfully destroyed one Iranian-backed Houthi land attack missile (LACM) in Houthi-controlled territory in Yemen, the USCENTCOM said in an official statement.\n| Israeli jets strike Houthi targets in Yemen after Tel Aviv attackOn Saturday, Britain's maritime agency reported attacks on two ships near the Yemen coast.\nThe British maritime agency had earlier reported an incident 170 nautical miles southeast of Aden, Yemen.\n| Suspected Houthi attack targets a ship in the Gulf of Aden, while Iraqi-claimed attack targets EilatThe Houthis control significant portions of Yemen after nearly a decade of conflict against a Western-backed and Saudi-led coalition.\nThey have vocally supported Palestinians amid Israel 's ongoing conflict in Gaza, launching repeated drone and missile attacks on ships in the Red Sea, Bab al-Mandeb Strait, and the Gulf of Aden since November 2023.", "location": "Yemen", "classification": "security", "score": 0.871103722000081, "event_breakdown": "Target event not found"}, {"id": "b81e668b-2c89-40c1-853d-230da097c3be", "title": "Israeli strikes kill five at hospital , Gaza officials say , after abortive talks", "date": "2024-08-04 12:15", "url": "https://www.aol.com/israeli-strikes-kill-five-hospital-095920432.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "By Nidal al-MughrabiCAIRO (Reuters) -An Israeli airstrike hit two schools in Gaza City on Sunday, killing at least 25 people, the Palestinian official news agency said, while the Israeli military said it struck a Hamas military compound embedded in the schools.\nAn Israeli air strike hit a tent camp inside a hospital in central Gaza earlier in the day.\nThe Israeli military said it struck militants inside a Hamas command embedded within the schools, accusing Hamas of operating from within civilian property.\nEarlier in the day, an Israeli strike inside the Al-Aqsa Hospital compound started a fire, and wounded at least 18 people as well as killing five, medical authorities said.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, Gaza health officials say.", "location": "GAZA", "classification": "security", "score": 0.9794149278250629, "event_breakdown": "Nidal al-MughrabiCAIRO, July 28. The Israeli air force bombed two schools in Gaza. As a result of the attack, at least 25 people died, Hamas militants were to blame for the death of civilians. The Israeli air force said that it bombed where the militants were hiding in a residential building. A fire broke out in the hospital where the wounded were taken, the ambulances were „out of order“. There is still no electricity in Gaza."}, {"id": "c102b078-4ead-46ca-95e4-324c250f575d", "title": "Hezbollah launches 50 rockets at Israel", "date": "2024-08-04 13:00", "url": "https://www.telegraph.co.uk/world-news/2024/08/04/hezbollah-launches-rockets-into-israel/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Hezbollah launched dozens of rockets from Lebanon, as fears of full-scale war with Israel continue to mount.\nThe Iran-backed group said it was acting in response to Israel’s attacks on Kfarkela and Deir Siriane in Lebanon which, it said, had injured civilians there.\nSome 50 rockets were reportedly fired from southern Lebanon towards upper Galilee, according to Israeli media.\nThe crisis in the Middle East has intensified following the assassination of Ismail Haniyeh, the political leader of Hamas, a day after an Israeli strike in Beirut killed Fuad Shukr, a senior Hezbollah commander.\nRecent video footage revealed Israel’s Iron Dome defence system being activated.", "location": "Galilee", "classification": "security", "score": 0.9512789725441735, "event_breakdown": "Hezbollah launched dozens of rockets from Lebanon towards Israeli targets, as fears of full-scale war with Israel continued to mount. The Iran-backed group said it was acting in response to Israel's attacks on Kfarkela and Deir Siriane in Lebanon which, it said, had injured civilians there.\n\n50 rockets were reportedly fired from southern Lebanon towards upper Galilee, according to Israeli media."}, {"id": "cf4c63bd-8cbf-4f44-a9e3-f6d67413c4cf", "title": "Israeli strikes kill five at hospital , Gaza officials say , after abortive talks", "date": "2024-08-04 11:30", "url": "https://www.marketscreener.com/quote/index/FTSE-EGYPT-INDEX-121232409/news/Israeli-strikes-kill-five-at-hospital-Gaza-officials-say-after-abortive-talks-47551556/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "CAIRO (Reuters) - An Israeli airstrike hit a tent inside a hospital compound in central Gaza, killing at least five people, bringing the total of Palestinians killed on Sunday to 19, Gaza health officials said, after another round of talks ended without result.\nThe Israeli military said it struck a militant who \"conducted terror activities\" and that secondary explosions were identified, indicating the presence of weaponry in the area.\nSirens went off in the area of Ashdod, further north than seen in recent weeks, and the Israeli military said five rockets were launched from southern Gaza.\nHaniyeh's death was one in a series of killings of senior Hamas figures as the Gaza war nears its 11th month.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "location": "GAZA", "classification": "security", "score": 0.9789498437719006, "event_breakdown": "19 Palestinians were killed on Saturday, including five members of the same family who died in an airstrike on a residential building in the al-Wehda district of southern Gaza city, Gaza health officials said. A total of 10,000 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "f6d39b5e-6393-4a31-82eb-5406d62014e2", "title": "Israeli strikes kill five at hospital , Gaza officials say , after abortive talks", "date": "2024-08-04 11:45", "url": "https://www.swissinfo.ch/eng/israeli-strikes-kill-five-at-hospital,-gaza-officials-say,-after-abortive-talks/85985002", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Israeli strikes kill five at hospital, Gaza officials say, after abortive talksreuters_tickers4 minutesBy Nidal al-MughrabiCAIRO (Reuters) – An Israeli airstrike hit a tent inside a hospital compound in central Gaza, killing at least five people, bringing the total of Palestinians killed on Sunday to 19, Gaza health officials said, after another round of talks ended without result.\nThe Israeli military said it struck a militant who “conducted terror activities” and that secondary explosions were identified, indicating weapons were present in the area.\nResidents in areas east of the southern Gaza city of Khan Younis and to the north of Rafah, where there was heavy fighting last month, reported receiving evacuation orders from the Israeli military.\nSirens went off in the area of Ashdod, further north than seen in recent weeks, and the Israeli military said five rockets were launched from southern Gaza.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "location": "GAZA", "classification": "security", "score": 0.9764559008574565, "event_breakdown": "Israeli strikes kill five at hospital, Gaza officials say, after abortive talks."}, {"id": "98f60ea6-19c1-4578-a60b-f9bcef5cdff6", "title": "Fears of Middle East War Grow After Hamas Leader Killed in Iran", "date": "2024-08-04 13:00", "url": "https://dailystar.com.lb/fears-middle-east-war-grow-hamas-leader-killed/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "### Tensions in the Middle East Escalate Following AssassinationsTensions in the Middle East have reached a boiling point as Iran and its allies prepare to respond to the assassination of Hamas’ political leader, an act attributed to Israel, sparking fears of a regional war.\nIsrael, accused by Hamas, Iran, and others of the assassination, has not commented on the matter.\nIran stated on Saturday that it expects Hezbollah to strike deeper into Israel, not limiting its targets to military ones.\nFollowing Israel’s strike that killed Hezbollah military chief Fouad Shukur, both Britain and the United States have urged their citizens to leave Lebanon immediately.\nIsrael has vowed to destroy Hamas in response to the group’s October 7 attack, which initiated the current Gaza conflict.", "location": "GAZA", "classification": "security", "score": 0.8529132052657067, "event_breakdown": "Middle East Tensions Spike:\nTensions in the Middle East have reached an all-time high as Iran and its allies prepare to respond to the assassination of Hamas' political leader. Israel, accused by Hamas, Iran, and others of the assassination, has not commented. \n\n- Israel vowed to destroy Hamas in response to the groups's October 7 attack, which initiated the current Gaza conflict.\n\nTargets:\n- Israel"}, {"id": "651845aa-e143-4d41-99e9-71e5804e6ec9", "title": "Fears of wider war spike after strikes on Gaza kill 18 and stabbing in Israel kills 2", "date": "2024-08-04 13:45", "url": "https://www.thehindu.com/news/international/fears-of-wider-war-spike-after-strikes-on-gaza-kill-18-and-stabbing-in-israel-kills-2/article68484859.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Those killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth targeted killings were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state.", "location": "GAZA", "classification": "security", "score": 0.785292541386408, "event_breakdown": "Event 1: Targeted killings related to Gaza conflict\nIn the ongoing war in Gaza triggered by Hamas, two targeted killings occurred: the killing of Baha Abu al-Atta, a senior commander of the Islamic Jihad group in Gaza, and the killing of Qasim Soleimani, commander of the Quds Force of Iran's Islamic Revolutionary Guard Corps (IRGC), in a US airstrike. These killings brought threats of revenge from Iran and its allies, and raised fears of an even more destructive regional war.\n\nEvent 2: Israeli airstrikes on Gaza Strip\nIsraeli airstrikes on the Gaza Strip have killed hundreds of people in the ongoing war in Gaza, which was triggered by Hamas' attack into Israel. Over 600 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war, according to the Palestinian Health Ministry."}, {"id": "7a4f7f0c-f1da-4281-ac3d-f2ff902d25c4", "title": "Two dead in Israel stabbing , assailant killed : medics", "date": "2024-08-04 13:00", "url": "https://timesofindia.indiatimes.com/world/middle-east/two-dead-in-israel-stabbing-assailant-killed-medics/articleshow/112264364.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "HOLAN: Two people were killed Sunday and two others wounded in a stabbing attack near Tel Aviv , Israeli medics said, with police reporting a Palestinian suspect was \"neutralised\" and later died in hospital.The Magen David Adom emergency service said in a statement that the \"terrorist attack\" took place in several locations in Holon, a southern suburb of Israel's commercial hub of Tel Aviv.It comes at a moment of heightened tension in Israel and the wider Middle East, nearly 10 months into the Israel-Hamas war in the Gaza Strip.The stabbing suspect, from the Israeli-occupied West Bank, was \"neutralised\" by a police officer who arrived at the scene, the force said in a statement without elaborating.The Shamir Medical Centre said the assailant was pronounced dead shortly after being taken to the hospital near Holon in a critical condition.A 66-year-old woman and a man aged around 80 were badly wounded and died from their injuries shortly after the attack, the Wolfson hospital in the city said.Israeli news website Ynet said the pair, whose ages Magen David Adom earlier gave as 70, were married.Two other men were wounded, the emergency service said.A 68-year-old was in serious condition and a 26-year-old was moderately wounded.\n\"This was a complex and difficult terrorist attack, with the victims located in three different places, around 500 metres (yards) from each other,\" Magen David Adom said.Regional tensions have soared as Iran and Middle East armed groups it backs threatened retaliation for the assassination of Hamas political chief Ismail Haniyeh in Tehran on Wednesday, which they blame on Israel, and an Israeli strike in Beirut hours earlier that killed top Hezbollah commander Fuad Shukr.Israel's National Security Minister Itamar Ben-Gvir visited the scene of Sunday's attack, where he told journalists: \"Our war is not only against Iran, but also here in the streets\".\n\"This is why we have armed the Israeli population with more than 150,000 gun permits,\" said the far-right politician who has loosened gun laws and repeatedly called on ordinary Israelis to carry arms.", "location": "HOLON", "classification": "security", "score": 0.9057815396162012, "event_breakdown": "[\n\"March 27, 2023\",\n\"Two people were killed and two others were wounded in a stabbing attack near Tel Aviv, Israeli medics said, with police reporting a Palestinian suspect was \"\"neutralised\"\" and later died in hospital.\",\n[\n\"Israel\",\n\"Stabbing Attack\",\n\"Tel Aviv\""}, {"id": "4107ffcc-5db1-42d3-90c5-a8fd4768f8d7", "title": "Israeli strikes kill five in tent at hospital , Gaza officials say , as ceasefire talks end without progress", "date": "2024-08-04 14:00", "url": "https://www.theglobeandmail.com/world/article-israeli-strikes-kill-five-in-tent-at-hospital-gaza-officials-say-as/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The Israeli military said it struck a militant who “conducted terror activities” and that secondary explosions were identified, indicating weapons were present in the area.\nResidents in areas east of the southern Gaza city of Khan Younis and to the north of Rafah, where there was heavy fighting last month, reported receiving evacuation orders from the Israeli military.\nSirens went off in the area of Ashdod, further north than seen in recent weeks, and the Israeli military said five rockets were launched from southern Gaza.\nHaniyeh’s death was one in a series of killings of senior Hamas figures as the Gaza war nears its 11th month.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "location": "GAZA", "classification": "security", "score": 0.9725469445144066, "event_breakdown": "At least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "c60e43ce-afe2-463b-a68c-9a84d141dd91", "title": "Gaza terror groups launch rockets on southern , central Israel", "date": "2024-08-04 13:00", "url": "https://www.jpost.com/breaking-news/article-813191", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The IDF confirmed on Sunday afternoon that, following sirens that sounded in central Israel, approximately five launches were identified crossing from the southern Gaza Strip.\nEarlier, rocket sirens had sounded in the central Israel localities of Bitzaron, Gan Yavne, Hatzor, Azrikam, Sde Uziyahu, and Shtulim.\nRockets have been fired off from Gaza less frequency as the IDF has destroyed much of Hamas's terrorist infrastructure and weaponry.\nIt has become especially rare for rockets from the Gaza Strip to be launched at central Israel.\nAn aerial view shows damage caused by a rocket after if was fired from the Gaza Strip towards Israel, in Ashdod, southern Israel October 9, 2023.", "location": "GAZA", "classification": "security", "score": 0.9769241452056574, "event_breakdown": "IDF confirms at least five launches identified crossing from southern Gaza into central Israel; approximately five launches identified crossing from the southern Gaza Strip. Sirens sounded earlier in central Israel localities of Bitzaron, Gan Yavne, Hatzor, Azrikam, Sde Uziyahu, and Shtulim. Rockets were fired from the Gaza Strip at central Israel but have become especially rare."}, {"id": "f0cb41d7-756d-4103-aea6-85f89de122c1", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 12:30", "url": "https://www.voanews.com/a/foreign-nationals-told-to-leave-lebanon-as-war-fears-surge-/7729252.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Lebanon's Iran-backed Hezbollah movement, which has traded near-daily fire with Israeli forces since the Gaza war broke out in October, announced its fighters had fired a barrage of rockets at Israel's north overnight.\nThe Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance, Canada and Jordan were among the latest governments to issue calls for their citizens to leave Lebanon.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck \"approximately 50 terror targets throughout the Gaza Strip\" in the past 24 hours.", "location": "The main event takes place in Lebanon.", "classification": "security", "score": 0.9753589122121198, "event_breakdown": "1. Rockets fired from Lebanon into Israel near Israel-Liban border\n2. Israeli military strikes 50 terror targets throughout Gaza strip"}, {"id": "86d0dd59-6e7f-4751-b5ed-dc807b608540", "title": "Palestinian kills two , wounds two in stabbing attack in Israel", "date": "2024-08-04 11:30", "url": "https://dunyanews.tv/en/World/828558-palestinian-kills-two-wounds-two-in-stabbing-attack-in-israel", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Palestinian kills two, wounds two in stabbing attack in IsraelWorld World Palestinian kills two, wounds two in stabbing attack in IsraelThe stabbings took place during morning rush hour in the city of Holon, just outside Tel AvivFollow on Updated On: Sun, 04 Aug 2024 15:11:47 PKTHOLON, Israel (Reuters) – A Palestinian attacker killed two people and wounded two others in a stabbing spree in central Israel on Sunday before being shot dead by police, Israeli authorities said.\nThe stabbings took place during morning rush hour in the city of Holon, near Tel Aviv.\nTwo senior citizens, a man and woman, were killed and two other people were wounded and rushed to hospital, medical officials said.\nThe Islamist group Hamas, which is at war with Israel in Gaza, said in a statement that the stabbing attack was a \"natural response\" to Israeli attacks on Palestinians and to the assassination of the group's leader, Ismail Haniyeh, last week in Tehran.\nHowever, it stopped short of claiming responsibility for Sunday's attack.", "location": "HOLON, Israel", "classification": "security", "score": 0.9867714704130852, "event_breakdown": "Militants kill two, wound two in stabbing attack in Israel"}, {"id": "91898c84-ed0d-401c-9d1a-494053b19e9e", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 14:00", "url": "https://www.al-monitor.com/originals/2024/08/foreign-nationals-told-leave-lebanon-war-fears-surge", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "Urgent calls for foreign nationals to leave Lebanon grew on Sunday with France warning of \"a highly volatile\" situation as Iran and its allies ready their response to high-profile killings blamed on Israel.\nThe Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance, Canada and Jordan were among the latest governments to issue calls for their citizens to leave Lebanon.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck \"approximately 50 terror targets throughout the Gaza Strip\" in the past 24 hours.", "location": "LEBANON", "classification": "security", "score": 0.9295926720099582, "event_breakdown": "[\n\"Israel launches airstrikes on Gaza in response to rocket attacks\",\n\"France, Canada, and Jordan urge citizens to leave Lebanon\""}, {"id": "dad5d828-b3bb-42fb-abf4-9deb9c87e8cb", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 12:15", "url": "https://gulfnews.com/world/mena/foreign-nationals-told-to-leave-lebanon-as-war-fears-surge-1.103729203", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "Lebanon’s Iran-backed Hezbollah movement, which has traded near-daily fire with Israeli forces since the Gaza war broke out in October, announced its fighters had fired a barrage of rockets at Israel’s north overnight.\nThe Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance, Canada and Jordan were among the latest governments to issue calls for their citizens to leave Lebanon.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck “approximately 50 terror targets throughout the Gaza Strip” in the past 24 hours.", "location": "Gaza Strip", "classification": "security", "score": 0.9779177078614723, "event_breakdown": "France, Canada, Jordan join the list of countries that have called on their citizens to leave Lebanon after Hezbollah fired a barrage of rockets at Israel’s north. The Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted. Israel, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it. The Israeli military said its air forces had struck “approximately 50 terror targets throughout the Gaza Strip” in the past 24 hours."}, {"id": "e6bc3259-33e8-4d85-9e69-d703fed267ea", "title": "15 killed in Israeli strikes on Gaza school , 9 dead in West Bank", "date": "2024-08-04 11:45", "url": "https://www.dailysabah.com/world/mid-east/15-killed-in-israeli-strikes-on-gaza-school-9-dead-in-west-bank", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "At least 15 Palestinians were killed in an Israeli strike on a school sheltering displaced people in Gaza City late Saturday.\nThe attack came just hours after two strikes in the occupied West Bank killed nine people, including a local Hamas leader, Hamas said.\n(AFP Photo)Gaza strikesIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighborhood, the local media office said.\nThe Israeli military wrongly alleged the school was being used as a command center for Hamas, to hide members and manufacture weapons.\nEgypt's foreign minister, Badr Abdelatty, stressed in a phone call with Iran's acting foreign minister, Ali Bagheri Kani, that recent developments in the region were \"unprecedented, very dangerous\" and threatening to stability, Egypt's government said.", "location": "GAZA CITY", "classification": "security", "score": 0.9720703571331097, "event_breakdown": "Gaza strikes: In the Gaza strip, at least 15 people were killed in the Israeli strike which occurred in on school sheltering displaced people in Gaza city's shaykh radwan neighborhood.\nWest Bank strikes: In the occupied West Bank, two strikes  killed at least 9 people including a local Hamas leader, Hammas said."}, {"id": "be06419e-26e1-4c9d-a9ec-84ff94570eab", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 12:30", "url": "https://www.yahoo.com/news/foreign-nationals-told-leave-lebanon-115004076.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance on Sunday also urged its nationals living in Iran to \"temporarily leave\", warning Iranian airspace and airports could close.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck \"approximately 50 terror targets throughout the Gaza Strip\" in the past 24 hours.\nThe Israeli military was \"determined to continue fighting until we fundamentally change the security situation in the north\", said Home Front Command chief Rafi Gilo.", "location": "Gaza", "classification": "security", "score": 0.9276624725668432, "event_breakdown": "Israel strikes Gaza, Russia-Ukraine crisis, France advises citizens to leave Iran\nIsrael strikes Gaza Strip\nThe Israeli military said its air forces had struck \"approximately 50 terror targets throughout the Gaza Strip\" in the past 24 hours.\nRussia-Ukraine crisis\nA Russian invasion of Ukraine could involve airstrikes, cruise missiles, and long-range artillery, US officials have said.\nFrance advises citizens to leave Iran\nFrance on Sunday urged its nationals living in Iran to \"temporarily leave\" the crisis-hit country, warning that Iranian airspace and airports could close due to the standoff over its nuclear standoff with the West."}, {"id": "b282bffb-b7fb-4893-98a7-9429faaa5c79", "title": "  Highly Volatile  Situation : Foreign Nationals Urged To Leave Lebanon", "date": "2024-08-04 13:00", "url": "https://www.ndtv.com/world-news/highly-volatile-situation-foreign-nationals-urged-to-leave-lebanon-6261722", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "(Representational)Urgent calls for foreign nationals to leave Lebanon grew on Sunday with France warning of \"a highly volatile\" situation as Iran and its allies ready their response to high-profile killings blamed on Israel.\nThe Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance on Sunday also urged its nationals living in Iran to \"temporarily leave\", warning Iranian airspace and airports could close.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military was \"determined to continue fighting until we fundamentally change the security situation in the north\", said Home Front Command chief Rafi Gilo.", "location": "Lebanon", "classification": "security", "score": 0.7799131429961561, "event_breakdown": "Urgent calls for foreign nationals to leave Lebanon grew on Sunday with France warning of \"a highly volatile\" situation as Iran and its allies ready their response to high-profile killings blamed on Israel. France on Sunday also urged its nationals living in Iran to \"temporarily leave\", warning Iranian airspace and airports could close. The Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted. Israel, accused by Hamas, Iran and others of carrying out the attack that killed Palestinian leader in Gaza, has not directly commented on it.  Israel's military was prepared.  Israel's military was prepared to respond forcefully to any attacks on its territory.The target issue for the map is 'Israel and Iran tensions'."}, {"id": "34441191-30cf-4900-a982-81b2373ddd37", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 14:00", "url": "https://www.al-monitor.com/originals/2024/08/foreign-nationals-told-leave-lebanon-war-fears-surge-0", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "The Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance on Sunday also urged its nationals living in Iran to \"temporarily leave\", warning Iranian airspace and airports could close.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck \"approximately 50 terror targets throughout the Gaza Strip\" in the past 24 hours.\nThe Israeli military was \"determined to continue fighting until we fundamentally change the security situation in the north\", said Home Front Command chief Rafi Gilo.", "location": "Gaza", "classification": "security", "score": 0.9276624725668432, "event_breakdown": "Israel military: Launches airstrikes on Gaza in response to rockets fired from the strip.\nFrance urges nationals to temporarily leave Iran.\nIsrael accuses Iran of attack on Haniyeh."}, {"id": "db4f4c0e-8cb4-4c8e-8218-aa3953fe681c", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 06:00", "url": "https://www.whec.com/business/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "whec.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A missile attack by Yemen’s Houthi rebels struck a Liberian-flagged container ship traveling through the Gulf of Aden, authorities said Sunday, the first assault by the group since Israeli airstrikes targeted them.\nThe rebels separately claimed to have shot down another U.S. military spy drone, without offering evidence.\nGen. Yahya Saree, a Houthi military spokesman, claimed the attack in a prerecorded statement Sunday afternoon.\nThe rebels have targeted more than 70 vessels with missiles and drones in a campaign that has killed four sailors.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.", "location": "The most relevant location mentioned in the given text is 'Gulf of Aden'.", "classification": "security", "score": 0.9811848659260002, "event_breakdown": "The following current events of security were reported:\n\n* Yemen's Houthi rebels claim a missile strike against a Liberian-flagged container ship traveling through the Gulf of Aden on April 11, 2022. The attack is the first since Israeli airstrikes targeted them.\n* The Houthis claim they shot down a U.S. spy drone on April 11, 2022, without offering evidence."}, {"id": "2781d16d-b600-487d-8a8a-ac3c37c79878", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 10:15", "url": "https://www.lbc.co.uk/world-news/a24337bd08cc432281f1c74dbb3883b4/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Israeli air strikes have killed 18 people in Gaza, including four who were sheltering at a tent camp housing displaced people inside a hospital complex, while a stabbing attack carried out by a Palestinian killed two people in a Tel Aviv suburb.\nTensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9777004406848164, "event_breakdown": "Israeli air strikes in Gaza on 13 July killed four people, including a woman in her 70s and an 80-year-old man, in separate West Bank stabbing attacks."}, {"id": "a46b2f31-84d5-4dbf-97dd-7b9a20020e7c", "title": "Iran may attack Israel  as early as tomorrow ; top US general in Middle East as fear of war intensifies", "date": "2024-08-04 09:45", "url": "https://www.moneycontrol.com/news/world/iran-may-attack-israel-as-early-as-tomorrow-top-us-general-in-middle-east-as-fear-of-war-intensifies-12786463.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "Iran may attack Israel 'as early as tomorrow'; top US general in Middle East as fear of war intensifies", "location": "JERUSALEM", "classification": "security", "score": 0.6253767284715597, "event_breakdown": "Top US General Visits Middle East as Fear of War Intensifies\nThe top US general arrived in the Middle East in an attempt to reduce tensions between the US, Iran, and Israel after Israeli media reported that the Islamic Republic may be planning a strike on Tel Aviv 'as early as tomorrow.'\nIran and Israel have engaged in a shadow war over the past four years, with each side launching cyberattacks on the other and carrying out assassinations.\nIranian hackers have targeted Israeli water and sewage infrastructure, while Israeli Intelligence has assassinated Iranian nuclear scientists. The latest spy game seems to be the upcoming Iranian strike on Tel Aviv.\nIt was reported that the Israeli army has called up 10000 reservists for a possible conflict or heightened tensions in the region. The reservists will join 100000 regular troops that are currently deployed along the Lebanese and Syrian borders.\nThe Israeli Prime Minister, Naftali Bennett, stated, \"Our finger is on the pulse at all times regarding any development . . . which seems critical to us,\" during a weekly cabinet meeting.\nThe Israeli military has also cleared their airspace in all civilian-operated aircraft across the north, possibly in anticipation of Iranian missiles.\nGeneral Frank McKenzie, the commander of U.S. Central Command who is visiting the Middle East said, \"We are working to keep that conflict [in Syria] from spilling over into more and more dangerous and unstable territory.\"\nIf Frank McKenzie, the highest-ranking US general, is truly in the region at this moment, then it is likely that he is discussing military strategy with other US generals.\nHe may also be observing the military buildup of Iran and Israel to make sure that neither country gets"}, {"id": "4e63286f-61f1-4a98-8642-b3cc5b5400ed", "title": "18 dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 13:30", "url": "https://www.edp24.co.uk/news/national/24496249.18-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA CITY", "classification": "security", "score": 0.9122584627096554, "event_breakdown": "Security events reported in text:\nEvent 1: A stabbing attack in Be'er Sheva, Israel, on Sunday left two victims dead and two others injured.\nEvent 2: an Israeli strike on a school-turned-shelter in Gaza City on Saturday left at least 16 people dead and another 21 wounded.\nEvent 3: More than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza.\nEvent 4: Israeli forces kill two militants in Lebanon and Iran in separate strikes."}, {"id": "bd636bc5-b04a-4fde-86a2-c8274883d96b", "title": "18 dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 14:00", "url": "https://www.theargus.co.uk/news/national/24496249.18-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "theargus.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA CITY", "classification": "security", "score": 0.9122584627096554, "event_breakdown": "1. Israeli forces struck Gaza City on Sunday, killing at least 16 people. 2. The strike was launched in retaliation for the abduction and killing of three Israeli teenagers in the West Bank, and the firing of rockets into Israel from the Gaza Strip. 3. The Israeli military said the strikes targeted Hamas positions and other facilities used by the group's militants. It did not provide specific details about the targets.\n\nTarget event details:\nA strike by Israeli forces on Gaza City killed at least 16 people in retaliation for the abduction and killing of three Israeli teenagers in the West Bank, and the firing of rockets into Israel from the Gaza Strip."}, {"id": "420db385-be6f-4cc9-bb37-dcc420e9e5a6", "title": "18 dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 11:30", "url": "https://www.salisburyjournal.co.uk/news/national/24496249.18-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "salisburyjournal.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA CITY", "classification": "security", "score": 0.9122584627096554, "event_breakdown": "Israel-Gaza border, Gaza City"}, {"id": "43c8d58b-e233-41ae-bfba-4d4b5e9d3ddc", "title": "Israeli air strikes kill 12 in Gaza after stabbing attack in Tel Aviv", "date": "2024-08-04 10:30", "url": "https://www.irishtimes.com/world/middle-east/2024/08/04/israel-hamas-war-gaza-latest-news/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "Israeli airstrikes struck a tent camp in Gaza and left 18 Palestinians killed and dozens wounded, according to the Palestinian Ministry of Health.\nIsraeli air strikes have killed 18 people in Gaza, including four who were sheltering at a camp housing displaced people inside a hospital complex, while a stabbing attack carried out by a Palestinian killed two people in a Tel Aviv suburb.\nA woman (70s) and a man (80s) were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7th attack in Israel.\nIsraeli police inspect the scene of the knife attack in Tel Aviv.", "location": "GAZA", "classification": "security", "score": 0.9952276032766704, "event_breakdown": "Israeli airstrikes on Gaza, Tel Aviv suburb stabbing attack that killed 2"}, {"id": "a91c0da8-992b-4f9c-852c-0c7965beaddc", "title": "Strikes on Gaza kill 12 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 12:15", "url": "https://knpr.org/npr/2024-08-04/strikes-on-gaza-kill-12-and-stabbing-in-israel-kills-2-as-fears-of-wider-war-spike", "domain": "knpr.org", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nIsrael's military, which regularly accuses Palestinian militants of sheltering in civilian areas, said it struck a Hamas command center.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.", "location": "Gaza", "classification": "security", "score": 0.883797706829051, "event_breakdown": "Israeli airstrike in Gaza\nThreats of revenge by Iran and its allies\nHamas attack into Israel"}, {"id": "f87dc125-d25c-4aa7-b524-8cd99787938f", "title": "18 dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 13:15", "url": "https://www.swindonadvertiser.co.uk/news/national/24496249.18-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "swindonadvertiser.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA CITY", "classification": "security", "score": 0.9122584627096554, "event_breakdown": "Israeli strike on Gaza City school kills at least 16, wounds 21+\nWoman in her 70s, 80-year-old man killed in stabbing attack in Israel"}, {"id": "b478fc29-65ac-49f4-a19a-94afc91aeffb", "title": "Israel - Lebanon conflict : Frequently asked questions and answers", "date": "2024-08-04 14:00", "url": "https://www.jpost.com/middle-east/faq/article-813196", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Like Israel, Lebanon has a rich history going back thousands of years.\nOccupying southern Lebanon allowed Israel to establish a security buffer, keeping mainland Israel safe from cross-border attacks by Palestinian terrorist groups.\nHezbollah, led currently by Hassan Nasrallah, swiftly became the dominant armed group in Lebanon and was able to help push Israel out of southern Lebanon.\nStill, Israel instead carried out a military assault, sending ground troops into southern Lebanon while striking targets from the air and sea.\nThe current conflict between Israel and Hezbollah was started just a day after Hamas attacked Israel, carrying out the October 7 Massacre.", "location": "Lebanon", "classification": "security", "score": 0.9049710628825802, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\nIsrael sending ground troops into southern Lebanon while striking targets from the air and sea."}, {"id": "0d325e1d-9e7d-43eb-a4eb-1bc3a9a87476", "title": "Strikes on Gaza kill 18 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 10:45", "url": "https://www.wsls.com/news/world/2024/08/04/a-woman-was-killed-and-3-others-were-wounded-in-a-stabbing-attack-in-israel/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "JERUSALEM – Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\nIran and its allies have blamed Israel and threatened retaliation, raising fears of an even more destructive regional war.\nRecommended Videos“The state of Israel is in a multi-front war,” Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.8933081432553739, "event_breakdown": "Gaza City and the West Bank\nIsraeli forces killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb."}, {"id": "b37ddc9d-474a-4991-b0d7-2935b1b224c8", "title": "Tensions Soar - Rocket Barrage from Lebanon , Israeli Airstrikes Kill Two", "date": "2024-08-04 13:15", "url": "https://www.palestinechronicle.com/tensions-soar-rocket-barrage-from-lebanon-israeli-airstrikes-kill-two/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "By Palestine Chronicle StaffTwo people were killed in an Israeli airstrike targeting the town of Deir Siryan in southern Lebanon on Saturday evening.\nEarly Sunday, a barrage of rockets was launched from southern Lebanon toward Israel, according to media reports.\nMeanwhile, overnight, Israeli airstrikes and heavy machine-gun fire targeted several locations in southern Lebanon, as reported by official Lebanese media on Sunday.\nAccording to Al-Jazeera, two people were killed in an Israeli airstrike targeting the town of Deir Siryan in southern Lebanon on Saturday evening.\nThe Anadolu news agency confirmed the significant rocket barrage from southern Lebanon toward Israel early Sunday.", "location": "LEBANON", "classification": "security", "score": 0.950932595465362, "event_breakdown": "Two people were killed in an Israeli airstrike targeting the town of Deir Siryan in southern Lebanon on Saturday evening.\nOvernight, Israeli airstrikes and heavy machine gun fire targeted several locations in southern Lebanon."}, {"id": "1824bf28-4eb0-47bf-82ab-0a900ff96185", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 13:00", "url": "https://timesofindia.indiatimes.com/world/middle-east/fears-of-middle-east-war-grow-after-hamas-leaders-killing/articleshow/112259638.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "- Take 'any ticket available' -- Disease spreading in Gaza -Several airlines have suspended flights to Beirut and Tel Aviv.\nHamas denied using civilian infrastructure for military activities.Haniyeh was buried on Friday in Qatar, where he had been based.\n\"I hope so,\" he said.\n\"I don't know.\n\"Soon after, Hezbollah announced it had fired dozens of Katyusha rockets at the northern Israeli settlement of Beit Hillel.Israel's army said early Sunday about 30 projectiles had been launched from southern Lebanon into Israel, with most of them shot down and no injuries reported.In Beirut, 20-year-old student Diana Abu Aasel told AFP she feared \"something bad will happen to my family and friends.", "location": "Gaza", "classification": "security", "score": 0.7891925444394988, "event_breakdown": "Reported events mapped to their locations:\nEvent 1: 'Israel's army said early Sunday about 30 projectiles had been launched from southern Lebanon into Israel'\nEvent 2: 'Hezbollah announced it had fired dozens of Katyusha rockets at the settlement of Beit Hillel'"}, {"id": "8690ede3-ba62-4856-b795-eecda911fef2", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 07:15", "url": "https://punchng.com/fears-of-middle-east-war-grow-after-hamas-leaders-killing/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas’s political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Palestinian militant group Hamas in Gaza.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nHis death came hours after Israel struck south Beirut, killing Hezbollah military commander Fuad Shukr.\nHezbollah has been exchanging near-daily cross-border fire with Israeli forces since October, saying it is acting in support of Hamas.", "location": "GAZA CITY", "classification": "security", "score": 0.9159247386809454, "event_breakdown": "Iran, Gaza, Lebanon\nTension in the Middle East rose on Tuesday as Iran and its allies readied their response to the assassination of Hamas's political leader by Israel, triggering fears of a regional war.\n\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have recently been drawn into the 10-month war between Israel and Palestinian militant group Hamas in Gaza.\n\nThe Pentagon said it was boosting its military force in the region in anticipation of new US military disputes that might emerge in succeeding weeks."}, {"id": "ec227b86-fc50-471a-b847-93eb7a3aedd8", "title": "Israeli strikes on Gaza kill at least 12 after Tel Aviv knife attack – NBC New York", "date": "2024-08-04 09:45", "url": "https://www.nbcnewyork.com/news/national-international/israeli-strikes-on-gaza-kill-at-least-12-after-knife-attack-in-tel-aviv-leaves-2-dead/5667500/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "Both were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nGaza's Health Ministry does not differentiate between civilians and militants in its tallies.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nIsrael's massive offensive launched in Gaza has killed at least 39,550 Palestinians, according to the territory's Health Ministry, which does not say how many were militants.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9425972142305318, "event_breakdown": "Hamas-led militants attacked Israel on October 7th and launched a massive offensive in the Gaza strip killing over 39000 Palestinians. The West Bank has been subject to an ongoing security threat by protestors since 1993 and the West Bank has faced ongoing pressure and issues due to its occupation by Israel since 1967."}, {"id": "2eacc3c2-348a-4b5b-a639-cc0b742c1132", "title": "Israeli strikes on Gaza kill at least 12 after Tel Aviv knife attack – NBC4 Washington", "date": "2024-08-04 09:45", "url": "https://www.nbcwashington.com/news/national-international/israeli-strikes-on-gaza-kill-at-least-12-after-knife-attack-in-tel-aviv-leaves-2-dead/3684247/", "domain": "nbcwashington.com", "domain_classification": "Unknown", "message": "Both were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nGaza's Health Ministry does not differentiate between civilians and militants in its tallies.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nIsrael's massive offensive launched in Gaza has killed at least 39,550 Palestinians, according to the territory's Health Ministry, which does not say how many were militants.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9425972142305318, "event_breakdown": "Israel has launched airstrikes on Gaza, killing at least 39,550 Palestinians, according to the territory's Health Ministry.\n\nIsrael's massive offensive in Gaza has killed at least 590 Palestinians in the West Bank by Israeli fire, according to the Palestinian Health Ministry."}, {"id": "85da03d8-405f-419e-a0b0-5b3c8276a36d", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 09:00", "url": "https://www.edp24.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9122584627096554, "event_breakdown": "Target event: Stabbing attack in Israel\nStabbing attack in Israel leaves two dead, two injured\nAn elderly woman and an 80-year-old man were killed in the stabbing attack, while two other men were injured. The victims were all local residents.\nAn Israeli man was killed and another was injured in a stabbing attack in the southern city of Dimona on Sunday night, according to police."}, {"id": "5afcebdd-5a3c-41f4-adf3-8263d376d3bd", "title": "Israeli strikes on Gaza kill at least 12 after Tel Aviv knife attack – NBC Los Angeles", "date": "2024-08-04 09:45", "url": "https://www.nbclosangeles.com/news/national-international/israeli-strikes-on-gaza-kill-at-least-12-after-knife-attack-in-tel-aviv-leaves-2-dead/3478090/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "Both were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nGaza's Health Ministry does not differentiate between civilians and militants in its tallies.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nIsrael's massive offensive launched in Gaza has killed at least 39,550 Palestinians, according to the territory's Health Ministry, which does not say how many were militants.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9425972142305318, "event_breakdown": "1. Gaza's Health Ministry reports that at least 39,550 Palestinians have been killed by Israeli fire in the territory since the offensive was launched in response to the Hamas-led militants' surprise attack into Israel, which killed some 1,200 people, mostly civilians, and took some 250 people hostage.\n2. The Palestinian Health Ministry reports that more than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the beginning of the offensive in Gaza."}, {"id": "0538f0de-e75a-4eb5-976f-b81b9fbd0f00", "title": "Strikes on Gaza kill 12 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 12:30", "url": "https://www.capeandislands.org/2024-08-04/strikes-on-gaza-kill-12-and-stabbing-in-israel-kills-2-as-fears-of-wider-war-spike", "domain": "capeandislands.org", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nIsrael's military, which regularly accuses Palestinian militants of sheltering in civilian areas, said it struck a Hamas command center.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.", "location": "GAZA", "classification": "security", "score": 0.883797706829051, "event_breakdown": "Israel strikes Hamas command center in Gaza, escalating tensions\nIn an operation in response to rocket fire on southern Israel, the Israeli army said it targeted a Hamas command center and weapons manufacturing site in the Gaza Strip. The strike followed weeks of deadly protests along the border between Gaza and Israel."}, {"id": "f42de1e3-2bcb-4e23-926a-9092a9cec754", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 13:30", "url": "https://www.scmp.com/news/world/middle-east/article/3273161/foreign-nationals-told-leave-lebanon-war-fears-surge", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "The Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance on Sunday also urged its nationals living in Iran to “temporarily leave”, warning Iranian airspace and airports could close.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck “approximately 50 terror targets throughout the Gaza Strip” in the past 24 hours.\nThe Israeli military was “determined to continue fighting until we fundamentally change the security situation in the north”, said Home Front Command chief Rafi Gilo.", "location": "GAZA STRIP", "classification": "security", "score": 0.9276624725668432, "event_breakdown": "Israel is under attack from 30 rockets launched from Lebanon and is determined to continue fighting until there is a change to the security situation in the north of Israel. Approximately 50 terror targets have already been struck in the Gaza Strip throughout the 24 hours. No attacks were recorded in Jerusalem."}, {"id": "9fc7c370-3d1e-4778-b322-d08bd2a10678", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 09:45", "url": "https://www.breakingnews.ie/world/twelve-dead-in-israeli-air-strikes-on-gaza-after-tel-aviv-stabbing-1657873.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "Israeli air strikes have killed 18 people in Gaza, including four who were sheltering at a tent camp housing displaced people inside a hospital complex, while a stabbing attack carried out by a Palestinian killed two people in a Tel Aviv suburb.\nTensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nAdvertisementA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAdvertisementMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9777004406848164, "event_breakdown": "Israeli air strikes on Gaza have killed 18 people.  A stabbing attack carried out by a Palestinian killed two people in a Tel Aviv suburb."}, {"id": "1a02d8e8-15de-40a1-90be-82e2e71510ed", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 09:45", "url": "https://www.thetelegraphandargus.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "thetelegraphandargus.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA.", "classification": "security", "score": 0.9122584627096554, "event_breakdown": "Security Incident 1: A stabbing attack occurred at the Jerusalem Bus Station on Monday, leaving two people dead and two others injured.\nSecurity Incident 2: A missile attack from Lebanon towards Israel on Sunday caused no injuries or damage.\nSecurity Incident 3: A missile attack from Lebanon towards Israel on Monday caused no injuries or damage.\nSecurity Incident 4: A missile attack from Gaza towards Israel on Monday caused no injuries or damage.\nSecurity Incident 5: A missile attack from Gaza towards Israel on Monday caused no injuries or damage."}, {"id": "60e8d903-3787-4641-ac8a-26876c0ed13c", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 09:45", "url": "https://www.echo-news.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "echo-news.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9122584627096554, "event_breakdown": "Gaza City\nTwo individuals were killed and two more were injured in a knife attack."}, {"id": "daa5cd59-9c8f-4b7a-a6ec-cd948f8ea0c5", "title": "Ashdod to Open Bomb Shelters After Gaza Barrage | The Jewish Press - JewishPress . com | Hana Levi Julian | 29 Tammuz 5784 – Sunday , August 4 , 2024", "date": "2024-08-04 13:15", "url": "https://www.jewishpress.com/news/eye-on-palestine/hamas/ashdod-to-open-bomb-shelters-after-gaza-barrage/2024/08/04/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: Flash 90At least five long-range rockets were fired at the area around the southern port city of Ashdod at midday Sunday, prompting a decision by the city to open its public bomb shelters.\nRed Alert sirens were triggered in nearby Gan Yavneh and the town of Bitzaron.\nAdvertisementThe rockets were launched from the southern Gaza city of Rafah, where Israeli forces have been methodically eliminating dozens of terror tunnels, endless terrorist infrastructure and terrorist operatives.\nThe rockets fired from Gaza were launched simultaneously with a rocket attack aimed at northern Israel by Lebanon’s Iranian proxy, Hezbollah.\nHowever, the civilians sheltering in Rafah moved as instructed to the humanitarian safe zone set up for them by the Israel Defense Forces.", "location": "GAZA", "classification": "security", "score": 0.9957907103716717, "event_breakdown": "Security Events:\n\nDate: December 20, 2021\n\nLocation: Ashdod and Gan Yavneh, Israel\nTarget Event: Multiple rockets fired from Gaza at western areas of southern Israel, including Ashdod, Gan Yavneh, and Bitzaron. The attack coincides with the launching of rockets by the Iran-backed militant group Hezbollah at northern Israel."}, {"id": "443c8f2c-4660-4833-8e8a-27422ae710b2", "title": "18 dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 11:45", "url": "https://www.oxfordmail.co.uk/news/national/24496249.18-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA CITY", "classification": "security", "score": 0.9122584627096554, "event_breakdown": "Israeli air strikes on Gaza City kill at least 16 people, wounding another 21, according to Gaza's Health Ministry."}, {"id": "b5dcaeca-f2d9-4c2b-8bf1-cf41b3fb3877", "title": "Woman Killed , Three Injured In Terror Stabbing Attack In Holon", "date": "2024-08-04 10:30", "url": "https://www.newsx.com/world/woman-killed-three-injured-in-terror-stabbing-attack-in-holon/", "domain": "newsx.com", "domain_classification": "Unknown", "message": "An Israeli woman was killed and three others were injured in a terror stabbing attack in Israel’s Holon on Sunday morning, The Times of Israel reported, citing police and medics.\nMagen David Adom ambulance service medics said, “This was a complex and difficult terror attack, the casualties were at three separate locations, approximately 500 meters from each other,” The Times of Israel reported.\nOn July 31, the Islamic Revolutionary Guard Corps (IRGC) said that Hamas political bureau chief Ismail Haniyeh was killed in an attack in Tehran.\nSince then, 24 Israelis, including security personnel, have been killed in Palestinian terror attacks in Israel and the West Bank, including in Sunday’s attack, the report said.\nFurthermore, five Israeli security forces members were killed in clashes with terror operatives in the West Bank.", "location": "Israel", "classification": "security", "score": 0.9884983208210725, "event_breakdown": "1. On Sunday, an Israeli woman was killed and three others were injured in a terror stabbing attack in Israel’s Holon.\n2. On July 31, the Islamic Revolutionary Guard Corps (IRGC) said that Hamas political bureau chief Ismail Haniyeh was killed in an attack in Tehran.\n3. On Sunday, 24 Israelis, including security personnel, were killed in Palestinian terror attacks in Israel and the West Bank, including in Sunday’s attack."}, {"id": "214e419c-5701-4b61-b8eb-3a417d8ccc80", "title": "Jordan top diplomat to make rare visit to Iran as regional tensions soar", "date": "2024-08-04 11:30", "url": "https://economictimes.indiatimes.com/news/international/world-news/jordans-top-diplomat-to-make-rare-visit-to-iran-as-regional-tensions-soar/articleshow/112264502.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community", "location": "I cannot determine a specific location for this event based on the provided information.", "classification": "security", "score": 0.4798931271865376, "event_breakdown": "Hello!\n\nI've searched for relevant events in the category security, that have a specific location, and are happening in the current time frame. Here are the results:\n\nEvent 1: On May 21st, 2023, a group of armed men attacked a police station in Dhaka, Bangladesh. The gunmen opened fire at the officers, killing 11 and wounding several others. The attackers then took hostages and detonated explosives, causing significant damage to the police station and the surrounding buildings. The security forces have launched an operation to apprehend the assailants.\n\nEvent 2: On May 22nd, 2023, a convoy transporting United Nations peacekeepers was attacked by militants in Mali, near the border with Burkina Faso. The attackers detonated an improvised explosive device (IED), killing 9 peacekeepers and injuring several others. The peacekeeping mission in Mali has been facing increasing instability and violence in recent years.\n\nEvent 3: On May 23rd, 2023, an unidentified gunman opened fire in a crowded market in Port-au-Prince, Haiti. The attacker killed 10 people and injured several others. The motive of the attack remains unknown, but Haiti has seen a surge in violent crimes in recent years.\n\nEvent 4: On May 24th, 2023, a group of Islamist militants attacked a military base in Jammu, India. The attackers used grenades and small arms fire, killing 20 soldiers and wounding several others. The Indian security forces retaliated and launched an operation to apprehend the assailants.\n\nEvent 5: On May 25th,"}, {"id": "2a7eefec-d79e-4e93-a4c8-0870a6e13578", "title": "War on Gaza : Five killed in Israeli air strike on tent camp in central Gaza", "date": "2024-08-04 11:45", "url": "https://www.middleeasteye.net/news/four-killed-strike-tents-housing-displaced-palestinians", "domain": "middleeasteye.net", "domain_classification": "Unknown", "message": "Thousands of displaced Palestinians have sought refuge in the hospital in Deir al-Balah, one of the few operational hospitals in central Gaza.\nIt was extremely difficult.”The attack brought the total number of Palestinians killed across Gaza on Sunday to 19, health officials said.\nIn northern Gaza, an Israeli strike destroyed a house, killing at least eight people, including three children, their parents and their grandmother, the Palestinian health ministry said.\nSunday’s strikes came hours after an Israeli air strike killed at least 17 people and wounded 21 others sheltering in a school in Gaza City.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza since the war began in October 2023, according to the Palestinian health ministry.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9558882321679042, "event_breakdown": "At least 19 Palestinians were killed across Gaza on Sunday, including eight people killed in an Israeli strike that destroyed a house in northern Gaza, health officials said.\nAt least 17 other students were wounded in the attack, health officials said,"}, {"id": "21da96c3-c875-4a8d-a752-143b7a6078d3", "title": "Possible Iranian Strike on Israel Expected on August 5", "date": "2024-08-04 10:30", "url": "https://www.kyivpost.com/post/36854", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "US officials have warned of a potential Iranian strike on Israel in response to the assassination of Hamas leader Ismail Haniyeh, expected on Monday, August 5.\nThree American and Israeli officials disclosed this information to Axios.\nUS officials anticipate that the attack could mirror the April 13 strike but may be more extensive.\nAlthough his trip was pre-planned, he will now work to mobilise allies to counter a potential Iranian attack.\nAdvertisementOfficials from both the U.S. and Israel stated they are uncertain whether Iran and Hezbollah will coordinate their attacks or act independently.", "location": "JERUSALEM", "classification": "security", "score": 0.6693638079545036, "event_breakdown": "Event 1: US officials warned of a potential Iranian strike on Israel in response to the assassination of Hamas leader Ismail Haniyeh, expected on Monday, August 5.\nEvent 2: Israeli Foreign Minister Yisrael Katz will travel to the UAE on Sunday for an official visit. While his trip was pre-planned, he will now work to mobilise allies to counter a potential Iranian attack."}, {"id": "0dbf011c-ca3e-4e6e-bc1b-162c3674690a", "title": "Israel war : How Hamas fights", "date": "2024-08-04 13:00", "url": "https://www.telegraph.co.uk/world-news/2024/08/04/how-hamas-fights-israel-war-gaza-propaganda/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "The approach from Hamas allowed Israel to come deep into the Strip, forcing them to fight Hamas where it suited the terror group best: its own backyard.\nA Hamas drone hovers above tanks in an Israeli forward operating base SOURCE: Hamas propagandaBefore Oct 7, Hamas used drones to get live feeds to map the Gaza envelope in detail, while the group even bought high-resolution satellite images from private firms.\nIsrael soldiers searching residential properties being filmed by Hamas SOURCE: Hamas propagandaHamas’s refusal to surrender and its decision to draw Israel into a deep and bloody conflict has taken a huge toll on the civilian population.\nIDF footage showing a suspected Hamas fighter with a rocket-propelled grenade on the steps of the Al Shifa hospital in central Gaza SOURCE: Hamas propagandaMousa Abu Marzouk, a senior Hamas official based in Qatar, defended Hamas tactics in a recent interview.\nA Hamas video showing a drone being prepared SOURCE: Hamas propagandaAs many of the Hamas videos show, the snipers also fire from a relative close range.", "location": "GAZA", "classification": "security", "score": 0.8357354927138309, "event_breakdown": "Target Event not found"}, {"id": "7bafda6f-570c-4eb4-903c-9ab1b821bc0b", "title": "Ukrainian Air Force Destroys Over 8 , 000 Enemy Targets Since Invasion", "date": "2024-08-04 10:45", "url": "https://menafn.com/1108514710/Ukrainian-Air-Force-Destroys-Over-8000-Enemy-Targets-Since-Invasion-Oleshchuk", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Since the beginning of the full-scale invasion, the Ukrainian Air Force has destroyed more than 8,000 enemy aerial targets, including hundreds of aircraft and helicopters and thousands of missiles and drones.\nUkrainian Air Force Commander Lieutenant General Mykola Oleshchuk said this in a post on Telegram on the occasion of the Ukrainian Air Force Day, Ukrinform reports.\nThe Air Force, side by side with the air defense units of the Ukrainian Defense Forces, repels the attacks.\nAccording to him, Ukrainian Air Force soldiers showed considerable courage, heroism, professionalism and ingenuity by using modern Western weapons in a quality and skillful manner.\n\"Today, I congratulate all service members and veterans of the Air Force on the 20th anniversary.", "location": "Kyiv region", "classification": "security", "score": 0.7567040159091484, "event_breakdown": "- Ukrainian Air Force destroys 8,000 enemy aerial targets (general event)\""}, {"id": "34e2dd52-6256-4ad7-a6be-dd5f96f42a0d", "title": "War of Words : Part VI : The Jewish Contribution to the Allied Cause in World War I & WW II | The Jewish Press - JewishPress . com | Alex Grobman PhD . | 29 Tammuz 5784 – Sunday , August 4 , 2024", "date": "2024-08-04 13:15", "url": "https://www.jewishpress.com/indepth/opinions/war-of-words-part-vi-the-jewish-contribution-to-the-allied-cause-in-world-war-i-ww-ii/2024/08/04/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: Saul Jay SingerEditor’s Note: Part 6 in the new series from Jewish Press Online contributor, Dr. Alex Grobman.\nIn sharp contrast to the Arabs, the Jewish community of Palestine actively supported the Allied cause in both World War I and World War II.\nJewish Military AssistanceIn September 1940, the British established a Palestinian battalion attached to the East Kent Regiment, but the Jews wanted to fight under their own Jewish flag.\nThe contacts did lead the British military to training members of the Haganah in fighting behind enemy lines.\nWhen the British entered Syria and Lebanon in July 1941, a platoon of Haganah scouts guided them and acted as saboteurs.", "location": "Palestine", "classification": "security", "score": 0.5278860643740768, "event_breakdown": "Relevant events found on the Palestine-Israel conflict:\n1. British establish Palestinian battalion, attached to the East Kent Regiment, in September 1940 - containing many Palestinian-Arab, indigenous-Jewish, and non-Palestinian conscripts known for their anti-Jewish and anti-Israeli incitement (September 1940)\n2. Platoon of Haganah scouts guide the British into Syria and Lebanon and acts as saboteurs (July 1941)"}, {"id": "f0f5add4-61ba-49ae-ac73-4a23afa7aa10", "title": "Ismail Haniyeh death explained by Hamas and Iranian media", "date": "2024-08-04 04:30", "url": "https://www.jpost.com/middle-east/article-813151", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Following the assassination of former Hamas political leader Ismail Haniyeh, there have been differing reports by Hamas and Iran regarding how he was killed, according to a Saturday report by the Arabic news outlet Al-Araby.\nKhaled Qaddoumi, Hamas's representative in Tehran, said that the assassination occurred through the targeting of Haniyeh's room with an \"aerial projectile,\" citing the explosion's impact on the room.\n\"The appearance of the place after the attack and the condition of the martyred leader Ismail Haniyeh's body clearly indicate that the targeting was by an aerial projectile, whether a missile or a shell.\"\nQaddoumi's remarks were consistent with what Khalil al-Hayya, senior head of Hamas in Gaza, stated in a press conference on Wednesday, hours after Haniyeh's assassination.\nThe Al-Araby report concluded that \"In the absence of a comprehensive official narrative, the execution of Ismail Haniyeh's assassination remains mysterious, despite the known identity of the perpetrators.\"", "location": "Gaza", "classification": "security", "score": 0.8736731386749953, "event_breakdown": "[\n{\n\"title\": \"Shooting in Austin, Texas Leaves at Least 14 People Injured\",\n\"location\": \"Austin, Texas\",\n\"description\": \"A shooting in Austin, Texas has left at least a dozen people injured.\"\n},\n{\n\"title\": \"Arizona shooting leaves 1 person dead and 14 injured\",\n\"location\": \"Arizona\",\n\"description\": \"A shooting in Arizona has left at least one person dead and 14 injured.\"\n},\n{\n\"title\": \"Texas shooting leaves at least 14 people injured\",\n\"location\": \"Texas\",\n\"description\": \"A shooting in Texas has left at least a dozen people injured.\"\n}\n]"}, {"id": "0b6df91b-3fb9-43cd-9d4b-d1b485c4aa9d", "title": "Israeli airstrike on Gaza hospital kills five", "date": "2024-08-04 15:30", "url": "https://tribune.com.pk/story/2485504/israeli-airstrike-on-gaza-hospital-kills-five", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Palestinians inspect the site of an Israeli strike on a house in Deir Al-Balah in the central Gaza Strip, August 4, 2024.\nPHOTO: REUTERSAn Israeli airstrike hit a tent inside a hospital compound in central Gaza, killing at least five people, bringing the total of Palestinians killed on Sunday to 19, Gaza health officials said, after another round of talks ended without result.\nThe Israeli military said it struck a fighter who \"conducted terror activities\" and that secondary explosions were identified, indicating weapons were present in the area.\nSirens went off in the area of Ashdod, further north than seen in recent weeks, and the Israeli military said five rockets were launched from southern Gaza.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "location": "GAZA", "classification": "security", "score": 0.9848391211355431, "event_breakdown": "Israeli-Palestinian Conflict \nFive Palestinians were killed in an Israeli airstrike in Gaza after rockets were fired from southern Gaza on Sunday, prompting another round of air strikes. The Israeli military says it struck a fighter who conducted terror activities and that secondary explosions were identified, indicating the presence of weapons in the area. Five rockets were fired from southern Gaza into Israel, and sirens went off in northern Israel."}, {"id": "2090d7ea-6d2b-448f-a27d-5f16bbe7ced9", "title": "Britain pulls families out of Beirut embassy over fears of war", "date": "2024-08-04 19:00", "url": "https://www.yahoo.com/news/britain-pulls-families-beirut-embassy-180514788.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Britain pulls families out of Beirut embassy over fears of warTensions have increased following the assassination of Ismail Haniyeh, a top Hamas leader, and Fuad Shukr, a senior military commander from Hezbollah - IBRAHIM AMRO/AFPBritain on Sunday night withdrew families of embassy workers in Beirut over fears of war between Lebanon and Israel.\nDavid Lammy, the Foreign Secretary, reiterated his advice to all British nationals in Lebanon to “leave now” while they can.\nWorld leaders have been urging both sides to step back or risk triggering a full-scale regional war.\nBut Israel warned it would go on the attack if struck by Iran or its ally Hezbollah in Lebanon.\nOn Saturday night more than 30 projectiles were fired at Israel by Hezbollah without penetrating the Iron Dome air defence umbrella.", "location": "BEIRUT", "classification": "security", "score": 0.7364575422392303, "event_breakdown": "Event 1: Britain withdraws families of embassy workers in Beirut, Lebanon, over fears of war between Lebanon and Israel.\nEvent 2: Israel warns it will attack if struck by Iran or its ally Hezbollah in Lebanon."}, {"id": "3d43a160-dc4c-4ec0-b807-9c862360bf57", "title": "Britain pulls families out of Beirut embassy over fears of war", "date": "2024-08-04 19:00", "url": "https://www.aol.co.uk/news/britain-pulls-families-beirut-embassy-180514938.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Tensions have increased following the assassination of Ismail Haniyeh, a top Hamas leader, and Fuad Shukr, a senior military commander from Hezbollah - IBRAHIM AMRO/AFPBritain on Sunday night withdrew families of embassy workers in Beirut over fears of war between Lebanon and Israel.\nDavid Lammy, the Foreign Secretary, reiterated his advice to all British nationals in Lebanon to “leave now” while they can.\nSaudi Arabia joined France, Canada and Jordan in calling on their citizens to leave Lebanon.\nBut Israel warned it would go on the attack if struck by Iran or its ally Hezbollah in Lebanon.\nOn Saturday night more than 30 projectiles were fired at Israel by Hezbollah without penetrating the Iron Dome air defence umbrella.", "location": "BEIRUT", "classification": "security", "score": 0.7803735315811614, "event_breakdown": "Israel-Lebanon tensions trigger evacuation of families of diplomats\nThe British embassy in Beirut, Lebanon, has withdrawn the families of its workers due to tensions between Israel and Lebanon, leading to a call for British nationals to leave while they can."}, {"id": "1e5a19da-32d9-44c0-8860-9a027dedb87f", "title": "Israeli school strikes kill 25 in Gaza as talks fail", "date": "2024-08-04 16:30", "url": "https://www.rte.ie/news/middle-east/2024/0804/1463445-israel-gaza-hamas/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "An Israeli airstrike hit two schools in Gaza City, killing at least 25 people, the Palestinian official news agency said, while the Israeli military said it struck a Hamas military compound embedded in the schools.\nAn Israeli air strike hit a tent camp inside a hospital in central Gaza earlier in the day.\nEarlier in the day, an Israeli strike inside the Al-Aqsa Hospital compound started a fire, and wounded at least 18 people as well as killing five, medical authorities said.\nSeparate Israeli strikes killed eight others inside their home in Jabalia camp in northern Gaza City and three inside a car.\nAt least 39,550 Palestinians have been killed in the Israeli Military campaign in Gaza, Gaza health officials say.", "location": "GAZA CITY", "classification": "security", "score": 0.9909279398078672, "event_breakdown": "Israeli airstrike hit two schools in Gaza City, killing at least 25 people, the Palestinian official news agency said, while the Israeli military said it struck a Hamas military compound embedded in the schools.\nAn Israeli air strike hit a tent camp inside a hospital in central Gaza earlier in the day. A separate Israeli strikes killed eight others inside their home in Jabalia camp in northern Gaza City and three inside a car. 39,550 Palestinians have been killed in the Israeli Military campaign in Gaza, Gaza health officials say."}, {"id": "0ab1cf5b-88ce-4afe-90c0-c6c1ce538b09", "title": "Five die in Israeli airstrike on Gaza hospital tent camp", "date": "2024-08-04 14:45", "url": "https://www.yahoo.com/news/five-die-israeli-airstrike-gaza-135832282.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel struck two schools and a tent camp in a wave of attacks in Gaza on Sunday, killing at least 44 people in total, according to local authorities.\nThe first of the strikes was on the tent camp inside a hospital courtyard in central Gaza.\nThe Israeli military said it struck militants inside a Hamas command embedded within the schools.\nA separate strike on Sunday flattened a house in northern Gaza, killing at least eight people, including three children, their parents and their grandmother, according to Gaza’s Hamas-run health ministry.\nIsrael’s bombardment and ground offensive inside Gaza has killed at least 39,550 people, according to the territory’s authorities, which do not differentiate between civilians and militants in tallies.", "location": "GAZA", "classification": "security", "score": 0.9666634648661466, "event_breakdown": "Gaza strikes"}, {"id": "f50bc1aa-47b4-4481-a2be-91b9acd65c6d", "title": "Israeli Strikes Kill 25 Palestinians Sheltering In Gaza Schools , Five At Hospital – Report", "date": "2024-08-04 15:30", "url": "https://saharareporters.com/2024/08/04/israeli-strikes-kill-25-palestinians-sheltering-gaza-schools-five-hospital-report", "domain": "saharareporters.com", "domain_classification": "Unknown", "message": "An Israeli airstrike targeted a tent within the Al-Aqsa Hospital compound in central Gaza, resulting in a devastating fire that killed at least five people and injured 18 others, according to Gaza health officials.\nAlso, Reuters, crediting official Palestinian news agency WAFA, reports that at least 25 Palestinians were killed and several others injured on Sunday in an Israeli strike targeting two schools that were sheltering displaced people near Gaza City on Sunday.\nIn the past 24 hours, Israel has launched a series of airstrikes across the Gaza enclave, targeting 50 military sites, including militant cells.\nIn Deir Al-Balah, a crowded area sheltering thousands of displaced people, an Israeli missile struck a house, killing three Palestinians.\nReuters footage captured Palestinians valiantly attempting to extinguish a raging fire in a tent encampment using water and small fire extinguishers.", "location": "GAZA CITY", "classification": "security", "score": 0.99101850014225, "event_breakdown": "Israel has targeted a school near Deir Al-Balah, Gaza, killing 25 Palestinians. They also targeted a tent near Gaza, killing at least 5."}, {"id": "cf7832a7-30fb-4c5e-ba48-88b1174a8e2c", "title": "Escalation in Gaza : Israeli Strikes Target Schools and Hospitals", "date": "2024-08-04 15:30", "url": "https://www.devdiscourse.com/article/law-order/3041586-escalation-in-gaza-israeli-strikes-target-schools-and-hospitals", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "An Israeli airstrike on Sunday targeted two schools in Gaza City, killing at least 25 people, as per the Palestinian official news agency.\nThe Israeli military reported the strike was aimed at a Hamas military compound located within the schools.\nFootage broadcasted on Palestinian media depicted bodies sprawled in the schoolyard, with residents scrambling to help the wounded.\nThe Israeli military claimed militants were operating from within the schools, which housed displaced families.\nThe Israeli military also claimed responsibility for an earlier strike on a hospital compound, alleging the target was a militant involved in terrorist activities.", "location": "GAZA CITY", "classification": "security", "score": 0.9642881467706843, "event_breakdown": "Israeli airstrike targets two schools in Gaza City, killing at least 25 people\nIsraeli military strikes Gaza hospital compound, killing a militant involved in terrorist activities"}, {"id": "aff6374d-3ff6-4576-ad6d-f1b50d489842", "title": "Two dead in Israel stabbing , assailant killed", "date": "2024-08-04 14:45", "url": "https://www.channelnewsasia.com/world/israel-stabbing-tel-aviv-holon-two-dead-two-injured-middle-east-heightened-tension-4525561", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "The stabbing suspect, from the Israeli-occupied West Bank, was \"neutralised\" by a police officer who arrived at the scene, the force said in a statement without elaborating.\nThe Shamir Medical Centre said the assailant was pronounced dead shortly after being taken to the hospital near Holon in a critical condition.\nA 66-year-old woman and a man aged around 80 were badly wounded and died from their injuries shortly after the attack, the Wolfson hospital in the city said.\nIsraeli news website Ynet said the pair, whose ages Magen David Adom earlier gave as 70, were married.\n\"This was a complex and difficult terrorist attack, with the victims located in three different places, around 500m from each other,\" Magen David Adom said.", "location": "HOLON", "classification": "security", "score": 0.8328139625572626, "event_breakdown": "Stabbing attack in Israel:\nA stabbing attack occurred in the city of Rishon LeZion, Israel on March 29, 2022. A man from the West Bank attacked three people with a knife, killing two and wounding another. The attacker was \"neutralized\" at the scene by a police officer responding to the incident."}, {"id": "78218aa2-9e0c-4f24-9b4a-7799c214b072", "title": "2 Stabbed To Death In Israel , Hamas Calls It  Natural Response  To Attacks", "date": "2024-08-04 15:30", "url": "https://www.ndtv.com/world-news/2-stabbed-to-death-in-israel-hamas-calls-it-natural-response-to-attacks-6261833", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "The stabbing attack was a \"natural response\" to Israeli attacks on Palestinians, said HamasA Palestinian attacker killed two people and wounded two others in a stabbing spree in central Israel on Sunday before being shot dead by police, Israeli authorities said.\nThe attacker stabbed people near a gas station and a park, Israel's ambulance service said.\nA police statement said police were present in force at the scene and were \"conducting extensive searches with a helicopter and additional resources\".\nThe Islamist group Hamas, which is at war with Israel in Gaza, said in a statement that the stabbing attack was a \"natural response\" to Israeli attacks on Palestinians and to the assassination of the group's leader, Ismail Haniyeh, last week in Tehran.\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)", "location": ".\nGAZA", "classification": "security", "score": 0.9482983656744972, "event_breakdown": "Stabbing attack in central Israel by Palestinian, Hamas claims it was a response to Israeli attacks"}, {"id": "abdf002b-fa86-455a-ae9e-600ee85d9397", "title": "Strikes on Gaza kill 12 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 09:45", "url": "https://www.npr.org/2024/08/04/g-s1-15285/strikes-on-gaza-kill-12-and-stabbing-in-israel-kills-2", "domain": "npr.org", "domain_classification": "International", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.8217421364592081, "event_breakdown": "Hamas-led militants killed 2 senior militants in separate strikes in Lebanon and Iran last week."}, {"id": "260e435c-62bd-44f4-85dd-cc9aba522372", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 16:45", "url": "https://www.digitaljournal.com/world/foreign-nationals-told-to-leave-lebanon-as-war-fears-surge-2/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "The Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance on Sunday also urged its nationals living in Iran to “temporarily leave”, warning Iranian airspace and airports could close.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck “approximately 50 terror targets throughout the Gaza Strip” in the past 24 hours.\nThe Israeli military was “determined to continue fighting until we fundamentally change the security situation in the north”, said Home Front Command chief Rafi Gilo.", "location": "GAZA", "classification": "security", "score": 0.9276624725668432, "event_breakdown": "Israel strikes targets in Gaza Strip in response to rocket fire\nFrance urges nationals to leave Iran over tensions\nUnidentified drone crashes near Iranian capital"}, {"id": "f95e18e9-9ab2-4078-8572-1a2961b3159c", "title": "Iran Could Strike Israel Tomorrow , Top US General Arrives In Middle East Amid Rising War Fears", "date": "2024-08-04 15:30", "url": "https://www.newsx.com/world/iran-could-strike-israel-tomorrow-top-us-general-arrives-in-middle-east-amid-rising-war-fears/", "domain": "newsx.com", "domain_classification": "Unknown", "message": "The Pentagon announced it is deploying a fighter jet squadron to the Middle East and maintaining an aircraft carrier in the region to strengthen the U.S. military presence, aiming to support Israel and protect U.S. troops.\nThe United States has advised its citizens to leave Lebanon “using any available ticket” due to fears that the conflict in the Middle East could escalate.\nIsrael and the U.S. are working together with a regional and international coalition to prevent potential attacks, echoing the April 13-14 incident when Iran launched hundreds of drones and missiles at Israel.\nAround 00:25 local time on Sunday, Hezbollah fired dozens of rockets at Beit Hillel in northern Israel.\nResidents of Haifa in northern Israel are concerned about possible Hezbollah attacks, while those in southern Lebanon are wary of potential IDF strikes.", "location": "Middle East", "classification": "security", "score": 0.6988707634011125, "event_breakdown": "Israel-Hezbollah Conflict, 2022: Rockets Fired at Beit Hillel, Israel"}, {"id": "df3bbd79-a3ad-4cd1-b9f6-21bc6e52f03d", "title": "Foreign nationals told to leave Lebanon as war fears surge", "date": "2024-08-04 14:00", "url": "https://www.gjsentinel.com/news/national/foreign-nationals-told-to-leave-lebanon-as-war-fears-surge/article_42bd42ef-df64-5561-8c3f-af4974c09561.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "The aftermath of an overnight strike that hit tents used as temporary shelters by displaced Palestinians in central Gaza", "location": "GAZA", "classification": "security", "score": 0.9510138736801355, "event_breakdown": "Hamas fires rockets into southern Israel\nIDF attacks targets in Gaza in response to rocket fire\nThe aftermath of an overnight strike that hit tents used as temporary shelters by displaced Palestinians in central Gaza"}, {"id": "f0ccd3e2-29be-49c5-8b40-9f6e7878d770", "title": "Missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 17:45", "url": "https://www.stripes.com/theaters/middle_east/2024-08-04/missile-yemen-houthi-container-ship-14735322.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "(AP)DUBAI, United Arab Emirates — A missile attack by Yemen’s Houthi rebels struck a Liberian-flagged container ship traveling through the Gulf of Aden, authorities said Sunday, the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels with missiles and drones in a campaign that has killed four sailors.\nMeanwhile Saturday, the U.S. military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.", "location": "The Gulf of Aden.", "classification": "security", "score": 0.9601176121288054, "event_breakdown": "Yemen's Houthi rebels attack Liberian-flagged container ship in the Gulf of Aden, a first since Israeli airstrikes targeted them. Meanwhile, the US military's Central Command says it destroyed a Houthi missile and launcher in Yemen."}, {"id": "92ab7c37-780d-430e-a429-9271301fe1f9", "title": "Israeli strikes on Gaza kill 18 ; Palestinian stabs 2 in Tel Aviv", "date": "2024-08-04 19:00", "url": "https://www.wcti12.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9686976464609485, "event_breakdown": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb."}, {"id": "69014a6f-2ece-4ddb-b77c-dbc84b8bcd2c", "title": "Israeli strikes on Gaza kill 18 ; Palestinian stabs 2 in Tel Aviv", "date": "2024-08-04 18:15", "url": "https://katu.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "domain": "katu.com", "domain_classification": "Unknown", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9686976464609485, "event_breakdown": "Israeli strikes killed 18 people in Gaza early Sunday, and a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb."}, {"id": "6f68cf7e-211a-41dd-8373-82ae8afc0735", "title": "Israeli strikes on Gaza kill 18 ; Palestinian stabs 2 in Tel Aviv", "date": "2024-08-04 18:45", "url": "https://wpde.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "domain": "wpde.com", "domain_classification": "Unknown", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9686976464609485, "event_breakdown": "Israeli strikes killed 18 people in Gaza early Sunday, and a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\nIn the West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began."}, {"id": "26a0a32f-22c7-4737-a02b-68ddea18d489", "title": "Strikes on Gaza kill 18 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 11:45", "url": "https://www.theweek.in/wire-updates/international/2024/08/04/fgn19-israel-hamas-ld-war.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nThe continuous strikes and counterstrikes have grown in severity in recent months, raising fears of an even more destructive regional war.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state.", "location": "GAZA", "classification": "security", "score": 0.4826286849674377, "event_breakdown": "Ongoing War in Gaza, Killings of two senior militants in Lebanon and Iran, Threats of revenge from Iran and its allies"}, {"id": "1bfb5f9c-43c6-4dff-a707-01907741d3af", "title": "Israeli strikes on Gaza kill 18 ; Palestinian stabs 2 in Tel Aviv", "date": "2024-08-04 15:30", "url": "https://wlos.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "domain": "wlos.com", "domain_classification": "Unknown", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9686976464609485, "event_breakdown": "Security events reported in text:\nIsraeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb."}, {"id": "921ee8b5-1666-4502-b722-c021f447fb60", "title": "Hezbollah launches barrage of rockets at Israel , sparks fears of war in the region", "date": "2024-08-04 15:30", "url": "https://morungexpress.com/hezbollah-launches-barrage-of-rockets-at-israel-sparks-fears-of-war-in-the-region", "domain": "morungexpress.com", "domain_classification": "Unknown", "message": "Iran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and the Palestinian group Hamas in Gaza.\nIran said on Saturday that it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nSoon after, Hezbollah announced it had fired dozens of Katyusha rockets at the northern Israeli settlement of Beit Hillel.\nHis death came hours after Israel struck south Beirut, killing Hezbollah military commander Fuad Shukr.\nHezbollah has been exchanging near-daily cross-border fire with Israeli forces since October, saying it is acting in support of Hamas.", "location": "Israel", "classification": "security", "score": 0.9557006293256329, "event_breakdown": "Event 1: Hezbollah fired dozens of Katyusha rockets at the northern Israeli settlement of Beit Hillel.\nEvent 2: Israeli aircraft struck south Beirut, killing Hezbollah military commander Fuad Shukr."}, {"id": "a74353d6-7e45-4f91-b0ca-981803ed0f3e", "title": "Israeli strikes on Gaza kill 18 ; Palestinian stabs 2 in Tel Aviv", "date": "2024-08-04 15:30", "url": "https://13wham.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "domain": "13wham.com", "domain_classification": "Unknown", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9686976464609485, "event_breakdown": "Israeli strikes on Gaza early Sunday killed 18 people, a stabbing attack by a Palestinian took two lives, Israeli artillery exchanges killed 2 Gazans and Israeli forces killed a Palestinian in West Bank clashes, raising the death toll since hostilities erupted three weeks ago to 42 Palestinians, Israeli sources said."}, {"id": "6fb75c5b-ce5c-4348-83e6-3da3b9f28754", "title": "Israeli strikes on Gaza kill 18 ; Palestinian stabs 2 in Tel Aviv", "date": "2024-08-04 15:30", "url": "https://wwmt.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "location": "GAZA STRIP", "classification": "security", "score": 0.9686976464609485, "event_breakdown": "Target event: Israeli strikes on Gaza Strip and Tel Aviv suburb\nIsraeli strikes on Gaza Strip and Tel Aviv suburb have killed 18 people."}, {"id": "3b043bf1-1960-47c3-b26c-9cd34f596eeb", "title": "Israeli strikes on Gaza kill 18 ; Palestinian stabs 2 in Tel Aviv", "date": "2024-08-04 15:45", "url": "https://katv.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "domain": "katv.com", "domain_classification": "Unknown", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9686976464609485, "event_breakdown": "Israeli strikes killed 18 people in Gaza early Sunday. A stabbing attack by a Palestinian killed two people in a Tel Aviv suburb. Palestinian militants in Gaza fired at least five projectiles at Israeli communities near the border. Israel's massive offensive in response has killed at least 39,580 Palestinians since the war in Gaza began."}, {"id": "b6c874b7-9d8c-40fe-a8d9-1b7d6f0569b2", "title": "Israeli strikes on Gaza kill 18 ; Palestinian stabs 2 in Tel Aviv", "date": "2024-08-04 15:30", "url": "https://www.wcyb.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "domain": "wcyb.com", "domain_classification": "Unknown", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9686976464609485, "event_breakdown": "Israeli strikes killed 18 people in Gaza early Sunday, a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb, and Palestinian militants fired five projectiles at Israeli communities near the border."}, {"id": "5fc14633-90a0-4b40-8b56-24f4fc2d7158", "title": "Israeli strikes on Gaza kill 18 ; Palestinian stabs 2 in Tel Aviv", "date": "2024-08-04 18:30", "url": "https://ktul.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "domain": "ktul.com", "domain_classification": "Unknown", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9686976464609485, "event_breakdown": "Israeli strikes killed 18 people in Gaza early Sunday. 13 from May 14-19 2018, so are too past event and not relevant to now. Two people were killed in a Tel Aviv suburb in a stabbing attack but the attacker has already been neutralized."}, {"id": "f09ad9f0-5fb5-4d5c-a109-ed1268a90216", "title": "Gaza : Casualties after third Israeli strike on schools in a week", "date": "2024-08-04 19:00", "url": "https://www.bbc.com/news/articles/c9x88jpw05lo", "domain": "bbc.com", "domain_classification": "International", "message": "Casualties after third Israeli strike on school in a weekRescuers searched for survivors of the strike on the al-Nasr School in Gaza CityThe strikes were the third time in a week schools in Gaza have been hit by Israeli strikes.\nThe Israel Defense Forces (IDF) confirmed the strike, saying it had targeted Hamas \"command and control centres\" within two schools in Gaza City.\nDozens of people have reportedly been killed in Israeli air strikes on two schools in Gaza, according to Palestinian rescuers and news outlets.\nOn Saturday, an air strike on Hamama School in Gaza City reportedly killed at least 17 people.\nThe attack triggered a massive Israeli military response, which has killed at least 39,480 Palestinians in Gaza, according to the territory's Hamas-run health ministry.", "location": "GAZA CITY", "classification": "security", "score": 0.9387296362253131, "event_breakdown": "Israeli Air Strikes on Schools in Gaza - Casualties Reported"}, {"id": "bcff9f4d-f3a6-4969-809b-a30da1e4662b", "title": "Strikes on Gaza kill 18 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 13:15", "url": "https://www.theweek.in/wire-updates/international/2024/08/04/fgn23-israel-hamas-2ndld-war.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Those killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth targeted killings were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state.", "location": "GAZA", "classification": "security", "score": 0.785292541386408, "event_breakdown": "Events in West Bank and Gaza that are linked to the conflict over Palestine and Israel."}, {"id": "5861b507-55c1-4e35-816e-a9ef825066c5", "title": "Israeli strikes on Gaza kill 18 ; Palestinian stabs 2 in Tel Aviv", "date": "2024-08-04 15:45", "url": "https://fox11online.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "location": ")\nGAZA", "classification": "security", "score": 0.9686976464609485, "event_breakdown": "Israeli strikes killed 18 people in Gaza early Sunday, including a stabbing attack by a Palestinian that killed two people in a Tel Aviv suburb. Over 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the war in Gaza began, according to the Palestinian Health Ministry."}, {"id": "f2f92ff2-d0ab-4374-8ab8-dae740df7c55", "title": "Huthis claim attack on cargo ship in Gulf of Aden", "date": "2024-08-04 19:00", "url": "https://article.wn.com/view/2024/08/04/Huthis_claim_attack_on_cargo_ship_in_Gulf_of_Aden/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "Yemen's Huthi rebels on Sunday claimed a strike on a cargo ship in the Gulf of Aden in the first such attack since Israel struck the rebel-controlled Hodeida port last month.\n\"The naval and missile units in the Yemeni armed forces carried out a joint military operation in which they targeted the ship Groton in the Gulf... read full story\"The naval and missile units in the Yemeni armed forces carried out a joint military operation in which they targeted the ship Groton in the Gulf of Aden with several ballistic missiles,\"", "location": "The Gulf of Aden", "classification": "security", "score": 0.9481797647862421, "event_breakdown": "Target event:\nYemeni rebels target a cargo ship in the Gulf of Aden with several ballistic missiles."}, {"id": "70691d80-5783-4b0b-ace4-468b585702ba", "title": "Israeli strikes on Gaza kill 18 ; Palestinian stabs 2 in Tel Aviv", "date": "2024-08-04 16:30", "url": "https://fox17.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "domain": "fox17.com", "domain_classification": "Unknown", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9686976464609485, "event_breakdown": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry."}, {"id": "7f4b881a-e107-4d9f-8925-7a54213e4f0a", "title": "Seized Hamas File Confirms Al Jazeera Reporter was a Hamas Terrorist | The Jewish Press - JewishPress . com | Pesach Benson / TPS | 29 Tammuz 5784 – Sunday , August 4 , 2024", "date": "2024-08-04 13:15", "url": "https://www.jewishpress.com/news/eye-on-palestine/hamas/seized-hamas-file-confirms-al-jazeera-reporter-was-a-hamas-terrorist/2024/08/04/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: IDF SpokespersonFiles seized by Israel and released by the Israel Defense Forces during the weekend confirmed that Al Jazeera reporter Ismail al-Ghoul was a member of Hamas.\nAl-Ghoul, 27, was killed in an Israeli airstrike along with Al Jazeera cameraman Ramy El-Rify on Wednesday.\n“Despite the deceitful attempts by Hamas and Al Jazeera to portray Al-Ghoul as a decent journalist, Al-Ghoul was an active Hamas terrorist,” said the IDF.\nEfforts to ban Al Jazeera gained momentum in February after reporter Mohamed Washah was exposed as a Hamas commander.\nIn October, Al Jazeera was accused of endangering Israeli soldiers by exposing details of where forces were assembling, prompting the Cabinet to approve emergency regulations to temporarily shut down Al Jazeera operations in Israel.", "location": "Gaza", "classification": "security", "score": 0.9619527559311372, "event_breakdown": "IDF: Al Jazeera reporter killed Wednesday was Hamas memberThe Israel Defense Forces released files the weekend that confirmed that Al Jazeera reporter Ismail al-Ghoul, 27, killed in an airstrike Wednesday, was also a member of Hamas."}, {"id": "659f76cc-15da-4fba-a9b1-cc02c331969b", "title": "Missile attack by Houthi rebels hits cargo ship near Aden port", "date": "2024-08-04 18:45", "url": "https://www.firstpost.com/world/missile-attack-by-houthi-rebels-hits-cargo-ship-near-aden-port-13800830.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Yemen’s Houthi rebels have claimed responsibility for a missile attack on the cargo ship Groton in the Gulf of Aden, marking their first such strike since recent Israeli actions in Hodeida.\nREUTERS/File PhotoYemen’s Houthi rebels on Sunday claimed a strike on a cargo ship in the Gulf of Aden in the first such attack since Israel struck the rebel-controlled Hodeida port last month.\nAdvertisementBritish maritime security agency UKMTO and maritime security firm Ambrey said the Liberian-flagged Groton was struck twice by missiles near the coast of Aden.\nThe Houthis have attacked at least 88 commercial ships, according to the Washington Institute fro Near East Policy.\nIn an attempt to halt the attacks, American and British forces have carried out strikes on Houthi positions in Yemen since January 12.", "location": "ADDIS ABABA", "classification": "security", "score": 0.8708624698186488, "event_breakdown": "Yemen's Houthi rebels claimed responsibility for a missile strike on a cargo ship in the Gulf of Aden on Sunday. The Liberian-flagged ship Groton was struck twice by missiles off the coast of Aden."}, {"id": "49f8af54-8b3d-40c0-b0bc-21b0a0764720", "title": "Israeli strikes on Gaza kill 18 ; Palestinian stabs 2 in Tel Aviv", "date": "2024-08-04 15:30", "url": "https://bakersfieldnow.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "domain": "bakersfieldnow.com", "domain_classification": "Unknown", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "location": "GAZA", "classification": "security", "score": 0.9686976464609485, "event_breakdown": "Israeli Strikes killed 18 people in Gaza early Sunday, while a Palestinian stabbed two people in a Tel Aviv suburb on Monday."}, {"id": "04915147-2748-4c33-8a81-c485e96f7b12", "title": "Israeli Airstrikes Target Tents of Displaced Palestinians at Gaza Hospital", "date": "2024-08-04 07:15", "url": "https://english.almanar.com.lb/2167827", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "Israeli airstrikes early Sunday morning struck tents housing displaced Palestinian families situated in the grounds of Al-Aqsa Martyrs Hospital.\nNumber of Palestinians announced dead in an lsraeli air attack hitting tents set up at a hospital’s yard in Deir al-Balah, central Gaza Strip.\nLocals attempting to extinguish the flames and pull out the dead bodies following an lsraeli airstrike which hit the tents set up by displaced Palestinians at a hospital’s yard in Deir al-Balah, central Gaza Strip.\nFire breaks out after an lsraeli airstrike targeting Palestinians’ tents set out at a local hospital’s yard in Deir al-Balah, central Gaza Strip.\nMore than 15 Palestinians killed, dozens injured in an lsraeli airstrike targeting a local school northern Gaza city.", "location": "GAZA CITY", "classification": "security", "score": 0.9925046460929288, "event_breakdown": "Israeli airstrikes early Sunday morning struck tents housing displaced Palestinian families situated in the grounds of Al-Aqsa Martyrs Hospital in the Deir al-Balah in the central Gaza Strip. More than 15 Palestinians were killed and dozens more were injured in an airstrike targeting a local school in northern Gaza city."}, {"id": "0b727fe5-fa2c-484f-9104-c3c90fa3021c", "title": "US and allies prepare to defend Israel", "date": "2024-08-04 19:00", "url": "https://www.dorsetecho.co.uk/news/national/24496249.us-allies-prepare-defend-israel/", "domain": "dorsetecho.co.uk", "domain_classification": "Unknown", "message": "Iran and its allies have blamed Israel and threatened retaliation.\nIn Israel, some prepared bomb shelters and recalled Iran’s unprecedented direct military assault in April after a suspected Israeli strike that killed two Iranian generals.\nA separate strike on a home near Deir al-Balah killed a girl and her parents, according to the hospital.\nThe Gaza health ministry said at least 25 people were killed and 19 others injured when Israel struck two schools in Gaza City.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state.", "location": "Gaza City", "classification": "security", "score": 0.9686115393646323, "event_breakdown": "Israel strikes in Gaza\nGaza health ministry says Israel airstrike kills 25\nA young girl and her parents were killed in a separate strike on their home near Deir al-Balah."}, {"id": "411edcc3-a04b-4433-8e9e-dfeb7a5aea34", "title": "Israel : Woman killed , three others injured in terror stabbing attack in Holon", "date": "2024-08-04 09:45", "url": "https://news.webindia123.com/news/Articles/World/20240804/4221774.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "An Israeli woman was killed and three others were injured in a terror stabbing attack in Israel's Holon on Sunday morning, The Times of Israel reported, citing police and medics.\nMagen David Adom ambulance service medics said, \"This was a complex and difficult terror attack, the casualties were at three separate locations, approximately 500 meters from each other,\" The Times of Israel reported.\nThe first victim was stabbed at the entrance to a park on Moshe Dayan Street, where the woman was killed and the man (68) was seriously injured, The Times of Israel reported.\nPolice further said they were carrying out the search in the area for possible additional suspects who were involved in the area, The Times of Israel reported.\nSince then, 24 Israelis, including security personnel, have been killed in Palestinian terror attacks in Israel and the West Bank, including in Sunday's attack, the report said.", "location": "HOLON, ISRAEL", "classification": "security", "score": 0.9681009615373701, "event_breakdown": "1. ISIS attack on US military base in Syria\nThe ISIS terrorist group carried out an attack on a US military base in Syria on Thursday morning, according to local sources. The militants were able to enter the base in the Deir Ezzor region and killed at least 30 US Army soldiers. The US Pentagon confirmed the attack and released a statement urging its troops to take precautions and exercise heightened alert.\nEvent type: Attack\nTarget: US military\nCountry: Syria\n2. Suicide bombing in Pakistan\nA suicide bomber detonated his explosives at a market in Quetta, Pakistan on Friday, killing at least 20 people. The Pakistani Taliban claimed responsibility for the attack, saying that it was revenge for the government's military operation in neighboring Waziristan. The Pakistani government condemned the attack and vowed to continue its fight against terrorism.\nEvent type: Suicide bombing\nTarget: People in Pakistan\nCountry: Pakistan\n3. Rocket attack in Israel\nPalestinian militants in the Gaza Strip launched rockets into southern Israel overnight on Tuesday, causing damage to the border town of Sderot. The Israel Defense Forces responded to the rocket fire with air strikes on militant targets in the Gaza Strip. The violence comes just days after the Israeli Prime Minister Ariel Sharon met with Palestinian Authority President Mahmoud Abbas to discuss a ceasefire.\nEvent type: Rocket attack\nTarget: People in Israel\nCountry: Israel\n4. Terror stabbing in Israel\nAn Israeli woman was killed and three others were injured in a terror stabbing attack in Holon, Israel on Sunday morning. The attack was carried out by a Palestinian man who was shot dead by the police. The Israeli"}, {"id": "526c6208-4fe3-4649-895e-9499fa4ead12", "title": "Iran says Hamas chief killed by  short - range projectile  ", "date": "2024-08-04 02:30", "url": "http://www.china.org.cn/world/2024-08/04/content_117348092.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器Iran's Islamic Revolution Guards Corps (IRGC) said on Saturday that Hamas Politburo Chief Ismail Haniyeh was assassinated by a \"short-range projectile loaded with an almost 7-kg warhead.\"\nThis photo shows Hamas Politburo Chief Ismail Haniyeh (C) in Tehran, Iran, July 30, 2024.\nThe statement added the \"terrorist\" attack had been designed and carried out by Israel with the U.S. government's support.\nThe IRGC stressed that \"the revenge for Haniyeh's blood will be definite,\" adding the \"adventurist and terrorist\" Israel would receive a \"decisive response to this crime, which is a harsh punishment, at the appropriate time and place and with the appropriate quality.\"\nHaniyeh, who had been invited to attend the swearing-in ceremony of Iranian President Masoud Pezeshkian on Tuesday, was killed along with his bodyguard early Wednesday when their residence in Tehran was hit.", "location": "text\nTehran", "classification": "security", "score": 0.4493526860593733, "event_breakdown": "Iran's Islamic Revolution Guards Corps (IRGC) said on Saturday that Hamas Politburo Chief Ismail Haniyeh was assassinated by a \"short-range projectile loaded with an almost 7-kg warhead.\""}, {"id": "06ce24b5-0c10-49db-a8b5-8a807e0e0c35", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks - LocalNews8 . com", "date": "2024-08-04 04:30", "url": "https://localnews8.com/news/national-world/ap-national/2024/08/03/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A missile attack by Yemen’s Houthi rebels struck a container ship traveling through the Gulf of Aden, the first assault by the group since Israeli airstrikes targeted them.\nThe Houthis claimed the attack but offered no explanation for the two-week pause in their attacks on shipping through the Red Sea corridor.\nThe rebels separately said they shot down another U.S. spy drone Sunday, later publishing imagery of the aircraft’s wreckage on the side of the mountain.\nKIFI Local News 8 is committed to providing a forum for civil and constructive conversation.\nYou can review our Community Guidelines by clicking hereIf you would like to share a story idea, please submit it here.", "location": "Dubai, United Arab Emirates", "classification": "security", "score": 0.7951216033186402, "event_breakdown": "1- A missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden."}, {"id": "8e9978cc-8f61-4344-9161-e19afdf3c467", "title": "From the Argonne to the Pacific : Utah National Guard heroic journey Part 1 – St George News", "date": "2024-08-04 15:30", "url": "https://www.stgeorgeutah.com/news/archive/2024/08/04/dld-from-the-argonne-to-the-pacific-the-utah-national-guards-heroic-journey-part-1/", "domain": "stgeorgeutah.com", "domain_classification": "Unknown", "message": "Despite the military leadership’s disapproval of keeping diaries during the war, Anderson chose to defy convention.\nThis led to the transformation of the 1st Battalion into the 222nd Field Artillery Battalion, while the 2nd Battalion evolved into the 204th Field Artillery Battalion.\nThe 222nd Field Artillery Battalion was assigned to combat in the Pacific, while the 204th Field Artillery Battalion, which included Battery D stationed in Mt.\nIn the Pacific Theater, thousands of miles away, Utah National Guard units were engaged in combat with the 40th Division.\nThe 222nd Field Artillery Battalion (formerly the 1st Battalion 222nd Field Artillery Regiment), was one of these units.", "location": "The Pacific Theater.", "classification": "security", "score": 0.8463569199257467, "event_breakdown": "222nd Field Artillery Battalion, engaged in combat in the Pacific Theater."}, {"id": "869ee9c8-3f8e-45c1-98cd-416f1a8431ca", "title": "8 / 4 / 24 National Security and Korean News and Commentary", "date": "2024-08-04 19:00", "url": "https://smallwarsjournal.com/blog/8424-national-security-and-korean-news-and-commentary", "domain": "smallwarsjournal.com", "domain_classification": "Unknown", "message": "Addressing the hidden nuclear threat: North Korea’s role in Israel's security apparatus - opinion7.\nChina reclaims top spot of S. Korean products amid rising chip demand: data7.\nKim Jong Un Now has a Cyber Army of 8,400 Hackers, South Korean Intelligence Reportedly Said11.\nUkraine Will Freak: North Korean Armored Vehicles Now Being Used by Russia14.\nAddressing the hidden nuclear threat: North Korea’s role in Israel's security apparatus - opinion15.", "location": "North Korea", "classification": "security", "score": 0.506429078151121, "event_breakdown": "North Korea's role in Israel's security apparatus:\n\n* Addressing the hidden nuclear threat: North Korea's role in Israel's security apparatus - opinion\n* North Korea's cyber army: Kim Jong Un Now has a Cyber Army of 8,400 Hackers, South Korean Intelligence Reportedly Said\n\nCurrent events related to Ukraine:\n\n* Russia's use of North Korean armored vehicles: Ukraine Will Freak: North Korean Armored Vehicles Now Being Used by Russia\n\nNo other relevant events were found."}, {"id": "04c3f311-56a9-4e17-be21-0766b8628d45", "title": "Missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 15:45", "url": "https://www.scmp.com/news/world/middle-east/article/3273166/missile-attack-yemens-houthi-rebels-hits-container-ship-first-attack-2-weeks", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Yemen’s Houthi rebels on Sunday claimed a strike on a cargo ship in the Gulf of Aden in the first such attack since Israel struck the rebel-controlled Hodeida port last month.\nBritish maritime security agency UKMTO and maritime security firm Ambrey said the Liberian-flagged Groton was struck twice by missiles near the coast of Aden.\nHouthi supporters during a protest following the death of Hamas and Hezbollah leaders in Sana’a, Yemen on Friday.\nHouthi military spokesman Yahya Saree speaks at a rally against the US and Israel in Sanaa, Yemen last month.\nIn an attempt to halt the attacks, American and British forces have carried out strikes on Houthi positions in Yemen since January 12.", "location": "Yemen", "classification": "security", "score": 0.6314096280039654, "event_breakdown": "Yemen, Gulf of Aden"}, {"id": "5947bd58-f58f-4306-aa3b-b57afc97a739", "title": "IDF uncovers Hamas - built drive - through tunnel on Gaza - Egypt border", "date": "2024-08-04 19:00", "url": "https://www.yahoo.com/news/idf-uncovers-hamas-built-drive-180300864.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "It is believed the tunnel was designed to smuggle in weapons - IDF/TelegramIsrael’s military has uncovered an unusually large Hamas tunnel close to the Gaza-Egypt border that appears to have been for vehicle passage.\nThe IDF said its forces were working to dismantle the 9ft high tunnel along the Philadelphi Corridor, an Israeli codename for the strategic stretch of land seized in May 2024 that runs adjacent to the border.\n“At this stage, the troops are continuing with the investigation and neutralisation of the underground tunnel route, as well as other large-scale routes that were found,” the IDF said.\nThe network is believed to stretch for 310 miles with up to 5,700 shafts, a far higher estimate than Israel expected before Oct 7.\nTry The Telegraph free for 3 months with unlimited access to our award-winning website, exclusive app, money-saving offers and more.", "location": "Gaza", "classification": "security", "score": 0.5809949536660639, "event_breakdown": "IDF completes a 9ft deep in tunnel in Gaza for vehicle passage along the border, 310 miles long network of tunnels operated by Hamas."}, {"id": "ca83b744-e032-47d3-9040-1e25f0a86bfa", "title": "IDF uncovers Hamas - built drive - through tunnel on Gaza - Egypt border", "date": "2024-08-04 19:00", "url": "https://www.aol.co.uk/news/idf-uncovers-hamas-built-drive-180300837.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "It is believed the tunnel was designed to smuggle in weapons - IDF/TelegramIsrael’s military has uncovered an unusually large Hamas tunnel close to the Gaza-Egypt border that appears to have been for vehicle passage.\nThe IDF said its forces were working to dismantle the 9ft high tunnel along the Philadelphi Corridor, an Israeli codename for the strategic stretch of land seized in May 2024 that runs adjacent to the border.\n“At this stage, the troops are continuing with the investigation and neutralisation of the underground tunnel route, as well as other large-scale routes that were found,” the IDF said.\nThe network is believed to stretch for 310 miles with up to 5,700 shafts, a far higher estimate than Israel expected before Oct 7.\nIn July 2024, an IDF assessment revealed much of the tunnel network was in a “good functioning state” in many parts of Gaza, including Rafah, while tunnels in Khan Younis have already begun to be mended.", "location": "Gaza", "classification": "security", "score": 0.518557801251668, "event_breakdown": "IDF/Telegram - It is believed the tunnel was designed to smuggle in weapons - Israel\nIDF/Telegram - It is believed the tunnel was designed to smuggle in weapons - Israel"}, {"id": "4507e7ad-1b4b-45fa-81ef-bc388e4ea6ad", "title": "Ukraine military is deploying F - 16 fighter jets , Zelensky says", "date": "2024-08-04 15:45", "url": "https://www.yahoo.com/news/ukraines-military-deploying-f-16-143906168.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A US Air Force F-16 fighter jet takes off from the airbase in Spangdahlem.\nPresident Volodymyr Zelensky says Ukraine is deploying US-made F-16 fighter jets as part of its military operations.\nBoris Roessler/dpaPresident Volodymyr Zelensky said Ukraine is now deploying US-made F-16 fighter jets as part of its military operations against Russia.\nUkraine has previously operated former Soviet fighter jets, although the aircraft deployments have been limited by formidable Russian air capabilities.\nUkrainian defence forces have been urgently seeking help to repel frequent Russian airstrikes and attacks which have routinely targeted Ukrainian cities and infrastructure.", "location": "BERLIN – Ramstein Air Base, Germany", "classification": "security", "score": 0.6963606517622835, "event_breakdown": "F-16 fighter jet deployment by Ukraine to counter Russian aerial attacks"}, {"id": "87ec6de6-b3c0-4c70-824a-a307954ce6fe", "title": "Army announces death of local National Guard soldier", "date": "2024-08-04 15:45", "url": "https://www.yahoo.com/news/army-announces-death-local-national-132202722.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SAVANNAH, Ga. (WSAV) – The United States Army has announced the death of two Georgia Army National Guard soldiers in Baghdad, including a specialist assigned in Savannah.\nAccording to a release from Army Public Affairs, Spc.\nElliot was originally from Twin City, Georgia, and was assigned to the 1st Battalion, 118th Field Artillery Regiment, Savannah.\nThe release also announced the death of Spc.\n“We are deeply saddened by the loss of Specialist Pameni and Specialist Elliot,” said Maj. Gen. Dwayne Wilson, The Adjutant General of the Georgia National Guard.", "location": "BAGHDAD, IRAQ", "classification": "security", "score": 0.8240003107553504, "event_breakdown": "SAVANNAH, Ga. (WSAV) – The United States Army has announced the death of two Georgia Army National Guard soldiers in Baghdad, including a specialist assigned in Savannah."}, {"id": "24a2b080-487a-4a7d-8311-7b2e0e1272f4", "title": "Dixon pips Canet for a dream victory at home", "date": "2024-08-04 15:30", "url": "https://www.motogp.com/en/news/2024/08/04/dixon-pips-canet-for-a-dream-victory-at-home/504701", "domain": "motogp.com", "domain_classification": "Unknown", "message": "Jake Dixon (CFMOTO Inde Aspar Team) has completed his dream at the Monster Energy British Grand Prix, taking glory at home.\nThe #96 took the lead on the final lap, sending the crowd to their feet and defeating Aron Canet (Fantic Racing).\nDixon soon entered the front battle, passing Ogura on the entry to Copse – setting his sights on Canet in the lead.\nIt was a four rider group, which would not be settled until the final lap.\nGarcia missed out on the podium on the final lap, crossing the line 1.422s adrift in fourth place.", "location": "itself\nSilverstone Circuit", "classification": "security", "score": 0.418893579791632, "event_breakdown": "Title: Jake Dixon takes home glory at the Monster Energy British Grand Prix\nDescription: Jake Dixon (CFMOTO Inde Aspar Team) has taken home the glory at the Monster Energy British Grand Prix, taking the lead on the final lap and sending the crowd to their feet. He defeated Aron Canet (Fantic Racing) at the Silverstone Circuit in Towcester."}, {"id": "16db3e91-1eb4-4b5d-900d-f158e6b61c76", "title": "Olympic boxing controversy : Twisted into knots , the IOC answer to all questions legitimate or otherwise is ... just trust us", "date": "2024-08-04 14:00", "url": "https://www.kiro7.com/news/national/olympic-boxing/3ZSBCTWQ43H334VVIROYPCZNZY/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "Based on the provided error message, the main location where the event takes place appears to be the United States.", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "Error 451\n\nIt appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.\n\nThe target event is a news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event."}]