[{"id": "a3317791-efdd-4562-9a03-e3094c17db0c", "title": "Zelensky assassination plot : Ukraine arrests two officials for treason over alleged Russian plot", "date": "2024-05-07 13:45", "url": "https://edition.cnn.com/2024/05/07/europe/zelensky-assassination-plot-ukraine-russia-intl/", "message": "CNN —Ukraine has detained two security officials allegedly involved in a Russian plot to assassinate President Volodymyr Zelensky, which Kyiv’s state security service (SBU) said it foiled.\nThe prosecutor’s office said one of the suspects received two drones and ammunition from Russia’s state security service (FSB), which they intended to transfer to another accomplice to carry out an explosion.\nZelensky has reportedly faced several attempts on his life since Russia began its full-scale invasion of Ukraine in February 2022.\nA woman from the southern Ukrainian region of Mykolaiv was arrested in August 2023 in connection to a plot to assassinate Zelensky.\nThe SBU said it caught the woman “red-handed” as she tried “to pass intelligence to the invaders.”In April, a Polish man was accused of assisting another alleged Russian assassination plot against Zelensky.", "location": "The main location where the main event takes place is Ukraine.", "classification": "security", "score": 0.5482047404681406, "event_breakdown": "- Location: Ukraine\n  - Ukraine detains two security officials allegedly involved in a Russian plot to assassinate President Volodymyr Zelensky.\n  - One of the suspects received two drones and ammunition from Russia’s state security service (FSB), intending to transfer them to another accomplice to carry out an explosion.\n  - Zelensky has reportedly faced several attempts on his life since Russia began its full-scale invasion of Ukraine in February 2022.\n  - A woman from the southern Ukrainian region of Mykolaiv was arrested in August 2023 in connection to a plot to assassinate Zelensky. The SBU caught her \"red-handed\" as she tried \"to pass intelligence to the invaders.\"\n  - In April, a Polish man was accused of assisting another alleged Russian assassination plot against Zelensky."}, {"id": "a1ce914e-49d7-46af-8c9a-5e04c0939aee", "title": "IDF names two fatalities in Monday drone strike on Metula", "date": "2024-05-07 07:30", "url": "https://www.ynetnews.com/article/skx787vmc", "message": "The IDF said on Tuesday that 31-year old Master sergeant (res.)\nNahman Natan Hertz from the West Bank settlement of Elazar and 31-year old Master sergeant (res.)\nDan Kamkagi from the settlement of Kfar Oranim were killed in the Monday Hezbollahdrone strike on Metula", "location": "Metula", "classification": "security", "score": 0.7273170032607493, "event_breakdown": "- Two Israeli soldiers killed in a Hezbollah drone strike on Metula: Master Sergeant Nahman Natan Hertz from the West Bank settlement of Elazar and Master Sergeant Dan Kamkagi from the settlement of Kfar Oranim."}, {"id": "4c5cd8ec-8332-4572-aebb-a84ee83ff102", "title": "Ukraine Foils Plot To Assassinate Zelensky , Arrests 2 Security Officials", "date": "2024-05-07 15:15", "url": "https://leadership.ng/ukraine-foils-plot-to-assassinate-zelensky-arrests-2-security-officials/", "message": "The Ukrainian State Security Service (SBU) said two government protection unit colonels have been arrested for allegedly planning to assassinate President Volodymyr Zelensky.\nThe SBU said on Tuesday that the officials were apprehended after it exposed a network of agents belonging to Russia’s State Security Service (FSB).\nThe SBU said it had “foiled” the “actively developing plans” to assassinate Zelensky.\nThe Ukrainian security agency said the assassination plot also targeted other senior officials, including the head of the SBU, Vasyl Maliuk, and the head of the Defence Intelligence of Ukraine, Kyrylo Budanov.\nIn August 2023, a woman from the southern Ukrainian region of Mykolaiv was equally arrested over a a plot to assassinate Zelensky.", "location": "The main location where the main event takes place is Ukraine.", "classification": "security", "score": 0.48718316974185566, "event_breakdown": "- Two government protection unit colonels arrested for planning to assassinate President Volodymyr Zelensky\n- Exposed network of agents belonging to Russia’s State Security Service (FSB)\n- \"Foiled\" actively developing plans to assassinate Zelensky\n- Assassination plot targeted other senior officials, including the head of the SBU and the head of the Defence Intelligence of Ukraine\n- Woman from the southern Ukrainian region of Mykolaiv arrested over a plot to assassinate Zelensky"}, {"id": "6f877e9a-1cd3-4472-9262-dc5e88b8b69e", "title": "Teen shot dead by police blows up toilet with homemade bomb", "date": "2024-05-07 03:30", "url": "https://www.perthnow.com.au/news/teen-shot-dead-by-police-blows-up-toilet-with-homemade-bomb-c-14574103", "message": "Footage has resurfaced of the Perth teenager shot dead by police using a homemade explosive to blow up a school toilet two years earlier.\nIn the video, students are left screaming and laughing following the explosion inside Rossmoyne Senior High School in Perth.\nREAD NOWCamera Icon The 16-year-old was shot by police after a carpark stabbing.\nSupplied Credit: NCA NewsWireCamera Icon The Rossmoyne Senior High School student had been enrolled in a deradicalisation program.\nCamera Icon The 16-year-old boy blew up a school toilet with a homemade explosive device.", "location": "Perth, Australia", "classification": "security", "score": 0.9700914613138167, "event_breakdown": "- Location: Rossmoyne Senior High School, Perth\n  Event: Teenager detonates homemade explosive in school toilet\n  Details: A 16-year-old student at Rossmoyne Senior High School in Perth detonated a homemade explosive device in a school toilet. Footage of the incident resurfaced, showing students reacting with screams and laughter following the explosion.\n\n- Location: Perth\n  Event: Police shoot teenager after carpark stabbing\n  Details: The same 16-year-old teenager involved in the school explosive incident was shot dead by police two years later after being involved in a carpark stabbing."}, {"id": "c9f3e1df-cfdf-4037-b811-6865e5e61f25", "title": "Israel : Two reservists killed by Hezbollah fire on Lebanese border", "date": "2024-05-07 10:45", "url": "https://www.prokerala.com/news/articles/a1529040.html", "message": "DO NOT RELEASE----Israel: Two reservists killed by Hezbollah fire on Lebanese border.\nImage Source: IANS NewsTel Aviv/Beirut, May 7 : Two Israeli reservists have been killed in a drone attack by the Lebanese Shiite militia Hezbollah, the Israeli army said on Tuesday.\nThe two 31-year-old soldiers were killed on Monday in an incident on Israel's northern border, the army said.\nAccording to Lebanese reports, four civilians - a couple and their two sons - were killed in an Israeli airstrike in Lebanon on Sunday.\nSince the beginning of the Gaza war seven months ago, there have been repeated military confrontations between Israel's army and the Hezbollah militia in Lebanon on the border, with multiple casualties on both sides.", "location": "Tel Aviv, Israel", "classification": "security", "score": 0.9822786728243467, "event_breakdown": "- Two Israeli reservists killed by Hezbollah fire on Lebanese border\n- Four civilians killed in an Israeli airstrike in Lebanon"}, {"id": "c686afa7-62a0-4188-a309-6375aaac74f1", "title": "Australian Boy Killed by Police Was in Deradicalization Program since Causing School Explosion", "date": "2024-05-07 12:30", "url": "https://www.newsmax.com/world/globaltalk/australia-perth-police-shot-stabbed-boy/2024/05/07/id/1163721/", "message": "The boy had injured a man with a kitchen knife in a hardware store parking lot on Saturday night before police killed him with a single shot.\nWestern Australia Police Commissioner Col Blanch said the boy killed in Perth had been a voluntary participant of the federally funded Countering Violent Extremism program since 2022 when he caused an explosion at a toilet at the Rossmoyne Senior High School, which he attended.\n“To be in a CVE program automatically says that we have concerns about his behavior and his thinking,” Blanch told Perth Radio 6PR.\nHe urged the school community to contact police with any concerns rather sharing those concerns through social media.\nWestern Australia police but had found no links between the Perth boy and an alleged network of teen extremists in the east coast city of Sydney.", "location": "", "classification": "security", "score": 0.7377466128533443, "event_breakdown": "- A boy injured a man with a kitchen knife in a hardware store parking lot on Saturday night.\n- Police killed the boy with a single shot.\n- The boy had been a voluntary participant in the Countering Violent Extremism program since 2022.\n- In 2022, the boy caused an explosion at a toilet in Rossmoyne Senior High School.\n- Western Australia Police Commissioner Col Blanch stated that being in the CVE program indicated concerns about the boy's behavior and thinking.\n- Blanch urged the school community to contact the police with any concerns instead of sharing them on social media.\n- Western Australia police found no links between the Perth boy and an alleged network of teen extremists in Sydney."}, {"id": "1859003e-2b6f-4c1f-b41b-7719bb1f474d", "title": "Iran IRGC Terrorists Sail Warship into Southern Hemisphere", "date": "2024-05-07 03:30", "url": "https://www.breitbart.com/middle-east/2024/05/06/irans-irgc-terrorists-sail-warship-into-southern-hemisphere/", "message": "Iran announced that Shahid Mahdavi, an Islamic Revolutionary Guard Corps (IRGC) warship, crossed the equator into the Southern Hemisphere for the first time.\nThe Shahid Mahdavi is on a “long-distance mission” in international waters, the Iranian state-owned PressTV propaganda outlet reported.\nIranian state media claimed that the warship was “conducting its biggest mission in terms of distance and operation,” without specifying further.\nIran's IRGC Navy floating base Shahid Mahdavi used as mobile platform at sea to launch ballistic missiles.\nDezful medium-range ballistic missile launched from 40-foot containers on the deck of the Shahid Mahdavi.", "location": "The main location where the main event takes place is null. The text mentions the Shahid Mahdavi, an Islamic Revolutionary Guard Corps (IRGC) warship, which is on a long-distance mission in international waters. Therefore, a specific location cannot be determined based solely on this information.", "classification": "security", "score": 0.3213328453789115, "event_breakdown": "- Shahid Mahdavi, an Islamic Revolutionary Guard Corps (IRGC) warship, crossed the equator into the Southern Hemisphere for the first time.\n- The Iranian state-owned PressTV reported that Shahid Mahdavi is on a \"long-distance mission\" in international waters.\n- Iranian state media claimed that the warship is conducting its biggest mission in terms of distance and operation.\n- The IRGC Navy floating base Shahid Mahdavi is used as a mobile platform at sea to launch ballistic missiles.\n- A Dezful medium-range ballistic missile was launched from 40-foot containers on the deck of the Shahid Mahdavi."}, {"id": "b17a0fd2-e041-4eb6-9438-c5b28bb4754f", "title": "Do you know these men ? NSW Police reveal new faces of Wakeley riot after Mar Mari Emmanuel was stavved", "date": "2024-05-07 04:00", "url": "https://www.dailymail.co.uk/news/article-13389131/Search-people-church-riots-Sydney.html", "message": "The first person depicted (Person P) is described as being a man of Mediterranean/Middle Eastern appearance, slim build, with short dark hair.\nHe is shown wearing light coloured clothing, dark coloured shoes and carrying a black bag across his body.\nHe is shown wearing a grey hooded jumper, black cap, black shorts and white shoes.\nHe is shown wearing a black singlet, shorts, cap and shoes.\nShe is shown wearing a singlet top and shorts, with a shirt tied around her waist and a dark coloured cap.", "location": "", "classification": "security", "score": 0.3481636283124513, "event_breakdown": "1. Person P depicted as a man of Mediterranean/Middle Eastern appearance, slim build, with short dark hair, wearing light-colored clothing, dark-colored shoes, and carrying a black bag across his body.\n2. Person P shown wearing a grey hooded jumper, black cap, black shorts, and white shoes.\n3. Person P shown wearing a black singlet, shorts, cap, and shoes.\n4. Another individual depicted wearing a singlet top and shorts, with a shirt tied around her waist and a dark-colored cap."}, {"id": "c489a55a-09c6-4658-b423-718a3c658529", "title": "Early Edition : May 7 , 2024", "date": "2024-05-07 13:00", "url": "https://www.justsecurity.org/95475/early-edition-may-7-2024/", "message": "by Beatrice YahiaSignup to receive the Early Edition in your inbox here.\nHere’s today’s news:ISRAEL-HAMAS WARThe Israeli military said this morning it has “operational control” of the Palestinian side of the Rafah crossing.\nThe “vast majority” of people ordered to evacuate parts of Rafah have left the area, the Israeli military said today.\nHopes for a pause in the fighting have been renewed after Hamas said yesterday it has agreed to a Qatari-Egyptian ceasefire proposal.\nPolice arrested some 125 activists as they broke up a pro-Palestinian demonstration camp at the University of Amsterdam early today.", "location": "Rafah", "classification": "security", "score": 0.5466386467332713, "event_breakdown": "- Israeli military has “operational control” of the Palestinian side of the Rafah crossing.\n- The “vast majority” of people ordered to evacuate parts of Rafah have left the area.\n- Police arrested some 125 activists as they broke up a pro-Palestinian demonstration camp at the University of Amsterdam."}, {"id": "5e352f28-997e-4d1d-b013-809641049dcc", "title": "HRW : Israel attack on Lebanon rescuers was  unlawful  ", "date": "2024-05-07 06:30", "url": "https://www.yahoo.com/news/hrw-israel-attack-lebanon-rescuers-055011584.html", "message": "The March 27 strike levelled the emergency services centre in the Lebanese village of Habariyeh (Rabih DAHER)Human Rights Watch said Tuesday an Israeli strike in Lebanon that killed seven first responders was \"an unlawful attack on civilians\", and urged Washington to suspend weapons sales to Israel.\n\"An Israeli strike on an emergency and relief centre\" in the southern village of Habariyeh on March 27 \"killed seven emergency and relief volunteers\" and constituted an \"unlawful attack on civilians that failed to take all necessary precautions\", HRW said in a statement.\nThe Israeli military did not immediately comment when contacted by AFP.\n\"Israeli forces used a US weapon to conduct a strike that killed seven civilian relief workers in Lebanon who were merely doing their jobs,\" HRW's Lebanon researcher, Ramzi Kaiss, said.\nThe rights group urged the United States to \"immediately suspend arms sales and military assistance to Israel given evidence that the Israeli military is using US weapons unlawfully\".", "location": "The main location where the main event takes place is the Lebanese village of Habariyeh.", "classification": "security", "score": 0.8233622422827552, "event_breakdown": "- The March 27 strike levelled the emergency services centre in the Lebanese village of Habariyeh.\n- Human Rights Watch (HRW) said that the Israeli strike in Lebanon killed seven first responders and constituted an unlawful attack on civilians.\n- HRW called on Washington to suspend weapons sales to Israel.\n- The Israeli military did not immediately comment on the matter.\n- Ramzi Kaiss, HRW's Lebanon researcher, stated that Israeli forces used a US weapon in the strike.\n- HRW urged the United States to immediately suspend arms sales and military assistance to Israel due to evidence of unlawful use of US weapons by the Israeli military."}, {"id": "35266cdf-b66c-4aa6-9e42-d5c580c63931", "title": "US cannot blame Israel for civilian deaths and ignore its own history", "date": "2024-05-07 04:00", "url": "https://www.jpost.com/opinion/article-800170", "message": "Quite frankly, the hypocrisy and holier-than-thou attitude of the United States toward Israel is truly infuriating.\nThe United States had tracked a 53-year-old shepherd in northern Syria with a highly sophisticated Predator Drone.\nTurns out, the United States tracked a simple shepherd named Lufti Hassan Masto thinking he was an al-Qaeda leader.\nIt makes clear that the United States, too, makes mistakes.\nOne report I read brought the total of innocent civilians killed by the United States via drone and missile strikes to 140,000.", "location": "", "classification": "security", "score": 0.8913525392487638, "event_breakdown": ""}, {"id": "cbff0099-bb10-4449-a63c-d3bb02a4b2b4", "title": "It time to for Rafah action - The Jerusalem Post", "date": "2024-05-07 04:00", "url": "https://www.jpost.com/opinion/article-800164", "message": "Entering Rafah will enable Israel to directly confront the terrorist infrastructure that poses an existential threat to its citizens.\nBy establishing a presence in Rafah, Israel would be able to further degrade Hamas’s ability to launch attacks and disrupt its ability to operate with impunity.\nBy showing resolve, Israel can better deter future attacks and create a more secure environment for its people.\nBy intervening in Rafah, Israel can help alleviate human suffering, facilitate the delivery of aid, and provide hope for a better future for all residents of Gaza.\nBy confronting the terrorist threat head-on, Israel can protect its citizens, deter future attacks, and pave the way for a brighter future for everyone in the region.", "location": "Rafah", "classification": "security", "score": 0.44648161792792657, "event_breakdown": "- Entering Rafah.\n- Establishing a presence in Rafah.\n- Intervening in Rafah."}, {"id": "7d401342-24ba-4e9c-ad7e-15540caa950f", "title": "A street in Kharkiv to be named after a fallen IDF soldier", "date": "2024-05-07 00:00", "url": "https://www.jpost.com/diaspora/article-800183", "message": "A street in the city of Kharkiv will be named after Corporal Alexei-Asher Nikov, who was killed in a terrorist attack during an operation in Gush Katif in 1998.\nFollowing his heroic act, the city council of his birthplace, Kharkiv, Ukraine, decided to name a street after him.\nUploaded on 7/5/2024 (credit: Courtesy)Nikov studied at the Jewish school \"Ohr Avner\" in Kharkiv, founded by the city's Chief Rabbi and Chabad emissary, Rabbi Moshe Moskovitz.\nThe school is now located on the street named after Nikov.\nThe initiative was supported by Israeli journalist and historian Shimon Briman, together with the head of the city council, Irina Goncharova, and Rabbi Moshe Moskovitz.", "location": "", "classification": "security", "score": 0.8952024820027247, "event_breakdown": "- A street in the city of Kharkiv will be named after Corporal Alexei-Asher Nikov.\n- Corporal Alexei-Asher Nikov was killed in a terrorist attack during an operation in Gush Katif in 1998.\n- The city council of Kharkiv decided to name a street after him in honor of his heroic act.\n- The street named after Nikov is now the location of the Jewish school \"Ohr Avner\" where Nikov studied.\n- The initiative to name the street after Nikov was supported by Israeli journalist and historian Shimon Briman, the head of the city council Irina Goncharova, and Rabbi Moshe Moskovitz."}, {"id": "a355d56a-f382-4f15-804e-6d66fc4f9afa", "title": "Police appeal for help identifying nine men after Wakeley riot", "date": "2024-05-07 03:30", "url": "https://www.standard.net.au/story/8619653/police-appeal-for-help-identifying-nine-men-after-wakeley-riot/?cs=9676", "message": "Some of those who flocked to the church had gone to support its parishioners, but many others had attended \"for the wrong reasons\", say police.", "location": "", "classification": "security", "score": 0.7461263919157685, "event_breakdown": ""}, {"id": "15b2cff9-61b0-4a4c-88fc-3cf2138b92e5", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-07 11:00", "url": "https://www.irishnews.com/news/world/israeli-forces-take-control-of-gaza-side-of-rafah-crossing-with-egypt-ARECKTAEWRMDXKR2ZRG5P7LXCQ/", "message": "Israeli Prime Minister Benjamin Netanyahu called it an “important step” toward dismantling Hamas’ military and governing capabilities.\nSmoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah (Ramez Habboub/AP) (Ramez Habboub/AP)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nWael Abu Omar, a spokesman for the Palestinian Crossings Authority, acknowledged Israeli forces had seized the crossing and had closed the facility for the time being.", "location": "Rafah", "classification": "security", "score": 0.9230069371281003, "event_breakdown": ""}, {"id": "625edcce-6a61-449a-8a52-60a84e6cad1d", "title": "U . N . Condemns Israel After Mass Graves Found in Gaza", "date": "2024-05-07 05:45", "url": "https://www.mediaite.com/news/u-n-condemns-israel-after-mass-graves-found-in-gaza-bodies-reportedly-showing-signs-of-torture-and-summary-executions/", "message": "The United Nations condemned Israel’s ongoing war in Gaza after the discovery of mass graves discovered at two hospitals.\nIsrael has been waging war in Gaza since the Oct. 7 terrorist attacks in which Hamas militants killed 1,200 Israelis and abducted more than 200 others.\nHamas, which controls Gaza, said on Monday it accepted the terms of a ceasefire agreement proposed by Egypt and Qatar.\nMore than 30,000 Palestinians have been killed in Gaza, where nearly 90% of the population has been displaced.\n“We are horrified at details emerging from mass graves recently unearthed in the Gaza Strip,” the U.N. press release stated.", "location": "", "classification": "security", "score": 0.8788358268649858, "event_breakdown": "- The United Nations condemned Israel’s ongoing war in Gaza after the discovery of mass graves discovered at two hospitals.\n- Israel has been waging war in Gaza since the Oct. 7 terrorist attacks in which Hamas militants killed 1,200 Israelis and abducted more than 200 others.\n- Hamas, which controls Gaza, said on Monday it accepted the terms of a ceasefire agreement proposed by Egypt and Qatar.\n- More than 30,000 Palestinians have been killed in Gaza, where nearly 90% of the population has been displaced.\n- “We are horrified at details emerging from mass graves recently unearthed in the Gaza Strip,” the U.N. press release stated."}, {"id": "cfc8e3ea-f9e8-4bfe-9889-6aa7d366243c", "title": "IRGC warship sails into Southern Hemisphere", "date": "2024-05-07 11:00", "url": "https://www.globalsecurity.org/wmd/library/news/iran/2024/iran-240505-isna01.htm", "message": "IRGC's warship sails into Southern HemisphereISNA - Iranian Students' News AgencySun / 5 May 2024 / 11:46A domestically-developed oceangoing warship operated by Iran's Islamic Revolution Guards Corps (IRGC) Navy has crossed the line of zero degrees latitude, the Equator, and sailed into the Southern Hemisphere.\nThe 2,100-tonne vessel, which is 240 meters in length and 27 meters in width, joined the IRGC's naval fleet in March 2023.\nThe oceangoing warship is equipped with a three-dimensional phased array radar, sea-to-sea and sea-to-air missiles, and sophisticated telecommunication systems for electronic warfare.\nIn February 2024, the IRGC Navy launched two ballistic missiles from inside two containers on board the warship.\nLeader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei has repeatedly called for efforts to maintain and boost Iran's defense capabilities.", "location": "Equator", "classification": "security", "score": 0.9706203641426284, "event_breakdown": "- IRGC's warship sails into Southern Hemisphere\n- The domestically-developed oceangoing warship operated by Iran's Islamic Revolution Guards Corps (IRGC) Navy crosses the Equator and enters the Southern Hemisphere\n- The 2,100-tonne vessel, equipped with advanced weaponry and technology, joins the IRGC's naval fleet\n- In February 2024, the IRGC Navy launches two ballistic missiles from inside two containers on board the warship\n- Leader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei emphasizes the need to maintain and boost Iran's defense capabilities"}, {"id": "9af555d0-b69e-479c-8b29-9bc5575a663f", "title": "Hamas accepts Gaza truce proposal , Israel urges Rafah evacuation", "date": "2024-05-07 02:15", "url": "https://www.philstar.com/world/2024/05/07/2353268/hamas-accepts-gaza-truce-proposal-israel-urges-rafah-evacuation", "message": "RAFAH, Palestinian territories — Hamas on Monday said it accepts a proposal for a truce in the seven-month-old war in Gaza, as Israel renewed an order for Palestinians in Rafah to evacuate ahead of a long-threatened invasion of the city.\nHamas member Khalil al-Hayya told the Qatar-based Al Jazeera channel the proposal agreed to by Hamas includes a three-phased truce.\nLater, Dujarric said that Guterres called on both Israel and Hamas to \"go the extra mile needed\" to seal a truce.\n'Return all hostages'Soon after the war started, Israel told Palestinians in northern Gaza to move south to \"safe zones\" –- including Rafah.\nEmergency workers said air strikes killed 16 people in Rafah on Sunday, hours after Hamas rockets killed the Israeli soldiers.", "location": "RAFAH", "classification": "security", "score": 0.5893894325447725, "event_breakdown": "- Hamas accepts proposal for truce in Gaza war\n- Israel renews order for Palestinians in Rafah to evacuate\n- Hamas member Khalil al-Hayya announces three-phased truce proposal\n- UN Secretary-General Guterres calls on Israel and Hamas to seal truce\n- Israel instructs Palestinians in northern Gaza to move south to \"safe zones,\" including Rafah\n- Air strikes kill 16 people in Rafah after Hamas rockets kill Israeli soldiers"}, {"id": "19ee1544-e286-4012-a34e-bcf789b4a2fe", "title": "Australian boy killed by police was in deradicalization program since causing school explosion", "date": "2024-05-07 13:15", "url": "https://www.mymotherlode.com/news/asia/3353494/australian-boy-killed-by-police-was-in-deradicalization-program-since-causing-school-explosion.html", "message": "Australian boy killed by police was in deradicalization program since causing school explosionAustralian boy killed by police was in deradicalization program since causing school explosion View PhotoMELBOURNE, Australia (AP) — A 16-year-old boy who was shot dead by police after stabbing a man in the Australian west coast city of Perth had been engaged in a deradicalization program since he detonated a homemade explosive device in a school toilet block two years ago, police said on Tuesday.\nWestern Australia Police Commissioner Col Blanch said the boy killed in Perth had been a voluntary participant of the federally funded Countering Violent Extremism program since 2022 when he caused an explosion at a toilet at the Rossmoyne Senior High School, which he attended.\n“To be in a CVE program automatically says that we have concerns about his behavior and his thinking,” Blanch told Perth Radio 6PR.\nHe urged the school community to contact police with any concerns rather sharing those concerns through social media.\nWestern Australia police but had found no links between the Perth boy and an alleged network of teen extremists in the east coast city of Sydney.", "location": "Perth, Western Australia.", "classification": "security", "score": 0.9181299154438205, "event_breakdown": ""}, {"id": "59072e59-019c-4c69-9620-4a70968e1b8b", "title": "Commander Allied Air Command General James B . Hecker visited the Czech Republic", "date": "2024-05-07 11:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240506-czechmdfa01.htm", "message": "Commander Allied Air Command General James B. Hecker visited the Czech RepublicMinistry of Defence & Armed Forces of the Czech Republic6.5.2024Author: by Filip TesařCommander of the Allied Air Command (AIRCOM) General James B. Hecker visited the Czech Republic on April 29-30th.\nThe Czech Air Force Commander Major General Petr Čepelka accompanied him during his visit of the 21st Tactical Air Force Base Čáslav on Monday.\nGeneral Hecker opined the aircraft with the support of other components should overcome the Russian air defence.\nAccording to General Hecker, the Čáslav Air Force Base, which is being prepared for the F-35 aircraft, is very promising.\nLastly, General Hecker and General Řehka emphasised the importance to continue the support of Ukraine.", "location": "", "classification": "security", "score": 0.7620631986064926, "event_breakdown": "- Commander Allied Air Command General James B. Hecker visited the Czech Republic\n- General Hecker visited the 21st Tactical Air Force Base Čáslav\n- General Hecker expressed the need for aircraft and other components to overcome Russian air defense\n- Čáslav Air Force Base is being prepared for the F-35 aircraft\n- General Hecker and General Řehka emphasized the importance of continuing support for Ukraine"}, {"id": "85365679-0413-4ff8-95d3-de24ec46bb9d", "title": "Mother of Manchester Arena bombing victim to walk to Downing Street to demand new law", "date": "2024-05-07 02:30", "url": "https://news.sky.com/story/mother-of-manchester-arena-bombing-victim-to-walk-to-downing-street-to-demand-new-law-13130839", "message": "The mother of one of the Manchester Arena bombing victims has set off on a 200-mile walk from the spot her son was killed to Downing Street to demand stronger protections against terrorism.\nShe will arrive at Downing Street on 22 May, the seventh anniversary of her son's death.\nThis morning Greater Manchester mayor Andy Burnham joined family and friends, at the AO Arena in central Manchester, to see Ms Murray off at 11am.\nDuring the 186-mile walk to Downing Street, she will be visiting memorials to victims of terror attacks to pay her respects.\nRead more:Injured survivors from Manchester Arena bombing suing MI5Could MI5 have prevented Manchester bombing?", "location": "The main location where the main event takes place is Manchester, England.", "classification": "security", "score": 0.9663436280425108, "event_breakdown": "- Mother of Manchester Arena bombing victim begins 200-mile walk from attack site to Downing Street\n- Arrival at Downing Street set for 22 May, seventh anniversary of son's death\n- Greater Manchester mayor Andy Burnham sees off mother at AO Arena in central Manchester\n- Mother to visit memorials to terror attack victims during 186-mile walk to Downing Street"}, {"id": "d8769e27-18c6-4c26-8bb2-a0fba71ec016", "title": "Hezbollah targets Israeli military command base in occupied Golan Heights", "date": "2024-05-07 11:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240506-presstv06.htm", "message": "Hezbollah targets Israeli military command base in occupied Golan HeightsIran Press TVMonday, 06 May 2024 10:33 AMThe Lebanese Hezbollah resistance movement has targeted an Israeli military command base in the occupied Syrian Golan Heights with dozens of Katyusha rockets.\nHeavy rocket barrages were launched from southern Lebanon at Israeli military installations at the Galilee panhandle in the northern part of the 1948 Israeli-occupied territories as well as the occupied Golan Heights.\nIsraeli media outlets reported that sirens blared over incoming rocket fire in a number of communities in the Golan Heights and close to the border with Lebanon.\nThere were reports that nearly 70 missiles were launched from Lebanon at the southern Golan Heights.\nIn retaliation, Hezbollah has launched near-daily rocket attacks on Israeli positions.", "location": "The main location where the main event takes place is the occupied Syrian Golan Heights.", "classification": "security", "score": 0.9882719732550795, "event_breakdown": ""}, {"id": "aeff5419-dd94-4a69-933c-7a6345ecdd32", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-07 08:00", "url": "https://www.edp24.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Smoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah (Ramez Habboub/AP)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nWael Abu Omar, a spokesman for the Palestinian Crossings Authority, acknowledged Israeli forces had seized the crossing and had closed the facility for the time being.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.9667473105749878, "event_breakdown": "- Location: Near separating wall between Egypt and Rafah, Gaza Strip\n  Event: Israeli airstrike hits buildings near the wall; Israeli military seizes crossing\n  Details: Smoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah. Footage released by the Israeli military shows a tank entering the crossing, with Israeli flags flying from tanks that seized the area. The Israeli military claims it seized the crossing after receiving intelligence it was \"being used for terrorist purposes.\" Wael Abu Omar, a spokesman for the Palestinian Crossings Authority, acknowledges Israeli forces seized the crossing and closed the facility. An Egyptian Foreign Ministry spokesperson declines to immediately comment on the Israeli seizure."}, {"id": "6c580703-2b08-49bc-a6e0-5777b97ec06b", "title": "HRW : Israel attack on Lebanon rescuers was  unlawful  ", "date": "2024-05-07 12:45", "url": "https://www.justiceinfo.net/en/131654-hrw-israel-attack-on-lebanon-rescuers-was-unlawful.html", "message": "Human Rights Watch said Tuesday an Israeli strike in south Lebanon that killed seven emergency workers was \"an unlawful attack on civilians\", urging Washington to suspend weapons sales to Israel.\nThe Israel-Lebanon border area has witnessed near-daily cross-border fire after Palestinian militant group Hamas's unprecedented October 7 attack on southern Israel sparked war in the Gaza Strip.\n\"An Israeli strike on an emergency and relief centre\" in south Lebanon's Habariyeh on March 27 \"killed seven emergency and relief volunteers\" and \"was an unlawful attack on civilians that failed to take all necessary precautions\", HRW said in a statement.\n\"Israeli forces used a US weapon to conduct a strike that killed seven civilian relief workers in Lebanon who were merely doing their jobs,\" said Ramzi Kaiss, Lebanon researcher at HRW.\nThe rights group urged the United States to \"immediately suspend arms sales and military assistance to Israel given evidence that the Israeli military is using US weapons unlawfully\".", "location": "", "classification": "security", "score": 0.9224644023482902, "event_breakdown": ""}, {"id": "38cbaa27-d796-4551-b81c-4e56194f2806", "title": "Iraq Islamic resistance hits two Israeli military bases with drones", "date": "2024-05-07 11:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240506-presstv09.htm", "message": "Iraq's Islamic resistance hits two Israeli military bases with dronesIran Press TVMonday, 06 May 2024 2:27 AMThe Islamic Resistance in Iraq says it has targeted two Israeli military bases in the occupied Palestinian territories using drones.\nThe Islamic Resistance in Iraq, which is an umbrella group of the country's anti-terror movements, made the announcement in separate statements early Monday.\n\"The Islamic Resistance in Iraq, on the morning of Monday, 06-05-2024, targeted a military facility of the Zionist occupation in our occupied lands by drone,\" the first statement said.\nThe attack on Tel Aviv, the first of its kind, targeted the Glilot intelligence center linked to the Israeli Mossad spy agency.\nThe Islamic Resistance in Iraq has also struck major American military bases in Syria and Iraq amid anger over the US support for Israel's onslaught on Gaza.", "location": "The main location where the main event takes place is Tel Aviv, Israel.", "classification": "security", "score": 0.9731395954086967, "event_breakdown": ""}, {"id": "4ac46c73-6e17-439e-9a1e-b7c52d991179", "title": "No terrorist incident call on random stabbing", "date": "2024-05-07 07:30", "url": "https://www.mandurahmail.com.au/story/8620357/no-terrorist-incident-call-on-random-stabbing/", "message": "The WA Department of Education has defended its handling of the boy, who had mental health issues, after it was revealed the concerned parents of another student at his school had sent a letter to the education minister, which was passed on to the department.", "location": "", "classification": "security", "score": 0.4040549463862174, "event_breakdown": "- Location: Western Australia (WA)\n  Event: Department of Education defends handling of boy with mental health issues\n  Details: The WA Department of Education defended its handling of a boy with mental health issues after concerned parents of another student at his school sent a letter to the education minister, which was then passed on to the department."}, {"id": "2eb545ef-5398-4948-93a9-0e5f534a7e38", "title": "Manchester Arena victim mum walks 200 miles for new venue law", "date": "2024-05-07 13:15", "url": "https://www.bbc.co.uk/news/articles/cjjep9z53j6o", "message": "The mother of a Manchester Arena attack victim has set off on a 200-mile (321km) trek to Downing Street to insist a law tightening security at public venues is introduced.\nFigen Murray began her walk from the Manchester Arena, where her son Martyn Hett was killed in 2017 by suicide bomber Salman Abedi.\nShe said campaigners \"cannot wait any longer\" for Martyn's Law, which would require venues to have counter-terrorism measures.\nA Home Office spokesman said the government was in the \"final stages\" of drafting the legislation.", "location": "", "classification": "security", "score": 0.7985450983583978, "event_breakdown": "- Location: Manchester Arena, Downing Street (London)\n  Event: Mother of Manchester Arena attack victim starts 200-mile trek to Downing Street\n  Details: Figen Murray, mother of victim Martyn Hett, begins a walk from Manchester Arena to Downing Street to advocate for Martyn's Law, which aims to tighten security at public venues against terrorism. The law would mandate venues to have counter-terrorism measures. A Home Office spokesman mentioned that the government is in the \"final stages\" of drafting this legislation."}, {"id": "9c5e7f06-e29f-4512-9fe8-40f2c8ec9822", "title": "Middle East crisis update : Israel rejects Hama acceptance of Qatar - Egypt ceasefire proposal", "date": "2024-05-07 00:30", "url": "https://www.dailymaverick.co.za/article/2024-05-07-israel-rejects-hamas-acceptance-of-truce-deal-biden-netanyahu-meet-as-idf-orders-rafah-evacuation/", "message": "Palestinians leave Rafah, Gaza, 6 May 2024, after the Israeli army warned of imminent military operations.\nIsrael rejects Hamas’ acceptance of Gaza ceasefire proposalHamas said it had agreed to a ceasefire proposal put forward by Qatar and Egypt to halt fighting with Israel in Gaza.\nHowever, Israel rejected Hamas’ acceptance, saying its forces would continue their operation in Rafah to eradicate the Palestinian militant group.\nThe discussion came hours after Israel’s military told Palestinians to move out of parts of the city where more than a million people are sheltering.\nThe war erupted when Hamas attacked southern Israel from Gaza, killing 1,200 people and taking 250 hostage.", "location": "Rafah, Gaza", "classification": "security", "score": 0.887403161845399, "event_breakdown": ""}, {"id": "5f5efded-70fe-4844-9227-4aacc46cca62", "title": "seeking peace ... ", "date": "2024-05-07 03:45", "url": "https://yourdemocracy.net/drupal/node/50914", "message": "Home » Blogs » Gus Leonisky's blog seeking peace...\nIn wars of attrition, military operations are determined by a state's ability to replace losses and create new formations, not by tactical and operational maneuvers.\nLow-end formations hold the line and slowly gain experience, increasing their quality until they gain the ability to conduct offensive operations.\nThey must be launched on a broad front, seeking to overwhelm the enemy at multiple points with superficial attacks.\nIndeed, this regression is disturbingly reminiscent of the “sleepwalkers” on the eve of the First World War.", "location": "", "classification": "security", "score": 0.4654512197330795, "event_breakdown": ""}, {"id": "57b4e86c-092b-46f8-8832-1b62d401bd18", "title": "Russia says Ukrainian drone attack killed 6 in Belgorod", "date": "2024-05-07 11:00", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240506-voa02.htm", "message": "Russia says Ukrainian drone attack killed 6 in BelgorodBy VOA News May 06, 2024Officials in western Russia said a Ukrainian drone attack killed at least six people Monday in the Belgorod region near the Russia-Ukraine border.\nVyacheslav Gladkov, the regional governor in Belgorod, said on Telegram the drone struck several vehicles and that the attack injured more than 30 people.\nThe Ukrainian air force said the drones were intercepted over the Sumy region, located in northeastern Ukraine along the border with Russia.\nThere was no immediate information about any damage or casualties, with the agency saying the result of the attack was being clarified.\nStanding in front of the 1,000-year-old Saint Sophia Cathedral in Kyiv, Zelenskyy noted that Ukraine has now been fighting for 802 days against Russia.", "location": "Belgorod", "classification": "security", "score": 0.9361140625366973, "event_breakdown": ""}, {"id": "a25553e8-599f-48b1-8319-9ecb2d2c02d5", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-07 11:00", "url": "https://www.irishnews.com/news/world/israeli-forces-take-control-of-gaza-side-of-rafah-crossing-with-egypt-ARECKTAEWRMDXKR2ZRG5P7LXCQ/", "message": "Smoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah (Ramez Habboub/AP) (Ramez Habboub/AP)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nWael Abu Omar, a spokesman for the Palestinian Crossings Authority, acknowledged Israeli forces had seized the crossing and had closed the facility for the time being.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah) (Ismael Abu Dayyah/AP)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "The main location where the main event takes place is Rafah, Gaza Strip.", "classification": "security", "score": 0.9688125500253771, "event_breakdown": ""}, {"id": "ddf1f09f-48d9-46b5-b1ed-6fd223cca7dc", "title": "A U . S . Navy Nimitz - Class Supercarrier Trained with France Aircraft Carrier", "date": "2024-05-07 03:45", "url": "https://nationalinterest.org/blog/buzz/us-navy-nimitz-class-supercarrier-trained-frances-aircraft-carrier-210920", "message": "Charles de Gaulle, the only nuclear-powered flattop in service apart from the U.S. Navy’s supercarriers, deployed under NATO command for the first time.\nThey did just that in early May, when the U.S. Navy’s Nimitz-class nuclear-powered supercarrier USS Dwight D. Eisenhower (CVN-69) sailed alongside the French Marine Nationale carrier FS Charles de Gaulle (R91) in the Mediterranean Sea.\nThe ongoing mission reflects France’s growing involvement with NATO since the onset of the conflict in Ukraine.\nThe airwing is supported by one land-based Atlantique 2 maritime patrol aircraft, operating in either a surface- or submarine-warfare role.\nCVN-69 is the second-oldest nuclear-powered aircraft carrier in service in the world today, and she is currently scheduled to be replaced around 2029, when the new Gerald R. Ford-class supercarrier USS Enterprise (CVN-80) enters service.", "location": "The main location where the main event takes place is the Mediterranean Sea.", "classification": "security", "score": 0.28986364713584706, "event_breakdown": ""}, {"id": "f30b10ab-c540-4903-9c6e-ab742ab4183c", "title": "Israeli airstrike that killed seven health workers in Lebanon used US bombs , analysis reveals – Ya Libnan", "date": "2024-05-07 02:15", "url": "https://yalibnan.com/2024/05/07/israeli-airstrike-that-killed-seven-health-workers-in-lebanon-used-us-weapons-analysis-reveals/", "message": "Pictures of the shrapnel sent by the Guardian were further verified by Human Rights Watch and an independent arms expert.\nJDAMs are guidance kits produced by US aerospace company Boeing which attach to 500-2,000lb “dumb bombs” and convert them into GPS-guided precision missiles.\nThey have been key to Israel’s war effort in Gaza and Lebanon, and have been one of the most requested munitions from the US.\nFive days after the attack on healthcare workers in Lebanon, Israel killed another seven aid workers employed by the World Central Kitchen in Gaza.\nThe Democratic senator Chris Van Hollen said that the attack on al-Habariyeh should be reflected in Blinken’s report to Congress.", "location": "The main location where the main event takes place is the Middle East region, specifically Gaza and Lebanon.", "classification": "security", "score": 0.944609576702492, "event_breakdown": "- Pictures of the shrapnel sent by the Guardian were verified by Human Rights Watch and an independent arms expert.\n- JDAMs, guidance kits produced by US aerospace company Boeing, convert \"dumb bombs\" into GPS-guided precision missiles.\n- JDAMs have been crucial to Israel's war efforts in Gaza and Lebanon and are highly requested from the US.\n- Five days after the attack on healthcare workers in Lebanon, Israel killed seven aid workers employed by the World Central Kitchen in Gaza.\n- Democratic senator Chris Van Hollen recommends that Blinken's report to Congress reflect the attack on al-Habariyeh."}, {"id": "6fe6b3ba-3869-40b2-b963-c9646cf6e727", "title": "Dozens of major terrorist groups operating from Afghanistan", "date": "2024-05-07 04:45", "url": "https://tribune.com.pk/story/2465455/dozens-of-major-terrorist-groups-operating-from-afghanistan", "message": "The Taliban takeover has also facilitated the re-emergence and strengthening of terrorist groups other than the TTP.\nAs many as 23 major terrorist groups are operating from Afghanistan threatening some 53 countries.\nFormed in 2015, IS-K mostly comprises disgruntled elements of Afghan Taliban, TTP, Arabs and Central Asians.\nThe seventh terrorist group is Baloch Raji Ajoi Sangar (BRAS) which includes BLA BLF, BRG and Majeed Bridge.\nThe Government of Pakistan has shared irrefutable evidence of the terror groups operating from Afghanistan’s safe havens to UNSC and international community.", "location": "The main location where the main event takes place is Afghanistan.", "classification": "security", "score": 0.8204365669782672, "event_breakdown": "1. The Taliban takeover has facilitated the re-emergence and strengthening of terrorist groups other than the TTP.\n2. As many as 23 major terrorist groups are operating from Afghanistan, threatening some 53 countries.\n3. IS-K, formed in 2015, mostly comprises disgruntled elements of Afghan Taliban, TTP, Arabs, and Central Asians.\n4. Baloch Raji Ajoi Sangar (BRAS) is the seventh terrorist group, including BLA, BLF, BRG, and Majeed Bridge.\n5. The Government of Pakistan has shared irrefutable evidence of terror groups operating from Afghanistan's safe havens with the UNSC and international community."}, {"id": "93fa3d33-81f7-49eb-aa7d-1f9b604d713a", "title": "2 Ukrainians detained for allegedly plotting Zelenskyy assassination with Russia , Ukraine says", "date": "2024-05-07 12:45", "url": "https://abcnews.go.com/International/2-ukrainians-detained-allegedly-plotting-zelenskyy-assassination-russia/story?id=108534193", "message": "Two colonels from Ukraine's SBU were recruited by Russia, Ukraine said.\nLONDON and KYIV -- Two colonels in Ukraine's State Protection Service were identified as part of a group planning to assassinate Ukrainian President Volodymyr Zelenskyy, Ukrainian officials said Tuesday.\nOther high-ranking officials were also allegedly targeted by the group, which SBU officials described as a \"network of agents.\"\nSBU head Vasyl Malyuk and the head of military intelligence, Kyrylo Budanov, were among those who had been targeted, officials said.\nThe colonels had allegedly obtained the drones they planned to use for the operation against Zelenskyy.", "location": "KYIV", "classification": "security", "score": 0.4464101505015071, "event_breakdown": ""}]