[{"id": "1eb22d5a-a649-4c2f-8def-999f230a1a40", "title": "Nine months on , Hamas hostages and survivors continue to be victimized", "date": "2024-07-18 16:30", "url": "https://www.washingtonexaminer.com/restoring-america/courage-strength-optimism/3088927/hamas-hostages-survivors-continue-to-be-victimized/", "domain": "washingtonexaminer.com", "domain_classification": "Unknown", "message": "Nine months ago, I went to a music festival in Israel.\nNova Music Festival security personnel, to whom I am eternally grateful, told us to get out.\nLike survivors of violent antisemitism before me, I thought the world would unite in condemnation of Hamas and its attack.\nJust last month, a crowd of “protesters” blockaded the Nova Music Festival memorial in downtown Manhattan, carrying terrorist flags and calling for more antisemitic violence.\nAnd a couple of weeks ago at Glastonbury, a music festival in England, attendees and performers showed support for Palestinians but ignored their peer festivalgoers who were taken as hostages from the Nova festival.", "location": "Israel", "classification": "antisemitism", "score": 0.7222134041543951, "event_breakdown": "Target Event: Several attendees and performers showed support for Palestinians but ignored their peer festivalgoers who were taken as hostages from the Nova festival."}, {"id": "53a73235-83b1-4d37-b1c6-6e91b0949927", "title": "How New York Jewish male intellectuals shaped our world – The Forward", "date": "2024-07-18 16:30", "url": "https://forward.com/culture/634002/grinberg-romano-mailer-zimbalist-new-york-jewish-male-intellectual/", "domain": "forward.com", "domain_classification": "Unknown", "message": "“The New York intellectuals helped render American Jews, a group long associated with left-wing radicalism, as not only properly anti-communist but properly masculine in Cold War America,” Grinberg writes.\nThis commitment to a specific politics, and the elevation of culture as integral to understanding it, would form the mold for the New York Intellectuals and ultimately for American intellectualism itself.\nCommentary, founded in 1945, by the American Jewish Committee, was another manifestation and tool of this secular Jewish American male project (the name itself connotes the tradition of Talmudic discourse, that sacred practice carried out by men for men).\nMailer often took the remaking of the American Jewish male to one of its most grotesque extremes.\nThe Village Voice, which Mailer co-founded, was a natural inheritor of the New York Intellectuals’ brand of political, cultural and ideological inquiry.", "location": "New York", "classification": "antisemitism", "score": 0.4516453631578793, "event_breakdown": "1. Antisemitic graffiti was found at a park in Brooklyn on November 29, 2021.\n2. On November 20, 2021, a swastika was found in Brooklyn.\n3. On November 19, 2021, a Brooklyn synagogue was vandalized.\n4. On November 15, 2021, a Jewish man was assaulted on the subway in Brooklyn."}]