[{"id": "9526cdf8-02be-4d85-8b95-5e2692f2de1e", "title": "How the IDF Saves Civilians | Frontpage Mag", "date": "2024-05-21 04:30", "url": "https://www.frontpagemag.com/the-idf-takes-more-steps-to-warn-civilians-away-from-combat-areas-than-any-other-military/", "message": "The IDF strives always to warn civilians away from places about to be targeted, even when those warnings remove the element of surprise, which often is the critical element in a military attack.\nAs the war raged on, Israel began giving out its military maps to civilians so they could conduct localized evacuations.\nActually, the IDF estimated the number of Hamas combatants killed to be 13,000 as of late January.\nThat would mean some 18,000 civilians have died in Gaza, a ratio of roughly 1 combatant to 1.5 civilians.\nEven if we were to accept Hamas’ figure of 31,000 Gazans dead (Hamas does not offer separate numbers for civilians and combatants), and subtract from that figure the 15,000 Hamas fighters killed, that would mean at most 16,000 civilians were killed.", "location": "GAZA CITY, GAZA", "classification": "security", "score": 0.9418744469900823, "event_breakdown": ".\n1. Israel gives civilians localized evacuation maps.\n2. IDF estimates some 13,000 Hamas combatants were killed.\n3. Numbers of civilian casualties are uncertain.\n4. Reference to 18,000 civilians deaths.\n5. Reference to 1 combatant to 1.5 civilians.\n6. Reference to 31,000 Gazans dead.\n7. Reference to 15,000 Hamas fighters killed.\n8. Reference to 31,000 Gazans dead.\n9. Reference to 15,000 Hamas fighters killed."}, {"id": "f2503a97-1e5f-4afd-9740-cf48d78b5869", "title": "Student Anger Over The Vietnam War Erupted Into Violence In The  60S − A Terrorism Expert Explores If The Same Could Happen Today", "date": "2024-05-21 01:45", "url": "https://menafn.com/1108234918/Student-Anger-Over-The-Vietnam-War-Erupted-Into-Violence-In-The-60S-A-Terrorism-Expert-Explores-If-The-Same-Could-Happen-Today", "message": "The dramatic scenes of police and state troopers dismantling student encampments on campuses and arresting protesters have sparked some accusations of heavy-handed law enforcement tactics .\nThe wave of recent pro-Palestinian, student-led protests reminds me of another tense era in the U.S. that was also prompted by U.S. engagement in a foreign war – the Vietnam War in the late 1960s and early 1970s.\nStudents' anger over the long-running U.S. war in Vietnam reached a boiling point on Aug. 28, 1968, at the Democratic National Convention in Chicago.\nDuring a 1981 bank robbery in Nanuet, New York, three law enforcement officers were killed during a shootout with Weather Underground members.\nDuring this time, the FBI worked closely with various state and law enforcement agencies to investigate the group and criminally prosecute various members .", "location": "Chicago, Illinois", "classification": "security", "score": 0.44613736560201417, "event_breakdown": "Here is a summary of the security events in the text:\n1968:  During the 1968 Democratic National Convention in Chicago, police officers and National Guardsmen clashed with antiwar protesters, resulting in numerous injuries.\n1981: A bank robbery in Nanuet, New York, resulted in a shootout between law enforcement officers and Weather Underground members, resulting in the deaths of three officers.\n2001, Sept 11: The September 11 attacks were a series of four coordinated terrorist attacks by the Islamic terrorist group al-Qaeda against the United States on the morning of Tuesday, September 11, 2001."}, {"id": "39561860-f5f4-4585-b421-a6d7fa6e9c20", "title": "Meet the mastermind of the October 7 strike on Israel – Ya Libnan", "date": "2024-05-21 04:15", "url": "https://yalibnan.com/2024/05/21/meet-the-mastermind-of-the-october-7-strike-on-israel/", "message": "In the months since Oct. 7, Deif is believed to have been directing Hamas military operations from the tunnels and backstreets of Gaza, alongside senior colleagues.\nRising up the Hamas ranks over 30 years, Deif developed the group’s network of tunnels and its bomb-making expertise.\nAn Israeli security source said Deif was directly involved in the planning and operational aspects of the attack.\nHe was arrested by Israel in 1989 and spent about 16 months in detention, a Hamas source said.\nHe did not use modern digital technology such as smart phones, the source close to Hamas said.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.6809455156182511, "event_breakdown": "1. Hamas military leader Deif is believed to have been directing Hamas military operations from the tunnels and backstreets of Gaza.\n2. Deif was directly involved in the planning and operational aspects of the Oct. 7 attack.\n3. Deif was arrested and charged with terrorism in 1989 by Israel, and spent 16 months in detention.\n4. Since Oct. 7, Deif's reputation with Hamas grows, as he directed the group through his network of tunnels.\n5. Deif did not use modern digital technology."}, {"id": "bca5d60c-0a8b-496b-979b-d34f9148fe03", "title": "Source close to Hizbollah says 4 dead in Israeli strikes on Lebanon", "date": "2024-05-21 00:45", "url": "http://www.jordantimes.com/news/region/source-close-hizbollah-says-4-dead-israeli-strikes-lebanon", "message": "Hizbollah, a Hamas ally, has traded near daily cross-border fire with Israeli forces since the Palestinian group's October 7 surprise attack on southern Israel that sparked the war in Gaza.\nThe source close to Hizbollah told AFP that \"at least four Hizbollah fighters were killed in Israeli raids on two different sites in southern Lebanon\", identifying the locations as Naqura on the coast and Mais Al Jabal, a border village to the east.\nA Hizbollah fighter was also killed on Monday in a strike in neighbouring Syria blamed on Israel, a separate source from the group told AFP.\nHizbollah said it launched a heavy rocket attack at an Israeli army barracks in the country’s north “in retaliation” for the Naqura strike, while also announcing other attacks on Israeli positions.\nThe violence has raised fears of all-out conflict between Hizbollah and Israel, which went to war in 2006.", "location": "LEBANON", "classification": "security", "score": 0.9725754080516641, "event_breakdown": "* October 7: Palestinian group Hamas launches a surprise attack on southern Israel.\n* October 20: Israeli forces are trading near daily cross-border fire with Hizbollah since the Palestinian group's October 7 attack.\n* October 25: Israeli raids on two different sites in southern Lebanon kill four Hizbollah fighters.\n* October 25: Hizbollah announces a heavy rocket attack on an Israeli army barracks in the country's north.\n* October 26: Israeli strikes in neighbouring Syria kill a Hizbollah fighter."}, {"id": "f03ccc1d-6506-4457-a40b-ed00d1aee838", "title": "Iran president dies in helicopter crash – Boston Herald", "date": "2024-05-21 04:15", "url": "https://www.bostonherald.com/2024/05/20/irans-president-dies-in-helicopter-crash/", "message": "Iran has offered no cause for the crash nor suggested sabotage brought down the helicopter, which fell in mountainous terrain in a sudden, intense fog.\nIn Tehran, Iran’s capital, businesses were open and children attended school Monday.\nLater in the day, hundreds of mourners crowded into downtown Vali-e-Asr square holding posters of Raisi and waving Palestinian flags.\nIran-backed Hamas led the attack that started the conflict, and Hezbollah, also supported by Tehran, has fired rockets at Israel.\nThe crash killed all eight people aboard a Bell 212 helicopter that Iran purchased in the early 2000s, according to the state-run IRNA news agency.", "location": "Tehran", "classification": "security", "score": 0.8506154090793318, "event_breakdown": ".\n1. Helicopter crash in Tehran, Iran, on Monday, Jan. 4, killing all eight people on board.\n2. Mourners gathered in downtown Vali-e-Asr square in Tehran after the crash on Monday, Jan. 4."}, {"id": "b7ceb74a-17ff-4c02-aa38-a3093caf137c", "title": "Ukraine Situation Report : Russia Advances On Vovchansk", "date": "2024-05-21 01:45", "url": "https://www.yahoo.com/news/ukraine-situation-report-russia-advances-235510096.html", "message": "Previously, Russia claimed its forces had entered Vovchansk , something that Ukraine has denied.\nRussian forces continue their attacks near Starytsya and in the direction of Prylipka (both southwest of Vovchansk) and near Tykhe (east of Vovchansk).\nHe said: “The enemy continues to try, especially inside Vovchansk, to push the Ukrainian armed forces out of the town.\nhttps://www.twitter.com/kromark/status/1792515295371743744There is also talk of a Russian attack on the Ukrainian airbase at Mirgorod in central Ukraine.\nNow, we have a video showing the explosive demise of one of these air defense systems, as the result of a Ukrainian drone strike.", "location": "Vovchansk", "classification": "security", "score": 0.9771954823777877, "event_breakdown": "1. Russia claimed to have entered Vovchansk, Ukraine denied it.\n2. Russian forces continue to attack near Starytsya and Prylipka, southwest of Vovchansk, and near Tykhe, east of Vovchansk.\n3. Russian forces try to push Ukrainian armed forces out of Vovchansk, especially in the town.\n4. There is talk of a Russian attack on the Ukrainian airbase at Mirgorod in central Ukraine.\n5. A Ukrainian drone strike resulted in the explosive demise of a Russian air defense system."}, {"id": "5304d1af-07c2-4813-bb89-7e9d4b3511d4", "title": "ICC warrant unlikely to bring change to operations in Israel - Hamas war", "date": "2024-05-21 02:15", "url": "https://kpic.com/news/nation-world/icc-warrant-unlikely-to-bring-change-to-operations-in-israel-hamas-war-international-criminal-court-war-crime-benjamin-netanyahu-yoav-gallant-yahya-sinwar-muhammad-deif-ismail-haniyeh", "message": "Neither Israel nor the United States are member states of the ICC, but it will still complicate tense diplomatic issues connected to the war.\nThe ICC’s warrant request is unlikely to change either side’s military objectives moving forward.\nIsraeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\nMore than half of Gaza’s population had fled to the city and its surrounding areas amid the war between Israel and Hamas.\nRepublican lawmakers in Congress have blasted the court for targeting Israeli leaders with warrants, threatening to pull U.S. support for it and to levy sanctions against it.", "location": "Gaza", "classification": "security", "score": 0.5497085548374816, "event_breakdown": "* ICC requested a warrant to target Israeli leaders with warrants\n* Republican lawmakers threatened to levy sanctions against the International court of justice for targeting Israeli leaders with warrants\n* More than half of Gaza's population fled the city and its surrounding areas as a result of the war between Israel and Hamas."}, {"id": "0ea9d5db-13f1-48a8-9fc2-f3723b1851bc", "title": "Helicopter crash that killed Iran president and others could reverberate across Middle East", "date": "2024-05-21 02:00", "url": "https://www.stripes.com/theaters/middle_east/2024-05-20/death-iran-president-upheaval-middle-east-13916464.html", "message": "(Vahid Salemi/AP)JERUSALEM — The helicopter crash in which Iranian President Ebrahim Raisi, the country’s foreign minister and other officials were killed is likely to reverberate across the Middle East, where Iran’s influence runs wide and deep.\nIsrael is believed to have carried out numerous attacks over the years targeting senior Iranian military officials and nuclear scientists.\nThere is no evidence Israel was involved in Sunday’s helicopter crash, and Israeli officials have not commented on the incident.\nIran has always insisted its nuclear program is for purely peaceful purposes, but the United States and others believe it had an active nuclear weapons program until 2003.\nIsrael is widely believed to be the only nuclear-armed power in the Middle East but has never acknowledged having such weapons.", "location": "JERUSALEM", "classification": "security", "score": 0.524981931912458, "event_breakdown": "1. The crash of an Iranian helicopter. This is considered an event because it happened to an object and is located in time.1 Israel’s attacks in the middle east, targeting senior officials. this is considered an event because it is a military action and event and happens at a specific location.1 Iran’s nuclear program. It is considered an event because it is held and it has a location and it can be located on a map.\n2. Israel is a nuclear power. It is considered an event because it located in time. but it isn’t that related to the other 3 events."}, {"id": "c87401bc-9894-4430-af2d-5149dccf86bd", "title": "Iran helicopter crash could reverberate across Middle East", "date": "2024-05-21 02:15", "url": "https://apnews.com/article/iran-helicopter-raisi-israel-hezbollah-hamas-yemen-f5145ec19b169417d3b40a50ca9ff5b0", "message": "JERUSALEM (AP) — The helicopter crash in which Iranian President Ebrahim Raisi, the country’s foreign minister and other officials were killed is likely to reverberate across the Middle East, where Iran’s influence runs wide and deep.\nThere is no evidence Israel was involved in Sunday’s helicopter crash, and Israeli officials have not commented on the incident.\n(AP Photo/Vahid Salemi)BEYOND THE MIDDLE EASTIran’s influence extends beyond the Middle East and its rivalry with Israel.\nIran has always insisted its nuclear program is for purely peaceful purposes, but the United States and others believe it had an active nuclear weapons program until 2003.\nIsrael is widely believed to be the only nuclear-armed power in the Middle East but has never acknowledged having such weapons.", "location": ")\nJERUSALEM", "classification": "security", "score": 0.5926534801755048, "event_breakdown": "1. Helicopter crash in Iran: Sunday’s helicopter crash that killed Iranian President Ebrahim Raisi, the country’s foreign minister and other officials.\n2. Iran's influence: Iran’s influence runs wide and deep across the Middle East. They are obliged to have a long rival with Israel.\n3. Iran nuclear deal: The United States and others believe it had an active nuclear weapons program until 2003.\n4. Israel's nuclear programme: Israel is widely believed to be the only nuclear-armed power in the Middle East, but they has never acknowledged having such weapons."}, {"id": "0b05c92f-56b9-43b8-b85f-1adf15187936", "title": "Israel plans to expand Rafah operation despite US concerns", "date": "2024-05-21 03:15", "url": "https://www.yahoo.com/news/israel-plans-expand-rafah-operation-012906317.html", "message": "Gallant also presented humanitarian aid plans for the population of the Gaza Strip.\nSullivan stressed the importance of Israel and Egypt concluding their talks on the reopening of the Rafah border crossing.\nHumanitarian workers must be able to safely deliver aid to those in need throughout the Gaza Strip, Sullivan said.\nMany of them are refugees from other parts of the Gaza Strip who had sought refuge in its southernmost point.\nThe Hamas-controlled health authority reported the deaths on Sunday of at least 24 Palestinians in the Nuseirat refugee camp in the centre of the Gaza Strip.", "location": "Gaza Strip", "classification": "security", "score": 0.7221527723012721, "event_breakdown": "Security Events Listed in the Text:\n\n1. 24 Palestinians were killed in the Nuseirat refugee camp in the centre of Gaza Strip.”\n2. Israel and Egypt are concluding talks about the reopening of the Rafah border crossing."}, {"id": "8b05a015-ddf5-4b40-9591-2a33d10610c2", "title": "Explosion kills 1 , injures 3 in Afghanistan Kandahar", "date": "2024-05-21 02:15", "url": "https://www.khaama.com/explosion-kills-1-injures-3-in-afghanistans-kandahar/", "message": "Sources in Kandahar province, which had previously confirmed explosions in the province, say that this explosion also resulted in casualties.\nAccording to a source, on Monday, May 20, an explosion occurred at the ‘Kabul Station’ in the central district of this province, resulting in several deaths and injuries.\nMullah Asadullah Jamshid, spokesperson for the security command in Kandahar, also confirmed the explosion and stated that one civilian was killed and three others were injured.\nMedia outlets, citing their sources in Kandahar, have reported that yesterday’s explosion was caused by a planted mine in a stall resulting in 6 deaths and over 10 injuries.\nIt is worth noting that this is the second explosion to occur in Kandahar since the beginning of the current solar year.", "location": "Kandahar", "classification": "security", "score": 0.9819986754800167, "event_breakdown": ".\n1. Monday May 20, 2022, an explosion occurred at the Kabul Station in the central district of Kandahar province. Several deaths and injuries are reported.\n2. In an unconfirmed report, headlines indicated that yesterday's explosion was caused by a mine and resulted in 6 deaths and over 10 injuries.\n3. The explosion in central Kandahar province is the second of the year and the result of an embedded explosive device in a market stall."}]