[{"id": "7047a413-9b57-4505-b1db-b8a1b188cab7", "title": "Palestinian embroidery workshop cancelled after Holocaust denial claims", "date": "2024-07-16 19:30", "url": "https://www.brightonandhovenews.org/2024/07/16/palestinian-embroidery-workshop-cancelled-after-holocaust-denial-claims/", "domain": "brightonandhovenews.org", "domain_classification": "Unknown", "message": "A Palestinian embroidery workshop at Jubilee Library has been cancelled by the council after claims its organiser shared Holocaust denial and other antisemitic claims on social media.\nThe flyer for the event, which had been due to be held fortnightly from today, featured a map of Israel with a Palestinian flag on it.\nAlthough the Holocaust post appears to have since been deleted, Brighton and Hove News verified the other posts on Ms Allan’s timeline.\nHeidi Bachram, who has a family member who is a hostage in Gaza, found the posts and shared them on Twitter.\nShe said: “It’s a relief to hear that this workshop was cancelled.", "location": "The Palestinian city of Gaza", "classification": "antisemitism", "score": 0.9101962657304443, "event_breakdown": "Brighton and Hove News, \"Palestinian embroidery workshop cancelled at Jubilee Library over antisemitism claims\"\nBrighton and Hove News, \"Palestinian embroidery workshop cancelled at Jubilee Library over antisemitism claims\""}, {"id": "e98851ad-1f80-4696-b968-529c41050e9e", "title": "Chabad visit Oct . 7 survivors , wounded IDF soldiers in Israel visit - Israel News", "date": "2024-07-16 23:30", "url": "https://www.jpost.com/israel-news/article-810618", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Over 200 Chabad on Campus representatives visited Israel last week for an annual Chabad on Campus International Conference.\nDuring the conference, representatives from the Chabad on Campus movement met with a number of notable Israeli officials, including Prime Minister Benjamin Netanyahu.\nChabad representatives have been working on college campuses to ensure that Jewish students are uplifted and have a space for their Jewish identities.\nThey joined nearly 200 Chabad on Campus Shluchim, currently in Israel for their annual convention, to share in the festive spirit.\nContinuing to meet IDF soldiers, the attendees visited the Shura Army base for a BBQ dinner where they interacted with soldiers.", "location": "Israel", "classification": "antisemitism", "score": 0.8039071896629816, "event_breakdown": "The target event is the newest article from the category 'anti-semitism' in the State of Israel, Israel\nThe Israeli and the Jewish Broadcasting Company."}, {"id": "ad214f86-4db2-4337-b385-53c0aa94a132", "title": "Social media claims that J . D . Vance is controlled by Israel or the Jews", "date": "2024-07-16 19:00", "url": "https://www.jpost.com/diaspora/article-810560", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Antisemites and anti-Israel activists were angered by former president and Republican party presidential candidate Donald Trump's pick for vice president on Monday, claiming on social media that J.D.\nVance is controlled by Israel or the Jews.\nMany anti-Israel influencers, like American communist commentator Jackson Hinkle, shared photographs of Trump and Vance visiting the Western Wall while wearing a kippah to indicate Israeli or Jewish control.\nAccusations of being a Mossad agentLarge and small social media accounts asserted that Vance was \"Israel first\" rather than \"America first.\"\nPro-Assad Australian commentator Maram Susli called for Vance to register as a foreign agent because the American Israel Public Affairs Committee donated to his campaign.", "location": "Washington, D.C.", "classification": "antisemitism", "score": 0.6226029474613287, "event_breakdown": "Antisemitism and Holocaust denial\nTarget event:\nno relevant events found"}]