[{"id": "7f32cfbc-233a-44e2-84fb-c1add5298a3c", "title": "Turkish drone strikes leave 23 civilians dead in Somalia", "date": "2024-05-08 14:30", "url": "https://www.garoweonline.com/en/news/somalia/turkish-drone-strikes-leave-23-civilians-dead-in-somalia", "message": "Turkish drone strikes leave 23 civilians dead in SomaliaMOGADISHU, Somalia - At least 23 civilians have been killed by suspected Turkish drones in Somalia, the Amnesty International has reported, calling for immediate investigations into what it terms as 'crimes against humanity', which meet the threshold of war crimes.\nAnd now, Amnesty International wants the governments of Somalia and Turkey to immediately investigate the incident, according to Tigere Chagutah, Amnesty International’s Regional Director for East and Southern Africa.\n“In Somalia, civilians have borne the brunt of suffering in war far too often.\nMultiple sources told Amnesty International that Al-Shabaab fighters were present in Bagdad during clashes on 18 March.\nThe government of Somalia has also signed a defence deal with Turkey, which expressly gives Ankara authority to oversee Somalia's waters.", "location": "MOGADISHU, Somalia", "classification": "security", "score": 0.877547879923673, "event_breakdown": "- Location: Mogadishu, Somalia\n- Event: Turkish drone strikes have left at least 23 civilians dead.\n- Suspected parties: Turkish drones.\n- Amnesty International is calling for immediate investigations into the incident, alleging potential 'crimes against humanity' or war crimes.\n- Amnesty International’s Regional Director for East and Southern Africa, Tigere Chagutah, urged the governments of Somalia and Turkey to investigate the incident.\n- Location: Bagdad, Somalia\n- Event: Clashes in Bagdad on 18 March, with multiple sources confirming Al-Shabaab fighters' presence during the clashes.\n- Context: Somalia has signed a defense deal with Turkey, giving Ankara authority to oversee Somalia's waters."}, {"id": "65853c98-aa9a-42e7-a359-e157a33cffb1", "title": "Ukraine War , Day 805 : Russia Plot to Assassinate Zelenskiy", "date": "2024-05-08 09:30", "url": "https://eaworldview.com/2024/05/ukraine-russia-plot-to-assassinate-zelenskiy/", "message": "On Remembrance and Victory over Nazism in World War II Day, Nazi Putin launched a massive missile attack on Ukraine.\nFirst responders dealing with the aftermath of a Russian attack on the Kyiv region:shows rescuers eliminating the consequences of Russia's night missile attack in Kyiv Oblast.\nLocal officials reported the Russian attack on 8 May injured 2 people in Kyiv Oblast and, an 8-year-old child in Kirovograd Oblast.\nLast month Polish and Ukrainian prosecutors announced the detention of a man suspected of aiding a Russian scheme to kill Zelenskiy.\nIn August 2023, the SBU said a woman had been arrested for trying to uncover details of Zelenskiy’s movements outside Kyiv.", "location": "Kyiv", "classification": "security", "score": 0.6462859063115821, "event_breakdown": "- Nazi Putin launched a massive missile attack on Ukraine.\n- First responders dealt with the aftermath of a Russian attack on the Kyiv region.\n- The Russian attack on 8 May injured 2 people in Kyiv Oblast and an 8-year-old child in Kirovograd Oblast.\n- Polish and Ukrainian prosecutors announced the detention of a man suspected of aiding a Russian scheme to kill Zelenskiy.\n- In August 2023, the SBU said a woman had been arrested for trying to uncover details of Zelenskiy’s movements outside Kyiv."}, {"id": "fc40d093-f63f-4d1b-9948-0a1ef9dcb80e", "title": "Al Jazeera : Israel airstrike kills at least 7 in Gaza City", "date": "2024-05-08 10:00", "url": "https://news.am/eng/news/822054.html", "message": "At least seven people were killed as a result of an Israeli airstrike that hit residential houses in Gaza City.\nThe planes of the Israel Defense Forces bombed the residential area of the eastern El-Zaytun district of the city, reports Al Jazeera.\nSeven people, including five children, were killed as a result of the bombing, according to the Palestinian authorities.\nAl Jazeera informed also about two dead and several wounded in Rafah, which is located in the south of the Palestinian enclave of Gaza Strip, on the border with Egypt.\nTwo civilians were killed as a result of an attack by the Israeli army on a civilian vehicle", "location": "Gaza City", "classification": "security", "score": 0.9993271217247683, "event_breakdown": "- Israeli airstrike hits residential houses in Gaza City, resulting in at least seven deaths\n- Israel Defense Forces bomb residential area in eastern El-Zaytun district of Gaza City\n- Seven people, including five children, killed in the bombing\n- Two dead and several wounded in Rafah, located in the south of Gaza Strip\n- Attack by Israeli army on civilian vehicle results in two civilian deaths"}, {"id": "6e52cd6d-b9b6-46fe-9636-3ccce2ce026b", "title": "Artificial Intelligence Is Telling Israel Who To Bomb . Here How", "date": "2024-05-08 13:15", "url": "https://digg.com/digg-vids/link/israel-idf-ai-artificial-intelligence-video", "message": "gospel and lavender Artificial Intelligence Is Telling Israel Who To Bomb.\nHere's How Darcy JimenezIsrael has been using AI in warfare for years, but now, something new is happening: the technology is generating bombing targets in Gaza in a war that has so far killed more than 35,000 Palestinians.\n6 hours ago · · ·", "location": "Gaza", "classification": "security", "score": 0.7617007075900305, "event_breakdown": "- Israel using AI technology to generate bombing targets in Gaza\n- War in Gaza resulting in the deaths of more than 35,000 Palestinians"}, {"id": "d0db7a68-6e8a-4e73-9b54-f280834e11fe", "title": "Australia : Police shoot dead 16 - year - old accused of extremist stabbing", "date": "2024-05-08 07:00", "url": "https://www.wsws.org/en/articles/2024/05/08/zdli-m08.html", "message": "Police who attended claim that when they arrived the boy refused to put down the knife, instead running towards them.\nBlanch proclaimed that the stabbing “certainly has all the hallmarks” of being a terrorism-related incident.\nThere has been no explanation as to why a purported terror attack would be staged in a quiet suburban carpark.\nDetails about the victim of the stabbing have not been made public, but it appears likely the unfortunate target was chosen at random.\nOn April 22, a 16-year-old boy stabbed an Assyrian bishop at a Church in the southwestern Sydney suburb of Wakeley.", "location": "Wakeley", "classification": "security", "score": 0.8793809481606457, "event_breakdown": "- Location: Suburban carpark\n  Description: A 16-year-old boy refused to put down a knife and ran towards the police when they arrived.\n  \n- Location: Suburban carpark\n  Description: Blanch stated that the stabbing bears the hallmarks of a terrorism-related incident.\n\n- Location: Suburban carpark\n  Description: It is unclear why a purported terror attack would be staged in a quiet suburban carpark.\n\n- Location: Suburban carpark\n  Description: Details about the victim of the stabbing have not been disclosed, but it seems likely that the target was chosen at random.\n\n- Location: Church in Wakeley, southwestern Sydney\n  Description: On April 22, a 16-year-old boy stabbed an Assyrian bishop."}, {"id": "539ffe78-99fb-450e-bce3-f8ff8c6dcd53", "title": "Unpacking the criticism of Israel Iran policy - The Jerusalem Post", "date": "2024-05-08 15:30", "url": "https://www.jpost.com/middle-east/iran-news/going-in-circles-critics-of-israels-policy-on-iran-have-dangerous-logic-analysis-800449", "message": "Critics use logical fallaciesBut at the same time, these same critics have urged Israel not to attack the Islamic Republic’s nuclear weapons program.\nThe S-300 missile system is seen during the National Army Day parade ceremony in Tehran, Iran, April 17, 2024.\nSome of these same critics then urged Israel not to attack Iran back so as to avoid the conflict deteriorating into a regional war.\nMost importantly, to avoid regional war, they urged Israel not to touch Iran’s nuclear weapons program.\nIran’s attack also could have eliminated Israel’s F-35 squadrons which would have hampered Israeli national offensive and defensive power for the next decade.", "location": "Tehran, Iran", "classification": "security", "score": 0.6631654011242722, "event_breakdown": "1. Critics use logical fallacies.\n2. Some critics urge Israel not to attack Iran's nuclear weapons program.\n3. The S-300 missile system is seen during the National Army Day parade ceremony in Tehran, Iran, on April 17, 2024.\n4. Some critics advise against Israel attacking Iran to prevent escalation into a regional war.\n5. Critics urge Israel not to target Iran's nuclear weapons program to avoid regional conflict.\n6. Iran's potential attack could have targeted Israel's F-35 squadrons, impacting Israeli offensive and defensive capabilities for the next decade."}, {"id": "8d73c042-7ef9-458c-af20-9e7e47f50fbf", "title": "US halts bomb shipments to Israel amid concerns of full - scale Rafah invasion as Biden rift with Netanyahu deepens", "date": "2024-05-08 06:15", "url": "https://www.dailymail.co.uk/news/article-13394521/US-halts-bomb-shipments-Israel-amid-concerns-scale-Rafah-invasion-Bidens-rift-Netanyahu-escalates.html", "message": "The US paused a shipment of bombs to Israel last week over concerns that Israel was approaching a decision on launching a full-scale assault on the southern Gaza city of Rafah.\nThe U.S. has historically provided enormous amounts of military aid for Israel.\nA decision against Israel would further add to pressure on Biden to curb the flow of weapons and money to Israel´s military.\nThe package included more than $14 billion in military aid for Israel, though the stalled transfer was not related to that measure.\nIsrael, by contrast, has used the bomb frequently in the seven-month Gaza war.", "location": "Rafah", "classification": "security", "score": 0.5473426539230661, "event_breakdown": "1. The US paused a shipment of bombs to Israel last week over concerns about a potential full-scale assault on Rafah, a city in southern Gaza.\n2. The US has a history of providing significant military aid to Israel.\n3. A decision against Israel would increase pressure on Biden to restrict the flow of weapons and funds to the Israeli military.\n4. The stalled transfer of bombs was part of a package totaling over $14 billion in military aid for Israel, but it was not directly related to this specific measure.\n5. Israel has frequently used bombs during the seven-month Gaza war."}, {"id": "2eeab603-b63f-4557-b024-ed7f5b84ef90", "title": "Conservative Principles , Political Reality , and the War on Terrorism", "date": "2024-05-08 05:00", "url": "https://www.heritage.org/homeland-security/report/conservative-principles-political-reality-and-the-war-terrorism", "message": "And when the Taliban government there refused, the United States and its allies attacked.\nExplained in military terms, this was one campaign in the global war on terrorism.\nThis is essentially the position in which the United States found itself with Iraq.\nRemember that the head of the United Nations Disarmament Organization would have been Saddam Hussein's Iraq, and the head of the United Nations Commission on Human Rights is Libya.\nI doubt very much that, left to their own devices, our military war planners would have opted for the force configuration and flow that they used.", "location": "Iraq", "classification": "security", "score": 0.8345013294665995, "event_breakdown": "1. The United States and its allies attacked Afghanistan after the Taliban government refused demands.\n2. The attack on Afghanistan was part of the global war on terrorism.\n3. The United States found itself in a similar position with Iraq as it did with Afghanistan.\n4. Iraq, under Saddam Hussein's rule, was the head of the United Nations Disarmament Organization.\n5. Libya was the head of the United Nations Commission on Human Rights.\n6. There were doubts about whether the military war planners would have chosen the same force configuration and flow if left to their own devices."}, {"id": "6b274d31-4222-4505-93af-89cc966d0e5d", "title": "Israel bans Al Jazeera : A look at the history of its feud , the network coverage of Gaza & accusations", "date": "2024-05-08 11:00", "url": "https://www.thehindu.com/news/international/israel-bans-al-jazeera-a-look-at-the-history-of-its-feud-the-networks-coverage-of-gaza-accusations/article68150990.ece", "message": "Israel shuts down Al Jazeera offices.\npic.twitter.com/8gLPtzOu4P — Al Jazeera English (@AJEnglish) May 5, 2024Additionally, the order also withdraws all accreditation granted to Al Jazeera’s crew, bans media service providers from transmitting the broadcast channel and blocks its websites.\nHow did Israel shut down Al Jazeera?\nAl Jazeera is one of the only news networks with broadcast offices in both the West Bank and the Gaza Strip.\nCountering Hamas, Israel launched continuous air attacks on Gaza as Hamas rocket attacks into Israel continued.", "location": "Gaza Strip", "classification": "security", "score": 0.9752164442551149, "event_breakdown": "- Israel shuts down Al Jazeera offices\n- Withdrawal of accreditation to Al Jazeera's crew\n- Ban on media service providers from transmitting the broadcast channel\n- Blocking of Al Jazeera's websites\n- Continuous air attacks on Gaza by Israel\n- Hamas rocket attacks into Israel"}, {"id": "a06c3ae1-a465-40a4-be79-e0977169d4e1", "title": "HRW declares Israeli attack on Lebanon rescuers  unlawful  - Newspaper", "date": "2024-05-08 07:45", "url": "https://www.dawn.com/news/1832135/hrw-declares-israeli-attack-on-lebanon-rescuers-unlawful", "message": "BEIRUT: Human Rights Watch said on Tuesday an Israeli strike in Lebanon that killed seven first responders was “an unlawful attack on civilians”, and urged Washington to suspend weapons sales to Israel.\n“An Israeli strike on an emergency and relief centre” in the southern village of Habariyeh on March 27 “killed seven emergency and relief volunteers” and constituted an “unlawful attack on civilians that failed to take all necessary precautions”, HRW said in a statement.\nThe Israeli military did not immediately comment when contacted.\n“Israeli forces used a US weapon to conduct a strike that killed seven civilian relief workers in Lebanon who were merely doing their jobs,” HRW’s Lebanon researcher, Ramzi Kaiss, said.\nThe rights group urged the United States to “immediately suspend arms sales and military assistance to Israel given evidence that the Israeli military is using US weapons unlawfully”.", "location": "Habariyeh", "classification": "security", "score": 0.871043794071978, "event_breakdown": "- An Israeli strike on an emergency and relief center in the southern village of Habariyeh on March 27.\n- The strike resulted in the death of seven emergency and relief volunteers.\n- Human Rights Watch deemed the attack as an \"unlawful attack on civilians.\"\n- HRW urged Washington to suspend weapons sales to Israel.\n- HRW stated that the Israeli military used a US weapon for the strike.\n- The United States was urged to immediately suspend arms sales and military assistance to Israel."}, {"id": "e93c90f6-35b8-40dd-99c0-2ed7d98ecea6", "title": "Russian attack on Odesa on 29 April : another man dies in hospital", "date": "2024-05-08 12:45", "url": "https://www.yahoo.com/news/russian-attack-odesa-29-april-105331325.html", "message": "A man who was injured in a Russian missile attack on the city of Odesa on 29 April has died in hospital.\nSource: a statement from Odesa City HallQuote: \"Unfortunately, the death toll from the Russian attack on Odesa on 29 April has risen to 7.\nOne more man, aged about 23, died in hospital today [8 May – ed.\nBackground:On 29 April, Russian forces carried out a missile strike on Odesa.\nOn 1 May, the death toll from the missile attack on Odesa rose to six, as a man died in hospital.", "location": "ODESA", "classification": "security", "score": 0.8671119895904036, "event_breakdown": "Events in the text:\n\n1. Russian missile attack on the city of Odesa on 29 April.\n2. A man injured in the attack died in hospital.\n3. Death toll from the Russian attack on Odesa on 29 April rises to 7.\n4. One more man, aged about 23, dies in hospital on 8 May.\n5. Death toll from the missile attack on Odesa rises to six on 1 May."}, {"id": "43df17b9-f4d7-422b-8390-525bdaa61d2c", "title": "Immigrants , crime , crime rate , terrorism , order security | Homeland Security Newswire", "date": "2024-05-08 03:15", "url": "https://www.homelandsecuritynewswire.com/dr20240507-the-manufactured-crisis-of-migrant-terrorists-at-the-border", "message": "Reports that illegal border crossers who are on the terrorist watch list have been apprehended seem to validate these fears.\nSince late 2020, Border Patrol has encountered 357 foreigners on the terrorist watch list attempting to cross the southwest border illegally.\nBut being on the watch list does not necessarily indicate an intent to commit terrorism on U.S. soil—which is what the public actually cares about.\nAlmost 98 percent of all victims of foreign‐born terrorists were murdered in the 9/11 terror attacks—the deadliest in world history.\nThis is not to trivialize the threat posed by foreign‐born terrorists to the lives, liberty, and private property of Americans.", "location": "southwest border", "classification": "security", "score": 0.772474593067622, "event_breakdown": "- Reports of illegal border crossers on the terrorist watch list being apprehended\n- Border Patrol encountering 357 foreigners on the terrorist watch list attempting to cross the southwest border illegally\n- Clarification that being on the watch list doesn't necessarily indicate intent to commit terrorism on U.S. soil\n- Mention of almost 98 percent of victims of foreign-born terrorists being murdered in the 9/11 terror attacks, the deadliest in world history\n- Acknowledgment of the threat posed by foreign-born terrorists to the lives, liberty, and private property of Americans"}, {"id": "0311f838-28ff-4cd2-95f2-9a04ba47ef84", "title": "Iran Announces It Is  Broadening the Battlefront  in War on Israel , U . S . ", "date": "2024-05-08 13:30", "url": "https://www.breitbart.com/middle-east/2024/05/08/iran-announces-it-is-broadening-the-battlefront-in-war-on-israel-u-s/", "message": "The commander of Iran’s Islamic Revolutionary Guard Corps (IRGC), Maj. Gen. Hossein Salami, claimed on Tuesday his rogue regime is “broadening the battlefront” against Israel and America to hasten the collapse of both nations.\nAnother Iranian terrorist proxy, the Houthi jihadist movement of Yemen, also issued an announcement on May 3 that its fighters would turn to the Mediterranean.\nIn his remarks on Tuesday, Salami, the Iranian IRGC commander, said Iran was “protecting [its] own country’s national security and also the security and dignity of other Muslims” by antagonizing and supporting terrorism against Israel.\nNaval Forces Central Command / U.S. 5th FleetThe IRGC is a U.S.-designated terrorist organization and a formal arm of the Iranian military.\nThe terror commander’s comments occurred on the same day that Israel confirmed a military operation in Rafah, the southernmost point of the Hamas-controlled Gaza Strip.", "location": "Rafah", "classification": "security", "score": 0.7687630055715252, "event_breakdown": "- The commander of Iran's Islamic Revolutionary Guard Corps (IRGC), Maj. Gen. Hossein Salami, claimed that Iran is broadening the battlefront against Israel and America.\n- The Houthi jihadist movement of Yemen announced that its fighters would turn to the Mediterranean.\n- Salami stated that Iran is protecting its own country's national security and supporting terrorism against Israel.\n- The IRGC is a U.S.-designated terrorist organization and a formal arm of the Iranian military.\n- Israel confirmed a military operation in Rafah, the southernmost point of the Hamas-controlled Gaza Strip."}, {"id": "149d2ddc-7127-41ba-b160-8a729a6af098", "title": "Zelensky Assassination Plot : Ukraine Thwarts Alleged Russia - Backed Attempt", "date": "2024-05-08 01:00", "url": "https://foreignpolicy.com/2024/05/07/zelensky-assassination-plot-attempt-putin-russia-gordon-black-soldier/?tpcc=recirc_trending062921", "message": "Failed Hit on ZelenskyKyiv foiled what it said was a Russian-coordinated plot to assassinate senior Ukrainian officials, including President Volodymyr Zelensky, Ukraine’s security service announced on Tuesday.\nFederal authorities arrested two Ukrainian security officials on suspicion of treason, which carries a life sentence, and of preparing a terrorist act.\nRussian President Vladimir Putin provided no immediate response to the allegation.\nUkrainian officials said the suspects planned to kill Budanov before Orthodox Easter, which fell on May 5 this year, by providing information on his whereabouts to target him in a rocket and drone strike.\nKyiv usually remains tight-lipped about assassination attempts against senior officials, of which there have been several since Russia’s war against Ukraine began.", "location": "Kyiv", "classification": "security", "score": 0.5304352600824518, "event_breakdown": "- Failed Hit on Zelensky in Kyiv\n- Foiled Russian-coordinated plot to assassinate senior Ukrainian officials\n- Arrest of two Ukrainian security officials on suspicion of treason and preparing a terrorist act\n- No immediate response from Russian President Vladimir Putin\n- Suspects planned to kill Budanov before Orthodox Easter through a rocket and drone strike\n- History of assassination attempts against senior officials in Ukraine since Russia's war began"}, {"id": "acc92840-3e9d-408f-a3bd-596de755cf03", "title": "Sette morti e diversi feriti in un raid di Israele su Gaza", "date": "2024-05-08 03:15", "url": "https://www.giornaledibrescia.it/italia-e-estero/sette-morti-e-diversi-feriti-in-un-raid-di-israele-su-gaza-khqfngug", "message": "GAZA, 08 MAG - Almeno sette persone sono rimaste uccise e diverse altre ferite oggi in un attacco aereo israeliano sulla città di Gaza, rende noto l'ospedale al-Ahli.\nL'agenzia di stampa palestinese Wafa afferma che il raid ha colpito un edificio residenziale nel quartiere orientale di Zeitoun.\nLe vittime apparterrebbero tutte alla stessa famiglia e tra loro ci sarebbero anche alcuni bambini, aggiunge la Wafa.\nIl bilancio dal 7 ottobre scorso nella Striscia di Gaza è di almeno 34.789 morti e 78.204 feriti, secondo il ministero della Sanità locale gestito da Hamas.", "location": "Gaza", "classification": "security", "score": 0.9531312870958195, "event_breakdown": "null"}, {"id": "537c9fc2-004f-4cc5-a021-43f3648b8bde", "title": "Russians damage critical infrastructure in Kirovohrad and Poltava oblasts , injuring child", "date": "2024-05-08 09:15", "url": "https://www.yahoo.com/news/russians-damage-critical-infrastructure-kirovohrad-043859616.html", "message": "Russian forces damaged a critical infrastructure facility, 13 residential buildings and dozens of garages in Kirovohrad Oblast during a missile attack on the night of 7-8 May, injuring a child.\nSource: Andrii Raikovych, Head of Kirovohrad Oblast Military Administration; Filip Pronin, Head of Poltava Oblast Military AdministrationQuote from Raikovych: \"As a result of an enemy missile attack on Kirovohrad Oblast, a critical infrastructure facility was damaged in Oleksandriia district.\nDespite the successful efforts of our defenders, we unfortunately had a strike on a power infrastructure facility in Poltava district.\nNo casualties or damage were reported in Kyiv after the Russian missile strike on the night of 7-8 May.\nPower generation and transmission facilities in six of Ukraine’s oblasts were attacked by the Russians: Poltava, Kirovohrad, Zaporizhzhia, Lviv, Ivano-Frankivsk and Vinnytsia.", "location": "Kirovohrad Oblast", "classification": "security", "score": 0.9886088409947793, "event_breakdown": "- Location: Kirovohrad Oblast, Ukraine\n- Event: Russian forces damaged a critical infrastructure facility, 13 residential buildings, and dozens of garages in Kirovohrad Oblast during a missile attack on the night of 7-8 May, injuring a child.\n- Source: Andrii Raikovych, Head of Kirovohrad Oblast Military Administration\n- Location: Poltava Oblast, Ukraine\n- Event: A power infrastructure facility was struck in Oleksandriia district during the missile attack, according to Raikovych.\n- Quote from Raikovych: \"Despite the successful efforts of our defenders, we unfortunately had a strike on a power infrastructure facility in Poltava district.\"\n- Location: Kyiv, Ukraine\n- Event: No casualties or damage were reported in Kyiv after the Russian missile strike on the night of 7-8 May.\n- Other locations affected: Zaporizhzhia, Lviv, Ivano-Frankivsk, Vinnytsia\n- Event: Power generation and transmission facilities in six of Ukraine’s oblasts, including Poltava, Kirovohrad, Zaporizhzhia, Lviv, Ivano-Frankivsk, and Vinnytsia, were attacked by the Russians."}, {"id": "898309d9-2911-4657-90bd-bd8987f2d3ab", "title": "American Academic Claims Israeli Killings in Gaza Worse Than Darfur", "date": "2024-05-08 07:30", "url": "https://www.frontpagemag.com/american-academic-claims-israeli-killings-in-gaza-worse-than-darfur/", "message": "The total deaths in the seven months of the Gaza War, according to the unverifiable, and likely exaggerated, figure put out by Hamas, are 34,000.\nThe total number of Hamas and PIJ combatants killed in that same period, according to the IDF estimate, are 15,000.\nHe states that the Gaza death toll reached 33,000 in the six months since the war began (an average of 5,500 per month).\nRemember that the world is supplied with statistics on Gaza deaths by the Health Ministry that is supplied with its figures from Hamas.\nWe can’t be sure of how many civilians died in Gaza, but we can be sure that whatever figure Hamas gives out, it is certain to be greatly exaggerated.", "location": "Gaza", "classification": "security", "score": 0.4654515137546569, "event_breakdown": "The information provided is about the Gaza War and the reported death tolls, but it does not specify individual events with distinct locations or incidents that can be mapped. Therefore, I'm unable to extract specific events from the text."}, {"id": "ceba6765-e05e-44c8-b457-33e2b6aba1ac", "title": "Israel - Hamas war enters seventh month : How the destruction in Gaza is unlike anything seen before", "date": "2024-05-08 08:30", "url": "https://www.firstpost.com/explainers/israel-hamas-war-seventh-month-destruction-gaza-unlike-anything-seen-before-13768488.html", "message": "The seven-month war between Israel and Hamas has killed over 34,000 people, caused catastrophic levels of hunger and injury, and destroyed massive amounts of material in Gaza.\nReutersThe Gaza war has reached its seventh month.\nAn Israeli mobile artillery unit fires a shell from southern Israel towards the Gaza Strip, in a position near the Israel-Gaza border, Tuesday, 7 May, 2024.\nAdvertisementThe territory’s largest hospital, Al-Shifa in Gaza City, was targeted in two offensives by the Israeli army, the first in November, the second in March.\nSmoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah, southern Gaza Strip.", "location": "Gaza City", "classification": "security", "score": 0.9818307959639397, "event_breakdown": "- The seven-month war between Israel and Hamas has killed over 34,000 people, caused catastrophic levels of hunger and injury, and destroyed massive amounts of material in Gaza.\n- The Gaza war has reached its seventh month.\n- An Israeli mobile artillery unit fires a shell from southern Israel towards the Gaza Strip, in a position near the Israel-Gaza border, Tuesday, 7 May, 2024.\n- The territory’s largest hospital, Al-Shifa in Gaza City, was targeted in two offensives by the Israeli army, the first in November, the second in March.\n- Smoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah, southern Gaza Strip."}, {"id": "0113a6e3-584f-4b22-a294-6bfc7f006b33", "title": "Barry Romo , Vietnam veteran who then fought against the war , dies at 76", "date": "2024-05-08 03:45", "url": "https://www.stripes.com/veterans/2024-05-07/barry-romo-obit-vietnam-veteran-13787712.html", "message": "Michael Allen, of Yale Divinity School; folk singer Joan Baez; and Barry Romo, of Vietnam Veterans Against the War.\nStanding near Romo was former Navy lieutenant John F. Kerry, also a leader of the Vietnam Veterans Against the War.\nBarry Romo, second from left, and Bill Davis in Chicago marching with Vietnam Veterans Against the War on Veterans Day circa 1970.\n“Our slogan was ‘honor the warrior, not the war,’” said Romo, who began work in the national office of the Vietnam Veterans Against the War in 1972.\nGen. Telford Taylor, a chief prosecutor at the post-World War II Nuremberg trials who became a staunch critic of the Vietnam War.", "location": "Chicago", "classification": "security", "score": 0.7197895452588408, "event_breakdown": "- Location: Yale Divinity School\n  Description: Michael Allen, Joan Baez, and Barry Romo were present.\n\n- Location: Vietnam Veterans Against the War event (unspecified location)\n  Description: John F. Kerry, a former Navy lieutenant and leader of the Vietnam Veterans Against the War, was present.\n\n- Location: Chicago (presumably)\n  Description: Barry Romo and Bill Davis marched with the Vietnam Veterans Against the War on Veterans Day around 1970.\n\n- Location: National office of the Vietnam Veterans Against the War (unspecified location)\n  Description: Barry Romo started working there in 1972.\n\n- Location: Nuremberg\n  Description: General Telford Taylor, a chief prosecutor at the post-World War II Nuremberg trials who became a staunch critic of the Vietnam War, was mentioned."}, {"id": "7d732c9d-09a4-448e-8ecc-72b5329d547b", "title": "Ukraine Says It Thwarted Russian Plan To Kill Zelenskiy , Top Officials", "date": "2024-05-08 14:30", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240507-rferl01.htm", "message": "Ukraine Says It Thwarted Russian Plan To Kill Zelenskiy, Top OfficialsBy RFE/RL's Ukrainian Service May 07, 2024KYIV - Ukraine's SBU security service said it \"thwarted\" an assassination attempt against President Volodymyr Zelenskiy by a network of five Ukrainian agents linked to Russia's Federal Security Service (FSB), the successor agency to the Soviet-era KGB.\n\"Counterintelligence and SBU investigators thwarted the FSB's plans to eliminate the president of Ukraine and other representatives of the top military and political leadership,\" SBU said on Telegram.\nThe Chemical Weapons Convention states that any toxic chemical used with the intention of causing harm is considered a chemical weapon.\nMeanwhile, on the battlefield, Russian shelling killed one civilian and wounded eight in several Ukrainian regions, officials reported early on May 7.\nAnother Russia-installed official claimed without providing evidence that Ukraine had used a U.S.-made Army Tactical Missile System, known as ATACMS, in the attack.", "location": "Kyiv", "classification": "security", "score": 0.6516923420793878, "event_breakdown": "- Location: Kyiv, Ukraine\n  Description: Ukraine's SBU security service claims to have thwarted an assassination attempt against President Volodymyr Zelenskiy by a network of five Ukrainian agents linked to Russia's Federal Security Service (FSB).\n\n- Location: Various Ukrainian regions\n  Description: Russian shelling killed one civilian and wounded eight people in several Ukrainian regions.\n\n- Location: Unspecified\n  Description: Another Russia-installed official alleges, without evidence, that Ukraine used a U.S.-made Army Tactical Missile System (ATACMS) in an attack."}, {"id": "d11ff933-4fff-462f-a729-f7e62772571a", "title": "Death Toll From Ukrainian Drone Attack on Russia Belgorod Climbs to 8", "date": "2024-05-08 15:15", "url": "https://www.themoscowtimes.com/2024/05/08/death-toll-from-ukrainian-drone-attack-on-russias-belgorod-climbs-to-8-a85070", "message": "The death toll from a Ukrainian drone strike on western Russia’s Belgorod region earlier this week has risen to eight people, Russian authorities said Wednesday.\nIn one of the deadliest recent attacks inside Russia, six people were killed Monday when drones struck two vans and a car near the village of Berezovka, around 7 kilometers from the Ukraine border, Belgorod region Governor Vyacheslav Gladkov said.\nThe agricultural company Agro-Belogorye previously said seven of its workers were killed and 32 others wounded in the strike.\n“Another civilian has died from the drone attack in the Borisovsky district on May 6,” Gladkov said on Telegram, adding that a man died at the hospital after being “seriously injured.” He did not specify whether the man was an employee of Agro-Belogorye.", "location": "Belgorod", "classification": "security", "score": 0.9301675240060701, "event_breakdown": "- Location: Belgorod region, western Russia\n- Event: Ukrainian drone strike resulted in the death of eight people, according to Russian authorities.\n- Details: Six people were killed when drones struck two vans and a car near the village of Berezovka, approximately 7 kilometers from the Ukraine border, as reported by Belgorod region Governor Vyacheslav Gladkov.\n- Related Event: Seven workers of the agricultural company Agro-Belogorye were killed, and 32 others were wounded in the strike, as previously reported.\n- Additional Casualty: Another civilian died from the drone attack in the Borisovsky district on May 6, as mentioned by Gladkov, though it's unclear if the individual was affiliated with Agro-Belogorye."}, {"id": "1a217980-de42-40bf-a400-a9d990489d77", "title": "Israel - Hamas war day 215 : What going on in Gaza ? ", "date": "2024-05-08 03:45", "url": "https://www.jpost.com/israel-hamas-war/2024-05-08/live-updates-800372", "message": "An anti-Israel billboard with a picture of Iranian missiles is seen on a street in Tehran, Iran April 19, 2024.\nCritics use logical fallaciesBut at the same time, these same critics have urged Israel not to attack the Islamic Republic’s nuclear weapons program.\nThe S-300 missile system is seen during the National Army Day parade ceremony in Tehran, Iran, April 17, 2024.\nSome of these same critics then urged Israel not to attack Iran back so as to avoid the conflict deteriorating into a regional war.\nMost importantly, to avoid regional war, they urged Israel not to touch Iran’s nuclear weapons program.", "location": "Tehran, Iran", "classification": "security", "score": 0.5420229878845749, "event_breakdown": "- Location: Tehran, Iran\n- Event: An anti-Israel billboard featuring a picture of Iranian missiles is seen on a street in Tehran on April 19, 2024.\n- Event: The S-300 missile system is displayed during the National Army Day parade ceremony in Tehran on April 17, 2024.\n- Event: Critics have urged Israel not to attack the Islamic Republic’s nuclear weapons program to avoid regional war.\n- Event: Some of these critics have also urged Israel not to retaliate against Iran to prevent the conflict from escalating into a regional war."}, {"id": "ae2926e9-9dfd-4dcf-ac7f-5d67d634e50c", "title": "Hamas warns Israel that new ceasefire talks are  the last chance  to free hostages as IDF strikes targets in Gaza after seizing control of Rafah crossing - with  concerned  US pausing bomb shipments", "date": "2024-05-08 07:45", "url": "https://www.dailymail.co.uk/news/article-13394619/Hamas-warns-Israel-new-ceasefire-talks-chance-free-hostages-IDF-strikes-targets-Gaza-seizing-control-Rafah-crossing-concerned-pausing-bomb-shipments.html", "message": "The United States has halted bomb shipments to Israel amid 'concerns' over its ally's invasion of Rafah, the overcrowded city in southern Gaza.\nThe White House condemned Israeli's move to capture the Rafah crossing, which interrupted sorely needed humanitarian deliveries, and paused shipments of bombs after Israel failed to address Washington's concerns over its Rafah plans.\nDespite the Cairo talks, witnesses and a local hospital reported Israeli strikes across the Gaza Strip overnight into Wednesday morning, including around Rafah.\n'The Israeli operation also highlights the tightening of the noose around Hamas' leaders and final bastion in Rafah...\nBut the Rafah operation was roundly condemned by world governments, human rights groups and aid agencies.", "location": "Rafah", "classification": "security", "score": 0.7278087818711054, "event_breakdown": "null"}, {"id": "b540aa6e-978e-440a-956c-7b3360aa3e29", "title": "Israel reopens key crossing for aid to enter Gaza that was closed over weekend rocket attack", "date": "2024-05-08 10:00", "url": "https://www.newsday.com/news/nation/israel-hamas-war-news-05-08-2024-f91924", "message": "The Kerem Shalom crossing between Gaza and Israel was closed over the weekend after a Hamas rocket attack killed four Israeli soldiers nearby, and on Tuesday, an Israeli tank brigade seized the nearby Rafah crossing between Gaza and Egypt, forcing its closure.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight, including two large blasts early Wednesday.\nThe Israeli military reported six launches from Rafah toward the Kerem Shalom crossing on Tuesday.\nCOGAT, the Israeli military body in charge of Palestinian civilian affairs, said the Kerem Shalom crossing reopened early Wednesday.\nThe U.S. has historically provided Israel enormous amounts of military aid, which has only accelerated since the start of the war.", "location": "Rafah crossing", "classification": "security", "score": 0.971408882835906, "event_breakdown": "1. **Kerem Shalom Crossing Closure:** The Kerem Shalom crossing between Gaza and Israel was closed after a Hamas rocket attack killed four Israeli soldiers nearby.\n\n2. **Israeli Seizure of Rafah Crossing:** An Israeli tank brigade seized the Rafah crossing between Gaza and Egypt, forcing its closure.\n\n3. **Explosions and Gunfire at Rafah Crossing:** Associated Press journalists reported sporadic explosions and gunfire in the area of the Rafah crossing overnight, including two large blasts early on Wednesday.\n\n4. **Rockets Launched from Rafah:** The Israeli military reported six launches from Rafah towards the Kerem Shalom crossing.\n\n5. **Kerem Shalom Crossing Reopened:** COGAT, the Israeli military body in charge of Palestinian civilian affairs, announced that the Kerem Shalom crossing reopened early on Wednesday.\n\n6. **U.S. Military Aid to Israel:** The United States has historically provided significant amounts of military aid to Israel, and this aid has increased since the start of the war."}, {"id": "be594fcd-6e4e-4b60-97f5-6fa5e2b398cb", "title": "Heightened Security at AMIA : Reflecting on Argentina Traumatic Past", "date": "2024-05-08 15:15", "url": "https://latinamericanpost.com/americas/politics/heightened-security-at-amia-reflecting-on-argentinas-traumatic-past/", "message": "A bomb threat at the Argentine Israelite Mutual Association (AMIA) building in Buenos Aires prompted an urgent police response, reminding the nation of its vulnerable past and ongoing commitment to combatting terrorism.\nThis week, an unsettling echo of Argentina’s turbulent history resounded through the streets of Buenos Aires as a bomb threat targeted the headquarters of the Argentine Israelite Mutual Association (AMIA).\nThe bomb scare began with a phone call received at 14:22 local time, claiming a potential threat at the AMIA building.\nFollowing established security protocols, the leadership of AMIA and the Delegation of Israeli-Argentine Associations (DAIA) swiftly involved the Anti-Terrorism Investigation Unit of the Federal Police of Argentina.\nCurrent Political Context and Security MeasuresThe recent bomb threat occurs against a backdrop of renewed international focus on terrorism, driven by Argentina’s current political stance.", "location": "Buenos Aires", "classification": "security", "score": 0.8646829619621793, "event_breakdown": "- Location: Buenos Aires, Argentina\n  Description: A bomb threat at the Argentine Israelite Mutual Association (AMIA) building prompted a police response. This was triggered by a phone call at 14:22 local time, indicating a potential threat at the AMIA building. The Anti-Terrorism Investigation Unit of the Federal Police of Argentina was involved in the response.\n"}, {"id": "797f9fd9-b16b-478f-8cce-73ba30564f4b", "title": "Israel reopens key crossing for aid to enter Gaza after rocket attack", "date": "2024-05-08 11:15", "url": "https://www.theargus.co.uk/news/national/24305011.israel-reopens-key-crossing-aid-enter-gaza-rocket-attack/", "message": "The Kerem Shalom crossing between Gaza and Israel was closed over the weekend after a Hamas rocket attack killed four Israeli soldiers nearby, and on Tuesday, an Israeli tank brigade seized the nearby Rafah crossing between Gaza and Egypt, forcing its closure.\nThe Israeli foray did not appear to be the start of the full-scale invasion of the city of Rafah that Israel has repeatedly promised.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight, including two large blasts early on Wednesday.\nSmoke rises following an Israeli bombardment in the Gaza Strip as seen from southern Israel (Leo Correa/AP)The Israeli military reported six launches from Rafah towards the Kerem Shalom crossing on Tuesday.\nCOGAT, the Israeli military body in charge of Palestinian civilian affairs, said the Kerem Shalom crossing reopened early on Wednesday.", "location": "Rafah", "classification": "security", "score": 0.9758271859597445, "event_breakdown": "null"}, {"id": "d8ae933c-9d49-4622-b234-35a2c82961e8", "title": "Israel seizes Gaza vital Rafah crossing , but the U . S . says it isnt the full invasion many fear", "date": "2024-05-08 03:00", "url": "https://www.theday.com/nation/20240507/israel-seizes-gazas-vital-rafah-crossing-but-the-u-s-says-it-isnt-the-full-invasion-many-fear/", "message": "Smoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah, southern Gaza Strip, Tuesday, May 7, 2024.\nIsrael's 401st Brigade took “operational control” of the Gaza side of the Rafah crossing early Tuesday, the military said.\nIsraeli authorities denied the U.N. humanitarian affairs office access to the Rafah crossing Tuesday, said its spokesman, Jens Laerke.\nSmoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah, southern Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Leo Correa)Smoke rises following an Israeli bombardment in the Gaza Strip as seen from southern Israel, Tuesday, May 7, 2024.", "location": "Rafah, southern Gaza Strip", "classification": "security", "score": 0.8909584145693952, "event_breakdown": "- Location: Near the separating wall between Egypt and Rafah, southern Gaza Strip\n  Description: Israeli airstrike on buildings.\n\n- Location: Rafah crossing (presumably in Gaza)\n  Description: Israel's 401st Brigade took \"operational control.\"\n\n- Location: Rafah crossing (presumably in Gaza)\n  Description: Israeli authorities denied access to the U.N. humanitarian affairs office.\n\n- Location: Gaza Strip (as seen from southern Israel)\n  Description: Smoke rises following an Israeli bombardment."}, {"id": "be8caf67-9c39-4f5f-8cb0-c9f8f30dadf2", "title": "Israel seizes Gaza vital Rafah crossing , but the US says it isnt the full invasion many fear", "date": "2024-05-08 01:15", "url": "https://www.timesleader.com/news/1653951/israel-seizes-gazas-vital-rafah-crossing-but-the-us-says-it-isnt-the-full-invasion-many-fear", "message": "Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, on Tuesday.\nThey have been closed for at least the past two days, though the smaller Erez crossing between Israel and northern Gaza continues to operate.\nBiden warned Netanyahu again Monday against launching an invasion of the city after Israel ordered 100,000 Palestinians to evacuate parts of Rafah.\nIsrael’s 401st Brigade took “operational control” of the Gaza side of the Rafah crossing early Tuesday, the military said.\nIsraeli authorities denied the U.N. humanitarian affairs office access to the Rafah crossing Tuesday, said its spokesman, Jens Laerke.", "location": "Rafah", "classification": "security", "score": 0.5726721456202832, "event_breakdown": "null"}, {"id": "9e2720eb-12e9-4ac0-8a5c-8919177ae0c0", "title": "Prosecutor Office : Ukrainian oligarch Kolomoisky suspected of ordering murder of lawyer in 2003", "date": "2024-05-08 15:15", "url": "https://www.yahoo.com/news/prosecutors-office-ukrainian-oligarch-kolomoisky-135207605.html", "message": "Jailed Ukrainian oligarch Ihor Kolomoisky is suspected of ordering the murder of the head of a law firm more than 20 years ago in Crimea, the Prosecutor General's Office reported on May 8.\nHe is the wealthiest businessman to have landed behind bars in Ukraine's independent history.\nFour men who were part of a \"criminal gang\" attacked the law firm's director, beating him and stabbing him.\nOn May 8, Ukrainian law enforcement officially announced that Kolomoisky was suspected of ordering the assassination.\nSubscribe to the NewsletterUkraine Business RoundupSubscribeThe Shevchenkivskyi district court recently extended Kolomoisky's detention for another two months on Feb. 28 until April 28.", "location": "CRIMEA", "classification": "security", "score": 0.6362951496005376, "event_breakdown": "null"}, {"id": "7b2a08b6-7450-4ac2-8234-db251d260dd7", "title": "Palestinian death toll in Gaza climbs to 34 , 789", "date": "2024-05-08 04:15", "url": "http://www.china.org.cn/world/2024-05/08/content_117173140.htm", "message": "视频播放位置 下载安装Flash播放器A man holds the body of a child killed in an Israeli airstrike at a hospital in the southern Gaza Strip city of Rafah, on May 7, 2024.\n[Photo/Xinhua]The Palestinian death toll from ongoing Israeli attacks on the Gaza Strip has risen to 34,789, health authorities in Gaza said in a press statement on Tuesday.\nThe Israeli army killed 54 people and wounded 96 others during the past 24 hours, bringing the total death toll to 34,789 and injuries to 78,204 since the Palestinian-Israeli conflict broke out in October last year, according to the statement.\nAt least one Palestinian was killed and nine others were injured by Israeli troops' gunfire during a nearly 20-hour military operation in the city of Tulkarm in the northern West Bank, Palestinian medical sources said on Tuesday.\nIsrael launched a large-scale offensive against Hamas in the Gaza Strip to retaliate the movement's surprise attack on southern Israel on Oct. 7, 2023, during which about 1,200 people in Israel were killed and more than 200 were taken hostage.", "location": "Rafah", "classification": "security", "score": 0.9702221259208881, "event_breakdown": "null"}, {"id": "e2014a0b-f2bb-4b5b-91f8-7d9fa8d89e51", "title": "German Army confirms video conference security breach ; recordings of over 6 , 000 meetings leaked online – NaturalNews . com", "date": "2024-05-08 10:00", "url": "https://www.naturalnews.com/2024-05-07-german-army-security-breach-6000-meetings-leaked.html", "message": "German Army confirms video conference security breach; recordings of over 6,000 meetings leaked onlineThe German Army has confirmed that it has discovered a security breach in the video conferencing system it uses , raising significant concerns about the privacy and security of military communications.\nThe leaked 38-minute recording, aired on Russia's state broadcaster RT and later confirmed by the German government, featured discussions among German military officers regarding missile transfers to Ukraine.\nThe leaked audio tape reignited debates over German missile deliveries to Ukraine and raised concerns about the security of government communications online.\nParliamentary Commissioner for the Armed Forces Eva Hogl called for comprehensive measures to enhance military security and counter espionage, stressing the need for increased vigilance.\nThe incident also prompted scrutiny of communication platforms like WebEx, with past security vulnerabilities adding to concerns about confidential communications.", "location": "Berlin", "classification": "security", "score": 0.5282352413750115, "event_breakdown": "- Location: Germany\n- Event: German Army confirms a security breach in its video conferencing system.\n- Details: Recordings of over 6,000 meetings leaked online, raising concerns about the privacy and security of military communications.\n- Related Events:\n  - A leaked 38-minute recording, aired on Russia's state broadcaster RT, featured discussions among German military officers regarding missile transfers to Ukraine.\n  - Parliamentary Commissioner for the Armed Forces Eva Hogl called for comprehensive measures to enhance military security and counter espionage, emphasizing the need for increased vigilance.\n- Impact:\n  - The incident reignited debates over German missile deliveries to Ukraine.\n  - Concerns were raised about the security of government communications online.\n  - Scrutiny of communication platforms like WebEx ensued, with past security vulnerabilities adding to concerns about confidential communications."}, {"id": "87162953-6c14-4fac-a5b4-9bbd729edb42", "title": "Xi begins Serbia visit on the 25th anniversary of NATO bombing of the Chinese Embassy | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-05-08 04:45", "url": "https://www.asahi.com/ajw/articles/15258845", "message": "BELGRADE, Serbia--Chinese leader Xi Jinping’s visit to European ally Serbia on Tuesday falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during NATO’s air war over Kosovo.\nU.S. jets dropped five bombs on the Chinese Embassy compound in the Serbian capital on May 7, 1999, setting it ablaze and killing three Chinese nationals.\n“The Chinese people value peace but will never allow historical tragedies to happen again,” Xi added.\nThe U.S. at the time apologized and said the embassy bombing was a mistake that happened due to faulty intelligence.\nHe is expected to visit the site of the former embassy and pay his respects to the bombing victims.", "location": "BELGRADE", "classification": "security", "score": 0.5225342438980963, "event_breakdown": "- Location: Belgrade, Serbia\n  Description: Chinese leader Xi Jinping's visit to Serbia coincides with the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during NATO's air war over Kosovo.\n\n- Location: Belgrade, Serbia\n  Description: U.S. jets bombed the Chinese Embassy compound in the Serbian capital on May 7, 1999, resulting in the death of three Chinese nationals.\n\n- Location: Belgrade, Serbia\n  Description: Xi Jinping is expected to visit the site of the former embassy and pay respects to the bombing victims during his visit to Serbia."}, {"id": "fc9b975b-a74a-4d9f-978d-ce0ec5aa932d", "title": "Israel seizes Gaza vital Rafah crossing , but the US says it isnt the full invasion many fear", "date": "2024-05-08 02:00", "url": "https://economictimes.indiatimes.com/news/international/world-news/israel-seizes-gazas-vital-rafah-crossing-but-the-us-says-it-isnt-the-full-invasion-many-fear/articleshow/109931714.cms", "message": "He said CIA chief William Burns will attend further talks in Cairo with representatives from Israel, Egypt and Qatar.\nHamas also sent a delegation to Cairo, which will meet separately with the Arab mediators.\nFamilies fled Rafah's eastern neighborhoods on foot or in vehicles and donkey carts piled with mattresses and supplies.\nHe questioned whether military pressure was an effective bargaining tactic.Israel's 401st Brigade took \"operational control\" of the Gaza side of the Rafah crossing early Tuesday, the military said.\n... We don't have Hamas,\" he said.Egypt's Foreign Ministry condemned the seizure of the crossing, calling it \"a dangerous escalation.", "location": "Rafah", "classification": "security", "score": 0.6112221983031633, "event_breakdown": "- Location: Cairo, Egypt  \n  Event: CIA chief William Burns attends talks with representatives from Israel, Egypt, and Qatar. A separate meeting with a Hamas delegation and Arab mediators is also planned.\n\n- Location: Rafah, Gaza Strip\n  Event: Families fled eastern neighborhoods, some on foot and others using vehicles or donkey carts, carrying mattresses and supplies.\n\n- Location: Rafah crossing, Gaza Strip\n  Event: Israel's 401st Brigade took \"operational control\" early Tuesday.\n\n- Location: Cairo, Egypt\n  Event: Egypt's Foreign Ministry condemned Israel's seizure of the Rafah crossing."}, {"id": "032d13b7-d887-46e9-9059-85e8e94945f7", "title": "Russia biggest airstrike in weeks piles pressure on Ukraine power grid", "date": "2024-05-08 10:00", "url": "https://tribune.com.pk/story/2465665/russias-biggest-airstrike-in-weeks-piles-pressure-on-ukraine-power-grid", "message": "PHOTO: REUTERSRussian missiles and drones struck nearly a dozen Ukrainian critical infrastructure facilities in a major airstrike early on Wednesday, causing serious damage at three Soviet-era thermal power plants, Kyiv officials said.\nTwo people were injured in the Kyiv region and one was hurt in the Kirovohrad region, Interior Minister Ihor Klymenko said.\nSome 350 rescuers were racing to minimise the damage caused to multiple energy facilities, 30 homes, public transport vehicles, cars and a fire station, he said.\nThe strike was the latest in a wave of attacks on critical energy infrastructure that began in March.\nGovernors of the Vinnytsia and Zaporizhzhia regions said separately that critical civilian infrastructure facilities were damaged, without providing further detail.", "location": "Kyiv", "classification": "security", "score": 0.8378971525844985, "event_breakdown": "1. **Kyiv Region, Ukraine:** Russian missiles and drones struck nearly a dozen Ukrainian critical infrastructure facilities, causing serious damage at three Soviet-era thermal power plants. Two people were injured in the Kyiv region.\n\n2. **Kirovohrad Region, Ukraine:** One person was injured during the airstrike.\n\n3. **Response to Damage:** Around 350 rescuers were deployed to minimize damage to multiple energy facilities, 30 homes, public transport vehicles, cars, and a fire station.\n\n4. **Vinnytsia and Zaporizhzhia Regions, Ukraine:** Governors of both regions reported damage to critical civilian infrastructure facilities, but no further details were provided."}, {"id": "c36b78f1-f71a-441a-b6ab-ace85550ff23", "title": "Israel seizes Gaza vital Rafah crossing , but the US says it isnt the full invasion many fear", "date": "2024-05-08 02:00", "url": "https://www.stltoday.com/news/nation-world/israel-seizes-gaza-s-vital-rafah-crossing-but-the-us-says-it-isn-t-the/article_b510d14a-0c53-11ef-aeab-5feb0d622025.html", "message": "They have been closed for at least the past two days, though the smaller Erez crossing between Israel and northern Gaza continues to operate.\nKirby said Israel described it as “an operation of limited scale and duration” aimed at cutting off Hamas arms smuggling.\nBiden warned Netanyahu again Monday against launching an invasion of the city after Israel ordered 100,000 Palestinians to evacuate parts of Rafah.\nIsrael's 401st Brigade took “operational control” of the Gaza side of the Rafah crossing early Tuesday, the military said.\nIsraeli authorities denied the U.N. humanitarian affairs office access to the Rafah crossing Tuesday, said its spokesman, Jens Laerke.", "location": "Rafah", "classification": "security", "score": 0.41558446970046053, "event_breakdown": "null"}, {"id": "d28f3b9c-d168-447d-a9c2-08de910e5c6b", "title": "Issa Haddad : Church rioter unleashes on media and police outside court", "date": "2024-05-08 07:45", "url": "https://www.9news.com.au/national/church-rioter-unleashes-on-media-and-police-outside-court/0ff85c78-3886-4fb9-9045-92da41d7283b", "message": "A man who took part in a violent uprising at a western Sydney church has swung his arms and spat at journalists outside court.\nREAD MORE: Woman stabbed outside Sydney gymIssa Haddad (right) was spoken to by police after an altercation with media as he departed the Fairfield Local Court in Sydney.\nHaddad yelled at reporters to leave him alone, while he told a police officer who tried to help him up to \"f--- off\".\n(9News)He has pleaded guilty to threatening violence to cause fear during a riot outside the Christ the Good Shepherd in Wakeley.\nFollowing the attack, a crowd swelled outside the church as members of the congregation pinned down the attacker inside.", "location": "Fairfield, Sydney", "classification": "security", "score": 0.6840984405776473, "event_breakdown": "- Location: Fairfield Local Court, Sydney, Australia\n  Description: Issa Haddad, who participated in a violent uprising at a church in western Sydney, spat at and swung his arms towards journalists outside the court. He pleaded guilty to threatening violence during the riot outside the Christ the Good Shepherd in Wakeley."}, {"id": "5f3bfab9-6153-4c42-a392-f278199b3494", "title": "Pakistan Army alleges plot to kill Chinese engineers was hatched in Afghanistan | Indiablooms - First Portal on Digital News Management", "date": "2024-05-08 07:00", "url": "https://www.indiablooms.com/world-details/SA/42523/pakistan-army-alleges-plot-to-kill-chinese-engineers-was-hatched-in-afghanistan.html", "message": "Photo Courtesy: X page video grabThe Pakistan Army has alleged that the plot to kill Chinese engineers in a suicide attack in Khyber Pakhtunkhwa’s Shangla region Mar 26 was hatched in Afghanistan.\n\" This suicide bombing also connects to across the border [in Afghanistan]; the planning of this terrorism [act] was done in Afghanistan.\nTerrorists and their facilitators were also being controlled from Afghanistan and the suicide bomber was also an Afghan [national],\" he said.\n“There is concrete evidence that TTP terrorists are still using Afghan soil to launch attacks in Pakistan,” Sharif said.\nFive Chinese engineers and their Pakistani driver were killed after a suicide bomber rammed his explosive-laden vehicle into their convoy.", "location": "Shangla region", "classification": "security", "score": 0.9152249516225451, "event_breakdown": "- Location: Khyber Pakhtunkhwa's Shangla region, Pakistan\n- Event: Alleged plot to kill Chinese engineers in a suicide attack, as claimed by the Pakistan Army.\n- Details: The plot was allegedly hatched in Afghanistan, with terrorists and facilitators controlled from Afghan soil. The suicide bomber involved was identified as an Afghan national.\n- Casualties: Five Chinese engineers and their Pakistani driver were killed when a suicide bomber targeted their convoy with an explosive-laden vehicle."}, {"id": "d0332e69-9235-43cd-b1a5-02336ef39669", "title": "Israel reopens key Kerem Shalom border crossing for Gaza aid", "date": "2024-05-08 11:45", "url": "https://saudigazette.com.sa/article/642714/World/Mena/Israel-reopens-key-Kerem-Shalom-border-crossing-for-Gaza-aid", "message": "TEL AVIV — Israel says it is reopening the Kerem Shalom crossing with southern Gaza for aid deliveries, four days after it was closed because of Hamas rocket fire.\nIt came after Israeli troops took full control of the Palestinian side of the Rafah crossing with Egypt.\nSeven months into its war with Hamas in Gaza, Israel has said that victory is impossible without taking Rafah.\nAnother six projectiles were fired at Kerem Shalom from the Rafah area on Tuesday, but no casualties were reported.\nOn Wednesday morning, the Israeli military said it had informed international organizations about the reopening of Kerem Shalom for humanitarian aid.", "location": "Kerem Shalom", "classification": "security", "score": 0.9087305372234619, "event_breakdown": "- Location: Tel Aviv, Israel\n- Event: Israel announces the reopening of the Kerem Shalom crossing with southern Gaza for aid deliveries.\n- Details: The crossing was closed for four days due to Hamas rocket fire.\n- Related Events:\n  - Israeli troops took full control of the Palestinian side of the Rafah crossing with Egypt.\n  - Israel stated that victory in its war with Hamas in Gaza is impossible without taking control of Rafah.\n  - Six projectiles were fired at Kerem Shalom from the Rafah area, with no reported casualties.\n- Impact:\n  - The Israeli military informed international organizations about the reopening of Kerem Shalom for humanitarian aid."}, {"id": "f97c1764-e178-4b92-8866-835635196923", "title": "Israel reopens key crossing for aid to enter Gaza after rocket attack", "date": "2024-05-08 11:15", "url": "https://www.oxfordmail.co.uk/news/national/24305011.israel-reopens-key-crossing-aid-enter-gaza-rocket-attack/", "message": "The Kerem Shalom crossing between Gaza and Israel was closed over the weekend after a Hamas rocket attack killed four Israeli soldiers nearby, and on Tuesday, an Israeli tank brigade seized the nearby Rafah crossing between Gaza and Egypt, forcing its closure.\nThe Israeli foray did not appear to be the start of the full-scale invasion of the city of Rafah that Israel has repeatedly promised.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight, including two large blasts early on Wednesday.\nSmoke rises following an Israeli bombardment in the Gaza Strip as seen from southern Israel (Leo Correa/AP)The Israeli military reported six launches from Rafah towards the Kerem Shalom crossing on Tuesday.\nCOGAT, the Israeli military body in charge of Palestinian civilian affairs, said the Kerem Shalom crossing reopened early on Wednesday.", "location": "Rafah", "classification": "security", "score": 0.9758271859597445, "event_breakdown": "null"}, {"id": "74d34c9b-2cee-4706-a411-4dcc13cbf0f0", "title": "Ukraine hits oil depot in Russian - held city , local leader says", "date": "2024-05-08 01:00", "url": "https://www.swissinfo.ch/eng/ukraine-hits-oil-depot-in-russian-held-city%2c-local-leader-says/77117804", "message": "Ukraine hits oil depot in Russian-held city, local leader says2 minutes(Reuters) -Ukrainian forces attacked an oil storage depot and sparked a large fire, injuring five people late on Tuesday on the outskirts of the Russian-held city of Luhansk in eastern Ukraine, the region’s Russia-installed leader said.\n“Late at night, the enemy made a strike on the peaceful city of Luhansk, shelling an oil storage depot on the edge of the city,” Leonid Pasechnik, head of the Luhansk People’s Republic, wrote on Telegram.\nVideo posted on the sites of both Russian and Ukrainian war bloggers showed a large fire burning some distance from apartment buildings.\nUkrainian war bloggers reported the strike, one suggesting it was carried out by a missile.\nSeparatist fighters backed and financed by Russia seized control of large chunks of Luhansk and Donetsk regions in eastern Ukraine in 2014 after Moscow annexed Crimea.", "location": "Luhansk, Ukraine", "classification": "security", "score": 0.8021651279161186, "event_breakdown": "null"}, {"id": "14adb437-30a6-4db4-8a3d-6bf4a6fa42e4", "title": "Russia launches wide attack on Ukrainian energy facilties", "date": "2024-05-08 10:00", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/05/08/russia-launches-wide-attack-on-ukrainian-energy-facilties/", "message": "Russian forces unleashed a night-time barrage of more than 50 cruise missiles and explosive drones at Ukraine’s power grid, targeting a wide area in what President Volodymyr Zelensky called a “massive” attack.\nThe mass barrages also drain Ukrainian air defences of ammunition as Kyiv’s depleted forces await delivery of the latest batch of promised Western military support.\nFlames burn in a crater following a Russian missile attack in Zaporizhzhia, Ukraine (Andriy Andriyenko/AP)DTEK, Ukraine’s biggest private energy supplier, said the attack “seriously damaged” equipment at three of its thermal power plants.\nRussia launched 55 missiles and 21 Shahed drones overnight, the Ukrainian air force said.\nAir defences downed 39 of the missiles and 20 of the drones, Ukrainian air force commander Mykola Oleshchuk said.", "location": "Zaporizhzhia", "classification": "security", "score": 0.8580152651876465, "event_breakdown": "1. **Ukraine's Power Grid:** Russian forces launched a night-time barrage of over 50 cruise missiles and explosive drones targeting Ukraine's power grid in a wide area, described by President Volodymyr Zelensky as a \"massive\" attack.\n\n2. **Impact on Air Defenses:** The mass barrages depleted Ukrainian air defenses of ammunition while awaiting delivery of promised Western military support.\n\n3. **Damage to Thermal Power Plants:** DTEK, Ukraine's largest private energy supplier, reported that the attack caused serious damage to equipment at three of its thermal power plants.\n\n4. **Russian Offensive:** Russia launched 55 missiles and 21 Shahed drones overnight, as confirmed by the Ukrainian air force.\n\n5. **Downed Missiles and Drones:** Ukrainian air defenses successfully downed 39 of the missiles and 20 of the drones, according to Ukrainian air force commander Mykola Oleshchuk."}, {"id": "f7033e5a-6bc9-46dd-bde3-2354c17b4f5f", "title": "Global Terror Threat Has Skyrocketed Due to Oct . 7 Hamas Attack , Gaza War , Experts Warn", "date": "2024-05-08 00:45", "url": "https://www.algemeiner.com/2024/05/07/global-terror-threat-has-skyrocketed-due-oct-7-hamas-attack-gaza-war-experts-warn/", "message": "The threat of terrorist attacks in the West has escalated in the wake of the Hamas terror group’s Oct. 7 massacre across southern Israel and amid the ensuing war in Gaza, according to experts who spoke with The Algemeiner.\nTerrorist groups are using Israel’s war against Hamas to encourage more attacks against the US, Guillot argued.\nExperts also noted the threat posed by Iran, which the US government has consistently deemed the world’s foremost state sponsor of terrorism.\n“The ongoing and primary terrorist threat is from the Iranian regime and its proxies,” said Marshall Wittman, a spokesperson for the American Israel Public Affairs Committee (AIPAC).\nMost of the outrages occurred after Oct. 7, during the ensuing Israel-Hamas war in Gaza.", "location": "southern Israel", "classification": "security", "score": 0.5368598524327733, "event_breakdown": "1. The Hamas terror group's Oct. 7 massacre across southern Israel\n2. Escalation of threat of terrorist attacks in the West\n3. Terrorist groups using Israel's war against Hamas to encourage more attacks against the US\n4. The threat posed by Iran as the world's foremost state sponsor of terrorism\n5. Outrages occurring during the Israel-Hamas war in Gaza"}, {"id": "0df525c1-98fb-4257-ae80-31903387239d", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 04:30", "url": "https://www.wsoctv.com/news/world/has-israel-followed/FUV2DZ2HVNE6LMKDTP6GWV5K34/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time.", "location": "Null", "classification": "security", "score": 0.8271377155631021, "event_breakdown": "null"}, {"id": "15614441-89c0-45e1-bb8d-11993a4e1c39", "title": "Belarus Says It Checking Preparedness Of Its Tactical Nuclear Forces", "date": "2024-05-08 14:30", "url": "https://www.globalsecurity.org/wmd/library/news/belarus/2024/belarus-240507-rferl01.htm", "message": "Belarus Says It's Checking Preparedness Of Its Tactical Nuclear ForcesBy RFE/RL's Belarus Service May 07, 2024The Belarusian Defense Ministry said on May 7 that it had started to check the preparedness of it tactical nuclear forces, a day after Russia announced a similar move.\nFirst Deputy Defense Minister Viktar Hulevich said some Belarusian armed forces and aircraft will be redeployed to a reserve airfield during the exercises.\nBelarusian Defense Minister Viktar Khrenin said the checks for preparedness of the carriers of the tactical nuclear weapons started at the order of authoritarian ruler Alyaksandr Lukashenka.\nLukashenka supported Russia's ongoing unprovoked invasion of Ukraine launched in February 2022 and allowed Russian armed forces to use Belarusian territory, military infrastructure, and airspace during the invasion.\nA day before the announcement from Minsk, Russia's Defense Ministry announced drills involving tactical nuclear weapons for the first time since it launched its aggression against Ukraine more than two years ago.", "location": "Minsk", "classification": "security", "score": 0.4418085740150897, "event_breakdown": "null"}, {"id": "086f6b90-27ff-47a8-a1ca-c160ed7bf5e5", "title": "Power Grid Operator Comments On Consequences Of Russian Strikes", "date": "2024-05-08 10:00", "url": "https://menafn.com/1108187418/Power-Grid-Operator-Comments-On-Consequences-Of-Russian-Strikes", "message": "That's according to NEC Ukrenergo , Ukrinform reports.\nThe equipment was damaged at one of the Ukrenergo facilities in the central region,\" the statement says.\nAir defense forces59 Russian missiles, drones overnight Wed\"The enemy is not abandoning plans to deprive Ukrainians of electricity.\nAs reported, overnight Wednesday, May 8, Russian invaders launched a combined strike involving missiles of various types and attack drones.\nIn total, the enemy employed 76 means of air attack: 55 missiles and 21 one-way attack drones.", "location": "central region", "classification": "security", "score": 0.7662232925068834, "event_breakdown": "null"}, {"id": "d6d218c7-cdca-4430-8b04-5c10e9926667", "title": "Russians attack power facilities in six Ukrainian oblasts overnight", "date": "2024-05-08 09:15", "url": "https://www.yahoo.com/news/russians-attack-power-facilities-six-032644865.html", "message": "Stock photo: State Emergency Service of UkrainePower generation and transmission facilities in six of Ukraine’s oblasts were attacked by the Russians on the night of 7-8 May.\nThe oblasts of Poltava, Kirovohrad, Zaporizhzhia, Lviv, Ivano-Frankivsk and Vinnytsia came under Russian fire.\nBackground:On the night of 7-8 May, Russia launched a missile attack on Ukraine.\nAn air-raid warning was issued in all oblasts of the country.\nNo casualties or damage were reported in Kyiv after the Russian missile strike on the night of 7-8 May.", "location": "The main location where the main event takes place is in Ukraine.", "classification": "security", "score": 0.82896721731743, "event_breakdown": "null"}, {"id": "75c638eb-8bca-4857-930d-71e5bc8d503e", "title": "Six terrorists killed in separate KP operations : ISPR - Pakistan", "date": "2024-05-08 18:45", "url": "https://www.brecorder.com/news/40302451/six-terrorists-killed-in-separate-kp-operations-ispr", "message": "Security forces in Khyber Pakhtunkhwa (KP) killed six terrorists in two separate operations on Wednesday, the military’s media wing reported.\nAccording to Inter-Services Public Relations Pakistan (ISPR), an intelligence-based operation was conducted in Dera Ismail Khan in response to reports of terrorist activity.\nIn another encounter in North Waziristan, troops effectively engaged the terrorists’ location as a result of which one more terrorist was killed.\nThe ISPR statement said that the killed terrorists were actively involved in various other terrorist acts in the region that targeted innocent civilians as well as security forces.\nLast week, security forces killed six terrorists in an intelligence-based operation in North Waziristan District.", "location": "Dera Ismail Khan", "classification": "security", "score": 0.9670811906059907, "event_breakdown": "- Security forces in Khyber Pakhtunkhwa (KP) killed six terrorists in two separate operations on Wednesday.\n- An intelligence-based operation was conducted in Dera Ismail Khan in response to reports of terrorist activity.\n- Troops effectively engaged the terrorists’ location in North Waziristan, resulting in the killing of one more terrorist.\n- The killed terrorists were actively involved in various other terrorist acts in the region that targeted innocent civilians as well as security forces.\n- Last week, security forces killed six terrorists in an intelligence-based operation in North Waziristan District."}, {"id": "e7643ab7-5060-4f45-a997-788bd6895122", "title": "Soldier downs two Russian missiles using Igla man - portable air defence system – Ukrainian Air Force", "date": "2024-05-08 18:30", "url": "https://www.yahoo.com/news/soldier-downs-two-russian-missiles-150602750.html", "message": "A soldier from the Kherson Anti-Aircraft Missile Brigade destroyed a Russian cruise missile using an Igla man-portable surface-to-air missile system in the skies over the south of Ukraine on the morning of 8 May.\nAlong with the commander and fire adjuster, we used thermal imagers and a laser pointer, and soon had the Russian missile in our sights.\nDawn was breaking at the time, and it is harder to shoot down an enemy cruise missile at this time as it is less visible.\"\nThe target was destroyed – the Russian cruise missile exploded in mid-air.\nThis is the second cruise missile Oleksii has downed using an Igla since the beginning of the full-scale war.", "location": "south of Ukraine", "classification": "security", "score": 0.6596441567536183, "event_breakdown": "- A soldier from the Kherson Anti-Aircraft Missile Brigade destroyed a Russian cruise missile using an Igla man-portable surface-to-air missile system in the skies over the south of Ukraine on the morning of 8 May.\n- Along with the commander and fire adjuster, we used thermal imagers and a laser pointer, and soon had the Russian missile in our sights.\n- Dawn was breaking at the time, and it is harder to shoot down an enemy cruise missile at this time as it is less visible.\"\n- The target was destroyed – the Russian cruise missile exploded in mid-air.\n- This is the second cruise missile Oleksii has downed using an Igla since the beginning of the full-scale war."}, {"id": "eb15cdf3-c7d4-426f-a450-1d851eefe5af", "title": "Powerful Iraqi pro - Iran group says US troops must leave", "date": "2024-05-08 18:45", "url": "https://www.naharnet.com/stories/en/305053-powerful-iraqi-pro-iran-group-says-us-troops-must-leave", "message": "Iraq's powerful Kataeb Hezbollah has renewed its call for U.S. troops to withdraw from Iraq, months after the Iran-backed armed group suspended attacks against American forces.\nThe United States considers Kataeb Hezbollah a \"terrorist\" group and has repeatedly targeted its operations in recent strikes.\nBut a deadly drone attack in late January triggered retaliation, with US forces launching dozens of strikes against Tehran-backed groups, including Kataeb Hezbollah.\nTwo days later, Kataeb Hezbollah said it was suspending its attacks on U.S. forces.\nThe United States has some 2,500 troops in Iraq and 900 in Syria as part of the international coalition against the Islamic State (IS) group.", "location": "Iraq", "classification": "security", "score": 0.980315279722061, "event_breakdown": "null"}, {"id": "73b35abc-9a57-409f-9136-cd4c944e2534", "title": "Gray Zone Warfare Debuts in 1st on the Steam Charts", "date": "2024-05-08 05:30", "url": "https://www.vgchartz.com/article/460905/gray-zone-warfare-debuts-in-1st-on-the-steam-charts/", "message": "Gray Zone Warfare Debuts in 1st on the Steam Charts - Sales/ 792 Viewsby, posted 16 hours agoGray Zone Warfare has debuted in first place on the Steam Weekly Top Sellers chart (excluding revenue generated by free games) for Week 19, 2024, which ended May 7, 2024.\nTotal War: WARHAMMER III shot up the charts to third place, following the release of DLC packs.\nManor Lords in its second week dropped one spot to second place, while Steam Deck and Helldivers 2 dropped two spots to fourth and fifth places, respectively.\nEA Sports FC 24 re-entered the top 10 in sixth place and Fallout 76 dropped five spots to ninth place.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel.", "location": "Steam Weekly Top Sellers chart", "classification": "security", "score": 0.6612074321112468, "event_breakdown": "- Gray Zone Warfare debuts in 1st place on the Steam Weekly Top Sellers chart\n- Total War: WARHAMMER III rises to third place on the charts\n- Manor Lords drops to second place in its second week\n- Steam Deck and Helldivers 2 drop to fourth and fifth places, respectively\n- EA Sports FC 24 re-enters the top 10 in sixth place\n- Fallout 76 drops five spots to ninth place"}, {"id": "bb83daca-5177-4bd5-a8e8-2131c25049fe", "title": "US Arms Delay to Israel Brings Anxiety and Talk of Self - Reliance", "date": "2024-05-08 17:15", "url": "https://www.bnnbloomberg.ca/us-arms-delay-to-israel-brings-anxiety-and-talk-of-self-reliance-1.2070484", "message": "(Bloomberg) -- As Israel’s war on Hamas in Gaza has grown increasingly controversial, arms suppliers including Italy, Spain and Canada have all halted sales.\nAbout 70% of Israel’s military imports come from the US, which has made more than 200 deliveries since the conflict started in October.\nThis was dubbed “the boutique industries policy” and helped Israel become a world leader in defense innovation.\nAt the end of 2023, pending deliveries of major arms to Israel included 61 combat aircraft from the US and four submarines from Germany.\nLandau named Elbit Systems Ltd. – which acquired the former Israeli Military Industries — as the most appropriate company to produce aerial bombs.", "location": "The main location where the main event takes place is **Gaza**.", "classification": "security", "score": 0.6112285060762658, "event_breakdown": "null"}, {"id": "ca5baed3-ec6e-47c8-9012-fc7bf56123ce", "title": "U . S . F - 22 Raptors Stationed at Kadena Amid Rising Tensions With China", "date": "2024-05-08 18:00", "url": "https://www.popularmechanics.com/military/aviation/a60672305/us-air-force-f22-raptors-deployed-kadena-china-proximity/", "message": "The U.S. Air Force recently deployed Virginia-based F-22 Raptors to Kadena Air Base.\nThe U.S. Air Force has redeployed F-22 Raptor jets more than 7,000 miles from home to a base literally on China’s doorstep.\nThe F-22s will be within range of their Chinese Air Force counterparts: the J-20 “Mighty Dragon” stealth fighter.\nThe trip from Joint Base Langley-Eustis, Virginia to Kadena Air Base on the island of Okinawa is a distance of 7,766 miles, nearly a third of the way around the world.\nIn 2023, the Air Force began withdrawing the two F-15C/D squadrons on the island.", "location": "Kadena Air Base", "classification": "security", "score": 0.4776813610441091, "event_breakdown": "- The U.S. Air Force recently deployed Virginia-based F-22 Raptors to Kadena Air Base.\n- The U.S. Air Force has redeployed F-22 Raptor jets more than 7,000 miles from home to a base literally on China’s doorstep.\n- The F-22s will be within range of their Chinese Air Force counterparts: the J-20 “Mighty Dragon” stealth fighter.\n- The trip from Joint Base Langley-Eustis, Virginia to Kadena Air Base on the island of Okinawa is a distance of 7,766 miles, nearly a third of the way around the world.\n- In 2023, the Air Force began withdrawing the two F-15C/D squadrons on the island."}, {"id": "97f0950b-73ef-4759-ba63-63b480cf10f6", "title": "Ukraine orders nationwide electricity rationing after Russian airstrikes", "date": "2024-05-08 18:15", "url": "https://www.stripes.com/theaters/europe/2024-05-08/ukraine-rations-electricity-russia-airstrikes-13793548.html", "message": "Rescuers work at a damaged building after a Russian missile attack in Kyiv region, Ukraine, Wednesday, May 8, 2024.\nThe statement cited a “shortage of electricity in the power system.”The Russian strikes, which lasted more than three hours overnight, targeted energy infrastructure in six Ukrainian regions.\nUkraine’s power plants, electrical grid and other infrastructure have become particularly vulnerable as Western countries have struggled to supply Kyiv with sufficient air defense systems and ammunition.\nSixteen missiles, including two ballistic missiles, and one drone pierced the shield, the Ukrainian air force said on Telegram.\nMissiles damaged three thermal power stations belonging to the country’s largest power supplier, DTEK, the company said in social media posts.", "location": "Kyiv", "classification": "security", "score": 0.4759438724508755, "event_breakdown": "null"}, {"id": "180ec115-b0c6-483c-921a-290e5f985ee8", "title": "Live updates : Israel - Hamas war , Rafah crossing , bombings , Gaza ceasefire deal", "date": "2024-05-08 04:30", "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-05-08-24/", "message": "Satellite images taken May 6, left, and May 7, right, show damage in Rafah, Gaza.\nPlanet Labs, PBCThe ongoing operation of the Israel Defense Forces (IDF) in Rafah has expanded from airstrikes to ground operations, which includes bulldozing, new satellite imagery obtained by CNN from Planet Labs shows.\nThe images show that IDF forces are over a mile outside of the Rafah crossing gate.\nThese ground operations were precluded by a number of military strikes in Rafah, which CNN has previously reported, and they appear to be ongoing as well.\nWhen the IDF moved into northern Gaza, they utilized airstrikes shortly before ground forces moved in.", "location": "Rafah, Gaza", "classification": "security", "score": 0.8189659844991202, "event_breakdown": "- IDF's ongoing operation expands from airstrikes to ground operations in Rafah, Gaza.\n- Satellite images show IDF forces over a mile outside Rafah crossing gate.\n- Ground operations follow preceding military strikes in Rafah.\n- IDF utilizes airstrikes before ground forces move into northern Gaza."}, {"id": "9048811a-d490-4943-96bc-622ce698d2f0", "title": "US pauses arms shipment to Israel over Rafah invasion plans", "date": "2024-05-08 19:15", "url": "https://www.ocregister.com/2024/05/08/us-pauses-arms-shipment-to-israel-over-rafah-invasion-plans/", "message": "Washington has not made a final decision on whether to proceed with the shipment, according to the official.\nBefore that, Ronald Reagan halted a shipment of cluster-type artillery shells after Israel’s invasion of Lebanon in 1982.\nAnd Richard Nixon held off providing arms to Israel for the first week of the 1973 Yom Kippur war.\nHamas, designated a terrorist organization by the U.S., killed 1,200 people and abducted roughly 250 when its fighters stormed into southern Israel from Gaza.\nCease-fire talks between Israel and Hamas continue but remain stuck over Hamas’s demand that any pause in fighting is effectively permanent.", "location": "Gaza", "classification": "security", "score": 0.8036545679982441, "event_breakdown": "Cease-fire talks between Israel and Hamas continue but remain stuck over Hamas’s demand that any pause in fighting is effectively permanent."}, {"id": "40df2378-39ba-4678-8ff6-eefa9b5875ed", "title": "WATCH : IDF storms Rafah , destroys over 100 terror targets", "date": "2024-05-08 19:15", "url": "https://www.jpost.com/breaking-news/article-800458", "message": "The IDF continued its limited Rafah operation on Wednesday while holding back from a larger operation pending the ongoing hostage negotiations with Hamas.\nMeanwhile, early Wednesday, the IDF and COGAT announced in a joint statement that the Kerem Shalom crossing into Gaza had reopened.\nRockets fired at Kerem Shalom crossingLate Wednesday, Hamas fired rockets at the crossing.\nMultiple defense sources had not responded to press time regarding whether Kerem Shalom was still open or had reclosed due to the attack.\nThere was also an incident in which Palestinian workers, presumably aid workers, were on their way to the Kerem Shalom crossing and were shot, with multiple workers wounded.", "location": "Kerem Shalom crossing", "classification": "security", "score": 0.7474413403889952, "event_breakdown": "null"}, {"id": "ce486a8a-30c1-4049-b306-ffe250c21312", "title": "Xi begins Serbia visit on the 25th anniversary of NATO bombing of the Chinese Embassy", "date": "2024-05-08 02:15", "url": "https://www.wfmz.com/news/ap/ap-business/xi-begins-serbia-visit-on-the-25th-anniversary-of-natos-bombing-of-the-chinese-embassy/article_6d6312a5-0006-542e-b7d4-34404d8cfadd.html", "message": "BELGRADE, Serbia (AP) — Chinese leader Xi Jinping's visit to European ally Serbia on Tuesday falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during NATO's air war over Kosovo.\nU.S. jets dropped five bombs on the Chinese Embassy compound in the Serbian capital on May 7, 1999, setting it ablaze and killing three Chinese nationals.\n“The Chinese people value peace but will never allow historical tragedies to happen again,\" Xi added.\nThe U.S. at the time apologized and said the embassy bombing was a mistake that happened due to faulty intelligence.\nHe is expected to visit the site of the former embassy and pay his respects to the bombing victims.", "location": "BELGRADE, Serbia", "classification": "security", "score": 0.47370294163194304, "event_breakdown": "null"}, {"id": "eb8e7eb1-55d8-4c35-9f40-674d1627852e", "title": "Xi begins Serbia visit on the 25th anniversary of NATO bombing of the Chinese Embassy", "date": "2024-05-08 03:00", "url": "https://gazette.com/ap/international/xi-begins-serbia-visit-on-the-25th-anniversary-of-natos-bombing-of-the-chinese-embassy/article_cdbb3383-37ba-515f-91ce-a9970b5a7062.html", "message": "Xi begins Serbia visit on the 25th anniversary of NATO's bombing of the Chinese EmbassyChinese leader Xi Jinping’s visit to European ally Serbia falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy during NATO’s air war over Kosovo", "location": "Belgrade", "classification": "security", "score": 0.7995867553542627, "event_breakdown": "Xi Jinping begins visit to Serbia on the 25th anniversary of NATO's bombing of the Chinese Embassy."}, {"id": "f5202645-6881-4793-bab5-c7b79239f901", "title": "Burnt houses , broken trolleybuses , giant craters Photos & video of Russia mass attack on Ukraine on May 8", "date": "2024-05-08 12:45", "url": "https://www.yahoo.com/news/burnt-houses-broken-trolleybuses-giant-115500911.html", "message": "Initial reports suggest the following:Read also: Russia attacks six Ukrainian oblasts in effort to cripple Ukraine's electricity infrastructureNV collected photos and video of the consequences of Russia's latest mass attack.\nKyiv OblastTwo people were injured in the village of Krasylivka near Brovary and 13 private buildings were destroyed or damaged by enemy missile debris.\nДСНСREUTERS/Thomas PeterREUTERS/Thomas PeterZaporizhzhyaRussia struck critical and civil infrastructure facilities, a garage, a city park, and the city's electric transport.\nREUTERS/Gleb GaranichReuters/ Gleb GaranichWe’re bringing the voice of Ukraine to the world.\nRead the original article on The New Voice of Ukraine", "location": "Kyiv Oblast", "classification": "security", "score": 0.8468990142276634, "event_breakdown": "null"}, {"id": "a8434e83-10ca-41b8-977e-a54d331490e4", "title": "Security forces kill six terrorists in two different operations in KP", "date": "2024-05-08 19:15", "url": "https://thefrontierpost.com/security-forces-kill-six-terrorists-in-two-different-operations-in-kp/", "message": "ReportPESHAWAR: Six terrorists were killed in two different operations in Khyber Pakhtunkhwa today.\nAccording to ISPR, the security forced conducted an intelligence based operation in Dera Ismail Khan District during which five terrorists were neutralized.\nIn another fire exchange in North Waziristan District, own troops effectively engaged terrorists’ location as a result of which another Terrorist Inam Ullah was killed.\nWeapons, ammunition and explosives were also recovered from the killed terrorists, who remained actively involved in numerous terrorist activities against the security forces as well as innocent civilians.\nSanitization operation is being carried out to eliminate any other terrorist found in the area as the security forces are determined to wipe out the menace of terrorism from the country.", "location": "Dera Ismail Khan District", "classification": "security", "score": 0.984929422428424, "event_breakdown": "- Six terrorists killed in two different operations in Khyber Pakhtunkhwa.\n- Five terrorists neutralized in an intelligence-based operation in Dera Ismail Khan District.\n- Terrorist Inam Ullah killed in a firefight in North Waziristan District.\n- Weapons, ammunition, and explosives recovered from the killed terrorists.\n- Sanitization operation underway to eliminate any other terrorists in the area."}, {"id": "22434d95-6f76-4a9e-b700-89db70c75ac5", "title": "Despite setbacks , US sees Israel - Hamas cease - fire within reach", "date": "2024-05-08 01:45", "url": "https://www.voanews.com/a/despite-setbacks-us-sees-israel-hamas-cease-fire-within-reach/7602347.html", "message": "The U.S. expressed optimism that a cease-fire agreement in Gaza is within reach, a day after Prime Minister Benjamin Netanyahu rejected a version of the deal that Hamas said it has accepted.\nCIA Director William Burns is in Cairo, Kirby said, acting as an interlocutor for the United States in negotiations involving Israel, Hamas, Egypt and Qatar.\nThe talks are aimed at achieving a temporary cease-fire accompanied by the release of some Israeli hostages held by Hamas in exchange for Palestinian prisoners held by Israel.\nIsrael said the plan did not meet its demands to eliminate Hamas' role from post-war Gaza.\nIn response, Hamas on Tuesday warned Israel there would be no cease-fire if military action continues in Rafah.", "location": "Rafah", "classification": "security", "score": 0.514972371182177, "event_breakdown": "null"}, {"id": "716c99eb-d5be-46a4-868b-27418664cfad", "title": "Terrorist Arrested for Attaching IED to Palestinian Flag in Attack", "date": "2024-05-08 15:30", "url": "https://www.algemeiner.com/2024/05/08/terrorist-arrested-attaching-ied-palestinian-flag-attack/", "message": "i24 News — The Israel Defense Forces (IDF) and Shin Bet security agency (ISA) forces have made a breakthrough in the case of a bomb attack last month involving an improvised explosive device (IED) attached to a Palestinian Authority (PA) flag in the Binyamin region of the West Bank.\nMuhammad Atallah Abu Alia, 22, was apprehended earlier this week on suspicion of his involvement in the attack, which left a 25-year-old IDF reservist lightly wounded when the device detonated while he attempted to remove the flag near the town of Kochav Hashachar.\nAccording to reports, during interrogation by the ISA, Alia confessed to his participation in constructing the explosive device and carrying out the attack.\nAdditionally, materials used in the creation of the IED were seized during his arrest.\nI was injured by shrapnel on my hands and that was it.", "location": "Kochav Hashachar", "classification": "security", "score": 0.997108455148432, "event_breakdown": "1. IDF and Shin Bet security agency make breakthrough in bomb attack case involving an improvised explosive device (IED) attached to a Palestinian Authority (PA) flag in the Binyamin region of the West Bank.\n2. Muhammad Atallah Abu Alia, 22, apprehended on suspicion of involvement in the attack near the town of Kochav Hashachar.\n3. Alia confesses to his participation in constructing the explosive device and carrying out the attack during interrogation by the ISA.\n4. Materials used in the creation of the IED seized during Alia's arrest.\n5. An IDF reservist lightly wounded when the device detonated while attempting to remove the flag, sustaining injuries to his hands from shrapnel."}, {"id": "e1bf06e5-9a72-425f-9e99-6fe3b264f089", "title": "Xi begins Serbia visit on the 25th anniversary of NATO bombing of the Chinese Embassy", "date": "2024-05-08 03:00", "url": "http://www.koreatimes.co.kr/www/world/2024/05/501_374205.html", "message": "Chinese leader Xi Jinping's visit to European ally Serbia on Tuesday falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during NATO's air war over Kosovo.\nU.S. jets dropped five bombs on the Chinese Embassy compound in the Serbian capital on May 7, 1999, setting it ablaze and killing three Chinese nationals.\n“The Chinese people value peace but will never allow historical tragedies to happen again,\" Xi added.\nThe U.S. at the time apologized and said the embassy bombing was a mistake that happened due to faulty intelligence.\nHe is expected to visit the site of the former embassy and pay his respects to the bombing victims.", "location": "Belgrade", "classification": "security", "score": 0.47370294163194304, "event_breakdown": "- Chinese leader Xi Jinping's visit to Serbia coincides with the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during NATO's air war over Kosovo.\n- U.S. jets dropped five bombs on the Chinese Embassy compound in the Serbian capital on May 7, 1999, resulting in its destruction and the death of three Chinese nationals.\n- Xi Jinping emphasized that while the Chinese people value peace, they will not tolerate historical tragedies like the embassy bombing to recur.\n- The U.S. apologized for the embassy bombing, attributing it to faulty intelligence at the time.\n- Xi Jinping is expected to visit the former embassy site and pay respects to the bombing victims during his visit to Serbia."}, {"id": "d480f617-9925-45d6-bfa9-f5eb1f19eaee", "title": "Israel seizes Gaza vital Rafah crossing , but the US says it isnt the full invasion many fear", "date": "2024-05-08 15:15", "url": "https://www.wafb.com/2024/05/07/israeli-forces-seize-rafah-border-crossing-gaza-putting-cease-fire-talks-knifes-edge/", "message": "They have been closed for at least two days, though the smaller Erez crossing between Israel and northern Gaza remains open.\nKirby said Israel described it as “an operation of limited scale and duration” aimed at cutting off Hamas arms smuggling.\nBiden warned Netanyahu again Monday against launching an invasion of the city after Israel ordered 100,000 Palestinians to evacuate parts of Rafah.\nIsrael’s 401st Brigade took “operational control” of the Gaza side of the Rafah crossing early Tuesday, the military said.\nIsraeli authorities denied the U.N. humanitarian affairs office access to the Rafah crossing Tuesday, said its spokesman, Jens Laerke.", "location": "Rafah", "classification": "security", "score": 0.42770622761181093, "event_breakdown": "null"}, {"id": "67bcb933-0179-4139-8688-b71daf5eb0b2", "title": "Opinion : Terror attack on IAF vehicle in Poonch demonstrates security threats", "date": "2024-05-08 11:15", "url": "https://www.siasat.com/opinion-terror-attack-on-iaf-vehicle-in-poonch-demonstrates-security-threats-3022548/", "message": "There was yet another terror attack on the security forces, this time on Indian Air Force vehicles in border district of Poonch on Saturday evening, in which one IAF personnel was killed and four others wounded.\nBut it has demonstrated that terrorism is still breathing in crucial border belt where the targets are hard – army and other wings of security forces.\nIt should prompt the government to have a holistic view of the security situation in the border belt in the overall context of security arrangements for the Lok Sabha polls and beyond.\nThere is yet another reason, the gaps that are widening between the locals and security forces, including police which make the locals to help the men from across in setting up their bases.\nThey were petrified by the acts of the security forces, and also angry that how could the villagers be picked up randomly, and then tortured to death.", "location": "Poonch", "classification": "security", "score": 0.919517746775168, "event_breakdown": "- Terror attack on Indian Air Force vehicles in the border district of Poonch results in one IAF personnel killed and four others wounded.\n- Terrorism persists in the crucial border belt, targeting hard-to-reach areas such as army and security force installations.\n- Government urged to take a holistic view of the security situation in the border belt, especially in light of upcoming Lok Sabha polls.\n- Widening gaps between locals and security forces, including police, potentially facilitating support for militants from across the border.\n- Villagers express fear and anger over alleged random arrests and torture by security forces."}, {"id": "85f1a915-71f1-41db-b7eb-57779e792fd1", "title": "Despite setbacks , US sees Israel - Hamas cease - fire within reach", "date": "2024-05-08 14:30", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240507-voa02.htm", "message": "Despite setbacks, US sees Israel-Hamas cease-fire within reachBy Patsy Widakuswara May 07, 2024The U.S. expressed optimism that a cease-fire agreement in Gaza is within reach, a day after Prime Minister Benjamin Netanyahu rejected a version of the deal that Hamas said it has accepted.\nCIA Director William Burns is in Cairo, Kirby said, acting as an interlocutor for the United States in negotiations involving Israel, Hamas, Egypt and Qatar.\nThe talks are aimed at achieving a temporary cease-fire accompanied by the release of some Israeli hostages held by Hamas in exchange for Palestinian prisoners held by Israel.\nIsrael said the plan did not meet its demands to eliminate Hamas' role from post-war Gaza.\nIn response, Hamas on Tuesday warned Israel there would be no cease-fire if military action continues in Rafah.", "location": "Rafah", "classification": "security", "score": 0.5275596236512948, "event_breakdown": "null"}, {"id": "4b6f122a-d011-4b80-af6a-fc4268f807aa", "title": "Israel reopens key crossing for aid to enter Gaza that was closed over weekend rocket attack – Winnipeg Free Press", "date": "2024-05-08 07:15", "url": "https://www.winnipegfreepress.com/world/2024/05/08/israel-reopens-key-crossing-for-aid-to-enter-gaza-that-was-closed-over-weekend-rocket-attack", "message": "The Kerem Shalom crossing between Gaza and Israel was closed over the weekend after a Hamas rocket attack killed four Israeli soldiers nearby, and on Tuesday, an Israeli tank brigade seized the nearby Rafah crossing between Gaza and Egypt, forcing its closure.\nThe Rafah crossing has been a vital conduit for humanitarian aid since the start of the war and is the only place where people can enter and exit.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight, including two large blasts early Wednesday.\nAn Israeli military official said that Hamas had fired unidentified projectiles at Kerem Shalom on Wednesday, confirming an earlier claim from the militant group.\nThe U.S. has historically provided Israel with enormous amounts of military aid, which has only accelerated since the start of the war.", "location": "Rafah crossing", "classification": "security", "score": 0.9658169414346339, "event_breakdown": "null"}, {"id": "1116cf6b-1802-4c1e-bf23-b6899fa92112", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 04:30", "url": "https://www.cravenherald.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "null"}, {"id": "271abff9-5ed2-472b-bd18-1c201c69fe97", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:00", "url": "https://www.dunmowbroadcast.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "null"}, {"id": "6f42dfc4-3e9e-4690-b928-f34f5946311f", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:00", "url": "https://www.countytimes.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "null"}, {"id": "7367436a-41f0-4e02-87e5-e27ffea18c1e", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:00", "url": "https://www.braintreeandwithamtimes.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "null"}, {"id": "8e2cf0ec-66bf-4cf7-b024-a840b49d067c", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 06:15", "url": "https://www.harrowtimes.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "null"}, {"id": "65e27617-62c4-4a51-9149-551a21d319cb", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 06:45", "url": "https://www.runcornandwidnesworld.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "null"}, {"id": "191f731a-5bb5-4639-a46f-2f4700ac9a3c", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 04:45", "url": "https://www.kilburntimes.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "IP访问频率过高,请稍后再试", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "null"}, {"id": "bfadc66a-bada-4e23-b4c0-90095f354cf4", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 04:45", "url": "https://www.greenocktelegraph.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "**Events from the provided text**:\n\n1. **Beirut, Lebanon**:\n   - Osama Hamdan, a Hamas official based in Beirut, stated that Hamas would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\n\n2. **Gaza-Egypt Border (Rafah Crossing)**:\n   - The White House commented that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city.\n   - Footage released by the Israeli military showed a tank entering the Rafah crossing. The footage showed Israeli flags flying from tanks that seized the area.\n   - The Israeli military claimed it seized the crossing after receiving intelligence that it was “being used for terrorist purposes.”\n\n3. **Rafah, Gaza Strip**:\n   - Palestinians observed the destruction following an Israeli strike on a residential building in Rafah, Gaza Strip.\n   - An Egyptian Foreign Ministry spokesperson declined to comment immediately on the Israeli seizure of the Rafah crossing."}, {"id": "280b0d25-2a32-4182-8101-523196b7a12e", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 07:00", "url": "https://www.andoveradvertiser.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "null"}, {"id": "2378956a-080f-4247-b2d9-ecccdbe0b5fd", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:15", "url": "https://www.darlingtonandstocktontimes.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "null"}, {"id": "a29359eb-c3c1-40bf-a328-5c7ef3587e93", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:15", "url": "https://www.heraldseries.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "null"}, {"id": "79325934-6d63-489a-8120-e16f5d5d05da", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:15", "url": "https://www.burnhamandhighbridgeweeklynews.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "null"}, {"id": "65fd79b3-82a4-4146-89b9-460647f612f4", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:15", "url": "https://www.stalbansreview.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "null"}, {"id": "ee7c6716-08ca-46ea-92b5-7703ca1ff0db", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:15", "url": "https://www.thecomet.net/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure.", "location": "Rafah", "classification": "security", "score": 0.8807881214106118, "event_breakdown": "null"}, {"id": "dc30c526-47a4-4da9-9f47-ea7277fe140d", "title": "Troops foil kidnap attempts , neutralise terrorists in Kaduna , Borno", "date": "2024-05-08 12:00", "url": "https://dailypost.ng/2024/05/08/troops-foil-kidnap-attempts-neutralise-terrorists-in-kaduna-borno/", "message": "The Nigerian Army said its troops, in their commitment, responded to a distress calls following bandits’ attack in Agunu Dutse Village in Kachia Local Government Area of Kaduna StateIt said during a search and rescue operation, the troops rescued six hostages unhurt, including two women and four children.\nIn a statement on its Facebook page, the Nigerian Army noted that the rescued victims, have been reunited with their families.\n“Troops on fighting patrol were alerted to the presence of terrorists lurking in Amale village in Kaduna North Local Government Area.\nThe troops, in collaboration with local vigilantes, engaged the terrorists, compelling them to abandon their firearms.\n“Similarly, troops of the Nigerian Army deployed for Counter-terrorism operations in the North East and North West on Tuesday, May 7, 2024 in a display of valour successfully foiled multiple kidnap attempts, neutralizing the terrorists’ threats and reuniting victims with their families.", "location": "Agunu Dutse Village", "classification": "security", "score": 0.9242733053998055, "event_breakdown": "1. Nigerian Army responds to distress calls following bandits' attack in Agunu Dutse Village, Kachia Local Government Area, Kaduna State.\n2. During a search and rescue operation, troops rescue six hostages, including two women and four children, unhurt.\n3. Rescued victims reunited with their families, as stated by the Nigerian Army on its Facebook page.\n4. Troops on fighting patrol alerted to presence of terrorists in Amale village, Kaduna North Local Government Area.\n5. Troops, in collaboration with local vigilantes, engage terrorists, compelling them to abandon their firearms.\n6. Troops deployed for Counter-terrorism operations in North East and North West successfully foil multiple kidnap attempts on Tuesday, May 7, 2024.\n7. Nigerian Army neutralizes terrorists' threats and reunites victims with their families."}, {"id": "c2aeffb7-7c3f-44d1-b2f4-5c940febfcf4", "title": "May 6 :  Axis of Resistance  operations against Israeli occupation", "date": "2024-05-08 14:30", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240507-presstv08.htm", "message": "The major operations carried out by the Palestinian and regional resistance groups on Monday, May 6, are as follows:Al-Qassam Brigades' operations on May 6:Bombed a gathering of Israeli forces positioned in the \"Netzarim\" axis with 107mm short-range rockets.\nTargeted a gathering of Israeli forces positioned on the \"Netzarim\" axis with the Rajoom rocket system.\nTargeted Israeli soldiers positioned on the \"Netzarim\" axis with 107-type rockets in a joint operation with the Al-Quds Brigades.\nBombed a gathering of Israeli soldiers and their military vehicles with several mortar shells on the \"Netzarim\" axis, south of Gaza City.\nMartyr Abu Ali Mustafa Brigades' operations on May 6:Bombed a gathering of Israeli forces in the \"Netzarim\" axis with rocket shells.", "location": "Netzarim", "classification": "security", "score": 0.9957862848079451, "event_breakdown": "1. Al-Qassam Brigades bombed a gathering of Israeli forces positioned in the \"Netzarim\" axis with 107mm short-range rockets.\n2. Al-Qassam Brigades targeted a gathering of Israeli forces positioned on the \"Netzarim\" axis with the Rajoom rocket system.\n3. Al-Qassam Brigades, in a joint operation with the Al-Quds Brigades, targeted Israeli soldiers positioned on the \"Netzarim\" axis with 107-type rockets.\n4. Al-Qassam Brigades bombed a gathering of Israeli soldiers and their military vehicles with several mortar shells on the \"Netzarim\" axis, south of Gaza City.\n5. Martyr Abu Ali Mustafa Brigades bombed a gathering of Israeli forces in the \"Netzarim\" axis with rocket shells."}]