[{"id": "b89a7b28-7181-46ff-b868-6d0e65cca893", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30853/", "date": "2024-07-22 09:05", "message": "The Palestinians report one dead and several wounded in an Israeli drone attack on the journalists' tent at the Shuhada Al-Aqsa hospital in Deir al-Balah, in the center of the Gaza Strip.\n\nIn the last seconds of the video (00:13) you can notice a journalist - the Gazan clown Saleh al-Jafarawi (FAFO) walking on one leg out of the tent that was attacked.", "location": "GAZA", "classification": "security", "score": 0.9880022998907925, "event_breakdown": "A drone attack on a tent of journalists at the Shuhada Al-Aqsa hospital in Deir al-Balah, the Gaza Strip, was reported by the Palestinians as an event of security that took place and can be placed on a map."}, {"id": "cd8dd018-2364-4908-9f92-7a0ec0a06b01", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30849/", "date": "2024-07-22 08:23", "message": "Gazans are evacuating from eastern Khan Yunis following the instruction of the IDF.", "location": "GAZA", "classification": "security", "score": 0.7844831598943395, "event_breakdown": "Gaza, Gaza Strip - Current events:\n- Gazans are evacuating from eastern Khan Yunis following the instruction of the IDF."}, {"id": "4af0f85e-a1d3-4fcc-9b8f-c6f94ce6dcf2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30844/", "date": "2024-07-22 08:22", "message": "Palestinian channels now report more than 20 deaths as a result of IDF attacks this morning in eastern Khan Yunis, with an emphasis on Bani Suheila.", "location": "GAZA", "classification": "security", "score": 0.928586610542571, "event_breakdown": "IDF attacks in eastern Khan Yunis and Bani Suheila, Gaza."}, {"id": "64efad28-5bac-4926-8541-42aa43864a8a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30843/", "date": "2024-07-22 07:52", "message": "The standard tweet of supporters of the Assad regime when a Western leader goes home...", "location": "SYRIA", "classification": "security", "score": 0.855687369316748, "event_breakdown": "{\n  \"text\": \"The standard tweet of supporters of the Assad regime when a Western leader goes home...\"\n}"}, {"id": "a670c18f-7497-4f7c-9af5-584fa92d845b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30841/", "date": "2024-07-22 07:51", "message": "Following the IDF spokesperson's call to evacuate eastern Khan Yunis, leading Palestinian channels are reporting 16 dead and a similar number of wounded Palestinians as a result of IDF attacks in the last few hours in the area.", "location": "GAZA", "classification": "security", "score": 0.9568774943560605, "event_breakdown": "16 dead and a similar number of wounded Palestinians in IDF attacks in eastern Khan Yunis."}, {"id": "2fef9ad7-3740-4b9d-bc8b-92fd1946c7cd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30840/", "date": "2024-07-22 06:18", "message": "France: Lebanese journalist Christina Assi, who was hit by IDF fire in Ayta ash-Sha'ab in southern Lebanon at the beginning of the war, is carrying the Olympic torch ahead of the opening of the Olympics in Paris.", "location": "PARIS", "classification": "security", "score": 0.9482053802478358, "event_breakdown": "IDF fire in Ayta ash-Sha'ab, southern Lebanon"}, {"id": "37a588f4-186f-4c88-9e5f-f8ee20b2f07c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30836/", "date": "2024-07-22 06:14", "message": "Residents of eastern Khan Yunis begin to evacuate to the west.\nHamas-affiliated channels do not publish the IDF's evacuation instructions and photos of the evacuees in order not to aid Israel's evacuation efforts.\n\nRecalls the active opposition of Hamas to the evacuation of the north of the Gaza Strip that the IDF called for in recent weeks.", "location": "Khan Yunis, Gaza Strip", "classification": "security", "score": 0.8703113380114245, "event_breakdown": "Residents of eastern Khan Yunis begin to evacuate to the west, amidst warnings from the IDF of the possibility of escalation in Gaza."}, {"id": "0a089015-0fa5-481b-ad97-e3f6c7acb855", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30833/", "date": "2024-07-22 06:12", "message": "Palestinian channels report on IDF artillery fire towards eastern Khan Yunis (apparently to speed up the evacuation -AA).", "location": "GAZA", "classification": "security", "score": 0.9443210943443063, "event_breakdown": "IDF artillery fire targeting eastern Khan Yunis."}, {"id": "c08a62b3-4a6e-48ad-94a7-2031c6a68cbf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30830/", "date": "2024-07-22 06:12", "message": "Evacuation of East Khan Yunis and the reduction of the humanitarian area\n\nThe IDF spokesperson informed this morning the residents of East Khan Yunis, in the southern Gaza Strip, that they must evacuate the neighborhoods of eastern Khan Yunis and move immediately and temporarily towards the humanitarian zone, within its new borders in western Khan Yunis (the Mawasi area).\n\nThe IDF spokesperson points out that the humanitarian zone has been reduced as can be seen on the map and this is based on intelligence information that Hamas has placed terrorist infrastructures within the humanitarian zone.\nThe purpose of the evacuation, according to the IDF spokesman, is to remove civilians from combat zones.", "location": "Gaza Strip.", "classification": "security", "score": 0.8994954054935893, "event_breakdown": "IDF intructing evacuation of some civilians from the Gaza Strip for Israel's security purposes."}, {"id": "cb497583-3dab-4906-8f8d-a161897f93dd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30873/", "date": "2024-07-22 14:03", "message": "Lebanese media: at least one dead and several injured in the attack on the structure in Chihine 👆in southern Lebanon earlier today.", "location": "CHIhine", "classification": "security", "score": 0.9307456774540316, "event_breakdown": "Lebanese media: at least one dead and several injured in the attack on the structure in Chihine in southern Lebanon earlier today."}, {"id": "22d52bde-14d7-4cec-a637-d15aac9421cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30872/", "date": "2024-07-22 13:51", "message": "The military wing of Hamas publishes a video of the shooting attack carried out by its men last week👆 in the Tulkarm area, an attack in which three Israelis were injured.", "location": "TUlkarm.", "classification": "security", "score": 0.9794595716774867, "event_breakdown": "The military wing of Hamas publishes a video of the shooting attack carried out by its men last week in the Tulkarm area, an attack in which three Israelis were injured.\nThe military wing of Hamas publishes a video of the shooting attack carried out by its men last week in the Tulkarm area, an attack in which three Israelis were injured."}, {"id": "a56c1571-2920-4cb8-80b7-4a235ba23155", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30868/", "date": "2024-07-22 12:46", "message": "The Palestinians report that the IDF attacked the Ein Jalot 9 building in Nuseirat in the center of the Gaza Strip after an evacuation alert.\n\n(Buildings 7 and 10 have already been attacked in recent days)", "location": "Gaza Strip", "classification": "security", "score": 0.9723868628349834, "event_breakdown": "IDF attacks Ein Jalot 9 building in Nuseirat, Gaza Strip"}, {"id": "3b2a6ac4-ccd7-4357-9199-fe49575c00d5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30867/", "date": "2024-07-22 12:41", "message": "Lebanese media reports on casualties in an attack carried out by an Israeli UAV on a building in Chihine in southern Lebanon a couple hours ago.", "location": "CHIHINE", "classification": "security", "score": 0.9730782782712554, "event_breakdown": "Event 1: An Israeli UAV attacked a building in Chihine, southern Lebanon. The attack resulted in casualties."}, {"id": "5ffe7361-748d-4830-b9aa-68dde0862d0c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30866/", "date": "2024-07-22 12:40", "message": "Hamas jumping on the opportunity:\nAgainst the background of the increasing aggression of the occupation in eastern Khan Yunis, which caused dozens of dead and injured and the displacement of families, we demand that the international community and the United Nations act urgently to stop the Zionist killing of our people who are experiencing genocide.", "location": "GAZA", "classification": "security", "score": 0.9347981337478122, "event_breakdown": "Eastern Khan Yunis\nNew Event:\nHamas jumping on the opportunity: Against the background of the increasing aggression of the occupation in eastern Khan Yunis, which caused dozens of dead and injured and the displacement of families, we demand that the international community and the United Nations act urgently to stop the Zionist killing of our people who are experiencing genocide."}, {"id": "23fbdd34-8cc7-45e9-87f6-4fe9b81d3173", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30865/", "date": "2024-07-22 12:38", "message": "The Gaza Shehab network (affiliated with Hamas):\n44 dead and about 90 injured in the east of Khan Yunis since the morning hours.", "location": "GAZA", "classification": "security", "score": 0.9741127925259646, "event_breakdown": "Event 1:\nIn the Gaza Strip on November 13, a confrontation erupted between Israeli soldiers and Palestinian militants, following an Israeli air strike. The strike targeted a car in the city of Khan Yunis, with four occupants said to be killed.\nEvent 2:\nAt least four people were killed and more than 90 injured in an explosion in the Gaza Strip on Monday, the Israeli military said. The explosion took place east of Khan Yunis."}, {"id": "fd8b6ccc-21be-4bbc-9432-ea9f667b87f0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30864/", "date": "2024-07-22 11:40", "message": "According to Palestinian channels, this is Ibrahim Mansour, who was arrested by the Israeli security forces on the charge of murdering the prison guard Yohai Avni.", "location": "GAZA", "classification": "security", "score": 0.9647003099267366, "event_breakdown": "Target event - A news push reporting an event that is happening in the current time frame and belongs to to the category security, and not a past event.\nNo relevant events found."}, {"id": "46ca8352-13dd-4bbb-a534-255a69ca32e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30857/", "date": "2024-07-22 11:35", "message": "Palestinians report an increase in the flow of displaced people from east of Khan Yunis following the entry of IDF ground forces into Bani Suheila and Abasan al-Kabira in the east of Khan Yunis.", "location": "GAZA", "classification": "security", "score": 0.8104532117316986, "event_breakdown": "Event 1: IDF Ground Forces Enter Bani Suheila and Abasan al-Kabira in Khan Yunis\nVenue: Bani Suheila and Abasan al-Kabira, east of Khan Yunis, Palestine\nDescription: Reports indicate a rise in displaced individuals from east of Khan Yunis due to the presence of IDF ground forces in Bani Suheila and Abasan al-Kabira."}, {"id": "a47195a4-9b8e-4fc9-9673-d6894280841b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30856/", "date": "2024-07-22 10:56", "message": "IDF Spokesperson: Today (Monday), IDF representatives informed the families of Alex Dancyg and Yagev Buchshtab, who were both brutally abducted into the Gaza Strip, that they are no longer alive and their bodies are being held by the Hamas terror organization.\n\nThe decision to determine their deaths was based on intelligence information and was approved by an expert committee of the Ministry of Health in cooperation with the Ministry of Religious Services and the Israel Police. The circumstances of their death in Hamas captivity are being examined by all the professional authorities.\n\nThe IDF operates in a wide variety of methods in order to gather information about the hostages in the Gaza Strip.\nThe IDF and Israeli security agencies will continue to accompany the families of the hostages for as long as required.", "location": "GAZA", "classification": "security", "score": 0.8808292781346315, "event_breakdown": "IDF Spokesperson: Today (Monday), IDF representatives informed the families of Alex Dancyg and Yagev Buchshtab, who were both abducted into the Gaza Strip, that they are no longer alive and their bodies are being held by the Hamas terror organization. circumstances of their death in Hamas captivity are being examined by all the professional authorities."}, {"id": "29b0909e-aaa4-400a-a65c-7515d53e41c4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30855/", "date": "2024-07-22 10:05", "message": "The Gazans are rushing to evacuate eastern Khan Yunis according to the instruction of the IDF spokesman in Arabic.", "location": "GAZA", "classification": "security", "score": 0.7808030231352939, "event_breakdown": "TARGET EVENT - Unknown\nNo relevant events were found."}, {"id": "d65e3d56-83cc-41a7-885c-b3d7d46424c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30852/", "date": "2024-07-22 08:31", "message": "Netiv HaAsara: Report of a suspect who arrived with a knife to the moshav and tried to harm troops.\nHe was neutralized by the standby squad.\n\n##\nThe moshav is just north of the border with Gaza.", "location": "the Gaza Strip", "classification": "security", "score": 0.9354492479741927, "event_breakdown": "Security events that are reported in text that can be placed on a map:\nEvent 1: Netiv HaAsara: Suspect with a knife tries to harm troops, standby squad neutralizes him\nEvent 2: Netiv HaAsara: Suspect with a knife tries to harm troops, standby squad neutralizes him"}, {"id": "42f80cb6-b391-466b-ba7a-ea87fa0b7d2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30834/", "date": "2024-07-22 06:13", "message": "The Palestinians report a number of dead and wounded in airstrikes carried out by the IDF in eastern Khan Yunis, the area that was warned to evacuate.", "location": "GAZA", "classification": "security", "score": 0.9653461387050711, "event_breakdown": "IDF carries out airstrikes in eastern Khan Yunis, targets identified, Palestinians reported dead and wounded"}, {"id": "423b7317-5c84-49f1-9c10-96bf0e11bd8a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30886/", "date": "2024-07-22 19:26", "message": "Hodeidah port in Yemen... after the Air Force visit.", "location": "Based on the text, Hodeidah port in Yemen is the main focus of the event.", "classification": "security", "score": 0.7593275498602166, "event_breakdown": "A recent report from Yemen indicates that the country's air force conducted aerial reconnaissance over the port city of Hodeidah on Thursday, a move seen as aimed at monitoring the movement of Houthi rebels in the area. The Houthis had earlier withdrawn from the port city in line with a UN-sponsored peace agreement. The port city of Hodeidah is strategically important, being the main entry point for humanitarian aid into Yemen. The Saudi-led coalition and the Yemeni government view the Houthi rebels as an Iranian-backed group."}, {"id": "62084bf9-0bc9-4ab5-8a3f-bf48ca0f1299", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30883/", "date": "2024-07-22 17:24", "message": "IDF: Earlier today (Monday), the IDF called on Gazan civilians to temporarily evacuate from specific areas of Khan Yunis. This was carried out due to intelligence indicating that terrorists were operating and firing rockets in these areas, as well as efforts by Hamas to reassemble its forces there. Following this, the IDF began combined operational activity above and below ground in the area.\n\nAs part of the operational activity, IDF aircraft and tanks struck and eliminated terrorists in the area.  \n\nSince this morning, the IAF and IDF artillery forces have struck more than 30 terror infrastructure sites in Khan Yunis, including in the area from which a projectile was launched toward Nirim in southern Israel earlier today. \n\nAdditionally, the IAF struck a weapons storage facility, observation posts, terror tunnel shafts, and structures used by the Hamas terrorist organization.", "location": "Khan Yunis", "classification": "security", "score": 0.9181360387518873, "event_breakdown": "IDF: Earlier today (Monday), the IDF called on Gazan civilians to temporarily evacuate from specific areas of Khan Yunis. This was carried out due to intelligence indicating that terrorists were operating and firing rockets in these areas, as well as efforts by Hamas to reassemble its forces there. Following this, the IDF began combined operational activity above and below ground in the area.\nIDF aircraft and tanks struck and eliminated terrorists in the area\n\nSince this morning, the IAF and IDF artillery forces have struck more than 30 terror infrastructure sites in Khan Yunis, including in the area from which a projectile was launched toward Nirim in southern Israel earlier today.\n\nAdditionally, the IAF struck a weapons storage facility, observation posts, terror tunnel shafts, and structures used by the Hamas terrorist organization."}, {"id": "d2fed170-be09-4ae9-b10e-60ccafeddbf2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30882/", "date": "2024-07-22 17:16", "message": "The Russian Ministry of Defense has released footage showing the destruction of HIMARS MLRS launchers in the Mykolaiv region of Ukraine using an Iskander missile.", "location": "MYKOLAIV", "classification": "security", "score": 0.7178748827647377, "event_breakdown": "Destroyed HIMARS MLRS launchers in the Mykolaiv region of Ukraine using an Iskander missile."}, {"id": "d35ec47e-f51f-4a25-8949-3cdce9dd35ce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30881/", "date": "2024-07-22 17:15", "message": "Kimberly Cheatle, head of the USSS:\n\nThe Secret Service's mission is to protect our nation's leaders. On July 13th, we failed.\n\nAs the Director of the United States' Secret Service, I take full responsibility for any security lapse of our agency. We are fully cooperating with ongoing investigations. We must learn from what happened, and I will move heaven and earth to ensure that an incident like July 13th does not happen again.", "location": "Washington, D.C.", "classification": "security", "score": 0.4268022593911344, "event_breakdown": "The USSS' Director Kimberly Cheatle commits to moving heaven and earth to ensure July 13th's incident does not happen again."}, {"id": "f626e343-da50-4342-8737-ab658a98abf7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30880/", "date": "2024-07-22 17:10", "message": "IDF Spokesperson:\n\nAn IDF officer was killed by a grenade explosion not during combat earlier this morning (Monday) in the Gaza Strip.\nThe Military Police have launched an investigation into the circumstances of the incident, the findings of which will be submitted to the Military Prosecutor's Office for review.\n\nHis family has been notified.", "location": "Gaza Strip", "classification": "security", "score": 0.9843654887668745, "event_breakdown": "IDF officer killed by grenade explosion in the Gaza Strip, Military Police launch investigation"}, {"id": "5d38f0c3-8959-4688-bbdc-fbc3b34838de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30878/", "date": "2024-07-22 17:08", "message": "Hamas celebrates the attack carried out by the terrorist Ibrahim Mansour 👆 against his jailer in an official announcement, noting that this is a natural reaction to the crimes against Palestinian prisoners.", "location": ")\nJERUSALEM", "classification": "security", "score": 0.9428481808892003, "event_breakdown": "Hamas celebrates the attack carried out by the terrorist Ibrahim Mansour against his jailer in an official announcement, noting that this is a natural reaction to the crimes against Palestinian prisoners."}, {"id": "36f1285b-e1f3-4643-96d3-0555caaa1fa1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30876/", "date": "2024-07-22 17:03", "message": "Lebanese media announce the death of Ibrahim al-Musawi, an member of the military wing of the Syrian National Socialist Party.\n\nHe was killed in an Israeli attack 👆 on a building in the village of Chihine in southern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9971114441424979, "event_breakdown": "Lebanese media announce the death of Ibrahim al-Musawi, a member of the military wing of the Syrian National Socialist Party, in an Israeli attack on a building in the village of Chihine in southern Lebanon. The attack was carried out by the Israeli military, which claimed it was targeting Hezbollah positions. The attack comes at a time of heightened tensions between the Israeli military and Hezbollah, who have been fighting in Syria."}, {"id": "8612761a-f3b4-4e80-b2f9-4b6a999bd386", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30874/", "date": "2024-07-22 17:01", "message": "The IDF spokesman publishes a video from the Rafah area in which Hamas terrorists are seen taking over a humanitarian aid convoy that was brought into the Strip.\n\nThis is how Hamas controls the population and this is one of the remaining sources of power it still holds to.", "location": "Rafah, Gaza Strip.", "classification": "security", "score": 0.8886417853047464, "event_breakdown": "IDF releases video showing Hamas terrorists taking over humanitarian aid convoy in Rafah area"}, {"id": "6143d514-4604-4168-8109-f5f27a83f969", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30870/", "date": "2024-07-22 12:49", "message": "The Palestinians publish documentation from this morning of the airstrikes that preceded the beginning of the movement of the maneuvering forces in eastern Khan Yunis.", "location": "GAZA", "classification": "security", "score": 0.942284140823662, "event_breakdown": "AL QUDS, May 13 (Xinhua) -- An air strike on a position in which (Palestinian Islamic Jihad) leader Baha Abu al Ata, was killed will also determine whether Israel knows it or not, as well as the reaction of the Islamic jihad in the Gaza Strip.\nAfter several days of relative calm between the security situation of the Palestinian enclave and the coalition forces, the Israeli Navy opened fire on Wednesday (the 6th of November) off-stage sites of the Islamic militancy in the Mediterranean Sea, in an attempt to end the recent launching of arson balloons.\nIn return, the Islamic jihad and Hamas, the ruling faction in the Gaza, have vowed to respond as soon as they can, without causing an armed escalation on the borders, and that they did not want to harm the Egyptian charter that was completed with Israel on the land border and Egypt's mediation.\nIsraeli media, which surveyed the Israeli army, said that the government had decided not to allow the Islamic jihadist commanders to rebuild their military wings, and that no outstanding leadership could emerge in the Palestinian enclave.\nBut the Israeli actions raised doubts about the possibility of Israeli fear, especially after the outbreak of the Palestinian Bombing war in the past few days, it will be the 12th year of the collapse of a ceasefire agreement.\nOn the other hand, the response of the Islamic jihad will depend on the aftermath of the assassination of Baha Abu al Ata, who followed the adoption of other measures by Israel to prevent the recruitment of its members in the Gaza border areas, like other factions.\nThe Israeli government has said that he will not be assassinated. As Robert Gatik, the Israeli army spokesman, wrote a message to reporters to an Al-Jazeera satellite channel, I think that Israel enjoys"}, {"id": "a7606508-c209-4430-a3c6-6589d30a1ff0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30863/", "date": "2024-07-22 11:39", "message": "The General Security Service and the Israel Police arrested the suspect in the murder of Yohai Avni z\"l about two weeks ago in Giv'on HaHadasha. The suspect (a Palestinian in his 20s, a resident of the village of Biddu) was arrested a week and a half ago, and the investigation by the Shin Bet and the central unit in the Jerusalem district continues.\n\nOn video - documentation of the soldiers of the Gidonim Unit (33) and the Shin Bet arresting the suspect in the murder.\n\n##\nPalestinian channels report that the detainee's name is Ibrahim Mansour - a released prisoner.", "location": "Giv'on HaHadasha", "classification": "security", "score": 0.8606059671546066, "event_breakdown": "The target event was a news story about a suspect that was arrested in the murder of Yohai Avni z\"l. The suspect was arrested about two weeks ago in Giv'on HaHadasha, which is in Israel. The story reports that the suspect is a Palestinian, in his 20s, and a resident of the village of Biddu. The investigation is being conducted by the Shin Bet and the central unit in the Jerusalem district."}, {"id": "fde321e3-9da1-428e-9832-e06efe665aa8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30839/", "date": "2024-07-22 06:17", "message": "Following the Israeli attack in Yemen and before the promised Houthi response, the spokesman for the Houthi naval forces sends a warning to the Arab countries in the region:\n\n\"Any country that joins Israel (cooperates with it) will be part of the target bank and we will treat it as an enemy, according to the laws of war according to which any country that supports an enemy country during war is an enemy.\"", "location": "Yemen", "classification": "security", "score": 0.6372146512703387, "event_breakdown": "The Israeli attack in Yemen was an attack by Israel on January 3, 2022, killing at least 25 people, according to the Houthi rebels. The Houthis promised to retaliate in response to the attack."}, {"id": "f639cb3f-198b-4719-a5e1-1772658271e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30877/", "date": "2024-07-22 17:05", "message": "The Palestinian Ministry of Health in Gaza:\n\n70 casualties  and over 200 wounded have arrived since this morning at the Nasser Hospital in Khan Yunis following the attacks in eastern Khan Yunis in the southern Gaza Strip.\n\n##\nGazan journalistic sources report over 75 deaths so far.\nGazan journalists in Khan Yunis claim the death toll has already reached 56.", "location": "GAZA", "classification": "security", "score": 0.9315444554380603, "event_breakdown": "target event not found"}]