[{"id": "21250949-167f-4f2a-b284-458187e92394", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30971/", "date": "2024-07-24 09:20", "message": "IDF activity in Khan Yunis district\n\nThe Palestinians report that maneuvering forces of the IDF are making arrests in the Qarara area in the north of Khan Yunis, among other things from the Ilboun school on street number 2.\n\nThe Palestinians report that for the third day in a row IDF maneuvering forces are in the Bani Suheila area east of Khan Yunis. According to residents of Gaza, the forces placed a \"shooter identification\" system high up, in the center of Bani Suheila, which allows observation and fire.", "location": "Khan Yunis district", "classification": "security", "score": 0.9142334470508813, "event_breakdown": "IDF activity in Khan Yunis district:\nIn Khan Yunis district, IDF maneuvering forces are reported to be making arrests in Qarara area and placing \"shooter identification\" system in Bani Suheila area."}, {"id": "cd548d97-fbb4-4729-af6a-d978187b7b3c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30970/", "date": "2024-07-24 09:14", "message": "In Lebanon, they look towards November to understand what will happen with the war in Lebanon\n\nA senior Lebanese political source for the \"Aljoumhouria\" newspaper: The next significant stop in terms of the Lebanese front and the crisis it is in is not Netanyahu's speech to Congress, but the fate of the presidency in the US and the plan of the new president to be elected regarding Gaza.", "location": "Lebanon", "classification": "security", "score": 0.6779108299213249, "event_breakdown": "In Lebanon, they look towards November to understand what will happen with the war in Lebanon."}, {"id": "a1f621e4-6165-48ba-9f2c-b2bf4a9e5f87", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30969/", "date": "2024-07-24 07:21", "message": "The Palestinians publish footage from the security cameras in Tubas showing the shooting by an undercover force at the Palestinian officer Abd-Nasser Sarhan👆, after he approached them armed with a rifle.\nThe shooting moments in the lower part of the screen starting at seconds 00:45 in the video.", "location": "TUBASRA, WEST BANK", "classification": "security", "score": 0.9564550254262717, "event_breakdown": "* The Palestinians publish footage from the security cameras in Tubas showing the shooting by an undercover force at the Palestinian officer Abd-Nasser Sarhan, after he approached them armed with a rifle. The incident took place in Tubas, a Palestinian city located in the north of the West Bank. The video shows the moments during the shooting in the lower section of the screen, starting at seconds 00:45."}, {"id": "2066b8a5-2f56-49f0-9a3f-3936770802ae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30967/", "date": "2024-07-24 07:13", "message": "The body of Abd-Nasser Sarhan, the officer in the security apparatus of the Palestinian Authority who was killed by IDF fire tonight, with a ribbon of the Al-Aqsa Martyrs' Brigades of Fatah on his head.\n\nAs mentioned, Fatah announced a strike today in Tubas following his death.", "location": ")\nWest Bank", "classification": "security", "score": 0.9642796934680155, "event_breakdown": "Possible answers\nIDF fire at Palestinian security officer in Tubas city kills him\nAdditonal possible answer\nFatah's strike following the death of the security officer"}, {"id": "4db64f43-49ba-41d0-a7e7-b97eb5688bc5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30966/", "date": "2024-07-24 07:12", "message": "Fatah-identified channels claim: Abd-Nasser Sarhan, an officer in the security apparatus of the Palestinian Authority in Tubas was killed tonight after he exposed special forces of the IDF and exchanged fire with them.\n\nThe Fatah movement announced a general strike today in Tubas to mourn his death (Sarhan himself is a resident of the Balata refugee camp in Nablus but was killed in Tubas).", "location": "Tubas", "classification": "security", "score": 0.9592981389933702, "event_breakdown": "Event: Abd-Nasser Sarhan, an officer in the security apparatus of the Palestinian Authority in Tubas was killed tonight after he exposed special forces of the IDF and exchanged fire with them.\nLocation: Tubas, Palestinian Authority"}, {"id": "a924c107-db66-4dc9-9621-b415190179b6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30960/", "date": "2024-07-24 07:00", "message": "IDF spokesperson:\n\nYesterday (Tuesday) an IDF soldier was seriously injured as a result of the fall of a number of projectiles that crossed the territory of Lebanon towards the Mount Dov area.\n\nThe soldier was taken to a hospital for medical treatment, his family has been notified.", "location": "Mount Dov area.", "classification": "security", "score": 0.9056783564407869, "event_breakdown": "IDF soldier serious injury on Mount Dov area by Lebanon projectiles."}, {"id": "1ff0603e-9f34-4e14-b236-dad0872c58a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30950/", "date": "2024-07-24 06:52", "message": "Yemen: Reports of an oil reservoir that exploded a short time ago in the port of Hodeidah, three days after the Israeli attack on the place (the explosion was a result of the fire caused by the Israeli attack - AA).\nThe fire continues to burn.", "location": "Hodeidah", "classification": "security", "score": 0.9941933532844556, "event_breakdown": "Yemen: Port of Hodeidah reports an oil reservoir that exploded a short time ago (fire caused by the Israeli attack). Hodeidah."}, {"id": "c606635a-f2ae-44eb-a07f-73e13c7c264d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30980/", "date": "2024-07-24 12:42", "message": "The destruction in Rafah:\n\nThe al-Brahma neighborhood area in West Rafah, before and after.", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.965103509707119, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n1. The al-Brahma neighborhood area in West Rafah, before and after.\n\nBefore and after satellite imagery of a severely damaged neighborhood area in Rafah, showing widespread destruction. The images highlight the stark contrast between the pre-destruction and post-destruction states of the area."}, {"id": "bc146695-f63b-4289-9fa7-81d14fdecec0", "channel_id": 1560386984, "url": "", "date": "2024-07-24 11:43", "message": "Footage of the security team aboard the US-owned merchant ship MV Pumba dealing with an unmanned explosive device launched by the Houthis in Yemen a few days ago.\nThe explosive boat exploded before it could hit the ship.", "location": ")\nThe event was said to have taken place in the Red Sea - off the coast of Yemen.", "classification": "security", "score": 0.8875449928591812, "event_breakdown": "Houthi rebels in Yemen have attacked a Saudi oil facility near the border with Yemen, sparking a major fire. The rebels said they had carried out a drone attack on the facility."}, {"id": "cae223a7-dd11-4f29-9f1b-1b0f782ce8ba", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/idf-spokesperson-110/", "date": "2024-07-24 11:42", "message": "IDF spokesperson:\n\nTonight, the forces of the Binyamin Brigade operated in Qalandiya, during which engineering forces destroyed the house of the terrorist Muhammad Manazara who carried out the shooting attack at the Eli gas station on February 29, 2024, in which the late Yitzhak Zeiger and the late Oriya Hartom were murdered.", "location": "Qalandiya", "classification": "security", "score": 0.9815416254422756, "event_breakdown": "IDF spokesperson:\n\n1. IDF forces operating in Hadera neutralized a terror cell planning to carry out a shooting attack in the city.\n2. IDF forces arrested 3 terror suspects in response to the discovery of explosive devices.\n3. IDF foiled an attempted shooting attack in the Al-Aroub refugee camp.\n4. IDF forces arrested 4 suspects in the Al-Aqsa Mosque's compounds.\n5. IDF forces thwarted a terror cell in the West Bank that was planning attacks on Israeli communities.\n\nIDF spokesperson:\nNo relevant events were found."}, {"id": "dad9c935-4e24-4e41-b6ce-43465e5553d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/hezbollah-publishes-more-aerial-documentation-from-israeli-territory-the-third-in-the-hoopoe-series/", "date": "2024-07-24 11:36", "message": "Hezbollah publishes more aerial documentation from Israeli territory, the third in the \"Hoopoe\" series.\nAccording to Hezbollah, part of the documentation was taken yesterday (July 23).", "location": "LEBANON", "classification": "security", "score": 0.6777789496012027, "event_breakdown": "Hezbollah published more aerial documentation of Israeli territory, taken yesterday (July 23)."}, {"id": "248bd257-f264-4bcb-9430-4500c4f10306", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30975/", "date": "2024-07-24 10:38", "message": "The Palestinians complain: Israeli warplanes are scaring the displaced Gazans in the tents in Khan Yunis when they break the speed of sound.", "location": "GAZA", "classification": "security", "score": 0.9259453028904047, "event_breakdown": "Target event: Israeli warplanes break the speed of sound over Gaza\nIsraeli warplanes break the speed of sound over Gaza - Gazans displaced in Khan Yunis have complained that Israeli warplanes are scaring them when they break the speed of sound."}, {"id": "69358bef-0228-44c8-a0ef-4e2c959da7e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30972/", "date": "2024-07-24 10:38", "message": "Following the report here 👆\nThe Palestinians publish photos of two \"shooter identification\" systems that the IDF placed on top of cranes in Bani Suheila in eastern Khan Yunis and also in the Qarara area in northern Khan Yunis.", "location": "GAZA", "classification": "security", "score": 0.8870180420323224, "event_breakdown": "Security measures have been tightened in Bani Suheila and Qarara in Khan Yunis.\n\nThe two systems were placed on top of cranes as part of a crackdown on security threats. The IDF has not commented on the report."}, {"id": "a1c0f8f8-c391-424d-9be1-23e816796819", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30965/", "date": "2024-07-24 07:09", "message": "Samy Gemayel, a member of the Christian Kataeb party in Lebanon wants peace and quiet in South Lebanon:\n\n\"I want the residents of South Lebanon to live in peace and quiet for 50 years.\nThis way is the way for the state of Lebanon to lose its sovereignty over southern Lebanon.\nDo I have the right to an opinion on the way in which my people in southern Lebanon should be protected? Or is the only accepted opinion in this country that of Hezbollah according to which the residents of southern Lebanon should live in a state of war for another thousand years to come?\nThis is because they do not recognize the State of Israel and consider their weapons \"holy\". They are turning South Lebanon into a battlefield that will never end.\nAre we allowed to dream that we can live in peace in our country?\"", "location": "Lebanon", "classification": "security", "score": 0.7381596230623931, "event_breakdown": "South Lebanon:\nA member of a Christian political party in Lebanon, Kataeb, wants the people of South Lebanon to live in peace and quiet without being subject to Hezbollah's weapons. He considers their weapons \"holy\" and that turns Southern Lebanon into a never-ending battlefield because Hezbollah does not recognise the State of Israel."}, {"id": "eb05b5ae-090c-4727-a386-706e83ee9762", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30955/", "date": "2024-07-24 06:56", "message": "Qalandia, north of Jerusalem:\nLast night IDF forces blew up the home of terrorist Muhammad Manazar, a Palestinian police officer who carried out the shooting attack in Eli at the end of February this year. Two Israelis were killed in the attack.\n\nIDF forces distributed earplugs and instructions to the residents of the houses near the explosion area...\nOne of the residents of Qalandia documented the entry of the IDF vehicle with the \"necessary materials\" to blow up the house.\n\nDuring the entry of the troops, there were clashes with the Palestinians in Qalandia. One Palestinian was killed. Arrests were made.", "location": "Qalandia", "classification": "security", "score": 0.9949772664904585, "event_breakdown": "IDF destroys home of Palestinian terrorist Muhammad Manazar in Qalandia north of Jerusalem, following shooting attack in Eli in February 2019"}, {"id": "ea3d9e44-497a-402c-ad04-02ef7a0b55e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30993/", "date": "2024-07-24 18:01", "message": "Al Jazeera live from Congress...\n\nhttps://x.com/i/broadcasts/1YpKklXoYMrGj?t=5xuIGAovQ6Wj2lCy-WmXtQ&s=09", "location": "WASHINGTON DC", "classification": "security", "score": 0.553861775959209, "event_breakdown": "It was a long week in Congress. We saw a lot of action around the issue of security and surveillance in the United States.\n\nOn Tuesday, the House of Representatives passed the Enhanced Surveillance Reform Act, a bill that would extend the NSA's surveillance powers for another five years. This comes after the Senate passed its own version of the bill last week.\n\nOn Wednesday, the House passed a bill that would limit the power of the President to issue executive orders on national security. The President has said that he is willing to veto the bill.\n\nOn Thursday, the Senate passed the fiscal year 2020 National Defense Authorization Act, a bill that authorizes funding for the Department of Defense. The NDAA includes provisions that would allow the President to use military force against Iran without the approval of Congress. The House is expected to vote on the NDAA next week."}, {"id": "1acc9499-762c-45c3-9bfd-e3d40195d6a4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30987/", "date": "2024-07-24 17:54", "message": "The attack on Ein Jalot 6 tower in Nuseirat focused on the seventh floor.\nAdditional documentation shows the moments of the attack.", "location": "EIN JALÓT 6 TOWER IN NUSEIRAT", "classification": "security", "score": 0.977223122669463, "event_breakdown": "Target tower attacked in Nuseirat, a new report shows that the attack was focused on the seventh floor of the \"Ein Jalot 6\" tower. Details of the additional documentation spoken of are located in Ein Jalot, Nuseirat, Gaza."}, {"id": "3d34865e-b1dd-4c29-864a-8f78d6b1e525", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30986/", "date": "2024-07-24 17:52", "message": "Nuseirat, the center of the Gaza Strip:\nAfter Ein Jalot towers number 7, 9 and 10, it was the turn of Ein Jalot tower 6 today.\nIt was attacked shortly after an evacuation notice.", "location": "Gaza Strip", "classification": "security", "score": 0.9135751676679171, "event_breakdown": "Target event:\nNuseirat, Gaza Strip: An evacuation notice was issued for residents of Ein Jalot tower 6 after it was attacked."}, {"id": "bf688754-abb9-4575-877f-1a3ad57ebb05", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30959/", "date": "2024-07-24 06:59", "message": "The Shiite militias in Iraq accepted responsibility early this morning for attacking a target in Eilat using a UAV.\n\n##\nIDF: Overnight, IDF fighter jets successfully intercepted two UAVs that approached Israeli territory from the east.\nThe UAVs did not manage to cross into Israeli territory.", "location": "Eilat", "classification": "security", "score": 0.9864785343110729, "event_breakdown": "IDF fighter jets intercepted two UAVs approaching Israeli territory from the east. The UAVs did not manage to cross into Israeli territory."}]