[{"id": "29c069ac-d7d9-4e23-8b7b-f401cc9fa614", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27390/", "date": "2024-05-18 08:04", "message": "The beginning of the operation of the American floating pier in Gaza. Footage from yesterday.", "location": "GAZA", "classification": "security", "score": 0.9385895061032036, "event_breakdown": "Security Events:\n\n1. The commencement of the American floating pier in Gaza.\n2. Footage from yesterday."}, {"id": "caaf77f0-7db0-445e-b055-7ad1244a9a5b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27387/", "date": "2024-05-18 08:03", "message": "The assassination of Sharahabil a-Seid 👆 in Lebanon near the border with Syria\n\nThe IDF spokesman announced last night that the IDF attacked and eliminated the terrorist Sharhabil Ali A-Seid, a senior member of the terrorist organization the Islamic Jama'a in Lebanon - who worked in cooperation with Hamas.\n\nThe military wing of Hamas officially announced this morning that A-Seid was in fact a commander in its ranks.", "location": "Lebanon", "classification": "security", "score": 0.984236194025843, "event_breakdown": "Event 1: IDF attacks eliminates terrorist Sharhabil Ali A-Seid\nEvent 2: Sharhabil Ali A-Seid is member of Islamic Jama'a\nEvent 3: Sharhabil Ali A-Seid cooperated with Hamas"}, {"id": "f2345a89-69aa-4337-aff3-497ef7c97784", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27386/", "date": "2024-05-18 07:43", "message": "The IDF spokesman reported last night that the attack in Jenin was carried out using a fighter jet and a helicopter . \n\nAccording to the report, the terrorists' command room was targeted in the attack. According to intelligence reports, the men, who were still inside the command room, were preparing an immediate attack.", "location": ")\nJenin", "classification": "security", "score": 0.8677386594771352, "event_breakdown": "Security Events:\n\n1. IDF carried an attack in Jenin using a fighter jet and a helicopter.\n2. The target was a terrorist command room.\n3. The terrorists inside the command room were preparing for an imminent attack."}, {"id": "111e519d-5e1b-49c0-8d42-01638a35edbe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27385/", "date": "2024-05-18 07:39", "message": "Palestinian channels:\nFIFA, the International Football Federation, refuses the Palestinian request to vote on the suspension of Israel's membership in the federation.\n\nAccording to FIFA, the issue should be examined by the FIFA Council.", "location": "FIFA", "classification": "security", "score": 0.9067507917333505, "event_breakdown": "Security Events:\n\n1. FIFA, the International Football Federation, refuses the Palestinian request to vote on the suspension of Israel's membership in the federation.\n\n2. FIFA states that the issue should be examined by the FIFA Council."}, {"id": "d29eb643-d432-4396-acf3-33ea571d5751", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27418/", "date": "2024-05-18 14:04", "message": "The Palestinians report that 5 Hamas policemen were killed in an IDF attack earlier today on Ishrin Street, in the center of Nuseirat (the center of the Strip) near the \"Al Iman\" flour mill.", "location": "NUSEIRAT", "classification": "security", "score": 0.9806067704461011, "event_breakdown": "Security Event: IDF attack on Ishrin Street in Nuseirat.Hamas policemen were killed in the IDF attack."}, {"id": "ebe6b781-1e37-43f3-ade5-3a01536d2591", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27417/", "date": "2024-05-18 13:50", "message": "Jenin: Combat engineers of the Palestinian Authority police arrived in the area of ​​Yahya Ayash square in Jenin following a report that a bomb had fallen from a fighter plane was located there.", "location": "Jenin", "classification": "security", "score": 0.9709999784130295, "event_breakdown": "Security Events:\n- Report of a bomb falling in Yahya Ayash square in Jenin\n- Deployment of Palestinian Authority police combat engineers"}, {"id": "5815da94-81a4-489a-999a-087021a21bd2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27416/", "date": "2024-05-18 13:48", "message": "The Palestinians report 22 dead in the attack on the house of the Al-Silawi family in the Jabaliya refugee camp in the northern Gaza Strip, not far from the Kamal Adwan hospital.", "location": "GAZA", "classification": "security", "score": 0.9757846770970594, "event_breakdown": "The security events in the text are as follows:\n\n1. The attack by Israeli forces on the house of the Al-Silawi family in the Jabaliya refugee camp in the northern Gaza Strip.\n2. The killing of 22 Palestinians in the attack.\n3. The location of the attack in close proximity to the Kamal Adwan hospital."}, {"id": "49aad828-a209-4a58-9536-701c88603940", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27413/", "date": "2024-05-18 13:44", "message": "IDF Spokesperson: The Givati ​​Brigade has killed about 80 terrorists in East Rafah.\nSignificant underground infrastructures were located.\nMany weapons were located, including a large number of anti-aircraft weapons (pictured).", "location": "GAZA", "classification": "security", "score": 0.9309481475643538, "event_breakdown": "Events:\nIDF locates significant underground infrastructures in East Rafah\nIDF locates many weapons, including large numbers of anti-aircraft weapons in East Rafah."}, {"id": "9ec272ac-6692-424e-a0c8-58e0382714a5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27407/", "date": "2024-05-18 13:34", "message": "The Deir al-Balah area in the center of the Gaza Strip is filling up with tents and Gazans who came from Rafah.", "location": "GAZA STRIP", "classification": "security", "score": 0.9734678149318564, "event_breakdown": "Security Events:\n\n1. The population of Deir al-Balah in the Gaza Strip is increasing rapidly as Gazans from Rafah are setting up tents in the area.\n2. There is a considerable security concern regarding the rapid influx of people into Deir al-Balah due to the potential displacement of people from Rafah, which might lead to instability in the region.\n3. The presence of tents and increased population in Deir al-Balah may alter the status quo in the area, which could potentially trigger security incidents.\n4. The influx of people into Deir al-Balah raises questions about the potential impact on resources and infrastructure, such as housing and medical facilities.\n5. The rapid increase in population in Deir al-Balah raises concerns about the potential strain on the local security and law enforcement resources.\n6. The influx of people into Deir al-Balah and the setting up of tents may lead to an increase in crime and violence, ultimately resulting in a security risk for the local population.\n\nNote: The above list captures the primary security events that can be identified from the given text. These events highlight the ongoing situation in the region and the potential security risks associated with the increasing population and presence of tents in Deir al-Balah."}, {"id": "5ca0b91d-2eb2-46c2-b6d0-4b1ff75e6b2b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27406/", "date": "2024-05-18 13:33", "message": "The Philadelphia axis area in Rafah in the south of the Gaza Strip is becoming empty of Gazans and tents.", "location": "GAZA STRIP", "classification": "security", "score": 0.9810980369733283, "event_breakdown": "Security Events:\n\n1. Evacuation of Philadelphia Axis area in Rafah, Gaza.\n2. Emptying of Gazans and tents from the area."}, {"id": "7a6a4985-61d8-4d8b-9b08-1abbb9c4528b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27405/", "date": "2024-05-18 13:33", "message": "Prime Minister of Slovenia: We will recognize a Palestinian state next month.", "location": "Ljubljana", "classification": "security", "score": 0.4526724735828317, "event_breakdown": "Security Events:\n\n* Prime Minister of Slovenia announces plans to recognize a Palestinian state next month\n* Slovenia to recognize a Palestinian state, a move opposed by Israel\n* Slovenian Prime Minister's announcement on recognition of a Palestinian state\n* Diplomatic relations between Slovenia and Palestine to be established\n* Implications of Slovenia's recognition of a Palestinian state on regional security and stability"}, {"id": "35fbd0b1-de58-4e78-8f97-20d702bce660", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27404/", "date": "2024-05-18 13:32", "message": "On the other side, the words of the Israeli Knesset member Ram Ben Barak stand out today and are echoed on many Arab channels:\n\n\"Our war in Gaza is pointless. And of course we will lose it.\n\nWe are returning to fight in areas where we have already fought, we are losing many soldiers and our economy is collapsing.\n\nWe are losing in the international arena and our relations with Washington are collapsing. We have not achieved any success.\"", "location": "Gaza", "classification": "security", "score": 0.496247117898843, "event_breakdown": "Security Events in the English-List Format:\n1. The Israeli Knesset member Ram Ben Barak recognizes that Israel's war in Gaza is pointless and that they will be defeated.\n2. The Israeli Army is going back to the areas they have fought before.\n3. The Israeli military is losing many soldiers in the Gaza strip.\n4. The Israeli military economy is suffering major losses.\n5. Israel has lost the diplomatic war with the rest of the world, particularly the United States and the European Union."}, {"id": "8fbac7e2-c004-4e4f-a8f5-8a0eb8ec26cd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27398/", "date": "2024-05-18 11:22", "message": "In the last hour, the Palestinians report 12 casualties in an IDF attack on the \"Ikara\" library in the Jabalia refugee camp in the northern Gaza Strip, where a shelter for displaced Gazans is located.\n\nIn another incident, the Palestinians are reporting that a Gazan named Azami Khalil Abu Daqa was killed in an attack on a vehicle near A-Shahkoosh Street in the northwest of Rafah. Four more Gazans were injured.", "location": "GAZA STRIP", "classification": "security", "score": 0.9950275751706031, "event_breakdown": "Event 1: IDF attack on the \"Ikara\" library in the Jabalia refugee camp in the northern Gaza Strip, resulting in 12 casualties.\nEvent 2: Attack on a Gazan vehicle near A-Shahkoosh Street in the northwest of Rafah, resulting in the death of Azami Khalil Abu Daqa and the injury of four others."}, {"id": "e0f4ebf5-443e-4bce-b813-2ea54149ed80", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27393/", "date": "2024-05-18 10:32", "message": "The remains of the command room that was targeted yesterday in an airstrike in Jenin's A-Damaj neighborhood.", "location": "Jenin", "classification": "security", "score": 0.9794169771029132, "event_breakdown": "Text:\nThe remains of a command room targeted in an airstrike in Jenin's A-Damaj neighborhood.\nEvents:\n* A-Damaj neighborhood airstrike in Jenin"}, {"id": "6a63c186-8bab-4c1e-83f5-ffd2939f394b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27392/", "date": "2024-05-18 10:31", "message": "The Palestinian Crossings Authority: The Kerem Shalom crossing has been closed to aid trucks for 12 days in a row.\n\n##\nOver the past few days, about 50 trucks of goods have entered through the crossing every evening, for merchants within the Strip. \n\nThis refers to the goods that were paid for and it is not the free humanitarian aid that the Gazans were used to during the first months of fighting.\n\nRafah crossing is still closed.", "location": "Kerem Shalom", "classification": "security", "score": 0.47366070481852524, "event_breakdown": "Security Events:\n\n1. Kerem Shalom crossing has been closed to aid trucks for 12 days in a row.\n2. Rafah crossing is still closed."}, {"id": "47cae95c-c2ea-4783-8211-1226f47e5ed1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27391/", "date": "2024-05-18 10:30", "message": "The Palestinians are wondering why aid trucks at the floating pier have yellow (Israeli) license plates...", "location": "GAZA STRIP", "classification": "security", "score": 0.9494680483019293, "event_breakdown": "1. Israeli aid trucks with yellow license plates parked at the floating pier.\n2. Palestinian security forces wondering why Israeli aid trucks have yellow license plates.\n3. Aid trucks at the floating pier with yellow license plates."}, {"id": "d5b72f1d-b31c-4f11-8c32-573b6cd59ecd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27430/", "date": "2024-05-18 18:37", "message": "The IDF spokesman in Arabic instructs the residents of the following neighborhoods - Salatin, Al-Karameh, A-Atatra, and Amer, located in the northwest of the Gaza Strip, to move south and evacuate to the west of Gaza City.\n\n##\nThis means that the IDF's activity in Jabalia deepens.\nIsraeli forces entered from the east and intend to cross the entire northern area of the Gaza Strip from east to west and reach the coastline.", "location": "The main event takes place in the Gaza Strip.", "classification": "security", "score": 0.9832652306922179, "event_breakdown": "Security Events in the northwest of the Gaza Strip:\n\n1. IDF instructs residents of Salatin, Al-Karameh, A-Atatra, and Amer neighborhoods to move south and west.\n2. IDF activities deepen in Jabalia.\n3. IDF enters from the east, crossing the northern Gaza Strip from east to west.\n4. IDF intends to reach the coastline."}, {"id": "0315ef77-c88f-47af-979f-c8d6942e6ce6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27428/", "date": "2024-05-18 18:33", "message": "Beirut: Demonstrations and clashes between Lebanese security forces and bikers.\n\nThe reason: the Lebanese police launched an operation to confiscate unlicensed motorcycles.\n\nAt noon, as demonstrations heated, police officers in Beirut were forced to shoot at protesters who were demonstrating in front of one of the police stations in Beirut following the confiscation of the motorcycles.", "location": ")\nBeirut", "classification": "security", "score": 0.9878907765889199, "event_breakdown": "Security events:\n\n1. Bikers in Beirut clash with security forces.\n2. Lebanese police launch operation to confiscate unlicensed motorcycles.\n3. Protests erupt in front of Beirut police station after motorcycle confiscation.\n4. Lebanese police fire shots at protesters during the demonstrations."}, {"id": "5539ae8b-8917-4c6b-bb08-3f175a29951d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27427/", "date": "2024-05-18 18:29", "message": "Tonight at a press conference, Israeli Minister Benny Gantz set six conditions for his party remaining part of the coalition government, setting an ultimatum for this until June 8.\n\nThe conditions that Gantz lays out for his strategic plan:\n\n1. The return of the hostages.\n2. Toppling Hamas, demilitarizing the Gaza Strip and ensuring Israeli security control.\n3. Alongside maintaining Israeli security control, establishing an American-European-Arab-Palestinian administration that will manage civilian matters in the Strip and lay the foundation for a future alternative that is not Hamas and not Abbas (PA President and Chairman Abu Mazen - AA).\n4. The return the displaced Israelis from the north of the country to their homes by September 1, and the rebuilding of the Western Negev.\n5. Promoting normalization with Saudi Arabia as part of a comprehensive move that will create an alliance with the free world and the Arab world against Iran.\n6. Adopting a bill that will ensure that all Israelis serve and contribute to the national effort (referring to the ongoing issue of Haredi men being exempt from military service -AA). \n\n##\nGantz with a new phrase for #the_day_after the war:\n\nNot Hamas and not Abbas.", "location": ".\nGaza Strip", "classification": "security", "score": 0.7445805303775641, "event_breakdown": "Event 1: Gantz set six conditions for the party being part of the coalition government.\nEvent 2: Gantz lays out these conditions: the return of hostages, toppling Hamas, demilitarizing Gaza, ensuring Israeli security control, establishing an administration, returning displaced Israelis, and promoting normalization with Saudi Arabia.\nEvent 3: Gantz wants the return of displaced Israelis by September 1 and the rebuilding of their homes.\nEvent 4: Gantz also wants a law requiring all Israelis to contribute to national effort."}, {"id": "7826d35a-87a5-44b0-82c9-ec3fbeb8b904", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27425/", "date": "2024-05-18 18:11", "message": "Footage by the IDF spokesman: Soldiers from the IDF's Paratroopers brigade take down Palestinian terrorists one by one, as they fled to the roof of a building in Jabalia, northern Gaza Strip.", "location": "JABALIYA", "classification": "security", "score": 0.9867747835227784, "event_breakdown": "Security Events: \n-IDF's Paratroopers brigade take down Palestinian terrorists in Jabalia, northern Gaza Strip."}, {"id": "35b6cd87-b68b-473e-85f9-d8722e833d5d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27424/", "date": "2024-05-18 17:40", "message": "IDF spokesperson: The IDF and the Shin Bet rescued the body of Israeli hostage Ron Binyamin, who was murdered by Hamas on Oct 7th.\n\nThe body of the late Ron Binyamin was recovered in a joint operation by the IDF and Shin Bet.\n\nAccording to verified intelligence information in our possession, Binyamin was murdered during the brutal terrorist attack on October 7th during the siege of Mefalsim, and his body was kidnapped to Gaza by Hamas terrorists.\n\nHis body was recovered along with the bodies of hostages Yitzhak Gelanter, Shani Louk and Amit Buskila.\n\nAfter an identification procedure, IDF representatives notified the family. The IDF and Shin Bet share in the family's grief at this difficult time.\n\nThe IDF and the Shin Bet continue to take all operational and intelligence measures, while taking operational risks, in order to realize the most important national mission of returning all the hostages.", "location": "Gaza", "classification": "security", "score": 0.8868333101900494, "event_breakdown": "List of security events:\n\n1. Hamas terrorist attack on October 7th during the siege of Mefalsim.\n2. Kidnapping of Ron Binyamin's body to Gaza by Hamas terrorists.\n3. Joint operation by the IDF and Shin Bet to recover the body and bodies of hostages Yitzhak Gelanter, Shani Louk and Amit Buskila.\n\nThese events are related to each other and can be listed as a single event in brief."}, {"id": "97423f04-deab-4392-82e2-0bac4e1052a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27423/", "date": "2024-05-18 17:30", "message": "Palestinian channels: Anas Shabaneh, the eldest son of Abu Anas Shabaneh, the commander of the Rafah Brigade in Hamas's Izz a-Din al-Qassam Brigades and one of the most senior military commanders left in Hamas, was killed this morning in an exchange of fire with IDF soldiers in Rafah's A-Tanour neighborhood.\n\nTwo of his younger brothers, Mahmoud and Abd Al-Nasser were both killed on Oct. 7th.", "location": "GAZA", "classification": "security", "score": 0.9960801590647578, "event_breakdown": "* Today (subject): Exchange of fire between IDF soldiers and Anas Shabaneh.\n* October 7: Mahmoud and Abd Al-Nasser Shabaneh killed by IDF soldiers."}, {"id": "3e6750e6-7e66-4fb2-91ff-36998ffb0f5f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27422/", "date": "2024-05-18 17:20", "message": "Aid entering the Gaza Strip via the American-built pier.", "location": "GAZA STRIP", "classification": "security", "score": 0.9535858817080166, "event_breakdown": "Security Events:\n\n1. Aid entering the Gaza Strip via the American-built pier.\n2. Aid entering the Gaza Strip.\n3. Aid entering the Gaza Strip via the American-built pier."}, {"id": "ec8e9280-2f37-449a-9eb9-77fdfcb18313", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27399/", "date": "2024-05-18 11:23", "message": "Israeli goods fill the markets of the center of the Gaza Strip (imported by Gazan merchants via the Kerem Shalom crossing).\n\nChips, sugar, chicken liver and wings - all Israeli!", "location": "GAZA STRIP", "classification": "security", "score": 0.9812874890826863, "event_breakdown": "Security Events:\n\n1. Import of Israeli goods into the Gaza Strip via the Kerem Shalom crossing.\n2. Import of Israeli products into the Gaza Strip (chips, sugar, chicken liver and wings)."}, {"id": "9c018888-5902-4a3d-bc77-2da7998c78e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27431/", "date": "2024-05-18 20:45", "message": "Palestinian channels: 40 casualties and about 100 wounded arrived today at the Kamal Adwan hospital in the northern Gaza Strip (likely as a result of the fighting in Jabalia - AA)", "location": "GAZA", "classification": "security", "score": 0.9720409790802279, "event_breakdown": "Security events mentioned in the text:\n\n* At least 40 casualties and about 100 wounded arrived today at the Kamal Adwan hospital in the northern Gaza Strip (likely as a result of the fighting in Jabalia - AA)\n\n* Fighting in Jabalia (location - AA)"}, {"id": "7604fdd0-08f4-49bc-881c-72ea1d9dcc50", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27409/", "date": "2024-05-18 13:43", "message": "Lebanese media: Israel attacked a vehicle in the last minutes in the duty free zone on the border between Lebanon and Syria.\n\nFollowing reports state the attack was carried out in Syrian territory immediately after the vehicle entered Syrian territory from Lebanese territory.\n\nAl-Saudi Arabia Network: The target of the attack on the Syria-Lebanon border was saved.", "location": "Based on the context provided, I was unable to determine a specific location for the event.", "classification": "security", "score": 0.9615168612134932, "event_breakdown": "Event 1: Israel attacked a vehicle in the last minutes in the duty free zone on the border between Lebanon and Syria.\nEvent 2: Reports indicate that the attack was carried out in Syrian territory immediately after the vehicle entered Syrian territory from Lebanese territory.\nEvent 3: Al-Saudi Arabia Network: The target of the attack on the Syria-Lebanon border was saved."}]