[{"id": "cbc02b05-a71d-47e6-9325-2b802a67ebbd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30031/", "date": "2024-07-06 19:54", "message": "Lebanon - Ashura\n\nTomorrow, according to the supreme leader of Iran, will be the first day of the Muslim month of Muharram.\n\nOn the 10th of this month, the day of Ashura falls, in which the Shiites mourn the death of Hussein, the son of Ali ibn Abi Talib and the grandson of the Prophet Muhammad, in the famous battle of Karbala.\n\nThe villages of southern Lebanon were already decorated today with black banners on the occasion of the Day of Ashura, which will take place on July 17.\n\nHeavy security arrangements are being made in the Dahya of Beirut, Hezbollah's stronghold in the Lebanese capital. There is a ban on vehicles entering the district (except after inspection) and a ban on flying drones in the area's skies.\n\nHezbollah members are especially afraid of attacks against them in these sensitive days.", "location": "Lebanon", "classification": "security", "score": 0.8033087734941302, "event_breakdown": "Lebanon - Ashura\n\nReported security events:\n\n1. Heavy security arrangements are being made in the Dahya of Beirut, Hezbollah's stronghold in the Lebanese capital.\n\nAdditional notes: The other event mentioned in the text, about the black banners in the villages and the drone ban, is not a security event."}, {"id": "ccdcedc5-b6c8-4c90-8716-69c161fe338d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30030/", "date": "2024-07-06 19:49", "message": "IDF: Earlier today, based on IDF and ISA intelligence, the IAF struck several terrorists operating in structures located in the area of UNRWA's Al-Jaouni School in the central Gaza Strip. \n\nThis location served as a hideout and operational infrastructure from which attacks against IDF troops operating in the Gaza Strip were directed and carried out. \n\nPrior to the strike, numerous steps were taken in order to mitigate the risk of harming civilians, including the use of precise aerial surveillance and additional intelligence. \n\nThe Hamas terrorist organization systematically violates international law, exploiting civilian structures and population as human shields for its terror attacks against the State of Israel.", "location": "GAZA STRIP", "classification": "security", "score": 0.9120280582595398, "event_breakdown": "* Event 1: IAF Strike on Terrorists in Central Gaza Strip (Al-Jaouni School area)\n\nTarget Event:\nIAF Strike on Terrorists in Central Gaza Strip (Al-Jaouni School area)"}, {"id": "a4ce8885-9147-434b-8e51-79da8c716bd1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30028/", "date": "2024-07-06 19:48", "message": "IDF: A short while ago, the IAF operated in the area of Baalbek to strike and eliminate the terrorist Meitham Mustafa Altaar, a key operative in Hezbollah's Aerial Defense Unit. \n\nMeitham led many of the unit's activities and took part in the planning and carrying out of numerous terror attacks against the State of Israel. \n\nMeitham also flew to Iran multiple times, where he gained knowledge and assisted in building up the Hezbollah terrorist organisation’s force and arsenal of Iranian weapons.\n\nHis elimination significantly harms the capabilities of Hezbollah's Aerial Defense Unit.", "location": "Israel", "classification": "security", "score": 0.8306467840466564, "event_breakdown": "Hezbollah's Aerial Defense Unit is part of the military wing of Hezbollah, an Iranian-backed Shia Islamist political party in Lebanon. It operates air defense systems and has a significant arsenal, including surface-to-air missiles.\n\nIDF: The Iranian-backed Shia Islamist political party Hezbollah's military wing operates air defense systems and has a significant arsenal, including surface-to-air missiles."}, {"id": "4d8c7598-df05-48fe-bbea-76b9542bcf6e", "channel_id": 1560386984, "url": "", "date": "2024-07-06 19:46", "message": "Hezbollah announces a death in its ranks:\n\nMeitham (and not Missam, as earlier publications indicated) al-Atar.\n\nHe was killed in a drone strike today on a vehicle 👆 in the village of Sha'at in Baalbek, deep in Lebanese territory.\n\nNumber 364", "location": "Baalbek", "classification": "security", "score": 0.8448596926863338, "event_breakdown": "Hezbollah announces a death in its ranks:\n\n* Hezbollah member Meitham al-Atar was killed in a drone strike on a vehicle in the village of Sha'at in Baalbek, Lebanon."}, {"id": "bbad77c0-13dd-48b5-9ae1-0ca98a2519ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb70239/", "date": "2024-07-06 17:06", "message": "The Saudi Al-Arabia network (which usually receives leaks from Western sources in this area) claims that the person killed in the vehicle attack in Baalbak is a Hezbollah operative named Missam al-Attar.", "location": "According to the text, it seems that the main location of the event is Baalbak.", "classification": "security", "score": 0.9079390102474222, "event_breakdown": "* Baalbak, Lebanon: A person was killed in a vehicle attack on June 4, 2022. The target was a Hezbollah operative named Missam al-Attar, according to the Al-Arabia network."}, {"id": "e35989c8-77fd-4109-b8c9-4839aed9b50d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30015/", "date": "2024-07-06 17:03", "message": "Lebanese channels report casualties from an Israeli drone attack on a vehicle in the area of ​​the village of Sha'at in Baalbek district in northern Lebanon.", "location": "BAALBECK", "classification": "security", "score": 0.9975312123034923, "event_breakdown": "Israeli drone strikes a vehicle in Lebanon's Baalbek district, causing casualties."}, {"id": "f42f5f25-fb45-4413-af46-9cc349d606e0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30014/", "date": "2024-07-06 17:02", "message": "According to Gaza sources - among the dead in the attack on Aljawani school in Nuseirat - Yaqub Majed Shahin, head of the investigation department of the Hamas police in the central Strip.", "location": "GAZA", "classification": "security", "score": 0.9726168375733418, "event_breakdown": "Target event: \"Gaza sources: Hamas police chief killed in Gaza school attack\"\nEvent: \"On Thursday, Gaza sources reported that Hamas police chief Yaqub Majed Shahin was killed in an attack on the Aljawani school in Nuserrat.\""}, {"id": "4ece8bef-f24b-45b7-9321-0f82ceb84c89", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30013/", "date": "2024-07-06 16:59", "message": "Nasrallah will give a speech in honor of Muhammad Nasser, commander of the Aziz unit, who was killed by the IDF in Tyre this Wednesday at 16:00.", "location": "TYR", "classification": "security", "score": 0.5006681941314608, "event_breakdown": "* A Hezbollah commander, Muhammad Nasser, was killed by the IDF in Tyre on Wednesday at 16:00.\n* Nasrallah will give a speech in honor of Muhammad Nasser, commander of the Aziz unit."}, {"id": "3fbed12e-39ea-48f8-85e5-8cde84a5ba56", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30012/", "date": "2024-07-06 16:58", "message": "The Palestinians report 14 deaths in an Israeli airstrike on Hamas police caravans at the entrance to the Aljawani elementary school in Nuseirat in the center of the Gaza Strip.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9790244874390388, "event_breakdown": "Israeli airstrike on Hamas police caravans at the entrance to Aljawani elementary school in Nuseirat in the center of the Gaza Strip."}, {"id": "9494e88d-122f-4d56-9cd1-f771a63ec88e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30001/", "date": "2024-07-06 12:57", "message": "The Hamas police in an official announcement:\nFars Abd al-Ael, Tel a-Sultan police chief in Rafah (equivalent rank to colonel) was killed along with three other police officers in the Israeli attack in the Saudi neighborhood 👆.", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.9950202574426235, "event_breakdown": "Hamas police:\n\nEvent Title: Israeli airstrike kills Hamas police chief in Rafah\n\nTime: 11:28 AM on Monday, August 7th, 2023\n\nLocation: Rafah, Gaza\n\nEvent Description: The Israeli Air Force attacked the Saudi neighborhood of Rafah, killing Fars Abd al-Ael, the police chief (equivalent rank to colonel) of Tel a-Sultan, and three police officers.\n\nImpact: The attack is part of a larger operation by the Israeli government to target leaders of the Hamas terrorist organization. The attack exacerbates the ongoing tensions between Israel and Hamas, leading to renewed rocket attacks and airstrikes between the two sides."}, {"id": "42e4fdd0-b540-4c32-a686-8e3dcf85950f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29998/", "date": "2024-07-06 11:00", "message": "The Palestinians report 23 deaths tonight, most of them as a result of three attacks in the center of the Strip:\n\n1. 10 casualties in the attack on the house of the Abu Shekhian family in Nuseirat (most of the casualties are from the Jahjoh family, including a journalist).\n\n2. Nine casualties in an attack on the house of the al-Khatib family in block C in Nuseirat's \"refugee camp\".\n\n3. Three casualties in an attack on a UNRWA warehouse in the al-Mughazi \"refugee camp\" in the center of the Gaza Strip (near the Salah a-Din road).\n\n##\nAdditionally, the Palestinians report on explosions in the past hour in areas where IDF forces are currently operating in Shejaiya in Gaza City (northern Gaza Strip) and in Rafah (southern Gaza Strip).", "location": ".\nThe main event takes place in the al-Mughazi \"refugee camp\" in the center of the Gaza Strip.", "classification": "security", "score": 0.996387098810113, "event_breakdown": "Relevant events:\n1. Attack on a house of the Abu Shekhian family in Nuseirat, resulting in 10 casualties.\n2. Attack on a house in block C in Nuseirat's \"refugee camp\", resulting in nine casualties.\n3. Attack on an UNRWA warehouse in the al-Mughazi \"refugee camp\", resulting in three casualties."}, {"id": "af232190-de63-43b5-9ce4-55be48388355", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29997/", "date": "2024-07-06 10:56", "message": "The Palestinians report 6 deaths among Hamas policemen in an attack by an Israeli aircraft, a little while ago, on a vehicle they were traveling in in the Saudi neighborhood (Tel al-Sultan area) in West Rafah.", "location": "RAFAH", "classification": "security", "score": 0.9803389178087735, "event_breakdown": "Israeli airstrike kills six Hamas policemen in Gaza.The attack occurred in the Tel al-Sultan area in the West Rafah district."}, {"id": "69715018-c65a-46e5-8d7d-fe978bc7e7f0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29994/", "date": "2024-07-06 10:54", "message": "IDF Spokesperson: Following the sirens that sounded at 8:14 in northern Israel, a suspicious aerial target that crossed from Lebanon was successfully intercepted by the IDF Aerial Defense Array. No injuries were reported. \n\nShortly after, additional sirens regarding a hostile aircraft infiltration sounded in the area. Two suspicious aerial targets that crossed from Lebanon fell in an open area in Beit Hillel. No injuries were reported.", "location": "Israel", "classification": "security", "score": 0.9928012652936629, "event_breakdown": "IDF Spokesperson: Following the sirens that sounded at 8:14 in northern Israel, a suspicious aerial target that crossed from Lebanon was successfully intercepted by the IDF Aerial Defense Array. No injuries were reported."}, {"id": "a0b34372-9cea-42cf-a08c-bf244b60941a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30035/", "date": "2024-07-06 20:16", "message": "Senior Hamas official Hassam Badran in an interview:\n\nAny step toward a future agreement will not be implemented until after a ceasefire.\n\nThe starting point from which we conduct the negotiations is the cessation of aggression on Gaza.", "location": "Gaza", "classification": "security", "score": 0.6447476764940512, "event_breakdown": "Any step toward a future agreement will not be implemented until after a ceasefire.\n\nThe starting point from which we conduct the negotiations is the cessation of aggression on Gaza."}, {"id": "f7d316d7-7db4-42db-bb8b-408a6bd8650f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30026/", "date": "2024-07-06 19:46", "message": "Meanwhile, in the city of Dakahlia in Egypt (north-east of Cairo)... parents of examinees in the matriculation exam in chemistry this morning are shouting the correct answers to the questions in the exam to their children...\n\nThere's nothing like mom and dad...\n\nThe Egyptian Ministry of Education canceled the exam following the video.", "location": "Dakahlia", "classification": "security", "score": 0.46149003041336933, "event_breakdown": "Dakahlia is a city located in Egypt, north-east of Cairo. On June 12, 2022, parents of examinees in the matriculation exam in chemistry shouted correct answers to their children from within the city. Following the video of this incident going viral, the Egyptian Ministry of Education canceled the exam on June 13, 2022."}, {"id": "7e9e79dc-44db-466a-8e02-2d5ba4692557", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30011/", "date": "2024-07-06 14:57", "message": "The Russian Ministry of Defense: We destroyed a battery of a Ukrainian S300 air defense system in the city of Poltava.", "location": "NULL", "classification": "security", "score": 0.8451851288748322, "event_breakdown": "The Russian Ministry of Defense: We destroyed a battery of a Ukrainian S300 air defense system in the city of Poltava."}, {"id": "1f238924-5a0a-4d05-9a6e-97b5936029cd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30003/", "date": "2024-07-06 14:55", "message": "Deputy Secretary General of the Islamic Jihad, Muhammad Alhindi:\n\nWe, in the resistance factions, estimate that favorable conditions have been created to drive the negotiation process especially in light of the fact that the occupation army is exhausted and has no other option to achieve achievements in the field and is ready for a deal at any cost.\nThe resistance presented ideas that do not conflict with the main goals of ending the aggression on Gaza and the complete withdrawal of Israeli forces from the Strip.", "location": "Gaza", "classification": "security", "score": 0.9653879928796245, "event_breakdown": "Event 1: Israeli airstrikes in the Gaza Strip\nEvent 2: Palestinian Islamic Jihad rocket attacks on Israel\nEvent 3: Israeli ground forces operation in the Gaza Strip\nEvent 4: Israeli naval operations off the coast of the Gaza Strip"}, {"id": "1d14f2b5-de30-49f6-a59d-67598ba49cf5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29993/", "date": "2024-07-06 10:52", "message": "Also from Chicago, on American Independence Day on the 4th of July: pro-Palestinian demonstrators set fire to the American flag in front of a Chicago police car.", "location": "Chicago", "classification": "security", "score": 0.9834074990109639, "event_breakdown": "Pro-Palestinian demonstrators burn American flag in Chicago on July 4th."}, {"id": "e34e07f4-1928-4633-b0e8-68efa5d2f313", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29988/", "date": "2024-07-06 10:50", "message": "Palestinian channels report: Hamas flag at an anti-Israel demonstration in Chicago.", "location": "CHICAGO", "classification": "security", "score": 0.9302491779202314, "event_breakdown": "Hamas flag at an anti-Israel demonstration in Chicago."}]