[{"id": "7913fece-dbc1-4b96-81d6-9954c4e2eed5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27754/", "date": "2024-05-24 09:51", "message": "The University Police officer at CUNY (City University of New York) responds to the ongoing bullying by Hamas supporters on campus who yell at him: \"you support genocide\"\nAnd tells them to their faces: \"I support that they kill all of you.\"", "location": "NULL", "classification": "antisemitism", "score": 0.41798512662363585, "event_breakdown": "Antisemitism Events:\n\n1. Ongoing bullying by Hamas supporters on CUNY campus\n2. Hamas supporters yelling at University Police officer at CUNY \"you support genocide\"\n3. University Police officer at CUNY responding \"I support that they kill all of you.\""}, {"id": "d887994e-2922-4705-88ab-c66042d581e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27753/", "date": "2024-05-24 09:51", "message": "USA: Hamas-supporting students demonstrated in front of the house of Nemat Shafik, the president of Columbia University in New York, protesting the police dispersal of the anti-Israeli and pro-Hamas protests on the university's campus.", "location": "NEW YORK", "classification": "antisemitism", "score": 0.458725308400868, "event_breakdown": "Antisemitism Events:\n\n1. Hamas-supporting students demonstrated in front of the house of Nemat Shafik, the president of Columbia University in New York.2. The protests were anti-Israeli and pro-Hamas."}, {"id": "f71dd475-7854-4932-b42e-c9feb652a6bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27782/", "date": "2024-05-24 21:02", "message": "Nasrallah: It was the war that led to the recognition of a Palestinian state. Not a process of political negotiation.\n\nThis evening, Nasrallah spoke for about an hour and a half at an event in honor of the president of Iran and the rest of the helicopter casualties. According to the original plan, he was supposed to give a speech tomorrow on the 24th anniversary of the Israeli withdrawal from Lebanon - which Hezbollah celebrates as Victory Day.\n\nAfter ranting for about an hour about the Iranian president, the Iranian foreign minister and Iran in general, as befits Iran's leading proxy, Nasrallah went on to deal with the war and Israel.\nI won't bore you with all his antics, but I will refer to three of the achievements of the current \"Tufan al-Aqsa\" war, as presented by Nasrallah through his unique rhetorical abilities:\n\n1. The issue of recognition of the Palestinian state.\nNasrallah emphasizes, in the central and most important point of his entire speech (at least in my opinion), that it was not the political path that ultimately led to the recognition of the Palestinian state, but the \"Tufan al-Aqsa\" war and the firm stand of the resistance.\nIn this context, he mentions the recognition of a Palestinian state by Ireland, Norway and Spain, as well as the vote at the United Nations in which 143 countries supported granting statehood to the Palestinian Authority.\n\nNasrallah actually says that there is no benefit in the process of political negotiations, the recognition of a Palestinian state comes through war and resistance.\n\n2. Increasing support for the Palestinians around the world.\nNasrallah explains that the demonstrations all over the world for the Palestinians, including in Western countries and universities abroad, came only because of the \"Tufan al-Aqsa\" war. According to him, the war opened the Western world to the Palestinians. This is the second major achievement that Nasrallah mentions in his speech.\n\n3. Israel is on trial in international courts\nNasrallah points out that thanks to the \"Tufan al-Aqsa\" Israel stands trial internationally (both at the International Court of Justice in The Hague and at the Criminal Court in The Hague - the ICC).\n\nBeyond the achievements of \"Tufan al-Aqsa\" that I detailed above, Nasrallah noted the miraculous impact of the videos coming from Gaza on social networks.\nAccording to him, what drives everything and causes the aforementioned achievements is the \"human emotion\". He explains, we are all human and the videos coming from Gaza on social networks cause the human emotion to identify with the Gazans, and it is the thing that brought about these unparalleled results.\n\n##\nNasrallah understands very well the power of social networks and impressively frames the achievements of \"Tufan al-Aqsa\" as I mentioned above. This framing is the compass that Nasrallah maps to the axis of resistance and it actually spurs the axis of resistance to continue on the path of war against Israel, as it leads to clear achievements.\nThe West plays into the hands of the axis of resistance and encourages it to continue to choose the path of terrorism.", "location": "Lebanon", "classification": "antisemitism", "score": 0.4588175694144924, "event_breakdown": "[Arson attack on an inner city Berlin synagogue on Tuesday, October 3, 2017, early in the morning (Grunewald street)]\n[Calls inside an Arson Attack on the Synagogue in Humboldt-Grunewald Alley]\n[Berlin - Police investigate an arson attack against a Jewish community center [...] during the Jewish holiday \"Hanukkah\". Some perpetrator acts in a politically loaded manner \"]]"}]