[{"id": "d65863e1-2a0f-4b07-89ae-5cebdfe9eff5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26875/", "date": "2024-05-08 07:14", "message": "The spokesperson for the Israeli Coordinator of Government Activities in the Territories:\n\nIn accordance with the directive of the Israeli government, the Kerem Shalom crossing was opened this morning for the entry of humanitarian aid into the Gaza Strip.\n\nWe emphasize that all humanitarian aid comes in after a careful security check by Land Crossings Authority security guards at the Ministry of Defense.\n\n\n###\nThe Biden administration is tying Israel's hands and preventing it from defeating Hamas.\n\nStrong American pressure on all fronts.", "location": "Gaza Strip", "classification": "security", "score": 0.8789561288270471, "event_breakdown": "1. Kerem Shalom crossing opened for entry of humanitarian aid into Gaza Strip.\n2. Humanitarian aid undergoes security check by Land Crossings Authority security guards at the Ministry of Defense.\n3. Biden administration exerting strong pressure on Israel."}, {"id": "c936dde7-0078-47d5-a5f3-829e90c4ce5d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26874/", "date": "2024-05-08 06:10", "message": "The Palestinian Authority this morning:\n\nThe Kerem Shalom crossing is still closed.\nThe Rafah crossing is closed to Palestinian passengers for the second day in a row.", "location": "The main location where the main event takes place is Kerem Shalom crossing.", "classification": "security", "score": 0.9142060613175274, "event_breakdown": "1. The Kerem Shalom crossing remains closed.\n2. The Rafah crossing is closed to Palestinian passengers for the second consecutive day."}, {"id": "9d6f23f9-b0cd-429b-9811-90aa3c646b90", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26871/", "date": "2024-05-08 06:06", "message": "Egypt: The newly-formed organization named after the Egyptian policeman Muhammad Salah, which accepted responsibility for the murder of the Israeli tourist yesterday in Egypt, published a photo, which looks like a frame taken from a video, allegedly showing the moment of the murder of the Israeli tourist (I blurred out the photo - AA).\n\nThe caption on the picture reads \"Hello from the children of Gaza\".", "location": "Gaza", "classification": "security", "score": 0.6057760145408754, "event_breakdown": "- Murder of an Israeli tourist in Egypt"}]