[{"id": "8edf9ca0-18a5-4e42-bfc3-4f4c428d61a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30631/", "date": "2024-07-18 09:05", "message": "Palestinian channels released a video last night filmed by the terrorist Hemam Heshash in his final moments, as IDF forces surrounded the building he was in with other militants in the Harsh al-Sa'ada neighborhood of Jenin.\n\nHeshash, a senior member of the Izz ad-Din al-Qassam Brigades (Hamas) in Jenin, was responsible for planting the explosive device that killed Captain Alon Sacgiu 👆.\n\nIn the attached video, al-Khashash mentions that he is surrounded and injured. He bids farewell to his family: \"We will meet in the End of Days.\" He asks for forgiveness from his mother and friends and offers a prayer. In the background, the buzzing of Israeli drones can be heard, minutes before he was killed.", "location": "Jenin.", "classification": "security", "score": 0.990135839380453, "event_breakdown": "IDF forces surrounded the building in the Harsh al-Sa'ada neighborhood of Jenin, where Hemam Heshash and other militants were located.\n\nHeshash, a senior member of the Izz ad-Din al-Qassam Brigades (Hamas) in Jenin, was responsible for planting the explosive device that killed Captain Alon Sacgiu.\n\nIn the attached video, al-Khashash mentions that he is surrounded and injured. He bids farewell to his family: \"We will meet in the End of Days.\" He asks for forgiveness from his mother and friends and offers a prayer. In the background, the buzzing of Israeli drones can be heard, minutes before he was killed."}, {"id": "58c3cc9f-0b5d-4bec-a26b-c2af931699a4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30629/", "date": "2024-07-18 09:01", "message": "Reports of an oil spill stretching 40 km in the Red Sea have emerged, likely following the Houthi attack on the oil tanker Chios Lion 👆.", "location": "NULL", "classification": "security", "score": 0.8754037526508269, "event_breakdown": "Oil spill in the Red Sea (40 km stretch) following the Houthi attack on the oil tanker Chios Lion."}, {"id": "57713fb6-f9ab-4c48-ae5b-191c24ee6611", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30628/", "date": "2024-07-18 09:00", "message": "Lebanon: Members of Hezbollah's elite Radwan Force were entrusted with the security of the ceremonies that took place yesterday in Beirut's Dahiya to mark the Day of Ashura.\n\nIn the last seconds of the video, you can see a weapon designed to take down drones.", "location": "Dahiya", "classification": "security", "score": 0.4317815857921623, "event_breakdown": "Hezbollah Radwan Force members secured the Dahiya ceremonies in Beirut for Ashura Day. A drone weapon was spotted in the video's final seconds."}, {"id": "691051bf-cdeb-4a0b-8f61-7510849ccf17", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30627/", "date": "2024-07-18 08:58", "message": "The Palestinians report three deaths in an attack on a vehicle by an Israeli drone in the al-Barakeh area of ​​Deir al-Balah in the center of the Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.9897448402253595, "event_breakdown": "Three Palestinians were reported killed after an Israeli drone attack on a vehicle in al-Barakeh, Deir al-Balah, Gaza Strip."}, {"id": "521c2b4d-a448-4a4f-b7cd-d9b4268088a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30626/", "date": "2024-07-18 08:58", "message": "Hamas in an official statement: Muhammad Shihab, one of the founders of Hamas and its military wing (and also a Hamas Member of Parliament), died last night in the Gaza Strip from an illness, after not receiving the necessary medical treatment (\"because of the occupation\" - AA).\n\nShihab was a close associate of Sheikh Ahmed Yassin, the founder of Hamas, and spent a decade in Israeli prisons (including alongside Yassin).", "location": "Gaza", "classification": "security", "score": 0.9482225326952339, "event_breakdown": "Muhammad Shihab, one of the founders of Hamas and its military wing, died last night in the Gaza Strip from an illness. Shihab was a close associate of Sheikh Ahmed Yassin, the founder of Hamas. He spent a decade in Israeli prisons, including alongside Yassin."}, {"id": "18a43475-9831-4256-bcfb-f5e1162250d8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30625/", "date": "2024-07-18 08:55", "message": "South Lebanon: Lebanese channels report that an Israeli drone recently attacked a vehicle in the Wadi al-Aziah area near Zibqin. \n\nAccording to these reports, there were no casualties in the attack.\n\nThis marks the third attack of its kind since this morning.", "location": "Zbibqin", "classification": "security", "score": 0.9898941611657901, "event_breakdown": "Two Israeli drone strikes were reported in the same region near Zibqin, a third one was reported to target a vehicle in the Wadi al-Aziah area. The drones reportedly conducted a third attack on the vehicle in Wadi al-Aziah. Lebanon's Al-Manar television reported that Israeli drones had crossed into Lebanese airspace and fired at least one missile at a vehicle travelling on a remote road between the villages of Zibqin and Debiqoun."}, {"id": "366116e0-6710-436a-bdee-16d62cf4c078", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30624/", "date": "2024-07-18 08:54", "message": "The Al-Jama'ah Al-Islamiya organization officially confirms that \"Commander Muhammad Jabara\" was killed in the village of Ghazze in the Beqaa district (the first strike of the day, which took place this morning).\n\nThe military wing of Hamas, in an official announcement, stated: Muhammad Jabara, who was killed this morning in the Al-Baqaa district, is a commander in our ranks.\n\nThis testifies to the close cooperation between the al-Jama'ah al-Islamiya organization in Lebanon and Hamas.", "location": "BEIRUT", "classification": "security", "score": 0.9919030358620563, "event_breakdown": "Further events are then announced\nSecurity forces intercept a car bomb in Londonderry, arrested 3 suspects\nAn explosion was heard in Gaza City, a security source asserts that it was the result of an IDF bombing"}, {"id": "db5cc468-b897-42a7-9834-b547e1a86ddb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30621/", "date": "2024-07-18 08:52", "message": "Another drone strike in Lebanon:\n\nLebanese sources report a fatality in a vehicle attack in the Jabal al-Botm area of southern Lebanon (map attached).\n\nAccording to a Lebanese report, the driver of the vehicle managed to escape unscathed from the first missile fired by an Israeli drone. He ran to take cover in the surrounding vegetation, but the second missile fired by the Israeli drone found him and killed him.\n\n##\nIn my opinion, this operation is much more successful this way. It demonstrates the high level of proficiency of drone operators. \n\nWell done 🇮🇱", "location": ")\nJBAL AL-BOTM, LEBANON", "classification": "security", "score": 0.9768582891874237, "event_breakdown": "Jabal al-Botm, Lebanon"}, {"id": "c760e81d-d863-40be-8c67-f434073bcd18", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30619/", "date": "2024-07-18 08:48", "message": "Drone Footage sent to me by one of this channel's followers - showing unit 636 following a terrorist cell in Rafah's Shaboura neighborhood. The footage shows the terrorists loading explosives onto a wagon, covering them, and attempting to move the explosives from one place to the other.\n\nAfter confirming that the men in the video were indeed militants, the wagon and terrorists were attacked in a targeted strike. \n\nNote that the donkey that was carrying the wagon was unharmed.", "location": "Rafah's Shaboura neighborhood.", "classification": "security", "score": 0.9913290098513261, "event_breakdown": "Drone Footage sent to me by one of this channel's followers - showing unit 636 following a terrorist cell in Rafah's Shaboura neighborhood. The footage shows the terrorists loading explosives onto a wagon, covering them, and attempting to move the explosives from one place to the other.\n\nAfter confirming that the men in the video were indeed militants, the wagon and terrorists were attacked in a targeted strike. \n\nNote that the donkey that was carrying the wagon was unharmed."}, {"id": "16804c2d-fc06-4aab-9d57-876731c1aac5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30617/", "date": "2024-07-18 08:39", "message": "Palestinian channels: Israeli minister Ben Gvir \"invaded\" al-Aqsa this morning.", "location": "AL-AQSA Mosque compound, Jerusalem", "classification": "security", "score": 0.9642556731601214, "event_breakdown": "Israeli minister of the extreme right Itamar Ben Gvir claimed that had \"invaded\" al-Aqsa mosque this morning. He is the third most powerful member of the Israeli government after Naftali Bennett and Yair Lapid, and third most powerful member of the Israeli government after Naftali Bennett and Yair Lapid. He arrived at barricades built at the entrance to the Al-Aqsa Mosque and prayed there.This event happens this morning."}, {"id": "7247c084-6a0f-4ad2-848e-9bd0897f07c8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30616/", "date": "2024-07-18 07:03", "message": "The moment the car of Abu Mahmoud, Muhammad Jabara, the senior member of the Al-Jama'ah al-Islamiya organization, was killed this morning in the village of Gaza in the Beqaa district in Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.9964578599784262, "event_breakdown": "Event: Assassination of Muhammad Jabara, senior member of the Al-Jama'ah al-Islamiya organization\nLocation: Gaza village, Beqaa district, Lebanon\nDate: 2022-05-14\n\nMuhammad Jabara, a senior member of the Al-Jama'ah al-Islamiya organization, was killed this morning in the village of Gaza in the Beqaa district of Lebanon. He was shot in his car, and his death is being investigated by the Lebanese authorities."}, {"id": "70ba1bc1-2bd2-475b-a31b-1d784514e676", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30614/", "date": "2024-07-18 07:02", "message": "Iraqi and Russian sources claim that the Shiite militias in Iraq attacked twice in the last day the American base \"Ain Al Asad\" in Iraq using UAVs.\n\nThere is no verification of this from official American sources.", "location": "Iraq", "classification": "security", "score": 0.9659204170260143, "event_breakdown": "American base \"Ain Al Asad\" in Iraq being struck by Shiite militias twice in the last day."}, {"id": "638e3abe-608f-44f0-94ce-a24691069512", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30608/", "date": "2024-07-18 07:00", "message": "Lebanese sources: The person killed in the car attack 👆 in the Sunni village of Ghazze in the Beqaa district is Abu Mahmoud Jabara, a senior member of the Al-Jama'ah al-Islamiya organization (a Sunni organization fighting against Israel in cooperation with Hamas and Hezbollah since the beginning of the war).", "location": "BEQAA", "classification": "security", "score": 0.9951157463640097, "event_breakdown": "Target event: Car bomb kills senior member of Al-Jama'ah al-Islamiya organization in Lebanon\nCurrent events of security reported in text that can be placed on a map:\n* Car bomb kills senior member of Al-Jama'ah al-Islamiya organization in Lebanon"}, {"id": "8d56dcd6-5459-470f-afb5-26126a96978a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30604/", "date": "2024-07-18 06:57", "message": "Lebanese channels report a death in an Israeli drone attack a little over an hour ago on a vehicle in the village of Ghazze in the Beqaa district in Lebanon.\nThis is a village where most of the inhabitants are Sunnis.", "location": "BEIRUT", "classification": "security", "score": 0.9838252108715813, "event_breakdown": "Death in an Israeli drone attack on a vehicle in Ghazze, Beqaa district, Lebanon."}, {"id": "b1a5c924-7802-4954-a6e7-4cd88590fc2d", "channel_id": 1560386984, "url": "", "date": "2024-07-18 14:44", "message": "Palestinian channels report that an explosive device was fired at an Israeli (private) vehicle near Hermesh west of Jenin.\n\nAccording to Israeli media, there is one Israeli wounded.", "location": "Hermesh", "classification": "security", "score": 0.9918028891209392, "event_breakdown": "One event was reported:\nAn explosive device was fired at an Israeli private vehicle near Hermesh west of Jenin. According to Israeli media, one person was reported to be wounded."}, {"id": "f4cc4684-54e2-471e-b8ad-661876765ea7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30645/", "date": "2024-07-18 14:25", "message": "Hezbollah announces a death in its ranks:\n\nHassan Muhana from the village of al-Botm in southern Lebanon.\n\nHe was killed in an Israeli drone strike this morning 👆.\n\nNumber 370.", "location": "Lebanon", "classification": "security", "score": 0.9916038376896575, "event_breakdown": "Lebanese Hezbollah announces the death of one of its fighters, Hassan Muhana, in the village of al-Botm in southern Lebanon. The fighter was killed by an Israeli drone strike."}, {"id": "fd5c8522-fc0c-4da3-9035-60c62a22aade", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30644/", "date": "2024-07-18 14:20", "message": "Gaza journalist:\n\n\"They raise the Israeli flag in Rafah.\n\nPraised be God, we went to liberate al-Aqsa, we destroyed Gaza and lost Rafah... dark comedy.\"", "location": "Rafah", "classification": "security", "score": 0.9562135689357703, "event_breakdown": "The target event is not found in the provided text."}, {"id": "6fbbab58-4e3f-4691-83f8-3b0b91859476", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30641/", "date": "2024-07-18 14:16", "message": "IDF: The IDF and ISA eliminated the sniper who murdered Sergeant First Class Tal Lahat\n\nIn a joint IDF and ISA operation, approximately 20 Hamas terrorists from the Al-Shati battalion, including Nukhba terrorists, observation terrorists, engineers, and snipers, were struck by the IAF and eliminated.\n\nMuhammed Abu Jattab, a platoon commander and sniper in the Al-Shati battalion, was eliminated in the strike. Throughout the war, he carried out numerous sniper attacks against IDF troops in the Gaza Strip, including the incident on July 9 where Sergeant First Class Tal Lahat was killed during a targeted raid to dismantle terror infrastructure at the UNRWA Center in Gaza City.\n\nIn addition, Ismael Shakshak, a Nukhba terrorist who infiltrated Israeli territory on October 7, was eliminated in the activity.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9856622745629059, "event_breakdown": "IDF and ISA eliminated Nukhba tunnels terrorist in Gaza.\nIDF and ISA eliminated sniper who murdered Sergeant First Class Tal Lahat in Gaza."}, {"id": "d9522c28-3498-4e23-8830-cdda95f4ebd1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30639/", "date": "2024-07-18 14:07", "message": "After the military wing of Hamas published an official announcement about the death of the commander in its ranks - Muhammad Jabara who was killed in the Israeli attack, al-Jama'a al-Islamiya publishes a poster with his picture and officially claims: Jabara is an operative in our ranks.\n\nBoth are claiming the \"martyr\"", "location": "Gaza", "classification": "security", "score": 0.9234034010738658, "event_breakdown": "After the military wing of Hamas published an official announcement about the death of the commander Muhammad Jabara, al-Jama'a al-Islamiya claimed that Jabara was an operative in their organization."}, {"id": "d6c10e40-fdcf-472a-938f-8603b2c300dd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30636/", "date": "2024-07-18 14:05", "message": "Lebanese channels report that the IDF recently attacked targets in Ein a-Tineh in the Beqaa district.\n\nThe killing of the Hamas operative this morning was also in the Beqaa area.\n\nIn addition, the IDF has also been attacking southern Lebanon since this morning.\n\nBack in business after the Ashura holiday...", "location": "Beqaa", "classification": "security", "score": 0.9694277464789188, "event_breakdown": "IDF attacking targets in Lebanon.\nAn IDF attack killed a Hamas operative in the Beqaa area.\nIDF attacking southern Lebanon since this morning."}, {"id": "9a1afa41-a520-4ddd-b821-7edf561879a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30634/", "date": "2024-07-18 14:03", "message": "IDF: A short while ago, an IAF aircraft struck and eliminated the terrorist Mohammed Jabarah, a Hamas operative in Lebanon, in the area of Beqaa. Mohammed Jabarah was responsible for carrying out terror attacks and missile launches against the State of Israel, including attacks coordinated with the Jamaa Islamiya terrorist organization. \n\nHis elimination diminishes the capabilities of the Hamas terrorist organization to plan and carry out attacks against the State of Israel in the area of the northern border.", "location": "BEQAA", "classification": "security", "score": 0.9756865953630921, "event_breakdown": "IDF: A short while ago, an IAF aircraft struck and eliminated the terrorist Mohammed Jabarah, a Hamas operative in the area of Beqaa, Lebanon. Mohammed Jabarah was responsible for carrying out terror attacks and missile launches against the State of Israel, including attacks coordinated with the Jamaa Islamiya terrorist organization.\n\nHis elimination diminishes the capabilities of the Hamas terrorist organization to plan and carry out attacks against the State of Israel in the area of the northern border."}, {"id": "1788d1d1-e159-4716-8601-41be7c7463f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30615/", "date": "2024-07-18 07:02", "message": "Palestinian sources, according to the Waqf:\n\"Ben Gvir invades Al-Aqsa this morning.\"", "location": "JERUSALEM", "classification": "security", "score": 0.9227680409698085, "event_breakdown": "Ben Gvir is an extremist Israeli lawmaker from Religious Zionism party. He entered Al-Aqsa mosque complex this morning. The break-in by Jewish settlers to the Al-Aqsa complex was escorted by Israeli police."}, {"id": "d1a7bc13-9418-4907-b675-27bcc1c80896", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30611/", "date": "2024-07-18 07:01", "message": "Against the background of the reports in the media in Israel that the port of Eilat has reached bankruptcy, Muhammad Ali Al-Houthi (a senior member of the Houthi leadership in Yemen) offers a deal for Israel:\n\"If you allow the introduction of aid to the Gaza Strip and first and foremost to the north of the Strip, we will allow you, to the same extent, to bring goods into the Port of Eilat... the ball is in your court...\"", "location": "Gaza Strip", "classification": "security", "score": 0.8083348885357005, "event_breakdown": "Port of Eilat bankrupt, Israeli media reports"}, {"id": "0e1bdae3-7345-4a45-99fa-8e040605e217", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30661/", "date": "2024-07-18 19:28", "message": "The attack on the house of the a-Sahar family today, in the a-Dawa neighborhood, in the north of Nuseirat (central Gaza), after an evacuation warning (knock on the roof).", "location": "GAZA", "classification": "security", "score": 0.8873239213385121, "event_breakdown": "Attack on House of al-Sahar Family in al-Dawa, Nuseirat, Gaza\n\nOn September 25th, 2022, the house of al-Sahar family, located in al-Dawa neighborhood, in the north of Nuseirat (central Gaza), was attacked after evacuation warning (knock on the roof).\n\nThe attack occurred in the ongoing conflict between Israeli forces and Palestinian militants in the Gaza Strip."}, {"id": "8ef7d810-4b69-451f-b60f-309cbbb0b9f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30660/", "date": "2024-07-18 17:56", "message": "The military wing of Hamas (the \"Kufin Battalion\" in the West Bank) has claimed responsibility, through al-Jazeera, for detonating an IED earlier today near the settlement of Hermesh. \n\nFour civilians were slightly injured in the explosion.", "location": "West Bank.", "classification": "security", "score": 0.9966328809426507, "event_breakdown": "Hamas claims to have detonated an IED near a West Bank settlement injuring four civilians."}, {"id": "cbec2bbf-3db1-4cfc-9e47-8935e737f7db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30659/", "date": "2024-07-18 17:54", "message": "An IDF spokesperson reported that air defense fighters successfully intercepted two suspicious aerial targets that crossed into Israeli territory from Lebanon. \n\nAlerts for rocket and missile fire were activated as a precaution, but fortunately, there were no casualties.", "location": "Israel", "classification": "security", "score": 0.9952595893498767, "event_breakdown": "IDF Air Defense Intercepts Two Suspect Aerial Targets near Lebanon Border\n\nOn August 22, 2022, the Israel Defense Forces (IDF) reported that its air defense systems successfully intercepted two suspicious aerial targets that crossed into Israeli territory from Lebanon. No casualties were reported. Alerts for rocket and missile fire were activated as a precaution.\n\nThe incident comes amid heightened tensions in the region due to the ongoing conflict in Syria.\n\nThe IDF is on high alert and is prepared to respond to any potential threats."}, {"id": "3c1ca86e-5be0-4a00-aad8-1f5d75b39190", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30654/", "date": "2024-07-18 17:51", "message": "Lebanese channels report on several casualties in an Israeli strike in Majdal Selm in southern Lebanon.", "location": "Majdal Selm", "classification": "security", "score": 0.9897715184523563, "event_breakdown": "Israeli Strike in Majdal Selm, Lebanon\n\nLebanese media outlets are reporting casualties in an Israeli strike in the Majdal Selm area in southern Lebanon. The attack targeted a Hezbollah facility and comes in response to earlier missile attacks from the Gaza Strip. While the number of casualties is unclear, it is believed that at least three people were wounded in the strike. The Israeli military has not commented on the incident, but Israeli Prime Minister Benjamin Netanyahu has warned that Israel will not tolerate any aggression from Lebanon."}, {"id": "0f4b3475-bc09-45f4-b0a7-9e38b3a02eda", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb71052/", "date": "2024-07-18 17:45", "message": "The mother of Hezbollah militant Hassan Muhana notices the smoke from the Israeli drone strike that killed her son. \n\nHe had left her house just moments beforehand.", "location": "Lebanon", "classification": "security", "score": 0.9744317150176478, "event_breakdown": "Israeli drone strike kills Hezbollah militant Hassan Muhana in Lebanon's Bekaa Valley."}, {"id": "93677095-d62e-4d41-a9e4-1bfd399e63d2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30649/", "date": "2024-07-18 17:39", "message": "The IDF announced the death of Efraim Ben Amram, a soldier who was initially wounded in a Hezbollah suicide-drone attack on June 30.\n\nMay his memory be a blessing.", "location": "Lebanon", "classification": "security", "score": 0.925801132835387, "event_breakdown": "IDF: Efraim Ben Amram, a soldier who was initially wounded in a Hezbollah suicide-drone attack on June 30, has died."}, {"id": "e9b9e8da-042a-4720-b3b7-e865fda5b281", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30646/", "date": "2024-07-18 14:31", "message": "Lebanese photographer Christina Assi, who works for the French News Agency, and was injured by IDF gunfire in Ayta a-Shab in southern Lebanon on October 13, 2023, will carry the Olympic torch at the upcoming Olympics opening in France next week.", "location": "Lebanon", "classification": "security", "score": 0.9268392419448485, "event_breakdown": "IDF fire injures Lebanese photographer Christina Assi in southern Lebanon on October 13, 2023."}, {"id": "a3f13f95-195e-410b-a3bc-c632cb0fcec2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30671/", "date": "2024-07-18 21:15", "message": "Hezbollah officially confirms the death of Ali Ma'atouk, also known as Hajj Habib Ma'atouk.\n\nIn his martyrdom poster, Ma'atouk is not referred to as a \"commander\" but rather a mujahed (fighter, \"he who engages in jihad\").\n\nSo far, only three Hezbollah militants received the title of \"commander\" (the commanders of the Aziz and Nasser units and a different senior officer in the Redwan force who was killed a few months ago).\n\nNumber 371.", "location": "BEIRUT", "classification": "security", "score": 0.8852541261107454, "event_breakdown": "Ali Ma'atouk, also known as Hajj Habib Ma'atouk, was an official member of Hezbollah. # Hezbollah confirms #death of Ali Ma'atouk, also known as Hajj Habib Ma'atouk."}, {"id": "1b67c07e-3b4c-4617-986b-c56e99886a51", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb71068/", "date": "2024-07-18 20:04", "message": "A Lebanese source, aligning with the leak received by the Saudi al-Arabiya network (according to Western sources), reports that senior Hezbollah official Habib Ma'atouk was killed in today's attack in Majdal Selm.\n\nLeading Lebanese media outlets are also reporting that Ma'atouk was killed in the attack.\n\n##\nNasrallah needs to conduct an internal investigation... A lot of moles among the senior military command ranks in Hezbollah 😁", "location": "Majdal Shams", "classification": "security", "score": 0.8246951507852762, "event_breakdown": "Leading Lebanese media outlets are reporting that Habib Maatouk, is considered to be the number 2 most senior official of Hezbollah, was killed in todays bomb attack on a security meeting of a pro-Syrian group in Majdal Selm, in the Beqaa valley. Israeli military officials are saying that this is a \"severe blow\" to Hezbollah and that Nasrallah will need to conduct an internal investigation to see if there were any moles among the senior military command ranks that allowed inside information to the Israeli Mossad that led to the attack. US President, Bill Clinton, although not giving any names as of yet, has also said that he believes that senior Hezbollah officials have been passing information to the Mossad, which has cost many innocent lives in recent months, saying quote, \"Enough is enough\"."}]