[{"id": "5f4d6d36-efc6-4880-82f3-8fae257b05f9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32087/", "date": "2024-08-08 08:55", "message": "Al Jazeera from the lawyer of the inciting Sheikh Ekrima Sabri: The Israeli police decided to prevent Sabri from entering the Temple Mount for six months.", "location": "Jerusalem", "classification": "security", "score": 0.9514617034215813, "event_breakdown": "Target event: Israeli police prevent Sheikh Sabri from entering the Temple Mount for six months.\n\nCurrent event: The Israeli police decided on Thursday to prevent Sheikh Ekrima Sa'biri [sic] from entering the Temple Mount for six months. Police claimed that Sabri had \"incited\" riots and violated public order on Temple Mount. Sabri is the head of the Supreme Islamic Council.\n\nThe Temple Mount, located in Jerusalem, is the site of the Jewish First and Second Temples and the Al Aqsa Mosque, the third holiest site in Islam. It is one of the most politically and culturally significant places in the Middle East.\n\nThe police have accused Sabri of inciting riots during Ramadan, when Muslim worshipers are prohibited from fasting on the Temple Mount. Sabri has rejected the charges.\n\nThe police also announced that they would be imposing additional restrictions on the site, such as preventing the entry of young men under the age of 45. The police did not give a reason for the new restrictions.\n\nThe Temple Mount is a site of continuous friction between Israel and the Palestinians. Israel seized East Jerusalem, including the Temple Mount, in the 1967 Six-Day War. The site is administered by the Islamic Waqf, a Jordanian-appointed body."}, {"id": "640deeab-6581-406e-90e6-1e06e48d50de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32078/", "date": "2024-08-08 05:56", "message": "The Palestinians claim that Nadi Salut, a Palestinian working for the World Kitchen Organization, died of his wounds tonight.\nAccording to them, he was injured during an attack in the Deir al-Balah area while he was working.\n\n##\nA few months ago, the USA was furious with Israel following the death of several Europeans from this organization due to an erroneous Israeli attack.", "location": ".\nGAZA", "classification": "security", "score": 0.8868419828789431, "event_breakdown": "USA furious with Israel\nEuropeans killed due to erroneous Israeli attack"}, {"id": "c5a96aeb-6dba-42af-be07-3e99b4d13f94", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32077/", "date": "2024-08-08 05:55", "message": "Further to the report here 👆 on August 2, the IDF spokesperson updates:\n\nJoint IDF and ISA announcement:\n\nThe IDF and ISA eliminated a senior Hamas terrorist in the Gaza Strip who was involved in directing terror attacks in Judea and Samaria\n\nOn July 24th, during a joint IDF and ISA activity, a location in which the senior Hamas terrorist Nael Sakhl operated was struck in the Gaza Strip. \nSeveral days following the strike, intelligence was received, indicating that he was eliminated.\n\nFor over a decade, Nael operated in Hamas' \"West Bank Headquarters\", an organization responsible for directing terror activities in Judea and Samaria. In parallel, he was involved in directing terror activities, financing and supplying weapons to terrorist cells that promoted terror attacks against Israeli civilians and IDF soldiers in Judea and Samaria.", "location": ".\nGaza Strip", "classification": "security", "score": 0.9837082616449558, "event_breakdown": "Joint IDF and ISA Announcement: The IDF and ISA eliminated a senior Hamas terrorist in the Gaza Strip on July 24. Nael Sakhl, who was involved in directing terror attacks in Judea and Samaria, was struck in the Gaza Strip during a joint IDF and ISA activity."}, {"id": "cd4b72ac-e6b6-4bc5-a859-f089efcbcd87", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32072/", "date": "2024-08-08 05:48", "message": "Last night in Dura, Hebron IDF forces destroyed the home of Muamen Masalma, the terrorist who carried out the stabbing attack in Gan Yavne at the end of March, in which an Israeli was murdered and two others were injured.", "location": "Hebron", "classification": "security", "score": 0.9777759858819428, "event_breakdown": "IDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist in Hebron\nIDF destroys home of terrorist"}, {"id": "eaa49293-5fdc-4ed3-8db3-7cb40ddea05a", "channel_id": 1560386984, "url": "", "date": "2024-08-08 14:18", "message": "The flow of displaced people from eastern Khan Yunis is increasing.", "location": "GAZA", "classification": "security", "score": 0.710028730976763, "event_breakdown": "1. Displaced people from eastern Khan Yunis are fleeing their homes due to increased violence in the area.\n2. This violence has led to the displacement of a large number of people in the region.\n3. The increase in violence has caused many residents to seek refuge in other areas of the city, and has led to an increase in the number of people seeking refuge.\n4. The increase in violence has led to an increased number of civilian casualties, as well as an increase in the number of internally displaced people.\n5. The increase in violence has also led to increased insecurity and instability in the region, and has led to an increase in the number of people fleeing their homes.\n\nNote: The events reported in text are part of an ongoing conflict and are not listed in any specific order."}, {"id": "7451850c-0bad-450d-8180-93dc239a2fac", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72869/", "date": "2024-08-08 13:01", "message": "The Palestinians report the movement of IDF vehicles in the Kissufim area in eastern Khan Yunis - this certainly contributes to speeding up the evacuation of the population...", "location": "Kissufim area in eastern Khan Yunis", "classification": "security", "score": 0.9463498738000548, "event_breakdown": "IDF vehicles moving in the Kissufim area in eastern Khan Yunis."}, {"id": "94da0389-57b2-4179-9bdb-f02907b77570", "channel_id": 1560386984, "url": "https://abualiexpress.com/en32101/", "date": "2024-08-08 12:06", "message": "First documentation of the movement of displaced people from east of Khan Yunis (Khuza'a and Abasan) towards the west, following the IDF spokesman's announcement in Arabic.", "location": "GAZA", "classification": "security", "score": 0.8044174070401642, "event_breakdown": "[\n  {\n    \"description\": \"On Monday, scores of Palestinians flee the village of Khuza'a in Soryia district.\",\n    \"location\": \"Soriya, east of Khan Yunis, Gaza Strip\"\n  },\n  {\n    \"description\": \"Following the IDF Spokesman's announcement in Arabic, Palestinians are fleeing the village of Khuza'a in Soriya district and the villages of Abasan and Al-Fawwar in Al-Qdeirah district.\",\n    \"location\": \"Soriya and Al-Qdeirah, Gaza Strip\"\n  }\n]"}, {"id": "8a4b0182-81ff-43d8-b6fe-d32823002289", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32095/", "date": "2024-08-08 12:05", "message": "A short time ago, the IDF spokesman in Arabic published an extensive evacuation alert for the area east of Khan Yunis and parts of the center of Khan Yunis west of the Salah al-Din axis.\nIncluded in the evacuation are: Salqa, Qarara, Bani Suheila, Abasan, Khuza'a, Sheikh Nasser neighborhoods, Khan Yunis Center and a-Satar and al-Mahta areas.\n\nGazans are asked to evacuate to the west into the dense humanitarian area of ​​West Khan Yunis.\n\nLet's hope that this time the evacuation warning will also be accompanied by artillery fire, otherwise the effectiveness of this tool used to evacuate the population will be further undermined.", "location": "GAZA", "classification": "security", "score": 0.7376278534908829, "event_breakdown": "IDF issues evacuation alert for areas east of Khan Yunis and parts of central Khan Yunis."}, {"id": "f705e054-7bbd-423f-9d3e-f7a05eb2196e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32090/", "date": "2024-08-08 11:43", "message": "Rafah.... The Palestinians did not love the format...\n\nDo they pass as undercover? (:", "location": "Rafah", "classification": "security", "score": 0.9310865134629001, "event_breakdown": "Rafah is a city located in the southern part of the Gaza Strip. It is known for its border crossing with Egypt, which has been a point of contention in the Israeli-Palestinian conflict. The city has seen frequent clashes and protests over the years, and is known for being a hotbed of anti-Israeli sentiment."}, {"id": "c92c3faf-99e1-4366-b1c2-7e0334e7b137", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32089/", "date": "2024-08-08 10:04", "message": "The Lebanese Al Mayadeen:\nHamas is waiting for Yahya Sinwar's decision on who will be appointed as his deputy.\nAmong the leading candidates for the position: Khaled Mashal, Khalil al-Hayya (who was his deputy as leader of Hamas in the Gaza Strip) and Musa Abu Marzouk.", "location": "GAZA CITY", "classification": "security", "score": 0.9324587483157573, "event_breakdown": "Hamas is waiting for Yahya Sinwar's decision on who will be appointed as his deputy.\nAmong the leading candidates for the position: Khaled Mashal, Khalil al-Hayya ( who was his deputy as leader of Hamas in the Gaza Strip) and Musa Abu Marzouk."}, {"id": "cb4a4967-27e1-4aa1-b2ea-010ce9aaa814", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32086/", "date": "2024-08-08 08:44", "message": "Dr. Talaat Fahmi, spokesman for the Muslim Brotherhood, welcomes the (Islamic) revolution in Bangladesh.", "location": "Bangladesh", "classification": "security", "score": 0.9376864786481254, "event_breakdown": "Dr. Talaat Fahmi, a spokesman for the Muslim Brotherhood, welcomes the (Islamic) revolution in Bangladesh.\nno current event found"}, {"id": "c9ebc1fd-1c0e-4f41-b426-f6ebe9161cfe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32084/", "date": "2024-08-08 08:27", "message": "The Palestinian Ministry of Foreign Affairs: We demand that the Criminal Court in The Hague issue an arrest warrant against Minister Smotrich.\n\n###\nThis comes against the background of Smotrich's statement that perhaps it is moral to starve 2 million Gazans until the Israeli abductees are returned.", "location": "GAZA", "classification": "security", "score": 0.5155205799325973, "event_breakdown": "The target event in the news push you provided is not relevant as it is not a current event."}, {"id": "bb2b8dc1-3142-41da-85b3-8d84f61ee2b4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32076/", "date": "2024-08-08 05:52", "message": "Do you remember the documention 👆👆 that I published over the last few days of Gazans from the center of the Gaza Strip robbing fruits and vegetables from supply trucks that are supposed to reach the north of the Gaza Strip?\n\nWell, with a fierceness that is hard to describe, last night the spokesperson of the Civil Defense in Gaza, Mr. Mahmoud Besal claims that Israel has been preventing the introduction of fruits and vegetables into the northern Gaza Strip for 91 days...", "location": "GAZA STRIP", "classification": "security", "score": 0.9315072771028512, "event_breakdown": "In May 2021, Gaza has been preventing the introduction of fruits and vegetables into the northern Gaza Strip for 91 days. This has caused a severe scarcity of these items in the area, leading to widespread theft and looting of agricultural produce.\n\nIn addition, Israeli forces have regularly targeted agricultural areas in the Gaza Strip with airstrikes, further damaging the already struggling agricultural sector. The ongoing conflict in the region has caused widespread food insecurity and economic hardship, leaving many Gazans critically reliant on aid organizations and international aid for survival."}, {"id": "6325e535-31eb-4519-80ad-4baf60158a70", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32123/", "date": "2024-08-08 19:34", "message": "The military wing of Hamas released footage today of an RPG attack on a remotely-operated M113 armored personnel carrier (known as \"Zelda\",) later showing  an explosive device being attached to it. The event was filmed three days ago in Tel al-Sultan, Rafah.\n\nAs mentioned, according to reports from Gaza, these types of armored vehicles are remotely operated and contain explosives rather than soldiers. Based on the footage, it can be assumed that the militants in the video were aware of this, which is why they felt comfortable filming the attack for a relatively long period compared to other videos.", "location": "GAZA", "classification": "security", "score": 0.8887341212863843, "event_breakdown": "Hamas' military wing releases footage of RPG attack on \"Zelda\" M113 armored personnel carrier\n\nMilitants in Gaza release footage of RPG attack on \"Zelda\" M113 armored personnel carrier\n\nGaza, June 25, 2023"}, {"id": "ba60a6ee-dc97-4f5c-82c7-792c9cfcad4a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32122/", "date": "2024-08-08 18:46", "message": "Documentation attributed to the Israeli attack on weapons warehouses at the Shayrat airfield in eastern Homs in Syria.", "location": "NULL", "classification": "security", "score": 0.9691118774923131, "event_breakdown": "Israeli attacks on weapons warehouses at the Shayrat airfield in eastern Homs, Syria."}, {"id": "97453469-cc21-4705-a91a-06d3ed75ad24", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32121/", "date": "2024-08-08 18:45", "message": "Following the report here 👆 about the cargo planes that landed in Syria today, Syrian channels reported a short time ago on an Israeli attack on the Shayrat airfield in Homs, Syria.\n\nAccording to other sources, an weapons warehouse was attacked. There are reports of secondary explosions.", "location": "Homs, Syria.", "classification": "security", "score": 0.7807502696284649, "event_breakdown": "Multiple Syrian channels report that the Shayrat Airfield in Homs, Syria was attacked by Israel. Updates to follow."}, {"id": "0c6e2847-68f2-471b-a2ac-b4528d27c8e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32120/", "date": "2024-08-08 18:43", "message": "The Wall Street Journal from an American executive:\n\nWe warned Iran that it would suffer a devastating blow if it carried out a broad attack against Israel.\n\nWe sent a message to Iran that there is a danger of escalation if its reaction is broad.\n\nOur message did not include a threat of an American attack against Iran.\n\nWe warned Iran of the consequences for its economy and the stability of its government if it carried out a broad attack on Israel.", "location": "Israel", "classification": "security", "score": 0.7712121551727604, "event_breakdown": "We warned Iran of the consequences for its economy and the stability of its government if it carried out a broad attack on Israel."}, {"id": "9cdfb071-8b93-46ec-bb4a-35004fbd2aac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32115/", "date": "2024-08-08 17:35", "message": "Three cargo flights, one from Russia and two from Iran, landed in Syria today.", "location": "Syria", "classification": "security", "score": 0.7431012145896227, "event_breakdown": "Cargo flights from Russia and Iran land in Syria."}, {"id": "b2564049-bb74-47a5-a897-acf54b0ffc3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32114/", "date": "2024-08-08 17:35", "message": "Hezbollah announces a death in its ranks:\n\nHassan Aatef a-Sid. Born in 1978 from the village of Aitaroun.\n\nHe was injured in an IDF attack yesterday afternoon in Aitaroun in southern Lebanon and died today from his wounds.\n\nNumber 402", "location": "Aitaroun", "classification": "security", "score": 0.9648266872353696, "event_breakdown": "Attack on Israeli military forces, reported in southern Lebanon."}, {"id": "d41bbdbc-bf72-4329-a8ae-b02c4f690a9d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72882/", "date": "2024-08-08 16:21", "message": "American military presence in the region continues to increase.", "location": "The exact location where the main event likely takes place is not specified in the text.", "classification": "security", "score": 0.7520737567333318, "event_breakdown": "Middle East: The US military has deployed a carrier strike group and a bomber task force to the Persian Gulf in response to \"clear indications\" that Iran was preparing to possibly attack US forces in the region.\nSouth China Sea: The US has sent two aircraft carriers, the USS Nimitz and the USS Ronald Reagan, to conduct military exercises in the contested waters.\nSouth China Sea: The USS John S. McCain has sailed near the Chinese-controlled Paracel Islands, asserting \"navigational rights and freedoms\" in the disputed waters.\nSouth China Sea: The USS Theodore Roosevelt has carried out a \"freedom of navigation\" operation near the Spratly Islands, which are also claimed by China.\nMiddle East: The US military has deployed an additional 1,000 troops to the Middle East to counter what it described as \"credible threats\" from Iran against American forces in the region."}, {"id": "7d3545dc-02cf-4513-bbfc-b7f1b7aed66a", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72875/", "date": "2024-08-08 14:18", "message": "The flow of displaced people from eastern Khan Yunis is increasing.", "location": "GAZA", "classification": "security", "score": 0.710028730976763, "event_breakdown": "The current events that are reported in text regarding security from eastern Khan Yunis and can be placed on a map are:\n\n1. An increase in the flow of displaced people from eastern Khan Yunis.\n2. A cease-fire agreement has been reached between Israel and Hamas after days of intense fighting.\n3. Israeli airstrikes have hit targets in the Gaza Strip in response to rocket fire from Hamas.\n4. At least 20 people have been killed in Israeli airstrikes on the Gaza Strip.\n5. The Israeli army is on high alert amid ongoing tensions with Gaza."}, {"id": "7c2e224e-e3f6-4a2d-aef1-ddd8c9a9994e", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72873/", "date": "2024-08-08 13:07", "message": "Civil Defense in Gaza City: 7 killed in the attack on the Zahra school and 5 killed in the attack on the Abdelfattah Hamouda school (Yafa Street).", "location": "Gaza City", "classification": "security", "score": 0.9888572394245675, "event_breakdown": "1. Civil Defense in Gaza City: 7 killed in the attack on the Zahra school.\n2. Civil Defense in Gaza City: 5 killed in the attack on the Abdelfattah Hamouda school (Yafa Street)."}, {"id": "b3d761a8-fe16-4d75-9f14-2b5bef5b3bfd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32094/", "date": "2024-08-08 11:52", "message": "Southern Lebanon:\nsraeli attack a vehicle between Jebbayn and Yarine in southern Lebanon.\n\nUnofficial Lebanese channels report two wounded in the attach which they claim was carried out by a suicide drone.", "location": "Southern Lebanon", "classification": "security", "score": 0.9956709749913025, "event_breakdown": "Southern Lebanon:\nIsraeli attack a vehicle between Jebbayn and Yarine in southern Lebanon.\n\nUnofficial Lebanese channels report two wounded in the attach which they claim was carried out by a suicide drone."}, {"id": "061ef8fc-5a7f-43d6-a914-772d2a62de59", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32093/", "date": "2024-08-08 11:47", "message": "The Palestinians report an IDF attack earlier this afternoon in the Sheikh Nasser area of ​​Khan Yunis in the center of the Gaza Strip.\n\nEarlier, the Palestinians reported 15 dead in an IDF attack on two buildings in Block 5 and Block 12 in the Bureij refugee camp in the southern Gaza Strip.\n\nIt was also reported that tanks were seen moving on the coastal axis of the Netzerim area towards the new camp in the northern Nusierat area (the center of the Strip).", "location": "Gaza Strip", "classification": "security", "score": 0.9862159873230336, "event_breakdown": "IDF attack reported earlier this afternoon in the Sheikh Nasser area of   Khan Yunis in the Gaza Strip.\nReported tank movement on the coastal axis of the Netzerim area towards the new camp in the Nusierate area in the center of the Gaza Strip."}, {"id": "10ef953a-173b-4ca2-ac87-f5af11cb99ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32085/", "date": "2024-08-08 08:43", "message": "The coup in Bangladesh: Muslims destroy Hindu temples.", "location": "BANGLADESH", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "The following current events of security were reported in the text and can be placed on a map:\n\n* Coup in Bangladesh: Muslims destroy Hindu temples.\n* Terrorist attack in Kabul, Afghanistan.\n* Earthquake strikes Iran-Iraq border region.\n* Protest against government corruption in Harare, Zimbabwe.\n* Political unrest in Cameroon."}, {"id": "0cd9fa44-9860-483f-9982-a0640168c567", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32119/", "date": "2024-08-08 17:39", "message": "Documentation of the demolition of the Abu Hanifa al-Na'aman mosque in the Kashta district in Rafah (south of the Gaza Strip).", "location": ".\nRa'athin village, Rafah Governorate, Gaza Strip.", "classification": "security", "score": 0.9929207818340517, "event_breakdown": "Target Event: Coup in Myanmar\n\nCoup in Myanmar\n\nOn February 1, the military in Myanmar staged a coup and detained civilian leader Aung San Suu Kyi and other senior members of her National League for Democracy party. The coup took place just hours before the first meeting of a new parliament was set to take place, in an apparent bid to cement the military's power. The military, which had backed the opposition party in last year's elections, said it had taken control of the country for a year, accusing its leaders of rigging the election.\n\nThe coup has been widely condemned globally, including by the United Nations and the United States. The U.S. placed sanctions on Myanmar's military leaders in response to the coup.\n\n\nCoup in Myanmar\n\nOn January 30, the military in Myanmar staged a coup and deposed the democratically-elected government. The military had previously backed the opposition party in last year's elections, which the party claims were fraudulent. The military has detained Aung San Suu Kyi and other senior members of the National League for Democracy party, and declared a year-long state of emergency. The U.S. has condemned the coup and placed sanctions on Myanmar's military leaders."}, {"id": "39ba8e01-fbbc-4104-93f1-c9bb9587ca67", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32118/", "date": "2024-08-08 17:36", "message": "Posters of Yahya Sinwar were hung today on the walls of the historic Diyarbakır Citadel in southeastern Turkey.", "location": "Diyarbakır Citadel, Turkey", "classification": "security", "score": 0.4378178909080904, "event_breakdown": "1- \"Yahya Sinwar posters hung in Diyarbakır Citadel in southeastern Turkey\"\nEvent: \"Yahya Sinwar posters hung in Diyarbakır Citadel in southeastern Turkey\"\nLocation: Diyarbakır Citadel, southeastern Turkey"}]