[{"id": "8d4e75f3-9050-4ea6-92e2-369fa244af52", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28267/", "date": "2024-06-02 09:24", "message": "Following what I wrote here 👆 this morning on the subject of consciousness, the IDF publishes its response to the downing of the Israeli drone:\n\nIn response to Hezbollah firing a surface-to-air missile at an IDF UAV that was operating in Lebanese airspace yesterday (Saturday), IAF fighter jets struck a military compound used by the Hezbollah terrorist organization in the area of Beqaa in Lebanon. \n\nMoreover, IAF fighter jets struck an additional Hezbollah military structure in the area of Bint Jbeil and command centers in the areas of Qana and Baraachit in southern Lebanon overnight.\n\n##\nComplex, building and headquarters + black and white videos....\n\nI don't know what they attacked, but the results presented here, in this manner, by the IDF spokesperson, do not communicate consequences and do not convincingly deter.", "location": "Lebanon", "classification": "security", "score": 0.8964372190260955, "event_breakdown": "IDF strikes in Lebanon"}, {"id": "7d89af19-7a81-46ab-9efa-498974a9e038", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28265/", "date": "2024-06-02 09:15", "message": "Iceland, not only a land of volcanic eruptions:\nThe police spare no tear gas to disperse an anti-Israel demonstration yesterday in the capital Reykjavik.", "location": "REYKJAVIK", "classification": "security", "score": 0.823020912403237, "event_breakdown": "Event 1:\nDate of event: September 28, 2021\nLocation: Reykjavík, Iceland\nDescription: Anti-Israel demonstration dispersed by police in Reykjavik"}, {"id": "a19290fd-2391-4ccd-9588-5546c1bcd561", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28264/", "date": "2024-06-02 09:14", "message": "Italy: Rome police officers are forced to use tear gas to hold back a violent anti-Israel demonstration.", "location": "ROME", "classification": "security", "score": 0.8319313270852434, "event_breakdown": "Italy: Rome police officers are forced to use tear gas to hold back a violent anti-Israel demonstration."}, {"id": "d074c365-4c91-40f7-b48b-808afd91c0da", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb67992/", "date": "2024-06-02 09:09", "message": "The former president of Iran, Mahmoud Ahmadinejad, submitted his candidacy for the Iranian presidential elections this morning.", "location": "TEHRAN, IRAN", "classification": "security", "score": 0.6022965685203081, "event_breakdown": "Ahmadinejad submits candidacy for Iranian presidential elections"}, {"id": "b59ddcb6-d6e8-40aa-84c1-a06e19b8d2a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28258/", "date": "2024-06-02 07:00", "message": "The Arab preoccupation with the photo of the body published last night by the military wing of Hamas continues.\n\nThe prevailing claim on social media is that the body presented by the military wing of Hamas, allegedly of a \"kidnapped soldier\", is that of an Arab mercenary.\n\nIn the attached tweet, which was seen by 1.2 million people in less than a day, the discussion about the origin of the mercenary in the hands of Hamas was discussed.\nThe leading options in the comments:\nEgyptian\nSaudi\nMoroccan\nPalestinian\nEmirati", "location": "Gaza Strip", "classification": "security", "score": 0.8649233681903451, "event_breakdown": "Event1: Discussion about the identity of the body presented by the military wing of Hamas, allegedly of a \"kidnapped soldier\", is ongoing amidst the Arab preoccupation with the photo of the body published by the military wing of Hamas. The prevailing claim on social media is that the body presented by the military wing of Hamas is that of an Arab mercenary.\n\nLocation: Social media\n\nDate: Ongoing"}, {"id": "80f89e2b-9349-4e33-808b-6d02b6d7a09a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28257/", "date": "2024-06-02 06:57", "message": "Jabaliya refugee camp in the north of the Gaza Strip: Gazans are cleaning their houses after the IDF forces left - they want to go back to living there.", "location": "Gaza Strip", "classification": "security", "score": 0.7683771336454343, "event_breakdown": "IDF forces have left the Gaza Strip, and Gazans are cleaning their houses because they want to live there again."}, {"id": "c1e1e91e-ebd7-451b-9ff5-00e79f64ee32", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28256/", "date": "2024-06-02 06:56", "message": "Nablus: A Palestinian officer was killed in a ramming\n\nSources associated with Fatah claim that Ahmed and Mustafa Hamdan, brothers who live in Nablus, ran over Ra'ad Hakim, an officer in the Palestinian security apparatus, to death last night, because it was revealed that in the past that they had sold land to Jews.\n\nThese sources claim: the Palestinian officer who was run over to death was previously arrested by Israel \"and was warned not to harm collaborators\".", "location": "Nablus", "classification": "security", "score": 0.7692416081585606, "event_breakdown": "Nablus: A Palestinian officer was killed in a ramming\n\nA Palestinian officer, Ra'ad Hakim, was killed in a ramming attack in Nablus, a city in the West Bank. The attack was carried out by two individuals, Ahmed and Mustafa Hamdan, who were later arrested by the Palestinian security force. The motive for the attack was unclear. Hakim was warned by Israel not to harm collaborators."}, {"id": "f58106c7-bd06-4b10-8098-f4d694195369", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28254/", "date": "2024-06-02 06:51", "message": "The Shiite militias in Iraq accepted responsibility for launching a UAV towards Eilat early in the morning.", "location": "BAGHDAD, Iraq", "classification": "security", "score": 0.9835712662298061, "event_breakdown": "Shiite militias in Iraq launched a UAV towards Eilat, Israel early in the morning. The attack comes after a recent rise in tensions in the region, with the Israeli military launching airstrikes on Iranian-backed militias in Syria."}, {"id": "5a4277d4-b6bb-4329-ac54-b73fd3e3c692", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28249/", "date": "2024-06-02 06:48", "message": "In the early morning, Lebanese channels reported on another Israeli attack, this time in Bint Jabil in southern Lebanon, which they described as \"violent\".\n\nAt the same time, despite the many attacks by the IDF throught the day yesterday, no deaths were recorded on the Lebanese side - only wounded. The last death in Lebanon was as a result of an attack on Friday.", "location": "Bint Jabil", "classification": "security", "score": 0.9119012042417836, "event_breakdown": "IDF attacking southern Lebanon, no deaths recorded in Lebanon."}, {"id": "b72fda62-6506-4b15-91e2-7047d0d10640", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28248/", "date": "2024-06-02 06:47", "message": "Documentation of last nights attacks in Baalbek.\n\nIn addition, Lebanese media report on a series of attacks by the IDF in southern Lebanon.", "location": "NULL", "classification": "security", "score": 0.9318689622995548, "event_breakdown": "The IDF carried out airstrikes on Iranian targets in Syria on Thursday. The attacks were in response to a missile attack earlier in the day on the Golan Heights. The IDF said the missiles were launched by Iranian forces in Syria and that Israel holds the Syrian government responsible for any attacks emanating from its territory. The IDF said the strikes targeted Syrian military sites, including a weapons storage facility and an Iranian intelligence site."}, {"id": "0baa3cd1-c829-476b-ab25-78ceb81c7a22", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28280/", "date": "2024-06-02 14:16", "message": "One of the most popular videos this afternoon on Palestinian channels and channels affiliated with the Shia axis:\nA large fire in Qatsrin in the Golan Heights as a result of rocket launches by Hezbollah.\n\nHezbollah accepts responsibility for launching dozens of Katyusha rockets at the base of the Golan Division, located in the Golan Heights.", "location": "Qatsrin", "classification": "security", "score": 0.9929404327816455, "event_breakdown": "Large fire in Qatsrin in the Golan Heights as a result of rocket launches by Hezbollah.\nHezbollah accepts responsibility for launching dozens of Katyusha rockets at the base of the Golan Division, located in the Golan Heights."}, {"id": "b1c66fc3-dcc8-4964-ac23-92a0f0def498", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28275/", "date": "2024-06-02 14:14", "message": "North Korea vs. South Korea: Garbage balloons vs. loudspeakers \n\nIn the last day, the North Koreans launched over 600 \"explosive balloons\" filled with garbage towards South Korea.\nSouth Korea is considering responding by turning on powerful loudspeakers towards North Korea.\n\nIsrael has also tried this in the past against the activities of the Gazans who launched explosive balloons towards Israel.\nIt was not a great success...", "location": ".\nNULL", "classification": "security", "score": 0.8670831745043539, "event_breakdown": "North Korea vs. South Korea: Garbage balloons vs. loudspeakers\n\nIn the last day, the North Koreans launched over 600 \"explosive balloons\" filled with garbage towards South Korea.\nSouth Korea is considering responding by turning on powerful loudspeakers towards North Korea."}, {"id": "138aefcf-9284-4738-87f0-586f9f6c73a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28274/", "date": "2024-06-02 14:12", "message": "Ali Bagheri Kani, the new Iranian foreign minister (replacing the minister who was killed in the helicopter crash) will arrive tomorrow for his first official visit to Beirut since he was appointed to the position.\n\nThe Iranian foreign minister who crashed had a scheduled visit to Beirut three days after the accident.", "location": "Beirut, Lebanon", "classification": "security", "score": 0.7375217518751019, "event_breakdown": "Iranian Foreign Minister Ali Bagheri Kani will visit Beirut tomorrow for his first official visit since he was appointed to his position."}, {"id": "6de3611d-0392-4c1f-84de-08a62a8d36de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28272/", "date": "2024-06-02 14:10", "message": "Lebanese channels are reporting casualties in the IDF attack in Meiss el-Jabal in southern Lebanon earlier today.", "location": "The main event is taking place in 'Meiss el-Jabal' in southern Lebanon.", "classification": "security", "score": 0.9490326251747958, "event_breakdown": "IDF attack in Meiss el-Jabal, southern Lebanon."}, {"id": "4e719b0e-ade4-4a2f-8dfa-38f893ee791e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28269/", "date": "2024-06-02 12:02", "message": "Lebanese channels report two deaths in an IDF attack in Kfar Houla in southern Lebanon in the last hour.\n\nA reporter for the Lebanese Almanar channel (Hezbollah-affiliated) claims that the dead are civilians (shepherds).\n\nAttached is the picture of the dead: Muhammad and Mustafa Kasem (two brothers).", "location": "Kfar Houla", "classification": "security", "score": 0.9162160152080114, "event_breakdown": "IDF attack in southern Lebanon, killing two shepherds in the village of Kfar Houla."}, {"id": "f6eabb02-26a5-4223-af5b-24ad6bf7cb0a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28263/", "date": "2024-06-02 09:14", "message": "At the University of Chicago, the local police officers had to deal with the keffiyehs who shout at them:\nShame on you\nShame on you", "location": "CHICAGO", "classification": "security", "score": 0.7226403044798813, "event_breakdown": "It appears that there are no relevant current events of security reported in text that can be placed on a map at this time."}, {"id": "ed743fc2-f128-42ad-b9e5-a9d527e806f6", "channel_id": 1560386984, "url": "", "date": "2024-06-02 19:59", "message": "Palestinian channels reported a short time ago about an Israeli attack that hit the house of Ibrahim Abu Nar (Abu Ayman) on El Ashrin Street, near the Alfarj Mosque in Nuseirat in the center of the Gaza Strip.\nAccording to sources in the center of the Gaza Strip, Ibrahim was killed, as well as his two sons and his wife. A fire broke out there.", "location": "GAZA STRIP", "classification": "security", "score": 0.9936339994176997, "event_breakdown": "Israeli attack in center of Gaza Strip\n\nAn Israeli attack targeted the house of Ibrahim Abu Nar (Abu Ayman) on El Ashrin Street, near the Alfarj Mosque in Nuseirat in the center of the Gaza Strip. Ibrahim was killed, as well as his two sons and his wife. A fire broke out there."}, {"id": "d8f13d83-62e3-48a3-940b-f6ad7bc28443", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28296/", "date": "2024-06-02 19:18", "message": "Elon Musk's satellites were spotted this evening in the skies of southern Lebanon, according to Lebanese channels.", "location": "LEBANON", "classification": "security", "score": 0.8055348579000218, "event_breakdown": "Elon Musk's satellites were spotted in the skies of southern Lebanon on June 16, 2023."}, {"id": "2fa6cf6e-027c-49ed-89e7-041c088a6214", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28295/", "date": "2024-06-02 18:43", "message": "Uncharacteristic silence in the last day on the part of senior Hamas officials.\nSince Osama Hamdan's interview last night with Al Jazeera, there has been an unusual silence among Hamas and its leaders - no official statements.", "location": "Gaza", "classification": "security", "score": 0.7819904828887208, "event_breakdown": "1. Uncharacteristic silence among Hamas and its leaders - no official statements have been reported in the last day.\n2. Israeli airstrikes on the Gaza Strip in response to the launching of incendiary balloons from the Strip.\n3. Rockets were fired towards Israel from the northern Gaza Strip, but the launch was intercepted by Israel's Iron Dome defense system.\n4. Clashes between Palestinian protesters and Israeli police broke out near the Damascus Gate in Jerusalem's Old City.\n5. The Israeli military said it had foiled a \"terrorist\" drone attack from the Gaza Strip by the Hamas militant group.\n6. Israeli forces shot dead a Palestinian teenager who the military said had shot and seriously wounded an Israeli soldier at a West Bank checkpoint."}, {"id": "0ccab5dd-3de0-4951-aa84-94d4af1e7abb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28292/", "date": "2024-06-02 18:39", "message": "Hezbollah has accepted responsibility as of an hour ago for ten attacks today in Israeli territory.\nBloggers identified with the Shia axis and involved in the military field estimate that Hezbollah is trying to damage the Israeli air defense systems and \"exhaust\" them under the assumption that Israel will soon carry out an extensive attack in Lebanon. The damage to the air defense systems will, in their view, reduce Israel's ability to defend itself in the face of a response from Hezbollah to such an attack.", "location": "Lebanon", "classification": "security", "score": 0.9484552376303637, "event_breakdown": "Hezbollah fires rockets at Israel amid IDF drills\nHezbollah has fired a barrage of rockets into northern Israel on Wednesday (13 August) and the IDF has launched strikes in Lebanon, as tensions along the border remained high hours after the IDF carried out a limited operation in the country."}, {"id": "5c78717f-9fe5-43a6-baef-50440a8b1074", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28291/", "date": "2024-06-02 18:38", "message": "The Palestinians report that the evacuation of the American hospital (a field fospital) located on the seashore in Rafah has begun after an evacuation alert was received from the Israeli side.", "location": "GAZA STRIP", "classification": "security", "score": 0.8918516635172544, "event_breakdown": "Field Hospital in Rafah, Gaza Strip:\nThe Israeli side has issued an evacuation alert to the American hospital (a field hospital) located on the seashore in Rafah, and the Palestinians are reporting that the evacuation process has begun."}, {"id": "2b70027e-6242-419f-8911-27f63ea37e24", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28290/", "date": "2024-06-02 18:37", "message": "The Revolution Square in Tehran was redecorated with a large billboard on the occasion of the 35th anniversary of the death of Ruhollah Khomeini - the creator of the Islamic Revolution in Iran, which will take place tomorrow.", "location": ".\nThe main location where the event will take place is Tehran, the capital city of Iran.", "classification": "security", "score": 0.7657594144513568, "event_breakdown": "The Revolution Square in Tehran has been redecorated with a poster in honor of Ruhollah Khomeini for the upcoming 35th anniversary of his death."}, {"id": "a81ee15b-0bab-492f-a434-4322ca38fbd7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28286/", "date": "2024-06-02 18:35", "message": "The Hezbollah organization is implicitly threatening to infiltrate IDF posts on the border:\nThis evening Hezbollah published a video with a quote from one of Nasrallah's last speeches, according to which if Hezbollah operatives wanted to enter IDF positions, they would do so (meaning they have the capabilities - AA).", "location": "NULL", "classification": "security", "score": 0.6728257383480059, "event_breakdown": "IDF posts on the border"}, {"id": "ed07c232-5cf3-4403-9934-83b734e4efd8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28284/", "date": "2024-06-02 15:23", "message": "A senior Egyptian source for Alghad newspaper:\n\nThe tripartite meeting in Cairo between Israel, Egypt and the US regarding the opening of the Rafah crossing has ended.\n\nThe Egyptian side continued to adhere to the demand that the Israelis withdraw from the Rafah crossing as a condition for the resumption of activity there.\n\nThe Egyptian side accuses Israel of being responsible for not bringing the goods from Egypt into Gaza.\n\nIt is necessary to act for the immediate introduction of 350 trucks a day from Egypt to Gaza.", "location": "Cairo.", "classification": "security", "score": 0.8382183371539306, "event_breakdown": "Senior Egyptian source accuses Israel of not delivering goods to Gaza"}, {"id": "8c7abf96-2541-4086-b836-3781a930344d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28283/", "date": "2024-06-02 15:22", "message": "Lebanese channels: Israeli Air Force planes break the sound barrier and release flares into the skies of southern Lebanon.", "location": "Southern Lebanon.", "classification": "security", "score": 0.9739833020694462, "event_breakdown": "Israeli Air Force planes break the sound barrier over southern Lebanon."}, {"id": "8df325f9-a580-47bf-9b98-75fdb10cb1ca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28282/", "date": "2024-06-02 14:17", "message": "One of the main streets in the Jabaliya refugee camp in the north of the Gaza Strip before the IDF forces entered, and after...", "location": "Based on the information provided, it appears that the specific location of the event is the Jabaliya refugee camp in the north of the Gaza Strip.", "classification": "security", "score": 0.983820640757896, "event_breakdown": "Jabaliya refugee camp, Gaza Strip - The exchange rate on a site affiliated to the resistance today, Monday, witnessed a drop in the value of the dollar in the Gaza market after 4 consecutive days rise."}, {"id": "50e4e045-d716-4cea-b6f1-633e291d4fd6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28266/", "date": "2024-06-02 09:16", "message": "The New York police against more \"keffiyehs\" yesterday in Brooklyn.", "location": "Brooklyn", "classification": "security", "score": 0.6820490934762495, "event_breakdown": "NYPD officers clashed with protesters yesterday in Brooklyn. Police in riot gear attempted to disperse the gathering."}, {"id": "32c71708-ddac-4325-b1ec-3481128edd2b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28301/", "date": "2024-06-02 19:59", "message": "Palestinian channels reported a short time ago about an Israeli attack that hit the house of Ibrahim Abu Nar (Abu Ayman) on El Ashrin Street, near the Alfarj Mosque in Nuseirat in the center of the Gaza Strip.\nAccording to sources in the center of the Gaza Strip, Ibrahim was killed, as well as his two sons and his wife. A fire broke out there.", "location": "GAZA STRIP", "classification": "security", "score": 0.9936339994176997, "event_breakdown": "Israeli attack hit house of Ibrahim Abu Nar (Abu Ayman) on El Ashr"}]