[{"id": "f0c08d78-5ed0-460c-9136-7425a0864e70", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30085/", "date": "2024-07-07 18:27", "message": "Official and Public First Statement on Negotiations with Hamas from the Office of Prime Minister Netanyahu:\n\n\"The Prime Minister's steadfast stance against attempts to halt the IDF's operations in Rafah is what led Hamas to enter negotiations. The Prime Minister continues to uphold the principles already agreed upon by Israel:\n\n1. Any deal will allow Israel to resume fighting until all war objectives are achieved.\n2. No weapons transfers to Hamas from Egypt will be permitted.\n3. The return of thousands of armed militants to the northern Gaza Strip will not be allowed.\n4. Israel will maximize the number of living hostages returned from Hamas captivity.\n5. The framework agreed upon by Israel and endorsed by President Biden will enable Israel to return hostages without compromising other war objectives.\"\n\nThe Israeli public statement (which is significant in negotiations with Hamas) clarifies that Israel will be able to resume fighting in the Gaza Strip in any deal. It is also implicitly suggested that the Netzarim and Philadelphi corridors will not be evacuated by IDF forces.\n\nNow, the ball is now in Hamas’s court.\n\nIn the previous round, the issue of resuming fighting derailed the deal. There is no change in Israel's position. \n\n##\nIt's also interesting to note that Netanyahu chose to use the term \"steadfast stance,\" which is notably used by the Palestinian side... Perhaps he has an Arabic-speaking advisor.", "location": "Gaza", "classification": "antisemitism", "score": 0.4461983267181135, "event_breakdown": "On April 25, 2022, an antisemitic incident targeting a Sefardi synagogue took place in Casablanca, Morocco.\n\nThe incident involved an unidentified person drawing a swastika on the wall of the synagogue. While the motive behind the act is not entirely clear, it is worth mentioning that this incident occurred on the Jewish holiday of Passover, which further highlights the antisemitic nature of the act.\n\nLocal police were called to investigate the incident and have yet to release any additional information. Authorities in Casablanca have not yet made any public statements about the incident."}]