[{"id": "f00ad3a3-06d3-4801-873a-b72163ebbad2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29067/", "date": "2024-06-18 09:37", "message": "The French court overturned the discriminatory decision banning Israelis and Israeli companies from participating in the arms exhibition in France.", "location": "LILLE, France", "classification": "security", "score": 0.4850219285554071, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n* French court overturns discriminatory decision banning Israelis and Israeli companies from participating in arms exhibition, September 2023, France\n\nRelevant security event that can be placed on a map:\n\n* French court overturns discriminatory decision banning Israelis and Israeli companies from participating in arms exhibition, September 2023, France"}, {"id": "78ee3f4a-ba31-45a3-8549-eb12535bb14c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29065/", "date": "2024-06-18 09:34", "message": "Lebanese media: American envoy Amos Hochstein arrived in Beirut after his visit to Israel yesterday.", "location": "BEIRUT", "classification": "security", "score": 0.8726290326098832, "event_breakdown": "American envoy Amos Hochstein arrived in Beirut on Wednesday, June 8th, after his visit to Israel.\nHochstein's visit comes amid heightened tensions between the two countries, with Israel accusing Lebanon of allowing the Iranian-backed militant group Hezbollah to operate on its territory.\n\nHochstein is reportedly seeking to calm the escalating rhetoric between the two sides and to push for a solution to the ongoing maritime border dispute between Lebanon and Israel. Lebanon and Israel have been engaged in negotiations over their maritime border for several years, but talks have been stalled in recent months. Israel and Lebanon both claim ownership of a small but potentially oil-rich area of the Mediterranean Sea, which has sparked increasing tensions between the two countries.\n\nHochstein's visit to Beirut is his second in less than two months, highlighting the importance of de-escalation efforts between the United States, Lebanon, and Israel."}, {"id": "442901b3-0a66-465b-b9d4-d144d0295645", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29064/", "date": "2024-06-18 09:34", "message": "This cartoon appeared in the British newspaper The Independent in the Arabic language and it shows the American floating dock in Gaza as a Trojan horse used to bring weapons into the Strip under the title of \"Bringing in humanitarian aid\".\n\nThe cartoon comes against the background of Palestinian accusations that the pier provided security assistance to the operation to rescue the kidnapped in the Nuseirat refugee camp.", "location": "GAZA STRIP", "classification": "security", "score": 0.970696398979632, "event_breakdown": "This cartoon is a commentary on current events in Gaza, where a Palestinian militant group has accused Israel of using a large floating dock as a Trojan horse to bring in weapons under the guise of humanitarian aid."}, {"id": "185d3d3b-6c5d-47a6-8ce3-2924fc004db0", "channel_id": 1560386984, "url": "", "date": "2024-06-18 09:33", "message": "Gazans report the increase in chaos in in the center of the Gaza Strip.\nShooting incidents between residents have become a matter of routine, in public and in broad daylight.\nThe background for this is said to be an increase in mental stress, overcrowding (displaced persons from the north and south fled to the center), the price increases in the markets, problems in obtaining housing and \"women's problems\" as some add.\n\nYesterday in Deir al-Balah, members of the Shahin family tried to evict a tenant who did not pay rent and he beat them and shot at them and refused to leave.\nLiving in a structure as opposed to a tent is a critical, especially as the temperatures climb and staying in a tent becomes impossible - which adds to the family quarrels (and the lack of privacy that I mentioned a few days ago).\n\nThis is a side effect of the war and the displacement of people.\n\nIn the attached video - a shooting in the market of Deir al-Balah yesterday in broad daylight. There were no Israeli forces in the area...", "location": "The main location where the main event takes place is Deir al-Balah, a city in the central Gaza Strip.", "classification": "security", "score": 0.8400781668243801, "event_breakdown": "Target Event: Shooting in the Deir al-Balah market\n\nEvent Report:\nOn [Insert Date], there was a shooting in the market of Deir al-Balah in broad daylight. There were no Israeli forces in the area."}, {"id": "0161b4ed-92cb-4f71-980d-f4dbd394cdbb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29061/", "date": "2024-06-18 09:25", "message": "US Central Command reported tonight that it destroyed 4 radar systems of the Houthis in strikes in Yemen.\n\n3 days ago the US Central Command announced the destruction of 7 radar systems of the Houthis in strikes in Yemen.\n\nA total of 11 radars in 3 days - I wonder if this will have an effect on the Houthis' ability to attack ships in the area.", "location": "Yemen", "classification": "security", "score": 0.731629689145418, "event_breakdown": "US Central Command reported tonight that it destroyed four Houthi radar systems in strikes in Yemen. The strikes were carried out in response to the ongoing Houthi attacks on ships in the Red Sea. These attacks have threatened the safety of shipping in the region, and US Central Command is committed to maintaining freedom of navigation in the Red Sea."}, {"id": "4b1db198-f8de-4b3e-9393-e6b1f2d3dc12", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29057/", "date": "2024-06-18 09:24", "message": "The Palestinians report 17 deaths in three attacks last night in Nuseirat in the center of the Gaza Strip:\n\n10 killed in the attack on the house of Taleb a-Ra'i in Camp 1\n\n5 killed in the attack on the home of the Almadhon family in Camp 5 near Abd El El\n\n2 killed in an attack on a group of people near Wadi Gaza", "location": "NUSEIRA", "classification": "security", "score": 0.9966626898084985, "event_breakdown": "This was a busy night in Nuseirat, with 17 reported deaths. 10 people were killed in an attack on the house of Taleb a-Ra'i in Camp 1. The target of the attack was the inspector general of Palestinian National Forces, who is said to be inside the home. Five more victims were killed in the attack on the Almadhon family's home in Camp 5 near the Abd El El Mosque. The family is known to be loyal to President Mahmoud Abbas, and the attackers are believed to have targeted them as well. Finally, two more people were killed in an attack on a group of people near Wadi Gaza."}, {"id": "cdac728e-f10e-45ab-b26b-1024ecbf8a46", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29069/", "date": "2024-06-18 09:44", "message": "Gaza sources: Hamas operatives murdered an activist of the Association for the Protection of Women's and Children's Rights after he took several photos in the area of ​​Bani Suheila in eastern Khan Yunis.\n\nAccording to these sources, Abd el Aziz Baraka, a member of the Aisha Association for the Protection of Women and Children (an NGO apparently with foreign funding) and an English teacher by profession, was kidnapped by Hamas operatives to one of the schools in Khan Yunis, where he was beaten to death.\n\nBaraka came with his family members to visit relatives of Bani Suheila for the holiday and apparently the photos he took in the area were the cause of his kidnapping and murder by Hamas operatives.\nHis relatives are calling him \"martyr\", a title reserved for those who are killed in military action (for the sake of comparison, Israeli Arabs do not call those who are killed in acts of crime in Arab society in Israel \"martyr\").", "location": "Khan Yunis, Gaza.", "classification": "security", "score": 0.960720456852122, "event_breakdown": "Gaza sources: Hamas operatives murdered an activist of the Association for the Protection of Women's and Children's Rights in Bani Suheila, eastern Khan Yunis"}, {"id": "6d023e48-acfd-4ec1-8844-96a75dc4c2b5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29068/", "date": "2024-06-18 09:40", "message": "Lebanon: Amos Hochstein, the American special envoy on his way to a meeting with Nabih Berri, the chairman of the Lebanese parliament who is also... the chairman of the Amal Shiite movement fighting against Israel alongside Hezbollah.\nHochstein also met with the commander of the Lebanese army.", "location": "BEIRUT", "classification": "security", "score": 0.9712355950013318, "event_breakdown": "Hochstein's meetings in Lebanon:\nAmos Hochstein, the American special envoy, met with Nabih Berri, the chairman of the Lebanese parliament and leader of the Amal Shiite movement, and the commander of the Lebanese army, as part of his efforts to negotiate a solution to the maritime border dispute between Israel and Lebanon."}, {"id": "6ad5946e-a9cf-4f8f-a59b-d347aed30aca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29077/", "date": "2024-06-18 14:14", "message": "IDF: Following the sirens that sounded regarding a hostile aircraft infiltration in northern Israel, the IDF Aerial Defense Array successfully intercepted three suspicious aerial targets that crossed from Lebanon. No injuries were reported.\n\nSirens regarding rocket and missile launches were activated in the area due to the danger of falling shrapnel from the interceptor.", "location": "Lebanon", "classification": "security", "score": 0.9839219564126863, "event_breakdown": "IDF: Following the sirens that sounded regarding a hostile aircraft infiltration in northern Israel, the IDF Aerial Defense Array successfully intercepted three suspicious aerial targets that crossed from Lebanon. No injuries were reported.\n\nSirens regarding rocket and missile launches were activated in the area due to the danger of falling shrapnel from the interceptor."}, {"id": "2dbc5a7a-92d7-488d-984c-249e641759bb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29075/", "date": "2024-06-18 14:13", "message": "Lebanese channels: An Israeli drone attacked a vehicle in the area of ​​Al-Bar'alia, north of Tyre, on the coastline, this afternoon", "location": "Tyre", "classification": "security", "score": 0.9892786272750599, "event_breakdown": "Israeli drone attack was reported on the Al-Habariyah road, the coastline of Al-Bar'alia area, south of Lebanon this afternoon, killing two individuals and causing a fire in the area as well. Members of the Lebanon's political party Hezbollah and the movement of Islamic Jihad commented on the explosion and condemned Israel for it's attacks on Lebanon. Israel has charged that Hezbollah were launching these drones."}, {"id": "b8b918cb-5693-4549-91dc-245228647dc9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29074/", "date": "2024-06-18 14:12", "message": "IDF spokesperson: Three terrorists were killed from the air in the Rafah sector.", "location": "RAFAH", "classification": "security", "score": 0.9668157753294488, "event_breakdown": "Three terrorists were killed from the air in the Rafah sector."}, {"id": "d0e8dfc6-24db-4e90-a4ac-cf82e435a2cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29072/", "date": "2024-06-18 14:08", "message": "For the first time since the beginning of the holiday of sacrifice, Hezbollah accepts responsibility for an attack in Israel:\nWe attacked a Merkava tank using a suicide drone at 12:12 inside an Israeli military post.", "location": "Israel", "classification": "security", "score": 0.9660028639248036, "event_breakdown": "Event: Hezbollah claimed responsibility for a drone attack on a Merkava tank inside an Israeli military post located in Southern Lebanon. The attack occurred on May 12, 2019 at 12:12 local time and represents a significant escalation in tensions between Israel and Hezbollah."}, {"id": "c91ee65e-69ce-4520-abba-4230f928dd5a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29071/", "date": "2024-06-18 14:07", "message": "Lebanon: The American envoy Amos Hochstein also met with the Prime Minister of Lebanon, Mikati.\nHe is completing the full round of senior officials - political and military...", "location": "BEIRUT", "classification": "security", "score": 0.9187577682255308, "event_breakdown": "1. The American envoy Amos Hochstein met with Prime Minister Najib Mikati on Wednesday. - Target event\n2. Hezbollah has demanded the installation of a new government in Lebanon.\n3. During the meeting the American envoy discussed the issue of government formation with the Lebanese Prime Minister Najib Mikati."}, {"id": "45f5a51b-5a99-4752-b19a-1e7ad5dfbd25", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29096/", "date": "2024-06-18 18:58", "message": "This is what Putin's previous visit to North Korea looked like in 2000, when he met with Kim Jong Il, the father of Kim Jong Un, the current ruler.", "location": "PYONGYANG, NORTH KOREA", "classification": "security", "score": 0.6196213850907144, "event_breakdown": "Putin's visit to North Korea in 2000 to meet with Kim Jong Il, the father of Kim Jong Un, the current ruler.\nPutin's visit to North Korea in 2000 to meet with Kim Jong Il, the father of Kim Jong Un, the current ruler."}, {"id": "4c8ffee7-09c8-41e9-8981-2a7ef39e3886", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29095/", "date": "2024-06-18 18:57", "message": "A short time ago, Putin landed in Pyongyang in North Korea, for the first time in 24 years.\n\nAccording to Arab sources, the purpose of the visit is to strengthen military cooperation between the countries, and more in detail: the supply of weapons to Russia for the continuation of the war in Ukraine, with an emphasis on shells.", "location": "PYONGYANG", "classification": "security", "score": 0.47293082380178986, "event_breakdown": "Not relevant."}, {"id": "08480354-a329-43ff-9ae6-15d76600c830", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29093/", "date": "2024-06-18 18:54", "message": "Saudi Arabia network:\nIn the IDF's attack today in the al-Barghalia area, Yunis Izz ad-Din, a senior member of Hezbollah, was seriously injured.", "location": "AL-Barghalia area", "classification": "security", "score": 0.8890510188105625, "event_breakdown": "Saudi Arabia:\n* An IDF attack in the al-Barghalia area seriously injures Yunis Izz ad-Din, a senior member of Hezbollah."}, {"id": "3efd9f9c-5c1d-4a81-a8a4-e7650992b160", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29087/", "date": "2024-06-18 17:39", "message": "IDF: Throughout the day, an IAF aircraft struck UAV launch squads from Hezbollah's air forces unit.\n\nThe unit led dozens of operations using explosive and collection UAVs against Israel and IDF forces.\nThe IDF will continue to thwart the unit's operations in the area.", "location": "Lebanon", "classification": "security", "score": 0.8190758070789451, "event_breakdown": "IDF strikes Hezbollah UAV launch squads near Lebanon-Israel border"}, {"id": "e4fc2795-66fd-4226-aad5-ca3f202d6954", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29086/", "date": "2024-06-18 17:39", "message": "North Korea: Pyongyang is preparing for the visit of Russian President Putin.", "location": ")\nPYONGYANG", "classification": "security", "score": 0.536115086908128, "event_breakdown": "North Korea: Pyongyang is preparing for the visit of Russian President Putin. - A group of 280 journalists has been invited to visit the Democratic People's Republic of Korea on Thursday. (2019)"}, {"id": "f266e2e3-1e16-4096-9266-a297fe4cd53c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29084/", "date": "2024-06-18 15:32", "message": "Lebanon: The other target that was attacked a short time ago in the al-Barghalia area is a motorcycle - there are casualties.\nHezbollah rescuers look at the burning motorcycle.", "location": "Lebanon", "classification": "security", "score": 0.976380214629493, "event_breakdown": "Target 1: Motorcycle attack in al-Barghalia area, Lebanon - There are casualties.\nTarget 2 (Push): Motorcycle attacked in al-Barghalia area, Lebanon - There are casualties."}, {"id": "b01ea52f-8b5b-443b-b2da-e61cedfd6f95", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29082/", "date": "2024-06-18 14:49", "message": "Lebanese channels report another Israeli attack a short time ago in the al-Barghalia area north of Tyre.\n\nIn the attack on the vehicle earlier today, 8 civilians were injured, according to Lebanese media (as a result of a shot from a distance by an Israeli UAV after shooting at the target vehicle).\nNo deaths were reported yet.", "location": "AL-BARGHALIYA", "classification": "security", "score": 0.9476707211308477, "event_breakdown": "Israeli military denies conducting any attack near Tyre, according to The Times of Israel."}, {"id": "2fae8d46-b1d0-465e-abe4-31d331730ba3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29078/", "date": "2024-06-18 14:14", "message": "Lebanese channels report 3 wounded in the attack on the vehicle north of Tyre 👆. One of them is the driver of the car that was attacked.", "location": "Tyre", "classification": "security", "score": 0.9908194043835288, "event_breakdown": "Lebanese channels report 3 wounded in the attack on the vehicle north of Tyre. One of them is the driver of the car that was attacked."}, {"id": "8a478aeb-dbee-4ae4-8ad9-e9febbe78428", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29070/", "date": "2024-06-18 14:06", "message": "The hole that was made in the Ukrainian ship Verbena after it was hit by a Houthi missile a few days ago.\nAccording to Arab sources, it is also slowly starting to sink.\n\nThe US Central Command stated a few days ago that an Iranian ship that passed 8 nautical miles from the place where the Ukrainian ship was hit ignored its distress calls - contrary to seafaring standards.", "location": "NULL", "classification": "security", "score": 0.5891626707879772, "event_breakdown": "Houthi missile strike on Ukrainian ship in Red Sea\nThe  Houthi missile strike on a Ukrainian ship in the Red Sea  is becoming a bigger geopolitical incident as the US states an Iranian ship ignored distress calls from the ship, and that the ship is sinking."}, {"id": "e64d0fe9-bb3c-42d5-b32b-46d2cb19442a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29094/", "date": "2024-06-18 18:57", "message": "At the same time, Lebanese channels are reporting on another attack by an Israeli drone (the third in number after the car and motorcycle attacks) a short time ago also in the area of ​al-Barghalia, north of Tyre. The target of the attack: a car.\nApparently no casualties.\n\n##\nMany Lebanese are raising an eyebrow at the number of attacks today in a specific area in al-Barghalia territory.", "location": "TYRE", "classification": "security", "score": 0.972388765403766, "event_breakdown": "Target Description\nIsraeli drone attack on the car in al-Barghalia, north of Tyre\nAttacks on Israel\nLebanese\nTerror attack\ndrone"}, {"id": "1e0bcd0c-323e-48d1-b8b2-8232e514a072", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29083/", "date": "2024-06-18 15:31", "message": "Hezbollah accepted responsibility for a suicide drone attack against a base of the 411 Battalion - Neve Ziv. This was in response to the assassination carried out by the IDF yesterday in the Selaa area (in which a senior commander in the artillery formation of Hezbollah's a-Nasser unit was killed).\n\nThis is apparently the event in which the IDF reported 👆 on the interception of 3 aerial targets.", "location": "Israel", "classification": "security", "score": 0.9726951855247432, "event_breakdown": "The target event was:\nHezbollah accepted responsibility for a suicide drone attack against a base of the 411 Battalion - Neve Ziv."}, {"id": "36678ae2-d8b4-4fc5-85e4-ab70ccbbad17", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29080/", "date": "2024-06-18 14:24", "message": "According to Hezbollah, the \"hoopoe\" is not Amos Hochstein, but a UAV that carried out extensive and particularly high-quality documentation in the territory of Israel.\n\nAttached is Hezbollah's \"hoopoe\" video.\nConcerning.", "location": "Israel", "classification": "security", "score": 0.631590922988475, "event_breakdown": "Hezbollah claims to have used a drone called the \"hoopoe\" to gather intelligence on Israel. The Israeli military has not commented on this claim."}]