[{"id": "c7e008da-7851-48ce-ade1-e4f343a795e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26702/", "date": "2024-05-05 13:48", "message": "Hezbollah in an official announcement:\n\nWe launched dozens of Katyushas at Israel's artillery batteries in the Zaoura area (in the territory of Israel-AA) in response to the attack in Meiss el-Jabal in which civilians were killed and wounded.\n\n##\nIsraeli media report 65 rockets fired from southern Lebanon towards Israel in the last volley.", "location": "The main location where the main event takes place is \"Zaoura area,\" which is in Israel.", "classification": "security", "score": 0.9900671289197039, "event_breakdown": "- Hezbollah launched dozens of Katyushas at Israel's artillery batteries in the Zaoura area (in the territory of Israel-AA) in response to the attack in Meiss el-Jabal where civilians were killed and wounded.\n- Israeli media reported 65 rockets fired from southern Lebanon towards Israel in the last volley."}, {"id": "2ac34709-94bd-4271-a88c-aebeb1858f1a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26700/", "date": "2024-05-05 12:59", "message": "The IDF: The Kerem Shalom crossing has been closed to truck crossing.\n\n##\nHamas bites the hand that feeds them and shoot at the place that brings them goods.\n\nThe Palestinians report air force attacks in the al-Salam neighborhood in East Rafah.", "location": "Rafah", "classification": "security", "score": 0.9868789289955291, "event_breakdown": "The events in the text are:\n\n1. The Kerem Shalom crossing has been closed to truck crossings (location: Kerem Shalom crossing).\n2. Hamas shoots at the location where goods are brought (location: Kerem Shalom crossing).\n3. Air force attacks reported in the al-Salam neighborhood in East Rafah (location: al-Salam neighborhood, East Rafah)."}, {"id": "d42d5744-93e1-4c6e-b737-58905f4c9605", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26699/", "date": "2024-05-05 12:57", "message": "Channels identified by Fatah:\n\nThe firing of Hamas from Rafah towards Kerem Shalom gave Israel justification for the action in Rafah, saved them, and gave them a way out in the eyes of the whole world. How stupid is Hamas.", "location": "Rafah", "classification": "security", "score": 0.8645762385475463, "event_breakdown": "1. Hamas fires from Rafah towards Kerem Shalom.\n2. Israel takes action in Rafah in response to Hamas firing.\n3. Israel justifies its actions in Rafah.\n4. The incident helps Israel in the eyes of the international community."}, {"id": "f855796c-c523-4f83-8971-28cff677490d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26698/", "date": "2024-05-05 12:56", "message": "Israeli media reports on Israeli casualties in Kerem Shalom as a result of falling explosives.\n\nAt 13:41, the military wing of Hamas accepted responsibility for launching short-range rockets of the \"Rajum\" type with a diameter of 114 mm towards assembly areas in Kerem Shalom.\n\n##\nKerem Shalom is very close to Rafah.", "location": "Kerem Shalom", "classification": "security", "score": 0.9874250957946622, "event_breakdown": "- Israeli casualties reported in Kerem Shalom as a result of falling explosives.\n- The military wing of Hamas accepts responsibility for launching short-range rockets towards assembly areas in Kerem Shalom."}, {"id": "7599289a-e07d-4d2e-848c-77632356af9a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26694/", "date": "2024-05-05 11:08", "message": "Lebanese channels: The number of civilians killed in the IDF attack in Meiss Ej Jabal in southern Lebanon has risen to four. The four are reportedly members of the same family (father, mother and their two children).\n\nHezbollah in an official announcement:\nWe attacked Kiryat Shmona with dozens of Katyusha and Flak type rockets, in response to the killing and wounding of the civilians in  Meiss Ej Jabal.\n\nIsrael's Magen David Adom reports that a 65-year-old man was lightly injured from the rocket fire, and that an ambulance was also damaged.", "location": "Kiryat Shmona", "classification": "security", "score": 0.9991968429482292, "event_breakdown": "- IDF attack in Meiss Ej Jabal, southern Lebanon\n- Killing of four civilians in Meiss Ej Jabal\n- Hezbollah attack on Kiryat Shmona with Katyusha and Flak rockets\n- Light injury of a 65-year-old man in Kiryat Shmona from rocket fire\n- Damage to an ambulance in Kiryat Shmona from rocket fire"}, {"id": "71fb7242-7ad0-4864-974e-b1b4ba314f92", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26693/", "date": "2024-05-05 11:04", "message": "Al-Jazeera reports that its offices in Israel have just been closed:\n\nFinally, the Israeli government decided to shut down the Al-Jazeera's offices in Israel - a propaganda channel, owned by the rulers of Qatar, masquerading as a legitimate news network.\n\nGood riddance...", "location": "Jerusalem", "classification": "security", "score": 0.8886573442292728, "event_breakdown": "- Al-Jazeera offices in Israel closed by the Israeli government"}, {"id": "134f1115-89a7-4d84-a2fe-4ffca93f0f19", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26692/", "date": "2024-05-05 11:01", "message": "Israel Police publishes CCTV footage of an arrest of a Palestinian woman who pulled a knife on police officers in the Old City of Jerusalem.\n\nNo officers were injured in the incident, and neither was the Palestinian woman.\n\n##\nI wonder how this situation would've ended for the woman in any of the Arab or Western countries...", "location": "Jerusalem", "classification": "security", "score": 0.9735874257227601, "event_breakdown": "1. Israel Police publishes CCTV footage of a Palestinian woman pulling a knife on police officers in the Old City of Jerusalem.\n2. No officers were injured during the incident.\n3. The Palestinian woman involved in the altercation was unharmed."}, {"id": "40159428-916a-4a16-b834-c8fd4a0a6b00", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26691/", "date": "2024-05-05 08:32", "message": "Lebanese sources update that three people were killed in the latest attack on Meiss Ej Jabal 👆, and report that another person was injured.", "location": "The main location where the main event takes place is \"Meiss Ej Jabal.\"", "classification": "security", "score": 0.9654846051668978, "event_breakdown": "- Attack on Meiss Ej Jabal: Three people killed, one injured"}, {"id": "799d908b-f63d-4838-8ff6-d7057646709d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26690/", "date": "2024-05-05 08:12", "message": "The IDF and Israeli Shit Bet announce that senior Islamic Jihad commander Aiman Zaarab was killed in a targeted strike,\n\nAccording to the announcement, Zaarab took part in the Oct. 7th attacks, and lead terrorist from the PIJ's elite Nukhba Force in their attack on the Kibbutz of Sufa and a neighboring military outpost.", "location": "Sufa", "classification": "security", "score": 0.9804161595100885, "event_breakdown": "- Aiman Zaarab, senior Islamic Jihad commander, killed in a targeted strike by the IDF and Israeli Shit Bet\n- Zaarab took part in the Oct. 7th attacks and led the terrorist attack on the Kibbutz of Sufa and a neighboring military outpost"}, {"id": "29e4f035-c608-420e-bf3a-34f9ddc396c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26689/", "date": "2024-05-05 08:09", "message": "The Lebanese report a number of wounded in an Israeli attack in Meiss Ej Jabal in southern Lebanon, which took place about an hour ago.", "location": "Meiss Ej Jabal", "classification": "security", "score": 0.9757043804391585, "event_breakdown": "- Israeli attack reported in Meiss Ej Jabal, southern Lebanon\n- Lebanese report a number of wounded in the attack"}, {"id": "bcc7fec5-e2c6-424b-9931-ffa29d70af0f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26688/", "date": "2024-05-05 08:07", "message": "The Palestinians report: an Apache helicopter attacked targets in Rafah in the southern Gaza Strip this morning.", "location": "Rafah", "classification": "security", "score": 0.9904248373796724, "event_breakdown": "- Apache helicopter attack on targets in Rafah, southern Gaza Strip"}, {"id": "d057f396-b320-461e-b9ce-49db294e717e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26687/", "date": "2024-05-05 08:06", "message": "Hezbollah's answer to the French proposal\n\nSources report that tomorrow morning Nabih Berri, the Speaker of the Lebanese Parliament (and the head of the Shiite Amal movement, fighting against Israel alongside Hezbollah) is expected to deliver Hezbollah's and the Amal movement's response to the French proposal for a cease-fire with Israel.\n\nAccording to Arab sources, the answer is likely to be that Lebanon is bound by UN Resolution 1701 and that the document will be the basis for negotiations after there is a ceasefire in Gaza.\n\n###\n\nResolution 1701, which ended the Second Lebanon War, spoke of 15,000 armed UNIFIL soldiers with powers south of Litani river, tasked with preventing the introduction of weapons and the presence of Hezbollah militants in the area - which were both violated. If Resolution 1701 had been enforced, we would not have reached the situation we are in today, with a massive deployment of Hezbollah in the south to the Litani.\n\nThe current situation shows how invaluable such agreements are - they shouldn't be taken seriously as they do not hold water.\n\nI suggest that France and the US, who are so keen on ending the fighting in Lebanon with a diplomatic solution, put themselves as guarantors to any new ceasefire agreement - so that any violation of the agreement will be met with with a French or American aerial strike. \n\nI wonder if they'd be willing to agree to this.", "location": "The main location where the main event takes place is \"Lebanon.\"", "classification": "security", "score": 0.9300229810162296, "event_breakdown": "- Hezbollah's response to the French proposal delivered by Nabih Berri\n- Mention of UN Resolution 1701 as the basis for negotiations after a ceasefire in Gaza\n- Criticism of the lack of enforcement of Resolution 1701 leading to the current situation\n- Suggestion for France and the US to be guarantors of a new ceasefire agreement with threat of aerial strikes for violations"}, {"id": "9357cf53-1a6f-4c38-b25a-4eb6bf2a9e6c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "The Shiite militias in Iraq claim to have attacked the Israeli port of Haifa yesterday evening with a cruise missile.", "location": "", "classification": "security", "score": 0.9938263803343869, "event_breakdown": "The Shiite militias in Iraq claim to have attacked the Israeli port of Haifa with a cruise missile yesterday evening."}, {"id": "acc9d1b2-3661-473c-b6dc-550e988acbdf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "University of Virginia, US:\n\nPolice officers armed with transparent plastic shields slowly advance in a single line towards anti-Israeli protesters armed with umbrellas, chanting \"shame, shame\".\n\n##\nLike a medieval battle...", "location": "", "classification": "security", "score": 0.9091059072642654, "event_breakdown": ""}, {"id": "328a8e7b-58ca-43b8-aa2c-e7d43423b7d1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26683/", "date": "2024-05-05 02:31", "message": "The follower Ben Tzion Macales points out that in the past week you can see in satellite images a new road that was broken (by IDF forces) in the area of ​​the Kerem Shalom crossing (near Rafah).\n\nGetting ready for Rafah...", "location": "", "classification": "security", "score": 0.8487874688356394, "event_breakdown": "- New road broken by IDF forces near Kerem Shalom crossing (near Rafah)"}, {"id": "0af1ffe4-e343-4081-9f88-71a56e3492cd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26681/", "date": "2024-05-05 00:04", "message": "USA: The police of Wisconsin do not make exceptions for academic staff: Samir Elatot, professor of sociology at the University of Wisconsin was arrested after taking an (over) active part in anti-Israel demonstrations.", "location": "", "classification": "security", "score": 0.3495209627959089, "event_breakdown": "- Arrest of Samir Elatot: Professor of sociology at the University of Wisconsin arrested for participating in anti-Israel demonstrations"}, {"id": "257708c5-8061-457d-b4b2-d9a17692646d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26678/", "date": "2024-05-04 17:47", "message": "Palestinian channels report: The IDF attacked the home of the prominent journalist in the Gaza Strip, Hassan Aslih (Hamas-affiliated) in the Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip.\nThere were no casualties in the attack.", "location": "Khan Yunis", "classification": "security", "score": 0.9953827602700771, "event_breakdown": "- IDF attack on the home of journalist Hassan Aslih in Manara neighborhood, Khan Yunis, Gaza Strip"}, {"id": "68eed716-6903-4bb8-93a3-f3c796daf55c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26677/", "date": "2024-05-04 17:31", "message": "Palestinian channels: The Palestinian Authority's security mechanisms detonated, in a controlled manner, explosive devices they located in Tubas (Northeastern Samaria).", "location": "The main location where the main event takes place is \"Tubas\" in Northeastern Samaria.", "classification": "security", "score": 0.9948419961865298, "event_breakdown": "- Controlled detonation of explosive devices located in Tubas by the Palestinian Authority's security mechanisms"}, {"id": "7fc8765e-9646-4b89-9a3c-6eca30802e79", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26676/", "date": "2024-05-04 17:20", "message": "Hamas-identified channels: All four killed (whose names have been published) 👆 in the IDF's activity in the village of Deir al-Ghusun in the north of Tulkarm, were operatives of the military wing of Hamas.\nAlaa Sharitah was the commander of the military wing of Hamas in Tulkarm.", "location": "", "classification": "security", "score": 0.9934812200416727, "event_breakdown": "null"}, {"id": "873c3ebc-9d8c-446c-ad2a-a93903e4638b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26675/", "date": "2024-05-04 17:19", "message": "Further to this👆\nA joint statement to the IDF spokesperson, the police spokesperson and the Shin Bet spokesperson:\n\nThe soldiers of Yamam, the IDF and the Shin Bet eliminated five terrorists who had barricaded themselves in a building in Tulkarm in a 12-hour battle\n\nThe soldiers of the Yamam, IDF and Shin Bet, under the precise intelligence guidance of the Shin Bet and IDF Intelligence, operated for over 12 hours in Tulkarm in a targeted activity to defeat a terrorist cell.\n\nThe soldiers closed in on a building where the terrorist squad was entrenched, which opened fire on them. The fighters responded by shooting with shoulder-fired missiles and other means from the building, and at the end of the exchange of fire, the five terrorists were eliminated.\nMilitary equipment and weapon parts were confiscated.\n\nDuring the activity, an IDF fighter was injured and brought to continue receiving medical treatment in a hospital; his family was informed.", "location": "", "classification": "security", "score": 0.9849329956770798, "event_breakdown": "- Joint operation by Yamam, IDF, and Shin Bet in Tulkarm to eliminate five terrorists barricaded in a building\n- 12-hour battle between security forces and terrorists in Tulkarm\n- Exchange of fire between security forces and terrorists in Tulkarm \n- Confiscation of military equipment and weapon parts during the operation\n- Injury of an IDF fighter during the activity, brought to hospital for medical treatment"}, {"id": "f3a59aec-d1fc-495b-8ad1-2949057e50e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26674/", "date": "2024-05-04 16:10", "message": "The Palestinians publish the names of four of the \"martyrs\" who were killed in the IDF operation tonight in the village of Deir el Ghusun in the north of Tulkarm:\n\n1. Alaa Sharith (the leftmost one).\n2. Tamer Fuqaha (next to Alaa' - both are behind the attack in which Elhanan Klein fell in November 2023. Tamer is also an operative of Erin al Aswad).\n3. Adnan Samara\n4. Asal Badran\n\nIn addition, there is the \"headless martyr\" who has not yet been identified - DNA tests will be conducted on him to confirm his identity.", "location": "", "classification": "security", "score": 0.9791185685870558, "event_breakdown": "- Palestinians publish names of four \\\"martyrs\\\" killed in IDF operation in Deir el Ghusun: Alaa Sharith, Tamer Fuqaha, Adnan Samara, Asal Badran\n- \\\"Headless martyr\\\" awaits identification through DNA tests"}, {"id": "ebad1ed3-4cd6-438d-a2b7-f961c37e4e00", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26673/", "date": "2024-05-04 15:36", "message": "The Palestinians report that the IDF forces have finished their activities in Deir al-Ghusun in the north of Tulkarm and have left.\nSources in Tulkarm say that the Palestinian rescue forces located another Palestinian \"martyr\" among the ruins, apparently headless.", "location": "The main location where the main event takes place is \"Deir al-Ghusun.\"", "classification": "security", "score": 0.9671169206516085, "event_breakdown": "- Conclusion of IDF activities in Deir al-Ghusun: IDF forces finish activities and leave the area (location: Deir al-Ghusun, north of Tulkarm).\n- Discovery of Palestinian \"martyr\" among ruins: Palestinian rescue forces locate a headless Palestinian among the ruins (location: Tulkarm)."}, {"id": "7a4b2389-0c96-435e-99e5-c7149491ab75", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26672/", "date": "2024-05-04 14:06", "message": "The Palestinians report that the person who came out from under the ruins of the house in Deir al-Ghusun and was arrested by IDF forces is the released prisoner Salma Badran, an operative of the military wing of Hamas with a \"heavy\" family lineage: he is the brother of the two \"martyrs\" of the wing - Fawaz and Seif Allah Badran. Salma is the owner of the apartment where the Hamas terrorists hid last night and which the IDF destroyed.\n\nFawaz (Salma's brother) was one of the senior bomb engineers of the Izz ad-Din al-Qassam Brigades in the West Bank and was the one who assembled the explosive device that exploded in the first suicide attack of the second intifada (March 2001), in which 3 Israeli citizens were killed in Netanya. Fawaz was also the one who recruited the suicide bomber for the attack and also guided other suicide bombers in Tulkarm. He was eliminated by the Israeli security forces that year using an explosive device planted in his car.", "location": "", "classification": "security", "score": 0.9989665591672134, "event_breakdown": "- Salma Badran emerges from under the ruins of a house in Deir al-Ghusun and is arrested by IDF forces\n- Salma Badran is identified as an operative of the military wing of Hamas and the brother of two \"martyrs\" of the wing - Fawaz and Seif Allah Badran\n- Fawaz Badran was a senior bomb engineer of the Izz ad-Din al-Qassam Brigades in the West Bank and was involved in the first suicide attack of the second intifada in Netanya"}, {"id": "999b23ef-a258-4298-a884-6cc5f2386552", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26671/", "date": "2024-05-04 14:00", "message": "The official Palestinian news agency Wafa: 6 Palestinians were killed in the IDF operation in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9664112263099419, "event_breakdown": "- 6 Palestinians killed in IDF operation in Deir al-Ghusun village"}, {"id": "05c929bc-49ee-4a8d-87fc-ae671234422f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26668/", "date": "2024-05-04 13:56", "message": "More footage from Deir al-Ghusun north of Tulkarm from the IDF operation today.", "location": "The main location where the main event takes place is \"Deir al-Ghusun\" north of Tulkarm.", "classification": "security", "score": 0.5645468611123309, "event_breakdown": "- IDF operation in Deir al-Ghusun, north of Tulkarm"}, {"id": "afb0b90f-e6cf-414e-8c37-c55ead1883de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Palestinian sources in Tulkarm claim that Tamer Fuqaha, an operative of the military wing of Hamas, (and the terrorist who carried out the attack in which Elhanan Klein fell on November 2, 2023), was killed in an IDF operation tonight in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun.", "classification": "security", "score": 0.9920826670749956, "event_breakdown": "null"}, {"id": "70ad8f80-8563-4d7d-899b-032bb1dc8258", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Deir al-Ghusun north of Tulkarm:\nThe IDF forces packed the body of the Palestinian who was killed in the area of ​​the building.\n\nPalestinian sources claim the IDF forces took 3 bodies.\n\nIDF forces then arrested a Palestinian who emerged from under the ruins of the house that the forces had besieged for many hours.", "location": "", "classification": "security", "score": 0.9879003899097348, "event_breakdown": "- IDF forces packed the body of the Palestinian who was killed in Deir al-Ghusun north of Tulkarm\n- Palestinian sources claim IDF forces took 3 bodies in Deir al-Ghusun north of Tulkarm\n- IDF forces arrested a Palestinian who emerged from under the ruins of the house in Deir al-Ghusun north of Tulkarm"}, {"id": "c294f1bb-8b7e-4364-8bb7-60c09dbcb2b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26661/", "date": "2024-05-04 13:10", "message": "The \"Holy Fire\" ceremony held today in the Church of the Holy Sepulcher in East Jerusalem as part of the \"Sabbath of Light\" that Christians celebrate today.", "location": "The main location where the main event takes place is \"Church of the Holy Sepulcher\" in East Jerusalem.", "classification": "security", "score": 0.7164941467590658, "event_breakdown": "- \"Holy Fire\" ceremony held in the Church of the Holy Sepulcher in East Jerusalem as part of the \"Sabbath of Light\""}, {"id": "f8af7af7-6bd8-46e3-80d1-3f09e376c3ec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26658/", "date": "2024-05-04 13:07", "message": "For nearly ten hours starting last night, IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm.\nAccording to the estimates, the terrorists Tamer Fakha and Alaa Sharitah, the operatives of the military wing of Hamas involved in the shooting attack in which Major General Elhanan Klein was killed near Beit Lid on November 2, 2023, were hiding in the house.\nSources associated with Hamas and Islamic Jihad operatives claim that the two managed to escape from the house which was surrounded by the IDF for many hours and fired upon by a large number of missles (and finally destroyed with a bulldozer - in the attached videos you can see the shooting and the demolition the house).", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9796365504234397, "event_breakdown": "null"}, {"id": "9f3eaf21-c4af-4508-821f-e09ea605bde3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26657/", "date": "2024-05-04 13:02", "message": "The Al Jazeera network claims: an Israeli drone launched a missile a few hours ago at a vehicle in Bint Jabil in southern Lebanon.\n\nUnofficial Lebanese sources: No casualties.", "location": "", "classification": "security", "score": 0.9652451684275815, "event_breakdown": ""}, {"id": "d6934980-62e2-46c4-9d65-c76316bfb26a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26656/", "date": "2024-05-04 12:30", "message": "The Qatari Al Jazeera cites a report by Reuters according to which Qatar is considering closing the offices of the political office of Hamas in its territory as part of an overall plan to continue its function as a mediator in the conflict between Hamas and Israel.", "location": "", "classification": "security", "score": 0.9065846889429762, "event_breakdown": "- Qatar considering closing Hamas political office\n- Reuters report cited by Qatari Al Jazeera\n- Part of plan to mediate conflict between Hamas and Israel"}, {"id": "858c9349-8c37-45f3-ae02-bf3fe70b8f5e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26655/", "date": "2024-05-04 12:29", "message": "At least 3 different Israeli military reporters publish the exact same message:\n\nPolitical actor:\n\nContrary to the publications, Israel will under no circumstances agree to the end of the war as part of an agreement to release our abductees.\n\nAs the political echelon decided, the IDF will enter Rafah and destroy the remaining Hamas battalions there - whether or not there will be a temporary respite for the release of our hostages.", "location": "Rafah", "classification": "security", "score": 0.6696081489195264, "event_breakdown": "null"}, {"id": "2389f88f-7391-450a-9bee-c59804676b09", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26653/", "date": "2024-05-04 12:27", "message": "Today, Lebanese sources report: Hezbollah will soon submit its comments to the French proposal to end the war in southern Lebanon\n\nJournalist sources in Lebanon state that Hezbollah and the Amal movement discussed the French proposal and decided not to reject it (so as not to be perceived as refusers - AA) but to submit 10 comments to amend the proposal.\nThe comments will be forwarded to the Speaker of the Lebanese Parliament (who happens to also be the head of the Amal Shiite movement fighting alongside Hezbollah in southern Lebanon - AA) and he will discuss them with Prime Minister Mikati and forward them to the French side.", "location": "The main location where the main event takes place is \"southern Lebanon.\"", "classification": "security", "score": 0.9143945024805114, "event_breakdown": "- Hezbollah to submit comments on French proposal to end war in southern Lebanon\n- Hezbollah and Amal movement discuss French proposal and decide to submit 10 comments for amendment, to be forwarded to Lebanese Parliament Speaker for discussion with Prime Minister Mikati and then to French side."}, {"id": "a209e367-d102-4707-b086-f2451addc9a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26652/", "date": "2024-05-04 12:26", "message": "Yesterday, Lebanese Al-Akhbar newspaper publishes the French proposal for a ceasefire between Israel and Hezbollah\n\nThe Lebanese Al-Akhbar newspaper, which is affiliated with Hezbollah, once again manages the agenda regarding the ceasefire agreements with Israel and reveals the details of the French proposal to end the war between Israel and Hezbollah in southern Lebanon.\n\nThe proposal includes three stages:\n\nFirst step (according to areas of responsibility)\n\nHezbollah the militias in South Lebanon stop the fire and allow UNIFIL to move freely in South Lebanon without restriction.\n\nIsrael will stop its attacks on Lebanese territory and stop jamming the radar in Lebanon.\n\nUNIFIL will increase patrols in southern Lebanon.\n\nSecond stage (within 3 days from the start of the first stage)\n\nHezbollah militias will dismantle all their facilities near the blue line, including observation towers and tents.\nAll military operatives, including the Radwan force, as well as equipment that enables the remote launch of anti-tank missiles, will be moved north beyond the ten-kilometer line from the border with Israel.\n\nIsrael will stop air flights over Lebanon.\n\nLebanon will begin deploying 15,000 soldiers on its behalf in southern Lebanon, south of the Litani River with the support of UNIFIL and international agencies.\n\nUNIFIL will resume its participation in the meetings of the tripartite mechanism (with Israel and Lebanon) and logistically assist the deployment of the Lebanese army south of Litani.\n\nThird stage (within ten days)\n\nThe renewal of the negotiations between Israel and Lebanon for the registration of the land border based on the negotiations that took place in 2017.\nBeginning of negotiations on the establishment of a zone free of armed military militias south of Litani (with the exception of the Lebanese army and UNIFIL forces).\n\nSupport for social and economic development in southern Lebanon.", "location": "Southern Lebanon", "classification": "security", "score": 0.9627738124436742, "event_breakdown": "- Lebanese Al-Akhbar newspaper publishes the French proposal for a ceasefire between Israel and Hezbollah"}, {"id": "33d24c3e-10f7-486f-8a4a-45265fcd6e1c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26651/", "date": "2024-05-04 12:20", "message": "The Saudi Asharq channel:\n\nHamas will announce within hours that it accepts this deal after receiving American guarantees for the end of the fighting and the complete withdrawal of IDF forces from all parts of the Strip at the end of the third and final phase of the deal, without the return of Israeli forces to the territory of the Strip.\n\nIt was also reported that Israel removed its objection to some of the names of the prisoners that Hamas demanded to be released in the deal - something that made progress possible.", "location": "", "classification": "security", "score": 0.5337781470853348, "event_breakdown": "- Hamas to announce acceptance of deal after receiving American guarantees\n- Complete withdrawal of IDF forces from all parts of the Strip at the end of the third phase of the deal\n- Israel removes objections to some names of prisoners demanded by Hamas"}, {"id": "aee89e9c-d56b-4647-8b5b-6fa59c1fc292", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26649/", "date": "2024-05-03 20:30", "message": "Documentation of one of today's attacks in the area of ​​the displaced persons' tents in Rafah in the south of the Gaza Strip - note the rocket rising into the sky. This indicates a precise hit by the aircraft on the target.", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.9952821119807056, "event_breakdown": "- Attack on displaced persons' tents in Rafah, Gaza Strip\n- Rocket rising into the sky indicating a precise hit by aircraft"}, {"id": "d0068615-5a27-49c9-9fc8-e57d9968c815", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26648/", "date": "2024-05-03 20:27", "message": "Hamas in an official announcement:\n\nIn light of the recent contacts with the mediators, tomorrow a delegation of the movement will arrive in Cairo to complete the talks.\n\nWe emphasize that the leadership of the movement reacted in a positive spirit to the proposal it received while discussing it. We are going to Cairo in the same positive atmosphere to reach an agreement.\n\nWe are determined to reach an agreement that will realize the demands of our people for a total cessation of aggression, the withdrawal of forces, the return of the displaced, aid to our people, the beginning of the reconstruction of the Gaza Strip and a serious exchange deal.", "location": "", "classification": "security", "score": 0.3907896760166591, "event_breakdown": "- Hamas delegation will arrive in Cairo to complete talks\n- Hamas leadership reacted positively to the proposal received during discussions\n- Hamas is determined to reach an agreement for total cessation of aggression, withdrawal of forces, return of the displaced, aid to the people, reconstruction of Gaza Strip, and a serious exchange deal"}, {"id": "588742cf-4057-4017-bffa-187d51aac398", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26645/", "date": "2024-05-03 19:03", "message": "Gazans complain: as part of the food packages distributed at UNRA schools, we received a food product that contains pork 🐷...\n\nحسب الله ونعم الوكيل", "location": "The main location where the main event takes place is \"Gaza.\"", "classification": "security", "score": 0.5476738944355803, "event_breakdown": "1. Gaza residents complain about receiving food containing pork in UNRA school food packages."}, {"id": "799e3510-a17a-4f14-8865-19c2983e80ec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26644/", "date": "2024-05-03 17:44", "message": "Reuters from a senior Hamas official: a Hamas delegation will arrive in Cairo tomorrow.", "location": "Cairo", "classification": "security", "score": 0.9023652992005777, "event_breakdown": "- Hamas delegation to arrive in Cairo tomorrow"}, {"id": "d330c67a-67f1-4b69-a03b-71c9d301d760", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26654/", "date": "2024-05-04 12:28", "message": "Heavy political pressure on Israel from all directions to silence all sectors, (mainly) at the expense of the Israeli interest. It will only get worse.", "location": "Israel", "classification": "security", "score": 0.7257546953647328, "event_breakdown": "- Heavy political pressure on Israel from all directions to silence all sectors\n  - Mainly at the expense of the Israeli interest"}]