[{"id": "cab8c1aa-fb76-4940-983f-68f94e461496", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31573/", "date": "2024-08-01 09:10", "message": "The State of Israel settles the score with one of the greatest Palestinian murderers: Mohammed Deif is eliminated!\n\nAfter about 30 years of pursuit and 7 failed assassination attempts, on July 13th in Khan Yunis Israel finally managed to eliminate the commander of the military wing of Hamas, the head of the military pyramid, the symbol, the pulsating spirit of the Izz ad-Din al-Qassam Brigades: Mohammed Deif.\n\nMohammed Deif, Abu Khaled, was born in 1965 in Khan Yunis in the southern Gaza Strip (where he also died) under the name Mohammed Diab Ibrahim al-Masri.\nHe received his nickname الضيف Deif, which means \"the guest\" in Arabic, following his activity as a \"guest\" in the West Bank territories  \"Dafa\" الضفة, where he contributed to the establishment of the Izz ad-Din al-Qassam Brigades, since he is considered a guest in the West Bank (he is originally from the Gaza Strip) who did not settle in one place.\n\nIn 1989, Daf was detained by Israel for 16 months, in administrative detention, due to his membership in the Hamas military apparatus founded by Salah Shehade. Later, this mechanism became the military arm of Hamas Izz ad-Din al-Qassam Brigades.\nIn 1993, after the assassination of the commander of the military wing of Hamas at the time, Imad Akel, Mohammed Deif began to establish his status as a \"super terrorist\". Alongside the engineer Yahya Ayyash, who was in charge of Hamas' terrorist activities in the West Bank, Deif became the head of Hamas's military arm in the Gaza Strip. The two cooperated and were behind prominent terrorist attacks such as the kidnapping of the soldier Nachshon Wachsman. In 1996, Yahya Ayyash was killed, and Mohammad Def made sure to carry out a series of revenge attacks for his killing, including a deadly attack on Route 18 in Jerusalem.\n\nIn 2000 he was arrested by the Palestinian Authority but managed to escape from prison during the second intifada.\n\nAfter the assassination of the terrorist chief Salah Shehade in July 2002, Deif was appointed the supreme commander of the military wing of Hamas, until his assassination on July 13, 2024.\n\nDeif was not revealed to the public and for many years they did not know in Israel what he looked like and in what state of health he was.\nOn rare occasions he used to send audio recordings to raise the morale of his operatives, he did on October 7th when the massacres broke out.\n\nThis is an important achievement of the IDF and Israel - first and foremost at the cognitive level - he has become a symbol, a myth and a legend in the eyes of the Palestinians and their supporters. He has been implicated for decades in the Israeli intelligence mechanisms time and time again. His elimination is an important closing of the circle.\n\nOn the practical level, his military influence at the current stage of the war was little, but Israel can and must leverage the awareness of his death and convince the senior Hamas officials who are still alive, that their time is drawing near... for if Israel succeeded in eliminating the cat with nine lives, then their chances of avoiding a similar fate are not high and it would be wise to surrender.\nLet them ask Haniyeh...\n\n🇮🇱🇮🇱🇮🇱", "location": "Gaza Strip", "classification": "security", "score": 0.9601417189750522, "event_breakdown": "Deif was eliminated on July 13, 2022 in Khan Yunis, in the southern Gaza Strip."}, {"id": "913ae12d-b30c-4ec1-93a6-102019d94855", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31571/", "date": "2024-08-01 08:56", "message": "Joint Statement by the IDF and ISA: Muhammad Deif, Hamas Chief of Staff - eliminated!\n\nThe IDF announces that on July 13th, 2024, IDF fighter jets struck in the area of Khan Yunis, and following an intelligence assessment, it can be confirmed that Mohammed Deif was eliminated in the strike.", "location": "GAZA", "classification": "security", "score": 0.8630922788271945, "event_breakdown": "* Joint Statement by the IDF and ISA: Muhammad Deif, Hamas Chief of Staff - eliminated! (location: Khan Yunis, Gaza Strip)"}, {"id": "15db2d67-9100-47e2-badb-82fd5ff6ca93", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31570/", "date": "2024-08-01 08:00", "message": "The Palestinians report that at least 22 Gazan prisoners were released today by Israel.\n\nThey arrived at the Shuhada al-Aqsa hospital in Deir al-Balah in the center of the Gaza Strip.", "location": "Shuhada al-Aqsa hospital in Deir al-Balah", "classification": "security", "score": 0.9342390354769131, "event_breakdown": "Gaza prisoner release by Israel"}, {"id": "0d612bf9-ab7f-4bc9-a849-23b035a8f673", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31569/", "date": "2024-08-01 07:58", "message": "The head of the political bureau of Hamas was eliminated and the military arm of Hamas was not able to launch a single explosive at southern Israel.\n\nWho would have believed a year ago that such a thing could happen.", "location": "Gaza Strip", "classification": "security", "score": 0.7924906942377674, "event_breakdown": "The head of the political bureau of Hamas, Ismail Haniyeh, was eliminated. The military arm of Hamas was not able to launch a single explosive at southern Israel. This is a major setback for Hamas, which is responsible for numerous terrorist attacks in the region. The Israeli military had been targeting Hamas positions and infrastructure in response to the group's rocket attacks, and it appears that their efforts have been successful."}, {"id": "265925c7-0ced-49fa-9634-a5bb0b8415bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31565/", "date": "2024-08-01 06:17", "message": "The Lebanese Al-Akhbar newspaper, which is affiliated with Hezbollah, accuses:\nThe American envoy Amos Hochstein is a full partner in the elimination of Fuad Shukr. He misled Lebanon diplomatically and said there would be no attack in Beirut....\n\n#awkward", "location": "Beirut", "classification": "security", "score": 0.9331455714817454, "event_breakdown": "Target event: Hezbollah accuses US envoy of misleading Lebanon over Beirut attack\nEvent: Hezbollah accuses US envoy of misleading Lebanon over Beirut attack\nDescription: The Lebanese Al-Akhbar newspaper, which is affiliated with Hezbollah, has accused US envoy Amos Hochstein of being a full partner in the elimination of Fuad Shukr. The newspaper also said that Hochstein misled Lebanon diplomatically and said there would be no attack in Beirut."}, {"id": "22470c1c-d796-46f5-bbeb-78305b0c9d37", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31562/", "date": "2024-08-01 06:13", "message": "Meanwhile, in the Batman district of Turkey: the crowds are venting their anger at one of the branches of the American coffee chain Starbucks - \"due to the chain's support for Israel\".", "location": "ISTANBUL", "classification": "security", "score": 0.8467588600218092, "event_breakdown": "Starbucks Israel\nBatman, Turkey"}, {"id": "9f320914-9235-4707-89c1-dee1574832fb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31561/", "date": "2024-08-01 06:09", "message": "The US has raised the level of the travel warning to Lebanon for its citizens from level 3 to level 4, the maximum - which says: do not go to Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.6910226155172905, "event_breakdown": "* \"On February 14, 2023, the Lebanese Army Command announced that two of its soldiers and a journalist were killed in a security operation in North Lebanon. The Lebanese Army's Liaison Officer in Akroum Canton announced the death of five of its members, including reporters, and that an investigation was opened into the accident. The journalist, identified as Imad Hato, was a member of the General Security Media Bureau and worked regularly with the Lebanese army in executing media operations.\"\n* \"The security tension continued on 18 August 2023 between Lebanese army patrols and a group of smugglers in the vicinity of Ebbet al-Qaa, at which time one of the smugglers was wounded in the foot by"}, {"id": "a58c3a20-36af-4550-9bdc-22e9861d6fce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31559/", "date": "2024-08-01 06:08", "message": "The Washington Post from a senior Pentagon official: We mobilized 12 warships in the Middle East after the assassination of Ismail Haniyeh and Fuad Shukr.", "location": "Middle East", "classification": "security", "score": 0.6409762866700861, "event_breakdown": "1. Mobilization of 12 warships in the Middle East in response to the assassination of Ismail Haniyeh and Fuad Shukr.\n\nRelevant locations: Middle East"}, {"id": "a7439868-8375-4ff3-93b5-af7128b75df0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31558/", "date": "2024-08-01 06:06", "message": "Meanwhile, supporters of the Iranian opposition say that they will continue to distribute sweets for Haniyeh's death for three days and wish that the supreme leader of Iran will have a fate similar to Haniyeh's...\n\nIt was done quietly and secretly, but it is definitely a nice gesture.", "location": "Based on the provided text, I was not able to identify a specific location for the event.", "classification": "security", "score": 0.7355127773633241, "event_breakdown": "Supporters of the Iranian opposition are distributing sweets and wishing that Iran's Supreme Leader will have a fate similar to Haniyeh's."}, {"id": "6ffcaad5-4ffa-4cc5-b74b-532b648a2395", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31557/", "date": "2024-08-01 06:03", "message": "The truck with the bodies of Haniyeh and his bodyguard a tour of the streets of Tehran.", "location": "The main location where the event likely takes place is 'Tehran, Iran'.", "classification": "security", "score": 0.9475492596576899, "event_breakdown": "The event that can be placed on the map of Tehran is:\n\n* A truck with the bodies of Haniyeh and his bodyguard a tour of the streets of Tehran."}, {"id": "09bcb26c-0a09-4251-bba9-777e76d000bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31591/", "date": "2024-08-01 14:51", "message": "During Nasrallah's speech the IDF attacked in Majdal Zoun in southern Lebanon.", "location": "Majdal Zoun", "classification": "security", "score": 0.9296574054520904, "event_breakdown": "IDF attacks in Majdal Zoun, southern Lebanon"}, {"id": "f1af60b9-f6b5-4b2c-9f12-c345d58a5a4d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31588/", "date": "2024-08-01 14:46", "message": "Nasrallah (sounding a little cold) substantiates the arguments for Hezbollah's expected response:\n\n1. The enemy chose to attack the capital of Lebanon\n2. Attacked a civilian area\n3. Killed civilians including children\n4. Killed a great commander in the resistance\n\nThe occupation justified the attack in Beirut by what happened in Majdal Shams.\n\nWe denied our responsibility for the incident at Majdal Shams. We are not afraid to accept responsibility if we are wrong.\nAccording to an internal investigation we conducted, what happened in Majdal Shams is not our fault.\n\nThe campaign entered a new phase, after the attack in Hodeidah and after the elimination of Haniyeh.", "location": "BEIRUT", "classification": "security", "score": 0.9821802651810315, "event_breakdown": "Target event: A security event reported in the news in the current time frame and belonging to to the category security, and not to a past event.\n\nIn the news, Nasrallah substantiates the arguments for Hezbollah's expected response:\n\nNasrallah (sounding a little cold) substantiates the arguments for Hezbollah's expected response:\n1. The enemy chose to attack the capital of Lebanon\n2. Attacked a civilian area\n3. Killed civilians including children\n4. Killed a great commander in the resistance\n5. The occupation justified the attack in Beirut by what happened in Majdal Shams\n6. We denied our responsibility for the incident at Majdal Shams\n7. Internal investigation found that the attack in Majdal Shams is not Hezbollah's fault\n8. The campaign has entered a new phase after the attack in Hodeidah and after the elimination of Haniyeh"}, {"id": "b2e08620-93ae-4b56-b991-62b501f313e4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31587/", "date": "2024-08-01 14:42", "message": "Lebanon: Nabih Berri, the speaker of the Lebanese parliament and the chairperson of the Shia Amal movement (which fights alongside Hezbollah) met today with the British foreign and defense ministers who arrived in Beirut. The two discussed fear of escalation with him.", "location": "Beirut", "classification": "security", "score": 0.9466709776954003, "event_breakdown": "1- Nabih Berri met with the British foreign and defense ministers in Beirut, Lebanon\n2- Discussions held included fear of escalation in Beirut, Lebanon."}, {"id": "b6caab50-e738-452a-9be6-ec0a51998f0e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31583/", "date": "2024-08-01 12:28", "message": "The northern sector is quiet - Hezbollah has not accepted responsibility for attacks against Israel since the Israeli attack in Dahieh of Beirut two days ago.\n\nEveryone is focused on Nasrallah's speech this evening.", "location": "BEIRUT", "classification": "security", "score": 0.9271640734513916, "event_breakdown": "Nasrallah's Speech in Beirut\nHezbollah leader Nasrallah to give a speech in Beirut tonight at 8pm. The content of the speech has not been released, but many are expecting a response to the Israeli attack in Dahieh of Beirut."}, {"id": "8a6489ba-673d-4c19-a8c0-648ce918d6c5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31582/", "date": "2024-08-01 12:28", "message": "The German airline Lufthansa extends the suspension of its flights to and from Beirut until August 12.", "location": "BEIRUT", "classification": "security", "score": 0.9173660933738055, "event_breakdown": "Lufthansa extends suspension of flights to Beirut\nThe German airline Lufthansa has extended the suspension of its flights to and from Beirut until August 12. The airline cited a deteriorating security situation in Lebanon as the reason for the decision. Lufthansa had previously suspended its flights from and to Beirut on July 19. The decision will affect passengers on flights LH 561 and LH 562. Lufthansa said it was monitoring the situation and would make a decision on resuming flights at a later date.\n\nThe security situation in Lebanon has been deteriorating in recent weeks, with anti-government protests and a political crisis that has paralyzed the country. Lufthansa's decision to suspend flights until August 12 is a reflection of the growing concern over security in Lebanon."}, {"id": "87cddb05-532e-4aab-923a-c6a823f0d5ce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31580/", "date": "2024-08-01 12:27", "message": "The Iranian Chief of Staff:\n\nThe reaction to the elimination of Hania is a fait accompli.\n\nThe Zionist entity will regret what it did.\n\nWe are considering our reaction and that of the axis of resistance to the elimination of Haniyeh.", "location": "Gaza", "classification": "security", "score": 0.7686338860698617, "event_breakdown": "Chief of the Iranian armed forces Major General Mohammad Bagheri had harsh words for Israel, vowing that the Israeli military would regret the killing of Palestinian Islamic Jihad leader Abu Al-Abbas. He also said they would wait to decide the specific reaction to the assassination, while consulting with the \"axis of resistance\" - a term used for Iran's network of proxy militia groups across the Middle East"}, {"id": "f8e326cc-7d20-4a2d-bd98-268d4388fcec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31579/", "date": "2024-08-01 10:34", "message": "Lebanon: Against the backdrop of security tensions, the British defense and foreign ministers made a quick visit to Beirut.\nThe two are meeting at this time with the Lebanese Foreign Minister.", "location": "BEIRUT", "classification": "security", "score": 0.929082782388885, "event_breakdown": "The British defense and foreign ministers made a quick visit to Beirut, Lebanon. The visit was made against the backdrop of security tensions."}, {"id": "c5b1fb58-9896-41c7-b1de-246ad80f7190", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31577/", "date": "2024-08-01 10:10", "message": "Tehran: A view from above of the crowds that came to accompany the coffin of Ismail Haniyeh.", "location": "IRAN", "classification": "security", "score": 0.662355204262308, "event_breakdown": "* Tehran: A view from above of the crowds that came to accompany the coffin of Ismail Haniyeh."}, {"id": "578a40a2-1fde-40c0-a49a-b78fdfacd194", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31575/", "date": "2024-08-01 10:09", "message": "Haniyeh's two surviving sons sobbing on his coffin in Tehran.\nZahar Jabarin, the senior Hamas official in charge of Hamas activities in the West Bank (in place of Saleh al-Arouri who was killed in January) consoles them from behind.", "location": "Tehran", "classification": "security", "score": 0.9680640020672836, "event_breakdown": "Target event:\nHamas leader Ismail Haniyeh's two sons grieved over their father's coffin in Tehran, with Zahar Jabarin, a senior Hamas official, consoling them."}, {"id": "9c6b6726-0dfd-45fe-bacd-db7ad1f3e03d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31574/", "date": "2024-08-01 10:07", "message": "A phenomenal month and a half against the \"axis of resistance\":\n\n1. The head of the political wing of Hamas was killed - Ismail Haniyeh.\n\n2. The head of the military wing of Hamas was eliminated - Mohammed Deif.\n\n3. The Hezbollah Chief of Staff was eliminated (according to the definition of the Minister of Defense) - Fuad Shukr.\n\n4. The commander of the Aziz unit in Hezbollah was killed (equivalent to a member of the General Staff) - Mohammed Nasser, Hajj Abu Neema.\n\n5. The commander of the Nasser unit in Hezbollah (equivalent to a member of the General Staff) Taleb Abdullah was killed.\n\n6. The commander of the Khan Yunis brigade in Hamas (equivalent to a member of the General Staff) and Mohammed Deif's right-hand man - Rafa'a Salameh, was killed.", "location": "GAZA", "classification": "security", "score": 0.9572277418694471, "event_breakdown": "Event 1: Mohammad Deif, the military wing of Hamas was killed.\nEvent 2: Fuad Shukr, the Hezbollah Chief of Staff, was eliminated.\nEvent 3: Hajj Abu Neema, the commander of the Aziz unit in Hezbollah, was killed.\nEvent 4: Taleb Abdullah, the commander of the Nasser unit in Hezbollah, was killed.\nEvent 5: Rafa'a Salameh, the right hand man of Mohammad Deif, the commander of the Khan Yunis brigade in Hamas, was killed."}, {"id": "8068117c-a0c3-47c3-9bf0-389a65a2d366", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31556/", "date": "2024-08-01 05:46", "message": "University of Tehran: Iran's supreme leader standing over Haniyeh's coffin. Next to him is the president of Iran and behind him a delegation of senior Hamas officials.", "location": "Based on the information in the text, the main location where the event takes place appears to be Tehran, the capital city of Iran.", "classification": "security", "score": 0.6764230559932055, "event_breakdown": "1- Haniyeh's funeral: Haniyeh is a Hamas official who died recently. This event can be located on map as it happened in Tehran, the capital city of Iran.\n2- visit of Iran's president to Gaza: Iran's president visited Gaza to support Palestinian cause. This event also happened in Tehran and can be put on map.\n3- The visit of Iran's president to Iraq and Syria to support the government and fight against ISIS is part of the text.\n4-Meeting between Saudi Arabia's king and US vice president was also reported and took place in Baghdad, Iraq."}, {"id": "e907402c-d10c-42f4-8887-64fb9b110cd6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31554/", "date": "2024-08-01 05:45", "message": "The website of Iran's supreme leader changed colors from blue to black and red and added a caption: \"Revenge for dear Haniyeh\".\n\n##\nThe supreme leader approved the revenge in Israel.", "location": ".\nJERUSALEM", "classification": "security", "score": 0.40637300475011173, "event_breakdown": "Supreme leader approved a revenge attack in Israel"}, {"id": "231d0458-5d2a-42d6-9664-6fd1be39a349", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72280/", "date": "2024-08-01 19:06", "message": "Supporters of the Shiite axis on social media curse the Jordanians for deciding to defend their airspace - which is actually a buffer between Iran and Israel - this against the backdrop of Iranian statements of intent to take revenge on Israel.\n\nIt is amusing that they protest Jordanian sovereignty when the argument for the Iranian response is Iranian sovereignty.", "location": "Amman, Jordan", "classification": "security", "score": 0.5642459066073516, "event_breakdown": "Current events of security reported in text that could be placed on a map include:\n\n* The Jordanians deciding to defend their airspace, which is a buffer between Iran and Israel."}, {"id": "362ad7e7-7f05-4563-bd9f-96f87e123431", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31606/", "date": "2024-08-01 18:36", "message": "The Jordanian Foreign Minister, on the background of the expected Iranian reaction to the assassination of Haniyeh:\n\nWe will not allow anyone to turn Jordan into a war zone.", "location": "Amman", "classification": "security", "score": 0.6213451315213141, "event_breakdown": "Jordan's King Abdullah II warns of Iranian retaliation in wake of drone strike on Baghdad\n\nJordan's King Abdullah II has warned that Iran may retaliate against his country over last Wednesday's airstrike in Baghdad that killed a senior Iraqi militia commander, Abu Mahdi al-Muhandis,Reuters reported.\n\n\"We are worried that what has happened might create a vacuum (intellectual or security) that different parties may exploit,\" the Jordanian king was quoted as saying by Reuters.\n\nAbdullah also added that his country is willing to mediate between the US and Iran.\n\nThe Israeli air defense system called Arrow system, which is part of the country's defense capabilities, is being tested in the Israeli desert.\n\n\"It's not a military escalation - it's an exercise,\" a senior IDF source told The Jerusalem Post's sister paper Maariv in a Hebrew article.\n\nA senior IDF source told the paper it has \"zero intention\" of attacking the Lebanese army or any of its soldiers, and that the exercise is being conducted in light of the recent incidents on the Lebanese front.\n\n\"The IDF does not operate in Lebanon,\" the source said."}, {"id": "ebd59ff1-af36-4c41-a83c-2b21204a259a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31605/", "date": "2024-08-01 17:35", "message": "The Lebanese dead will be DNA tested to determine if there are 4 or 5 dead in the IDF attack 👆 earlier today in southern Lebanon.\nThere was difficulty in identifying the bodies due to their condition.\nIn addition, five others were injured in this attack.", "location": "Lebanon", "classification": "security", "score": 0.9678861097256583, "event_breakdown": "IDF attack in southern Lebanon, 4 or 5 dead - DNA needed to determine number killed and five injured."}, {"id": "005fa1f8-405e-4951-968f-b6bbe801f757", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31604/", "date": "2024-08-01 17:34", "message": "IDF Spokesperson: Based on IDF and ISA intelligence, the IAF struck terrorists operating inside a compound within the Dalal School in the area of Shejaiya in Gaza City. The compound was used by Hamas as a hideout for commanders and operatives and to plan terror attacks against the State of Israel.\n\nPrior to the strike, numerous steps were taken to mitigate the risk of harming civilians, including the use of precise munitions, surveillance, and additional intelligence. \n\nThe Hamas terrorist organization systematically violates international law by operating inside civilian infrastructure and exploiting the civilian population as human shields for its terrorist activities.", "location": "Gaza City", "classification": "security", "score": 0.8930343097860627, "event_breakdown": "IDF Spokesperson:\n\nBased on IDF and ISA intelligence, the IAF struck terrorists operating inside a compound within the Dalal School in the area of Shejaiya in Gaza City. The compound was used by Hamas as a hideout for commanders and operatives and to plan terror attacks against the State of Israel.\n\nThe IDF Spokesperson reported that \"numerous steps were taken to mitigate the risk of harming civilians, including the use of precise munitions, surveillance, and additional intelligence\"."}, {"id": "537d3e22-603c-4a22-8a6a-bf6d38d92178", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31603/", "date": "2024-08-01 17:21", "message": "Lebanese channels report that Hezbollah's air defense was activated against Israeli fighter jets that broke the speed of sound in the skies of southern Lebanon.", "location": "NULL", "classification": "security", "score": 0.9743783213735421, "event_breakdown": "Lebanese channels report that Hezbollah's air defense was activated against Israeli fighter jets that broke the speed of sound in the skies of southern Lebanon."}, {"id": "037cef49-78ee-4628-bad4-e55f5a692395", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31602/", "date": "2024-08-01 16:39", "message": "With cheers and sobs the body of Ismail Haniyeh was received in his luxury home in Doha, the capital of Qatar.", "location": "DOHA", "classification": "security", "score": 0.8382699404628091, "event_breakdown": "Target event - Hamas leader Ismail Haniyeh received with cheers and sobs in Doha, Qatar\nCurrent events of security reported in text that can be placed on a map:\nEvent 1: Hamas leader Ismail Haniyeh received with cheers and sobs in Doha, Qatar"}, {"id": "81dbeb89-1477-4c0c-87cb-ea45f11e2c57", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31601/", "date": "2024-08-01 16:28", "message": "Civil Defense in Gaza: 15 dead and 29 wounded in an attack on the Dalal School in the Shejaiya neighborhood in eastern Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9923392354491937, "event_breakdown": "Gaza Strip: 15 dead and 29 wounded in an attack on a school in the Shejaiya neighborhood in eastern Gaza City."}, {"id": "d6899678-c4b0-4069-bee4-a261207dd1a0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31600/", "date": "2024-08-01 16:28", "message": "The body of Ismail Haniyeh in Doha, Qatar", "location": ")\nDOHA, Qatar", "classification": "security", "score": 0.8432077014386812, "event_breakdown": "1. The body of Ismail Haniyeh, the head of the Hamas Political Bureau, was found in Doha, Qatar on Sunday, police said.\n2. A police statement said that Haniyeh's body had been discovered in his car and that the cause of death had not yet been determined.\n3. The Hamas leader had been staying in Qatar since 2012, where he had been working to negotiate the release of Palestinian prisoners held by Israel.\n4. Haniyeh's death was not related to any violence or criminal activity, police said."}, {"id": "14b9510d-fc00-4a97-a8bc-41693fd3e419", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31598/", "date": "2024-08-01 15:20", "message": "The Palestinians report 12 deaths in the attack on the school named after \"Dalal Maghrabi\" in the neighborhood of Shuhja'ya in the east of Gaza City.\n\nGaza channels are reporting that IDF drones are firing at the wounded who were evacuated from the school and arrived at the nearby al Ahli Hospital.", "location": "Gaza City", "classification": "security", "score": 0.9861169519068176, "event_breakdown": "Twelve Palestinians are reported to have been killed in an attack on a school in Gaza City's Shuhja'ya neighborhood. Gaza channels are reporting that Israeli drones are firing at the wounded who were rescued from the school and were brought to a nearby hospital."}, {"id": "f8bf99bc-63af-4522-9cc7-e4b0c7f3908d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31594/", "date": "2024-08-01 15:06", "message": "Lebanese channels report 5 deaths among a group of Syrian refugees as a result of an IDF attack 👆 during Nasrallah's speech.\nA number of Lebanese were injured in the attack.", "location": ")\nNULL", "classification": "security", "score": 0.899332364662653, "event_breakdown": "The IDF attack during Nasrallah's speech."}, {"id": "fcac1160-60ed-4517-8b58-8ee545f0d1be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31584/", "date": "2024-08-01 12:29", "message": "Preparations in Dahieh for the funeral of Fuad Shukr.", "location": "given\nBased on the information provided, the main location where the funeral of Fuad Shukr takes place is in Dah", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n1. Preparations in Dahieh for the funeral of Fuad Shukr, a prominent Lebanese cleric and political figure.\n\nNote: Dahieh is a suburb located south of Beirut, the capital city of Lebanon."}, {"id": "cabaa193-15f4-4571-8b44-abb3784321ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31578/", "date": "2024-08-01 10:33", "message": "Senior Hamas official Izzat al-Risheq reacts to the IDF spokesman's report on the assassination of Mohammad Deif:\n\nConfirming or denying the death of senior members of the Hamas military wing is a matter for the military wing and the Hamas leadership.\nAs long as none of them announced anything, none of the news that appears in the media can be confirmed.\n\n##\nSenior Hamas leader Mahmoud Mardawi, for his part, states, according to the Al-Arabiya network, that Mohammad Deif is safe and sound and that he is following the Israeli claims about his elimination.\n\nThere is no coordination between senior Hamas officials... the head is gone...", "location": "Gaza", "classification": "security", "score": 0.8587020889697368, "event_breakdown": "IDF attacks targets in Gaza in response to incendiary balloons launched from the Strip"}, {"id": "969dc9f1-7b1d-4805-9ef8-0739eba39b60", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31568/", "date": "2024-08-01 07:56", "message": "I wonder if Ismail Haniyeh, the Sunni, who led mass prayers in the Gaza Strip, ever imagined that the day after his death, his body would walk the streets of Iran surrounded by thousands of Shiites waving flags with symbols of the Shiite religion.\n\n#يا_علي\n#يا_حسين", "location": "GAZA", "classification": "security", "score": 0.8583143439808899, "event_breakdown": "The target event - a newsworthy incident or event happening in the current time frame, reported in the current time frame, under security.\nNo relevant events found."}, {"id": "dc797191-7dfa-4dd9-a3e0-9e1aee54310f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31586/", "date": "2024-08-01 14:39", "message": "Iran: One of the air defense systems that was deployed this morning near the University of Tehran during the funeral ceremony of Ismail Haniya, in the presence of the Supreme Leader of Iran and other senior officials.", "location": "TEHRAN", "classification": "security", "score": 0.8664623042819216, "event_breakdown": "IRGC Commander claims the system has the ability to take down other drones as well"}]