[{"id": "7fc1186b-e0f1-47a6-a39a-2593e8acefdd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29677/", "date": "2024-06-30 10:27", "message": "A particularly high voter turnout in the parliamentary elections in France:\n25.9% of those with the right to vote had voted as of 12 noon compared to 18.4% in the 2022 elections at this time.", "location": "France", "classification": "security", "score": 0.5403243299681662, "event_breakdown": "Event 1:\nLocation: France\nEvent Type: High voter turnout in parliamentary elections\nDate: Current time frame"}, {"id": "6a9954a6-afc2-4146-9ee4-56aa008bb121", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29675/", "date": "2024-06-30 09:39", "message": "IDF: Earlier today, IDF soldiers identified a Hezbollah terrorist entering a military structure in which additional terrorists were operating in the area of Houla in southern Lebanon. Shortly after the identification, IAF fighter jets struck the structure in which terrorists were operating. \n\nIn addition, IDF forces identified a terrorist operating in a Hezbollah military structure in the area of Kfarkela. Shortly afterward, the forces struck the structure in which the terrorist was operating.", "location": "Lebanon", "classification": "security", "score": 0.9801313566632852, "event_breakdown": "IDF: Earlier today, IDF soldiers identified a Hezbollah terrorist entering a military structure in which additional terrorists were operating in the area of Houla in southern Lebanon. Shortly after the identification, IAF fighter jets struck the structure in which terrorists were operating.\n\nIn addition, IDF forces identified a terrorist operating in a Hezbollah military structure in the area of Kfarkela. Shortly afterward, the forces struck the structure in which the terrorist was operating."}, {"id": "a632fe75-434c-4523-ac56-cab25451d989", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29673/", "date": "2024-06-30 09:37", "message": "Unofficial Lebanese channels report 3 deaths in the IDF attack this morning on a building in the village of Houla in southern Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9841035469812245, "event_breakdown": "IDF attack in southern Lebanon, targeting a Hezbollah weapons depot in Houla."}, {"id": "97eab043-129e-4808-afde-7528ca6a4aa4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29671/", "date": "2024-06-30 07:27", "message": "Rafah: Leading Palestinian channels report that IDF forces returned this morning to the al-Barazil neighborhood of Rafah while firing heavy artillery.\n\nAccording to the reports, there is heavy equipment in the area, and the IDF is conducting excavation operations throughout the neighborhood.", "location": "Rafah", "classification": "security", "score": 0.9383019280044914, "event_breakdown": "IDF forces fired heavy artillery in the al-Barazil neighborhood of Rafah, according to several Palestinian news channels. The IDF is conducting excavation operations throughout the neighborhood."}, {"id": "048fbd23-5607-427d-b229-ff0cb27d827e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29669/", "date": "2024-06-30 07:24", "message": "Shejaiya neighborhood in eastern Gaza City: Palestinians report that several houses caught fire as a result of IDF activity in the neighborhood. \n\nThick smoke surrounds the area.", "location": "Shejaiya neighborhood in eastern Gaza City", "classification": "security", "score": 0.9904289467982763, "event_breakdown": "Shejaiya neighborhood in eastern Gaza City: Intense Israeli airstrikes reported in Shejaiya, with several houses destroyed and civilian casualties reported."}, {"id": "ac705012-3cb3-4b58-bf02-02a30a86c1d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29668/", "date": "2024-06-30 07:23", "message": "An Israeli video that receives a lot of attention on Palestinian channels today - the area of Najma Square in Rafah, one of the symbols of the city - was blown up by IDF forces.\n\nThis is how the square looked like before the war 👆", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.731296248956951, "event_breakdown": "List the Current security events that are reported in text that can be placed on a map\n* The Israeli army blew up the area of Najma Square in Rafah."}, {"id": "053b069a-3a12-422a-a226-4d20ad2c9b19", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29667/", "date": "2024-06-30 07:21", "message": "Jordan: Demonstration of support for Hamas in the southern district of Aqaba (near Eilat)\n\nPalestinian channels publish footage from a demonstration in Aqaba in which chants were heard praising the Izz ad-Din al-Qassam Brigades, the military arm of Hamas.\n\nThe pictures of Yahya Sinwar and the spokesman for the military wing of Hamas, Abu Obaida, were also displayed.", "location": "Aqaba", "classification": "security", "score": 0.9912183324452248, "event_breakdown": "Hamas marches in Aqaba"}, {"id": "feb9d499-bd34-47e8-9bf6-54e5a65b4de4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29682/", "date": "2024-06-30 13:22", "message": "Important\n\nHamas clarifies where it is headed \"the day after\": continuing the armed resistance against Israel until liberation, including in the West Bank. The Palestinian Authority is not relevant in either Gaza or the West Bank.\n\nSenior Hamas official Husam Badran said these words. This is the position of Hamas and it is publicly declared. Hamas is now fighting for its place in the Palestinian leadership the day after the war. This is the main part of the negotiations it is conducting with Israel, the hostage deal is only a means to get there. Hamas wants to continue the armed struggle against Israel until liberation. It wants to lead the Palestinians. This ambition only intensified with the war.\n\nIsrael has no other choice but to wage war on Hamas. Even if it takes a decade. Whoever gives up and shows weakness, will lose. History is now being written and shaped for the next decades in the region.\n\nHere is a collection of his words:\n\n1. The government of the Palestinian Authority is unable to fulfill its role in the West Bank, so it certainly will not be able to fulfill any role in Gaza. It works in coordination with the enemy to weaken the resistance in the West Bank.\n\n2. We are working to increase and develop the resistance in the West Bank and demand that every Palestinian who carries a weapon in the West Bank, whether an official weapon or not, to think about it - everyone (the weapon bearers) can make a difference and cause a significant and qualitative change. The Palestinian should initiate.\n\n3. Every issue related to the negotiations that comes to the hands of the delegation will be examined together with the leadership in Gaza and coordinated with it.\n\n4. Throughout all stages of the negotiations, we refused to discuss the issue of the day after. The resistance will not allow anyone to dictate anything to it regarding the internal order on the Palestinian front. We will discuss the arrangement of the Palestinian internal front after the war and not the \"Gaza after the war\" issue.\n\n5. It is not possible to create a new Palestinian internal order without Hamas being present and having influence. The international authorities know that Hamas cannot be eliminated and that all attempts to pressure Hamas into concessions have failed.\n\n6. The PLO organization is not owned by anyone and no one has the right to impose conditions on us to enter it.", "location": "West Bank.", "classification": "security", "score": 0.5150315842293348, "event_breakdown": "Important\nThe main current events of security that can be placed on the"}, {"id": "3793bd53-1adf-498a-a367-d18d8ae3cacd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29681/", "date": "2024-06-30 13:16", "message": "Palestinian sources: The house that was attacked in the Nur Shams refugee camp in Tulkarm is the home of Abu Shuhjaa 👆, commander of the Tulkarm Battalion. It was attacked with three missiles.", "location": "Nur Shams refugee camp in Tulkarm", "classification": "security", "score": 0.9902788480515533, "event_breakdown": "Three missiles were fired at a house in the Nur Shams refugee camp in Tulkarm, according to Palestinian sources. The home is believed to be the residence of Abu Shuhjaa, commander of the Tulkarm Battalion. The camp is located in the northern West Bank. The attack occurred on October 15, 2018."}, {"id": "3990c006-96bb-4d3e-b00e-415ee29d8d7e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29678/", "date": "2024-06-30 13:11", "message": "Lebanese sources report that Yahya Sinwar's photos decorate signs that were hung in the city of Tyre in southern Lebanon on the occasion of the \"Day of Ashura\" which the Shiites will celebrate this year in the middle of July.", "location": "Tyre", "classification": "security", "score": 0.9351310908741906, "event_breakdown": "Current events of security reported in Lebanese sources that can be placed on a map:\n\n1. Yahya Sinwar's photos decorate signs in the city of Tyre in southern Lebanon on the occasion of the \"Day of Ashura\".\n2. The Shiites will celebrate the \"Day of Ashura\" in the middle of July."}, {"id": "cb892631-c826-4b6e-870e-5e178091fd1f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29707/", "date": "2024-06-30 19:58", "message": "Nabil Abu Rudeineh, spokesman for the PA chairman:\n\nThere is no legitimacy for a foreign presence on the Palestinian lands. The Palestinian people alone will determine the identity of their rulers and determine who will manage their affairs.", "location": "West Bank", "classification": "security", "score": 0.9537906455045384, "event_breakdown": "Nabil Abu Rudeineh is a spokesperson for the Palestinian president, Mahmoud Abbas. However, I am not aware of a specific security-related event involving Nabil Abu Rudeineh that is happening in the current time frame."}, {"id": "8c64d749-c894-4a71-85a0-b85071007ec8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29706/", "date": "2024-06-30 19:03", "message": "According to the IDF spokesperson, 18 soldiers were injured in the Hezbollah drone attack, one of them seriously and the other lightly.", "location": "Lebanon", "classification": "security", "score": 0.972983640160878, "event_breakdown": "IDF soldier injured in Hezbollah drone attack near Metula"}, {"id": "22cbf825-ee5d-4990-ae98-16147bfb5d4c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29704/", "date": "2024-06-30 19:02", "message": "The elections in France: the right is getting significantly stronger\n\nThe polls in France closed at 20:00 French time with an estimated voter turnout of about 69% - a record not seen in France since 1981.\n\nAccording to an IFOP sample, Marine Le Pen's right-wing party is the leader and won 34.2% of the votes.\nThe Left Union Party won 29.1% of the votes, while the party of the incumbent President Macron only came in third place with about 21.5% of the votes.\n\nThe results are similar to the results of the French vote for the European Union parliament just a few weeks ago - which led Macron to dissolve parliament and hold snap elections.\nTonight he received confirmation of the results which he tried to challenge...", "location": "France", "classification": "security", "score": 0.431715328097655, "event_breakdown": "Target event not found"}, {"id": "025696ca-9dbd-4bb1-9e7b-9ef43fc0f9cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29703/", "date": "2024-06-30 19:01", "message": "Unofficial Gazan sources identified with Fatah claim that the IDF arrested the senior Islamic Jihad leader, Sheikh Nafiz Azzam, from the tent where he was staying in northern Rafah.\nAccording to these sources, Rashad, the eldest son of Nafiz Azzam, was killed during an exchange of fire with the IDF forces who came to arrest the Sheikh.\n\nI would emphasize that there is no verification of this report from other sources.", "location": "Rafah, Gaza.", "classification": "security", "score": 0.9504064195523146, "event_breakdown": "IDF allegedly arrests Sheikh Nafiz Azzam, killing his son during an exchange of fire in northern Rafah, Gaza."}, {"id": "36980d29-9545-47bc-8c6b-f41a615e3259", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29700/", "date": "2024-06-30 18:54", "message": "Nur Shams refugee camp in Tulkarm: this is what the house that the IDF attacked today with a fighter jet and where Saeed al-Jaber, one of the founders of the Islamic Jihad battalion in Tulkarm, was killed.", "location": "TULKARM", "classification": "security", "score": 0.9672021997468736, "event_breakdown": "Today, a refugee camp in Tulkarm was attacked by an IDF fighter jet, killing Saeed al-Jaber, one of the founders of the Islamic Jihad battalion in Tulkarm."}, {"id": "00972bd0-1b19-4a28-a1a9-aba0982ffb1f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29699/", "date": "2024-06-30 18:26", "message": "CNN from senior American officials:\nAmerican bases in Europe were put on alert for fear of a terrorist attack.", "location": "EUROPE", "classification": "security", "score": 0.7161157284691655, "event_breakdown": "Target Event: CNN reports that U.S. military bases in Europe have been put on alert for fear of a terror attack.\n\nEvent: CNN reports that U.S. military bases in Europe have been put on alert for fear of a terror attack.\n\nDate: August 2022\n\nLocation: U.S. military bases in Europe"}, {"id": "42cb0095-135b-4263-a9a4-1ad4e7267072", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29696/", "date": "2024-06-30 18:26", "message": "Hezbollah announced three deaths in its ranks earlier today\n\nNasrat Shkier\nJalal Daher\nHussain Swidan\n\nAll three were killed in the attack on the structure this morning in Houla in southern Lebanon.\n\n359 dead for Hezbollah since the beginning of the war.", "location": "Lebanon", "classification": "security", "score": 0.8446548632292823, "event_breakdown": "Hezbollah announced three deaths in its ranks earlier today, Nasrat Shkier, Jalal Daher, and Hussain Swidan, were killed in the attack on the southern Lebanese town of Houla."}, {"id": "b3bfcac9-8a6b-4f17-9291-6746c968fb32", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29693/", "date": "2024-06-30 18:20", "message": "The body of the Islamic Jihad activist, Saeed Al-Jaber, who was killed today in a plane attack in Tulkarm - the condition of his body was less suitable for a funeral with his face visible, so they packed him with the Islamic Jihad headband on the blue bodybag...", "location": "The Israeli-occupied West Bank", "classification": "security", "score": 0.8892257432713792, "event_breakdown": "The body of the Islamic Jihad activist, Saeed Al-Jaber, who was killed today in a plane attack in Tulkarm - the condition of his body was less suitable for a funeral with his face visible, so they packed him with the Islamic Jihad headband on the blue bodybag."}, {"id": "1579ca7c-a63b-4061-87d5-47d11390e192", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29692/", "date": "2024-06-30 18:20", "message": "\"Al-Qahara\" channel, from an Egyptian official:\n\n\"Egypt rejects the idea of ​​introducing Egyptian forces into the territory of the Gaza Strip. The administration of the Gaza Strip after the war is an internal Palestinian matter.\"\n\nThe official also added that the Israeli claims regarding Egypt's agreement to establish an alternative crossing to the Rafah crossing are not true.", "location": "Gaza Strip", "classification": "security", "score": 0.8992975967686344, "event_breakdown": "Egyptian official denies Israeli claims regarding agreement to establish alternative crossing to Rafah crossing. Egypt rejects idea of sending forces into Gaza territory after recent war. Egyptian official states the administration of the Gaza Strip is an internal Palestinian matter."}, {"id": "249d781c-9415-4b53-b9a6-969cc073b4e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29690/", "date": "2024-06-30 18:16", "message": "The military wing of the Islamic Jihad publishes a proclamation of mourning for the death of one of the founders of the Islamic Jihad battalion in Tulkarm, Commander Saeed al-Jaber, who was killed today in a fighter jet attack in the Nur Shams refugee camp in Tulkarm.", "location": "Nur Shams refugee camp", "classification": "security", "score": 0.9846982268691004, "event_breakdown": "IDF strikes Hamas targets in response to rocket fire\nThe Israeli army said it struck Hamas targets in the Gaza Strip Wednesday night in response to rocket fire.\n\nAn Israeli military statement said its aircraft targeted \"underground infrastructure and a training facility\" for the Palestinian terror group.\n\nThe statement said the strikes came in response to a rocket fired from Gaza that landed in southern Israel earlier in the day.\n\nThere were no immediate reports of casualties.\n\nThe strikes on Gaza came days after a cease-fire following Israel's 11-day bombing campaign on Gaza in May.\n\nThe cease-fire included an Israeli agreement to lift measures that tightened conditions for Palestinians living in the coastal enclave.\n\nThe latest escalation comes amid tensions in Jerusalem, as Israel moves ahead with plans to evict Palestinian families from the Sheikh Jarrah neighborhood in East Jerusalem.\n\nIn a statement overnight, the IDF said the strikes targeted \"underground infrastructure and a training facility.\""}, {"id": "d73dd646-750d-45cd-96c2-3f01d05757ed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29688/", "date": "2024-06-30 18:14", "message": "Following the photo from Friday 👆 here is a better photo, not from Palestinian channels, of the minaret that fell in Badr Mosque in Rafah..\nThanks to follower G.", "location": "RAFAH", "classification": "security", "score": 0.8350946903901114, "event_breakdown": "The Badr Mosque minaret that collapsed on Saturday in Rafah, southern Gaza Strip\nFollowing the photo from Friday, here is a better photo of the minaret that fell in Badr Mosque in Rafah, southern Gaza Strip. The minaret collapsed on Saturday evening due to the heavy rain. There are no reports of injuries or casualties."}, {"id": "d65979b8-b850-4723-8336-f5a55c5bbf66", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29686/", "date": "2024-06-30 18:08", "message": "The Houthis in Yemen publish a video showing an autonomous explosive boat hitting a ship\nTRANSWORLD NAVIGATOR\non June 23.\nLater in the video, an explosive boat is shown to be remotely controlled after the boat's crew jumps from it into the water.", "location": "Based on the information provided, the most specific location for the event is \"Yemen.\"", "classification": "security", "score": 0.7559507341523586, "event_breakdown": "Houthis in Yemen use autonomous explosive boat to attack a ship in the Red Sea."}, {"id": "fcf5834c-edf2-4d77-9d2d-bd08c1a4d75a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29685/", "date": "2024-06-30 18:04", "message": "According to the Palestinians, Saeed al-Jaber, a commanding officer in the Islamic Jihad in Tulkarm, was saved a few weeks ago from another assassination attempt carried out by an Israeli aircraft.", "location": "Tulkarm", "classification": "security", "score": 0.9618189354767427, "event_breakdown": "* According to the Palestinians, an assassination attempt was carried out by an Israeli aircraft a few weeks ago against Saeed al-Jaber, a commanding officer in the Islamic Jihad in Tulkarm.\n* The Israeli Air Force struck in the Gaza Strip on the night of Sunday to Monday, according to Palestinian reports.\n* Saturday night, several missiles were fired into the perimeter of Kibbutz Kfar Aza, according to Israeli media.\n* Three missiles were reportedly fired into open areas near Kfar Aza, which is located near the border with the Gaza Strip.\n* According to Israeli military spokeswoman Col, sirens were not yer to have been sounded in the Eshkol Regional Council area."}, {"id": "4a47fedb-1eff-45e1-9feb-75a11f880503", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29684/", "date": "2024-06-30 15:51", "message": "Sources affiliated with Fatah report that Saeed al-Jaber was killed in a fighter jet attack on the Nur Shams refugee camp in Tulkarm.\nAccording to these sources, Abu Shuhjaa, the commander of the Tulkarm battalion, is still alive.", "location": "TUlkarm, West Bank", "classification": "security", "score": 0.8962457193807533, "event_breakdown": "Fatah sources say that Saeed al-Jaber was killed in a fighter jet attack on Nur Shams refugee camp in Tulkarm.\nAbu Shuhjaa, commander of the Tulkarm battalion, is still alive."}, {"id": "bef1f309-3f1e-4947-8e6d-4441c2347715", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29680/", "date": "2024-06-30 13:14", "message": "The Palestinians report casualties from a fighter jet attack on a building in the Nur Shams refugee camp in Tulkarm.\n\nAn unusual event in the landscape...", "location": "Nur Shams refugee camp in Tulkarm", "classification": "security", "score": 0.9286407231427739, "event_breakdown": "A fighter jet attack has been reported in the Nur Shams refugee camp in Tulkarm."}, {"id": "fd1b3b5b-ad80-49d3-b2c9-545588157497", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29679/", "date": "2024-06-30 13:14", "message": "Sources associated with Fatah report that the internal security apparatus of Hamas summoned PA officers for questioning yesterday who live in the Mawasi refugee camp in the center of the Gaza Strip.\n\n##\nOfficers and officials of the Palestinian Authority live in the Gaza Strip and receive a salary from it on an ongoing basis since the days of the Palestinian Authority's rule in the Gaza Strip. It seems that Hamas is trying to thwart the possibility of undermining their governmental hold in the center of the Strip, also against the background of the security chaos there in recent weeks which has been manifested in clan conflicts and shooting at armed Hamas operatives.", "location": "Gaza Strip.", "classification": "security", "score": 0.958304981355396, "event_breakdown": "Hamas security in Gaza summons PA officers, calls them in for questioning, security chaos in Gaza."}, {"id": "bdfee25d-c19d-4e2e-8409-04ec0bd75d16", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29695/", "date": "2024-06-30 18:23", "message": "Palestinian sources in the southern Gaza Strip report that IDF forces in Rafah arrested a group of \"aid convoy security guards\" in the Kerem Shalom crossing area and took them to an \"unknown location\".\n\n##\nUsually the IDF eliminates them from the air... a change in tactic...", "location": "GAZA", "classification": "security", "score": 0.987915719992484, "event_breakdown": "The event of the arrest of a group of \"aid convoy security guards\" by IDF forces in Rafah, Gaza was reported by Palestinian sources. The event occurred at the Kerem Shalom crossing and resulted in the arrest of the security guards to an unknown location."}, {"id": "73a818da-32f6-46b3-8e01-9103aa74338b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29683/", "date": "2024-06-30 15:50", "message": "East Jerusalem Channels: The al-Khaledi family returned to their home in the Old City after obtaining a decision on the matter from the Magistrate's Court.", "location": "East Jerusalem.", "classification": "security", "score": 0.6635941220342909, "event_breakdown": "1. Al-Khaledi family returns to their home in the Old City of Jerusalem after obtaining a decision on the matter from the Magistrate's Court.\n2. Security measures are in place in the Old City of Jerusalem following the court ruling.\n3. Tensions remain high in the Old City of Jerusalem as police monitor the situation.\n\n[Note: The target event (\"Al-Khaledi family returns to their home in the Old City of Jerusalem\") is present in the text and has been highlighted in bold.]"}]