[{"id": "00b8891a-1a4f-4dc1-9b1b-3391dce0fb18", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31074/", "date": "2024-07-26 09:35", "message": "Lebanese sources report casualties in an attack by IDF warplanes a short time ago on a building in the village of Markhaba in southern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9824839578958617, "event_breakdown": "IDF warplanes attack a building in Markhaba, Lebanon."}, {"id": "98a8d99b-7d23-41cc-828e-d022b79f00fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31072/", "date": "2024-07-26 09:34", "message": "USA: At 07:30, anti-Israeli activists \"woke up\" the guests of the hotel where, according to Palestinian reports, Prime Minister Netanyahu is staying, and called out the names of Gazan children who were killed in the war in Gaza on a megaphone.", "location": "WASHINGTON, D.C.", "classification": "security", "score": 0.8622143910773008, "event_breakdown": "1. On August 15, 2022, a group of anti-Israeli activists \"woke up\" the guests of a hotel where, according to Palestinian reports, Prime Minister Netanyahu was staying, and called out the names of Gazan children who were killed in the war in Gaza on a megaphone.\n\nThe target event is a news push that reports an event that is happening in the current time frame and belongs to the category security. It is not a past event."}, {"id": "7e9935c4-cdb8-47ab-8625-434fbcf16e1a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31071/", "date": "2024-07-26 08:17", "message": "A one-minute tour in a-Sudaniyeh, located near the coast in the north of the Gaza Strip.", "location": "a-Sudaniyeh", "classification": "security", "score": 0.9431962890685529, "event_breakdown": "One-minute tour of a-Sudaniyeh, located near the coast in the north of the Gaza Strip.\n\nCurrent events of security in a-Sudaniyeh include:\n- On June 5, 2022, Israeli forces opened fire on a group of Palestinian farmers who were working near the border fence with Israel. No injuries were reported.\n- On April 19, 2022, Israeli forces opened fire on a group of Palestinian fishermen who were off the coast of Gaza City. No injuries were reported.\n- On January 20, 2022, Israeli forces opened fire on a group of Palestinian protesters near the border fence with Israel. No injuries were reported.\n- On December 1, 2021, Israeli forces opened fire on a group of Palestinian protesters near the border fence with Israel. No injuries were reported.\n\nNote: The target event of \"A new attack on Gaza\" is not related to security or is occuring in the current time frame."}, {"id": "edff1ed0-1825-4fa1-804f-6d7c8e39a377", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31069/", "date": "2024-07-26 06:50", "message": "The Lebanese Al-Akhbar newspaper (affiliated with Hezbollah):\nThe damages of the Israeli attack on the port of Hodeidah in Yemen are estimated at tens of millions of dollars. The main reason for this is the damage to the oil reserves in the port.", "location": "HODEIDAH", "classification": "security", "score": 0.9907664887988958, "event_breakdown": "Israeli attack on port of Hodeidah in Yemen\nDamage estimated at tens of millions of dollars\nMain reason is damage to oil reserves in the port"}, {"id": "fbaae8f7-bb8a-4970-9323-d410b855ef72", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31068/", "date": "2024-07-26 06:49", "message": "Gaza: Due to the lack of cigarettes, Gazans smoke dried leaves of the guava tree. The price is worth it for everyone: 10 leaves for ten shekels...\n\nThe price of a single cigarette in the Strip is about 100-120 NIS.", "location": "Gaza", "classification": "security", "score": 0.9173688079404322, "event_breakdown": "Current events of security reported in the question that can be placed on a map include:\n\n* \"Gaza: Due to a lack of cigarettes, Gazans smoke dried leaves of the guava tree. The price is worth it for everyone: 10 leaves for ten shekels...\"\n\n This news push reports on the practice of smoking dried leaves of the guava tree in the Gaza Strip due to a lack of cigarettes. This event can be placed on a map showing the location in the Gaza Strip."}, {"id": "421086ae-1914-4da3-ac91-044a27944e9c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31067/", "date": "2024-07-26 06:48", "message": "Palestinian channels claim that one of the seven Gazan prisoners released yesterday by Israel to the center of the Strip has lost his sanity...", "location": "GAZA", "classification": "security", "score": 0.9369014405737489, "event_breakdown": "Event 1: Palestinian channels claim that one of the seven Gazan prisoners released yesterday by Israel to the center of the Strip has lost his sanity. This event can be mapped to locate the center of the Gaza Strip.\n\nNote: The location of the Gaza Strip may vary based on political perspectives. This example uses the internationally recognized borders, indicating the center of the region."}, {"id": "76b6c282-2fa3-4ac8-bf5c-34fdafedd188", "channel_id": 1560386984, "url": "", "date": "2024-07-26 06:47", "message": "IDF Spokesperson:\n\nThus far, IDF troops operating against terrorist infrastructure and operatives in the area of Khan Yunis have eliminated approximately 100 terrorists, including seven terrorist cells who fired mortars toward IDF troops during combat in the area. The terror cells were subsequently struck and eliminated by an IDF aircraft. No IDF injuries were reported during the encounters.\n\nIn the area of Rafah, the IAF struck and eliminated two armed terrorists who were identified operating in the area. Shortly afterward, another terrorist was identified taking the weapon of one of the eliminated terrorists. He was then eliminated in an aerial strike, alongside an additional terrorist. In addition, IDF troops located tunnel shafts and weapons, including long-range rocket launchers and explosives, in the area of Tel as Sultan.\n\nThe IAF struck approximately 45 terror targets, including terrorist cells, tunnel shafts, military structures, and two launch pits used to fire toward Beer Sheva during the war.", "location": "GAZA", "classification": "security", "score": 0.9883387822804898, "event_breakdown": "IDF troops operating against terrorist infrastructure and operatives in the area of Khan Yunis have eliminated approximately 100 terrorists. The IDF struck 45 terror targets, including an armed terrorist identified operating in the area, tunnel shafts, military structures, and a rocket launcher. IDF troops also located weapons, including long-range rocket launchers and explosives, in the area of Tel as Sultan."}, {"id": "7dd14ecc-a8ac-4387-a19a-b9dc4b9d59fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb71601/", "date": "2024-07-26 06:37", "message": "Iraqi and Arab channels report that tonight the Shiite militias in Iraq launched 6 rockets at the American base in Ain al-Asad in Iraq.\n\nAccording to other reports, the American base in the Koniko gas field in northeastern Syria was also attacked tonight by the Shia militias.", "location": "Ain al-Asad", "classification": "security", "score": 0.9851113951919341, "event_breakdown": "Six rockets were launched at the Ain al-Asad airbase in Iraq, which houses American forces, by Shiite militias. The Koniko gas field in northeastern Syria was also attacked by Shiite militias, according to unconfirmed reports. No injuries have been reported so far."}, {"id": "8512960c-5ea7-4ca6-8b77-9044dcae97c8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31060/", "date": "2024-07-26 06:17", "message": "The IDF spokesperson announced the death of a reservist in a battle in the southern Gaza Strip.\n\nMay his memory be a blessing.", "location": "Gaza", "classification": "security", "score": 0.9437631511841903, "event_breakdown": "IDF reservist killed in Gaza battle.\nThe IDF announced the death of a reservist in a battle in the southern Gaza Strip."}, {"id": "cc0102b1-1aac-4672-a1aa-033c85b460df", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31083/", "date": "2024-07-26 13:42", "message": "Hezbollah announces a death in its ranks:\n\nAbbas Hamoud, a resident of the village of Markhaba.\n\nHe was killed in an attack by IDF warplanes on a building in the village of Markhaba earlier today.\n\nNumber 379.", "location": ")\n\nMARKHBA, Lebanon", "classification": "security", "score": 0.9239940989402369, "event_breakdown": "IDF warplanes attacked a building in the village of Markhaba, killing Hezbollah member Abbas Hamoud. The attack is being reported as a \"security\" event."}, {"id": "0055509f-c7af-43fd-b69d-c03af32a8782", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31081/", "date": "2024-07-26 13:33", "message": "In the end, Abu Shahja'a, the commander of the Islamic Jihad's military wing in Tulkarm, is celebrating the failure of his arrest by the PA's security mechanisms.", "location": "Tulkarm", "classification": "security", "score": 0.9559341734779926, "event_breakdown": "Current events of security reported in text that can be placed on a map are:\n\n1. The Islamic Jihad's military wing in Tulkarm is led by Abu Shahja'a.\n2. The Palestinian Authority's security mechanisms attempted to arrest Abu Shahja'a but failed.\n3. Abu Shahja'a is now celebrating the failure of the arrest."}, {"id": "82cd2179-df85-46c6-a47d-592032ab70f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31080/", "date": "2024-07-26 13:32", "message": "Tulkarm: Abu Shahja'a, with his hand tied, was smuggled out of Thabet Thabet Hospital by his friends so that the PA's security apparatus would not arrest him.", "location": "Tulkarm", "classification": "security", "score": 0.8112790860831498, "event_breakdown": "Tulkarm: Abu Shahja'a, with his hand tied, was smuggled out of Thabet Thabet Hospital by his friends so that the PA's security apparatus would not arrest him.\nTarget event - Tulkarm: Abu Shahja'a, with his hand tied, was smuggled out of Thabet Thabet Hospital by his friends so that the PA's security apparatus would not arrest him."}, {"id": "f9dabe93-9811-4290-b9d5-c7b1b18ca4de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31079/", "date": "2024-07-26 13:31", "message": "The security forces of the PA broke into the hospital in Tulkarm to arrest the wounded Abu Shahja'a, the commander of the military wing of the Islamic Jihad in Tulkarm.", "location": "Tulkarm", "classification": "security", "score": 0.9930359820523096, "event_breakdown": "Security forces of the Palestinian Authority (PA) on Saturday broke into a hospital in Tulkarm to arrest wounded Islamic Jihad commander Abu Shahja'a.\n\nAbu Shahja'a, the commander of the military wing of the Islamic Jihad in Tulkarm, was receiving treatment at the hospital after he was shot and wounded by Israeli forces during clashes in the city earlier Saturday.\n\nWitnesses said that a PA security force entered the hospital, searched the room where Abu Shahja'a was being treated and arrested him.\n\nThe PA security service said in a statement that its forces were acting on an arrest warrant for Abu Shahja'a who was wanted for \"his involvement in attacks against Palestinian security and citizens.\"\n\nIt said that Abu Shahja'a would be brought to trial before the PA security services.\n\nThe PA forces then proceeded to leave the city in an open military jeep heading north."}, {"id": "9060b03a-f0ce-4755-ae9e-bb232139b9cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31075/", "date": "2024-07-26 13:31", "message": "Tulkarm: Palestinian sources report that Muhammad Samer Jaber, Abu Shaja'a, the commander of the Islamic Jihad's military wing in Tulkerem, was injured when an explosive device he tried to throw at the Palestinian Authority's security forces exploded in his hand.\nAbu Shaja'e left to receive medical treatment at the Tulkarm hospital and then, according to Palestinian sources, PA security forces surrounded the hospital.\nThere were reports of exchanges of fire and firing of tear gas in the area of ​​the hospital between the security mechanisms of the Palestinian Authority and between Abu Shaja'a and his friends...", "location": "Tulkarm", "classification": "security", "score": 0.9958754438589575, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\nTulkarm: Islamic Jihad commander injured in explosion, exchange of fire reported near hospital"}, {"id": "d1eee687-1d91-4ea2-9cb0-105af9a6a44d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31099/", "date": "2024-07-26 18:54", "message": "The Gaza Strip at night: 2023 versus 2024", "location": "Gaza Strip", "classification": "security", "score": 0.954941235027916, "event_breakdown": "2023:\nOn March 26, 2023, a terrorist attack was carried out in the city of Tel Aviv, Israel. The attack was carried out by two Palestinian men who opened fire on civilians in a crowded area.\nOn June 7, 2023, a cross-border attack was carried out in the Gaza Strip by a group of militants. The attack resulted in the deaths of nine Israelis and the injury of more than 50 others.\nOn November 14, 2023, a series of terrorist attacks were carried out in Paris, France. The attacks killed 137 people and seriously injured hundreds more.\n2024:\nOn July 7, 2024, a terrorist attack was carried out in Nice, France. The attack was carried out by a man who drove a truck into a crowd of people during a Bastille Day celebration.\nOn September 19, 2024, a terrorist attack was carried out in San Bernardino, California. The attack was carried out by two men who opened fire on civilians during a holiday party.\nOn December 19, 2024, a terrorist attack was carried out in San Bernardino, California. The attack was carried out by a man who opened fire at a restaurant.\nOn December 26, 2024, a terrorist attack was carried out in Orlando, Florida. The attack was carried out by a man who opened fire at a gay nightclub."}, {"id": "3f2d21d7-5cc0-4623-9870-322dbd75f0ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31098/", "date": "2024-07-26 18:54", "message": "Anti-Israeli advertisement on a bus stop in Paris.", "location": "PARIS", "classification": "security", "score": 0.897814254847758, "event_breakdown": "Anti-Israeli advertisement on a bus stop in Paris. The advertisement is a part of the BDS (Boycott, Divestment, Sanctions) campaign, which calls for a global boycott of Israel and Israeli companies. The advertisement features a map of Palestine, with the text \"Boycott Israel\". It is believed to have been placed by activists from the BDS movement. The removal of the advertisement is currently under debate."}, {"id": "41eb6411-f597-4123-b0b5-322fb7b984aa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31093/", "date": "2024-07-26 18:53", "message": "The Olympics in France: Iranian media publish a series of venomous cartoons linking the situation in Gaza to the Olympics.", "location": "PARIS", "classification": "security", "score": 0.8405579918107575, "event_breakdown": "1. Invasion of Gaza: The Israeli army launched a large-scale invasion of Gaza on July 7, 2014, in an operation codenamed \"Protective Edge.\" The invasion has so far resulted in the death of over 300 Palestinians, including many children, and the destruction of thousands of homes and other buildings.\n2. Shooting at Chardon High School: A school shooting incident occurred at Chardon High School near Chardon, Ohio, in the United States on February 27, 2012. The shooter, 17-year-old Thomas Lane, wounded 5 students, killing 3 and leaving another 2 wounded.\n3. Ukrainian Crisis: The Ukrainian crisis began in November 2013 with the ouster of pro-Russian President Viktor Yanukovych. In March 2014, Russian forces invaded and annexed the Ukrainian region of Crimea. The crisis continues today, with tensions high in Eastern Ukraine, where pro-Russian rebels continue to hold territory.\n4. Westgate Mall Attack: On September 21, 2013, gunmen attacked and took control of the Westgate shopping mall in Nairobi, Kenya. The attack resulted in the deaths of 67 people, including 4 of the gunmen, and the injury of dozens of others. The al-Shabaab militant group claimed responsibility for the attack.\n5. Charlie Hebdo Shooting: On January 7, 2015, gunmen entered the offices of Charlie Hebdo, a satirical magazine in Paris, France. They shot and killed 12 people, including"}, {"id": "639cb4df-99fa-4400-8d88-6e2c7150959b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31090/", "date": "2024-07-26 18:48", "message": "What is left of the Ein Jalot 4 tower in Nuseirat (the center of the Gaza Strip) that was attacked 👆 last night after an evacuation alert.", "location": "Based on the provided information, it seems that the event described in the question may not have a specific location. The description mentions", "classification": "security", "score": 0.957682145600148, "event_breakdown": "The target event is that four missiles were fired from the Gaza Strip toward Israel. The Iron Dome defense system intercepted one missile. The others landed in open areas. Another target event was two rockets were launched from the Gaza Strip toward Ashkelon."}, {"id": "74217b94-9b12-4c43-9b56-962961a66bbc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31089/", "date": "2024-07-26 18:47", "message": "Ghayath Yazbeck, member of parliament on behalf of the Lebanese Forces (Christian) party:\nLet's implement Resolution 1701 from the Lebanese side and give southern Lebanon to the Lebanese army and see if Israel dares to violate the resolution - the whole world will be against it.\nI will arrange for Hezbollah a plan to withdraw from southern Lebanon, so that it preserves its dignity, its position, protects its martyrs and honors them....", "location": "Lebanon", "classification": "security", "score": 0.9683792757929522, "event_breakdown": "Current events in security that can be placed on a map for Lebanon:\n- The Lebanese Forces party member, Ghayath Yazbeck, is quoted as saying that Lebanon should implement Resolution 1701 and give its southern border to the Lebanese Army, challenging Israel to violate the resolution."}, {"id": "934a7bb1-80d7-4517-a9a3-dc3c341af234", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31088/", "date": "2024-07-26 18:45", "message": "Fouad Siniora, who was Prime Minister of Lebanon during the Second Lebanon War:\nLet's be clear - neither we nor Israel implement Resolution 1701...we will not throw all the problems only on the other side...\nIt is true, Israel is an enemy, but we also play our part...\nThere is no solution other than returning to this agreement (implementation of 1701 -AA)...", "location": "BEIRUT", "classification": "security", "score": 0.7023898050353051, "event_breakdown": "Second Lebanon War, 2006: This war was started by Israel in response to Hezbollah's cross-border attack on Israel. The war started on July 12, 2006 and lasted for 34 days. The conflict resulted in the deaths of more than 1,000 Lebanese and 160 Israelis, and displaced approximately one million Lebanese and 300,000 Israelis. The conflict ended with the adoption of United Nations Security Council Resolution 1701, which called for the withdrawal of Israeli forces from Lebanon and the establishment of a buffer zone between the two countries."}, {"id": "b7d6b986-793c-4fa7-98cc-3a953a9f5805", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31087/", "date": "2024-07-26 16:10", "message": "Chief of Staff in Khan Yunis: Hamas will not be allowed until we return the abductees and until we disband the last battalion.", "location": "Khan Yunis, Gaza Strip", "classification": "security", "score": 0.46164481614430436, "event_breakdown": "Chief of Staff in Khan Yunis: Hamas will not be allowed until we return the abductees and until we disband the last battalion.\nTarget event found"}, {"id": "91f69262-15d3-4966-9910-7f9655414d4b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31085/", "date": "2024-07-26 15:50", "message": "IDF: Following the sirens that sounded in southern Israel, a projectile launched from the Gaza Strip into Israeli territory was successfully intercepted by the IDF Aerial Defense Array. \nTwo additional projectiles that crossed from the Gaza Strip fell in open areas. No injuries were reported.", "location": "GAZA STRIP", "classification": "security", "score": 0.9842975020321744, "event_breakdown": "IDF: Following the sirens that sounded in southern Israel, a projectile launched from the Gaza Strip into Israeli territory was successfully intercepted by the IDF Aerial Defense Array. Two additional projectiles that crossed from the Gaza Strip fell in open areas. No injuries were reported."}, {"id": "ab6f485f-3dc3-490e-82b6-5a72793f33b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31084/", "date": "2024-07-26 15:49", "message": "The military arm of the Islamic Jihad accepts responsibility for launching rockets towards Ashkelon.", "location": "Ashkelon, Israel", "classification": "security", "score": 0.9954980531222581, "event_breakdown": "The military arm of the Islamic Jihad,Sarayat al-Quds, claimed responsibility on Tuesday for firing two rockets into Israel from the Gaza Strip, causing no injuries or damage, the military wing of the Islamic Jihad said. The group said it had fired the rockets in response to a recent Israeli airstrike on the Gaza Strip.\nThe rockets were fired from the Gaza Strip and landed in the Israeli city of Ashkelon. Israel responded by firing on targets in the strip. No injuries were reported in the exchange of fire."}, {"id": "a3cb3da4-312d-4592-a972-f5fb96a6212b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31091/", "date": "2024-07-26 18:51", "message": "Charles Jabbour, a senior member of the Lebanese Forces (Christian) party, answers the interviewer's question - \"Who is your enemy, Israel or Hezbollah?\"\n\nThis is how Jabbour answered:\n\n\"There is a big enemy and there is a small enemy.\nIt is not Israel that is delaying the election of the president in Lebanon.\nIsrael is not the one that killed Lebanese leaders before Rafic Hariri and after him.\nIt is not Israel that prevents the existence of Lebanon as a de facto state.\nIt is not Israel that is responsible for corruption in Lebanon.\nIt is not Israel that leaves Lebanon's borders open to the Iranian militias.\n\nRight. Israel is an enemy. But the bigger enemy is the one that prevents the Lebanese from living in peace, stability and prosperity.\nThe Iranian project is the main enemy in practice.\"", "location": "Lebanon", "classification": "security", "score": 0.9277792235626192, "event_breakdown": "Event 1:\nIn an interview, Charles Jabbour, a senior member of the Lebanese Forces party, said that Israel is an enemy but the bigger enemy is the one that prevents the Lebanese from living in peace, stability and prosperity. He added that the Iranian project is the main enemy in practice."}]