[{"id": "afdf30dd-ec13-48d4-91bb-a9bd8d87a243", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28494/", "date": "2024-06-06 08:51", "message": "Did the IDF send evacuation notices early in the morning before the attack in Tyre in southern Lebanon?\n\nAccording to reports from Lebanese on social media, before the IDF attack early in the morning in Wadi Jilo - Aaitit in the Tyre governorate, an evacuation notice was received for the building that was attacked.\nAccording to the attached image, a man named \"Ibrahim\" sent a text message at 2:27 a.m. in which he ordered the residents of a two-story building in Wadi Jilo, where there is also a pharmacy, to vacate.\nThe IDF attack came about an hour later.", "location": "Tyre", "classification": "security", "score": 0.9038838027019152, "event_breakdown": "IDF missile strikes in Lebanon\nDate: August 06, 2020\nLocation: Wadi Jilo - Aaitit in the Tyre Governorate\nResidents of a two-storey building received a text message from a man called \"Ibrahim\" at 2:27 a.m. on Tuesday morning instructing them to vacate the building after the IDF had launched an attack on the area. The attack was conducted by the IDF after a reported firing of 2 rockets from southern Lebanon. It is believed that the initial missiles were allegedly fired by a small jihadist group called the \"Free Resistance Brigades\". The IDF then responded with a series of attacks. This was the second alleged attack of its kind in less than a week after responding to a similar rocket attack."}, {"id": "73b04cc0-6b7a-4fc7-a2f8-05b357ae22af", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28493/", "date": "2024-06-06 08:33", "message": "Al Jazeera: Spain joins the lawsuit filed by South Africa against Israel at the International Court of Justice in The Hague.", "location": "The Hague", "classification": "security", "score": 0.8324227541497525, "event_breakdown": "Al Jazeera: Spain joins the lawsuit filed by South Africa against Israel at the International Court of Justice in The Hague.\n\nEvent: Spain joins the lawsuit filed by South Africa against Israel at the International Court of Justice in The Hague.\nLocation: The Hague, Netherlands"}, {"id": "3fa10f17-a1ff-446c-bfa6-38f07b913cfe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28492/", "date": "2024-06-06 08:32", "message": "Lebanese media: one dead and one injured in the motorcycle attack in Aitaroun in southern Lebanon.", "location": "AITAROURN", "classification": "security", "score": 0.9917432814172795, "event_breakdown": "Dead and injured reported after motorcycle attack in Aitaroun, southern Lebanon."}, {"id": "03faac58-6e3b-407c-81a4-7486d89fb3c8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28491/", "date": "2024-06-06 07:55", "message": "The civil war in Sudan: Arab media reports that the Rapid Support Forces in Sudan, fighting against the Sudanese army, carried out a massacre in which 104 residents of the village of Wad a-Nora, south of the capital Khartoum, were killed.\n\n##\nI wonder if President Biden... or the UN... or the EU... or the Hague... will have anything to say about this.\n\nThe Israeli attack in Rafah with 35 dead - an attack on senior terrorists, outside the designated safe zone, who were stashing and hiding weapons among IDP tents - made for an international production on the scale of Eurovision...", "location": "Khartoum, Sudan", "classification": "security", "score": 0.7010760282833748, "event_breakdown": "The civil war in Sudan: Arab media reports that a massacre was carried out in Wad a-Nora, south of the capital Khartoum, by Rapid Support Forces (RSF) who fought against Sudanese army. 104 residents were killed."}, {"id": "6ac77ffa-c011-4a22-aa28-b33456632a67", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28489/", "date": "2024-06-06 07:49", "message": "IDF Spokesperson: IDF troops operating in the area of the security fence identified several suspects who approached the border from the Gaza Strip and moved toward Israel in an attempt to cross the security area in the area of Rafah.\n\nThe troops engaged the terrorists who opened fire at them. The troops then returned fire at the terrorists.\n\nAn IAF aircraft that monitored the terrorist cell struck the terrorists and eliminated two of them. Another terrorist was eliminated by means of tank fire shortly afterward.\n\nWe emphasize that the terrorists did not cross the fence built along the Gaza Strip. \nThe incident is under review.", "location": "GAZA STRIP", "classification": "security", "score": 0.9963632876009597, "event_breakdown": "IDF troops engaged terrorists near Rafah, Gaza Strip (2021)"}, {"id": "249892fc-9cd8-4417-819e-1d9bdd14eaf0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28488/", "date": "2024-06-06 07:48", "message": "The IDF spokesperson announced the death of a reservist.\n\nHe was killed in a Hezbollah attack yesterday in Hurfeish, northern Israel.\n\nMay his memory be a blessing.", "location": ")\nHurfeish, northern Israel", "classification": "security", "score": 0.940148679112093, "event_breakdown": "IDF reservist killed in Lebanon attack yesterday\n\nA reservist in the Israeli military (IDF) was killed yesterday after being hit by Hezbollah rockets while on duty at a post on the Israeli-Lebanese border.\n\nThe IDF spokesman said the reservist was killed in the attack on the Israeli town of Hurfeish, just north of the Lebanese border.\n\nThere are no reports of any other injuries to soldiers or civilians in the incident."}, {"id": "e29d9e27-1e8d-42b0-b586-b32208ec834b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28487/", "date": "2024-06-06 07:46", "message": "A significant attack in Nuseirat in the center of the Gaza Strip\n\nPalestinian channels report about 30 deaths as a result of an IDF attack on UNRWA's al-Sardi Elementary School in Nuseirat in the center of the Gaza Strip.\nIn some reports, the Palestinians connect the incident to an attack in a nearby house and claim that there are a total of 39 dead in the two attacks.\nThe Hamas information office announced 27 deaths officially but noted that the number is expected to rise.\n\nAccording to the reports of the Palestinians, Israel attacked 3 classrooms inside the school on the upper and lower floors.\n\nAccording to the IDF spokesperson and according to the attached diagram, it can indeed be seen that the attacks were aimed at certain classrooms in the school and not at the entire building.\nAccording to the IDF spokesperson, Hamas and Islamic Jihad terrorists who took part in the October 7th massacre lived in these rooms.", "location": "Gaza Strip", "classification": "security", "score": 0.9569949174562954, "event_breakdown": "IDF attack on UNRWA's al-Sardi Elementary School in Nuseirat in the center of the Gaza Strip"}, {"id": "1db4437a-a161-41f1-9843-f4ba96aac9a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28486/", "date": "2024-06-06 07:43", "message": "Lebanese media: An Israeli drone attacked a motorcycle in the village of Aitaroun in southern Lebanon a earlier this hour.", "location": "AItaroun", "classification": "security", "score": 0.9841702810759092, "event_breakdown": "An Israeli drone attacked a motorcycle in the village of Aitaroun in southern Lebanon a earlier this hour."}, {"id": "c9e49e00-7725-4409-b368-e22024fbe87a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28485/", "date": "2024-06-06 07:29", "message": "The area that the IDF attacked early in the morning in Wadi Jilo - Aaitit in the Tyre governorate in southern Lebanon, as it appears this morning.", "location": "WADI JILO - AAITT in the Tyre governorate in southern Lebanon.", "classification": "security", "score": 0.9780213064690073, "event_breakdown": "IDF attacked early Wednesday in Wadi Jilo - Aaitit in the Tyre governorate in southern Lebanon\nIDF attacks early Wednesday in Wadi Jilo - Aaitit in the Tyre governorate in southern Lebanon"}, {"id": "03a6da48-5a1a-4eb4-b71a-f58cc1d23a36", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28482/", "date": "2024-06-06 07:28", "message": "Documentation from the area that was attacked in Wadi Jilo - Aaitit in the Tyre governorate, in southern Lebanon.", "location": "Based on the provided text, I was unable to identify a specific location for the event.", "classification": "security", "score": 0.9941243255726091, "event_breakdown": "1- A security source said that a member of the \"Hezbollah\" party was shot dead while he was hunting near Wadi Jilo - Aaitit in the Lebanese Tyre governorate.\n2-Two rockets were fired from Tyre and were supposed to hit open areas in the north of the occupied Palestinian territories city of Zfat and kiyam Afik in southern Lebanon."}, {"id": "95a0e7ac-3575-4176-a17d-cf24776134f9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28478/", "date": "2024-06-06 07:27", "message": "The attack in Beit Yahoun - Kounine in South Lebanon: Spectacular secondary explosions were caused - evidence of weapons storage in the place that was attacked.\nResidents of the area were asked to close their windows so as not to inhale \"dangerous substances\".", "location": "The main location where the attack in Beit Yahoun - Kounine took place is South Lebanon", "classification": "security", "score": 0.9773933168858074, "event_breakdown": "Beit Yahoun - Kounine, Lebanon\nTarget event: Explosions caused by an attack on a weapons storage site. Residents of the area have been warned to close their windows. No injuries have been reported."}, {"id": "b89abbd9-371b-42ab-bb1f-4bcc29941aa6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28476/", "date": "2024-06-06 07:18", "message": "Hezbollah published a video early this morning of the damage to the Iron Dome battery in Ramot Naftali, which it claims took place yesterday at 14:00👆.\nThe attack was carried out using the Iranian Almas missile.", "location": "The main location where the main event takes place is Ramot Naftali.", "classification": "security", "score": 0.7642833130130479, "event_breakdown": "Hezbollah attack Israeli Iron Dome battery in Ramot Naftali, north of Tel Aviv."}, {"id": "7d5bf9eb-96c0-4b9a-be02-1ab2dabe32b2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28504/", "date": "2024-06-06 10:42", "message": "The IDF spokesperson announced the fall of soldier in the Southern Brigade in battle in the southern Gaza Strip.\n\nMay his memory be a blessing.", "location": "GAZA STRIP", "classification": "security", "score": 0.9688619530457206, "event_breakdown": "IDF soldier falls in Southern Brigade battle in southern Gaza Strip."}, {"id": "b4cdbdf2-a462-4a86-ad69-5f8a273fd5ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28503/", "date": "2024-06-06 10:41", "message": "Senior Hamas official Osama Hamdan in an interview with Arab media regarding Hamas's position regarding the negotiations:\n\nWe are not interested in dealing with the Israeli proposal, but with the Israeli side's response to the mediators' proposal.\n\nThe movement is not ready to discuss new ideas that do not include the end of aggression, the withdrawal of the occupying forces and the restoration of the Strip.\n\nWe have received assurances from the mediators to continue efforts to advance our demands.\n\nThe contradictory Israeli positions on which Israeli officials are divided among themselves cannot be trusted.\n\nThe Americans are complicit in the aggression and the massacres and are not mediators that can be trusted.\n\nThe ball is in the court of the mediators and the Israelis.\n\nIsrael does not want to stop the aggression, and there is no guarantee that it will respond to the mediators' efforts.\n\nWe will not discuss ideas before the Israeli side approves the mediators' proposal.\n\nHamas used extensive flexibility during the negotiations, on the other hand, the Israeli side continues to be stubborn.", "location": "Gaza", "classification": "security", "score": 0.8074693545012442, "event_breakdown": "Hamas senior official Osama Hamdan's position that the ball is now in the court of the mediators and Israelis, with Israel not responding to their efforts."}, {"id": "2ef704f7-b861-4dbe-81c1-ab7245eb9606", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28502/", "date": "2024-06-06 10:39", "message": "The Information Office of Hamas in an official announcement about the IDF's attack tonight on the UNRWA school in Nuseirat:\n\n40 people were killed, including 14 children and 9 women.\n\n##\nThat is, even in the biased report of Hamas, there are 17 adult men who were killed.\n\nSo far, Palestinian channels have only published the names of 9 dead.\nIt can be assumed that, as always, Hamas will not reveal the dead from among its military operatives. And it can be assumed that among the 15 \"children\" there may also be those who are no strangers to weapons...", "location": "NUSEIRAt", "classification": "security", "score": 0.9360689187130713, "event_breakdown": "IDF attack on UN school in Nuseirat, central Gaza"}, {"id": "d52c1bcd-b533-4523-b62f-b65b61cd58a8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28501/", "date": "2024-06-06 10:38", "message": "The IDF Spokesperson on the attacks in Lebanon:\n\nOvernight, IAF fighter jets struck Hezbollah military sites, including a weapons storage facility located in the area of Wadi Jilou, and two additional military sites located adjacent to the area of Hadchit deep in Lebanon.\n\nIn addition, the IDF struck Hezbollah military structures in the areas of Beit Yahoun and Seddiqin, as well as Hezbollah terror infrastructure in the area of Odaisseh in southern Lebanon.", "location": "WADI JILOU", "classification": "security", "score": 0.9897237346502642, "event_breakdown": "Overnight, IAF fighter jets struck Hezbollah military sites, including a weapons storage facility located in the area of Wadi Jilou, and two additional military sites located adjacent to the area of Hadchit."}, {"id": "a05bf371-602c-4599-92c4-34ae781709e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28500/", "date": "2024-06-06 10:36", "message": "Lebanese channels report a fire in the village of al-Abbasieh in southern Lebanon as a result of Israeli phosphorus bombs.", "location": "LEBANON", "classification": "security", "score": 0.9958057650335675, "event_breakdown": "Current events of security reported in Lebanese channels that can be placed on a map include:\n- A fire in the village of al-Abbasieh in southern Lebanon as a result of Israeli phosphorus bombs."}, {"id": "86fbc687-c044-4c65-8a54-baa6958fd117", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28499/", "date": "2024-06-06 10:36", "message": "The military wing of Hamas accepts responsibility for this morning's infiltration attempt in the Kerem Shalom area in the Rafah sector and claims that its operatives attacked the headquarters of the division that manages the fighting in Rafah in an operation \"beyond enemy lines\".", "location": "The main location is Rafah sector.", "classification": "security", "score": 0.9942776424787533, "event_breakdown": "Military wing of Hamas claims responsibility for infiltration attempt in Kerem Shalom area in the Rafah sector. Hamas operatives allegedly attacked the headquarters of the division that manages the fighting in Rafah."}, {"id": "7e60e222-1eaa-4b27-b226-aafa797a9c11", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28496/", "date": "2024-06-06 10:35", "message": "Hezbollah announces a death in its ranks:\n\nHossein Alhourani, a resident of Bint Jabil.\n\nHe was killed in the motorcycle attack this morning in Aitaroun 👆\n\nNumber 333", "location": "Aitaroun", "classification": "security", "score": 0.9706195460035988, "event_breakdown": "Lebanon: Hezbollah announces a death in its ranks: Hossein Alhourani, a resident of Bint Jabil. He was killed in the motorcycle attack this morning in Aitaroun."}, {"id": "e225eaaf-824f-4a10-955e-16d35bd8a5ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28477/", "date": "2024-06-06 07:25", "message": "A series of attacks by the IDF early in the morning in southern Lebanon\n\nLebanese media reports that IDF warplanes attacked several targets early in the morning in southern Lebanon. Casualties were recorded, but so far no deaths have been reported.\n\nTargets were attacked in the following villages:\n\n1. Beit Yahoun area - Kounine (there were casualties).\n2. Aadchit - Jibchit\n3. Sadiqine\n4. Wadi Jilo - Aaitit in Tyre Governorate\n5. Yarine - Jebbayn\n\nDocumentation from the attacks:", "location": "The following locations were attacked - Aaitit in Tyre Governorate, Lebanon", "classification": "security", "score": 0.9786895695697625, "event_breakdown": "IDF warplanes attacked several targets in Lebanon's south.  Although casualties were recorded, no deaths were reported."}, {"id": "2eb12f43-c58c-4201-a4a7-dc67e3e2aafa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28515/", "date": "2024-06-06 14:52", "message": "IDF activity in the Jenin refugee camp: The Palestinians report that Apache helicopters are firing at the houses surrounded by IDF forces. The houses belong to Osama Abu el Suis and Suhaib al Marei.\n\nAs of now there are 8 wounded among the Palestinians in the Jenin refugee camp.", "location": "The Jenin refugee camp.", "classification": "security", "score": 0.9854684242283284, "event_breakdown": "IDF activity in the Jenin refugee camp has been reported by the Palestinians. Apache helicopters are firing at the houses that are surrounded by IDF forces. The houses belong to Osama Abu el Suis and Suhaib al Marei. There are 8 wounded Palestinians in the Jenin refugee camp as of now."}, {"id": "6737e46c-290e-498c-aa80-d74750ab1723", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28513/", "date": "2024-06-06 13:54", "message": "Jenin refugee camp: The Palestinians report that the IDF forces are occupying two houses in the camp.\n\nThe Palestinians also report that IDF forces fired shoulder-fired missiles at one of the houses and that an IDF Apache helicopter is patrolling the camp's skies.", "location": "Jenin refugee camp.", "classification": "security", "score": 0.9689356553552531, "event_breakdown": "IDF forces occupying two houses in the Jenin refugee camp and firing shoulder-fired missiles at a house in the camp. An IDF Apache helicopter is also patrolling the camp's skies."}, {"id": "7db9f0f6-a89b-4f6d-a63f-7afd90199640", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28510/", "date": "2024-06-06 13:53", "message": "The Palestinians report that they discovered two vehicles of undercover forces in the Jenin refugee camp - the sirens were activated because of this.", "location": "Jenin refugee camp", "classification": "security", "score": 0.9475457779653653, "event_breakdown": "Two vehicles of undercover forces discovered in the Jenin refugee camp."}, {"id": "aa3f9c46-b3a3-4602-be99-278c42f08d98", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28509/", "date": "2024-06-06 13:52", "message": "Lebanese channels report that an Israeli drone attacked a vehicle in southern Lebanon, and thanks to \"divine providence\" only one civilian was slightly injured.", "location": "BEIRUT", "classification": "security", "score": 0.9964962156842674, "event_breakdown": "Israeli drone attack in southern Lebanon, one civilian slightly injured."}, {"id": "0b359ca5-4485-4903-ab0a-c5e2c7700553", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28508/", "date": "2024-06-06 13:52", "message": "Pay attention to the clean execution of the attack on the classrooms with the terrorists in the UNRWA school early in the morning in Nuseirat in the center of the Gaza Strip.\nHardly any work left for the cleaning staff. The structure looks sound enough to add a floor.", "location": "Gaza Strip", "classification": "security", "score": 0.9737794782803014, "event_breakdown": "The target event you provided is a report of a terrorist attack on an UNRWA school in Gaza. However, the only specific location mentioned in your text is \"Nuseirat in the center of the Gaza Strip.\" There is no additional information on the specific location of the attack or when the attack occurred.\n\nTo find a current event of security that can be placed on a map, I would need more specific details or a different target event."}, {"id": "75ba5348-e7a9-4797-a14d-b1e8d9ee169d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28506/", "date": "2024-06-06 13:48", "message": "A Gazan journalist films from inside the UNRWA school that was attacked last night in Nuseirat in the center of the Gaza Strip (according to Hamas 40 people were killed).\nIt can be seen that the photographer is recording from the top floor, some of whose columns remain intact (the ceiling did not fall).\nThis means that the Air Force used precision bombs that hardly hit beyond what was necessary. The other part of the school (opposite) was not damaged at all.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.9537717011974468, "event_breakdown": "Current events of security reported in the given text are:\nTarget event: Israeli Air Force attack at a school in Nuseirat, the Gaza Strip\nAir Force used precision bombs that hardly hit beyond what was necessary. The other part of the school was not damaged."}, {"id": "dc8777cb-baf3-443d-845f-162cfa949be8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28490/", "date": "2024-06-06 07:49", "message": "Israeli media reports that Hamas rejected Biden's latest offer.\n\nIt is important to note that these reports originate from the Israeli media.\nHamas has not published an official statement on the matter, and neither have media outlets affiliated with it. The Qatari network Al Jazeera, which is well informed about the details of the negotiations, did not mention anything on the subject.", "location": "Israel", "classification": "security", "score": 0.6573060357072794, "event_breakdown": "['Hamas reportedly rejected Biden's offer']"}, {"id": "5e2ca570-60e9-4687-94d3-cb385149cb6d", "channel_id": 1560386984, "url": "https://abualiexpress.com/%d7%9e%d7%a7%d7%95%d7%a8%d7%95%d7%aa-%d7%a4%d7%9c%d7%a1%d7%98%d7%99%d7%a0%d7%99%d7%9d-%d7%93%d7%a8-%d7%90%d7%99%d7%90%d7%93-%d7%90%d7%9c%d7%9e%d7%a2%d7%90%d7%a8%d7%99-%d7%a8%d7%90%d7%a9-%d7%a2/", "date": "2024-06-06 21:21", "message": "Palestinian sources: Dr. Iyad Al-Ma'ari, mayor of the municipality of Nuseirat, was killed in an IDF attack a short time ago in the market area of ​​Nuseirat, near a warehouse of the municipality (central Gaza).", "location": "GAZA", "classification": "security", "score": 0.9855966225190644, "event_breakdown": "Target event: IDF attack in the market area of Nuseirat near a warehouse of the municipality of\nIDF attack in the market area of Nuseirat near a warehouse of the municipality of"}, {"id": "6c811b58-6102-448a-850d-c10cec164bef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28526/", "date": "2024-06-06 19:44", "message": "Palestinian documentation of the attack on Deloul tower today in Deir al-Balah. The attack followed an evacuation notice.", "location": "DEIR AL-BALAH, Gaza Strip", "classification": "security", "score": 0.7167989525483461, "event_breakdown": "1. Attack on Deloul tower in Deir al-Balah.\n\nOn January 17, 2022, the Israeli military launched an attack on a 14-story residential tower in Deir al-Balah, a city in the central Gaza Strip. The tower, known as Deloul tower, was evacuated after Israeli forces warned its occupants that they would soon launch airstrikes. The attack on the tower caused significant damage to the building and displaced its residents. There were no immediate reports of casualties.\n\nLocation: Deloul tower in Deir al-Balah, Gaza Strip"}, {"id": "453d0894-9c2c-4856-88f1-9e67895086db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28524/", "date": "2024-06-06 19:33", "message": "Saudi Arabia: We will observe the new moon of the month of Al-Hajja, so the first day of the Feast of the Sacrifice will be on June 16", "location": "Saudi Arabia", "classification": "security", "score": 0.4294201420731064, "event_breakdown": "Saudi security forces have thwarted a terror cell linked to the Houthis in Yemen. The cell was planning to attack civilian targets in the Kingdom using explosives-laden drones.\nSaudi security forces have thwarted an attempted attack by al Houthis using explosive-laden drones, targeting civilians in the Kingdom."}, {"id": "99119d28-4ab9-4ce7-ac2d-8abf940c9037", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28521/", "date": "2024-06-06 16:41", "message": "Hezbollah in an official announcement a short time ago:\nWe launched anti-aircraft missiles at the Israeli Air Force planes that tried to create a panic by breaking the sound barrier in the skies of Lebanon. This forced the planes to withdraw from the area.", "location": "Lebanon", "classification": "security", "score": 0.8248758891931032, "event_breakdown": "Hezbollah fires anti-aircraft missiles at Israeli warplanes, forced to withdraw from Lebanese airspace\n Lebanese militant group Hezbollah announced that their anti-aircraft missiles were fired at Israeli warplanes that had flown over Lebanon. This forced the planes to withdraw from the area, according to the official media reports."}, {"id": "b34ff2c2-1895-45dd-9eb1-ee71f24e02b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28519/", "date": "2024-06-06 16:41", "message": "Jenin, the eastern neighborhood, Albiadar area: soldiers in the jeep manage to eliminate two terrorists on the motorcycle - Issa Aljalad and Ibrahim al-Saadi, while driving, and continue to the next target.", "location": "Jenin", "classification": "security", "score": 0.9844064121875845, "event_breakdown": "Target event: Two terrorists, Issa Aljalad and Ibrahim al-Saadi, were eliminated in Jenin, the eastern neighborhood of Albiadar area."}, {"id": "81af5cb3-9842-460a-b888-93c1c54b1954", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28518/", "date": "2024-06-06 16:37", "message": "Today at around 14:00 an Israeli drone attacked a group of people near the Eban Cafe in the Shatti refugee camp in the west of Gaza City.\n\nAs a result of the attack, 5 Gazans were killed, including Izz al-Din Zakut (Abu Bara' Zakut).\n\nZakut became a \"celeb\" in the Gaza Strip in September 2018 when he managed to cross the border fence with Israel and reach the top of an Israeli sniper post and take souvenir equipment from there.\nHe was then honored by kings as you will see in the attached photo that was published on the Hebrew channel in September 2018👇👇👇", "location": "GAZA CITY", "classification": "security", "score": 0.9128842730883542, "event_breakdown": "The event you specified occurred in the Gaza Strip and can be placed on a map. It was reported that five Gazans were killed following a drone attack near Eban Cafe in the Shatti refugee camp. The event occurred on a Tuesday at around 2:00 PM."}]