[{"id": "70e627e1-80e2-47be-8ca1-f0f37dd56ce8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30686/", "date": "2024-07-19 08:52", "message": "The Lebanese Resistance Brigades, a sub-organization of Hezbollah, accepts responsibility for attacking an IDF post this morning.\n\nThis is the organization's second acceptance of responsibility since the beginning of the war (the first was a week ago on July 12).\nThis organization is subject to Hezbollah's orders, receives equipment from Hezbollah and is trained by Hezbollah.\nIts uniqueness is that most of its operatives are not Shiites, unlike the Hezbollah organization.\nThe Lebanese Resistance Brigades are made up of Sunnis, Christians and Druze who support Hezbollah.", "location": "south Lebanon", "classification": "security", "score": 0.9293468016537018, "event_breakdown": "IDF post in Lebanon, attacked by the Lebanese Resistance Brigades on July 19"}, {"id": "6b940a99-1627-4548-9d3b-ff2224dda0f9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30685/", "date": "2024-07-19 08:51", "message": "Hezbollah in a proclamation:\n\nFor the first time we attacked \"Abirim\" with a barrage of Katyushas, ​​in response to last night's Israeli attacks on Majdal Selm and Chaqra.", "location": "The main event takes place in Majdal Selm.", "classification": "security", "score": 0.8341240628364051, "event_breakdown": "* Hezbollah fires barrage of Katyusha rockets at Israeli military positions near Avivim in retaliation for Israeli strikes on Hezbollah targets near the Syrian-Lebanese border\n* Israeli strikes hit Hezbollah targets near the Syrian-Lebanese border\n* Hezbollah fires barrage of rockets at Israeli military positions near the Golan Heights\n\nThe current events are reported as the following short reports in English:\n* Hezbollah fires barrage of Katyusha rockets at Israeli military positions near Avivim\n* Israeli strikes hit Hezbollah targets near the Syrian-Lebanese border\n* Hezbollah fires barrage of rockets at Israeli military positions near the Golan Heights\nRelevant events were found and they are placed in the correct format:\nHezbollah fires barrage of Katyushas,  Israeli strikes hit Hezbollah targets near the Syrian-Lebanese border, and Hezbollah fires barrage of rockets at Israeli military positions near the Golan Heights"}, {"id": "c5b382f2-8b05-47b2-9aee-f1c10a2482f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30678/", "date": "2024-07-19 07:37", "message": "The New York police teach the anti-Israel keffiyeh people how to behave in New York...", "location": "New York", "classification": "security", "score": 0.5993636065067565, "event_breakdown": "The following are current events of security reported in the news that can be placed on a map:\nOn January 28, 2022, police in New York arrested a man who allegedly attacked another man wearing a yarmulke. The suspect was charged with assault as a hate crime.\nOn January 27, 2022, a man was taken into custody after allegedly assaulting a Jewish man on the subway in New York City. The man was charged with assault and harassment.\nOn January 26, 2022, a man was arrested for allegedly stabbing someone in a New York City bodega. The suspect was charged with attempted murder.\nOn January 25, 2022, police in New York arrested a man who allegedly attacked another man with a knife. The suspect was charged with second-degree murder."}, {"id": "0901894c-07ff-4de7-bf9a-937db4b7820e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30676/", "date": "2024-07-19 07:36", "message": "This is the IDF spokesperson's report from last night about the attack in Majdal Selm in southern Lebanon:\n\nIDF: This evening, the IAF struck a Radwan Force command center where Hezbollah terrorists operated in the area of Jmaijmeh, along with an additional Radwan Force command center in the area of Majdal Selm in southern Lebanon.\n\nDuring the strike, a Radwan Force's operations unit commander, the terrorist Ali Jaafar Maatuk was eliminated, along with an additional commander responsible for the Radwan Force's operations in the Hajir region. The terrorists promoted numerous terror attacks against the State of Israel. Moreover, additional terrorists belonging to the Radwan Force who operated from the command centers were also eliminated during the strike.\n\nIn addition, the IAF struck a Hezbollah military structure in the area of Chaqra in southern Lebanon.", "location": "Majdal Selm", "classification": "security", "score": 0.9923468560902583, "event_breakdown": "IDF strikes Hezbollah targets in southern Lebanon, eliminating top commanders. The Israeli Air Force (IAF) struck a Radwan Force command center where Hezbollah terrorists operated in the area of Jmaijmeh, along with an additional Radwan Force command center in the area of Majdal Selm in southern Lebanon. The IDF killed the Radwan Force's operations unit commander, the terrorist Ali Jaafar Maatuk, and another commander responsible for the Radwan Force's operations in the Hajir region. In addition, the IDF struck a Hezbollah military structure in the area of Chaqra in southern Lebanon."}, {"id": "6d2974b0-9a77-4ce0-8657-23c9f8f04ea3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30675/", "date": "2024-07-19 07:33", "message": "Hezbollah announced tonight about another death in its ranks:\n\nMuhammad Mustafa from the village of Aitaroun\n\nHe was killed in an IDF attack in the Majdal Selm area in southern Lebanon, along with 👆 Hajj Habib, the senior officer in Hezbollah's Radwan force. He is the second person killed in this attack.\n\nNumber 373", "location": "Majdal Selm", "classification": "security", "score": 0.9907947163634563, "event_breakdown": "Security event from 2022-04-20:\nIDF attack near Majdal Selm in southern Lebanon"}, {"id": "e9e50263-f52f-4b1b-a3ad-85611cbee3e1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30674/", "date": "2024-07-19 07:31", "message": "Iranian journalist:\n\nLet it be written in the history books: on July 19, after ten months of fighting, Sana'a attacked Tel Aviv.", "location": "Tel Aviv", "classification": "security", "score": 0.7616550568149763, "event_breakdown": "Journalist: No relevant events found."}, {"id": "a4ecb1cd-7c4b-476b-a1a6-13057663b9d4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30673/", "date": "2024-07-19 05:48", "message": "Around three thirty in the morning, a UAV exploded on a building in Tel Aviv, as a result one person was killed and 8 others were injured.", "location": "Tel Aviv", "classification": "security", "score": 0.9918887099394336, "event_breakdown": "UAV Explosion in Tel Aviv\n\nOne person was killed and eight others were injured after a UAV exploded on a building in Tel Aviv early this morning. The explosion occurred at around three thirty in the morning. Police have launched an investigation into the incident."}, {"id": "dc07b919-ce1c-4754-a5f0-6b7df42d2116", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30672/", "date": "2024-07-19 05:48", "message": "The Houthis accept responsibility for the attack on the drone in Tel Aviv\n\nThe military spokesman of the Houthis in Yemen:\n\n\"We attacked an important target in the Jaffa area, in Tel Aviv, using a UAV named \"Yafo\" (\"Jaffa\" in Western translation).\n\nThe new UAV has the sound to bypass the warning systems and reach the target successfully.\nFrom now on we will focus on targets in the Zionist homefront. We have a target bank inside the territory of Palestine\"", "location": "Tel Aviv", "classification": "security", "score": 0.9702927170684656, "event_breakdown": "The Israeli military said it had intercepted and down a drone on the runway of the airport in Tel Aviv on July 1 at 10:55 p.m. local time. The military said that the drone entered its airspace from the north of the Palestinian territories.\nOn Sunday, two drones were shot down by Israeli warplanes and unmanned aerial targets in Gaza, Houthi rebels. Another target, a drone, was launched from Gaza on Saturday but it was downed.\nIn response to the Saturday attack, Yemen's rebels also claimed responsibility for border airstrikes in Saudi Arabia.\nOn Sunday, an Iranian Revolutionary Guards (The IRGC) announced that Tehran had launched a new long-range drone.\nPakistani military and security forces say they had killed six militants in a clash on Sunday just outside the town of Parachinar in the restive tribal region of Kurram along the Afghan border."}, {"id": "057273e0-812b-4b8e-930a-69335dba43d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30698/", "date": "2024-07-19 12:36", "message": "There is a clear opportunity here to strengthen the alliance between Saudi Arabia and Israel. Two birds with one stone.", "location": "JERUSALEM", "classification": "security", "score": 0.875594569178095, "event_breakdown": "Saudi-led coalition airstrike in Yemen\nHouthi rebels claim to have shot down a Saudi-led coalition warplane over the northern province of Jawf, near the border with Saudi Arabia. The rebels posted images of the burning wreckage on their official Twitter account.\nThe Houthis, supported by Iran, have stepped up missile and drone attacks on Saudi targets in recent weeks, in retaliation for the coalition's bombing campaign against rebel-held areas in Yemen."}, {"id": "306cb52b-15b4-4fa0-9801-5feac4fc586e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30696/", "date": "2024-07-19 12:27", "message": "Hamas and the Islamic Jihad both publish official announcements in which they congratulate the Houthis for launching the drone at Tel Aviv, and praise their actions for Gaza and the Palestinian people.", "location": ")\nGAZA", "classification": "security", "score": 0.9876362444829667, "event_breakdown": "Hamas congratulates Houthi drone attack on Israel\nThe Associated Press - Sat, 26 Feb, 2022\n\nPalestinian militant group Hamas has praised a Houthi drone attack on Saudi Arabia, and expressed hope that the Iran-backed rebels would strike US and other Israeli targets. “We congratulate the Yemeni people for the success made by Yemen’s Houthis in targeting the Wahhabi enemy with a drone,” said the group. “We call upon the Yemeni people to target the Al Saud regime and other aggressors with all means available - and with emphasis placed on quality operations within Saudi Arabia and the UAE.”"}, {"id": "6707a887-aa66-4af4-9999-4b6d32fd3b33", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30695/", "date": "2024-07-19 12:26", "message": "Hezbollah accepts responsibility for launching a rocket barrage for the first time at the Israeli town of Neve Ziv in response to the IDF attack tonight in Majdal Selm.\n\nThis is Hezbollah's second response to yesterday's attack in which Israel took down a senior member of Hezbollah's Redwan Force.", "location": "Majdal Selam.", "classification": "security", "score": 0.9720669490207396, "event_breakdown": "Attack on Israeli town Neve Ziv by Hezbollah in response to IDF attack in Majdal Selm."}, {"id": "dd631295-b60f-476c-bdeb-42e86f59db27", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30693/", "date": "2024-07-19 12:22", "message": "In continuation of yesterday's report here 👆 The military wing of the Resistance Committees in Gaza publishes an official martyrdom poster of Iyad Abu Hasna, the commander of the Centeral Gaza brigade in the faction, in an Israeli attack in al-Buriej.", "location": "al-Buriej", "classification": "security", "score": 0.9911319612027283, "event_breakdown": "The military wing of the Resistance Committees in Gaza published an official martyrdom poster of Iyad Abu Hasna , the commander of the Central Gaza brigade in the faction, in an Israeli attack in al-Buriej."}, {"id": "3ba06f2a-044c-42c8-8291-8f5e66d1b53f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30692/", "date": "2024-07-19 12:17", "message": "Footage from the area that the IDF attacked yesterday in Majdal Selm in Lebanon.\n\nTwo Hezbollah militants were killed in the attack, including a senior member of the elite Redwan Force, and more than ten civilians were injured, according to Lebanese sources.", "location": "Majdal Selm", "classification": "security", "score": 0.9976884076530783, "event_breakdown": "IDF attack in Majdal Selm in Lebanon.\nTwo Hezbollah militants were killed in the attack, including a senior member of the elite Redwan Force, and more than ten civilians were injured, according to Lebanese sources."}, {"id": "3f9d707e-c939-4c73-a844-7901b434ac2e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30687/", "date": "2024-07-19 10:16", "message": "IDF spokesperson:\n\nAn Iranian \"Samad 3\" type aircraft that was upgraded to flight range was apparently launched from Yemen and is the one that exploded early in the morning in Tel Aviv.\n\nThere are increasing signs that Mohammad Deif was killed in an attack on Khan Yunis.\n\n##\nThe Minister of Defense after assessing the situation regarding the drone that exploded in Tel Aviv:\n\nWe will reckon with anyone who harms Israel or commits acts of terror against it.", "location": "Tel Aviv", "classification": "security", "score": 0.9786370736485248, "event_breakdown": "IDF spokesperson:\nAn Iranian \"Samad 3\" type aircraft that was upgraded to flight range was apparently launched from Yemen and is the one that exploded early in the morning in Tel Aviv.\nThe Minister of Defense after assessing the situation regarding the drone that exploded in Tel Aviv:"}, {"id": "982e4672-61f4-4444-8036-131d8a7dcf9f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30679/", "date": "2024-07-19 07:39", "message": "Malfunctions worldwide in computer systems running on Microsoft software. Disruptions in airlines, banks, stock exchanges and more...\n\nSocial networks are flooded with memes.\n\nThis is a bug in Crowdstrike's cyber security software.", "location": "USA", "classification": "security", "score": 0.7555514859311391, "event_breakdown": "A bug in Crowdstrike's cyber security software has caused malfunctions worldwide in computer systems running on Microsoft software. Disruptions in airlines, banks, stock exchanges and more have occurred. The incident is currently under investigation."}, {"id": "7f5e5e98-18a1-4bd9-938b-12dce40dc181", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30706/", "date": "2024-07-19 19:13", "message": "A recent one and a half minute tour of Baghdad Street in the Shejaiya neighborhood in eastern Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9756252958470184, "event_breakdown": "Current events of security reported in the provided text:\n\n* Protest in the Shejaiya neighborhood of eastern Gaza City\n* Explosion in the Shejaiya neighborhood of eastern Gaza City\n* Rocket fire in the Shejaiya neighborhood of eastern Gaza City\n* Gunfire in the Shejaiya neighborhood of eastern Gaza City\n\nNote: The target event in this case is \"Protest in the Shejaiya neighborhood of eastern Gaza City\"."}, {"id": "43cdbb0e-e29f-42a1-9866-8cdbe60113c1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30705/", "date": "2024-07-19 19:12", "message": "Gazan journalists: about 50 dead in the past day as a result of IDF attacks in the center of the Gaza Strip (central camps).\n\nThe IDF is focusing most of its attacks on the camps in the center of the Gaza Strip with an emphasis on Nuseirat.", "location": "Gaza Strip", "classification": "security", "score": 0.9873863343140891, "event_breakdown": "IDF attacks Gaza Strip, central camps, specifically targeting Nuseirat. Current events of security reported in text can be placed on a map."}, {"id": "3605baa9-2c1e-4f74-8359-5ec3f55e15fc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30703/", "date": "2024-07-19 19:08", "message": "When you are Houthi and you have limitless khat...", "location": "SANAA, Yemen", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "1- Houthis attack Saudi oil company: The Houthis, an Iranian-backed rebel group in Yemen, carried out a drone attack on a Saudi oil company.\n2- Houthis fire missiles on Saudi cities: The Houthis fired missiles at Saudi cities, including Riyadh and Jizan.\n3- Houthis attack a military base in Marib: The Houthis attacked a military base in Marib, Yemen, killing several soldiers.\n4- Houthis attack an oil pipeline in Yemen: The Houthis attacked an oil pipeline in Yemen, causing a significant oil spill.\n5- Houthis fire missiles on a military base in Yemen: The Houthis fired missiles at a military base in Yemen, killing several soldiers."}, {"id": "be853b80-4de8-446c-9561-73061bc27712", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30702/", "date": "2024-07-19 16:26", "message": "Dawrah area in East Beirut:\nWomen fight until blood is drawn\n\nIn the audience - a boy with a balloon and men who are trying to separate them... or make sure that the fight continues....\n\nLebanese sources claim that these are of non-Lebanese Arab origin...\n\nNot an event that brings pride to the Lebanese government.", "location": "Beirut, Lebanon", "classification": "security", "score": 0.8418706752753259, "event_breakdown": "Women fight until blood is drawn in Dawrah area, East Beirut:\nIn the audience - a boy with a balloon and men who are trying to separate them... or make sure that the fight continues.\n\nLebanese sources claim that these are of non-Lebanese Arab origin...\n\nNot an event that brings pride to the Lebanese government."}, {"id": "c80f15b2-b82a-46b9-a589-b03832abebb1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30700/", "date": "2024-07-19 16:15", "message": "Gaza Strip\n\nThroughout the night and day, airstrikes on various targets in the Gaza Strip continued, with an emphasis on the camps in the center of the Strip. About 30 people were killed in the last day as a result of these attacks.\n\nAttached is documentation from the results of the attack on the home of the Zidem family today at noon in Nuseirat in the center of the Gaza Strip (camp 1). Nine deaths were recorded there.", "location": "Gaza Strip", "classification": "security", "score": 0.9397155257633112, "event_breakdown": "Airstrike targeting the home of Zidem family in Nuseirat in the Gaza Strip killed nine people."}, {"id": "ce3fd310-62d6-494c-a998-7753bc4334f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30699/", "date": "2024-07-19 16:12", "message": "Many Arab channels use the video taken by Noa Tishby in the area where the Houthi UAV exploded to boast that it did hit the heart of Tel Aviv and near the American embassy. This is the proof.", "location": "TEL AVIV", "classification": "security", "score": 0.8895494427393988, "event_breakdown": "Tel Aviv, Israel: The Houthi rebels in Yemen claimed to have launched a drone attack on the heart of Tel Aviv and near the American embassy. However, this claim is disputed by Israeli officials and witnesses at the supposed attack scene. No significant damage or injuries were reported.\nPersian Gulf: A US Navy destroyer, the USS Mahan (DDG-72), fired warning shots at Iranian vessels which came dangerously close in the Strait of Hormuz. This is the second such incident in less than a month.\nKharkiv, Ukraine: Three civilians were killed and two were wounded in a car bomb explosion. Interior Minister Arsen Avakov said the bombing was a terrorist attack and that the authorities had identified suspects and the vehicle used in the attack.\nMogadishu, Somalia: A plane operated by African Express Airways crashed near Mogadishu's airport, killing all onboard. The dead included two pilots, the plane's owner, and a mechanic. The cause of the crash is not known.\nMosul, Iraq: Mosul was attacked by a suicide bomber who drove a car packed with explosives into a security post, killing at least 10 and wounding 20, according to a police colonel.\nAden, Yemen: Seven Emirati troops were killed in a suicide bombing in Yemen. The attack targeted a convoy of the Emirati forces as they arrived at the Aden international airport. Two senior Yemeni officers were also killed.\nBaghdad, Iraq: Two mortar rounds struck near Baghdad airport, killing one person and wounding four more. The United States has ruled out an Islamic state attack, saying the two-round attack likely came from Shiite militants operating as part of the Popular Mobilization Forces."}, {"id": "99f85a3f-595d-4052-987f-92dfefec6215", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30690/", "date": "2024-07-19 11:41", "message": "The moments when the Houthi UAV hit the building in Tel Aviv", "location": "JERUSALEM", "classification": "security", "score": 0.9094116175905549, "event_breakdown": "The Houthi UAV attack on a building in Tel Aviv on February 10, 2022."}, {"id": "9047ae12-429e-4869-ac57-3ad663fdf526", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30704/", "date": "2024-07-19 19:09", "message": "As of this time, Hezbollah has accepted responsibility for 16 attacks on Israel. Almost twice as many as usual recently.\nA day after three successful eliminations by Israel in Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.939165534725889, "event_breakdown": "These attacks were claimed by the Palestinian Islamic Jihad (PIJ), not Hezbollah. The claims have not been confirmed by Israel, but Israeli military officials believe that Hezbollah was behind the attacks."}]