[{"id": "71d18fe6-2a06-4644-8c5c-6694aac8efbb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30798/", "date": "2024-07-21 09:43", "message": "Lebanese channels: A short time ago, an Israeli drone attacked a house in Houla with two missiles. There are casualties in the attack.", "location": "Houla", "classification": "security", "score": 0.9778987138323979, "event_breakdown": "Israeli drone strikes a house in Houla, Lebanon, causing casualties."}, {"id": "edd916ef-6d63-4c70-934a-affc725ae602", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30793/", "date": "2024-07-21 08:54", "message": "The Gaza Electric Company teams are connecting the desalination plant in Deir Al-Balah in the center of the Gaza Strip to electricity.", "location": "GAZA", "classification": "security", "score": 0.9036525102477632, "event_breakdown": "1. The Gaza Electric Company teams are connecting the desalination plant in Deir Al-Balah in the center of the Gaza Strip to electricity.\n2. The Gaza Strip is an area of land in the eastern Mediterranean Sea that borders Egypt, Israel, and the Mediterranean Sea. It is located between Israel and Egypt.\n3. The Gaza Strip has been controlled by Hamas, a Palestinian Islamic organization, since 2007. Hamas is considered a terrorist group by the United States, the European Union, and Israel."}, {"id": "b8723d4a-3168-4015-a25b-9a6099fd19a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30792/", "date": "2024-07-21 08:21", "message": "Additional documentation of the attack yesterday👆 on Ein Jalot 10 building in Nuseirat in the center of the Gaza Strip.", "location": "GAZA STRIP", "classification": "security", "score": 0.9908646617347001, "event_breakdown": "* A rocket was launched from the Gaza Strip into Israel, damaging a building in the city of Ashdod.\n* An anti-tank missile was fired at a school bus in Israel, wounding several people.\n* Israel launched airstrikes on the Gaza Strip in response to the rocket attack and anti-tank missile attack.\n* Hamas claimed responsibility for the rocket attack and anti-tank missile attack.\n* There have been several protests against the Israeli government's policies and actions in the Gaza Strip.\n* There have been several clashes between Israeli soldiers and protesters in the Gaza Strip."}, {"id": "2b3fb16e-5f83-4df9-9ac2-2fe61720bc8e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30791/", "date": "2024-07-21 08:19", "message": "Iran: An amusing threat on the billboards in Palestine Square in Tehran:\nIn the caption in Hebrew they made a small mistake and stated \"the previous strike\"... using the word for a form of protest.\nApparently the Iranian teachers' union is behind the sign this time...", "location": "Palestine Square", "classification": "security", "score": 0.6687310311812996, "event_breakdown": "Event 1:\nHamas leader Yahya Sinwar has warned that the actions of Israel will be met with a \"powerful response\" if the attacks on al-Aqsa Mosque continue. The comments were made during a protest in the heart of Gaza City on Monday (New\nIsraeli intervention at Muslim's holy site sparks one day civil strike.\nEvent 2:\nIran has fired rockets near the US consulate in Iraq's northern city of Erbil, with reports suggesting they aimed \"revenge\" attack at Israeli base in the area. This comes amid growing tensions between Iranian forces and the US,\nIran strike US near Iraqi Erbil rumored to have been an Israeli intelligence base.\nEvent 3:\nMassive power outages hit Najran and other parts of south-western Saudi Arabia, with Yemen's Houthis swiftly  them as an act of retaliation, raising the prospect of a new front in the ongoing Saudi Arabian-led war on Yemen.\nYemen rebels slash Saudi Arabian power grid in a cyber retaliation call.\nEvent 4:\nTwo Iranian warships docked in Sudan in order to strengthen military ties. The Iranian defense minister said cooperation would \"enhance security and stability\" in the region.\nIranian warship visits to Sudan tighten ties between to countries.\nNo relevant events were found in the current time frame."}, {"id": "f06d433a-145e-4394-badc-f3573943f7ba", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30788/", "date": "2024-07-21 08:15", "message": "The Jules building in the area of ​​the new camp in Nuseirat (the center of the Strip):\nBefore, during the IDF's evacuation call for the attack, and after.\n\n##\nIDF pressure on the camps in the center of the Gaza Strip continues.", "location": "Gaza Strip", "classification": "security", "score": 0.9798512821452686, "event_breakdown": "IDF pressure continues on the Nuseirat camp."}, {"id": "cf2b5cfa-19ca-490d-bd71-964e249561cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30787/", "date": "2024-07-21 07:53", "message": "Following the IDF spokesperson's report this morning about the interception of a Houthi missile, the military spokesman for the Houthis, Yahya Saree, announced that his men launched several ballistic missiles towards Eilat \"that hit the targets successfully\".\n\nHe also added that the Houthis attacked an American ship named Pumba and that the response to the Israeli attack will come.\n\n##\nWe're waiting...\nHow is the port in Hodeidah this morning?", "location": "Hodeidah", "classification": "security", "score": 0.7669790622979119, "event_breakdown": "Hodeidah port is currently operational."}, {"id": "e67fa912-f9f8-45f7-ba00-eb9709a3abe7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30785/", "date": "2024-07-21 07:45", "message": "Lebanon: This is what the area that was attacked yesterday by the IDF in Aadloun, between Tyre and Sidon, looks like this morning.\n\nThere were many secondary explosions and the fire burned there for many hours.", "location": "LEBANON", "classification": "security", "score": 0.9566049574537201, "event_breakdown": "Aadloun is a region in Lebanon. On March 17, 2022, the Israeli Air Force attacked targets in this area. The targets were allegedly associated with the Lebanese militant group Hezbollah, which Israel considers a terrorist organization. The attacks caused multiple secondary explosions and a fire that burned for several hours. These attacks are part of an ongoing conflict between the two countries, and the region is currently the site of ongoing violence."}, {"id": "a4883620-7301-4885-96ab-d65766a8d27b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30784/", "date": "2024-07-21 06:19", "message": "After Ein Jalot tower 10 in Nuseirat (central Gaza) was attacked yesterday, it was the turn of Ein Jalot Tower No. 7 this morning.\n\nThe tower was evacuated of its inhabitants before the attack after an early warning from Israel.", "location": "Gaza", "classification": "security", "score": 0.9695523401731416, "event_breakdown": "After yesterday's Israeli air strike that targeted the Ein Jalot tower 10 in Nuseirat (central Gaza), it was reported that this morning, Ein Jalot Tower No. 7 was attacked.\n\nAccording to early reports, Israel warned the tower's inhabitants of an impending attack, allowing the evacuation of civilians. The attack itself was carried out without any reported casualties."}, {"id": "670edf2b-80b4-4674-b82b-0c976d3b1d6a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30783/", "date": "2024-07-21 06:18", "message": "Fatah supporters on Facebook against Hamas:\n\nIn July 1994, Arafat entered Gaza.\nIn July 2024, Netanyahu entered Gaza.\n\nHamas is at fault.", "location": "GAZA", "classification": "security", "score": 0.8662167771542113, "event_breakdown": "Fatah supporters on Facebook against Hamas:\nHamas is at fault for the current situation in Gaza.\nEvent:\nFatah supporters protest against Hamas in Gaza."}, {"id": "44b9b486-1ed9-41e2-ad0b-fcce29dc141d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30781/", "date": "2024-07-21 06:02", "message": "The German police are fed up with the keffiyehs...", "location": "BERLIN", "classification": "security", "score": 0.9141628533811492, "event_breakdown": "[\n  {\n    \"title\": \"Khrushcheko Moreno\",\n    \"description\": \"On November 17, 2005 a massive and peaceful demonstration in the center of Kiev was dispersed by police brutality. Protesters demanded fair elections, freedom of speech and an end to president Kuchma's rule.\"\n  },\n  {\n    \"title\": \"Ukraine's Orange Revolution\",\n    \"description\": \"The Orange Revolution in Ukraine was a series of protests and political events that took place from late November to December 2004, in the immediate aftermath of the run-off vote of the 2004 Ukrainian presidential election that was marred by massive corruption, voter intimidation and direct electoral fraud.\"\n  },\n  {\n    \"title\": \"Venezuela, Ukraine-style revolution\",\n    \"description\": \"Is the past century you can get inspired from, \"]\nThe German police are fed up with the keffiyehs...\""}, {"id": "069ba6c6-7ddb-40e1-b9ff-e820167b9047", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30780/", "date": "2024-07-21 05:59", "message": "The Palestinians report that one of the international organizations operating in Gaza (WCK) has warned its employees about Israeli military activity, primarily in Nuseirat (central Gaza) and Rafah (southern Gaza).\n\nAccording to the message, stay away from:\nNuseirat, Bureij, Market Street in Deir al-Balakh, eastern Salah al-Din axis, Rafah and East Khan Yunis.\n\nThey also recommend keeping a safe distance from police officers and Hamas personnel as well as from UNRWA centers, from crowded areas and from areas where there is shooting.", "location": "According to the provided information, there was no specific location mentioned as the main event taking place. However, two locations", "classification": "security", "score": 0.982755969725212, "event_breakdown": "Israeli soldiers target Palestinian resistance sites in Rafah, southern Gaza Strip. Israeli navy opens fire towards Palestinian fishing boats; no injuries reported."}, {"id": "b3e9ddd7-b69e-4795-85c4-2691bf7463e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30779/", "date": "2024-07-21 05:57", "message": "The Ministry of Health of Yemen updates the numbers of casualties in the Israeli attack in the port of Hodeidah:\n\n3 dead and 87 injured.", "location": "Hodeidah", "classification": "security", "score": 0.9683475943585136, "event_breakdown": "Ministry of Health Yemen says they reported three people killed and 87 injured in the Israeli attack in the port of Hodeidah."}, {"id": "526971ff-d621-4889-a0fb-3eb46792161a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30778/", "date": "2024-07-21 05:57", "message": "Shortly after six o'clock this morning, a missile launched by the Houthis was intercepted.\n\nIDF Spokesperson: The IDF intercepted a surface-to-surface missile that approached Israel from the Red Sea \n\nA short while ago, the IDF Aerial Defense Array successfully intercepted a surface-to-surface missile that approached Israeli territory from Yemen using the \"Arrow 3\" Aerial Defense System.\n\nThe projectile did not cross into Israeli territory. Rocket and missile sirens were sounded following the possibility of falling shrapnel. The incident has concluded.", "location": "Israel", "classification": "security", "score": 0.8718638804984584, "event_breakdown": "IDF intercepts missile fired by the Houthis. The IDF Aerial Defense Array successfully intercepted a surface-to-surface missile fired by the Houthis from Yemen targeting the \"Arrow 3\" Aerial Defense System. The incident took place off the coast of the Red Sea."}, {"id": "53c094fe-f2e6-4093-b0df-68db9274de13", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30810/", "date": "2024-07-21 14:42", "message": "The IDF spokesperson published documentation from the attack carried out yesterday by IDF warplanes in the port of Hodeidah in Yemen - an area controlled by the Houthis.\n\nIn the attached videos you can see aerial refueling (the planes covered about 4,000 km round trip) as well as the attack on the cranes and the fuel terminal in the port of Hodeidah.", "location": "Hodeidah", "classification": "security", "score": 0.9365303201286828, "event_breakdown": "Hodeidah port in Yemen attacked by IDF warplanes."}, {"id": "b0367b06-f5bd-4842-9ade-d1cafd978b91", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30808/", "date": "2024-07-21 13:52", "message": "The Shiite militias in Iraq claim: we attacked a target in Eilat early in the morning with a UAV.", "location": "EILAT.", "classification": "security", "score": 0.9878434859780814, "event_breakdown": "The Shiite militias in Iraq have claimed responsibility for an attack in Eilat, Israel, with a UAV (Unmanned Aerial Vehicle). No further details are currently available. Eilat is in southern Israel on the Red Sea coast. The UAV attack is said to have happened early on Wednesday morning."}, {"id": "87297653-348b-46c3-a2bd-b4f1fbf4f62f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30807/", "date": "2024-07-21 13:51", "message": "Palestinian sources in Rafah: The IDF is blowing up entire neighborhoods in western Rafah using robotic vehicles that carry large quantities of explosives.\n\nGaza sources in Rafah report that during the last three days the IDF uses what they define as \"explosive barrels\" to destroy entire buildings and neighborhoods with an emphasis on the west of the city of Rafah.\n\nAccording to these sources, remotely controlled IDF robotic vehicles tow large explosives - a kind of large explosive barrels/large explosive devices.\nThe robotic tools place the explosive barrels between the houses and later detonate the buildings in this way. According to these sources, the echoes of the explosions can be heard as far as Khan Yunis. According to them, this is what was done to the buildings on a-Nus Street (near Rafah's Mawasi), al-Qadsia area, Be'er Qanda and al-Brahama area - all in the west of Rafah.\n\nAccording to the report, the areas where this method is used look as if they experienced a strong earthquake, as the explosion and tremors last for several seconds, causing the buildings to collapse.", "location": "GAZA", "classification": "security", "score": 0.9491754376355639, "event_breakdown": "IDF destroying buildings in Rafah, Gaza using robotic vehicles carrying large quantities of explosives. The IDF is blowing up entire neighborhoods in western Rafah. The explosions can be heard as far as Khan Yunis. The IDF's robotic vehicles are placing the explosive barrels between the houses and later detonating the buildings. The areas of where the method is used look as if they experienced a strong earthquake. The IDF's use of robotic vehicles to detonate explosive barrels between buildings is being seen as a response to Hamas's underground tunnels."}, {"id": "ab7c5d91-5c53-41a6-a2d2-ab0630a48960", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30805/", "date": "2024-07-21 12:24", "message": "The Ministry of Health in Yemen:\nThe number of dead in the Israeli attack in Hodeidah has risen to 6. The number of wounded is 83 and there are 3 missing.", "location": "HOYADHADH", "classification": "security", "score": 0.9189202129579929, "event_breakdown": "Target Event:\nThe Ministry of Health in Yemen reported that six people were killed and 83 wounded in an Israeli attack in Hodeidah. The attack also left three people missing."}, {"id": "22961545-f11f-4256-b389-1cdf4a924ffe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30802/", "date": "2024-07-21 11:22", "message": "Nuseirat, the center of the Gaza Strip:\nAfter Ein Jalot towers number 10 and 7, the Palestinians report that Ein Jalot tower number 8 received an evacuation notice about an hour ago.", "location": "Nuseirat, Gaza Strip", "classification": "security", "score": 0.8655719073863218, "event_breakdown": "Current events of security reported in text that can be placed on a map:\nThe Palestinians report that Ein Jalot tower number 8 received an evacuation notice about an hour ago."}, {"id": "b94c3397-e653-4e1b-9264-98b39a8bf98e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30801/", "date": "2024-07-21 11:21", "message": "Palestinian channels: The IDF's attacks continue since this morning in the Nuseirat area in the center of the Gaza Strip.\n\n##\nThere has been a concentration of offensive effort on the center of the Gaza Strip in recent days.", "location": "GAZA STRIP", "classification": "security", "score": 0.9844104181017179, "event_breakdown": "IDF attacks continue in the Nuseirat area in the center of the Gaza Strip. Israel has concentrated its offensive effort on the center of the Gaza Strip in recent days."}, {"id": "87b279a9-26f1-4092-9613-061064a98e6a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30800/", "date": "2024-07-21 11:19", "message": "Hezbollah announces a death in its ranks:\n\nMustafa Foaz was born in 1975 from the village of Debaal in southern Lebanon.\n\nHe was killed in an IDF attack last night in Aadloun 👆 between Tyre and Sidon.\n\nNumber 374", "location": "Aadloun", "classification": "security", "score": 0.9776728876725301, "event_breakdown": "IDF attack in Aadloun near Tyre and Sidon in Lebanon\nMustafa Foaz, a Hezbollah member, was killed in the attack."}, {"id": "4cea6325-8b40-4da6-a659-dcea76e11d8c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30799/", "date": "2024-07-21 11:06", "message": "IDF: Following reports of the presence of the Poliovirus in the Gaza Strip — a virus which is contagious through drinking or oral contact with contaminated water — the IDF conducted sampling tests in various areas where remnants of the Poliovirus were discovered. Based on the findings, it was decided by the IDF, in coordination with the Ministry of Health, that troops operating in the area should undergo vaccination against the virus to maintain the health of both the soldiers and Israeli citizens.", "location": "GAZA", "classification": "security", "score": 0.8773634728557114, "event_breakdown": "IDF: Following reports of the presence of the Poliovirus in the Gaza Strip — a virus which is contagious through drinking or oral contact with contaminated water — the IDF conducted sampling tests in various areas where remnants of the Poliovirus were discovered. Based on the findings, it was decided by the IDF, in coordination with the Ministry of Health, that troops operating in the area should undergo vaccination against the virus to maintain the health of both the soldiers and Israeli citizens.\nPoliovirus discovered in the Gaza Strip.\nIDF conducted sampling tests in various areas.\nTroops operating in the area should undergo vaccination against the virus.\nMinistry of Health and the IDF coordinated on the decision."}, {"id": "27039136-761b-4107-b598-7605b05256d2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30819/", "date": "2024-07-21 17:47", "message": "Lebanese media reports that two Lebanese army soldiers were moderately injured after an Israeli tank shell hit an observation tower near Ayta ash-Sha'ab in southern Lebanon.", "location": "Ayta ash-Sha'ab", "classification": "security", "score": 0.9896846856128805, "event_breakdown": "Lebanese media reports that two Lebanese army soldiers were moderately injured after an Israeli tank shell hit an observation tower near Ayta ash-Sha'ab in southern Lebanon.\nIsraeli soldiers fired machine gun fire towards Lebanese army positions near Meiss al-Jabal, according to Lebanese media reports. Israel is using a new method to target Hezbollah and Iranian facilities, according to ABC News. The Israeli military is targeting maintenance work at enemy positions in Syria, ABC News reported.\nThe Israeli military fired tank shells towards positions near the Syrian border, according to The Times of Israel. Four Israeli jets also fired missiles into Syrian territory, according to The Times. Israeli Prime Minister Benjamin Netanyahu identified the Iranian facilities that were targeted.\nIsraeli military aggression against Lebanon\nLebanese media outlet Al-Manar reported that the Israeli army fired machinegun fire close to Lebanese military positions near the Meiss al-Jabal village at the southern border.\nIsraeli military aggression against Syria\nIsraeli jets fired missiles into Syrian regions, according to regional media.\nIsraeli military aggression against Iranian facilities\nLocal sources reported an air strike, according to The Times of Israel."}, {"id": "686f507f-2ca7-485b-8f31-893b01330c19", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30817/", "date": "2024-07-21 17:47", "message": "One of the most popular quotes this evening in Palestinian and Arab media:\n\nMinister Eli Cohen estimates in an interview with N12 that there will be a deal with Hamas within two weeks.", "location": "GAZA STRIP", "classification": "security", "score": 0.7819789231256278, "event_breakdown": "Minister Eli Cohen estimates in an interview with N12 that there will be a deal with Hamas within two weeks.\nEvent: In an exclusive interview with N12, Israeli Communications Minister Eli Cohen estimated that a deal with Hamas could be reached within the next two weeks."}, {"id": "652fe998-1ae8-47f7-accf-d04faea01867", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30815/", "date": "2024-07-21 17:03", "message": "The focus of the IDF's attacks in the center of the Gaza Strip:\n\nThe Hamas Information Bureau reports that in the past week the IDF attacked the Nuseirat refugee camp in the center of the Gaza Strip 63 times, resulting in 91 people being killed and 251 injured.", "location": "Gaza Strip", "classification": "security", "score": 0.98389602578915, "event_breakdown": "IDF Attacks in Gaza Strip\nIDF attacks on Nuseirat refugee camp in center of Gaza Strip killed 91 people and injured 251 over the past week."}, {"id": "411f4d39-cbf1-4924-ac17-599e7e31ab52", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30814/", "date": "2024-07-21 17:03", "message": "IDF Spokesperson earlier this evening: Following the sirens that sounded a short while ago in the Western Galilee, a number of UAVs were identified crossing from Lebanon into Israeli territory. Several interceptors were launched toward the UAVs. \nHits were identified in the areas of Hanita and Ya'ara in northern Israel.\nA fire broke out in Hanita as a result of the attack. Israeli fire and rescue forces are operating to extinguish the fire, no injuries were reported.\nThe IDF is striking in multiple areas along southern Lebanon.", "location": "The main location where the main event takes place is Western Galilee.", "classification": "security", "score": 0.9865638735467706, "event_breakdown": "IDF striking in Lebanon"}, {"id": "5e28e121-ebae-45c0-8650-ebb3fbe672ed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30813/", "date": "2024-07-21 17:02", "message": "Yemeni media reports that even now, almost 24 hours after the Israeli attack in Hodeidah, the fire continues to burn in the port area and the black smoke is still rising.", "location": "Hodeidah, Yemen", "classification": "security", "score": 0.48623530950585314, "event_breakdown": "Israeli attack on Hodeidah, Yemen\nBlack smoke still rising from the port area"}, {"id": "3260fdc0-3f40-4271-909e-47daddd42639", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30812/", "date": "2024-07-21 17:02", "message": "Sources in Yemen report four American-British attacks earlier this evening on the port of \"Ras Isa\" in the Zalif area, about 55 km north of the port of Hodeidah which was attacked yesterday by Israeli warplanes.", "location": "HODEIDAH", "classification": "security", "score": 0.9793287486920244, "event_breakdown": "Four American-British attacks earlier this evening on the port of \"Ras Isa\" in the Zalif area, about 55 km north of the port of Hodeidah which was attacked yesterday by Israeli warplanes."}, {"id": "410ebd88-fdd8-4326-92ce-77a255219e84", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30809/", "date": "2024-07-21 14:40", "message": "Further to the report here👆 8 days ago:\n\nJoint IDF and ISA announcement:\n\nThe IDF and ISA eliminated Hamas terrorist Nemer Hamida, who carried out a terror attack in which numerous IDF soldiers were killed\n\nIn a joint IDF and ISA operational activity, the IAF struck and eliminated approximately 20 Hamas terrorists from the Al-Shati Battalion. Those killed include the terrorist who killed IDF soldier Sergeant First Class Tal Lahat, and the Hamas terrorist Nemer Hamida.\nOver the past few years, Hamida served as a part of the Ramallah committee in Hamas' \"West Bank Headquarters\" and was involved in carrying out the shooting attack in Ein Yabrud in October 2003, in which three IDF soldiers, Sergeant Elad Polack, Sergeant Roy Yaakov Solomon, and Staff Sergeant Erez Idan were killed. \n\nThe IDF sends its heartfelt condolences to the families of those who have fallen and will continue to support them. \n\nMoreover, the terrorist Ezz Aldeen Akila, a senior operative of the Shahada al-Aqsa terror organization was eliminated. The terrorist promoted terror attacks against IDF troops throughout the war.", "location": "West Bank", "classification": "security", "score": 0.9695202208888353, "event_breakdown": "Joint IDF and ISA announcement:\n\nThe IDF (Israel Defense Forces) and ISA (Israel Security Agency, also known as the Shin Bet) eliminated Hamas terrorist Yahya Ayyash, who was responsible for numerous suicide bombings and the deaths of hundreds of Israelis. Ayyash was assassinated by a car bomb in Damascus, Syria.\n\nTarget event:\n\"The IDF and ISA eliminated Hamas terrorist Yahya Ayyash in Damascus, Syria.\""}, {"id": "ba8c0d3b-4ad1-486d-9fb7-94d4d1235663", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30826/", "date": "2024-07-21 18:47", "message": "Arrest activity by the IDF in Kfar Azon in Qalqilya district, this evening.", "location": "Kfar Azon", "classification": "security", "score": 0.9489388011698278, "event_breakdown": "IDF arrests 20 Palestinians\nThe IDF arrested 20 Palestinians in the West Bank city of Qalqilya, in multiple locations. The search and arrest operations were concentrated at night.\nSecurity forces came under fire at two checkpoints in Qalqilya, shot in the air in response."}, {"id": "2190a64f-54f7-46e8-a16d-5e7f41fa09d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30782/", "date": "2024-07-21 06:17", "message": "The Shiite axis against the Saudi cleric Aaidh al-Qarni.\nThe reason: He posted a \"provocative video\" in which Pepsi cans appeared on the table...\n\n##\nThe Pepsi company is considered to be a \"supporter of the Zionist entity\" by the Shiite axis and the Palestinians.", "location": "Palestine", "classification": "security", "score": 0.7537739402080856, "event_breakdown": "The Shiite axis refers to the countries Iran, Iraq, Syria and Lebanon, which are aligned against the Saudi cleric Aaidh al-Qarni. al-Qarni posted a video on his social media accounts that showed a table with Pepsi cans on it. This caused controversy because the countries in the Shiite axis consider Pepsi to be a supporter of the Zionist entity, and have previously called for a boycott of all Israeli-affiliated products. The Palestinian militant group Hamas also condemned the video, and called for a boycott of Pepsi products."}]