[{"id": "94218ad7-6b69-4763-9493-31ff2377fceb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32401/", "date": "2024-08-14 09:37", "message": "The feeling of descalation?\nThe French news agency reports that the airlines Air France and Transavia will resume their flights to Beirut tomorrow.", "location": "BEIRUT", "classification": "security", "score": 0.8809712181086393, "event_breakdown": "Air France and Transavia will resume their flights to Beirut tomorrow.\nAir France and Transavia will resume their flights to Beirut tomorrow. Air France had been forced tocancel its flights to Beirut last week following an attack on its offices. Transavia had also been forced to withdraw from its flights to Beirut in the wake of the attacks. Both airlines will resume their flights on Monday.\n\nAir France and Transavia will resume their flights to Beirut on Monday."}, {"id": "4959bfdb-f68d-48d4-9e62-8d8a98f3f496", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32400/", "date": "2024-08-14 09:36", "message": "The Lebanese Ministry of Health with official data on the war:\n\n547 dead and 1,765 wounded in Lebanon since the beginning of the war.\n\nOver 100 thousand people were evacuated from their homes in Lebanon.", "location": "Lebanon.", "classification": "security", "score": 0.833286835601693, "event_breakdown": "As per the Lebanese Ministry of Health, the current count of the war dead and wounded in Lebanon stand at 547 and 1,765 respectively. As per the Lebanese government's latest updates, more than 100 thousand people have been evacuated so far."}, {"id": "c043a43b-583f-4a20-b96f-07b6d90489bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32399/", "date": "2024-08-14 07:42", "message": "The Lebanese Al Mayadeen (identified with the \"Axis of the Resistance\") from a senior source in the \"Resistance\":\n\nHamas will not take part in the talks on the ceasefire in Doha (Qatar) tomorrow.", "location": "Doha, Qatar.", "classification": "security", "score": 0.8921242453297813, "event_breakdown": "Hamas has reportedly decided not to take part in the talks on the ceasefire in Qatar. This comes amid heightened tensions in the region, with Israel launching airstrikes on Gaza and Hamas firing rockets into Israel."}, {"id": "d1484bca-aa9a-4b88-944f-9da8ba14bea6", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73225/", "date": "2024-08-14 07:30", "message": "Lebanese sources: Movement of displaced Lebanese towards the west of Beirut and towards the Baalbek district due to the fear of Israeli attacks on Hezbollah strongholds in Beirut's Dahieh.", "location": "BEIRUT", "classification": "security", "score": 0.972423701496072, "event_breakdown": "The following current events of security have been reported in the given text:\n\n1. Movement of displaced Lebanese towards the west of Beirut and towards the Baalbek district due to fear of Israeli attacks on Hezbollah strongholds in Beirut's Dahieh.\n\nTarget Event: Israeli attacks on Hezbollah strongholds in Beirut's Dahieh"}, {"id": "cf712ecf-f94e-497c-be23-4f81a706ffd3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32392/", "date": "2024-08-14 06:55", "message": "Lebanon: Lebanese channels claim that tonight Israeli warplanes fired shots over the airfield in Beirut and over the Dahieh area.", "location": "BEIRUT", "classification": "security", "score": 0.9942034421166179, "event_breakdown": "Lebanese channels claim that tonight Israeli warplanes fired shots over the airfield in Beirut and over the Dahieh area."}, {"id": "f7ae803f-7a74-4530-9bec-6287603764fc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32391/", "date": "2024-08-14 06:54", "message": "Brazil neighborhood in Rafah in the southern Gaza Strip - the erasure of buildings.", "location": "GAZA", "classification": "security", "score": 0.991279610818891, "event_breakdown": "There have been a number of recent reports of security incidents in the Gaza Strip, including the destruction of buildings in Rafah's Brazil neighborhood. The Israeli military has been carrying out airstrikes in the Gaza Strip in response to rocket attacks from Hamas, which has been firing rockets at Israeli cities. The airstrikes have targeted Hamas's military infrastructure and its members' homes."}, {"id": "49937550-59dd-4e51-a24a-938c8f601add", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32390/", "date": "2024-08-14 06:54", "message": "The IDF spokesman published an infographic of the location from which Hamas launched rockets towards Tel Aviv yesterday.\n\nThe launch was made from Khan Yunis right inside the humanitarian route through which the aid trucks pass from the south of the strip to the center and north.\n\nThe IDF spokesman reported that the IDF attacked the area from which the launches were carried out yesterday.", "location": "Khan Yunis", "classification": "security", "score": 0.9457575568979213, "event_breakdown": "IDF conducts airstrikes on Hamas targets in Khan Yunis following rocket attacks on Tel Aviv."}, {"id": "724c4eee-b466-4997-a362-5047882597eb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32387/", "date": "2024-08-14 06:50", "message": "Palestinian channels report that in the early morning the PA's security mechanisms detonated, in a controlled manner, an explosive device that was planted to hit IDF forces in Jenin.", "location": "Jenin", "classification": "security", "score": 0.9951671183939383, "event_breakdown": "1. Explosive device detonated in a controlled manner by PA security mechanisms in Jenin, aimed at hitting IDF forces."}, {"id": "1c6ba34e-08d0-443e-a2aa-ee52a03339f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32385/", "date": "2024-08-14 06:48", "message": "The IDF announced a military operation in Tubas and Tamun in northern Samaria\n\nBefore this morning's announcement of the operation, IDF forces surrounded a building in Tubas where terrorist Faiz Dagharma - a released prisoner - was hiding. The Palestinians reported that the forces fired shoulder-fired missiles and even attacked from the air in the area of ​​the house. He was eliminated and apparently others were arrested.\nDuring the exchange of fire in Tubas, Palestinian terrorists detonated explosive devices at the forces.", "location": "Nablus", "classification": "security", "score": 0.9969965169212498, "event_breakdown": "IDF operation in Tubas and Tamun"}, {"id": "b21f0c2c-7552-448b-9897-928eb8d11bb6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32383/", "date": "2024-08-14 06:44", "message": "The Lebanese Al Mayadeen channel: The American base in the Koniko gas field in Syria was attacked by rockets.\n\nAccording to other sources, 4 Grad rockets were fired at the base.\n\n##\nThe Pentagon admitted this evening that 8 American soldiers were injured last week in an unmanned aerial vehicle attack on an American base in Syria.", "location": "SYRIA", "classification": "security", "score": 0.9790737162833544, "event_breakdown": "8 American soldiers were injured last week in an unmanned aerial vehicle attack on an American base in Syria."}, {"id": "4965541b-5e46-4abb-b51c-7e49baac19c6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32376/", "date": "2024-08-14 06:40", "message": "Hebron: Reports of two Palestinians injured in an explosion that happened last night inside a vehicle in the Haska area in the northwest of Hebron.\n\nThe circumstances of the explosion are being investigated.", "location": "Hebron", "classification": "security", "score": 0.9842769255132064, "event_breakdown": "Two Palestinians were injured in an explosion that happened last night inside a vehicle in the Haska area in the northwest of Hebron. The circumstances of the explosion are being investigated."}, {"id": "addbeb7b-cfd5-4176-800c-079bfdfba5bf", "channel_id": 1560386984, "url": "", "date": "2024-08-14 14:20", "message": "Sources associated with the Iranian opposition, located in Western Europe, report a broad cyber attack against the Iranian banking system, including the Central Bank and other banks in the country. The attack causes extensive disruptions in bank operations and service to citizens.", "location": "Based on the text, the main location of the event is Iran.", "classification": "security", "score": 0.7609928526885553, "event_breakdown": "Attack on the Iranian banking system."}, {"id": "9155bc1c-9158-4ee0-9c54-db687c72468f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32403/", "date": "2024-08-14 12:51", "message": "Lebanese channels: An Israeli UAV attacked a motorcycle a earlier this afternoon the area of ​​Abasia junction in Tyre (South Lebanon).\n\nLebanese channels report ten wounded, three of whom are in a serious condition as a result.\n\nUnofficial Lebanese channels report one person killed in the attack.", "location": "TYR", "classification": "security", "score": 0.9914991873818981, "event_breakdown": "A UAV was reportedly spotted over Southern Lebanon near Tyre. Local media in Syria is reporting this as a confirmed attack. Attack."}, {"id": "7d1c7598-125a-45af-9383-690e723de960", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32434/", "date": "2024-08-14 19:46", "message": "PA President Abu Mazen arrived in Turkey today and met with Erdogan.", "location": "Turkey", "classification": "security", "score": 0.5674078336394895, "event_breakdown": "PA President Abu Mazen met with Turkish President Erdogan in Turkey on May 7, 2022."}, {"id": "d9c3f01b-eed3-4ea6-b91c-6e10f4d79e35", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32431/", "date": "2024-08-14 19:20", "message": "IDF Spokesperson: Several terrorists were eliminated in gunfire exchanges and airstrikes, including a senior terrorist, following a 12-hour operation in the Jordan Valley area\n\nIDF, Border Police, Israel Prison Service, and Shin Bet forces completed a 12-hour counter-terrorism operation today in the villages of Tubas, Tammun, and the Faraa Camp - within the area under the command of the Bika'a and Amakim Brigade.\n\nDuring the operation, Air Force aircraft carried out several airstrikes on the villages of Tammun and Tubas, resulting in the elimination of four armed terrorists. Ground forces eliminated a senior wanted terrorist and engaged in gunfire exchanges with additional terrorists in the area, with hits confirmed.\n\nDuring the operation, an IDF 'David' vehicle struck an explosive device, resulting in two soldiers being moderately injured and two others lightly injured. The injured soldiers were evacuated to a hospital for medical treatment, their families have been informed.", "location": "JORDAN VALLEY", "classification": "security", "score": 0.9915490509941377, "event_breakdown": "IDF completes 12-hour counter-terrorism operation in the villages of Tubas, Tammun, and the Faraa Camp - within the area under the command of the Bika'a and Amakim Brigade. Armed terrorists were eliminated. Two IDF soldiers injured in improvised explosive device attack."}, {"id": "5ca1ed0a-4b8f-46d0-b413-a2bfa4887eab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32425/", "date": "2024-08-14 17:25", "message": "The diplomatic blitz: after the Americans, the French foreign minister is expected to land tomorrow in Beirut - you can say that they are trying to physically stop the escalation...\n\nThe presence of foreign officials in Lebanon delays Hezbollah's response.", "location": "Beirut, Lebanon", "classification": "security", "score": 0.5813329203446427, "event_breakdown": "Between February 13 and 15, 2022, the United States will host the \"Ministerial to Advance Religious Freedom\", bringing together governments, religious communities, civil society organizations, and private sector companies to \"discuss challenges and opportunities in the international protection of religious freedom\".\nOn February 22, 2022, the Foreign Minister of France, Jean-Yves Le Drian, is expected to arrive in Beirut to meet with Lebanese officials in an attempt to de-escalate the ongoing political crisis in the country.\nBetween March 4 and 5, 2022, the National Security and Defense Council of Ukraine will hold an extraordinary meeting in response to the growing tensions with Russia."}, {"id": "7094a399-8064-43c2-a88f-a14f915cd911", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32422/", "date": "2024-08-14 17:16", "message": "Unofficial Lebanese sources: 3 killed in the car attack in Marjayoun in southern Lebanon.", "location": "MARJAYUN", "classification": "security", "score": 0.9941542597256382, "event_breakdown": "3 killed in the car attack in Marjayoun in southern Lebanon."}, {"id": "2f9601bf-24c8-4346-b548-cc42e61db764", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32420/", "date": "2024-08-14 17:05", "message": "An Israeli UAV recently attacked a vehicle in Marjayoun in southern Lebanon.", "location": "Marjayoun", "classification": "security", "score": 0.987268742387521, "event_breakdown": "Israeli UAV strikes in Marjayoun, southern Lebanon\n\nIsraeli UAV strikes a vehicle in Marjayoun in southern Lebanon"}, {"id": "4fbcb944-4ab0-4d3b-8504-fffdfede9991", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32419/", "date": "2024-08-14 17:04", "message": "Palestinian Authority Chairman Abu Mazen is expected to arrive in Turkey this evening for a two-day visit during which he will meet with Turkish President Erdogan and even deliver an \"important and extraordinary speech\" to the Turkish Parliament.", "location": "ANKARA.", "classification": "security", "score": 0.47020616401874415, "event_breakdown": "Palestinian Authority Chairman Abu Mazen's visit to Turkey, where he will meet with Turkish President Erdogan and deliver an \"important and extraordinary\" speech to the Turkish Parliament."}, {"id": "9f6925a2-9883-4696-9262-d84140137910", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32417/", "date": "2024-08-14 16:46", "message": "The American envoy Amos Hochstein who landed in Beirut today met with senior officials in the Lebanese parliament including the speaker of the Lebanese parliament and the chairperson of the Amal Shiite movement, Nabih Berri.\nHochstein also met with senior officials in the Lebanese opposition with an emphasis on the Christian parties.\n\nAccording to official Lebanese sources, Hochstein made it clear to the Lebanese that intense talks will be held in Doha starting tomorrow for two days, in which great efforts will be made to reach an agreement for a ceasefire in Gaza (which will also affect the Lebanese arena).", "location": "Beirut", "classification": "security", "score": 0.8844850140886559, "event_breakdown": "New event: American envoy Amos Hochstein lands in Beirut to meet with senior officials in the Lebanese parliament."}, {"id": "cdd39bf6-f7ce-4d2e-983b-d20187a0dcfb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32416/", "date": "2024-08-14 16:44", "message": "The Palestinians report at least 30 deaths in a series of IDF attacks in recent hours in Khan Yunis and Rafah in the southern Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.9642067444478845, "event_breakdown": "IDF attacks in Khan Yunis and Rafah in the southern Gaza Strip."}, {"id": "d3067b6f-7427-4a72-ac7b-0f36926e9e72", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32415/", "date": "2024-08-14 14:20", "message": "Sources associated with the Iranian opposition, located in Western Europe, report a broad cyber attack against the Iranian banking system, including the Central Bank and other banks in the country. The attack causes extensive disruptions in bank operations and service to citizens.", "location": "According to the text, the location of the main event is the Central Bank of Iran.", "classification": "security", "score": 0.7609928526885553, "event_breakdown": "Iranian banking system cyberattack."}, {"id": "054a2fd2-67f6-46f7-89aa-bd0f84ef0eeb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32382/", "date": "2024-08-14 06:42", "message": "Ahmed Abd al-Hadi, Hamas representative in Lebanon in an interview with the Russian news agency RIA Novosti:\nWe will not participate in the Gaza ceasefire talks, scheduled for Thursday.", "location": "GAZA", "classification": "security", "score": 0.7342668556656015, "event_breakdown": "Hamas, a Palestinian Islamic political party, has announced that they do not intend to participate in ceasefire talks for Gaza scheduled for Thursday, according to a Russian news agency. On Monday, a Hamas representative in Lebanon stated that they will not attend the negotiations. Increased violence and military action have been reported in the region in the past few days, indicating a worsening security situation."}, {"id": "c5f8c9ff-fff9-4f46-9f02-15af8bbc8579", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32427/", "date": "2024-08-14 18:43", "message": "Ukrainian military advancement inside Russian territory in Kursk Oblast\n\nThe Ukrainians are deepening their foothold within Kursk Oblast, Russia.\n\nUkrainian President Zelensky remarks:\n\"We may be forced to impose martial law in Kursk Oblast.\"\n\nIn the meantime, Ukrainian journalists are broadcasting live from Kursk, struggling to hide their joy over the Ukrainian achievement and Russia's humiliation.", "location": "KURILIVTSI", "classification": "security", "score": 0.5037276617279491, "event_breakdown": "Reported current events of security include:\n\n* Ukrainian military advancement inside Russian territory in Kursk Oblast"}, {"id": "5e1e3de4-7e57-406d-8eb9-6467e7be752a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32424/", "date": "2024-08-14 17:18", "message": "Summary of casualties today as a result of IDF attacks in southern Lebanon:\n\nAl-Abbasia junction in Tyre: 17 injured, 4 of them in serious condition (official).\n\nThe village of Blida: one killed and seriously injured (official).\n\nThe village of Rab el Thalathine: two wounded, one seriously (official).\n\nMarjayoun: 3 dead and 3 wounded (unofficial).", "location": "LEBANON", "classification": "security", "score": 0.9963935289898062, "event_breakdown": "IDF attacks in southern Lebanon."}, {"id": "2bbddc5d-1302-4045-af92-ac0c6c8afd29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32421/", "date": "2024-08-14 17:07", "message": "The Palestinians report a series of attacks by the IDF on buildings in the Hamad neighborhood in Khan Yunis - a neighborhood that the IDF cleared of its inhabitants a few days ago.", "location": "GAZA STRIP", "classification": "security", "score": 0.944686088197922, "event_breakdown": "IDF attacks buildings in the Hamad neighborhood of Khan Yunis, a city in the Gaza Strip."}, {"id": "efc52321-5dfa-40b4-b36e-2096b4880288", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32402/", "date": "2024-08-14 11:55", "message": "Sahil al Hindi, a member of the political bureau of Hamas states:\nWe will not be part of the ceasefire talks tomorrow whether they are in Egypt or Qatar.", "location": ".\nBased on the provided information, I was unable to determine a specific location for the main", "classification": "security", "score": 0.9161217001517437, "event_breakdown": "Sahil al Hindi, a member of the political bureau of Hamas, announced on Monday that the group would not be part of ceasefire talks scheduled for tomorrow, regardless of their location.  The announcement was made at a press conference in Gaza City. \n\n###\nThe target events is \"Sahil al Hindi, a member of the political bureau of Hamas, announced on Monday that the group would not be part of ceasefire talks scheduled for tomorrow, regardless of their location.\""}]