[{"id": "6ffd646a-27df-428c-b6b1-33935df36ae0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29462/", "date": "2024-06-26 08:31", "message": "The Palestinian \"Leaf Campaign\"\n\nThe Palestinians are trying to rekindle the \"there is hunger in the Gaza Strip\" narrative and have started to promote a campaign on social media that deals with the fact that the majority of Gazans in the northern Gaza Strip are hungry, and with an emphasis on the children (this works best in campaigns) and are forced to eat leaves...\n\nReal pictures of hunger in Gaza are hard to come by... because there is simply no hunger in Gaza... so for the sake of the cause they recruited cartoonists and also use the wonders of AI... (or ask some children to stand with a pile of leaves and take a picture).", "location": "Gaza", "classification": "security", "score": 0.6571613250646349, "event_breakdown": "The provided text did not provide any information about current events of security reported in text that has a specific location."}, {"id": "2c83cb37-3b96-46b6-9b6a-0b25392daf11", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29458/", "date": "2024-06-26 06:55", "message": "Taiwan's Ministry of Defense: 26 Chinese fighter jets were spotted in Taiwan's airspace this morning.", "location": "TAIWAN", "classification": "security", "score": 0.7712617263320517, "event_breakdown": "26 Chinese fighter jets were spotted in Taiwan's airspace this morning."}, {"id": "6cb934f1-ee0e-45fe-8275-25a41f7caa9d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29457/", "date": "2024-06-26 06:52", "message": "After many reports from Gazans in the last few days that they received messages to return/prepare to return to their homes in the northern Gaza Strip, the information office of Hamas publishes a message on its behalf in which it states that these are fake messages and the Gazans should beware of them so they don't fall for them, because the army shoots those who try to return to the northern Gaza Strip.", "location": "Gaza Strip", "classification": "security", "score": 0.8662813106009163, "event_breakdown": "Hamas warns Gazans about fake messages to return to northern Gaza\nAfter many reports from Gazans in the last few days that they received messages to return/prepare to return to their homes in the northern Gaza Strip."}, {"id": "7da1ee9c-6fb7-4003-aa64-5722661d9ae4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29456/", "date": "2024-06-26 06:51", "message": "The Shiite militias in Iraq accepted responsibility for launching a drone towards Eilat early in the morning.\n\nA red alert was indeed activated in Eilat shortly before 02:30.\n\nHere is a report on the matter:\n\nIDF: Following the siren that sounded regarding a hostile aircraft infiltration in the area of Eilat, over the past hour a UAV that was identified approaching Israeli territory from the area of the Red Sea fell off the coast of Eilat. The UAV was monitored by IDF soldiers throughout the incident and it did not cross into Israeli territory. During the incident, an interceptor was launched toward the UAV. \n\nThe sirens regarding a hostile aircraft infiltration were activated in accordance with protocol.", "location": ")\nRED SEA", "classification": "security", "score": 0.9658319398337544, "event_breakdown": "Shiite militias in Iraq launch a drone towards Eilat, Israel. The drone is shot down by the IDF. \n\nThe alarms were activated in Eilat soon before 02:30.\n\nHere is a report on the matter:\n\nIDF: Following the siren that sounded about a hostile aircraft penetration in the area of Eilat, over the last hour a UAV that was discovered approaching Israeli soil from the Persian Gulf area fell off the coast of Eilat. The UAV was monitored by the Defence Forces soldiers throughout the event and it did not enter Israeli territory. During the event, an interceptor was launched towards the UAV.\n\nThe alarms about a hostile aircraft penetration were released in accordance with the protocol."}, {"id": "5d0be3a2-cb92-4b0d-9443-08b724955e12", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29451/", "date": "2024-06-26 06:48", "message": "Pay attention to the following report by the IDF spokesperson last night:\n\nIDF: The IDF eliminated a significant Islamic Jihad terrorist\n\nEarlier today (Tuesday), an IAF aircraft directed by IDF intelligence struck and eliminated the terrorist Fadi Al-Wadiya, who served as a significant operative in the Islamic Jihad terrorist organization.\n\nAs part of his role, Fadi Al-Wadiya developed and advanced the terrorist organization's rocket array and was a central figure in the terrorist organization's knowledge of electronics and chemistry.\n\n##\nThe assassination took place yesterday morning in Gaza City.\n\nNow take a look at the reactions on the Palestinian side about the terrorist Fadi 👇👇👇", "location": "Gaza City", "classification": "security", "score": 0.8821037292963904, "event_breakdown": "The IDF's assassination of the Islamic Jihad leader sparked a new round of fighting between the IDF and the Palestinian Islamic Jihad in the southern Gaza Strip."}, {"id": "c75f3e8e-2c73-4e30-a9f7-14741e345449", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29477/", "date": "2024-06-26 13:26", "message": "More from the chaos in the center of the Gaza Strip: \n\nFatah-affiliated channels report that residents opposed to Hamas (apparently due to the conflict with the Abu Amro family in the a-Zawayda area in central Gaza) set fire to vehicles used by officials from the Hamas Interior Ministry (Hamas' security apparatus) and also set fire to tents belonging to Hamas operatives.", "location": "GAZA", "classification": "security", "score": 0.9865807082966793, "event_breakdown": "Event 1: In the Gaza Strip, residents opposed to Hamas set fire to vehicles used by the Interior Ministry, the security apparatus of the Hamas party.\nEvent 2: In the Gaza Strip, residents opposed to Hamas set fire to tents belonging to Hamas operatives."}, {"id": "d3980d15-918c-4203-9cfe-c0f23dd2f015", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29476/", "date": "2024-06-26 13:24", "message": "The Jordanian Foreign Minister on \"the day after\": \n\nWe will not clean up after Netanyahu and we will not send Jordanian forces to replace the occupation in Gaza.", "location": "Gaza", "classification": "security", "score": 0.9327897057302054, "event_breakdown": "King Abdullah: ISIS's Worst Enemy\nKing Abdullah of Jordan is one of the most dangerous enemies that ISIS has ever faced, and the worst that the terrorist organization has had so far."}, {"id": "94921c53-e658-4a31-b82d-36e8aadec62a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29475/", "date": "2024-06-26 13:24", "message": "Iranian Oil Minister: We signed a memorandum of understanding with Russia regarding the import of Russian gas to Iran.\n\nA senior official in the Iranian President's office: the agreement will lead to a regional geopolitical change, in favor of Iran, in the field of energy.", "location": "Based on the text, it is not clear where the main event takes place.", "classification": "security", "score": 0.5214536283392713, "event_breakdown": "Iranian Oil Minister Zamaninia announces that Iran has signed a memorandum of understanding with Russia regarding the import of Russian gas to the country.\n\nThe official said the agreement would lead to a geopolitical change in favor of Iran in the region in terms of energy. The deal is aimed at diversifying Iran's gas imports, as Iran has had a long-standing agreement to import gas from Turkmenistan."}, {"id": "44af3221-94cf-4a40-abaa-b752367a6cff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29474/", "date": "2024-06-26 12:13", "message": "Bint Jbeil, South Lebanon: A fire broke out following Israeli shelling.", "location": "Bint Jbeil, South Lebanon", "classification": "security", "score": 0.9699529130599701, "event_breakdown": "Bint Jbeil, South Lebanon: A fire broke out following Israeli shelling."}, {"id": "a1ee50a0-c064-4b55-9e34-8dac67a95773", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29473/", "date": "2024-06-26 10:54", "message": "Lebanese Media: An Israeli drone attacked the power line (Transformer 66) located in the village of Tiba in Southern Lebanon. This power line supplies electricity to the Litani River area and was targeted shortly after being repaired.", "location": "LEBANESE", "classification": "security", "score": 0.971300441455746, "event_breakdown": "Lebanese Media: An Israeli drone attacked the power line (Transformer 66) located in the village of Tiba in Southern Lebanon. This power line supplies electricity to the Litani River area and was targeted shortly after being repaired.\nSecurity Event:\nLocation: Lebanese village of Tiba, Southern Lebanon\nEvent: An Israeli drone attacked the power line (Transformer 66) leading to power outage in the Litani River area."}, {"id": "192fa47a-04f7-4068-9d94-e89192b5982c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29472/", "date": "2024-06-26 10:53", "message": "A 50% Decrease in Hezbollah Attacks on Israel in Recent Days\n\nIt's interesting to examine the timeline of Hezbollah's attacks on Israel over the past couple of weeks, for which Hezbollah has officially claimed responsibility.\n\nHere is the list based on Hezbollah's publications, including notable events that have influenced the frequency of attacks. It is worth mentioning that Hezbollah's daily average during the war has been approximately nine attacks per day:\n\nJune 25: 5 attacks\nJune 24: 4 attacks\nJune 23: 6 attacks\nJune 22: 5 attacks\nJune 21: 6 attacks\nJune 20: 5 attacks - The last Hezbollah operative was killed.\nJune 19: 9 attacks\nJune 18: 7 attacks\nJune 17: No attacks - Eid al-Adha\nJune 16: No attacks - Eid al-Adha\nJune 15: 3 attacks - Eve of Eid al-Adha\nJune 14: 18 attacks\nJune 13: 12 attacks\nJune 12: 19 attacks - Beginning of the response to the assassination of senior operative Taleb Abdullah.\nJune 11: 10 attacks", "location": "Israel", "classification": "security", "score": 0.9217181884758614, "event_breakdown": "June 12: Hezbollah launched an attack against Israel in the Golan Heights, wounding two Israeli soldiers. (Reuters)"}, {"id": "9ce6d3eb-00f5-4da2-a9c4-3cc441d04eac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29471/", "date": "2024-06-26 10:40", "message": "Subscriber G gives us a glimpse of this morning's events in Tel a-Sultan area in western Rafah – an Israeli tank fires a shell at a booby-trapped Palestinian house, which explodes with force. \n\nAccording to G, more than 30% of the houses in the area are booby-trapped.", "location": "RAFAH", "classification": "security", "score": 0.8796499810353794, "event_breakdown": "IDF fires at booby-trapped Palestinian house, causing explosion in Tel a-Sultan area, western Rafah. At least 30% of the houses are reported to have been boobytrapped. (Note: Rafah is a city in the Gaza Strip.)"}, {"id": "8ffa520f-9cee-41d6-be85-0e945188bbda", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29470/", "date": "2024-06-26 10:38", "message": "Turkish President Erdogan:\n\nIt seems that Israel, having burned and destroyed Gaza, is now turning its attention to Lebanon and is receiving support for this from the West behind the scenes.\n\nJust as it has stood by the Palestinians, Turkey stands by the Lebanese people and Lebanon, and calls on other countries in the region to do the same.\n\nNetanyahu's plans to expand the circle of conflict will bring catastrophe to the entire region, and the Islamic world and regional countries must oppose this.", "location": "Lebanon", "classification": "security", "score": 0.8305165773038192, "event_breakdown": "Turkish President Recep Tayyip Erdogan claimed that Israel is receiving support from the West behind the scenes in its actions against Lebanon, and called on countries in the region to stand by the Lebanese people. These comments were made in response to Israeli Prime Minister Netanyahu's plans to expand the circle of conflict in the region."}]