[{"id": "b7e7c453-92d0-4260-a568-73cd58e9ecfc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26592/", "date": "2024-05-02 06:10", "message": "Hezbollah supporters publish a martyrdom poster for all seven commanders in Hezbollah's Redwan force who were killed by the IDF in recent months.\n\nIn the middle of the poster, Wisam Al-Tawil, the most senior commander in the group.", "location": "Beirut", "classification": "security", "score": 0.9129119823872885, "event_breakdown": "1. Hezbollah supporters publish a martyrdom poster for seven commanders from Hezbollah's Redwan force killed by the IDF.\n2. Wisam Al-Tawil is featured prominently in the middle of the poster."}, {"id": "3d5db6bd-4d90-485e-bb52-3d98b34e8191", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26591/", "date": "2024-05-02 06:07", "message": "UCLA: LAPD places snipers on the rooftops, ahead of the break-in to the Palestinian camp.", "location": "UCLA", "classification": "security", "score": 0.477613560530437, "event_breakdown": "- LAPD places snipers on the rooftops of UCLA ahead of the break-in to the Palestinian camp."}, {"id": "9303cebf-d5e0-438f-84fa-cbaf3375a958", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26591/", "date": "2024-05-02 06:07", "message": "UCLA, California: Pro-Palestinian protesters strengthen the fortifications around the camp as LAPD prepares to evacuate them.", "location": "UCLA, California", "classification": "security", "score": 0.24548310984527943, "event_breakdown": "- Pro-Palestinian protesters strengthen fortifications around the camp at UCLA, California\n- LAPD prepares to evacuate the pro-Palestinian protesters"}, {"id": "95f568f2-4c53-4f7a-866c-122ca6a0fa23", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26589/", "date": "2024-05-02 05:59", "message": "Anti-Israeli, Hamas-supporting students at CUNY drag the American flag across the floor while stepping on it.\n\nFor Muslims, the sole of the shoe is considered impure (this is why they take off their shoes and wash their feet before entering a mosque). For them, stepping on the flag symbolizes the highest possible level of contempt towards the flag and what it represents.", "location": "CUNY (City University of New York)", "classification": "security", "score": 0.4796570154561653, "event_breakdown": "- Anti-Israeli, Hamas-supporting students at CUNY drag the American flag across the floor while stepping on it."}, {"id": "4a32d210-7355-4f3e-91db-bc5663ac95f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26587/", "date": "2024-05-02 05:48", "message": "More from UCLA: Anti-Israel protesters shout at the police:\n\nShame, shame shame.\nPalestine will be free.\nIntifada, infada.", "location": "UCLA", "classification": "security", "score": 0.8600958656161236, "event_breakdown": "- Anti-Israel protesters at UCLA shouted at the police in response to the Israeli-Palestinian conflict.\n- Protesters chanted \"Shame, shame, shame\" and \"Palestine will be free\" while expressing their support for Palestine.\n- The protest also included chants of \"Intifada, intifada\" as a call for resistance against Israeli occupation."}, {"id": "2d3f02c4-e877-434b-855b-256c765573fc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26586/", "date": "2024-05-02 05:47", "message": "California: University police at UCLA declared the Palestinian camp on the university grounds illegal...", "location": "Los Angeles", "classification": "security", "score": 0.6827855270051891, "event_breakdown": "- California: University police at UCLA declare the Palestinian camp on university grounds illegal.\n- Location: University of California, Los Angeles (UCLA), California, USA"}, {"id": "6ae2a45e-5f10-4c8a-9bfe-b21aefc98fff", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65901/", "date": "2024-05-02 05:46", "message": "New York: An anti-Israel demonstration, with the participation of anti-Zionist Jews, was held in front of the entrance to Columbia University.", "location": "New York", "classification": "security", "score": 0.5234050700785756, "event_breakdown": "- Anti-Israel demonstration at Columbia University, New York"}, {"id": "26a9e319-020f-420b-8793-1a6a5150c6bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65901/", "date": "2024-05-02 05:46", "message": "Georgia: Violent demonstrations broke out last night in front of the Georgian Parliament building, after the Georgian parliament passed the \"Foreign Agents\" law 👆 in second reading.\n\nPro-EU protesters (who oppose the law) were dispersed by riot police.", "location": "Georgian Parliament building", "classification": "security", "score": 0.6551109760272031, "event_breakdown": "null"}, {"id": "2335b811-6d01-4bc9-8d15-0c820eb9d6d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26580/", "date": "2024-05-02 05:43", "message": "The Shiite militias in Iraq claim to have attacked a couple of targets last night, in the Golan and in Eilat, using suicide drones.", "location": "Golan", "classification": "security", "score": 0.9627523075644225, "event_breakdown": "- Shiite militias claim to have attacked targets in the Golan using suicide drones\n- Shiite militias claim to have attacked targets in Eilat using suicide drones"}, {"id": "932c7a20-fe1b-4519-994d-17da360ce32f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26576/", "date": "2024-05-02 05:41", "message": "Tulkarm, West Bank: Palestinian media reports that the last night Palestinian Authority's Security Services killed Ahmed Abu Al-Ful, the commander of the \"death squads\" in the military wing of the Islamic Jihad in Tulkarm.\n\nHamas and the Islamic Jihad issued proclamations in which they strongly condemned the PA.\nLocal organizations in Tulkarm called for demonstrations against the Palestinian Authority.\n\nThe spokesman for the PA's Security Services presented the its version of the events:\n\nAbu Al-Ful fired at a PA patrol and they returned fire at the source of the shooting.", "location": "Tulkarm", "classification": "security", "score": 0.9821976217161991, "event_breakdown": "- Tulkarm, West Bank: Palestinian media reports that the last night Palestinian Authority's Security Services killed Ahmed Abu Al-Ful, the commander of the \"death squads\" in the military wing of the Islamic Jihad in Tulkarm.\n- Hamas and the Islamic Jihad issued proclamations condemning the PA.\n- Local organizations in Tulkarm called for demonstrations against the Palestinian Authority.\n- Spokesman for the PA's Security Services presented its version of events: Abu Al-Ful fired at a PA patrol and they returned fire at the source of the shooting."}, {"id": "010f9cf1-377a-4d24-b3c2-fd79c8a807d1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26574/", "date": "2024-05-01 19:33", "message": "The caption they gave in Lebanon to this video, apparently shot in Beirut:\nIf Tom and Jerry had guns...", "location": "Beirut", "classification": "security", "score": 0.92455182741136, "event_breakdown": "1. Video caption titled \"If Tom and Jerry had guns\" circulating in Lebanon\n2. Video apparently shot in Beirut"}, {"id": "0a8cbf1a-a7e6-4042-81ba-f2a6eca0080c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26572/", "date": "2024-05-01 19:26", "message": "Senior Hamas official Osama Hamdan:\n\nIf Israel launches an attack in Rafah, we will stop the negotiations. We will not conduct negotiations under fire.", "location": "RAFah", "classification": "security", "score": 0.9407444633801235, "event_breakdown": "- Israel launches an attack in Rafah"}, {"id": "596a085e-c548-4fd0-9afa-e23a052ab1a0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26571/", "date": "2024-05-01 19:15", "message": "France: As part of a demonstration on the occasion of Workers' Day in Paris today, a protester, a leftist, threw a bottle at a French policeman...", "location": "Paris", "classification": "security", "score": 0.9116644392276201, "event_breakdown": "- Worker's Day demonstration in Paris\n- Protester throws bottle at French policeman"}, {"id": "2f116b69-cc22-456e-9afc-bd6681f2211d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26569/", "date": "2024-05-01 18:48", "message": "The President of Colombia, Gustavo Petro, announced today during a speech in De Bolivar Square, on the occasion of Workers' Day, that starting tomorrow Colombia will sever diplomatic ties with Israel due to the war in Gaza.\n\n##\nThe Colombian military industry will be less than happy with the announcement...", "location": "Bolivar Square", "classification": "security", "score": 0.589329698151539, "event_breakdown": "- President of Colombia, Gustavo Petro, announces severing of diplomatic ties with Israel during speech at De Bolivar Square on Workers' Day.\n- Location: De Bolivar Square, Colombia\n\n- Colombian military industry reacts negatively to announcement.\n- President Gustavo Petro announced the severance of diplomatic ties with Israel in De Bolivar Square, Colombia\n- Colombian military industry reacts to the announcement"}, {"id": "d0ba04e3-21b0-44a4-8903-8a6040c0dc00", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26567/", "date": "2024-05-01 17:11", "message": "Following the report yesterday 👆\n\nIDF: For the first time since the beginning of the war: The Erez Crossing has been opened for the entry of humanitarian aid\n\nAccording to the government directive, and as part of the effort to increase the quantity and routes for humanitarian aid to the Gaza Strip, for the first time since the beginning of the war, the IDF, through the Coordination of Government Activities in the Territories (COGAT), opened the Erez Crossing of the Ministry of Defense's Land Crossings Authority today (Wednesday), to allow the entry of humanitarian aid into the Gaza Strip. As part of this effort, after careful security inspection, 30 trucks of humanitarian aid including food and medical supplies for the northern part of the Gaza Strip, arrived from Jordan and entered Gaza today.\n\nThe entry of humanitarian aid through the Erez Crossing was made possible after engineering work was carried out in the area by the Engineering Units and additional IDF forces.", "location": "Erez Crossing", "classification": "security", "score": 0.8099480769840893, "event_breakdown": "- Opening of Erez Crossing for entry of humanitarian aid into Gaza Strip"}, {"id": "20b84d3a-496f-476d-9b00-ec6499c0fd05", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26564/", "date": "2024-05-01 16:42", "message": "Pro-Palestinian students yesterday took down the American flag at the University of North Carolina at Chapel Hill and raised the Palestinian flag in its place.\nCounty police officers arrived at the scene and re-raised the American flag. The pro-Israeli students stood there with Israeli flags and sang the American national anthem (as you can see in the attached video) in front of the American flag that was raised at the top of the mast.\n\nImmediately after that, the pro-Palestinians tried to remove the American flag again, and then the students in the picture came and raised the American flag and prevented the flag from touching the floor.\n\n##\nThe Americans are very sensitive to the issue of the flag and in my opinion the pro-Palestinians' injury to it plays against them in American public opinion. The pro-Israel American students made sure to show their respect for American symbols. There are many merits here for Israel and the Jewish community.", "location": "University of North Carolina at Chapel Hill", "classification": "security", "score": 0.591259548805944, "event_breakdown": "- Pro-Palestinian students took down the American flag at the University of North Carolina at Chapel Hill and raised the Palestinian flag\n- County police officers arrived at the scene and re-raised the American flag\n- Pro-Israeli students stood with Israeli flags and sang the American national anthem in front of the American flag\n- Pro-Palestinians tried to remove the American flag again, but other students raised it and prevented it from touching the ground"}, {"id": "a67950a9-c1dc-43f8-96c2-9b6024191e38", "channel_id": 1560386984, "url": "", "date": "2024-05-01 16:36", "message": "Iran: The Fars district police use the Iranian military drone Mahajr 6 to enforce traffic laws....\n\nThe Iranian drivers hope that the UAV, which is capable of carrying bombs, is not armed...", "location": "Fars district", "classification": "security", "score": 0.9309802576040591, "event_breakdown": "- The Fars district police uses the Iranian military drone Mahajr 6 to enforce traffic laws\n- Iranian drivers hope that the UAV is not armed."}, {"id": "aabf6c39-0233-488b-a942-0b6a44117e80", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26560/", "date": "2024-05-01 14:52", "message": "From the other side, the pro-Hamas students at UCLA call out to the Los Angeles police officers:\n\nPigs go home!\n\n##\nThe whole story is in two videos.", "location": "Los Angeles", "classification": "security", "score": 0.7977283031701242, "event_breakdown": "null"}, {"id": "e9aae0b4-cec7-464d-96f5-b891a88d0a1e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26559/", "date": "2024-05-01 14:03", "message": "California, UCLA:\n\nLos Angeles police officers arrive at the university grounds and are greeted with sympathetic chants from the pro-Israel students:\n\nUSA, USA, USA !", "location": "UCLA, Los Angeles", "classification": "security", "score": 0.7240329419690582, "event_breakdown": "- Los Angeles police officers arrive at UCLA\n- Pro-Israel students greet police with sympathetic chants \"USA, USA, USA!\""}, {"id": "10a79af1-15a9-492b-8a83-6a6d905c29f4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26558/", "date": "2024-05-01 13:45", "message": "An important statement yesterday by the spokesperson of the American State Department, regarding the lawsuits against Israel for the war in Gaza:\n\nWe believe that the International Criminal Court in The Hague has no jurisdiction in this matter.", "location": "The Hague", "classification": "security", "score": 0.6211716807888927, "event_breakdown": "- Statement by the American State Department spokesperson regarding lawsuits against Israel for the war in Gaza"}, {"id": "a8d4c563-ec50-4af4-b36d-a34321ff3a62", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26557/", "date": "2024-05-01 13:44", "message": "Hezbollah announces a death in its ranks:\n\nVahid Tefili, born in 2000 from the village of Deir al-Zahrani in southern Lebanon.\n\nVahid was seriously injured more than four days ago and died tonight from his wounds. The circumstances of his death are not specified.\nIn addition to being a Hezbollah military operative, he was a \"commander\" in the local Hezbollah scout tribe.\n\nNumber 291", "location": "Deir al-Zahrani", "classification": "security", "score": 0.9744458110938735, "event_breakdown": "- Hezbollah announces the death of Vahid Tefili, a military operative and \"commander\" in the local Hezbollah scout tribe, from the village of Deir al-Zahrani in southern Lebanon."}, {"id": "2305ca7c-6494-4c43-b36d-84c606d078d4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26555/", "date": "2024-05-01 13:42", "message": "The Lebanese Al-Akhbar newspaper (affiliated with Hezbollah) publishes the details of the Israeli proposal that it claims was submitted to Hamas through Egypt on April 26:\n\nFirst stage (40 days - subject to extension)\n\nThe Israeli forces will withdraw from the densely populated areas (not from Netzarim Corridor).\nAircraft traffic in the Gaza Strip will be suspended for 8-10 hours every day.\nThe displaced citizens will be able to return to their homes.\nOn the seventh day after the release of the women among the abductees, IDF forces will clear the coastal axis to allow the movement of humanitarian aid.\nOn the 22nd, after the release of two-thirds of the agreed upon hostages, the IDF forces will withdraw from Netzarim Corridor. At this stage, it will be possible to bring in 500 aid trucks a day, 50 of which will be diesel for the operation of the power plant in Gaza. Heavy equipment will also be brought into the Gaza Strip to clear the rubble and the hospitals, clinics will be retrained and the bakeries all over the strip.\n\nDuring this period, Hamas will release at least 33 abductees under the category: women, children up to the age of 19, adults over the age of 50, sick and wounded.\nIsrael will release 20 Palestinian prisoners for each abductee, in a matching category: women and children for women and children. Adults against adults, when the proportion of 20 prisoners is kept for each abductee.\nIn this category, Palestinian prisoners whose remaining sentence exceeds 10 years will not be released.\n\nSoldiers category:\nFor each kidnapped female soldier, 20 prisoners sentenced to life imprisonment and another 20 prisoners with up to 10 years remaining in prison will be released. Israel has the right to veto the names of the prisoners up to 200 names cumulatively.\nThe prisoners will be released to the Gaza Strip or abroad.\n\nRate of release: Hamas will release 3 Israeli hostages every 3 days.\nThe Palestinian prisoners who will be released will not be able to be re-arrested for the crimes they committed before their prison term (ie they will receive amnesty).\n\nStarting on the 14th, there was an agreement for more wounded military operatives, according to an agreed list, to go through the Rafah crossing for medical treatment abroad.\n\nSecond stage of the agreement (42 days)\n\nThe completion of the agreement for a comprehensive calm (ceasefire) and its announcement before the release of surviving abductees (men and soldiers) in exchange for the release of additional Palestinian prisoners.\nThe beginning of the necessary arrangements for the total rehabilitation of the strip.\n\nStep 3 of the agreement (42 days)\nKidnapped-prisoner body swap.\nBeginning of the implementation of a 5-year rehabilitation plan for the Strip.", "location": "Gaza Strip", "classification": "security", "score": 0.9000418392132419, "event_breakdown": "- Lebanese Al-Akhbar newspaper publishes Israeli proposal details to Hamas through Egypt on April 26\n- First stage of the proposal (40 days)\n  - Israeli forces withdraw from densely populated areas except Netzarim Corridor\n  - Aircraft traffic in Gaza Strip suspended for 8-10 hours daily\n  - Displaced citizens allowed to return home\n  - IDF forces clear coastal axis after release of women abductees\n  - IDF withdraws from Netzarim Corridor after release of two-thirds of hostages\n  - Incoming aid includes 500 trucks/day, medical equipment, and humanitarian aid\n  - Hamas releases abductees based on categories\n  - Israel releases Palestinian prisoners in matching categories\n  - Soldiers category: specific conditions for release\n  - Rate of release: 3 Israeli hostages every 3 days\n  - Wounded military operatives allowed to go abroad for treatment\n\n- Second stage of the agreement (42 days)\n  - Comprehensive calm (ceasefire) announced before release of remaining abductees\n  - Preparations for total rehabilitation of Gaza Strip begin\n\n- Step 3 of the agreement (42 days)\n  - Kidnapped-prisoner body swap\n  - Implementation of a 5-year rehabilitation plan for Gaza Strip begins"}, {"id": "3774cbab-1baa-4b52-8d13-848978e09f43", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26554/", "date": "2024-05-01 13:36", "message": "The operation in Rafah - the Lebanese Al-Akhbar newspaper (Hezbollah-affiliated) from its sources:\n\nThe US demands that Israel evacuate at least 800,000 displaced people from Rafah before the attack in the area. 40,000 tents arrived in Israel from China, paid for by the United Arab Emirates. Each tent can accommodate 20 people (a total of 800,000 people).\n\nThere is a concentration of about a thousand IDF vehicles, including tanks and APCs in the southern area of ​​the Gaza Strip (on the Israeli side).\nIsrael is planning to break into Rafah from the area of ​​the Sofa crossing and the Kerem Shalom crossing.\n\nThe Egyptians asked to check with the leadership of Hamas, whether its military arm is planning to blow up the fences in the border area with Egypt in order to cause crowds to flee to Egyptian territory.", "location": "Rafah", "classification": "security", "score": 0.9569005729564938, "event_breakdown": "1. US demands Israel evacuate 800,000 displaced people from Rafah before the attack.\n2. 40,000 tents arrive in Israel from China, paid for by the United Arab Emirates.\n3. Concentration of about a thousand IDF vehicles in southern Gaza Strip.\n4. Israel plans to break into Rafah from Sofa crossing and Kerem Shalom crossing.\n5. Egyptians inquire with Hamas leadership about potential border disturbances with Egypt."}, {"id": "5e2b3e83-8a3d-46e2-a375-8124a029a852", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26552/", "date": "2024-05-01 06:52", "message": "Florida: Security forces dispersed a demonstration on the campus of the University of South Florida by firing tear gas.\n\nPro-Palestinian rioters were also arrested there.", "location": "University of South Florida", "classification": "security", "score": 0.8859654747405098, "event_breakdown": "- Security forces dispersed a demonstration on the campus of the University of South Florida by firing tear gas and arrested pro-Palestinian rioters."}, {"id": "88cdaae1-9ca5-49ad-b731-0d289530b2bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26544/", "date": "2024-05-01 06:48", "message": "NYPD buses with the detainees from tonight leave the grounds of Columbia University.", "location": "Columbia University", "classification": "security", "score": 0.5229719379429217, "event_breakdown": "- NYPD buses with detainees from Columbia University leave the grounds."}, {"id": "ccaeecf5-9f6c-47c9-8f65-3776ed0510cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26538/", "date": "2024-05-01 06:44", "message": "At the center of it all - the removal of the Palestinian rioters occupying Hamilton Hall, which they had vandalized while taking over the building and barricading themselves inside.", "location": "Hamilton Hall", "classification": "security", "score": 0.942578494351582, "event_breakdown": "1. Palestinian rioters occupy Hamilton Hall\n2. Palestinian rioters vandalize Hamilton Hall\n3. Palestinian rioters barricade themselves inside Hamilton Hall\n4. Removal of Palestinian rioters from Hamilton Hall"}, {"id": "8be728f7-f9d8-4e87-9482-96ccb438a50b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26536/", "date": "2024-04-30 21:25", "message": "University of Ottawa in Canada - chants in Arabic:\nFree Free Palestine\nOut out with Israel", "location": "University of Ottawa in Ottawa, Canada", "classification": "security", "score": 0.48927072203212124, "event_breakdown": "- University of Ottawa, Canada: Chants in Arabic heard on campus:\n  - \"Free Free Palestine\"\n  - \"Out out with Israel\"\n- Chants in Arabic calling for a free Palestine and condemning Israel at the University of Ottawa in Canada"}, {"id": "86eab736-bb16-4a9a-8ea4-84c513970628", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26535/", "date": "2024-04-30 20:55", "message": "Tomorrow will be a month since the last attack attributed to Israel in Damascus, the capital of Syria - the attack in which Muhammad Reza Zahedi, the commander of the Quds Force in the Iranian Revolutionary Guards in the Syrian and Lebanese sector, was killed.\n\nAccording to Syrian sources, this is the longest quiet period in the skies of Damascus in recent years.\n\nIs the Iranian deterrence working?", "location": "Damascus, Syria.", "classification": "security", "score": 0.8725166052039606, "event_breakdown": "- Damascus, Syria: It will be a month since the last attack attributed to Israel in Damascus, the capital of Syria. Muhammad Reza Zahedi, commander of the Quds Force in the Iranian Revolutionary Guards in the Syrian and Lebanese sector, was killed in the attack.\n- Location: Damascus, Syria"}, {"id": "080d75a9-a5a0-4d54-8f00-18e0444daf28", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26534/", "date": "2024-04-30 20:50", "message": "The Houthis, Iran's loyalists in Yemen, publish documentation of a UAV they launched yesterday at the Greek ship CYCLADES, according to the US Central Command, there were no casualties as a result and the ship continued on its way. Damage was not denied.", "location": "CYCLADES", "classification": "security", "score": 0.891526682381482, "event_breakdown": "- The Houthis in Yemen publish documentation of a UAV they launched at the Greek ship CYCLADES. \n- According to the US Central Command, there were no casualties as a result of the UAV launch.\n- The ship CYCLADES continued on its way after the incident."}, {"id": "c8e922f3-23be-45c5-8347-611420efc481", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26533/", "date": "2024-04-30 19:51", "message": "President Biden: Hamas has now become the only obstacle to a ceasefire and aid to civilians in Gaza.", "location": "Gaza", "classification": "security", "score": 0.35802645145819, "event_breakdown": "- President Biden's statement on Hamas being the only obstacle to a ceasefire and aid to civilians in Gaza"}, {"id": "507b1fef-1b8e-4f04-bfc9-5dc4d59aafb0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26531/", "date": "2024-04-30 17:14", "message": "About Al Jazeera:\nThe Qatari network will soon broadcast a special program in which it will glorify and praise Yahya Sinwar, the leader of Hamas in the Gaza Strip - \"the man who managed to put the whole world on one foot\".", "location": "Gaza Strip", "classification": "security", "score": 0.8212158042349625, "event_breakdown": "- Al Jazeera plans to broadcast a special program that glorifies and praises Yahya Sinwar, the leader of Hamas in the Gaza Strip.\n- Location: Al Jazeera, Doha, Qatar"}, {"id": "0679c8c4-c27c-4e9d-98eb-7def0670a516", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26530/", "date": "2024-04-30 16:32", "message": "A young Jewish man does not allow Al Jazeera's reporter, Najwan Simri, to broadcast a report (which is not sympathetic to Israel, to put it mildly) regarding the stabbing attack by the Turkish citizen today in the Old City of Jerusalem.\nHe repeats to the camera: don't listen to their nonsense.\nShe later turns to the Israeli police stationed in the area, complaining about the young man and falsely claiming he is touching her.\nIt is worth noting they are members of the same force (Israeli Border Police) that was attacked.", "location": "Old City of Jerusalem", "classification": "security", "score": 0.9339038273219109, "event_breakdown": "- A young Jewish man interrupts Al Jazeera's reporter, Najwan Simri, from broadcasting a report in the Old City of Jerusalem\n- The man tells the camera not to listen to their nonsense\n- Najwan Simri complains to Israeli police in the area, falsely claiming the young man is touching her"}, {"id": "7adbc976-f084-4bd7-bc21-441660cda245", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26529/", "date": "2024-04-30 16:00", "message": "Members of the Palestinian Authority's security forces confront Palestinian protesters near the Canadian Embassy in Ramallah. The protesters are protesting Canada's support for Israel regarding the fighting in Gaza.", "location": "Ramallah", "classification": "security", "score": 0.9876206410667714, "event_breakdown": "- Ramallah: Members of the Palestinian Authority's security forces confront Palestinian protesters near the Canadian Embassy. The protesters were demonstrating against Canada's support for Israel regarding the fighting in Gaza."}, {"id": "988c07e2-dc6d-4c0b-9a75-a36e697ddf58", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26527/", "date": "2024-04-30 15:38", "message": "The military arm of the Islamic Jihad in Jenin is trying to thwart the entry of the undercover forces into the refugee camp and placed signs with instructions for the driving public:\n\n1. The car windows must be opened.\n2. At night, the interior light in the car must be turned on.\n3. Owners of commercial vehicles - your vehicle will be checked before entering the area.", "location": "Jenin", "classification": "security", "score": 0.9594313959113322, "event_breakdown": "- The military arm of the Islamic Jihad in Jenin attempts to block undercover forces from entering the refugee camp by setting up signs with driving instructions, including opening car windows and turning on interior lights at night.\n- Commercial vehicle owners are notified that their vehicles will be inspected before entering the area."}, {"id": "528aea63-49f2-4cd1-8586-2258ed9171b6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26524/", "date": "2024-04-30 14:52", "message": "Two public promises today made by the Prime Minister and Minister Ben Gvir regarding entry to Rafah.\nArab and Palestinian media quote them extensively.", "location": "Rafah", "classification": "security", "score": 0.4280292525387717, "event_breakdown": "- Rafah: Prime Minister and Minister Ben Gvir make public promises regarding entry policies.\n- Location: Rafah, Gaza Strip"}, {"id": "e8dc7c38-0108-419b-bbcb-da48579d6ece", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26523/", "date": "2024-04-30 14:51", "message": "The White House: Soon, trucks with flour will enter Gaza through a new crossing.", "location": "The White House", "classification": "security", "score": 0.43932515330510435, "event_breakdown": "- Trucks with flour will enter Gaza through a new crossing by The White House"}, {"id": "55dccc80-ce89-4e09-a297-302541714c62", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26521/", "date": "2024-04-30 13:25", "message": "The military wing of the Islamic Jihad: We fired rockets at the Israeli command and control centers in the Netzarim area.", "location": "Netzarim", "classification": "security", "score": 0.9949691837335627, "event_breakdown": "- Netzarim area, Israel: The military wing of the Islamic Jihad claims to have fired rockets at Israeli command and control centers.\n- Location: Netzarim area, Israel"}, {"id": "e4ef003e-13b4-4392-8d23-cf2ea50be103", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26520/", "date": "2024-04-30 13:24", "message": "The Israel Police publishes CCTV footage of today's stabbing attack near the Flowers Gate in the Old City of Jerusalem.\n\nThe Turkish terrorist stalked the two police officers from behind, and then pulled out a knife and started stabbing one of two.\n\nThankfully the officers managed to fight him off, sustaining only minor injuries.\n\nAs previously mentioned, the terrorist was shot and killed.", "location": "Old City of Jerusalem", "classification": "security", "score": 0.9972743688563904, "event_breakdown": "- Stabbing attack near the Flowers Gate in the Old City of Jerusalem\n- Turkish terrorist stalking two police officers\n- Turkish terrorist stabbing one of the police officers\n- Police officers fighting off the attacker with minor injuries\n- Terrorist shot and killed by the police"}]