[{"id": "a61b7068-966a-48c5-b3b7-956bb7d9f654", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26564/", "date": "2024-05-01 16:42", "message": "Pro-Palestinian students yesterday took down the American flag at the University of North Carolina at Chapel Hill and raised the Palestinian flag in its place.\nCounty police officers arrived at the scene and re-raised the American flag. The pro-Israeli students stood there with Israeli flags and sang the American national anthem (as you can see in the attached video) in front of the American flag that was raised at the top of the mast.\n\nImmediately after that, the pro-Palestinians tried to remove the American flag again, and then the students in the picture came and raised the American flag and prevented the flag from touching the floor.\n\n##\nThe Americans are very sensitive to the issue of the flag and in my opinion the pro-Palestinians' injury to it plays against them in American public opinion. The pro-Israel American students made sure to show their respect for American symbols. There are many merits here for Israel and the Jewish community.", "location": "Chapel Hill, North Carolina", "classification": "security", "score": 0.591259548805944, "event_breakdown": "- Pro-Palestinian students took down the American flag at the University of North Carolina at Chapel Hill and raised the Palestinian flag in its place.\n- County police officers arrived at the scene and re-raised the American flag.\n- Pro-Israeli students stood with Israeli flags and sang the American national anthem in front of the American flag.\n- Pro-Palestinians tried to remove the American flag again.\n- Students raised the American flag and prevented it from touching the floor."}, {"id": "bcc331e1-2051-4d8a-8448-506d4bd8f1a7", "channel_id": 1560386984, "url": "", "date": "2024-05-01 16:36", "message": "Iran: The Fars district police use the Iranian military drone Mahajr 6 to enforce traffic laws....\n\nThe Iranian drivers hope that the UAV, which is capable of carrying bombs, is not armed...", "location": "Fars district", "classification": "security", "score": 0.9309802576040591, "event_breakdown": "- Fars district police use Iranian military drone Mahajr 6 to enforce traffic laws in Iran\n- Iranian drivers express concern about the potential arming of the UAV"}, {"id": "227fcc4e-1321-4480-b0ad-91d61d812877", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26560/", "date": "2024-05-01 14:52", "message": "From the other side, the pro-Hamas students at UCLA call out to the Los Angeles police officers:\n\nPigs go home!\n\n##\nThe whole story is in two videos.", "location": "UCLA", "classification": "security", "score": 0.7977283031701242, "event_breakdown": "1. Pro-Hamas students at UCLA confront Los Angeles police officers and shout \"Pigs go home!\""}, {"id": "bfc9d77b-2c0d-4944-a0c2-a39cc2b2725f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26559/", "date": "2024-05-01 14:03", "message": "California, UCLA:\n\nLos Angeles police officers arrive at the university grounds and are greeted with sympathetic chants from the pro-Israel students:\n\nUSA, USA, USA !", "location": "UCLA, Los Angeles, California", "classification": "security", "score": 0.7240329419690582, "event_breakdown": "- Los Angeles police officers arrive at UCLA\n- Pro-Israel students greet police officers with sympathetic chants of \"USA, USA, USA!\""}, {"id": "08415f15-e342-404c-af08-543e5dbf3ac9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26558/", "date": "2024-05-01 13:45", "message": "An important statement yesterday by the spokesperson of the American State Department, regarding the lawsuits against Israel for the war in Gaza:\n\nWe believe that the International Criminal Court in The Hague has no jurisdiction in this matter.", "location": "The Hague", "classification": "security", "score": 0.6211716807888927, "event_breakdown": "1. Statement by American State Department spokesperson regarding lawsuits against Israel for the war in Gaza."}, {"id": "a10e3eb7-91b5-4b21-b2db-e184f485bafe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26557/", "date": "2024-05-01 13:44", "message": "Hezbollah announces a death in its ranks:\n\nVahid Tefili, born in 2000 from the village of Deir al-Zahrani in southern Lebanon.\n\nVahid was seriously injured more than four days ago and died tonight from his wounds. The circumstances of his death are not specified.\nIn addition to being a Hezbollah military operative, he was a \"commander\" in the local Hezbollah scout tribe.\n\nNumber 291", "location": "Deir al-Zahrani", "classification": "security", "score": 0.9744458110938735, "event_breakdown": "1. Location: Southern Lebanon\n   Event: Hezbollah announces the death of Vahid Tefili, born in 2000 in the village of Deir al-Zahrani. He was seriously injured more than four days ago and died from his wounds. Tefili was a Hezbollah military operative and a \"commander\" in the local Hezbollah scout tribe."}, {"id": "5fceadcd-01c7-4c8c-8d84-f68f89487258", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26554/", "date": "2024-05-01 13:36", "message": "The operation in Rafah - the Lebanese Al-Akhbar newspaper (Hezbollah-affiliated) from its sources:\n\nThe US demands that Israel evacuate at least 800,000 displaced people from Rafah before the attack in the area. 40,000 tents arrived in Israel from China, paid for by the United Arab Emirates. Each tent can accommodate 20 people (a total of 800,000 people).\n\nThere is a concentration of about a thousand IDF vehicles, including tanks and APCs in the southern area of ​​the Gaza Strip (on the Israeli side).\nIsrael is planning to break into Rafah from the area of ​​the Sofa crossing and the Kerem Shalom crossing.\n\nThe Egyptians asked to check with the leadership of Hamas, whether its military arm is planning to blow up the fences in the border area with Egypt in order to cause crowds to flee to Egyptian territory.", "location": "Rafah", "classification": "security", "score": 0.9569005729564938, "event_breakdown": "- US demands evacuation of 800,000 displaced people from Rafah before attack\n- 40,000 tents from China, paid for by UAE, arrived in Israel\n- Concentration of IDF vehicles in southern Gaza Strip\n- Israel planning to break into Rafah from Sofa and Kerem Shalom crossings\n- Egyptians inquire Hamas about potential border disturbance plan"}, {"id": "2a46a7c5-b4ce-4700-a37f-2c6771dbb056", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26553/", "date": "2024-05-01 06:54", "message": "City University of New York (CUNY): NYPD remove the Palestinian flag and return the American flag to its rightful place.\n\nHow symbolic.", "location": "City University of New York", "classification": "security", "score": 0.6717599929513742, "event_breakdown": "1. NYPD removes Palestinian flag at City University of New York (CUNY)\n2. American flag returned to its rightful place at CUNY"}, {"id": "f18bc5eb-81ef-4021-acd9-d86b40837564", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26552/", "date": "2024-05-01 06:52", "message": "Florida: Security forces dispersed a demonstration on the campus of the University of South Florida by firing tear gas.\n\nPro-Palestinian rioters were also arrested there.", "location": "University of South Florida", "classification": "security", "score": 0.8859654747405098, "event_breakdown": "- Security forces dispersed a demonstration on the campus of the University of South Florida by firing tear gas\n- Pro-Palestinian rioters were arrested there"}, {"id": "cb8c1f59-b6a0-4178-8df0-5d9e8d650a27", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26547/", "date": "2024-05-01 06:50", "message": "Outside Columbia University: \"NYPD, KKK, IDF they're all the same\" \n\nArrests were made there as well.", "location": "Columbia University", "classification": "security", "score": 0.8221939130531482, "event_breakdown": "- Outside Columbia University: \"NYPD, KKK, IDF they're all the same\"\n- Arrests were made there as well"}, {"id": "1308c6e0-bddb-4c66-a723-99d677bae0c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26544/", "date": "2024-05-01 06:48", "message": "NYPD buses with the detainees from tonight leave the grounds of Columbia University.", "location": "Columbia University", "classification": "security", "score": 0.5229719379429217, "event_breakdown": "- NYPD buses with detainees leave Columbia University"}, {"id": "c24bb486-65dd-4476-8c96-931f7616926a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26538/", "date": "2024-05-01 06:44", "message": "At the center of it all - the removal of the Palestinian rioters occupying Hamilton Hall, which they had vandalized while taking over the building and barricading themselves inside.", "location": "'Hamilton Hall'", "classification": "security", "score": 0.942578494351582, "event_breakdown": "1. Palestinian rioters occupy Hamilton Hall, vandalize the building, and barricade themselves inside."}, {"id": "82525d0b-51c5-4baf-a27c-156ba8d7871d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26536/", "date": "2024-04-30 21:25", "message": "University of Ottawa in Canada - chants in Arabic:\nFree Free Palestine\nOut out with Israel", "location": "University of Ottawa in Canada", "classification": "security", "score": 0.48927072203212124, "event_breakdown": "1. University of Ottawa, Canada: Chants in Arabic supporting Palestine and denouncing Israel."}, {"id": "e3c8b5ec-28cb-4093-acb0-edc20406af23", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26535/", "date": "2024-04-30 20:55", "message": "Tomorrow will be a month since the last attack attributed to Israel in Damascus, the capital of Syria - the attack in which Muhammad Reza Zahedi, the commander of the Quds Force in the Iranian Revolutionary Guards in the Syrian and Lebanese sector, was killed.\n\nAccording to Syrian sources, this is the longest quiet period in the skies of Damascus in recent years.\n\nIs the Iranian deterrence working?", "location": "Damascus, Syria", "classification": "security", "score": 0.8725166052039606, "event_breakdown": "- Attack attributed to Israel in Damascus, Syria resulting in the death of Muhammad Reza Zahedi, commander of the Quds Force in the Iranian Revolutionary Guards in the Syrian and Lebanese sector.\n- Longest quiet period in the skies of Damascus, Syria in recent years reported by Syrian sources."}, {"id": "099ede50-afdc-4166-927c-8d2649133455", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26534/", "date": "2024-04-30 20:50", "message": "The Houthis, Iran's loyalists in Yemen, publish documentation of a UAV they launched yesterday at the Greek ship CYCLADES, according to the US Central Command, there were no casualties as a result and the ship continued on its way. Damage was not denied.", "location": "The main location where the event takes place is: CYCLADES", "classification": "security", "score": 0.891526682381482, "event_breakdown": "1. Houthis in Yemen launch a UAV at the Greek ship CYCLADES.\n2. The US Central Command confirms the incident and reports no casualties on board the ship.\n3. The CYCLADES ship sustains damage from the UAV attack but continues its voyage."}, {"id": "bdcb404f-f37f-4c32-b9c2-ca1f9d06b1f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26532/", "date": "2024-04-30 19:10", "message": "The American Washington Post:\n1200 students have been arrested so far as part of protests at universities across the US.", "location": "Washington, D.C.", "classification": "security", "score": 0.4446909162405631, "event_breakdown": "- 1200 students arrested in protests at universities across the US"}, {"id": "d8a2ac98-ab0b-433c-9cdb-5ed4db27de1f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26531/", "date": "2024-04-30 17:14", "message": "About Al Jazeera:\nThe Qatari network will soon broadcast a special program in which it will glorify and praise Yahya Sinwar, the leader of Hamas in the Gaza Strip - \"the man who managed to put the whole world on one foot\".", "location": "Gaza Strip", "classification": "security", "score": 0.8212158042349625, "event_breakdown": "- Al Jazeera plans to broadcast a special program praising Yahya Sinwar, the leader of Hamas in the Gaza Strip"}, {"id": "d4c07db6-ff22-4c71-9d97-da5611e31442", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26530/", "date": "2024-04-30 16:32", "message": "A young Jewish man does not allow Al Jazeera's reporter, Najwan Simri, to broadcast a report (which is not sympathetic to Israel, to put it mildly) regarding the stabbing attack by the Turkish citizen today in the Old City of Jerusalem.\nHe repeats to the camera: don't listen to their nonsense.\nShe later turns to the Israeli police stationed in the area, complaining about the young man and falsely claiming he is touching her.\nIt is worth noting they are members of the same force (Israeli Border Police) that was attacked.", "location": "Odesa", "classification": "security", "score": 0.9339038273219109, "event_breakdown": "- A young Jewish man prevents Al Jazeera's reporter, Najwan Simri, from broadcasting a report on a stabbing attack by a Turkish citizen in the Old City of Jerusalem\n- The man advises the viewers not to listen to the report\n- Najwan Simri complains to the Israeli police about the young man and falsely claims he is touching her"}, {"id": "0080848d-f9d3-47cf-8581-7f9d377fd10f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26529/", "date": "2024-04-30 16:00", "message": "Members of the Palestinian Authority's security forces confront Palestinian protesters near the Canadian Embassy in Ramallah. The protesters are protesting Canada's support for Israel regarding the fighting in Gaza.", "location": "Ramallah", "classification": "security", "score": 0.9876206410667714, "event_breakdown": "Location: Ramallah, Palestinian Authority\n\nEvent: Members of the Palestinian Authority's security forces confront Palestinian protesters near the Canadian Embassy. The protesters are demonstrating against Canada's support for Israel regarding the fighting in Gaza."}, {"id": "ceee20f3-c79c-44c5-87a5-8e6c2f00284d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26527/", "date": "2024-04-30 15:38", "message": "The military arm of the Islamic Jihad in Jenin is trying to thwart the entry of the undercover forces into the refugee camp and placed signs with instructions for the driving public:\n\n1. The car windows must be opened.\n2. At night, the interior light in the car must be turned on.\n3. Owners of commercial vehicles - your vehicle will be checked before entering the area.", "location": "Jenin", "classification": "security", "score": 0.9594313959113322, "event_breakdown": "- The military arm of the Islamic Jihad in Jenin placing signs with instructions for the driving public in the refugee camp to thwart the entry of undercover forces."}, {"id": "8f893c20-ac7e-4c1f-81b5-1cccbaceaf7b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26524/", "date": "2024-04-30 14:52", "message": "Two public promises today made by the Prime Minister and Minister Ben Gvir regarding entry to Rafah.\nArab and Palestinian media quote them extensively.", "location": "Rafah", "classification": "security", "score": 0.4280292525387717, "event_breakdown": "- Two public promises made by the Prime Minister and Minister Ben Gvir regarding entry to Rafah\n- Arab and Palestinian media extensively quote the promises made by the Prime Minister and Minister Ben Gvir"}, {"id": "ced78d5a-8759-4070-a2ac-88ae9d58ccc1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26522/", "date": "2024-04-30 14:50", "message": "Esra Erdoğan, the daughter of the President of Turkey, praises and praises in Arabic the Turkish terrorist who carried out the stabbing attack today in East Jerusalem.\nShe calls him by the nickname \"Lion of Lions of Turkey\" and calls to pray for the sake of the \"heroic martyr\".\n\nAfter the terrorist's name was revealed, she tweeted another tweet in his honor.", "location": "East Jerusalem", "classification": "security", "score": 0.5620430139992374, "event_breakdown": "- Esra Erdoğan praises Turkish terrorist in Arabic for stabbing attack in East Jerusalem\n- Refers to the terrorist as \"Lion of Lions of Turkey\" and calls for prayers for the \"heroic martyr\"\n- Tweets another message in honor of the terrorist after his name is revealed"}, {"id": "04181b7f-e6f2-4859-9b03-a6825d3024cc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26521/", "date": "2024-04-30 13:25", "message": "The military wing of the Islamic Jihad: We fired rockets at the Israeli command and control centers in the Netzarim area.", "location": "Netzarim area", "classification": "security", "score": 0.9949691837335627, "event_breakdown": "- Rocket attack by the military wing of the Islamic Jihad on the Israeli command and control centers in the Netzarim area"}, {"id": "f9452b6a-0ea2-46f1-9385-e36c8bfdcb83", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26520/", "date": "2024-04-30 13:24", "message": "The Israel Police publishes CCTV footage of today's stabbing attack near the Flowers Gate in the Old City of Jerusalem.\n\nThe Turkish terrorist stalked the two police officers from behind, and then pulled out a knife and started stabbing one of two.\n\nThankfully the officers managed to fight him off, sustaining only minor injuries.\n\nAs previously mentioned, the terrorist was shot and killed.", "location": "Old City of Jerusalem", "classification": "security", "score": 0.9972743688563904, "event_breakdown": "- Stabbing attack near the Flowers Gate in the Old City of Jerusalem\n- Terrorist stalking police officers and stabbing one of them\n- Police officers fighting off the attacker and sustaining minor injuries\n- Terrorist shot and killed"}, {"id": "84d19bec-b82e-420d-aeaf-fbb9019d70ea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26517/", "date": "2024-04-30 13:11", "message": "Lebanese sources report on casualties in several Israeli attacks in Yaroun and Odaisseh in southern Lebanon.", "location": "Yaroun", "classification": "security", "score": 0.9926602654668037, "event_breakdown": "Location: Yaroun and Odaisseh, Southern Lebanon\n\nEvent: Lebanese sources report casualties in several Israeli attacks in Yaroun and Odaisseh in southern Lebanon."}, {"id": "46025722-37eb-4459-8e1e-0315f26b18e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26516/", "date": "2024-04-30 11:12", "message": "The American University in Beirut, Lebanon: Here, too, the statue of George Washington undergoes a process of \"Palestinianization\"\n\nOne of the students in the crowd is seen holding a picture of Muhammad Deif, the head of the military wing of Hamas.", "location": "Beirut, Lebanon", "classification": "security", "score": 0.6905892484369863, "event_breakdown": "null"}, {"id": "4198b2f5-8d1f-4774-8702-03dbb4f241cd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26515/", "date": "2024-04-30 10:49", "message": "Ramallah, West Bank: A Palestinian joyfully presents the loot from the attack on the German ambassador's vehicle - its license plate.", "location": "Ramallah, West Bank", "classification": "security", "score": 0.9812876088138319, "event_breakdown": "Location: Ramallah, West Bank\n\nEvent: A Palestinian joyfully presents the loot from the attack on the German ambassador's vehicle, specifically its license plate."}, {"id": "83686238-b33a-4be9-8339-600d40c49cd8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26514/", "date": "2024-04-30 10:31", "message": "The Flower Gate area in the Old City of Jerusalem:\n\nAn Israeli police officer sustained light injuries in a stabbing attack. \n\nThe terrorist, a tourist from Turkey was \"neutralized\", apparently permanently.", "location": "Old City of Jerusalem", "classification": "security", "score": 0.9953919204555158, "event_breakdown": "Location: Flower Gate area, Old City of Jerusalem\n\nEvent: An Israeli police officer sustains light injuries in a stabbing attack by a tourist from Turkey. The attacker is neutralized, presumably permanently."}, {"id": "5446b0b7-f7f5-49e3-914f-1eaedae0c274", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26513/", "date": "2024-04-30 10:30", "message": "Ramallah, West Bank: The German ambassador to the PA was almost lynched by a Palestinian mob during a visit to a museum near Birzeit University.\n\nThe Palestinian mob surrounded the ambassador's car, vandalized it, and threw rocks at it.\n\nThis attack comes in light of Germany's support for Israel during the war.", "location": "Ramallah, West Bank", "classification": "security", "score": 0.9413258241893517, "event_breakdown": "1. Ramallah, West Bank: German ambassador to the PA nearly lynched by Palestinian mob during visit to museum near Birzeit University.\n2. Palestinian mob surrounds ambassador's car, vandalizes it, and throws rocks at it.\n3. Attack linked to Germany's support for Israel during war."}, {"id": "0cfacb2d-018b-4aea-87af-bb6113d0af1c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26512/", "date": "2024-04-30 10:25", "message": "A survey by the Harvard Harris Institute published yesterday yielded similar results - there is a clear majority for a military operation in Rafah among the American public - 72% support an operation in Rafah.", "location": "RAFAH", "classification": "security", "score": 0.6975851679334045, "event_breakdown": "- Survey conducted by the Harvard Harris Institute shows 72% support for a military operation in Rafah among the American public."}, {"id": "4b13a3b9-34dc-408f-b050-f5dd180015c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26510/", "date": "2024-04-30 08:33", "message": "Students at Columbia University are switching to chants in Arabic.\n\n#Columbia_has_fallen", "location": "Columbia University", "classification": "security", "score": 0.4835643031151498, "event_breakdown": "1. Students at Columbia University switch to chanting in Arabic.\n2. Hashtag trending on social media: #Columbia_has_fallen."}, {"id": "79566d8a-ff02-499d-a299-b34c4e7aa681", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26508/", "date": "2024-04-30 08:32", "message": "The statue of George Washington at George Washington University has been Palestinianized and defaced.", "location": "George Washington University", "classification": "security", "score": 0.3831179570317771, "event_breakdown": "- The statue of George Washington at George Washington University has been Palestinianized and defaced."}, {"id": "25b23194-e190-49f8-8c7e-4d826151bbe7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26507/", "date": "2024-04-30 08:31", "message": "Stanford University, California: A student, wearing a headband of the military wing of Hamas, prepares for class...", "location": "Stanford University, California", "classification": "security", "score": 0.7733456335938974, "event_breakdown": "- A student at Stanford University in California wearing a headband of the military wing of Hamas prepares for class."}, {"id": "68899593-3229-491a-a350-dcbc72ea6d2a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26506/", "date": "2024-04-30 08:30", "message": "Protest against Israel on US campuses:\n\n\"Morning Prayer\" at Harvard University.\n\n#sound_on", "location": "Harvard University", "classification": "security", "score": 0.7488853793510446, "event_breakdown": "- Protest against Israel on US campuses\n- \"Morning Prayer\" at Harvard University"}, {"id": "eece0314-63a6-4f13-910b-8aac5b7ec2d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26500/", "date": "2024-04-30 08:17", "message": "Last night, the American Central Command published pictures of the progress of the construction of the floating pier off the coast of Gaza.\n\nAt the same time, there are reports that the British are considering sending soldiers on their behalf to secure the pier.", "location": "Gaza", "classification": "security", "score": 0.8247471719227055, "event_breakdown": "1. Location: Off the coast of Gaza\n\nEvent: American Central Command published pictures showing the progress of the construction of the floating pier.\n\n2. Location: Not specified (potentially involving Gaza)\n\n- American Central Command published pictures of the construction of the floating pier off the coast of Gaza\n- British considering sending soldiers to secure the pier"}, {"id": "d5b054fd-da17-44ce-9359-1504ba54f2b7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26495/", "date": "2024-04-30 05:48", "message": "And how it ended", "location": "ODESA\nThe story ended with the sinking of the ship", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "I'm sorry, could you please clarify which text you're referring to?"}, {"id": "690a25ff-93c3-4a09-837d-0f5f5958b776", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26486/", "date": "2024-04-29 20:34", "message": "Hamas: The movement's delegation arrived in Cairo today to consult and clarify a number of issues in the latest proposal. Inquiries and clarifications were made with the mediators - the Qataris and the Egyptians. The Hamas delegation will leave Cairo (for Doha, the capital of Qatar) for further consultations (within the movement).", "location": "Cairo", "classification": "security", "score": 0.6150094041786179, "event_breakdown": "Location: Cairo, Egypt\n\n- Hamas delegation arrives in Cairo for consultations on latest proposal\n- Delegation makes inquiries and clarifications with Qatari and Egyptian mediators\n- Hamas delegation to leave Cairo for Doha for further consultations within the movement"}, {"id": "d85464da-28a0-4f4c-8ea2-1ea785336688", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26481/", "date": "2024-04-29 18:52", "message": "PA Chairman Abu Mazen met tonight in Saudi Arabia with Saudi Crown Prince Muhammad bin Salman.", "location": "Saudi Arabia", "classification": "security", "score": 0.8201277390222063, "event_breakdown": "- PA Chairman Abu Mazen met with Saudi Crown Prince Muhammad bin Salman in Saudi Arabia"}, {"id": "e456a998-ac11-4a61-a747-c5d3833fafcd", "channel_id": 1560386984, "url": "", "date": "2024-04-29 18:52", "message": "Ismail Haniyeh, chairman of the political bureau of Hamas, continues to receive an audience in Istanbul, this time Algerian members of parliament as well as members of Turkish parties.\nThe official excuse: they come to console him for the death of his sons and grandsons in an IDF attack a few weeks ago.", "location": "Istanbul", "classification": "security", "score": 0.9058050621174512, "event_breakdown": "null"}, {"id": "99ee740c-69dd-4d29-8e0f-4d91e2382ad6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26477/", "date": "2024-04-29 18:47", "message": "The IDF spokesperson announced the death of two reservists in battle in the center of the Gaza Strip.\n\nMay their memories be a blessing.", "location": "Gaza Strip", "classification": "security", "score": 0.944319386655642, "event_breakdown": "Location: Center of the Gaza Strip\n\nEvent: Two Israeli Defense Forces (IDF) reservists are reported dead in battle."}]