[{"id": "1ebc311d-ed9c-42b7-9ae6-7febba39e8bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26712/", "date": "2024-05-05 17:36", "message": "Syrian sources report that Iyad al-Saleh, a senior Hezbollah official responsible for recruiting volunteers to fight in the Hasakah area, in northeastern Syria, was killed as a result of an explosive device planted in his vehicle.\nThe vehicle exploded on Alkachaa street in the city of Hasakah inside a security compound under the control of Assad forces.", "location": "Hasakah", "classification": "security", "score": 0.9947713961658057, "event_breakdown": "- Iyad al-Saleh, a senior Hezbollah official responsible for recruiting volunteers in northeastern Syria, was killed by an explosive device planted in his vehicle.\n- The vehicle exploded on Alkachaa street in the city of Hasakah inside a security compound under the control of Assad forces."}, {"id": "5286f8ed-e9ea-4f9a-aeb5-0291702bd7ee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26711/", "date": "2024-05-05 17:32", "message": "The military wing of Hamas publishes documentation of the launch of \"Rajum\" rockets towards Kerem Shalom earlier today.", "location": "", "classification": "security", "score": 0.7112693064771131, "event_breakdown": "- The military wing of Hamas published documentation of the launch of \"Rajum\" rockets towards Kerem Shalom earlier today."}, {"id": "5c4781a0-a16d-4cf5-8808-72b2a378a5b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26710/", "date": "2024-05-05 17:31", "message": "The Palestinians report 6 deaths in the attack on a Hamas police container at the Aljaauni elementary school in the Nuseirat refugee camp in the center of the Gaza Strip.", "location": "Nuseirat refugee camp", "classification": "security", "score": 0.9765586093354613, "event_breakdown": "- An attack on a Hamas police container at the Aljaauni elementary school in the Nuseirat refugee camp in the center of the Gaza Strip resulted in 6 reported deaths."}, {"id": "30eaea14-71ed-47fc-a49e-282d22db8931", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26709/", "date": "2024-05-05 17:29", "message": "Hamas senior Osama Hamdan:\n\nThe operation (rocket attack this morning -AA) in Kerem Shalom is a message from Hamas's military arm to the occupation that the consequences of any adventure carried out by his army will be different from what he imagines.", "location": "Based on the information provided, the main location where the main event takes place is Kerem Shalom.", "classification": "security", "score": 0.9755908976599748, "event_breakdown": "- Hamas carried out a rocket attack in Kerem Shalom.\n- Hamas senior Osama Hamdan stated that the attack was a message from Hamas's military arm to the occupation that the consequences of any adventure carried out by the Israeli army will be different from what the army imagines."}, {"id": "801e94f9-3129-48e4-9114-bd10666a6478", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26708/", "date": "2024-05-05 17:28", "message": "Reuters: The head of the CIA left Qatar (Cairo) due to the fact that the talks regarding Gaza are facing collapse.\n\n##\nI wonder if he took the same flight as the Hamas delegation from Cairo to Doha...", "location": "Cairo, Egypt.", "classification": "security", "score": 0.8322369078311902, "event_breakdown": "- The head of the CIA left Qatar, departing from Cairo, due to the fact that talks regarding Gaza are facing collapse."}, {"id": "d18f01a2-676b-4db3-9e40-f065070c43e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26707/", "date": "2024-05-05 17:28", "message": "Documentation of the moments of the attack on the home of the Shatiwi family near the Rafah crossing (after an evacuation alert).", "location": "The main location where the main event takes place is near the Rafah crossing.", "classification": "security", "score": 0.9622204096287527, "event_breakdown": "- Attack on the home of the Shatiwi family near the Rafah crossing."}, {"id": "6bdeef88-069b-45a2-b350-4d48198f9241", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26706/", "date": "2024-05-05 17:25", "message": "The Palestinians report 6 deaths from among members of the Almasri and Elatar families in an attack on a house in the Yabna camp in Rafah earlier today (the house belongs to the Elatar family).", "location": "Rafah", "classification": "security", "score": 0.6391017690620457, "event_breakdown": "- Attack on a house in the Yabna camp in Rafah\n- 6 deaths reported: members of the Almasri and Elatar families\n- Location: Yabna camp, Rafah"}, {"id": "789231d3-5b0a-4b63-a039-acce2b2d5ec2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26704/", "date": "2024-05-05 17:18", "message": "Al Jazeera from a senior Hamas source:\nThe movement delegation left Cairo for consultations after two days of talks.", "location": "", "classification": "security", "score": 0.9425929695497295, "event_breakdown": "1. Hamas delegation holds talks in Cairo for two days.\n2. Hamas delegation leaves Cairo for consultations."}, {"id": "f462a4c5-51c7-409a-b4bd-39583e7869be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26703/", "date": "2024-05-05 17:18", "message": "Several attacks in the last few hours in Rafah, usually on agricultural lands or houses that received an evacuation notice in advance. The Palestinians report one death.\nThe home of the Shatiwi family (the attached video) near the Rafah crossing was attacked.", "location": "Rafah", "classification": "security", "score": 0.911214583607436, "event_breakdown": "- Multiple attacks in Rafah in the last few hours, targeting agricultural lands and houses with evacuation notices\n- One death reported by Palestinians in Rafah due to the attacks\n- Attack on the home of the Shatiwi family near the Rafah crossing"}, {"id": "f1aab229-1673-4544-830c-2c40808609fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26702/", "date": "2024-05-05 13:48", "message": "Hezbollah in an official announcement:\n\nWe launched dozens of Katyushas at Israel's artillery batteries in the Zaoura area (in the territory of Israel-AA) in response to the attack in Meiss el-Jabal in which civilians were killed and wounded.\n\n##\nIsraeli media report 65 rockets fired from southern Lebanon towards Israel in the last volley.", "location": "Meiss el-Jabal", "classification": "security", "score": 0.9900671289197039, "event_breakdown": "- Hezbollah announced launching dozens of Katyushas at Israel's artillery batteries in the Zaoura area, in response to an attack in Meiss el-Jabal where civilians were killed and wounded.\n- Israeli media reported that 65 rockets were fired from southern Lebanon towards Israel in the last volley."}, {"id": "43510b92-f0f5-47c0-b057-5538427223f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26700/", "date": "2024-05-05 12:59", "message": "The IDF: The Kerem Shalom crossing has been closed to truck crossing.\n\n##\nHamas bites the hand that feeds them and shoot at the place that brings them goods.\n\nThe Palestinians report air force attacks in the al-Salam neighborhood in East Rafah.", "location": "East Rafah", "classification": "security", "score": 0.9868789289955291, "event_breakdown": "- The IDF closes the Kerem Shalom crossing for truck crossings.\n- Hamas fires at the Kerem Shalom crossing.\n- Palestinians report air force attacks in the al-Salam neighborhood in East Rafah."}, {"id": "68ea65d1-d9cd-480d-a20e-64424e4ac618", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26699/", "date": "2024-05-05 12:57", "message": "Channels identified by Fatah:\n\nThe firing of Hamas from Rafah towards Kerem Shalom gave Israel justification for the action in Rafah, saved them, and gave them a way out in the eyes of the whole world. How stupid is Hamas.", "location": "The main location mentioned in the text is Rafah.", "classification": "security", "score": 0.8645762385475463, "event_breakdown": "1. Firing of Hamas rockets from Rafah towards Kerem Shalom\n2. Israeli action in Rafah in response to the rocket firing\n3. Israel gaining justification for their actions in Rafah\n4. Hamas' actions saving Israel and providing them an exit strategy in the eyes of the world"}, {"id": "592130e2-6104-4e6f-a81a-4155add26503", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26698/", "date": "2024-05-05 12:56", "message": "Israeli media reports on Israeli casualties in Kerem Shalom as a result of falling explosives.\n\nAt 13:41, the military wing of Hamas accepted responsibility for launching short-range rockets of the \"Rajum\" type with a diameter of 114 mm towards assembly areas in Kerem Shalom.\n\n##\nKerem Shalom is very close to Rafah.", "location": "", "classification": "security", "score": 0.9874250957946622, "event_breakdown": "- Israeli casualties in Kerem Shalom due to falling explosives\n- Hamas military wing launching short-range rockets towards assembly areas in Kerem Shalom via Rafah"}, {"id": "5dc981e5-f2db-4e38-9e97-4ba7615ae120", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26696/", "date": "2024-05-05 11:30", "message": "Ismail Haniyeh, Chairman of the Political Bureau of Hamas:\n\nWe conducted negotiations in a positive and flexible spirit. The movement's priority is to stop the aggression. This is essential and logical.\nWhat does the agreement mean if a ceasefire is not its first stage?", "location": "", "classification": "security", "score": 0.2923656283049672, "event_breakdown": "- Ismail Haniyeh, Chairman of the Political Bureau of Hamas, conducted negotiations in a positive and flexible spirit for a ceasefire\n- Hamas expressed that stopping the aggression is the priority and essential for the movement."}, {"id": "f3d2e62c-42d0-4308-a64c-12253a631f82", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26694/", "date": "2024-05-05 11:08", "message": "Lebanese channels: The number of civilians killed in the IDF attack in Meiss Ej Jabal in southern Lebanon has risen to four. The four are reportedly members of the same family (father, mother and their two children).\n\nHezbollah in an official announcement:\nWe attacked Kiryat Shmona with dozens of Katyusha and Flak type rockets, in response to the killing and wounding of the civilians in  Meiss Ej Jabal.\n\nIsrael's Magen David Adom reports that a 65-year-old man was lightly injured from the rocket fire, and that an ambulance was also damaged.", "location": "Kiryat Shmona", "classification": "security", "score": 0.9991968429482292, "event_breakdown": "- IDF attack in Meiss Ej Jabal in southern Lebanon, resulting in the death of four civilians\n- Hezbollah attacks Kiryat Shmona with dozens of Katyusha and Flak rockets in response to the civilian deaths in Meiss Ej Jabal\n- A 65-year-old man injured from the rocket fire in Kiryat Shmona, with an ambulance also damaged"}, {"id": "73055e43-9cd0-4d41-bc15-5a7305afd357", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26692/", "date": "2024-05-05 11:01", "message": "Israel Police publishes CCTV footage of an arrest of a Palestinian woman who pulled a knife on police officers in the Old City of Jerusalem.\n\nNo officers were injured in the incident, and neither was the Palestinian woman.\n\n##\nI wonder how this situation would've ended for the woman in any of the Arab or Western countries...", "location": "The main location where the main event takes place is the Old City of Jerusalem.", "classification": "security", "score": 0.9735874257227601, "event_breakdown": "- Israel Police published CCTV footage of an arrest of a Palestinian woman who pulled a knife on police officers in the Old City of Jerusalem.\n- No officers or the Palestinian woman were injured in the incident."}, {"id": "41fb12de-7894-4734-907b-aaa151f33d92", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26691/", "date": "2024-05-05 08:32", "message": "Lebanese sources update that three people were killed in the latest attack on Meiss Ej Jabal 👆, and report that another person was injured.", "location": "Meiss Ej Jabal.", "classification": "security", "score": 0.9654846051668978, "event_breakdown": "1. Attack on Meiss Ej Jabal: Three people were killed in the latest attack on Meiss Ej Jabal, according to Lebanese sources.\n2. Casualties: The attack resulted in the deaths of three individuals.\n3. Injured person: One person was reported to be injured during the incident."}, {"id": "cedcc74a-8b04-4097-b5db-2afae1a8f0f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26690/", "date": "2024-05-05 08:12", "message": "The IDF and Israeli Shit Bet announce that senior Islamic Jihad commander Aiman Zaarab was killed in a targeted strike,\n\nAccording to the announcement, Zaarab took part in the Oct. 7th attacks, and lead terrorist from the PIJ's elite Nukhba Force in their attack on the Kibbutz of Sufa and a neighboring military outpost.", "location": "Kibbutz Sufa", "classification": "security", "score": 0.9804161595100885, "event_breakdown": "- Senior Islamic Jihad commander Aiman Zaarab killed in a targeted strike by the IDF and Israeli Shin Bet\n- Aiman Zaarab participated in the October 7th attacks and led terrorists from the PIJ's elite Nukhba Force in an attack on Kibbutz Sufa and a neighboring military outpost"}, {"id": "e7b574dd-f67e-4db7-a4b9-efe639909c3d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26689/", "date": "2024-05-05 08:09", "message": "The Lebanese report a number of wounded in an Israeli attack in Meiss Ej Jabal in southern Lebanon, which took place about an hour ago.", "location": "Meiss Ej Jabal", "classification": "security", "score": 0.9757043804391585, "event_breakdown": "- Lebanese report a number of wounded in an Israeli attack\n- Location: Meiss Ej Jabal in southern Lebanon\n- Timing: Approximately an hour ago"}, {"id": "428c69de-eb5b-40f5-856b-d7f42ccb6f10", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26688/", "date": "2024-05-05 08:07", "message": "The Palestinians report: an Apache helicopter attacked targets in Rafah in the southern Gaza Strip this morning.", "location": "Rafah, in the southern Gaza Strip.", "classification": "security", "score": 0.9904248373796724, "event_breakdown": ""}, {"id": "88f60111-a106-43f7-9124-663c0f4b96ac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26687/", "date": "2024-05-05 08:06", "message": "Hezbollah's answer to the French proposal\n\nSources report that tomorrow morning Nabih Berri, the Speaker of the Lebanese Parliament (and the head of the Shiite Amal movement, fighting against Israel alongside Hezbollah) is expected to deliver Hezbollah's and the Amal movement's response to the French proposal for a cease-fire with Israel.\n\nAccording to Arab sources, the answer is likely to be that Lebanon is bound by UN Resolution 1701 and that the document will be the basis for negotiations after there is a ceasefire in Gaza.\n\n###\n\nResolution 1701, which ended the Second Lebanon War, spoke of 15,000 armed UNIFIL soldiers with powers south of Litani river, tasked with preventing the introduction of weapons and the presence of Hezbollah militants in the area - which were both violated. If Resolution 1701 had been enforced, we would not have reached the situation we are in today, with a massive deployment of Hezbollah in the south to the Litani.\n\nThe current situation shows how invaluable such agreements are - they shouldn't be taken seriously as they do not hold water.\n\nI suggest that France and the US, who are so keen on ending the fighting in Lebanon with a diplomatic solution, put themselves as guarantors to any new ceasefire agreement - so that any violation of the agreement will be met with with a French or American aerial strike. \n\nI wonder if they'd be willing to agree to this.", "location": "", "classification": "security", "score": 0.9300229810162296, "event_breakdown": "- Nabih Berri, the Speaker of the Lebanese Parliament and head of the Shiite Amal movement, is expected to deliver Hezbollah's and the Amal movement's response to the French proposal for a cease-fire with Israel tomorrow morning.\n- The response is likely to affirm that Lebanon is bound by UN Resolution 1701 and that the document will serve as the basis for negotiations after a ceasefire in Gaza."}, {"id": "74e50030-d0e1-49dc-9132-e437327183c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "The Shiite militias in Iraq claim to have attacked the Israeli port of Haifa yesterday evening with a cruise missile.", "location": "Haifa", "classification": "security", "score": 0.9938263803343869, "event_breakdown": "- Shiite militias in Iraq claimed to have attacked the Israeli port of Haifa with a cruise missile yesterday evening."}, {"id": "8a627408-4a94-444d-b72e-7aad8288b918", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "University of Virginia, US:\n\nPolice officers armed with transparent plastic shields slowly advance in a single line towards anti-Israeli protesters armed with umbrellas, chanting \"shame, shame\".\n\n##\nLike a medieval battle...", "location": "", "classification": "security", "score": 0.9091059072642654, "event_breakdown": "- Police officers advance towards anti-Israeli protesters at University of Virginia, US"}, {"id": "5b4348a4-d3f9-4d4c-b330-cbfc56aba734", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26683/", "date": "2024-05-05 02:31", "message": "The follower Ben Tzion Macales points out that in the past week you can see in satellite images a new road that was broken (by IDF forces) in the area of ​​the Kerem Shalom crossing (near Rafah).\n\nGetting ready for Rafah...", "location": "Kerem Shalom crossing", "classification": "security", "score": 0.8487874688356394, "event_breakdown": "- Satellite images show a new road created by IDF forces in the area of the Kerem Shalom crossing near Rafah in the past week."}, {"id": "b0430ef9-7438-4fde-a1c5-6ebfaa07086d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26681/", "date": "2024-05-05 00:04", "message": "USA: The police of Wisconsin do not make exceptions for academic staff: Samir Elatot, professor of sociology at the University of Wisconsin was arrested after taking an (over) active part in anti-Israel demonstrations.", "location": "The main location where the main event takes place is Wisconsin, USA.", "classification": "security", "score": 0.3495209627959089, "event_breakdown": ""}, {"id": "d9f8df76-de1d-4f36-b538-38ca29ff64d1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26679/", "date": "2024-05-04 22:00", "message": "Al Jazeera from a Hamas official:\n\"The movement will in no way sign an agreement that does not sincerely include the cessation of the war in Gaza.\"", "location": "", "classification": "security", "score": 0.934171742227279, "event_breakdown": "- Al Jazeera reports from a Hamas official that the movement will not sign an agreement that does not sincerely include the cessation of the war in Gaza."}, {"id": "8e335237-4146-454c-9d3b-a493d1192253", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26678/", "date": "2024-05-04 17:47", "message": "Palestinian channels report: The IDF attacked the home of the prominent journalist in the Gaza Strip, Hassan Aslih (Hamas-affiliated) in the Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip.\nThere were no casualties in the attack.", "location": "Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip.", "classification": "security", "score": 0.9953827602700771, "event_breakdown": ""}, {"id": "58a5a0a9-edb1-4a64-a8dc-23c186ec7d2b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26677/", "date": "2024-05-04 17:31", "message": "Palestinian channels: The Palestinian Authority's security mechanisms detonated, in a controlled manner, explosive devices they located in Tubas (Northeastern Samaria).", "location": "Tubas (Northeastern Samaria)", "classification": "security", "score": 0.9948419961865298, "event_breakdown": "- Palestinian Authority's security mechanisms detonated explosive devices in Tubas, Northeastern Samaria."}, {"id": "70ecef77-b481-4359-a6c8-13ceea78e9c4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26676/", "date": "2024-05-04 17:20", "message": "Hamas-identified channels: All four killed (whose names have been published) 👆 in the IDF's activity in the village of Deir al-Ghusun in the north of Tulkarm, were operatives of the military wing of Hamas.\nAlaa Sharitah was the commander of the military wing of Hamas in Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9934812200416727, "event_breakdown": "- Hamas-identified channels report that all four people killed during the IDF's operation in the village of Deir al-Ghusun in northern Tulkarm were operatives of Hamas's military wing.\n- Alaa Sharitah, one of the four killed, was identified as the commander of the military wing of Hamas in Tulkarm."}, {"id": "fcbc2161-8cb7-48ed-825e-494b8189f13a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26675/", "date": "2024-05-04 17:19", "message": "Further to this👆\nA joint statement to the IDF spokesperson, the police spokesperson and the Shin Bet spokesperson:\n\nThe soldiers of Yamam, the IDF and the Shin Bet eliminated five terrorists who had barricaded themselves in a building in Tulkarm in a 12-hour battle\n\nThe soldiers of the Yamam, IDF and Shin Bet, under the precise intelligence guidance of the Shin Bet and IDF Intelligence, operated for over 12 hours in Tulkarm in a targeted activity to defeat a terrorist cell.\n\nThe soldiers closed in on a building where the terrorist squad was entrenched, which opened fire on them. The fighters responded by shooting with shoulder-fired missiles and other means from the building, and at the end of the exchange of fire, the five terrorists were eliminated.\nMilitary equipment and weapon parts were confiscated.\n\nDuring the activity, an IDF fighter was injured and brought to continue receiving medical treatment in a hospital; his family was informed.", "location": "The main location where the main event takes place is Tulkarm.", "classification": "security", "score": 0.9849329956770798, "event_breakdown": "- Joint anti-terror operation in Tulkarm involving Yamam, IDF, and Shin Bet\n- 12-hour battle resulting in the elimination of five terrorists\n- Seizure of military equipment and weapon parts\n- Injury of an IDF fighter who was then hospitalized"}, {"id": "be65162c-9a9f-481e-baa7-8e096931550b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26674/", "date": "2024-05-04 16:10", "message": "The Palestinians publish the names of four of the \"martyrs\" who were killed in the IDF operation tonight in the village of Deir el Ghusun in the north of Tulkarm:\n\n1. Alaa Sharith (the leftmost one).\n2. Tamer Fuqaha (next to Alaa' - both are behind the attack in which Elhanan Klein fell in November 2023. Tamer is also an operative of Erin al Aswad).\n3. Adnan Samara\n4. Asal Badran\n\nIn addition, there is the \"headless martyr\" who has not yet been identified - DNA tests will be conducted on him to confirm his identity.", "location": "Deir el Ghusun", "classification": "security", "score": 0.9791185685870558, "event_breakdown": "- The Palestinians published the names of four \"martyrs\" killed in the IDF operation in the village of Deir el Ghusun in the north of Tulkarm:\n  - Alaa Sharith\n  - Tamer Fuqaha\n  - Adnan Samara\n  - Asal Badran\n\n- A \"headless martyr\" who has not yet been identified; DNA tests will be conducted to confirm his identity."}, {"id": "a6a86569-f27b-4501-9d45-9c4d97a80346", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26673/", "date": "2024-05-04 15:36", "message": "The Palestinians report that the IDF forces have finished their activities in Deir al-Ghusun in the north of Tulkarm and have left.\nSources in Tulkarm say that the Palestinian rescue forces located another Palestinian \"martyr\" among the ruins, apparently headless.", "location": "", "classification": "security", "score": 0.9671169206516085, "event_breakdown": "- IDF forces have finished their activities in Deir al-Ghusun in the north of Tulkarm and have left.\n- Palestinian rescue forces in Tulkarm report locating another Palestinian \"martyr\" among the ruins, who was apparently headless."}, {"id": "7319f0c4-bd6e-44c1-a2ef-7946ae6e51c4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26672/", "date": "2024-05-04 14:06", "message": "The Palestinians report that the person who came out from under the ruins of the house in Deir al-Ghusun and was arrested by IDF forces is the released prisoner Salma Badran, an operative of the military wing of Hamas with a \"heavy\" family lineage: he is the brother of the two \"martyrs\" of the wing - Fawaz and Seif Allah Badran. Salma is the owner of the apartment where the Hamas terrorists hid last night and which the IDF destroyed.\n\nFawaz (Salma's brother) was one of the senior bomb engineers of the Izz ad-Din al-Qassam Brigades in the West Bank and was the one who assembled the explosive device that exploded in the first suicide attack of the second intifada (March 2001), in which 3 Israeli citizens were killed in Netanya. Fawaz was also the one who recruited the suicide bomber for the attack and also guided other suicide bombers in Tulkarm. He was eliminated by the Israeli security forces that year using an explosive device planted in his car.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9989665591672134, "event_breakdown": ""}, {"id": "007bc174-11b7-4111-a38d-e50f970651ea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26671/", "date": "2024-05-04 14:00", "message": "The official Palestinian news agency Wafa: 6 Palestinians were killed in the IDF operation in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9664112263099419, "event_breakdown": "- 6 Palestinians killed in IDF operation in Deir al-Ghusun village, Tulkarm."}, {"id": "6b5e5d8d-e92c-4176-83c9-e423f4f800d6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26668/", "date": "2024-05-04 13:56", "message": "More footage from Deir al-Ghusun north of Tulkarm from the IDF operation today.", "location": "", "classification": "security", "score": 0.5645468611123309, "event_breakdown": ""}, {"id": "be3874e6-95d7-4487-a83a-c3aa286ce078", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Palestinian sources in Tulkarm claim that Tamer Fuqaha, an operative of the military wing of Hamas, (and the terrorist who carried out the attack in which Elhanan Klein fell on November 2, 2023), was killed in an IDF operation tonight in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9920826670749956, "event_breakdown": "- Palestinian sources in Tulkarm claim that Tamer Fuqaha, an operative of the military wing of Hamas and the perpetrator of the attack in which Elhanan Klein was killed on November 2, 2023, was killed in an IDF operation tonight in the village of Deir al-Ghusun in the north of Tulkarm."}, {"id": "60348703-5c54-458e-93f8-5e3f768115e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26661/", "date": "2024-05-04 13:10", "message": "The \"Holy Fire\" ceremony held today in the Church of the Holy Sepulcher in East Jerusalem as part of the \"Sabbath of Light\" that Christians celebrate today.", "location": "The main location where the main event takes place is the Church of the Holy Sepulcher in East Jerusalem.", "classification": "security", "score": 0.7164941467590658, "event_breakdown": ""}, {"id": "0f4ac81f-a5e7-489f-bc0e-1ac5277785f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26658/", "date": "2024-05-04 13:07", "message": "For nearly ten hours starting last night, IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm.\nAccording to the estimates, the terrorists Tamer Fakha and Alaa Sharitah, the operatives of the military wing of Hamas involved in the shooting attack in which Major General Elhanan Klein was killed near Beit Lid on November 2, 2023, were hiding in the house.\nSources associated with Hamas and Islamic Jihad operatives claim that the two managed to escape from the house which was surrounded by the IDF for many hours and fired upon by a large number of missles (and finally destroyed with a bulldozer - in the attached videos you can see the shooting and the demolition the house).", "location": "", "classification": "security", "score": 0.9796365504234397, "event_breakdown": "- IDF forces conducted an operation for nearly ten hours starting last night around a house in the village of Deir al-Ghusun, north of Tulkarm.\n- The operation targeted a house where terrorists Tamer Fakha and Alaa Sharitah, operatives of the military wing of Hamas involved in the shooting attack that killed Major General Elhanan Klein near Beit Lid on November 2, 2023, were believed to be hiding.\n- The house was surrounded by IDF for many hours and was fired upon by a large number of missiles. \n- The house was eventually destroyed with a bulldozer. \n- Sources associated with Hamas and Islamic Jihad claim that the two suspected terrorists managed to escape from the house."}, {"id": "f231075b-2f6f-40b8-a6b4-1dfa2be08648", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26657/", "date": "2024-05-04 13:02", "message": "The Al Jazeera network claims: an Israeli drone launched a missile a few hours ago at a vehicle in Bint Jabil in southern Lebanon.\n\nUnofficial Lebanese sources: No casualties.", "location": "Bint Jbeil", "classification": "security", "score": 0.9652451684275815, "event_breakdown": ""}, {"id": "6feb3035-b627-42d3-9e05-a24d3d07c770", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26656/", "date": "2024-05-04 12:30", "message": "The Qatari Al Jazeera cites a report by Reuters according to which Qatar is considering closing the offices of the political office of Hamas in its territory as part of an overall plan to continue its function as a mediator in the conflict between Hamas and Israel.", "location": "Qatar", "classification": "security", "score": 0.9065846889429762, "event_breakdown": ""}, {"id": "a22dffa1-cad6-41bf-acd4-cb14381ff8c6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26655/", "date": "2024-05-04 12:29", "message": "At least 3 different Israeli military reporters publish the exact same message:\n\nPolitical actor:\n\nContrary to the publications, Israel will under no circumstances agree to the end of the war as part of an agreement to release our abductees.\n\nAs the political echelon decided, the IDF will enter Rafah and destroy the remaining Hamas battalions there - whether or not there will be a temporary respite for the release of our hostages.", "location": "", "classification": "security", "score": 0.6696081489195264, "event_breakdown": ""}, {"id": "73aacf3c-2777-4013-b091-26cc829ceee0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26654/", "date": "2024-05-04 12:28", "message": "Heavy political pressure on Israel from all directions to silence all sectors, (mainly) at the expense of the Israeli interest. It will only get worse.", "location": "Israel", "classification": "security", "score": 0.7257546953647328, "event_breakdown": ""}, {"id": "4cfbf69b-68cf-42db-8eda-4addea746a84", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26653/", "date": "2024-05-04 12:27", "message": "Today, Lebanese sources report: Hezbollah will soon submit its comments to the French proposal to end the war in southern Lebanon\n\nJournalist sources in Lebanon state that Hezbollah and the Amal movement discussed the French proposal and decided not to reject it (so as not to be perceived as refusers - AA) but to submit 10 comments to amend the proposal.\nThe comments will be forwarded to the Speaker of the Lebanese Parliament (who happens to also be the head of the Amal Shiite movement fighting alongside Hezbollah in southern Lebanon - AA) and he will discuss them with Prime Minister Mikati and forward them to the French side.", "location": "Beirut, Lebanon", "classification": "security", "score": 0.9143945024805114, "event_breakdown": "- Hezbollah to submit comments on French proposal to end war in southern Lebanon\n- Hezbollah and Amal movement decide not to reject the French proposal, will submit 10 comments for amendments\n- Comments to be forwarded to Speaker of Lebanese Parliament, who will discuss with Prime Minister Mikati before sending to the French side"}, {"id": "85848436-5f91-4e38-890a-0b96b3b681fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26652/", "date": "2024-05-04 12:26", "message": "Yesterday, Lebanese Al-Akhbar newspaper publishes the French proposal for a ceasefire between Israel and Hezbollah\n\nThe Lebanese Al-Akhbar newspaper, which is affiliated with Hezbollah, once again manages the agenda regarding the ceasefire agreements with Israel and reveals the details of the French proposal to end the war between Israel and Hezbollah in southern Lebanon.\n\nThe proposal includes three stages:\n\nFirst step (according to areas of responsibility)\n\nHezbollah the militias in South Lebanon stop the fire and allow UNIFIL to move freely in South Lebanon without restriction.\n\nIsrael will stop its attacks on Lebanese territory and stop jamming the radar in Lebanon.\n\nUNIFIL will increase patrols in southern Lebanon.\n\nSecond stage (within 3 days from the start of the first stage)\n\nHezbollah militias will dismantle all their facilities near the blue line, including observation towers and tents.\nAll military operatives, including the Radwan force, as well as equipment that enables the remote launch of anti-tank missiles, will be moved north beyond the ten-kilometer line from the border with Israel.\n\nIsrael will stop air flights over Lebanon.\n\nLebanon will begin deploying 15,000 soldiers on its behalf in southern Lebanon, south of the Litani River with the support of UNIFIL and international agencies.\n\nUNIFIL will resume its participation in the meetings of the tripartite mechanism (with Israel and Lebanon) and logistically assist the deployment of the Lebanese army south of Litani.\n\nThird stage (within ten days)\n\nThe renewal of the negotiations between Israel and Lebanon for the registration of the land border based on the negotiations that took place in 2017.\nBeginning of negotiations on the establishment of a zone free of armed military militias south of Litani (with the exception of the Lebanese army and UNIFIL forces).\n\nSupport for social and economic development in southern Lebanon.", "location": "The main location where the main event takes place is southern Lebanon.", "classification": "security", "score": 0.9627738124436742, "event_breakdown": "- Lebanese Al-Akhbar newspaper publishes French proposal for ceasefire between Israel and Hezbollah \n- First stage of ceasefire proposal: Hezbollah militias in South Lebanon to stop fire, UNIFIL to increase patrols, Israel to stop attacks and radar jamming\n- Second stage of ceasefire proposal: Hezbollah to dismantle facilities near blue line and move military operatives north, Israel to stop air flights over Lebanon, Lebanon to deploy soldiers with UNIFIL support\n- Third stage of ceasefire proposal: Renewal of negotiations between Israel and Lebanon for border registration, negotiations on establishing zone free of armed militias, support for social and economic development in southern Lebanon"}, {"id": "a42f52c2-bad8-406e-9ce4-2c6e56d3cb7e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26649/", "date": "2024-05-03 20:30", "message": "Documentation of one of today's attacks in the area of ​​the displaced persons' tents in Rafah in the south of the Gaza Strip - note the rocket rising into the sky. This indicates a precise hit by the aircraft on the target.", "location": "", "classification": "security", "score": 0.9952821119807056, "event_breakdown": "- An attack in the area of the displaced persons' tents in Rafah in the south of the Gaza Strip was documented. A rocket was seen rising into the sky, indicating a precise hit by an aircraft on the target."}, {"id": "a0077635-82a6-44ce-8f50-0b88498caf25", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26648/", "date": "2024-05-03 20:27", "message": "Hamas in an official announcement:\n\nIn light of the recent contacts with the mediators, tomorrow a delegation of the movement will arrive in Cairo to complete the talks.\n\nWe emphasize that the leadership of the movement reacted in a positive spirit to the proposal it received while discussing it. We are going to Cairo in the same positive atmosphere to reach an agreement.\n\nWe are determined to reach an agreement that will realize the demands of our people for a total cessation of aggression, the withdrawal of forces, the return of the displaced, aid to our people, the beginning of the reconstruction of the Gaza Strip and a serious exchange deal.", "location": "", "classification": "security", "score": 0.3907896760166591, "event_breakdown": "- Hamas delegation to arrive in Cairo for talks"}, {"id": "67f7273a-e4ff-4e34-a005-7cb2d2f2553a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26715/", "date": "2024-05-05 17:36", "message": "IDF: Over the last few hours, approximately 40 launches were identified crossing from Lebanon into Israeli territory, a number of which were intercepted. No injuries were reported. In response, the IDF struck the sources of the fire. \n\nA short while ago, IAF fighter jets struck Hezbollah military structures and terrorist infrastructure in the areas of Markaba, Kfarkela, and Odaisseh in southern Lebanon. In addition, this morning (Sunday), IAF fighter jets struck a military site in the area of Meiss El Jabal in southern Lebanon.\n\nFurthermore, IDF artillery struck in order to remove a threat in the area of Chebaa in southern Lebanon.", "location": "Markaba, Kfarkela, and Odaisseh", "classification": "security", "score": 0.9755126961797929, "event_breakdown": ""}, {"id": "fc8773c2-1ed4-4893-a595-96571286f006", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Deir al-Ghusun north of Tulkarm:\nThe IDF forces packed the body of the Palestinian who was killed in the area of ​​the building.\n\nPalestinian sources claim the IDF forces took 3 bodies.\n\nIDF forces then arrested a Palestinian who emerged from under the ruins of the house that the forces had besieged for many hours.", "location": "", "classification": "security", "score": 0.9879003899097348, "event_breakdown": "null"}, {"id": "adffaacd-90f2-4527-b082-7824d081d4f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26650/", "date": "2024-05-03 20:33", "message": "The Saudi Asharq channel from its sources:\nHamas obtained American confirmation through the Egyptian and Qatari mediators that the term \"sustainable peace\" that appears in the agreement is in fact a permanent ceasefire.\n\n##\nI remind you, this will make or break the agreement.\nIf Hamas receives guarantees not to resume fighting, it will sign the agreement.\nThere are no disputes between the parties regarding the other sections.", "location": "", "classification": "security", "score": 0.8031684638552474, "event_breakdown": "- Hamas obtains confirmation from the US through Egyptian and Qatari mediators regarding the term \"sustainable peace\" in the agreement"}, {"id": "2ac88cb3-453b-487d-9cd8-064bf2e07e5e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26716/", "date": "2024-05-05 19:11", "message": "Following this report here 👆\n\nIDF Spokesperson: The IDF and ISA struck a Hamas command and control center located  in an UNRWA complex in central Gaza which served as a staging ground for multiple attacks against IDF troops and humanitarian efforts\n\nFollowing precise IDF and ISA intelligence, IAF fighter jets struck a Hamas command and control center in the central Gaza Strip which served as central terrorist infrastructure. The strike was carefully planned and carried out using precise munition in order to minimize harm to uninvolved civilians. \n\nThe command and control center was used as a staging ground for multiple attacks on IDF troops located in Gaza's central corridor in recent weeks. Furthermore, the forward operations base was used to carry out attacks on humanitarian efforts, which aims to increase the distribution of humanitarian aid to Gazan civilians.\n\nIn addition, Hamas oversaw the supply of weapons to dozens of Hamas terrorists from inside the command and control center, including those located and operating inside underground terror tunnels. \n\nHamas intentionally positioned the command and control position within the vicinity of an active UNRWA location, jeopardizing the Gazan civilians taking refuge there.\n\nThe Hamas terrorist organization systematically exploits the civilian population and institutions as human shields for their terrorist activities against the State of Israel.\n\nAs a result of the strike, the Hamas’ command and control center located in the UNRWA complex is no longer operational.", "location": "The main location where the main event takes place is central Gaza.", "classification": "security", "score": 0.9315464166616569, "event_breakdown": "- IDF and ISA struck a Hamas command and control center located in an UNRWA complex in central Gaza.\n- IAF fighter jets struck a Hamas command and control center in the central Gaza Strip.\n- The command and control center in central Gaza Strip was used as a staging ground for multiple attacks on IDF troops and humanitarian efforts.\n- IDF reported that Hamas used this location to oversee the supply of weapons to Hamas terrorists, including those located and operating inside underground terror tunnels."}, {"id": "d558d302-4fe1-4161-8f0e-884e06ebde32", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26697/", "date": "2024-05-05 12:19", "message": "Hamas in an official announcement:\n\n\"We strongly condemn the decision of the criminal Netanyahu and his Nazi government to close the offices of the Al-Jazeera network.\"", "location": "Based on the given information, the main location where the event takes place is not explicitly mentioned. Therefore, the answer would be \"null\".", "classification": "security", "score": 0.7607563168384598, "event_breakdown": "1. Hamas issues an official announcement condemning the decision of Israeli Prime Minister Netanyahu and his government to close the offices of Al-Jazeera network."}, {"id": "280af4c5-2d56-4aa6-bcce-4c61e105c1f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26693/", "date": "2024-05-05 11:04", "message": "Al-Jazeera reports that its offices in Israel have just been closed:\n\nFinally, the Israeli government decided to shut down the Al-Jazeera's offices in Israel - a propaganda channel, owned by the rulers of Qatar, masquerading as a legitimate news network.\n\nGood riddance...", "location": "", "classification": "security", "score": 0.8886573442292728, "event_breakdown": "- Israeli government shuts down Al-Jazeera's offices in Israel"}]