[{"id": "5816c47f-1eb1-4251-b07c-ada437414514", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29980/", "date": "2024-07-05 17:15", "message": "The negotiations for the kidnapped - will there be a deal? What needs to happen for a deal to go through?\n\nOver the past day, the Israeli media has been increasingly concerned with the issue of negotiations for a hostage release deal with Hamas. There are many spins, conflicting reports, there is progress, there is no progress... Hamas has folded, Israel has folded... so let's make some sense of things.\n\nFirst we'll go back to remember why a deal didn't close the last time. The main bone of contention between the parties was:\n\nWill Israel return to fighting in Gaza after the implementation of the first phase of the deal, which includes the return of all the abductees alive from the category: women, children, adults and female soldiers.\n\nHamas wanted a commitment and guarantees that the fighting would not resume after this stage. Israel refused and despite the intense American attempt to \"sabotage\" both sides this did not succeed. Whether the fighting will stop or not is a fundamental matter and it is also a matter of yes and no, black and white - there is no gray here.\n\nIt is very important to remember that the reason for Hamas's insistence on a complete and permanent cessation of hostilities as part of any deal is its desire to survive in the Strip and continue to control it. The kidnapped are her bargaining chips, the means she has to keep them in her hands to achieve this goal. This is the ultimate goal of Hamas. The release of a female prisoner from prison in Israel is only a secondary goal.\nThis is also the reason for Israel's insistence on the condition of continuing to fight Hamas after the deal. Israel is not ready for Hamas to continue to rule and survive and as of now Hamas has not been defeated and in practice it still controls the Strip through tens of thousands of its armed men.\n\n##\nNow there are new claims that Hamas is ready to be flexible. As I posted here in the last day, senior Hamas officials for their part declare that the change is only in the atmosphere and the fundamental issues and demands of the movement have not changed.\n\nFor a transaction to go through, one of the following must happen:\n1. Israel will give up its demand for the resumption of hostilities after the first phase of the deal.\n2. Hamas will give up its demand for a permanent ceasefire in the first phase of the deal.\n\nWhen you are told that there is progress and there is flexibility and there is a breakthrough, ask which of the parties gave up the demand that thwarted the deal last time.", "location": "GAZA", "classification": "antisemitism", "score": 0.45732754533447434, "event_breakdown": "Hamas leader Yahya Sinwar declared that his movement is ready to reach an agreement with Israel that does not include responsibility for paying compensation to the Israeli families who lost loved-ones in Hamas attacks."}]