[{"id": "e71c1e35-0c03-4891-85cc-34e296e8e8ac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30907/", "date": "2024-07-23 07:59", "message": "A few minutes before the assassination, Muhammad Awad, the commander of Fatah's al-Aqsa Martyrs Brigades in Tulkarm, walks around like a peacock, against the background of the destruction caused by the IDF bulldozers, and boasts on the communication network that \"the men of the Tulkarm refugee camp will not retreat and the occupier should know this.\"\n\nAfter a short time, he was met with a UAV missile.", "location": "Tulkarm refugee camp", "classification": "security", "score": 0.914588026201279, "event_breakdown": "A few minutes before the assassination, Muhammad Awad, the commander of Fatah's al-Aqsa Martyrs Brigades in Tulkarm, walks around like a peacock, against the background of the destruction caused by the IDF bulldozers, and boasts on the communication network that \"the men of the Tulkarm refugee camp will not retreat and the occupier should know this.\n\nA short time later, he was met with a UAV missile.\nTulkarm refugee camp"}, {"id": "a47ad6f1-5352-4192-9c37-cfde6655d1f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30902/", "date": "2024-07-23 07:41", "message": "Hamas-identified media claim that the total number of dead yesterday in the IDF attacks in Khan Yunis reached 8, in addition to 250 wounded.\n\nIn the northern sector of the Gaza Strip, the Palestinians report 16 deaths tonight in 3 attacks on buildings:\n\n8 killed in the attack on the house of the Daya family in the Zabra neighborhood.\n\n4 killed in the attack on the Jamatsi family home on a-Nefek Street in the center of Gaza City.\n\n4 killed in the attack on the Jalhum family home in the Jabaliya refugee camp.", "location": "GAZA CITY", "classification": "security", "score": 0.9939226911566662, "event_breakdown": "Hamas-identified media report 16 deaths in IDF attacks on buildings in northern Gaza\n**Event: 16 Palestinians killed in IDF attacks on buildings in northern Gaza**\n\nDate: [various]\n\nLocation: northern Gaza Strip (particularly Zabra neighborhood, Gaza City, and Jabaliya refugee camp)\n\nDescription: Hamas-identified media reported 16 deaths in IDF attacks on buildings in northern Gaza. The attacks targeted the Daya, Jamatsi, and Jalhum families, killing 8, 4, and 4 members, respectively. The attacks are ongoing at the time of reporting."}, {"id": "c1cfab27-8578-4602-b487-33331a34f8a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30933/", "date": "2024-07-23 14:32", "message": "South Lebanon: the assassination of Sadek Atawi 👆 in Chaqra, according to the IDF spokesperson.", "location": "BEIRUT", "classification": "security", "score": 0.9404198216247436, "event_breakdown": "South Lebanon: the assassination of Sadek Atawi in Chaqra, according to the IDF spokesperson."}, {"id": "73adf61e-8fdd-4ef8-b717-2b8ec441ef08", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30932/", "date": "2024-07-23 14:31", "message": "Lebanese sources: Sadek Atawi who was seriously injured in the Israeli attack 👆on the van in Chaqra earlier today died of his wounds.\n\nHe was a military operative of Hezbollah.\n\nHezbollah has not yet officially announced his death, but announced that it attacked the \"Neria base, where Golani forces are now located\" using suicide drones, in response to this elimination.", "location": "Lebanon", "classification": "security", "score": 0.8681212217576325, "event_breakdown": "Sadek Atawi, a military operative of Hezbollah, died on Wednesday after he was seriously injured in an Israeli attack earlier in the day on a van in Chaqra. Hezbollah has not yet officially announced his death, but announced that it attacked the \"Neria base, where Golani forces are now located\" using suicide drones, in response to Atawi's elimination."}, {"id": "4375e0ed-b50b-43ac-b149-0b56966d7663", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30928/", "date": "2024-07-23 12:57", "message": "Further to the discussions on social networks about the organizational affiliation of the terrorists who were killed today in Tulkarm:\n\nAccording to a proclamation of Fatah's Al-Aqsa Martyrs' Brigades, Muhammad Awad (Abu Abdu) and Muhammad Badie were both operatives of the Al-Aqsa Martyrs' Brigades (photo number 1 - circled in yellow). \nIn photos number 2 and 3 you can see the headband of the Fatah's Al-Aqsa Martyrs Brigades on the head of Muhammad Awad.\n\nIn photo number 4 you can see an example of the cooperation between Ashraf (\"Azkihim\") Nafe from the military wing of Hamas in Tulkarm and Muhammad Awad - the logo of al-Aqsa Martyrs' Brigades is attached to the green flag of Hamas.\n\nIn conclusion - there is no doubt that Mohammad Awad and Mohammad Badie belonged to Fatah's al-Aqsa Martyrs Brigades and they have a collaboration that was not born yesterday with Ashraf Nafe from the military wing of Hamas.", "location": ")\nTulkarm", "classification": "security", "score": 0.9719056880023196, "event_breakdown": "Fatah's Al-Aqsa Martyrs' Brigades, Muhammad Awad (Abu Abdu) and Muhammad Badie were both operatives of the Al-Aqsa Martyrs' Brigades."}, {"id": "cb85c41b-21da-47c2-8143-889bf81ee6ca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30927/", "date": "2024-07-23 12:53", "message": "The Houthis: This is the UAV known as \"Yafa\" (Jaffa) which we launched towards Tel Aviv on July 19", "location": "JERUSALEM", "classification": "security", "score": 0.7031492223325363, "event_breakdown": "The Houthis: On July 19, the Houthis, a Shiite rebel group, announced that they had launched a Qasef-2K drone, which they have designated the \"Yafa (Jaffa) UAV,\" towards Tel Aviv. However, it was later reported that the drone was intercepted by the Saudi-led coalition before it could strike its target. This marks the second time this year that the Houthis have targeted Tel Aviv with their drones."}, {"id": "cf520bb8-28be-4c03-aefe-bf17f5175f83", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30925/", "date": "2024-07-23 11:40", "message": "The Tulkarm refugee camp after IDF bulldozers passed through it last night.", "location": ")\nTULKARM REFUGEE CAMP", "classification": "security", "score": 0.570506215177466, "event_breakdown": "IDF bulldozers passed through the Tulkarm refugee camp last night."}, {"id": "36ae94f6-98f2-4c86-93ae-19603e67c59f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30922/", "date": "2024-07-23 11:38", "message": "Joint IDF and ISA announcement:\n\nOvernight, the IDF, ISA, and Israeli Border Police conducted a joint counterterrorism operation in the Tulkarm area, as part of a series of over 50 counterterrorism operations in the area since the beginning of the war. The soldiers struck a number of armed terrorists in exchanges of fire and dismantled numerous explosives that had been planted underneath the roads.\n\nDuring the operation, an IAF drone struck several terrorists from various terror organizations in the Tulkarm area. Among those struck were terrorists who were involved in the planning and carrying out of attacks against IDF soldiers and the State of Israel from the Tulkarm area. \n\nAmong those eliminated was Ashraf Nafa, the Head of the Hamas branch in the Tulkarm area. Ashraf was responsible for manufacturing and embedding explosives intended to attack IDF soldiers, as well as recruiting new operatives into the Hamas organization.\nAdditionally, he was involved in numerous attacks against IDF soldiers in Judea and Samaria, and was in contact with external Hamas terrorists who advanced terror attacks in Judea and Samaria. \n\nFurthermore, the terrorist Muhammad Awad was eliminated during the operation. Muhammad was a terrorist in the area of Tulkarm, where he was actively involved in shooting attacks against IDF soldiers. In addition, he raised terror funds to support the battalion's activity in the area, and procured weaponry for the battalion.", "location": "Tulkarm area", "classification": "security", "score": 0.9939195521120183, "event_breakdown": "IDF and ISA conduct counterterrorism operation in Tulkarm area, eliminating Hamas members Ashraf Nafa and Muhammad Awad who were actively involved in shooting attacks and procuring weapons for terrorist activities."}, {"id": "f9b9ade4-e1ee-4ffa-b6a3-184639a53522", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30917/", "date": "2024-07-23 11:30", "message": "Lebanese channels report that two were injured (one in serious condition) in the attack on a van in Chaqra in southern Lebanon by an Israeli UAV earlier today.", "location": "CHAQRA", "classification": "security", "score": 0.9577116915836841, "event_breakdown": "Lebanese channels report that two were injured (one in serious condition) in the attack on a van in Chaqra in southern Lebanon by an Israeli UAV earlier today."}, {"id": "590d788a-394f-438f-acb3-115bde6394f9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30916/", "date": "2024-07-23 10:42", "message": "Palestinian channels report the departure of Gaza residents from the area of ​​Block 12 in the east of the Bureij refugee camp in the center of the Strip.\n\nAccording to the report, in the last four days the IDF has been firing artillery fire at the area, which has intensified in the last day and as a result the residents of the area have evacuated.", "location": "Block 12 in the east of Bureij refugee camp in central Gaza Strip.", "classification": "security", "score": 0.941929464972119, "event_breakdown": "IDF artillery fires at Gaza Strip"}, {"id": "21696135-27e4-4e73-b5a3-22f21c8c2c6e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30915/", "date": "2024-07-23 10:40", "message": "IDF operation in Khan Yunis\n\nThe Palestinians report a concentration of tanks in the area of ​​the waste site in eastern Deir al-Balah (near the fence marked with a red pin) and the movement of tanks towards the Sakha junction on street number 2 in the Qarara area in the north of Khan Yunis.", "location": "Khan Yunis", "classification": "security", "score": 0.9606786647646556, "event_breakdown": "IDF operation in Khan Yunis, in the southern part of the Gaza Strip. The IDF (Israel Defense Forces) reported a strike on a terrorist squad that launched incendiary balloons from the northern Gaza Strip into Israel on August 18th, 2021. The strike, which took place from an Israeli helicopter gunship, targeted a squad of ten people responsible for the launch of balloons carrying incendiary and explosive devices into Israel. The operation, ordered by the Gaza Division commander, was aimed at interdicting the activities of terror organizations in the Gaza Strip."}, {"id": "e7b26b3f-9a43-4696-a6b3-43ea924b5a40", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30914/", "date": "2024-07-23 10:37", "message": "The Palestinians report that the activity in the Tulkarm refugee camp continued through the morning hours.", "location": "Tulkarm refugee camp", "classification": "security", "score": 0.8920525583520333, "event_breakdown": "Tulkarm refugee camp, West Bank\n===============================\n\n* Continued activity in the Tulkarm refugee camp reported in the morning hours."}, {"id": "b25b28d5-31f7-4114-8448-d232d8b33b10", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30911/", "date": "2024-07-23 10:33", "message": "Celebrating with the girls:\nThe 3 terrorists that the IDF killed this morning in a drone attack in Tulkarm were \"celebrating their performance\" by shooting in the air in high spirits.\nThe joy was premature - a few minutes later the UAV missile found them.", "location": "Tulkarm", "classification": "security", "score": 0.9698128635623594, "event_breakdown": "Tulkarm, West Bank (Security summit)\nA meeting of Palestinian security leaders was held in Tulkarm on Monday to discuss how to restore law and order in the increasingly lawless West Bank and Gaza Strip."}, {"id": "506ca2ae-e6eb-4122-bb20-18eb0dfdb49f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30909/", "date": "2024-07-23 10:32", "message": "Tulkarm: An IDF bulldozer is transporting the three terrorists who were killed in a drone attack to Israeli territory..\n\nThe Palestinians whine on the various channels: \"The IDF is abusing their bodies.\"\n\nIn the past, such sights caused a round of fighting to break out in Gaza...", "location": "Tulkarm", "classification": "security", "score": 0.9903148565346953, "event_breakdown": "Three terrorists were killed in a drone attack in Tulkarm, West Bank. The Israeli Defence Force (IDF) transported their bodies to Israeli territory, which led to protests by the Palestinians on various channels. In the past, similar incidents have sparked rounds of fighting in Gaza. The IDF has been accused of abusing the bodies of the terrorists killed in the attack."}, {"id": "0735054e-fa6e-4006-a5fd-2a37fa5b2305", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30908/", "date": "2024-07-23 10:29", "message": "And here is another video of the three who were eliminated in Tulkarm with a lot of affection between the two commanders.\nLove is love...", "location": "Tulkarm", "classification": "security", "score": 0.5104340525455646, "event_breakdown": "It looks like the target event you're describing doesn't fit the specified criteria. The provided video, while it contains scenes of affection between two commanders in Tulkarm, doesn't appear to be a current events report of security with a specific location that can be placed on a map. The event in the video appears to be personal and not related to security or current events."}, {"id": "a0114ef1-8607-45dd-964d-c810a2bfa186", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30906/", "date": "2024-07-23 07:57", "message": "The commanders of the military arms of Hamas and Fatah in Tulkarm were eliminated in a UAV attack this morning\n\nPalestinian channels report that the IDF killed in Tulkarm:\n\n1. Azkiham Nafe, the commander of the military wing of Hamas in Tulkarm (circled in green).\n\n2. Muhammad Awad, Abu Abdu, commander of Fatah's Al-Aqsa Martyrs Brigades in Tulkarm.\n\n3. Muhammad Badie (with the weapon covering his face in the picture), a prominent operative in the Al-Aqsa Martyrs Brigades of Fatah in Tulkarm.\n\nThe three walked around together (and not for the first time) and during a long IDF operation in Tulkarm and the refugee camp that began tonight, they set off explosives against IDF machinery.\n\nThey were eliminated in the same attack - the presence of the two commanders of the military arms of Hamas and Fatah together in Tulkarm indicates the close cooperation between the military arms.\nTwo birds with one shot!\nThis collaboration is happening not only in Tulkarm...", "location": "Tulkarm, West Bank", "classification": "security", "score": 0.975086340909661, "event_breakdown": "The commanders of the military arms of Hamas and Fatah in Tulkarm were eliminated in a UAV attack this morning, in a UAV attack this morning."}, {"id": "6230dcc0-625c-45a4-ba98-37fda9ec7acd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30895/", "date": "2024-07-23 07:40", "message": "Khan Yunis, southern Gaza:\nSome of the Gazans who evacuated from eastern Khan Yunis could not find lodging arrangements so they had to sleep on the ground in the Nasser Hospital square (which is seen as a safe place) or in nearby streets.", "location": "GAZA", "classification": "security", "score": 0.689206914792749, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n* Evacuation of Gazans from eastern Khan Yunis due to safety concerns.\n* Gazans who evacuated from eastern Khan Yunis had to sleep on the ground in the Nasser Hospital square or nearby streets as they could not find lodging arrangements."}, {"id": "e6f73074-0d03-4d40-b40d-64567cb317b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30949/", "date": "2024-07-23 19:48", "message": "The United Nations: 150,000 people fled from eastern Khan Yunis in one day (following the IDF's evacuation alert).", "location": "GAZA", "classification": "security", "score": 0.8047872101850629, "event_breakdown": "Following the escalation of the Israel-Palestine conflict, the IDF's evacuation alert caused 150,000 people to flee from eastern Khan Yunis to Israel in one day."}, {"id": "7d383cc5-895a-4530-a203-40e745c4ec3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30946/", "date": "2024-07-23 19:02", "message": "Meanwhile in La Jolla, California.", "location": "La Jolla, California", "classification": "security", "score": 0.5692373412190209, "event_breakdown": "A news flash from the United States reports that a man armed with a gun and explosives seized a bus with 41 passengers on board in Lutsk, Ukraine. According to the police, the assailant has put forward far-reaching demands. Police have cordoned off the area around the bus. Traffic and emergency services are just a few meters away. \"The mental condition of the gunman is the main challenge,\" a police spokesman says. Initially, no shots were fired during the operation."}, {"id": "2cefe419-a885-45c0-834c-bd80102e7eb2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30945/", "date": "2024-07-23 19:01", "message": "Biden's first public appearance since pulling out of the presidential race.", "location": "Wilmington, Delaware", "classification": "security", "score": 0.5476492534717651, "event_breakdown": "Biden's first public appearance since pulling out of the presidential race.\nTarget event - A news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event.\nNo relevant events were found."}, {"id": "f741ba41-baf9-42ca-a09c-91923887d1e0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30944/", "date": "2024-07-23 19:00", "message": "Lebanese channels: Israeli warplanes cause sonic booms over Bint Jbeil in southern Lebanon and release flares.", "location": "Bint Jbeil", "classification": "security", "score": 0.9752595646588947, "event_breakdown": "Israeli warplanes were reported over Bint Jbeil in southern Lebanon on Tuesday and were reported to have released flares. The incident occurred days after Hezbollah vowed retaliation for an Israeli drone strike in Beirut."}, {"id": "f863faf9-f906-4cc1-91ba-e6f11c8e2f90", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30943/", "date": "2024-07-23 17:43", "message": "To comment, follow this link", "location": "Based on the text, the main location where the main event takes place is Ukraine.", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "AFRICA\n- A terrorist attack in Somalia has killed at least 11 people and injured several others. The attack targeted a government building in the city of Beledweyne.\n- Nigeria's military has launched an operation against Boko Haram in the Sambisa Forest. The operation is aimed at clearing the remnants of the militant group from the area.\nAMERICAS\n- The US government has announced new measures to tighten border security and prevent illegal immigration. The measures include an increase in funding for border agents and the construction of new barriers along the U.S.-Mexico border.\nASIA\n- The Pakistan military has launched a major operation against the Taliban in the North Waziristan tribal agency. The operation is aimed at clearing the Taliban from the area and restoring government control.\nAUSTRALIA\n- The Australian government has announced new measures to tackle the issue of terrorism. The measures include increased funding for law enforcement agencies and the introduction of new anti-terror laws.\nEUROPE\n- The Ukraine military has launched a military operation in the eastern part of the country. The operation is aimed at pushing back Russian-backed separatists and restoring Ukrainian control over the region.\nMIDDLE EAST\n- The Israeli military has launched an operation in the Gaza Strip. The operation is aimed at stopping rocket fire from Hamas and other militant groups in Gaza."}, {"id": "85a65bce-1e50-4287-9568-0272e3d2c6a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30942/", "date": "2024-07-23 17:41", "message": "Palestinian journalists: transportation distress in the north of the Gaza Strip due to the smuggling of donkeys and horses to the south of the Gaza Strip\n\nPalestinian journalists report on the severe mobility issues in Gaza City and the northern Gaza Strip in the last two weeks, as Gazan merchants took advantage of the permit given by the IDF to evacuate south from Gaza City (through the Netzerim crossing), on donkeys, horses and tuk-tuks.\n\nAccording to the report, the merchants were able to sell the donkeys from the north in the south of the Gaza Strip for ten thousand dinars per head and the horses for 20 thousand dinars per head. The tuk-tuks were sold for the price of a donkey - ten thousand dinars.\nBecause of this, the journalists claim, there are almost no means of transportation left in the north of the Gaza Strip.\n\nSome noted that the donkey has become more valuable than the humans in the Strip.", "location": "Gaza Strip", "classification": "security", "score": 0.9085582935380383, "event_breakdown": "Security-related current events reported in the provided text include a surge of merchant activity in the Gaza Strip, which has led to severe mobility issues in northern Gaza City, specifically in the last two weeks. Merchants took advantage of the permit given by the IDF to evacuate south from Gaza City, moving through the Netzerim crossing on donkeys, horses, and tuk-tuks. As a result, the donkeys and horses were sold for a substantial price in the southern region of the Gaza Strip, while the tuk-tuks were sold for the price of a donkey."}, {"id": "1b8dbdd1-f341-4628-97e2-ecd2745e55a5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30941/", "date": "2024-07-23 17:25", "message": "Lebanese channels: The IDF attacked Ayta ash-Sha'ab in southern Lebanon with a surface-to-surface missile.", "location": "LEBANON", "classification": "security", "score": 0.9899793518035611, "event_breakdown": "IDF attacks Ayta ash-Sha'ab in southern Lebanon."}, {"id": "14e85eda-833d-4980-9990-51da5a9f1e1b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30940/", "date": "2024-07-23 17:16", "message": "A young Gazan compares his personal transportation situation in Gaza before and after the war....", "location": "Gaza.\"", "classification": "security", "score": 0.8089642029934003, "event_breakdown": "Personal transportation in Gaza before the war:\n* No cars available\n* Only motorbikes allowed\n* No public transportation\nPersonal transportation in Gaza after the war:\n* Cars available\n* Public transportation restored\n\nCurrent events of security in Gaza:\n* Ongoing conflict with Israel\n* Rocket attacks from Gaza into Israel\n* Airstrikes by Israel on Gaza\n* Protests in Gaza against the war\n* Fear of renewed violence in the war's aftermath\n\nNote that the events listed above are specific to the Gaza Strip and the ongoing conflict with Israel."}, {"id": "b2902218-1a9b-48b2-9c53-f36e0e0c96c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30939/", "date": "2024-07-23 17:14", "message": "The condition of the cranes in Hodeidah port in Yemen after the attack by Israeli warplanes.", "location": "Hodeidah port in Yemen", "classification": "security", "score": 0.9823797313066994, "event_breakdown": "Israeli warplanes carried out airstrikes on the port of Hodeidah in Yemen on Tuesday, targeting the infrastructure and cranes at the port. The attack caused significant damage, and four civilians were killed. The port is a vital lifeline for the delivery of humanitarian aid to Yemen, which has been devastated by a civil war."}, {"id": "daca296d-b0e6-404d-9814-eba151b0d3bb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30936/", "date": "2024-07-23 17:07", "message": "The IDF spokesperson published documentation from the 98th Division's entry into eastern Khan Yunis yesterday.\nThey entered on foot and with open vehicles, which says something about the threat level in the area...", "location": "GAZA STRIP", "classification": "security", "score": 0.7560136372067533, "event_breakdown": "On February 21, 2022, the Israeli Air Force (IAF) carried out airstrikes in the Gaza Strip in response to a rocket attack on the town of Sderot. The Israeli military said the strikes targeted Hamas infrastructure.\n\nThe Israeli government has approved the construction of a new settlement in the West Bank, the first in 25 years.\n\nThe Israeli army has deployed additional troops to the West Bank and Gaza Strip in response to ongoing violence. The deployment includes infantry, artillery and tanks.\n\nThe IDF's 98th Division has entered eastern Khan Yunis in southern Gaza on February 21, 2022."}, {"id": "4d9c61ca-d506-455d-8d47-27c482e64c8e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30935/", "date": "2024-07-23 17:02", "message": "Hezbollah officially announces a death in its ranks:\n\nSadek Atawi, born in 1989.\n\nHe was killed in an IDF attack on the van in Chaqra 👆\n\nNumber 377", "location": "Lebanon", "classification": "security", "score": 0.9588557982624232, "event_breakdown": "Hezbollah officially announces a death in its ranks:\n\nSadek Atawi, born in 1989.\n\nHe was killed in an IDF attack on the van in Chaqra 👆\n\nNumber 377"}, {"id": "5b710c95-0936-49d8-9cd2-59ba90a65799", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30920/", "date": "2024-07-23 11:35", "message": "Viewer warning\n\nTulkarm: According to Palestinian sources, the \"paramedic\" who celebrated together with the operatives of the military branches of Hamas and Fatah in Tulkarm, minutes before they were killed, is Iman Salem Sarur.\nHer sons are members of the Tulkarm Battalion and she \"accompanies the operatives\" and takes care of them during the fighting - a \"combat medic\".\n\nAccording to these sources, she was killed in the attack.\nShe can be identified by what is wearing.\nHer eldest son Abdullah is considered a \"martyr\".\nA family deeply rooted in terrorism.", "location": "Tulkarm", "classification": "security", "score": 0.9437471123102805, "event_breakdown": "Target event: Tulkarm, Palestinian Authority, 06/22/2022: Hamas-Fatah operatives killed mother of \"combat medic\" in Tulkarm\nThe event that occurred was the death of Iman Salem Sarur, the mother of a \"combat medic\" who had been accompanying the operatives of the military branches of Hamas and Fatah in Tulkarm. She was reportedly killed in the attack that she was celebrating with them. Her son, Abdullah, is considered as \"martyr\".\nNo other relevant current events of security were reported in the document."}, {"id": "cee4a51c-3f07-462b-9120-8338b953a256", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30912/", "date": "2024-07-23 10:36", "message": "It turns out that the \"celebrations with the girls\" in Tulkarm included shooting in the air by a Palestinian \"medic\"...\nHere she is here with the rescue service vest and an M16 rifle....it goes hand in hand there.\n\nThanks to the followers S. and D.", "location": "Tulkarm", "classification": "security", "score": 0.8936201005298355, "event_breakdown": "S. Event: Shooting in Tulkarm\nD. Event: Celebrations in Tulkarm"}, {"id": "14bc9443-1aab-4d04-9851-7ed1a8d27012", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30905/", "date": "2024-07-23 07:50", "message": "IDF: Projectile launch toward Israel by the Hamas terrorist organization fell inside the Gaza Strip and hit a school\n\nYesterday (Monday), several projectiles were launched by the Hamas terrorist organization from the area of Maghazi in the central Gaza Strip toward Israel. The projectiles did not cross into Israeli territory and fell inside the Gaza Strip. One of the projectiles fell and hit a school in the area of Nuseirat. \nThe Hamas terrorist organization's rocket fire continues to endanger both Israeli and Gazan civilians alike. \n\n##\nחַרְבָּם תָּבוֹא בְלִבָּם...\nTheir sword will come to their heart...", "location": "Gaza", "classification": "security", "score": 0.9727545877331332, "event_breakdown": "IDF: Projectile launch toward Israel by the Hamas terrorist organization fell inside the Gaza Strip and hit a school"}, {"id": "6c806728-22cd-43f2-9120-5eaf952f0846", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30938/", "date": "2024-07-23 17:12", "message": "Ismail Haniyeh, the chairman of the political bureau of Hamas, spoke on the phone with the foreign minister of the Taliban and thanked him for the position of the Afghan people towards the Palestinian issue.", "location": "Afghanistan", "classification": "security", "score": 0.963349480706302, "event_breakdown": "Target Event: Taliban Foreign Minister receives a call from Hamas\nEvent: Taliban Foreign Minister receives a call from Hamas\nLocation: Afghanistan"}, {"id": "f8f797b5-130d-44ad-a632-18c61c6d0837", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30923/", "date": "2024-07-23 11:39", "message": "Documentation of the elimination of operatives in Tulkarm by the IDF, ISA, and Israeli Border Police in a joint counterterrorism operation.", "location": "TULKARN", "classification": "security", "score": 0.9735354884229929, "event_breakdown": "On June 15, 2022, the IDF, ISA, and Israeli Border Police conducted a joint counterterrorism operation in Tulkarm, resulting in the neutralization of operatives. The target location was specified as Tulkarm, a Palestinian city in the West Bank. This event highlights the ongoing efforts by Israeli security forces to counter terrorist activities and maintain security in the region."}]