[{"id": "258c3147-866d-4761-a757-be4f6c4bcaac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26678/", "date": "2024-05-04 17:47", "message": "Palestinian channels report: The IDF attacked the home of the prominent journalist in the Gaza Strip, Hassan Aslih (Hamas-affiliated) in the Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip.\nThere were no casualties in the attack.", "location": "Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip.", "classification": "security", "score": 0.9953827602700771, "event_breakdown": "- IDF attacked the home of journalist Hassan Aslih in Manara neighborhood, Khan Yunis, Gaza Strip"}, {"id": "f96aec24-7ae5-4d69-bb3a-20502a499797", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26677/", "date": "2024-05-04 17:31", "message": "Palestinian channels: The Palestinian Authority's security mechanisms detonated, in a controlled manner, explosive devices they located in Tubas (Northeastern Samaria).", "location": "Tubas", "classification": "security", "score": 0.9948419961865298, "event_breakdown": "- Palestinian Authority's security mechanisms detonated explosive devices in Tubas, Northeastern Samaria"}, {"id": "e9b5ece0-663d-4bcb-a75a-23a912358f34", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26676/", "date": "2024-05-04 17:20", "message": "Hamas-identified channels: All four killed (whose names have been published) 👆 in the IDF's activity in the village of Deir al-Ghusun in the north of Tulkarm, were operatives of the military wing of Hamas.\nAlaa Sharitah was the commander of the military wing of Hamas in Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9934812200416727, "event_breakdown": "- Four operatives of the military wing of Hamas were killed in IDF activity in Deir al-Ghusun, north of Tulkarm.\n- The commander of the military wing of Hamas in Tulkarm was Alaa Sharitah."}, {"id": "922483c7-dc89-4364-8e1c-1f2640303ee3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26675/", "date": "2024-05-04 17:19", "message": "Further to this👆\nA joint statement to the IDF spokesperson, the police spokesperson and the Shin Bet spokesperson:\n\nThe soldiers of Yamam, the IDF and the Shin Bet eliminated five terrorists who had barricaded themselves in a building in Tulkarm in a 12-hour battle\n\nThe soldiers of the Yamam, IDF and Shin Bet, under the precise intelligence guidance of the Shin Bet and IDF Intelligence, operated for over 12 hours in Tulkarm in a targeted activity to defeat a terrorist cell.\n\nThe soldiers closed in on a building where the terrorist squad was entrenched, which opened fire on them. The fighters responded by shooting with shoulder-fired missiles and other means from the building, and at the end of the exchange of fire, the five terrorists were eliminated.\nMilitary equipment and weapon parts were confiscated.\n\nDuring the activity, an IDF fighter was injured and brought to continue receiving medical treatment in a hospital; his family was informed.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9849329956770798, "event_breakdown": "- Joint operation by Yamam, IDF, and Shin Bet eliminates five terrorists barricaded in a building in Tulkarm after a 12-hour battle.\n- Soldiers, guided by precise intelligence from Shin Bet and IDF Intelligence, conduct targeted activity in Tulkarm against a terrorist cell.\n- Terrorist squad entrenched in a building opens fire on soldiers, who respond with shoulder-fired missiles and other means, resulting in the elimination of five terrorists.\n- Confiscation of military equipment and weapon parts during the operation.\n- An IDF fighter injured during the activity is brought to a hospital for medical treatment; family informed."}, {"id": "5350bd90-44bf-4e06-9604-d60c0937b9e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26674/", "date": "2024-05-04 16:10", "message": "The Palestinians publish the names of four of the \"martyrs\" who were killed in the IDF operation tonight in the village of Deir el Ghusun in the north of Tulkarm:\n\n1. Alaa Sharith (the leftmost one).\n2. Tamer Fuqaha (next to Alaa' - both are behind the attack in which Elhanan Klein fell in November 2023. Tamer is also an operative of Erin al Aswad).\n3. Adnan Samara\n4. Asal Badran\n\nIn addition, there is the \"headless martyr\" who has not yet been identified - DNA tests will be conducted on him to confirm his identity.", "location": "Deir el Ghusun", "classification": "security", "score": 0.9791185685870558, "event_breakdown": "- Four Palestinians killed in an IDF operation in the village of Deir el Ghusun in the north of Tulkarm identified by the Palestinians.\n  1. Alaa Sharith\n  2. Tamer Fuqaha\n  3. Adnan Samara\n  4. Asal Badran\n- One unidentified Palestinian, referred to as the \"headless martyr,\" pending DNA tests for confirmation of identity."}, {"id": "a81cacfd-1a98-4f75-bb6f-2c03cdaea44c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26673/", "date": "2024-05-04 15:36", "message": "The Palestinians report that the IDF forces have finished their activities in Deir al-Ghusun in the north of Tulkarm and have left.\nSources in Tulkarm say that the Palestinian rescue forces located another Palestinian \"martyr\" among the ruins, apparently headless.", "location": "Deir al-Ghusun, Tulkarm", "classification": "security", "score": 0.9671169206516085, "event_breakdown": "- IDF forces finish activities in Deir al-Ghusun, north of Tulkarm and leave\n- Palestinian rescue forces find headless Palestinian \"martyr\" in the ruins of Deir al-Ghusun"}, {"id": "77ddd91c-d952-4193-af01-ae927c3765c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26672/", "date": "2024-05-04 14:06", "message": "The Palestinians report that the person who came out from under the ruins of the house in Deir al-Ghusun and was arrested by IDF forces is the released prisoner Salma Badran, an operative of the military wing of Hamas with a \"heavy\" family lineage: he is the brother of the two \"martyrs\" of the wing - Fawaz and Seif Allah Badran. Salma is the owner of the apartment where the Hamas terrorists hid last night and which the IDF destroyed.\n\nFawaz (Salma's brother) was one of the senior bomb engineers of the Izz ad-Din al-Qassam Brigades in the West Bank and was the one who assembled the explosive device that exploded in the first suicide attack of the second intifada (March 2001), in which 3 Israeli citizens were killed in Netanya. Fawaz was also the one who recruited the suicide bomber for the attack and also guided other suicide bombers in Tulkarm. He was eliminated by the Israeli security forces that year using an explosive device planted in his car.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9989665591672134, "event_breakdown": "null"}, {"id": "9a1dae5b-5056-4244-a897-80dee7381dab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26671/", "date": "2024-05-04 14:00", "message": "The official Palestinian news agency Wafa: 6 Palestinians were killed in the IDF operation in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9664112263099419, "event_breakdown": "- 6 Palestinians killed in IDF operation in Deir al-Ghusun, Tulkarm"}, {"id": "64a40e89-0b7d-4494-bbb3-90472cd59ee2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26668/", "date": "2024-05-04 13:56", "message": "More footage from Deir al-Ghusun north of Tulkarm from the IDF operation today.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.5645468611123309, "event_breakdown": "- IDF operation in Deir al-Ghusun north of Tulkarm\n- More footage released from the operation"}, {"id": "6f573580-bb99-4787-9b61-6c3b94b577f6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Palestinian sources in Tulkarm claim that Tamer Fuqaha, an operative of the military wing of Hamas, (and the terrorist who carried out the attack in which Elhanan Klein fell on November 2, 2023), was killed in an IDF operation tonight in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9920826670749956, "event_breakdown": "- Tamer Fuqaha, a Hamas operative, was killed in an IDF operation in Deir al-Ghusun village, Tulkarm."}, {"id": "23c7fbbe-fffa-48aa-85d7-d78f3ae6b8ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Deir al-Ghusun north of Tulkarm:\nThe IDF forces packed the body of the Palestinian who was killed in the area of ​​the building.\n\nPalestinian sources claim the IDF forces took 3 bodies.\n\nIDF forces then arrested a Palestinian who emerged from under the ruins of the house that the forces had besieged for many hours.", "location": "Tulkarm", "classification": "security", "score": 0.9879003899097348, "event_breakdown": "- IDF forces pack the body of a Palestinian killed in Deir al-Ghusun, north of Tulkarm.\n- Palestinian sources claim IDF forces took three bodies in the area.\n- IDF forces arrest a Palestinian who emerged from under the ruins of a besieged house after many hours in Deir al-Ghusun."}, {"id": "4e0b972f-eff7-4761-ba62-f30f516000bb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26661/", "date": "2024-05-04 13:10", "message": "The \"Holy Fire\" ceremony held today in the Church of the Holy Sepulcher in East Jerusalem as part of the \"Sabbath of Light\" that Christians celebrate today.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.7164941467590658, "event_breakdown": "- \"Holy Fire\" ceremony held at the Church of the Holy Sepulcher in East Jerusalem.\n- Part of the \"Sabbath of Light\" celebration observed by Christians."}, {"id": "ecc9f86b-b936-40de-ae3a-4a949f7269c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26658/", "date": "2024-05-04 13:07", "message": "For nearly ten hours starting last night, IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm.\nAccording to the estimates, the terrorists Tamer Fakha and Alaa Sharitah, the operatives of the military wing of Hamas involved in the shooting attack in which Major General Elhanan Klein was killed near Beit Lid on November 2, 2023, were hiding in the house.\nSources associated with Hamas and Islamic Jihad operatives claim that the two managed to escape from the house which was surrounded by the IDF for many hours and fired upon by a large number of missles (and finally destroyed with a bulldozer - in the attached videos you can see the shooting and the demolition the house).", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9796365504234397, "event_breakdown": "1. IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm\n2. Terrorists Tamer Fakha and Alaa Sharitah, associated with Hamas, were believed to be hiding in the house\n3. The two terrorists managed to escape from the surrounded house\n4. The house was fired upon by a large number of missiles and finally destroyed with a bulldozer"}, {"id": "10e2dd2a-06b3-4916-bf0f-516474249c7f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26657/", "date": "2024-05-04 13:02", "message": "The Al Jazeera network claims: an Israeli drone launched a missile a few hours ago at a vehicle in Bint Jabil in southern Lebanon.\n\nUnofficial Lebanese sources: No casualties.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9652451684275815, "event_breakdown": "- An Israeli drone reportedly launched a missile at a vehicle in Bint Jabil, southern Lebanon, according to Al Jazeera network.\n- Unofficial Lebanese sources report no casualties from the incident."}, {"id": "f457828c-2434-4630-9e06-9d7e008ae2fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26655/", "date": "2024-05-04 12:29", "message": "At least 3 different Israeli military reporters publish the exact same message:\n\nPolitical actor:\n\nContrary to the publications, Israel will under no circumstances agree to the end of the war as part of an agreement to release our abductees.\n\nAs the political echelon decided, the IDF will enter Rafah and destroy the remaining Hamas battalions there - whether or not there will be a temporary respite for the release of our hostages.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.6696081489195264, "event_breakdown": "- Several Israeli military reporters publish the same message about Israel's stance on ending the war and releasing abductees\n- IDF will enter Rafah to destroy Hamas battalions, regardless of any temporary respite for hostage release"}, {"id": "83285468-1867-46c6-82e0-4116506416a5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26653/", "date": "2024-05-04 12:27", "message": "Today, Lebanese sources report: Hezbollah will soon submit its comments to the French proposal to end the war in southern Lebanon\n\nJournalist sources in Lebanon state that Hezbollah and the Amal movement discussed the French proposal and decided not to reject it (so as not to be perceived as refusers - AA) but to submit 10 comments to amend the proposal.\nThe comments will be forwarded to the Speaker of the Lebanese Parliament (who happens to also be the head of the Amal Shiite movement fighting alongside Hezbollah in southern Lebanon - AA) and he will discuss them with Prime Minister Mikati and forward them to the French side.", "location": "Lebanon", "classification": "security", "score": 0.9143945024805114, "event_breakdown": "- Hezbollah to submit comments on French proposal to end war in southern Lebanon\n- Hezbollah and Amal movement discuss French proposal and decide to submit 10 comments for amendment, to be forwarded to Speaker of Lebanese Parliament and then to French side"}, {"id": "81cc6143-189f-4c5a-ba9e-c1d9bddcbd2e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26651/", "date": "2024-05-04 12:20", "message": "The Saudi Asharq channel:\n\nHamas will announce within hours that it accepts this deal after receiving American guarantees for the end of the fighting and the complete withdrawal of IDF forces from all parts of the Strip at the end of the third and final phase of the deal, without the return of Israeli forces to the territory of the Strip.\n\nIt was also reported that Israel removed its objection to some of the names of the prisoners that Hamas demanded to be released in the deal - something that made progress possible.", "location": "Strip", "classification": "security", "score": 0.5337781470853348, "event_breakdown": "1. Hamas to announce acceptance of deal with American guarantees for end of fighting and IDF withdrawal from all parts of the Strip\n2. Israel removes objection to some names of prisoners demanded by Hamas for release in the deal"}, {"id": "2be43f06-5ea9-450e-b6b2-d9414c712a77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26650/", "date": "2024-05-03 20:33", "message": "The Saudi Asharq channel from its sources:\nHamas obtained American confirmation through the Egyptian and Qatari mediators that the term \"sustainable peace\" that appears in the agreement is in fact a permanent ceasefire.\n\n##\nI remind you, this will make or break the agreement.\nIf Hamas receives guarantees not to resume fighting, it will sign the agreement.\nThere are no disputes between the parties regarding the other sections.", "location": "Egypt", "classification": "security", "score": 0.8031684638552474, "event_breakdown": "- Hamas obtains American confirmation through Egyptian and Qatari mediators regarding a permanent ceasefire term in the agreement."}, {"id": "d790d98e-e1d9-431c-92ac-1af3843ca710", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26649/", "date": "2024-05-03 20:30", "message": "Documentation of one of today's attacks in the area of ​​the displaced persons' tents in Rafah in the south of the Gaza Strip - note the rocket rising into the sky. This indicates a precise hit by the aircraft on the target.", "location": "Rafah", "classification": "security", "score": 0.9952821119807056, "event_breakdown": "- Attack documented in the area of displaced persons' tents in Rafah, southern Gaza Strip.\n- Rocket seen rising into the sky, indicating a precise hit by aircraft on the target."}, {"id": "20ef1d72-09aa-42ac-a7f9-c2a729bc26dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26648/", "date": "2024-05-03 20:27", "message": "Hamas in an official announcement:\n\nIn light of the recent contacts with the mediators, tomorrow a delegation of the movement will arrive in Cairo to complete the talks.\n\nWe emphasize that the leadership of the movement reacted in a positive spirit to the proposal it received while discussing it. We are going to Cairo in the same positive atmosphere to reach an agreement.\n\nWe are determined to reach an agreement that will realize the demands of our people for a total cessation of aggression, the withdrawal of forces, the return of the displaced, aid to our people, the beginning of the reconstruction of the Gaza Strip and a serious exchange deal.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.3907896760166591, "event_breakdown": "- Hamas delegation to arrive in Cairo for talks after positive response to proposal\n- Aim to reach agreement for cessation of aggression, withdrawal of forces, return of displaced, aid, Gaza reconstruction, and exchange deal"}, {"id": "fd8e19c6-7c13-4727-81c1-ef0aa76f3db9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26645/", "date": "2024-05-03 19:03", "message": "Gazans complain: as part of the food packages distributed at UNRA schools, we received a food product that contains pork 🐷...\n\nحسب الله ونعم الوكيل", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.5476738944355803, "event_breakdown": "- Gazans complain about receiving a food product containing pork as part of food packages distributed at UNRA schools."}, {"id": "9fc97b32-0d73-4f06-8264-226e8b28ae96", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26644/", "date": "2024-05-03 17:44", "message": "Reuters from a senior Hamas official: a Hamas delegation will arrive in Cairo tomorrow.", "location": "Cairo", "classification": "security", "score": 0.9023652992005777, "event_breakdown": "null"}, {"id": "418cf9e6-11b0-43ad-a436-9f6865665095", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26642/", "date": "2024-05-03 16:36", "message": "One of the signs of abundance in the northern Gaza Strip: Gazan donkeys receive fresh pita bread\n\nA Gazan from the north of the Gaza Strip to the donkey: once (when there was a shortage of bread) we ate from your food, now take and eat bread from today. You are better than many people...", "location": "Gaza Strip", "classification": "security", "score": 0.8432632263954416, "event_breakdown": "- Gazan donkeys in northern Gaza receive fresh pita bread\n- Gazan from northern Gaza feeds donkeys fresh pita bread and recalls previous food shortages"}, {"id": "e76c74da-06d4-4435-8495-a121f3e7f9cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26641/", "date": "2024-05-03 16:28", "message": "American Central Command:\n\nDue to weather conditions, construction work on the floating pier off the coast of Gaza was stopped and it was moved to Ashdod port, where its construction will be completed.\n\nAfter the completion of its construction, it will be floated along the shores of Gaza to the place where it was planned to be placed.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.8222928362890448, "event_breakdown": "- Construction work on the floating pier off the coast of Gaza halted due to weather conditions.\n- The floating pier construction relocated to Ashdod port for completion.\n- Upon completion, the pier will be floated along the shores of Gaza to its intended location."}, {"id": "ff5f36ef-7a8e-4c0f-8e92-507970289ad2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26640/", "date": "2024-05-03 15:56", "message": "Reuters from an Egyptian source:\n\nThe head of the CIA, William Burns, arrived in Cairo to promote the ceasefire in Gaza.\n\n##\nThe Americans are using all their weight and are firing their heaviest guns to reach a ceasefire.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.8731912994868349, "event_breakdown": "- Head of the CIA, William Burns, arrives in Cairo to promote ceasefire in Gaza\n- American efforts to promote ceasefire in Gaza"}, {"id": "12b0267e-955b-46e2-98f4-8e9c1deaceb4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26639/", "date": "2024-05-03 15:55", "message": "The Palestinian Ministry of Health in Gaza:\n26 dead in the Strip in the last day.\n\nThe number of deaths in the last few days:\n28\n33\n47\n34\n\nTotal dead in the Gaza Strip since the beginning of the war: 34,622. Total wounded: about 78 thousand.\n\n##\nIn the last day, the number of dead was the lowest in the Gaza Strip since the beginning of the war (with the exception of the hodna period in November 2023).", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.8569080015487186, "event_breakdown": "- Palestinian Ministry of Health in Gaza reports 26 deaths in the last day in the Gaza Strip.\n- Total deaths in the Gaza Strip since the beginning of the war: 34,622. Total wounded: approximately 78,000.\n- The number of deaths in the last few days: 28, 33, 47, 34.\n- The number of dead in the last day is the lowest in the Gaza Strip since the beginning of the war (excluding the hodna period in November 2023)."}, {"id": "cf7119f6-3d35-42bc-a942-3b6f278cc629", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26633/", "date": "2024-05-03 13:36", "message": "Paris: French security forces break into Sciences Po the Institute of Political Science to break up an anti-Israel demonstration by the students there.", "location": "Paris", "classification": "security", "score": 0.9281242816179448, "event_breakdown": "- French security forces break into Sciences Po, the Institute of Political Science in Paris to break up an anti-Israel demonstration by the students"}, {"id": "5fe78930-c8dd-4a1d-a56a-38e6bcc43287", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26632/", "date": "2024-05-03 13:29", "message": "The Houthi military spokesman:\n\nWe announce, under the direction of Commander Abdelmalek Alhouthi, the fourth phase of our activities:\n\nWe will hit all the ships whose destination is Israel's ports, wherever we can get our hands on them (that is, the innovation is that the activity is not limited by location - AA).\n\nIf Israel starts an operation in Rafah, all the ships of the companies that have any connection to Israeli ports will be affected (for example, if a certain shipping company works with Israeli ports, all its ships, even those whose destination is not Israel, will be affected - AA).", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.5250724896751947, "event_breakdown": "- Fourth phase of Houthi activities announced by military spokesman\n- Ships heading to Israel's ports will be targeted\n- All ships of companies connected to Israeli ports will be affected if Israel starts an operation in Rafah"}, {"id": "aa066654-8294-4167-81c7-6e629487ace6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26631/", "date": "2024-05-03 13:27", "message": "A few points to note:\n\n1. Hezbollah said anyway that it will stop the fire as soon as there is a ceasefire in Gaza.\n\n2. The French proposal does not answer the question of implementation and enforcement. What do we do if Hezbollah does not vacate? What happens if in six months Hezbollah returns south of Litani River? After all, the non-enforcement of Resolution 1701 at the end of the Second Lebanon War is what brought us to the current situation.\nEnforcement is the heart of the matter in the Lebanese arena. What enforcement measures are there and what are the sanctions for violations by Hezbollah?\n\n3. Israel was flying in the skies of Lebanon before the war, now it will have to commit that it will stop...\n\nThe bottom line, the proposal creates a situation where Israel will be left with just a paper in hand, without any deterrence and with Hezbollah's military force threatening the residents of the north.\n\nFor the Americans and the French this is excellent. This is a disaster for Israel.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.8178512051645865, "event_breakdown": "- Hezbollah states it will cease fire once a ceasefire is implemented in Gaza.\n- Concerns raised about the French proposal's lack of clarity on implementation and enforcement regarding Hezbollah's withdrawal from certain areas in Lebanon.\n- Questions raised about enforcement measures and potential sanctions for Hezbollah violations.\n- Israel's commitment to halting flights over Lebanon discussed.\n- Concerns expressed about the proposal leaving Israel without deterrence against Hezbollah's military threat in the north."}, {"id": "37ce0483-83a2-4014-96db-13e4902c6127", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26630/", "date": "2024-05-03 13:15", "message": "About 100,000 Palestinians have left the Gaza Strip since the beginning of the war\n\nThe Palestinian ambassador in Egypt: since the beginning of the war and until April, 85 thousand Palestinians left the Gaza Strip for Egypt through the Rafah crossing.\n\nTaking the month of April into account, it can be estimated that about one hundred thousand Palestinians left the Strip since the beginning of the war.", "location": "Gaza Strip", "classification": "security", "score": 0.8683848530412968, "event_breakdown": "- Approximately 100,000 Palestinians have left the Gaza Strip since the beginning of the war.\n- Palestinian Ambassador in Egypt reports that since the start of the war until April, 85,000 Palestinians left Gaza for Egypt via the Rafah crossing.\n- Considering the month of April, it's estimated that around 100,000 Palestinians have left the Strip since the war's onset."}, {"id": "1497b8ac-cd33-41ad-bb91-aa8fc436fdf6", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65962/", "date": "2024-05-03 13:11", "message": "A must watch:\n\nStudents from the \"Free Palestine Army\" charge Portland police officer with shields made from trash cans.\n\n##\nNot the sharpest tools in the shed...", "location": "Portland, Oregon", "classification": "security", "score": 0.7716378859605466, "event_breakdown": "- Students from the \"Free Palestine Army\" charged a Portland police officer with shields made from trash cans."}, {"id": "938ba78f-fe33-48aa-823e-2288da792a36", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26628/", "date": "2024-05-03 13:11", "message": "Fox News: The Iranian flag was raised by the students at the University of Irvine in California.\n\nIran is offering scholarships to students who will be expelled from US universities following the protests.", "location": "University of Irvine, California", "classification": "security", "score": 0.38395330639266484, "event_breakdown": "- Iranian flag raised by students at University of Irvine in California\n- Iran offering scholarships to students facing expulsion from US universities after protests"}, {"id": "c1ada807-9581-4341-a021-3bb324b44955", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26625/", "date": "2024-05-03 11:05", "message": "Reuters from the Turkish Minister of Commerce:\n\nThe suspension of trade with Israel will continue until a permanent cease-fire in Gaza and until Israel allows all aid into the strip. \n\n##\nTurkey has de-facto joined the Shiite axis - like the Houthis... they are harming the Israeli economy until a ceasefire is reached. The Sultan became a Houthi pirate.\n\nIsrael should remember this when Turkey wants to resume trade between the countries.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9341793288581125, "event_breakdown": "- Turkish Minister of Commerce announces the continuation of trade suspension with Israel.\n- Suspension to persist until a permanent ceasefire in Gaza and Israel permits all aid into the strip.\n- Turkey's actions likened to those of the Houthis, implying alignment with the Shiite axis.\n- Israel warned to consider Turkey's stance when resuming trade relations."}, {"id": "24049148-9cb7-4dac-8108-ecb2cfb51c7e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26624/", "date": "2024-05-03 11:04", "message": "The Shia militias in Iraq claim:\nYesterday afternoon (May 2nd) we launched two cruise missiles from Iraq at a target in Tel Aviv and at a target in Be'er Sheva.\n\nThe militias in Iraq also claim that they attacked an Israeli target in the Dead Sea early this morning \"with appropriate weapons\".\n\n###\nSources of the Lebanese al-Mayadeen claim that the Iraqi cruise missiles were launched at the Glilot Base in Tel Aviv and the Avraham Base in Be'er Sheva.", "location": "Tel Aviv", "classification": "security", "score": 0.9833649319691411, "event_breakdown": ""}, {"id": "cc3d4f27-10bb-4096-893b-4d961b0f47db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26623/", "date": "2024-05-03 10:23", "message": "The coup in Niger: Russian soldiers reportedly enter a military base where the American troops are stationed\n\nAccording to Reuters, Russian soldiers have entered a military air base housing American forces in the capital of Niger.\n\nAs you might remember, last year there was a coup in Niger and the military junta that seized power demanded that the US terminate the agreement with it and... remove all American forces from Niger.\n\nThe American forces have not yet evacuated and now they have new \"guests\" at their base.\n\nAmerican officials state that the Russian and American soldiers remain in separate areas at the base. The American Secretary of Defense spoke out on the matter and said that there is no fear that the Russians will get their hands on American equipment.\n\n##\nThe Taliban send their regards..", "location": "Niamey, Niger", "classification": "security", "score": 0.7709916187413431, "event_breakdown": "- Russian soldiers reportedly enter a military air base in Niger, where American troops are stationed.\n- Following a coup in Niger last year, the military junta demanded the removal of all American forces from the country.\n- American forces have not yet evacuated the base, despite the junta's demands.\n- American and Russian soldiers are said to be in separate areas within the base, according to American officials.\n- The American Secretary of Defense assures that there is no fear of Russian access to American equipment."}, {"id": "fa500d79-3281-4ee0-a89f-d6dcf7ee283a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26620/", "date": "2024-05-03 06:44", "message": "Last night's attack in Damascus, attributed to Israel\n\nSyrian sources identified with the Shiite axis report that the target of the Israeli attack in Damascus was the \"State Security School\" (of the Syrian Army - AA), near the village of Najaha, and as a result, a three-story building was severely damaged there.\nAccording to these sources, the target of the attack belonged to the Syrian army and not to Iranian elements in Syria.\n\nThe Syrian Ministry of Defense officially announced that Israel carried out an airstrike last night at 10:05 PM which resulted in the injury of 8 Syrian soldiers and damage to property.", "location": "Damascus", "classification": "security", "score": 0.9816944407775801, "event_breakdown": "- Last night's attack in Damascus, attributed to Israel\n- The target of the attack was the \"State Security School\" near the village of Najaha, resulting in severe damage to a three-story building\n- Syrian Ministry of Defense officially announced the airstrike at 10:05 PM, resulting in 8 Syrian soldiers injured and property damage"}, {"id": "237b1aa4-440f-435f-af70-65bfea4f2b76", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26619/", "date": "2024-05-02 20:40", "message": "After the report of the Bloomberg agency's reporter in Turkey 👆, the Turkish Ministry of Commerce officially announces:\n\nFrom today, the import of goods from Israel and the export of goods to it will be suspended until all aid can be brought into the Gaza Strip", "location": "Turkey", "classification": "security", "score": 0.9158362566726752, "event_breakdown": "- Turkish Ministry of Commerce officially announces the suspension of import of goods from Israel and export of goods to Israel.\n- Suspension is declared until all aid can be brought into the Gaza Strip."}]