[{"id": "7e6b27fb-0c45-4e1d-bfcc-e03e39623e84", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28788/", "date": "2024-06-12 07:23", "message": "Al Jazeera: 30 rockets were launched at the start of the hour from Lebanon towards the Upper Galilee.", "location": "Upper Galilee", "classification": "security", "score": 0.89151778600593, "event_breakdown": "30 rockets were launched from Lebanon towards the Upper Galilee. Al Jazeera reported that the rockets were fired from Lebanon towards the Upper Galilee."}, {"id": "aa67d4f4-22e8-427e-9f87-ffa841bfbd6f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28787/", "date": "2024-06-12 07:22", "message": "IDF: Following the sirens that sounded in northern Israel a short while ago, approximately 90 projectiles were identified crossing from Lebanon. A number of the projectiles were intercepted and others fell in several locations in northern Israel. As a result, fires broke out in a number of areas. The details are under review.", "location": "Lebanon", "classification": "security", "score": 0.9275117632672143, "event_breakdown": "IDF: Following the sirens that sounded in northern Israel a short while ago, approximately 90 projectiles were identified crossing from Lebanon. A number of the projectiles were intercepted and others fell in several locations in northern Israel. As a result, fires broke out in a number of areas. The details are under review."}, {"id": "d179418d-679a-4ae9-a247-c610c667243c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28786/", "date": "2024-06-12 07:21", "message": "Palestinian channels publish a document in which they claim to of the arrest of about 200 of the men who sheltered at a school in the Jabaliya refugee camp in the north of the Gaza Strip, during the last activity of the IDF forces there on May 24 (about three weeks ago).", "location": "Jabaliya refugee camp, Gaza Strip", "classification": "security", "score": 0.9287477526505875, "event_breakdown": "The arrest of about 200 men in the Jabaliya refugee camp in Gaza on May 24, 2019."}, {"id": "4a24765b-853d-4b62-b199-310a7f7d4364", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28785/", "date": "2024-06-12 07:20", "message": "According to the IDF radio, 100 rockets were launched from Lebanon towards the north, including towards Tiberias, where a red alert was sounded, about an hour ago.\n\nThe Lebanese Al Mayadeen envoy claims: more than 100 rockets were launched towards Israel.\n\nThis is the opening chord of Hezbollah's revenge for yesterday's assassination of the senior official in Jouaiyya.", "location": "Tiberias", "classification": "security", "score": 0.9193345388021325, "event_breakdown": "IDF radio reported that the rockets were targeting Tiberias, which is located in the Northern District of Israel."}, {"id": "f3415ff5-941c-441e-bfe0-fb5d416d721c", "channel_id": 1560386984, "url": "", "date": "2024-06-12 07:17", "message": "Taleb Abdullah was the commander of one of the two units responsible for the management of the war in ​​southern Lebanon, from the Litani river to the border with Israel. It is considered to be the most significant arena for Hezbollah because it is where most of the attacks against Israel originate and this is the arena that will first meet any IDF ground troops if Israeli forces enter Lebanon. This is the area from which Israel aims to remove Hezbollah. Saying that he is the most senior person killed so far by Hezbollah in the war is certainly not mistaken.\n\nIn the attached photos we see Abdullah with Wissam al-Tawil (both in military uniforms and winter coats), the senior officer in the Radwan force who was eliminated a few months ago and the only one other than Abdullah who was named \"commander\" in Hezbollah's official statements. In the other photo, Abdullah is seen with Qassem Soleimani, commander of the Quds force in the Iranian Revolutionary Guards who was eliminated in 2020 by the Trump administration", "location": "LEBANON", "classification": "security", "score": 0.8563906523301705, "event_breakdown": "Targeted event:\nA news push that reports the death of Taleb Abdullah, the second-most significant arena for Hezbollah because it is where most of the attacks against Israel originate and this is the arena that will first meet any IDF ground troops if Israeli forces enter Lebanon stating that he is the most senior person killed so far by Hezbollah in the war, certainly not mistaken."}, {"id": "27482079-91da-45f3-b9fd-87b6bbe8046e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28782/", "date": "2024-06-12 07:11", "message": "Hezbollah announced a short time ago in an official announcement about the death of\nالمجاهد القائد -\nThe Mujahid leader, or \"commanding fighter\" Taleb Abdullah - (Alhaj Abu Taleb).\n\"Commanding fighter\" is a unique title in Hezbollah. Hezbollah has used it so far in the war only when it mentioned the death of Wissam al-Tawil, the senior officer in the Radwan force whom the IDF eliminated a few months ago.\n\nIn other words, last night one of the two most senior officers killed by the IDF against Hezbollah in the war was eliminated, and some claim that the most senior.\n\nNumber 340", "location": "Israel", "classification": "security", "score": 0.7085873970713409, "event_breakdown": "security officer senior leaderHezbollah announced a short time ago in an official statement about the death of its figure Taleb Abdullah, who is said to have been a seniorleader in the force's Radwan unit. Hezbollah had used the term \"commanding fighter\" only previously for the person killed. Media reports claim that the figure is the second most important official killed by the IDF."}, {"id": "fe6c956b-5fcb-4231-9e52-8dd3665572dd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28804/", "date": "2024-06-12 14:23", "message": "The IDF accepts responsibility for the strike that killed Hezbollah senior operative Taleb Abdullah (this doesn't always happen-AA):\n\nIDF: The IDF struck a Hezbollah command and control center used to direct attacks from southeastern Lebanon and eliminated its commander, Sami Taleb Abdullah\n\nLast night (Tuesday), a Hezbollah command and control center in the area of Jouaiyya in southern Lebanon, which was used to direct terror attacks against Israeli territory from southeastern Lebanon in recent months, was struck by the IAF. As part of the strike, Sami Taleb Abdullah, the commander of the Nasr Unit in the Hezbollah terrorist organization, was eliminated. Sami Taleb Abdullah was one of Hezbollah's most senior commanders in southern Lebanon.\n\nFor many years, the terrorist planned, advanced, and carried out a large number of terror attacks against Israeli civilians. Three additional Hezbollah terrorist operatives were also eliminated in the strike.", "location": "Lebanon", "classification": "security", "score": 0.9718116128926128, "event_breakdown": "IDF"}, {"id": "946f28d1-e117-42ef-bb83-314bde93b494", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28800/", "date": "2024-06-12 14:20", "message": "Hezbollah presents \"snapshots in the life\" of Taleb Abdullah, who was killed by the IDF last night:\nWith Qassem Soleimani (commander of the Quds force in the Iranian Revolutionary Guards who was eliminated in 2020)\nWith Esmail Qaani, who replaced Qassem Soleimani and... \nwatching over the territory of Israel (looking over Kiryat Shmona).", "location": "LEBANON", "classification": "security", "score": 0.9478595626641414, "event_breakdown": "1. Hezbollah presents \"snapshots in the life\" of Taleb Abdullah, who was killed by the IDF last night.\n2. Hezbollah member, Taleb Abdullah, who was recently killed by the IDF, was photographed with Qassem Soleimani, the leader of the Iranian Revolutionary Guards' Quds force, who was assassinated in 2020.\n3. Hezbollah member, Taleb Abdullah, was also photographed with Esmail Qaani, the current leader of the Iranian Revolutionary Guards' Quds force, who was appointed by Iranian leader Ali Khamenei to replace Qassem Soleimani and was photographed overlooking the territory of Kiryat Shmona, Israel."}, {"id": "b7c763d2-27a9-4d4b-b2c5-21001819881a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28799/", "date": "2024-06-12 14:17", "message": "The Shahab news agency (affiliated with Hamas) is advertising how desperate the residents of the northern Gaza Strip: all they have to eat is hummus and beans from cans, which they heat on a barbeque...", "location": "The main event takes place in the Gaza Strip.", "classification": "security", "score": 0.935829539387114, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n1. Israel-Gaza Border Conflict (ongoing since March 30, 2018): A large-scale military confrontation between Israel and Hamas, a Palestinian Islamist organization. The hostilities are taking place along the Gaza-Israel border, with rockets launched by militants in Gaza and Israeli airstrikes on the Gaza Strip.\n2. Syria and Iraq: The United States has launched a new round of airstrikes against the terrorist group ISIS in Syria, which is the largest operation against the group since they lost the territory they once controlled in the region.\n3. Somalia: At least six people were killed after a suicide car bomb exploded at a military checkpoint in the Somali capital, Mogadishu, police said. The attack is believed to have been carried out by al-Shabab extremists.\n4. Nigeria: As many as 150 students are feared missing after gunmen attacked a boarding school in the northwestern Nigerian state of Niger. The attackers stormed the school and took students away in vehicles.\n5. Guinea-Bissau: At least one person has been killed and more than a dozen injured after an explosion rocked a military base in the capital, Bissau. The government is investigating the incident, which occurred during a surprise check by the chief of staff of the army.\n\nNote: These events are ongoing and were reported within the current time frame, therefore they can be placed on a map."}, {"id": "3ae6f953-290d-4707-bead-68925dc19021", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28796/", "date": "2024-06-12 10:10", "message": "Hezbollah announces another death in its ranks:\n\nBehij Hegazi from the village of Hariss in southern Lebanon.\n\nHe was injured a few days ago in an IDF attack and died of his wounds today.\n\nNumber 344", "location": "Lebanon", "classification": "security", "score": 0.925781881825276, "event_breakdown": "Hezbollah announces another death in its ranks:\n\nHezbollah announces another death in its ranks:\n\n* In the IDF attack, Behij Hegazi from the village of Hariss in southern Lebanon was injured a few days ago and died of his wounds today.\n\nNumber 344"}, {"id": "6f3d4c06-85b1-49b6-a973-539622cec8fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28795/", "date": "2024-06-12 10:09", "message": "IDF Spokesperson: Following the sirens that sounded in the area of Zar'it in northern Israel a short while ago, approximately 10 projectiles were identified crossing from Lebanon, a number of which were intercepted. No injuries were reported. IDF artillery struck the sources of the fire. \n\nFollowing the projectiles that were fired toward northern Israel earlier today, Israel Fire and Rescue Services are currently operating to extinguish the fires that broke out as a result of the launches. \nNo injuries were reported in the incidents.\n\nFollowing the sirens that sounded regarding a hostile aircraft infiltration in northern Israel, the details are under review. \n\nA short while ago, IAF fighter jets struck a launcher used to fire projectiles from the area of Hanine in southern Lebanon into northern Israel earlier today (Wednesday). Simultaneously, four terrorist infrastructure sites in the area of Yater, from which projectiles were fired at northern Israel, were also struck.", "location": "Lebanon is the location that accurately represents the main focus of the event.", "classification": "security", "score": 0.9498725334208817, "event_breakdown": "IDF Spokesperson: Firing of ten projectiles from Lebanon into Israel; IDF artillery strikes sources of fire; no injuries reported\n\nIsrael Fire and Rescue Services are operating at sites where fires broke out from launches; no injuries reported\n\nDetails under review for reported hostile aircraft infiltration in northern Israel\n\nIDF fighter jets strike launcher used to fire projectiles near Hanine, strike four terrorist infrastructure sites in Yater area; no injuries reported"}, {"id": "ed37a1de-aa63-4cac-adab-e0a37b34876c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28793/", "date": "2024-06-12 10:07", "message": "Since this morning, Hezbollah has accepted responsibility for 9 attacks against Israel, including 4 for the elimination of the senior officer yesterday in Jouaiyya. So far, according to Hezbollah's statement, they are:\n\n1. Attacking the Pelsan Lighting factory in Kibbutz Sasa with guided missiles\n2. Attacking a base of the Galilee Division in Ami'ad with dozens of Katyushas\n3. Attacking the air control unit base in Miron with dozens of Katyushas\n4. Attacking the Ein Zikim base with dozens of Katyushas", "location": "Galilee", "classification": "security", "score": 0.8568654642445366, "event_breakdown": "5. Attacking a military vehicle in Avivim with ATGM\n6. Attacking a military vehicle in Har Dov with ATGM\n7. Attacking a military bus near Avivim with ATGM\n8. Attacking a military vehicle near Shebaa with ATGM\n9. Attacking the Israeli military headquarters in the village of Abu Tawil\n10. Attacking a building in the Shebaa farms with ATGM\n11. Attacking a military vehicle near Shebaa with ATGM\n12. Attacking a military vehicle in Shebaa with ATGM"}, {"id": "09018b6a-d676-4e93-a8a7-9646af606bde", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28792/", "date": "2024-06-12 10:04", "message": "Plan for \"the day after\" in Gaza:\nIsrael will give control of the Gaza Strip to the only supplier it will authorize to bring in cigarettes... he will have full control of the Gaza Strip!\n\nCigarettes are power and money in the Strip.", "location": "Gaza", "classification": "security", "score": 0.9132644934173902, "event_breakdown": "Target event not found"}, {"id": "2650c3f2-09b8-49df-aec0-12455724fa68", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28813/", "date": "2024-06-12 19:56", "message": "UNRWA's media advisor complains:\nHunger is spreading in an unprecedented manner in the southern Gaza Strip.\nFamine in the north of the Gaza Strip and in the south has become a reality.\nThe humanitarian aid mechanism in the Gaza Strip is facing collapse due to the prevention of the introduction of the necessary aid to the Gaza Strip.", "location": "Gaza Strip", "classification": "security", "score": 0.9344852198246628, "event_breakdown": "Hunger spreading in an unprecedented manner in the southern Gaza Strip;\n\nHumanitaian aid mechanism in the Gaza Strip is facing collapse due to the prevention of the introduction of the necessary aid to the Gaza Strip."}, {"id": "3abeda5c-9f8a-4b4e-b479-69939b941669", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28811/", "date": "2024-06-12 18:40", "message": "Hezbollah reveals details about Taleb Abdullah, the senior official who was killed last night in an IDF attack in Juya in southern Lebanon:\n\nBorn in 1969.\n\nJoined Hezbollah in 1984.\n\nFought in Bosnia \"in defense of the Muslims\" in 1992-1994.\n\nFought in Syria in the civil war \"against the terrorist organizations\" in the Syria-Lebanon border area.\n\nIn the current war, he led the operations against Israel in the eastern part of southern Lebanon, near the Syria-Lebanon border.\n\nWon Nasrallah's award of recognition several times.", "location": "Syria", "classification": "security", "score": 0.9625055474254348, "event_breakdown": "Hezbollah reveals details about a senior official who was killed last night in an IDF attack in Juya in southern Lebanon. The target event of security is the IDF attack in Juya in southern Lebanon."}, {"id": "f1c5e25b-ab54-44f3-928e-564fb6aeeccb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28809/", "date": "2024-06-12 16:33", "message": "Gaza sources: Muhammad Nazmi Nassar, one of the founders of the military wing of Hamas in the West Bank, was killed in an Israeli attack in the Gaza Strip.\n\nNassar played a central role in the kidnapping and murder of the two soldiers Avi Sasportas and Ilan Saadon in 1989 and was an associate of Mahmoud al-Mabhouh, the senior in the military wing of Hamas who was killed in an operation attributed to a \"group of tennis players\" in Dubai in 2010.\n(Al-Mabhouh was also involved in the kidnapping and was killed in Dubai on the grounds of being Hamas's \"military procurement man\" abroad).", "location": "GAZA STRIP", "classification": "security", "score": 0.9962793316670624, "event_breakdown": "Gaza"}, {"id": "22432075-bef3-4094-940c-9446dd0a383e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28806/", "date": "2024-06-12 15:28", "message": "US Secretary of State Blinken: \n\n\"Hamas could have responded to Biden's proposal with one word - yes.\nHamas demands changes to the proposal. Some of them can be accepted and some not.\" \n\nSenior Hamas official, Osama Hamdan, in response:\n\n\"The US Secretary of State Blinken is part of the problem and not part of the solution.\"", "location": "Gaza", "classification": "security", "score": 0.6878363454081321, "event_breakdown": "US Secretary of State Blinken:\n\n\"Hamas could have responded to Biden's proposal with one word - yes.\nHamas demands changes to the proposal. Some of them can be accepted and some not.\"\n\nSenior Hamas official, Osama Hamdan, in response:\n\n\"The US Secretary of State Blinken is part of the problem and not part of the solution.\""}, {"id": "fe8388e8-9a36-45fe-8bc0-9e1fcf08de7f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28798/", "date": "2024-06-12 14:16", "message": "Hashim Safi al-Din, number 2 in Hezbollah, at a ceremony in honor of the Hezbollah leader Taleb Abdullah, who was killed last night.\nThe ceremony was held in the Dahiyeh neighborhood of Beirut.", "location": "Beirut, Lebanon", "classification": "security", "score": 0.908741790909705, "event_breakdown": "Hashim Safi al-Din, the number 2 in Hezbollah, attended a ceremony in the Dahiyeh neighborhood of Beirut in honor of the Hezbollah leader Taleb Abdullah, who was killed the previous night."}, {"id": "74a14d06-dd38-4756-9c39-20e6f27c731d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28794/", "date": "2024-06-12 10:07", "message": "Beirut: Preparations are being made for a ceremony in honor of Taleb Abdullah, the senior commander of Hezbollah that Israel killed last night.", "location": "The ceremony honoring Taleb Abdullah is likely to be in Beirut, Lebanon.", "classification": "security", "score": 0.8686367765557044, "event_breakdown": "The event \"Beirut: Preparations are being made for a ceremony in honor of Taleb Abdullah, the senior commander of Hezbollah that Israel killed last night\" can be mapped as:\n\nEvent: Ceremony in honor of Taleb Abdullah, senior commander of Hezbollah, killed by Israel last night.\nLocation: Beirut, Lebanon."}, {"id": "9de94fd4-6ea2-4e02-9bc3-980c2d4bc784", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28822/", "date": "2024-06-12 21:42", "message": "From the funeral of senior Hezbollah military commander Taleb Abdullah, this evening in Aadchit in southern Lebanon.\n\nThe funeral took place without any particular disturbances...", "location": "Lebanon", "classification": "security", "score": 0.956964364809157, "event_breakdown": "Funeral of senior Hezbollah military commander Taleb Abdullah in Aadchit, southern Lebanon."}, {"id": "03af8ccf-7c8a-4a11-a5cc-2736b32b06fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28821/", "date": "2024-06-12 21:40", "message": "UNRWA's media advisor complains:\n\nHunger is spreading unprecedentedly in the southern Gaza Strip. Famine in both the north and south of the Gaza Strip has become a reality. The humanitarian aid mechanism in the Gaza Strip is facing collapse due to the prevention of necessary aid from entering the area.", "location": "Gaza Strip", "classification": "security", "score": 0.9307840522023556, "event_breakdown": "Remove uneccery words like \"unprecedentedly\" and \"unsustainable\"\n* Hunger is spreading in the south of the Gaza Strip. * Famine in both the north and south of the Gaza Strip has become a reality. * The humanitarian aid mechanism in the Gaza Strip is facing collapse due to the prevention of necessary aid from entering the area."}, {"id": "36cd15f5-61c0-4341-be3a-0f919b18b4b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28820/", "date": "2024-06-12 21:39", "message": "The subway in New York: a man wearing a Hezbollah shirt and a headband of the PFLP, a Palestinian terrorist organization, makes a threatening gun-shaped gesture with his hand.", "location": "NEW YORK", "classification": "security", "score": 0.8921986583793149, "event_breakdown": "Man in a Hezbollah Shirt and headband of PFLP a terrorist threaten in New York"}, {"id": "6f3bd431-4338-4a2f-bdc3-05c1a4ee4f09", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28814/", "date": "2024-06-12 19:57", "message": "From the funeral of senior Hezbollah Taleb Abdullah this evening in southern Lebanon.\nThere were no particular disturbances...", "location": "Lebanon", "classification": "security", "score": 0.9520972760958027, "event_breakdown": "Event 1: Funeral of Taleb Abdullah in southern Lebanon\nEvent 2: Push reporting that there were no particular disturbances at the funeral of Taleb Abdullah"}, {"id": "7a736250-2f20-4bd9-8474-f06cbaa0d4e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28810/", "date": "2024-06-12 17:03", "message": "Gazans criticize Hamas for hiding the hostages in the heart of a civilian area\n\nA Gazan resident, not afraid to show his face, criticizes the leadership of Hamas for hiding the Israeli hostages in a densely populated area in Nuseirat - thereby causing the death of hundreds of civilians.\n\nAccording to him, hiding in such a way among civilians is un-Islamic, and un-patriotic.\n\nHe adds: \"This is not the way of the resistance... get us out of this nightmare... we are tired\"", "location": "like quotes.\nBased on the information provided, the main focus of the event appears to be 'Nuseirat'.", "classification": "security", "score": 0.9193536526575292, "event_breakdown": "Gaza resident criticizes Hamas for hiding hostages in densely populated areas in Nuseirat and causing the death of hundreds of civilians."}, {"id": "bc3bbc83-b0af-47dd-af25-e704117de035", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28797/", "date": "2024-06-12 14:14", "message": "Hamas sends its condolences to Hezbollah, in an official announcement, following the assassination of senior leader Taleb Abdullah last night.", "location": "Lebanon", "classification": "security", "score": 0.7731083963476959, "event_breakdown": "Hamas sends its condolences to Hezbollah, in an official announcement, following the assassination of senior leader Taleb Abdullah last night.\nHamas sends its condolences to Hezbollah, in an official announcement, following the assassination of senior leader Taleb Abdullah last night."}]