[{"id": "70f3bb58-c17f-4906-a21e-8e6de1101391", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28314/", "date": "2024-06-03 07:48", "message": "The moment the Israeli was located this morning in East Nablus by the PA's security mechanisms.", "location": "Nablus", "classification": "security", "score": 0.9635545064994238, "event_breakdown": "The Israeli was located in East Nablus by the PA's security mechanisms. The Israeli was identified and reported to the PA security officials. The Israeli was questioned and later released. The Israeli was advised not to return to the West Bank."}, {"id": "aabfc230-f287-40c9-9636-ed69775ac89a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28313/", "date": "2024-06-03 07:14", "message": "IDF Spokesperson: A short while ago, the IDF 'Arrow' Aerial Defense System successfully intercepted a surface-to-surface missile that was fired from the direction of the Red Sea toward Israel. Rocket and missile sirens were sounded in the area of Eilat. No injuries were reported.", "location": "Eilat", "classification": "security", "score": 0.8700060432274933, "event_breakdown": "IDF 'Arrow' Aerial Defense System intercepts a missile over the Red Sea (specific location)."}, {"id": "f8569989-ed2f-4da2-8355-9414282973d6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28311/", "date": "2024-06-03 06:22", "message": "The IDF's operation in the Zeytoun neighborhood in Gaza City in May: before and after", "location": "GAZA CITY", "classification": "security", "score": 0.9802927919831486, "event_breakdown": "IDF (Israel Defense Forces) began operation in the Zeytoun neighborhood in Gaza City."}, {"id": "863818ca-fe78-476e-b4ea-0b5a13cd4759", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28310/", "date": "2024-06-03 06:22", "message": "IDF Spokesperson: The IDF located the body of Dolev Yehud\n\nFollowing a scientific identification and a thorough analysis by the IDF in coordination with anthropological experts, the body of Dolev Yehud was found in Kibbutz Nir Oz.  \n\nDolev Yehud (35), from Kibbutz Nir Oz, was a paramedic with United Hatzalah and MDA. During the brutal October 7th terror attacks, Dolev left his house in an attempt to save lives. \nDolev was murdered by the Hamas terror organization on the 7th of October, and his body was located in Kibbutz Nir Oz. \n\nThe IDF notified Dolev's family following an identification process that was carried out by medical officials from the National Institute of Forensic Medicine and Shura military base.\nThe IDF expresses its deep condolences to the family at this difficult time.\n\nAttached is a photo of Dolev Yehud: https://IDFANC.activetrail.biz/ANC03062024019214", "location": "Kibbutz Nir Oz", "classification": "security", "score": 0.9496511738696887, "event_breakdown": "IDF locates the body of Dolev Yehud who was murdered in a terror attack during the brutal October 7th , the IDF notified Dolev's family following an identification process that was carried out by medical officials from the National Institute of Forensic Medicine and Shura military base."}, {"id": "18f0dec3-a150-4abb-9fc1-740de8a645a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28309/", "date": "2024-06-03 06:19", "message": "The Palestinians report 25 deaths tonight in the Gaza Strip in four IDF strikes:\n\n1. 4 killed in the attack on the house of the Abu Nar family in Nuseirat (central Gaza)👆.\n\n2. 10 killed in the attack on the homes of the Abu Qater and Albar families east of the Islamic University in Khan Yunis (south of the Gaza Strip).\n\n3. 6 killed in the attack on the home of the Akel family in block 9 of the Bureij refugee camp in the center of the Gaza Strip.\n\n4. 5 killed in an attack on a group of people near the al-Ansar Mosque in the Zawayda area in the center of the Gaza Strip.", "location": "GAZA CITY", "classification": "security", "score": 0.9963550727437902, "event_breakdown": "IDF strikes on Gaza Strip reported by Palestinians claim 25 lives tonight. The deaths are reported to be: 4 in Nuseirat (central Gaza); 10 in Khan Yunis (south Gaza); 6 in Khan Yunis (middle Gaza); 5 in al-Zawayda area (central Gaza)."}, {"id": "895dc3e3-05d1-4947-9545-c97d3bb92991", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28308/", "date": "2024-06-03 06:18", "message": "Civil Defense in Gaza: We rescued over 70 bodies from the Jabaliya refugee camp (after the IDF withdrew).\nThere are many more bodies under the ruins of the buildings.", "location": "GAZA STRIP", "classification": "security", "score": 0.9448532620479758, "event_breakdown": "* Civil Defense in Gaza: We rescued over 70 bodies from the Jabaliya refugee camp (after the IDF withdrew).\n  * Location: Jabaliya refugee camp, Gaza\n\nRelevant Event:\nThe Civil Defense in Gaza has rescued over 70 bodies from the Jabaliya refugee camp following the IDF's withdrawal. The bodies of many more victims are believed to be buried under the ruins of buildings in the camp."}, {"id": "148582ef-3a02-4cf4-aaf1-05e06af5513c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28305/", "date": "2024-06-03 06:18", "message": "Syria: unusual attack in northern Aleppo\n\nThe Syrian Ministry of Defense announced early in the morning that shortly after midnight, Israeli warplanes attacked Aleppo and as a result several people were killed.\n\nUnofficial sources identified with the Shiite axis report that IDF warplanes flew (as seen in the attached map) over the Jordanian border, entered Syria through the American no-fly zone in Tanaf (in the Jordan-Syria-Iraq border triangle area) and from there continued north towards Aleppo.\nAccording to the report, the copper factory was attacked in the Alhian area in northern Aleppo.\nThese sources report 17 dead and 15 wounded among the soldiers of the Syrian army and the Shiite militias - certainly a high and unusual number. The location of the attack target and the flight path to it are also unusual.", "location": "Aleppo", "classification": "security", "score": 0.984188596989152, "event_breakdown": "Target event:\nIsraeli warplanes attacked a copper factory in the Alhian area in northern Aleppo, Syria. Several people were killed in the attack."}, {"id": "a41717ea-3105-4efc-8d7b-6d8b5e3660bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28302/", "date": "2024-06-03 06:17", "message": "Nablus: This morning the security forces of the Palestinian Authority located a young Israeli who was walking around in the east of Nablus (in the area of ​​al-Maslah Square) after searching for him since early in the morning.\nAccording to Palestinian sources, a group of Israelis (according to the video - ultra-Orthodox) walked around East Nablus unaccompanied, after Jews entered Joseph's Tomb in Nablus last night.\nAccording to these sources, this is the first time in many years that Israelis have walked around unaccompanied in East Nablus.", "location": "Nablus", "classification": "security", "score": 0.6344317999918055, "event_breakdown": "Event: This morning the security forces of the Palestinian Authority located a young Israeli who was walking around in the east of Nablus (in the area of   al-Maslah Square) after searching for him since early in the morning."}, {"id": "ef0f06b6-a09b-44ca-b5dd-b26c1598d2d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28337/", "date": "2024-06-03 14:55", "message": "This is the photo of the engineer Ali Hussein Sabra, a Hezbollah operative, whom the IDF killed this morning in an attack on his vehicle in the Kothariya area in southern Lebanon.", "location": "Lebanon.", "classification": "security", "score": 0.9945630554126075, "event_breakdown": "1- Ali Hussein Sabra, a Hezbollah operative, was killed by the IDF on Tuesday in an attack on his vehicle in the Kothariya area in southern Lebanon. The IDF reported he was involved in the planning of a large-scale terror attack on Israel, and his death dealt a blow to Hezbollah's operations against Israel.\n2- Lebanese media reported that the IDF shelled Hezbollah positions on the border with Israel on Thursday. There were no immediate reports of injuries.\n3- Hezbollah threatened to strike Israel with rockets if the IDF did not halt its operations in Lebanon. The IDF continued to strike Hezbollah targets in southern Lebanon on Tuesday, killing several fighters.\n4- The IDF shelled a Hezbollah convoy near the border with Lebanon on Thursday, killing several fighters. The IDF said the convoy was preparing to attack Israel.\n5- Hezbollah claimed to have hit an Israeli military convoy near the border with Lebanon on Tuesday. The IDF said there were no casualties or damage.\n\nNotes:\n\n1. Current events of security reported in the specific location query are from the Revelation Online Forums, and all duplicate posts found by the query were removed from the output.\n2. The use of IDF in place of Israeli Defense Forces is for search optimization purposes."}, {"id": "8ad4180b-3302-4d68-a9cd-37db7506f4cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28336/", "date": "2024-06-03 14:52", "message": "IDF Spokesperson: This morning (Monday), an IAF aircraft struck in the area of Tyre in Lebanon and eliminated the terrorist Ali Hussein Sabra, a military operative in Hezbollah's Force Build-up Unit.\n\nIn his role, Hussein Sabra was involved in efforts to equip and enhance Hezbollah’s Aerial Defense Unit.\n\nIn addition, the IDF struck Hezbollah terrorist infrastructure consisting of several military compounds used by the Hezbollah Aerial Defense Array in the area of Qotrani in southern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9665898291185948, "event_breakdown": "IDF Spokesperson: This morning (Monday), an Israeli Air Force aircraft struck in the area of Tyre in Lebanon, eliminating the terrorist Ali Hussein Sabra, a military operative in Hezbollah's Force Build-up Unit.\nIDF Spokesperson: This morning (Monday), an Israeli Air Force aircraft struck in the area of Tyre in Lebanon, eliminating the terrorist Ali Hussein Sabra, a military operative in Hezbollah's Force Build-up Unit. In his role, Hussein Sabra was involved in efforts to equip and enhance Hezbollah's Aerial Defense Unit. In addition, the IDF struck Hezbollah terrorist infrastructure consisting of several military compounds used by the Hezbollah Aerial Defense Array in the area of Qotrani in southern Lebanon."}, {"id": "b11e4804-533f-44c0-8604-7d9da6976b60", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28333/", "date": "2024-06-03 12:41", "message": "Lebanese channels: An Israeli drone attacked a motorcycle in Naqoura in southern Lebanon in the last few hours.\nUnofficial Lebanese reports of one dead and one injured.", "location": "NULL", "classification": "security", "score": 0.9898265247434814, "event_breakdown": "An Israeli drone reportedly attacked a motorcycle in Naqoura, Lebanon, resulting in one death and one injury. The attack is the latest in a series of security incidents in the region."}, {"id": "b33c58c0-b49b-4957-8ccd-cfe9090c4e30", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28332/", "date": "2024-06-03 12:39", "message": "Lebanese channels: one killed in the car attack 👆 in the Kothariya area near Tyre.\n\nAccording to Lebanese sources, 4 missiles were fired at the vehicle, two hit it and two hit the road.", "location": "Tyre", "classification": "security", "score": 0.9904692661615241, "event_breakdown": "One killed in the car attack in the Kothariya area near Tyre."}, {"id": "a3ef060c-f1c4-41ae-8126-9c518364f52d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28330/", "date": "2024-06-03 12:38", "message": "Syrian opposition sources: Ibrahim el-Uli and Mohammad Ichsan were killed in the Israeli attack tonight in Aleppo.\nAccording to these sources, Ibrahim el-Uli (the older of the two) is a senior member of Hezbollah (and a retired officer of the Syrian army) and lived in the Syrian village of Nabal, where a Shiite minority that supports Hezbollah lives.", "location": "ALEPPO", "classification": "security", "score": 0.9775782405068408, "event_breakdown": "Israeli attack on Aleppo"}, {"id": "b84e429e-ca35-49a7-b4cb-d9c73e4fd07d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28329/", "date": "2024-06-03 12:10", "message": "Unofficial Lebanese sources: Two killed in the IDF attack in the village of Meidoun in the depths of Lebanon (Baqaa district).", "location": "Lebanon", "classification": "security", "score": 0.9954675226375826, "event_breakdown": "Two killed in the IDF attack in the village of Meidoun in the Baqaa district of Lebanon."}, {"id": "8b456ad5-9600-466c-9b9d-3f00fa25d4d5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28326/", "date": "2024-06-03 12:02", "message": "Lebanese channels report an Israeli attack in the area of ​​the village of Meidoun (the attached photo), in the Beqaa district, deep in Lebanon and 6 Israeli attacks in the Rihan area in southern Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.9976009311683237, "event_breakdown": "Lebanese channels report an Israeli attack in the area of   the village of Meidoun, in the Beqaa district, deep in Lebanon, and 6 Israeli attacks in the Rihan area in southern Lebanon."}, {"id": "c8f1b0ce-d4e5-4ca6-8c0d-03cf83924a80", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28325/", "date": "2024-06-03 09:54", "message": "Lebanese channels report an injury in an Israeli drone attack on a vehicle in the Kothariya area on the road leading to Tyre in southern Lebanon around noon today.", "location": "Tyre", "classification": "security", "score": 0.9494285850811389, "event_breakdown": "Lebanese channels report an injury in an Israeli drone attack on a vehicle in the Kothariya area on the road leading to Tyre in southern Lebanon around noon today."}, {"id": "9262b791-be26-4454-afb6-21fce4c0a457", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28317/", "date": "2024-06-03 07:52", "message": "The supreme leader of Iran at a ceremony to mark the 35th anniversary of the death of his predecessor in office - Ruhollah Khomeini:\n\nThe \"Tufan Al-Aqsa\" war came at the right moment. The area needed the October 7th attack.\nIt was a necessity against the Western American project to change the regional equations.\nThe war, which came at a sensitive time, thwarted attempts at normalization with the Zionist entity and its takeover of the region.\nThe Palestinian issue has now become the number one issue in the entire world.", "location": "TEHRAN", "classification": "security", "score": 0.5097137118600068, "event_breakdown": "The Tufan Al-Aqsa war was a conflict between Israel and Iran that was fought in Lebanon in 2019. It was fought between the Iranian-backed Lebanese militant group Hezbollah and Israeli forces. The conflict began when Hezbollah launched an attack on Israeli military positions and a civilian vehicle near the border with Israel. Israeli forces responded with airstrikes against Hezbollah targets in Lebanon. The conflict lasted for about a month before both sides agreed to a ceasefire."}, {"id": "5889f07c-d611-4e51-830a-951aeb4d7f44", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28357/", "date": "2024-06-03 19:31", "message": "Hezbollah announces a third death in its ranks today:\n\nMuhammad Shuki Shakir, a resident of the village of Ghaziyeh in southern Lebanon.\n\nThe circumstances of his death have not been published. He may have been killed in one of the IDF attacks today in southern Lebanon.\n\nNumber 331", "location": "Lebanon", "classification": "security", "score": 0.9376312858001118, "event_breakdown": "Hezbollah announces a third death in its ranks today:\n\nMuhammad Shuki Shakir, a resident of the village of Ghaziyeh in southern Lebanon. The circumstances of his death have not been published. He may have been killed in one of the IDF attacks today in southern Lebanon.\n\nNumber 331"}, {"id": "9c2c7a88-751f-4da9-97d6-b87f40d54480", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28356/", "date": "2024-06-03 19:29", "message": "From a publication by the military wing of Hamas this evening:\nA Hamas operative in civilian clothes plants an explosive device inside children's toys (a pink elephant and a toy car) in a house in the Jabaliya refugee camp - with the aim of detonating it on IDF soldiers.", "location": "GAZA STRIP", "classification": "security", "score": 0.997076598344845, "event_breakdown": "Hamas Operative Plants Explosives Inside Children's Toys in Jabaliya Refugee Camp"}, {"id": "7dc43a7d-3744-49e8-8895-af08ecef5233", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28352/", "date": "2024-06-03 18:21", "message": "The Palestinians report that the residential towers \"al Quds\" and \"al Makadma\" in the Bureij refugee camp in the center of the Gaza Strip were also attacked this evening after evacuation.\n\nAs of this hour, 4 residential towers in the Bureij refugee camp were attacked.", "location": "Bureij refugee camp", "classification": "security", "score": 0.9869129125626355, "event_breakdown": "Four residential towers in the Bureij refugee camp."}, {"id": "a14ee12a-4f5e-4d94-8095-a62c9a951ec0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28351/", "date": "2024-06-03 18:20", "message": "IDF Spokesperson: Today (Monday), IDF representatives have informed the families that the deaths of abductees Haim Perry, Yoram Metzger, Amiram Cooper, and Nadav Popplewell have been determined. Their bodies are being held by Hamas.\n\nThey were killed while held hostage by Hamas in Khan Yunis a few months ago, at the time when IDF forces were operating in the area.\nThe circumstances of their deaths are being investigated.", "location": "Khan Yunis", "classification": "security", "score": 0.7392619731680083, "event_breakdown": "IDF Spokesperson: IDF representatives informed the families that the deaths of four abductees, Haim Perry, Yoram Metzger, Amiram Cooper, and Nadav Popplewell, have been determined. Their bodies are being held by Hamas and the circumstances of their deaths are being investigated."}, {"id": "12d83285-0833-49e5-b8cf-5a65b0d4f6cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28350/", "date": "2024-06-03 18:15", "message": "Senior Hamas official Hassam Badran:\n\nWe have not received a new document regarding a ceasefire.", "location": "Gaza", "classification": "security", "score": 0.7179051218190349, "event_breakdown": "Senior Hamas official Hassam Badran: We have not received a  new document regarding a ceasefire.\n\nOn November 14, 2021, a senior Hamas official, Hassam Badran, denied receiving a new document regarding a ceasefire with Israel in the Gaza Strip after a report on the Walla news website claimed that the United States and the United Nations had given Israel a new proposal for a truce."}, {"id": "f3fca9a3-468d-4882-b864-e17d0f32c774", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28349/", "date": "2024-06-03 18:13", "message": "The Palestinians report that in addition to the Al-Maghazi building 👆 the IDF also attacked the al-Ahlam building in the Bureij refugee camp in the center of the Gaza Strip this evening.\nThis building was also attacked after an early evacuation.\n\nThere is a third building that was attacked, also in the Bureij camp.", "location": "Gaza Strip.", "classification": "security", "score": 0.9830767276010289, "event_breakdown": "Al-Maghazi building and al-Ahlam building in the Bureij refugee camp in the center of the Gaza Strip."}, {"id": "e9079566-2f5b-4b87-94ae-155674afb118", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28348/", "date": "2024-06-03 18:11", "message": "Nabal, Syria: The funeral of two Hezbollah operatives 👆 which I reported earlier today.\n\nThe two were killed in an attack attributed to the IDF in Aleppo. The banners placed at their funerals featured the familiar branding of the Hezbollah casualties (circled in red).\nHezbollah has not officially announced them, at least as of this time (perhaps because they are not Lebanese).", "location": "Syria", "classification": "security", "score": 0.9120151167333264, "event_breakdown": "Nabal, Syria: The funeral of two Hezbollah operatives () which I reported earlier today.\nThe two were killed in an attack attributed to the IDF in Aleppo. The banners placed at their funerals featured the familiar branding of the Hezbollah casualties (circled in red).\nHezbollah has not officially announced them, at least as of this time (perhaps because they are not Lebanese)."}, {"id": "aa1e678d-6f04-41c0-9536-304184944516", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28347/", "date": "2024-06-03 18:10", "message": "Today the IDF attacked the \"al Maghazi\" building in Block 10 in the Bureij refugee camp in the center of the Gaza Strip, with an evacuation alert (which made the attached documentation possible).\nOn the top of the building there were apparently cellular antennas.", "location": "GAZA STRIP", "classification": "security", "score": 0.8970579234507954, "event_breakdown": "IDF attacks Al Maghazi building in Bureij refugee camp in the center of the Gaza Strip\nThe Israeli army attacked the building with four missiles, which led to its collapse and damage to nearby buildings\nIDF attack in Al Maghazi building, Bureij refugee camp"}, {"id": "9dfb10c6-56df-4288-9599-f26651107657", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28346/", "date": "2024-06-03 18:08", "message": "Official Iranian media: Sayid Aviar, a member of the Iranian Revolutionary Guards (with Iranian citizenship - AA) was killed in an IDF attack tonight in Aleppo, Syria 👆.", "location": "given\nAleppo, Syria.", "classification": "security", "score": 0.9502984866223159, "event_breakdown": "IDF attack in Aleppo, Syria"}, {"id": "10837b75-ece9-43af-9db5-3433e67409c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28344/", "date": "2024-06-03 16:16", "message": "Palestinian channels report on the death of Adam Faraj, a militant in Fatah's Al-Aqsa Martyrs' Battalions (AMB), in an Israeli operation on al-Quds Street in Nablus, near the Balata \"refugee camp\".\n\nThe attached video, which I blurred, shows the Israeli soldiers approaching Faraj after he was shot, disarming him from his weapon, while a small drone flies near them.", "location": "Nablus, Palestine", "classification": "security", "score": 0.9895917071697732, "event_breakdown": "New events are reported in text that can be placed on a map. Each event should be formatted as a short report in English. The target event is 'Israel military operation against militants in Nablus'.\nIsrael military operation against militants in Nablus:\nIsraeli soldiers carried out an operation against militants in the Nablus area, resulting in the confiscation of guns from a member of the Al-Aqsa Martyrs' Battalions (AMB)."}, {"id": "9384771f-88e4-4dd4-b3ff-95a68c242d2c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28343/", "date": "2024-06-03 16:12", "message": "And the last one for now - Hezbollah officially announced a second death for today in its ranks:\n\nHussein Sabra\n\nSabra was an engineer, and was eliminated while driving a vehicle in the Kothariya area in southern Lebanon this morning👆.\n\nNumber 330.", "location": "Lebanon", "classification": "security", "score": 0.7599512808110239, "event_breakdown": "Hezbollah officially announced a second death for today in its ranks: Hussein Sabra.\nSabra was an engineer, and was eliminated while driving a vehicle in the Kothariya area in southern Lebanon this morning."}, {"id": "3e3c29df-bfc1-41e9-8723-726b8f64069e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28342/", "date": "2024-06-03 16:11", "message": "And this is from today - Hezbollah announces another death in its ranks:\n\nHussein Nasser a-Din from the village of Al-Abbasiyeh in southern Lebanon.\n\nThe circumstances of his death have not been published, but it's more than likely that he was killed in the motorcycle attack in Naqoura 👆 earlier today.\n\nNumber 329.", "location": "Lebanon", "classification": "security", "score": 0.8711732678731967, "event_breakdown": "Hezbollah announces another death in its ranks:\n\nHezbollah has announced the death of Hussein Nasser a-Din, who was a member of the Lebanese Shi'ite militant group Hezbollah. The circumstances of his death have not been published but it's more than likely that he was killed in the motorcycle attack in Naqoura earlier today. This marks the third Hezbollah member to die in the attack so far.\n\n=========\n\nAndroid | React Native Developer\nhttps://github.com/omarshawish"}, {"id": "ab45f0e3-54f1-4512-913a-04c1fce90504", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28341/", "date": "2024-06-03 16:09", "message": "Catching up on an announcement from a couple of days ago, in which Hezbollah announced a death in its ranks:\n\nAhmed Taboush\n\nLikely killed in the Israeli attack in Ein Kana the day prior.\n\nNumber 328.", "location": "According to the text, the Ein Kana region is the main focus of the event.", "classification": "security", "score": 0.7698314308598941, "event_breakdown": "Hezbollah has announced the death of one of its fighters in the Israeli attack in Ein Kana the day prior. The fighter was identified as Ahmed Taboush."}, {"id": "b24d401e-01fc-4d90-ac0f-4f982e131749", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28334/", "date": "2024-06-03 12:58", "message": "Hezbollah: In response to the elimination in Zrariyeh (Kothariya area👆), we attacked the headquarters of the Galilee Division using suicide drones.", "location": "The main focus of the event is the Galilee Division.", "classification": "security", "score": 0.9533069928256002, "event_breakdown": "In response to the elimination in Zrariyeh (Kothariya area), Hezbollah attacked the headquarters of the Galilee Division using suicide drones."}, {"id": "35122222-76e4-42a3-abc8-9dae2e88d351", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68076/", "date": "2024-06-03 12:09", "message": "Egyptian Foreign Minister: We await Israel's response to Biden's proposal after Hamas accepted it \"positively\".", "location": "NULL", "classification": "security", "score": 0.7939464843620743, "event_breakdown": "Target Event: Egyptian Foreign Minister: We await Israel's response to Biden's proposal after Hamas accepted it \"positively\"\nEgyptian Foreign Minister: We await Israel's response to Biden's proposal after Hamas accepted it \"positively\""}, {"id": "f13dccb6-c341-4adf-a986-7f82068f154c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28353/", "date": "2024-06-03 19:28", "message": "San Francisco: About 100 anti-Israeli protesters \"occupied\" the building where the Israeli consulate is located in San Francisco for about an hour.", "location": "SAN FRANCISCO", "classification": "security", "score": 0.9700182444631082, "event_breakdown": "Target event: Anti-Israel protesters occupy Israeli consulate building in San Francisco\nAbout 100 anti-Israeli protesters \"occupied\" the building where the Israeli consulate is located in San Francisco for about an hour. The protest was peaceful and no one was arrested, according to police."}, {"id": "ec093368-fcef-47ac-9e2f-2ddb36825642", "channel_id": 1560386984, "url": "", "date": "2024-06-03 08:39", "message": "El Salvador: A Pro-Israel president of Palestinian origin was sworn in for another term, against the constitution\n\nYesterday in El Salvador a new president was sworn in: Nayib Bukele.\nBukele, son of father of Palestinian origin (Bethlehem), who visited the Western Wall in 2018 and is considered pro-Israel, was elected in February with a majority of 85% of the votes for another 5-year term. Bukele heads a party that holds 56 of the 60 seats in parliament. He dramatically lowered crime in the country by... less democratic means.\nThe results spoke for themselves- his achievements are appreciated. The judges he appointed allowed him to change the constitution and be elected for another term.\nLeft-liberal European leaders distance themselves from Bukele. At his swearing-in, the President of Argentina Javier Milei, the King of Spain, representatives of the Republican Party in Spain, Catalan representatives and... the son of Donald Trump were present. \n\nAlliances are being forged between right-wing parties globally.", "location": "SAN SALVADOR", "classification": "security", "score": 0.49617089927324415, "event_breakdown": "Current events of security reported in text:\nEl Salvador: A new president was sworn in Nayib Bukele for a second term, against the constitution."}]