[{"id": "04e460ec-2193-4a06-9d86-d21fbf4f8ddd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29140/", "date": "2024-06-19 17:36", "message": "Nasrallah's speech: a series of threats in order to scare Israel from starting an all-out war in Lebanon\n\nThis evening, Nasrallah spoke for about an hour and a half at an event in honor of Taleb Abdullah, commander of al-Nasser unit in Hezbollah, whom Israel killed last week.\n\nHe dedicated the first part of the speech to the senior officer who passed away along with three of his close companions - the members of the senior command of al-Nasser unit. Nasrallah noted that the response to his assassination was powerful and was carried out mostly by al-Nasser unit to show that the elimination of its commander and senior commanders only strengthened its determination to fight.\nNasrallah points out that Taleb Abdullah was the most senior commander of Hezbollah who started the support system for the Gaza arena from Lebanon on October 8, 2023 and continued it until his last day.\n\nIn the second part of the speech, Nasrallah gradually builds up the threat towards Israel lest it start a war on Lebanon.\nHe points out that Hezbollah has more than 100,000 trained fighters at its disposal, which is more than what Hezbollah needs for an all-out war. According to him, Hezbollah rejected requests from companies in the resistance axis to send tens of thousands of fighters to Lebanon to help.\n\nNasrallah further declares that the campaign between the wars in which Israel tried to prevent weapons and ammunition from reaching Hezbollah through strikes in Syria failed and that everything that needed to arrive - arrived.\n\nNasrallah also pointed out that Hezbollah manufactures its own weapons in Lebanese territory and that it has a large number of UAVs.\nNasrallah announced that the enemy should be afraid of a war with Hezbollah and that the enemy knows why...\n\nAccording to Nasrallah the war will be in the air, at sea and on land and that the enemy will not be able to withstand it. According to him, the ships in the Mediterranean Sea will become targets, similar to what is happening in the Red Sea.\n\nAs mentioned, Nasrallah added a direct threat to the Cypriot government if it allows Israel to use its territory against Lebanon.\n\nNasrallah emphasizes that the internal arena in Lebanon, the Lebanese population and not only the Shiite population, supports Hezbollah and the continuation of the fighting for Gaza - according to him this is a very important factor that gives strength to the resistance and empowers it (in this context I look at the internal arena in Israel and in a mirror image according to Nasrallah he emphasizes the importance of internal unity in the nation in Israel - AA).\n\nNasrallah concludes his remarks by noting the fact that this is the most important war in the region since 1948. A historical battle that will change the face of the entire region and because of its importance he adds on the subject of \"the martyrs of the axis of resistance\": the blood that was spilled was spilled in the right place! (meaning they change history with their blood).\n\n##\nThere are lessons to be learned from Nasrallah in this speech, especially in regards to the last part of the speech:\n\n1. The historical importance he gives to the current war.\n2. The importance of the internal arena, specifically the civilian population, in strengthening the fighting force.\n\nIn addition, I will point out that if Nasrallah was not afraid of a war with Israel, he would not have tried so hard to threaten Israel in an attempt to prevent it.", "location": "Lebanon", "classification": "antisemitism", "score": 0.48787760256698387, "event_breakdown": "Israel's threats to Lebanon - Target of Nasrallah's speech"}]