[{"id": "d9eb8457-f6ad-429b-aafc-96a527cc9f3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26678/", "date": "2024-05-04 17:47", "message": "Palestinian channels report: The IDF attacked the home of the prominent journalist in the Gaza Strip, Hassan Aslih (Hamas-affiliated) in the Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip.\nThere were no casualties in the attack.", "location": "Khan Yunis in the Gaza Strip", "classification": "security", "score": 0.9953827602700771, "event_breakdown": "- IDF attacks home of journalist Hassan Aslih in Manara neighborhood, Khan Yunis, Gaza Strip\n- No casualties reported in the attack"}, {"id": "0cfe2fb5-4696-44ee-b9ee-bdba8a050119", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26677/", "date": "2024-05-04 17:31", "message": "Palestinian channels: The Palestinian Authority's security mechanisms detonated, in a controlled manner, explosive devices they located in Tubas (Northeastern Samaria).", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9948419961865298, "event_breakdown": "- Palestinian Authority's security mechanisms detonated explosive devices in Tubas (Northeastern Samaria)"}, {"id": "03da34fa-4a60-48e8-ae37-731764d136d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26676/", "date": "2024-05-04 17:20", "message": "Hamas-identified channels: All four killed (whose names have been published) 👆 in the IDF's activity in the village of Deir al-Ghusun in the north of Tulkarm, were operatives of the military wing of Hamas.\nAlaa Sharitah was the commander of the military wing of Hamas in Tulkarm.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9934812200416727, "event_breakdown": "- IDF activity in the village of Deir al-Ghusun, north of Tulkarm\n- Four Hamas operatives killed in the IDF activity\n- Alaa Sharitah identified as the commander of the Hamas military wing in Tulkarm"}, {"id": "11344959-ed02-4f07-b787-c0d6bcc2f3c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26675/", "date": "2024-05-04 17:19", "message": "Further to this👆\nA joint statement to the IDF spokesperson, the police spokesperson and the Shin Bet spokesperson:\n\nThe soldiers of Yamam, the IDF and the Shin Bet eliminated five terrorists who had barricaded themselves in a building in Tulkarm in a 12-hour battle\n\nThe soldiers of the Yamam, IDF and Shin Bet, under the precise intelligence guidance of the Shin Bet and IDF Intelligence, operated for over 12 hours in Tulkarm in a targeted activity to defeat a terrorist cell.\n\nThe soldiers closed in on a building where the terrorist squad was entrenched, which opened fire on them. The fighters responded by shooting with shoulder-fired missiles and other means from the building, and at the end of the exchange of fire, the five terrorists were eliminated.\nMilitary equipment and weapon parts were confiscated.\n\nDuring the activity, an IDF fighter was injured and brought to continue receiving medical treatment in a hospital; his family was informed.", "location": "Tulkarm", "classification": "security", "score": 0.9849329956770798, "event_breakdown": "- Joint operation by Yamam, IDF, and Shin Bet in Tulkarm\n- Elimination of five terrorists barricaded in a building in Tulkarm\n- 12-hour battle between security forces and terrorists in Tulkarm\n- Confiscation of military equipment and weapon parts\n- Injury of an IDF fighter during the operation, brought to a hospital for medical treatment with his family informed"}, {"id": "e18645d1-18ae-41f6-ab70-8e2c811a42b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26674/", "date": "2024-05-04 16:10", "message": "The Palestinians publish the names of four of the \"martyrs\" who were killed in the IDF operation tonight in the village of Deir el Ghusun in the north of Tulkarm:\n\n1. Alaa Sharith (the leftmost one).\n2. Tamer Fuqaha (next to Alaa' - both are behind the attack in which Elhanan Klein fell in November 2023. Tamer is also an operative of Erin al Aswad).\n3. Adnan Samara\n4. Asal Badran\n\nIn addition, there is the \"headless martyr\" who has not yet been identified - DNA tests will be conducted on him to confirm his identity.", "location": "Deir el Ghusun", "classification": "security", "score": 0.9791185685870558, "event_breakdown": "- Palestinians publish names of four \"martyrs\" killed in IDF operation in Deir el Ghusun: Alaa Sharith, Tamer Fuqaha, Adnan Samara, Asal Badran\n- \"Headless martyr\" killed in the operation, awaiting DNA test for identification"}, {"id": "b213384b-0f63-4966-b02e-a283f6a202b7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26673/", "date": "2024-05-04 15:36", "message": "The Palestinians report that the IDF forces have finished their activities in Deir al-Ghusun in the north of Tulkarm and have left.\nSources in Tulkarm say that the Palestinian rescue forces located another Palestinian \"martyr\" among the ruins, apparently headless.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9671169206516085, "event_breakdown": "- IDF forces finish activities in Deir al-Ghusun, north of Tulkarm and leave\n- Palestinian rescue forces find headless Palestinian \"martyr\" among the ruins in Tulkarm"}, {"id": "eee51a55-2ada-4c6f-9516-15075a7e35f2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26672/", "date": "2024-05-04 14:06", "message": "The Palestinians report that the person who came out from under the ruins of the house in Deir al-Ghusun and was arrested by IDF forces is the released prisoner Salma Badran, an operative of the military wing of Hamas with a \"heavy\" family lineage: he is the brother of the two \"martyrs\" of the wing - Fawaz and Seif Allah Badran. Salma is the owner of the apartment where the Hamas terrorists hid last night and which the IDF destroyed.\n\nFawaz (Salma's brother) was one of the senior bomb engineers of the Izz ad-Din al-Qassam Brigades in the West Bank and was the one who assembled the explosive device that exploded in the first suicide attack of the second intifada (March 2001), in which 3 Israeli citizens were killed in Netanya. Fawaz was also the one who recruited the suicide bomber for the attack and also guided other suicide bombers in Tulkarm. He was eliminated by the Israeli security forces that year using an explosive device planted in his car.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9989665591672134, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "a7707a7d-6337-4d9a-a51a-559f7927b10f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26671/", "date": "2024-05-04 14:00", "message": "The official Palestinian news agency Wafa: 6 Palestinians were killed in the IDF operation in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9664112263099419, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "16582c8e-e73e-41b4-832c-5c4cc67e3462", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26668/", "date": "2024-05-04 13:56", "message": "More footage from Deir al-Ghusun north of Tulkarm from the IDF operation today.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.5645468611123309, "event_breakdown": "- IDF operation in Deir al-Ghusun north of Tulkarm"}, {"id": "5dda7eae-79d2-40f3-b24b-1f1db11d8eaa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Palestinian sources in Tulkarm claim that Tamer Fuqaha, an operative of the military wing of Hamas, (and the terrorist who carried out the attack in which Elhanan Klein fell on November 2, 2023), was killed in an IDF operation tonight in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9920826670749956, "event_breakdown": "- Tamer Fuqaha, a Hamas operative responsible for an attack, was killed in an IDF operation in the village of Deir al-Ghusun north of Tulkarm."}, {"id": "25b4ab1a-0c63-4496-bf5d-cc305e4e33bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Deir al-Ghusun north of Tulkarm:\nThe IDF forces packed the body of the Palestinian who was killed in the area of ​​the building.\n\nPalestinian sources claim the IDF forces took 3 bodies.\n\nIDF forces then arrested a Palestinian who emerged from under the ruins of the house that the forces had besieged for many hours.", "location": "Tulkarm", "classification": "security", "score": 0.9879003899097348, "event_breakdown": "- IDF forces packed the body of a Palestinian killed in Deir al-Ghusun north of Tulkarm.\n- Palestinian sources claim IDF forces took 3 bodies from the area.\n- IDF forces arrested a Palestinian emerging from under the ruins of a house besieged for hours in the same area."}, {"id": "cba92b9a-91df-4c0e-a75a-d5f50f80fa18", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26661/", "date": "2024-05-04 13:10", "message": "The \"Holy Fire\" ceremony held today in the Church of the Holy Sepulcher in East Jerusalem as part of the \"Sabbath of Light\" that Christians celebrate today.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.7164941467590658, "event_breakdown": "- Holy Fire ceremony held in the Church of the Holy Sepulcher in East Jerusalem"}, {"id": "24137ffd-8e2e-4cf9-ae71-a18207001616", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26658/", "date": "2024-05-04 13:07", "message": "For nearly ten hours starting last night, IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm.\nAccording to the estimates, the terrorists Tamer Fakha and Alaa Sharitah, the operatives of the military wing of Hamas involved in the shooting attack in which Major General Elhanan Klein was killed near Beit Lid on November 2, 2023, were hiding in the house.\nSources associated with Hamas and Islamic Jihad operatives claim that the two managed to escape from the house which was surrounded by the IDF for many hours and fired upon by a large number of missles (and finally destroyed with a bulldozer - in the attached videos you can see the shooting and the demolition the house).", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9796365504234397, "event_breakdown": "- IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm\n- Terrorists Tamer Fakha and Alaa Sharitah, operatives of the military wing of Hamas involved in the shooting attack in which Major General Elhanan Klein was killed near Beit Lid on November 2, 2023, were believed to be hiding in the house\n- The two terrorists managed to escape from the surrounded house after being fired upon by a large number of missiles and the house was eventually destroyed with a bulldozer"}, {"id": "7572cd9f-3191-40e6-92d9-e484a3cfd2a5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26657/", "date": "2024-05-04 13:02", "message": "The Al Jazeera network claims: an Israeli drone launched a missile a few hours ago at a vehicle in Bint Jabil in southern Lebanon.\n\nUnofficial Lebanese sources: No casualties.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9652451684275815, "event_breakdown": "- An Israeli drone launched a missile at a vehicle in Bint Jabil, southern Lebanon according to Al Jazeera network.\n- Unofficial Lebanese sources reported no casualties in the incident."}, {"id": "6b382a2b-370f-443d-aa49-03aa4300b98d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26656/", "date": "2024-05-04 12:30", "message": "The Qatari Al Jazeera cites a report by Reuters according to which Qatar is considering closing the offices of the political office of Hamas in its territory as part of an overall plan to continue its function as a mediator in the conflict between Hamas and Israel.", "location": "Qatar", "classification": "security", "score": 0.9065846889429762, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "ecb128b9-ed5e-4e9a-8ac1-25369b9de481", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26655/", "date": "2024-05-04 12:29", "message": "At least 3 different Israeli military reporters publish the exact same message:\n\nPolitical actor:\n\nContrary to the publications, Israel will under no circumstances agree to the end of the war as part of an agreement to release our abductees.\n\nAs the political echelon decided, the IDF will enter Rafah and destroy the remaining Hamas battalions there - whether or not there will be a temporary respite for the release of our hostages.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.6696081489195264, "event_breakdown": "- Three Israeli military reporters publish the same message regarding Israel's stance on ending the war and releasing abductees.\n- Political decision made for IDF to enter Rafah and destroy Hamas battalions regardless of the potential temporary respite for hostage release."}, {"id": "70745347-1155-44fb-a924-c9218cf14309", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26653/", "date": "2024-05-04 12:27", "message": "Today, Lebanese sources report: Hezbollah will soon submit its comments to the French proposal to end the war in southern Lebanon\n\nJournalist sources in Lebanon state that Hezbollah and the Amal movement discussed the French proposal and decided not to reject it (so as not to be perceived as refusers - AA) but to submit 10 comments to amend the proposal.\nThe comments will be forwarded to the Speaker of the Lebanese Parliament (who happens to also be the head of the Amal Shiite movement fighting alongside Hezbollah in southern Lebanon - AA) and he will discuss them with Prime Minister Mikati and forward them to the French side.", "location": "Lebanon", "classification": "security", "score": 0.9143945024805114, "event_breakdown": "- Hezbollah will soon submit comments on the French proposal to end the war in southern Lebanon\n- Hezbollah and the Amal movement discussed the French proposal and decided to submit 10 comments to amend it"}, {"id": "1093e3f6-0e8a-48f1-980a-6765ec2cadb0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26652/", "date": "2024-05-04 12:26", "message": "Yesterday, Lebanese Al-Akhbar newspaper publishes the French proposal for a ceasefire between Israel and Hezbollah\n\nThe Lebanese Al-Akhbar newspaper, which is affiliated with Hezbollah, once again manages the agenda regarding the ceasefire agreements with Israel and reveals the details of the French proposal to end the war between Israel and Hezbollah in southern Lebanon.\n\nThe proposal includes three stages:\n\nFirst step (according to areas of responsibility)\n\nHezbollah the militias in South Lebanon stop the fire and allow UNIFIL to move freely in South Lebanon without restriction.\n\nIsrael will stop its attacks on Lebanese territory and stop jamming the radar in Lebanon.\n\nUNIFIL will increase patrols in southern Lebanon.\n\nSecond stage (within 3 days from the start of the first stage)\n\nHezbollah militias will dismantle all their facilities near the blue line, including observation towers and tents.\nAll military operatives, including the Radwan force, as well as equipment that enables the remote launch of anti-tank missiles, will be moved north beyond the ten-kilometer line from the border with Israel.\n\nIsrael will stop air flights over Lebanon.\n\nLebanon will begin deploying 15,000 soldiers on its behalf in southern Lebanon, south of the Litani River with the support of UNIFIL and international agencies.\n\nUNIFIL will resume its participation in the meetings of the tripartite mechanism (with Israel and Lebanon) and logistically assist the deployment of the Lebanese army south of Litani.\n\nThird stage (within ten days)\n\nThe renewal of the negotiations between Israel and Lebanon for the registration of the land border based on the negotiations that took place in 2017.\nBeginning of negotiations on the establishment of a zone free of armed military militias south of Litani (with the exception of the Lebanese army and UNIFIL forces).\n\nSupport for social and economic development in southern Lebanon.", "location": "Southern Lebanon", "classification": "security", "score": 0.9627738124436742, "event_breakdown": "- Lebanese Al-Akhbar newspaper publishes the French proposal for a ceasefire between Israel and Hezbollah\n- Proposal includes three stages:\n  - First step: Hezbollah to stop firing in South Lebanon, UNIFIL to increase patrols, and Israel to cease attacks and radar jamming\n  - Second stage: Hezbollah to dismantle facilities near the blue line, Israel to stop air flights over Lebanon, Lebanon to deploy soldiers with UNIFIL support\n  - Third stage: Renewal of negotiations on land border registration, establishment of a zone free of armed militias, support for social and economic development in southern Lebanon."}, {"id": "687d039a-df98-44ef-ab64-9510ab8ea0b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26650/", "date": "2024-05-03 20:33", "message": "The Saudi Asharq channel from its sources:\nHamas obtained American confirmation through the Egyptian and Qatari mediators that the term \"sustainable peace\" that appears in the agreement is in fact a permanent ceasefire.\n\n##\nI remind you, this will make or break the agreement.\nIf Hamas receives guarantees not to resume fighting, it will sign the agreement.\nThere are no disputes between the parties regarding the other sections.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.8031684638552474, "event_breakdown": "- Hamas obtains confirmation from American sources through Egyptian and Qatari mediators regarding the term \"sustainable peace\" in the agreement: (Location: not specific, as the information is obtained through sources)\n- The term \"sustainable peace\" in the agreement is clarified to be a permanent ceasefire."}, {"id": "89f012ad-a553-46d0-843c-2ce4b960e3db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26649/", "date": "2024-05-03 20:30", "message": "Documentation of one of today's attacks in the area of ​​the displaced persons' tents in Rafah in the south of the Gaza Strip - note the rocket rising into the sky. This indicates a precise hit by the aircraft on the target.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9952821119807056, "event_breakdown": "- Attack on displaced persons' tents in Rafah, Gaza Strip\n- Rocket launch into the sky indicating precise hit by aircraft"}, {"id": "ff0e4b85-dac6-4016-b67e-491c5aebd8da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26648/", "date": "2024-05-03 20:27", "message": "Hamas in an official announcement:\n\nIn light of the recent contacts with the mediators, tomorrow a delegation of the movement will arrive in Cairo to complete the talks.\n\nWe emphasize that the leadership of the movement reacted in a positive spirit to the proposal it received while discussing it. We are going to Cairo in the same positive atmosphere to reach an agreement.\n\nWe are determined to reach an agreement that will realize the demands of our people for a total cessation of aggression, the withdrawal of forces, the return of the displaced, aid to our people, the beginning of the reconstruction of the Gaza Strip and a serious exchange deal.", "location": "Cairo", "classification": "security", "score": 0.3907896760166591, "event_breakdown": "- Hamas delegation to arrive in Cairo for talks\n- Reacted positively to proposal received during discussions\n- Determined to reach agreement for cessation of aggression, withdrawal of forces, return of displaced, aid, Gaza Strip reconstruction, and exchange deal"}, {"id": "658c54a6-8445-4ff9-8ff4-58889b81271e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26645/", "date": "2024-05-03 19:03", "message": "Gazans complain: as part of the food packages distributed at UNRA schools, we received a food product that contains pork 🐷...\n\nحسب الله ونعم الوكيل", "location": "Gaza", "classification": "security", "score": 0.5476738944355803, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "58912370-6359-45dc-bbaf-3b4f2925262f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26644/", "date": "2024-05-03 17:44", "message": "Reuters from a senior Hamas official: a Hamas delegation will arrive in Cairo tomorrow.", "location": "Cairo", "classification": "security", "score": 0.9023652992005777, "event_breakdown": "- A Hamas delegation is scheduled to arrive in Cairo tomorrow, as reported by a senior Hamas official."}, {"id": "7fe65eb1-d130-4087-aee7-ef5ee0fd7921", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26643/", "date": "2024-05-03 16:51", "message": "The Houthis clarify the words of the Houthi military spokesman and point out that starting today every ship that docks in an Israeli port will be \"marked\" and as soon as it passes through an area within the reach of the Houthis it will be attacked even if it is not on its way to an Israeli port at the time.\n\nIf Israel enters Rafah, the next step for the Houthis will be to attack all ships belonging to companies that even one of their ships docks in Israeli ports.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.4099593512202328, "event_breakdown": "- Houthi threat to attack any ship docking in Israeli port\n- Possible Houthi attack on ships of companies with ships docking in Israeli ports"}, {"id": "e67f0410-3a10-493b-b7ee-d6480929a56e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26642/", "date": "2024-05-03 16:36", "message": "One of the signs of abundance in the northern Gaza Strip: Gazan donkeys receive fresh pita bread\n\nA Gazan from the north of the Gaza Strip to the donkey: once (when there was a shortage of bread) we ate from your food, now take and eat bread from today. You are better than many people...", "location": "Gaza Strip", "classification": "security", "score": 0.8432632263954416, "event_breakdown": "- Gazan donkeys in the northern Gaza Strip receiving fresh pita bread\n- A Gazan from the north of the Gaza Strip sharing bread with the donkeys, expressing gratitude for their help during past shortages"}, {"id": "f4534197-5597-408c-bf10-0b09aa86d7c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26641/", "date": "2024-05-03 16:28", "message": "American Central Command:\n\nDue to weather conditions, construction work on the floating pier off the coast of Gaza was stopped and it was moved to Ashdod port, where its construction will be completed.\n\nAfter the completion of its construction, it will be floated along the shores of Gaza to the place where it was planned to be placed.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.8222928362890448, "event_breakdown": "- Construction work on the floating pier off the coast of Gaza was moved to Ashdod port.\n- The completed floating pier will be floated along the shores of Gaza to its planned location."}, {"id": "4657d912-8e5d-455a-8ee9-4daa62a37ea5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26640/", "date": "2024-05-03 15:56", "message": "Reuters from an Egyptian source:\n\nThe head of the CIA, William Burns, arrived in Cairo to promote the ceasefire in Gaza.\n\n##\nThe Americans are using all their weight and are firing their heaviest guns to reach a ceasefire.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.8731912994868349, "event_breakdown": "-  Head of the CIA, William Burns, arrives in Cairo to promote ceasefire in Gaza"}, {"id": "f1aa6c03-9fa8-489c-9c81-57548b81d67b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26639/", "date": "2024-05-03 15:55", "message": "The Palestinian Ministry of Health in Gaza:\n26 dead in the Strip in the last day.\n\nThe number of deaths in the last few days:\n28\n33\n47\n34\n\nTotal dead in the Gaza Strip since the beginning of the war: 34,622. Total wounded: about 78 thousand.\n\n##\nIn the last day, the number of dead was the lowest in the Gaza Strip since the beginning of the war (with the exception of the hodna period in November 2023).", "location": "Gaza City", "classification": "security", "score": 0.8569080015487186, "event_breakdown": "- 26 dead in the Gaza Strip in the last day\n- Total dead in the Gaza Strip since the beginning of the war: 34,622\n- Total wounded in the Gaza Strip since the beginning of the war: about 78 thousand\n- The number of deaths in the last few days:\n  - 28\n  - 33\n  - 47\n  - 34\n- In the last day, the number of dead was the lowest in the Gaza Strip since the beginning of the war (excluding the hodna period in November 2023)"}, {"id": "e5045aca-94f3-4d7f-92d1-b4c8f9511b72", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26638/", "date": "2024-05-03 15:14", "message": "The American Wall Street Journal:\n\nIsrael gave Hamas an extension of one week that will end this coming weekend to respond to the proposal it submitted.\n\nYahya Sinwar has not yet responded to the Israeli proposal.\n\nAccording to the newspaper, Hamas is asking for American guarantees for the non-renewal of fighting after the upcoming deal, since in its view the clause in the proposal surrounding the matter is \"too vague\" and allows Israel to return to fighting.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.5459997237435309, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}, {"id": "435ae035-7024-450b-95ae-2da50208817d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26633/", "date": "2024-05-03 13:36", "message": "Paris: French security forces break into Sciences Po the Institute of Political Science to break up an anti-Israel demonstration by the students there.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9281242816179448, "event_breakdown": "- French security forces break into Sciences Po, the Institute of Political Science in Paris."}, {"id": "433354b2-5036-4478-9476-e5012d150978", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26631/", "date": "2024-05-03 13:27", "message": "A few points to note:\n\n1. Hezbollah said anyway that it will stop the fire as soon as there is a ceasefire in Gaza.\n\n2. The French proposal does not answer the question of implementation and enforcement. What do we do if Hezbollah does not vacate? What happens if in six months Hezbollah returns south of Litani River? After all, the non-enforcement of Resolution 1701 at the end of the Second Lebanon War is what brought us to the current situation.\nEnforcement is the heart of the matter in the Lebanese arena. What enforcement measures are there and what are the sanctions for violations by Hezbollah?\n\n3. Israel was flying in the skies of Lebanon before the war, now it will have to commit that it will stop...\n\nThe bottom line, the proposal creates a situation where Israel will be left with just a paper in hand, without any deterrence and with Hezbollah's military force threatening the residents of the north.\n\nFor the Americans and the French this is excellent. This is a disaster for Israel.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.8178512051645865, "event_breakdown": "1. Hezbollah announces intention to cease fire upon Gaza ceasefire\n2. French proposal lacks clear implementation and enforcement plan\n3. Concerns raised about potential return of Hezbollah south of Litani River\n4. Enforcement measures and sanctions for Hezbollah violations questioned\n5. Israel's commitment to halt flights over Lebanon discussed\n6. Proposal may leave Israel without deterrence against Hezbollah militancy"}, {"id": "cd55fab7-abee-48b2-9fcb-06d42751785d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26630/", "date": "2024-05-03 13:15", "message": "About 100,000 Palestinians have left the Gaza Strip since the beginning of the war\n\nThe Palestinian ambassador in Egypt: since the beginning of the war and until April, 85 thousand Palestinians left the Gaza Strip for Egypt through the Rafah crossing.\n\nTaking the month of April into account, it can be estimated that about one hundred thousand Palestinians left the Strip since the beginning of the war.", "location": "Rafah Crossing", "classification": "security", "score": 0.8683848530412968, "event_breakdown": "null"}, {"id": "b2b98a90-2ae6-4b5c-bce0-8297db32ca54", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26628/", "date": "2024-05-03 13:11", "message": "Fox News: The Iranian flag was raised by the students at the University of Irvine in California.\n\nIran is offering scholarships to students who will be expelled from US universities following the protests.", "location": "University of Irvine in California", "classification": "security", "score": 0.38395330639266484, "event_breakdown": "1. Iranian flag raised by students at University of Irvine in California\n2. Iran offers scholarships to students facing expulsion from US universities due to protests"}, {"id": "48161aba-6efe-461f-b891-afd8436b6023", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26625/", "date": "2024-05-03 11:05", "message": "Reuters from the Turkish Minister of Commerce:\n\nThe suspension of trade with Israel will continue until a permanent cease-fire in Gaza and until Israel allows all aid into the strip. \n\n##\nTurkey has de-facto joined the Shiite axis - like the Houthis... they are harming the Israeli economy until a ceasefire is reached. The Sultan became a Houthi pirate.\n\nIsrael should remember this when Turkey wants to resume trade between the countries.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9341793288581125, "event_breakdown": "1. Suspension of trade between Turkey and Israel until a permanent cease-fire in Gaza and the allowance of all aid into the strip.\n2. Turkey joining the Shiite axis, likened to the Houthis, harming the Israeli economy until a ceasefire is achieved. The Sultan referred to as a Houthi pirate. \n3. Reminder to Israel regarding the implications for future trade relations with Turkey."}, {"id": "57c17388-1e08-4b25-938f-989da165d78f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26624/", "date": "2024-05-03 11:04", "message": "The Shia militias in Iraq claim:\nYesterday afternoon (May 2nd) we launched two cruise missiles from Iraq at a target in Tel Aviv and at a target in Be'er Sheva.\n\nThe militias in Iraq also claim that they attacked an Israeli target in the Dead Sea early this morning \"with appropriate weapons\".\n\n###\nSources of the Lebanese al-Mayadeen claim that the Iraqi cruise missiles were launched at the Glilot Base in Tel Aviv and the Avraham Base in Be'er Sheva.", "location": "Tel Aviv", "classification": "security", "score": 0.9833649319691411, "event_breakdown": "- Shia militias in Iraq claim to have launched two cruise missiles at targets in Tel Aviv and Be'er Sheva\n- Shia militias in Iraq claim to have attacked an Israeli target in the Dead Sea"}, {"id": "785ad671-2091-4bef-8cf6-13b0e2c9c119", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26623/", "date": "2024-05-03 10:23", "message": "The coup in Niger: Russian soldiers reportedly enter a military base where the American troops are stationed\n\nAccording to Reuters, Russian soldiers have entered a military air base housing American forces in the capital of Niger.\n\nAs you might remember, last year there was a coup in Niger and the military junta that seized power demanded that the US terminate the agreement with it and... remove all American forces from Niger.\n\nThe American forces have not yet evacuated and now they have new \"guests\" at their base.\n\nAmerican officials state that the Russian and American soldiers remain in separate areas at the base. The American Secretary of Defense spoke out on the matter and said that there is no fear that the Russians will get their hands on American equipment.\n\n##\nThe Taliban send their regards..", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.7709916187413431, "event_breakdown": "Taliban launches new offensive in Afghanistan"}, {"id": "106d62a7-40c4-4a96-9dd4-a96c0ac9adea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26620/", "date": "2024-05-03 06:44", "message": "Last night's attack in Damascus, attributed to Israel\n\nSyrian sources identified with the Shiite axis report that the target of the Israeli attack in Damascus was the \"State Security School\" (of the Syrian Army - AA), near the village of Najaha, and as a result, a three-story building was severely damaged there.\nAccording to these sources, the target of the attack belonged to the Syrian army and not to Iranian elements in Syria.\n\nThe Syrian Ministry of Defense officially announced that Israel carried out an airstrike last night at 10:05 PM which resulted in the injury of 8 Syrian soldiers and damage to property.", "location": "\"Damascus\"", "classification": "security", "score": 0.9816944407775801, "event_breakdown": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop"}]