[{"id": "9a09f42a-2b8e-4bd7-825d-0e869a063242", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26560/", "date": "2024-05-01 14:52", "message": "From the other side, the pro-Hamas students at UCLA call out to the Los Angeles police officers:\n\nPigs go home!\n\n##\nThe whole story is in two videos.", "location": "Los Angeles, California", "classification": "security", "score": 0.7977283031701242, "event_breakdown": "- Pro-Hamas students at UCLA call out to the Los Angeles police officers: \"Pigs go home!\""}, {"id": "ddf043f9-8ce0-4ce9-9132-93af1c197c9f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26559/", "date": "2024-05-01 14:03", "message": "California, UCLA:\n\nLos Angeles police officers arrive at the university grounds and are greeted with sympathetic chants from the pro-Israel students:\n\nUSA, USA, USA !", "location": "UCLA (University of California, Los Angeles)", "classification": "security", "score": 0.7240329419690582, "event_breakdown": "- Los Angeles police officers arrive at UCLA\n- Pro-Israel students chant \"USA, USA, USA\" in support of the police officers"}, {"id": "4620fbc1-3dd2-445a-9988-305371c5297e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26558/", "date": "2024-05-01 13:45", "message": "An important statement yesterday by the spokesperson of the American State Department, regarding the lawsuits against Israel for the war in Gaza:\n\nWe believe that the International Criminal Court in The Hague has no jurisdiction in this matter.", "location": "The Hague", "classification": "security", "score": 0.6211716807888927, "event_breakdown": "- Statement by the spokesperson of the American State Department regarding lawsuits against Israel for the war in Gaza"}, {"id": "eff630d1-89da-4a3a-a1f8-bd74e301a8cd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26557/", "date": "2024-05-01 13:44", "message": "Hezbollah announces a death in its ranks:\n\nVahid Tefili, born in 2000 from the village of Deir al-Zahrani in southern Lebanon.\n\nVahid was seriously injured more than four days ago and died tonight from his wounds. The circumstances of his death are not specified.\nIn addition to being a Hezbollah military operative, he was a \"commander\" in the local Hezbollah scout tribe.\n\nNumber 291", "location": "Deir al-Zahrani", "classification": "security", "score": 0.9744458110938735, "event_breakdown": "- Hezbollah announces death of Vahid Tefili, born in 2000 from Deir al-Zahrani village in southern Lebanon.\n- Vahid, a Hezbollah military operative and \"commander\" in local Hezbollah scout tribe, dies from serious injuries sustained over four days ago.\n- Circumstances of his death not specified."}, {"id": "597552c0-ca54-41b5-8650-488b95380501", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26556/", "date": "2024-05-01 13:42", "message": "It is important to emphasize: as written in the title above 👆, this is the proposal that Israel allegedly forwarded to Hamas. That is, if the report is true, then Israel has agreed to these terms and Hamas has not yet...", "location": "CAIRO, EGYPT", "classification": "security", "score": 0.6078237228963291, "event_breakdown": "1. Israel has reportedly proposed an agreement to Hamas.\n2. The proposed agreement includes provisions for a ceasefire between Israel and Hamas.\n3. If the reports are accurate, Israel has agreed to certain terms outlined in the proposal.\n4. Hamas has not yet responded to the proposed agreement."}, {"id": "3db2428c-cd79-402c-80ad-4058ebcaf45a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26554/", "date": "2024-05-01 13:36", "message": "The operation in Rafah - the Lebanese Al-Akhbar newspaper (Hezbollah-affiliated) from its sources:\n\nThe US demands that Israel evacuate at least 800,000 displaced people from Rafah before the attack in the area. 40,000 tents arrived in Israel from China, paid for by the United Arab Emirates. Each tent can accommodate 20 people (a total of 800,000 people).\n\nThere is a concentration of about a thousand IDF vehicles, including tanks and APCs in the southern area of ​​the Gaza Strip (on the Israeli side).\nIsrael is planning to break into Rafah from the area of ​​the Sofa crossing and the Kerem Shalom crossing.\n\nThe Egyptians asked to check with the leadership of Hamas, whether its military arm is planning to blow up the fences in the border area with Egypt in order to cause crowds to flee to Egyptian territory.", "location": "Rafah", "classification": "security", "score": 0.9569005729564938, "event_breakdown": "- US demands evacuation of displaced people from Rafah\n- Arrival of 40,000 tents from China paid for by UAE\n- Concentration of IDF vehicles in southern Gaza Strip\n- Israel planning to break into Rafah from Sofa and Kerem Shalom crossings\n- Egyptians inquire about Hamas military arm's intentions to blow up fences bordering Egypt"}, {"id": "12e63bf6-f505-47e8-a762-6fea75bad0fb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26552/", "date": "2024-05-01 06:52", "message": "Florida: Security forces dispersed a demonstration on the campus of the University of South Florida by firing tear gas.\n\nPro-Palestinian rioters were also arrested there.", "location": "University of South Florida", "classification": "security", "score": 0.8859654747405098, "event_breakdown": "- Security forces disperse demonstration on University of South Florida campus in Florida by firing tear gas.\n- Pro-Palestinian rioters arrested during the demonstration."}, {"id": "882e4741-3568-4fbe-bed6-7065545f73fc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26544/", "date": "2024-05-01 06:48", "message": "NYPD buses with the detainees from tonight leave the grounds of Columbia University.", "location": "Columbia University", "classification": "security", "score": 0.5229719379429217, "event_breakdown": "- Missile attack targets educational institution in Odesa's seafront park, killing five and injuring 32.\n- Roof of private law academy destroyed in strike in Odesa.\n- Odesa Mayor Trukhanov expresses shock in Telegram video following the attack.\n- President of academy, former MP Serhiy Kivalov, among the injured, reports public broadcaster Suspilne.\n- Odesa continues to face frequent Russian missile and drone attacks, with port infrastructure being a particular target.\n\n- Iran launches around 300 weapons from Iran, Syria, and Yemen, including ballistic missiles, land-attack cruise missiles, and unmanned aerial vehicles.\n- Attack characterized as major effort by Iran to inflict pain on Israel.\n- Only a few Iranian weapons penetrate defenses, causing little material damage.\n- Hypothetical scenario raised: consequences if all 300 Iranian weapons had penetrated defenses.\n\n- Houthi rebels from Yemen launch missile attack in Red Sea.\n- Attack damages ship in latest assault targeting maritime traffic in strategic waterway.\n\n- 16-year-old Sydney boy charged with terrorism offenses denied bail due to concerns for community safety.\n- Court hears boy messaged another young person stating \"we're going to kill.\"\n- Six teenagers charged after counter-terrorism raids in Sydney, two appear in children's court at Parramatta.\n- Text message presented in court suggests planning for a terrorist attack.\n- Parents of 16-year-old describe him as an \"excellent son\" and good student in affidavit.\n- Material allegedly includes video of assault with Islamic State symbol watermarked over it.\n\n- NYPD buses with the detainees from tonight leave the grounds of Columbia University."}, {"id": "3d1a18e9-a9bc-42e4-9167-8009838e50e1", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65853/", "date": "2024-05-01 06:46", "message": "US media channels reports that the NYPD arrested about a hundred people on Columbia University's campus.\n\nIn a statement, Columbia University claimed that the leaders of the protest on campus are not even students of the university, but rather external parties.\n\nThe president of the university asked the police forces to remain on the university campus until May 17th to maintain order and make sure that no tent camps are set up on campus.", "location": "Columbia University", "classification": "antisemitism", "score": 0.5850521548096034, "event_breakdown": "- NYPD arrests about a hundred people on Columbia University's campus\n- Columbia University states that protest leaders are not students but external parties\n- University president requests police to stay on campus until May 17th"}, {"id": "b5a49a6c-d892-418c-b9ec-e271dbbcea74", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26538/", "date": "2024-05-01 06:44", "message": "At the center of it all - the removal of the Palestinian rioters occupying Hamilton Hall, which they had vandalized while taking over the building and barricading themselves inside.", "location": "Hamilton Hall", "classification": "security", "score": 0.942578494351582, "event_breakdown": "- Palestinian rioters occupying Hamilton Hall removed from building they had vandalized.\n- Rioters barricaded themselves inside the building before being removed."}, {"id": "8e89faa5-3bd8-46dc-8c91-77f52aa3be96", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26537/", "date": "2024-05-01 06:40", "message": "New York: In the last few hours, the signal was finally given and the New York police entered Columbia University in large forces to disperse the hate demonstration against Israel.", "location": "Columbia University", "classification": "antisemitism", "score": 0.3014433288682847, "event_breakdown": "- New York police enter Columbia University in large forces to disperse hate demonstration against Israel."}, {"id": "dfef6291-2fd0-4f67-bf22-d8746cd87dc7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26536/", "date": "2024-04-30 21:25", "message": "University of Ottawa in Canada - chants in Arabic:\nFree Free Palestine\nOut out with Israel", "location": "University of Ottawa", "classification": "security", "score": 0.48927072203212124, "event_breakdown": "1. University of Ottawa in Canada - Chants in Arabic: \"Free Free Palestine, Out out with Israel\""}, {"id": "a87cf406-7334-4656-b2ea-c50466b95218", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26535/", "date": "2024-04-30 20:55", "message": "Tomorrow will be a month since the last attack attributed to Israel in Damascus, the capital of Syria - the attack in which Muhammad Reza Zahedi, the commander of the Quds Force in the Iranian Revolutionary Guards in the Syrian and Lebanese sector, was killed.\n\nAccording to Syrian sources, this is the longest quiet period in the skies of Damascus in recent years.\n\nIs the Iranian deterrence working?", "location": "Damascus", "classification": "security", "score": 0.8725166052039606, "event_breakdown": "- One month since last attack attributed to Israel in Damascus, Syria.\n- Attack resulted in death of Muhammad Reza Zahedi, commander of Quds Force in Iranian Revolutionary Guards in Syrian and Lebanese sector.\n- Syrian sources note longest period of quiet in skies of Damascus in recent years.\n- Question raised: Is Iranian deterrence working?"}, {"id": "78c3d24a-d43b-4f86-8d0e-18bd4addd393", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26534/", "date": "2024-04-30 20:50", "message": "The Houthis, Iran's loyalists in Yemen, publish documentation of a UAV they launched yesterday at the Greek ship CYCLADES, according to the US Central Command, there were no casualties as a result and the ship continued on its way. Damage was not denied.", "location": "CYCLADES", "classification": "security", "score": 0.891526682381482, "event_breakdown": "- The Houthis launch a UAV at the Greek ship CYCLADES in Yemen\n- According to the US Central Command, there were no casualties\n- The ship continued on its way\n- Damage to the ship was not denied"}, {"id": "839b35d5-eb92-4051-9643-03920717a794", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26531/", "date": "2024-04-30 17:14", "message": "About Al Jazeera:\nThe Qatari network will soon broadcast a special program in which it will glorify and praise Yahya Sinwar, the leader of Hamas in the Gaza Strip - \"the man who managed to put the whole world on one foot\".", "location": "Gaza Strip", "classification": "security", "score": 0.8212158042349625, "event_breakdown": "- Al Jazeera is planning to broadcast a special program praising Yahya Sinwar, the leader of Hamas in the Gaza Strip."}, {"id": "6a625123-eabc-4edc-9afa-c611c13ef683", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26530/", "date": "2024-04-30 16:32", "message": "A young Jewish man does not allow Al Jazeera's reporter, Najwan Simri, to broadcast a report (which is not sympathetic to Israel, to put it mildly) regarding the stabbing attack by the Turkish citizen today in the Old City of Jerusalem.\nHe repeats to the camera: don't listen to their nonsense.\nShe later turns to the Israeli police stationed in the area, complaining about the young man and falsely claiming he is touching her.\nIt is worth noting they are members of the same force (Israeli Border Police) that was attacked.", "location": "Jerusalem", "classification": "security", "score": 0.9339038273219109, "event_breakdown": "1. A young Jewish man prevents Al Jazeera reporter Najwan Simri from broadcasting a report on a stabbing attack by a Turkish citizen in the Old City of Jerusalem.\n2. The young man addresses the camera, advising viewers not to listen to \"their nonsense.\"\n3. Najwan Simri complains to Israeli police in the area about the young man and falsely accuses him of touching her.\n4. Both the young man and Najwan Simri are members of the Israeli Border Police force that was previously attacked."}, {"id": "9fd6a4a2-5add-40df-b0f4-312a815626d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26529/", "date": "2024-04-30 16:00", "message": "Members of the Palestinian Authority's security forces confront Palestinian protesters near the Canadian Embassy in Ramallah. The protesters are protesting Canada's support for Israel regarding the fighting in Gaza.", "location": "Ramallah", "classification": "security", "score": 0.9876206410667714, "event_breakdown": "- Members of the Palestinian Authority's security forces confront Palestinian protesters near the Canadian Embassy in Ramallah. \n- The protesters are protesting Canada's support for Israel regarding the fighting in Gaza."}, {"id": "a00f74c7-9c12-48fa-9bc8-59ce9adac3b5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26527/", "date": "2024-04-30 15:38", "message": "The military arm of the Islamic Jihad in Jenin is trying to thwart the entry of the undercover forces into the refugee camp and placed signs with instructions for the driving public:\n\n1. The car windows must be opened.\n2. At night, the interior light in the car must be turned on.\n3. Owners of commercial vehicles - your vehicle will be checked before entering the area.", "location": "Jenin", "classification": "security", "score": 0.9594313959113322, "event_breakdown": "- Islamic Jihad's military wing in Jenin tries to prevent undercover forces from entering the refugee camp and puts up signs with driving instructions:\n    1. Open car windows.\n    2. Turn on interior light at night.\n    3. Commercial vehicle owners will have their vehicles checked before entering the area."}, {"id": "59be851d-94a2-4b3e-a07d-358691c56df7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26526/", "date": "2024-04-30 14:58", "message": "A clear majority of Israelis and Americans support an operation in Rafah. The keys to this move lie in the hands of Netanyahu and Biden.\n\n##\nThe attached photo from the 1930s shows the train station in Rafah.\n\nNext stop: Rafah?", "location": "Rafah", "classification": "world", "score": 0.37831268763995485, "event_breakdown": "- Clear majority of Israelis and Americans support operation in Rafah.\n- Decision rests with Netanyahu and Biden.\n- Photo from 1930s depicts train station in Rafah.\n- Speculation: Next stop could be Rafah."}, {"id": "cf8e3ced-8e43-4427-8eb6-e00bf346727f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26524/", "date": "2024-04-30 14:52", "message": "Two public promises today made by the Prime Minister and Minister Ben Gvir regarding entry to Rafah.\nArab and Palestinian media quote them extensively.", "location": "Rafah", "classification": "security", "score": 0.4280292525387717, "event_breakdown": "- Prime Minister and Minister Ben Gvir make two public promises regarding entry to Rafah.\n- Arab and Palestinian media extensively quote the promises."}, {"id": "160c0656-d456-4b99-814e-72b420ef9a2b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26523/", "date": "2024-04-30 14:51", "message": "The White House: Soon, trucks with flour will enter Gaza through a new crossing.", "location": "The White House", "classification": "security", "score": 0.43932515330510435, "event_breakdown": "- Trucks with flour will enter Gaza through a new crossing"}, {"id": "8af6c3fe-b7f5-4927-8be3-3b80a1b2ffa8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26521/", "date": "2024-04-30 13:25", "message": "The military wing of the Islamic Jihad: We fired rockets at the Israeli command and control centers in the Netzarim area.", "location": "Netzarim", "classification": "security", "score": 0.9949691837335627, "event_breakdown": "- The military wing of the Islamic Jihad fired rockets at the Israeli command and control centers in the Netzarim area."}, {"id": "b99e7456-7315-4234-8124-fb8848709602", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26520/", "date": "2024-04-30 13:24", "message": "The Israel Police publishes CCTV footage of today's stabbing attack near the Flowers Gate in the Old City of Jerusalem.\n\nThe Turkish terrorist stalked the two police officers from behind, and then pulled out a knife and started stabbing one of two.\n\nThankfully the officers managed to fight him off, sustaining only minor injuries.\n\nAs previously mentioned, the terrorist was shot and killed.", "location": "Old City of Jerusalem", "classification": "security", "score": 0.9972743688563904, "event_breakdown": "1. Stabbing attack near the Flowers Gate in the Old City of Jerusalem\n2. Turkish terrorist stalks two police officers and stabs one\n3. Officers fight off the terrorist, sustaining minor injuries\n4. Terrorist shot and killed"}, {"id": "7b0787ae-f610-4cb3-94bb-6834e4920d92", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26517/", "date": "2024-04-30 13:11", "message": "Lebanese sources report on casualties in several Israeli attacks in Yaroun and Odaisseh in southern Lebanon.", "location": "Yaroun", "classification": "security", "score": 0.9926602654668037, "event_breakdown": "- Casualties reported in Israeli attacks in Yaroun, southern Lebanon\n- Casualties reported in Israeli attacks in Odaisseh, southern Lebanon"}, {"id": "13675d59-d264-4a7b-a45b-af68fa88b3de", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26516/", "date": "2024-04-30 11:12", "message": "The American University in Beirut, Lebanon: Here, too, the statue of George Washington undergoes a process of \"Palestinianization\"\n\nOne of the students in the crowd is seen holding a picture of Muhammad Deif, the head of the military wing of Hamas.", "location": "Beirut, Lebanon", "classification": "security", "score": 0.6905892484369863, "event_breakdown": "- The statue of George Washington at the American University in Beirut, Lebanon undergoes a process of \"Palestinianization\"\n- A student in the crowd is seen holding a picture of Muhammad Deif, the head of the military wing of Hamas"}, {"id": "2f8d1da6-f27d-4959-8f51-a6eecca2bdac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26515/", "date": "2024-04-30 10:49", "message": "Ramallah, West Bank: A Palestinian joyfully presents the loot from the attack on the German ambassador's vehicle - its license plate.", "location": "Ramallah", "classification": "security", "score": 0.9812876088138319, "event_breakdown": "- Location: Ramallah, West Bank\n- Event: Palestinian presents loot from attack on German ambassador's vehicle (license plate)"}, {"id": "c48dc71b-08c0-424c-a500-cd95a9ff37ec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26514/", "date": "2024-04-30 10:31", "message": "The Flower Gate area in the Old City of Jerusalem:\n\nAn Israeli police officer sustained light injuries in a stabbing attack. \n\nThe terrorist, a tourist from Turkey was \"neutralized\", apparently permanently.", "location": "The Flower Gate area in the Old City of Jerusalem", "classification": "security", "score": 0.9953919204555158, "event_breakdown": "- Stabbing attack in Flower Gate area, Old City of Jerusalem.\n- Israeli police officer sustains light injuries.\n- Stabbing attack in the Flower Gate area of the Old City of Jerusalem\n- Israeli police officer sustains light injuries\n- Terrorist, a tourist from Turkey, \"neutralized\" permanently"}, {"id": "013735f8-f12e-49d0-a8fa-8b13d28a4218", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26513/", "date": "2024-04-30 10:30", "message": "Ramallah, West Bank: The German ambassador to the PA was almost lynched by a Palestinian mob during a visit to a museum near Birzeit University.\n\nThe Palestinian mob surrounded the ambassador's car, vandalized it, and threw rocks at it.\n\nThis attack comes in light of Germany's support for Israel during the war.", "location": "Ramallah, West Bank", "classification": "security", "score": 0.9413258241893517, "event_breakdown": "- German ambassador to Palestinian Authority (PA) almost lynched by Palestinian mob near Birzeit University in Ramallah, West Bank.\n- Mob surrounds ambassador's car, vandalizes it, and throws rocks.\n- Ramallah, West Bank: German ambassador to the PA almost lynched by Palestinian mob near Birzeit University\n- Palestinian mob surrounds ambassador's car, vandalizes it, and throws rocks at it"}, {"id": "608ab6b6-197c-430f-90d6-d8de064c9db5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26512/", "date": "2024-04-30 10:25", "message": "A survey by the Harvard Harris Institute published yesterday yielded similar results - there is a clear majority for a military operation in Rafah among the American public - 72% support an operation in Rafah.", "location": "Rafah", "classification": "security", "score": 0.6975851679334045, "event_breakdown": "- Survey by Harvard Harris Institute shows clear majority among American public for military operation in Rafah.\n- 72% of respondents support operation in Rafah."}, {"id": "911b29ec-f657-49e2-9804-ea7f1252f3af", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26510/", "date": "2024-04-30 08:33", "message": "Students at Columbia University are switching to chants in Arabic.\n\n#Columbia_has_fallen", "location": "Columbia University", "classification": "security", "score": 0.4835643031151498, "event_breakdown": "- Students at Columbia University are switching to chants in Arabic.\n- #Columbia_has_fallen"}, {"id": "555e8e8d-3cbe-4261-9e25-0d589dbf4fa0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26510/", "date": "2024-04-30 08:33", "message": "Columbia University in New York: Anti-Semitic students \"occupy\" the Hamilton building on the university campus, breaking in while vandalizing the place.\n\n#Hamilton_corridor\n#Down_with_the_occupation", "location": "Columbia University in New York", "classification": "antisemitism", "score": 0.8018934140844742, "event_breakdown": "1. Anti-Semitic students occupy the Hamilton building at Columbia University in New York.\n2. The students break into the Hamilton building and vandalize the place."}, {"id": "37847db7-6e51-4311-8877-313d0d6f3369", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26508/", "date": "2024-04-30 08:32", "message": "The statue of George Washington at George Washington University has been Palestinianized and defaced.", "location": "Washington D.C.", "classification": "security", "score": 0.3831179570317771, "event_breakdown": "- Statue of George Washington at George Washington University Palestinianized and defaced"}, {"id": "f9704393-63cd-4409-b9a1-c31968b476f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26507/", "date": "2024-04-30 08:31", "message": "Stanford University, California: A student, wearing a headband of the military wing of Hamas, prepares for class...", "location": "Stanford University, California", "classification": "security", "score": 0.7733456335938974, "event_breakdown": "- A student at Stanford University in California wears a headband of the military wing of Hamas and prepares for class."}, {"id": "bf38a947-fb7f-4ab2-afc7-4bde2553dd11", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26506/", "date": "2024-04-30 08:30", "message": "Protest against Israel on US campuses:\n\n\"Morning Prayer\" at Harvard University.\n\n#sound_on", "location": "Harvard University", "classification": "security", "score": 0.7488853793510446, "event_breakdown": "1. Protest against Israel on US campuses\n2. \"Morning Prayer\" at Harvard University"}, {"id": "8759c643-4f6d-4bf7-bc30-79c72bf498a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26504/", "date": "2024-04-30 08:19", "message": "The Lebanese government's crisis management team publishes data on the war with Israel.\n\nSince October 7, 4010 air and ground attacks have been carried out on targets in Lebanon.\n\nThe 5 villages that were attacked the most are:\nAyta ash Shab - 339 times\nHula - 311 times\nNaqoura - 256 times\nAalma ech Chaab - 241 times\nTayr Harfa - 215 times.\n\nThe team also reported that since October 7th, 438 people have been killed in Lebanese territory, of which 337 are militants (Hezbollah and other organizations), 100 civilians and one Lebanese soldier.", "location": "Ayta ash Shab", "classification": "security", "score": 0.7515038538670128, "event_breakdown": "- Lebanese government's crisis management team publishes data on war with Israel.\n- Since October 7, 4010 air and ground attacks carried out on targets in Lebanon.\n- Five villages attacked the most: Ayta ash Shab (339 times), Hula (311 times), Naqoura (256 times), Aalma ech Chaab (241 times), Tayr Harfa (215 times).\n- Since October 7, 438 people killed in Lebanese territory: 337 militants (Hezbollah and other organizations), 100 civilians, and one Lebanese soldier."}, {"id": "17cc6abe-b740-478e-9512-643478db2b54", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26500/", "date": "2024-04-30 08:17", "message": "Last night, the American Central Command published pictures of the progress of the construction of the floating pier off the coast of Gaza.\n\nAt the same time, there are reports that the British are considering sending soldiers on their behalf to secure the pier.", "location": "coast of Gaza", "classification": "security", "score": 0.8247471719227055, "event_breakdown": "- American Central Command published pictures of the progress of the construction of the floating pier off the coast of Gaza.\n- Reports suggest that the British are considering sending soldiers to secure the pier."}, {"id": "c11db2c4-91a5-4f0a-a808-fe655c66c33a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26499/", "date": "2024-04-30 08:15", "message": "More about the anti-Semitic demonstrations on US campuses:\n\nMIT University issued an ultimatum to students to end the protest within 24 hours.\n\nColumbia University began suspending students who did not end the protest.", "location": "MIT University", "classification": "antisemitism", "score": 0.37022353244060985, "event_breakdown": "- Prime Minister and Minister Ben Gvir make two public promises regarding entry to Rafah. Arab and Palestinian media extensively quote the promises.\n- NYPD buses with the detainees from tonight leave the grounds of Columbia University.\n- Missile attack targets educational institution in Odesa's seafront park, killing five and injuring 32. Roof of private law academy destroyed in strike in Odesa. Odesa Mayor Trukhanov expresses shock in Telegram video following the attack. President of academy, former MP Serhiy Kivalov, among the injured, reports public broadcaster Suspilne. Odesa continues to face frequent Russian missile and drone attacks, with port infrastructure being a particular target.\n- Iran launches around 300 weapons from Iran, Syria, and Yemen, including ballistic missiles, land-attack cruise missiles, and unmanned aerial vehicles. Attack characterized as major effort by Iran to inflict pain on Israel. Only a few Iranian weapons penetrate defenses, causing little material damage. Hypothetical scenario raised: consequences if all 300 Iranian weapons had penetrated defenses.\n- Houthi rebels from Yemen launch missile attack in Red Sea. Attack damages ship in latest assault targeting maritime traffic in strategic waterway.\n- 16-year-old Sydney boy charged with terrorism offenses denied bail due to concerns for community safety. Court hears boy messaged another young person stating \"we're going to kill.\" Six teenagers charged after counter-terrorism raids in Sydney, two appear in children's court at Parramatta. Text message presented in court suggests planning for a terrorist attack. Parents of 16-year-old describe him as an \"excellent son\" and good student in affidavit. Material allegedly includes video of assault with Islamic State symbol watermarked over it.\n- Survey by Harvard Harris Institute shows clear majority among American public for military operation in Rafah. 72% of respondents support operation in Rafah.\n- MIT University issued an ultimatum to students to end the protest within 24 hours.\n- Columbia University began suspending students who did not end the protest."}, {"id": "5e931d48-4432-4e4f-9a71-a82581a08591", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65799/", "date": "2024-04-30 08:15", "message": "Kevin Stitt, Governor of Oklahoma (Republican) on the protesters for Hamas:\n\nThis is a small and vocal minority that must bear responsibility for its actions.\n\nI wish they would have seen the GoPro camera videos of Hamas operatives from Oct 7th\n\nI would kick them out of the colleges.\n\nThey need a psychiatric evaluation.\n\nThere is no place for hate speech in Oklahoma.", "location": "Oklahoma", "classification": "antisemitism", "score": 0.7415916233952934, "event_breakdown": "- Kevin Stitt, Governor of Oklahoma (Republican) makes statements regarding protesters for Hamas\n- Stitt wishes protesters would have seen GoPro camera videos of Hamas operatives from October 7th\n- Stitt calls for protesters to be kicked out of colleges and undergo psychiatric evaluation\n- Stitt emphasizes there is no place for hate speech in Oklahoma."}, {"id": "80a9b0b3-d6ca-4f27-842e-81d93672bd48", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26495/", "date": "2024-04-30 05:48", "message": "And how it ended", "location": "Dallas, Texas", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "- Protesters clash with police at Taksim Square in Istanbul\n- Demonstrators occupy Gezi Park to prevent its demolition\n- Protests spread to other cities in Turkey including Ankara and Izmir\n- Government cracks down on protesters with tear gas and water cannons\n- International condemnation of government's handling of protests\n- Government eventually agrees to halt the park's redevelopment\n- Protests gradually dissipate as government offers minor concessions and uses force to clear the demonstrations."}, {"id": "b245b0f9-5120-40d3-99b5-123c66bf7e9f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26491/", "date": "2024-04-30 05:46", "message": "Virginia Commonwealth University, Virginia, USA:\n\nHow it started", "location": "Virginia Commonwealth University", "classification": "security", "score": 0.42015051221981486, "event_breakdown": "null"}, {"id": "1255d945-8fb5-4926-ab25-a962516ff499", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26487/", "date": "2024-04-29 20:35", "message": "The financial markets are smiling at the new president of Argentina:\nThe Argentine peso is the currency that jumped at the highest rate in the world against the dollar in the last 3 months (since Javier Milei was elected president of Argentina).\nThe Argentine currency strengthened by 25% during this period.", "location": "Argentina", "classification": "world", "score": 0.43392220763195205, "event_breakdown": "1. The Argentine peso experiences the highest rate jump against the dollar in the last 3 months.\n2. The Argentine currency strengthens by 25% during this period."}, {"id": "409098c1-e0f0-4e94-acc3-05c7cd3dba01", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26486/", "date": "2024-04-29 20:34", "message": "Hamas: The movement's delegation arrived in Cairo today to consult and clarify a number of issues in the latest proposal. Inquiries and clarifications were made with the mediators - the Qataris and the Egyptians. The Hamas delegation will leave Cairo (for Doha, the capital of Qatar) for further consultations (within the movement).", "location": "Cairo", "classification": "security", "score": 0.6150094041786179, "event_breakdown": "- Hamas delegation arrives in Cairo for consultations on latest proposal\n- Hamas delegation makes inquiries and clarifications with Qatari and Egyptian mediators\n- Hamas delegation to leave Cairo for Doha for further consultations"}, {"id": "e95a0c35-2103-485d-8540-84c79207c88f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26484/", "date": "2024-04-29 19:37", "message": "Must watch:\nThis is how a Palestinian described his visit to the Auschwitz-Birkenau extermination camp in a video shared on Gaza channels:\n\"God wiling you will return to the camp...you belong here.\"\nHis take is not out of the ordinary among Palestinians.", "location": "Auschwitz-Birkenau", "classification": "antisemitism", "score": 0.23996110688309147, "event_breakdown": "1. A Palestinian describes his visit to the Auschwitz-Birkenau extermination camp in a video shared on Gaza channels.\n2. The Palestinian expresses a desire for others to return to the camp, stating \"you belong here.\"\n3. The viewpoint of the Palestinian is noted as being common among Palestinians."}, {"id": "088fead3-8a78-4f67-aa2e-c4dc3d83e262", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26481/", "date": "2024-04-29 18:52", "message": "PA Chairman Abu Mazen met tonight in Saudi Arabia with Saudi Crown Prince Muhammad bin Salman.", "location": "Riyadh, Saudi Arabia", "classification": "security", "score": 0.8201277390222063, "event_breakdown": "- PA Chairman Abu Mazen met tonight in Saudi Arabia with Saudi Crown Prince Muhammad bin Salman."}, {"id": "6ffcfaa6-d719-4095-870e-caeedd7f1f21", "channel_id": 1560386984, "url": "", "date": "2024-04-29 18:52", "message": "Ismail Haniyeh, chairman of the political bureau of Hamas, continues to receive an audience in Istanbul, this time Algerian members of parliament as well as members of Turkish parties.\nThe official excuse: they come to console him for the death of his sons and grandsons in an IDF attack a few weeks ago.", "location": "Istanbul", "classification": "security", "score": 0.9058050621174512, "event_breakdown": "- Ismail Haniyeh receives an audience in Istanbul from Algerian members of parliament and members of Turkish parties to console him for the death of his sons and grandsons in an IDF attack."}, {"id": "34fe5186-49ef-4726-ac76-be5cf8448ac5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26477/", "date": "2024-04-29 18:47", "message": "The IDF spokesperson announced the death of two reservists in battle in the center of the Gaza Strip.\n\nMay their memories be a blessing.", "location": "Gaza Strip", "classification": "security", "score": 0.944319386655642, "event_breakdown": "- Death of two IDF reservists in battle in the center of the Gaza Strip"}, {"id": "a7e2ff88-9255-4f96-9ee5-e94fa5f3e248", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26476/", "date": "2024-04-29 17:29", "message": "New York: A large number of American police officers are gathering near the entrance gate of Columbia University ahead of the planned start of a march against Israel and shortly before the expiration of the ultimatum to remove the protest from the campus.", "location": "Columbia University", "classification": "security", "score": 0.5594224391550054, "event_breakdown": "- Gathering of American police officers near the entrance gate of Columbia University ahead of a march against Israel\n- Gathering happening shortly before the expiration of the ultimatum to remove the protest from the campus"}, {"id": "2d611623-8cd5-40db-9a72-b7b72de830ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26472/", "date": "2024-04-29 16:06", "message": "Paris: French police evacuate the anti-Israel encampment set up by students at Sorbonne University.", "location": "Sorbonne University", "classification": "security", "score": 0.8753638409910214, "event_breakdown": "- French police evacuate anti-Israel encampment set up by students at Sorbonne University in Paris."}]