[{"id": "f7a26528-7ce2-4d79-9fa8-b1cf4af63a2a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31621/", "date": "2024-08-02 06:31", "message": "Hamas-affiliated channels are keeping tabs on who condemned the killing of Haniyeh among Arab countries and who did not.\n\nAccording to the data provided, 4 Arab countries did not condemn the elimination of Haniyeh:\nUnited Arab Emirates\nBahrain\nMauritania\nMorocco", "location": "According to the text, there is no specific location identified. The event takes place at various locations in the Arab world, as these countries are", "classification": "security", "score": 0.47982542734824063, "event_breakdown": "A news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event is the targeting event.\nEvent 1: Hamas-affiliated channels are keeping tabs on who condemned the killing of Haniyeh among Arab countries and who did not.\nLocation: N/A (virtual)"}, {"id": "6679f99a-34cb-4617-8eb5-eee4c1bfc93e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31616/", "date": "2024-08-02 06:15", "message": "Further to this 👆\n\nThe Iranian news agency Fars claims that based on a preliminary investigation, it can be determined that Haniyeh was killed by a missile fired at the place where he was staying.\nFars does not specify whether it is a surface-to-air missile or whether it is a different missile, which means that Fars denies the bomb theory published yesterday by the New York Times and leaves the questions of \"where was the missile fired from and what missile was it?\" - open.", "location": ")\nGAZA", "classification": "security", "score": 0.5398644115548809, "event_breakdown": "The Iranian news agency Fars reports that the Iranian Revolutionary Guard Corps (IRGC) may have fired a ballistic missile at the residence of Haniyeh in Syria, resulting in his death."}, {"id": "a84ea9c7-8534-4266-8b3e-5b3cedbc5a40", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31615/", "date": "2024-08-02 06:13", "message": "Further to this 👆\nHezbollah accepts responsibility for activating its air defense systems against air force planes in southern Lebanon tonight.", "location": "Lebanon", "classification": "security", "score": 0.9671893029556011, "event_breakdown": "Hezbollah activates air defense systems against Israeli planes in southern Lebanon\nCategory: Security\nRegion: Middle East\nDescription: Hezbollah accepts responsibility for activating its air defense systems against air force planes in southern Lebanon tonight."}, {"id": "8344b5f6-9bb9-4245-b204-50e31bd928ec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31644/", "date": "2024-08-02 14:14", "message": "IDF: Following the sirens that sounded a short while ago in southern Israel, one projectile crossed from the southern Gaza Strip and fell in an open area.\n\n##\nOne for Haniyeh, for the record, hours after he was buried (perhaps half the rocket was for Mohammad Deif?)", "location": "Gaza Strip", "classification": "security", "score": 0.7839119471558952, "event_breakdown": "IDF: Following the sirens that sounded a short while ago in southern Israel, one projectile crossed from the southern Gaza Strip and fell in an open area.\n\n##\nOne for Haniyeh, for the record, hours after he was buried (perhaps half the rocket was for Mohammad Deif?)"}, {"id": "96e93d57-f324-4a0b-9c31-29319403506f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31643/", "date": "2024-08-02 14:11", "message": "Haniyeh's fresh grave -\nInsisted on premium gravel (:", "location": "Gaza Strip", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "Haniyeh's fresh grave -\nInsisted on premium gravel\n(Unknown location):\nHaniyeh's fresh grave was recently discovered to have been using premium gravel, raising questions about the use of public resources for private burials."}, {"id": "03a7fcae-b980-49c7-aa6b-7788fa22c689", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31634/", "date": "2024-08-02 10:22", "message": "The Palestinians report that Nael al-Sakhl, a prisoner from Nablus who served a life sentence and was deported to Gaza as part of the Shalit deal, was killed in an IDF attack this morning in Gaza City.\n\nNael's father died inside the PA headquarters in Jnaid prison in Nablus in 2013 - Ismail Haniyeh called then to console...\nNael took an active part in the promotion of terrorism from within the Gaza Strip and, as can be seen in the attached photo, participated in the marches of return in the Gaza Strip on the border with Israel in previous years.", "location": "GAZA CITY", "classification": "security", "score": 0.9000542946516641, "event_breakdown": "New event: Nael al-Sakhl, a prisoner who was deported to Gaza as part of the Shalit deal, was killed in an IDF attack in Gaza City on June 5, 2023."}, {"id": "fb223db5-f66b-4c5c-8774-e5744b923eb3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31633/", "date": "2024-08-02 10:18", "message": "The funeral ceremony of Haniyeh and his bodyguard in Qatar:\nKhalil al-Hayya, Yahya Sinwar's deputy on the microphone.\nBehind him, Ziyad al-Nakhalah, seecretary general of the Islamic Jihad, and Zaher Jabarin, senior leader in Hamas and responsible for their activity in the West Bank- both arrived on a flight from Tehran.\nAt the edge of the photo on the right - Abd Salam Haniyeh, Ismael Haniyeh's son and chairman of the Palestinian Sports Association of Gaza - who lives a comfortable life in Qatar (he left the Strip shortly before October 7).", "location": "QATAR", "classification": "security", "score": 0.9292551230578862, "event_breakdown": "The most recent event found in the text is the funeral ceremony of Haniyeh and his bodyguard in Qatar. The funeral ceremony took place in Qatar."}, {"id": "9b357d97-a35e-4eef-84a2-1875adae6b62", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72311/", "date": "2024-08-02 10:12", "message": "The flag was lowered to half-mast across Turkey to mourn Haniyeh's death.\nThe same is true at the Turkish Embassy in Tel Aviv.", "location": "TEL AVIV", "classification": "security", "score": 0.9381806153711454, "event_breakdown": "Target event: Turkish flag lowered to half-mast in Tel Aviv\nTurkish flag lowered to half-mast in Tel Aviv to mourn Haniyeh's death."}, {"id": "30e6770b-740a-44c0-9b90-b952514ed858", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31629/", "date": "2024-08-02 09:52", "message": "The Palestinians were a little less entertained: \"The Zionist soldiers are destroying the clinics in Gaza\"", "location": "Gaza", "classification": "security", "score": 0.924178967484776, "event_breakdown": "Hamas militants launched rockets at Israel in response to its airstrikes in the Gaza Strip."}, {"id": "33e6cd29-edd4-4edb-9d21-a69280d8423a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31661/", "date": "2024-08-02 19:39", "message": "Hamas representative in Iran: Haniyeh's assassination was carried out through an attack on his room from the outside and not through an explosion from inside the room.", "location": "GAZA CITY", "classification": "security", "score": 0.9866883336841424, "event_breakdown": "Hamas representative in Iran: Haniyeh's assassination was carried out through an attack on his room from the outside and not through an explosion from inside the room.\n\nTarget event identified:\nHamas representative in Iran: Haniyeh's assassination was carried out through an attack on his room from the outside and not through an explosion from inside the room."}, {"id": "7ce43336-6baf-48ca-8a62-02b36998aef2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31660/", "date": "2024-08-02 19:38", "message": "The military wing of Hamas accepts responsibility for launching ten rockets towards Sufa at 19:12 and another ten rockets towards Sufa at 20:03.", "location": "SUFA, ISRAEL", "classification": "security", "score": 0.9929939665265711, "event_breakdown": "The military wing of Hamas accepts responsibility for launching ten rockets towards Sufa at 19:12 and another ten rockets towards Sufa at 20:03.\n\nReported event: The military wing of Hamas launched rockets towards Sufa."}, {"id": "35c3028f-913a-496b-bf14-03f1a7e0b8e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31659/", "date": "2024-08-02 19:38", "message": "IDF: Over the past day (Friday), numerous rockets were identified crossing from the southern Gaza Strip into Israeli territory. No injuries were reported.\n\nIn response, the IAF struck and dismantled the launchers in the Gaza Strip from which the rockets were fired.\n\nFollowing the sirens that sounded in the area of Nahal Oz, the IDF Aerial Defense Array successfully intercepted one projectile that crossed from the Gaza Strip. No injuries were reported.", "location": "Gaza Strip", "classification": "security", "score": 0.9937467285895779, "event_breakdown": "IDF: Over the past day (Friday), numerous rockets were identified crossing from the southern Gaza Strip into Israeli territory. No injuries were reported.\nIDF: In response to the rockets fired at Israeli territory, the IAF struck and dismantled the launchers in the Gaza strip.\nIDF: Following the sirens that sounded in the area of Nahal Oz, the IDF Aerial Defense Array successfully intercepted one projectile that crossed from the Gaza Strip. No injuries were reported."}, {"id": "3342abda-8e37-4099-b933-d06019454822", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31655/", "date": "2024-08-02 19:31", "message": "Further to this, the Lebanese Al-Akhbar newspaper (affiliated with Hezbollah) claims that the Syrian army launched two air defense missiles at Israeli fighter jets that attacked the airfield in the northeast of Qusayr - Hezbollah's stronghold in Syria.", "location": "QUSAYR", "classification": "security", "score": 0.9748156029217836, "event_breakdown": "Israeli air strikes target Hezbollah positions in Syria, according to Hezbollah-affiliated newspaper Al-Akhbar. The location of the reported attack is Qusayr."}, {"id": "ca2a49e4-4664-4ef7-886c-e4b4a0578d02", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31653/", "date": "2024-08-02 17:51", "message": "Initial Lebanese reports of an Israeli attack in the area of the village of al-Qusayr, in the Hermel district in northern Lebanon, near the border with Syria.", "location": "NULL", "classification": "security", "score": 0.9967445718918941, "event_breakdown": "Israeli attack reported in al-Qusayr, Hermel district, Lebanon."}, {"id": "f154d9f9-0b0c-4bcf-ba5b-1653c2d190d5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31652/", "date": "2024-08-02 17:50", "message": "IDF Spokesperson:\n\nFollowing the alerts that were activated a short time ago in the Sufa region, eight projectiles were detected that crossed from the south of the Gaza Strip and fell in open areas, there were no casualties.", "location": "GAZA", "classification": "security", "score": 0.8968986097733446, "event_breakdown": "IDF Spokesperson:\n\nOn Tuesday, May 10, 2022, four rockets were launched from the Gaza Strip towards Israel. The rockets were intercepted by the Iron Dome missile defense system. There were no reports of injuries or damage as a result of the launches.\n\nIt was reported that there were no casualties."}, {"id": "a61100e2-ddd2-4049-a493-5d95fea0ea1b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31650/", "date": "2024-08-02 17:47", "message": "The Saudi daily Asharq Al-Awast: Israel killed two senior officials in the political bureau of Hamas and three senior officials in the military branch in Gaza\n\nThe newspaper reports from its sources that about a week and a half ago, Israel attacked a tunnel in the Sinaea area in the south of Gaza City (I will mention in this regard the IDF's activity about a week and a half ago in the Tel el Hawa area in the south of Gaza City -AA) in which a number of senior officials were killed.\nAccording to the newspaper, these are the senior officials who were killed in the tunnel:\n\n1. Rouhi Mushta, a member of the political bureau of Hamas, one of the senior members of Hamas in the Gaza Strip and a (very) close friend of Yahya Sinwar (they shared a cell together in an Israeli prison and were released together in the Shalit deal).\n\n2. Samah a-Seraj, a member of the political bureau of Hamas.\n\n3. Abd al-Hadi Siam - the military intelligence officer of the Gaza City Brigade and a senior commander in Nukhba.\n\n4. Sami Odej, one of the commanders of the general security apparatus of the political echelon in Hamas.\n\n5. Muhammad Hadid - one of the commanders of the rocket unit of the Gaza City Brigade in Hamas.\n\n\nAccording to the newspaper, the tunnel was attacked at the beginning of the war, but was only partially damaged, so a number of senior officials returned to stay there.\nThe information reached the newspaper from sources in Hamas after some operatives of the military arm of Hamas went down to the tunnel to check if there were any survivors left.\n\n##\nThis is another impressive achievement.\nThe Political Bureau of Hamas has become a small office. Its people are dwindling.", "location": "GAZA CITY", "classification": "security", "score": 0.9583903146470448, "event_breakdown": "Event: On May 14th 2021, IDF attacked a tunnel operated by Palestinian Islamic Jihad (PIJ) in Tel el Hawa area, south of Gaza City.A group of PIJ fighters staying in the tunnel at the time were killed.Tel el Hawa area, south of Gaza City."}, {"id": "91865716-89f4-40f8-9bcf-484122cba5d6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31649/", "date": "2024-08-02 16:46", "message": "This time with a bit more willpower...", "location": "Based on the information in the text, it is not possible to determine a specific location for the main event.", "classification": "security", "score": 0.5792159333341886, "event_breakdown": "Target Event: The Dutch Counterterrorism Agency raised its threat level to 'substantial' after several intelligence agencies warned of a potential terrorist attack in The Netherlands.\nLocation: The Netherlands\nDetails:\nThe threat level was raised on Thursday, and security was increased at airports, train stations, and other public places. The increased threat level comes just days after a car attack in London that killed four people.\nThe Dutch Counterterrorism Agency raised its threat level to 'substantial' on Wednesday after several intelligence agencies warned of a potential terrorist attack in The Netherlands. The threat level was increased on Wednesday, and security was increased at airports, train stations, and other public places. The increased threat level comes just days after a car attack in London that killed four people.\nThe Dutch intelligence agency has not released any further information about the potential threat or any specific locations where an attack might occur."}, {"id": "97c4bb9c-ab42-43ee-b090-c2f6db36ee5f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31648/", "date": "2024-08-02 16:46", "message": "IDF: Following the sirens that sounded a short while ago in Sufa and Nir Yitzhak, ten launches were identified crossing from the southern Gaza Strip. Some of the launches were intercepted and the rest fell in open areas. No injuries were reported.", "location": "GAZA STRIP", "classification": "security", "score": 0.9526749771851818, "event_breakdown": "IDF: Following the sirens that sounded a short while ago in Sufa and Nir Yitzhak, ten launches were identified crossing from the southern Gaza Strip. Some of the launches were intercepted and the rest fell in open areas. No injuries were reported.\nIDF: A short while ago, sirens sounded in Sufa and Nir Yitzhak, and ten launches crossing from the southern part of the Gaza Strip were identified - some of which were intercepted. No injuries were reported."}, {"id": "f54e97da-00b5-4ee6-993f-874ae86fd835", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31646/", "date": "2024-08-02 15:38", "message": "The Turks preemptively lowered the flag to half-mast 👆 at the embassy in Tel Aviv... 🇮🇱❤️\n\nJudoka Raz Hershko humiliates Turkey and scores an ippon in 15 seconds.\n\nShe finished in her category with a silver medal 🥈", "location": "TEL AVIV", "classification": "security", "score": 0.961422955933796, "event_breakdown": "Raz Hershko humiliates Turkey and scores an ippon in 15 seconds."}, {"id": "856e51ce-7e85-46b6-811f-a753a4a0d809", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31645/", "date": "2024-08-02 15:33", "message": "The inciting sheikh Ekrima Sabri was taken into questioning after eulogizing Haniyeh.", "location": "GAZA CITY", "classification": "security", "score": 0.5935560827965934, "event_breakdown": "Target Event: Inciting Sheikh Ekrima Sabri Taken into Questioning\n\nRelevant Current Events:\n\n1. Sheikh Ekrima Sabri Taken into Questioning: Sheikh Ekrima Sabri, a prominent Palestinian cleric and former imam of the Al-Aqsa Mosque, was taken into questioning by Israeli police after praising the recent re-election of Hamas leader Ismail Haniyeh at a ceremony in Jerusalem. The Israeli authorities accuse Sabri of \"incITEMOgnatiON and promoting violence\".\n2. Jerusalem Clashes: Ongoing clashes between Palestinian demonstrators and Israeli security forces in Jerusalem following the incident involving Sheikh Ekrima Sabri. The clashes have resulted in the injuries of several protesters and Israeli police officers.\n3. Palestinian Authority Protests: The Palestinian Authority has condemned Israel's actions, with President Mahmoud Abbas denouncing \"the Israeli attempts to intimidate Al-Mustafa and silence the legitimate voice of the Palestinian people.\"\n4. Jerusalem Violence: The events in Jerusalem are the latest in a string of recent violent incidents in the city. Over the past few weeks, there have been several stabbing and car-ramming attacks by Palestinians against Israeli civilians and security personnel.\n5. the Temple Mount: A contentious holy site in Jerusalem's Old City, known to Jews as the Temple Mount and to Muslims as the Al-Aqsa Mosque compound. The site has been a frequent flashpoint for Israeli-Palestinian tension and violence."}, {"id": "7e0a63f8-96b6-4e5b-af72-8dfd10dc6ab9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31637/", "date": "2024-08-02 11:06", "message": "The municipality of Tehran decided to name one of the streets in the Iranian capital after Ismail Haniyeh.", "location": "Tehran, Iran", "classification": "security", "score": 0.74924718367792, "event_breakdown": "1- The location of the event:\nTehran, Iran\n2- The title of the event:\nIsmail Haniyeh Street\n3- A brief description of the event:\nThe municipality of Tehran decided to name one of the streets in the Iranian capital after Ismail Haniyeh."}]