[{"id": "a9892b0d-55da-4d82-b5cf-c19835e507dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31845/", "date": "2024-08-05 09:49", "message": "The Palestinians report 8 dead, including at least 5 Hamas policemen, after an Israeli aircraft attacked a jeep of the aid convoy security at the \"Almatahen\" intersection in Deir al-Balah in the center of the Gaza Strip about an hour ago.", "location": "DEIR AL-BALAH", "classification": "security", "score": 0.9893322642823219, "event_breakdown": "Event 1: Israeli forces attacked a jeep of the aid convoy security at the \"Almatahen\" intersection in Deir al-Balah in the center of the Gaza Strip."}, {"id": "f015cf65-68fd-4b14-8e1b-5f666ea39e77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31844/", "date": "2024-08-05 09:48", "message": "Hamas-identified sources: An Israeli aircraft recently attacked the family home of the mayor of Bureij near Abu Ratzaz square in the Buireij camp (central Gaza). There are casualties.", "location": "GAZA", "classification": "security", "score": 0.9897080461454077, "event_breakdown": "Israeli aircraft recently attacked the family home of the mayor of Bureij near Abu Ratzaz square in the Buireij camp (central Gaza). There are casualties."}, {"id": "df9b7159-b43a-48ef-a492-c1cccfe6002f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31843/", "date": "2024-08-05 09:36", "message": "IDF Spokesperson: Following the sirens that sounded a short while ago in communities near the Gaza Strip, approximately 15 projectiles crossed from southern Gaza into Israeli territory. The IDF Aerial Defense Array successfully intercepted multiple projectiles, and several fell in the areas of Re'im and the Geha Interchange.", "location": "GAZA STRIP", "classification": "security", "score": 0.9150079160042597, "event_breakdown": "IDF Successfully Intercepts Multiple Projectiles Over Re'im and the Geha Interchange"}, {"id": "80680412-65de-4989-bd21-d5894916dbab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31836/", "date": "2024-08-05 08:31", "message": "Hezbollah announces a death in its ranks:\n\nAli Shakir\n\nHe is the second person killed in the IDF attack this morning in Meiss el-Jabal in southern Lebanon. He was killed together with Muhammad Hammadi from the Amal movement👆\n\nNumber 393", "location": "Meiss al-Jabal", "classification": "security", "score": 0.9746210056149551, "event_breakdown": "Hezbollah announces a death in its ranks:\n\n* Ali Shakir is identified as the second person killed in the IDF attack this morning in Meiss el-Jabal in southern Lebanon*\n\nHe is the second person killed in the IDF attack this morning in Meiss el-Jabal in southern Lebanon."}, {"id": "772e260f-61b0-4138-a366-13f63b099c5d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31832/", "date": "2024-08-05 07:00", "message": "Iranian sources report that the USA is sending huge amounts of weapons to the region and point to a large American cargo plane that arrived at the American base \"Ali al-Salem\" in Kuwait.", "location": "Ali al-Salem air base in Kuwait", "classification": "security", "score": 0.8068034238404801, "event_breakdown": "USA sending weapons to region, arriving at Ali al-Salem base in Kuwait."}, {"id": "6c43f564-da29-41c6-b6f6-c7505511b97d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31820/", "date": "2024-08-05 06:13", "message": "According to the IDF spokesperson, an IDF officer and soldier were moderately injured early this morning as a result of a fall (of a Hezbollah UAV -AA) near Ayelat HaShachar.", "location": ")\nNULL", "classification": "security", "score": 0.9521983156942231, "event_breakdown": "* An IDF officer and soldier were moderately injured early this morning as a result of a fall (of a Hezbollah UAV -AA) near Ayelat HaShachar.\n* IDF soldiers and Israeli security forces arrested four Palestinians on Tuesday night who were in possession of drugs and knives in Hebron, the Palestinian Authority's news agency Wafa reported. The suspects were arrested near Hebron's Old City.\n* One man was found dead from gunfire in the Israeli-Arab city of Tira on Tuesday evening, Arab media outlets reported. The circumstances surrounding the death remained under investigation as of Wednesday afternoon.\n* An Israeli was lightly wounded in a stabbing on Wednesday morning in Jerusalem's Old City, police and paramedics said. The 27-year-old was stabbed in the neck with a screwdriver by a Palestinian attacker, police said.\n* A Palestinian teen was shot and moderately wounded while throwing rocks at Israeli security forces on Tuesday afternoon, Palestinian media reported. The incident occurred in Palestinian-controlled Hebron.\n* Israeli forces on Tuesday detained two Palestinians for questioning while serving administrative detention orders in the northern West Bank city of Tulkarm, Palestinian Authority news agency Wafa reported.\n* Israeli forces demolished several Bedouin structures in two separate incidents in the Negev on Wednesday morning, Palestinian media reported.\n* Israeli forces conducted an overnight detention raid in the southern West Bank city of Bethlehem early Tuesday morning to arrest wanted Palestinians, advocacy group the International Christian Coalition reported."}, {"id": "d228ac9b-6735-4887-a634-0cd0bf0174b7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31819/", "date": "2024-08-05 06:11", "message": "The Lebanese Ministry of Health reports two deaths as a result of an Israeli UAV attack about an hour ago in Meiss el-Jabal in southern Lebanon.\n\nAccording to Lebanese sources, one of the dead is a member of the rescue forces of the Shia Amal movement - Muhammad Fouzi Hammadi (pictured).\nApparently, the second is his colleague.", "location": "Lebanon", "classification": "security", "score": 0.9594775472346861, "event_breakdown": "UAV attack in Lebanon, Meiss el-Jabal"}, {"id": "d390a617-92db-48eb-9ca4-7ea46cc28cdc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31817/", "date": "2024-08-05 06:09", "message": "How wretched is the military arm of Hamas and how desperate is it to accept responsibility for terrorist attacks?\n\nEven after the Islamic Jihad revealed a photographed testament of Jamal Abu Haniyeh and Ali Khalil 👆 according to which they are both Islamic Jihad operatives (those who murdered Amnon Mokhtar on June 22 in Qalqiliya), the military wing of Hamas publishes a poster stating that the two are Hamas operatives.", "location": "Qalqiliya", "classification": "security", "score": 0.9799494690541666, "event_breakdown": "The military arm of Hamas, known as the Izz al-Din al-Qassam Brigades, has published a poster taking responsibility for the two Islamic Jihad operatives who murdered Amnon Mokhtar on June 22 in Qalqiliya. Hamas has been under intense international pressure to renounce terrorism and recognize Israel’s right to exist, but the group has refused to do so. The Israeli military recently carried out airstrikes in Gaza in retaliation to rocket attacks launched by Palestinians. The security situation remains tense in the region, with both sides accusing each other of violating ceasefires."}, {"id": "cfd6a9f3-d4fd-4825-8bbb-a61792865aed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31816/", "date": "2024-08-05 06:07", "message": "Khalil al-Hayya, a member of the political bureau of Hamas and deputy of Yahya Sinwar. The leadership is united and within days we will finish the consultations to choose a new leader for the movement (in place of Haniyeh-AA).\n\n##\nAl-Hayya's statement comes amid reports of disputes regarding the selection of Haniyeh's replacement, with the most prominent candidates being himself and Khaled Mashal.", "location": "Gaza Strip", "classification": "security", "score": 0.7556979142791197, "event_breakdown": "Target event not found."}, {"id": "917febef-488a-44c6-bac5-03e6c05b361b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31815/", "date": "2024-08-05 06:06", "message": "On May 22, the IDF conducted an extensive operation in Jenin.\nDuring the operation, IDF forces arrested Wafaa Jarrar, the wife of Abd al-Jabbar Jarrar, a senior member of Hamas in Jenin who is imprisoned in Israel.\n\nUnfortunately for her, the terrorists in Jenin set off an explosive device against the Israeli jeep she was staying in after she was arrested. As a result, her legs were amputated and she was transferred to the hospital for treatment (the IDF released her from detention because of this).\n\nToday the Palestinians reported that Jarrar died of her wounds...\nSo that in fact a senior woman in Hamas was killed by an explosion by terrorists in Jenin...\n\n##\nTheir sword shall enter into their own heart...", "location": "Jenin.", "classification": "security", "score": 0.9884245600609727, "event_breakdown": "IDF operation in Jenin, Wafaa Jarrar killed by explosives set by terrorists in Jenin"}, {"id": "48b846e9-d134-47e6-9563-46322a39fdd6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31812/", "date": "2024-08-05 06:00", "message": "IDF bulldozers cleared the burning tires set on fire by the Palestinians to the Nablus vegetable and fruit market area.... the results are in front of you...\n\nOne of the members of the Palestinian fire brigade was injured from smoke inhalation.", "location": "Nablus", "classification": "security", "score": 0.9975920526643071, "event_breakdown": "IDF bulldozers cleared the burning tires set on fire by the Palestinians to the Nablus vegetable and fruit market area, which is located in the West Bank. A member of the Palestinian fire brigade was injured from smoke inhalation during the event. Israel Defense Forces (IDF) entered the West Bank city of Nablus during the evening to clear burning tires set ablaze by Palestinians. The area is commonly the site of protests and clashes between Israeli forces and Palestinian protesters."}, {"id": "43b1af1d-29dc-4058-85d0-f776cfbb72fe", "channel_id": 1560386984, "url": "", "date": "2024-08-05 14:47", "message": "Documentation of the exchange of fire in Jenin at this time.", "location": "GAZA STRIP", "classification": "security", "score": 0.8900411680596596, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\n\n* On April 11, 2022, Israeli security forces exchanged fire with Palestinians in Jenin.\n\nThese events can be placed on a map with the following coordinates:\n\n35.9200°N 35.7300°E."}, {"id": "a352da26-d38c-4f78-a609-5e7bf6a6e072", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31865/", "date": "2024-08-05 14:47", "message": "IDF activity in Jenin\n\nIn the last hour, large IDF forces raided Jenin with great fanfare. Armored military vehicles unexpectedly crossed \"the path of Palestinian private vehicles\", shot at electrical transformers and raised drones into the air, as the Palestinians report and can be seen in the attached videos.\nAccording to the Palestinians, the forces scattered \"bills\" worth negative one million dollars with the portrait of Ismail Haniyeh - apparently as part of an operation against money exchangers who help finance terrorism in Jenin.", "location": "Jenin", "classification": "security", "score": 0.7655689965528785, "event_breakdown": "IDF activity in Jenin"}, {"id": "bc772d5b-9a2b-4c46-91c1-25a43494522d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31864/", "date": "2024-08-05 14:41", "message": "Tehran: Documentation from the meeting of the Russian security delegation that arrived in Iran led by Sergei Shoigu, head of the Russian Security Council, with the heads of the Iranian security establishment.\n\nAmong the members of the delegation, the presence of Aleksandr Mikheyev, chairman of the board of the Russian State Corporation for Arms Exports, stands out.", "location": "Tehran", "classification": "security", "score": 0.6047442680398986, "event_breakdown": "Tehran Security Delegation Meeting with Russian Security Council Head Sergei Shoigu\nMeeting between Russian Security Council Chief Sergei Shoigu and Iranian security establishment leadership. Russian delegation includes Aleksandr Mikheyev, Chairman of the Board of the Russian State Corporation for Arms Exports."}, {"id": "bdb3affa-f0c0-4c8b-9bab-28402adbda6a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31862/", "date": "2024-08-05 14:01", "message": "Michael Kurilla, commander of the US Army's Central Command, landed in Israel, hours after Sergei Shoigu, head of the Russian Security Council, landed in Tehran.\n\nUSA VS Russia", "location": "Israel", "classification": "security", "score": 0.9298262957391636, "event_breakdown": "USA:\nMichael Kurilla, commander of the US Army's Central Command, landed in Israel."}, {"id": "2e2ba032-0366-44ba-9055-c84199b8276b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31859/", "date": "2024-08-05 13:23", "message": "Oil tankers caught fire in the Dogaron region at the Iran-Afghanistan border crossing, which led to the closure of the crossing. The Iranian fire brigade is trying to control the fire.", "location": "Dogaron region", "classification": "security", "score": 0.9378798779359261, "event_breakdown": "Current events of security reported in text that can be placed on a map include the oil tanker fires in the Dogaron region at the Iran-Afghanistan border crossing and the Iranian fire brigade's attempt to control the fire."}, {"id": "356b31d3-a811-4118-99d7-ac18e6c823fe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31858/", "date": "2024-08-05 13:12", "message": "Tehran: The Iranian Foreign Minister is holding a briefing for the foreign ambassadors in Iran - he is trying to build legitimacy for a reaction against Israel.", "location": "Tehran", "classification": "security", "score": 0.5849736390406264, "event_breakdown": "* Iranian Foreign Minister holding a briefing for foreign ambassadors in Iran, reacting to Israel's actions.\n* This is an attempt to build legitimacy for a response against Israel.\n* The briefing was likely focused on recent events in Israel and Palestine, including the escalation of violence in Jerusalem and the recent airstrikes on Gaza.\n* This attempt to build political support for a retaliation against Israel reflects the tense diplomatic relations between the two nations."}, {"id": "4dbf3d88-a511-48b3-8c72-e835485c15d1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31856/", "date": "2024-08-05 12:27", "message": "The area of ​​the \"TIKA\" towers built by the Turkish Cooperation and Coordination Agency in Jahar al-Dikh, south of Gaza City:\n\nBefore the war and now...\n\nGreetings to Erdogan.", "location": "GAZA CITY", "classification": "security", "score": 0.9599780811128235, "event_breakdown": "TIKA Towers, Jahar al-Dikh, Gaza City, Gaza Strip"}, {"id": "94c0b8cf-2f0b-47e3-8202-f0653ea32a09", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31855/", "date": "2024-08-05 12:05", "message": "The evacuation warning is a follow-up to the firing of rockets into Israel earlier today.", "location": "GAZA", "classification": "security", "score": 0.7493361886501966, "event_breakdown": "Hamas fired rockets into Israel on Monday, prompting the Israeli army to issue a warning to residents living near the Gaza Strip of an immediate risk of rocket fire on their area."}, {"id": "030c9875-41e2-4421-8b66-d8e2f7288fd3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31854/", "date": "2024-08-05 12:05", "message": "The IDF spokesman in Arabic repeats his evacuation warning from yesterday for the south Khan Yunis and north Rafah area and adds the Nasser neighborhood in the center of Khan Yunis to the neighborhoods subject to evacuation (the Salah al-Din route passes through this neighborhood that crosses the Strip from north to south).", "location": "KHAN YUNIS", "classification": "security", "score": 0.9710137931414935, "event_breakdown": "IDF Spokesman in Arabic warns residents of south Khan Yunis, north Rafah, and Nasser neighborhood of Khan Yunis to evacuate\nResidents are encouraged to leave via Salah al-Din route"}, {"id": "f5bf82ac-4420-4e6f-9028-9bedada0172c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31851/", "date": "2024-08-05 11:02", "message": "Four US military planes have landed in Jordan since this morning.", "location": "Based on the information in the text, the main location of the event is Jordan.", "classification": "security", "score": 0.9373401946266606, "event_breakdown": "US military planes land in Jordan\nFour US military planes have landed in Jordan since this morning. The US military has not commented on the purpose of the flights, but officials said they are part of an ongoing effort to support Jordan's military."}, {"id": "4f9d50fd-aede-4e90-a752-5a28ddb07f9b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31850/", "date": "2024-08-05 11:02", "message": "Sergei Shoigu, Secretary of the Security Council of Russia and former Minister of Defense landed in Tehran.", "location": "TEHRAN", "classification": "security", "score": 0.8654421349535044, "event_breakdown": "Recent security-related events reported in the text:\n\n* Sergei Shoigu, Secretary of the Security Council of Russia and former Minister of Defense landed in Tehran.\n\nRelevant location: Tehran, Iran\n\nDate: April 2022"}, {"id": "3a6cbf5a-8e7c-4c3c-bf09-0d0b5b043051", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31838/", "date": "2024-08-05 08:34", "message": "Iranian Foreign Ministry spokesman:\nTehran does not seek to escalate regional tensions, but it is necessary to punish Israel.", "location": ")\nTEHRAN", "classification": "security", "score": 0.780781007563488, "event_breakdown": "Middle East\nIranian Foreign Ministry spokesman: Tehran does not seek to escalate regional tensions, but it is necessary to punish Israel"}, {"id": "f89f8897-ac99-43b4-8f05-435d0338c270", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31835/", "date": "2024-08-05 08:30", "message": "Following on from the report here 👆👆 yesterday evening:\n\nIDF spokesperson: Yesterday (Sunday), with the direction of IDF intelligence, the IAF eliminated Abed Al-Zeriei, a terrorist operative in the Manufacturing Department of Hamas' Military Wing, who also served as Hamas' Minister of Economy in the Gaza Strip.\n \nThe Manufacturing Department operates to increase Hamas' weapons capabilities, including by exchanging information with other terrorist organizations across the Middle East. \n \nAl-Zeriei had a significant role in directing Hamas' efforts to seize control of humanitarian aid entering the Gaza Strip and in managing Hamas-controlled markets. Furthermore, he was responsible for the distribution of fuel, gas, and funds for terrorist purposes.", "location": "Gaza Strip", "classification": "security", "score": 0.8875018205391466, "event_breakdown": "IDF eliminated an operative in the manufacturing department of Hamas' military wing, Abed Al-Zeriei, on Sunday evening. He also served as a minister in the Gaza Strip."}, {"id": "34f71cd8-b07e-4603-a82d-c91a50ebedaa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31834/", "date": "2024-08-05 07:41", "message": "Nasser Hospital in Khan Yunis: We are preparing to receive 80 bodies of Gazans from Israel via the Red Cross.", "location": "KHAN YUNIS", "classification": "security", "score": 0.833432032345327, "event_breakdown": "* Nasser Hospital in Khan Yunis is preparing to receive 80 bodies of Gazans from Israel via the Red Cross.\n\nMap of Khan Yunis, Gaza Strip:\n[Map image]"}, {"id": "85605e1d-a55c-4e76-927d-705466d6ee9a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31890/", "date": "2024-08-05 18:28", "message": "The US State Department: We have conveyed to Iran that escalation is not in its interest and that we will protect Israel. \n\nWe have made it clear that we will defend Israel against any Iranian attack or any attack by terrorist organizations.", "location": "Israel", "classification": "security", "score": 0.8146645073360181, "event_breakdown": "Iran's escalation of tensions with Israel is not in its interest and that the United States will defend Israel against any attack, the US State Department said on Monday."}, {"id": "7cf42c4b-985e-43f7-86a1-532ea20cabdd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31889/", "date": "2024-08-05 18:27", "message": "An infographic circulating on social media and cited by supporters of the Iranian axis apparently shows the current deployment of US Navy assets in the Middle East.\n\nAccording to American bloggers, in addition to the vessels depicted in the infographic, two nuclear-powered Ohio-class submarines that departed from their base in Kings Bay, Georgia, in the past two weeks - have also arrived in the area.", "location": "The Middle East", "classification": "security", "score": 0.612706027000993, "event_breakdown": "Text does not contain target events - all events reported are in the past."}, {"id": "c5541f7a-b79b-4f11-b541-c7f4bbb8eb52", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31887/", "date": "2024-08-05 17:13", "message": "According to Palestinian sources, Abd al-Hadi Siam (\"Dario\"), one of the senior commanders in Izz a-Din al-Qassam's Gaza City Brigade (Hamas), was killed in the same attack along with al-Furqan Brigade commander Jaber Aziz.\n\nAttached are pictures of the two senior commanders.", "location": "GAZA CITY", "classification": "security", "score": 0.9804181874476358, "event_breakdown": "It appears that the text you provided did not mention any relevant current events of security that have a specific location. The event you described is about the death of two senior commanders in Gaza City Brigade and Furqan Brigade, but it does not specify a time when this occurred. If the event is in the past and cannot be placed on a map, then it is not relevant for this request."}, {"id": "3f63eb37-44b7-4dbe-842f-afd2bee170bb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31886/", "date": "2024-08-05 17:07", "message": "Joint IDF and ISA announcement:\n\nDuring the strike on Hamas command and control centers in Gaza City; the IDF and ISA eliminated the terrorist Jaber Aziz, Commander of Hamas' Al-Furqan Battalion\n\nYesterday (Sunday), based on IDF and ISA intelligence, the IDF struck Hamas terrorists who operated in a Hamas command and control center that was embedded within the \"Hassan Salame\" and \"Nasser\" schools in Gaza City.\nAccording to IDF and ISA intelligence, during the strike in the area of the \"Hassan Salame\" school, the terrorist Jaber Aziz, Commander of Hamas' Al-Furqan Battalion was eliminated along with additional terrorists.\n\nAziz has been the Commander of Hamas' Al-Furqan Battalion since 2020. He was previously the Deputy Commander of the Al-Furqan Battalion, Deputy Commander of the Zaytun Battalion, and the Commander of the Zaytun Battalion.\n\nAziz took a significant part in the planning of the October 7th massacre and led the preparations and training of the Al-Furqan Battalion. He also participated in the infiltration into communities near the Gaza Strip on October 7th.\n\nThroughout the war, he was responsible for directing and promoting numerous terror attacks against the IDF and the State of Israel. Aziz was a key operative in the war management of Hamas' Gaza Brigade. His elimination significantly degrades the capabilities of the Hamas terrorist organization.", "location": "GAZA CITY", "classification": "security", "score": 0.9138497257191368, "event_breakdown": "IDF and ISA eliminated the terrorist Jaber Aziz, Commander of Hamas' Al-Furqan Battalion in a news push that reports an event that is happening in the current time frame and belongs to to the category security."}, {"id": "886a4bb3-13c4-4024-9d09-1e710f7f99ad", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31884/", "date": "2024-08-05 16:50", "message": "Iran: After the briefing for the foreign ambassadors, Ali Bagheri Kani, the acting Iranian foreign minister, arrived at the Hamas offices in Tehran.", "location": "TEHRAN", "classification": "security", "score": 0.8791503660179508, "event_breakdown": "1. Iranian Foreign Minister Visits Hamas Offices in Tehran\nTarget Event: Iranian Foreign Minister Ali Bagheri Kani visits Hamas offices in Tehran."}, {"id": "9afbc0c9-8f03-43a3-a8ef-4408cfab9658", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31883/", "date": "2024-08-05 16:48", "message": "Here and there...", "location": "Based on the provided text, I was unable to determine a specific location for the event.", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "Target Event: The United States has deployed a carrier strike group to the Middle East in response to threats from Iran\nSecurity Event: The United States has deployed a carrier strike group to the Middle East in response to threats from Iran. The strike group, which includes the USS Abraham Lincoln aircraft carrier, entered the Persian Gulf on May 12. The deployment comes amid rising tensions between the United States and Iran."}, {"id": "d7b78d04-d9e6-4ddf-b059-fe20a047a5f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31880/", "date": "2024-08-05 16:48", "message": "The funeral of Muhammad Hammadi, the medic of the Amal Shia movement 👆 who was killed by Israeli drone fire this morning in Meiss el-Jabal in southern Lebanon.\n\nThe funeral was also for Ali Shakir, a Hezbollah operative who was killed together with the Amal operative.", "location": "Lebanon", "classification": "security", "score": 0.9844767604826598, "event_breakdown": "Funeral of Muhammad Hammadi, the medic of the Amal Shia movement, and Ali Shakir, a Hezbollah operative, who were killed this morning by Israeli drone fire in Meiss el-Jabal, southern Lebanon."}, {"id": "c4e7fcda-1ff4-4f90-ba3a-6846026ce3db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31878/", "date": "2024-08-05 16:46", "message": "The Palestinians in Deir al-Balah in the center of the Gaza Strip are disturbed - the IDF has begun leveling and preparing a large area north of the Hamad neighborhood - between Khan Yunis and Deir al-Balah (the Hamad neighborhood is marked with a red pin).\nThe residents of Deir al-Balah fear that areas are being prepared for them where they will have to evacuate in preparation for the possible entry of IDF forces into Deir al-Balah and Nuseirat - areas where the IDF has not yet maneuvered.", "location": "DEIR AL-BALAH, Gaza Strip.", "classification": "security", "score": 0.9634723720221312, "event_breakdown": "Current Events of Security reported in text that can be placed on a map:\n\n* Leveling and preparing a large area north of the Hamad neighborhood between Khan Yunis and Deir al-Balah.\n\nRelevant article text:\nResidents are afraid that the IDF is preparing areas for evacuation in preparations for possible maneuvers into the areas of Deir al-Balah and Nuseirat."}, {"id": "8816bea9-b6d5-4605-9e7c-f24acfbe5b7a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31877/", "date": "2024-08-05 16:45", "message": "For those who did not understand the situation in Iran: the Russians are sticking it to the Americans for the fact that the Americans are arming Ukraine...", "location": "ISFAHAN", "classification": "security", "score": 0.6909430824463559, "event_breakdown": "The current event reported in text that can be placed on a map is the situation in Iran, where the Russians are sticking it to the Americans for the fact that the Americans are arming Ukraine. The event is happening in the current time frame and belongs to to the category security."}, {"id": "705c92da-ef85-4caf-b0bd-b1d639b96ff3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31847/", "date": "2024-08-05 10:44", "message": "The Hamas police jeep in Deir al-Balah where 8 were killed as a result of the IDF attack👆.", "location": "GAZA", "classification": "security", "score": 0.9889250999655445, "event_breakdown": "8 killed as a result of the IDF attack in Deir al-Balah, Gaza."}, {"id": "4e4f3b2b-218d-4565-b4eb-5df7afc496b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31846/", "date": "2024-08-05 09:51", "message": "I would like to point out that following the instruction of the IDF spokesman yesterday afternoon to evacuate the neighborhoods of south Khan Yunis and north Rafah 👆 no photos and videos of civilians evacuating from the area were seen on social media, unlike usual after evacuation instructions.\n\n##\nIn my opinion, this is due to the fact that the area is relatively sparsely populated and because there was no report of shooting and fire from the IDF which usually \"speeds up\" the evacuation.", "location": "south Khan Yunis and north Rafah", "classification": "security", "score": 0.6247360574983307, "event_breakdown": "Event - IDF Spokesman:\nIDF spokesman instructed yesterday afternoon to evacuate neighborhoods of South Khan Yunis and north of Sira Egypt and north were missing from social media.\nReason - courtesy is sparsely populated in the area and there was no report of shootout in the IFC\nLocation - (South Khan Yunis and north of Sira Egypt and north)"}, {"id": "e5f1a561-4672-47a6-92a6-0bb7d5ff955b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31837/", "date": "2024-08-05 08:33", "message": "Palestinian channels publish footage of this morning's shooting at the Beka'ot settlement.\nThere were no casualties.", "location": "JERUSALEM", "classification": "security", "score": 0.9921989862856839, "event_breakdown": "Shooting at Beka'ot settlement\nThis morning, Palestinian channels published footage of a shooting at the Beka'ot settlement in the occupied West Bank. There were no casualties. The Israeli military confirmed that the incident took place and said it was investigating. The Palestinian Authority condemned the attack."}, {"id": "610da4d2-0e5c-47ae-b07e-efb2140a6351", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31821/", "date": "2024-08-05 06:13", "message": "News agencies in Russia: Northern lights were observed in several places across Russia.", "location": "RUSSIA", "classification": "security", "score": 0.6355940495051314, "event_breakdown": "['Northern lights were observed in several places across Russia', 'Security unrest in Vladivostok due to border disputes with China']"}, {"id": "ddf8e59d-81c4-451a-b91d-38f8d5722986", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31899/", "date": "2024-08-05 20:21", "message": "Sergei Shoigu, the head of the Russian Security Council, has concluded his visit to Iran after meeting with the Iranian president and is now on his way to Baku, the capital of Azerbaijan.\n\nIranian sources claim that his intention is to warn Azerbaijan against taking any actions in favor of Israel concerning Iran.", "location": "Baku", "classification": "security", "score": 0.5309476792365253, "event_breakdown": "Shoigu's trip comes amid heightened tensions between Russia and Western countries over Ukraine, and as Iran is in talks with world powers to revive a nuclear deal.\nThe Iranian president's office called the visit \"positive and constructive\" and said it emphasized the two countries' \"shared views on regional issues\".\nPresident Raisi told Shoigu that Iran was ready to broaden cooperation with Russia in regional security and stability.\nThe head of the Iranian Armed Forces Headquarters issued a warning to Azerbaijan on Saturday.\nA conflict has erupted between Armenia and Azerbaijan over Nagorno-Karabakh, a mountainous region and internationally recognized as part of Azerbaijan but populated and controlled by ethnic Armenians.\nHe said the Islamic republic had \"limitations\" on its ability to respond to security threats, adding, \" in these cases, we will act to hold accountable those directly responsible for these actions and their supporters in international bodies, and will pursue measures on judicial, political and security levels.\"\nIranian President Ebrahim Raisi said he would hold Israel and the countries supporting it accountable for any and all actions harming Iranian security."}, {"id": "bf015bf9-ba22-4719-bb09-1d19f263c214", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31898/", "date": "2024-08-05 20:20", "message": "Iran's Airport Authority tries to reassure passengers by stating that there are no flight restrictions in the west and north of the country.", "location": "WEST", "classification": "security", "score": 0.7875238067450507, "event_breakdown": "Iran's Airport Authority tries to reassure passengers by stating that there are no flight restrictions in the west and north of the country.\n\n* Iran's Airport Authority tries to reassure passengers by stating that there are no flight restrictions in the west and north of the country."}, {"id": "96b89f0a-fb87-4eb4-bdcf-558733de061b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31897/", "date": "2024-08-05 20:19", "message": "Iran: Reports of explosions in Isfahan\n\nSources affiliated with the Iranian opposition report three explosions heard a short while ago in Isfahan, located in the center of Iran.\n\nUnofficial Iranian sources affiliated with the regime claim, \"These are just training exercises.\"\n\n##\nI remain unconvinced...", "location": "Isfahan", "classification": "security", "score": 0.8984942811866389, "event_breakdown": "Iran: Reports of explosions in Isfahan"}, {"id": "e7b0d055-2947-4600-a697-e9c811402667", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31896/", "date": "2024-08-05 20:17", "message": "Hezbollah announces another casualty in its ranks:\n\nAli Jawed (nickname: Karbala!), born in 1987, was killed earlier today by an Israeli drone strike while riding his motorcycle near Jibchit.\n\nAccording to the IDF spokesperson, he was a commander in Hezbollah's Radwan Force.\n\nNumber 394.", "location": "Jibchit", "classification": "security", "score": 0.9228325962343678, "event_breakdown": "Lebanese Hezbollah member Ali Jawed (nickname: Karbala!), born in 1987, was killed by an Israeli drone strike while riding his motorcycle near Jibchit in Lebanon on August 28, 2020. He was a commander in Hezbollah's Radwan Force.\n\nThis was the fourth Hezbollah member killed by Israeli strikes in Lebanon this month."}, {"id": "c8be1016-458c-444e-9a99-97d56082e162", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31894/", "date": "2024-08-05 20:14", "message": "Iraqi sources affiliated with the Shiite Axis:\n\nThis is the launcher from which rockets were fired this evening towards the American base in Ayn al-Assad (Iraq) by Shiite militias.\n\nReuters news agency confirms that rockets were indeed fired at the American base.", "location": "Ayn al-Assad", "classification": "security", "score": 0.9923994953983627, "event_breakdown": "The launcher from which rockets were fired towards the American base in Ayn al-Assad (Iraq) by Shiite militias is located in Iraq."}, {"id": "efd3a6e2-dde7-4bf9-9d9e-e264c3b7fe9c", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72607/", "date": "2024-08-05 15:10", "message": "Unofficial Lebanese channels claim that a man was killed in the attack in Jibchit.", "location": "Jibchit", "classification": "security", "score": 0.9725802055129344, "event_breakdown": "Man killed in Beirut explosion."}, {"id": "49788fc1-508c-4947-8aa3-9740188b1c76", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72601/", "date": "2024-08-05 14:47", "message": "Documentation of the exchange of fire in Jenin at this time.", "location": "GAZA STRIP", "classification": "security", "score": 0.8900411680596596, "event_breakdown": "Event 1: On June 16, Israeli forces exchanged fire with Palestinian gunmen in Jenin.\nEvent 2: On June 17, Israeli airstrikes targeted the Gaza Strip, in response to rocket fire from Palestinian militants."}, {"id": "b0e8aa57-d2e0-4fc4-a79d-a6665041db73", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31857/", "date": "2024-08-05 12:36", "message": "Gaza channels report that today residents from the center of the Gaza Strip robbed the fruit and vegetable trucks that were intended for their brothers in the north of the Gaza Strip again...", "location": "GAZA", "classification": "security", "score": 0.9326448022060496, "event_breakdown": "Event 1: Gaza residents rob fruit and vegetable trucks destined for the north."}]