[{"id": "35642faa-0951-4618-8c89-0520757920e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26690/", "date": "2024-05-05 08:12", "message": "The IDF and Israeli Shit Bet announce that senior Islamic Jihad commander Aiman Zaarab was killed in a targeted strike,\n\nAccording to the announcement, Zaarab took part in the Oct. 7th attacks, and lead terrorist from the PIJ's elite Nukhba Force in their attack on the Kibbutz of Sufa and a neighboring military outpost.", "location": "Sufa", "classification": "security", "score": 0.9804161595100885, "event_breakdown": "- The IDF and Israeli Shin Bet announce the targeted strike killing senior Islamic Jihad commander Aiman Zaarab at a location in Gaza. \n- Zaarab took part in the October 7th attacks and led terrorists from the PIJ's elite Nukhba Force in their attack on the Kibbutz of Sufa and a neighboring military outpost."}, {"id": "02cb5956-9f36-4b95-8d0b-faf8380a274d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26689/", "date": "2024-05-05 08:09", "message": "The Lebanese report a number of wounded in an Israeli attack in Meiss Ej Jabal in southern Lebanon, which took place about an hour ago.", "location": "Meiss Ej Jabal, southern Lebanon", "classification": "security", "score": 0.9757043804391585, "event_breakdown": "- Israeli attack reported in Meiss Ej Jabal, southern Lebanon\n- Number of wounded reported by the Lebanese"}, {"id": "e4ebd834-b955-4a6b-b73d-f57a2431ea5b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26688/", "date": "2024-05-05 08:07", "message": "The Palestinians report: an Apache helicopter attacked targets in Rafah in the southern Gaza Strip this morning.", "location": "Rafah", "classification": "security", "score": 0.9904248373796724, "event_breakdown": "- An Apache helicopter attacked targets in Rafah in the southern Gaza Strip this morning, according to Palestinian reports."}, {"id": "7e87021b-8c77-46e0-bd20-933dce5afd4f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26687/", "date": "2024-05-05 08:06", "message": "Hezbollah's answer to the French proposal\n\nSources report that tomorrow morning Nabih Berri, the Speaker of the Lebanese Parliament (and the head of the Shiite Amal movement, fighting against Israel alongside Hezbollah) is expected to deliver Hezbollah's and the Amal movement's response to the French proposal for a cease-fire with Israel.\n\nAccording to Arab sources, the answer is likely to be that Lebanon is bound by UN Resolution 1701 and that the document will be the basis for negotiations after there is a ceasefire in Gaza.\n\n###\n\nResolution 1701, which ended the Second Lebanon War, spoke of 15,000 armed UNIFIL soldiers with powers south of Litani river, tasked with preventing the introduction of weapons and the presence of Hezbollah militants in the area - which were both violated. If Resolution 1701 had been enforced, we would not have reached the situation we are in today, with a massive deployment of Hezbollah in the south to the Litani.\n\nThe current situation shows how invaluable such agreements are - they shouldn't be taken seriously as they do not hold water.\n\nI suggest that France and the US, who are so keen on ending the fighting in Lebanon with a diplomatic solution, put themselves as guarantors to any new ceasefire agreement - so that any violation of the agreement will be met with with a French or American aerial strike. \n\nI wonder if they'd be willing to agree to this.", "location": "Beirut, Lebanon.", "classification": "security", "score": 0.9300229810162296, "event_breakdown": "- Hezbollah and Amal movement's response to the French proposal for a ceasefire with Israel expected to be delivered by Nabih Berri, the Speaker of the Lebanese Parliament.\n- The response likely to assert Lebanon's adherence to UN Resolution 1701 as the basis for negotiations after a ceasefire in Gaza.\n- UN Resolution 1701, which ended the Second Lebanon War, mentioned the deployment of 15,000 armed UNIFIL soldiers south of the Litani river to prevent weapons introduction and Hezbollah presence, which were violated.\n- Proposal to have France and the US act as guarantors to any new ceasefire agreement in Lebanon, with violations met by French or American aerial strikes."}, {"id": "c269f643-4bdb-4b67-bffc-ca6cc11b68b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "The Shiite militias in Iraq claim to have attacked the Israeli port of Haifa yesterday evening with a cruise missile.", "location": "Haifa", "classification": "security", "score": 0.9938263803343869, "event_breakdown": "- Shiite militias in Iraq claim to have attacked the Israeli port of Haifa with a cruise missile"}, {"id": "1efad064-b590-4fe5-91d7-d2c52fa83ee1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "University of Virginia, US:\n\nPolice officers armed with transparent plastic shields slowly advance in a single line towards anti-Israeli protesters armed with umbrellas, chanting \"shame, shame\".\n\n##\nLike a medieval battle...", "location": "University of Virginia, US", "classification": "security", "score": 0.9091059072642654, "event_breakdown": "1. Police officers advance towards anti-Israeli protesters at the University of Virginia, US.\n2. Anti-Israeli protesters armed with umbrellas chant \"shame, shame\" during the confrontation."}, {"id": "f5891c46-0b12-4fe8-8e91-08ceb53e9e05", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26683/", "date": "2024-05-05 02:31", "message": "The follower Ben Zion Mekels points out that in the past week you can see in satellite images a new road that was broken (by IDF forces) in the area of ​​the Kerem Shalom crossing (near Rafah).\n\nGetting ready for Rafah...", "location": "Rafah", "classification": "security", "score": 0.8487874688356394, "event_breakdown": "- IDF forces break a new road near the Kerem Shalom crossing, near Rafah"}, {"id": "9128bfa7-b034-416a-83ac-d3596c234958", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26681/", "date": "2024-05-05 00:04", "message": "USA: The police of Wisconsin do not make exceptions for academic staff: Samir Elatot, professor of sociology at the University of Wisconsin was arrested after taking an (over) active part in anti-Israel demonstrations.", "location": "University of Wisconsin", "classification": "security", "score": 0.3495209627959089, "event_breakdown": "1. Samir Elatot, professor of sociology at the University of Wisconsin, was arrested by the Wisconsin police.\n2. The arrest took place after Samir Elatot participated in anti-Israel demonstrations."}, {"id": "b03e5994-3739-4082-a637-2e249978a049", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26678/", "date": "2024-05-04 17:47", "message": "Palestinian channels report: The IDF attacked the home of the prominent journalist in the Gaza Strip, Hassan Aslih (Hamas-affiliated) in the Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip.\nThere were no casualties in the attack.", "location": "Khan Yunis", "classification": "security", "score": 0.9953827602700771, "event_breakdown": "- IDF attacked the home of prominent journalist Hassan Aslih in Manara neighborhood, Khan Yunis, Gaza Strip\n- No casualties reported"}, {"id": "8f73455b-0c27-42cf-840a-f658947590db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26677/", "date": "2024-05-04 17:31", "message": "Palestinian channels: The Palestinian Authority's security mechanisms detonated, in a controlled manner, explosive devices they located in Tubas (Northeastern Samaria).", "location": "Tubas", "classification": "security", "score": 0.9948419961865298, "event_breakdown": "- Palestinian Authority's security mechanisms detonated explosive devices in Tubas (Northeastern Samaria)"}, {"id": "5f2da1ac-cdd6-4f7d-a73e-4cf94c61d70d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26676/", "date": "2024-05-04 17:20", "message": "Hamas-identified channels: All four killed (whose names have been published) 👆 in the IDF's activity in the village of Deir al-Ghusun in the north of Tulkarm, were operatives of the military wing of Hamas.\nAlaa Sharitah was the commander of the military wing of Hamas in Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9934812200416727, "event_breakdown": "- Four operatives of the military wing of Hamas were killed in IDF's activity in the village of Deir al-Ghusun in the north of Tulkarm.\n- Alaa Sharitah, identified as the commander of the military wing of Hamas in Tulkarm."}, {"id": "a1169e79-dad5-461b-952a-c0284bc3575b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26675/", "date": "2024-05-04 17:19", "message": "Further to this👆\nA joint statement to the IDF spokesperson, the police spokesperson and the Shin Bet spokesperson:\n\nThe soldiers of Yamam, the IDF and the Shin Bet eliminated five terrorists who had barricaded themselves in a building in Tulkarm in a 12-hour battle\n\nThe soldiers of the Yamam, IDF and Shin Bet, under the precise intelligence guidance of the Shin Bet and IDF Intelligence, operated for over 12 hours in Tulkarm in a targeted activity to defeat a terrorist cell.\n\nThe soldiers closed in on a building where the terrorist squad was entrenched, which opened fire on them. The fighters responded by shooting with shoulder-fired missiles and other means from the building, and at the end of the exchange of fire, the five terrorists were eliminated.\nMilitary equipment and weapon parts were confiscated.\n\nDuring the activity, an IDF fighter was injured and brought to continue receiving medical treatment in a hospital; his family was informed.", "location": "Tulkarm", "classification": "security", "score": 0.9849329956770798, "event_breakdown": "- Five terrorists eliminated by joint operation of Yamam, IDF, and Shin Bet in Tulkarm.\n- 12-hour battle in Tulkarm resulting in the elimination of the terrorist cell.\n- Confiscation of military equipment and weapon parts during the operation.\n- One IDF fighter injured during the activity and receiving medical treatment in a hospital."}, {"id": "651fade1-206b-44ca-9d06-28f3ca3e3e44", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26674/", "date": "2024-05-04 16:10", "message": "The Palestinians publish the names of four of the \"martyrs\" who were killed in the IDF operation tonight in the village of Deir el Ghusun in the north of Tulkarm:\n\n1. Alaa Sharith (the leftmost one).\n2. Tamer Fuqaha (next to Alaa' - both are behind the attack in which Elhanan Klein fell in November 2023. Tamer is also an operative of Erin al Aswad).\n3. Adnan Samara\n4. Asal Badran\n\nIn addition, there is the \"headless martyr\" who has not yet been identified - DNA tests will be conducted on him to confirm his identity.", "location": "Deir el Ghusun", "classification": "security", "score": 0.9791185685870558, "event_breakdown": "1. Palestinians publish names of four \"martyrs\" killed in IDF operation in Deir el Ghusun:\n   - Alaa Sharith\n   - Tamer Fuqaha (linked to attack in which Elhanan Klein fell)\n   - Adnan Samara\n   - Asal Badran\n\n2. Unidentified \"headless martyr\" DNA tests to confirm identity."}, {"id": "b738c76d-d90d-4d4e-8a91-c35640021d9d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26673/", "date": "2024-05-04 15:36", "message": "The Palestinians report that the IDF forces have finished their activities in Deir al-Ghusun in the north of Tulkarm and have left.\nSources in Tulkarm say that the Palestinian rescue forces located another Palestinian \"martyr\" among the ruins, apparently headless.", "location": "Tulkarm", "classification": "security", "score": 0.9671169206516085, "event_breakdown": "- IDF forces finish activities in Deir al-Ghusun, north of Tulkarm and leave.\n- Palestinian rescue forces find headless Palestinian \"martyr\" among the ruins in Tulkarm."}, {"id": "ef1b38ed-b93d-4409-b7eb-467ec702c161", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26672/", "date": "2024-05-04 14:06", "message": "The Palestinians report that the person who came out from under the ruins of the house in Deir al-Ghusun and was arrested by IDF forces is the released prisoner Salma Badran, an operative of the military wing of Hamas with a \"heavy\" family lineage: he is the brother of the two \"martyrs\" of the wing - Fawaz and Seif Allah Badran. Salma is the owner of the apartment where the Hamas terrorists hid last night and which the IDF destroyed.\n\nFawaz (Salma's brother) was one of the senior bomb engineers of the Izz ad-Din al-Qassam Brigades in the West Bank and was the one who assembled the explosive device that exploded in the first suicide attack of the second intifada (March 2001), in which 3 Israeli citizens were killed in Netanya. Fawaz was also the one who recruited the suicide bomber for the attack and also guided other suicide bombers in Tulkarm. He was eliminated by the Israeli security forces that year using an explosive device planted in his car.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9989665591672134, "event_breakdown": "- Salma Badran, a released prisoner and operative of Hamas, is arrested by IDF forces in Deir al-Ghusun.\n- Salma Badran is the brother of Fawaz and Seif Allah Badran, who were both \"martyrs\" of the Hamas military wing.\n- Salma is the owner of the apartment where Hamas terrorists hid, which was destroyed by the IDF.\n- Fawaz Badran, a senior bomb engineer of the Izz ad-Din al-Qassam Brigades, assembled an explosive device for a suicide attack in Netanya in March 2001, killing 3 Israeli citizens. He was eliminated by Israeli security forces that year using an explosive device planted in his car."}, {"id": "fea352ca-7f55-47a3-b0fa-8099718e151f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26671/", "date": "2024-05-04 14:00", "message": "The official Palestinian news agency Wafa: 6 Palestinians were killed in the IDF operation in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9664112263099419, "event_breakdown": "- IDF operation in the village of Deir al-Ghusun in the north of Tulkarm\n- 6 Palestinians killed in the operation"}, {"id": "54d6bd74-25f7-4326-b900-6fdfad04c66f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26668/", "date": "2024-05-04 13:56", "message": "More footage from Deir al-Ghusun north of Tulkarm from the IDF operation today.", "location": "Tulkarm", "classification": "security", "score": 0.5645468611123309, "event_breakdown": "- Additional footage from Deir al-Ghusun, north of Tulkarm, from today's IDF operation."}, {"id": "48e4cef9-7ee6-4d10-82fb-b1469448215a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Palestinian sources in Tulkarm claim that Tamer Fuqaha, an operative of the military wing of Hamas, (and the terrorist who carried out the attack in which Elhanan Klein fell on November 2, 2023), was killed in an IDF operation tonight in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9920826670749956, "event_breakdown": "- Tamer Fuqaha, a Hamas operative responsible for the attack on Elhanan Klein, was killed in an IDF operation in Deir al-Ghusun village, Tulkarm."}, {"id": "4773f148-f165-4317-bdec-0534480e454c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Deir al-Ghusun north of Tulkarm:\nThe IDF forces packed the body of the Palestinian who was killed in the area of ​​the building.\n\nPalestinian sources claim the IDF forces took 3 bodies.\n\nIDF forces then arrested a Palestinian who emerged from under the ruins of the house that the forces had besieged for many hours.", "location": "Tulkarm", "classification": "security", "score": 0.9879003899097348, "event_breakdown": "- IDF forces packed the body of a Palestinian killed in the area of ​​a building in Deir al-Ghusun, north of Tulkarm.\n- Palestinian sources claim IDF forces took three bodies from the area.\n- IDF forces arrested a Palestinian who emerged from under the ruins of a house besieged by the forces for many hours."}, {"id": "308a2430-9a2a-43ed-9899-d6b660b7beca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26661/", "date": "2024-05-04 13:10", "message": "The \"Holy Fire\" ceremony held today in the Church of the Holy Sepulcher in East Jerusalem as part of the \"Sabbath of Light\" that Christians celebrate today.", "location": "Church of the Holy Sepulcher, East Jerusalem", "classification": "security", "score": 0.7164941467590658, "event_breakdown": "- \"Holy Fire\" ceremony held at the Church of the Holy Sepulchre in East Jerusalem.\n- Part of the \"Sabbath of Light\" celebrated by Christians today."}, {"id": "73febcaf-0f0a-4f84-92e7-439d8df2130b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26658/", "date": "2024-05-04 13:07", "message": "For nearly ten hours starting last night, IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm.\nAccording to the estimates, the terrorists Tamer Fakha and Alaa Sharitah, the operatives of the military wing of Hamas involved in the shooting attack in which Major General Elhanan Klein was killed near Beit Lid on November 2, 2023, were hiding in the house.\nSources associated with Hamas and Islamic Jihad operatives claim that the two managed to escape from the house which was surrounded by the IDF for many hours and fired upon by a large number of missles (and finally destroyed with a bulldozer - in the attached videos you can see the shooting and the demolition the house).", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9796365504234397, "event_breakdown": "null"}, {"id": "26080395-2be4-40e9-9829-41d926a29fd4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26657/", "date": "2024-05-04 13:02", "message": "The Al Jazeera network claims: an Israeli drone launched a missile a few hours ago at a vehicle in Bint Jabil in southern Lebanon.\n\nUnofficial Lebanese sources: No casualties.", "location": "Bint Jbeil, Lebanon", "classification": "security", "score": 0.9652451684275815, "event_breakdown": "- An Israeli drone reportedly launched a missile at a vehicle in Bint Jabil, southern Lebanon, according to Al Jazeera network.\n- Unofficial Lebanese sources report no casualties from the incident."}, {"id": "438a9a27-9a2e-4ffd-8c2c-4bbc02c157fe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26656/", "date": "2024-05-04 12:30", "message": "The Qatari Al Jazeera cites a report by Reuters according to which Qatar is considering closing the offices of the political office of Hamas in its territory as part of an overall plan to continue its function as a mediator in the conflict between Hamas and Israel.", "location": "Qatar", "classification": "security", "score": 0.9065846889429762, "event_breakdown": "- Qatar considers closing Hamas' political office as part of mediating between Hamas and Israel"}, {"id": "861bf77c-519e-4f40-b77d-56027bceb644", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26655/", "date": "2024-05-04 12:29", "message": "At least 3 different Israeli military reporters publish the exact same message:\n\nPolitical actor:\n\nContrary to the publications, Israel will under no circumstances agree to the end of the war as part of an agreement to release our abductees.\n\nAs the political echelon decided, the IDF will enter Rafah and destroy the remaining Hamas battalions there - whether or not there will be a temporary respite for the release of our hostages.", "location": "Rafah", "classification": "security", "score": 0.6696081489195264, "event_breakdown": "1. Three Israeli military reporters publish the same message contradicting claims that Israel would agree to end the war as part of a deal to release abductees.\n2. The political echelon decides that the IDF will enter Rafah and eliminate the remaining Hamas battalions, regardless of a potential temporary ceasefire for hostage release."}, {"id": "2e3bf7b7-29eb-4467-85cc-76ebc55505a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26653/", "date": "2024-05-04 12:27", "message": "Today, Lebanese sources report: Hezbollah will soon submit its comments to the French proposal to end the war in southern Lebanon\n\nJournalist sources in Lebanon state that Hezbollah and the Amal movement discussed the French proposal and decided not to reject it (so as not to be perceived as refusers - AA) but to submit 10 comments to amend the proposal.\nThe comments will be forwarded to the Speaker of the Lebanese Parliament (who happens to also be the head of the Amal Shiite movement fighting alongside Hezbollah in southern Lebanon - AA) and he will discuss them with Prime Minister Mikati and forward them to the French side.", "location": "Lebanon", "classification": "security", "score": 0.9143945024805114, "event_breakdown": "- Hezbollah preparing to submit comments on the French proposal to end the war in southern Lebanon.\n- Hezbollah and the Amal movement discussing the French proposal and deciding not to reject it but to submit 10 comments for amendment.\n- Comments to be forwarded to the Speaker of the Lebanese Parliament, who is also the head of the Amal Shiite movement, for discussion with Prime Minister Mikati and then forwarded to the French side."}, {"id": "1c84311a-7492-49fe-a3b0-54a4cd076677", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26652/", "date": "2024-05-04 12:26", "message": "Yesterday, Lebanese Al-Akhbar newspaper publishes the French proposal for a ceasefire between Israel and Hezbollah\n\nThe Lebanese Al-Akhbar newspaper, which is affiliated with Hezbollah, once again manages the agenda regarding the ceasefire agreements with Israel and reveals the details of the French proposal to end the war between Israel and Hezbollah in southern Lebanon.\n\nThe proposal includes three stages:\n\nFirst step (according to areas of responsibility)\n\nHezbollah the militias in South Lebanon stop the fire and allow UNIFIL to move freely in South Lebanon without restriction.\n\nIsrael will stop its attacks on Lebanese territory and stop jamming the radar in Lebanon.\n\nUNIFIL will increase patrols in southern Lebanon.\n\nSecond stage (within 3 days from the start of the first stage)\n\nHezbollah militias will dismantle all their facilities near the blue line, including observation towers and tents.\nAll military operatives, including the Radwan force, as well as equipment that enables the remote launch of anti-tank missiles, will be moved north beyond the ten-kilometer line from the border with Israel.\n\nIsrael will stop air flights over Lebanon.\n\nLebanon will begin deploying 15,000 soldiers on its behalf in southern Lebanon, south of the Litani River with the support of UNIFIL and international agencies.\n\nUNIFIL will resume its participation in the meetings of the tripartite mechanism (with Israel and Lebanon) and logistically assist the deployment of the Lebanese army south of Litani.\n\nThird stage (within ten days)\n\nThe renewal of the negotiations between Israel and Lebanon for the registration of the land border based on the negotiations that took place in 2017.\nBeginning of negotiations on the establishment of a zone free of armed military militias south of Litani (with the exception of the Lebanese army and UNIFIL forces).\n\nSupport for social and economic development in southern Lebanon.", "location": "Southern Lebanon", "classification": "security", "score": 0.9627738124436742, "event_breakdown": "- Lebanese Al-Akhbar newspaper publishes French proposal for ceasefire between Israel and Hezbollah\n- First stage of the proposal:\n    - Hezbollah to stop firing in South Lebanon and allow UNIFIL movement\n    - Israel to halt attacks on Lebanese territory and radar jamming\n    - UNIFIL to increase patrols in southern Lebanon\n- Second stage (within 3 days):\n    - Hezbollah to dismantle facilities near the blue line\n    - Move military operatives and equipment beyond ten-kilometer line from border\n    - Israel to stop air flights over Lebanon\n    - Lebanon to deploy 15,000 soldiers in south Lebanon with UNIFIL support\n- Third stage (within ten days):\n    - Renewal of negotiations between Israel and Lebanon for land border registration\n    - Negotiations for establishing a zone free of armed militias south of Litani\n    - Support for social and economic development in southern Lebanon"}, {"id": "78a6a09c-b9fe-4cb5-ba5d-c6300b115633", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26649/", "date": "2024-05-03 20:30", "message": "Documentation of one of today's attacks in the area of ​​the displaced persons' tents in Rafah in the south of the Gaza Strip - note the rocket rising into the sky. This indicates a precise hit by the aircraft on the target.", "location": "Rafah in the south of the Gaza Strip.", "classification": "security", "score": 0.9952821119807056, "event_breakdown": "1. Attack near displaced persons' tents in Rafah, south of the Gaza Strip\n- Location: Near displaced persons' tents in Rafah, south of the Gaza Strip\n- Description: Aircraft targets area, rocket seen rising into the sky, indicating a precise hit on the target"}, {"id": "b2f68741-1b35-4d18-ae8e-896427ab7a51", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26648/", "date": "2024-05-03 20:27", "message": "Hamas in an official announcement:\n\nIn light of the recent contacts with the mediators, tomorrow a delegation of the movement will arrive in Cairo to complete the talks.\n\nWe emphasize that the leadership of the movement reacted in a positive spirit to the proposal it received while discussing it. We are going to Cairo in the same positive atmosphere to reach an agreement.\n\nWe are determined to reach an agreement that will realize the demands of our people for a total cessation of aggression, the withdrawal of forces, the return of the displaced, aid to our people, the beginning of the reconstruction of the Gaza Strip and a serious exchange deal.", "location": "Cairo", "classification": "security", "score": 0.3907896760166591, "event_breakdown": "- Hamas delegation arriving in Cairo for talks"}, {"id": "c658988b-baaa-42bf-982b-c383ada9f032", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26644/", "date": "2024-05-03 17:44", "message": "Reuters from a senior Hamas official: a Hamas delegation will arrive in Cairo tomorrow.", "location": "Cairo", "classification": "security", "score": 0.9023652992005777, "event_breakdown": "1. A Hamas delegation will arrive in Cairo as reported by a senior Hamas official."}, {"id": "baaa32df-a7ab-4d73-be22-ee20ed62a4c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26643/", "date": "2024-05-03 16:51", "message": "The Houthis clarify the words of the Houthi military spokesman and point out that starting today every ship that docks in an Israeli port will be \"marked\" and as soon as it passes through an area within the reach of the Houthis it will be attacked even if it is not on its way to an Israeli port at the time.\n\nIf Israel enters Rafah, the next step for the Houthis will be to attack all ships belonging to companies that even one of their ships docks in Israeli ports.", "location": "Rafah", "classification": "security", "score": 0.4099593512202328, "event_breakdown": "- The Houthis clarify statements by their military spokesman, announcing that every ship docking in an Israeli port will be \"marked\" starting today.\n- They declare that any ship passing through an area within the Houthis' reach will be attacked, even if not en route to an Israeli port at the time.\n- The Houthis warn that if Israel enters Rafah, they will escalate to attacking all ships belonging to companies with even one ship docking in Israeli ports."}, {"id": "5ec8b641-d316-4dfd-a40b-45cadb161a07", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26642/", "date": "2024-05-03 16:36", "message": "One of the signs of abundance in the northern Gaza Strip: Gazan donkeys receive fresh pita bread\n\nA Gazan from the north of the Gaza Strip to the donkey: once (when there was a shortage of bread) we ate from your food, now take and eat bread from today. You are better than many people...", "location": "Gaza Strip", "classification": "security", "score": 0.8432632263954416, "event_breakdown": "- Gazan donkeys in the northern Gaza Strip receiving fresh pita bread, indicating abundance in the area.\n- A Gazan from the north of the Gaza Strip expressing gratitude to the donkeys, highlighting a shift from scarcity to abundance."}, {"id": "0952976e-c3cd-4050-80af-0d5a54ff1e56", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26641/", "date": "2024-05-03 16:28", "message": "American Central Command:\n\nDue to weather conditions, construction work on the floating pier off the coast of Gaza was stopped and it was moved to Ashdod port, where its construction will be completed.\n\nAfter the completion of its construction, it will be floated along the shores of Gaza to the place where it was planned to be placed.", "location": "Ashdod", "classification": "security", "score": 0.8222928362890448, "event_breakdown": "- Construction work on the floating pier off the coast of Gaza halted due to weather conditions.\n- The floating pier is relocated to Ashdod port for completion of construction.\n- After construction, the pier will be floated along the shores of Gaza to its intended location."}, {"id": "cf438971-410d-43ee-b032-35c52f39a99b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26640/", "date": "2024-05-03 15:56", "message": "Reuters from an Egyptian source:\n\nThe head of the CIA, William Burns, arrived in Cairo to promote the ceasefire in Gaza.\n\n##\nThe Americans are using all their weight and are firing their heaviest guns to reach a ceasefire.", "location": "Cairo", "classification": "security", "score": 0.8731912994868349, "event_breakdown": "- Visit of CIA head William Burns to Cairo to promote ceasefire in Gaza\n- American efforts to reach ceasefire in Gaza using significant diplomatic weight."}, {"id": "fecc36f7-626b-4467-ae51-cb6d32467bf1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26639/", "date": "2024-05-03 15:55", "message": "The Palestinian Ministry of Health in Gaza:\n26 dead in the Strip in the last day.\n\nThe number of deaths in the last few days:\n28\n33\n47\n34\n\nTotal dead in the Gaza Strip since the beginning of the war: 34,622. Total wounded: about 78 thousand.\n\n##\nIn the last day, the number of dead was the lowest in the Gaza Strip since the beginning of the war (with the exception of the hodna period in November 2023).", "location": "Gaza Strip", "classification": "security", "score": 0.8569080015487186, "event_breakdown": "- 26 dead in the Gaza Strip reported by the Palestinian Ministry of Health\n- Total deaths in the last few days: 28, 33, 47, 34\n- Total dead in the Gaza Strip since the beginning of the war: 34,622; Total wounded: about 78 thousand\n- Lowest number of dead in a day in the Gaza Strip since the beginning of the war, except for a period in November 2023."}, {"id": "65918163-d83e-462b-9e99-113dc80d258d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26633/", "date": "2024-05-03 13:36", "message": "Paris: French security forces break into Sciences Po the Institute of Political Science to break up an anti-Israel demonstration by the students there.", "location": "Paris", "classification": "security", "score": 0.9281242816179448, "event_breakdown": "- French security forces break into Sciences Po, the Institute of Political Science in Paris.\n- The forces intervene to break up an anti-Israel demonstration by the students at Sciences Po."}, {"id": "50a2831f-9558-4331-b92c-879ec622d696", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26630/", "date": "2024-05-03 13:15", "message": "About 100,000 Palestinians have left the Gaza Strip since the beginning of the war\n\nThe Palestinian ambassador in Egypt: since the beginning of the war and until April, 85 thousand Palestinians left the Gaza Strip for Egypt through the Rafah crossing.\n\nTaking the month of April into account, it can be estimated that about one hundred thousand Palestinians left the Strip since the beginning of the war.", "location": "Rafah", "classification": "security", "score": 0.8683848530412968, "event_breakdown": "- Approximately 100,000 Palestinians have left the Gaza Strip since the start of the war.\n- Palestinian Ambassador in Egypt reports that 85,000 Palestinians departed from Gaza to Egypt through the Rafah crossing from the war's onset until April.\n- Including April's figures, it's estimated around 100,000 Palestinians have left the Gaza Strip during the conflict."}, {"id": "d35a5b7f-4ec0-4ea0-aa3c-94da7a859ee6", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65962/", "date": "2024-05-03 13:11", "message": "A must watch:\n\nStudents from the \"Free Palestine Army\" charge Portland police officer with shields made from trash cans.\n\n##\nNot the sharpest tools in the shed...", "location": "Portland", "classification": "security", "score": 0.7716378859605466, "event_breakdown": "- Students from the \"Free Palestine Army\" use shields made from trash cans\n- Students charge at a Portland police officer"}, {"id": "34646444-9e80-4517-961d-f741d5142749", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26628/", "date": "2024-05-03 13:11", "message": "Fox News: The Iranian flag was raised by the students at the University of Irvine in California.\n\nIran is offering scholarships to students who will be expelled from US universities following the protests.", "location": "University of Irvine, California", "classification": "security", "score": 0.38395330639266484, "event_breakdown": "1. Iranian flag raised by students at University of Irvine in California\n2. Iran offers scholarships to US students facing expulsion after protests"}]