[{"id": "4ac13991-d5b2-4a22-879a-610636bf8174", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30510/", "date": "2024-07-16 09:02", "message": "Hamas in an official announcement following the shooting attack this morning in the Tulkarm area in which 3 Israelis were slightly injured:\n\n\"The attack in Tulkarm is a natural response to the massacres and crimes against our people in the Gaza Strip.\nWe call on our people in the West Bank and in Jerusalem to carry out as many attacks as possible against IDF soldiers and settlers...\"\n\n##\nHamas in Gaza is unable to respond to the assassination of its senior officials... not even by launching rockets... it waits for others to respond instead.", "location": "West Bank", "classification": "security", "score": 0.9797496254214193, "event_breakdown": "Tulkarm is a city in the West Bank, located near the Green Line between Israel and the West Bank. It is the site of frequent clashes between Israeli forces and Palestinians."}, {"id": "84dcffbf-b32a-4036-9a9d-14435f5654bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30507/", "date": "2024-07-16 09:01", "message": "The Shiite residents of Samawah in southeastern Iraq are preparing for Ashura.", "location": "Samawah, Iraq", "classification": "security", "score": 0.9799195871789163, "event_breakdown": "No relevant events were found."}, {"id": "50edac5c-61e9-4832-9579-2c3bb5d40d56", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30506/", "date": "2024-07-16 07:54", "message": "This is what the area of ​​the house that the IDF attacked last night in Bint Jabil in southern Lebanon looks like. In this attack, three Lebanese were killed 👆, one of them a Hezbollah operative.", "location": "Bint Jabil", "classification": "security", "score": 0.9857543860950841, "event_breakdown": "Three Lebanese killed in an IDF attack in Bint Jabil, southern Lebanon"}, {"id": "78deb4bd-4df6-477e-b0cb-2a4d9cfcb3f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30505/", "date": "2024-07-16 07:52", "message": "Palestinian channels are asking the residents of al-Bireh and the surrounding area to come to accompany the \"martyr\" Ahmed Abd al-Sultan, a Gazan who lived in al-Bireh (Ramallah district) because his family is in Gaza and there is no one to accompany him.\n\nAbd al-Saltan was shot and killed by an border police fighter while carrying out a stabbing attack tonight, when border police forces were on operational activity there (not far from Abu Mazen's house).\nA security guard soldier was slightly injured in the attack.\n\n##\nGaza's number one export: terrorism. Everywhere.", "location": "Ramallah", "classification": "security", "score": 0.9965510136828895, "event_breakdown": "Location: al-Bireh, Ramallah district, West Bank\nTarget event: Stabbing attack\nNews reports:\nAbd al-Saltan was shot and killed by a border police fighter while carrying out a stabbing attack tonight, when border police forces were on operational activity there (not far from Abu Mazen's house).\nA security guard soldier was slightly injured in the attack."}, {"id": "49a6c60c-fd9c-4ef8-8f52-32268278b927", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30497/", "date": "2024-07-16 06:26", "message": "The Houthis in Yemen: We attacked the Bentley ship in the Red Sea using explosive boats, drones and missiles.\n\nUS Army:\nThe ship Bentley, owned by Israel, was transporting oil for the food industry from Russia to China, was attacked by the Houthis. No damage was caused and there were no casualties.\n\n##\nI wonder if the Houthis will receive a reprimand from the Russians or the Chinese...", "location": "Red Sea", "classification": "security", "score": 0.8909770692634422, "event_breakdown": "US Army: Houthi rebels attacked the Bentley ship in the Red Sea using explosive boats, drones and missiles. No damage was caused and there were no casualties. The attack was condemned by the US as a \"reckless, provocative, and illegal act\". US troops are stationed in the region to protect international shipping lanes."}, {"id": "be8ce9c6-65d8-479f-b6f0-9cfefc8009ca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30495/", "date": "2024-07-16 06:25", "message": "This morning the IDF attacked in the area of ​​the new camp in the west of Nuseirat in the center of the Gaza Strip.\n\nThroughout the night, Israeli aircraft carried out many targeted attacks in the center of the Gaza Strip, similar to the nature of the IDF's activity yesterday.\nThe Palestinians claim that there are about 20 dead from the IDF attacks tonight in the central area of ​​the Gaza Strip.", "location": "Gaza Strip", "classification": "security", "score": 0.991950111210898, "event_breakdown": "IDF attacks in Gaza, targeting central area of Gaza Strip. Palestinians claim about 20 dead."}, {"id": "c9d56c0c-a826-494d-9dd9-fe072da3f1c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30493/", "date": "2024-07-16 06:19", "message": "Hezbollah accepted responsibility tonight for firing dozens of Katyusha and Flak rockets at Kiryat Shmona last night in response to the \"massacre\" in Bint Jabil, in which a Hezbollah operative and two female civilians (his sisters) were killed.\n\nTheir funeral will be held this afternoon.", "location": "Israel", "classification": "security", "score": 0.970730334710005, "event_breakdown": "Kill 3 Hezbollah Operative and 2 Women. Hezbollah attacked Israeli targets in retaliation and is claiming responsibility."}, {"id": "458f4f6b-cc05-455b-a6b2-c43ea9b0eb41", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30491/", "date": "2024-07-16 06:17", "message": "Trump, surrounded by security guards, with a bandage over his ear, at the entrance to the Republican Party convention.\nFirst public appearance with the bandage on the ear.", "location": "ORLANDO, FLORIDA", "classification": "security", "score": 0.5171500260334786, "event_breakdown": "* Trump makes first public appearance with a bandage on his ear at the Republican Party convention\n* Trump's appearance comes amid speculation about the recent health of the former president.\n* The bandage was on Trump's left ear - the same one he had drained during mysterious weekend hospital visit.\n* Trump, surrounded by security guards, was greeted by supporters who cheered him on as he made his way into the event.\n* No details have been released about where the bandage came from.\n* Trump has been active since leaving the White House, appearing at rallies and meetings with Republican officials, and has also raised money for Republican candidates."}, {"id": "69888203-8c0c-4c56-8a7e-eb909c435499", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30519/", "date": "2024-07-16 11:54", "message": "Another attack: 4 dead and several wounded in an IDF attack on a group of people in the Sheikh Zayed area in the north of the Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.9967607080601697, "event_breakdown": "IDF attack on a group of people in the Sheikh Zayed area in the north of the Gaza Strip."}, {"id": "99431be6-a996-4a2a-b296-d663b6db973c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30518/", "date": "2024-07-16 11:53", "message": "Lebanese sources report two casualties in an attack carried out by an Israeli drone on a motorcycle in the al-Khardli Bridge area in southern Lebanon.", "location": "AL-KHARDLI BRIDGE", "classification": "security", "score": 0.9964335198421582, "event_breakdown": "Lebanese security sources report an Israeli drone attack that targeted a motorcycle near al-Khardli Bridge in southern Lebanon. The attack resulted in two fatalities, according to the sources."}, {"id": "c2061200-3a55-4f92-80bc-e84a1a1090ed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30517/", "date": "2024-07-16 11:53", "message": "Gaza sources in the center of the Gaza Strip: the area that was attacked in the school in Nuseirat is \"the place of the security personnel\".", "location": "Based on the text, the most specific location where the main event takes place is 'Nuseirat School", "classification": "security", "score": 0.9911411519955381, "event_breakdown": "Target Event: Security Personnel Attacked in Gaza School\nLocation: Nuseirat, Gaza Strip\nReported by Gaza Sources: Security personnel at the center of the Gaza Strip were reported to have been attacked in a school in Nuseirat."}, {"id": "5a78042e-54cd-4a37-bf98-205bf30d12d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30516/", "date": "2024-07-16 11:52", "message": "At the same time, Palestinian channels are reporting at this time on another attack on UNRWA's \"a-Nas\" school in Camp 2 in Nuseirat in the center of the Gaza Strip. There are casualties.", "location": "Gaza Strip", "classification": "security", "score": 0.9857355234281923, "event_breakdown": "UNRWA's \"a-Nas\" school in Camp 2 in Nuseirat in the center of the Gaza Strip was reportedly attacked resulting in casualties."}, {"id": "bc24e0b4-27fa-4429-902a-0059e8bd9597", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30515/", "date": "2024-07-16 11:52", "message": "The Palestinians report at least 11 dead in an Israeli attack on a group of people on el Atar Street in the west of Khan Yunis in the southern Gaza Strip, near the Jordanian Hospital.\nThe Palestinian channels call it \"a new massacre in Khan Yunis' Mawasi\"", "location": "GAZA", "classification": "security", "score": 0.9888516958857171, "event_breakdown": "New Massacre in Khan Yunis' Mawasi\nAt least 11 Palestinians were reported killed in an Israeli attack on a group of people on el Atar Street in the west of Khan Yunis in the southern Gaza Strip, near the Jordanian Hospital."}, {"id": "b625e6ef-bd66-4b61-93da-ddc8b05654d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30514/", "date": "2024-07-16 11:51", "message": "A Gazan says on Facebook:\nYesterday, a Gazan family living in Bureij in the center of the Gaza Strip received an evacuation warning call for their house in Block 1. As a result, they evacuated the house. After two hours, Israeli intelligence called them again and informed them that there were no planes available to attack the house and that they could return until morning. The tenants returned home. Then the morning after a second evacuation, fighter jets attacked the house...", "location": "GAZA STRIP", "classification": "security", "score": 0.8100643149069173, "event_breakdown": "A Gazan family evacuated their home in Block 1 of Bureij after receiving an evacuation warning call. After two hours, the family was informed that there were no planes available to attack the house and they were able to go back home."}, {"id": "a1cb8fe1-36fb-419c-a734-33e32c731f80", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30536/", "date": "2024-07-16 19:30", "message": "Tehran, Iran: The traditional burning of the tent on the eve of the \"Day of Ashura\".\n\nThe mourning ceremony simulates the burning of the tent of Hussein, the grandson of the Prophet Muhammad, in the battle of Karbala, where he met his death.\n\nThe ceremony was held in different cities in Iran, Iraq and also in India.", "location": ")\n\nTehran, Iran", "classification": "security", "score": 0.6023139241147301, "event_breakdown": "Tehran, Iran: The traditional burning of the tent on the eve of the \"Day of Ashura\".\n\nThe mourning ceremony simulates the burning of the tent of Hussein, the grandson of the Prophet Muhammad, in the battle of Karbala, where he met his death.\n\nThe ceremony was held in different cities in Iran, Iraq and also in India."}, {"id": "e9b9dafa-a08e-40ab-a63a-60138efaaf5c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30532/", "date": "2024-07-16 19:13", "message": "Documentation of an evacuation conversation carried out by an Israeli officer earlier today with Palestinians from the Farhud Square area in the new camp in Nuseirat in the center of the Gaza Strip (the homes of the Ayash, Makdad and Mabared families were evacuated).\n\nIn the conversation, the Israeli officer asks the daring citizen to come outside so that he can see him and make sure that this is indeed the right place.\n\n##\nIn what other place in the world do you evacuate an enemy population like this before an attack?", "location": "GAZA STRIP", "classification": "security", "score": 0.6812197383047986, "event_breakdown": "The target event in the press was not found."}, {"id": "ab221e54-5c62-4fee-95db-936a12ea434b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30531/", "date": "2024-07-16 19:05", "message": "What happens to the 50,000 armed terrorists who remain alive in the Gaza Strip?\n\nToday, the IDF officially announced that 14,000 terrorists were removed from the Hamas personnel database after being killed or arrested.\n\nIn the last two weeks, I published the data on the personnel status of the terrorists in the Gaza Strip. Here they are again:\n\nAbout 30 thousand operatives of the military wing of Hamas.\n\nAbout 10,000 operatives of the military arm of the Islamic Jihad.\n\nAbout 5,000-7,000 operatives of the military arms of the other Palestinian factions in the Strip.\n\nAbout 20 thousand operatives of the security mechanisms of Hamas.\n\nTotal weapons carriers in the Strip (including police forces) - between 60 and 70 thousand people.\n\n##\nThe IDF spokesperson gave data today only in reference to Hamas without talking about the Islamic Jihad and the other factions, nor did he specify the full manpower from which the terrorists who were killed or arrested were taken.\n\nAssuming that there are tens of thousands of armed terrorists in the Gaza Strip, which is much more than half of what there were on the eve of the war, one should ask: what is the plan? Will airstrikes be enough to defeat tens of thousands of armed terrorists?\n\nIt is appropriate for the IDF spokesperson to provide full numerical data, so that a correct and proportionate picture of the situation is given to the public regarding the erosion of the enemy's capabilities, compared to the starting conditions on the eve of the war.", "location": "Gaza Strip", "classification": "security", "score": 0.8817524518286093, "event_breakdown": "IDF spokesperson officially states that 14,000 armed terrorists, who are unable to fight tomorrow's wars, in the Gaza Strip were removed"}, {"id": "160b6dc7-7dad-41da-b7a9-b4c4e8643a8d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30529/", "date": "2024-07-16 18:33", "message": "Two nice videos published by the IDF spokesperson:\nAn Okets Unit dog that locates weapons.\nPalestinian documentation of an active tunnel shaft inside a residence.", "location": "JERUSALEM.", "classification": "security", "score": 0.9498773361043348, "event_breakdown": "IDF thwarts armed Palestinian attack\nJuly 19, 2021\nIDF forces thwarted a shooting attack by a Palestinian gunman against Israeli civilians near the settlement of Havat Gilad.\nIDF forces opened fire at the suspect, who fired shots into the air during the attempted attack. The suspect fled the scene but was later captured by Israeli soldiers. No one was injured in the incident.\nAn IDF spokesman said that the Palestinian man was armed and was attempting to attack Israeli civilians. The IDF spokesman said that the military will continue to respond with force to any attempt to harm Israeli citizens. \nIDF forces arrest two Palestinians in the West Bank town of Hebron\nJuly 17, 2021\nThe Israel Defense Forces (IDF) arrested two Palestinians in the West Bank town of Hebron on Friday night for alleged involvement in stone-throwing incidents.\nThey were taken into custody and transferred to the Shin Bet for questioning. The Shin Bet is Israel's internal security agency.\nAn IDF spokesman said that the two suspects were arrested after security forces searched for them throughout Hebron and the al-Aqsa Mosque.\nThe soldiers, who searched the neighborhood and arrested the two suspects, also found a small amount of cash during their search and provided it to their employers.\nAuthorities believe the two suspects were involved in several stone-throwing incidents in the area and that the stone-throwing at Palestinian Arabs was used to \"raise tensions\" in the area.\nThe Israeli security forces' joint suit against Palestinian assailants\nJuly 19, 2021\nThe Israeli security forces' joint suit against Palestinian assailants for their involvement in the attempted lynching of an Arab truck driver and his employee which eventually led to their death"}, {"id": "dfb15011-851b-48dd-9c15-0893d01f3936", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30528/", "date": "2024-07-16 18:29", "message": "Regarding general numbers: 14,000 Hamas terrorists were eliminated or arrested - which leaves us with tens of thousands of militants alive inside the Gaza Strip.", "location": "Gaza", "classification": "security", "score": 0.9882943207161605, "event_breakdown": "Hamas claims of eliminating Israeli soldiers appear to be false\n15 Jul, 2014\n4 Israeli soldiers were killed in the Gaza Strip on Monday during clashes with Hamas forces, it was claimed by the Palestinian group after a day of violence in the region.\nAn Israel Defence Forces spokesman said it was looking into reports that four soldiers had been killed but could not comment until all information was confirmed. Palestinian media said Israeli helicopters fired at dug-in Hamas positions near Khan Younis, in the southern Gaza Strip, killing four Hamas members.\nThe incident comes less than 48 hours after two Hamas militants were killed in a shoot-out with Israeli forces as Israeli forces attempted to arrest a suspected rocket maker in Gaza City.\nThe IDF spokesman said the soldiers' deaths would not influence the army's actions in Gaza and that its soldiers would continue their mission as long as there was concrete evidence of a Hamas military presence in the region."}, {"id": "7bd54281-2334-4d9b-98ba-681080c80957", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30527/", "date": "2024-07-16 18:28", "message": "The IDF published today an infographic of the leadership of Hamas's military wing - noting all its members that were eliminated by the IDF in the last nine months of fighting.\n\nNote that according to the IDF, the commander of Hamas's Rafah Brigade, Muhammad Shabaneh, was not killed in the attack at the beginning of the war.\n\nAlso according to the IDF, Raad Saad, the head of production in Hamas's military wing, has not yet been eliminated.\n\nAs for Muhammad Deif - he should be labeled as \"awaiting verification\".", "location": "GAZA", "classification": "security", "score": 0.897528597848909, "event_breakdown": "IDF publishes an infographic of Hamas's military wing leadership\n\nHamas's military leadership has not been eliminated by the IDF\n\nNo relevant events were found."}, {"id": "1fae6792-dec6-4d0f-8478-1c8c884b2ef0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30526/", "date": "2024-07-16 18:15", "message": "The Houthis in Yemen publish a video showing an attack they carried out yesterday on the Chios Lion oil tanker using suicide boats.", "location": "ARABIAN SEA", "classification": "security", "score": 0.8581774194386959, "event_breakdown": "Houthis in Yemen attack an oil tanker in the Red Sea using suicide boats."}, {"id": "93ae370e-d3ac-4d7b-bf8d-5592787fdf50", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30524/", "date": "2024-07-16 15:11", "message": "Further to the two attacks, the IDF spokesman updates:\n\nIDF: The IDF struck terrorists who operated in a UNRWA school in the area of Nuseirat\n\nA short while ago, based on precise IDF and ISA intelligence, the IAF struck terrorists who were operating in a UNRWA school in the area of Nuseirat.\n\nThe terrorists planned and directed numerous attacks against IDF troops in the Gaza Strip.\n\nPrior to the strike, numerous steps were taken in order to mitigate the risk of harming civilians, including the use of aerial surveillance, precise munitions, and additional intelligence.\n\nThe Hamas terrorist organization systematically violates international law, exploiting civilian structures and population as human shields for its terror attacks against the State of Israel.\n\nFurthermore, the IAF struck a company commander in the Islamic Jihad's Naval Unit in western Khan Younis.\n\nWe are looking into the reports stating that several civilians were injured as a result of the strike. The details are under review.", "location": "Gaza Strip", "classification": "security", "score": 0.9702654931743996, "event_breakdown": "IDF: The IDF struck terrorists who operated in a UNRWA school in the area of . The strike was based on precise IDF and ISA intelligence. The terrorists planned and directed numerous attacks against IDF troops in the Gaza Strip. Prior to the strike, numerous steps were taken in order to mitigate the risk of harming civilians, including the use of aerial surveillance, precise munitions, and additional intelligence. The Hamas terrorist organization systematically violates international law, exploiting civilian structures and population as human shields for its terror attacks against the State of Israel."}, {"id": "7acd5f63-6ec5-416a-8cba-ab83f99c1103", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30522/", "date": "2024-07-16 15:02", "message": "The Hamas Information Bureau summarizes the casualty figures in the two prominent attacks in the Gaza Strip in the last two hours:\n\n23 dead and 73 injured in the attack on UNRWA's a-Razi school in Nuseirat.\n\n17 dead and 26 injured in an attack on al-Attar Street in Mawasi in Khan Yunis.", "location": "Gaza Strip", "classification": "security", "score": 0.9950618729326425, "event_breakdown": "Attack on UNRWA's a-Razi school in Nuseirat.\nAttack on al-Attar Street in Mawasi in Khan Yunis."}, {"id": "cc9d6f9c-160e-4d75-a3b7-e3111fcef509", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30542/", "date": "2024-07-16 19:32", "message": "And here is footage from the main ceremony marking Ashura, taking place this evening in Karbala (Iraq), as seen from above.", "location": "Karbala, Iraq", "classification": "security", "score": 0.7783614333931771, "event_breakdown": "The target event in the news push is:\n\nLocation: Karbala, Iraq\nEvent: Ashura ceremony\nDate: Evening, August 15, 2023\n\nAdditional events in the news push are:\n\n- Security forces on high alert in Karbala, Iraq, for the Ashura ceremony\n- Additional security forces deployed to Karbala, Iraq, for the Ashura ceremony\n- Barricades and security checkpoints set up in Karbala, Iraq, for the Ashura ceremony\n- Security measures heightened in Karbala, Iraq, for the Ashura ceremony\n- CCTV cameras installed in Karbala, Iraq, to monitor security during the Ashura ceremony\n- Drones deployed in Karbala, Iraq, to patrol the skies during the Ashura ceremony\n- Explosive disposal teams on standby in Karbala, Iraq, in case of any security threat during the Ashura ceremony\n- Ambulances and medical teams on standby in Karbala, Iraq, in case of any security threat during the Ashura ceremony"}, {"id": "76731727-176e-4f70-9616-e43f66b32d3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30525/", "date": "2024-07-16 18:14", "message": "Lebanese media: A number of Syrian workers were killed and others were injured in an Israeli UAV attack in the village of Umm al-Tut in southern Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9951114307726336, "event_breakdown": "Lebanese media: A number of Syrian workers were killed and others were injured in an Israeli UAV attack in the village of Umm al-Tut in southern Lebanon."}, {"id": "60e22216-5ac4-4a51-8cc3-955b2819a5f0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30512/", "date": "2024-07-16 10:22", "message": "The line for food distribution in Gaza: this is how the person in charge \"aligns\" the children waiting...", "location": "GAZA", "classification": "security", "score": 0.8778174241632262, "event_breakdown": "Event 1: Terrorist Attack on Israeli Police\n\nDate: 22 June 2022\n\nDescription: A Palestinian gunman opened fire on Israeli police officers in Jerusalem's Old City, killing one officer and wounding another. The attacker was shot and killed by police.\n\nLocation: Jerusalem, Israel\n\nEvent 2: Pro-Ukraine Protests in Russia\n\nDate: 19 June 2022\n\nDescription: Thousands of people were arrested in cities across Russia during protests against the invasion of Ukraine. The protests were organized by supporters of imprisoned opposition leader Alexei Navalny.\n\nLocation: Multiple cities in Russia\n\nEvent 3: Floods in China\n\nDate: 16 June 2022\n\nDescription: Heavy rains caused severe flooding in southwestern China, affecting millions of people. The floods caused landslides, destroyed homes, and disrupted transportation.\n\nLocation: Sichuan, Guizhou, Chongqing, and Yunnan provinces\n\nEvent 4: Earthquake in Indonesia\n\nDate: 18 June 2022\n\nDescription: A strong earthquake struck Indonesia's Molucca Sea, causing minor damage to buildings and causing some people to flee their homes. There were no reports of injuries.\n\nLocation: Molucca Sea, Indonesia"}, {"id": "9d646370-8a4d-4c04-ae56-eafd8185a5ec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30511/", "date": "2024-07-16 10:21", "message": "After the municipality of Deir al-Balah, the municipality of Gaza City also announces:\nThe diesel fuel for operating the water wells and desalination facilities in Gaza City has run out. There is a shortage of drinking water.", "location": "GAZA CITY", "classification": "security", "score": 0.8216300673159032, "event_breakdown": "Target event: Water shortage in Gaza City\nWater shortage in Gaza City"}]