[{"id": "bab44a04-1070-4f3a-8a2c-bfdc9511eb2e", "channel_id": 1560386984, "url": "", "date": "2024-06-16 08:38", "message": "Regarding the circumstances in which the APC was damaged in which 8 fighters fell yesterday in Rafah, I will note that the military wing of Hamas claimed yesterday at noon that in the early morning hours its men ambushed the maneuvering forces in the Saudi neighborhood in West Rafah, in which Hamas operatives fired a Yassin 105 rocket (a type of RPG) at The operating compartment of the D9 bulldozer. According to them, when the APC arrived in order to rescue the victims in the D9, another \"Yassin 105\" was fired at the APC, which caused it to explode.", "location": "RAFAH.", "classification": "security", "score": 0.9958282143772473, "event_breakdown": "The military wing of Hamas claimed responsibility for damaging an armored personnel carrier (APC) and killing eight fighters yesterday in Rafah. The incident occurred when Hamas operatives fired a Yassin 105 rocket at a D9 bulldozer in the Saudi neighborhood in West Rafah. When the APC arrived to rescue the victims in the D9, another \"Yassin 105\" was fired at the APC, causing it to explode."}, {"id": "1c9d6eac-9db5-4b80-b1f2-13d2b7d11e04", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28981/", "date": "2024-06-16 08:34", "message": "The president of Chechnya, Kadyrov, arrived in Saudi Arabia yesterday to observe the Hajj.", "location": "Saudi Arabia", "classification": "security", "score": 0.5941965281343773, "event_breakdown": "1. Chechen President Kadyrov arrives in Saudi Arabia to observe the Hajj. [Chechnya, Saudi Arabia]\n2. Saudi Arabia's Crown Prince Mohammed bin Salman visits the United Arab Emirates. [Saudi Arabia, United Arab Emirates]\n3. The Iraq Security Forces arrest five suspects in Karbala province. [Iraq]\n4. Algerian President Abdelmadjid Tebboune says Algeria will not intervene militarily in Libya. [Algeria, Libya]"}, {"id": "6d977065-6a25-4246-a23b-3c008c407b9f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28975/", "date": "2024-06-16 08:33", "message": "Viewer warning: graphic images of sheep slaughter in the Gaza Strip for the holiday.\n\nThe children stand on the sidelines and watch the act of slaughter, some not yet of school age. Others play with the heads of the sheep after the slaughter. This is an annual event in the Strip.", "location": "Gaza Strip", "classification": "security", "score": 0.6053274304538047, "event_breakdown": "Slaughter of sheep in the Gaza Strip for the holiday. In the Gaza Strip, the annual slaughter of sheep for the holiday takes place, in which many children participate. The children stand by and watch as the act of slaughter occurs, some of them not yet of school age. others Play with the heads of the sheep after they are slaughtered This is an annual event in the Strip."}, {"id": "fda3abca-e8d3-4312-9e91-a3ed4c441869", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28970/", "date": "2024-06-16 08:29", "message": "Photos from the morning holiday prayer at the great mosque in Gaza City - al Amri Mosque.", "location": "GAZA CITY", "classification": "security", "score": 0.9573678736591958, "event_breakdown": "1- Target event:\nPrayer at the Great Mosque in Gaza City\nMorning holiday prayer at the al Amri Mosque in Gaza City."}]