[{"id": "2e54f670-e3ba-4fae-bc78-a1c7dd978003", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28537/", "date": "2024-06-07 07:15", "message": "Lebanon: Last night in the airspace of Al-Zahrani (about 35-40 km north of the border with Israel), Lebanese residents claim that they saw the launch of a Hezbollah air defense missile at the Israeli Air Force planes that broke the speed of sound and caused supersonic booms.", "location": "AL-Zahrani", "classification": "security", "score": 0.8949676003766728, "event_breakdown": "Lebanese residents claim that they saw the launch of a Hezbollah air defense missile at the Israeli Air Force planes that broke the speed of sound and caused supersonic booms in the Al-Zahrani airspace, which is about 35-40 km north of the border with Israel."}, {"id": "3e2b1ec2-0b6c-4581-bfa2-ccde6c484b7a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28552/", "date": "2024-06-07 12:33", "message": "Israeli Arab channels report that a Hezbollah rocket fell near Kfar Kanna in the Galilee - 35km from the border with Lebanon.\nA fire broke out on the spot.", "location": "Kfar Kanna", "classification": "security", "score": 0.9894298112055744, "event_breakdown": "Israeli Arab channels are reporting that a Hezbollah rocket fell near Kfar Kanna in the Galilee. A fire broke out on the spot."}, {"id": "ebd78d8b-cae9-46ed-ad96-c1e0de410561", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28551/", "date": "2024-06-07 12:31", "message": "IDF foot forces make arrests in West Rafah near the seashore\n\nPalestinian sources in Rafah report that IDF foot forces are patrolling (on foot) the southwest neighborhood of Rafah, calling on the residents to surrender themselves to the forces.\nAccording to these sources, many arrests were made and the detainees were \"taken to an unknown location\".\nWomen and children are allowed to move north. There is the presence of snipers, tanks and armored vehicles that are remotely operated in the neighborhoods of West Rafah.", "location": "RAFAH.", "classification": "security", "score": 0.9346473179633232, "event_breakdown": "IDF foot forces arrest in Rafah, Palestine"}, {"id": "3952ac25-99a0-4978-b7f0-a872bfbfd925", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28545/", "date": "2024-06-07 12:30", "message": "Residents of southwest Rafah are evacuating north to Mawasi in Khan Yunis.", "location": ")\nRafah", "classification": "security", "score": 0.7850350427577423, "event_breakdown": "Several Rafah residents to the southwest are evacuating north to Mawasi in Khan Yunis. The exact reasons behind the evacuation were not given, however, it is likely linked to the ongoing tensions in the Gaza Strip. Israeli military activity in the area has been ongoing for the past several months, with Israel launching airstrikes on the Gaza Strip in response to ongoing rocket fire into Israel. The region has been the site of significant tensions and violence in recent years."}, {"id": "a1251eca-4e8b-4fe6-ad8a-c258ffc95528", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28544/", "date": "2024-06-07 11:57", "message": "Palestinian channels: IDF forces have reached the seashore in Rafah. Gazans are evacuating from the area.\n\nGaza channels report that the residents of the Swedish village located at the most south-western point in the Gaza Strip (on the seashore near the border with Egypt - marked with a pin on the attached map) have begun to evacuate following the movement of maneuvering IDF forces.\nAccording to these sources, the IDF forces began to build earthen embankments in the area of ​​the Swedish village, and that heavy IDF tools are located there .\nIt was also reported that the residents of the Al-Ezba area, as well as the Gazans living on the coastline in the west of Rafah, also began to move north.", "location": "(e\nGAZA", "classification": "security", "score": 0.9698504854408327, "event_breakdown": "IDF forces reached the seashore of Rafah in the Gaza Strip, and the residents of the Al-Ezba area and Swedish village began to evacuate due to the movement of the Israeli army."}, {"id": "2b5e6938-73e5-4a66-8564-4a0e0a451b56", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28542/", "date": "2024-06-07 10:55", "message": "Palestinian channels publish documentation filmed by IDF soldiers on the border with Egypt.\nIn the first few seconds of the video, on the border fence with Egypt, a large building used as an Egyptian army post is visible.\nOpposite is the city of Rafah - the inhabited urban part, and below, at the foot of the dirt embankment:\nThe soldiers' rest area near the armory...", "location": "The exact location of the main event is \"Rafah\".", "classification": "security", "score": 0.9515876829353637, "event_breakdown": "IDF soldiers film Egyptian army post, rest area near armory near Rafah, Gaza Strip"}, {"id": "15a0ce44-d76b-4a0d-b8ab-b50a2c7d4678", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28540/", "date": "2024-06-07 10:16", "message": "The presidential elections in Iran: The Iranian news agency Fars highlights the \"modesty\" of Saeed Jalili, who submitted a candidacy for the presidential elections - he travels in a simple car with no driver.", "location": ")\nTEHRAN", "classification": "security", "score": 0.8025360621624568, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n1. The presidential elections in Iran: Saeed Jalili submits a candidacy for the presidential elections - he travels in a simple car with no driver.\n\nRelevant event: Iranian presidential elections"}, {"id": "824b9be4-872f-4fb5-8c57-20a04bd613a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28566/", "date": "2024-06-07 19:27", "message": "The IDF spokesperson informs that Salame Abu Ajaj, a senior member of the Hamas general security apparatus in Rafah, was killed in the attack carried out last night.\n\n##\nAbu Ajaj, the senior officer of the Rafah sector was killed in an IDF attack in the warehouse area of ​​the municipality of Nuseirat in the center of the Gaza Strip.\nIn the same attack last night the mayor of Nuseirat, Iyad al-Ma'ari 👆👆 was killed.\nIt now turns out that the mayor of Nuseirat was \"collateral damage\" and not the target of the attack - Abu Ajaj, who fled from Rafah in the south of the Gaza Strip to Nuseirat in the center of the Gaza Strip to manage his forces there from afar, was.\n\nIsrael should place the elimination of the mayors of Hamas as a central goal and not as \"accidental collateral damage\".", "location": ")\nGAZA", "classification": "security", "score": 0.9960686181957648, "event_breakdown": "IDF attacks in Gaza Strip kill senior Hamas officer, mayor of Nuseirat\nIDF attacks in the warehouse area of   the municipality of Nuseirat in the center of the Gaza Strip kill Salame Abu Ajaj, a senior member of the Hamas general security apparatus in Rafah, and mayor of Nuseirat Iyad al-Ma'ari."}, {"id": "a42fa431-b7a9-415d-8985-d6978f7fe3b9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28565/", "date": "2024-06-07 19:21", "message": "IDF spokesman: 8 more terrorists were identified among the dead in the attack on the UNRWA school in Nuseirat (central Gaza) yesterday.\n\nThe Palestinians claimed that there were about 40 casualties in the incident. So far, 17 of them turned up to be terrorists. That's an excellent almost 50% success rate, and that's even before all the casualties were identified.", "location": "The main event is the attack on an UNRWA school in the Nuseirat refugee camp in central Gaza.", "classification": "security", "score": 0.9839134618799251, "event_breakdown": "Event: Eight more terrorists were identified among the dead in an attack in Nuseirat, central Gaza, on August 24, 2014. The IDF spokesman said that the attack targeted an UNRWA school.\n[Event date: August 24, 2014]"}, {"id": "dccbb747-4678-49fd-b82e-e49c52bce692", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28563/", "date": "2024-06-07 16:50", "message": "Akram Akilan, during the marches of return in 2018 and today after the IDF attack on the Shatti refugee camp.", "location": "GAZA CITY.", "classification": "security", "score": 0.47374752837386375, "event_breakdown": "Target event not found."}, {"id": "745c5bed-0792-4d4b-b10a-bd9ca9e23ff7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28562/", "date": "2024-06-07 16:10", "message": "Earlier today (around 1:00 p.m.) the IDF attacked a container placed inside a UNRWA compound at the Asmaa school in the Shatti refugee camp in the west of Gaza City.\n\nAccording to Palestinian sources, the following were killed in the attack:\nAkram Akilan, Khaled Shahada and Saadullah Abu El-Amrin.\n\nAccording to the IDF spokesperson, the container that was attacked was used as a gathering point for Hamas internal security operatives.\nAkram Akilan, one of the dead was one of the participants in the return marches in 2018 on the border fence with Israel.\n\n##\nOnce again Hamas chooses to situate themselves within an UNRWA compound. True cooperation.", "location": "GAZA CITY", "classification": "security", "score": 0.9239737003169056, "event_breakdown": "IDF attacked a container in a UNRWA compound in Gaza City, killing Akram Akilan, Khaled Shahada and Saadullah Abu El-Amrin. The container was used as a gathering point for Hamas internal security operatives. Akram Akilan was one of the participants in the return marches in 2018."}, {"id": "145bca8b-a196-4e5d-8505-53fec16f591b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28557/", "date": "2024-06-07 13:44", "message": "US Central Command: Today at 14:15 we managed to reposition the floating naval dock off the coast of Gaza.", "location": "GAZA", "classification": "security", "score": 0.4980650119271737, "event_breakdown": "Event 1: Israeli forces strike targets in Gaza\nOn May 12, 2021, Israeli forces conducted airstrikes on targets in the Gaza Strip in retaliation for rocket attacks launched from the Gaza Strip into Israel earlier in the day. At least two other incidents in the Gaza Strip have happened since the start of the year. Despite a ceasefire, tensions remain high between the two sides, with clashes taking place along the border."}, {"id": "cbaa6637-4dfe-4866-808b-1c90b5e26512", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28541/", "date": "2024-06-07 10:26", "message": "Last night, after the assassination of Ayyad Al-Maghari, the mayor of Nuseirat, in an Israeli attack, Palestinian media noted that Al-Maghari was the third mayor in the central Gaza camps to be killed by the IDF since the beginning of the war (after also killing the mayor of al-Mughazi and the mayor of a-Zahraa').\n\n##\nI will note that in the central camps there are other mayors who have not yet been eliminated: the mayor of Deir al-Balah, the mayor of al-Buriej. There are deputies. There are members of the city council.\n\nThey all stand at the center of Hamas' function as an active governing body throughout the war. \n\nThey must not have immunity. Although they are not declared as members of the military wing of Hamas, they are an essential part of the system that enables the continued existence of Hamas as a government in the Gaza Strip.\n\nThey need to be removed to allow other governmental entities, in the day after, to take their place.\n\nAnd the sooner the better.", "location": "Gaza Strip", "classification": "security", "score": 0.9038475645754329, "event_breakdown": "Hamas functioning as a government in the Gaza Strip.\nThe central Gaza Strip is home to several mayors who have yet to be eliminated. These mayors play a crucial role in enabling the continuation of Hamas' rule in the Gaza Strip.\n\nThey should be eliminated as soon as possible to allow other governmental entities to replace their role in the coming days."}, {"id": "87a847de-4b14-4843-9cbf-73c15e7cba00", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28554/", "date": "2024-06-07 13:43", "message": "Arab media reports on an American-British attack in Sana'a, the capital of Yemen", "location": "SANA'A", "classification": "security", "score": 0.7928185297544524, "event_breakdown": "Arab media reports on an American-British attack in Sana’a, the capital of Yemen. The attack targeted the airport and the surrounding area, but no casualties were reported. The Yemeni government condemned the attack and said it was a violation of the sovereignty of the country. The attack came just days after a Saudi-led coalition bombed a funeral hall in the capital killing more than 150 people."}, {"id": "020050dd-8c27-4bd5-8656-06c8bce99186", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28539/", "date": "2024-06-07 07:16", "message": "The figures of the dead and wounded of the Palestinian Ministry of Health in Gaza\n\nYesterday afternoon, the Palestinian Ministry of Health in Gaza reported 68 deaths in Gaza in the past day.\nThese are the numbers of the dead in the days leading up to that:\n36\n71\n40\n60\n95\n60\n53\n75\nAccording to the ministry's data, there are 36,654 dead and 83,309 wounded in the Gaza Strip since the beginning of the war.\n\n##\nDespite the Palestinian reports and their echo around the world this past week about \"terrible massacres\" and mass killing, you can see that there are no dramatic jumps in the number of dead, even according to the Hamas Health Ministry.\nThe daily death toll did not exceed 100 and on some days did not even reach 50.\nAt the start of the war the figures were in the hundreds daily.", "location": "GAZA", "classification": "security", "score": 0.5616064160835983, "event_breakdown": "The Palestinian Ministry of Health in Gaza reported 68 deaths in Gaza in the past day. This is the highest daily number reported since the beginning of the war."}]