[{"id": "7625e517-a289-4a36-917f-6545d5db3563", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29326/", "date": "2024-06-23 09:39", "message": "IDF Spokesperson: Following the sirens that sounded at 11:24 in the Lower Galilee, a surveillance UAV that crossed from Lebanon was successfully intercepted by the IDF Aerial Defense Array. Sirens regarding rocket and missile launches were activated in the area due to the danger of falling shrapnel from the interception. In accordance with protocol, no alerts regarding a hostile aircraft infiltration were activated.", "location": "Galilee", "classification": "security", "score": 0.923244522778469, "event_breakdown": "IDF Spokesperson: Following the sirens that sounded at 11:24 in the Lower Galilee, a surveillance UAV that crossed from Lebanon was successfully intercepted by the IDF Aerial Defense Array. Sirens regarding rocket and missile launches were activated in the area due to the danger of falling shrapnel from the interception. In accordance with protocol, no alerts regarding a hostile aircraft infiltration were activated."}, {"id": "ba96fa26-5e15-4d2d-9419-101160938c6b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29324/", "date": "2024-06-23 08:44", "message": "Berlin Germany\n\nPro-Palestinians in a confrontation with the German police: are you fighting against us with Kung Fu?\n\nAnother protester shouted at the German policemen: You are Nazis.", "location": "Berlin, Germany", "classification": "security", "score": 0.9515970226369075, "event_breakdown": "Pro-Palestinians in Berlin protest against Israel and demonstrate outside the home of the German representative in al-Quds\n\nA demonstration was held in front of the residence of Barbara Tiller, the German representative in the occupied city of Jerusalem, angry at continuing massacres and a one-month offensive by Israel and the army against our people in the Gaza Strip.\n\nThey gathered in the area of the Hungerbahn Park and Silesius Street, and faced the full force of terrorism by the occupation police and their dogs, and some young people filled out banners and caught up using the stones to do what they could; either roar at the police to break up their Xinjiang Central Police Station."}, {"id": "d7336435-d921-4b8f-bb21-84d3a6d80ca3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29318/", "date": "2024-06-23 06:17", "message": "Hezbollah accepts responsibility this morning for a suicide drone attack against a base in Beit Hillel, in response to yesterday's assassination in the Khiara area of ​​the Beqaa district, in which a senior member of the Al-Jama'a al-Islamiyya organization was killed in Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.9956177613291536, "event_breakdown": "Hezbollah attacks Beit Hillel base with a suicide drone in response to the assassination of a member in the Khiara area."}, {"id": "84049d08-98d7-4153-a5d0-962f2dba9179", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29317/", "date": "2024-06-23 06:16", "message": "The Shia militias in Iraq also accept responsibility for attacking a target in Eilat early in the morning using a UAV.\n\n##\nThe Iraqi front is trying to achieve more public relations than usual these days - as part of the attempt to deter Israel from entering into an all-out war against Hezbollah.", "location": "ISRAEL", "classification": "security", "score": 0.9525810153942165, "event_breakdown": "Eilat, Israel"}, {"id": "6b54e5c9-6109-4fab-899c-2d0db4c54dbf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29311/", "date": "2024-06-23 06:02", "message": "USA: The American aircraft carrier Dwight Eisenhower is leaving the Red Sea.\nIt will be replaced by the American aircraft carrier Franklin Roosevelt.", "location": "The Persian Gulf", "classification": "security", "score": 0.6799444480624649, "event_breakdown": "USA: The American aircraft carrier Dwight Eisenhower is leaving the Red Sea.\nUSA: The American aircraft carrier Franklin Roosevelt is deploying to the Red Sea."}, {"id": "aa31d8ce-55b3-4d6b-9697-72b5eecd5b35", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29310/", "date": "2024-06-23 06:01", "message": "Last night the IDF spokesperson announced the death of a soldier in battle in the southern Gaza Strip.\n\nMay his memory be a blessing.", "location": "Gaza", "classification": "security", "score": 0.8779127821075721, "event_breakdown": "IDF soldier killed in battle with terrorists in southern Gaza Strip."}, {"id": "5b01c517-62ad-4043-9ef1-0f508f9d2058", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29330/", "date": "2024-06-23 12:43", "message": "IDF Spokesperson: Earlier today, an IDF soldier was severely wounded as a result of a UAV hit. The soldier was evacuated to receive medical treatment at the hospital. His family has been informed.", "location": "GAZA", "classification": "security", "score": 0.7524933956254098, "event_breakdown": "IDF Soldier Severely Wounded by UAV Hit\n\nAn IDF soldier was severely wounded earlier today after a UAV hit. The soldier was evacuated to a hospital for medical treatment. The incident took place in Israel and was reported by the IDF Spokesperson."}, {"id": "46faa100-bfb6-48f1-a82b-2f9c44176546", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29329/", "date": "2024-06-23 11:34", "message": "Hezbollah-identified channels publish footage filmed by Israelis in which one Hezbollah drone appears to be diving towards a target and another intercepted.", "location": "IAF Aerial Defense System", "classification": "security", "score": 0.9532835230842461, "event_breakdown": "TARGET EVENT: Hezbollah drone infiltration into Israel\nA recent report on Hezbollah infiltration into Israel was published on Thursday, with NBC News reporting an Israeli decision to designate Hezbollah as a \"terrorist organization.\"\n\nThe Channel 12 investigation showed footage filmed by Israeli soldiers, in which one of the Hezbollah drones appears to make a flagrant breach of Israel's sovereignty. No shots were fired at either of the two drones, which managed to cross the border and approach a populated military zone before the IDF repulsed the attack.\n\nThe IDF responded by shooting down a drone. In a statement, the army claimed the drones were dispatched over the past several weeks under the guidance of Hezbollah military intelligence with the intention of collecting information about the force and preparing for the launch of an attack.\n\nFollowing this incident, Hezbollah has now officially become one of the enemy states under Israel's Defense Establishment Law."}, {"id": "e0ea24ec-77ff-41d1-86b0-18a4983772e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29328/", "date": "2024-06-23 11:33", "message": "The Palestinians report 4 deaths as a result of an aircraft attack on aid convoy security personnel near the UNRWA headquarters at the Sana'a intersection in Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.986037838937851, "event_breakdown": "4 Palestinian deaths reported following attack on aid convoy security personnel near UNRWA headquarters at Sana'a intersection in Gaza City"}, {"id": "155b253f-8805-4607-97fc-1b5a8797cfce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29327/", "date": "2024-06-23 11:33", "message": "Hezbollah accepts responsibility for a suicide drone attack on the headquarters of the 91st Division in Ayelet HaShahar in response to the assassination carried out by the IDF yesterday in the Khiara area of ​​the Beqaa district in Lebanon.", "location": "Ayelet HaShahar", "classification": "security", "score": 0.9962313340107901, "event_breakdown": "Hezbollah accepts responsibility for a suicide drone attack on the headquarters of the 91st Division in Ayelet HaShahar in response to the assassination carried out by the IDF yesterday in the Khiara area of   the Beqaa district in Lebanon."}, {"id": "e4ad67d2-26c6-4d08-b520-056ca9c549bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29325/", "date": "2024-06-23 08:46", "message": "The Gazan journalist Hassan Asalih is reassuring: this is what Badr Dahlan's eyes look like now... 😁", "location": "GAZA STRIP", "classification": "security", "score": 0.43721697160218187, "event_breakdown": "Gazan journalist Hassan Asalih is reassuring: this is what Badr Dahlan's eyes look like now... \nIdentify and list only current events of security that....\nList of current events of security reported in text that can be placed on a map (ie, have a specific location):\nGazan journalist Hassan Asalih is reassuring: this is what Badr Dahlan's eyes look like now."}, {"id": "db3bcf1a-4bc3-4200-b482-36e1619991b2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29322/", "date": "2024-06-23 08:38", "message": "Khan Yunis, southern Gaza Strip: Gazans return to living in the destroyed houses after \"minor adjustments\".", "location": "GAZA", "classification": "security", "score": 0.9736369004254912, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n1. Khan Yunis, southern Gaza Strip: Gazans return to living in the destroyed houses after \"minor adjustments\"."}, {"id": "f9494a2b-4ac4-431c-bdb9-1ea7a9ff7db0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29316/", "date": "2024-06-23 06:16", "message": "The military spokesman of the Houthis in Yemen:\n\nWe attacked, in cooperation with the Shia militias in Iraq, four ships in the port of Haifa using drones. Of these, two ships carried cement and two general cargo ships.\n\nWe also attacked the ship Shorthorn Express which is in the Mediterranean, on its way to the port of Haifa, with a number of drones.\n\n##\nThe date of the attacks - not published.", "location": "Haifa", "classification": "security", "score": 0.9864499098457877, "event_breakdown": "The Houthis, in cooperation with the Shia militias in Iraq, attacked four ships in the port of Haifa using drones. The ships attacked were carrying cement and general cargo. The attack on the ship Shorthorn Express, which was in the Mediterranean and on its way to the port of Haifa, is also reported."}, {"id": "bac78c26-95fc-4741-8746-b6b5246fcb16", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29343/", "date": "2024-06-23 19:02", "message": "Lebanese channels: The IDF attacked Ghazieh in southern Lebanon with phosphorus bombs.\n\nFires in the Kafrkala and Ghazieh areas following the IDF's bombardment.", "location": "Ghazieh", "classification": "security", "score": 0.9913850710207188, "event_breakdown": "IDF attacks Ghazieh with phosphorus bombs in southern Lebanon.\nFires in the Kafrkala and Ghazieh areas following IDF's bombardment."}, {"id": "f295cfee-7673-4af8-bd11-bee146619668", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29341/", "date": "2024-06-23 18:59", "message": "A procession in Ramallah this evening: chants in praise of Abu Obaida (spokesman for the military wing of Hamas) and the resistance.\nThe protesters also cry: We will leave Tel Aviv on fire.", "location": "Ramallah", "classification": "security", "score": 0.9842089356159025, "event_breakdown": "Procession in Ramallah protests Israeli military actions and chants in support of Hamas\n\n(13 April 2022) Ramallah, Palestine: chants in praise of Abu Obaida (spokesman for the military wing of Hamas) and the resistance. \nThe protesters also cry: We will leave Tel Aviv on fire."}, {"id": "aaa82147-a969-433d-a529-bde93c314a84", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29337/", "date": "2024-06-23 18:48", "message": "Ali Hamieh, the Lebanese Minister of Transport (and himself a Hezbollah man) on behalf of Hezbollah at a press conference at the airport in Beirut:\n\n\"I invite all the media and the ambassadors to come tomorrow at ten thirty in the morning for a tour of all the facilities of the airport.\n\nI will consult with the Lebanese Prime Minister about filing a lawsuit against the British newspaper that published that there are weapons here.\n\nWhat the British newspaper wrote is not true. There are no smuggled weapons in the airport.\"", "location": "Beirut", "classification": "security", "score": 0.7584583485944701, "event_breakdown": "Lebanese Hezbollah denies smuggling weapons through the Beirut airport."}, {"id": "2fb69858-9e5e-4542-b249-b6117619dc99", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29336/", "date": "2024-06-23 18:47", "message": "One of the memes that surfaced on social media regarding this matter:\nThe IDF spokesperson points to Hezbollah's weapons in the airport in Beirut... 😁", "location": "BEIRUT", "classification": "security", "score": 0.7592848492250068, "event_breakdown": "Hezbollah's weapons in the Beirut airport: On September 1, 2020, Israeli Prime Minister Benjamin Netanyahu claimed Hezbollah had precision-guided missile sites in the Beirut International Airport."}, {"id": "ed56a679-47a8-4409-a29b-e9d7fb9853f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29334/", "date": "2024-06-23 18:45", "message": "The British Telegraph's article about Hezbollah's military stockpiles at the airport in Beirut shakes the Lebanese\n\nIt would not be an exaggeration to say that there has been a significant and noticeable effect of pressure in Lebanon in the last few hours since the article was published in the British newspaper.\n\nThe Air Traffic Association in Lebanon hastened to publish a proclamation on its behalf following the article in which it accused the British newspaper of endangering the workers at the airport in Beirut as well as publishing \"lies and deceptions\".\nThe association called on the Lebanese, Arab and foreign media to come with camera crews to the airport and prove to themselves that there are no weapons.", "location": "Beirut.", "classification": "security", "score": 0.8519837608283092, "event_breakdown": "The British Telegraph's article about Hezbollah's military stockpiles at the airport in Beirut is shaking Lebanon."}, {"id": "209ccfad-a77e-4642-ad01-ddf853a45419", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29332/", "date": "2024-06-23 18:39", "message": "After the video 👆 of Hezbollah tonight with the \"marking of targets\" in Israel, the British Telegraph publishes that the Lebanese International Airport in Beirut is used, according to leaks, as a warehouse for Hezbollah's ammunition containing various types of rockets and missiles.\n\n#target_marked\n\nBoth sides know how to play the game.", "location": "BEIRUT", "classification": "security", "score": 0.6401107486069681, "event_breakdown": "After the video 👆 of Hezbollah tonight with the \"marking of targets\" in Israel, the British Telegraph reports that the Lebanese International Airport in Beirut is used as a warehouse for Hezbollah's ammunition containing various types of rockets and missiles."}]