[{"id": "a0b61e5b-c577-4caf-a0ba-1e01e77dd3a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29043/", "date": "2024-06-17 13:20", "message": "Hamas in an official announcement: the burning of the exit hall at the Rafah crossing by the occupation army is a war crime\n\n##\nIn the pictures: before and after", "location": "GAZA", "classification": "security", "score": 0.9278680319032475, "event_breakdown": "Current events of security reported in the news that can be placed on a map include:\n- Hamas in an official announcement: the burning of the exit hall at the Rafah crossing by the occupation army is a war crime."}, {"id": "5e2465bb-f9f6-45b9-b0a0-4e8ff8159ad7", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68995/", "date": "2024-06-17 13:00", "message": "Hezbollah officially announces the death of:\n\nMuhammad Ayoub - he was killed in the car attack in Selaa in southern Lebanon, earlier today.\n\nNumber 345", "location": "Selaa", "classification": "security", "score": 0.9210848633799239, "event_breakdown": "Hezbollah officially announces the death of Muhammad Ayoub. He was killed in the car attack in Selaa in southern Lebanon, earlier today."}, {"id": "a8020711-608f-4e27-9bd5-e4b27fbd639b", "channel_id": 1560386984, "url": "", "date": "2024-06-17 11:21", "message": "Palestinian channels have been reporting on the movement of Israeli tanks and heavy equipment from the Philadelphi axis area towards the center of Rafah city and the area of ​​Al-Awda Square - where, according to these sources, the maneuvering forces are setting residents' houses on fire.\nAlong with the advance of the forces to the north, accompanying artillery fire was reported as well as an attack on a group of people using a UAV in the area of ​​the Khirbat al-Adas neighborhood in the north of Rafah (it also appears on the map).", "location": "GAZA STRIP", "classification": "security", "score": 0.9858362704002958, "event_breakdown": "Israeli army advances toward the center of Rafah, artillery fire reported, and UAV attack on a group of people in the Khirbat al-Adas neighborhood in the north of Rafah."}, {"id": "3b120dcf-2967-4f5c-b7f7-5dec68c259ac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29029/", "date": "2024-06-17 10:59", "message": "Additional photos of the vehicle that was attacked near Sela in southern Lebanon.", "location": "The main event takes place in Sela, southern Lebanon.", "classification": "security", "score": 0.9954199842545294, "event_breakdown": "TARGET EVENT:\nOn May 8, 2022, Israeli jets struck several targets in Lebanon, the Lebanese army said, in the first major flare-up between Israel and the Iranian-backed group Hezbollah since an escalation in September 2021.The strikes came after the leaders of Lebanon's Hezbollah movement and the Iranian Quds Force commander Qasem Soleimani were killed in an Israeli airstrike in Lebanon.\nLebanese Army: Israeli Jets Conducted 7 Strikes in South Lebanon\nLebanese army troops conducted an operation on Tuesday aimed at stopping the Israeli jets that struck several targets the previous day in the south of the country, reported the Lebanese al-Modon news site, citing the Lebanese army's commander.As\ntarget : the attack by Israeli jets on Hezbollah targets in southern Lebanon"}, {"id": "9ad0cda3-3e67-4460-b46b-47c8154aad9b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29026/", "date": "2024-06-17 10:59", "message": "Unofficial Lebanese channels report two deaths in an Israeli drone attack around noon on a vehicle near the village of Sela in southern Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9877034025785357, "event_breakdown": "Security incidents were reported in the following locations -\n- drone attack near Sela, Lebanon\n- two fatalities reported"}, {"id": "e132e146-c6f8-4202-823f-c3dfea9caf09", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29020/", "date": "2024-06-17 10:54", "message": "Photos showing the sinking of the Greek ship Tutor that was damaged as a result of a Houthi explosive on June 12.\n\nAlso attached is a video from the moments before the boat was hit, after the threat was identified by the ship's security team, as well as another video after the hit.\n\nAs a result of the impact, a member of the ship's crew went missing. The rest of the crew were rescued that day by US-led coalition forces.", "location": "RED SEA.", "classification": "security", "score": 0.7714361869537574, "event_breakdown": "Houthi explosive damaged a Greek ship in Yemen (World) and resulted in one casualty. Crew rescued by coalition forces."}, {"id": "47c3f8c8-4f71-4eef-a6db-2929a8d57fd6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29017/", "date": "2024-06-17 07:31", "message": "South Lebanon: Also in the villages of Tayrharfa and Ayta ash-Shab, the residents of southern Lebanon (who fled the terror of the war) are taking advantage of the holiday and the relative peace on the border with Israel to reach their homes and assess the damage from the Israeli attacks.", "location": "Southern Lebanon", "classification": "security", "score": 0.9736386852400865, "event_breakdown": "South Lebanon: Residents of southern Lebanon are taking advantage of the holiday and the relative peace on the border with Israel to reach their homes and assess the damage from the Israeli attacks.\n\nTarget event: Residents of southern Lebanon assess the damage from Israeli attacks."}, {"id": "b4e0a802-dc86-4610-952c-1f056870b8bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29049/", "date": "2024-06-17 19:36", "message": "\"Hot goods\" entered the Strip today through trucks that passed through Kerem Shalom: watermelons on their way to Abu Kader with nicotine.\n\nNext time check them better at the crossing. This watermelon is worth more than 15 thousand NIS in Gaza...", "location": "GAZA", "classification": "security", "score": 0.6640303300562238, "event_breakdown": "watermelons on their way to Abu Kader with nicotine"}, {"id": "19b55522-bbb0-4e16-8534-afa1b98157e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29046/", "date": "2024-06-17 19:02", "message": "Lebanese channels report on a series of attacks by the IDF this evening in southern Lebanon.\nAccording to these sources, there are casualties in the attacks in Chira and Aitaroun.", "location": "CHIRA", "classification": "security", "score": 0.9866135198931631, "event_breakdown": "IDF attacks in southern Lebanon reported on Lebanese media\nLebanese channels report on IDF attacks in Chira, Aitaroun"}, {"id": "1ce4690c-32cb-4477-8a72-569cf138004a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29045/", "date": "2024-06-17 18:59", "message": "Palestinian channels report 12 dead and a number of wounded in an Israeli attack on a force securing goods and humanitarian aid trucks in East Rafah.", "location": "GAZA", "classification": "security", "score": 0.9835040513602368, "event_breakdown": "12 dead in Israeli attack on force securing goods trucks in East Rafah"}, {"id": "e4301772-e36b-4c3e-b812-2e10a717838f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29044/", "date": "2024-06-17 15:33", "message": "Rafah sector: The IDF spokesperson publishes aerial footage of the Swedish village in the southwest of Rafah that was cleared by the soldiers of the 162nd division, after they also took control of the Philadelphi axis.\nAccording to the IDF spokesperson, hundreds of terrorists were killed during the fighting in Rafah. Hundreds of tunnel shafts and about 25 tunnels have been uncovered so far.\nThe activity continues.", "location": "RAFAH.", "classification": "security", "score": 0.9318019253195496, "event_breakdown": "The IDF spokesperson publishes aerial footage of the Swedish village in the southwest of Rafah that was cleared by the soldiers of the 162nd division, after they also took control of the Philadelphi axis."}]