[{"id": "4746559b-8d9c-442a-b35f-6911ddc8d12f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26560/", "date": "2024-05-01 14:52", "message": "From the other side, the pro-Hamas students at UCLA call out to the Los Angeles police officers:\n\nPigs go home!\n\n##\nThe whole story is in two videos.", "location": "Los Angeles", "classification": "security", "score": 0.7977283031701242, "event_breakdown": "- Pro-Hamas students at UCLA call out to Los Angeles police officers: \"Pigs go home!\""}, {"id": "767ea233-c033-4005-9409-bea3acca056c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26559/", "date": "2024-05-01 14:03", "message": "California, UCLA:\n\nLos Angeles police officers arrive at the university grounds and are greeted with sympathetic chants from the pro-Israel students:\n\nUSA, USA, USA !", "location": "UCLA", "classification": "security", "score": 0.7240329419690582, "event_breakdown": "1. Los Angeles police officers arrive at the UCLA campus.\n2. Pro-Israel students at UCLA chant \"USA, USA, USA!\" in support of the police presence."}, {"id": "5a1db001-5693-4eca-bd47-125122d0a5c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26558/", "date": "2024-05-01 13:45", "message": "An important statement yesterday by the spokesperson of the American State Department, regarding the lawsuits against Israel for the war in Gaza:\n\nWe believe that the International Criminal Court in The Hague has no jurisdiction in this matter.", "location": "The Hague", "classification": "security", "score": 0.6211716807888927, "event_breakdown": "- Statement by the spokesperson of the American State Department regarding lawsuits against Israel for the war in Gaza"}, {"id": "2c22a021-4880-4db0-8f4d-1118f5b689da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26557/", "date": "2024-05-01 13:44", "message": "Hezbollah announces a death in its ranks:\n\nVahid Tefili, born in 2000 from the village of Deir al-Zahrani in southern Lebanon.\n\nVahid was seriously injured more than four days ago and died tonight from his wounds. The circumstances of his death are not specified.\nIn addition to being a Hezbollah military operative, he was a \"commander\" in the local Hezbollah scout tribe.\n\nNumber 291", "location": "Deir al-Zahrani", "classification": "security", "score": 0.9744458110938735, "event_breakdown": "- Hezbollah announces the death of Vahid Tefili, a military operative and \"commander\" in the local Hezbollah scout tribe.\n- Vahid Tefili was born in 2000 in the village of Deir al-Zahrani in southern Lebanon.\n- Vahid was seriously injured over four days ago and succumbed to his wounds. The exact circumstances surrounding his death remain unspecified."}, {"id": "ba3761af-4c1b-4037-b873-a48847c64c4c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26554/", "date": "2024-05-01 13:36", "message": "The operation in Rafah - the Lebanese Al-Akhbar newspaper (Hezbollah-affiliated) from its sources:\n\nThe US demands that Israel evacuate at least 800,000 displaced people from Rafah before the attack in the area. 40,000 tents arrived in Israel from China, paid for by the United Arab Emirates. Each tent can accommodate 20 people (a total of 800,000 people).\n\nThere is a concentration of about a thousand IDF vehicles, including tanks and APCs in the southern area of ​​the Gaza Strip (on the Israeli side).\nIsrael is planning to break into Rafah from the area of ​​the Sofa crossing and the Kerem Shalom crossing.\n\nThe Egyptians asked to check with the leadership of Hamas, whether its military arm is planning to blow up the fences in the border area with Egypt in order to cause crowds to flee to Egyptian territory.", "location": "Rafah", "classification": "security", "score": 0.9569005729564938, "event_breakdown": "1. The US demands Israel to evacuate 800,000 displaced people from Rafah before an attack.\n2. 40,000 tents arrived in Israel from China, paid for by the United Arab Emirates, each tent can accommodate 20 people.\n3. Concentration of about a thousand IDF vehicles, including tanks and APCs in the southern area of the Gaza Strip.\n4. Israel plans to break into Rafah from the Sofa crossing and Kerem Shalom crossing.\n5. Egyptians request confirmation from Hamas leadership if its military arm plans to blow up fences at the border with Egypt."}, {"id": "34ffae12-a775-4c40-a7ef-a222103c5db8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26553/", "date": "2024-05-01 06:54", "message": "City University of New York (CUNY): NYPD remove the Palestinian flag and return the American flag to its rightful place.\n\nHow symbolic.", "location": "City University of New York (CUNY)", "classification": "security", "score": 0.6717599929513742, "event_breakdown": "- City University of New York (CUNY): NYPD remove the Palestinian flag and return the American flag to its rightful place."}, {"id": "40d4a92c-d914-4503-a61a-77adcea5542f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26552/", "date": "2024-05-01 06:52", "message": "University of Washington: Olivia Feldman, a Jewish student, says that she does not feel safe on her university's campus and notes that she was shouted at to \"go back to the gas chambers.\"\n\nOlivia is the great-granddaughter of a Holocaust survivor.\n\n#Antisemitism_on_campuses", "location": "University of Washington", "classification": "antisemitism", "score": 0.9258163430419338, "event_breakdown": "- University of Washington: Olivia Feldman, a Jewish student, reports feeling unsafe on campus after being shouted at to \"go back to the gas chambers.\"\n- Olivia Feldman, great-granddaughter of a Holocaust survivor, highlights instances of antisemitism on campuses."}, {"id": "f39a5790-4f7c-452b-8247-38c29dfe1857", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26552/", "date": "2024-05-01 06:52", "message": "Florida: Security forces dispersed a demonstration on the campus of the University of South Florida by firing tear gas.\n\nPro-Palestinian rioters were also arrested there.", "location": "University of South Florida", "classification": "security", "score": 0.8859654747405098, "event_breakdown": "- Security forces dispersed a demonstration on the campus of the University of South Florida by firing tear gas.\n- Pro-Palestinian rioters were also arrested there."}, {"id": "5de57214-a636-4d5a-9da3-7a779cb159df", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26547/", "date": "2024-05-01 06:50", "message": "Outside Columbia University: \"NYPD, KKK, IDF they're all the same\" \n\nArrests were made there as well.", "location": "Outside Columbia University", "classification": "security", "score": 0.8221939130531482, "event_breakdown": "- Protest outside Columbia University denouncing NYPD, KKK, and IDF.\n- Arrests made during the protest."}, {"id": "497e9121-a5c5-410c-a60e-e63b13e4fbdd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26544/", "date": "2024-05-01 06:48", "message": "NYPD buses with the detainees from tonight leave the grounds of Columbia University.", "location": "Columbia University", "classification": "security", "score": 0.5229719379429217, "event_breakdown": "1. NYPD buses with detainees leave Columbia University grounds."}, {"id": "40c976d7-f606-4770-96bd-59f4a1f2be1d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65853/", "date": "2024-05-01 06:46", "message": "US media channels reports that the NYPD arrested about a hundred people on Columbia University's campus.\n\nIn a statement, Columbia University claimed that the leaders of the protest on campus are not even students of the university, but rather external parties.\n\nThe president of the university asked the police forces to remain on the university campus until May 17th to maintain order and make sure that no tent camps are set up on campus.", "location": "Columbia University", "classification": "antisemitism", "score": 0.5850521548096034, "event_breakdown": "- NYPD arrests around 100 people on Columbia University's campus.\n- Columbia University claims protest leaders are external parties, not students.\n- University president requests police presence until May 17th to prevent tent camps."}, {"id": "e471124e-52db-4792-a8f6-912b5aa4ccb8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26538/", "date": "2024-05-01 06:44", "message": "At the center of it all - the removal of the Palestinian rioters occupying Hamilton Hall, which they had vandalized while taking over the building and barricading themselves inside.", "location": "Hamilton Hall", "classification": "security", "score": 0.942578494351582, "event_breakdown": "- Palestinian rioters occupy Hamilton Hall\n- Vandalism of Hamilton Hall\n- Barricading themselves inside Hamilton Hall"}, {"id": "acbcf955-aa72-40ff-9ea8-4f6962009a79", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26537/", "date": "2024-05-01 06:40", "message": "New York: In the last few hours, the signal was finally given and the New York police entered Columbia University in large forces to disperse the hate demonstration against Israel.", "location": "Columbia University", "classification": "antisemitism", "score": 0.3014433288682847, "event_breakdown": "- Signal given for New York police to enter Columbia University\n- New York police entered Columbia University in large forces to disperse hate demonstration against Israel"}, {"id": "b8443150-d951-40b0-93f2-f0f84efe1ed3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26536/", "date": "2024-04-30 21:25", "message": "University of Ottawa in Canada - chants in Arabic:\nFree Free Palestine\nOut out with Israel", "location": "University of Ottawa, Ottawa, Canada", "classification": "security", "score": 0.48927072203212124, "event_breakdown": "1. University of Ottawa in Canada - Chants in Arabic: \"Free Free Palestine, Out out with Israel\""}, {"id": "36772e41-1ec8-4784-ba44-1eea06453302", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26535/", "date": "2024-04-30 20:55", "message": "Tomorrow will be a month since the last attack attributed to Israel in Damascus, the capital of Syria - the attack in which Muhammad Reza Zahedi, the commander of the Quds Force in the Iranian Revolutionary Guards in the Syrian and Lebanese sector, was killed.\n\nAccording to Syrian sources, this is the longest quiet period in the skies of Damascus in recent years.\n\nIs the Iranian deterrence working?", "location": "Damascus, Syria", "classification": "security", "score": 0.8725166052039606, "event_breakdown": "- Attack attributed to Israel in Damascus, Syria\n- Killing of Muhammad Reza Zahedi, commander of the Quds Force in the Iranian Revolutionary Guards\n- Longest quiet period in the skies of Damascus in recent years"}, {"id": "d73e0867-2a83-4406-81a7-663a6924bccd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26533/", "date": "2024-04-30 19:51", "message": "President Biden: Hamas has now become the only obstacle to a ceasefire and aid to civilians in Gaza.", "location": "Gaza", "classification": "security", "score": 0.35802645145819, "event_breakdown": "1. President Biden stated that Hamas is the only obstacle to a ceasefire and aid to civilians in Gaza."}, {"id": "3ed908f5-8ea6-48f9-a739-0dacef87a6a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26532/", "date": "2024-04-30 19:10", "message": "The American Washington Post:\n1200 students have been arrested so far as part of protests at universities across the US.", "location": "universities across the US", "classification": "security", "score": 0.4446909162405631, "event_breakdown": "- 1200 students arrested in protests at universities across the US"}, {"id": "2d3e2114-0285-4cf3-a40b-ccf314a7ed3f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26531/", "date": "2024-04-30 17:14", "message": "About Al Jazeera:\nThe Qatari network will soon broadcast a special program in which it will glorify and praise Yahya Sinwar, the leader of Hamas in the Gaza Strip - \"the man who managed to put the whole world on one foot\".", "location": "Gaza Strip", "classification": "security", "score": 0.8212158042349625, "event_breakdown": "- Al Jazeera plans to broadcast a special program glorifying and praising Yahya Sinwar, the leader of Hamas in the Gaza Strip"}, {"id": "1e18aaef-d43f-49e1-a505-02d8d33789cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26530/", "date": "2024-04-30 16:32", "message": "A young Jewish man does not allow Al Jazeera's reporter, Najwan Simri, to broadcast a report (which is not sympathetic to Israel, to put it mildly) regarding the stabbing attack by the Turkish citizen today in the Old City of Jerusalem.\nHe repeats to the camera: don't listen to their nonsense.\nShe later turns to the Israeli police stationed in the area, complaining about the young man and falsely claiming he is touching her.\nIt is worth noting they are members of the same force (Israeli Border Police) that was attacked.", "location": "Old City of Jerusalem", "classification": "security", "score": 0.9339038273219109, "event_breakdown": "- Al Jazeera's reporter, Najwan Simri, attempts to broadcast a report on a stabbing attack by a Turkish citizen in the Old City of Jerusalem\n- A young Jewish man intervenes and prevents the broadcast, urging viewers not to listen to the report\n- Najwan Simri complains to Israeli police about the young man, falsely claiming he touched her\n- Both the young man and Najwan Simri are members of the Israeli Border Police force"}, {"id": "097fce57-fee6-4d24-be50-3d9c2c7584da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26529/", "date": "2024-04-30 16:00", "message": "Members of the Palestinian Authority's security forces confront Palestinian protesters near the Canadian Embassy in Ramallah. The protesters are protesting Canada's support for Israel regarding the fighting in Gaza.", "location": "Canadian Embassy, Ramallah", "classification": "security", "score": 0.9876206410667714, "event_breakdown": "- Palestinian Authority's security forces confront Palestinian protesters near Canadian Embassy in Ramallah.\n- Protesters demonstrate against Canada's support for Israel amid Gaza conflict."}, {"id": "69b0a0d7-4805-47d0-945d-3acf4d69c8d1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26527/", "date": "2024-04-30 15:38", "message": "The military arm of the Islamic Jihad in Jenin is trying to thwart the entry of the undercover forces into the refugee camp and placed signs with instructions for the driving public:\n\n1. The car windows must be opened.\n2. At night, the interior light in the car must be turned on.\n3. Owners of commercial vehicles - your vehicle will be checked before entering the area.", "location": "JENIN", "classification": "security", "score": 0.9594313959113322, "event_breakdown": "- Islamic Jihad's military arm in Jenin places signs with instructions for the driving public\n  - Instructions include opening car windows and turning on interior light at night\n  - Commercial vehicle owners warned of vehicle checks before entering the area"}, {"id": "079a2e35-53c6-48b7-9eb7-241d92f0a278", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26526/", "date": "2024-04-30 14:58", "message": "A clear majority of Israelis and Americans support an operation in Rafah. The keys to this move lie in the hands of Netanyahu and Biden.\n\n##\nThe attached photo from the 1930s shows the train station in Rafah.\n\nNext stop: Rafah?", "location": "Rafah", "classification": "world", "score": 0.37831268763995485, "event_breakdown": "1. A clear majority of Israelis and Americans support an operation in Rafah.\n2. The keys to this move lie in the hands of Netanyahu and Biden.\n3. Photo from the 1930s shows the train station in Rafah."}, {"id": "498ce592-c8a5-4210-a4a2-af5e24b974fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26524/", "date": "2024-04-30 14:52", "message": "Two public promises today made by the Prime Minister and Minister Ben Gvir regarding entry to Rafah.\nArab and Palestinian media quote them extensively.", "location": "Rafah", "classification": "security", "score": 0.4280292525387717, "event_breakdown": "- Prime Minister and Minister Ben Gvir make public promises regarding entry to Rafah.\n- Arab and Palestinian media extensively quote their statements."}, {"id": "f5c5bb39-4df2-4550-8c42-70e3ecd58413", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26523/", "date": "2024-04-30 14:51", "message": "The White House: Soon, trucks with flour will enter Gaza through a new crossing.", "location": "Gaza", "classification": "security", "score": 0.43932515330510435, "event_breakdown": "- The White House announces trucks with flour will enter Gaza through a new crossing."}, {"id": "07292382-12a9-465c-9f89-32b54406f681", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26522/", "date": "2024-04-30 14:50", "message": "Esra Erdoğan, the daughter of the President of Turkey, praises and praises in Arabic the Turkish terrorist who carried out the stabbing attack today in East Jerusalem.\nShe calls him by the nickname \"Lion of Lions of Turkey\" and calls to pray for the sake of the \"heroic martyr\".\n\nAfter the terrorist's name was revealed, she tweeted another tweet in his honor.", "location": "East Jerusalem", "classification": "security", "score": 0.5620430139992374, "event_breakdown": "- Esra Erdoğan praises Turkish terrorist in Arabic in East Jerusalem\n- She refers to the terrorist as the \"Lion of Lions of Turkey\"\n- Calls for prayers for the \"heroic martyr\"\n- Tweets another message in honor of the terrorist after his name is revealed"}, {"id": "6ce55171-52f3-4dfd-8b0b-571c498af14f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26521/", "date": "2024-04-30 13:25", "message": "The military wing of the Islamic Jihad: We fired rockets at the Israeli command and control centers in the Netzarim area.", "location": "Netzarim", "classification": "security", "score": 0.9949691837335627, "event_breakdown": "- Islamic Jihad's military wing claims responsibility for firing rockets at Israeli command and control centers in the Netzarim area."}, {"id": "c10b7423-237e-47a2-ad27-ce916006292a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26520/", "date": "2024-04-30 13:24", "message": "The Israel Police publishes CCTV footage of today's stabbing attack near the Flowers Gate in the Old City of Jerusalem.\n\nThe Turkish terrorist stalked the two police officers from behind, and then pulled out a knife and started stabbing one of two.\n\nThankfully the officers managed to fight him off, sustaining only minor injuries.\n\nAs previously mentioned, the terrorist was shot and killed.", "location": "Flowers Gate in the Old City of Jerusalem", "classification": "security", "score": 0.9972743688563904, "event_breakdown": "- Israel Police release CCTV footage of stabbing attack near Flowers Gate in Old City of Jerusalem.\n- Turkish terrorist stabs police officers from behind, prompting officers to fight back.\n- Officers sustain minor injuries while subduing the attacker.\n- Attacker shot and killed by authorities."}, {"id": "212e59ce-1bf8-4277-8bf0-ed08120fd99b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26517/", "date": "2024-04-30 13:11", "message": "Lebanese sources report on casualties in several Israeli attacks in Yaroun and Odaisseh in southern Lebanon.", "location": "Yaroun and Odaisseh, southern Lebanon", "classification": "security", "score": 0.9926602654668037, "event_breakdown": "- Israeli attacks reported in Yaroun and Odaisseh, southern Lebanon, resulting in casualties."}, {"id": "cb0f9d5b-0acb-4a32-a302-73dc38800920", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26516/", "date": "2024-04-30 11:12", "message": "The American University in Beirut, Lebanon: Here, too, the statue of George Washington undergoes a process of \"Palestinianization\"\n\nOne of the students in the crowd is seen holding a picture of Muhammad Deif, the head of the military wing of Hamas.", "location": "American University in Beirut", "classification": "security", "score": 0.6905892484369863, "event_breakdown": "- The statue of George Washington at the American University in Beirut, Lebanon undergoes a process of \"Palestinianization\"\n- A student in the crowd is seen holding a picture of Muhammad Deif, the head of the military wing of Hamas."}, {"id": "b82b4848-dc4c-4bde-a0d2-c505bb6a7cf8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26515/", "date": "2024-04-30 10:49", "message": "Ramallah, West Bank: A Palestinian joyfully presents the loot from the attack on the German ambassador's vehicle - its license plate.", "location": "Ramallah, West Bank", "classification": "security", "score": 0.9812876088138319, "event_breakdown": "- Palestinian attack on the German ambassador's vehicle in Ramallah, West Bank\n- Palestinian presenting the license plate loot from the attack in Ramallah, West Bank"}, {"id": "ca2e6f64-ca1d-4262-8888-e52c8319c7fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26514/", "date": "2024-04-30 10:31", "message": "The Flower Gate area in the Old City of Jerusalem:\n\nAn Israeli police officer sustained light injuries in a stabbing attack. \n\nThe terrorist, a tourist from Turkey was \"neutralized\", apparently permanently.", "location": "JERUSALEM", "classification": "security", "score": 0.9953919204555158, "event_breakdown": "null"}, {"id": "3172cdd8-f657-44dc-a883-141229cf5dbd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26513/", "date": "2024-04-30 10:30", "message": "Ramallah, West Bank: The German ambassador to the PA was almost lynched by a Palestinian mob during a visit to a museum near Birzeit University.\n\nThe Palestinian mob surrounded the ambassador's car, vandalized it, and threw rocks at it.\n\nThis attack comes in light of Germany's support for Israel during the war.", "location": "Ramallah, West Bank", "classification": "security", "score": 0.9413258241893517, "event_breakdown": "- Ramallah, West Bank: German ambassador to the PA almost lynched by Palestinian mob near Birzeit University\n- Palestinian mob surrounds ambassador's car, vandalizes it, and throws rocks\n- Attack occurs in response to Germany's support for Israel during the war"}, {"id": "3e679a70-90dc-4b48-84d7-4bbe469836bb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26512/", "date": "2024-04-30 10:25", "message": "A survey by the Harvard Harris Institute published yesterday yielded similar results - there is a clear majority for a military operation in Rafah among the American public - 72% support an operation in Rafah.", "location": "Rafah", "classification": "security", "score": 0.6975851679334045, "event_breakdown": "- Survey by Harvard Harris Institute shows 72% of American public support a military operation in Rafah.\n"}, {"id": "1843ee13-c783-4ae2-a8a4-a301ef1c3cec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26510/", "date": "2024-04-30 08:33", "message": "Students at Columbia University are switching to chants in Arabic.\n\n#Columbia_has_fallen", "location": "New York City", "classification": "security", "score": 0.4835643031151498, "event_breakdown": "- Students at Columbia University switch to chants in Arabic.\n- Hashtag \"Columbia_has_fallen\" emerges."}, {"id": "bb2f6d68-75b7-403e-a84f-dfe32b9024be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26508/", "date": "2024-04-30 08:32", "message": "The statue of George Washington at George Washington University has been Palestinianized and defaced.", "location": "George Washington University", "classification": "security", "score": 0.3831179570317771, "event_breakdown": "- Defacement of the George Washington statue at George Washington University"}, {"id": "0d8d28cf-6b62-45f2-a02a-cb68b2628093", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26507/", "date": "2024-04-30 08:31", "message": "Stanford University, California: A student, wearing a headband of the military wing of Hamas, prepares for class...", "location": "Stanford University, California", "classification": "security", "score": 0.7733456335938974, "event_breakdown": "- Stanford University, California: A student wearing a headband of the military wing of Hamas prepares for class."}, {"id": "932e4931-29d0-447e-a39b-7163589daa27", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26506/", "date": "2024-04-30 08:30", "message": "Protest against Israel on US campuses:\n\n\"Morning Prayer\" at Harvard University.\n\n#sound_on", "location": "Harvard University", "classification": "security", "score": 0.7488853793510446, "event_breakdown": "- Protest against Israel on US campuses.\n- \"Morning Prayer\" event at Harvard University."}, {"id": "1717c78c-2c2e-435b-a47d-80aa1d9075f4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26505/", "date": "2024-04-30 08:27", "message": "An investigation by the Times sheds light on Ebrahim Al-Arjani's \"Ya Hala\" company, and on the profit it made on the backs of Gazans attempting to flee the violence in the Strip.\n\nAccording to the report, Al-Arjani company generated $88 million by \"coordinating\" the departure of 20,000 Gazans from the Gaza Strip during the month March alone (This \"service\" has been available for at least 5-6 months.)\n\nAccording to estimates, around 85,000 individuals have left Gaza since the onset of the conflict, paying approximately $5,000 per person.\n\nEbrahim Al-Arjani holds significant influence in North Sinai. He is a member of the Tarabin tribe and owns the Ibna Sina'a company, which imports and exports goods from Gaza. Al-Arjani holds close ties with Egyptian President Al-Sisi, he played a pivotal role in organizing the Bedouins of North Sinai into a paramilitary force, aiding the Egyptian army against groups like ISIS, and is known to be a business partner of the Egyptian President's son.", "location": "North Sinai", "classification": "security", "score": 0.4058430507307752, "event_breakdown": "- Investigation by the Times sheds light on Ebrahim Al-Arjani's \"Ya Hala\" company profiting from Gazans fleeing violence in the Gaza Strip.\n- Al-Arjani company generated $88 million by coordinating the departure of 20,000 Gazans in March alone, with this service available for at least 5-6 months.\n- Around 85,000 individuals have left Gaza since the conflict began, paying around $5,000 per person.\n- Ebrahim Al-Arjani holds influence in North Sinai, being a member of the Tarabin tribe and owning Ibna Sina'a company that trades goods from Gaza.\n- Al-Arjani has close ties with Egyptian President Al-Sisi, played a role in organizing Bedouins of North Sinai into a paramilitary force, aiding the Egyptian army against groups like ISIS, and is a business partner of the President's son."}, {"id": "433a0073-c3de-4629-afd7-8d48b9fc9b11", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26504/", "date": "2024-04-30 08:19", "message": "The Lebanese government's crisis management team publishes data on the war with Israel.\n\nSince October 7, 4010 air and ground attacks have been carried out on targets in Lebanon.\n\nThe 5 villages that were attacked the most are:\nAyta ash Shab - 339 times\nHula - 311 times\nNaqoura - 256 times\nAalma ech Chaab - 241 times\nTayr Harfa - 215 times.\n\nThe team also reported that since October 7th, 438 people have been killed in Lebanese territory, of which 337 are militants (Hezbollah and other organizations), 100 civilians and one Lebanese soldier.", "location": "Ayta ash Shab", "classification": "security", "score": 0.7515038538670128, "event_breakdown": "- The Lebanese government's crisis management team publishes data on the war with Israel.\n- Since October 7, 4010 air and ground attacks have been carried out on targets in Lebanon.\n- The 5 villages that were attacked the most are: Ayta ash Shab - 339 times, Hula - 311 times, Naqoura - 256 times, Aalma ech Chaab - 241 times, Tayr Harfa - 215 times.\n- The team also reported that since October 7th, 438 people have been killed in Lebanese territory, of which 337 are militants (Hezbollah and other organizations), 100 civilians, and one Lebanese soldier."}, {"id": "9f0fd380-b455-4693-91dc-4509d68b57e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26500/", "date": "2024-04-30 08:17", "message": "Last night, the American Central Command published pictures of the progress of the construction of the floating pier off the coast of Gaza.\n\nAt the same time, there are reports that the British are considering sending soldiers on their behalf to secure the pier.", "location": "Off the coast of Gaza", "classification": "security", "score": 0.8247471719227055, "event_breakdown": "1. The American Central Command published pictures of the construction of a floating pier off the coast of Gaza.\n2. Reports indicate that the British are contemplating sending soldiers to secure the pier."}, {"id": "196c41e9-7534-4dec-a4bc-47c26fd57026", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26499/", "date": "2024-04-30 08:15", "message": "More about the anti-Semitic demonstrations on US campuses:\n\nMIT University issued an ultimatum to students to end the protest within 24 hours.\n\nColumbia University began suspending students who did not end the protest.", "location": "Cambridge", "classification": "antisemitism", "score": 0.37022353244060985, "event_breakdown": "- MIT University issues ultimatum to end protest within 24 hours\n- Columbia University starts suspending students for not ending protest"}, {"id": "7013d491-4a1e-449f-8bc8-a559585c28bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26487/", "date": "2024-04-29 20:35", "message": "The financial markets are smiling at the new president of Argentina:\nThe Argentine peso is the currency that jumped at the highest rate in the world against the dollar in the last 3 months (since Javier Milei was elected president of Argentina).\nThe Argentine currency strengthened by 25% during this period.", "location": "Buenos Aires, Argentina", "classification": "world", "score": 0.43392220763195205, "event_breakdown": "- The Argentine peso jumps at the highest rate in the world against the dollar in the last 3 months, strengthening by 25% since Javier Milei was elected president of Argentina"}, {"id": "8ca2815a-4e56-4857-96c8-62b3f7052b3f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26486/", "date": "2024-04-29 20:34", "message": "Hamas: The movement's delegation arrived in Cairo today to consult and clarify a number of issues in the latest proposal. Inquiries and clarifications were made with the mediators - the Qataris and the Egyptians. The Hamas delegation will leave Cairo (for Doha, the capital of Qatar) for further consultations (within the movement).", "location": "Cairo", "classification": "security", "score": 0.6150094041786179, "event_breakdown": "- Hamas delegation arrived in Cairo for consultations on the latest proposal\n- Inquiries and clarifications made with Qataris and Egyptians mediators\n- Hamas delegation will leave Cairo for Doha for further consultations"}, {"id": "813bc859-3fea-45a3-9ee8-185d65d37509", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26484/", "date": "2024-04-29 19:37", "message": "Must watch:\nThis is how a Palestinian described his visit to the Auschwitz-Birkenau extermination camp in a video shared on Gaza channels:\n\"God wiling you will return to the camp...you belong here.\"\nHis take is not out of the ordinary among Palestinians.", "location": "Auschwitz-Birkenau extermination camp", "classification": "antisemitism", "score": 0.23996110688309147, "event_breakdown": "- Palestinian shares experience of visiting Auschwitz-Birkenau extermination camp in video circulated on Gaza channels.\n- Expresses sentiment of returning to the camp, stating \"you belong here,\" reflecting views not uncommon among Palestinians."}, {"id": "3c1be516-32a3-4a7e-bc15-12a079079e86", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26483/", "date": "2024-04-29 19:25", "message": "A Gazan sprayed graffiti on the wall of his house:\nDon't bother... they've already stolen everything.", "location": "The main location where the main event takes place is Gaza.", "classification": "entertainment", "score": 0.26770524855604194, "event_breakdown": "1. A Gazan sprayed graffiti on the wall of his house with a message: \"Don't bother... they've already stolen everything.\""}, {"id": "d81a6a9d-a4a0-4284-901f-368a39d428f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26481/", "date": "2024-04-29 18:52", "message": "PA Chairman Abu Mazen met tonight in Saudi Arabia with Saudi Crown Prince Muhammad bin Salman.", "location": "SAUDI ARABIA", "classification": "security", "score": 0.8201277390222063, "event_breakdown": "- PA Chairman Abu Mazen meets Saudi Crown Prince Muhammad bin Salman in Saudi Arabia."}, {"id": "cfe19baa-efc0-4190-9075-d82acb049a6e", "channel_id": 1560386984, "url": "", "date": "2024-04-29 18:52", "message": "Ismail Haniyeh, chairman of the political bureau of Hamas, continues to receive an audience in Istanbul, this time Algerian members of parliament as well as members of Turkish parties.\nThe official excuse: they come to console him for the death of his sons and grandsons in an IDF attack a few weeks ago.", "location": "Istanbul", "classification": "security", "score": 0.9058050621174512, "event_breakdown": "1. Ismail Haniyeh receives audience in Istanbul from Algerian members of parliament and Turkish party members.\n2. The visit is to console him for the death of his sons and grandsons in an IDF attack."}, {"id": "c5e30f31-520a-4900-8057-b3311151953c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26477/", "date": "2024-04-29 18:47", "message": "The IDF spokesperson announced the death of two reservists in battle in the center of the Gaza Strip.\n\nMay their memories be a blessing.", "location": "Gaza Strip", "classification": "security", "score": 0.944319386655642, "event_breakdown": "1. Two IDF reservists killed in battle in the center of the Gaza Strip."}, {"id": "b529c7dd-dbb1-47ae-be9d-4269c18eca54", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26476/", "date": "2024-04-29 17:29", "message": "New York: A large number of American police officers are gathering near the entrance gate of Columbia University ahead of the planned start of a march against Israel and shortly before the expiration of the ultimatum to remove the protest from the campus.", "location": "Columbia University", "classification": "security", "score": 0.5594224391550054, "event_breakdown": "- American police officers gather near the entrance gate of Columbia University in New York\n- Gathering is ahead of a planned march against Israel\n- Gathering occurs shortly before the expiration of an ultimatum to remove the protest from the campus"}, {"id": "73a98967-535a-4b3e-ae7f-246b7995b4e2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26473/", "date": "2024-04-29 16:54", "message": "Texas Governor Greg Abbott is calling on Congress not to transfer more of the American taxpayer's money to Harvard University following the removal of the American flag on the university grounds and replacing it with the Palestinian flag. Similar posts receive wide resonance and support among American Twitter accounts.", "location": "Harvard University", "classification": "security", "score": 0.40498556178769163, "event_breakdown": "- Texas Governor Greg Abbott urges Congress not to allocate more taxpayer money to Harvard University.\n- Harvard University removes American flag and replaces it with Palestinian flag, sparking outrage.\n- Posts denouncing Harvard's flag replacement gain significant support on American Twitter accounts."}, {"id": "9dda0526-f283-44b4-a9ed-43bdb691c7aa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26472/", "date": "2024-04-29 16:06", "message": "Paris: French police evacuate the anti-Israel encampment set up by students at Sorbonne University.", "location": "Sorbonne University, Paris", "classification": "security", "score": 0.8753638409910214, "event_breakdown": "1. French police evacuate the anti-Israel encampment set up by students at Sorbonne University in Paris."}]