[{"id": "2eacdad3-0ae1-44de-9aed-3aa723500301", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28103/", "date": "2024-05-30 06:04", "message": "The Lebanese al-Mayadeen from a source in the \"resistance\" following yesterday's Israeli attack in Syria:\n\nThe reports according to which three Hezbollah members were killed in yesterday's Israeli attack on a truck in the Al Furqlus area of ​​Homs (Syria) are not true.\nThe truck driver jumped out of it, and was saved.\nThere were no Hezbollah members inside the truck.", "location": "Homs", "classification": "security", "score": 0.9942679664904099, "event_breakdown": "Israeli attack in Syria, reported on Al-Mayadeen.Lebanese al-Mayadeen from a source in the \"resistance\" denies reports according to which three Hezbollah members were killed in yesterday's Israeli attack in Syria."}, {"id": "dd034590-a700-4847-9161-cc7565073dae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28103/", "date": "2024-05-30 06:04", "message": "Paris: French MPs Louis Boyard and Sebastien Delogu celebrate at an anti-Israel demonstration after being expelled from the parliament for waving the Palestinian flag.", "location": ")\nPARIS", "classification": "security", "score": 0.9446848596987233, "event_breakdown": "French MPs Louis Boyard and Sebastien Delogu celebrate at an anti-Israel demonstration after being expelled from the parliament for waving the Palestinian flag."}, {"id": "66fb1272-b8f6-4174-a3b8-b725ed8959d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb67776/", "date": "2024-05-30 05:56", "message": "The IDF spokesperson announced this morning the fall of three fighters:\nTwo in the ramming attack last night near Nablus and one in battle in the north of the Gaza Strip.\n\nMay their memories be a blessing.", "location": "Nablus", "classification": "security", "score": 0.9603219175148298, "event_breakdown": "Three IDF fightersfell today in the ramming attack near Nablus and in fighting in the north of the Gaza Strip, the IDF announced. The IDF is reporting the death of two fighters in a ramming attack near Nablus and one in fighting in the north of the Gaza Strip. May their memories be blessed."}, {"id": "a12263b4-80cb-40dd-b7ab-1c1a5ed6a690", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28095/", "date": "2024-05-30 05:52", "message": "Syria: Syrian opposition sources claim that the destruction of the residential building yesterday in Baniyas, and the killing of the Syrian girl, were caused by a Syrian interceptor missile that was launched at the Israeli warplanes that attacked in Syria yesterday evening.", "location": "NULL", "classification": "security", "score": 0.9873574619280683, "event_breakdown": "Syria: Syrian opposition sources claim that the destruction of the residential building in Baniyas, and the killing of the Syrian girl, were caused by a Syrian interceptor missile that was launched at the Israeli warplanes that attacked in Syria yesterday evening. The incident occurred in Baniyas."}, {"id": "ffe23fe6-5e07-4fa4-a161-3f7bb31b0eb4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28094/", "date": "2024-05-30 05:51", "message": "American Senator: Saudi Arabia is not opposed to the destruction of Hamas\n\nRepublican Senator Lindsey Graham, visiting Israel, talks about the normalization agreement between Israel and Saudi Arabia and says out loud what Saudi Arabia cannot:\n\nTo reach an agreement, Saudi Arabia wants a reduction in the scope of the fighting. The Saudi Crown Prince does not expect Israel to agree to not destroying the Hamas battalions. No one in Saudi Arabia wants Hamas to remain a military presence (in order to reach an agreement - AA).\nWhy would Saudi Arabia invest money in the \"new Palestine\" if Hamas stays?\nIt is in everyone's interest to destroy these terrorist networks.\n\n##\nIt should be remembered that Saudi Arabia is the leader of the Sunni axis and its position regarding Hamas is the position of many other Sunni countries - they cannot say publicly that they support the destruction of Hamas, but they would be happy for it to happen and as soon as possible.", "location": "Tel Aviv, Israel", "classification": "security", "score": 0.7607178117355818, "event_breakdown": "Event: Republican Senator Lindsey Graham, visiting Israel, talks about the normalization agreement between Israel and Saudi Arabia and says out loud what Saudi Arabia cannot:\n\"To reach an agreement, Saudi Arabia wants a reduction in the scope of the fighting. The Saudi Crown Prince does not expect Israel to agree to not destroying the Hamas battalions. No one in Saudi Arabia wants Hamas to remain a military presence (in order to reach an agreement - AA).\"\nLocation: Israel"}, {"id": "199ad0de-b668-4ca7-84cf-f6e85f8c67a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28093/", "date": "2024-05-30 04:44", "message": "Fatah's al-Aqsa Martyrs Brigades in Tulkarm claim in a proclamation: Our operatives infiltrated a house in the settlement of Bat Hefer with the aim of eliminating an officer. The officer was not at home and only his children were present. In accordance with Islamic morality and contrary to the nature of the occupation's activities, the operatives spared the children and only took an M4 type weapon and a Glock pistol from the scene.", "location": "The main event takes place at a settler's house in the settlement of Bat Hefer.", "classification": "security", "score": 0.9886789185938496, "event_breakdown": "Target event found:\nIn Tulkarm, the al-Aqsa Martyrs Brigades, a militant group associated with Fatah, claimed operatives infiltrated a house in the settlement of Bat Hefer. The group claims they targeted an officer, but the officer was not at home, only his children were present."}, {"id": "72cfe8a1-d90e-4ecc-8319-8820b7aae895", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28090/", "date": "2024-05-30 04:42", "message": "Syria - Lebanon\n\nResidents of the Baaqa area in Lebanon (near the border with Syria) claim to have found fragments of an Israeli Spice 1000 missile in Lebanese territory, which they estimate was shot down by the Syrian air defense systems during the attack this evening.", "location": ")\n\nSyria", "classification": "security", "score": 0.9948361383684446, "event_breakdown": "Syrian air defense systems shot down an Israeli Spice 1000 missile in the Baaqa area in Lebanon."}]