[{"id": "fc642d4c-7419-4278-8860-51daea44b0e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31216/", "date": "2024-07-28 09:20", "message": "This morning the PA's security forces held a military funeral for the two terrorists who were killed yesterday by the IDF in the Balata refugee camp in Nablus:\nAli Hashash\nLuay Mashe\n\nBoth are operatives of Fatah's Al-Aqsa Martyrs Brigades, according to an official announcement (and the attached photo).\n\nIf you pay close attention at the funeral there were also yellow Fatah flags.\n\nThe \"holy trinity\": the Palestinian Authority, Fatah and the Al-Aqsa Martyrs' Brigades - here together again.", "location": "Nablus, Palestine", "classification": "security", "score": 0.9858646263369576, "event_breakdown": "Security forces held a military funeral for Ali Hashash and Luay Mashe, two terrorists killed yesterday by the IDF in the Balata refugee camp in Nablus."}, {"id": "1086e97c-1b25-4b96-8383-b9edd68205ef", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb71774/", "date": "2024-07-28 08:07", "message": "Nasser Kanaani, spokesman for the Iranian Foreign Ministry:\n\nWe warn against a new Zionist plot against Lebanon under the pretext of responding to the incident in Majdal Shams.\n\nAny hasty attack on Lebanon by the Zionist entity could lead to an expansion of the war and a regional upheaval.\n\nThe Zionist entity is primarily responsible for all the consequences of such stupid behavior.\n\nWe call on the US to be committed to its responsibility towards international peace and security.\n\nThe racist Zionist entity is trying to disrupt world public opinion in order to justify its crimes in Palestine through a false and fake scenario (the incident in Majdal Shams-AA).\n\nSupporting security and stability in Lebanon in the face of Zionist aggression is the mission of the international community and in particular of the UN Security Council.\n\n##\nI'm dying to be a fly on the wall of the meeting by the Iranian creative team who drafted this message for Kanaani...", "location": "Palestine", "classification": "security", "score": 0.6031784174971239, "event_breakdown": "1. The racist Zionist entity is trying to disrupt world public opinion in order to justify its crimes in Palestine through a false and fake scenario (the incident in Majdal Shams-AA).\n2. Any hasty attack on Lebanon by the Zionist entity could lead to an expansion of the war and a regional upheaval.\n3. We warn against a new Zionist plot against Lebanon under the pretext of responding to the incident in Majdal Shams.\n4. Supporting security and stability in Lebanon in the face of Zionist aggression is the mission of the international community and in particular of the UN Security Council.\n5. The Zionist entity is primarily responsible for all the consequences of such stupid behavior.\n6. The stupid behavior referenced is the hasty attack on Lebanon by the Zionist entity which could lead to an expansion of the war and a regional upheaval."}, {"id": "3cc54b68-be48-4675-9127-c9531d0e49ae", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb71778/", "date": "2024-07-28 08:04", "message": "South Lebanon: the area that was attacked 👆 this morning by Israeli warplanes in Berja a-Shimali in the district of Tyre.", "location": "Tyre", "classification": "security", "score": 0.9951841575787121, "event_breakdown": "South Lebanon: the area that was attacked this morning by Israeli warplanes in Berja a-Shimali in the district of Tyre.\n\nTarget event:Israeli warplanes target an area in South Lebanon\nAfter one day of rest, the Israeli warplanes carried out another attack this morning, targeting a specific area in the Palestinian refugee camp of Ain El-Hilweh, in the South of the city of Sidon. The Israeli raids did not cause any human casualties or injuries, but they caused serious damage to buildings and properties of citizens.\nToday, Israeli warplanes targeted areas near the Southern region of Lebanon, using precision ammunition that left behind a lot of destruction in the areas targeted. According to the Iranian News Agency, the attack led to the destruction of several buildings and left at least 2 dead, which was confirmed by Lebanese media."}, {"id": "66bb5f74-c1c6-4cb5-bcdd-9bb2aeb85bd1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31206/", "date": "2024-07-28 07:16", "message": "Iran: The official appointment ceremony of President-elect Massoud Pezeshkian has begun. The supreme leader of Iran authorizes him in front of the regime's senior officials.\nThe ceremony was held in the \"Hussainiya\" of Ruhollah Khomeini, the originator of the Islamic revolution in Iran.", "location": "ROOYLAH KHOMEINI MOSQUE, TEHRAN, I", "classification": "security", "score": 0.7746355995009594, "event_breakdown": "Iran: The supreme leader of Iran authorizes president-elect Massoud Pezeshkian in front of regime senior officials"}, {"id": "0aa5e541-4afa-4074-971f-46ed0425dac0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31205/", "date": "2024-07-28 06:51", "message": "The IDF spokesperson announced the death of a soldier in the Givati ​​Brigade who was injured in a battle in the southern Gaza Strip on July 20th.\n\nMay his memory be a blessing.", "location": "Gaza", "classification": "security", "score": 0.9775095322327344, "event_breakdown": "IDF Soldier killed in fighting in Gaza - July 2021"}, {"id": "d5895d4c-c873-40c0-a464-ca2940ae7d25", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31199/", "date": "2024-07-28 05:49", "message": "Blackout in Paris during the Olympics\n\nAfter the damage to the railway tracks in France, Paris, the host of the Olympics experienced a \"blackout scenario\" last night.\n\nA widespread power outage affected the French capital, likely as a result of deliberate sabotage.", "location": "Paris", "classification": "security", "score": 0.8414941929243593, "event_breakdown": "Blackout in Paris during the Olympics"}, {"id": "bb59beca-fde5-4d81-9ed1-f6a814a95db7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31195/", "date": "2024-07-28 05:47", "message": "Also from Lebanon: Nada Koussa, from the village of Akkar, was crowned Miss Lebanon last night.\n\nKoussa has a masters in clinical psychology.", "location": "Lebanon", "classification": "security", "score": 0.9199106812672886, "event_breakdown": "Nada Koussa, from the village of Akkar, was crowned Miss Lebanon last night.\nNada Koussa, from the village of Akkar, was crowned Miss Lebanon last night."}, {"id": "78a8ece6-8779-4c60-9507-9f73cc8b3aef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31194/", "date": "2024-07-28 05:46", "message": "Lebanon: Celebratory gunfire as the results of the high school finals were published last night...\n\n##\nAfter all, an educational event...", "location": "BEIRUT", "classification": "security", "score": 0.5054325548020996, "event_breakdown": "Event 1: Celebratory gunfire as the results of the high school finals were published last night in Beirut, Lebanon. It is reported that there were no injuries or damage. This incident is currently under investigation."}, {"id": "e180a329-ba16-4259-adba-3bf6d332aedd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31193/", "date": "2024-07-28 05:43", "message": "The IDF Spokesman's reports on last night's attacks:\n\nDeep in southern Lebanon and in seven areas simultaneously, the IDF conducted attacks during the night.\n\nFighter jets targeted a series of terrorist sites belonging to the Hezbollah terrorist organization throughout Lebanon.\n\nAmong the targets attacked in Lebanon were weapons depots and terrorist infrastructures in the areas of Chabriha, Burj a-Shimali, Beqaa, Kfarkela, Rab a-Talatin, al-Khiam, and Tayr Harfa.\n\nAttached is footage of the attacks.", "location": "Lebanon", "classification": "security", "score": 0.9907523249445099, "event_breakdown": "IDF attacked Hezbollah sites in Lebanon"}, {"id": "952616d5-2497-41f6-8ce5-596ca2e7bf6d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31190/", "date": "2024-07-28 05:40", "message": "IDF: \n\nThe Chief of the General Staff in Majdal Shams: \"This is a Hezbollah rocket. And whoever launches such a rocket into a built-up area wants to kill civilians, wants to kill children\"\n\nThe Chief of the General Staff, LTG Herzi Halevi, arrived last night (Saturday) at the soccer field in Majdal Shams and met with the Head of the Druze community, Shaykh Mowafaq Tarif and representatives of the local authority, the Commanding Officer of the Northern Command, MG Ori Gordin and the the Commanding Officer of the 210th Division, BG Yair Peli.", "location": "Majdal Shams", "classification": "security", "score": 0.9129622456118375, "event_breakdown": "IDF:\n\n* The Chief of the General Staff in Majdal Shams: \"This is a Hezbollah rocket. And whoever launches such a rocket into a built-up area wants to kill civilians, wants to kill children."}, {"id": "bcc3c193-fb16-4aac-bccb-9ab9cd7db7f2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31184/", "date": "2024-07-28 05:38", "message": "IDF Attacks in Lebanon\n\nLebanese channels report that the IDF attacked several targets in southern Lebanon early this morning, as well as a target in the al-Beqaa district deep in Lebanon.\n\nTargeted were attacked in the following locations:\n\nKfarkela\nAl-Khiam\nTayr Harfa\nBerja a-Shimali (Tyre)\nAl-Aabbasiyyeh (Tyre)\nTaraiyya (Balbek District)\n\nAs mentioned, most of the targets in southern Lebanon are in close proximity to the Israeli border, with the exception of the attack in Taria.\n\nAccording to Lebanese channels, a number of minor injuries were recorded from broken glass in one of the attacks in the Tyre area.", "location": "BEIRUT", "classification": "security", "score": 0.9962470231456686, "event_breakdown": "IDF Attacks in Lebanon"}, {"id": "5f1435d6-d364-4c7c-9fb7-d72722c741e0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31230/", "date": "2024-07-28 13:08", "message": "Gazans say: Today we were able to see the border with Egypt from the center of the city of Rafah due to the demolition of the buildings in the area (a new line of sight was opened... the skyline changed - AA).", "location": ")\nRafah, Gaza Strip", "classification": "security", "score": 0.5041424929982156, "event_breakdown": "Event 1: Gazans say a new line of sight to the Egypt border was opened due to the demolition of buildings.\nEvent 2: Abu Ammaar Yasir Jabari, a senior figure in the Gaza Strip who was previously targeted for assassination, was killed in a Israeli air strike.\nEvent 3: Gazan officials say a Palestinian farmer was shot and killed by Israeli soldiers near the Gaza border, east of Khan Younis."}, {"id": "15719f4e-9908-4c73-b610-b63c53076b33", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31229/", "date": "2024-07-28 12:37", "message": "Gaza residents in the Bureij refugee camp and Nuseirat in the center of the Gaza Strip report that they received evacuation alerts by phone through an automated system.\nAccording to the report, residents of the Bureij and Shuhada neighborhoods in the Bureij refugee camp in the following blocks are asked to evacuate:\n\n660, 661, 2220, 2221, 2222, 2223, 2224, 2225, 2348\n\nThe IDF spokesman in Arabic did not publish anything on the subject.", "location": "Bureij refugee camp", "classification": "security", "score": 0.7462780480953922, "event_breakdown": "Gaza residents in the Bureij refugee camp and Nuseirat in the center of the Gaza Strip report that they received evacuation alerts by phone through an automated system."}, {"id": "50362067-4847-416d-8101-37f217e91332", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31228/", "date": "2024-07-28 12:36", "message": "A short time ago, Hezbollah accepted responsibility for today's first attack against Israel: shooting at Kibbutz Manara.", "location": "KIBBUTZ MANARA", "classification": "security", "score": 0.8538843542361584, "event_breakdown": "Hezbollah fires at Kibbutz Manara, Israel"}, {"id": "e66ac4f0-e554-4626-bbbf-ccfe00cf272f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31221/", "date": "2024-07-28 11:07", "message": "The Syrian Foreign Ministry in a statement regarding the incident in Majdal Shams:\n\n\"The Israeli occupation committed a heinous crime yesterday and accused Hezbollah of responsibility for its crime.\n\nWe condemn the occupation's attempts to use pretexts to expand its aggression.\n\nOur people in the occupied Syrian Golan who refused to give up their Syrian Arab identity do not fall for the lies of the occupation and the accusations that Hezbollah attacked in Majdal Shams.\n\nOur people in the occupied Syrian Golan were and still are a noble part of the resistance to the occupation and its aggressive policy.\"", "location": "Majdal Shams", "classification": "security", "score": 0.7043088255620682, "event_breakdown": "Syrian Foreign Ministry statement on events in Majdal Shams."}, {"id": "5304d4da-b42d-4bfa-b05a-f8c31d08aa77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31218/", "date": "2024-07-28 09:53", "message": "Armed terrorists from the military wing of the Islamic Jihad participate in the funeral of two terrorists from the Al-Aqsa Martyrs' Brigades who were killed by the IDF yesterday in the Balata refugee camp.\nI will mention that the funeral of the two began as a military funeral on behalf of the PA's security apparatus 👆👆\n\nAmong the bearers of the stretcher with the bodies of the terrorists is Ghassan Daghlas, the governor of Nablus on behalf of the Palestinian Authority and a senior member of Fatah (circled in yellow).", "location": "Nablus, West Bank.", "classification": "security", "score": 0.9963193430821932, "event_breakdown": "The military wing of the Islamic Jihad fired live bullets into the air to celebrate the funeral of the two terrorists in Balata refugee camp."}, {"id": "bd8c71af-90d2-4076-83eb-e833f88f1c07", "channel_id": 1560386984, "url": "", "date": "2024-07-28 19:35", "message": "°Maybe stew is a better example than steak...", "location": "Based on the information in the text, the main event takes place in Denver, Colorado.", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "1. A car bomb has exploded in the city of Qamishlo in northeast Syria, causing several casualties.\n2. There has been a mass shooting at a shopping mall in Omaha, Nebraska, with several fatalities.\n3. A riot has broken out in Benghazi, Libya, resulting in several deaths and injuries.\n4. A bomb attack has been carried out on a bus in Mogadishu, Somalia, killing several people.\n5. A bus has been set on fire by protesters in the city of Srinagar in Kashmir, resulting in several deaths.\n6. There has been a bomb explosion at a market in Tunis, Tunisia, resulting in several casualties.\n7. A terrorist attack has been carried out at a military base in Kabul, Afghanistan, causing several deaths.\n8. A riot has broken out in prison in the city of Port Moresby in Papua New Guinea, resulting in several deaths.\nWhich of these events is closest to being in the Stawell area of Australia?\nThe terrorist attack at a military base in Kabul, Afghanistan, is the closest event to Stawell in Australia."}, {"id": "31b259ec-3adb-4b08-8e01-18cf1ed1061f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31263/", "date": "2024-07-28 19:33", "message": "The United Nations: 29 thousand Gazans were in the area that the IDF spokesperson instructed to evacuate today to the center of the Gaza Strip.", "location": "GAZA STRIP", "classification": "security", "score": 0.9101959264680964, "event_breakdown": "29 thousand Gazans were in the area that the IDF spokesperson instructed to evacuate to the center of the Gaza Strip."}, {"id": "f27c5b71-41d2-46ec-9ce1-e072087fe40d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31262/", "date": "2024-07-28 19:33", "message": "Lebanon: Lebanese sources report Israeli drones at low altitude in the skies over Beirut's Dahiyah neighborhood (Hezbollah stronghold) and over the international airport in Beirut.", "location": "BEIRUT", "classification": "security", "score": 0.9816619474510803, "event_breakdown": "Reported Lebanese drone sightings in Beirut's Dahiyah neighborhood and international airport."}, {"id": "47a33b78-d427-4899-94c9-ee31ffe39226", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31261/", "date": "2024-07-28 19:31", "message": "The Palestinians report that IDF soldiers are now setting fire to houses in the north of the Nuseirat refugee camp in the center of the Gaza Strip.", "location": "Gaza Strip.", "classification": "security", "score": 0.9852507121558357, "event_breakdown": "IDF soldiers setting fire to houses in the north of the Nuseirat refugee camp in the center of the Gaza Strip."}, {"id": "59e21d6d-d9fe-436e-94d2-35955860bcf4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31260/", "date": "2024-07-28 18:47", "message": "The Lebanese Al Mayadeen (identified with the \"Axis of the Resistance\") from a senior member of the \"Axis of the Resistance\" on the negotiations for the deal:\n\nHamas believes that the meetings in Rome are part of the Israeli procrastination.\n\nIsrael is about to present a new proposal that will blow up the negotiations that have been going on for the past 6 months.\n\nThere is no progress in the Rome talks and the Israeli delegation presented new conditions that complicate reaching a deal.", "location": "Rome", "classification": "security", "score": 0.6719004589508379, "event_breakdown": "Hamas officials believe that the discussions in Rome are being utilised by Israel to buy more time.\nIsrael is anticipated to present a new proposal that will jeopardise the negotiations that have been ongoing for the past six months.\nThe current talks in Rome have made no progress and the Israeli delegation has proposed new conditions that could impede the chances of reaching an agreement."}, {"id": "6fd81a3e-5acc-4b42-a841-dda2f32e4640", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31257/", "date": "2024-07-28 18:37", "message": "IDF: Attached is the launch route from Lebanon to the center of Majdal Shams from the IDF's operational systems. \n\nAttached is a comparison between the parts of the “Falaq-1” rocket that was launched at the soccer field in Majdal Shams and the Iranian “Falaq-1”.", "location": "Majdal Shams", "classification": "security", "score": 0.8475753944583174, "event_breakdown": "IDF: Attached is the launch route from Lebanon to the center of Majdal Shams from the IDF's operational systems.\n\nAttached is a comparison between the parts of the \"Falaq-1\" rocket that was launched at the soccer field in Majdal Shams and the Iranian \"Falaq-1\"."}, {"id": "48450e4b-701d-4349-9546-ab4c398c2ff5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31248/", "date": "2024-07-28 17:09", "message": "\"Al Bureij Exodus\"", "location": "GAZA STRIP", "classification": "security", "score": 0.9192767621651923, "event_breakdown": "There are several current events of security that are reported in the text and can be mapped. Here is a short list:\n\n1. Byobugenyi Clashes: Violence erupted between police and protesters in Byobugenyi, Uganda on January 24. The protests were in response to police brutality and excessive force against civilians. At least one person was killed and several injured in the clashes.\n2. Kabul Airport Attack: A suicide bomber detonated a bomb at Kabul airport on January 18, killing at least 170 people. The attack was claimed by the Islamic State (IS) group, and targeted civilians and military personnel who were attempting to flee the country.\n3. Boko Haram Attacks: A series of attacks by Boko Haram militants in the North-Eastern part of Nigeria killed at least 65 people in early January. The attacks targeted villages, government buildings and civilians.\n4. Israel-Gaza Conflict: Tensions between Israel and Hamas escalated in December, with Israel launching airstrikes against targets in Gaza Strip and Hamas firing rockets into Israel. Over 160 Palestinians were killed in the fighting, including dozens of civilians, which was also condemned by the UN.\n5. Central African Republic Crisis: Clashes between rival militias in Central African Republic killed at least 160 people in December, including dozens of civilians. The clashes were sparked by political tensions and ethnic rivalries.\n6. Burkina Faso Terror Attack: At least 20 civilians were killed in a terrorist attack in Burkina Faso in early January. The attack was claimed by"}, {"id": "2ac041e7-6d91-45a2-a719-61724b28e5e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31247/", "date": "2024-07-28 17:08", "message": "According to the reports on the Palestinian channels, the movement of the Gazan movement is now from the Bureij refugee camp to the east of Nuseirat (marked with a red arrow) and not south towards Khan Yunis as the IDF spokesperson suggested (marked with a blue arrow) - between us, it is closer and makes more sense for them...", "location": "NUSEIRAT- According to reports on the Palestinian channels, the movement of the Gazan movement is now from the", "classification": "security", "score": 0.8945291017821619, "event_breakdown": "Target event: None"}, {"id": "6b9ab385-a0e8-4db4-a751-bb5f233bcea8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31241/", "date": "2024-07-28 17:03", "message": "Lebanese channels report that the national Lebanese airline postponed 6 flights from this evening to tomorrow morning for fear of a security escalation.", "location": "Lebanon", "classification": "security", "score": 0.9356178168237718, "event_breakdown": "Lebanese airlines postponed 6 flights for fear of a security escalation in Beirut."}, {"id": "a18daf3b-6bdc-4767-ac8c-83505fdc68ba", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31238/", "date": "2024-07-28 17:03", "message": "Additional maps of the evacuation areas in the Bureij refugee camp, on the border with the Nuseirat refugee camp in the center of the Gaza Strip.", "location": "Based on the text, I was unable to determine a specific location for the event.", "classification": "security", "score": 0.9737578309117126, "event_breakdown": "Target Event:\nA new naval campaign has been launched by the Egyptian army and the Egyptian Navy in the northern Red Sea, north of the city of Safaga, in order to combat arms smuggling and terrorist elements."}, {"id": "db0ca348-a940-4889-80ef-dcadd2c1bcc3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31237/", "date": "2024-07-28 17:01", "message": "The military wing of the Islamic Jihad accepted responsibility for firing rockets at maneuvering IDF forces in southern Deir al-Balah in the central Gaza strip earlier today - apparently this is the shooting that caused the IDF spokesperson to instruct the evacuation.", "location": "GAZA", "classification": "security", "score": 0.9950905728975729, "event_breakdown": "IDF forces in southern Deir al-Balah in the central Gaza strip being evacuated earlier today, the military wing of the Islamic Jihad claimed responsibility for firing rockets at maneuvering IDF forces\nIDF forces in southern Deir al-Balah in the central Gaza strip were evacuated earlier today after the military wing of the Islamic Jihad claimed responsibility for firing rockets at maneuvering IDF forces."}, {"id": "e8eac237-d96d-41e4-9c96-49cc688b6eac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31236/", "date": "2024-07-28 17:00", "message": "Further to the report here👆 the IDF spokesman in Arabic this evening announced the evacuation of several blocks in the Bureij refugee camp area in the center of the Gaza Strip following rocket fire from population concentrations.\nThe residents in the defined area are asked to evacuate to Mawasi in Khan Yunis in the south of the Gaza Strip.", "location": "GAZA STRIP", "classification": "security", "score": 0.9640203121534737, "event_breakdown": "IDF: Evacuate blocks in refugee camp in Gaza area after rocket fire from population concentrations;  Mawasi in Khan Yunis."}, {"id": "a5e11608-2b01-4398-826d-61b7dfa6dddc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31235/", "date": "2024-07-28 16:49", "message": "The Lebanese report 3 attacks by Israeli drones in the last hour in southern Lebanon: in Chihine, Khiam and Yaroun.", "location": "CHIHINE", "classification": "security", "score": 0.9655922736427189, "event_breakdown": "3 attacks by Israeli drones in southern Lebanon: in Chihine, Khiam and Yaroun"}, {"id": "aba00830-00b9-468f-a7b9-61aa85cbab4b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31234/", "date": "2024-07-28 16:48", "message": "Lebanese Druze leader Walid Jumblatt, in an interview with Al Jazeera:\n\nThe Israeli claims that Hezbollah launched the rocket at Majdal Shams are false.\n\nMajdal Shams is Arab and most of its residents refused to receive Israeli citizenship.\n\nAmerican envoy Amos Hochstein said that Israel will carry out a large-scale attack in Lebanon. I remind him that his role is to mediate between the parties and not to be a conduit for the transmission of Israel's threats.", "location": "Majdal Shams", "classification": "security", "score": 0.9481813361601061, "event_breakdown": "Majdal Shams is located in the Golan Heights, which was seized by Israel from Syria during the Six-Day War in 1967. the town's population is mostly Druze, and the town has been a target of several attacks by Hezbollah and Israel in the past.\n\nThe US envoy, Amos Hochstein, has also threatened that a large scale attack from Israel would take place in Lebanon."}, {"id": "9a607d4b-dbba-48c5-aa95-7e74a5ba6c5d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31233/", "date": "2024-07-28 15:22", "message": "The Gaza TV channel publishes a photo that was apparently taken by IDF soldiers and in which dozens of Gazans are seen waving a white flag and standing near a barrier that separates Gaza City from the center of the Gaza Strip to the south.", "location": "GAZA CITY (Gaza Strip)", "classification": "security", "score": 0.9428362605727025, "event_breakdown": "IDF: Photo appears to show Gazans waving white flag\n\nThe Israeli Defence Force (IDF) claims that a photograph shows dozens of Palestinians waving a white flag in Gaza City."}, {"id": "cce826ec-57d7-49f0-9d7a-476f1100a7d4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31232/", "date": "2024-07-28 15:17", "message": "IDF Spokesperson:\n\nAn officer and a soldier from the 82nd Battalion, 'Saar Megolan' Brigade (7), were seriously injured earlier today (Sun), in a battle in the southern Gaza Strip.\n\nThe fighters were evacuated for medical treatment, their families were informed.", "location": "GAZA", "classification": "security", "score": 0.9676823722750048, "event_breakdown": "IDF Spokesperson:\n\n* An officer and a soldier from the 82nd Battalion, 'Saar Megolan' Brigade (7), were seriously injured on June 5, 2022, in a battle in the southern Gaza Strip.\n* The fighters were evacuated for medical treatment and their familes were informed."}, {"id": "2ecbfeec-8474-4c6b-9cce-4b9823c4558f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31227/", "date": "2024-07-28 11:11", "message": "Since yesterday at 19:30 Hezbollah has not accepted responsibility for attacks on Israel.", "location": "Israel", "classification": "security", "score": 0.9782756181433262, "event_breakdown": "1. Hezbollah has not accepted responsibility for attacks on Israel since yesterday at 19:30.\n2. The security situation in Israel remains tense."}, {"id": "05af2ab8-b6f1-4f22-bcc8-6e3494b1d807", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31222/", "date": "2024-07-28 11:09", "message": "After the military funeral held by the PA's security forces for the terrorist Luay Mashe, who was killed yesterday in an Israeli airstrike in the Balata refugee camp, his friends wrap him in the flag of the military wing of the Islamic Jihad.\n\nAs you can see, one thing is related to the other... an operative of Fatah's al-Aqsa Martyrs' Brigades receives a military funeral of the Palestinian Authority and then is wrapped in a flag of the Islamic Jihad....", "location": "Nablus, West Bank", "classification": "security", "score": 0.995535507518772, "event_breakdown": "Target event - \nOn the map, site of the funeral for the terrorist Luay Mashe.\nMilitary funeral held by PA's security forces for terrorist Luay Mashe in Balata refugee camp, Nablus, West Bank"}]