[{"id": "7b8fc868-b034-4e18-82e3-3f4ca61e8e4e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26678/", "date": "2024-05-04 17:47", "message": "Palestinian channels report: The IDF attacked the home of the prominent journalist in the Gaza Strip, Hassan Aslih (Hamas-affiliated) in the Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip.\nThere were no casualties in the attack.", "location": "Khan Yunis", "classification": "security", "score": 0.9953827602700771, "event_breakdown": "- The IDF attacked the home of prominent journalist Hassan Aslih in the Manara neighborhood in eastern Khan Yunis, southern Gaza Strip."}, {"id": "26571031-1a73-4311-aa50-d11196f4d847", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26677/", "date": "2024-05-04 17:31", "message": "Palestinian channels: The Palestinian Authority's security mechanisms detonated, in a controlled manner, explosive devices they located in Tubas (Northeastern Samaria).", "location": "Tubas", "classification": "security", "score": 0.9948419961865298, "event_breakdown": "- The Palestinian Authority's security mechanisms detonated explosive devices in Tubas (Northeastern Samaria)"}, {"id": "0e36cb44-3f06-4963-83cf-c7cf6583029e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26676/", "date": "2024-05-04 17:20", "message": "Hamas-identified channels: All four killed (whose names have been published) 👆 in the IDF's activity in the village of Deir al-Ghusun in the north of Tulkarm, were operatives of the military wing of Hamas.\nAlaa Sharitah was the commander of the military wing of Hamas in Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9934812200416727, "event_breakdown": "- Four Hamas operatives killed in IDF activity in Deir al-Ghusun, Tulkarm\n- Alaa Sharitah identified as commander of Hamas military wing in Tulkarm"}, {"id": "11f3d342-8979-4042-84a6-4a1c5d8e7951", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26675/", "date": "2024-05-04 17:19", "message": "Further to this👆\nA joint statement to the IDF spokesperson, the police spokesperson and the Shin Bet spokesperson:\n\nThe soldiers of Yamam, the IDF and the Shin Bet eliminated five terrorists who had barricaded themselves in a building in Tulkarm in a 12-hour battle\n\nThe soldiers of the Yamam, IDF and Shin Bet, under the precise intelligence guidance of the Shin Bet and IDF Intelligence, operated for over 12 hours in Tulkarm in a targeted activity to defeat a terrorist cell.\n\nThe soldiers closed in on a building where the terrorist squad was entrenched, which opened fire on them. The fighters responded by shooting with shoulder-fired missiles and other means from the building, and at the end of the exchange of fire, the five terrorists were eliminated.\nMilitary equipment and weapon parts were confiscated.\n\nDuring the activity, an IDF fighter was injured and brought to continue receiving medical treatment in a hospital; his family was informed.", "location": "Tulkarm", "classification": "security", "score": 0.9849329956770798, "event_breakdown": "- Joint operation by Yamam, IDF, and Shin Bet in Tulkarm\n- Elimination of five terrorists barricaded in a building after a 12-hour battle\n- Soldiers closing in on the building and engaging in a firefight with the terrorists\n- Confiscation of military equipment and weapon parts\n- Injury of an IDF fighter who was brought to a hospital for medical treatment"}, {"id": "03855749-bf19-48c7-97c8-fb8de2d6ce1d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26674/", "date": "2024-05-04 16:10", "message": "The Palestinians publish the names of four of the \"martyrs\" who were killed in the IDF operation tonight in the village of Deir el Ghusun in the north of Tulkarm:\n\n1. Alaa Sharith (the leftmost one).\n2. Tamer Fuqaha (next to Alaa' - both are behind the attack in which Elhanan Klein fell in November 2023. Tamer is also an operative of Erin al Aswad).\n3. Adnan Samara\n4. Asal Badran\n\nIn addition, there is the \"headless martyr\" who has not yet been identified - DNA tests will be conducted on him to confirm his identity.", "location": "Deir el Ghusun in the north of Tulkarm", "classification": "security", "score": 0.9791185685870558, "event_breakdown": "- Palestinians publish names of four \"martyrs\" killed in IDF operation in Deir el Ghusun: Alaa Sharith, Tamer Fuqaha, Adnan Samara, Asal Badran\n- Identification pending for \"headless martyr\" to be confirmed through DNA tests"}, {"id": "7fdda697-315d-4ffb-a633-8b9873a5d48c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26673/", "date": "2024-05-04 15:36", "message": "The Palestinians report that the IDF forces have finished their activities in Deir al-Ghusun in the north of Tulkarm and have left.\nSources in Tulkarm say that the Palestinian rescue forces located another Palestinian \"martyr\" among the ruins, apparently headless.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9671169206516085, "event_breakdown": "- IDF forces finish activities in Deir al-Ghusun, north of Tulkarm\n- Palestinian rescue forces find headless \"martyr\" among ruins in Tulkarm"}, {"id": "e8a61a44-91e0-48a3-82ed-a1be7462bb91", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26672/", "date": "2024-05-04 14:06", "message": "The Palestinians report that the person who came out from under the ruins of the house in Deir al-Ghusun and was arrested by IDF forces is the released prisoner Salma Badran, an operative of the military wing of Hamas with a \"heavy\" family lineage: he is the brother of the two \"martyrs\" of the wing - Fawaz and Seif Allah Badran. Salma is the owner of the apartment where the Hamas terrorists hid last night and which the IDF destroyed.\n\nFawaz (Salma's brother) was one of the senior bomb engineers of the Izz ad-Din al-Qassam Brigades in the West Bank and was the one who assembled the explosive device that exploded in the first suicide attack of the second intifada (March 2001), in which 3 Israeli citizens were killed in Netanya. Fawaz was also the one who recruited the suicide bomber for the attack and also guided other suicide bombers in Tulkarm. He was eliminated by the Israeli security forces that year using an explosive device planted in his car.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9989665591672134, "event_breakdown": "- Salma Badran, a released prisoner and operative of the military wing of Hamas, is arrested by IDF forces in Deir al-Ghusun.\n- Salma Badran is the brother of two \"martyrs\" of the Hamas military wing, Fawaz and Seif Allah Badran.\n- Fawaz Badran, a senior bomb engineer for the Izz ad-Din al-Qassam Brigades, was involved in the first suicide attack of the second intifada in Netanya in March 2001, resulting in the death of 3 Israeli citizens. He was eliminated by Israeli security forces that year using an explosive device planted in his car."}, {"id": "ad1ab7d5-a657-4598-90ce-72df9298da25", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26671/", "date": "2024-05-04 14:00", "message": "The official Palestinian news agency Wafa: 6 Palestinians were killed in the IDF operation in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9664112263099419, "event_breakdown": "- 6 Palestinians were killed in the IDF operation in the village of Deir al-Ghusun in the north of Tulkarm."}, {"id": "4d4ac85d-1050-4979-a027-4486c820392e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26668/", "date": "2024-05-04 13:56", "message": "More footage from Deir al-Ghusun north of Tulkarm from the IDF operation today.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.5645468611123309, "event_breakdown": "- More footage from IDF operation in Deir al-Ghusun north of Tulkarm"}, {"id": "2d29a8a7-39fb-457d-83bb-a0f5b8300d72", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Deir al-Ghusun north of Tulkarm:\nThe IDF forces packed the body of the Palestinian who was killed in the area of ​​the building.\n\nPalestinian sources claim the IDF forces took 3 bodies.\n\nIDF forces then arrested a Palestinian who emerged from under the ruins of the house that the forces had besieged for many hours.", "location": "Tulkarm", "classification": "security", "score": 0.9879003899097348, "event_breakdown": "- IDF forces pack the body of a Palestinian killed in the area of a building in Deir al-Ghusun, north of Tulkarm.\n- Palestinian sources claim IDF forces took three bodies.\n- IDF forces arrest a Palestinian who emerged from under the ruins of the besieged house."}, {"id": "168568b1-1cc4-4b90-acd7-b18198877d46", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26661/", "date": "2024-05-04 13:10", "message": "The \"Holy Fire\" ceremony held today in the Church of the Holy Sepulcher in East Jerusalem as part of the \"Sabbath of Light\" that Christians celebrate today.", "location": "East Jerusalem", "classification": "security", "score": 0.7164941467590658, "event_breakdown": "- \"Holy Fire\" ceremony in the Church of the Holy Sepulcher, East Jerusalem"}, {"id": "723cd525-ccc7-441d-afc6-b299636753a5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26658/", "date": "2024-05-04 13:07", "message": "For nearly ten hours starting last night, IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm.\nAccording to the estimates, the terrorists Tamer Fakha and Alaa Sharitah, the operatives of the military wing of Hamas involved in the shooting attack in which Major General Elhanan Klein was killed near Beit Lid on November 2, 2023, were hiding in the house.\nSources associated with Hamas and Islamic Jihad operatives claim that the two managed to escape from the house which was surrounded by the IDF for many hours and fired upon by a large number of missles (and finally destroyed with a bulldozer - in the attached videos you can see the shooting and the demolition the house).", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9796365504234397, "event_breakdown": "- IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm.\n- Terrorists Tamer Fakha and Alaa Sharitah, operatives of the military wing of Hamas involved in the shooting attack, were believed to be hiding in the house.\n- The two terrorists managed to escape from the house despite being surrounded by IDF for many hours and fired upon with missiles."}, {"id": "f69f177f-0261-4119-b81f-9ee480d3cc68", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26657/", "date": "2024-05-04 13:02", "message": "The Al Jazeera network claims: an Israeli drone launched a missile a few hours ago at a vehicle in Bint Jabil in southern Lebanon.\n\nUnofficial Lebanese sources: No casualties.", "location": "Bint Jbeil, Lebanon.", "classification": "security", "score": 0.9652451684275815, "event_breakdown": "- Israeli drone attack in Bint Jabil, southern Lebanon\n- No casualties reported"}, {"id": "08d7f41f-0ea6-482e-8913-cec421c0ed80", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26656/", "date": "2024-05-04 12:30", "message": "The Qatari Al Jazeera cites a report by Reuters according to which Qatar is considering closing the offices of the political office of Hamas in its territory as part of an overall plan to continue its function as a mediator in the conflict between Hamas and Israel.", "location": "Qatar", "classification": "security", "score": 0.9065846889429762, "event_breakdown": "- Qatari Al Jazeera cites a report by Reuters about Qatar considering closing the Hamas political office in its territory\n- Qatar's plan is part of its mediation efforts in the Hamas-Israel conflict."}, {"id": "b1b8fef5-7136-453d-865d-43da8c0e3c51", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26655/", "date": "2024-05-04 12:29", "message": "At least 3 different Israeli military reporters publish the exact same message:\n\nPolitical actor:\n\nContrary to the publications, Israel will under no circumstances agree to the end of the war as part of an agreement to release our abductees.\n\nAs the political echelon decided, the IDF will enter Rafah and destroy the remaining Hamas battalions there - whether or not there will be a temporary respite for the release of our hostages.", "location": "Rafah", "classification": "security", "score": 0.6696081489195264, "event_breakdown": "null"}, {"id": "9b85671c-9287-4c44-9431-3bd7c694a0b7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26653/", "date": "2024-05-04 12:27", "message": "Today, Lebanese sources report: Hezbollah will soon submit its comments to the French proposal to end the war in southern Lebanon\n\nJournalist sources in Lebanon state that Hezbollah and the Amal movement discussed the French proposal and decided not to reject it (so as not to be perceived as refusers - AA) but to submit 10 comments to amend the proposal.\nThe comments will be forwarded to the Speaker of the Lebanese Parliament (who happens to also be the head of the Amal Shiite movement fighting alongside Hezbollah in southern Lebanon - AA) and he will discuss them with Prime Minister Mikati and forward them to the French side.", "location": "Lebanon", "classification": "security", "score": 0.9143945024805114, "event_breakdown": "- Hezbollah to submit comments on French proposal to end war in southern Lebanon\n- Hezbollah and Amal movement discuss French proposal, decide not to reject it, but to submit 10 comments for amendments\n- Comments to be forwarded to Speaker of Lebanese Parliament, who will discuss them with Prime Minister Mikati before forwarding them to the French side"}, {"id": "c1cd592e-8ca7-454a-b4ec-91b9d06fd5e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26649/", "date": "2024-05-03 20:30", "message": "Documentation of one of today's attacks in the area of ​​the displaced persons' tents in Rafah in the south of the Gaza Strip - note the rocket rising into the sky. This indicates a precise hit by the aircraft on the target.", "location": "Rafah", "classification": "security", "score": 0.9952821119807056, "event_breakdown": "- Documentation of an attack in the area of displaced persons' tents in Rafah, south of the Gaza Strip.\n- Rocket rising into the sky indicates a precise hit by aircraft on the target."}, {"id": "22b3ca39-c1d2-45a8-9c0c-5bdd46773895", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26648/", "date": "2024-05-03 20:27", "message": "Hamas in an official announcement:\n\nIn light of the recent contacts with the mediators, tomorrow a delegation of the movement will arrive in Cairo to complete the talks.\n\nWe emphasize that the leadership of the movement reacted in a positive spirit to the proposal it received while discussing it. We are going to Cairo in the same positive atmosphere to reach an agreement.\n\nWe are determined to reach an agreement that will realize the demands of our people for a total cessation of aggression, the withdrawal of forces, the return of the displaced, aid to our people, the beginning of the reconstruction of the Gaza Strip and a serious exchange deal.", "location": "Cairo", "classification": "security", "score": 0.3907896760166591, "event_breakdown": "- Hamas announces that a delegation will arrive in Cairo to complete talks following recent contacts with mediators.\n- The leadership of Hamas reacts positively to a proposal and intends to reach an agreement emphasizing a total cessation of aggression, withdrawal of forces, return of displaced individuals, aid to the people, reconstruction of Gaza, and a serious exchange deal."}, {"id": "96accb55-3eb3-4f84-9341-24a57304b6a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26644/", "date": "2024-05-03 17:44", "message": "Reuters from a senior Hamas official: a Hamas delegation will arrive in Cairo tomorrow.", "location": "Cairo", "classification": "security", "score": 0.9023652992005777, "event_breakdown": "- Reuters report: A Hamas delegation will arrive in Cairo tomorrow."}, {"id": "90d81c77-f6d1-4be2-b6ae-cb2551fcd3b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26642/", "date": "2024-05-03 16:36", "message": "One of the signs of abundance in the northern Gaza Strip: Gazan donkeys receive fresh pita bread\n\nA Gazan from the north of the Gaza Strip to the donkey: once (when there was a shortage of bread) we ate from your food, now take and eat bread from today. You are better than many people...", "location": "Gaza Strip", "classification": "security", "score": 0.8432632263954416, "event_breakdown": "- Gazan donkeys in the northern Gaza Strip receive fresh pita bread\n- A Gazan from the north of the Gaza Strip offers fresh bread to the donkeys as a gesture of gratitude"}, {"id": "9d6a84b2-cb4a-46f6-93cb-3c3500074c5c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26641/", "date": "2024-05-03 16:28", "message": "American Central Command:\n\nDue to weather conditions, construction work on the floating pier off the coast of Gaza was stopped and it was moved to Ashdod port, where its construction will be completed.\n\nAfter the completion of its construction, it will be floated along the shores of Gaza to the place where it was planned to be placed.", "location": "Ashdod port", "classification": "security", "score": 0.8222928362890448, "event_breakdown": "- Construction work on the floating pier off the coast of Gaza halted due to weather conditions\n- Floating pier moved to Ashdod port for completion of construction\n- After construction completion, the floating pier will be floated along the shores of Gaza to its intended location."}, {"id": "0227bf24-7d55-4e4d-9b44-fadc2fe70a2e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26640/", "date": "2024-05-03 15:56", "message": "Reuters from an Egyptian source:\n\nThe head of the CIA, William Burns, arrived in Cairo to promote the ceasefire in Gaza.\n\n##\nThe Americans are using all their weight and are firing their heaviest guns to reach a ceasefire.", "location": "Cairo", "classification": "security", "score": 0.8731912994868349, "event_breakdown": "- Head of the CIA, William Burns, arrives in Cairo.\n- Purpose of the visit is to promote the ceasefire in Gaza.\n- The United States is heavily involved in efforts to reach a ceasefire, employing significant diplomatic pressure."}, {"id": "cf6cbe59-bd8d-4bd5-9c9e-793b7d0eaf82", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26639/", "date": "2024-05-03 15:55", "message": "The Palestinian Ministry of Health in Gaza:\n26 dead in the Strip in the last day.\n\nThe number of deaths in the last few days:\n28\n33\n47\n34\n\nTotal dead in the Gaza Strip since the beginning of the war: 34,622. Total wounded: about 78 thousand.\n\n##\nIn the last day, the number of dead was the lowest in the Gaza Strip since the beginning of the war (with the exception of the hodna period in November 2023).", "location": "Gaza City", "classification": "security", "score": 0.8569080015487186, "event_breakdown": "- 26 dead in the Gaza Strip in the last day\n- Total of 28, 33, 47, and 34 deaths reported in the last few days\n- Total dead in the Gaza Strip since the beginning of the war: 34,622\n- Total wounded in the Gaza Strip since the beginning of the war: about 78 thousand"}, {"id": "a054932c-5578-40f7-9f57-45dbaee9cb1d", "channel_id": 1560386984, "url": "", "date": "2024-05-03 15:14", "message": "Berlin: A large fire at the Diehl company's weapons manufacturing plant. \nThe Diehl company manufactures defensive weapon systems and guided missiles.", "location": "Berlin", "classification": "security", "score": 0.7984412808819542, "event_breakdown": "- Large fire at Diehl company's weapons manufacturing plant in Berlin. \n- Diehl company manufactures defensive weapon systems and guided missiles."}, {"id": "e32aa91a-fd42-498f-ba2f-cb0fef7c727c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26633/", "date": "2024-05-03 13:36", "message": "Paris: French security forces break into Sciences Po the Institute of Political Science to break up an anti-Israel demonstration by the students there.", "location": "Sciences Po, Paris", "classification": "security", "score": 0.9281242816179448, "event_breakdown": "- French security forces break into Sciences Po (Institute of Political Science) in Paris to break up an anti-Israel demonstration by the students."}, {"id": "50c8648d-94e3-4c85-bed2-28eb526af8d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26630/", "date": "2024-05-03 13:15", "message": "About 100,000 Palestinians have left the Gaza Strip since the beginning of the war\n\nThe Palestinian ambassador in Egypt: since the beginning of the war and until April, 85 thousand Palestinians left the Gaza Strip for Egypt through the Rafah crossing.\n\nTaking the month of April into account, it can be estimated that about one hundred thousand Palestinians left the Strip since the beginning of the war.", "location": "Rafah", "classification": "security", "score": 0.8683848530412968, "event_breakdown": "- About 100,000 Palestinians have left the Gaza Strip since the beginning of the war, with 85,000 leaving for Egypt through the Rafah crossing until April."}, {"id": "4e51d8cb-86a3-46e1-a670-64b2865556c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65962/", "date": "2024-05-03 13:11", "message": "A must watch:\n\nStudents from the \"Free Palestine Army\" charge Portland police officer with shields made from trash cans.\n\n##\nNot the sharpest tools in the shed...", "location": "Portland", "classification": "security", "score": 0.7716378859605466, "event_breakdown": "- Students from the \"Free Palestine Army\" charge a Portland police officer with shields made from trash cans.\n- Incident occurs in Portland."}, {"id": "d2d2b15f-cb5b-4e6b-a7c0-205621fcd62e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26628/", "date": "2024-05-03 13:11", "message": "Fox News: The Iranian flag was raised by the students at the University of Irvine in California.\n\nIran is offering scholarships to students who will be expelled from US universities following the protests.", "location": "University of Irvine in California", "classification": "security", "score": 0.38395330639266484, "event_breakdown": "- Iranian flag raised by students at the University of Irvine in California.\n- Iran offers scholarships to students facing expulsion from US universities due to protests."}, {"id": "f39a76fc-7d01-41fa-a7f6-47457cf7feb4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26625/", "date": "2024-05-03 11:05", "message": "Reuters from the Turkish Minister of Commerce:\n\nThe suspension of trade with Israel will continue until a permanent cease-fire in Gaza and until Israel allows all aid into the strip. \n\n##\nTurkey has de-facto joined the Shiite axis - like the Houthis... they are harming the Israeli economy until a ceasefire is reached. The Sultan became a Houthi pirate.\n\nIsrael should remember this when Turkey wants to resume trade between the countries.", "location": "Gaza", "classification": "security", "score": 0.9341793288581125, "event_breakdown": "- Turkish Minister of Commerce announces the continuation of the suspension of trade with Israel until a permanent cease-fire in Gaza and until Israel allows all aid into the strip.\n- Turkey's stance is likened to joining the Shiite axis, akin to the Houthis, and is seen as harming the Israeli economy until a ceasefire is reached."}, {"id": "87fe722d-c747-458b-acc4-70859ee013d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26624/", "date": "2024-05-03 11:04", "message": "The Shia militias in Iraq claim:\nYesterday afternoon (May 2nd) we launched two cruise missiles from Iraq at a target in Tel Aviv and at a target in Be'er Sheva.\n\nThe militias in Iraq also claim that they attacked an Israeli target in the Dead Sea early this morning \"with appropriate weapons\".\n\n###\nSources of the Lebanese al-Mayadeen claim that the Iraqi cruise missiles were launched at the Glilot Base in Tel Aviv and the Avraham Base in Be'er Sheva.", "location": "Tel Aviv, Israel.", "classification": "security", "score": 0.9833649319691411, "event_breakdown": "- Shia militias in Iraq claim to have launched two cruise missiles at targets in Tel Aviv and Be'er Sheva\n- Militias in Iraq claim to have attacked an Israeli target in the Dead Sea with appropriate weapons"}, {"id": "e95a982b-5271-4e7a-a81a-878037ef6686", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26623/", "date": "2024-05-03 10:23", "message": "The coup in Niger: Russian soldiers reportedly enter a military base where the American troops are stationed\n\nAccording to Reuters, Russian soldiers have entered a military air base housing American forces in the capital of Niger.\n\nAs you might remember, last year there was a coup in Niger and the military junta that seized power demanded that the US terminate the agreement with it and... remove all American forces from Niger.\n\nThe American forces have not yet evacuated and now they have new \"guests\" at their base.\n\nAmerican officials state that the Russian and American soldiers remain in separate areas at the base. The American Secretary of Defense spoke out on the matter and said that there is no fear that the Russians will get their hands on American equipment.\n\n##\nThe Taliban send their regards..", "location": "Niamey", "classification": "security", "score": 0.7709916187413431, "event_breakdown": "- Russian soldiers reportedly enter a military base housing American troops in the capital of Niger.\n- Last year, a coup occurred in Niger, and the military junta demanded the removal of all American forces.\n- American forces have not yet evacuated from Niger despite the junta's demands.\n- Russian and American soldiers remain in separate areas at the base, according to American officials.\n- American Secretary of Defense reassures that there is no fear of Russians acquiring American equipment.\n- Additional statement: \"The Taliban send their regards.\""}, {"id": "2136b160-8248-40ae-93ac-203f0354233f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26620/", "date": "2024-05-03 06:44", "message": "Last night's attack in Damascus, attributed to Israel\n\nSyrian sources identified with the Shiite axis report that the target of the Israeli attack in Damascus was the \"State Security School\" (of the Syrian Army - AA), near the village of Najaha, and as a result, a three-story building was severely damaged there.\nAccording to these sources, the target of the attack belonged to the Syrian army and not to Iranian elements in Syria.\n\nThe Syrian Ministry of Defense officially announced that Israel carried out an airstrike last night at 10:05 PM which resulted in the injury of 8 Syrian soldiers and damage to property.", "location": "Damascus", "classification": "security", "score": 0.9816944407775801, "event_breakdown": "- Last night's attack in Damascus, attributed to Israel\n- Target of the Israeli attack was the \"State Security School\" near the village of Najaha in Damascus\n- Three-story building severely damaged\n- Target of the attack belonged to the Syrian army, not Iranian elements\n- Syrian Ministry of Defense officially announced airstrike by Israel at 10:05 PM\n- 8 Syrian soldiers injured and property damaged"}, {"id": "b0dfa438-8d28-4da0-a168-3dec7c53b361", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26619/", "date": "2024-05-02 20:40", "message": "After the report of the Bloomberg agency's reporter in Turkey 👆, the Turkish Ministry of Commerce officially announces:\n\nFrom today, the import of goods from Israel and the export of goods to it will be suspended until all aid can be brought into the Gaza Strip", "location": "Turkey", "classification": "security", "score": 0.9158362566726752, "event_breakdown": "- Turkish Ministry of Commerce officially announces suspension of import of goods from Israel and export of goods to Israel\n- Suspension of trade with Israel until aid can be brought into Gaza Strip"}, {"id": "2522b9c2-c729-4215-908c-65028b0d710e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26618/", "date": "2024-05-02 20:19", "message": "Palestinian sources report the death of officer Muhammad Adas, one of the companions of Palestinian Authority Chairman Abu Mazen from the Presidential Guard, as a result of an IDF shot that hit him in the head during the entry of IDF forces into the village of Anbata in the Tulkarm district in the last hour.", "location": "Anbata", "classification": "security", "score": 0.9884898904177141, "event_breakdown": "null"}]