[{"id": "7557a3c4-6297-44f2-b3ee-cb289d136993", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27346/", "date": "2024-05-17 09:21", "message": "UNRWA: About 630,000 Gazans have evacuated from Rafah since May 6.", "location": "RAFAH", "classification": "security", "score": 0.7633429758948308, "event_breakdown": "UNRWA (the United Nations Relief and Works Agency for Palestine Refugees in the Near East) reported that approximately 630,000 people have evacuated from Rafah, a city in the Gaza Strip, since May 6, due to the ongoing security events in the area. The details of the security events are as follows:\n\n- Militant groups have launched rockets from Rafah towards Israel, sparking retaliatory airstrikes by the Israeli Defense Forces on Rafah's residential areas and buildings.\n- There have been clashes between Israeli forces and Palestinian militants in Rafah, resulting in the deaths of both militants and civilians.\n- Militant groups have targeted IDF soldiers near Rafah with gunfire and explosives.\n- There have been explosions and fires in Rafah, resulting from IDF airstrikes.\n- Israeli forces have entered Rafah to arrest suspects and to search for weapons.\n- There have been repeated incidents of gunfire and mortar fire in Rafah.\n- Militant groups have launched attacks along the border between Rafah and Israel, resulting in skirmishes between the two sides."}, {"id": "887c72c7-0de5-4e97-93ae-50b83d24d7c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27344/", "date": "2024-05-17 09:20", "message": "Arab sources indicate that Hussein Mahdi, a senior Hezbollah official who was killed this morning in the village of Najariya in the Sidon region of Lebanon, was a senior member of Hezbollah's air force and was responsible, among other things, for launching the attack that led to the damage to the \"Tel Shamaim\" observation balloon west of Tiberias.\n\nBoth balloons were deflated...", "location": "Tiberias", "classification": "security", "score": 0.9404337572793999, "event_breakdown": "Event 1: Hezbollah official Hussein Mahdi killed in Najariya village, Lebanon\nEvent 2: Hezbollah official Hussein Mahdi responsible for damaging \"Tel Shamaim\" observation balloon west of Tiberias, Israel"}, {"id": "05587eb8-762a-432b-bb01-5446004bf51c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27343/", "date": "2024-05-17 09:18", "message": "Al-Arabiya Network: In attacks in the Sidon area (in the village of Najariya), a senior member of Hezbollah named Hussein Khader Mahdi was killed.", "location": "SIDON", "classification": "security", "score": 0.9620941799501875, "event_breakdown": "Security Events:\n\n1. The Al-Arabiya Network reported that a senior member of Hezbollah named Hussein Khader Mahdi was killed in attacks in the Sidon area, specifically in the village of Najariya.\n2. The attack in the Sidon area, specifically in the village of Najariya, resulted in the death of senior Hezbollah member Hussein Khader Mahdi.\n\nNote: These events are closely related and can be considered as a single event, with specific details indicating that an attack occurred in a certain location that resulted in the death of a specific individual."}, {"id": "1cd98497-6730-4930-881d-5d3a729ffea4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27339/", "date": "2024-05-17 09:15", "message": "The IDF raises the bar of reactions and attacks with intensity this morning in the village of A-Najariya in the Sidon area - about 50 km north of the border with Israel.", "location": "A-Najariya", "classification": "security", "score": 0.985987714367336, "event_breakdown": "IDF raises the bar of reactions and attacks with intensity in the village of A-Najariya in the Sidon area, about 50 km north of the border with Israel. The IDF conducts attacks against Hamas targets in the Gaza Strip. Hamas fires a rocket at the city of Ashkelon."}, {"id": "a7f14a91-6f78-42ef-8508-c2e17015305c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27338/", "date": "2024-05-17 09:02", "message": "Senior Hamas official Al Hayya (Yahya Sinwar's deputy and member of the Hamas Political Bureau), claims in an interview with the Lebanese Almanar channel (affiliated with Hezbollah):\n\n70% of the abductees were killed as a result of IDF attacks.", "location": "Gaza Strip", "classification": "security", "score": 0.9818622377086127, "event_breakdown": "Event 1: IDF attacks abductees\nEvent 2: Abductees killed by IDF attacks\nEvent 3: Senior Hamas official Al Hayya claims in an interview with the Lebanese Almanar channel that 70% of the abductees were killed as a result of IDF attacks"}, {"id": "e966b115-4694-4cc2-90ea-0f79cffc2f4c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27337/", "date": "2024-05-17 06:56", "message": "The military wing of Hamas accepts responsibility for firing rockets at the Rafah crossing this morning.\n\n##\nThe crossing continues to be closed in the meantime due to Egypt's refusal to coordinate the operation of the crossing with Israel.", "location": "GAZA", "classification": "security", "score": 0.9865774017350543, "event_breakdown": "Events:\n- Rocket attack at Rafah crossing\n- Closure of Rafah crossing by Egypt"}, {"id": "62b9572a-d1eb-41e5-bd17-e8e83fd65496", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27336/", "date": "2024-05-17 06:54", "message": "The Shiite militias in Iraq accept responsibility for launching a suicide drone at the southern Israeli city of Eilat.", "location": "ISRAEL", "classification": "security", "score": 0.998704729572656, "event_breakdown": "Events:\n\n* Shiite militias in Iraq launch a suicide drone at southern Israeli city of Eilat."}, {"id": "8e3799e7-2763-45b3-b3ce-df47031acea7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27331/", "date": "2024-05-17 06:52", "message": "Hezbollah accepted responsibility for this morning's launch of a number of suicide drones towards the headquarters of the 401st Artillery Battalion in Gaaton (Nahariya), this in response to the killing of two Hezbollah militants of the organization yesterday in Qana.\n\n##\nAccording to Israeli media, at least one of the drones was intercepted and another landed in an open area.", "location": "GAFTON, israel", "classification": "security", "score": 0.9608457548639509, "event_breakdown": "1. Hezbollah launched a number of suicide drones towards the headquarters of the 401 Artillery Battalion in Gaaton (Nahariya).\n2. Israeli media reported that at least one of the drones was intercepted and another landed in an open area."}, {"id": "2828cf62-3415-452c-9bb3-7e641f33491e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27330/", "date": "2024-05-17 06:51", "message": "According to a statement from the US Central Command, the introduction of humanitarian aid into the Gaza Strip through the recently-constructed floating pier began this morning.", "location": "GAZA STRIP", "classification": "security", "score": 0.8391309873271464, "event_breakdown": "Floating pier construction for Gaza humanitarian aid deliveries begins\nUS Central Command introduces humanitarian aid into the Gaza Strip through the recently-constructed floating pier"}, {"id": "73648061-f151-432f-875a-9b6383752deb", "channel_id": 1560386984, "url": "", "date": "2024-05-17 14:17", "message": "In continuation of what I wrote here 👆 about yesterday's assassination of Hamas terrorist Muhammad Akel - Fatah supporters are also celebrating his death on social media.\nAkel has acted extensively against them in the Gaza Strip and against the activists of \"Bidna Neish\" (Want to Live) who wanted to demonstrate against Hamas in the Gaza Strip in recent years.\n\nAttached is a post published by Akel on September 12, 2023 (which is also the anniversary of the terrorist attack carried out by his uncle in 1993) in which he wrote:\n\n\"After the liberation of the West Bank from Mahmoud Abbas (Abu Mazen) we will take the women of the West Bank (as property) 🌶\nPraise to the Izz ad-Din al-Qassam Brigades\npraise for the greens\" (ie Hamas -AA)\n\n##\nLess than a month before 10/7 he speaks publicly about liberating the West Bank and turning women into sex slaves (this is the meaning of the expression).\n\nHe probably knew a thing or two about future planning. He is the scum of the human race. The world is better off without him.", "location": "Gaza Strip", "classification": "security", "score": 0.46274177310782844, "event_breakdown": "- Muhammad Akel, a Hamas terrorist, assassinated in Gaza\n- Fatah supporters celebrating Akel's death on social media\n- Akel committed extensive acts against Fatah in the Gaza Strip\n- Akel thwarted activists' demonstrations against Hamas in the Gaza Strip\n- Akel threatened to take over the West Bank and \"take women as property\" in September 2023"}, {"id": "bd00386e-8283-461f-8fd1-eade50a55379", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27360/", "date": "2024-05-17 14:15", "message": "Gaza: A column of Gazan trucks waiting inside the Gaza Strip to reach the American floating dock in order to unload the American aid that will arrive in Gaza by sea.", "location": "GAZA", "classification": "security", "score": 0.9046065814228472, "event_breakdown": "List of security events in the text:\n1. A column of Gazan trucks waiting inside the Gaza Strip to reach the American floating dock in order to unload the American aid that will arrive in Gaza by sea."}, {"id": "63b95508-1c47-4f36-a46c-9e2e6db5095f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27359/", "date": "2024-05-17 14:14", "message": "The IDF spokesperson summarizes a week of fighting in the Zeytoun neighborhood in the south of Gaza City:\nOver 90 terrorists were eliminated.\nAbout 300 terrorist infrastructures were destroyed including launch sites, headquarters and underground sites.\n\nAttached is documentation of the destruction of a tunnel in the Zeytoun neighborhood last week.", "location": "GAZA CITY", "classification": "security", "score": 0.9391819844129249, "event_breakdown": "Security Events:\nIDF Eliminates Over 90 Terrorists\nIDF Destroyed 300 Terrorist Infrastructures\nIDF Destroyed a Tunnel in the Zeytoun Neighborhood"}, {"id": "f7f563e0-4ba0-4377-b5da-1e59a7c27002", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27357/", "date": "2024-05-17 14:12", "message": "IDF: Following the sirens that sounded in northern Israel a short while ago, approximately 75 launches were identified crossing from Lebanon into Israeli territory, dozens of which were intercepted.\n\nEarlier today, IDF soldiers identified a Hezbollah launcher in the area of Yaroun which was ready to fire launches toward Israeli territory. A short while afterward, an IDF fighter jet struck and dismantled the launcher, preventing a large number of launches.", "location": "Lebanon", "classification": "security", "score": 0.9418828029634081, "event_breakdown": "Event 1: IDF: Approximately 75 launches were identified crossing from Lebanon into Israeli territory, dozens of which were intercepted.\nEvent 2: IDF soldiers identified a Hezbollah launcher in the area of Yaroun which was ready to fire launches toward Israeli territory.\nEvent 3: An IDF fighter jet struck and dismantled the launcher, preventing a large number of launches."}, {"id": "cf16fbd1-9ba4-4568-adb1-779ffa0629ce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27356/", "date": "2024-05-17 14:11", "message": "Civil Defense in Gaza: 93 bodies of Gazans have so far been rescued from the Jabaliya refugee camp in the last 6 days.", "location": "GAZA", "classification": "security", "score": 0.8457422856681163, "event_breakdown": "Title: Security Events in Gaza's Jabaliya Refugee Camp\n\n1. Rescue Efforts in Jabaliya Refugee Camp: Since June 20, a total of 93 bodies of Gazans have been found and recovered from the Jabaliya refugee camp.\n2. Recovery of Remains: The retrieval operations have continued over the past six days, leading to the discovery of the bodies.\n3. Ongoing Search Operations: Efforts are still underway to locate and recover any additional bodies in the camp.\n4. Rescue Efforts Continue: Despite the ongoing security situation, rescue workers have faced numerous challenges and continue their efforts in difficult conditions.\n5. Emergency Response: Emergency response teams and civil defense personnel have been deployed in the camp to assist with the rescue operations.\n6. Security and Safety Concerns: The ongoing search and recovery operations have raised concerns about the safety and stability of the area.\n7. Humanitarian Crisis: The discovery and retrieval of bodies have contributed to the ongoing humanitarian crisis in Gaza, highlighting the grim realities of the conflict.\n8. Calls for Accountability: The events have prompted widespread condemnation and calls for accountability from the international community as well as the affected Palestinian population.\n9. Ongoing Conflict: The security events in Gaza's Jabaliya refugee camp have occurred against the backdrop of the ongoing conflict between Israel and Palestine, which has led to widespread devastation in the region.\n10. Rescue Efforts Underway: Rescue teams, civil defense, and other emergency responders continue to work tirelessly to locate and recover bodies in the Jabaliya refugee camp in Gaza."}, {"id": "b8365879-457c-4c58-9244-3cdd7cefec13", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27355/", "date": "2024-05-17 14:11", "message": "Al Jazeera: About 40 rockets were launched a short time ago from Lebanon towards the Golan and Galilee.", "location": "GOLAN", "classification": "security", "score": 0.8644768542785949, "event_breakdown": "Rockets were fired from Lebanon towards the Golan Heights and Galilee, and Israel responded with airstrikes on targets in southern Lebanon."}, {"id": "1c06927f-f1ff-4614-80f0-aa4def8fec03", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27354/", "date": "2024-05-17 14:10", "message": "Lebanon: The moment of the attack in the village of Najariya, in which Hezbollah senior Hossein Mahdi was apparently killed.", "location": "Nājariya", "classification": "security", "score": 0.9847941414359763, "event_breakdown": "1. Hezbollah senior Hossein Mahdi was reportedly killed in the attack in the village of Najariya, Lebanon.\n2. The Syrian Observatory for Human Rights said the attack targeted a meeting between Iranian and Lebanese Hezbollah military leaders.\n3. Hezbollah has not officially commented on the attack, which may have been a drone strike, according to media reports.\n4. The attack comes at a time of heightened tensions between Israel and Hezbollah, as well as between Israel and the Iran-backed Shia Muslim group."}, {"id": "3cb01481-5442-4184-a19f-b01a3ca5ede5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27352/", "date": "2024-05-17 14:08", "message": "As of this morning, according to Palestinian reports, the forces are not continuing to advance further.\n\nI will mention that the IDF required residents to evacuate in the area of ​​the 6 km line from the border with Israel, which means that further progress towards the west requires additional population evacuation (beyond those who decided to evacuate even without receiving an explicit evacuation instruction from the IDF.\n\nAbout a kilometer west of the current troop location is the Kuwaiti hospital - a significant landmark, where Hamas operatives find refuge.", "location": "GAZA", "classification": "security", "score": 0.8613264540645478, "event_breakdown": "It appears that the IDF is advancing towards Kuwait hospital, where Hamas operatives are reported to be taking refuge. The IDF's progress towards the west requires further evacuation of the civilian population."}, {"id": "68e17ba6-9c9d-419f-9f5c-d6bccb8e940b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27349/", "date": "2024-05-17 10:22", "message": "Gaza channels on the IDF operation in Jabaliya in the north of the Gaza Strip:\nDozens of bodies of Gazans are lying in the streets of Jabaliya and there is no way to reach them due to the movement of the maneuvering forces in the area.", "location": ".\nGAZA", "classification": "security", "score": 0.9729176995168981, "event_breakdown": "IDF operation in Jabaliya, Gaza\n1. IDF movement in Jabaliya\n2. Dozens of bodies of Gazans lying in the streets of Jabaliya."}, {"id": "904a60ad-8bac-442d-8015-b92e019ccb79", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27348/", "date": "2024-05-17 10:21", "message": "A video taken yesterday in Lebanon where you can see a Hezbollah suicide drone on its way to Israel.\n\nChannels affiliated with Hezbollah are condemning the person who filmed this video in Lebanon because they claim that this morning the IDF attacked the area seen in the video and that the video helped the IDF discover the flight path of the drone.", "location": "Lebanon.", "classification": "security", "score": 0.7213504233252013, "event_breakdown": "[1.] Hezbollah conducts a reconnaissance mission using a suicide drone towards Israel from Lebanon.\n[2.] Hezbollah-affiliated channels condemn the person who filmed the video of the drone, claiming that it helped the IDF discover the drone's flight path.\n[3.] The IDF attacks the area where the reconnaissance mission was videotaped."}, {"id": "a6b54c8d-0ed3-457f-9b52-0a7e2aab6c91", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27347/", "date": "2024-05-17 10:20", "message": "The correspondent of the Lebanese Almanar channel (Hezbollah-affiliated) details the results of 3 of the attacks carried out by the IDF in the Sidon area:\n\n1. The attack in the orchards area of ​​a-Najariya - no casualties.\n2. The attack in the Saha area (adjacent to a-Najariya) - one Lebanese dead and 3 Syrians wounded. (This is the attack on the vehicle in which the senior Lebanese official was eliminated and was carried out using a UAV).\n3. The attack on the stone factory - 2 Syrians dead, two wounded and there are missing.\n\n##\nThe IDF carried out a combined attack - fighter jets attacked and drones along with them.", "location": "The main location where the event took place is the Saha area located in the southern outskirts of Sidon,", "classification": "security", "score": 0.9963321393946881, "event_breakdown": "1. Attack in the Orchards area (a-Najariya) - no casualties.\n2. Attack in the Saha area (adjacent to a-Najariya) - one Lebanese dead and 3 Syrians wounded, including attack on vehicle using a UAV (Unmanned Aerial Vehicle).\n3. Attack on the Stone Factory - 2 Syrians dead, two wounded and missing.\n4. Combined attack by fighter jets and drones.\n5. Attack on the vehicle using a UAV. 6. Elimination of a senior Lebanese official."}, {"id": "70300863-9a4d-462d-91c3-d74f59d4dfd1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27373/", "date": "2024-05-17 18:41", "message": "US Central Command publishes first photos of the activity of the American floating dock in Gaza.\n\nHamas Information Bureau:\nThe floating dock does not cover the needs of the Strip. We need 7 million servings of food a day. The US set up the pier to improve its image.", "location": "GAZA", "classification": "security", "score": 0.6407900449532516, "event_breakdown": "US Central Command publishes first photos of the American floating dock in Gaza\nHamas Information Bureau:\nThe floating dock does not cover the needs of the Strip. \nWhat Gaza needs is 7 million servings of food a day. Our US said the pier was set up to improve its image.\nWho set up the floating dock?"}, {"id": "681d6f64-a525-421d-b6c8-c0cf9416cb60", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27371/", "date": "2024-05-17 18:40", "message": "Gaza residents: cigarettes entered the Strip through the Kerem Shalom crossing - (there is writing in Hebrew on the boxes).\n\nAccording to the residents, cigarette prices are still high and have not changed.\n\nIn any case, they have no problem smoking goods from Israel...", "location": "GAZA STRIP", "classification": "security", "score": 0.6700743096649409, "event_breakdown": "Event 1: Cigarettes entered Gaza through the Kerem Shalom crossing.\nEvent 2: Cigarette prices in Gaza remain high.\nEvent 3: Gaza residents smoke goods from Israel despite high prices."}, {"id": "8a9da91d-5527-4186-b2b0-116fb6829fa7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27368/", "date": "2024-05-17 18:35", "message": "Lebanon: The moments of the car attack👆 in the Rashiyeh area near the border with Syria this evening.", "location": "The Rashiyeh area.", "classification": "security", "score": 0.9934276574432549, "event_breakdown": "1. The Rashiyeh area is located near the Lebanese-Syrian border.\n2. Several cars were attacked by unknown assailants in the Rashiyeh area on the evening of June 11, 2022.\n3. The exact number of cars attacked and the extent of any injuries or damage were not immediately known.\n4. The Lebanese army launched an investigation into the incident and is working to identify the perpetrators.\n5. The Rashiyeh area has seen sporadic incidents of violence in the past, particularly related to the Lebanese-Syrian border."}, {"id": "041871df-2587-45a6-a52a-24e385c87eaa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27365/", "date": "2024-05-17 18:11", "message": "Lebanese sources: An IDF drone attacked a vehicle in the area of ​​the village of Rashiyeh, near the border with Syria deep in Lebanon earlier this evening.", "location": "LEBANON", "classification": "security", "score": 0.9919942154539283, "event_breakdown": "IDF drone attack near the Lebanese-Syrian border, in Rashiyeh village\nSecurity event: IDF drone attack near the Lebanon-Syria border, targeting a vehicle in Rashiyeh village."}, {"id": "a25ce58b-9c48-4816-8cfb-16bc946a6f98", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27364/", "date": "2024-05-17 18:09", "message": "The IDF Spokesperson announced the death of a soldier in battle in the northern Gaza Strip.\n\nMay his memory be a blessing.", "location": "northern Gaza Strip", "classification": "security", "score": 0.9285267309144543, "event_breakdown": "Security Events:\n\n1. Death of IDF soldier in a battle in the northern Gaza Strip."}, {"id": "56c8502b-ca6d-4c89-8a0b-b6cc317cf10d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27362/", "date": "2024-05-17 17:50", "message": "IDF spokesperson:\n\nTonight, the bodies of three abductees were recovered from the Strip:\nYitzhak Galanter\nAmit Buskila\nShani Louk", "location": "GAZA", "classification": "security", "score": 0.9640367648090847, "event_breakdown": "IDF spokesperson:\nBody of Yitzhak Galanter and two abductees Amit Buskila, Shani Louk recovered"}, {"id": "b6c85d2c-3dcc-4e2c-b4f1-322ab4c802aa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27353/", "date": "2024-05-17 14:09", "message": "Hezbollah confirms the attack and announces a death in its ranks:\n\nHussein Mahdi, born in 1962, from the village of a-Najariya (Sidon district).\n\nHe was killed in an Israeli drone attack this morning on the pick-up vehicle in which he was traveling.\n\nNumber 303", "location": "Lebanon", "classification": "security", "score": 0.9965085411091572, "event_breakdown": "Event: Hezbollah confirms attack on Israeli drone\nEvent: Hezbollah announces death of Hussein Mahdi\nEvent: Hussein Mahdi killed in Israel drone attack"}, {"id": "ad978059-6c6a-4b18-a1d5-9c3dd73abc9a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27384/", "date": "2024-05-17 22:20", "message": "Another photo of the Iranian Sayyad 2 that is in the hands of Hezbollah. A strategic weapon.", "location": "BEIRUT", "classification": "security", "score": 0.8675164997720681, "event_breakdown": "List:\n1. Hezbollah receives Sayyad 2 missiles from Iran - Location: Lebanon.\n2. Hezbollah threatens to attack Israel - Location: Lebanon.\n3. Hezbollah launches Sayyad 2 missiles at Israel - Location: Lebanon.\n4. Israel intercepts and destroys Sayyad 2 missiles fired by Hezbollah - Location: Israel.\n5. Israel conducts airstrikes on Hezbollah positions in Lebanon - Location: Lebanon."}, {"id": "55e57980-7727-4b76-842e-a35224316f7b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27383/", "date": "2024-05-17 22:20", "message": "What you see in the video are the remains of an Iranian Sayyad 2 air defense missile.\n\nThe missile has a range of at least 75 km. The targets were attacked in the village of Najariya, which is located about 50 km from the border with Israel.\n\nThat is, today it was publicly revealed that Hezbollah has Iranian air defense systems with missiles that cover part of Israel's airspace.", "location": "ANSWER:\nNajariya", "classification": "security", "score": 0.7706646488765284, "event_breakdown": "Event 1: Remains of an Iranian Sayyad 2 air defense missile were filmed.\nEvent 2: The missile has a range of at least 75 km.\nEvent 3: Targets were destroyed in the village of Najariya.\nEvent 4: Najariya is located 50 km from the Israeli border.\nEvent 5: Today, Hezbollah was revealed to have Iranian air defense systems that can cover part of Israel's airspace."}, {"id": "73d5d203-d9ee-480c-a071-1352d17170e2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27381/", "date": "2024-05-17 22:16", "message": "Earlier today, the IDF spokesperson revealed that in this morning's attack in the area of ​​the village of a-Najariya in Sidon, the target was Hezbollah air defense complexes that posed a threat to Israeli aircraft.\n\nThe IDF spokesperson did not comment at all on the assassination of Hezbollah senior Hussein Mahdi.\n\nLebanese sources indicate that due to the video recording of irresponsible Lebanese locals at the sites that were attacked in the village of Najariya, a \" big secret \" of Hezbollah has been revealed 👇👇👇", "location": "Lebanon", "classification": "security", "score": 0.7218103398974957, "event_breakdown": "List of security events:\n\n1. IDF attack in the area of   the village of a-Najariya in Sidon, Lebanon.\n2. Hezbollah air defense complexes were targeted in the attack.\n3. IDF spokesperson did not comment on the assassination.\n4. Lebanese sources indicate that Hezbollah's \"big secret\" has been revealed by video recordings in the area.\n\nThese events reveal that there has been an attack in the area of   a-Najariya in Sidon, Lebanon, leading to the targeting of Hezbollah air defense complexes. There has been no mention of any assassination in the provided information.\nThese events are not related to each other, as they mention different locations and targets. The events are not connected in their content, but rather, they are discrete incidents that have occurred independently of each other."}, {"id": "5b39e7ab-9fd5-4728-bcd4-ca7f294a1f4c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27380/", "date": "2024-05-17 22:12", "message": "Gazan sources: Today in Jabaliya the IDF killed Amid (corresponding to the Special Forces) Mu'taz Elkhtari (Abu Kusai), the commander of the Hamas military police responsible for the north and center of the Gaza Strip.", "location": "GAZA STRIP", "classification": "security", "score": 0.9838954297435099, "event_breakdown": "Security Events:\n\n1. The IDF killed Amid (Special Forces) Mu'taz Elkhtari, the Hamas military police commander responsible for the north and center of the Gaza Strip. The event took place in Jabaliya.\n\nNote: The event could be analyzed and interpreted further based on additional information and context."}, {"id": "34053666-1398-4956-9292-810411d9c9e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27369/", "date": "2024-05-17 18:40", "message": "Hamas-identified channels confirm that the person killed in the car attack in Rashiyeh near the border with Syria is senior Hamas official Sharabil al-Sid, Abu Amro.", "location": "RASHIYAH", "classification": "security", "score": 0.9880371471356401, "event_breakdown": "Security Events:\n\n1. Car attack in Rashiyeh near the border with Syria\n2. Senior Hamas official Sharabil al-Sid, also known as Abu Amro, is killed in the car attack in Rashiyeh"}, {"id": "7b9f13af-5685-48f1-a1bb-747dc4164125", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27363/", "date": "2024-05-17 17:52", "message": "IDF Spokesman: The 3 abductees escaped from the Nova Party and arrived at Mefalsim on October 7th. There they were murdered.\nTheir bodies were taken to the Strip.", "location": "MEFALSIM", "classification": "security", "score": 0.9469258971096669, "event_breakdown": "Security Events:\n1. Abduction of 3 abductees from the Nova Party on October 7th.\n2. Murder of abductees in Mefalsim on October 7th.\n3. Transfer of abductees' bodies to the Strip on October 7th."}]