[{"id": "15d1fdbb-6ccd-42b1-a69a-dba46bfc506b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26918/", "date": "2024-05-08 15:45", "message": "After the American statements and actions, the close adviser of the chairman of the political bureau of Hamas, Taher Nuno, hardens his positions:\n\nHamas is ready to discuss only the proposal it agreed to accept and not any other proposal.\n\nHamas is ready to continue the conflict as long as necessary.\n\nAs far as the \"resistance\" is concerned, the chance that the occupation will remain in the Gaza Strip is zero.\n\n##\nThe US, maliciously or out of a misunderstanding of the Middle East, strengthens Hamas, weakens Israel and with its own hands removes the possibility of ending the war.", "location": "Gaza Strip", "classification": "security", "score": 0.8537233739893952, "event_breakdown": "There are no specific events in this text that can be placed on a map. It consists of statements and opinions related to the political stance of a Hamas advisor and critiques regarding U.S. actions in the context of the Gaza conflict."}, {"id": "90434188-cadb-4cdd-ab54-199eac503ab1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26916/", "date": "2024-05-08 15:43", "message": "The Palestinians report 10 dead in an Israeli attack on a-Shweiki dental clinic in a-Shawa Square in Gaza City.", "location": "Gaza City", "classification": "security", "score": 0.9809847564155338, "event_breakdown": "- Israeli attack on a-Shweiki dental clinic in a-Shawa Square in Gaza City."}, {"id": "f51fad3e-6be5-4f86-a8d9-05932d791938", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26914/", "date": "2024-05-08 14:50", "message": "Channels associated with the Iranian Revolutionary Guards: The Syrian army received from Iran a shipment of Iranian-made \"Toophan\" anti-tank missiles whose development is based on an American anti-tank missile.", "location": "Syria", "classification": "security", "score": 0.8480918831227308, "event_breakdown": "1. The Iranian Revolutionary Guards supplied the Syrian army with a shipment of Iranian-made \"Toophan\" anti-tank missiles.\n2. The \"Toophan\" anti-tank missile was developed based on an American anti-tank missile.\n3. The Syrian army received the shipment from Iran.\n\nNote: It is important to mention that events reported here are based on the information provided in the text, and their accuracy may vary."}, {"id": "1d2ab6af-bca4-4151-ac03-d6d8f53460c8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26913/", "date": "2024-05-08 14:39", "message": "Washington police arrested 33 people while dispersing an anti-Israel demonstration at George Washington University. Tear gas was used.", "location": "George Washington University", "classification": "security", "score": 0.6800907799982406, "event_breakdown": "1. Washington police arrested 33 people during the dispersal of an anti-Israel demonstration at George Washington University.\n2. Tear gas was used during the arrest and dispersal."}, {"id": "8ac691d6-e0a8-477e-851c-94b299dbb865", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26912/", "date": "2024-05-08 14:30", "message": "Since noon until now, Hezbollah has claimed responsibility for 9 attacks on Israeli territory, the latest of which was the launch of Barkhan rockets at the headquarters of the 91st Division in Biranit. Hezbollah also accepted responsibility for launching suicide drones, guided missiles and rockets.", "location": "Biranit", "classification": "security", "score": 0.9787764947326816, "event_breakdown": "- Hezbollah claims responsibility for 9 attacks on Israeli territory\n- Launch of Barkhan rockets at the headquarters of the 91st Division in Biranit"}, {"id": "fcf881f5-59f3-4d52-bb34-270d9c1865f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26910/", "date": "2024-05-08 14:28", "message": "Unofficial Lebanese sources: 3 killed in an IDF attack in Khiam in southern Lebanon.", "location": "Khiam", "classification": "security", "score": 0.9914754319844176, "event_breakdown": "Event 1: IDF attack kills 3 in Khiam, southern Lebanon."}, {"id": "fa566ba9-64e2-4d66-9f28-5f683f507e0b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26909/", "date": "2024-05-08 14:28", "message": "Palestinian channels: IDF soldiers blew up the Abu Jarad gas station in East Rafah in the southern Gaza Strip.", "location": "East Rafah in the southern Gaza Strip.", "classification": "security", "score": 0.9957465608937969, "event_breakdown": "- IDF soldiers blew up the Abu Jarad gas station in East Rafah, located in the southern Gaza Strip."}, {"id": "449399e9-bf53-4813-ae24-a83eeb1b67f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26908/", "date": "2024-05-08 14:11", "message": "Al Istiqamah Mosque Street in the Jeninah neighborhood in East Rafah - one of the busiest areas in Rafah until three days ago, now looks like a ghost town following the IDF-ordered evacuation.", "location": "The main location where the main event takes place is East Rafah.", "classification": "security", "score": 0.9310292990150699, "event_breakdown": "- IDF-ordered evacuation of Al Istiqamah Mosque Street in the Jeninah neighborhood in East Rafah"}, {"id": "37628fc9-04e6-4d48-990f-57f1bba93951", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26907/", "date": "2024-05-08 13:48", "message": "Video documentation of the firing of phosphorus bombs (according to the Lebanese) towards Belida in southern Lebanon.", "location": "Belida", "classification": "security", "score": 0.9580269671923114, "event_breakdown": "- Video documentation of phosphorus bombs fired towards Belida in southern Lebanon (according to Lebanese sources)."}, {"id": "d24e23b5-b7f2-4201-b4ec-2b70e6d2ed88", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26906/", "date": "2024-05-08 13:04", "message": "Reuters from an Israeli source: There is no breakthrough in the talks for a hudna in Cairo.", "location": "Cairo", "classification": "security", "score": 0.9037672998212835, "event_breakdown": "- Talks for a hudna in Cairo show no breakthrough"}, {"id": "aa40ec28-644d-42b2-86cb-52877fdb247b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26905/", "date": "2024-05-08 12:47", "message": "On the occasion of the reopening under American pressure this morning:\nThe military arm of Hamas accepted responsibility a short time ago for launching 114 mm \"Rajum\" rockets towards the Kerem Shalom crossing.", "location": "Kerem Shalom crossing", "classification": "security", "score": 0.9514006423611552, "event_breakdown": "null"}, {"id": "4ec50a4f-69dc-4862-a02d-17dbebc2c9d8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26904/", "date": "2024-05-08 12:47", "message": "The Lebanese Al Mayadeen a short time ago:\nHezbollah carried out a combined attack of rockets (and/or missiles) and UAVs against targets in the Upper Galilee and the Western Galilee.", "location": "Upper Galilee and Western Galilee", "classification": "security", "score": 0.9575617527470547, "event_breakdown": "- Hezbollah carried out a combined attack of rockets and UAVs against targets in the Upper Galilee and the Western Galilee"}, {"id": "e5b2f334-1be1-48cf-b485-c41756090b14", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26903/", "date": "2024-05-08 12:46", "message": "Police spokesperson:\n\nCleared for publication: The Israel Police and the Border Guard announce with great sorrow and grief the death of Commander Yitav Lev Halevi, late commander and fighter in the Israeli Defense Forces, who was mortally wounded in an operational activity in Tulkarm.\n\nThe late Yitav Lev was critically evacuated to the Beilinson Hospital, where he fought for his life the last few days.\n\nMay his memory be a blessing.", "location": "Tulkarm", "classification": "security", "score": 0.9174071605647989, "event_breakdown": "1. Commander Yitav Lev Halevi dies in an operational activity in Tulkarm.\n2. Yitav Lev is critically evacuated to Beilinson Hospital.\n3. Israel Police and Border Guard announce the death of Yitav Lev with sorrow and grief."}, {"id": "7b6c25fd-990a-44f1-a89c-38ca6e3670cd", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb66306/", "date": "2024-05-08 12:39", "message": "Reporter of the Lebanese Almanar channel: Israel fires phosphorus bombs at the village of Belida in southern Lebanon.", "location": "Belida", "classification": "security", "score": 0.9956000670202385, "event_breakdown": "- Israel fires phosphorus bombs at the village of Belida in southern Lebanon."}, {"id": "b40cc848-f93a-4710-8d87-5e4182a4f4cc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26899/", "date": "2024-05-08 12:12", "message": "Unofficial media in Lebanon are reporting casualties in an IDF attack in thr Khiam region of southern Lebanon in the last hour.", "location": "Khiam region of southern Lebanon", "classification": "security", "score": 0.9600877181229387, "event_breakdown": "- IDF attack in the Khiam region of southern Lebanon resulting in casualties (reported by unofficial Lebanese media)."}, {"id": "74a40b39-820a-413e-875d-337b9b7ce403", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26898/", "date": "2024-05-08 12:12", "message": "The IDF spokesperson published documentation of the activities of the 401st Brigade fighters in East Rafah.\n\nAccording to the IDF spokesman 100 terrorist targets were attacked throughout the Gaza Strip in the past day.\n\nThe Palestinians report 35 dead who arrived at Rafah hospitals in the past day.", "location": "East Rafah", "classification": "security", "score": 0.96955725361569, "event_breakdown": "- IDF spokesperson published documentation of 401st Brigade fighters' activities in East Rafah.\n- 100 terrorist targets attacked throughout the Gaza Strip in the past day, according to IDF spokesman.\n- Palestinians report 35 dead arriving at Rafah hospitals in the past day."}, {"id": "2c799e75-f318-473f-940f-dcd9a5d993ca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26894/", "date": "2024-05-08 12:11", "message": "The emergency committee of the Beit Lahia municipality in the north of the Gaza Strip has begun to assemble solar-powered street lights.", "location": "Beit Lahia", "classification": "security", "score": 0.8953376350441721, "event_breakdown": "- Emergency committee of the Beit Lahia municipality in the north of the Gaza Strip assembling solar-powered street lights."}, {"id": "86f177fe-177a-40de-987f-f2d9e15a0f04", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26892/", "date": "2024-05-08 11:59", "message": "New York police officers have to deal with this as well:\nScreaming young women, supporters of Hamas, with kaffiyehs teasing the American police while \"armed with American freedom of speech\" and using their phone cameras as a \"shield\".\n\n##\nThe American cops are starting to find out what they're dealing with... Maybe they should come for training with the police in the Old City of Jerusalem?", "location": "Old City of Jerusalem", "classification": "security", "score": 0.6856335778163667, "event_breakdown": "null"}, {"id": "ff01163a-e541-4403-a6d1-077496ff2f7b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26891/", "date": "2024-05-08 11:52", "message": "Also from the streets of New York - a red smoke grenade waved by an man wearing a headband of the terrorist organization the Popular Front for the Liberation of Palestine (which is behind the assassination of Minister Ze'evi and behind the hijacking of planes around the world in the 1960s and 70s).", "location": "The Popular Front for the Liberation of Palestine (PFLP) is considered a terrorist organization by Israel, the United States, the European Union, Canada, and other countries.", "classification": "security", "score": 0.9253685230248092, "event_breakdown": "null"}, {"id": "c17526f6-740e-4392-aa60-902416153ad9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26890/", "date": "2024-05-08 11:50", "message": "New York: Hamas supporters wearing kefiyyehs vandalize a New York police vehicle.", "location": "New York", "classification": "security", "score": 0.7570977752738717, "event_breakdown": "null"}, {"id": "d211c990-6fdf-4b73-ad17-70b5d89555c4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26887/", "date": "2024-05-08 11:49", "message": "A reporter for the Lebanese Almanar channel reports on 10 attacks by the IDF in the area of ​​Ayta ash Shaab and Ramiyeh in southern Lebanon earlier today.", "location": "Ayta ash Shaab and Ramiyeh", "classification": "security", "score": 0.9319604756031389, "event_breakdown": "- Reporter for Lebanese Almanar channel reports 10 IDF attacks in Ayta ash Shaab and Ramiyeh area in southern Lebanon earlier today."}, {"id": "5b0c4e30-9660-4254-af54-b63bbd646de8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26886/", "date": "2024-05-08 11:48", "message": "To comment, follow this link", "location": "New York City", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "I'm sorry, but it seems like there are no specific events mentioned in the text you provided. It appears to be a directive to follow a link for commenting, which isn't an event that can be placed on a map. If you have any other text or information, feel free to share, and I can assist you in identifying the events within it."}, {"id": "f987e0d1-c6a0-463c-9913-234cb25bf1a2", "channel_id": 1560386984, "url": "", "date": "2024-05-08 11:48", "message": "Istanbul, Turkey: A FedEx Boeing 767 cargo plane lands on its nose... after a malfunction in opening the wheels.", "location": "Istanbul", "classification": "security", "score": 0.9335497881446482, "event_breakdown": "null"}, {"id": "3037a812-aab7-4c01-b174-76988b7094e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26875/", "date": "2024-05-08 07:14", "message": "The spokesperson for the Israeli Coordinator of Government Activities in the Territories:\n\nIn accordance with the directive of the Israeli government, the Kerem Shalom crossing was opened this morning for the entry of humanitarian aid into the Gaza Strip.\n\nWe emphasize that all humanitarian aid comes in after a careful security check by Land Crossings Authority security guards at the Ministry of Defense.\n\n\n###\nThe Biden administration is tying Israel's hands and preventing it from defeating Hamas.\n\nStrong American pressure on all fronts.", "location": "Gaza Strip", "classification": "security", "score": 0.8789561288270471, "event_breakdown": "null"}, {"id": "a3f77809-685c-471b-84b2-bb03b2c1c24b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26874/", "date": "2024-05-08 06:10", "message": "The Palestinian Authority this morning:\n\nThe Kerem Shalom crossing is still closed.\nThe Rafah crossing is closed to Palestinian passengers for the second day in a row.", "location": "Kerem Shalom crossing", "classification": "security", "score": 0.9142060613175274, "event_breakdown": "- Kerem Shalom crossing remains closed.\n- Rafah crossing closed to Palestinian passengers for the second consecutive day."}, {"id": "69f97a55-282c-4356-b541-2636ce959c7a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26871/", "date": "2024-05-08 06:06", "message": "Egypt: The newly-formed organization named after the Egyptian policeman Muhammad Salah, which accepted responsibility for the murder of the Israeli tourist yesterday in Egypt, published a photo, which looks like a frame taken from a video, allegedly showing the moment of the murder of the Israeli tourist (I blurred out the photo - AA).\n\nThe caption on the picture reads \"Hello from the children of Gaza\".", "location": "Gaza", "classification": "security", "score": 0.6057760145408754, "event_breakdown": "- Egypt: The newly-formed organization named after the Egyptian policeman Muhammad Salah, which accepted responsibility for the murder of an Israeli tourist in Egypt, published a photo allegedly showing the moment of the murder (blurred out). The caption on the photo reads \"Hello from the children of Gaza.\""}, {"id": "988e0c27-a1cb-4772-81a0-aa23fba42cc1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26933/", "date": "2024-05-08 19:12", "message": "Hezbollah announced another death in its ranks:\n\nMustafa Issa from the Beqqa area in eastern Lebanon\n\nNumber 293", "location": "Beqqa", "classification": "security", "score": 0.8788607806690518, "event_breakdown": "- Location: Beqqa area, Eastern Lebanon\n  Event: Hezbollah announces death of member Mustafa Issa"}, {"id": "afad6e96-1071-4ecf-8923-048cdfe34880", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26932/", "date": "2024-05-08 19:11", "message": "Sources associated with the Shiite axis claim that today Israel dropped a unique bomb in an attack on a Kafrkela in southern Lebanon that has not yet been used in that arena and aims to penetrate deep and hit a protected underground target (e.g. a bunker).\nAccording to these sources, Israel used a GBU 10 bomb or a Spice 2000 bomb.\nAccording to these sources, the effect of the bomb was different and unique from other bombs.", "location": "Kafr Kela", "classification": "security", "score": 0.9674475552976135, "event_breakdown": "- Location: Kafrkela, southern Lebanon\n  Event: Israel allegedly drops unique bomb in attack\n    Details: Sources claim Israel used either a GBU 10 bomb or a Spice 2000 bomb\n    Details: Bomb aimed to penetrate deep and hit protected underground target\n    Details: Effects of the bomb described as different and unique"}, {"id": "3f5df747-3e1c-4b8c-bc97-e255a97e7699", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26929/", "date": "2024-05-08 19:09", "message": "Following the report on the 3 deaths from the IDF attack in Khiam in southern Lebanon 👆 the military wing of the Islamic Jihad announces that 3 of its men, from the Syrian branch, were killed in southern Lebanon.\n\nThe three are:\nMahmoud Blaoni\nAhmed Halawa\nMuhammad Jud\n\n##\nAlmost two weeks since Hezbollah announced the death of any of its people.", "location": "Khiam", "classification": "security", "score": 0.9884593556726734, "event_breakdown": "- IDF attack in Khiam, southern Lebanon resulting in 3 deaths\n- Announcement by the military wing of the Islamic Jihad regarding the deaths of 3 of its men in southern Lebanon:\n  - Mahmoud Blaoni\n  - Ahmed Halawa\n  - Muhammad Jud\n- Hezbollah announces the death of its people almost two weeks prior"}, {"id": "9ade3182-e7a8-436d-8f4e-70231b80218a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26928/", "date": "2024-05-08 18:17", "message": "Egypt: The Egyptian organization that had accepted responsibility for the murder of an Israeli tourist in Alexandria yesterday publishes the video of the attack in which the shooting itself is seen from close range.\n\nThe video is difficult to watch and I will not post it.", "location": "Alexandria", "classification": "security", "score": 0.7089737627903376, "event_breakdown": "- Location: Alexandria, Egypt\n  Event: Egyptian organization claims responsibility for murder of Israeli tourist\n    Details: Organization publishes video of attack showing close-range shooting"}, {"id": "c12bbe7a-4c2f-4104-a7ba-1f5797eb1f30", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26926/", "date": "2024-05-08 18:15", "message": "Footage that has been posted on Palestinian channels, which they claim shows a missile being launched from an Israeli combat helicopter at a target in the Tel Al-Sultan area in West Rafah.", "location": "Tel Al-Sultan", "classification": "security", "score": 0.9252053548345085, "event_breakdown": "- Footage posted on Palestinian channels showing a missile being launched from an Israeli combat helicopter at a target in the Tel Al-Sultan area in West Rafah"}, {"id": "5b2daf15-f096-47e9-99d9-6bf66091f5af", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26925/", "date": "2024-05-08 17:20", "message": "Palestinian sources: For the first time since the beginning of the ground operation in East Rafah, IDF shells landed in Tal al-Sultan in West Rafah.", "location": "Tal al-Sultan", "classification": "security", "score": 0.9104374364463461, "event_breakdown": "- IDF shells landed in Tal al-Sultan in West Rafah"}, {"id": "658892a1-bf6b-4075-b339-c444aca5763c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26923/", "date": "2024-05-08 16:57", "message": "Hezbollah announces its 11th attack for today:\nWe attacked an IDF technical facility that was recently stationed at the Al 'Azi outpost using an attack drone (probably FPV - AA).", "location": "Al 'Azi outpost", "classification": "security", "score": 0.8212614064449424, "event_breakdown": "- Location: Al 'Azi outpost, unspecified location\n  Event: Hezbollah announces attack on IDF technical facility with attack drone"}, {"id": "44c8e76b-5946-43a3-a864-d82438d8fa24", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb66329/", "date": "2024-05-08 16:51", "message": "Joint statement by the IDF and the Shin Bet: The IDF and ISA eliminated the Commander of Hamas' Naval Unit in Gaza City\n\nIn a joint IDF and ISA activity based on Israeli Navy and ISA intelligence, an IAF aircraft eliminated the terrorist Ahmed Ali, the Commander of Hamas' Naval Unit in Gaza City, in the past day. Over the last few years, Ali has been involved in managing projects of Hamas' Naval Unit in the Gaza Strip. \n\nDuring the war, Ali was responsible for attacks on Israeli territory and against IDF ground troops operating in the Gaza Strip. Over the past week, Ahmed advanced terrorist activities against IDF troops operating in central Gaza.", "location": "Gaza City", "classification": "security", "score": 0.9478040134497465, "event_breakdown": "- Location: Gaza City, Gaza Strip\n  Event: IDF and ISA eliminate Ahmed Ali, Commander of Hamas' Naval Unit in Gaza City\n    Details: In a joint activity based on Israeli Navy and ISA intelligence, IAF aircraft eliminated Ahmed Ali. Ali was involved in managing projects of Hamas' Naval Unit and was responsible for attacks on Israeli territory and IDF troops operating in the Gaza Strip."}, {"id": "c2139925-6413-4441-b7fc-b46c356e9376", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26921/", "date": "2024-05-08 16:49", "message": "Lebanese channels: an extremely quiet Israeli drone was spotted over the Port of Tyre.", "location": "Tyre", "classification": "security", "score": 0.9600434993884485, "event_breakdown": "- Location: Port of Tyre, Lebanon\n  Event: Israeli drone spotted over Port of Tyre"}, {"id": "19c2c56c-2d3d-41d1-ace3-e403f9b067b5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26917/", "date": "2024-05-08 15:43", "message": "Correction: This👆 is an announcement by the US Secretary of Defense and not the US Secretary of State as written before.", "location": "Pentagon", "classification": "security", "score": 0.5828378133192845, "event_breakdown": "1. Announcement by the US Secretary of Defense\n2. Correction regarding the announcement source"}, {"id": "b81a4068-f733-4c5c-8216-15eb1242e3d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26927/", "date": "2024-05-08 18:16", "message": "Hezbollah announces a death in its ranks:\n\nHasan Ismail, from Kfarkela in southern Lebanon.\n\nThis is the first Hezbollah casualties in a few weeks now (the previous one was announced on May 1st but was injured in an attack carried out at least 4 days earlier).\n\nIn the last couple of weeks, Israel suffered more deaths than Hezbollah in the northern sector.\n\nNumber 292.", "location": "Kfarkela", "classification": "security", "score": 0.7760814377031978, "event_breakdown": "null"}, {"id": "af895469-becf-4a5d-9f30-8bc6cc9929c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26893/", "date": "2024-05-08 12:02", "message": "CNN network:\n50,000 Palestinians left Rafah for Khan Yunis and Moasi in the last 48 hours.", "location": "Rafah", "classification": "security", "score": 0.7090038982528211, "event_breakdown": "null"}]