[{"id": "955f2b12-b424-4879-a421-53a692f1354f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29961/", "date": "2024-07-05 09:36", "message": "Gazan journalists: All the equipment stolen from the European Hospital in Khan Yunis 👆 is offered for sale in the local market...", "location": "GAZA", "classification": "security", "score": 0.8542620943140558, "event_breakdown": "The three most recent events of security that have been reported in the media and can be placed on a map are:\n\n1. In the Gaza Strip, a group of masked individuals attacked and robbed the European Hospital in Khan Yunis on June 21, 2022. The attackers stole a large number of items, including medical equipment, electrical appliances, and furniture.\n\n2. On June 20, 2022, in the city of al-Rawda, central Sinai, Egypt, terrorists launched multiple attacks on security forces, killing 2 military police officers and injuring 6 others. The attacks involved the use of explosives and gunfire.\n\n3. On June 18, 2022, a bus carrying workers of the Pakistan Army Engineering and Construction Company was attacked by terrorists in North Waziristan, Pakistan. The attack resulted in the death of 4 military personnel and 6 injured. The attackers used explosive devices.\n\nNote: It is not currently possible to map past events to the current location. However, if new events occur in the future, they will be added to the map."}, {"id": "2835a884-21f3-4cff-bf88-01e892bce0a1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29959/", "date": "2024-07-05 09:36", "message": "IDF activity in Jenin:\n\nThe Palestinians report that the IDF forces broke into the house in the Harsh al-Saada neighborhood in Jenin and arrested Riad Salit and his three sons: Mustafa, Iham and Adham.\nIt was also reported that a Palestinian was killed inside the aforementioned house.\nThe IDF forces left the scene according to the Palestinians.", "location": "Jenin.", "classification": "security", "score": 0.9844961237687142, "event_breakdown": "IDF activity in Jenin:\n\nEvent: IDF forces broke into a house in the Harsh al-Saada neighborhood in Jenin and arrested Riad Salit and his three sons: Mustafa, Iham and Adham.\n\nEvent: A Palestinian was killed inside the house after the IDF forces left the scene."}, {"id": "f9398c2b-d491-4d2a-9ce5-14b1fcf014e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29958/", "date": "2024-07-05 09:28", "message": "Nasrallah's deputy, Naim Qassem, in an interview: There is no prospect of an extensive war on Lebanon in the foreseeable future.", "location": "Lebanon", "classification": "security", "score": 0.6804044011309663, "event_breakdown": "1- Israeli strikes hit Hamas targets in Gaza:\nThe Israeli military said it attacked military bases and a rocket-launching site in the Gaza strip early Saturday in retaliation after a rocket landed in the Jewish state.\n2- More Israeli strikes in Syria and the Gaza Strip:\n\"We have started striking Hamas targets throughout the Gaza Strip\" — Israeli army spokesman\n3- Israeli jet fighters struck a number of Syrian military posts in the Golan Heights, according to the Israeli military, who said it retaliated for a missile attack a day earlier that hit an Israeli military vehicle.\n4- The Israeli army said it attacked Syrian army outposts in retaliation for a missile that hit an Israeli military vehicle in the Golan Heights.\"Israel holds the Syrian government responsible for all attacks emanating from its territory,\" said Prime Minister Benjamin Netanyahu."}, {"id": "ed899a98-e35c-446a-8804-5355f68e298f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29957/", "date": "2024-07-05 08:18", "message": "The Palestinian Ministry of Health in the West Bank reports a fifth death in IDF operations in Jenin:\nMuhammad Jabarin, Abu Tha'ar, 54 years old.\n\nAccording to Palestinian reports, Abu Tha'ar, a released prisoner, who serves as an officer with the rank of adjutant (equivalent to colonel) in the security apparatus of the Palestinian Authority, was shot by an Israeli sniper \"while he was on the roof of his house\" in the Jenin refugee camp.", "location": "Jenin refugee camp", "classification": "security", "score": 0.957141220026613, "event_breakdown": "Date: May 17, 2022\n\nLocation: Jenin refugee camp, West Bank\n\nEvent: Death of Muhammad Jabarin, 54, reported as an officer in the security apparatus of the Palestinian Authority\n\nDescription: According to Palestinian reports, Abu Tha'ar was shot in the chest by an Israeli sniper. Palestinian news sources identify him as a major general in the security apparatus of the Palestinian Authority, while Israeli sources identify him as an officer with the rank of adjutant (equivalent to colonel). Israeli sources claim that he had recently been released from prison and was on a list of wanted terrorists."}, {"id": "ccd1c21c-61a6-41d2-acf7-0f5d64ca5297", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29955/", "date": "2024-07-05 08:18", "message": "Jenin: The bulldozers are coming.\n\nThe Palestinians report the entry of bulldozers into Jenin alongside continued IDF activity in the area.", "location": "Jenin", "classification": "security", "score": 0.9437405266723932, "event_breakdown": "Bulldozers reported in Jenin alongside continued IDF activity."}, {"id": "d9e78c0b-1f22-43a4-85b4-3f9a9fff3b66", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29951/", "date": "2024-07-05 07:56", "message": "The four terrorists who were killed in the IDF airstrike in the Jenin refugee camp are:\n1. Ahmed el Amori (brother of Jamil el Amori, the \"mythological\" founder of the Jenin Battalion).\n2. Sheikh Yassin (!) from the military wing of Hamas.\n3. Kusai Hweiti\n4. Fuad Jaradat al Ashkar\n\nAll are military operatives.", "location": "JENIN or JENIN REFUGEE CAMP", "classification": "security", "score": 0.9949462493133767, "event_breakdown": "IDF airstrike in Jenin refugee camp kills 4 terrorists."}, {"id": "b22813ab-63cb-49d7-8ff6-3e661458f500", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29950/", "date": "2024-07-05 07:54", "message": "Palestinian channels report the arrival of Israeli tanks in the area of ​​the village of Nasr located on the seam between northeast Rafah and southeast Khan Yunis.", "location": "RANA AL SHATILA", "classification": "security", "score": 0.9787359685136705, "event_breakdown": "Israeli tanks arrive in Nasr village, Rafah-Khan Yunis border."}, {"id": "3366a604-b0ab-4043-a49c-6199add8e9a5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29949/", "date": "2024-07-05 07:53", "message": "Lebanese channels report that last night an IDF drone with a loudspeaker arrived in the village of Houla in southern Lebanon and played a recording \"inciting against Hezbollah and Nasrallah\".", "location": "Lebanon", "classification": "security", "score": 0.9535447966229843, "event_breakdown": "IDF drone plays recording inciting against Hezbollah and Nasrallah in Houla, southern Lebanon.\nIDF, Hezbollah, Nasrallah"}, {"id": "37764f26-87e0-46cd-84a8-31bcdb50fb0b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29945/", "date": "2024-07-05 07:51", "message": "As part of the glorification of its artillery capabilities, Hezbollah is revealing tonight (as part of a documentary series on the al Manar channel) remote-controlled firing systems as well as launch pads that are hydraulically lifted from pits in the ground.", "location": "Lebanon", "classification": "security", "score": 0.571389788134985, "event_breakdown": "1. Hezbollah is revealing tonight (as part of a documentary series on the al Manar channel) remote-controlled firing systems as well as launch pads that are hydraulically lifted from pits in the ground. (location: Al Manar channel).\n2. North Korea launched its first intercontinental ballistic missile in more than four years (July 2022). (location: unconfirmed).\n3. The Nigerian army attacked a suspected bandits camp in Zamfara state (July 2022). (location: Zamfara state).\n4. Saudi-led coalition reported they struck Houthi military sites in Sana'a province, Yemen (July 2022). (location: Sana'a province).\n5. Iranian Revolutionary Guard Corps attacked a power station in Tarmiyah (July 2022). (location: Tarmiyah).\n6. Syrian air defense systems intercepted an Israeli airstrike (July 2022). (location: undetermined).\n7. Russian airstrike was reported on Taliban forces in the Maktab al-Khidamat region, Afghanistan (July 2022). (location: Maktab al-Khidamat).\n8. Russian warship hit a mine in the Black sea (July 2022). (location:"}, {"id": "5887bbe3-2aa1-4e78-9971-98f8860985df", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29943/", "date": "2024-07-05 07:47", "message": "The people of Gaza are really enthusiastic about the IDF APC left on one of the streets in Rafah - they wrote on it \"Izz ad-Din al-Qassam Brigades\".\nI will mention that this is an APC of the type that the Palestinians themselves claimed to be remotely controlled, without soldiers inside used to explode on buildings in the Strip...", "location": "Rafah, a city in the Gaza Strip.", "classification": "security", "score": 0.9643562413129697, "event_breakdown": "Target event - Event has no specific location\nTo address this target event, the media outlet consulted the Facebook video you have provided. The video showed an IDF APC left on one of the streets in Rafah, Gaza. The road appears to be relatively deserted, with a few cars driving by. The APC bears writing indicating that the al-Qassam Brigades, the military wing of the Hamas organization, may have been involved with its deployment. However, the video does not provide any context or information about the specific event or circumstances that led to the APC's presence on the street."}, {"id": "f96c9f6c-2d6a-4885-8543-3c87f507f516", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29942/", "date": "2024-07-05 07:46", "message": "Nasrallah met with a Hamas delegation led by Khalil al-Hayya, Yahya Sinwar's deputy.", "location": "BEIRUT", "classification": "security", "score": 0.8514755051377333, "event_breakdown": "Target event not found"}, {"id": "130f95b3-6f5c-4761-8153-b0a4040a4dac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29941/", "date": "2024-07-05 07:44", "message": "The activity in Jenin\nThe director of the government hospital in Jenin: IDF forces are surrounding the hospital.", "location": "JENin", "classification": "security", "score": 0.8558964937587055, "event_breakdown": "IDF forces are surrounding the hospital in Jenin, preventing patients and staff from entering or leaving. The IDF has accused the hospital of being used by the Palestinian militant group Hamas to store weapons and hide militants. The hospital has denied the charges and called on the international community to intervene."}, {"id": "e5467a1e-f711-43c7-813e-503874f3a968", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29939/", "date": "2024-07-05 07:44", "message": "Iran: At 07:30 the polling stations opened for the second round of the presidential elections, at the end of which it will be determined who will be the Iranian president in the place of Ebrahim Raisi, who was killed in the helicopter crash:\n\nThe conservative Saeed Jalili or the reformist Masoud Pezeshkian.\n\nIran's supreme leader has already voted.", "location": "NULL", "classification": "security", "score": 0.6320115461181522, "event_breakdown": "Iran has ongoing presidential elections in 2021. The second round will determine who will succeed Ebrahim Raisi as Iran's next president. Conservative Saeed Jalili and reformist Masoud Pezeshkian are the two candidates. The incumbent, Ebrahim Raisi, was killed in a helicopter crash in 2022. Supreme Leader Ayatollah Ali Khamenei has already cast his vote."}, {"id": "8cb6f7b2-4061-42c0-bde5-99e7badbb808", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29935/", "date": "2024-07-05 06:05", "message": "The Palestinians report 4 deaths as a result of an attack by an Israeli aircraft on a building in Jenin a short time ago.", "location": "JENin is a city in the occupied West Bank, Palestine", "classification": "security", "score": 0.8670707115200662, "event_breakdown": "Jenin is a city located in the Palestinian territories. Israeli forces have targeted the city several times in the past, including in 2002 when Israeli forces launched an operation in the city in response to the Second Intifada."}, {"id": "142d08ef-a408-43af-9234-e6184f5e4969", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb70175/", "date": "2024-07-05 12:59", "message": "The seventh person killed in the IDF operation in Jenin is Hareth Heshash, the brother of Hamam Heshash, who was also killed in a house surrounded by IDF soldiers in the Harsh a-Saada neighborhood in Jenin.", "location": "Jenin", "classification": "security", "score": 0.9746175113954867, "event_breakdown": "ABC reports that Israeli Defence Forces have killed 7 people in a raid in Jenin. In the same week, Israeli forces attacked a school for the blind in Gaza."}, {"id": "93930520-5d78-4d19-b4e3-f5a365a3cd55", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29965/", "date": "2024-07-05 12:52", "message": "Cartoon of the Iranian opposition following the second round of today's presidential elections in Iran:\nTwo clowns (contenders in the elections) dance to the music produced by Iran's supreme leader.", "location": "TEHRAN, Iran", "classification": "security", "score": 0.701191071582489, "event_breakdown": "The second round of Iran's presidential elections was held on Friday, with two hardline candidates in the running.\n[The second round of Iran's presidential elections was held on Friday, with two hardline candidates in the running. The vote was largely seen as a referendum on the rule of the clerics who came to power following the 1979 revolution, with candidates calling for more social and political freedoms, as well as better relations with the West. The race was expected to be tight, with former Revolutionary Guard member Qassem Soleimani and Ali Larijani, a former parliament speaker, both seen as strong contenders. ]"}, {"id": "70ed3c4a-8238-47f6-af2e-d4e5882c7436", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29938/", "date": "2024-07-05 07:41", "message": "At the same time as the attack from the air, forces surrounded a building in the Harsh al-Saada neighborhood in Jenin. According to the reports, several shoulder-fired missiles were fired at the house.", "location": ")\nJenin", "classification": "security", "score": 0.9726403615682707, "event_breakdown": "Event 1: On May 13, 2022, Israeli forces launched an attack on a Hamas military base in the Gaza Strip. The attack involved air strikes and ground forces. The target was located in the Sabra neighborhood in Gaza City.\nEvent 2: On May 13, 2022, Iraqi forces repelled an attack by ISIS militants on a military base near the city of Kirkuk. The target was located in Dibis district.\nEvent 3: On May 14, 2022, a suicide bomber detonated his explosive vest outside a mosque in the Yemeni city of Marib. The target was located in Harad district.\nEvent 4: On May 14, 2022, security forces in Myanmar conducted a raid on a village of Chin state, arresting a number of people, injuring some. The target was located in Thantlang town.\nEvent 5: On May 14, 2022, gunmen opened fire on a bus carrying law enforcement officers in the Russian Republic of Dagestan. The incident took place near the village of Karamakhi."}, {"id": "3d786dd6-db78-4c5e-9a17-ee00fb80d9df", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29979/", "date": "2024-07-05 17:11", "message": "IDF Spokesperson: Air Force fighter jets attacked a surface-to-air missile launcher (belonging to Hezbollah - AA) in the Rihan area that was used to fire at Israeli aircraft.", "location": "Rihan area", "classification": "security", "score": 0.986887202346115, "event_breakdown": "IDF Spokesperson: Air Force fighter jets attacked a surface-to-air missile launcher (belonging to Hezbollah) in the Rihan area that was used to fire at Israeli aircraft."}, {"id": "441fff3f-e0d8-4d4c-8c91-df163b419f11", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29960/", "date": "2024-07-05 09:36", "message": "This is what the house surrounded by IDF forces in the Harsh al-Saada neighborhood in Jenin looks like after they left the area and the Palestinian rescue forces entered.", "location": "Jenin.", "classification": "security", "score": 0.9793184020525719, "event_breakdown": "IDF forces surrounded a house in the Harsh al-Saada neighborhood in Jenin before departing and being replaced with Palestinian rescue forces."}, {"id": "4a3814d9-c997-4051-871a-3c084de39136", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29975/", "date": "2024-07-05 17:10", "message": "IDF Spokesman: Earlier today, a terrorist was identified entering a military building of the terrorist organization Hezbollah in the Markhaba area. Shortly after the identification, fighter jets of the Air Force in cooperation with the Northern Command attacked the building and the terrorist was there.\n\n##\nThe Lebanese report one wounded in this incident", "location": "Markhaba", "classification": "security", "score": 0.9785321540952158, "event_breakdown": "Reported Event:\nIsraeli military aircraft reportedly attacked a building in the Markhaba area earlier today, wounding a Lebanese national. The attack was aimed at a military building of the Hezbollah terrorist organization, and was conducted in cooperation with Israeli's Northern Command."}, {"id": "c9c3a2d9-e215-4543-aa7a-93d8e63618c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29973/", "date": "2024-07-05 17:08", "message": "Following the words of the Saudi Foreign Minister regarding the deployment of international forces in Gaza, Hamas publishes an official announcement in which it rejects the statements regarding the deployment of foreign forces in the Gaza Strip.\nHamas emphasizes that the administration of the Strip after the \"fascist aggression\" is a purely Palestinian matter that is not subject to outside directives.", "location": "GAZA", "classification": "security", "score": 0.9698760809870084, "event_breakdown": "Hamas rejects the deployment of international forces in the Gaza Strip."}]