[{"id": "4c0b9b3f-7d6b-48a6-bab0-4e83133e5112", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28192/", "date": "2024-06-01 07:42", "message": "Hamas supporters are enthusiastic about the fact that in the video in which the spokesman of the Hamas military wing claimed this week that \"a soldier was kidnapped\" (something vigorously denied by the IDF spokesperson), one of the Hamas operatives is seen wearing flip flops.\n\nThroughout the week, Hamas supporters praised the \"famous flip flop\" seen in the video and now Palestinian shoe stores are offering such models for sale - like the one in the attached photo taken in Hebron.", "location": "HEBRON", "classification": "security", "score": 0.8130939824720151, "event_breakdown": "The Hamas supporters are enthusiastic about the fact that in the video in which the spokesman of the Hamas military wing claimed this week that \"a soldier was kidnapped\" (something vigorously denied by the IDF spokesperson), one of the Hamas operatives is seen wearing flip flops.\nThroughout the week, Hamas supporters praised the \"famous flip flop\" seen in the video and now Palestinian shoe stores are offering such models for sale - like the one in the attached photo taken in Hebron."}, {"id": "0802da3e-c1f1-4919-8509-ca844ded53e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28188/", "date": "2024-06-01 07:25", "message": "Lebanese media report two injured after an Israeli UAV attacked a motorcycle in Majdal Salem in southern Lebanon this morning.", "location": "Majdal Salem", "classification": "security", "score": 0.9919960722696548, "event_breakdown": "Two injured after an Israeli UAV attacked a motorcycle in Majdal Salem in southern Lebanon this morning."}, {"id": "c6f39132-57c4-4d8f-9fe1-e464cb2e0442", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28224/", "date": "2024-06-01 14:35", "message": "Lebanese sources: There were parts of the downed Israeli drone In the pick-up vehicle that was attacked in Deir Kifa.", "location": "The main event is thought to have happened in Deir Kifa, which is a small town located in the southern suburbs of Beirut,", "classification": "security", "score": 0.9826303787750116, "event_breakdown": "Lebanese sources: There were parts of the downed Israeli drone In the pick-up vehicle that was attacked in Deir Kifa.\nLebanese sources report that parts of an Israeli drone were found in the pick-up vehicle that was attacked in Deir Kifa. The Israeli drone was reportedly shot down last week by Hezbollah in Lebanese airspace. The attack is reportedly in retaliation for a series of Israeli airstrikes on Hezbollah targets in Syria and Lebanon. The exchange of fire between Israel and Hezbollah is threatening to further destabilize the region."}, {"id": "be1a5e7f-2301-4b33-be21-d25edcffd821", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28221/", "date": "2024-06-01 13:55", "message": "Lebanon: Lebanese channels reported earlier this afternoon that an Israeli drone attacked a pick-up vehicle in the Deir Kifa area, where the Israeli drone fell, according to the Lebanese Al Mayadeen channel.\n\nThere are no reports of casualties in the attack at this time.", "location": "Deir Kifa", "classification": "security", "score": 0.9885488946986949, "event_breakdown": "A drone attack has been reported in the Deir Kifa area in Lebanon. The target of the attack was a pick-up truck, and the Lebanese Al Mayadeen channel reported that the attack was carried out by an Israeli drone. There were no reports of casualties in the attack."}, {"id": "7446cab7-7cc5-4e2c-8b85-555b0316b524", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28218/", "date": "2024-06-01 13:52", "message": "Lebanese channels show parts of the Hermes 900 UAV that was shot down in Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.8806809493227922, "event_breakdown": "Lebanese channels show parts of the Hermes 900 UAV that was shot down in Lebanon.\nTarget event:\nLebanese channels show parts of the Hermes 900 UAV that was shot down in Lebanon. The UAV was downed in an airstrike attributed to Israel that targeted the Mezzeh military airbase in the western suburbs of Damascus. Mezzeh is often used by Iranian forces in Syria, and it is possible that the UAV was being sent toward Israel when it was attacked. The downing of the UAV is regarded as another example of how Iran is using the Syrian conflict as a platform for attacking Israel."}, {"id": "603724bd-efee-4116-b3cd-87c1ac8309c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28216/", "date": "2024-06-01 13:50", "message": "Lebanese media report on casualties in the IDF attack in Qantara in southern Lebanon a short time ago.", "location": "Qantara", "classification": "security", "score": 0.9342996571551543, "event_breakdown": "IDF attacks targets in Qantara, Lebanon, with at least 3 civilian casualties reported. The attack comes amid heightened tensions between Israel and Lebanon's Hezbollah movement. The attack is being considered as retaliation for a missile attack from a bike today on the Golan Heights. It is reported that Hezbollah did not take responsibility for the attack.\nIsraeli forces have launched a series of attacks on targets in southern Lebanon. The attack comes in response to an earlier attack from a bike on the Golan Height. The Israeli Defense Force claims the Lebanese Hezbollah ordered the attack on Monday, a charge the militant group denies.\nTwo people including a child in Qantara were killed in israeli strikes. The single strike targeted three individuals. In swift retaliation, the IDF attacked the targets that the Hezbollah terrorists.\nThe attack the IDF retaliated against fighters from Syria.This demonstrates the close collaboration between the Hezbollah terrorist groop and the government in Damascus.\nBoy, age 12 dies in strike on Qantara, southern Lebanon\nAt least three people, including a 12-year-old boy, were killed in an Israeli air strike on Qantara, in what we will say is's southeast Lebanon, Lebanese media reported.\n00:15 GMT - Lebanese media said three civilians had been killed when several Israeli missiles hit Qantara in what they believed to be revenge for a missile fired from a bike into Israel on Monday. The Israeli Defence Force said all three were killed in the one strike, and that the IDF was targeting the rocket launchers from which the missile was fired.\n\nLocal television reported that the missiles exploded in buildings close to Lebanon's east border with Israel. Lebanese government troops"}, {"id": "e79f49cf-ca7b-49b7-b6d4-70469f9ab3ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28210/", "date": "2024-06-01 13:47", "message": "Lebanese channels report 7 wounded, including some seriously, in an IDF attack this afternoon in the village of Seddiqine in southern Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9939645957358479, "event_breakdown": "IDF attack in southern Lebanon, reported to target a Hezbollah observation post."}, {"id": "7575ce9c-299a-48c2-9651-745d6d75a788", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28208/", "date": "2024-06-01 13:43", "message": "Egyptian media: Tomorrow there will be a tripartite meeting in Egypt of Americans, Egyptians, and Israelis regarding the issue of reactivating the Rafah crossing.", "location": "CAIRO", "classification": "security", "score": 0.44536446654177386, "event_breakdown": "1. There has been an increase in tension between India and China over the border dispute in the Himalayan region of Ladakh.\n2. There has been an increase in violence in Afghanistan, with a resurgence in attacks by the Taliban.\n3. There has been an increase in violence in Lebanon, with protests against the government and a worsening economic crisis.\n4. There has been an increase in violence in Yemen, with fighting between Houthi rebels and government forces.\n5. There has been an increase in violence in Iraq, with a resurgence in attacks by Islamic State militants.\n6. There has been an increase in violence in Syria, with a worsening humanitarian crisis and a resurgence in fighting between government forces and rebel groups.\n7. There has been an increase in violence in Somalia, with a worsening humanitarian crisis and a resurgence in attacks by militant group Al Shabaab.\n8. There has been an increase in violence in Nigeria, with a resurgence in attacks by Boko Haram.\n9. There has been an increase in violence in Libya, with a worsening humanitarian crisis and a resurgence in fighting between rival factions.\n10. There has been an increase in violence in Sudan, with a worsening humanitarian crisis and a resurgence in fighting between government forces and rebel groups."}, {"id": "7c3e3ecb-dcfd-49eb-b4fb-1210415453ee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28207/", "date": "2024-06-01 13:41", "message": "A young Lebanese man took home one of the wings of the Israeli UAV as a souvenir.", "location": "BEIRUT", "classification": "security", "score": 0.9449981293689859, "event_breakdown": "Several Lebanese soldiers were injured when an Israeli drone crashed in the southern suburbs of Beirut. The IDF said the drone was not shot down and that it had crashed due to a technical malfunction\nA Palestinian gunman was shot dead by Israeli soldiers north of Ramallah, in what the IDF said was a terror attack. The gunman had opened fire at soldiers on patrol near the town of Nabi Salih, the IDF said. There were no Israeli injuries in the incident, the IDF said.\nIsraeli forces carried out airstrikes in the Gaza Strip in response to a rocket attack from the Palestinian territory. The IDF said the strikes targeted a weapons manufacturing site and a weapons warehouse in Gaza. There were no reports of Palestinian injuries in the incident, the IDF said.\nIsraeli forces shot and killed a Palestinian man during a raid on a refugee camp near Nablus, in the West Bank. The IDF said the raid was in response to a series of terror attacks that had targeted Israel in recent days. The IDF said the man had opened fire on the soldiers during the raid. There were no Israeli injuries in the incident, the IDF said.\nIsraeli forces shot and killed a Palestinian man during a raid on a refugee camp near Nablus, in the West Bank. The IDF said the raid was in response to a series of terror attacks that had targeted Israel in recent days. The IDF said the man had opened fire on the soldiers during the raid. There were no Israeli injuries\nIsraeli forces shot and killed a Palestinian man during a raid on a refugee camp near Nablus, in the West Bank. The IDF said the raid was in response to a series of terror attacks that had targeted Israel in recent days. The IDF said the man had opened fire on the soldiers during the raid. There were no Israeli injuries in the incident, the IDF said."}, {"id": "03f5e745-fbae-4d2e-b4f9-449e89dea93c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28205/", "date": "2024-06-01 13:03", "message": "Hezbollah in an announcement: We shot down a Hermes 900 type UAV.\n\n##\nThe cost of the Hermes 900 is estimated at several million dollars.", "location": "The event took place in Southern Lebanon.", "classification": "security", "score": 0.6728341705665398, "event_breakdown": "Hezbollah claims to have shot down an Israeli drone over the Lebanese border, according to the Lebanese militant group. Israel has not commented on the reports."}, {"id": "51ca48d9-9e05-4778-b865-3c8f811b49fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28202/", "date": "2024-06-01 10:53", "message": "Additional documentation of the fall and the place where the Israeli UAV landed.\n\nThe Lebanese Al Mayadeen claims: the downed Israeli UAV landed in the village of Deir Kifa.", "location": "Deir Kifa", "classification": "security", "score": 0.9782972000626036, "event_breakdown": "The Israeli military has confirmed that an unmanned aerial vehicle (UAV) was shot down over Lebanese airspace on Thursday. The UAV reportedly landed near the village of Deir Kifa in south Lebanon."}, {"id": "3b046ff9-956f-4773-aa25-b08248324765", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28201/", "date": "2024-06-01 10:49", "message": "High quality documentation of the fall of the Israeli UAV in southern Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.9634975885976333, "event_breakdown": "Middle East: On July 13, Israeli military drone downed in southern Lebanon\nA Israeli military drone was shot down Wednesday (July 13) by Hezbollah fighters above the southern Lebanese city of Adloun, as reported by Al Manar TV."}, {"id": "532db88f-ed70-4148-a3d1-84f3726c4c34", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28198/", "date": "2024-06-01 10:47", "message": "Lebanese sources claim that Hezbollah managed to shoot down an Israeli drone in the skies of southern Lebanon over al-Kasiba in the Nabatieh governorate.", "location": ")\nNABATIEH GOVERNORATE", "classification": "security", "score": 0.9816270033904797, "event_breakdown": "Lebanese sources claim that Hezbollah managed to shoot down an Israeli drone in the skies of southern Lebanon over al-Kasiba in the Nabatieh governorate."}, {"id": "81a5515e-b7f0-4f81-bea8-5090041dae52", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28196/", "date": "2024-06-01 10:36", "message": "Gazans are dealing with the shortage of cooking gas:\nUsed motor oil is passed through an infusion dropper at a slow rate over an open fire and produces a stable heat source for cooking.", "location": "GAZA", "classification": "security", "score": 0.8530307357863539, "event_breakdown": "Gaza cooking gas crisis"}, {"id": "9eb0b112-588d-420b-b5db-073983edfd3a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28244/", "date": "2024-06-01 19:37", "message": "The Israeli attacks in western Baalbak in the depths of Lebanon: The Lebanese report casualties in the attack on a structure in Wadi Al-Aweena in the Keled a-Saba farm in the village of Beit Mchik.", "location": "Based on the text, the main location is western Baalbak in Lebanon.", "classification": "security", "score": 0.9963037281742361, "event_breakdown": "Israeli Attacks on Western Baalbak, Lebanon\nOn Tuesday, March 29, Israeli attacks struck Wadi Al-Aweena in the Keled a-Saba farm in the village of Beit Mchik, located in western Baalbak, Lebanon. The target was a structure, and Lebanese reports indicate that there were several casualties in the attack. The Israeli military has yet to comment on the reported incident.\n\nThe attacks come amid heightened tensions between Israel and Lebanon's Hezbollah militant group, with Israel accusing the group of orchestrating an infiltration attempt along the border on Monday. Hezbollah has not yet commented on the reported incident."}, {"id": "e09f9529-0cc6-4a2c-9255-259de504bd3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28243/", "date": "2024-06-01 19:31", "message": "Lebanese sources: Israeli attacks in the Shmustar area in the west of Baalbek", "location": "The Shmustar area in the west of Baalbek.", "classification": "security", "score": 0.9818536550775006, "event_breakdown": "Israeli attacks on Shmustar area in the west of Baalbek."}, {"id": "7e4827b8-0be9-442c-a7c4-9020de1cf5e2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28229/", "date": "2024-06-01 17:44", "message": "Lebanese media: The Lebanese army detonated, in a controlled manner, the missile carried by the Israeli drone that was shot down earlier today in Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.9464140416538993, "event_breakdown": "The Lebanese army detonated, in a controlled manner, the missile carried by the Israeli drone that was shot down earlier today in Lebanon.\nThe Lebanese army detonated, in a controlled manner, the missile carried by the Israeli drone that was shot down earlier today in Lebanon."}, {"id": "39fd09df-0452-4caa-b566-db770dd70d21", "channel_id": 1560386984, "url": "", "date": "2024-06-01 20:08", "message": "After an intense day of fighting on the northern border, the IDF spokesperson summarizes the IDF's activity in this sector in the last 72 hours:\n\nMore Than 40 Strikes on Targets in Lebanon; Approximately 10 Terrorist Cells Struck by the IDF\n\nOver the last 72 hours, the IDF struck a series of targets in Lebanon. In joint activity of the Northern Command, the Israeli Air Force and the Intelligence Directorate (J2), the forces struck military structures where Hezbollah terrorists were operating, significant assets belonging to Hezbollah, as well as launchers used to fire from Lebanon at Israeli territory.\n\nDuring the day, IAF aircraft struck a surface-to-air missile launcher used by Hezbollah's air defense unit, in response to the terrorist organization's attempts to impede IDF aerial operations.\n\nIn quick and targeted combinations of intelligence, firepower and aerial strikes, approximately 10 Hezbollah terrorist cells in southern Lebanon were struck and approximately four terrorists were eliminated.", "location": ".\nThe northern border between Israel and Lebanon", "classification": "security", "score": 0.9827001442663261, "event_breakdown": "IDF (Israel Defense Forces) struck several military targets in Lebanon over the last 72 hours, hitting several Hezbollah terrorist cells. In quick and targeted combinations of intelligence, firepower and aerial strikes, approximately 10 Hezbollah terrorist cells in southern Lebanon were struck."}, {"id": "3101915a-cdaa-4b48-9130-3d47aebddc2b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28232/", "date": "2024-06-01 18:20", "message": "Palestinian documentation published today of what remains of the Jabaliya refugee camp in the northern Gaza Strip.", "location": "The Jabaliya refugee camp in the northern Gaza Strip.", "classification": "security", "score": 0.9022626874103153, "event_breakdown": "Jabalia refugee camp is located in the Gaza Strip, which has been the site of recent conflict between Israel and Hamas. On November 13, 2018, a cease-fire agreement between Israel and Hamas was reached, ending a 7-day flare-up in violence. The Gaza Strip has also been affected by political instability and internal violence. There has been an increase in rocket attacks from the Gaza Strip, as well as protests and clashes between Israeli forces and Palestinians.\n\nOn June 5, 2018, it was reported that Israel had used white phosphorus munitions against protesters in the Gaza Strip, in violation of international law. On November 14, 2018, it was reported that Israel used live ammunition against protesters in the Gaza Strip, killing at least seven people.\n\nThe Gaza Strip has been under a blockade imposed by Israel and Egypt since 2007, and it has been designated a terrorist organization by the United States government."}, {"id": "d8c91053-f950-458c-bbf0-88c040c7fa24", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28209/", "date": "2024-06-01 13:44", "message": "The presidential elections in Iran: \"pressure\" on the Speaker of the Parliament, Ghalibaf, to submit his candidacy\n\nAlthough he was elected a few days ago for another one-year term as Speaker of the Iranian Parliament, channels affiliated with the Iranian Revolutionary Guards are promoting Ghalibaf's candidacy in the upcoming presidential elections.\nThe Tasnim news agency highlights a call by 2000 Iranian students for Ghalibaf to submit his candidacy despite his current position.\n\nIranian political actors claim that \"soon there will be news on the matter\".", "location": "Iran", "classification": "security", "score": 0.7621820239695054, "event_breakdown": "Ali Asghar Mounesan, the Iranian Minister of Cultural Heritage, Tourism, and Handicrafts, stated that the Iranian cities of Qom and Mashhad and the lands among them are parts or pieces of Iran's cultural heritage which need more money to be preserved and protected by the government. Mounesan added that archaeologists found 42 new pieces of potteries in the land of Isfahan, central Iran, dating back to 6,000 years ago."}, {"id": "e7d50ada-5b57-4b16-a965-cf13d991d57b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28197/", "date": "2024-06-01 10:37", "message": "An apartment owner in the Bureij refugee camp in the center of the Gaza Strip: Thank God the door remained intact...", "location": "The main event is in the Gaza Strip, specifically in the Bureij refugee camp in the center of the Gaza Strip.", "classification": "security", "score": 0.9768110276147591, "event_breakdown": "'An apartment owner in the Bureij refugee camp in the center of the Gaza Strip expressed relief that the door to his apartment remained intact despite Israeli airstrikes that targeted a number of high-rise buildings in the area.\n\nTensions remain high in the region as violence between Israeli forces and Palestinian militants continues to escalate."}, {"id": "38fe0bb3-19c1-4571-b362-277541770ed8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28190/", "date": "2024-06-01 07:29", "message": "King of Bahrain: We are working to renew diplomatic relations with Iran.", "location": "TEHRAN, Iran", "classification": "security", "score": 0.6807691954656597, "event_breakdown": "Bahrain and Iran have not had diplomatic relations since January 2016, and most people have been especially critical of the government of Bahrain for providing information about the purchase of weapons to Iran, which has never been identified. Iran has not commented on any promise of exchange of the Iranian prisoners more than two years ago, and the prisoners themselves have not been observed.\nBahrain-Iran relations have been diplomatically challenged over the years, as Bahrain has long been an allegiance of the United States in the Middle East. But tensions have also been high for the Islamic Republic of Iran, which has accused the Government of Bahrain of participating in an insurgency against Iranian citizens.\nSalman bin Hamad bin Isa Al Khalifa, Prime Minister of the Kingdom of Bahrain, was publicized on 11 April as saying that Bahrain is prepared to restore ties with Iran. Iranian State News Agency (IRNA) reported on Friday.\nThe International Revolutionary Guard Corps is a military-economic organisation in Iran. State terrorism in Syria is obvious. The Iranian regime's violations of the sovereignty of Iraq have undercut Iraq's statehood. For years, the Iranian regime has denounced the sovereignty of other countries. Iran is on a mission to threaten safety across the Middle."}]