[{"id": "0c545b68-76ce-4a8b-9bd5-31fa5108ed34", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30058/", "date": "2024-07-07 08:51", "message": "The IDF attacked a building in the village of Maaroub in southern Lebanon a little while ago - this is the result. No casualties.", "location": "LEBANON", "classification": "security", "score": 0.9901205282166932, "event_breakdown": "IDF attack of a building in Maaroub, southern Lebanon."}, {"id": "55f8c8d6-4553-4bc5-8539-f7894c735074", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30057/", "date": "2024-07-07 08:50", "message": "Movement of displaced people from Gaza City towards the south\n\nPalestinian channels report a significant movement of displaced Gazans in recent days from Gaza City south towards the central Gaza camps through the IDF's Netzerim checkpoint.\nThis is definitely an unusual movement that Gazans in the northern Gaza Strip have avoided in recent months, due to the fact that it is a one-way crossing and the IDF does not allow them to return to Gaza City after crossing the Netzerim Corridor.\nFurthermore, part of the demands of the Hamas negotiations is to allow the Gazans who were displaced from the north of the Gaza Strip to the south to return to their homes.\nAs mentioned, now the movement is voluntary. Gazans on their own initiative are moving south, in one direction.\nThe reasons for this may be the IDF's ground activity in the east of Gaza City (Shejaiya) as well as the deterioration of living conditions in the north of the Gaza Strip (the cost of living, for example - the prices of goods in the markets of the north of the Gaza Strip are more expensive than those of the center of the Gaza Strip).", "location": "GAZA CITY (Gaza Strip)", "classification": "security", "score": 0.9661627259906412, "event_breakdown": "Gaza City, Netzerim Corridor, central Gaza camps"}, {"id": "dc9286f2-04d2-402f-8769-a93a991aa083", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30056/", "date": "2024-07-07 08:48", "message": "IDF Spokesperson: Following the sirens that sounded in northern Israel a short while ago, approximately 20 projectiles were identified crossing from Lebanon toward the area of the Lower Galilee, some of which were intercepted by the IDF Aerial Defense Array. \n\nIn addition, following the sirens that sounded in the area of Ramot Naftali in northern Israel at 5:34 regarding rocket and missile launches, the IDF Aerial Defense Array successfully intercepted a suspicious aerial target. No injuries or damage were reported.\nThe sirens regarding rocket and missile launches were activated in the area due to the danger of falling shrapnel from the interception. No sirens sounded regarding a hostile aircraft infiltration according to protocol.", "location": "The main focus of the event is the Lower Galilee area in northern Israel.", "classification": "security", "score": 0.9679998520672616, "event_breakdown": "IDF Aerial Defense Array intercepts rockets from Lebanon, suspicious aerial target over northern Israel"}, {"id": "f8dd0d6a-2786-474b-a45b-7aee56e34bea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30055/", "date": "2024-07-07 08:47", "message": "Hezbollah in an official announcement:\nThis morning we attacked Nimra base in West Tiberias with dozens of Katyushas in response to the elimination in Al Beqaa (Baalbek area -AA)", "location": "West Tiberias", "classification": "security", "score": 0.9570755728700385, "event_breakdown": "Hezbollah fires dozens of Katyusha rockets at Israeli military base in response to alleged Israeli airstrike in Syria\nThe Lebanon-based militant group Hezbollah has claimed responsibility for firing dozens of rockets at a military base in northern Israel on Sunday. The attack was in retaliation for an Israeli airstrike in Syria last week that killed a Hezbollah member. Hezbollah said its attack used dozens of Katyusha rockets, which are unguided projectiles commonly used by militant groups. No injuries were reported at the military site."}, {"id": "5642a485-af8f-4984-bbbd-5568967516b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30054/", "date": "2024-07-07 08:44", "message": "At 10:00, Hezbollah launched dozens of rockets towards the Galilee, apparently in response to yesterday's elimination in Baalbek. Intercepts were observed in the skies of Tiberias.\nMDA reports a 28-year-old seriously injured as a result of the barrage.", "location": "Galilee", "classification": "security", "score": 0.9418694258970863, "event_breakdown": "10:00 Hezbollah launched dozens of rockets towards the Galilee, apparently in response to elimination in Baalbek yesterday. Intercepts were observed in the skies of Tiberias."}, {"id": "63c35bca-9cd9-4c2c-aeb6-9c882261af8f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30048/", "date": "2024-07-07 07:12", "message": "Iran: The black mourning flags were raised to mark Ashura\n\nThis is what the Imam Reza shrine in Mashhad looked like this morning. The Shiites all over the world are mourning the death of Husayn ibn Ali, the grandson of the Prophet Muhammad who was killed on the tenth day (Ashura) of the month of Muharram (which will begin in ten days).", "location": "Mashhad", "classification": "security", "score": 0.6027981479101978, "event_breakdown": "The black mourning flags were raised to mark Ashura, which commemorates the death of Husayn ibn Ali, the grandson of the Prophet Muhammad\n- Shiite Muslims worldwide are mourning the loss of Husayn ibn Ali, the grandson of the Prophet of Muhammad, who was killed on the tenth day (Ashura) of the month of Muharram."}, {"id": "fe29c45d-7059-4ab5-9581-ba46aab733b6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30045/", "date": "2024-07-07 06:11", "message": "Explosives in Tulkarm\n\nPalestinian sources stated tonight that a large explosive device that was planted on the road and was intended to hit IDF soldiers, exploded in the Nur Shams refugee camp in Tulkarm, due to a mistake by the person who planted it.\nAs a result, an electrical transformer was damaged and a power outage was caused in Nur Shams and nearby areas.\n\nThere are conflicting reports regarding Palestinian casualties as a result of the explosion.", "location": "TULKARM", "classification": "security", "score": 0.9974427197880932, "event_breakdown": "Explosive Device Explosion in Nur Shams Refugee Camp, Tulkarm"}, {"id": "ec3a3487-86b8-4457-ac07-3b4e0529c44e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30040/", "date": "2024-07-07 06:10", "message": "The Palestinians publish documentation from UNRWA's Al-Jawani school in Nusierat in the center of the Gaza Strip, where the IDF attacked Hamas police caravans (according to the Palestinians, 16 people were killed and dozens injured in the attack).\nFrom the photos you can see that the school building, painted in UNRWA colors, remains intact. What was attacked, as mentioned yesterday, were the temporary structures where Hamas operatives lived at the entrance to the school.", "location": "The main event takes place in the Gaza Strip, particularly at Al-Jawani school in Nuseirat.", "classification": "security", "score": 0.988444883526855, "event_breakdown": "IDF attacks Hamas police caravans at Al-Jawani school in Nusierat, the Gaza Strip."}, {"id": "f789c633-7a80-4292-8bc9-0cb8f0b3e0f0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30038/", "date": "2024-07-07 06:08", "message": "Geert Wilders, the leader of the party for freedom in the Dutch parliament that made up the current coalition in the Netherlands stings Erdogan (who came to watch the game in Berlin) on the background of the loss of the Turkish team.\n\nIn another tweet, he explains that the behavior of the Turks in the Netherlands as in the video 👆 is what brought so many mandates to his party.", "location": "itself\nBerlin", "classification": "security", "score": 0.4727509181834203, "event_breakdown": "Geert Wilders, the leader of the Dutch Freedom Party, criticized Turkish President Recep Tayyip Erdogan on Twitter during the UEFA 2020 European Championship soccer match between the Netherlands and Turkey."}, {"id": "2ebda872-d259-4839-b589-f5d045c1a391", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30072/", "date": "2024-07-07 14:51", "message": "Israeli media reports that three Israelis were injured, one seriously and the others lightly, as a result of Hezbollah's anti-tank missile fire.\n\nAccording to these sources, one of the injured is an American citizen", "location": ")\nIsrael", "classification": "security", "score": 0.9777508527573147, "event_breakdown": "Hezbollah's anti-tank missile fire in northern Israel reported on May 11, 2022. Three Israelis were injured, one seriously and the other two lightly, as a result of this attack. One of the injured is an American citizen. The attack took place in the Shebaa Farms area, near the border between Lebanon and Israel. The Israeli Defense Forces said in a statement that the attack was \"a blatant violation of Israeli sovereignty\" and that the IDF would respond \"at the appropriate time and place\". The attack comes amid heightened tensions in the region, with Israel accusing Hezbollah of building up its military capabilities in southern Lebanon."}, {"id": "4d7a88a2-2595-488a-94d1-7ab80fd89e89", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30064/", "date": "2024-07-07 13:16", "message": "The Civil Defense in Gaza reports that it retrieved 4 dead as a result of an IDF attack on the \"al-Aaiyla al-Mukadasa\" school in the west of Gaza City.", "location": ".\nGAZA CITY, Gaza Strip", "classification": "security", "score": 0.9728567288354074, "event_breakdown": "Populated Place: Gaza\nPopulated Place: Gaza City\nIDF (Israel Defense Forces)\n2022-05"}, {"id": "d6e29cd9-c129-4e25-b74c-5241f3061bd7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30061/", "date": "2024-07-07 11:52", "message": "Hezbollah in an official announcement:\nWe launched dozens of Katyusha rockets towards the air control base in Miron in response to the elimination carried out by the IDF yesterday the area of al-Beqaa.", "location": "NULL", "classification": "security", "score": 0.8627164202813831, "event_breakdown": "Hezbollah fires rockets at Israel"}, {"id": "a81e1325-e900-414a-8918-690486af5b6a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30059/", "date": "2024-07-07 09:51", "message": "\"Sewage rivers\" on the street next to Shuhada al-Aqsa Hospital in Deir al-Balah in the center of the Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.9649208005442066, "event_breakdown": "* In Palestine, protests broke out in response to the Israeli police's provocation of the Al Aqsa mosque\n* Protests in response to Gaza's ongoing power cuts\n* Protests against increasing crime in the West Bank\n* Protests against the Israeli army's destruction of homes in a village in the Hebron district\n* Demonstrations in the West Bank and Jerusalem against Jewish settlers\n* Protests against Israeli restrictions imposed on Palestinian worshipers' access to the Aqsa mosque in Jerusalem\n* Demonstrations against the Palestinian Authority in the West Bank\n* Protests in the Gaza Strip against the Palestinian Authority\n* Protests in the West Bank against the Palestinian Authority"}, {"id": "b608735e-253a-482d-a22c-cbf537565ec6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30052/", "date": "2024-07-07 07:17", "message": "On Valiasr Street in Tehran, an interesting banner was raised (also on the occasion of Ashura) that associates the battle of Husayn ibn Ali with the war in Gaza.\nHusayn ibn Ali is seen on the side of the Gazans (next to the spokesman of the military wing of Hamas), in front of the Israeli tanks and soldiers, with Al-Aqsa in the background.\n\nThe poster asks the question:\n\"What would he (Husayn ibn Ali - AA) do?\"\n\nThe Iranians are harnessing Shia theological elements in favor of Hamas (Sunni) in the war in Gaza.", "location": "Tehran", "classification": "security", "score": 0.9536647827049417, "event_breakdown": "Gaza, Israel"}, {"id": "2c3f8305-5541-44e3-ae67-77b187f52843", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30089/", "date": "2024-07-07 19:11", "message": "Second Round of the French Elections:\n\nPreliminary results from exit polls after the polls closed indicate that President Macron's party, along with the left-wing factions in French politics, has managed to block the rise of the right and prevent a majority for the right-wing coalition led by Marine Le Pen.\n\nIn the attached slide: Macron's party is shown in orange and the left-leaning parties in red.", "location": "France", "classification": "security", "score": 0.600525171299834, "event_breakdown": "Add an event for the second round of french elections"}, {"id": "a96e4ad4-1bff-430b-a3a1-ebdd13b32524", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30087/", "date": "2024-07-07 19:09", "message": "Hamas-affiliated channels are reporting that Ahmed Abu Al-Hijah (Abu Dajana), a prominent military operative in the Izz a-Din al-Qassam Brigades (Hamas) in Jenin, died today at a local hospital after being wounded by IDF fire a few days ago. \n\nFatah-affiliated channels also attempted to claim ownership over the martyr by publishing an old photo of the terrorist, in which he is seen wearing the uniform of the Palestinian Authority's police force.\n\nIn any case, he will no longer be a concern.", "location": "Jenin.", "classification": "security", "score": 0.9494505394358428, "event_breakdown": "Ahmed Abu Al-Hijah, a prominent military operative in the Izz a-Din al-Qassam Brigades (Hamas) in Jenin, died today at Khalil Suleiman Hospital in Jenin after being wounded by IDF fire a few days ago."}, {"id": "d95da206-0604-4d91-8104-29b983bf9ec3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30086/", "date": "2024-07-07 19:06", "message": "Hezbollah Official Announcement:\n\nIn response to the assassination carried out by the IDF yesterday in the al-Beqaa region, we attacked the long-range aerial monitoring base on Mount Hermon with a group of suicide drones, causing damage to its warning systems.\n\nLebanese channel al-Mayadeen reports that this is the first time Hezbollah has targeted this base, which is situated at an altitude of 2,230 meters. According to al-Mayadeen, the base is responsible for intelligence coverage on the eastern front, including Syria, Iraq, Jordan, and extending up to the Iranian border.", "location": "Mount Hermon", "classification": "security", "score": 0.9841568399020024, "event_breakdown": "A target event could not be found in the text provided."}, {"id": "2d0914c5-be8e-48e4-8441-e37c97c13317", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30083/", "date": "2024-07-07 18:20", "message": "Following the recent warning about the infiltration of hostile aircraft in the northern part of the country, air defense fighters successfully intercepted several targets that crossed from Lebanon into the Mount Dov and Dafna areas.\n\nAdditionally, an explosive drone UAV was detected falling in an open area in the Hermon region. There were no casualties reported.", "location": "Mount Dov", "classification": "security", "score": 0.9548312271293463, "event_breakdown": "The recent events were placed on a map and can be reported on as follows.\nOn February 12, 2022 air defence fighters intercepted aircraft that crossed from Lebanon to the Mount Dov and Dafna areas. A UAV drone was also detected in the Hermon region. No casualties were reported."}, {"id": "8062548b-1d72-4309-a37b-51249e2ad7e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30076/", "date": "2024-07-07 16:04", "message": "The IDF spokesman announced the death of a company commander in the 601st Engineering Battalion in a battle in the southern Gaza Strip.\n\nMay his memory be a blessing.", "location": "Gaza Strip", "classification": "security", "score": 0.9523553371811447, "event_breakdown": "IDF Company Commander Killed in Southern Gaza Strip"}, {"id": "37dca159-3993-4f71-ace7-ba5ae6d0826f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30075/", "date": "2024-07-07 16:03", "message": "The IDF spokesman in Arabic published a short time ago an evacuation notice for the residents of the neighborhoods of Darj, the Old City, and Tufah in Gaza City.\nAccording to the instructions, the residents must move west, towards the sea, to the humanitarian zone.\n\n##\nThe announcement will add quite a bit of pressure on the Gazan population and may also increase the movement of Gazans south to the center of the Gaza Strip, outside of the Gaza City area and the north of the Gaza Strip.", "location": "GAZA CITY", "classification": "security", "score": 0.8545901746078933, "event_breakdown": "IDF Spokesman in Arabic publishes evacuation notice in Gaza. Residents of Darj, Old City, Tufah directed to move west towards sea."}, {"id": "35797320-8570-4dfe-b16c-9f1fb3fad81f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30066/", "date": "2024-07-07 14:48", "message": "Hamas confirms in an official announcement the death of \"the commander, the martyr and the engineer Ihab al-Ghussein, who was in charge of the Ministry of Labor in Gaza\".", "location": "GAZA", "classification": "security", "score": 0.9624343390023589, "event_breakdown": "Hamas confirms death of senior member Ihab al-Ghussein in Gaza"}, {"id": "7e683b27-40c2-4965-b9fa-eb2133cba5ce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30063/", "date": "2024-07-07 11:55", "message": "IDF Spokesperson:\n\nFollowing the alerts that were activated in the northern part of the country at 1:02 p.m., about 20 launches were detected that crossed the territory of Lebanon towards the Miron region.\nAs a result of the launches, several fires broke out in the area, there were no casualties.", "location": "Miron region", "classification": "security", "score": 0.9134560478201458, "event_breakdown": "Target event:\nIDF: 20 launches from Lebanon into Israel, several fires\nIDF: 20 launches from Lebanon into Israel, several fires"}, {"id": "12c3a22a-1a1c-4c4e-8cec-bccd9c8335d2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30073/", "date": "2024-07-07 16:01", "message": "Following earlier reports 👆the IDF spokesperson provides the following update:\n\nA short while ago, based on IDF and ISA intelligence, the IAF struck a complex inside of which terrorists were operating and hiding in the area of a school building in Gaza City.  \n\nSimultaneously, the IDF struck a Hamas weapons manufacturing facility embedded by the terrorist organization in the area of the school.\n\nPrior to the strike, numerous steps were taken in order to mitigate the risk of harming civilians, including the use of precise aerial surveillance and additional intelligence. \n\nThe Hamas terrorist organization systematically violates international law, exploiting civilian structures and population as human shields for its terror attacks against the State of Israel.", "location": "Gaza City", "classification": "security", "score": 0.8788939247919862, "event_breakdown": "IDF provided an update in strikes on Gaza took place today. The IDF struck inside Gaza of the city. A news push reported strikes on targets of a terrorist organization. Relevant events can be placed on a map point. The IDF provided the information."}, {"id": "696d1f38-1bad-4fd8-abe1-801506c62f4a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30065/", "date": "2024-07-07 13:18", "message": "Palestinian channels report: the engineer Ihab al-Ghussein, who is in charge of the Ministry of Labor in Gaza on behalf of Hamas, was killed in an Israeli attack in the west of Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9844511855571147, "event_breakdown": "Israeli strike in the west of Gaza City kills Ihab al-Ghussein, a Hamas official\nCategory: Security\nRegion: West Gaza City, Gaza Strip"}]