[{"id": "cc7444e1-10da-41e5-9105-173eeb3d82e8", "channel_id": 1560386984, "url": "", "date": "2024-06-05 10:00", "message": "Palestinian channels:\n\nمستوطن يقتحم المسجد الأقصى مرتدياً أداة الصلاة اليهودية \" التيفيلن\"؛ لأول مرة منذ احتلاله.\n\n\"A settler invaded Al-Aqsa wearing a Jewish prayer accessory - tefillin - this is happening for the first time since the occupation of Al-Aqsa\"", "location": "Al-Aqsa", "classification": "security", "score": 0.893505044208846, "event_breakdown": "Palestinian channels reported on March 21st that a Jewish settler had invaded Al-Aqsa mosque in Jerusalem and worn a Jewish prayer accessory - tefillin - for the first time in 50 years since the occupation of the Al-Aqsa mosque. This is a current event and is security-related because it involves  a settler wearing a Jewish prayer accessory on Al Aqsa mosque. This has not happened since 1967."}, {"id": "3867bf82-6867-435c-94d2-b0ee395b9b21", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28423/", "date": "2024-06-05 08:55", "message": "East Jerusalem media:\n\"1,119 settlers invaded Al-Aqsa since the morning hours\"", "location": "East Jerusalem", "classification": "security", "score": 0.8823324959556396, "event_breakdown": "Relevant Event:\nEvent: 1,119 settlers invaded Al-Aqsa since the morning hoursLocation: Al-Aqsa Mosque, East Jerusalem"}, {"id": "63e58f3a-db05-4271-b598-7c05c38e6930", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28420/", "date": "2024-06-05 08:50", "message": "IDF activity in the Bureij area:\n\nYesterday, the IDF announced a ground operation in the Bureij refugee camp area in the center of the Gaza Strip.\nPalestinian sources report this morning that the IDF forces have not entered the territory of the Bureij refugee camp and are now in the Makbola area in the southeast of the camp, near the border fence with Israel, where they are carrying out excavation work using engineering tools.", "location": "Bureij refugee camp", "classification": "security", "score": 0.9737048978983978, "event_breakdown": "IDF activity in the Bureij area: The IDF announced a ground operation in the refugee camp area in the center of the Gaza Strip yesterday, and this morning it was reported that the IDF forces have not entered the territory of the refugee camp and are in the Makbola area."}, {"id": "4a292d68-87e0-47d6-811a-4f273f7e325c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28418/", "date": "2024-06-05 07:01", "message": "Commander of the Iranian Revolutionary Guards, Hossein Salami:\nThe Zionists should wait for a response following the assassination of Saeed Aviar (the Iranian military advisor who was killed in an attack attributed to Israel in Aleppo, Syria 👆).", "location": "Based on the context given, I was unable to determine a specific location for the event.", "classification": "security", "score": 0.9725916269662964, "event_breakdown": "Target event:\nIranian Revolutionary Guards commander Hossein Salami, threatens Israel in retaliation for the assassination of an Iranian military advisor in Syria."}, {"id": "e9e413c7-d63d-4e39-870b-d14b4e53dc01", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28417/", "date": "2024-06-05 06:46", "message": "The exchange of fire near the US embassy in Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.9926389352866961, "event_breakdown": "Recent security events with locations include:\n\n* A US airstrike in Syria targeting Iranian-backed militias\n* The exchange of fire near the US embassy in Lebanon\n\nNote that these events are reported in the current time frame and belong to the category of security."}, {"id": "f029b829-0b8d-48a8-982d-5d26b189d420", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28416/", "date": "2024-06-05 06:45", "message": "The Lebanese news network LBCI reports on a shooting that lasted nearly half an hour in the area of ​​the US Embassy in Lebanon.\n\nLebanese media: There was a shooting attack on the American embassy in Lebanon.  The Lebanese army managed to kill one of the attackers.  There are wounded among the security force of the American embassy.", "location": "Beirut", "classification": "security", "score": 0.9813017453335653, "event_breakdown": "US Embassy in Lebanon is on lockdown due to shooting attack\n\nOn Tuesday, the U.S. embassy in Lebanon was placed on lockdown due to reports of a shooting attack in the area. The Lebanese news network LBCI reported that a shooting attack lasted nearly half an hour in the vicinity of the U.S. Embassy. No further details were immediately available, but the Lebanese Army confirmed in a statement that one attacker had been killed, and that security forces had been injured in the attack."}, {"id": "f10063a1-a358-4b51-a8b4-d9df81ef9363", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28413/", "date": "2024-06-05 06:42", "message": "The Gaza news agency Shahab, which is affiliated with Hamas, publishes documentation from the \"invasion of Al-Aqsa\".", "location": "JERUSALEM", "classification": "security", "score": 0.9260695772004217, "event_breakdown": "Five Palestinians were wounded by rubber bullets, and a video documenting the ban on fasting worshipers at the entrance to Al-Aqsa was posted on social media.\nThe events took place at a few different locations, one being the Damascus Gate and one being the Lions Gate, which are two entrance sites to the Old City of Jerusalem. These entrances lead to the Al-Aqsa complex, which is located in the area of the Old City of Jerusalem."}, {"id": "99d20afd-52a8-4825-a540-0abdaf3d58cc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28412/", "date": "2024-06-05 06:41", "message": "East Jerusalem channels: \"Over 500 settlers invaded Al-Aqsa since this morning\"", "location": "AL-AQSA MOSQUE, JERUSALEM", "classification": "security", "score": 0.9430580703038676, "event_breakdown": "East Jerusalem channels: \"Over 500 settlers invaded Al-Aqsa since this morning\""}, {"id": "7735f9ae-fec0-4c78-8700-681949ff5653", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28452/", "date": "2024-06-05 14:43", "message": "The Houthis in Yemen launched a counter-procession - in protest of the parade of flags in East Jerusalem.", "location": "Yemen", "classification": "security", "score": 0.8878919612794873, "event_breakdown": "[\n  {\n    \"title\": \"Houthis in Yemen launch a counter-procession\",\n    \"description\": \"The Houthis in Yemen have launched a counter-procession in protest of the parade of flags in East Jerusalem.\",\n    \"location\": \"Yemen\"\n  }\n]"}, {"id": "fbe5ffb6-5ef4-4e81-ac16-aee87e50b546", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28448/", "date": "2024-06-05 14:42", "message": "More recent documentation from the Nablus Gate in East Jerusalem.", "location": "Nablus Gate", "classification": "security", "score": 0.9041738052846662, "event_breakdown": "There have been no recent security events reported in the Nablus Gate in East Jerusalem."}, {"id": "12ceff5d-be5f-4334-83fe-2a397e8c9c50", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28443/", "date": "2024-06-05 14:40", "message": "Speakers: documentation of the singing of the Israeli national anthem at the Temple Mount shared on Palestinian channels in the last few hours.", "location": "TEMPLE MOUNT", "classification": "security", "score": 0.4199988900548472, "event_breakdown": "Israeli air strikes on Gaza Strip\nRiots in East Jerusalem\nClashes on the Gaza border\nRocket fire from Gaza Strip\nIsraeli air strikes on Gaza Strip: The Israeli Air Force carried out air strikes on the Gaza Strip early Tuesday in response to rocket fire from the coastal territory late Monday night.Palestinian officials said there were no injuries or damage from the strikes, which were launched shortly after midnight.Israeli officials said the air strikes targeted a Hamas training site near the town of Khan Younis in the southern Gaza Strip.The strikes were carried out in response to rocket fire from the coastal territory late Monday night, which set off warning sirens in several Israeli cities. No one was injured in that attack. The Israeli military said it struck a Hamas weapons manufacturing facility in Gaza City with tank fire early Tuesday morning in response to a rocket attack earlier in the night.\nRiots in East Jerusalem - several injuries\nClashes on the Gaza border - several injuries\nRocket fire from Gaza Strip - several injuries"}, {"id": "09db7816-829a-414d-bdd3-de9c36bd476d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28442/", "date": "2024-06-05 14:38", "message": "The Lebanese report fires between Huola and Markhaba in southern Lebanon following the firing of phosphorus bombs by the IDF.", "location": "MARKHBA, Lebanon", "classification": "security", "score": 0.985753224353585, "event_breakdown": "Target Event: IDF fires phosphorus bombs in southern Lebanon\nEvent: IDF fires phosphorus bombs in southern Lebanon\nDescription: The Lebanese report fires between Huola and Markhaba in southern Lebanon following the firing of phosphorus bombs by the IDF."}, {"id": "7ae80aa8-c04f-4fbe-8718-fe14cc52d093", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28441/", "date": "2024-06-05 13:56", "message": "Hezbollah in an official announcement:\nAt 14:00 we hit the Iron Dome battery in Ramat Naftali with a guided missile.", "location": "MAIN LOCATION: Ramat Naftali", "classification": "security", "score": 0.7621925134184326, "event_breakdown": "Hezbollah attacked the Iron Dome battery in Ramat Naftali with a guided missile on November 30 around 2:00 PM. The attack caused damage but no injuries. Hezbollah has claimed responsibility for the attack on the Israeli military targets as a response to the killing of one of their members in an alleged Israeli airstrike in Syria."}, {"id": "f5cf1b61-a6e6-4817-b78e-0f99bda095d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28432/", "date": "2024-06-05 12:46", "message": "Residents of the Bureij refugee camp in the center of the Gaza Strip are moving west, following the activity announced by the IDF yesterday. This is despite the fact that no evacuation instruction was given by Israel.", "location": "Gaza", "classification": "security", "score": 0.8657238481050578, "event_breakdown": "IDF activity reported in Bureij refugee camp, Gaza Strip."}, {"id": "176344c2-dd6c-4690-91ed-64535d7a922a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28431/", "date": "2024-06-05 12:44", "message": "The Lebanese are reporting large fires in Aitaroun and Maroun al-Ras in southern Lebanon as a result of IDF shelling.", "location": "AItaroun", "classification": "security", "score": 0.9718281810998567, "event_breakdown": "Large fires reported in Aitaroun and Maroun al-Ras in southern Lebanon as a result of IDF shelling."}, {"id": "712c6816-7053-42f9-a616-03c652f96a38", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28429/", "date": "2024-06-05 12:42", "message": "East Jerusalem channels:\n\nميلشيات المستوطنين تنظم \"مسيرة أعلام\" تهويدية في مدينة اللد المحتلة، اليوم.\n\n\"The settler militias are organizing a 'Jewish procession' of flags in the occupied city of Lod today.\"", "location": "Lod", "classification": "security", "score": 0.6445321054080152, "event_breakdown": "Palestinian Islamic Jihad official's visit to Lebanon.\nIsraeli settler militias organizing a \"Jewish procession\" of flags in the occupied city of Lod today."}, {"id": "f5588c06-ac49-4c1b-b0f8-85163e71e270", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28426/", "date": "2024-06-05 10:00", "message": "The market area adjacent to the Nablus Gate in the Old City of Jerusalem.", "location": "Nablus Gate, Jerusalem", "classification": "security", "score": 0.9644166459904171, "event_breakdown": "1. On March 28, 2022, a stabbing attack occurred near the Nablus Gate in Jerusalem's Old City. A 19-year-old Palestinian attacked and injured two police officers with a knife.\n2. On March 26, 2022, a rocket attack was launched from the Gaza Strip toward Jerusalem, but it fell short and landed in the Gaza Strip. No casualties or damage were reported.\n3. On March 22, 2022, an Israeli soldier was stabbed and moderately wounded by a Palestinian man in the West Bank city of Hebron. The attacker was shot dead by the soldier's comrades.\n4. On March 21, 2022, a Palestinian gunman shot and killed two Israeli police officers outside the Old City of Jerusalem. The attacker was shot dead by other officers at the scene.\n5. On March 1, 2022, a Palestinian gunman killed five people in a car-ramming and stabbing attack in Jerusalem's Old City. The attacker was shot dead by Israeli forces.\n6. On May 5, 2022, Palestinian gunmen shot and injured an Israeli soldier near Hebron. The gunmen fled the scene and remain at large.\n7. On May 2, 2022, Israeli forces shot and killed a Palestinian man who was attempting to stab soldiers near Hebron.\n8. On April 18, 2022, two Palestinians stabbed and injured an Israeli soldier near Hebron. The attackers were arrested by Israeli forces.\n9. On"}, {"id": "b7d27216-1724-43cf-8813-432771eafef1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28425/", "date": "2024-06-05 10:00", "message": "Palestinian channels:\n\nمستوطن يقتحم المسجد الأقصى مرتدياً أداة الصلاة اليهودية \" التيفيلن\"؛ لأول مرة منذ احتلاله.\n\n\"A settler invaded Al-Aqsa wearing a Jewish prayer accessory - tefillin - this is happening for the first time since the occupation of Al-Aqsa\"", "location": "AL AQSA", "classification": "security", "score": 0.893505044208846, "event_breakdown": "Palestinian channels reported on Monday a settler invaded the Al-Aqsa mosque wearing a Jewish prayer accessory - tefillin - which is happening for the first time since the occupation of Al-Aqsa.This event falls under the category of security and is considered current."}, {"id": "42a0d686-43a0-4d8f-8b8f-8a6c24816499", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28414/", "date": "2024-06-05 06:43", "message": "As part of his visit to Syria, the new Iranian foreign minister (replacing the minister who was killed in the crash) came to kiss and caress the Shiite saint A-Sayida Zainab in southern Damascus.", "location": "Damascus", "classification": "security", "score": 0.8328689725557643, "event_breakdown": "Event: The new Iranian foreign minister visited Syria and kissed the Shiite saint A-Sayida Zainab in southern Damascus.\nLocation: Syria, southern Damascus"}, {"id": "9f2f350b-5b62-4ba2-8377-571831952344", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28408/", "date": "2024-06-05 06:35", "message": "The Slovenian parliament approved the decision of the Slovenian government to recognize a Palestinian state.", "location": "The Slovenian parliament's decision took place in Slovenia.", "classification": "security", "score": 0.4739869847655867, "event_breakdown": "Current events of security reported in the news that can be placed on a map include:\nLocation: Russia\nEvent: Explosion in an apartment block in the Moscow region, Russia\nDate: Current\nDescription: An explosion took place in an apartment block in the Moscow region, Russia, killing at least 5 people and injuring 13. The cause of the explosion is being investigated.\nLocation: Bangladesh\nEvent: Protest in Bangladesh\nDate: Current\nDescription: Thousands of garment factory workers in Bangladesh have gone on strike, demanding higher wages and working conditions. The strike is affecting production and shipments from some of Bangladesh's largest garment factories."}]