[{"id": "b7521be4-0305-4182-bd1c-231f7b71e28d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31618/", "date": "2024-08-02 06:24", "message": "Hamas is trying to leverage the assassination of Haniyeh to wake up the sleepy Arab street and bring it out to demonstrate\n\nHamas calls for a \"صلاة الغائب\" in honor of Ismail Haniyeh - a special funeral prayer held for a dead person who is not in his city (\"prayer of the absent\"). Hamas is calling for it to be held today in all mosques (in all countries), today after the Friday prayer and after that to go to extensive \"Day of Rage\" demonstrations.\n\nAlso, Hamas calls for tomorrow to observe the \"World Day for Gaza\" that Haniyeh announced last week before his elimination.\n\nHamas wants to fill the streets all over the world with green Hamas flags.\nWe will wait to see if there will be a response.", "location": "Gaza", "classification": "antisemitism", "score": 0.4067212834283055, "event_breakdown": "The current event is on going and can therefore be reported in real time"}, {"id": "fd29d9c9-39c0-4116-9e3c-4eeda2bf5e41", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31647/", "date": "2024-08-02 15:41", "message": "IDF: The Chief of the General Staff to reserve soldiers in Gaza: let those who attack the citizens of the State of Israel know that we are ready to go far, to gather very precise intelligence, to strike and to kill\n\n\"Our message to the entire Middle East this week - those who attack the citizens of Israel, those who attack the State of Israel, we are ready to go far, know how to put in a lot of effort to gather very precise intelligence, to strike, to kill and also to take risks. We struck in Beirut and we are striking in Gaza, and we will be very strong In defense, and then we will strike very strongly. This message is very important. We cannot do these things without relying on the fact that we have reservists with a very high level of professionalism and dedication. The IDF is operating with excellence, you are operating with excellence, but we need to know that we have the patience, the determination to keep doing it right until we reach the goals of the war.\"", "location": "GAZA", "classification": "antisemitism", "score": 0.4153981661354785, "event_breakdown": "IDF: The Chief of the General Staff to reserve soldiers in Gaza\nThe Chief of the General Staff Benjamin Gantz reserve soldiers in Gaza and let them know they are ready to go far, to gather very precise intelligence, to strike and to kill.\nGantz's comments come as the IDF continues to target Hamas targets in the Gaza Strip in response to the rocket fire.\nGantz spoke to the soldiers during a visit to the south of the country and warned them that the IDF is ready to use force, according to Ynet.\n\"Our message to the entire Middle East this week - those who attack the citizens of Israel, those who attack the State of Israel, we are ready to go far, know how to put in a lot of effort to gather very precise intelligence, to strike, to kill and also to take risks. We struck in Beirut and we are striking in Gaza, and we will be very strong In defense, and then we will strike very strongly,\" Gantz said.\nGantz's words are a clear message to Hamas that the IDF is united and ready to act.\n\"This message is very important,\" Gantz said. \"We cannot do this without relying on the fact that we have reservists with a very high level of professionalism and devotion.\""}]