[{"id": "662c62b3-35d5-4073-a3c8-34931ab2345d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26822/", "date": "2024-05-06 22:10", "message": "Some geographic data about Rafah in the southern Gaza Strip:\n1. The distance from the border with Israel to the beach in Rafah in a straight line is 12 km.\n\n2. The distance from the Israeli border to the Rafah crossing is about 3 km.\n\n3. The distance from the border of Israel to the line of the eastern neighborhoods of Rafah is also about three kilometers. In between there is an area that is not urban and has almost no residential buildings - there is also the destroyed Gaza airport, which in recent years has become an area for pirate car races and camel races.\n\nThe neighborhoods of A-Salam and Janinah in East Rafah (the 3 km line) are the first urban areas that the IDF's maneuvering forces will encounter in East Rafah.", "location": "Rafah", "classification": "security", "score": 0.9246715498195338, "event_breakdown": "1. Israeli forces encountered urban areas in East Rafah, particularly the neighborhoods of A-Salam and Janinah.\n2. The distance from the Israeli border to the beach in Rafah is approximately 12 km in a straight line.\n3. The Rafah crossing is about 3 km from the Israeli border.\n4. The eastern neighborhoods of Rafah are approximately 3 km from the Israeli border, with an area between them that is not urban and has minimal residential buildings, including the destroyed Gaza airport."}, {"id": "12439b78-50a3-4538-be57-09de96009ec7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26821/", "date": "2024-05-06 22:08", "message": "The Palestinians report dead and wounded in an Israeli airstrike on a building in the Tal a-Sultan neighborhood in West Rafah (marked with a red circle).\n\nI also marked with a blue arrow a possible path taken by the Israeli tanks that arrived near the Rafah crossing, according to the earlier Palestinian report.", "location": "The main location where the main event takes place is West Rafah.", "classification": "security", "score": 0.9630523459252799, "event_breakdown": "- Israeli airstrike on a building in the Tal a-Sultan neighborhood in West Rafah\n- Israeli tanks arrived near the Rafah crossing"}, {"id": "f3ccc1fb-b554-4db7-b15b-0f0e60dd0e23", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26820/", "date": "2024-05-06 21:35", "message": "According to another Palestinian report from the last few minutes, 3 IDF tanks have arrived at a distance of about 200 meters from the Rafah crossing and they are firing at buildings in the crossing.", "location": "Rafah crossing", "classification": "security", "score": 0.87151281142575, "event_breakdown": "- 3 IDF tanks arrived at a distance of about 200 meters from the Rafah crossing\n- IDF tanks firing at buildings in the crossing"}, {"id": "b7f5d97e-98d5-45f0-953c-7ddf7bffcbb2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26819/", "date": "2024-05-06 21:35", "message": "Journalists in Rafah are reporting heavy artillery fire from the IDF now towards the area surrounding the Rafah and Kerem Shalom crossing complexes as well as towards the A-Salam and Jeninah neighborhoods in East Rafah. There is also an air attack on targets in a-Tanor neighborhood, also in East Rafah.\n\n##\nThere are still no reports of a significant advance of maneuvering forces into Rafah and according to some the sources of the maneuvering forces are not far from the border fence, still in open areas and not in urban areas.", "location": "Rafah", "classification": "security", "score": 0.8724267717113189, "event_breakdown": "- Heavy artillery fire reported from IDF towards Rafah and Kerem Shalom crossing complexes\n- Heavy artillery fire reported towards A-Salam and Jeninah neighborhoods in East Rafah\n- Air attack reported on targets in a-Tanor neighborhood in East Rafah"}, {"id": "35aaacf9-c9bd-48a3-9b10-8d2ecb7635fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26818/", "date": "2024-05-06 21:21", "message": "Some residents of Rafah do not care about the fact that Israel did not agree to a hudna. They went out to celebrate Hamas's announcement of accepting the terms of the ceasefire even late at night.", "location": "Rafah", "classification": "security", "score": 0.5161512565919127, "event_breakdown": "- Some residents of Rafah celebrate Hamas's announcement of accepting the terms of the ceasefire."}, {"id": "cc473b2d-8c81-489a-9e38-41350370e0a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26816/", "date": "2024-05-06 21:09", "message": "Flares in the east of Rafah in the southern Gaza Strip, moments ago.", "location": "Rafah", "classification": "security", "score": 0.9326758034036216, "event_breakdown": "Flares reported in the east of Rafah, southern Gaza Strip."}, {"id": "5b2ee175-236f-494a-8b6a-763745dbaa3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26814", "date": "2024-05-06 19:40", "message": "Airstrikes in Janineh, eastern Rafah.", "location": "Janineh, eastern Rafah", "classification": "security", "score": 0.8281741041868073, "event_breakdown": "- Airstrikes in Janineh, eastern Rafah."}, {"id": "075399f2-1745-4137-8f73-86e2d6dd8133", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26813/", "date": "2024-05-06 19:22", "message": "The Israeli Prime Minister's Office:\n\nThe war cabinet has unanimously decided that Israel should continue with a military operation in Rafah to exert pressure on Hamas militarily, with the aim of advancing the release of our hostages and achieving our objectives.\n\nDespite Hamas's offer being far from meeting Israel's crucial demands, Israel will send work crews to the mediators to maximize the possibility of reaching an agreement acceptable to Israel.", "location": "Rafah", "classification": "security", "score": 0.908859392841682, "event_breakdown": "- Israeli military operation in Rafah to exert pressure on Hamas\n- Efforts to advance the release of hostages and achieve objectives through military action\n- Sending work crews to mediators to maximize possibility of reaching agreement with Hamas"}, {"id": "f5f3a1d9-894a-401f-bf75-050c8a1cb68b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26812/", "date": "2024-05-06 19:17", "message": "The IDF: IDF forces are now attacking and operating against targets of the terrorist organization Hamas in eastern Rafah.\n\nMore details to follow.", "location": "Rafah", "classification": "security", "score": 0.9709683398024609, "event_breakdown": "- IDF forces attacking and operating against Hamas targets in eastern Rafah"}, {"id": "3614e1c8-dc02-40b9-b978-527911dbec63", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26811/", "date": "2024-05-06 19:15", "message": "The Palestinians report that Israeli airplanes are conducting \"fire belt\" type air strikes in the in the eastern neighborhoods of Rafah.", "location": "Rafah", "classification": "security", "score": 0.9569364180620141, "event_breakdown": "1. Israeli airplanes conducting \"fire belt\" type air strikes in the eastern neighborhoods of Rafah - Palestinian report."}, {"id": "c017d6ba-10c4-4e03-aeda-4cd87a3818be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26810/", "date": "2024-05-06 19:11", "message": "Gaza channels:\n\nA surprise ground attack now in East Rafah.\n\n(Israeli - AA) tank movement under heavy artillery cover.", "location": "East Rafah", "classification": "security", "score": 0.932993333127104, "event_breakdown": "- Surprise ground attack in East Rafah\n- Israeli tank movement under heavy artillery cover"}, {"id": "e141e0cf-33ae-4d3c-b594-e66168312817", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26807/", "date": "2024-05-06 18:33", "message": "Against the background of Hamas's agreement - chants in praise of Muhammad Deif, the head of Hamas's military wing, in the square of the Shuhada al-Aqsa hospital in Deir al-Balah.", "location": "Deir al-Balah", "classification": "security", "score": 0.9536802995119938, "event_breakdown": "- Chants in praise of Muhammad Deif at the square of Shuhada al-Aqsa hospital in Deir al-Balah"}, {"id": "cfde03ff-f1af-486e-ab5c-4d84885189be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26806/", "date": "2024-05-06 18:32", "message": "An important question to ask tonight:\nWhat does the ceasefire agreement say about the continued presence of Hamas in the Gaza Strip and its continued rule?\n\nWill senior Hamas officials finish their journey in the Strip and be deported or will they stay in the Strip and renew their control over the Strip?\n\nThis is a question that Israel should ask itself and also present this question to the Americans.\n\nIf the war ends before the second phase of the deal and before the release of all the abductees, what will happen to senior Hamas officials who are in the Strip?\n\nThis should appear in the agreement.", "location": "Gaza Strip", "classification": "security", "score": 0.8697658509370266, "event_breakdown": "- Ceasefire agreement between Israel and Hamas\n- Presence and control of Hamas in the Gaza Strip\n- Fate of senior Hamas officials in the Gaza Strip\n- Potential deportation of senior Hamas officials\n- Release of all abductees in relation to the war's end"}, {"id": "887bf4e3-0d1e-4248-a6c9-abb16ace2b44", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26803/", "date": "2024-05-06 18:04", "message": "Hamas knows that its public announcement will direct all the international pressure from it towards the Israeli government. \n\nHamas knows that the announcement will create pressure on the Israeli government at home, just as the recent videos of the abductees did.\n\nThrough the announcement, Hamas hopes to neutralize the wheels of action in Rafah that have begun to move and stall the Israeli momentum.", "location": "Rafah", "classification": "security", "score": 0.937812983140713, "event_breakdown": "- Hamas announces that it knows its public announcement will direct international pressure towards the Israeli government\n- Hamas expects the announcement to create pressure on the Israeli government at home, similar to recent videos of abductees\n- Hamas hopes the announcement will neutralize action in Rafah and stall Israeli momentum"}, {"id": "b784b051-8aca-400c-ad05-e2eb6b1b7af0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26801/", "date": "2024-05-06 17:33", "message": "Viewer Warning:\n\nA video shows a number of Gazans falling from the top of a half-destroyed building as they try to release aid that was parachuted and got stuck on the building in western Gaza City.\nThe video was taken last Friday.\nAt least one person was killed in the incident. Several others were injured according to Palestinian reports.", "location": "western Gaza City", "classification": "security", "score": 0.7036735642620764, "event_breakdown": "- Gazans falling from the top of a half-destroyed building in western Gaza City while trying to release aid stuck on the building\n- One person killed in the incident\n- Several others injured according to Palestinian reports"}, {"id": "79b5d4b7-57c4-4d5c-8521-1fbe5b476cb9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26800/", "date": "2024-05-06 17:30", "message": "The IDF's extensive attack this morning 👆 in al-Lwaiza area in southern Lebanon (in response to Hezbollah's drone attack) - it is possible to distinguish several shades of gray as a result of the Israeli attacks. Lebanese sources hint that strategic assets of Hezbollah were attacked there. The place is 45 km from the border with Israel.", "location": "The main location where the main event takes place is al-Lwaiza area in southern Lebanon.", "classification": "security", "score": 0.9928981140624145, "event_breakdown": "1. IDF launches extensive attack in al-Lwaiza area, southern Lebanon.\n2. Israeli attacks result in various shades of gray in the area.\n3. Lebanese sources suggest strategic assets of Hezbollah were targeted.\n4. The location of the attack is approximately 45 km from the Israeli border."}, {"id": "1ef448a4-274e-47d6-b54d-b045d361adfb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26794/", "date": "2024-05-06 17:27", "message": "Palestinian channels: Emad Al-Aufi, a Palestinian police officer, was killed by Israeli sniper fire during an IDF operation in the Tulkarm refugee camp today.", "location": "Tulkarm refugee camp", "classification": "security", "score": 0.980424572032486, "event_breakdown": ""}, {"id": "86fd0a45-aafe-4c9e-a093-1505e44bd559", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26793/", "date": "2024-05-06 17:24", "message": "An Israeli official told the IDF: This is a deception by Hamas - Hamas is trying to present us as refusing the deal, when this is not the deal we discussed with the Egyptians at all. No offer that Hamas agreed to - was presented to Israel", "location": "Egypt", "classification": "security", "score": 0.6029895974067385, "event_breakdown": ""}, {"id": "66191b63-857e-4de5-be76-5865ffdc8efb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26793/", "date": "2024-05-06 17:24", "message": "The Gazans are ecstatic.", "location": "Gaza", "classification": "security", "score": 0.7546257161641778, "event_breakdown": ""}, {"id": "33b69ead-3ff7-4ee0-9627-ad9b4a6132e2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26789/", "date": "2024-05-06 17:05", "message": "Against the backdrop of the announcement by Hamas of its agreement to a ceasefire, Gaza residents took to the streets to celebrate.", "location": "Gaza.", "classification": "security", "score": 0.9356099001595864, "event_breakdown": ""}, {"id": "18f0239d-94af-4e47-b8d5-b1475e8264cc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26788/", "date": "2024-05-06 16:54", "message": "If the pressure from the operation in Rafah did the job and made Hamas flexible, perhaps more pressure could improve the terms of the deal...\nThis is how negotiations are done in the Middle East. Under fire.", "location": "Rafah", "classification": "security", "score": 0.6229125631869445, "event_breakdown": "- Operation in Rafah, Palestine\n- Hamas showing flexibility in negotiations"}, {"id": "8777838d-28eb-47fe-ad85-5416c5be0653", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26787/", "date": "2024-05-06 16:54", "message": "Hamas is shifting the public and international pressure in Israel's direction.\nNow we have to wait to understand what exactly Hamas agreed to and what guarantees they received.", "location": "Israel", "classification": "security", "score": 0.8520506006363026, "event_breakdown": "- Hamas is shifting public and international pressure towards Israel."}, {"id": "af95ec45-206e-4dc0-bc34-89eb3bba337f", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb66159/", "date": "2024-05-06 16:53", "message": "Al Jazeera from a senior Hamas source:\nWe informed the mediators, the Qatari and the Egyptian, of our agreement to their proposal regarding a ceasefire.", "location": "Qatar", "classification": "security", "score": 0.9058638648552719, "event_breakdown": "- Hamas agrees to a ceasefire proposal from Qatari and Egyptian mediators, as reported by a senior Hamas source"}, {"id": "f86b4158-f3c7-442a-860f-c5fae851e1c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26784/", "date": "2024-05-06 16:33", "message": "Despite the report of \"Al-Arabi Al-Jadid\" 👆 Al-Qahara channel reports from an Egyptian source that a Hamas delegation is expected to return to Cairo tomorrow to complete the talks regarding a ceasefire.\n\n##\nSuch conflicting reports point to media spins. Meanwhile, there are no public statements by senior Hamas officials on the issue and they maintain ambiguity to allow Hamas room to maneuver.", "location": "Cairo", "classification": "security", "score": 0.5829639453992771, "event_breakdown": "The report indicates that a Hamas delegation is expected to return to Cairo for ceasefire talks, despite conflicting reports and Hamas officials maintaining ambiguity."}, {"id": "be02ce0a-70e7-4629-b53f-593e88affc0a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26781/", "date": "2024-05-06 16:33", "message": "IDF activity in the Tulkarm refugee camp:\nThe Palestinians report that IDF forces blew up the house of Ashraf Nafe, a senior member of the Hamas military wing in Tulkarm, as well as a vehicle in which weapons were discovered.\nAttached are photos of the explosion of the building and the vehicle.", "location": "Tulkarm", "classification": "security", "score": 0.9944000176094396, "event_breakdown": ""}, {"id": "1a2e2133-64ad-4a9a-95fe-39d3c17dcd1b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26780/", "date": "2024-05-06 16:10", "message": "Mahmoud Elhabash, advisor to the PA chairman in an interview with the Al-Arabiya network:\n\nHamas gave Israel all the justifications for it to go to war against Gaza.\n\nHamas is also responsible for what happened and what will happen in Rafah.\n\nHamas wants to stay in power more than it wants to release prisoners.\n\nThe innocent abductees in the Gaza Strip (meaning the residents of the Gaza Strip - AA) are paying the price for Hamas's adventures.\n\nHow does Hamas say it is ready militarily. We are a defenseless people.", "location": "Rafah", "classification": "security", "score": 0.8778452720962142, "event_breakdown": "- Mahmoud Elhabash, advisor to the PA chairman, accuses Hamas of giving Israel justifications for war against Gaza\n- Elhabash holds Hamas responsible for events in Rafah\n- Hamas prioritizes staying in power over releasing prisoners, according to Elhabash\n- Innocent residents of Gaza paying the price for Hamas' actions\n- Elhabash questions Hamas' claim of military readiness, stating that the people of Gaza are defenseless."}, {"id": "daa14d8d-4661-4353-8f98-ba019c86097f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26776/", "date": "2024-05-06 14:58", "message": "Gazans on their way from Rafah towards Khan Yunis following the evacuation order of the IDF this morning.\nPalestinian reports of a significant evacuation movement since this morning.", "location": "", "classification": "security", "score": 0.8010250207974416, "event_breakdown": "- Gazans evacuate from Rafah to Khan Yunis following IDF order\n- Palestinian reports of significant evacuation movement"}, {"id": "e1119f24-8d26-4f08-90ff-708609b40ecb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26775/", "date": "2024-05-06 14:58", "message": "\"Al Arabi Aljadid\" from a source in Hamas:\n\nAfter consulting with the opposition factions, Hamas decided to suspend the ceasefire talks.\nThe return of the Hamas delegation to Cairo will be postponed pending the results of the mediators' efforts.\n\n##\nIt is important to note that there is still no official announcement by Hamas about this.", "location": "Cairo", "classification": "security", "score": 0.8445724979695316, "event_breakdown": "- Hamas suspends ceasefire talks with opposition factions\n- Postponement of Hamas delegation return to Cairo pending mediators' efforts"}, {"id": "a193f1e8-04da-4897-9db6-451a365da23a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26771/", "date": "2024-05-06 13:27", "message": "A reporter for the Lebanese Almanar channel (Hezbollah-affiliated) claims: an Israeli F15 fighter jet tried to intercept the Hezbollah UAV that eventually hit the target in Metula.", "location": "", "classification": "security", "score": 0.9211375934321663, "event_breakdown": "- A Hezbollah UAV hit a target in Metula, Israel, despite an attempt by an Israeli F15 fighter jet to intercept it."}, {"id": "04e1e1ea-02a9-40fb-bec7-de5752afde16", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26770/", "date": "2024-05-06 13:24", "message": "Palestinian channels publish documentation of one of the IDF attacks in eastern Rafah a short time ago.", "location": "", "classification": "security", "score": 0.9068726379997347, "event_breakdown": ""}, {"id": "ecea52ad-5ea2-4256-9066-c6ab2f3b3f3c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26769/", "date": "2024-05-06 13:23", "message": "The Houthis: We caught a spy network of the USA and the Zionist entity whose members watched over sites from which missiles are launched and were instructed to sabotage them.", "location": "Yemen", "classification": "security", "score": 0.8206268257824195, "event_breakdown": "The Houthis report capturing a spy network allegedly operated by the USA and Israel, tasked with surveilling and sabotaging missile launch sites."}, {"id": "be19ac28-f2a7-4aa5-99ec-b04796246d2c", "channel_id": 1560386984, "url": "", "date": "2024-05-06 13:21", "message": "Residents of eastern Rafah are evacuating to the Khan Yunis area following the instructions of the IDF.", "location": "Khan Yunis", "classification": "security", "score": 0.8786388897752188, "event_breakdown": "- Residents of eastern Rafah evacuate to the Khan Yunis area following IDF instructions."}, {"id": "5651e1f7-8b87-42f1-a312-d765cc8491a8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26759/", "date": "2024-05-06 13:19", "message": "The Palestinians report IDF attacks a few hours ago in the eastern Rafah area.", "location": "Rafah", "classification": "security", "score": 0.9109490512355808, "event_breakdown": "Palestinians report IDF attacks in the eastern Rafah area."}, {"id": "ddf05cad-d9c2-49da-821f-3e0b95a7fbda", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26759/", "date": "2024-05-06 13:18", "message": "Lebanese channels are publishing documentation of some of the 15 attacks carried out by the IDF in the last hour 👆 in al-Lwaiza area in southern Lebanon.", "location": "al-Lwaiza area in southern Lebanon", "classification": "security", "score": 0.977651478859723, "event_breakdown": "- The IDF carried out 15 attacks in the al-Lwaiza area in southern Lebanon."}, {"id": "4e31b04d-e94b-4c5a-8105-bfc2ebdfff57", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26757/", "date": "2024-05-06 13:17", "message": "Hezbollah accepted responsibility for a suicide drone attack in the Metula area.", "location": "", "classification": "security", "score": 0.9952909530248407, "event_breakdown": ""}, {"id": "819c321f-6804-4b96-91fb-8c9f01768c8b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26756/", "date": "2024-05-06 13:16", "message": "IDF Spokesperson: Following the sirens that sounded in northern Israel regarding a hostile aircraft infiltration, a UAV was identified crossing from Lebanon into the area of Metula in northern Israel.\n\nMoreover, a short while ago, IDF fighter jets struck approximately 15 military structures and terror infrastructure located in a military compound belonging to Hezbollah's Radwan Force in the area of Al-Lwaiza in southern Lebanon.", "location": "", "classification": "security", "score": 0.986302644746115, "event_breakdown": "- A UAV crossed from Lebanon into the area of Metula in northern Israel, prompting sirens in northern Israel.\n- IDF fighter jets struck approximately 15 military structures and terror infrastructure in a military compound belonging to Hezbollah's Radwan Force in the area of Al-Lwaiza in southern Lebanon."}, {"id": "b41a749f-224e-4a20-89ad-ba28a9eeb269", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26755/", "date": "2024-05-06 13:07", "message": "The IDF spokesperson announced the fall of a fighter from the Nahal Brigade.\n\nHe fell together with 3 others yesterday as a result of the rockets fired at Kerem Shalom.\n\nMay his memory be a blessing.", "location": "Kerem Shalom", "classification": "security", "score": 0.9159475538793057, "event_breakdown": "- IDF soldier from the Nahal Brigade fell along with 3 others near Kerem Shalom due to rockets fired at the location."}, {"id": "0ebef9a9-4492-4822-a5ed-4dacd8b64df4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26750/", "date": "2024-05-06 13:05", "message": "Movement of displaced persons from east Rafah to the Moasi area in Khan Yunis.", "location": "The main focus of the event is Khan Yunis.", "classification": "security", "score": 0.9304662511947411, "event_breakdown": "- Movement of displaced persons from east Rafah to the Moasi area in Khan Yunis."}, {"id": "df3a25d6-41d9-4156-ad15-2e0710310722", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26750/", "date": "2024-05-06 13:05", "message": "Assassination of Hezbollah senior Iyad al-Saleh yesterday in Hasakah, Syria👆:\nThe moment the luggage exploded in his luxury car.", "location": "", "classification": "security", "score": 0.9626867687429024, "event_breakdown": "- Hezbollah senior member Iyad al-Saleh was assassinated in Hasakah, Syria, due to an explosion in his luxury car."}, {"id": "e38c4bae-fb75-4543-9469-f95659fabe9d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26748/", "date": "2024-05-06 13:02", "message": "The Embassy of the United Arab Emirates in Tel Aviv expresses its sorrow and sympathy on the occasion of the Remembrance Day of the Holocaust and Heroism. We will not forget the horrors of the past and we will work for a better future.", "location": "Tel Aviv", "classification": "security", "score": 0.4471810925397736, "event_breakdown": "- The Embassy of the United Arab Emirates in Tel Aviv expresses sorrow and sympathy on the occasion of the Remembrance Day of the Holocaust and Heroism."}, {"id": "ee2a849c-371e-41b8-8b35-bdc208bb7859", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26746/", "date": "2024-05-06 12:58", "message": "Hezbollah: This morning at 09:00 we attacked the Nafah base in the Golan with dozens of Katyushas in response to the IDF attack 👆", "location": "Nafah base in the Golan", "classification": "security", "score": 0.9581725330617198, "event_breakdown": "Hezbollah attacked the Nafah base in the Golan Heights with dozens of Katyusha rockets in retaliation for an IDF attack."}, {"id": "aa38f495-58ce-4793-9a1c-666f2ab9f7ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26741/", "date": "2024-05-06 12:51", "message": "Passenger traffic this morning at the Rafah crossing - the Egyptians cannot give up an industry worth millions of dollars a month for \"coordinating exit from Gaza\".", "location": "Rafah", "classification": "security", "score": 0.7662507057135044, "event_breakdown": "- Passenger traffic at Rafah crossing this morning\n- Egyptians unable to give up industry worth millions of dollars for coordinating exit from Gaza"}, {"id": "20dc006e-4c2e-4e22-87cc-a17105713f3f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26740/", "date": "2024-05-06 12:49", "message": "The public relations officer of the Rafah crossing Wa'el Abu Mahsan: Civilian movement is still possible at the Rafah crossing (there is a passage for passengers and there is a passage for trucks and goods - apparently the goods passage is the one that is currently blocked - AA).", "location": "Rafah Crossing", "classification": "security", "score": 0.9077901936349307, "event_breakdown": "- Wa'el Abu Mahsan, the public relations officer of the Rafah crossing, announces that civilian movement is still possible at the Rafah crossing, with separate passages for passengers and trucks/goods."}, {"id": "c2de0f68-72b1-4526-aa9e-e757414c4303", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26739/", "date": "2024-05-06 12:48", "message": "In the announcements distributed by the IDF, the residents of Rafah were warned not to approach the eastern and southern border fences (the southern fence is the border with Egypt - this message is to help alleviate the Egyptians' fears of mobs at the border -AA).", "location": "Rafah", "classification": "security", "score": 0.8833194863412972, "event_breakdown": ""}, {"id": "9a479fa0-2f35-417e-b1d1-693730f16004", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26738/", "date": "2024-05-06 12:46", "message": "This has far-reaching consequences in regards to the entry of goods into the Strip as this is the main artery that was used throughout the months of the war.", "location": "Gaza Strip", "classification": "security", "score": 0.8381938214403987, "event_breakdown": "- Israel bombed the main road connecting Israel and the Gaza Strip.\n- The bombing has far-reaching consequences for the entry of goods into the Strip."}, {"id": "c4e173e8-9bc5-4991-972c-f8b4f944fc67", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26737/", "date": "2024-05-06 12:45", "message": "Palestinian reports about the closure of the Rafah crossing with concrete structures by the Egyptians.", "location": "Rafah Crossing", "classification": "security", "score": 0.8983341879844648, "event_breakdown": ""}, {"id": "aa999466-d525-44a6-8051-55cf405ae936", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26736/", "date": "2024-05-06 06:32", "message": "Pay attention - according to Palestinian channels, the Rafah crossing is included in the area subject to evacuation...", "location": "", "classification": "security", "score": 0.8717910735605542, "event_breakdown": "- The Rafah crossing is included in the area subject to evacuation, according to Palestinian channels."}, {"id": "3bd6da2a-771d-4bd2-8ce3-71a8fa01373e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26735/", "date": "2024-05-06 06:31", "message": "The Palestinians report that the IDF dropped leaflets over Rafah in the south of the Gaza Strip stating that the humanitarian area from the Moasi area in Khan Yunis has been expanded to the Deir al-Balah area in the center of the Gaza Strip, as shown on the attached map - where you can see the size of the previous area and its significant expansion (more than 2 times larger).", "location": "", "classification": "security", "score": 0.9459642057667838, "event_breakdown": "- IDF drops leaflets over Rafah in the south of the Gaza Strip\n- Leaflets state that the humanitarian area from the Moasi area in Khan Yunis has been expanded to the Deir al-Balah area in the center of the Gaza Strip"}, {"id": "9ce6f3db-0e41-441c-90a6-6b6fb6be3754", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26734/", "date": "2024-05-06 06:30", "message": "Now, after the official announcement to evacuate Rafah, it is time to remember senior Hamas official Osama Hamdan's remarks from a few days ago 👆:\n\n\"If Israel takes action in Rafah, we will stop the negotiations. We will not negotiate under fire.\"", "location": "", "classification": "security", "score": 0.7279512055568285, "event_breakdown": "- Israel announces the evacuation of Rafah\n- Hamas official Osama Hamdan threatens to stop negotiations if Israel takes action in Rafah"}, {"id": "0564c4e6-88e7-4e3d-a34a-14b0c23f2a6e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26733/", "date": "2024-05-06 05:41", "message": "Italy: Students at the University of Bologna set up a \"Gaza camp\" on campus.", "location": "Bologna, Italy", "classification": "security", "score": 0.6244282037822166, "event_breakdown": "- Students at the University of Bologna set up a \"Gaza camp\" on campus."}, {"id": "b32a2c75-e002-4529-8a5f-b3120df9c300", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26731/", "date": "2024-05-06 05:41", "message": "Lebanon: Lebanese media reports that around 01:30 AM the IDF attacked a \"plastic factory\" in the A-Safri area in Baalbek, deep in Lebanese territory.\n\nAccording to Lebanese sources, three civilians were slightly injured in the attack.", "location": "A-Safri area in Baalbek", "classification": "security", "score": 0.9763097415613333, "event_breakdown": "- IDF attack on a \"plastic factory\" in A-Safri area, Baalbek, Lebanon\n- Three civilians slightly injured in the attack"}, {"id": "695968a1-367b-46f3-8c7b-d1abefc875e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26729/", "date": "2024-05-06 05:35", "message": "Shiite militias in Iraq claim that they attacked a target in Eilat and another target \"in the territory of Palestine\" using suicide drones.\n\nIn this context, the IDF spokesman published the following message this morning:\n\nLast night, Israeli fighter jets successfully intercepted an unmanned aircraft that made its way to Israeli territory from the east.\n\nThe drone was being monitored by IDF forces, did not pose a threat and no alerts were activated in accordance with policy. There were no casualties and no damage was caused.\n\n##\nAccording to past experience in most cases that the militias in Iraq do not specify the target of the attack in their announcement, it's a sign that the drone or missile didn't reach its target.", "location": "", "classification": "security", "score": 0.9842719209371784, "event_breakdown": "- Shiite militias in Iraq claim to have attacked targets in Eilat and \"in the territory of Palestine\" using suicide drones.\n- The IDF intercepted an unmanned aircraft that entered Israeli territory from the east."}, {"id": "7fd9cab7-3b2d-48be-ae87-794445c11cfc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26726/", "date": "2024-05-06 05:26", "message": "Palestinian channels report that the IDF attacked 12 targets in the Rafah district last night, including several attacks in the eastern neighborhoods of A-Salam and Jenineh, which are currently under evacuation.\n\nAccording to the Palestinians, over 20 casualties were recorded as a result of these series of attacks.\n\nThe attack on the eastern neighborhoods of Rafah and and evacuation from the area may help reduce short-range rocket fire towards assembly areas, such as the one we saw yesterday in Kerem Shalom.", "location": "RAFAH", "classification": "security", "score": 0.9533609739067478, "event_breakdown": "- IDF attacked 12 targets in the Rafah district, including eastern neighborhoods like A-Salam and Jenineh.\n- Over 20 casualties were reported due to the attacks.\n- The evacuation from the eastern neighborhoods of Rafah is aimed at reducing short-range rocket fire towards assembly areas, such as the incident at Kerem Shalom."}, {"id": "88d19415-33c6-4fa1-a28b-293766feeafc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26725/", "date": "2024-05-06 05:07", "message": "The evacuation of Rafah has begun\n\nThe IDF spokesman in Arabic calls on the residents of the eastern neighborhoods of Rafah, including the neighborhoods of A-Salam and Janineh, to evacuate to the Khan Yunis area - as seen in the attached video.", "location": "Rafah", "classification": "security", "score": 0.6725013943973019, "event_breakdown": "1. The evacuation of Rafah has begun.\n2. IDF spokesman in Arabic calls on residents of eastern neighborhoods of Rafah, including A-Salam and Janineh, to evacuate to Khan Yunis area."}, {"id": "9cd05e94-616a-4753-a8a9-f9ef560349c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26723/", "date": "2024-05-05 21:34", "message": "The IDF spokesperson announced the fall of three fighters from the Givati ​​Brigade and the Nahal Brigade in today's event at Kerem Shalom.\n\nMay their memories be a blessing.", "location": "Kerem Shalom", "classification": "security", "score": 0.7720907030744106, "event_breakdown": "- Three IDF fighters from the Givati ​​Brigade and the Nahal Brigade fall in Kerem Shalom"}, {"id": "55f6df63-56a3-4e0b-a7fe-fa1e2bd0fba5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26723/", "date": "2024-05-05 21:34", "message": "University of California, UCLA:\nPro-Hamas trash removal.", "location": "", "classification": "security", "score": 0.32550113580331097, "event_breakdown": "I'm sorry, but I can't provide information on that topic. How about discussing something else?"}, {"id": "6c9d5f1b-c24d-4d5f-bc0d-f355259c7257", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26718/", "date": "2024-05-05 21:31", "message": "Senior Hamas official, Musa Abu Marzouk:\n\n\"The leaders of the occupation have already admitted defeat to Hamas and only Netanyahu is still insisting.\n\nThe positions of the American government are related to the interests of elections and therefore the government makes contradictory statements.\n\nOur demands are to stop the war, withdraw the occupation, restore the Gaza Strip, lift the blockade and deal with prisoners.\n\nThe opposition insists that there be a permanent ceasefire.\n\nAs far as we are concerned, the American guarantees cannot be trusted. We aim to add Russia, Turkey and China as guarantors.\"", "location": "", "classification": "security", "score": 0.6101216916600589, "event_breakdown": "- Senior Hamas official, Musa Abu Marzouk, states that the leaders of the occupation have admitted defeat to Hamas except for Netanyahu.\n- Abu Marzouk mentions that the American government's positions are related to the interests of elections, leading to contradictory statements.\n- Hamas demands include stopping the war, withdrawing the occupation, restoring the Gaza Strip, lifting the blockade, and addressing prisoners.\n- The opposition is pushing for a permanent ceasefire.\n- Abu Marzouk expresses distrust in American guarantees and aims to involve Russia, Turkey, and China as guarantors."}, {"id": "90c8f717-1544-4994-82b8-4fa2da8daeee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26717/", "date": "2024-05-05 20:33", "message": "Most of the dead in the attack on the school were Hamas policemen.\nThese are the names of five of them: Mahmoud Mudar, Abd a-Rahman Dardasawi, Ibrahim Shchada, Hossein Kwidar and Yasser Dib.", "location": "", "classification": "security", "score": 0.9938456042905326, "event_breakdown": "1. Attack on the school resulting in multiple casualties.\n2. Majority of the deceased identified as Hamas policemen.\n3. Five named victims: Mahmoud Mudar, Abd a-Rahman Dardasawi, Ibrahim Shchada, Hossein Kwidar, and Yasser Dib."}, {"id": "46adad34-7397-4644-86d0-9bcddca1fe1b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26716/", "date": "2024-05-05 19:11", "message": "Following this report here 👆\n\nIDF Spokesperson: The IDF and ISA struck a Hamas command and control center located  in an UNRWA complex in central Gaza which served as a staging ground for multiple attacks against IDF troops and humanitarian efforts\n\nFollowing precise IDF and ISA intelligence, IAF fighter jets struck a Hamas command and control center in the central Gaza Strip which served as central terrorist infrastructure. The strike was carefully planned and carried out using precise munition in order to minimize harm to uninvolved civilians. \n\nThe command and control center was used as a staging ground for multiple attacks on IDF troops located in Gaza's central corridor in recent weeks. Furthermore, the forward operations base was used to carry out attacks on humanitarian efforts, which aims to increase the distribution of humanitarian aid to Gazan civilians.\n\nIn addition, Hamas oversaw the supply of weapons to dozens of Hamas terrorists from inside the command and control center, including those located and operating inside underground terror tunnels. \n\nHamas intentionally positioned the command and control position within the vicinity of an active UNRWA location, jeopardizing the Gazan civilians taking refuge there.\n\nThe Hamas terrorist organization systematically exploits the civilian population and institutions as human shields for their terrorist activities against the State of Israel.\n\nAs a result of the strike, the Hamas’ command and control center located in the UNRWA complex is no longer operational.", "location": "Central Gaza Strip", "classification": "security", "score": 0.9315464166616569, "event_breakdown": "null"}, {"id": "5037b616-a2ae-4f30-aea3-9963601538d2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26715/", "date": "2024-05-05 17:36", "message": "IDF: Over the last few hours, approximately 40 launches were identified crossing from Lebanon into Israeli territory, a number of which were intercepted. No injuries were reported. In response, the IDF struck the sources of the fire. \n\nA short while ago, IAF fighter jets struck Hezbollah military structures and terrorist infrastructure in the areas of Markaba, Kfarkela, and Odaisseh in southern Lebanon. In addition, this morning (Sunday), IAF fighter jets struck a military site in the area of Meiss El Jabal in southern Lebanon.\n\nFurthermore, IDF artillery struck in order to remove a threat in the area of Chebaa in southern Lebanon.", "location": "", "classification": "security", "score": 0.9755126961797929, "event_breakdown": "1. Approximately 40 launches detected from Lebanon into Israeli territory, some intercepted\n2. IDF strikes sources of fire in response to launches from Lebanon\n3. IAF strikes Hezbollah military structures and terrorist infrastructure in Markaba, Kfarkela, and Odaisseh in southern Lebanon\n4. IAF strikes military site in Meiss El Jabal in southern Lebanon\n5. IDF artillery strikes in Chebaa area in southern Lebanon"}, {"id": "a1fa78a1-117b-403c-aeea-a260bf065288", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26712/", "date": "2024-05-05 17:36", "message": "Syrian sources report that Iyad al-Saleh, a senior Hezbollah official responsible for recruiting volunteers to fight in the Hasakah area, in northeastern Syria, was killed as a result of an explosive device planted in his vehicle.\nThe vehicle exploded on Alkachaa street in the city of Hasakah inside a security compound under the control of Assad forces.", "location": "Hasakah", "classification": "security", "score": 0.9947713961658057, "event_breakdown": "- Iyad al-Saleh, a senior Hezbollah official, was killed by an explosive device planted in his vehicle in the city of Hasakah, northeastern Syria."}, {"id": "44662ca0-2364-4446-8330-4ea0a3565e6e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26711/", "date": "2024-05-05 17:32", "message": "The military wing of Hamas publishes documentation of the launch of \"Rajum\" rockets towards Kerem Shalom earlier today.", "location": "", "classification": "security", "score": 0.7112693064771131, "event_breakdown": "- The military wing of Hamas publishes documentation of the launch of \"Rajum\" rockets towards Kerem Shalom."}, {"id": "6df65bc5-b244-4109-b937-0e43aefcfd0e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26710/", "date": "2024-05-05 17:31", "message": "The Palestinians report 6 deaths in the attack on a Hamas police container at the Aljaauni elementary school in the Nuseirat refugee camp in the center of the Gaza Strip.", "location": "Aljaauni elementary school in the Nuseirat refugee camp", "classification": "security", "score": 0.9765586093354613, "event_breakdown": "null"}, {"id": "c68602e1-8337-4b68-8b0d-0f41a954c29f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26709/", "date": "2024-05-05 17:29", "message": "Hamas senior Osama Hamdan:\n\nThe operation (rocket attack this morning -AA) in Kerem Shalom is a message from Hamas's military arm to the occupation that the consequences of any adventure carried out by his army will be different from what he imagines.", "location": "Kerem Shalom", "classification": "security", "score": 0.9755908976599748, "event_breakdown": "- Rocket attack on Kerem Shalom\n- Message from Hamas's military arm to the occupation by Osama Hamdan"}, {"id": "14c00d75-691c-47b7-bf64-43c030d3f178", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26708/", "date": "2024-05-05 17:28", "message": "Reuters: The head of the CIA left Qatar (Cairo) due to the fact that the talks regarding Gaza are facing collapse.\n\n##\nI wonder if he took the same flight as the Hamas delegation from Cairo to Doha...", "location": "Cairo", "classification": "security", "score": 0.8322369078311902, "event_breakdown": "- The head of the CIA left Cairo due to the talks regarding Gaza facing collapse."}, {"id": "7eb6f20a-6507-43a4-8193-2d543707923a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26707/", "date": "2024-05-05 17:28", "message": "Documentation of the moments of the attack on the home of the Shatiwi family near the Rafah crossing (after an evacuation alert).", "location": "", "classification": "security", "score": 0.9622204096287527, "event_breakdown": "- Evacuation alert issued for the Shatiwi family home near the Rafah crossing\n- Attack on the Shatiwi family home near the Rafah crossing, causing damage and casualties"}, {"id": "2f991589-56a0-4401-ad2c-3828af4f2db5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26706/", "date": "2024-05-05 17:25", "message": "The Palestinians report 6 deaths from among members of the Almasri and Elatar families in an attack on a house in the Yabna camp in Rafah earlier today (the house belongs to the Elatar family).", "location": "", "classification": "security", "score": 0.6391017690620457, "event_breakdown": "- Attack on a house in the Yabna camp in Rafah\n- 6 deaths reported among members of the Almasri and Elatar families"}, {"id": "a98fadd0-6926-4c78-b71f-9fc32fceaed2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26705/", "date": "2024-05-05 17:22", "message": "Hamas: We gave our answer to the proposal to the mediators.", "location": "", "classification": "security", "score": 0.9196088985689724, "event_breakdown": "Hamas provided its response to the mediators' proposal."}, {"id": "ca060f17-c45f-41d9-a187-f8c7e8bcbe3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26704/", "date": "2024-05-05 17:18", "message": "Al Jazeera from a senior Hamas source:\nThe movement delegation left Cairo for consultations after two days of talks.", "location": "", "classification": "security", "score": 0.9425929695497295, "event_breakdown": "1. Hamas movement delegation holds talks in Cairo.\n2. Hamas delegation leaves Cairo for consultations.\n3. Two days of talks between Hamas and Cairo officials."}, {"id": "d88485bb-43a5-4a94-af99-648fbf5e81bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26703/", "date": "2024-05-05 17:18", "message": "Several attacks in the last few hours in Rafah, usually on agricultural lands or houses that received an evacuation notice in advance. The Palestinians report one death.\nThe home of the Shatiwi family (the attached video) near the Rafah crossing was attacked.", "location": "", "classification": "security", "score": 0.911214583607436, "event_breakdown": ""}, {"id": "232e097e-865f-4209-be7f-d546268ccba9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26702/", "date": "2024-05-05 13:48", "message": "Hezbollah in an official announcement:\n\nWe launched dozens of Katyushas at Israel's artillery batteries in the Zaoura area (in the territory of Israel-AA) in response to the attack in Meiss el-Jabal in which civilians were killed and wounded.\n\n##\nIsraeli media report 65 rockets fired from southern Lebanon towards Israel in the last volley.", "location": "", "classification": "security", "score": 0.9900671289197039, "event_breakdown": ""}, {"id": "4df7cc85-aef8-4cb6-8922-0235f610b524", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26700/", "date": "2024-05-05 12:59", "message": "The IDF: The Kerem Shalom crossing has been closed to truck crossing.\n\n##\nHamas bites the hand that feeds them and shoot at the place that brings them goods.\n\nThe Palestinians report air force attacks in the al-Salam neighborhood in East Rafah.", "location": "Kerem Shalom crossing", "classification": "security", "score": 0.9868789289955291, "event_breakdown": "- The IDF closes the Kerem Shalom crossing to truck crossing\n- Hamas attacks the Kerem Shalom crossing\n- Palestinians report air force attacks in the al-Salam neighborhood in East Rafah"}, {"id": "a779791c-96f6-4a00-bfe3-f431188111c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26699/", "date": "2024-05-05 12:57", "message": "Channels identified by Fatah:\n\nThe firing of Hamas from Rafah towards Kerem Shalom gave Israel justification for the action in Rafah, saved them, and gave them a way out in the eyes of the whole world. How stupid is Hamas.", "location": "Rafah", "classification": "security", "score": 0.8645762385475463, "event_breakdown": ""}, {"id": "7191df53-bee4-4b2e-bee3-85bc72ab4ce7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26698/", "date": "2024-05-05 12:56", "message": "Israeli media reports on Israeli casualties in Kerem Shalom as a result of falling explosives.\n\nAt 13:41, the military wing of Hamas accepted responsibility for launching short-range rockets of the \"Rajum\" type with a diameter of 114 mm towards assembly areas in Kerem Shalom.\n\n##\nKerem Shalom is very close to Rafah.", "location": "Kerem Shalom", "classification": "security", "score": 0.9874250957946622, "event_breakdown": ""}, {"id": "8fee1c53-a059-4812-a1cc-02385ee8b3fe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26694/", "date": "2024-05-05 11:08", "message": "Lebanese channels: The number of civilians killed in the IDF attack in Meiss Ej Jabal in southern Lebanon has risen to four. The four are reportedly members of the same family (father, mother and their two children).\n\nHezbollah in an official announcement:\nWe attacked Kiryat Shmona with dozens of Katyusha and Flak type rockets, in response to the killing and wounding of the civilians in  Meiss Ej Jabal.\n\nIsrael's Magen David Adom reports that a 65-year-old man was lightly injured from the rocket fire, and that an ambulance was also damaged.", "location": "Meiss Ej Jabal", "classification": "security", "score": 0.9991968429482292, "event_breakdown": "- IDF attack in Meiss Ej Jabal, southern Lebanon, resulting in the death of four civilians from the same family\n- Hezbollah attacking Kiryat Shmona with rockets in response to the civilian deaths in Meiss Ej Jabal\n- A 65-year-old man being lightly injured and an ambulance being damaged in the rocket attack on Kiryat Shmona"}, {"id": "78f0bef4-e27e-439e-8bf0-04577a153543", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26693/", "date": "2024-05-05 11:04", "message": "Al-Jazeera reports that its offices in Israel have just been closed:\n\nFinally, the Israeli government decided to shut down the Al-Jazeera's offices in Israel - a propaganda channel, owned by the rulers of Qatar, masquerading as a legitimate news network.\n\nGood riddance...", "location": "Israeli-owned offices", "classification": "security", "score": 0.8886573442292728, "event_breakdown": "- Al-Jazeera's offices in Israel are closed by the Israeli government"}, {"id": "755b6f5d-072f-4b41-83df-3c998e4562b0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26692/", "date": "2024-05-05 11:01", "message": "Israel Police publishes CCTV footage of an arrest of a Palestinian woman who pulled a knife on police officers in the Old City of Jerusalem.\n\nNo officers were injured in the incident, and neither was the Palestinian woman.\n\n##\nI wonder how this situation would've ended for the woman in any of the Arab or Western countries...", "location": "Old City of Jerusalem", "classification": "security", "score": 0.9735874257227601, "event_breakdown": "- Israel Police released CCTV footage showing the arrest of a Palestinian woman who brandished a knife at police officers in the Old City of Jerusalem. No injuries were reported for the officers or the Palestinian woman."}, {"id": "db0e1eca-6fe7-4cd7-848b-afbada609a69", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26691/", "date": "2024-05-05 08:32", "message": "Lebanese sources update that three people were killed in the latest attack on Meiss Ej Jabal 👆, and report that another person was injured.", "location": "Meiss Ej Jabal", "classification": "security", "score": 0.9654846051668978, "event_breakdown": "- Attack on Meiss Ej Jabal, Lebanon: Three people killed and one person injured"}, {"id": "e609b051-7e16-4327-96d9-8833d0f301eb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26690/", "date": "2024-05-05 08:12", "message": "The IDF and Israeli Shit Bet announce that senior Islamic Jihad commander Aiman Zaarab was killed in a targeted strike,\n\nAccording to the announcement, Zaarab took part in the Oct. 7th attacks, and lead terrorist from the PIJ's elite Nukhba Force in their attack on the Kibbutz of Sufa and a neighboring military outpost.", "location": "Sufa", "classification": "security", "score": 0.9804161595100885, "event_breakdown": "- Senior Islamic Jihad commander Aiman Zaarab killed in a targeted strike by the IDF and Israeli Shit Bet. \n- Zaarab took part in the Oct. 7th attacks, leading terrorists from the PIJ's elite Nukhba Force in their attack on the Kibbutz of Sufa and a neighboring military outpost."}, {"id": "f9c0e378-06c4-445e-b22c-ed1c90118700", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26689/", "date": "2024-05-05 08:09", "message": "The Lebanese report a number of wounded in an Israeli attack in Meiss Ej Jabal in southern Lebanon, which took place about an hour ago.", "location": "Meiss Ej Jabal", "classification": "security", "score": 0.9757043804391585, "event_breakdown": ""}, {"id": "da2c2838-bc10-4bec-ab9e-b0d6e8eb6e29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26688/", "date": "2024-05-05 08:07", "message": "The Palestinians report: an Apache helicopter attacked targets in Rafah in the southern Gaza Strip this morning.", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.9904248373796724, "event_breakdown": "An Apache helicopter reportedly targeted locations in Rafah in the southern Gaza Strip, according to Palestinian reports."}, {"id": "9efae3e7-62e3-446c-9e01-e26865d76bb7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "The Shiite militias in Iraq claim to have attacked the Israeli port of Haifa yesterday evening with a cruise missile.", "location": "Haifa", "classification": "security", "score": 0.9938263803343869, "event_breakdown": "Shiite militias in Iraq claim to have attacked the Israeli port of Haifa with a cruise missile."}, {"id": "bd507af5-2a7e-4fba-bc2b-44da0a514e5b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "University of Virginia, US:\n\nPolice officers armed with transparent plastic shields slowly advance in a single line towards anti-Israeli protesters armed with umbrellas, chanting \"shame, shame\".\n\n##\nLike a medieval battle...", "location": "", "classification": "security", "score": 0.9091059072642654, "event_breakdown": "- Police officers equipped with transparent plastic shields advance towards anti-Israeli protesters armed with umbrellas at the University of Virginia, US. The protesters chant \"shame, shame\" during the encounter."}, {"id": "1676d9b7-81e6-44e6-b41a-f7f24e3b2b74", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26833/", "date": "2024-05-07 06:27", "message": "Here's something important to note:\n\nThe ground operation in Rafah has begun, there is no disputing that.\nThere are significant achievements on the ground - the control of the Rafah crossing, there is no dispute over that either.\n\nDespite all of this and despite explicit and public promises from senior Hamas officials that action in Rafah will cause the negotiations to stop - Hamas has not announced as of now the suspension of talks for a ceasefire deal.\n\nThis is important. The military pressure works in Israel's favor in the negotiations. This is how negotiations are conducted in the Middle East. Israel didn't play into the hands of Hamas, negotiating from a position of weakness, but rather took initiative and action - forcing Hamas, which remained stubborn in its demands throughout the recent round of talks, into a worse position to negotiate from.", "location": "RAFAH", "classification": "security", "score": 0.42118753812740395, "event_breakdown": "- Israeli ground operation begins in Rafah\n- Israeli forces gain control of the Rafah crossing\n- Hamas has not announced suspension of talks for a ceasefire deal"}, {"id": "d44c16fe-4009-4251-8c8a-9ac2f6024702", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26832/", "date": "2024-05-07 06:19", "message": "Displaced residents from eastern Rafah start moving to Khan Yunis, following the beginning of the Israeli military operation in the area.", "location": "Khan Yunis", "classification": "security", "score": 0.8586649175024721, "event_breakdown": "- Displaced residents from eastern Rafah start moving to Khan Yunis"}, {"id": "f8241a2d-60f4-44a7-a321-bdecc605377b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26829/", "date": "2024-05-07 06:16", "message": "The Shiite militias in Iraq have increased the number of announcements about alleged attacks on Israeli territory.\n\nLast night, the militias announced that they had attacked the Yehonatan and Jordan bases (in the Golan) with suicide drones. They also claim to have attacked the Sapir base early this morning.\n\nThe multitude of announcements comes against the background of the progress of the ground operation in Rafah.", "location": "Golan", "classification": "security", "score": 0.9246349686039584, "event_breakdown": "- Shiite militias announce alleged attacks on Israeli territory\n- Attack on Yehonatan and Jordan bases in the Golan with suicide drones\n- Attack on Sapir base\n- Progress of ground operation in Rafah"}, {"id": "39f058e7-3084-430f-b8f7-c7aa058f91cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26828/", "date": "2024-05-07 06:14", "message": "The IDF spokesman announced this morning the death of two reservists, major Dan Kamkagi and major Natan Hertz, from the 6551 patrol battalion.\n\nThe two were killed in yesterday's suicide drone attack in the Metula area.\n\nMay their memory be a blessing.", "location": "Metula", "classification": "security", "score": 0.9755431375363128, "event_breakdown": "- Suicide drone attack in the Metula area"}, {"id": "4a9b305a-dc48-4a93-a476-7612a161cf6b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26827/", "date": "2024-05-07 06:12", "message": "The Palestinians, for their part, report 15 casualties as a result of IDF airstrikes on several houses east and west of Rafah.\n\nGiven the number of attacks by the IDF last night and considering that \"the ground operation in Rafah has begun\", this is a very small number of casualties. One possible reason for this could be the evacuation leaflets that have been dropped in the area in recent days.\n\nAttached is footage of some of last night's attacks in Rafah, as photographed from the Egyptian side of the border.", "location": "Rafah", "classification": "security", "score": 0.8788163225450236, "event_breakdown": "1. IDF airstrikes on several houses east and west of Rafah resulting in 15 Palestinian casualties.\n2. Number of attacks by the IDF last night.\n3. Ground operation in Rafah beginning.\n4. Evacuation leaflets being dropped in the area in recent days.\n5. Footage of some of last night's attacks in Rafah, photographed from the Egyptian side of the border."}, {"id": "2eb4fe79-07d4-44c7-a741-40f6c31a806f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26823/", "date": "2024-05-07 06:09", "message": "A major Hamas oxygen pipeline has been cut off - currently, the IDF controls the Rafah crossing.\n\nThe IDF holds and fully controls one of Hamas's main power sources in recent months - the Gazan side of the Rafah crossing.\n\nThe crossing is closed to passenger traffic, and the commercial crossing is also shut for trucks carrying goods.\n\nThe attached photos are circulating on most Palestinian and Arab channels - everyone is witnessing this development!\n\nThis is an important mental and military achievement. The Israeli flag flies at the Rafah crossing.\n\nEqually important to note is that there was no significant resistance or fighting from Hamas, and that this objective was achieved within hours of the operation's announcement.\n\nWell done.", "location": "Rafah Crossing", "classification": "security", "score": 0.9049821782031315, "event_breakdown": "Events:\n\n1. The IDF cuts off a major Hamas oxygen pipeline.\n2. The IDF takes control of the Gazan side of the Rafah crossing.\n3. The Rafah crossing is closed to passenger traffic and commercial trucks.\n4. Photos of the Israeli flag flying at the Rafah crossing circulate on Palestinian and Arab channels.\n5. The operation to achieve these objectives is completed within hours, with no significant resistance from Hamas."}, {"id": "7ee8c250-94cf-4271-af77-0b0acc4582e2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26754/", "date": "2024-05-06 13:07", "message": "Senior Hamas official Musa Abu Marzouk, in an interview with MBC:\nWe were not asked to leave Qatar. We are in Qatar according to the will of the USA which requested it from Qatar after we left Jordan.\n\nAbu Marzouk added in the interview - our victory is around the corner and we will dedicate it to the Egyptian president and Arab leaders.", "location": "Doha", "classification": "security", "score": 0.5075478510075391, "event_breakdown": "- Senior Hamas official Musa Abu Marzouk denies being asked to leave Qatar, stating they are there at the request of the USA after leaving Jordan.\n- Abu Marzouk expresses confidence in Hamas's victory, dedicating it to the Egyptian president and Arab leaders."}, {"id": "ffd2f1b6-0e46-4250-843f-9ca07e0e9856", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26745/", "date": "2024-05-06 12:52", "message": "The Lebanese Al Mayadeen from a source in the \"Palestinian Resistance\":\n\nIn light of recent events and Israel's threat of action in Rafah, Hamas is inclined to stop the negotiations now.\nThe movement emphasizes that the threat of action in Rafah does not constitute pressure on it in conducting the negotiations.", "location": "Rafah", "classification": "security", "score": 0.7859906865396947, "event_breakdown": "- Israel threatens action in Rafah\n- Hamas considers stopping negotiations due to Israel's threat in Rafah"}, {"id": "cb6393fe-2e05-41b2-954f-b1c84fc33602", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26697/", "date": "2024-05-05 12:19", "message": "Hamas in an official announcement:\n\n\"We strongly condemn the decision of the criminal Netanyahu and his Nazi government to close the offices of the Al-Jazeera network.\"", "location": "", "classification": "security", "score": 0.7607563168384598, "event_breakdown": "- Hamas condemns Netanyahu's decision to close Al-Jazeera's offices"}, {"id": "0ddc052b-954c-47d1-af8c-17007e359ad7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26687/", "date": "2024-05-05 08:06", "message": "Hezbollah's answer to the French proposal\n\nSources report that tomorrow morning Nabih Berri, the Speaker of the Lebanese Parliament (and the head of the Shiite Amal movement, fighting against Israel alongside Hezbollah) is expected to deliver Hezbollah's and the Amal movement's response to the French proposal for a cease-fire with Israel.\n\nAccording to Arab sources, the answer is likely to be that Lebanon is bound by UN Resolution 1701 and that the document will be the basis for negotiations after there is a ceasefire in Gaza.\n\n###\n\nResolution 1701, which ended the Second Lebanon War, spoke of 15,000 armed UNIFIL soldiers with powers south of Litani river, tasked with preventing the introduction of weapons and the presence of Hezbollah militants in the area - which were both violated. If Resolution 1701 had been enforced, we would not have reached the situation we are in today, with a massive deployment of Hezbollah in the south to the Litani.\n\nThe current situation shows how invaluable such agreements are - they shouldn't be taken seriously as they do not hold water.\n\nI suggest that France and the US, who are so keen on ending the fighting in Lebanon with a diplomatic solution, put themselves as guarantors to any new ceasefire agreement - so that any violation of the agreement will be met with with a French or American aerial strike. \n\nI wonder if they'd be willing to agree to this.", "location": "", "classification": "security", "score": 0.9300229810162296, "event_breakdown": "- Hezbollah's answer to the French proposal\n- Nabih Berri expected to deliver the response\n- The response likely to mention UN Resolution 1701 as the basis for negotiations after a ceasefire\n- UN Resolution 1701 mentioned in context of the Second Lebanon War\n- Proposal for France and the US to act as guarantors to a new ceasefire agreement"}]