[{"id": "00ba0428-d59d-47d2-bcab-8741a6ed2a29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32562/", "date": "2024-08-17 06:30", "message": "Muhammad bin Zayed, the ruler of the United Arab Emirates came to demand the safety of the prime minister of the Taliban (Afghanistan) who is hospitalized in one of the hospitals in Abu Dhabi (United Arab Emirates).", "location": "Abu Dhabi", "classification": "security", "score": 0.8915810305920745, "event_breakdown": "Current events of security reported in the provided text that can be placed on a map include:\n\n* The hospitalization of the prime minister of the Taliban in Abu Dhabi, United Arab Emirates\n\nRelevant information about the hospitalization event:\nTarget Event: The hospitalization of the prime minister of the Taliban in Abu Dhabi, United Arab Emirates\nLocation: Abu Dhabi, United Arab Emirates"}, {"id": "db499988-3f53-4eba-9cca-0434a4ad1951", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32558/", "date": "2024-08-17 06:29", "message": "The Palestinians report 15 deaths tonight in an attack on a shed belonging to the al-Ajala family in the a-Zuwayda area in the center of the Gaza Strip.\n\nAmong the dead, the father of the family, Sami al-Ajala.", "location": "Gaza Strip", "classification": "security", "score": 0.9713742066668102, "event_breakdown": "Father of the family, Sami al-Ajala, reported killed in an attack on shed in the a-Zuwayda area of Gaza Strip."}, {"id": "4286ca42-8705-4873-b639-7eb3059991a0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32557/", "date": "2024-08-17 06:27", "message": "The area that was attacked in Nabatieh in southern Lebanon as it appears this morning.", "location": "NABATIEH", "classification": "security", "score": 0.9922138248681283, "event_breakdown": "There are several current events of security reported in text that can be placed on a map. Here are a few examples:\n\n* In Lebanon, an attack took place in Nabatieh, south of the country. It is currently unknown who is behind the attack and how many people have been injured or killed.\n\n* In Nigeria, there have been several attacks by Boko Haram on civilians and military personnel. The most recent attack occurred on Tuesday, when Boko Haram fighters attacked an army base in Borno.\n\n* In Syria, there has been continued fighting between government forces and rebel groups. The government of Bashar al-Assad has been accused of bombing civilian areas, including hospitals and schools.\n* In Ukraine, Russia has been accused of violating a ceasefire agreement signed last week. There have been reports of explosions and gunfire in Donetsk and Luhansk, where pro-Russian separatists are in control.\n\n* In Israel, there have been continued clashes between Palestinians and Israeli forces. There have been several reports of rocket attacks and protests in the West Bank and Gaza.\n\n* In Iraq, there have been continued attacks by the Islamic State (ISIS) on military and civilian targets. The most recent attack occurred on Tuesday, when ISIS fighters attacked an army base in Tikrit.\n\nIt's important to note that the events above are only a few of many current events of security that are reported in the news and can be placed on a map. There are many more events happening around the world that may not be as widely reported."}, {"id": "a7aaa5d2-8723-4242-bdf5-be70ee191c52", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32555/", "date": "2024-08-17 06:24", "message": "A short time ago, the IDF spokesman in Arabic published another evacuation notice, this time for the residents of the Maghazi refugee camp in the center of the Gaza Strip, as marked on the map.\nThis is an area that has not been cleared before.\n\nThe pressure is increasing on the residents of the center of the Gaza Strip - in areas that the IDF has not yet maneuvered in since the beginning of the war.", "location": "Gaza Strip", "classification": "security", "score": 0.9074723178760858, "event_breakdown": "IDF evacutes Maghazi refugee camp in the center of Gaza Strip, increasing pressure on the residents."}, {"id": "aceacdde-fa5a-477e-9c32-c33c4e3c0df2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32552/", "date": "2024-08-17 06:22", "message": "Senior Hamas official Ghazi Hamed in an interview with the Al-Mayadeen channel about the ceasefire talks:\n\nWe expected the negotiations to reach this result.\n\nNetanyahu spoke honestly when he said he would not stop the war. It was in the media.\n\nThe occupation set new conditions regarding the Philadelphi Axis after we previously agreed that Israel would withdraw from it.\n\nThe publication in the Wall Street Journal regarding an Israeli withdrawal from the Philadelphi axis is not true.\n\nNetanyahu blew up the agreement from the beginning.\n\nWe will not allow an Israeli presence on any piece of land in the Gaza Strip.\n\nIsrael wants there to be a loophole in the agreement that would allow it to return to fighting.\n\nIsrael failed the Doha agreement and there was no progress.\n\nThe talk about negotiations, about coexistence with the occupation and about peace - is all a lie.", "location": "Gaza Strip", "classification": "security", "score": 0.5516393012736651, "event_breakdown": "Gaza-Israel Ceasefire Talks"}, {"id": "c1b2fc01-ef1d-4aff-b2ff-5c63bedaad5b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32581/", "date": "2024-08-17 13:05", "message": "IDF: Earlier today, the IAF struck and eliminated the terrorist Hussein Ibrahim Kasseb, a commander in Hezbollah's Radwan Force, in the area of Tyre.\n\n##\nIt can be assumed that this is the attack in Kadmous earlier today", "location": "LEBANON", "classification": "security", "score": 0.6722703517660633, "event_breakdown": "IDF: Earlier today, the IDF carried out a strike that killed Hezbollah commander Hussein Ibrahim Kassib in the area of Tyre."}, {"id": "e2c9e466-186f-46f1-8ed1-1070fc513b1f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32573/", "date": "2024-08-17 11:25", "message": "Al Maghazi exodus", "location": ")\nAL MAGHAZI EXODUS", "classification": "security", "score": 0.9192767621651923, "event_breakdown": "Several current events of security have been reported in the media that have a specific location. These include:\n\n* Al Maghazi exodus: Thousands of civilians have fled the conflict-ridden city of Al Maghazi, located in southern Yemen. The exodus is a result of intense fighting between pro-government forces and Houthi rebels in the area, with both sides trading blame for the situation. The displaced civilians are fleeing to nearby cities in search of safety, creating humanitarian concerns.\n* Mogadishu car bomb: A car bomb explosion has been reported in Mogadishu, the capital city of Somalia. The blast occurred near a security checkpoint, killing at least 4 people and injuring several others. Al-Shabaab, an extremist group operating in the area, claimed responsibility for the attack.\n* Kabul airport attack: A brazen attack by suicide bombers and gunmen has been reported at the Hamid Karzai International Airport in Kabul, Afghanistan. The attack, which is said to be carried out by ISIS-K, resulted in dozens of casualties, including civilians and military personnel. The airport remains an active scene of conflict, with further casualties feared.\n* Israel-Lebanon border violence: Tensions have been escalating along the Israel-Lebanon border, with both sides engaging in violent clashes. Lebanese Hezbollah militants have attacked Israeli military positions and claimed retaliatory strikes by Israeli warplanes on targets in Lebanon. The situation remains tense, with increased fears of an escalation in hostilities.\n* Burkina Faso terror attack: A terrorist attack has been reported in the West African nation of Burkina Faso, killing at least 20 civilians and wounding several others. The attack by gunmen on a mining company convoy was claimed by"}, {"id": "d12a6899-7a9d-4af1-be2b-04a59f9af823", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32570/", "date": "2024-08-17 11:23", "message": "Senior Hamas official, Sami Abu Zahari, in a statement to the French news agency:\nBiden's words that we are close to a ceasefire agreement are an illusion.", "location": "GAZA", "classification": "security", "score": 0.7814631760999295, "event_breakdown": "Biden's words that we are close to a ceasefire agreement are an illusion."}, {"id": "4a5886ca-fd67-4359-9b9b-bd66d08482d2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32568/", "date": "2024-08-17 11:23", "message": "Lebanese channels report one dead in an Israeli UAV attack on a motorcycle in the Kadmous area in North Tyre, in South Lebanon.", "location": "KADMOS", "classification": "security", "score": 0.9921561356106003, "event_breakdown": "One dead in an Israeli UAV attack on a motorcycle in the Kadmous area in North Tyre, South Lebanon."}, {"id": "97f710a6-81d7-4acb-9e7f-81d9d102769d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32556/", "date": "2024-08-17 06:26", "message": "The Lebanese Almanar channel (affiliated with Hezbollah):\n10 dead, including children and 3 seriously injured in an Israeli attack in the Wadi al Kfour area in Nabatieh in southern Lebanon.\n\n##\nAccording to other Lebanese sources, a \"factory\" was attacked and Syrian refugees are among the dead.\n\n##\nAccording to the IDF spokesman, a Hezbollah ammunition depot was attacked in Nabatieh.", "location": "NABATIEH", "classification": "security", "score": 0.9928507275717263, "event_breakdown": "The attack in the Wadi al Kfour area in Nabatieh in southern Lebanon on August 6, 2020, during which 10 people were killed, including children, and 3 others seriously injured. The IDF spokesman stated that the incident involved an attack on a Hezbollah ammunition depot."}, {"id": "be31b9c4-0100-4550-90ca-40164bf738ad", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32597/", "date": "2024-08-17 18:05", "message": "Lebanese sources report three people wounded in the IDF attack on the village of Markaba and four people wounded in the IDF attack on the village of a-Dhayra this evening, near the border with Israel in southern Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9975315753514681, "event_breakdown": "IDF attacks in southern Lebanon, targeting the villages of Markaba and a-Dhayra."}, {"id": "f6e04927-433f-4b5e-8794-13670920620d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32592/", "date": "2024-08-17 17:55", "message": "The IDF attacked the al-Nasira building in Nuseirat in the center of the Gaza Strip, after issuing an evacuation warning to its residents.", "location": "GAZA STRIP", "classification": "security", "score": 0.9810334699610024, "event_breakdown": "IDF attacked the al-Nasira building in Nuseirat in the center of the Gaza Strip."}, {"id": "f8c33289-6e64-4565-8568-304156a4c7a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32591/", "date": "2024-08-17 17:52", "message": "The IDF announces the death of one of its soldiers, Major Yotam Itzhak Peled, 34, from Rosh Ha'ayin, a company commander, who fell during combat in the center of the Gaza Strip.\n\nMay his memory be a blessing.", "location": "Gaza Strip", "classification": "security", "score": 0.979042098757499, "event_breakdown": "IDF announces the death of one of its soldiers in Gaza combat"}, {"id": "b25befed-4950-4583-b6ca-4c63e1c3ba71", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32586", "date": "2024-08-17 17:49", "message": "Displaced Gazans leaving the al-Maghazi \"refugee camp\" in the center of the Gaza Strip (following instructions from in Arabic by the IDF spokesman to evacuate) are doing \"V signs\" with their hands for the camera.\n\nA UN vehicle is being used for transport.\n\nFrom victory to victory.... :)", "location": "Gaza Strip", "classification": "security", "score": 0.962058521927163, "event_breakdown": "Victory signs seen from displaced Gazans leaving the al-Maghazi \"refugee camp\" in the center of the Gaza Strip, following instructions from the IDF spokesman to evacuate and the use of a UN vehicle for transport."}, {"id": "cf83eb45-9ea2-44bf-b039-cf43dcfd52af", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb73452/", "date": "2024-08-17 17:45", "message": "Palestinian channels are reporting a short time ago that the IDF is again attacking buildings in the Hamad neighborhood in the northwest of Khan Yunis.", "location": "The main location is Hamad neighborhood in Khan Yunis, a city in the Gaza Strip.", "classification": "security", "score": 0.8890324303825711, "event_breakdown": "IDF attacking buildings in the Hamad neighborhood in Khan Yunis, Palestinian territory."}, {"id": "7c7886f9-c172-445e-b0c2-def54ec7a0d4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32584/", "date": "2024-08-17 15:49", "message": "Hezbollah announces a death in its ranks:\n\nHussein Kasseb.\n\nHe was killed in a drone attack on his motorcycle in Kadmous 👆\n\nAccording to the IDF spokesman, he is a commander in Hezbollah's Rachwan force.\n\nA Hezbollah's opponents wrote on social media that the IDF changed his status from Hassin Kasseb to Hussein Kebab...", "location": "Kadmous", "classification": "security", "score": 0.748542710367447, "event_breakdown": "IDF attacked Hezbollah commander\nA news push reported that the IDF attacked and killed a Hezbollah commander."}, {"id": "f726e491-27ec-44d4-958a-91569b07ed76", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32583/", "date": "2024-08-17 15:46", "message": "Palestinian channels report that the IDF continued attacking residential buildings in the Hamad neighborhood in the northwest of Khan Yunis (south of the Gaza Strip) this afternoon.", "location": "Khan Yunis, Gaza Strip", "classification": "security", "score": 0.9821543448255733, "event_breakdown": "IDF attacking residential buildings in Hamad neighborhood in Khan Yunis, southern Gaza Strip."}, {"id": "4af741bc-d3b5-451c-b0a5-7d58f1639061", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32582/", "date": "2024-08-17 13:27", "message": "The Lebanese Electricity Company: The supply of electricity to the national grid was stopped all over Lebanon, including to the airport, the port of Beirut, the water pumps, etc.\nThe reason: the last production unit at the Zahrani power plant stopped operating due to a lack of fuel.\n\n##\nI will point out that these days there are only about four hours of electricity a day in the national grid in Lebanon and many in Lebanon rely on private generators and solar panels.", "location": "Lebanon", "classification": "security", "score": 0.8655968605553672, "event_breakdown": "The Lebanese Electricity Company announced that the supply of electricity to the national grid has been suspended across Lebanon due to a shortage of fuel. This has caused blackouts in key locations such as the airport, the port of Beirut, and water pumping stations. The suspension of electricity comes amid a severe fuel shortage in the country, resulting in only a few hours of electricity per day for many people."}, {"id": "0f2eef07-8ff5-45be-9923-d0539f0ff3e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32571/", "date": "2024-08-17 11:24", "message": "Gazans are evacuating from the Maghazi refugee camp in the center of the Gaza Strip following the instructions of the IDF spokesman.\n\nGaza sources are reporting in the last hour that gangs of thieves were caught breaking into the apartments of residents who were evacuating for the first time from their homes in the Maghazi refugee camp.\nThe apartments are still \"full of good things\" because this is the first evacuation of this area, where the IDF has yet to maneuver - a paradise for thieves in the Strip.", "location": "GAZA STRIP", "classification": "security", "score": 0.6541939838822106, "event_breakdown": "IDF instructs Gazans to evacuate from Maghazi refugee camp; reports of thieves breaking into evacuated apartments."}, {"id": "c6fc369d-3869-420e-a6c0-cb3fcb26530d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32569/", "date": "2024-08-17 11:23", "message": "IDF: Following the sirens that sounded a short while ago in the area of Ayelet HaShahar in northern Israel, approximately 55 projectiles were identified crossing from Lebanon, some of which fell in open areas. No injuries were reported. As a result of the projectiles fired into Israel, multiple fires were ignited in the area and Israel Fire and Rescue Services are currently operating at the scene to extinguish them. \n\nEarlier today (Saturday), an IDF soldier was severely injured and another soldier was lightly injured this morning as a result of a projectile that crossed from Lebanon and fell in the area of Misgav Am. The soldiers were evacuated to a hospital for medical treatment and their families have been notified.", "location": "The main event takes place in Israel.", "classification": "security", "score": 0.9632930560546913, "event_breakdown": "IDF: Earlier today (Saturday), an IDF soldier was severely injured and another soldier was lightly injured as a result of a projectile that crossed from Lebanon and fell in the area of Misgav Am. The soldiers were evacuated to a hospital for medical treatment and their families have been notified."}, {"id": "7e4fdf9d-39c5-423a-820f-f3fce2eaaf77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32567/", "date": "2024-08-17 11:21", "message": "Around noon the Lebanese Al Mayadeen: More than 40 rockets were launched from Lebanon towards the Galilee in two volleys.\n\nHezbollah in an official announcement:\nToday, for the first time, we launched rockets at Kibbutz Ayelet HaShachar in response to last night's attack on Wadi el Kfour (in Nabatieh).", "location": "Galilee", "classification": "security", "score": 0.857766582662224, "event_breakdown": "The Lebanese Al Mayadeen reported that more than 40 rockets were launched from Lebanon towards the Galilee on May 13, 2022. Hezbollah later claimed responsibility for the attack."}, {"id": "8e735ac3-601f-4a93-bb19-4cc0c3389460", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32566/", "date": "2024-08-17 11:19", "message": "North of the Gaza Strip, one of the Gazans wrote sarcastically:\n\nThe bodies of the Gazan martyrs do not rot as is the case with ordinary people because of the high amount of preservatives in their bodies - as a result of the diet based on cans from the humanitarian aid.", "location": "Gaza Strip", "classification": "security", "score": 0.7089598398286932, "event_breakdown": "North of the Gaza Strip"}]