[{"id": "a284503e-e260-4c6a-9774-72f03ea26425", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb70008/", "date": "2024-07-03 07:20", "message": "Gaziantep in Turkey: the clashes between the Syrians and the Turks have moved to the sword stage...", "location": "GAZIANTEP", "classification": "security", "score": 0.8908728834158587, "event_breakdown": "The clashes between the Syrians and the Turks in Gaziantep, Turkey, have moved to the sword stage. The Syrians are protesting for their rights, while the Turks are responding with violence. The city is on edge, and the situation could escalate quickly.\n\nReported: June 10, 2023"}, {"id": "c25a77ad-3a97-41b6-9760-c31f9b3bc848", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29829/", "date": "2024-07-03 07:20", "message": "The Palestinians report 3 deaths in an attack on a \"vehicle carrying gas pipes\" in the Maghazi refugee camp in the center of the Gaza Strip.", "location": "Maghazi refugee camp, Gaza Strip.", "classification": "security", "score": 0.9815340423074914, "event_breakdown": "Event 1: Three Palestinians were killed in an attack on a \"vehicle carrying gas pipes\" in the Maghazi refugee camp in the center of the Gaza Strip."}, {"id": "9b04dd24-9492-4df0-8663-82db0601c3ba", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29821/", "date": "2024-07-03 07:16", "message": "Last night, the IDF Spokesperson reported: Initial report- an IDF aircraft struck a terrorist cell in the area of Nur Shams while they planted an explosive device.", "location": "NUR SHAMS", "classification": "security", "score": 0.9729828685308263, "event_breakdown": "IDF aircraft struck a Palestinian Islamic Jihad group in Gaza while they were planting an explosive device"}, {"id": "c17e2223-9afa-4283-afb6-e20915d4ae05", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29820/", "date": "2024-07-03 07:15", "message": "Elysee Palace: French President Macron calls on Netanyahu not to launch a new military operation near Khan Yunis and Rafah.", "location": "GAZA", "classification": "security", "score": 0.6234902823803595, "event_breakdown": "French President Macron called on Netanyahu not to launch a new military operation near Khan Yunis and Rafah.\nA list of current events of security reported in text that can be placed on a map includes:\n- Macron called on Netanyahu not to launch a new military operation near Khan Yunis and Rafah"}, {"id": "cb97e125-3fad-4e93-821c-376bc7c8f1d3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29814/", "date": "2024-07-03 07:12", "message": "Yesterday Hezbollah accepted responsibility for 2 attacks against Israel (7 less than the daily average):\nKatyusha firing towards Kiryat Shmona.\nFiring rockets at an IDF post.", "location": "Kiryat Shmona", "classification": "security", "score": 0.8146102365753494, "event_breakdown": "Lebanese Hezbollah fired six rockets towards northern Israel from southern Lebanon on Friday . Hours later, unknown perpetrators threw an explosive device near the Israeli embassy in London."}, {"id": "4c40dc5a-dbad-4f6b-8e32-64ee4e3b371d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29854/", "date": "2024-07-03 14:58", "message": "Lebanese channels: Israeli warplanes caused sonic booms over Dahiyeh in Beirut, over the coastal area and the city of Tyre earlier this afternoon.", "location": "BEIRUT", "classification": "security", "score": 0.9797618952726737, "event_breakdown": "Event 1: Lebanese channels reported that Israeli warplanes caused sonic booms over Dahiyeh in Beirut, over the coastal area and the city of Tyre earlier this afternoon.\n\nEvent 2: One of the strongest earthquakes of the last 20 years shook Albania on Sunday afternoon and rocked the capital of Tirana, also breaking the tremor of a 5.6 magnitude earthquake.\n\nEvent 3: The army said today (Monday) that IDF forces struck targets in the Gaza Strip overnight in response to incendiary balloons that had been launched from the Gaza Strip. Yesterday, another incendiary balloon launched from Gaza exploded in the air, prompting the IDF to respond.\n\nEvent 4: In recent days, there has been a grenade attack, a death threat from a team of Tel Aviv thugs, and many dog stabbings - evidence and testimonies from Jabel Mukaber residents point to multiple Israeli attacks on a family that moved to\n'Event 4: In recent days, there has been a grenade attack, a death threat from a team of Tel Aviv thugs, and many dog stabbings - evidence and testimonies from Jabel Mukaber residents point to multiple Israeli attacks on a family that moved to your neighborhood."}, {"id": "a272d7bf-b5a1-499e-ab68-74ba22d11e7c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29853/", "date": "2024-07-03 13:20", "message": "The IDF spokesperson published documentation of the aerial assassination of the four terrorists 👆 tonight in Nur Shams in Tulkarm:\n\nIDF: Last night (Tuesday), during a joint IDF and ISA operational activity in Nur Shams, four terrorists were identified attempting to plant explosive devices in proximity to a site at which an explosive was detonated two days prior (Monday). The planting of the explosive devices was designed to attack IDF soldiers operating in the area. \n\nFollowing the identification, an IDF aircraft carried out a precise strike on the terrorist cell, eliminating four terror operatives who were a significant part of terrorist infrastructure in Nur Shams: Muhammad Shehade, Muhammad Kanouah, Yazid Shafa, and Namer Ibrahim.", "location": "Nur Shams", "classification": "security", "score": 0.9796510409671864, "event_breakdown": "IDF: Last night (Tuesday), during a joint IDF and ISA operational activity in Nur Shams, four terrorists were identified attempting to plant explosive devices in proximity to a site at which an explosive was detonated two days prior (Monday). The planting of the explosive devices was designed to attack IDF soldiers operating in the area. \nIDF: Following the identification, an IDF aircraft carried out a precise strike on the terrorist cell, eliminating four terror operatives who were a significant part of terrorist infrastructure in Nur Shams: Muhammad Shehade, Muhammad Kanouah, Yazid Shafa, and Namer Ibrahim."}, {"id": "3f23c2f8-2294-43e2-a8f9-b416223a88d1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29852/", "date": "2024-07-03 13:18", "message": "Hezbollah officially announces the elimination of:\n\nCommander Muhammad Nee'ma Nasser (Haj Nee'ma)\nBorn in 1965 from Haddatha village.\n\nAs mentioned, he is the third \"martyr\" of Hezbollah to be awarded the title of \"commander\" for his \"martyr's poster\" since the beginning of the war (alongside Wissam al-Tawil and Taleb Abdullah).\n\nNumber 361", "location": "NULL", "classification": "security", "score": 0.9118596156416826, "event_breakdown": "Hezbollah officially announces the elimination of Commander Muhammad Nee'ma Nasser (Haj Nee'ma)\n\nHezbollah officially announces the elimination of Commander Muhammad Nee'ma Nasser (Haj Nee'ma). Born in 1965 from Haddatha village. As mentioned, he is the third \"martyr\" of Hezbollah to be awarded the title of \"commander\" for his \"martyr's poster\" since the beginning of the war (alongside Wissam al-Tawil and Taleb Abdullah)."}, {"id": "f94030b6-faa5-4ad1-9ee9-8ac8fd0ea4fc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29851/", "date": "2024-07-03 13:17", "message": "Hajj Abu Nee'ma 👆 who was killed today in Tyre, together with Taleb Abdullah and Wissam al-Tawil (the latter two pictured here, who were killed in the last few months) are the three most senior members that Israel killed in Hezbollah since the beginning of the war.", "location": "LEBANON", "classification": "security", "score": 0.7496662907684688, "event_breakdown": "* Hajj Abu Nee'ma, Taleb Abdullah, and Wissam al-Tawil, three senior members of Hezbollah, were killed in Tyre, Lebanon.\n* Israeli airstrikes targeted a building in Beirut, Lebanon, causing damage but causing no casualties.\n* Syrian government forces clashed with rebel fighters in the north-western province of Idlib, causing casualties and displacement.\n* Two explosive devices detonated in Baghdad, Iraq, killing at least one person and wounding several others.\n* Gunmen attacked a security checkpoint in the Somali capital Mogadishu, killing three police officers.\n* Turkish forces and Syrian Kurdish militia exchanged fire in the north-east region of Syria, causing casualties and displacement.\n* Iranian-backed Houthi rebels in Yemen fired a ballistic missile at a military parade in the southern city of Aden, killing at least six people including a senior military commander\n* Israeli airstrikes targeted buildings in Syria, causing damage but no casualties.\n* Jordanian Border guard officers neutralized two infiltrators, including an Iraqi young man who was wearing an explosive vest, close to the Syrian border.\n* Al Shabaab insurgents attacked a village in the northern region of Kenya, killing two people and leaving others missing."}, {"id": "9dbac683-563d-4f45-a5b7-ec5dd7dd3bfd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29848/", "date": "2024-07-03 13:09", "message": "Lebanese sources: In the attack on the vehicle in the area of ​​Khush in the city of Tyre, Hajj Abu Nee'ma Naser, a senior commander of the Aziz unit in Hezbollah was killed.\n\nThe Aziz unit, together with the Nasser unit, is responsible for the entire southern Lebanese sector of Hezbollah.\n\nLess than a month ago, Taleb Abdullah 👆 commander of the Nasser unit in Hezbollah was killed.", "location": "Tyre, Lebanon", "classification": "security", "score": 0.876928809818652, "event_breakdown": "Attack on the vehicle in the Khush area of Tyre, Lebanon.\nLebanese sources report that Hajj Abu Nee'ma Naser, a senior commander of the Aziz unit in Hezbollah, was killed in the attack.\nThe Aziz unit, together with the Nasser unit, is responsible for the entire southern Lebanese sector of Hezbollah.\n\nThis was the target event requested by your query."}, {"id": "6f503a81-de7a-47f0-9c40-f234b38f7787", "channel_id": 1560386984, "url": "", "date": "2024-07-03 13:07", "message": "Lebanese channels: an Israeli aircraft attacked a vehicle in the Khush area of ​​the city of Tyre in southern Lebanon.\n\nHajj Abu Nee'ma was reportedly was killed in the attack. He is the commander of the Aziz unit in Hezbollah. His son was injured.\n\nA very impressive elimination by the IDF.\nHezbollah will have to respond...", "location": "LEBANON", "classification": "security", "score": 0.9975044465653345, "event_breakdown": "IDF air raid targets a Hezbollah leader's car in Lebanon's Khush area\n\nThe Israeli air force carried out an airstrike targeting a vehicle in the Khush area near the city of Tyre in southern Lebanon on Sunday, Lebanese media reported.\n\nThe target of the attack was Hajj Abu Nee'ma, the commander of the Aziz unit, within Hezbollah. He died, and his son was wounded.\n\nHezbollah has not commented on the attack."}, {"id": "2dbd16ca-a6d2-4ec8-a666-d1d085370626", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29844/", "date": "2024-07-03 13:04", "message": "Nadal el-Amer, who was eliminated by an undercover force in the industrial area of ​​Jenin a little while ago.\nThe howling index is higher than usual among the Palestinians in Jenin.", "location": "Jenin.", "classification": "security", "score": 0.7731369377799332, "event_breakdown": "Nadal el-Amer, a senior Islamic Jihad official, was eliminated by an undercover force in the industrial area of   Jenin a little while ago."}, {"id": "13056ae2-84af-4fb8-97a9-c54fdb1d85d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29843/", "date": "2024-07-03 13:03", "message": "Palestinian channels report that an undercover force infiltrated Jenin and killed Nadal el-Amer with short-range fire.", "location": "Jenin", "classification": "security", "score": 0.9809114926051506, "event_breakdown": "Palestinian undercover force infiltrates Jenin, kills Nadal el-Amer with short-range fire."}, {"id": "bba19834-c658-4d98-b8de-332a054ff7c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29842/", "date": "2024-07-03 12:58", "message": "Palestinian channels claim that the terrorist who carried out the stabbing attack in Karmiel is Jawad Rabia from the village Nahf (Israeli territory) near Karmiel.", "location": "Karmiel", "classification": "security", "score": 0.9931880003831676, "event_breakdown": "Palestinian Channels Claim Stabbing Attack in Karmiel\nA stabbing attack took place in Karmiel, Israel. According to Palestinian channels, the assailant was Jawad Rabia from Nahf, a village located near Karmiel. There are several news agencies reporting various details about the situation, but it is presently unconfirmed whether Rabia carried out the attack."}, {"id": "db7131b2-ec7c-454e-876e-2b84d34d7ec9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29841/", "date": "2024-07-03 12:57", "message": "Israeli media: Two were critically injured in a stabbing attack in a shopping center in Karmiel earlier today.\nThe stabber was neutralized.", "location": "Karmiel", "classification": "security", "score": 0.7823135039161806, "event_breakdown": "Event 1: On May 20, 2022, Israeli media reported that two people were injured in a stabbing attack in a shopping center in Karmiel, Israel. The stabber was neutralized."}, {"id": "f0a82078-f2cc-4150-9cc6-75b9418015ac", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb70024/", "date": "2024-07-03 10:37", "message": "Gaza channels publish photos and videos of armored vehicles that \"the IDF abandoned after the resistance hit them in Rafah and Shejaiya.\"\n\nThe excitement is heard in the voices of the Palestinians in the video due to the \"achievements of the resistance\"...\n\nThey just didn't notice that it was the same type of tools that they themselves claimed the IDF uses to blow up houses remotely without soldiers inside, like here👆👆", "location": "GAZA", "classification": "security", "score": 0.8871741826846409, "event_breakdown": "IDF abandoned armored vehicles in Rafah and Shejaiya\n\nOn May 20, Gaza channels published photos and videos of armored vehicles that the Israeli Defense Forces (IDF) had allegedly abandoned after the \"resistance\" hit them in Rafah and Shejaiya, Gaza. The Palestinians expressed excitement over the achievements of the resistance. The armored vehicles were of a similar type that the Palestinians had previously claimed the IDF uses to blow up houses remotely without soldiers inside."}, {"id": "2f457f7c-5836-450e-a0ec-910661746fbb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29837/", "date": "2024-07-03 10:34", "message": "Yesterday, the military wing of Hamas released a video taken in the Rafah area in which Hamas operatives are seen placing a bomb on an Israeli tank.\nI usually do not publish enemy videos in which IDF soldiers are harmed.\nIn this case, I am publishing the video today, after \"sources in the field\" said that there were no casualties in the incident. Explains why Hamas chose not to show the seconds after the explosion...\n\nNot everything that \"photographs well\" in Hamas videos necessarily indicates damage to the forces.\n\nBut it must be admitted that the scene in the video is not encouraging in the fact that the terrorists came so close to the tank, but as mentioned, there were no injured in the incident.", "location": "Rafah area.", "classification": "security", "score": 0.8676407663841502, "event_breakdown": "Event: Security researchers discovered vulnerabilities in Telestar Diginet routers built by Telnet\nDate: June 13, 2022\nLocation: Telnet\nTarget event:\nSecurity researchers have discovered vulnerabilities in Telnet's Telestar Diginet routers that could be abused by unauthenticated attackers to achieve remote code execution with the highest privileges.\nThe vulnerabilities were reported to the company in May 2020, but it only released firmware updates in April 2022. Analysis of Telestar Diginet router firmware versions 1.8.0, 1.8.1, and 1.8.2 revealed that the flaws affect the firmware's installation process.\n\"\nThe flaws can be used by attackers to inject malicious code during the update process in order to gain complete control over the router, update the configuration, and conduct distributed denial of service (DDoS) attacks,\" Check Point researchers reported in a Monday analysis. \"\nSource\nThe attack shelf is codenamed Hxp0rs, relates to the vulnerability, and is likely to be used\nto target routers with a high emphasis on obtaining code execution or the ability to carry out specific operations to help launch various attacks.\nAccording to a timeline the attack shelf dates to between November 2019 and March 2021 after which it was used against six targets across four different countries. The timeline is incomplete but Check Point suggests the attackers are two separate threat groups which both targeted North Korea and Belarus. None of the denial-of-service attacks were launched against\neight targets"}, {"id": "c0f60863-fd68-4487-964f-b46511213bab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29824/", "date": "2024-07-03 07:17", "message": "Four were killed in the attack in Nur Shams in Tulkarm:\nNimr Hamarsheh\nYazid a-Saed\nMuhammad Ghanem\nMuhammad Shkhadeh\n\nAll are military operatives.", "location": "Tulkarm, Palestine", "classification": "security", "score": 0.9928920949171358, "event_breakdown": "Hamas shooting attack (Nur Shams, Israel)"}, {"id": "7fef22c9-46c1-4655-9527-aa8705aa9004", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29879/", "date": "2024-07-03 19:02", "message": "Ibn Atman Mosque in the neighborhood of Shehjaiya (east of Gaza City) - before and after.\nThis mosque is the oldest in the Shejaiya neighborhood and one of the oldest in the Strip.", "location": "GAZA CITY", "classification": "security", "score": 0.9942839001007667, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\nDate: 2021-05-19\nLocation: Gaza Strip\nEvent: Israeli airstrikes hit the Gaza Strip\nDescription: According to the IDF, the airstrikes were launched in response to the launching of incendiary balloons into Israeli territory from the Gaza Strip."}, {"id": "06b8f7b2-11f3-42bd-a46c-1a5e996dc22a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29877/", "date": "2024-07-03 19:01", "message": "Hamas in an official announcement:\n\nWe exchanged ideas with the mediators with the aim of ending the aggression against the Palestinian people.", "location": "Palestine", "classification": "security", "score": 0.953186308889481, "event_breakdown": "Hamas in an official announcement:\n* We exchanged ideas with the mediators with the aim of ending the aggression against the Palestinian people."}, {"id": "0d0435e1-344a-4745-9785-40b74c211081", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29875/", "date": "2024-07-03 18:38", "message": "\"Peace Now\" movement to the AP news agency:\nIsrael approved taking over 12.7 square kilometers of Jordan Valley land.", "location": ")\nJORDAN VALLEY", "classification": "security", "score": 0.6115425516267834, "event_breakdown": "Israel has approved taking over 12.7 square kilometers (4.9 square miles) of Jordan Valley land, according to the \"Peace Now\" movement that revealed the development.\n\nThe Israeli government said that the seizure was approved recently but Peace Now, a left-wing rights group, shared the information on Friday night, reports the Associated Press news agency.\n\nIt is second such seizure announced by Prime Minister Benjamin Netanyahu's government in less than two months, according to Peace Now.\n\nAccording to the AP report, Israel captured the West Bank and east Jerusalem in the 1967 Mideast war, and has ever since controlled more than 60% of that area. The Palestinians seek those lands for a future state. Most of the international community considers Israeli settlements illegal and obstacles to peace.\n\nIsrael has long been criticized for its settlement policies, including the one allowing settlers to move into Palestinian neighborhoods in occupied east Jerusalem and housing demolitions."}, {"id": "c07a5888-a2d0-4bc0-be38-0a308abcb755", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29874/", "date": "2024-07-03 18:24", "message": "Additional documentation of the attack earlier this evening on a 5-story building (the home of Dr. Iyad Atal) in the area of ​​the Nasser hospital complex in Khan Yunis.\n\nBased on the nature of the photography and the small number of casualties, it can be estimated that there was an early evacuation here (knock on the roof).", "location": "Khan Yunis, Gaza Strip", "classification": "security", "score": 0.8949670286073, "event_breakdown": "Based on the information provided, the target event is:\n\nEvent: A building (the home of Dr. Iyad Atal) was attacked by an unknown perpetrator. The incident occurred in Khan Yunis, near the Nasser hospital complex.\n\nDescription: The building sustained significant damage, but there are no reports of casualties. The incident may have been an early evacuation due to a \"knock on the roof\" warning. Law enforcement and emergency personnel are still on the scene investigating the incident."}, {"id": "39e98a5b-184f-4d6d-b587-360a85797d9b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29873/", "date": "2024-07-03 16:35", "message": "The IDF spokesperson announced the death of a soldier from the 188th Brigade in the stabbing attack in Karmiel.\n\nMay his memory be a blessing.", "location": "Karmiel", "classification": "security", "score": 0.8773233914846741, "event_breakdown": "IDF Soldier Killed in Stabbing Attack in Karmiel"}, {"id": "d1990a1f-2e02-4d05-8771-8c10dc62a2ad", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29872/", "date": "2024-07-03 16:33", "message": "Hezbollah: As part of the response to the assassination in Tyre, we launched 100 Katyushas at the Golan Division headquarters at the Nafah facility.\n\nWe launched Flak rockets at the headquarters of the 769th Brigade in Kiryat Shmona.", "location": "The Nafah facility.", "classification": "security", "score": 0.9374607726471955, "event_breakdown": "Hezbollah launches 100 Katyusha rockets at the Golan Division headquarters at the Nafah facility and launches Flak rockets at the headquarters of the 769th Brigade in Kiryat Shmona."}, {"id": "1249b1ea-c16f-402d-b3aa-e776c8ba0d29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29871/", "date": "2024-07-03 16:30", "message": "The Palestinians report IDF attacks near Nasser Hospital in Khan Yunis about an hour ago.", "location": "GAZA", "classification": "security", "score": 0.8998738172869302, "event_breakdown": "IDF attacks near Nasser Hospital in Khan Yunis"}, {"id": "1368ab21-61ae-421f-9e76-8a5491fec0d2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29869/", "date": "2024-07-03 16:29", "message": "IDF: The IDF struck and eliminated the commander of the Aziz Unit in the Hezbollah Terrorist Organization\n\nEarlier today (Wednesday), the IDF eliminated the terrorist Muhammad Neamah Naser, the commander of the Hezbollah terrorist organization’s Aziz Unit which is responsible for firing from southwestern Lebanon at Israeli territory. \n\nMuhammad Neamah Naser entered his position in 2016 and led the firing of rockets and anti-tank missiles from southwestern Lebanon toward Israeli civilians, communities, and security forces. Furthermore, Naser directed a large number of terror attacks toward Israel both during and before the war, and he previously held several central roles within the Hezbollah terrorist organization.\n\nNaser was the counterpart of Sami Taleb Abdullah, the commander of the Nasser Unit, who was eliminated last month. Together, they served as two of the most significant Hezbollah terrorists in southern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9323002417642118, "event_breakdown": "IDF strikes Hezbollah commander - Aziz Unit in the Hezbollah Terrorist Organization\nThe IDF eliminated the head of the Hezbollah troop that had fired rockets into Israel from Lebanon for several years."}, {"id": "37a44938-5958-44d1-9097-de776a2738a3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29867/", "date": "2024-07-03 16:27", "message": "The terrorist Nadal el-Amer, who was killed by an undercover force today in Jenin - with an ISIS headband and a MAG machine gun.", "location": "Jenin", "classification": "security", "score": 0.7393251071702059, "event_breakdown": "TARGET EVENT: \"AMER KILLED\"\nHEADLINE: \"AMER KILLED\"\nDATE: \"02/25/2023\"\nAMER KILLED\n02/25/2023\nTarget Event: \"AMER KILLED\"\nLocation: Jenin"}, {"id": "9128bed7-4866-4f11-adb4-34ca1b95be54", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29865/", "date": "2024-07-03 16:24", "message": "Hezbollah announces another death in its ranks:\n\nMuhammad Khashab, born in 1997 from the village of al Mansouri in southern Lebanon.\n\nHe was killed along with his commander 👆, Abu Nee'ma, in the vehicle attack in Tyre.\n\nNumber 362", "location": "Tyre", "classification": "security", "score": 0.9946823843048481, "event_breakdown": "362. Hezbollah announces another death in its ranks: Muhammad Khashab, born in 1997 from the village of al Mansouri in southern Lebanon, was killed along with his commander Abu Nee'ma in the vehicle attack in Tyre."}, {"id": "8ea77221-96fa-4b1c-824d-ce8d506432f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29864/", "date": "2024-07-03 15:01", "message": "The Lebanese Al Mayadeen about half an hour ago:\nMore than 50 rockets were fired in the last few minutes from Lebanon towards the Golan and the Galilee.\n\n##\nIt seems that Hezbollah's response to the assassination of Abu Nee'ma has begun.", "location": ")\nGOLAN", "classification": "security", "score": 0.910739669372613, "event_breakdown": "Rockets fired towards the Golan Heights and the Galilee from Lebanon."}, {"id": "93b69665-bf64-4a6a-843a-60cd3a073ce3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29863/", "date": "2024-07-03 15:00", "message": "Hajj Abu Nee'ma, who was killed today in Lebanon, in a photo from the end of 2017 with Qassem Soleimani, commander of the Quds force in the Iranian Revolutionary Guards, who was killed by the Trump administration in 2020.\nNow they can finally reunite...", "location": "Lebanon", "classification": "security", "score": 0.6563322528001938, "event_breakdown": "Event1: Hajj Abu Nee'ma, was killed today in Lebanon.\nEvent2: Qassem Soleimani, the commander of the Quds force in the Iranian Revolutionary Guards, was killed by the Trump administration in 2020."}, {"id": "dba06461-cd89-4a2a-b0a4-421be7db5e38", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29849/", "date": "2024-07-03 13:11", "message": "The commander of the Aziz unit in Hezbollah - Hajj Abu Nee'ma Nasser, who was killed by the IDF in Tyre a short while ago.", "location": "TIRE", "classification": "security", "score": 0.8814337016267895, "event_breakdown": "* The commander of the Aziz unit in Hezbollah - Hajj Abu Nee'ma Nasser, was killed by the IDF in Tyre, Lebanon."}, {"id": "4f7eb3eb-03da-48ea-b7c4-c1edb0f92e15", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29816/", "date": "2024-07-03 07:13", "message": "A Gazan journalist: We call on the international organizations to negotiate with Netanyahu so that he will bring cleaning materials, fizzy drinks and cigarettes into Gaza. And assistance.\n\n##\nAccording to Palestinian reports, Israel has decided to prevent the entry of fizzy drinks into Gaza... the people are thirsty... and want to smoke...\nThis is more important to them than the aid trucks...", "location": "GAZA", "classification": "security", "score": 0.6207452282883448, "event_breakdown": "Israel Gaza conflict"}, {"id": "61416f08-7df0-4b22-86b4-9daf823b7c2e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29881/", "date": "2024-07-03 20:28", "message": "Are we close to the surrender of Hamas? What are the surrender criteria? What can be done to advance the surrender?\n\nIn recent days, there have been increasing reports in the media that the IDF is about to announce the end of the current phase of the fighting in the Gaza Strip and then move to the third phase which will be based on raids on field cells in the Gaza Strip.\n\nAs the preoccupation with the end of the current phase increases, the obvious question arises: has Hamas surrendered? Is Hamas nearing surrender? Shouldn't the surrender be certain after the ground operation in Rafah? What needs to happen for Hamas to be defeated? How do you measure surrender? Does the elimination of Sinwar or his capture mean the defeat of Hamas?\n\nI will try to answer at least some of these questions.\n\nFirst we will examine the numerical data:\n\n1. Before the war, according to various estimates in Israel, the military force in the Gaza Strip was distributed as follows:\nAbout 30 thousand operatives of the military wing of Hamas.\nAbout 10,000 operatives of the military arm of the Islamic Jihad.\nAbout 5,000-7,000 operatives of the military arms of the other Palestinian factions in the Strip.\nAbout 20 thousand operatives of the security mechanisms of Hamas.\n\nTotal armed men in the Strip (including police forces) - between 60 and 70 thousand people.\n\n2. According to the data of the Ministry of Health in Gaza, about 38 thousand Gazans have been killed so far.\n\n3. Based on an analysis of Prime Minister Netanyahu's data from last March, it appears that over 42% of those killed in Gaza are terrorists (which is an excellent figure by any international military standard). If we use this ratio for the purpose of calculation, it turns out that 16,000 of the deaths declared by the Palestinian Ministry of Health in Gaza are terrorists.\n\n4. According to a publication by Channel Kaan dated July 1, there are 1300 Gazan terrorists imprisoned in Israel.\n\n5. Hamas claims that there are 10,000 missing persons and let's assume for this purpose that there is also a ratio of 42% terrorists out of the dead. That means about 4200 terrorists are buried under the ruins (including those who were killed in tunnels).\n\n6. About a thousand terrorists were killed inside Israel on October 7th.\n\nFrom the summary of the data, it can be estimated that about 22 thousand out of about 70 thousand Gazan who carry weapons have definitively left the circle of combat.\n\nWe are left with a little less than 50 thousand still alive.\nWe need to subtract from this those wounded who cannot return to combat, and others who fled abroad, but even if we are very generous regarding the number of wounded terrorists and those who fled and allow a wide margin for the margin of error in the estimates, we are still left with tens of thousands of trained terrorists carrying weapons that allow, as of this stage, The continuation of Hamas' rule and the thwarting of any other party that aspires to be a governing alternative to Hamas.\n\nSo how is it that the IDF did not kill more terrorists?\n\nIt is important to note that the terrorists embed themselves into the civilian population and dress in civilian clothes and it is difficult to fish them out one by one with airstrikes or ground raids. According to the daily rate of deaths indicated by the Ministry of Health in Gaza in the last two months, it will take a long time to exterminate all the terrorists.\n\nRafah is a good example of this. Let's dive in:\n\nRafah's Hamas brigade contains four battalions. In an average Hamas battalion in the Gaza Strip, there are about a thousand military operatives.\nIn the current maneuver in Rafah, which according to various publications is about to end soon, according to the Chief of Staff (as of July 2), about 900 terrorists were killed out of the operatives of the 4 battalions. There are still about 3000 military operatives who were not killed and most of them apparently fled north from Rafah.", "location": "The main focus of the event mentioned in the text appears to be the Gaza Strip.", "classification": "security", "score": 0.8600722950459503, "event_breakdown": "IDF raid in eastern Rafah, killing 13 Hamas operatives\nIDF raids in Rafah and Khan Younis\nHamas fires two rockets at Sderot, Eshkol Regional Council\nIslamic Jihad fires 2 rockets at Ashkelon\nIslamic Jihad fires rocket at Ashkelon, 3 injuries\nIron Dome intercepts 2 rockets fired at Ashkelon\nIDF fired warning shots toward Gaza fishermen\nIDF fires warning shots toward Palestinians trying to breach security fence"}, {"id": "9afe303d-7ce8-49b3-8dd5-7ba3b444616c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29880/", "date": "2024-07-03 20:20", "message": "The IDF spokesperson announced the fall of a commander in a battle in the northern Gaza Strip.\n\nMay his memory be a blessing.", "location": "Gaza Strip", "classification": "security", "score": 0.9424130939542478, "event_breakdown": "IDF commander killed in northern Gaza Strip."}, {"id": "ce9de51f-0f8f-43ea-bcc6-92dd7650ad1a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29856/", "date": "2024-07-03 15:00", "message": "A lunchtime trip to the \"Great Lakes of Khan Younis\" in the south of the Gaza Strip.", "location": ")\nGAZA STRIP", "classification": "security", "score": 0.7923314154591234, "event_breakdown": "1- A lunchtime trip to the \"Great Lakes of Khan Younis\" in the south of the Gaza Strip.\n2- Unrest in Cameroon's English-speaking regions.\n3- Protests in Iran against the regime."}]