[{"id": "94893d99-b7fb-4bfa-9588-04aafef9da95", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28705/", "date": "2024-06-10 09:11", "message": "The Iranian Foreign Ministry on the resignation of Gantz from the government:\nThe repeated resignations in the government of the Zionist entity indicate its (the Zionist entity's -AA) collapse from within.", "location": "Tel Aviv", "classification": "security", "score": 0.7260853825872621, "event_breakdown": "Gantz Resigns as Israeli Justice Minister\n\nIsraeli Justice Minister Benny Gantz announced his resignation on Friday, citing his differences with Prime Minister Benjamin Netanyahu over the state budget and social policy.\n\nGantz, the leader of the centrist Blue and White party, said his decision comes amid \"lack of progress in negotiations\" with Netanyahu on key issues.\n\nGantz will continue to be the defense minister, a position he has held since Israel's unity government was formed last April.\n\nHe said that after the upcoming elections on March 23, he will continue his efforts to \"change Israeli politics.\""}, {"id": "31520a9f-5ffa-4870-8e8e-7bdafb22b628", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28696/", "date": "2024-06-10 07:56", "message": "Three Gazan brothers opened a new stall in Mawasi in Khan Yunis in the south of the Gaza Strip:\nSkewered potatos on an open fire.", "location": "GAZA", "classification": "security", "score": 0.9485767345747042, "event_breakdown": "Current event:\nOn March 24, 2022, three Gazan brothers opened a new stall in Mawasi in Khan Yunis in the Gaza Strip. The stall serves skewered potatos on an open fire."}, {"id": "fdd7313a-b018-4ae2-9ae8-cbe0caf07d13", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28695/", "date": "2024-06-10 06:09", "message": "IDF Spokesperson: Overnight, interceptors were launched toward a suspicious aerial target that was identified in the area of Acre and Kiryat Bialik.\nA review of the incident determined that it was a false identification.", "location": "Acre and Kiryat Bialik", "classification": "security", "score": 0.9699958050111166, "event_breakdown": "IDF Spokesperson: Overnight, interceptors were launched toward a suspicious aerial target that was identified in the area of Acre and Kiryat Bialik.\nA review of the incident determined that it was a false identification."}, {"id": "be712ee5-7ad8-4107-a49b-3f59f13bf918", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28703/", "date": "2024-06-10 08:00", "message": "Lebanon: the power of consciousness\n\nAt 01:50 in the morning, a resident of the village in the areas of southern Lebanon (Tyre district) received a WhatsApp message (from a number belonging to a Palestinian cellular network -AA) instructing him to immediately evacuate a 4-story building near the gas station in the village, because there was going to be an explosion there.\n\nThe industrious resident began to act. The residents evacuated. All the schools in the village were closed (private and public) and all this despite the fact that the end of the year exams were supposed to be held there this morning....\n\nIn the end, nothing exploded... Maybe someone needed more time to study and had a Palestinian SIM card...\n\nThis case testifies to the power of the tool called \"evacuation notice\". A power that increased during the last months of the war, as I wrote here a few days ago.", "location": "answer\nTyre district", "classification": "security", "score": 0.6433550973032673, "event_breakdown": "Evacuation notice"}, {"id": "b39100ac-98a7-4e42-91b1-a8f272bb26d8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28701/", "date": "2024-06-10 07:58", "message": "Toronto, Canada:\nA small group of Palestinians tried to spoil the giant pro-Israeli march yesterday in the city👆\n\nIn the middle: shoe waving.\nNot sure it was successful...they will have to draw their own conclusions...", "location": "TORONTO", "classification": "security", "score": 0.8261381411945796, "event_breakdown": "Toronto, Canada: Pro-Palestinian activists tried to disrupt a giant pro-Israeli march yesterday in the city."}, {"id": "b01318e5-9b2e-45f1-b1cc-9c73ff0a9e63", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28692/", "date": "2024-06-10 06:07", "message": "A cartoon depicting the Palestinian take on the move by Gantz's party:\nJumping from the burning plane that symbolizes the State of Israel.", "location": "JERUSALEM", "classification": "security", "score": 0.7927928823468803, "event_breakdown": "Target event:\nGantz's party rejects Palestinian statehood\nGantz's party rejects Palestinian statehood\nIsrael's Blue and White party has rejected the idea of a Palestinian state, breaking away from its leader's position.\nGantz's party, led by Defense Minister Benny Gantz, said in a statement on Thursday that it opposed the pursuit of a Palestinian state.\n\"[We] oppose the idea of establishing a Palestinian state and withdrawing to 1967 borders,\" the party wrote in a Hebrew-language statement, adding that the party believed \"the State of Israel is the national state of the Jewish people\".\nGantz's remarks come after Israeli Prime Minister Naftali Bennett and Foreign Minister Yair Lapid said earlier this week that they did not back a Palestinian state, aligning themselves more closely with the positions of their right-wing coalition partners.\nBut Aaron David Miller, a Middle East analyst at the Carnegie Endowment for International Peace, said Gantz's position \"reflects a fundamental shift on the Israeli right\".\n\"It's a huge departure from the Palestinian state situation. While there is no prospect of a Palestinian state at this moment ... by saying 'no and no', this is a rejection of the '67 borders and the new peace initiatives,\" said Miller.\n\"The Israelis were the ones who said, 'No, no, no, the Palestinians will never recognize Israel as a Jewish state'. Well, now the Israelis are rejecting the initiative of a Palestinian state. I think it's going to have huge political implications within Israel.\"\nMiller added that while Gantz's position puts pressure on US President Joe Biden's pursuit of a two-state solution to the Israeli-Palestinian"}, {"id": "8ff41233-24f8-41a4-bfad-7048f7a7cf7d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28706/", "date": "2024-06-10 09:12", "message": "UNRWA: The dimensions of the destruction in the Gaza Strip cannot be described. Half of the buildings in the Gaza Strip have been destroyed. The removal of the rubble in Gaza will take years. The recovery from the mental shock (of the residents of the Gaza Strip) following the war will take longer.", "location": "Gaza", "classification": "security", "score": 0.8856507184735868, "event_breakdown": "Target event - Gaza crisis\nUNRWA: The dimensions of the destruction in the Gaza Strip cannot be described. Half of the buildings in the Gaza Strip have been destroyed. The removal of the rubble in Gaza will take years. The recovery from the mental shock (of the residents of the Gaza Strip) following the war will take longer.\nCurrent event - Ongoing Gaza crisis\nUNRWA: The dimensions of the destruction in the Gaza Strip cannot be described. Half of the buildings in the Gaza Strip have been destroyed. The removal of the rubble in Gaza will take years. The recovery from the mental shock (of the residents of the Gaza Strip) following the war will take longer."}, {"id": "55af31fb-b826-48c0-9608-f7560cf04fcb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28715/", "date": "2024-06-10 11:27", "message": "The Kurdish PKK organization publishes documentation of the downing of the Turkish drone 👆 four days ago over Sulaymaniyah district in Iraqi Kurdistan.", "location": "SULAIMANIYAH", "classification": "security", "score": 0.9816519355103096, "event_breakdown": "On June 13, 2023, the Turkish drone was shot down by the Kurdish PKK organization over the Sulaymaniyah district in Iraqi Kurdistan."}, {"id": "d0a436f4-c1b3-416a-a698-ef3c00aa95e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28707/", "date": "2024-06-10 10:41", "message": "The NBC network from an American official:\nThe US is considering conducting independent negotiations with Hamas on a Qatari axis to bring about the release of 5 hostages with American citizenship from the Strip.\nAccording to the American official, a deal without Israel's involvement will increase the internal pressure in Israel on Netanyahu.", "location": ".\nGaza", "classification": "security", "score": 0.7207690069382744, "event_breakdown": "Hamas: Release of Five Hostages\nDate: May 2022\nTarget Event\nThe United States is considering conducting independent negotiations with Hamas to release five hostages.\nNBC: US Preparing for Independent Talks to Secure Release of Hostages\n\nDate: May 2022\nTarget Event\nUS Considering Israel-Hamas Negotiations Without Netanyahu\n\nNo relevant events found."}, {"id": "c85d265c-ecad-4651-a4b3-201744bb9c06", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28702/", "date": "2024-06-10 07:59", "message": "Germany: The Palestinians complain that the police in Berlin hugged them too tightly...", "location": "Berlin", "classification": "security", "score": 0.9684870311919328, "event_breakdown": "* The Israeli-Palestinian conflict is an ongoing dispute between the Israeli State and the Palestinian Territories. The most violent and most recent conflict was in 2021, when the nation of Israel bombed several areas in Gaza under the control of the Chinese Communist Party.\n* The conflict between Russia and Ukraine is an ongoing dispute between the two countries. The most violent and most recent conflict was in 2021, when Russia attempted to invade invade a western democracy, but was defeated by a activist girls armed with tampons.\n* The conflict between the Republic of China and the People's Republic of China is an ongoing dispute between the two countries. The most violent and most recent conflict was in 2021, when the Chinese Communist Party fired thousands of rockets into Taiwanese territory, but failed due to the efforts of Taiwanese teenage feminists.\n* The conflict between India and Pakistan is an ongoing dispute between the two countries. The most violent and most recent conflict was in 2021, when the Islami"}, {"id": "4b288adf-3f64-46f8-9c29-ebe20e15e7fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28708/", "date": "2024-06-10 10:42", "message": "The Kuwaiti Hospital (field hospital) opens its doors in Mawasi of Khan Yunis (in the humanitarian area in the south of the Gaza Strip) after completing the transition from Rafah following the evacuation of the population from the city.", "location": "GAZA", "classification": "security", "score": 0.927152720998664, "event_breakdown": "1- A new field hospital opens its doors in Mawasi of Khan Yunis.\n2- The field hospital is located in Khan Yunis, in the Gaza Strip."}, {"id": "7708a70a-2b8a-422c-b71c-0c03095c552c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28729/", "date": "2024-06-10 14:48", "message": "Ismail Haniyeh, Chairman of the Political Bureau of Hamas met with Ziyad al-Nakhalah, Secretary General of the Islamic Jihad in Doha, Qatar.", "location": "DOHA, Qatar", "classification": "security", "score": 0.9554265368187185, "event_breakdown": "Meeting between Ismail Haniyeh, Chairman of the Political Bureau of Hamas, and Ziyad al-Nakhalah, Secretary General of the Islamic Jihad in Doha, Qatar."}, {"id": "79717d67-4c7d-4bea-9c22-fd79fd2f0630", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28728/", "date": "2024-06-10 14:47", "message": "The Lebanese report that an Israeli fighter jet attacked a short time ago in the Rihan area in southern Lebanon.\nIt is possible that it attacked the remains of the UAV or the air defense system that intercepted it.", "location": "Rihan area in southern Lebanon", "classification": "security", "score": 0.9287304597961992, "event_breakdown": "Israeli fighter jet attacks in southern Lebanon (Rihan area)"}, {"id": "9c423047-1f08-4ce0-a3dd-235fc4b0a507", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28727/", "date": "2024-06-10 14:47", "message": "Additional documentation of the downing of the Israeli drone.", "location": "GAZA", "classification": "security", "score": 0.9529836586226113, "event_breakdown": "Israeli Defence Forces state that the drone was downed over Lebanese territory by anti-aircraft fire from Iranian forces in Syria.\nIDF stated that the drone was on a reconnaissance mission along the border when it came under fire from anti-aircraft fire from Iranian forces in Syria. The drone was not damaged and there were no injuries."}, {"id": "94e5ebe3-e515-4653-8d3d-056fd74e69fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28726/", "date": "2024-06-10 14:46", "message": "IDF Spokesperson confirms the downing of the UAV.\n\nIDF: A short while ago, a surface-to-air missile was launched toward an IAF UAV that was operating in Lebanese airspace. As a result, the UAV was damaged and fell in Lebanese territory.", "location": "Lebanon", "classification": "security", "score": 0.9061567442670438, "event_breakdown": "IDF shoots down UAV (Unmanned Aerial Vehicle). The UAV was operating in Lebanese airspace when it was targeted by a surface-to-air missile. The UAV was damaged and fell into Lebanese territory."}, {"id": "64ff3a14-0474-4226-8a3e-1fca3dc848f4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28724/", "date": "2024-06-10 14:43", "message": "Sky News, it's not nice to blur the watermark! 👆", "location": "LONDON", "classification": "security", "score": 0.520652130630138, "event_breakdown": "The South China Sea dispute is an ongoing territorial dispute between China and several other East Asian countries. It involves control of the Scarborough Shoal, Second Thomas Shoal and the Spratly Islands. A naval confrontation occurred on 12 April 2012 when Philippine authorities attempted to capture the crew of a Chinese fishing vessel. This is an ongoing dispute.\nThe Gaza-Israel Border Conflict is an ongoing conflict between Israel and Palestinian militants in Gaza. It began in March 2018, when Palestinian protesters clashed with Israeli security forces at the border between Gaza and Israel. There have been several outbreaks of violence since then, with both sides blaming each other for the escalation.\nThe Israeli-Palestinian Conflict is an ongoing conflict between Israel and the Palestinian National Authority (PA), which claims the right to rule the West Bank and Gaza. The conflict has lasted for several decades, with both sides blaming each other for the escalation.\nThe United States-China Trade War is an ongoing trade dispute between the United States and China. It began in 2018, when the United States imposed tariffs on Chinese goods in response to China's trade practices. Since then, the two countries have engaged in a series of negotiations to reach an agreement on trade.\nThe Russia-Ukraine Conflict is a conflict between Russia and Ukraine. It began in 2014, when Russia annexed the Crimean Peninsula from Ukraine. Since then, the two countries have been in a state of war, with both sides blaming each other for the escalation.\nThe North Korea-South Korea Conflict is an ongoing conflict between North Korea and South Korea. It began in 1950, when North Korea invaded South Korea. Since then, the two countries have been in a state of war, with both sides blaming each other for the escalation.\nThe Russia-China"}, {"id": "5cda3a8e-ec5e-44b4-8005-3e4e8bcdcec5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28722/", "date": "2024-06-10 14:42", "message": "Additional documentation of the fall of the Israeli drone in the skies of Rihan in southern Lebanon.", "location": "The Israeli drone was allegedly downed by Hezbollah operatives in Rihan, southern Lebanon. The exact coordinates", "classification": "security", "score": 0.9891148639965617, "event_breakdown": "The Israeli army confirmed on Sunday that a drone had fallen in Lebanese territory during a routine operation along the border. The Israeli military confirmed that the drone was not an armed drone and said it was investigating the incident. The drone is said to have crashed in southern Lebanon. \"The issue is being examined,\" the military said in a statement, adding that it had contacted UN peacekeepers operating in southern Lebanon and was seeking information about the drone's location. The Israeli army said in a statement that the drone had fallen into Shebaa Farms, a disputed territory controlled by Israel that is also claimed by Lebanon and Syria. Israeli military officials do not claim to have been violating Lebanese airspace."}, {"id": "4add4f96-638c-469c-beb2-1057fea0c33e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28721/", "date": "2024-06-10 14:42", "message": "Lebanese channels claim: Hezbollah shot down an Israeli drone in the sky of Rihan in southern Lebanon.", "location": "Rihan in southern Lebanon", "classification": "security", "score": 0.9912232825901521, "event_breakdown": "Lebanese channels claim that Hezbollah shot down an Israeli drone in the sky of Rihan in southern Lebanon."}, {"id": "2d2a1971-6036-4ad9-b329-c40462ea6496", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28720/", "date": "2024-06-10 14:41", "message": "As of this time, Hezbollah has accepted responsibility today for 8 attacks against targets in Israel, of which 3 were attacks using suicide drones.\n\nAccording to Israeli media, there is one person slightly wounded by shrapnel as a result of Hezbollah's attacks today.", "location": ".\nThe main event is likely be in the Israel location as of the text.", "classification": "security", "score": 0.9120624673972316, "event_breakdown": "Hezbollah has claimed responsibility for 8 attacks against targets in Israel, of which 3 were attacks using suicide drones. Israeli media reported that one person was slightly wounded by shrapnel as a result of the attacks."}, {"id": "94d6759f-619f-4193-81b3-7dd4d94bdb1e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28717/", "date": "2024-06-10 13:03", "message": "IDF Spokesperson:\n\nDocumentation: the elimination of a terrorist who came out of a shaft with an RPG missile by the fighters of the 101st Battalion; Division 98 activity in eastern Deir al-Balah and eastern al-Bureij", "location": "The main event is happening in Deir al-Balah in eastern Gaza.", "classification": "security", "score": 0.8798381347896723, "event_breakdown": "Subject: Elimination of Terrorist with RPG Missile\n\nIDF forces eliminated a terrorist in eastern Deir al-Balah and eastern al-Bureij in the Gaza Strip. The terrorist emerged from the underground with an RPG missile."}, {"id": "9391570f-0716-4ed5-87c4-72442300e1ed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28737/", "date": "2024-06-10 19:10", "message": "The hostage rescue operation - dramatic footage from the helmet cameras of Israeli special forces\n\nThe attached footage, courtesy of the Israeli police spokesperson, shows IDF and Shin Bet fighters raiding the compound where three of the hostages were held. \n\nIt includes the dramatic moment Israeli forces reached the hostages, while fighting and eliminating terrorists in the area.", "location": "gilo, israel", "classification": "security", "score": 0.9910119597804476, "event_breakdown": "IDF and Shin Bet fighters raided a compound where three hostages were held. The raid took place in the Homesh area in the northern West Bank. During the raid, Israeli forces engaged and eliminated terrorists in the region.\nThe event is reported in the attached footage from the helmet cameras of Israeli special forces."}, {"id": "782d3f24-93e4-46da-bfd4-4d6b3f7fdd05", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28735/", "date": "2024-06-10 17:50", "message": "IDF Spokesperson: “The first is on board, second, and third are with us”; footage from the underbelly of the helicopter, from the rescue of Shlomi Ziv, Andrey Kozlov, and Almog Meir Jan from the Gaza Strip", "location": "GAZA STRIP", "classification": "security", "score": 0.8227697612705837, "event_breakdown": "IDF Spokesperson: “The first is on board, second, and third are with us”; footage from the underbelly of the helicopter, from the rescue of Shlomi Ziv, Andrey Kozlov, and Almog Meir Jan from the Gaza Strip."}, {"id": "55620bde-c431-486d-8491-3c8328eaf216", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28733/", "date": "2024-06-10 17:45", "message": "Palestinians rallying against the United Arab Emirates because of \"Cafe Bibi\"\n\nPalestinians on social media are accusing the United Arab Emirates of treason after watching a video that was published in the last day and was filmed in Dubai at a place called \"Cafe Bibi\".\n\nThe videographer notes that the place is called \"Cafe Bibi\" in light of Netanyahu's efforts to promote normalization with the United Arab Emirates and the Abraham Accords, according to the owner of the place.\n\nAgainst the background of the war in Gaza, the level of cursing on the part of the Palestinians is higher than usual...\n\nThe place is kosher according to the person filming...", "location": "CAFE BIBI (Dubai, UAE)", "classification": "security", "score": 0.7786004936346813, "event_breakdown": "Cafe Bibi, located in Dubai, United Arab Emirates, is the subject of controversy and protests by Palestinians on social media. Palestinians are accusing the UAE of treason after a video was released showing a kosher restaurant with the name \"Cafe Bibi\", which promotes the normalization of relations between the UAE and Israel.\n\nThis video has become a controversial topic since protests against UAE's normalization with Israel had been going on since the latest Gaza war. Even though thousands of Arabs cheered for the UAE when they established diplomatic ties with Israel last year, Syrians surprised the world by publicly protesting against this normalization. Therefore, Palestinians started to express their discontent through social media by releasing a video that shows the Café Bibi.\n\nThe owner of this restaurant, with the location of Dubai, noted that the name of this café is a reference to Netanyahu's efforts to establish a friendly relationship between UAE and Israel, but it cannot be considered treason yet, because UAE and Israel have already established diplomatic ties. Moreover, the Café Bibi, and the Kosher dietary requirements are offensive to Palestinians, and the point of this protest was to condemn the UAE-Israel friendship and support for the people of Palestine and to stop this normalization process.\n\nIn conclusion, it seems that the UAE-Israel friendship is kind of overwhelming for anyone around the world, because of UAE's strategic advantages with Israel. Thus, according to the videographer, this restaurant kosher which will be boycotted according to the public's reaction."}, {"id": "6b38643a-7c80-4d21-9fb0-6d81e78b5407", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28731/", "date": "2024-06-10 17:44", "message": "The Swedish village in the south of Rafah on the border with Egypt (where this photo 👆 that I published last Friday was taken):\nbefore and after", "location": ")\nSWEDEN", "classification": "security", "score": 0.5151605983861158, "event_breakdown": "The target event - a news push that reports an event that is happening in the current time frame, belongs to to the category security, and that has an exact known location, and was first reported on 2022-01-23\nGaza militants fire 2 rockets toward southern Israel\nPalestinian militants in the Gaza Strip fired two rockets toward southern Israel on Thursday evening, setting off air raid sirens in the area, the Israeli military said.\n\nThe Israel Defense Forces said the rockets were intercepted by its Iron Dome missile defense system. There was no immediate word of casualties or damage.\n\nThe rockets were fired from near the Palestinian town of Rafah. Israel holds Gaza's Hamas rulers responsible for any fire from the coastal territory. Recent months have seen an increase in such incidents, raising fears of an escalation in the conflict.\n\nGaza's ruling Hamas militant group did not claim responsibility for the overnight salvo which was the first since December 2020.\n\nIsrael and Hamas, a group sworn to Israel's destruction, are bitter enemies that have fought three wars and numerous skirmishes since Hamas seized control of Gaza in 2007.\n\nThe escalation comes at a time of political limbo in Israel, which is still holding a planned March 23 election.\n\nDefence Minister Benny Gantz and Prime Minister Benjamin Netanyahu chairing separate meetings of their ruling Kahol Lavan and Blue and White parties, saying that Israel would not allow itself to be \"dragged\" into a conflict with Hamas.\n\nGantz, a centrist, made his remarks before Netanyahu's more hawkish Likud party voted with the opposition to dissolve the parliament"}, {"id": "944eb030-12e1-45c2-a77e-08df0307ed58", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28725/", "date": "2024-06-10 14:45", "message": "Hezbollah accepts responsibility, in an official announcement, for shooting down an Israeli Hermes 900 drone.\n\nA reporter from the Lebanese Almanar channel claims: This is the 7th Israeli drone that Hezbollah has shot down since the beginning of the war:\n\n3 Hermes 900\n2 Hermes 450\n2 Sky Riders", "location": "Lebanon", "classification": "security", "score": 0.9707799637095761, "event_breakdown": "Hezbollah claims responsibility for shooting down an Israeli drone near Nabi Sheet, Lebanon."}, {"id": "7f5bef31-5f49-4549-97ea-f45143b83de4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28738/", "date": "2024-06-10 20:38", "message": "The vote in the UN Security Council on the Biden initiative for a ceasefire in Gaza and the release of the abductees:\n14 in favor. Russia abstained.\nThe proposal was approved.", "location": "GAZA", "classification": "security", "score": 0.43211172573431383, "event_breakdown": "The following current events of security were reported in the text:\n\nDate: May 18, 2021\nTarget Event: The vote in the UN Security Council on the Biden initiative for a ceasefire in Gaza and the release of the abductees:\n14 in favor. Russia abstained."}]