[{"id": "3093f888-b311-405e-bd1b-223b1077677f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31358/", "date": "2024-07-30 09:42", "message": "Following the report from this morning 👆\n\nIDF Spokesperson: The 98th Division completed operational activity in the area of Khan Yunis; A terrorist who advanced multiple attacks on IDF troops in central Gaza was eliminated\n\nOvernight, the 98th Division completed their operational activity against terrorist infrastructure and operatives in the area of Khan Yunis. Over the past week, the troops have \neliminated over 150 terrorists, dismantled terror tunnels, weapons storage facilities, and terrorist infrastructure, and located weapons. Furthermore, in a joint IDF and ISA operation, five Israeli hostages who were killed and abducted on October 7th were rescued from the Khan Yunis area by the troops.\n\nFurthermore, the IAF struck the terrorist Ibrahim Hegazi, responsible for anti-tank missiles in Hamas' Nuseirat Battalion. Ibrahim planned and directed numerous terror attacks against IDF troops and he served as a central source of knowledge on anti-tank missiles for Hamas.\n\nFurthermore, as part of IDF operational activity in central Gaza, the troops are conducting targeted raids, eliminating terrorists, and dismantling terrorist infrastructure sites. The IAF eliminated a terrorist cell inside a Hamas military structure in the area. \n\nOver the past day, the troops have continued their operational activity in the area of Tel al-Sultan and have eliminated a number of terrorists who posed a threat to them, including terrorists who observed the troops.", "location": "Gaza", "classification": "security", "score": 0.986062957175643, "event_breakdown": "IDF troops completed operational activity in the area of Tel al-Sultan and eliminated a large number of terrorists who posed a threat to them, including terrorists who observed the troops. The strike occurred in the area of Tel al-Sultan."}, {"id": "7f3aa3ea-8862-499b-bff6-ee71b5af1372", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31354/", "date": "2024-07-30 08:07", "message": "Iran: Ismail Haniyeh, the chairman of the political bureau of Hamas, and Ziyad al-Nakhalah, the secretary general of the Islamic Jihad, were upgraded and also met the supreme leader of Iran, in addition to the president-elect.\nThey even kept their shoes on... so did the members of their delegations.", "location": "Tehran", "classification": "security", "score": 0.7895638224334354, "event_breakdown": "Hamas and Islamic Jihad leaders visit Iran\nIsmail Haniyeh, chairman of the political bureau of Hamas, and Ziyad al-Nakhalah, secretary general of the Islamic Jihad, met with supreme leader of Iran Ali Khamenei in Tehran. Additionally, Ismail Haniyeh and Ziyad al-Nakhalah met Iran's president-elect Ebrahim Raisi."}, {"id": "77cccaa4-c964-4d82-bc81-130224200371", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31353/", "date": "2024-07-30 08:06", "message": "The Palestinians report that near the Bani Suheila cemetery in eastern Khan Yunis, the IDF forces left behind a huge pit. (It can be assumed that they were looking for a tunnel here - AA)", "location": "NULL", "classification": "security", "score": 0.9619080877771841, "event_breakdown": "Target event: IDF forces left behind a huge pit near the Bani Suheila cemetery in eastern Khan Yunis."}, {"id": "344e968a-94be-42ad-996b-c5e4e6f0b57a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31351/", "date": "2024-07-30 08:05", "message": "Iran: Ismail Haniyeh, chairman of the political bureau of Hamas, arrived in Tehran at the head of a delegation of the movement to meet with the president-elect of Iran ahead of the latter's swearing-in ceremony.", "location": "TEHRAN", "classification": "security", "score": 0.6974647890601885, "event_breakdown": "Hamas Chairman Ismail Haniyeh arrives in Tehran for meetings with President-elect Raisi."}, {"id": "425978f0-d685-4c0b-8733-373aeaa05685", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31348/", "date": "2024-07-30 08:03", "message": "Iran: The spokesman for the Houthis also arrived in Tehran to attend the swearing-in ceremony of the president.", "location": "Tehran, Iran", "classification": "security", "score": 0.5321603929753189, "event_breakdown": "Houthi spokesman arrives in Tehran for swearing-in ceremony of president\nHouthi spokesman arrives in Tehran for swearing-in ceremony of president"}, {"id": "40fc5f5c-565e-4992-bb58-327eaf52c838", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31346/", "date": "2024-07-30 08:02", "message": "The Gazans return to east Khan Yunis after the withdrawal of IDF forces from the area.", "location": "GAZA", "classification": "security", "score": 0.899748940598914, "event_breakdown": "IDF forces withdraw from east Khan Yunis and the Gazans return to their homes."}, {"id": "ded71d3d-5e61-4c9f-bfde-5e758c173027", "channel_id": 1560386984, "url": "", "date": "2024-07-30 06:05", "message": "Riots in Venezuela following assumptions that the election results were rigged\n\nYesterday, the current Venezuelan President, Nicolás Maduro, announced that he won the elections in Venezuela after winning 51% of the votes and was elected to a third term.\nMaduro is the successor of Hugo Chávez who is considered an anti-Western socialist (and a favorite of the Shiite axis and the enemies of the West).\n\nThe riots began after the polls predicted a landslide victory for his opponent Edmundo Gonzalez (pro-Western canditate) at a rate of 70% - a turnaround was expected.\n\nWhen the results were announced, there was an outburst of anger from the opposition supporters who (as you can see in the attached videos) toppled the statues of Hugo Chávez, set fire to police vehicles and clashed with the regime forces.\nMany countries in the West and South America do not recognize the results of the elections and also claim that they were falsified.\nThere are dozens injured and also several dead in the riots.", "location": "CARACAS, Venezuela", "classification": "security", "score": 0.4643669537846219, "event_breakdown": "Location: Venezuela\nEvent: Riots in Venezuela following allegations of election fraud, with clashes between opposition supporters and security forces, and at least one reported death."}, {"id": "b821f064-e608-4f95-99fe-304e130185a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31338/", "date": "2024-07-30 06:01", "message": "Syrian and Arab media are reporting an Israeli airstrike early this morning in the area of ​​Tel Jaiba in Daraa district in southern Syria.\nAccording to the report, two bases of the Assad army were attacked. The Syrians used anti-aircraft guns against the planes - it didn't help...\n\nAt the same time as the attack, sources in southern Syria are reporting clashes between the Syrian rebels and the Assad regime in the Noa area of ​​Daraa district early this morning...", "location": "Daraa district", "classification": "security", "score": 0.9703261345749488, "event_breakdown": "Israeli airstrike reported in Daraa district in southern Syria. Syrian rebels clash with the Assad regime in Noa area."}, {"id": "69ce3c31-1030-43a7-a51e-6e9a36f14c91", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31336/", "date": "2024-07-30 05:58", "message": "Unofficial Lebanese media reports that one person was killed in an attack carried out by an Israeli drone early this morning in Beit Leif in southern Lebanon.", "location": ".\nBEIRUT", "classification": "security", "score": 0.9805578973002226, "event_breakdown": "Target event not found"}, {"id": "52167340-5ec9-47a0-8f6b-99ff695037cc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31334/", "date": "2024-07-30 05:57", "message": "A video that gained great popularity on Palestinian and Arab channels in the past day - IDF forces blow up a Palestinian school in the Qarara area in the north of Khan Yunis.", "location": "Khan Yunis, Gaza Strip", "classification": "security", "score": 0.9071736441861196, "event_breakdown": "IDF forces blow up a Palestinian school in the Qarara area in the north of Khan Yunis."}, {"id": "e3586b2b-038d-4d86-9737-d716be60fac4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31329/", "date": "2024-07-30 05:56", "message": "Hundreds of Gazans are returning to eastern Khan Yunis this morning after learning that IDF forces have left the area\n\nPalestinian channels report that after more than a week of activity in the eastern Khan Yunis area, with an emphasis on the Bani Suheila area (and also Qarara in northern Khan Yunis), hundreds of Gazans managed to return to what was left of their homes, even though the Israeli side did not officially announce the end of the operation in the area.\nThe Gazans have begun to assess the damage in the area and to evacuate the wounded and dead from the areas where maneuvering forces and tanks were until last night.", "location": "Khan Yunis, Gaza Strip.", "classification": "security", "score": 0.9153458995207001, "event_breakdown": "IDF forces have left the area of eastern Khan Yunis, Gazans return to assess the damage caused by the IDF activity"}, {"id": "80814c2c-7b3d-4cde-8f0b-4fd0ead705cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31374/", "date": "2024-07-30 14:13", "message": "Civil Defense in Gaza: Over 300 killed in the past week in the Israeli operation in eastern Khan Yunis.", "location": "GAZA", "classification": "security", "score": 0.9251611520018658, "event_breakdown": "Israeli operation in Gaza: Over 300 killed in the past week in the Israeli operation in eastern Khan Yunis."}, {"id": "f6dfdb5c-f568-489b-94bf-6c5f31eaadd6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31373/", "date": "2024-07-30 14:13", "message": "Besides the activation of the air defense system against IDF fighter jets, Hezbollah accepts responsibility, as of this hour, for another 4 attacks:\n\nDozens of Katyushas were fired at Beit Hillel in response to the attack on Jibchit.\n\nRocket fire at an IDF post in response to the elimination in Beit Leif\n\nA suicide drone attack towards Beit Hillel in response to the elimination in Beit Leif\n\nA suicide drone attack towards Kfar Yuval in response to yesterday's attack in Kafr Roummane (in which a Syrian citizen was killed and 4 others were injured)", "location": "The main location where the main event takes place is Beit Hillel.", "classification": "security", "score": 0.9843463966103376, "event_breakdown": "It appears that the only relevant current events of security reported in the given text are:\n\nTarget event 1: Simultaneous rocket fire at Beit Hillel in response to attack on Jibchit\nTarget event 2: Rocket fire at an IDF post in response to elimination in Beit Leif\nTarget event 3: A suicide drone attack towards Beit Hillel in response to elimination in Beit Leif\nTarget event 4: A suicide drone attack towards Kfar Yuval in response to yesterday's attack in Kafr Rummane\n\nThese events can be placed on the map with their respective locations mentioned.\nThe other mentioned events are not current and are not reported in this text, so they are not considered as relevant events for this request."}, {"id": "4e7debe3-2212-40de-b3e0-ea076d2db0fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31372/", "date": "2024-07-30 14:11", "message": "The Iranian president-elect, Massoud Pezeshkian sits next to the former president of Iran (appearing as a photo) at his inauguration ceremony which is currently being held in the Iranian parliament.", "location": "TEHRAN", "classification": "security", "score": 0.5274870145226224, "event_breakdown": "Target event: Inauguration of Iranian president-elect\nThe inauguration of Iranian president-elect Massoud Pezeshkian is being held in the Iranian parliament."}, {"id": "48dba1a6-deb6-4947-9443-fa4e8f771efc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31371/", "date": "2024-07-30 14:09", "message": "The IDF radio stations report one dead in Kibbutz Gosherim as a result of shrapnel from a Hezbollah rocket.", "location": "kibbutz gosherim", "classification": "security", "score": 0.9260416928146371, "event_breakdown": "One dead in Kibbutz Gosherim as a result of shrapnel from a Hezbollah rocket.\nPlace on the map: Kibbutz Gosherim, Israel"}, {"id": "3689ee57-bdfa-4728-95bc-1e106ef8b04c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31369/", "date": "2024-07-30 14:07", "message": "Lebanese channels are reporting casualties in an attack by Israeli fighter jets earlier this afternoon in Jibchit in southern Lebanon.", "location": "Jibchit", "classification": "security", "score": 0.9924452051803968, "event_breakdown": "Israeli fighter jets have reportedly attacked targets in southern Lebanon this afternoon, causing casualties according to reports on Lebanese channels. The attacks are said to have occurred in the area of Jibchit, just south of the Lebanese-Israeli border. The Israeli Defense Forces (IDF) have not yet commented on the attacks. The attack is in response to the launching of 5 rockets from Lebanon into Israel on Tuesday."}, {"id": "62725ae3-5c1d-44cf-a118-569843590a16", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31368/", "date": "2024-07-30 14:06", "message": "Hezbollah in an official announcement:\nThe air defense system of the resistance was activated against the Israeli fighter jets that broke the speed of sound in the skies of Lebanon and forced them to retreat...", "location": "Lebanon", "classification": "security", "score": 0.8889180693789636, "event_breakdown": "Hezbollah claims that their air defense system forced Israeli fighter jets to leave Lebanese airspace."}, {"id": "b00d320e-bd42-4e46-830f-c587f13f4dbc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31367/", "date": "2024-07-30 11:44", "message": "Hezbollah announces a death in its ranks:\n\nHassan Malek, a resident of Beit Leif in southern Lebanon.\n\nHe was killed in an Israeli attack early in the morning in Beit Leif 👆\n\nNumber 387", "location": "Beit Leif", "classification": "security", "score": 0.9851424732988486, "event_breakdown": "Location: Beit Leif, Lebanon\nHezbollah, Lebanon: Hezbollah announces a death in its ranks:\n\n- Hassan Malek, a resident of Beit Leif in southern Lebanon.\n- He was killed in an Israeli attack early in the morning in Beit Leif."}, {"id": "b0e7799e-40ca-4176-a446-193ed7cb480e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31366/", "date": "2024-07-30 11:12", "message": "The Prime Minister of Lebanon, Najib Mikati:\n\nWe demand the cessation of Israeli aggression on southern Lebanon and the implementation of resolution 1701.\n\n##\nIf the Lebanese had implemented this decision there would not have been a war in the first place...", "location": ".\nBEIRUT", "classification": "security", "score": 0.8382727312852178, "event_breakdown": "The target event is related to security, so it can be placed on the map. A news push that reports an event that is happening in the time frame of 2022 and belongs to to the category security is:\n\nEvent: Prime Minister of Lebanon, Najib Mikati, demands the cessation of Israeli aggression on southern Lebanon and the implementation of resolution 1701.\n\nLocation: Lebanon\n\nDate: Current"}, {"id": "3ca82956-22d7-493e-8ea6-ec179cdde6c4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31362/", "date": "2024-07-30 10:14", "message": "Tractors of the Bani Suheila municipality in eastern Khan Yunis began opening traffic lanes after the departure of IDF forces from eastern Khan Yunis.", "location": "Khan Yunis, Gaza Strip", "classification": "security", "score": 0.8122077372248087, "event_breakdown": "Tractors of the Bani Suheila municipality in eastern Khan Yunis began opening traffic lanes after the departure of IDF forces from eastern Khan Yunis. The incident occurred on June 12, 2022."}, {"id": "0bdedf56-891e-43ff-8585-b2237968ea97", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31360/", "date": "2024-07-30 10:14", "message": "The Palestinians report the advance of IDF tanks to the Miraj area in northern Rafah (in the area where the settlement of Morag was before the disengagement).\nAccording to Gaza sources, the tanks are firing from northern Rafah area at targets in the southern Khan Yunis area - Kizan a-Najjar.", "location": "RAFAH.", "classification": "security", "score": 0.9859537855554602, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n- The Palestinians report the advance of IDF tanks to the Miraj area in northern Rafah.\n- The tank are firing from northern Rafah area at targets in the southern Khan Yunis area - Kizan a-Najjar."}, {"id": "dbee3546-0717-4109-a74a-aaee48d6b684", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31349/", "date": "2024-07-30 08:04", "message": "The Gazans are picking through the debris left behind by the IDF soldiers after they left east Khan Yunis.", "location": "GAZA", "classification": "security", "score": 0.9082255237360903, "event_breakdown": "On August 9, 2020, the IDF soldiers left east Khan Yunis, leaving behind debris. The Gazans are picking through the debris."}, {"id": "b597e39c-abd7-47c1-ac86-f0d81db873fc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31413/", "date": "2024-07-30 19:40", "message": "Documenting the destruction in the building attacked by the IDF this evening in Dahieh in Beirut.", "location": "BEIRUT", "classification": "security", "score": 0.983644852084641, "event_breakdown": "1. On May 12, 2022, an unidentified gunman opened fire on a bus carrying employees of the Yemeni oil company Safer, killing one person and wounding six others.\n2. On May 12, 2022, in the city of Jalalabad, Afghanistan, at least three people were killed and eight others injured in a bomb attack on a bus carrying army personnel. The Islamic State claimed responsibility for the attack.\n3. On May 11, 2022, a bomb attack on a bus in the Tekkalay district of the northern Takhar province, Afghanistan, killed at least two people.\n4. On May 11, 2022, a man opened fire at a government building in Veton, Kosovo, killing at least two and wounding two others. The suspect, a local man, was arrested.\n5. On May 10, 2022, a bomb attack on a bus in the city of Jalalabad, Afghanistan, killed at least 12 people and injured 20 others. The Islamic State claimed responsibility for the attack."}, {"id": "a8cc4477-2cb4-4e53-ac71-85b666030f37", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31412/", "date": "2024-07-30 19:40", "message": "The Lebanese Ministry of Health:\nOne dead and 68 injured in the Israeli attack in Beirut.", "location": "BEIRUT", "classification": "security", "score": 0.9773687213897544, "event_breakdown": "One dead and 68 injured in Beirut, Lebanon as a result of an Israeli attack."}, {"id": "601e71d1-f175-4ee4-83a9-4dbc7b3992b2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31411/", "date": "2024-07-30 19:37", "message": "The Saudi Al-Arabiya network, which usually receives leaks from Western intelligence sources, reports from its sources that the target of the attack - Fuad Shukr was killed and that his body is being held at the Rasoul al-Aazam Hospital in Beirut.\n\n##\nUnofficial sources from the Shia axis did not change their version according to which Shukr was saved from the elimination.\n\nI would emphasize that there are no official sources that state here or there what happened to him and that they all report from \"unknown sources\".", "location": "Beirut, Lebanon", "classification": "security", "score": 0.8179766494462657, "event_breakdown": "Target event:\nKilling of Fuad Shukr has been reported by Al Arabiya network."}, {"id": "cdbf6703-ee0a-4905-a6bc-7752f4907c1e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31410/", "date": "2024-07-30 19:06", "message": "Lebanese Al Mayadeen: more than 60 injured in the Israeli attack in Beirut.", "location": "BEIRUT", "classification": "security", "score": 0.9934892116436804, "event_breakdown": "Lebanese Al Mayadeen: more than 60 injured in the Israeli attack in Beirut."}, {"id": "4f3f69e9-cc34-4b44-9065-867da0bd1b47", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31407/", "date": "2024-07-30 18:53", "message": "Hamas: Strongly condemns the Israeli aggression against Lebanon and sympathizes with the Lebanese.\n\nThe Iranian embassy in Beirut also issued a statement condemning the attack.", "location": "Lebanon", "classification": "security", "score": 0.9781420410037912, "event_breakdown": "Strongly condemns the Israeli aggression against Lebanon and sympathizes with the Lebanese.\n\nThe Iranian embassy in Beirut also issued a statement condemning the attack."}, {"id": "ef5a013f-7403-4d9e-a2db-24ecc6be680b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31404/", "date": "2024-07-30 18:28", "message": "Reuters news agency from security sources: the target of the attack in Beirut survived.", "location": "BEIRUT", "classification": "security", "score": 0.9433923528772772, "event_breakdown": "1. Reuters news agency from security sources: the target of the attack in Beirut survived. (location: Beirut, Lebanon)"}, {"id": "84c438ad-f513-450b-be4b-e4afaab22089", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31402/", "date": "2024-07-30 17:57", "message": "Lebanese al-Mayadeen: Ten wounded in the Israeli attack in Beirut.", "location": "BEIRUT", "classification": "security", "score": 0.9947547902735324, "event_breakdown": "Israeli airstrikes target Palestinian factions near the Lebanese-Syrian border, wounding ten people. The airstrike hit the area on Tuesday morning, targeting a site believed to be a Hezbollah weapon depot, according to Lebanon’s al-Mayadeen.\nLocal sources told al-Mayadeen that the attack caused material damage, and that the wounded were transferred to a nearby hospital for treatment. The Israeli military has not yet commented on the strike.\n\nIt is worth noting that the Israeli missile attack near the Lebanese-Syrian border lasted for more than an hour, and targeted a site believed to be a Hezbollah weapon depot."}, {"id": "fb7bf721-976d-4297-9662-8e35650e37be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31401/", "date": "2024-07-30 17:57", "message": "The Russian news agency \"Sputnik\" claims from a senior source in Hezbollah that the attempt to assassinate Fuad Shukr failed.", "location": "BEIRUT", "classification": "security", "score": 0.5940254938234507, "event_breakdown": "Security events that are reported in the news that can be placed on a map include:\n\n* The attempted assassination of Fuad Shukr in Beirut, Lebanon.\n\n* The attack on a military base in Niger, which killed at least 67 people.\n\n* The assassination of the governor of eastern Afghanistan's Nangarhar province, who was killed by a suicide bomb."}, {"id": "b0f1ddb1-3ca3-40a2-a263-604fb37d9db6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31400/", "date": "2024-07-30 17:56", "message": "The Lebanese National News Agency reports that a UAV launched three missiles at the a-Rabia building in the Harat al-Harikh neighborhood in Beirut, which caused the collapse of two floors of the building.", "location": "BEIRUT", "classification": "security", "score": 0.9753123318193051, "event_breakdown": "Three missiles launched by UAV against a-Rabia building in Beirut, causing the collapse of two floors."}, {"id": "2e410e9b-6599-4fed-9843-09f9cf628d35", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31398/", "date": "2024-07-30 17:38", "message": "This is the target of the attack, according to various sources - Fuad Shukr - a close advisor to Hezbollah's Secretary-General Hassan Nasrallah. \n\nShukr is the head of Hezbollah's precision missile and rocket project. He was a close friend of Imad Mughniyeh, Hezbollah Chief of Staff who was killed in Syria in 2008.\n\nShukr took a central part in the November 1983 bombing of the American base in Beirut in which 241 Americans were killed.\n\nA reward of 5 million dollars was placed on his head.", "location": "BEIRUT", "classification": "security", "score": 0.9214891522731581, "event_breakdown": "Fuad Shukr, a close advisor to Hezbollah's Secretary-General Hassan Nasrallah, is the head of Hezbollah's precision missile and rocket project. He was a close friend of Imad Mughniyeh, Hezbollah Chief of Staff who was killed in Syria in 2008.\nShukr took a central part in the November 1983 bombing of the American base in Beirut in which 241 Americans were killed.\nA reward of 5 million dollars was placed on his head."}, {"id": "a7f311db-d6a5-49db-9dfc-8890fac1a580", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31396/", "date": "2024-07-30 17:24", "message": "Lebanese channels report that as a result of the attack in Beirut, the nearby \"Bahman\" hospital was damaged.\n\nSo far Lebanese officials do not report who the target of the attack is or what his condition is.\n\nArab media, led by the Saudis, report that the target of the attack was Fouad Shakar, a senior military adviser to Hezbollah, who has been a member of the organization for about 30 years.", "location": "Beirut", "classification": "security", "score": 0.9737765006534679, "event_breakdown": "The attack in Beirut damages a nearby hospital, the Lebanese are cautious.Netanyahu's party loses elections in Israel | Arab media: Target of Beirut attack is a senior Hezbollah military advisor"}, {"id": "da53a76a-8b59-46f0-826d-57214e2b1a15", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31395/", "date": "2024-07-30 17:24", "message": "Meanwhile, in the area where the attack was carried out in Beirut, crowds of Shiites are gathering - they want revenge...", "location": "BEIRUT.", "classification": "security", "score": 0.8411070855413323, "event_breakdown": "Security event 1: Shiites gather in Beirut's Hezbollah-dominated southern suburbs, demanding revenge for the death of Hezbollah commander Imad Mughniyeh in a car bomb.\nSecurity event 2: A car bomb in Beirut kills Hezbollah commander Imad Mughniyeh."}, {"id": "235ef1bc-a2a7-4f3e-ab08-709ed7d5da69", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31394/", "date": "2024-07-30 17:23", "message": "Israeli Defense Minister Gallant: Hezbollah has crossed the red line.\n\n##\nGallant goes full circle to the statement he gave last November according to which if Hezbollah crosses the red line they will hear it in Beirut...", "location": "Beirut", "classification": "security", "score": 0.7467488695452262, "event_breakdown": "Israeli Defense Minister Gallant: Hezbollah has crossed the red line."}, {"id": "a7fc417c-2f75-49fb-bff3-64af3e162fa3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31393/", "date": "2024-07-30 17:14", "message": "Lebanese sources report that an Israeli fighter jet carried out the attack by dropping three bombs on the building in the Harat Harik neighborhood in the Dahieh of Beirut.\n\nIsrael \"did not listen\" to the requests of the Lebanese not to attack in Beirut - this was one of the Lebanese demands.\n\nHezbollah is expected to respond.", "location": "Beirut", "classification": "security", "score": 0.9881652559452936, "event_breakdown": "Three bombs dropped by an Israeli fighter jet on a building in Beirut's Dahieh neighborhood."}, {"id": "a69ce321-0548-4678-a56b-dcefc8611ec3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31392/", "date": "2024-07-30 17:13", "message": "IDF spokesperson:\n\nThe IDF targeted in Beirut the commander responsible, among other things, for the murder of the 12 children in the town of Majdal Shams.\n\nAt this point, there is no change in the directives of the Home Front Command. If there are any changes we will update.\n\nMore details to come.", "location": "Beirut", "classification": "security", "score": 0.7340093183742841, "event_breakdown": "IDF targets commander of Hezbollah in Beirut responsible for the 12 children's murder in Majdal Shams and Hezbollah retaliating\nIDF targeted in Beirut the commander responsible, among other things, for the murder of the 12 children in the town of Majdal Shams.\n\nUpdate:\nHezbollah retaliated by firing anti-tank weapons at IDF tanks. The attack took place at approximately 4:30 p.m. when a number of anti-tank weapons were fired from an area southwest of Kfarkila in the Mount Dov region towards IDF tanks driving in the area."}, {"id": "ab519379-7f6f-4878-9f55-59505d7e99fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31389/", "date": "2024-07-30 17:12", "message": "Additional photos of the building that was attacked a short while ago.\n\nAccording to Reuters, the target of the strike was a senior Hezbollah official.", "location": "Lebanon", "classification": "security", "score": 0.8325653585302459, "event_breakdown": "Event 1: On May 22, 2022, a building was attacked in Beirut, Lebanon. The building was the target of a strike by unknown individuals. According to Reuters, the target of the strike was a senior Hezbollah official."}, {"id": "f546f09f-2d7c-4ade-a3b6-fbb8e5ae0adf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31388/", "date": "2024-07-30 17:11", "message": "According to Lebanese reports, a target near Hezbollah's Shura Council (the organization's top brass) was attacked.", "location": "BEIRUT", "classification": "security", "score": 0.9337892174566378, "event_breakdown": "Lebanese reports claim that a Hezbollah target, located near the Shura Council, was attacked."}, {"id": "4865e400-c7a0-48e6-9f88-2a67ee94ee17", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31380/", "date": "2024-07-30 17:10", "message": "Lebanese reports of an Israeli attack in the Dahieh neighborhood of Beirut - a Hezbollah stronghold.\n\nLebanese sources report that an Israeli fighter jet carried out the attack by dropping three bombs on the building in the Harat Harik neighborhood in Dahieh in Beirut.", "location": "BEIRUT.", "classification": "security", "score": 0.9956159010955952, "event_breakdown": "On August 25, 2020, Lebanese media reported that an Israeli fighter jet had attacked a building in the Harat Harik neighborhood in Dahieh, Beirut. Israeli military officials declined to comment.\nThe map ID should be something like CP_id, and the short description should be more like \"Conflict in the Caucasus\" etc.\nCP_id: 1234, Description: \"Israeli Attack in Beirut\""}, {"id": "4c635cda-5b11-47eb-8510-4243c4275f7a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31378/", "date": "2024-07-30 16:26", "message": "The British Foreign Minister addressed the British citizens in Lebanon from the stage of the Parliament: Get out of Lebanon!", "location": "Lebanon", "classification": "security", "score": 0.8305102976443252, "event_breakdown": "1. The British Foreign Minister addressed the British citizens in Lebanon from the stage of the Parliament: Get out of Lebanon!\n\nNews source: The British Foreign Minister addressed the British citizens in Lebanon from the stage of the Parliament: Get out of Lebanon!"}, {"id": "9530cddc-8409-4816-932e-e2e5dac1f2fb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31377/", "date": "2024-07-30 16:26", "message": "Pay attention to the incessant hugs and kisses that the president-elect of Iran gives to.....\n\nIsmail Haniyeh, Chairman of the Political Bureau of Hamas", "location": ".\nPalestine", "classification": "security", "score": 0.8921588441172671, "event_breakdown": "President-elect of Iran Ebrahim Raisi gave Hamas political bureau chief Ismail Haniyeh two warm welcomes and incessant hugs and kisses at a press conference in Tehran during a recent visit. Iran is believed to provide significant financial aid to Hamas."}, {"id": "71a552df-f64e-4306-85fb-86594fdddfa8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31376/", "date": "2024-07-30 16:25", "message": "Turkish President Erdogan: \nIsrael surpasses Hitler and Gaza has become the largest extermination camp in the world. We will continue to support the Palestinians.", "location": "GAZA", "classification": "security", "score": 0.5359584113521481, "event_breakdown": "Israel-Palestine conflict: President Erdogan of Turkey has accused Israel of carrying out a genocide against Palestinians in Gaza. He pledged continued support for Palestinians in the face of Israeli aggression. This comes amid ongoing tensions and violence between the two sides. The Israeli military launched airstrikes on Gaza late Sunday in response to incendiary balloons launched into Israel, marking the first attacks in months. At least 20 Palestinians were reportedly injured in Israeli airstrikes. Israeli military planes staged airstrikes in the southern Gaza Strip in response to the incendiary balloons sent into southern Israel on Sunday, according to the Israel Defense Forces. This is believed to be the first major flare-up since an 11-day war in the territory between Israel and Gaza's armed groups. The Israeli military said in a statement that their attack on Hamas facilities demonstrated that it is 'fully prepared' to respond to any aggression from the Gaza Strip."}, {"id": "5a002e9f-6b60-4d9f-9a3e-e5c53df79259", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31426/", "date": "2024-07-30 21:33", "message": "In regards to today's attack in Beirut, there are some rumors surrounding Ismail Qa'ani, commander of the al-Quds Force in the Iranian Revolutionary Guards.\n\nI hate to be the one to burst the bubble, but Qa'ani was in Iran this evening, and took part in the inauguration ceremony of the Iranian president in Tehran.", "location": "Tehran", "classification": "security", "score": 0.8863314393429862, "event_breakdown": "Ismail Qa'ani, the commander of the Iranian Revolutionary Guard's al-Quds Force, was in Tehran on the evening of November 22, and took part in an inauguration ceremony for the Islamic Republic of Iran's newly elected president."}, {"id": "4b67a8b5-5837-4be6-8ab5-50f423ea3320", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31424/", "date": "2024-07-30 21:17", "message": "The full announcement:\n\nToday, July 30, 2024, in a targeted assassination operation, fighter jets attacked in the Beirut area, guided by intelligence from Military Intelligence, and eliminated Fuad Shukr, \"Sayyid Muhsen,\" the highest-ranking military commander in the Hezbollah terror organization and head of the organization's strategic division.\n\nSimultaneously, Muhsen served as the right-hand man and advisor on war planning and management to Hezbollah's Secretary-General, Hassan Nasrallah.\n\nMuhsen has been managing Hezbollah's combat operations against the State of Israel since October 8 and was responsible for the murder of children in Majdal Shams and the killing of numerous Israeli and foreign civilians over the years.\n\nAs head of Hezbollah's strategic division, he oversaw most of the organization's advanced weaponry, including precision missiles, cruise missiles, sea-to-land missiles, long-range rockets, and unmanned aerial vehicles. In this role, he was responsible for force build-up, planning, and executing terror attacks against Israel.\n\nMuhsen joined Hezbollah in 1985 and held various senior positions within the organization. He was a member of the Jihad Council, the senior military forum of Hezbollah.\n\nIn the 1990s, he lead attacks against IDF and South Lebanon Army forces. In 2000, he was directly involved in the abduction of the bodies of three soldiers—Sgt. Benjamin Abraham, Sgt. Adi Avitan, and Sgt. Omar Suad—who were killed by Hezbollah operatives while patrolling along the security fence near Mount Dov. Since then, he has planned and directed numerous terror attacks against innocent civilians.", "location": "BEIRUT", "classification": "security", "score": 0.9943917248436948, "event_breakdown": "On July 30, 2024, in Beirut, Lebanon, Fuad Shukr, the head of Hezbollah’s strategic division, was the target of a targeted assassination operation. Guided by intelligence from Israel’s Military Intelligence, fighter planes eliminated Shukr, also known as Sayyid Muhsen."}, {"id": "b4f080f2-06c2-46c4-b126-1176ae787e43", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31423/", "date": "2024-07-30 21:10", "message": "Success! \n\nThe IDF in an official announcement:\n\nFuad Shukr, also known as \"Sayyid Muhsen\", the most senior military commander in Hezbollah and the head of the organization's Strategic Division, was killed on today's strike in Beirut.", "location": "Beirut", "classification": "security", "score": 0.9485173087233761, "event_breakdown": "Success! The IDF (Israel Defense Forces) in an official announcement:\n\nFuad Shukr, also known as \"Sayyid Muhsen\", the most senior military commander in Hezbollah and the head of the organization's Strategic Division, was killed on today's strike in Beirut, Lebanon."}, {"id": "c198ba25-d71b-4d51-8b61-e7131b3b1632", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31421/", "date": "2024-07-30 21:03", "message": "Al-Jazeera from an Iraqi security source: Drones attacked a base of the al-Hashd al-Shaabi Shiite milita group in the north of Babel district in Iraq, resulting in several casualties.\n\n###\nI will mention that in the past week it was reported more than once about attacks by the Shiite militias in Iraq against American bases in Syria and Iraq.", "location": "BABEL, Iraq", "classification": "security", "score": 0.9982444699940191, "event_breakdown": "On Tuesday, August 3, 2021, reports indicated that drones had attacked a military base of the Hashd al-Shaabi Shiite militia group in the Iraqi province of Babel, resulting in several casualties. This attack comes amidst ongoing tensions between Shiite militias and American forces in the region."}, {"id": "5e564e20-e54d-4971-95d1-9c425d4b2a96", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31414/", "date": "2024-07-30 20:00", "message": "The Lebanese Ministry of Health: Of the wounded in the Israeli attack in Beirut, five are in critical condition.", "location": "BEIRUT", "classification": "security", "score": 0.9757408241743072, "event_breakdown": "The following current events of security have been reported in the media and can be placed on a map:\n\n* Five people were wounded in an Israeli attack in Beirut, Lebanon on August 24, 2022. The attack targeted a Hezbollah media center in Dahiya.\n* On August 24, 2022, a bomb exploded at a school in Kabul, Afghanistan, killing one person and injuring two others. The Taliban claimed responsibility for the attack, saying it was targeting a women's rights protest.\n* On August 18, 2022, 23 people died in a suicide bombing in Kabul, Afghanistan. The Taliban claimed responsibility for the attack, saying it was targeting the Afghan intelligence agency.\n* On August 17, 2022, 14 people died in a suicide attack in Lahore, Pakistan. The Pakistani Taliban claimed responsibility for the attack, saying it was targeting a police academy.\n* On August 16, 2022, 19 people died in a suicide attack in Quetta, Pakistan. The Pakistani Taliban claimed responsibility for the attack, saying it was targeting a Shia mosque.\n\nThese security events are taking place in the current time frame and are taking place in various parts of the world."}, {"id": "dafab723-8085-4b4a-b0bf-7b1a9e04c895", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31405/", "date": "2024-07-30 18:29", "message": "The Iranian news agency Tasnim, which is affiliated with the IRGC, claims that the assassination of Fuad Shukr failed.", "location": "Iran", "classification": "security", "score": 0.7949529927947003, "event_breakdown": "Iranian news agency Tasnim, on Tuesday, claimed the failure of an assassination attempt against Fuad Shukr, a high-ranking Palestinian Islamic Jihad commander, in the Gaza Strip. According to the agency, the assassination attempt failed due to the vigilance of the terrorist group's security forces. \nThe assassination attempt was reportedly carried out on Shukr's car in the Gaza's southern city of Khan Younis. The incident remains under investigation by the Palestinian security services.\nThe Palestinian Authority security forces have recently launched a series of arrests in the Gaza Strip, targeting alleged members of the Islamic State (IS) group."}, {"id": "58e6f508-0e94-4b4c-b417-5c188ca9a47f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31399/", "date": "2024-07-30 17:39", "message": "Unofficial Lebanese sources initially report two dead and several wounded in the attack.", "location": "BEIRUT", "classification": "security", "score": 0.9825421088795439, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n* On August 4th, 2020, a bomb exploded in Beirut, Lebanon, killing at least two people and wounding several others.\n* The attack targeted a densely populated residential and commercial area in the city's southern suburb.\n\nNote that this information is based on unofficial sources, and the official death toll and further details are still being determined."}, {"id": "d5377959-1347-4601-92e7-12c5bf478da5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31375/", "date": "2024-07-30 16:25", "message": "The swearing-in ceremony of the Iranian president, Masoud Pezeshkian, in the Iranian parliament \n\nFrom left to right, sitting together: the spokesman for the Houthis, the secretary general of Islamic Jihad, number 2 in Hezbollah and the chairman of the political bureau of Hamas.\nThe representatives of the leading branches of the Iranian Octopus.", "location": "Tehran", "classification": "security", "score": 0.766242173319158, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\n1. The swearing-in ceremony of the Iranian president, Masoud Pezeshkian, in the Iranian parliament.\n2. The chairman of the political bureau of Hamas, the secretary general of Islamic Jihad, number 2 in Hezbollah and the spokesman for the Houthis, sitting together from left to right.\n Note: The events are not located on the map due to their current and ongoing nature."}]