[{"id": "9652c0c3-4ba4-48ff-9944-aef5397a3131", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32142/", "date": "2024-08-09 08:32", "message": "This is what an exiled Gazan wrote on Facebook this morning:\n\n\"The appointment of Sinwar, the disappearance of the movement's spokespeople, the effective cessation of the Hamas government in Gaza, alongside the capitulation of the 'Captagon Axis' (the Shiite axis - AA) to escalation and the adoption of the 'Ya Wash Ya Wash' strategy ('slowly, slowly' - a quote from Nasrallah's latest speech - AA) — simply mean that everything has collapsed. \n\nThe myth that has been exploited for 17 years (since Hamas's rise in Gaza - AA) under bombastic slogans has crumbled... Fallen, like a house of cards. Gaza has nothing left but its own residents. They are alone. Alone with themselves... They must now figure out how to escape the tunnel they've been driven into by these bastards...\"", "location": "Gaza", "classification": "antisemitism", "score": 0.5751445863548008, "event_breakdown": "Replace generic names by real names\nThe appointment of Sinwar, the disappearance of the movement's spokespeople, the effective cessation of the Hamas government in Gaza, alongside the capitulation of the 'Captagon Axis' (the Shiite axis) to escalation and the adoption of the 'Ya Wash Ya Wash' strategy ('slowly, slowly') — simply mean that everything has collapsed.\n\nGaza has nothing left but its own residents. They must now figure out how to escape the tunnel they've been driven into by these bastards."}, {"id": "78230cb8-22ec-4acf-a6e3-0ba95865aa18", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32152/", "date": "2024-08-09 14:22", "message": "Save us from Hamas before you save us from the Jews!\n\nHere's a video you won't see on al-Jazeera. A displaced Gazan, during today's evacuation from eastern Khan Yunis:\n\nI call on the whole world.... Save us from Hamas before you save us from the Jews. Save us from Hamas before you save us from the Jews.\n\nThey (Hamas) trade in our blood... And every time we end up being displaced... Look... Our women and children are on the street...\n\n(I call on) the Arab nation, the Islamic nation, the human morality - save us from Hamas before you save us from the Jews... Save us from Hamas before you save us from the Jews...", "location": "itself\nGAZA", "classification": "antisemitism", "score": 0.40527967089494715, "event_breakdown": "The displaced Gazan's plea for help, \"save us from Hamas before you save us from the Jews,\" could not be placed on a map because it refers to a broader sentiment of antisemitism and is not a specific event.\n\nTo have a list of current events of antisemitism reported in text and placed on a map, please provide new prompts."}]