[{"id": "16486bf2-603d-416d-9c4a-9cc40fc430d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27290/", "date": "2024-05-16 10:12", "message": "The Egyptians are trapped with the Rafah crossing\n\nThe Lebanese Al-Akhbar (Hezbollah-affiliated) from Egyptian sources:\nSenior Egyptian officials have informed their American counterparts in recent days that forcing changes on the border between Egypt and Gaza (Philadelphia Axis) through military force is unacceptable. Israel replied to them, through the Americans, that the issue of Israel's control of the Rafah crossing has been decided and that Israel will not withdraw from it, and that the situation must be treated as a matter of course.\n\n##\nI will mention that the Egyptians refuse to open the Rafah crossing for the movement of goods as long as Israel controls the crossing and their position is that they are willing to cooperate in the crossing only with a Palestinian entity and not with Israelis.\nTheir position stems from a fear that they will be perceived as agreeing to the new reality in which Israel controls the crossing. As a result, the crossing remains closed even though Israel is ready to open it for the entry of goods and aid from Egypt.\nLast night Ismail Haniyeh, the chairman of the political bureau of Hamas, stated that the movement is in direct contact with the \"Egyptian brothers\" on this issue.\nEgypt is in an interesting trap that will only get worse as time passes and the crossing remains closed. In the meantime, beyond the issue of goods, there is no going out and no coming in through the crossing gates. Gazans who want to go to Egypt cannot.\nUntil before Israel took control of the crossing, about 700 people per day crossed into Egypt.", "location": "Rafah crossing", "classification": "antisemitism", "score": 0.5287615448279832, "event_breakdown": ".\nHere is the relevant part of the text:\n- The Egyptians informed their American counterparts that they will not open the Rafah crossing for the movement of goods as long as Israeli control exists.\n- The Egyptians refuse to open the crossing and are unsatisfied with cooperation with Israel to make decisions."}]