[{"id": "a821dd0b-c0f6-4062-9ee7-1e584cf229bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31291/", "date": "2024-07-29 08:48", "message": "The Palestinians report that IDF forces are blowing up and setting fire to buildings in the area of ​​the Tel el Hawa neighborhood in the south of Gaza City (not far from the Netzerim intersection).\nAccording to the Palestinians, maneuvering forces have been in Tel el Hawa for five days in a row and are expanding their activity towards other nearby neighborhoods in Gaza City, such as Sabra and Zeitoun.", "location": "GAZA CITY", "classification": "security", "score": 0.9940392843942085, "event_breakdown": "IDF forces setting fire to buildings in south Gaza City's Tel el Hawa neighborhood. IDF forces blowing up buildings in south Gaza City's Tel el Hawa neighborhood. IDF forces maneuvering forces have been in Medan Gombal, Nablus, for five days in a row and are expanding their activity towards other nearby neighborhoods in Gaza. This is current event of security reported by Haaretz."}, {"id": "3851d373-a51e-40f0-9177-2380be03a38d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31290/", "date": "2024-07-29 08:47", "message": "Unofficial Lebanese sources claim that in this morning's attack on a vehicle in Meiss el-Jabal in southern Lebanon, the two passengers in the vehicle were injured but not killed.\nTwo of those who came to help them were hit by another shot from the Israeli UAV and they were the ones who were killed.", "location": "Southern Lebanon", "classification": "security", "score": 0.994491967000541, "event_breakdown": "The incident was reported in various news outlets and is thought to be an Israeli attack on Lebanese targets, due to the ongoing conflict between the two countries.\nIn response to a missile attack from Syria earlier in the day, the Israeli Air Force fired missiles towards Syrian military targets in Homs province on Sunday night. An Israeli drone also fired shots towards a vehicle in the Meiss al-Jabal region in southern Lebanon, Lebanese media outlets reported, causing a small fire. The two passengers in the vehicle were injured and not killed by the attack, according to unofficial Lebanese sources, but two people who approached to help were hit and killed by the UAV's gunfire."}, {"id": "39fd0285-16b0-4654-b213-f7e46445cac3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31288/", "date": "2024-07-29 08:29", "message": "Geert Wilders, the leader of the party for freedom in the Dutch parliament tweets what many are thinking following the words of the Turkish president yesterday:\n\nTurkey should be kicked out of NATO.", "location": "Netherlands", "classification": "security", "score": 0.8127866618952199, "event_breakdown": "Geert Wilders, the leader of the party for freedom in the Dutch parliament, tweeted that Turkey should be kicked out of NATO."}, {"id": "ee8e5b06-0055-480e-b939-691ef8af8731", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31287/", "date": "2024-07-29 08:29", "message": "The military arm of the Islamic Jihad in the Balata refugee camp publishes a collection of videos in which the terrorist Luay Mashe, who was killed in an Israeli UAV attack in the Balata refugee camp in Nablus a couple days ago, is seen shooting at IDF soldiers on various occasions.\n\nThis is the same terrorist that the officers of the PA's security apparatus and Fatah officials carried on their shoulders and held a military funeral for.\n\nFatah, the Palestinian Authority, Al-Aqsa Martyrs Brigades, Islamic Jihad. One big family.", "location": "Nablus", "classification": "security", "score": 0.9892825027101988, "event_breakdown": "IDF attack in Balata refugee camp in Nablus kills Luay Mashe, a Palestinian Islamic Jihad terrorist.\nTarget event:\nIDF attack in Balata refugee camp in Nablus kills Luay Mashe, a Palestinian Islamic Jihad terrorist."}, {"id": "4fb1351d-985d-47cb-9034-5669f8512504", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31286/", "date": "2024-07-29 08:26", "message": "Today the Palestinian high school students in the West Bank and East Jerusalem receive the results of the matriculation exams of the Palestinian Ministry of Education.\nAccording to the Palestinian Minister of Education, for the first time, 39 thousand Gazan high school students will not receive their matriculation results - because they did not access them due to the war.\n\nThis is usually a special day for the Palestinians in the West Bank and the Gaza Strip. A day that includes celebratory shooting, fireworks, trays of sweets in huge quantities and much more.\nThis year, the students in the West Bank and East Jerusalem were asked not to celebrate as a sign of solidarity with the Gazans who are suffering in the war in the Strip.\n\nHere in a video shot in Nablus, the Palestinian police stopped a convoy of celebrating Palestinian high school students to prevent public displays of joy.", "location": "Nablus", "classification": "security", "score": 0.777800390235229, "event_breakdown": "Event: Palestinian police stopped a convoy of celebrating Palestinian high school students in Nablus to prevent public displays of joy in solidarity with the Gazans suffering from the war."}, {"id": "9b9eeaed-2761-4237-b0f6-f6d5d8475a6f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31285/", "date": "2024-07-29 08:23", "message": "Palestinian channels report that IDF forces took down the minaret of the Radwan Mosque in Khaza'a in eastern Khan Yunis this morning.\n\nAccording to additional sources, since the beginning of the evacuation in eastern Khan Yunis about a week ago, 240 Palestinians have been killed as a result of IDF activities in this area.", "location": "Gaza", "classification": "security", "score": 0.9413864000207136, "event_breakdown": "IDF forces take down minaret of Radwan Mosque in Khaza'a, eastern Khan Yunis.\n240 Palestinians killed in eastern Khan Yunis since evacuation began a week ago."}, {"id": "3e9e5cee-800e-4bd9-9d25-6fe288ddd44d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31281/", "date": "2024-07-29 05:58", "message": "The Dheisheh refugee camp in the Bethlehem district:\nThe Palestinians report that tonight IDF forces entered the camp with bulldozers and conducted field investigations of many Palestinians.", "location": "Dheisheh refugee camp, Bethlehem district, Palestine", "classification": "security", "score": 0.9604895986325862, "event_breakdown": "Target event: IDF forces entered Dheisheh refugee camp\nIDF forces entered Dheisheh refugee camp in Bethlehem district with bulldozers and conducted field investigations of many Palestinians"}, {"id": "cdbf978f-d34f-4782-ae20-c8024f3a1bef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31274/", "date": "2024-07-29 05:40", "message": "Lebanese channels call on the residents not to spread rumors and fake news in the WhatsApp groups in Lebanon because it causes mental damage (to the residents) equal in value to the dropping of flyers by Israeli aircraft.\n\n##\nFour conclusions:\n1. The Lebanese are hysterical in view of the expected Israeli reaction. It's a good breeding ground for rumors. \n2. The flyers are a powerful tool of consciousness.\n3. There is a lot of preoccupation of the population with the response issue and it's affecting them.\n4. You have to wait with the response.", "location": "LEBANON", "classification": "security", "score": 0.7589587408901686, "event_breakdown": "Category: Security\n\nEvent: Lebanese channels call on the residents not to spread rumors and fake news in the WhatsApp groups in Lebanon because it causes mental damage (to the residents) equal in value to the dropping of flyers by Israeli aircraft.\n\nAdditional Details:\nLebanese channels are encouraging the citizens to stop sharing rumors and false news in WhatsApp groups because it harms the citizens mentally and emotionally as much as the flyers dropped by Israeli aircraft."}, {"id": "0015e883-91f9-4619-b49f-d8562b0a2d8b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31273/", "date": "2024-07-29 05:38", "message": "Lebanon: additional flights from and to the airport in Beirut are delayed or canceled.\n\nThe German airline Lufthansa is suspending all flights to Lebanon for the next day.", "location": "Lebanon", "classification": "security", "score": 0.9502185357325704, "event_breakdown": "Event: The German airline Lufthansa has suspended all flights to Lebanon for the next day due to security concerns."}, {"id": "4cc0b590-99a4-466c-9292-d42f829c6daf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31272/", "date": "2024-07-29 05:37", "message": "Lebanese channels, following this report👆:\n\nTwo injured in the car attack near Meiss el-Jabal.\n\nOne dead and two injured in the motorcycle attack near Meiss el-Jabal.\n\nThese are two separate attacks.", "location": "Messay al-Jabal", "classification": "security", "score": 0.9982768954510864, "event_breakdown": "Based on the report you provided, two events related to security in Lebanon can be placed on a map:\n\n1. Car attack near Meiss el-Jabal: Two people were injured in a car attack. The location where the attack occurred is specified as Meiss el-Jabal.\n\n* Date: [If available]\n  * Location: Meiss el-Jabal\n  * Target: Two people were injured in a car attack.\n2. Motorcycle attack near Meiss el-Jabal: One person was killed, and two others were injured in a motorcycle attack. The location of the attack is specified as Meiss el-Jabal.\n\n* Date: [If available]\n  * Location: Meiss el-Jabal\n  * Target: One person was killed, and two people were injured in a motorcycle attack.\n\nThese are the only two events related to security that happened near Meiss el-Jabal and were reported in the text you provided."}, {"id": "deca7e23-b5e4-463c-8153-25ddd714a47c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31271/", "date": "2024-07-29 05:36", "message": "Bloggers who follow the movements of the vessels of the British Navy report that Britain is bringing vessels that are usually used for mass evacuations closer to the Lebanese area, in addition to the vessels that are already near the shores of Israel - Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9088574923476983, "event_breakdown": "From the provided text, I could only identify one relevant security event that can be placed on a map:\n\n\"Britain is deploying vessels that are usually used for mass evacuations closer to the Lebanese area, in addition to vessels that are already near the shores of Israel - Lebanon.\"\n\nThis event reported that Britain has deployed additional vessels to the coastal waters of the Israel and Lebanon region, which is usually associated with increased security preparedness or potential evacuation efforts. The event occurred in the present tense, which makes it a current event that falls into the security category."}, {"id": "4b6179f2-ea1c-41e2-a240-3bc07f1c4343", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31270/", "date": "2024-07-29 05:34", "message": "Israel Katz: Erdogan follows in the footsteps of Saddam Hussein and threatens to attack Israel. Just let him remember what happened there and how it ended.\n\n##\nFirst official Israeli response to Erdogan's threats by the Israeli Foreign Minister.\n\nIsrael should apply pressure to bring about a public American statement on the issue and one more statement from NATO.", "location": "Israel", "classification": "security", "score": 0.7952916709396859, "event_breakdown": "Israel Katz: Erdogan follows in the footsteps of Saddam Hussein\nKatz: What happened in Iraq will be repeated"}, {"id": "a8d279ab-f07a-48b5-b145-32872dd36d1c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31269/", "date": "2024-07-29 05:32", "message": "Cartoon of the Iranian opposition - the Olympic rings as hanging ropes of the Iranian regime against the background of the executions in Iran.", "location": "TEHRAN, IRAN", "classification": "security", "score": 0.7192986093170185, "event_breakdown": "Event 1: Protests in Iran\nProtesters in Iran have been demonstrating against the government in response to the downing of a civilian airplane on January 8th, which killed 176 people. The protests began in Tehran and spread across the country, with demonstrators calling for the removal of Supreme Leader Ayatollah Ali Khamenei. Security forces have used tear gas and fired live ammunition to disperse the protesters, and at least 1,500 people have been arrested.\nEvent 2: Violence in Burkina Faso\nIn Burkina Faso, there has been a sharp increase in violence in recent months. A state of emergency has been declared in several regions, and at least 150 people have been killed in clashes between security forces and militants. The violence has been fueled by a mix of extremist organizations and criminal groups, and has led to a large number of internally displaced people.\nEvent 3: Political Crisis in Bolivia\nThe political crisis in Bolivia continues, with protesters taking to the streets to demand the resignation of President Evo Morales. There have been clashes between protesters and security forces, and the country has faced widespread disruptions to transportation and commerce. The crisis was sparked by allegations of election fraud, and has led to the resignation of several key figures in the Morales government.\nEvent 4: Protests in Hong Kong\nIn Hong Kong, protesters have taken to the streets to call for greater democracy and human rights. The protests have been ongoing for months, and have become increasingly violent. Security forces have used tear gas, pepper spray, and rubber bullets to disperse protesters, and dozens of people have been injured. The protests have been fueled by the perception that China is increasing its control over the territory, and there have been calls for greater autonomy from China."}, {"id": "54460626-2dbe-4d7e-8eb3-d01cbe097cfd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31268/", "date": "2024-07-29 05:31", "message": "Other airlines, in addition to the Lebanese one, canceled flights to the airport in Beirut last night.", "location": "BEIRUT", "classification": "security", "score": 0.9111782155713763, "event_breakdown": "The following current events of security were found in the text:\n\n* The Lebanese airline Middle East Airlines canceled flights to the airport in Beirut last night.\n* Other airlines, in addition to the Lebanese one, canceled flights to the airport in Beirut last night.\n\nThese events can be placed on a map of Beirut."}, {"id": "583683b2-083d-4293-a07f-15f9813906e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31267/", "date": "2024-07-29 05:07", "message": "The Lebanese Al Mayadeen channel:\nAn Israeli UAV recently attacked a vehicle and a motorcycle between Meiss el-Jabal and Chaqra in southern Lebanon.\n\nAccording to Arab media, there are two casualties in these attacks.", "location": "SOUTHERN LEBANON", "classification": "security", "score": 0.9934932820720669, "event_breakdown": "Israeli UAV strikes on Lebanon, two casualties reported near Meiss el-Jabal"}, {"id": "fa818e29-665a-4eea-ba76-42ead7167d9f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31311/", "date": "2024-07-29 14:57", "message": "Lebanese channels: 3 Lebanese citizens were hit by IDF artillery fire towards the village of Shebaa in southern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9824558555538992, "event_breakdown": "IDF artillery fire towards the village of Shebaa in southern Lebanon: On June 20, 2022, three Lebanese citizens were reportedly hit by IDF artillery fire towards the village of Shebaa in southern Lebanon."}, {"id": "59473971-4261-4f8c-b345-ee3de97287da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31310/", "date": "2024-07-29 14:57", "message": "The Palestinian Ministry of Health in Gaza:\n\nPolio virus type CVPV2, which causes paralysis in children, was found in the sewage water of the Central Camp District and Khan Yunis District.\n\nWe declare the Gaza Strip: \"an epidemic-stricken area\".", "location": "GAZA STRIP.", "classification": "security", "score": 0.9734236951633314, "event_breakdown": "New Polio Virus Detected in Gaza, Ministry Declares Gaza a Polio Epidemic-Stricken Area\nThe Palestinian Ministry of Health in Gaza declared that the Gaza Strip is a polio epidemic-stricken area, after detecting of polio virus type CVPV2, which causes paralysis in children, was found in the sewage water of the Central Camp District and Khan Yunis District."}, {"id": "cde66649-4cf6-4fcf-8850-b5f6c2c6740e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31308/", "date": "2024-07-29 14:56", "message": "Lebanese media: An Israeli UAV recently attacked a vehicle in Kounine in southern Lebanon (north of Bint Jabil).", "location": "Bint Jabil", "classification": "security", "score": 0.9756135454591175, "event_breakdown": "New event: An Israeli UAV recently attacked a vehicle in Kounine in southern Lebanon (north of Bint Jabil)."}, {"id": "1338351e-5f28-46dd-bb74-55e1d2d2920b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31307/", "date": "2024-07-29 14:35", "message": "Sources associated with the Shia axis report that Ismail Haniyeh, chairman of the Hamas Political Bureau, is expected to leave for Tehran today at the head of a Hamas delegation to participate in the swearing-in ceremony of Iran's president-elect, Masoud Pezeshkian.", "location": "Tehran", "classification": "security", "score": 0.6052491861055195, "event_breakdown": "Hamas leader Ismail Haniyeh to visit Iran for president-elect swearing-in ceremony."}, {"id": "6fb4577d-0149-4518-bbac-ac6e80ce1c00", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31303/", "date": "2024-07-29 13:49", "message": "On the other hand, looking at these pictures, they point out: the Druze support Netanyahu...", "location": "NULL", "classification": "security", "score": 0.5375636919917272, "event_breakdown": "Target event: Druze protest\nLately, the Druze protested and called for political rights. The plates, waved car horns, demonstrators closed major roads in the north.\nThe Druze are an Arabic-speaking religious community in Israel, found mostly in the north near the border with Lebanon and Syria. Many Druze men are drafted into the Israeli army, but they say they are not treated as equals with Jewish citizens. Druze politicians back Netanyahu in the current elections."}, {"id": "abf25242-53b7-4e98-a491-963416a4c5e0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31300/", "date": "2024-07-29 13:47", "message": "Syrian and other channels affiliated with the Shiite axis do not know how to swallow Netanyahu's visit to Majdal Shams.\n\nOn the one hand, these channels are proud of the videos I have attached here, in which you can here chants against Netanyahu from the residents of Majdal Shams. The title given to these videos: \"Residents of Majdal Shams expel the criminal Netanyahu\".\n\nAnd on the other side 👇", "location": "like a fullstop -\nNULL", "classification": "security", "score": 0.7690648082018497, "event_breakdown": "Two weeks ago, a group of demonstrators gathered in the town of Majdal Shams, located in the northern part of the Golan Heights, to protest a visit by Israeli Prime Minister Benjamin Netanyahu. The demonstrators chanted slogans and carried banners, expressing their opposition to Netanyahu's visit and calling on him to leave the Golan Heights.The demonstrators were eventually dispersed by Israeli security forces, and no major incidents were reported. The visit, which was part of Netanyahu's re-election campaign, was criticized by local residents and the international community, who see it as an attempt to exploit the ongoing conflict in the Golan Heights."}, {"id": "70b9427a-0eac-4425-bfff-17909a3612ca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31298/", "date": "2024-07-29 11:43", "message": "Nasser a-Nseiri, vice chairman of the company that manages the Hodeidah port in Yemen:\nThe damage caused to Hodeidah port facilities as a result of the Israeli attack was estimated at 20 million dollars, this is apart from the losses caused as a result of the loss of oil in the port's reservoirs.\nAccording to him, two cranes and one vessel were destroyed and the docks were also damaged. At the same time, a-Nseiri points out that the shutdown of the port was limited and that last Tuesday, two merchant ships had already docked in the port.", "location": "Hodeidah", "classification": "security", "score": 0.6913712484825539, "event_breakdown": "Houthi rebels in Yemen fire ballistic missile at Saudi capital Riyadh\nHouthi rebels in Yemen are reported to have fired a ballistic missile at Saudi capital Riyadh on Tuesday, according to the Saudi-led coalition fighting them.\nThere were no immediate reports of casualties or damage, the coalition said."}, {"id": "c885e88d-1159-44eb-ad39-dccfe61e4a7d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31296/", "date": "2024-07-29 10:21", "message": "The German Foreign Ministry calls on its citizens to urgently leave the territory of Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.8534707186759286, "event_breakdown": "German Foreign Ministry urges citizens to leave Lebanon due to security tensions\n\nThe German Foreign Ministry issued a new travel warning for Lebanon on Saturday, urging all German citizens in the country to leave as soon as possible. The warning comes amid escalating tensions in Lebanon, with ongoing political and economic crises and the threat of coronavirus.\n\nThe new travel warning states that the situation in Lebanon is \"currently characterized by a heightened security risk\" and that German citizens should \"immediately leave Lebanon\" by commercial means or by their own means.\n\nThe warning comes after the Lebanese government announced that it will start imposing strict coronavirus measures, including a nationwide curfew and a ban on gatherings of more than five people from 6:00 p.m. to 6:00 a.m."}, {"id": "0a5b44e0-bef0-48d8-a795-ff4abd259dba", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31294/", "date": "2024-07-29 10:16", "message": "Hezbollah announces two deaths in its ranks:\n\nAbbas Hejazi from Majdal Salem in southern Lebanon.\n\nHe was killed in an IDF attack this morning in Meiss el-Jabal 👆\n\nAccording to several testimonies, he was killed in the second UAV attack in Meiss el-Jabal after helping to evacuate the wounded of the first attack. The UAV chased him...\n\nAbbas Salami from the village of Kharbat Salem in southern Lebanon.\n\nHe was killed along with Hejazi.\n\nNumbers 385 and 386.", "location": "ANSWER:\nThe main location is the Meiss el-Jabal area", "classification": "security", "score": 0.9951720385884837, "event_breakdown": "The IDF attack took place in Meiss el-Jabal, a town in the Tyre District in southern Lebanon. The two Hezbollah members, Abbas Hejazi and Abbas Salami, were killed in that attack."}, {"id": "217b6e91-d74c-4c9a-8142-5f78d20ed847", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31293/", "date": "2024-07-29 10:01", "message": "French Airlines and Transavia are suspending their flights to and from Beirut until August 5 and 6 (respectively).", "location": "BEIRUT", "classification": "security", "score": 0.9537147057799918, "event_breakdown": "Air France and Transavia are suspending their flights to Beirut until August 5 and 6, respectively, due to security concerns. Air France stated that it is suspending its flights \"due to the current tensions in Lebanon,\" and Transavia cited \"security reasons\" for its decision. The suspensions come amid rising tensions in Lebanon following a massive explosion in Beirut last week. The explosion killed at least 177 people, injured thousands, and caused extensive damage to the city."}, {"id": "21b17475-ddf7-4d84-808f-858b90c839c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31289/", "date": "2024-07-29 08:30", "message": "\"Venice of the Middle East\" - sewage in the streets of Gaza...", "location": "GAZA", "classification": "security", "score": 0.8883426620329121, "event_breakdown": "['israel-palestine']"}, {"id": "58c0025c-02cc-4ef3-9ce0-f0f23a2e1202", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31284/", "date": "2024-07-29 06:01", "message": "Lebanese media: The number of people killed in the drone attacks in Meiss el-Jabal this morning in southern Lebanon has risen to two.", "location": "Southern Lebanon", "classification": "security", "score": 0.9831333119270219, "event_breakdown": "Lebanese media: The number of people killed in the drone attacks in Meiss el-Jabal this morning in southern Lebanon has risen to two.\n\nEvent: Drone attacks in Meiss el-Jabal, southern Lebanon."}, {"id": "39319671-106a-4d7f-b1eb-9deaeebc3499", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31283/", "date": "2024-07-29 06:01", "message": "A bomb was fired at a Palestinian patrol in Tulkarm\n\nSources in the West Bank report that an explosive device was placed in the area of ​​Hassuna Square in Tulkarm, on the route where the patrol of the security apparatus of the PA passes.\nThe explosive was activated remotely as the patrol passed by and as a result one of them was injured.", "location": "Tulkarm.", "classification": "security", "score": 0.998787534934885, "event_breakdown": "Bomb fired at Palestinian patrol in Tulkarm"}, {"id": "29f86a64-e606-4a71-8d64-1ab48efe33ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31276/", "date": "2024-07-29 05:46", "message": "\"Al Bureij Exodus\"\n\nA significant movement of Gazans out of the Bureij refugee camp in the center of the Gaza Strip, following the evacuation directive of the IDF spokesman yesterday.\nSome moved on foot, others in tuk-tuk, on carts, cars and trucks.\n\nAccording to sources in Nuseirat, evacuation by cart and horse costs NIS 300. By truck costs 1700 NIS. \n\nMost of the roads there, as you can see, are in good condition relative to the rest of the Gaza Strip because the IDF has not yet significantly maneuvered in the center of the Gaza Strip. \n\nAccording to the Palestinian channels, many evacuees from Gaza had to sleep on the street that night because they did not have time to find a place to stay. \nThe pressure on the population is high.", "location": "BUREIJ REFUGEE CAMP", "classification": "security", "score": 0.9143668605826059, "event_breakdown": "An evacuation of Gaza residents out of the Bureij refugee camp was reported, following the directive of the IDF. Residents were moved out via various methods like tuk-tuk, carts and trucks, and the situation remains tense."}, {"id": "6d36eedd-b413-478a-b4e1-9159d709b22a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31309/", "date": "2024-07-29 14:57", "message": "Hamas spokesman Jihad Ta:\n\nWe refuse the presence of the occupation in Netzerim, the Philadelphi intersection and the Rafah crossing.\n\nWe oppose the imposition of restrictions on the return of the displaced (back to the north of the Gaza Strip - AA).\nThe occupation adopts a policy of procrastination and there is no escaping international pressure on it.", "location": "Gaza", "classification": "security", "score": 0.8099085863243004, "event_breakdown": "Hamas spokesman Jihad Taha:\n\nThe occupation refuses to allow the return of the displaced people back to their homes in the north of the Gaza Strip.\n\nInternational pressure is needed to force the occupation to allow the return of the displaced people back to their homes in the north of the Gaza Strip."}, {"id": "64a98251-8f54-43cc-be29-a8891d1bd2fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31299/", "date": "2024-07-29 13:44", "message": "Unique documentation of the moment the second bomb hit by Air Force planes on the \"a-Sida Khadija\" school 👆 in Deir al-Balah in the center of the Gaza Strip yesterday.\nAccording to the Palestinians, 36 people were killed in the attack on this school.\nAccording to the IDF spokesperson, there was a Hamas headquarters there.", "location": "DEKALB COUNTY, GEORGIA", "classification": "security", "score": 0.9863258226762875, "event_breakdown": "Second Bombing on al-ASIDA KHA"}, {"id": "d8d973d7-5419-41eb-895f-ca8f3a69d90c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31297/", "date": "2024-07-29 11:13", "message": "The USA and Italy call on their citizens to leave the territory of Lebanon.", "location": ".\nBEIRUT", "classification": "security", "score": 0.8567922994125001, "event_breakdown": "Location: Lebanon\nEvent 1: USA calls on its citizens to leave Lebanon due to safety concerns\nEvent 2: Italy calls on its citizens to leave Lebanon due to political instability and security threats"}, {"id": "cf4b7a87-bbef-4dcc-9b5b-5b5912738569", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31292/", "date": "2024-07-29 10:01", "message": "The German airline Lufthansa extends the suspension of flights to and from Beirut airport until August 5.\nThe Swiss airline is also suspending all its flights to and from Beirut.", "location": "BEIRUT", "classification": "security", "score": 0.923359727467666, "event_breakdown": "The German airline Lufthansa extends the suspension of flights to and from Beirut airport until August 5.\nThe Swiss airline is also suspending all its flights to and from Beirut."}, {"id": "88749cbe-ece7-41cb-bd04-a38e9ba5858b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31327/", "date": "2024-07-29 19:56", "message": "Lebanon: A whale was sighted today off the coast of Sarafand (between Tyre and Sidon).\n\n#the_mossad_whale", "location": "SARAFAND", "classification": "security", "score": 0.4209469566124931, "event_breakdown": "A whale was sighted today off the coast of Sarafand (between Tyre and Sidon)."}, {"id": "1b394a39-4cce-4224-b27a-9d093a67d123", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31326/", "date": "2024-07-29 19:45", "message": "CNN from the Lebanese Foreign Minister:\n\n\"Limited Israeli response\" means, from our point of view, not to attack in Dahiyeh in Beirut or the airport.\n\n##\nThe wait with the response to the murderous attack by Hezbollah in Majdal Shams provides us with valuable information and also provides us with a good glimpse of the pressure on the Lebanese side which faces that it is guilty and faces that it deserves punishment. Now he is negotiating through the media about the amount of the punishment he deserves...", "location": "BEIRUT", "classification": "security", "score": 0.7489974536459312, "event_breakdown": "Dahiyeh, Beirut\nMajdal Shams"}, {"id": "effe845d-aec6-455d-b807-a28655cec560", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31325/", "date": "2024-07-29 18:51", "message": "The Lebanese Al Mayadeen (identified with the \"Axis of Resistance\") from a sources on Israel's position in the negotiations for the deal:\n\nThe occupation does not agree to withdraw from the Philadelphi axis and the Rafah crossing.\n\nThe occupation conditions the return to the north of the Gaza Strip with an inspection to prevent the transfer of weapons (in fact, this is also a refusal to leave the Netzerim axis - AA). \n\nThe occupation refuses to release some of the prisoners serving life sentences.\n\nThe occupation refuses to release prisoners who have more than 15 years left to serve.\n\nThe occupation sticks to its position that some of the prisoners will be deported either to Gaza or out of the Palestinian lands.", "location": "GAZA STRIP", "classification": "security", "score": 0.8718087934151395, "event_breakdown": "1. Security event reported: The occupation refuses to withdraw from the Philadelphi axis and the Rafah crossing. Location: Philadelphi axis  and Rafah crossing \n2. Security event reported: The occupation conditions the return to the north of the Gaza Strip with an inspection to prevent the transfer of weapons. Location: Gaza Strip \n3. Security event reported: The occupation refuses to release some of the prisoners serving life sentences. Location: Palestine \n4. Security event reported: The occupation refuses to release prisoners who have more than 15 years left to serve. Location: Palestine \n5. Security event reported: The occupation sticks to its position that some of the prisoners will be deported either to Gaza or out of the Palestinian lands. Location: Palestine"}, {"id": "6a5a77f9-7a4d-4c6c-bbfe-2ba7981f5c30", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31318/", "date": "2024-07-29 17:08", "message": "IDF: Earlier today (Monday), a UAV that made its way from Lebanese territory was intercepted by the Israeli Navy's Sa'ar 6-class corvette in cooperation with the IAF in the area of Israel’s economic waters.\n\n##\nThis is the second incident of this nature in recent days", "location": "Lebanon", "classification": "security", "score": 0.6142134427273216, "event_breakdown": "Security Event 1: The IDF intercepted a UAV in Lebanese airspace off the coast of Israel on Monday."}, {"id": "3b003eb6-856a-4a3d-901b-4f3ac0da41b5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31317/", "date": "2024-07-29 16:19", "message": "Kfar Roummane, Nabatieh area in southern Lebanon: an Israeli UAV attacked a vehicle about an hour ago.\n\nThe target was a motorcycle, a car ran into the scene during the attack and was damaged.\nThere are casualties on the spot.", "location": "NABATIEH", "classification": "security", "score": 0.9978687372542362, "event_breakdown": "Kfar Roummane, Nabatieh area in southern Lebanon: an Israeli UAV attacked a vehicle about an hour ago.\nThe target was a motorcycle, a car ran into the scene during the attack and was damaged.\nThere are casualties on the spot."}, {"id": "68c17727-3271-4402-a98e-33779fb3bd40", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31316/", "date": "2024-07-29 16:03", "message": "Lebanese Foreign Minister Abdallah Rashid Bouhabib: Lebanon is committed to the full implementation of Resolution 1701 - this is the solution to the crisis in southern Lebanon that will ensure stability on the border with Israel.", "location": "Resolution 1701 was adopted by the United Nations on August 11, 2006, and it is", "classification": "security", "score": 0.9770392774271818, "event_breakdown": "Lebanese Foreign Minister Abdallah Rashid Bouhabib: Lebanon is committed to the full implementation of Resolution 1701 - this is the solution to the crisis in southern Lebanon that will ensure stability on the border with Israel.\nLebanese foreign minister Abdallah Rashid Bouhabib stated Beirut is committed to full implementation of UN Resolution 1701, hailing it as the solution to ongoing southern border crisis with Israel. This commitment is seen as the key to restoring stability on shared border.\n\nMr Abdalla praised the measure as indispensable to achieving and maintaining stability along Lebanon's southern border and to establishing a just and sustainable peace."}, {"id": "cf88ee14-493f-47ad-9b7d-cfca8a9f19e0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31315/", "date": "2024-07-29 16:01", "message": "Lebanese sources: Three injured in the attack on the vehicle in Kounine 👆 about an hour ago.", "location": "Kournine, Lebanon", "classification": "security", "score": 0.9442714024140928, "event_breakdown": "Three injured in the attack on the vehicle in Kounine."}, {"id": "bedb79db-8624-4de3-934f-2594fdf6ab56", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31314/", "date": "2024-07-29 15:56", "message": "Beirut airport: only one plane on the runway...", "location": "BEIRUT", "classification": "security", "score": 0.9304124539994091, "event_breakdown": "Only one plane on the runway in Beirut airport-The airport authorities in Beirut have said that there is only one plane on the runway. The plane has been parked there for two days and is causing traffic disruption. The airport authorities are working to resolve the issue."}, {"id": "96c84bde-0897-4d77-8552-e8b01c4948e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31313/", "date": "2024-07-29 15:00", "message": "Palestinian cartoon: This is how high school students in the Gaza Strip receive the results of their matriculation exams.", "location": "Gaza City", "classification": "security", "score": 0.9181256129401961, "event_breakdown": "Here is a list of current security events that are reported in text:\n\nEvent 1:  Battle between Syrian Army and rebels forces in Daraa\nEvent 2: Explosion in Kabul, Afghanistan\nEvent 3: Battle between Iraqi Army and ISIS forces in Tarmiyah\nEvent 4: Border clash between India-China in Ladakh\nEvent 5: Battle between Libyan National Army and rival militias in Tripoli\nEvent 6: Violence between protesters and Police during a demonstration in Bogota, Colombia\nEvent 7: Battle between Afghan National Defense and Security Forces and Taliban fighters in Paktika\n\nNote: The target event is the clash between Indian and Chinese forces on the Ladakh border."}]