[{"id": "712b9b8a-a2ce-42bd-a64a-fcbe82098121", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26674/", "date": "2024-05-04 16:10", "message": "The Palestinians publish the names of four of the \"martyrs\" who were killed in the IDF operation tonight in the village of Deir el Ghusun in the north of Tulkarm:\n\n1. Alaa Sharith (the leftmost one).\n2. Tamer Fuqaha (next to Alaa' - both are behind the attack in which Elhanan Klein fell in November 2023. Tamer is also an operative of Erin al Aswad).\n3. Adnan Samara\n4. Asal Badran\n\nIn addition, there is the \"headless martyr\" who has not yet been identified - DNA tests will be conducted on him to confirm his identity.", "location": "Deir el Ghusun", "classification": "security", "score": 0.9791185685870558, "event_breakdown": "1. The Palestinians publish the names of four \"martyrs\" killed in IDF operation in Deir el Ghusun, Tulkarm:\n   - Alaa Sharith\n   - Tamer Fuqaha\n   - Adnan Samara\n   - Asal Badran\n2. \"Headless martyr\" discovered in the same operation, awaiting DNA tests for identification."}, {"id": "d3ec0654-e49b-4488-a403-90b1d678910b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26673/", "date": "2024-05-04 15:36", "message": "The Palestinians report that the IDF forces have finished their activities in Deir al-Ghusun in the north of Tulkarm and have left.\nSources in Tulkarm say that the Palestinian rescue forces located another Palestinian \"martyr\" among the ruins, apparently headless.", "location": "Tulkarm", "classification": "security", "score": 0.9671169206516085, "event_breakdown": "- IDF forces finish activities in Deir al-Ghusun in the north of Tulkarm and leave\n- Palestinian rescue forces find headless Palestinian \"martyr\" among the ruins in Tulkarm"}, {"id": "6db03ce2-647e-4d1a-ab61-dfa5b8021d2b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26672/", "date": "2024-05-04 14:06", "message": "The Palestinians report that the person who came out from under the ruins of the house in Deir al-Ghusun and was arrested by IDF forces is the released prisoner Salma Badran, an operative of the military wing of Hamas with a \"heavy\" family lineage: he is the brother of the two \"martyrs\" of the wing - Fawaz and Seif Allah Badran. Salma is the owner of the apartment where the Hamas terrorists hid last night and which the IDF destroyed.\n\nFawaz (Salma's brother) was one of the senior bomb engineers of the Izz ad-Din al-Qassam Brigades in the West Bank and was the one who assembled the explosive device that exploded in the first suicide attack of the second intifada (March 2001), in which 3 Israeli citizens were killed in Netanya. Fawaz was also the one who recruited the suicide bomber for the attack and also guided other suicide bombers in Tulkarm. He was eliminated by the Israeli security forces that year using an explosive device planted in his car.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9989665591672134, "event_breakdown": "- Salma Badran is reported to have been arrested by IDF forces after emerging from under the ruins of a house in Deir al-Ghusun.\n- Salma Badran is identified as an operative of the military wing of Hamas and the brother of two Hamas \"martyrs\" - Fawaz and Seif Allah Badran.\n- Salma Badran's apartment, where Hamas terrorists hid the previous night, was destroyed by the IDF.\n- Fawaz Badran, a senior bomb engineer of the Izz ad-Din al-Qassam Brigades in the West Bank, assembled the explosive device that caused the first suicide attack of the second intifada in Netanya in March 2001, resulting in the deaths of 3 Israeli citizens.\n- Fawaz Badran was responsible for recruiting the suicide bomber for the attack and guiding other suicide bombers in Tulkarm. He was killed by Israeli security forces in the same year using an explosive device planted in his car."}, {"id": "83cb6ee3-dc62-41ea-be98-52bb7fdb364d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26671/", "date": "2024-05-04 14:00", "message": "The official Palestinian news agency Wafa: 6 Palestinians were killed in the IDF operation in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9664112263099419, "event_breakdown": "- IDF operation in the village of Deir al-Ghusun, resulting in the death of 6 Palestinians"}, {"id": "852c3b3e-2199-4edc-a1ad-3e4179367361", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26668/", "date": "2024-05-04 13:56", "message": "More footage from Deir al-Ghusun north of Tulkarm from the IDF operation today.", "location": "Tulkarm", "classification": "security", "score": 0.5645468611123309, "event_breakdown": "- IDF operation in Deir al-Ghusun north of Tulkarm"}, {"id": "243baf78-488d-4526-81db-1012a0150189", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Palestinian sources in Tulkarm claim that Tamer Fuqaha, an operative of the military wing of Hamas, (and the terrorist who carried out the attack in which Elhanan Klein fell on November 2, 2023), was killed in an IDF operation tonight in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9920826670749956, "event_breakdown": "- IDF operation in the village of Deir al-Ghusun in the north of Tulkarm\n- Killing of Tamer Fuqaha, an operative of the military wing of Hamas"}, {"id": "07a7c5a0-7947-4af6-90a2-cac445cc0e9b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Deir al-Ghusun north of Tulkarm:\nThe IDF forces packed the body of the Palestinian who was killed in the area of ​​the building.\n\nPalestinian sources claim the IDF forces took 3 bodies.\n\nIDF forces then arrested a Palestinian who emerged from under the ruins of the house that the forces had besieged for many hours.", "location": "Tulkarm", "classification": "security", "score": 0.9879003899097348, "event_breakdown": "- IDF forces packed the body of a Palestinian killed in the area of Deir al-Ghusun north of Tulkarm\n- Palestinian sources claim IDF forces took 3 bodies\n- IDF forces arrested a Palestinian who emerged from under the ruins of the besieged house in Deir al-Ghusun"}, {"id": "57eab42e-1994-489c-a126-c6dc9d36254c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26661/", "date": "2024-05-04 13:10", "message": "The \"Holy Fire\" ceremony held today in the Church of the Holy Sepulcher in East Jerusalem as part of the \"Sabbath of Light\" that Christians celebrate today.", "location": "East Jerusalem", "classification": "security", "score": 0.7164941467590658, "event_breakdown": "- Holy Fire ceremony held at the Church of the Holy Sepulcher in East Jerusalem"}, {"id": "243e43a5-f6a6-4454-9dd8-d762cb83480c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26658/", "date": "2024-05-04 13:07", "message": "For nearly ten hours starting last night, IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm.\nAccording to the estimates, the terrorists Tamer Fakha and Alaa Sharitah, the operatives of the military wing of Hamas involved in the shooting attack in which Major General Elhanan Klein was killed near Beit Lid on November 2, 2023, were hiding in the house.\nSources associated with Hamas and Islamic Jihad operatives claim that the two managed to escape from the house which was surrounded by the IDF for many hours and fired upon by a large number of missles (and finally destroyed with a bulldozer - in the attached videos you can see the shooting and the demolition the house).", "location": "Deir al-Ghusun village", "classification": "security", "score": 0.9796365504234397, "event_breakdown": "- IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm.\n- The house was surrounded by IDF for many hours and fired upon by a large number of missiles.\n- The house was finally destroyed with a bulldozer."}, {"id": "f4c52c70-29cf-4882-b550-84767aac9b8e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26657/", "date": "2024-05-04 13:02", "message": "The Al Jazeera network claims: an Israeli drone launched a missile a few hours ago at a vehicle in Bint Jabil in southern Lebanon.\n\nUnofficial Lebanese sources: No casualties.", "location": "Bint Jbeil", "classification": "security", "score": 0.9652451684275815, "event_breakdown": "- An Israeli drone launches a missile at a vehicle in Bint Jabil, southern Lebanon.\n- Unofficial Lebanese sources report no casualties."}, {"id": "93a42a3f-7861-4165-a495-9a1206b46200", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26656/", "date": "2024-05-04 12:30", "message": "The Qatari Al Jazeera cites a report by Reuters according to which Qatar is considering closing the offices of the political office of Hamas in its territory as part of an overall plan to continue its function as a mediator in the conflict between Hamas and Israel.", "location": "Qatar", "classification": "security", "score": 0.9065846889429762, "event_breakdown": "- Qatar considering closing Hamas political office\n- Part of plan to mediate conflict between Hamas and Israel"}, {"id": "c873f58c-8aab-43ff-a4b8-2e64cd65b5a8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26655/", "date": "2024-05-04 12:29", "message": "At least 3 different Israeli military reporters publish the exact same message:\n\nPolitical actor:\n\nContrary to the publications, Israel will under no circumstances agree to the end of the war as part of an agreement to release our abductees.\n\nAs the political echelon decided, the IDF will enter Rafah and destroy the remaining Hamas battalions there - whether or not there will be a temporary respite for the release of our hostages.", "location": "Rafah", "classification": "security", "score": 0.6696081489195264, "event_breakdown": "- Multiple Israeli military reporters publish the message that Israel will not agree to end the war in exchange for the release of abductees.\n- The IDF will enter Rafah to destroy remaining Hamas battalions, as decided by the political echelon, regardless of any temporary respite for releasing hostages."}, {"id": "b9e2c4a0-3210-4940-b295-45ba60019498", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26652/", "date": "2024-05-04 12:26", "message": "Yesterday, Lebanese Al-Akhbar newspaper publishes the French proposal for a ceasefire between Israel and Hezbollah\n\nThe Lebanese Al-Akhbar newspaper, which is affiliated with Hezbollah, once again manages the agenda regarding the ceasefire agreements with Israel and reveals the details of the French proposal to end the war between Israel and Hezbollah in southern Lebanon.\n\nThe proposal includes three stages:\n\nFirst step (according to areas of responsibility)\n\nHezbollah the militias in South Lebanon stop the fire and allow UNIFIL to move freely in South Lebanon without restriction.\n\nIsrael will stop its attacks on Lebanese territory and stop jamming the radar in Lebanon.\n\nUNIFIL will increase patrols in southern Lebanon.\n\nSecond stage (within 3 days from the start of the first stage)\n\nHezbollah militias will dismantle all their facilities near the blue line, including observation towers and tents.\nAll military operatives, including the Radwan force, as well as equipment that enables the remote launch of anti-tank missiles, will be moved north beyond the ten-kilometer line from the border with Israel.\n\nIsrael will stop air flights over Lebanon.\n\nLebanon will begin deploying 15,000 soldiers on its behalf in southern Lebanon, south of the Litani River with the support of UNIFIL and international agencies.\n\nUNIFIL will resume its participation in the meetings of the tripartite mechanism (with Israel and Lebanon) and logistically assist the deployment of the Lebanese army south of Litani.\n\nThird stage (within ten days)\n\nThe renewal of the negotiations between Israel and Lebanon for the registration of the land border based on the negotiations that took place in 2017.\nBeginning of negotiations on the establishment of a zone free of armed military militias south of Litani (with the exception of the Lebanese army and UNIFIL forces).\n\nSupport for social and economic development in southern Lebanon.", "location": "southern Lebanon", "classification": "security", "score": 0.9627738124436742, "event_breakdown": "- Lebanese Al-Akhbar newspaper publishes French proposal for ceasefire between Israel and Hezbollah in southern Lebanon\n- Three-stage proposal includes measures for Hezbollah, Israel, UNIFIL, and Lebanon\n- First stage includes stopping of fire by Hezbollah and Israel, and increased patrols by UNIFIL\n- Second stage includes dismantling of Hezbollah facilities near blue line, moving military operatives north, stopping air flights over Lebanon, and deployment of Lebanese soldiers with UNIFIL support\n- Third stage includes renewal of border negotiations, establishment of zone free of armed military militias, and support for social and economic development in southern Lebanon"}, {"id": "1bb11c1f-5253-4c2b-8061-c9d4731f8233", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26651/", "date": "2024-05-04 12:20", "message": "The Saudi Asharq channel:\n\nHamas will announce within hours that it accepts this deal after receiving American guarantees for the end of the fighting and the complete withdrawal of IDF forces from all parts of the Strip at the end of the third and final phase of the deal, without the return of Israeli forces to the territory of the Strip.\n\nIt was also reported that Israel removed its objection to some of the names of the prisoners that Hamas demanded to be released in the deal - something that made progress possible.", "location": "Gaza Strip", "classification": "security", "score": 0.5337781470853348, "event_breakdown": "- Hamas to announce acceptance of the deal with American guarantees\n- Complete withdrawal of IDF forces from all parts of the Strip\n- Israel removes objection to some names of prisoners for release deal"}, {"id": "95949492-748f-4034-a3b4-37c10230d779", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26649/", "date": "2024-05-03 20:30", "message": "Documentation of one of today's attacks in the area of ​​the displaced persons' tents in Rafah in the south of the Gaza Strip - note the rocket rising into the sky. This indicates a precise hit by the aircraft on the target.", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.9952821119807056, "event_breakdown": "1. Documentation of an attack near the displaced persons' tents in Rafah, Gaza Strip\n2. Rocket rising into the sky indicating a precise hit by aircraft on target"}, {"id": "ed88c1da-00e1-4e50-866d-67ffba91657b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26648/", "date": "2024-05-03 20:27", "message": "Hamas in an official announcement:\n\nIn light of the recent contacts with the mediators, tomorrow a delegation of the movement will arrive in Cairo to complete the talks.\n\nWe emphasize that the leadership of the movement reacted in a positive spirit to the proposal it received while discussing it. We are going to Cairo in the same positive atmosphere to reach an agreement.\n\nWe are determined to reach an agreement that will realize the demands of our people for a total cessation of aggression, the withdrawal of forces, the return of the displaced, aid to our people, the beginning of the reconstruction of the Gaza Strip and a serious exchange deal.", "location": "Cairo", "classification": "security", "score": 0.3907896760166591, "event_breakdown": "- Hamas delegation to arrive in Cairo for talks\n- Hamas leadership reacted positively to the proposal received\n- Determination to reach an agreement for cessation of aggression, withdrawal of forces, return of displaced, aid to people, reconstruction of Gaza Strip, and exchange deal"}, {"id": "2afd07f6-fc47-4fb0-aafc-01e54e059413", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26644/", "date": "2024-05-03 17:44", "message": "Reuters from a senior Hamas official: a Hamas delegation will arrive in Cairo tomorrow.", "location": "Cairo", "classification": "security", "score": 0.9023652992005777, "event_breakdown": "- Hamas delegation to arrive in Cairo."}, {"id": "d161792a-7723-4ae6-931c-92fb407946bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26642/", "date": "2024-05-03 16:36", "message": "One of the signs of abundance in the northern Gaza Strip: Gazan donkeys receive fresh pita bread\n\nA Gazan from the north of the Gaza Strip to the donkey: once (when there was a shortage of bread) we ate from your food, now take and eat bread from today. You are better than many people...", "location": "Northern Gaza Strip", "classification": "security", "score": 0.8432632263954416, "event_breakdown": "1. Gazan donkeys in the northern Gaza Strip receive fresh pita bread\n2. A Gazan from the north of the Gaza Strip feeds bread to the donkeys, expressing gratitude for their past help"}, {"id": "4fe131c2-4e62-451c-bdc4-b9ae230984fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26641/", "date": "2024-05-03 16:28", "message": "American Central Command:\n\nDue to weather conditions, construction work on the floating pier off the coast of Gaza was stopped and it was moved to Ashdod port, where its construction will be completed.\n\nAfter the completion of its construction, it will be floated along the shores of Gaza to the place where it was planned to be placed.", "location": "Ashdod port", "classification": "security", "score": 0.8222928362890448, "event_breakdown": "1. Construction work on the floating pier off the coast of Gaza is halted due to weather conditions.\n2. The floating pier is moved to Ashdod port for completion of construction.\n3. After completion, the floating pier will be floated along the shores of Gaza to its intended location."}, {"id": "43b07556-017f-4784-93e1-d45b3307eefa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26640/", "date": "2024-05-03 15:56", "message": "Reuters from an Egyptian source:\n\nThe head of the CIA, William Burns, arrived in Cairo to promote the ceasefire in Gaza.\n\n##\nThe Americans are using all their weight and are firing their heaviest guns to reach a ceasefire.", "location": "Cairo", "classification": "security", "score": 0.8731912994868349, "event_breakdown": "- William Burns arrives in Cairo to promote ceasefire in Gaza"}, {"id": "6c64eaa0-ac2d-42be-a0a6-330d9b05455c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26639/", "date": "2024-05-03 15:55", "message": "The Palestinian Ministry of Health in Gaza:\n26 dead in the Strip in the last day.\n\nThe number of deaths in the last few days:\n28\n33\n47\n34\n\nTotal dead in the Gaza Strip since the beginning of the war: 34,622. Total wounded: about 78 thousand.\n\n##\nIn the last day, the number of dead was the lowest in the Gaza Strip since the beginning of the war (with the exception of the hodna period in November 2023).", "location": "Gaza City", "classification": "security", "score": 0.8569080015487186, "event_breakdown": "- Location: Gaza Strip\n  - Report from the Palestinian Ministry of Health: 26 dead in the last day, bringing the total dead in the Gaza Strip since the beginning of the war to 34,622. Total wounded estimated at about 78 thousand.\n  - Previous days' death tolls: 28, 33, 47, 34.\n  - Note: The number of dead in the last day was the lowest in the Gaza Strip since the beginning of the war (excluding the hodna period in November 2023)."}, {"id": "2e3e411f-9481-4c7b-ad9c-a1438ff2963a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26633/", "date": "2024-05-03 13:36", "message": "Paris: French security forces break into Sciences Po the Institute of Political Science to break up an anti-Israel demonstration by the students there.", "location": "Paris", "classification": "security", "score": 0.9281242816179448, "event_breakdown": "- French security forces break into Sciences Po, the Institute of Political Science in Paris"}, {"id": "132d4c95-8edc-441b-8c12-4ca9d1d7152e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26631/", "date": "2024-05-03 13:27", "message": "A few points to note:\n\n1. Hezbollah said anyway that it will stop the fire as soon as there is a ceasefire in Gaza.\n\n2. The French proposal does not answer the question of implementation and enforcement. What do we do if Hezbollah does not vacate? What happens if in six months Hezbollah returns south of Litani River? After all, the non-enforcement of Resolution 1701 at the end of the Second Lebanon War is what brought us to the current situation.\nEnforcement is the heart of the matter in the Lebanese arena. What enforcement measures are there and what are the sanctions for violations by Hezbollah?\n\n3. Israel was flying in the skies of Lebanon before the war, now it will have to commit that it will stop...\n\nThe bottom line, the proposal creates a situation where Israel will be left with just a paper in hand, without any deterrence and with Hezbollah's military force threatening the residents of the north.\n\nFor the Americans and the French this is excellent. This is a disaster for Israel.", "location": "Lebanon", "classification": "security", "score": 0.8178512051645865, "event_breakdown": "1. Hezbollah states it will cease fire once a ceasefire is implemented in Gaza.\n2. Concerns raised over the French proposal's lack of clarity on implementation and enforcement, particularly regarding Hezbollah's compliance with Resolution 1701.\n3. Israel faces potential restrictions on its military presence in Lebanese airspace, raising concerns about deterrence and security in northern Israel."}, {"id": "6e12b105-3da9-484a-a5d5-0776c1a068c6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26630/", "date": "2024-05-03 13:15", "message": "About 100,000 Palestinians have left the Gaza Strip since the beginning of the war\n\nThe Palestinian ambassador in Egypt: since the beginning of the war and until April, 85 thousand Palestinians left the Gaza Strip for Egypt through the Rafah crossing.\n\nTaking the month of April into account, it can be estimated that about one hundred thousand Palestinians left the Strip since the beginning of the war.", "location": "Rafah Crossing", "classification": "security", "score": 0.8683848530412968, "event_breakdown": "- About 100,000 Palestinians have left the Gaza Strip since the beginning of the war\n- 85 thousand Palestinians left the Gaza Strip for Egypt through the Rafah crossing from the beginning of the war until April"}, {"id": "3cfa582c-c5c7-4504-9be4-9139260cf022", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65962/", "date": "2024-05-03 13:11", "message": "A must watch:\n\nStudents from the \"Free Palestine Army\" charge Portland police officer with shields made from trash cans.\n\n##\nNot the sharpest tools in the shed...", "location": "Portland", "classification": "security", "score": 0.7716378859605466, "event_breakdown": "- Students from the \"Free Palestine Army\" charge a Portland police officer with shields made from trash cans."}, {"id": "6a79dc1f-f3d9-4bc8-95fa-99aeac9185a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26628/", "date": "2024-05-03 13:11", "message": "Fox News: The Iranian flag was raised by the students at the University of Irvine in California.\n\nIran is offering scholarships to students who will be expelled from US universities following the protests.", "location": "University of Irvine in California", "classification": "security", "score": 0.38395330639266484, "event_breakdown": "- Iranian flag raised by students at University of Irvine in California\n- Iran offering scholarships to students facing expulsion from US universities due to protests"}, {"id": "b89055d1-6ce5-4428-b6c3-922b2459ca34", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26623/", "date": "2024-05-03 10:23", "message": "The coup in Niger: Russian soldiers reportedly enter a military base where the American troops are stationed\n\nAccording to Reuters, Russian soldiers have entered a military air base housing American forces in the capital of Niger.\n\nAs you might remember, last year there was a coup in Niger and the military junta that seized power demanded that the US terminate the agreement with it and... remove all American forces from Niger.\n\nThe American forces have not yet evacuated and now they have new \"guests\" at their base.\n\nAmerican officials state that the Russian and American soldiers remain in separate areas at the base. The American Secretary of Defense spoke out on the matter and said that there is no fear that the Russians will get their hands on American equipment.\n\n##\nThe Taliban send their regards..", "location": "Niamey, Niger", "classification": "security", "score": 0.7709916187413431, "event_breakdown": "Taliban captures Bagram Air Base in Afghanistan, seizing control of military equipment and releasing prisoners."}, {"id": "f1b56b9f-71d9-432d-bae0-27cced492dda", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26620/", "date": "2024-05-03 06:44", "message": "Last night's attack in Damascus, attributed to Israel\n\nSyrian sources identified with the Shiite axis report that the target of the Israeli attack in Damascus was the \"State Security School\" (of the Syrian Army - AA), near the village of Najaha, and as a result, a three-story building was severely damaged there.\nAccording to these sources, the target of the attack belonged to the Syrian army and not to Iranian elements in Syria.\n\nThe Syrian Ministry of Defense officially announced that Israel carried out an airstrike last night at 10:05 PM which resulted in the injury of 8 Syrian soldiers and damage to property.", "location": "Damascus", "classification": "security", "score": 0.9816944407775801, "event_breakdown": "- Last night\\'s attack in Damascus, attributed to Israel\n- Target of the attack was the \"State Security School\" near the village of Najaha\n- Three-story building severely damaged\n- Target belonged to the Syrian army, not Iranian elements\n- Syrian Ministry of Defense confirmed the airstrike at 10:05 PM\n- 8 Syrian soldiers injured, property damaged"}, {"id": "5d6c3a30-0e9d-476a-8ff4-f626da6801f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26618/", "date": "2024-05-02 20:19", "message": "Palestinian sources report the death of officer Muhammad Adas, one of the companions of Palestinian Authority Chairman Abu Mazen from the Presidential Guard, as a result of an IDF shot that hit him in the head during the entry of IDF forces into the village of Anbata in the Tulkarm district in the last hour.", "location": "Anbata village in the Tulkarm district", "classification": "security", "score": 0.9884898904177141, "event_breakdown": "- Death of officer Muhammad Adas in the village of Anbata, Tulkarm district as a result of an IDF shot"}, {"id": "f6b42dcf-9c8a-40db-91dc-9ec464c097d1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26617/", "date": "2024-05-02 20:17", "message": "Sources associated with the Syrian opposition report on limited explosions heard in the last half hour in Damascus, the capital of Syria.\n\nAccording to these sources, the Syrian air defense systems were not activated.\n\nThe sources add that an Israeli airstrike was carried out against a military post near the fifth bridge on the road leading to the Damascus border.", "location": "Damascus, Syria.", "classification": "security", "score": 0.9015089065332462, "event_breakdown": "- Limited explosions heard in Damascus, the capital of Syria\n- Syrian air defense systems were not activated\n- Israeli airstrike carried out against a military post near the fifth bridge on the road leading to the Damascus border"}, {"id": "3b6dc9f7-7da2-4ded-8a70-af0e435fca4e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26616/", "date": "2024-05-02 19:25", "message": "Following today's report on the death of Dr. Adnan Albarsh 👆 and another Gazan, in prison in Israel, Hamas, in an official announcement on its behalf, is trying to create symmetry with the Israeli abductees in Gaza and states that \"the death of two of our people abducted in the prison of the fascist occupation, under barbaric torture is proof of the heinous war crimes committed by the occupation.. \"\nHamas calls on the international community to act immediately and condemn \"this Nazi behavior and force Israel to reveal what happened to the thousands of Palestinians kidnapped by Israel and to return them to their families...\"", "location": "Israel", "classification": "security", "score": 0.8612271269653651, "event_breakdown": "1. Dr. Adnan Albarsh and another Gazan die in an Israeli prison.\n2. Hamas accuses Israel of committing war crimes against the abducted Palestinians.\n3. Hamas calls for international condemnation of Israel's actions and demands the return of Palestinian prisoners to their families."}, {"id": "33597986-2620-4b1d-973f-7842c8957eab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26614/", "date": "2024-05-02 17:59", "message": "Palestinian channels: Settlers threw stones at Palestinian vehicles on Route 60", "location": "Route 60", "classification": "security", "score": 0.972113358305666, "event_breakdown": "- Settlers threw stones at Palestinian vehicles on Route 60"}, {"id": "d5c25dca-dfbc-4715-8172-10221cfe697d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26612/", "date": "2024-05-02 17:48", "message": "A new organization calling itself the \"Ashtar Brigades\" - the Islamic resistance in Bahrain, claims to have launched a drone at the \"Traknet\" company, which deals with vessel traffic, in Eilat.\n\nThis is the first time that an organization related to the axis of resistance located in Bahrain accepts responsibility for military action against Israel.\n\n##\nBahrain is signed on the Abraham Accords security agreement with Israel.", "location": "Eilat", "classification": "security", "score": 0.9260489183235847, "event_breakdown": "null"}]