[{"id": "785280af-164c-4548-8b40-0dcc669bdc75", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26552/", "date": "2024-05-01 06:52", "message": "University of Washington: Olivia Feldman, a Jewish student, says that she does not feel safe on her university's campus and notes that she was shouted at to \"go back to the gas chambers.\"\n\nOlivia is the great-granddaughter of a Holocaust survivor.\n\n#Antisemitism_on_campuses", "location": "University of Washington", "classification": "antisemitism", "score": 0.9258163430419338, "event_breakdown": "- University of Washington: Jewish student Olivia Feldman expresses feeling unsafe on campus after being shouted at to \"go back to the gas chambers.\"\n- Location: University of Washington campus, Seattle, Washington, USA"}, {"id": "71f6de56-c538-4e0a-bc55-094e5f39b353", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65853/", "date": "2024-05-01 06:46", "message": "US media channels reports that the NYPD arrested about a hundred people on Columbia University's campus.\n\nIn a statement, Columbia University claimed that the leaders of the protest on campus are not even students of the university, but rather external parties.\n\nThe president of the university asked the police forces to remain on the university campus until May 17th to maintain order and make sure that no tent camps are set up on campus.", "location": "Columbia University", "classification": "antisemitism", "score": 0.5850521548096034, "event_breakdown": "- NYPD arrests about a hundred people on Columbia University's campus\n- Columbia University claims protest leaders are not students\n- President of the university asks police to remain on campus until May 17th"}, {"id": "a0322710-8aca-4735-9d47-69f5071e5c98", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26537/", "date": "2024-05-01 06:40", "message": "New York: In the last few hours, the signal was finally given and the New York police entered Columbia University in large forces to disperse the hate demonstration against Israel.", "location": "Columbia University, New York", "classification": "antisemitism", "score": 0.3014433288682847, "event_breakdown": "- New York: Police entered Columbia University to disperse hate demonstration against Israel"}]