[{"id": "26be6385-646f-4234-84b8-de9ddbbcbf00", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26678/", "date": "2024-05-04 17:47", "message": "Palestinian channels report: The IDF attacked the home of the prominent journalist in the Gaza Strip, Hassan Aslih (Hamas-affiliated) in the Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip.\nThere were no casualties in the attack.", "location": "Khan Yunis, Gaza Strip", "classification": "security", "score": 0.9953827602700771, "event_breakdown": "- IDF attack on the home of journalist Hassan Aslih in Manara neighborhood, eastern Khan Yunis, southern Gaza Strip"}, {"id": "d13b01c8-586f-45b7-8e48-958946ee86c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26677/", "date": "2024-05-04 17:31", "message": "Palestinian channels: The Palestinian Authority's security mechanisms detonated, in a controlled manner, explosive devices they located in Tubas (Northeastern Samaria).", "location": "Tubas", "classification": "security", "score": 0.9948419961865298, "event_breakdown": "- The Palestinian Authority's security mechanisms detonated explosive devices in Tubas, Northeastern Samaria."}, {"id": "ef18c8a2-1386-455f-bcf1-da95feb7bbfd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26676/", "date": "2024-05-04 17:20", "message": "Hamas-identified channels: All four killed (whose names have been published) 👆 in the IDF's activity in the village of Deir al-Ghusun in the north of Tulkarm, were operatives of the military wing of Hamas.\nAlaa Sharitah was the commander of the military wing of Hamas in Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9934812200416727, "event_breakdown": "- Four operatives of the military wing of Hamas were killed in IDF activity in the village of Deir al-Ghusun in the north of Tulkarm\n- Alaa Sharitah was the commander of the military wing of Hamas in Tulkarm"}, {"id": "02dadee0-d00a-4996-9c4b-e2b8b45aed75", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26675/", "date": "2024-05-04 17:19", "message": "Further to this👆\nA joint statement to the IDF spokesperson, the police spokesperson and the Shin Bet spokesperson:\n\nThe soldiers of Yamam, the IDF and the Shin Bet eliminated five terrorists who had barricaded themselves in a building in Tulkarm in a 12-hour battle\n\nThe soldiers of the Yamam, IDF and Shin Bet, under the precise intelligence guidance of the Shin Bet and IDF Intelligence, operated for over 12 hours in Tulkarm in a targeted activity to defeat a terrorist cell.\n\nThe soldiers closed in on a building where the terrorist squad was entrenched, which opened fire on them. The fighters responded by shooting with shoulder-fired missiles and other means from the building, and at the end of the exchange of fire, the five terrorists were eliminated.\nMilitary equipment and weapon parts were confiscated.\n\nDuring the activity, an IDF fighter was injured and brought to continue receiving medical treatment in a hospital; his family was informed.", "location": "Tulkarm", "classification": "security", "score": 0.9849329956770798, "event_breakdown": "- Soldiers of Yamam, the IDF and the Shin Bet eliminated five terrorists in a 12-hour battle in Tulkarm.\n- The soldiers closed in on a building where the terrorist squad was entrenched, which opened fire on them.\n- The fighters responded by shooting with shoulder-fired missiles and other means from the building.\n- At the end of the exchange of fire, the five terrorists were eliminated.\n- Military equipment and weapon parts were confiscated.\n- An IDF fighter was injured and brought to continue receiving medical treatment in a hospital."}, {"id": "256ec3d6-e845-4fac-a534-ed4e0032d91e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26674/", "date": "2024-05-04 16:10", "message": "The Palestinians publish the names of four of the \"martyrs\" who were killed in the IDF operation tonight in the village of Deir el Ghusun in the north of Tulkarm:\n\n1. Alaa Sharith (the leftmost one).\n2. Tamer Fuqaha (next to Alaa' - both are behind the attack in which Elhanan Klein fell in November 2023. Tamer is also an operative of Erin al Aswad).\n3. Adnan Samara\n4. Asal Badran\n\nIn addition, there is the \"headless martyr\" who has not yet been identified - DNA tests will be conducted on him to confirm his identity.", "location": "Deir el Ghusun", "classification": "security", "score": 0.9791185685870558, "event_breakdown": "- Four Palestinian \"martyrs\" were killed in an IDF operation in the village of Deir el Ghusun\n- Alaa Sharith, Tamer Fuqaha, Adnan Samara, and Asal Badran were identified as the four individuals killed\n- DNA testing will be conducted to confirm the identity of the \"headless martyr\""}, {"id": "263b3d09-9007-4732-94d8-3f68843350b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26673/", "date": "2024-05-04 15:36", "message": "The Palestinians report that the IDF forces have finished their activities in Deir al-Ghusun in the north of Tulkarm and have left.\nSources in Tulkarm say that the Palestinian rescue forces located another Palestinian \"martyr\" among the ruins, apparently headless.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9671169206516085, "event_breakdown": "1. IDF forces finish activities in Deir al-Ghusun in the north of Tulkarm and leave.\n2. Palestinian rescue forces find a headless Palestinian \"martyr\" among the ruins in Tulkarm."}, {"id": "a96ce974-a41a-45c3-a0d3-56e934aa0681", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26672/", "date": "2024-05-04 14:06", "message": "The Palestinians report that the person who came out from under the ruins of the house in Deir al-Ghusun and was arrested by IDF forces is the released prisoner Salma Badran, an operative of the military wing of Hamas with a \"heavy\" family lineage: he is the brother of the two \"martyrs\" of the wing - Fawaz and Seif Allah Badran. Salma is the owner of the apartment where the Hamas terrorists hid last night and which the IDF destroyed.\n\nFawaz (Salma's brother) was one of the senior bomb engineers of the Izz ad-Din al-Qassam Brigades in the West Bank and was the one who assembled the explosive device that exploded in the first suicide attack of the second intifada (March 2001), in which 3 Israeli citizens were killed in Netanya. Fawaz was also the one who recruited the suicide bomber for the attack and also guided other suicide bombers in Tulkarm. He was eliminated by the Israeli security forces that year using an explosive device planted in his car.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9989665591672134, "event_breakdown": "- Salma Badran, an operative of the military wing of Hamas, was arrested by IDF forces after coming out from under the ruins of a house in Deir al-Ghusun.\n- Salma Badran is the brother of two Hamas \"martyrs\" - Fawaz and Seif Allah Badran.\n- Fawaz Badran, a senior bomb engineer for the Izz ad-Din al-Qassam Brigades, assembled an explosive device for the first suicide attack of the second intifada in Netanya in March 2001, resulting in the deaths of 3 Israeli citizens. Fawaz was later eliminated by Israeli security forces in the same year using an explosive device planted in his car."}, {"id": "3a96ca92-5af3-4d37-863c-a5011ed56c93", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26671/", "date": "2024-05-04 14:00", "message": "The official Palestinian news agency Wafa: 6 Palestinians were killed in the IDF operation in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9664112263099419, "event_breakdown": "- 6 Palestinians killed in IDF operation in Deir al-Ghusun village, north of Tulkarm, Palestine."}, {"id": "34d75560-ee43-4ce1-b91d-9f3cf1e2cf3d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26668/", "date": "2024-05-04 13:56", "message": "More footage from Deir al-Ghusun north of Tulkarm from the IDF operation today.", "location": "Tulkarm", "classification": "security", "score": 0.5645468611123309, "event_breakdown": "- More footage released from Deir al-Ghusun, north of Tulkarm\n- IDF operation conducted in the area"}, {"id": "23f4e89e-ac98-4028-8bc5-d23071911b0e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Palestinian sources in Tulkarm claim that Tamer Fuqaha, an operative of the military wing of Hamas, (and the terrorist who carried out the attack in which Elhanan Klein fell on November 2, 2023), was killed in an IDF operation tonight in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9920826670749956, "event_breakdown": "- Tamer Fuqaha, an operative of the military wing of Hamas, was killed in an IDF operation in the village of Deir al-Ghusun in the north of Tulkarm."}, {"id": "9549aab9-738d-41a9-9448-89b565c96170", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Deir al-Ghusun north of Tulkarm:\nThe IDF forces packed the body of the Palestinian who was killed in the area of ​​the building.\n\nPalestinian sources claim the IDF forces took 3 bodies.\n\nIDF forces then arrested a Palestinian who emerged from under the ruins of the house that the forces had besieged for many hours.", "location": "Tulkarm", "classification": "security", "score": 0.9879003899097348, "event_breakdown": "- IDF forces packed the body of a Palestinian killed in Deir al-Ghusun, north of Tulkarm.\n- Palestinian sources claim IDF forces took three bodies in the area.\n- IDF forces arrested a Palestinian who emerged from under the ruins of a besieged house in Deir al-Ghusun."}, {"id": "34ce91b5-2bb2-4faf-948c-3fcb8878b9ac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26661/", "date": "2024-05-04 13:10", "message": "The \"Holy Fire\" ceremony held today in the Church of the Holy Sepulcher in East Jerusalem as part of the \"Sabbath of Light\" that Christians celebrate today.", "location": "Church of the Holy Sepulcher in East Jerusalem", "classification": "security", "score": 0.7164941467590658, "event_breakdown": "- \"Holy Fire\" ceremony held in the Church of the Holy Sepulcher in East Jerusalem"}, {"id": "5681466a-8e2d-4a6d-a2cf-5a3f147ea4bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26658/", "date": "2024-05-04 13:07", "message": "For nearly ten hours starting last night, IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm.\nAccording to the estimates, the terrorists Tamer Fakha and Alaa Sharitah, the operatives of the military wing of Hamas involved in the shooting attack in which Major General Elhanan Klein was killed near Beit Lid on November 2, 2023, were hiding in the house.\nSources associated with Hamas and Islamic Jihad operatives claim that the two managed to escape from the house which was surrounded by the IDF for many hours and fired upon by a large number of missles (and finally destroyed with a bulldozer - in the attached videos you can see the shooting and the demolition the house).", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9796365504234397, "event_breakdown": "- IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm for nearly ten hours\n- Terrorists Tamer Fakha and Alaa Sharitah, associated with Hamas, were believed to be hiding in the house\n- The two terrorists managed to escape from the surrounded house\n- The house was fired upon by a large number of missiles and eventually destroyed with a bulldozer"}, {"id": "0545d676-b78e-4ce2-85a7-ea6597f76b6b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26657/", "date": "2024-05-04 13:02", "message": "The Al Jazeera network claims: an Israeli drone launched a missile a few hours ago at a vehicle in Bint Jabil in southern Lebanon.\n\nUnofficial Lebanese sources: No casualties.", "location": "Bint Jbeil, Southern Lebanon.", "classification": "security", "score": 0.9652451684275815, "event_breakdown": "null"}, {"id": "100c8bfd-66a5-493c-89ec-58449000478a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26656/", "date": "2024-05-04 12:30", "message": "The Qatari Al Jazeera cites a report by Reuters according to which Qatar is considering closing the offices of the political office of Hamas in its territory as part of an overall plan to continue its function as a mediator in the conflict between Hamas and Israel.", "location": "Qatar", "classification": "security", "score": 0.9065846889429762, "event_breakdown": "- Qatar considering closing Hamas political office in its territory\n- Reuters report cited by Al Jazeera\n- Part of plan to continue mediating conflict between Hamas and Israel"}, {"id": "029edffa-ea1b-4632-a560-77c9f9c9de59", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26655/", "date": "2024-05-04 12:29", "message": "At least 3 different Israeli military reporters publish the exact same message:\n\nPolitical actor:\n\nContrary to the publications, Israel will under no circumstances agree to the end of the war as part of an agreement to release our abductees.\n\nAs the political echelon decided, the IDF will enter Rafah and destroy the remaining Hamas battalions there - whether or not there will be a temporary respite for the release of our hostages.", "location": "Rafah", "classification": "security", "score": 0.6696081489195264, "event_breakdown": "- Three Israeli military reporters publish the same message\n- Israel will not agree to end the war as part of an agreement to release abductees\n- IDF will enter Rafah and destroy remaining Hamas battalions"}, {"id": "9cd48de8-775e-4080-b458-7001a33f2775", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26654/", "date": "2024-05-04 12:28", "message": "Heavy political pressure on Israel from all directions to silence all sectors, (mainly) at the expense of the Israeli interest. It will only get worse.", "location": "Israel", "classification": "security", "score": 0.7257546953647328, "event_breakdown": "null"}, {"id": "4518f4b3-cd1e-4ed9-99c0-628a3ab5365f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26652/", "date": "2024-05-04 12:26", "message": "Yesterday, Lebanese Al-Akhbar newspaper publishes the French proposal for a ceasefire between Israel and Hezbollah\n\nThe Lebanese Al-Akhbar newspaper, which is affiliated with Hezbollah, once again manages the agenda regarding the ceasefire agreements with Israel and reveals the details of the French proposal to end the war between Israel and Hezbollah in southern Lebanon.\n\nThe proposal includes three stages:\n\nFirst step (according to areas of responsibility)\n\nHezbollah the militias in South Lebanon stop the fire and allow UNIFIL to move freely in South Lebanon without restriction.\n\nIsrael will stop its attacks on Lebanese territory and stop jamming the radar in Lebanon.\n\nUNIFIL will increase patrols in southern Lebanon.\n\nSecond stage (within 3 days from the start of the first stage)\n\nHezbollah militias will dismantle all their facilities near the blue line, including observation towers and tents.\nAll military operatives, including the Radwan force, as well as equipment that enables the remote launch of anti-tank missiles, will be moved north beyond the ten-kilometer line from the border with Israel.\n\nIsrael will stop air flights over Lebanon.\n\nLebanon will begin deploying 15,000 soldiers on its behalf in southern Lebanon, south of the Litani River with the support of UNIFIL and international agencies.\n\nUNIFIL will resume its participation in the meetings of the tripartite mechanism (with Israel and Lebanon) and logistically assist the deployment of the Lebanese army south of Litani.\n\nThird stage (within ten days)\n\nThe renewal of the negotiations between Israel and Lebanon for the registration of the land border based on the negotiations that took place in 2017.\nBeginning of negotiations on the establishment of a zone free of armed military militias south of Litani (with the exception of the Lebanese army and UNIFIL forces).\n\nSupport for social and economic development in southern Lebanon.", "location": "South Lebanon", "classification": "security", "score": 0.9627738124436742, "event_breakdown": "- Al-Akhbar newspaper publishes French proposal for ceasefire between Israel and Hezbollah in southern Lebanon\n- Proposal includes three stages: \n  - First stage: Hezbollah to stop fire, Israel to stop attacks, UNIFIL to increase patrols in South Lebanon\n  - Second stage: Hezbollah to dismantle facilities near blue line, Israel to stop air flights over Lebanon, Lebanon to deploy soldiers in southern Lebanon with UNIFIL support\n  - Third stage: Renewal of negotiations between Israel and Lebanon on land border, negotiations on establishing zone free of armed militias south of Litani, support for social and economic development in southern Lebanon"}, {"id": "4e21ad75-d035-4d3f-b800-e6eddb942cf2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26649/", "date": "2024-05-03 20:30", "message": "Documentation of one of today's attacks in the area of ​​the displaced persons' tents in Rafah in the south of the Gaza Strip - note the rocket rising into the sky. This indicates a precise hit by the aircraft on the target.", "location": "Rafah, Gaza Strip.", "classification": "security", "score": 0.9952821119807056, "event_breakdown": "- Documentation of an attack in the area of displaced persons' tents in Rafah, south of the Gaza Strip.\n- Rocket rising into the sky indicates a precise hit by aircraft on the target."}, {"id": "129cb0c9-ca30-4acd-9b77-f62f9a822b66", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26648/", "date": "2024-05-03 20:27", "message": "Hamas in an official announcement:\n\nIn light of the recent contacts with the mediators, tomorrow a delegation of the movement will arrive in Cairo to complete the talks.\n\nWe emphasize that the leadership of the movement reacted in a positive spirit to the proposal it received while discussing it. We are going to Cairo in the same positive atmosphere to reach an agreement.\n\nWe are determined to reach an agreement that will realize the demands of our people for a total cessation of aggression, the withdrawal of forces, the return of the displaced, aid to our people, the beginning of the reconstruction of the Gaza Strip and a serious exchange deal.", "location": "Cairo", "classification": "security", "score": 0.3907896760166591, "event_breakdown": "- Hamas delegation to arrive in Cairo for talks"}, {"id": "336a9517-1299-4122-9fc6-0f98963a3e4c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26644/", "date": "2024-05-03 17:44", "message": "Reuters from a senior Hamas official: a Hamas delegation will arrive in Cairo tomorrow.", "location": "Cairo", "classification": "security", "score": 0.9023652992005777, "event_breakdown": "- A Hamas delegation will arrive in Cairo tomorrow"}, {"id": "065e3fd0-f44f-4f27-a7eb-9bfca4afd972", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26643/", "date": "2024-05-03 16:51", "message": "The Houthis clarify the words of the Houthi military spokesman and point out that starting today every ship that docks in an Israeli port will be \"marked\" and as soon as it passes through an area within the reach of the Houthis it will be attacked even if it is not on its way to an Israeli port at the time.\n\nIf Israel enters Rafah, the next step for the Houthis will be to attack all ships belonging to companies that even one of their ships docks in Israeli ports.", "location": "Israeli Ports", "classification": "security", "score": 0.4099593512202328, "event_breakdown": "- The Houthis announce plans to attack any ship docking in Israeli ports and those passing through areas within their reach.\n- The Houthis threaten to attack ships of companies with vessels docking in Israeli ports if Israel enters Rafah."}, {"id": "429e5539-3965-4396-aaa6-692f9c4db0df", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26642/", "date": "2024-05-03 16:36", "message": "One of the signs of abundance in the northern Gaza Strip: Gazan donkeys receive fresh pita bread\n\nA Gazan from the north of the Gaza Strip to the donkey: once (when there was a shortage of bread) we ate from your food, now take and eat bread from today. You are better than many people...", "location": "Gaza Strip", "classification": "security", "score": 0.8432632263954416, "event_breakdown": "1. Event: Gazan donkeys in the northern Gaza Strip receive fresh pita bread as a sign of abundance.\n2. Event: A Gazan from the north of the Gaza Strip expresses gratitude to the donkeys for sharing their food during a bread shortage, now offering them fresh bread as a gesture of appreciation."}, {"id": "c58cb3f1-b6d5-4787-991d-6aff68bd4973", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26641/", "date": "2024-05-03 16:28", "message": "American Central Command:\n\nDue to weather conditions, construction work on the floating pier off the coast of Gaza was stopped and it was moved to Ashdod port, where its construction will be completed.\n\nAfter the completion of its construction, it will be floated along the shores of Gaza to the place where it was planned to be placed.", "location": "Ashdod", "classification": "security", "score": 0.8222928362890448, "event_breakdown": "- Construction work on the floating pier off the coast of Gaza was stopped due to weather conditions.\n- The construction work was moved to Ashdod port for completion.\n- After construction, the floating pier will be transported along the shores of Gaza to its intended location."}, {"id": "daed6ee6-41e7-4cc5-9d0e-31f13f33756c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26640/", "date": "2024-05-03 15:56", "message": "Reuters from an Egyptian source:\n\nThe head of the CIA, William Burns, arrived in Cairo to promote the ceasefire in Gaza.\n\n##\nThe Americans are using all their weight and are firing their heaviest guns to reach a ceasefire.", "location": "Cairo", "classification": "security", "score": 0.8731912994868349, "event_breakdown": "1. Head of the CIA, William Burns, arrives in Cairo to promote Gaza ceasefire.\n2. Americans exert strong diplomatic efforts for achieving a ceasefire in Gaza."}, {"id": "5cf9be94-3704-4342-b1cb-dca6b0d9fb1c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26639/", "date": "2024-05-03 15:55", "message": "The Palestinian Ministry of Health in Gaza:\n26 dead in the Strip in the last day.\n\nThe number of deaths in the last few days:\n28\n33\n47\n34\n\nTotal dead in the Gaza Strip since the beginning of the war: 34,622. Total wounded: about 78 thousand.\n\n##\nIn the last day, the number of dead was the lowest in the Gaza Strip since the beginning of the war (with the exception of the hodna period in November 2023).", "location": "Gaza Strip.", "classification": "security", "score": 0.8569080015487186, "event_breakdown": "- 26 dead in the Gaza Strip in the last day\n- Total dead in the Gaza Strip since the beginning of the war: 34,622\n- Total wounded: about 78 thousand"}, {"id": "861a1b09-6024-4373-9d56-09640748f3f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26638/", "date": "2024-05-03 15:14", "message": "The American Wall Street Journal:\n\nIsrael gave Hamas an extension of one week that will end this coming weekend to respond to the proposal it submitted.\n\nYahya Sinwar has not yet responded to the Israeli proposal.\n\nAccording to the newspaper, Hamas is asking for American guarantees for the non-renewal of fighting after the upcoming deal, since in its view the clause in the proposal surrounding the matter is \"too vague\" and allows Israel to return to fighting.", "location": "Israel", "classification": "security", "score": 0.5459997237435309, "event_breakdown": "- Israel gives Hamas one-week extension to respond to proposal\n- Yahya Sinwar has not yet responded to Israeli proposal\n- Hamas asks for American guarantees for non-renewal of fighting after upcoming deal"}, {"id": "4742091e-7085-42c3-9fc1-3379b275a6c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26633/", "date": "2024-05-03 13:36", "message": "Paris: French security forces break into Sciences Po the Institute of Political Science to break up an anti-Israel demonstration by the students there.", "location": "Sciences Po", "classification": "security", "score": 0.9281242816179448, "event_breakdown": "- French security forces break into Sciences Po, the Institute of Political Science in Paris.\n- The security forces intervene to break up an anti-Israel demonstration by students at Sciences Po."}, {"id": "37e9f7ac-8706-4022-8359-bff994448b77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26630/", "date": "2024-05-03 13:15", "message": "About 100,000 Palestinians have left the Gaza Strip since the beginning of the war\n\nThe Palestinian ambassador in Egypt: since the beginning of the war and until April, 85 thousand Palestinians left the Gaza Strip for Egypt through the Rafah crossing.\n\nTaking the month of April into account, it can be estimated that about one hundred thousand Palestinians left the Strip since the beginning of the war.", "location": "Gaza Strip.", "classification": "security", "score": 0.8683848530412968, "event_breakdown": "- About 100,000 Palestinians have left the Gaza Strip since the beginning of the war\n- 85 thousand Palestinians left the Gaza Strip for Egypt through the Rafah crossing"}, {"id": "c26720d9-3df4-45f9-838d-5125fad4261b", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65962/", "date": "2024-05-03 13:11", "message": "A must watch:\n\nStudents from the \"Free Palestine Army\" charge Portland police officer with shields made from trash cans.\n\n##\nNot the sharpest tools in the shed...", "location": "Portland, Oregon", "classification": "security", "score": 0.7716378859605466, "event_breakdown": "- Students from the \"Free Palestine Army\" charge at a Portland police officer\n- The students use shields made from trash cans"}, {"id": "5f20034a-f5d3-4987-a029-346c8e8e6d87", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26628/", "date": "2024-05-03 13:11", "message": "Fox News: The Iranian flag was raised by the students at the University of Irvine in California.\n\nIran is offering scholarships to students who will be expelled from US universities following the protests.", "location": "University of Irvine in California", "classification": "security", "score": 0.38395330639266484, "event_breakdown": "- Iranian flag raised by students at University of Irvine, California\n- Iran offering scholarships to students facing expulsion from US universities after protests"}, {"id": "66721bf3-71fb-4703-b688-b12492d18c48", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26625/", "date": "2024-05-03 11:05", "message": "Reuters from the Turkish Minister of Commerce:\n\nThe suspension of trade with Israel will continue until a permanent cease-fire in Gaza and until Israel allows all aid into the strip. \n\n##\nTurkey has de-facto joined the Shiite axis - like the Houthis... they are harming the Israeli economy until a ceasefire is reached. The Sultan became a Houthi pirate.\n\nIsrael should remember this when Turkey wants to resume trade between the countries.", "location": "Gaza", "classification": "security", "score": 0.9341793288581125, "event_breakdown": "- Suspension of trade with Israel until a permanent cease-fire in Gaza and allows all aid into the strip as stated by the Turkish Minister of Commerce\n- Turkey is seen as joining the Shiite axis and compared to the Houthis for harming the Israeli economy until a ceasefire is reached, with implications for future trade relations between Turkey and Israel"}, {"id": "f1bcbbee-86b5-43ae-a02e-b6ede19e8aae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26624/", "date": "2024-05-03 11:04", "message": "The Shia militias in Iraq claim:\nYesterday afternoon (May 2nd) we launched two cruise missiles from Iraq at a target in Tel Aviv and at a target in Be'er Sheva.\n\nThe militias in Iraq also claim that they attacked an Israeli target in the Dead Sea early this morning \"with appropriate weapons\".\n\n###\nSources of the Lebanese al-Mayadeen claim that the Iraqi cruise missiles were launched at the Glilot Base in Tel Aviv and the Avraham Base in Be'er Sheva.", "location": "Tel Aviv", "classification": "security", "score": 0.9833649319691411, "event_breakdown": "- Shia militias in Iraq claim to have launched two cruise missiles from Iraq towards targets in Tel Aviv and Be'er Sheva.\n- The militias also claim to have attacked an Israeli target in the Dead Sea using appropriate weapons.\n- Sources from Lebanese al-Mayadeen claim that the Iraqi cruise missiles targeted the Glilot Base in Tel Aviv and the Avraham Base in Be'er Sheva."}, {"id": "9668c0f4-a532-4388-a589-0f0513a5250a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26623/", "date": "2024-05-03 10:23", "message": "The coup in Niger: Russian soldiers reportedly enter a military base where the American troops are stationed\n\nAccording to Reuters, Russian soldiers have entered a military air base housing American forces in the capital of Niger.\n\nAs you might remember, last year there was a coup in Niger and the military junta that seized power demanded that the US terminate the agreement with it and... remove all American forces from Niger.\n\nThe American forces have not yet evacuated and now they have new \"guests\" at their base.\n\nAmerican officials state that the Russian and American soldiers remain in separate areas at the base. The American Secretary of Defense spoke out on the matter and said that there is no fear that the Russians will get their hands on American equipment.\n\n##\nThe Taliban send their regards..", "location": "Niger's capital, Niamey", "classification": "security", "score": 0.7709916187413431, "event_breakdown": "- Russian soldiers reportedly enter a military base in Niger housing American forces\n- Last year's coup in Niger led to the demand for the removal of American forces by the military junta in power\n- American forces have not yet evacuated despite the demands\n- American and Russian soldiers are currently present at the same base, but remain in separate areas"}, {"id": "a9f22b21-ec22-4459-8f21-3c819ba07b53", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26620/", "date": "2024-05-03 06:44", "message": "Last night's attack in Damascus, attributed to Israel\n\nSyrian sources identified with the Shiite axis report that the target of the Israeli attack in Damascus was the \"State Security School\" (of the Syrian Army - AA), near the village of Najaha, and as a result, a three-story building was severely damaged there.\nAccording to these sources, the target of the attack belonged to the Syrian army and not to Iranian elements in Syria.\n\nThe Syrian Ministry of Defense officially announced that Israel carried out an airstrike last night at 10:05 PM which resulted in the injury of 8 Syrian soldiers and damage to property.", "location": "'Damascus'", "classification": "security", "score": 0.9816944407775801, "event_breakdown": "- Last night's attack in Damascus, attributed to Israel\n- Syrian sources identified the \"State Security School\" near the village of Najaha as the target of the Israeli attack\n- A three-story building was severely damaged as a result of the attack\n- The Syrian Ministry of Defense officially announced that 8 Syrian soldiers were injured and property was damaged in the airstrike carried out by Israel at 10:05 PM"}, {"id": "b74d96da-fb5c-4608-af6f-bac4d2d64678", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26619/", "date": "2024-05-02 20:40", "message": "After the report of the Bloomberg agency's reporter in Turkey 👆, the Turkish Ministry of Commerce officially announces:\n\nFrom today, the import of goods from Israel and the export of goods to it will be suspended until all aid can be brought into the Gaza Strip", "location": "Turkey", "classification": "security", "score": 0.9158362566726752, "event_breakdown": "- Turkish Ministry of Commerce officially announces suspension of import and export of goods with Israel"}, {"id": "e6f8617f-8631-4a16-8932-9335cb09a758", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26618/", "date": "2024-05-02 20:19", "message": "Palestinian sources report the death of officer Muhammad Adas, one of the companions of Palestinian Authority Chairman Abu Mazen from the Presidential Guard, as a result of an IDF shot that hit him in the head during the entry of IDF forces into the village of Anbata in the Tulkarm district in the last hour.", "location": "Anbata, Tulkarm", "classification": "security", "score": 0.9884898904177141, "event_breakdown": "- Death of officer Muhammad Adas in Anbata village, Tulkarm district"}]