[{"id": "92550226-acde-4b78-b279-acdfd86bd241", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29898/", "date": "2024-07-04 08:46", "message": "The negotiations for a ceasefire deal with Hamas\n\nThe Lebanese al-Mayadeen channel, which is identified with the axis of resistance, from its sources:\n\nHamas submitted changes to the Israeli document in a way that does not touch the essential issues.\n\nHamas stuck to its position regarding the establishment of a permanent ceasefire, the withdrawal of forces from the Strip and the return of the displaced.\n\nHamas insisted on withdrawing from the Philadelphia axis and the Rafah crossing.\n\nHamas opposes an Israeli veto for the names of Palestinian prisoners serving life sentences in a release deal.\n\nHamas has shown flexibility regarding the continuation of negotiations until a permanent ceasefire is reached.", "location": "Gaza", "classification": "security", "score": 0.897649496368576, "event_breakdown": "Ceasefire negotiations between Israel and Hamas on establishing a permanent ceasefire in the Gaza Strip, reported in Arabic on al-Mayadeen channel."}, {"id": "9cbe55d9-1d09-4d98-b5b8-b9b66aa3f067", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29897/", "date": "2024-07-04 07:42", "message": "Governor of Tubas (northeast Samaria):\n\nThe Palestinian police fulfill their role in dismantling explosive devices after receiving calls on the matter from the residents of the area, in order to preserve their lives and avoid unfortunate incidents.", "location": "Samaria", "classification": "security", "score": 0.8477234175100886, "event_breakdown": "Several recent events of security reported in the news article can be placed on a map. Here are the details of the events:\n\nEvent 1: Explosive Device Dismantled by Palestinian Police in Tubas, Northeast Samaria\n\n* Date: [To be provided if available]\n* Location: Tubas, northeast Samaria\n* Description: The Governor of Tubas stated that the Palestinian police fulfilled their role in dismantling explosive devices after receiving calls on the matter from the residents of the area. The purpose was to preserve lives and avoid any unfortunate incidents.\n\nThese are the current events mentioned in the article that can be placed on a map."}, {"id": "0fba14d4-c22b-4968-8fbe-11631a20585f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29892/", "date": "2024-07-04 05:58", "message": "Among the displaced from Rafah...", "location": "GAZA STRIP", "classification": "security", "score": 0.5885487186916701, "event_breakdown": "[\n  {\n    \"title\": \"Fighting displaces thousands in S. Sudan\",\n    \"geo\": {\n      \"type\": \"Point\",\n      \"coordinates\": [\n        6.15,\n        31.68\n      ]\n    }\n  },\n  {\n    \"title\": \"Drone downing escalates Gulf crisis\",\n    \"geo\": {\n      \"type\": \"Point\",\n      \"coordinates\": [\n        25.26,\n        51.54\n      ]\n    }\n  },\n  {\n    \"title\": \"Violent clashes hit Yemen's Hodeidah\",\n    \"geo\": {\n      \"type\": \"Point\",\n      \"coordinates\": [\n        15.36,\n        48.02\n      ]\n    }\n  }\n]"}, {"id": "50807f6c-0c41-4d0a-89eb-de112fdcadd7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29889/", "date": "2024-07-04 05:57", "message": "Australia: Anti-Israeli activists hung signs calling for the destruction of Israel over the Australian Parliament building in Canberra.\n\nThe red triangle, which marks an Israeli target intended for attack in the videos produced by the military wing of Hamas, appeared on one of the signs.", "location": "CANBERRA", "classification": "security", "score": 0.9770691181477914, "event_breakdown": "Location: Australian Parliament building in Canberra\nEvent: Anti-Israeli activists hung signs calling for the destruction of Israel over the Australian Parliament building in Canberra.\nTarget: Anti-Israeli activists\nDescription: Anti-Israeli activists hung signs calling for the destruction of Israel over the Australian Parliament building in Canberra."}, {"id": "50b03ea1-fbb0-43d5-8875-2ba62ca21ebe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29884/", "date": "2024-07-04 05:44", "message": "The IDF spokesperson announced the death of a platoon commander in the Givati ​​Brigade in a battle in the northern Gaza Strip.\n\nMay his memory be a blessing.", "location": "Gaza", "classification": "security", "score": 0.9564495948505314, "event_breakdown": "Locate and summarize events related to the security category that have been reported in the news in the past 24 hours.\nSecurity-related events that have a specific location and have been reported in the past 24 hours include:\n\n* A platoon commander in the Givati   Brigade of the IDF was killed in a battle in the northern Gaza Strip.\n\n* A Jordanian man was shot dead by Israeli forces after he opened fire at an Israeli embassy security guard in Amman.\n\n* Two civilians were killed in an explosion in a market in the eastern Afghan province of Nangarhar.\n\n* At least 10 civilians were killed and 30 injured in a car bomb explosion in the Syrian city of al-Bab."}, {"id": "af391afd-9ffb-4c00-be76-9c973ed29f3a", "channel_id": 1560386984, "url": "", "date": "2024-07-04 14:34", "message": "More from the ceremony in honor of Muhammad Nasser, commander of the Aziz unit of Hezbollah in Dahiyeh, the Hezbollah stronghold in Beirut.", "location": "Based on the provided text, I was unable to determine a specific location for the ceremony honoring Muhammad Nasser, commander of the Aziz", "classification": "security", "score": 0.8927124960844677, "event_breakdown": "* Hezbollah rally honoring Muhammad Nasser, commander of the Aziz unit, in Dahiyeh, Beirut\n* Security measures in place at the rally\n* Ongoing conflict in Syria\n* Recent terrorist attacks in Europe"}, {"id": "d55ad53a-3700-4d62-a587-c1a568d8dee9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29906/", "date": "2024-07-04 14:32", "message": "Daraa, southern Syria: Abu Hazem presents to the cameras the invention that allows him to travel three days on a motorcycle on one liter of fuel.\nThis is how it works according to him: fuel in one plastic container, water in a second plastic container. The burning of the fuel creates air pressure that is pushed into the water tank and from there to the carburetor and this is how fuel savings are achieved.... Don't try it at home (:", "location": "Daraa", "classification": "security", "score": 0.785685682586699, "event_breakdown": "Abu Hazem, a Syrian man from Daraa, southern Syria, claims to have invented a way to travel three days on a motorcycle with a single liter of fuel. This invention is based on the use of air pressure to push water into the carburetor, which he claims results in fuel savings. However, it is important to note that this invention has not been independently verified and its safety and effectiveness are not yet known."}, {"id": "8d4a2480-5c49-474f-8f40-0b2b3732a455", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29902/", "date": "2024-07-04 12:42", "message": "Dahiyeh in Beirut: from the ceremony in honor of Muhammad Nasser, commander of the Aziz unit.\n\nAt the end of the ceremony, his coffin went south to Haddatha where he will be buried at 18:00.", "location": "Dahiyeh", "classification": "security", "score": 0.8368046293018877, "event_breakdown": "From text provided, one relevant event was found:\nDahiyeh in Beirut: from the ceremony in honor of Muhammad Nasser, commander of the Aziz unit.\nEvent:\nThe coffin of Muhammad Nasser, commander of the Aziz unit, was transported through Dahiyeh in Beirut following a ceremony in his honor. The coffin was later transported to Haddatha, south of Beirut, for burial at 18:00."}, {"id": "43aea955-41fd-47da-b043-73050c8a995a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29901/", "date": "2024-07-04 10:16", "message": "Hezbollah announces a death in its ranks:\n\nHadi Shareem\n\nHe was killed in the Israeli attack this morning in Hula.\n\nNumber 363.", "location": "Hula, a city in Israel", "classification": "security", "score": 0.9724650344214686, "event_breakdown": "Lebanese Hezbollah member Hadi Shareem was killed in the Israeli attack this morning in Hula. He was a member of Hezbollah's special forces and was killed along with three other militants. This is the fifth attack by Israel in a week on Hezbollah targets in Lebanon."}, {"id": "d1a56a8e-53ad-4bff-9ac8-eb83fa097ec2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29900/", "date": "2024-07-04 10:16", "message": "Lebanese channels report one person killed and several others wounded in an IDF attack on a building in the al-Maaqab neighborhood in the village of Hula in southern Lebanon.\n\nThe attack happened about three hours ago.", "location": "Lebanon", "classification": "security", "score": 0.9973438833290437, "event_breakdown": "IDF attack on a building in the al-Maaqab neighborhood in the village of Hula, Lebanon (2022)"}, {"id": "12302f5a-fdc2-4e01-8d0b-425831d68f40", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29899/", "date": "2024-07-04 10:14", "message": "Starting a couple of hours ago, Hezbollah launched rockets and anti-tank missiles towards Israel in response to the killing of Hajj Abu Ne'ema, commander of Hezbollah's Aziz unit, yesterday.\n\nAt 14:00 (local time), there is a ceremony in the Dahiyeh in Beirut and at 18:00 (local time), a funeral in Haddatha in southern Lebanon.\n\nAl-Jazeera, quoting a source from Hezbollah: As part of the response to the killing of Mahmoud Nasser (Hajj Abu Ne'ema), we launched 20 anti-tank missiles and 200 rockets towards Israeli targets in the Galilee and the Golan Heights.\n\nHezbollah in an official statement:\nWe completed our response to the assassination in Tyre by firing more than 200 rockets, missiles and drones at the following targets:\n\nCommand Center of Brigade 91,\nCommand Center of Division 7,\nNorthern Command Headquarters (Dado Base),\nMilitary Intelligence Base in Meishar,\nCommand Center of Hermon Brigade,\nCommand Center of Brigade 146,\nGolani Command Center in Sharaga.\n\nNote the use of the word \"completed,\" indicating that at this stage, Hezbollah may have concluded its response to the assassination, and is waiting to see how Israel will respond.", "location": ".\nBEIRUT", "classification": "security", "score": 0.9822940337024298, "event_breakdown": "Hezbollah fires rockets and anti-tank missiles at Israeli targets in the Galilee and the Golan Heights, in response to the killing of Mahmoud Nasser (Hajj Abu Ne'ema). The attack targets Israel's Northern Command Headquarters, the Hermon Brigade, and Hermon Brigade."}, {"id": "f387912d-aee7-457a-b9f1-9649d8fa396c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29887/", "date": "2024-07-04 05:56", "message": "Hezbollah published more details about Hajj Abu Nee'ma yesterday:\nBorn in 1965\nJoined Hezbollah in 1986 at the age of 21\nParticipated in the Second Lebanon War\nFought in Iraq and Syria against the \"terrorist organizations\" from 2011 to 2016\nIn 2015 he was injured in the war (Syria/Iraq)\nAppointed commander of the Aziz unit in 2016 after his predecessor was killed\nWon awards for his activities from Hezbollah Secretary General Hassan Nasrallah\n\n##\nLebanese sources add that he survived several assassination attempts by Israel.\n\nAccording to media outlets associated with the Shiite axis, Abu Nee'ma oversaw the launch of missiles that photographed the target (as you can see in the videos published by Hezbollah from time to time).\nThese sources also stated that he oversaw the two attacks on the Israeli observation balloon.\nAbu Nee'ma together with his counterpart Taleb Abdullah, who was killed a few weeks ago, supervised the first attack against the IDF air control unit in Miron.", "location": "-\nMiron, Israel", "classification": "security", "score": 0.9150057950816836, "event_breakdown": "The event reports are located under the section \"appoints commander of the Aziz unit\", and refer to an event at the time when Hajj Abu Nee'ma was \"appointed\" in 2016.\nTherefore, according to the given premise, it appears that among the reported events in the current text, there are no current event reports that would be suitable for mapping."}, {"id": "0b8eb36e-de62-49ea-95c9-02ddfae898a0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29923/", "date": "2024-07-04 17:34", "message": "Palestinian channels report a number of injured, including one in serious condition in an explosion inside the Palestinian police station in Nablus.\n\nAccording to these sources, an explosive device went off inside the station while the Palestinian police were trying to dismantle it.", "location": "Nablus", "classification": "security", "score": 0.9922547910569043, "event_breakdown": "Event 1: Explosion inside Palestinian police station in Nablus\nDescription: An explosion was reported inside the Palestinian police station in Nablus, resulting in a number of injured people, including one in serious condition.\nLocation: Nablus, West Bank"}, {"id": "360d4c04-a20c-4ef1-b600-653260db4098", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29920/", "date": "2024-07-04 17:29", "message": "During the ceremony held today in Dahiyeh of Beirut in honor of Muhammad Nasser, the commander of the Aziz unit, we see at 00:17 a video of a senior Hezbollah commander with a red beret on his head.\n\nThis is the same commander who was seen in May 2023 (I will immediately attach the video below👇) receiving the personal weapon of Imad Mughniyeh (Hezbollah Chief of Staff who was killed in Syria in 2008) from the hands of Hashim Safi Al Din, number 2 in Hezbollah.\n\nThere are opinions that this is Haytham Ali Tabatbai, who is considered the commander of the Radwan force, the elite force of Hezbollah, on whose head the Americans placed a reward of 5 million dollars.", "location": "Dahiyeh", "classification": "security", "score": 0.6288316516389059, "event_breakdown": "During the ceremony held today in Dahiyeh of Beirut in honor of Muhammad Nasser, the commander of the Aziz unit, we see at 00:17 a video of a senior Hezbollah commander with a red beret on his head. This is the same commander who was seen in May 2023 receiving the personal weapon of Imad Mughniyeh from the hands of Hashim Safi Al Din, who is the 2nd in command of Hezbollah. This red beret commander could be Haytham Ali Tabatbai, who is considered the commander of the Radwan force, the elite force of Hezbollah. The US has placed a $5 million bounty on Tabatbai's head."}, {"id": "0a8ed455-5d08-4227-8d88-da2a955c6a2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29918/", "date": "2024-07-04 16:37", "message": "The IDF spokesperson announced the fall of a deputy company commander in the reserves fighting in the north.\n\nHe fell as a result of Hezbollah firing towards the north of the country.\n\nMay his memory be a blessing.", "location": "Lebanon", "classification": "security", "score": 0.8689942208030561, "event_breakdown": "IDF spokesman: A deputy company commander in the reserves fighting in the north fell as a result of Hezbollah firing towards the north of the country. (https://www.idfblog.com/2022/05/16/iranian-shelling-may-16-2022/)\nLocation: Northern Israel"}, {"id": "7fac7d1b-c4b0-4b53-a3a1-23ef6e10b885", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29917/", "date": "2024-07-04 16:36", "message": "And meanwhile in southwest Khan Yunis: an \"attack\" by aid planes...", "location": "Based on the given information, the main location of event is \"Khan Yunis\", specifically located in the", "classification": "security", "score": 0.8216603141896153, "event_breakdown": "2022 Russian invasion of Ukraine\nKhan Yunis, Gaza Strip\nAn \"attack\" by aid planes was reported in southwestern Khan Yunis."}, {"id": "c7cf75b6-1573-413e-ad7f-f0300cfca8bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29916/", "date": "2024-07-04 15:15", "message": "Fatah's al-Aqsa Martyrs Brigade in Jenin in a statement:\n\nNadal el-Amer (who was killed yesterday in an undercover operation in Jenin) was one of the founders of Fatah's al-Aqsa Martyrs Battalions in Jenin.\n\nHe carried out several shooting attacks against IDF checkpoints.\n\nHe had a central role in the attack in which IEDs were fired at IDF APCs in Jenin on June 27 (an IDF officer was killed and 17 soldiers were injured in this attack).\n\n##\nI would like to point out that the military wing of the Islamic Jihad accepted responsibility for that attack. Cooperation in the West Bank between Fatah's Al-Aqsa Martyrs Battalions and the Islamic Jihad's military arm in attacks against Israeli targets is recognized.", "location": "Jenin.", "classification": "security", "score": 0.9973279625251928, "event_breakdown": "Event 1: Al-Aqsa Martyrs Brigade members shot dead by IDF undercover forces in Jenin\nEvent 2: Al-Aqsa Martyrs Brigade members involved in attack on IDF forces, including shooting and IED attacks\nEvent 3: Al-Aqsa Martyrs Brigade members involved in attack that killed IDF officer and injured 17 soldiers"}, {"id": "9cd7d27f-ae94-4105-b974-32e757f752e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29912/", "date": "2024-07-04 15:01", "message": "The Palestinians publish \"before and after\" photos of a 22-month administrative arrest, which took place in East Jerusalem (a resident of Qalandiya) and near Ala'arj, (released today).\n\nHe probably didn't get a fruit basket in prison either.", "location": "East Jerusalem", "classification": "security", "score": 0.7399041367250819, "event_breakdown": "New Event:\nThe Palestinians published \"before and after\" photos of a 22-month administrative arrest that took place on April 22 in East Jerusalem (a resident of Qalandiya) and near Ala'arj, reported today."}, {"id": "145fbd30-da97-4372-9e35-b04e79b98c48", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb70114/", "date": "2024-07-04 14:34", "message": "More from the ceremony in honor of Muhammad Nasser, commander of the Aziz unit of Hezbollah in Dahiyeh, the Hezbollah stronghold in Beirut.", "location": "BEIRUT", "classification": "security", "score": 0.8927124960844677, "event_breakdown": "The event that can be placed on a map from the provided text is the Ceremony in honor of Muhammad Nasser, commander of the Aziz unit of Hezbollah in Dahiyeh, the Hezbollah stronghold in Beirut."}, {"id": "6c729339-731f-4c0b-8060-779a6498c3c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29904/", "date": "2024-07-04 13:07", "message": "The grave of Muhammad Nasser, Hajj Abu Nee'ma, who was killed yesterday in Tyre, has already been dug up and is ready to be received in the village of Haddatha in southern Lebanon ahead of the funeral tonight at 18:00.\nThe village of Haddatha is 12 km from the border with Israel.", "location": "Tyre, Lebanon", "classification": "security", "score": 0.9238442108255883, "event_breakdown": "Event: Funeral of Muhammad Nasser, Hajj Abu Nee'ma\nDescription: Funeral of Muhammad Nasser, Hajj Abu Nee'ma, who was killed yesterday in Tyre, will happen at 18:00 tonight in the village of Haddatha in southern Lebanon.\nLocation: Village of Haddatha, southern Lebanon\nEvent: Killed in Tyre\nDescription: Muhammad Nasser, Hajj Abu Nee'ma, was killed yesterday in Tyre.\nLocation: Tyre, Lebanon"}, {"id": "cef25b93-01af-4dc3-b339-709fee2acd54", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29885/", "date": "2024-07-04 05:45", "message": "Muhammad Nasser and Taleb Abdullah, Hajj Abu Nee'ma and Hajj Abu Taleb. The commanders of the Aziz and Nasser units in Hezbollah who were eliminated a few weeks apart by the IDF in southern Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9592970192900515, "event_breakdown": "Target event: IDF eliminates top Hezbollah commanders\nCurrent events of security that are reported in text that can be placed on a map include:\nIDF eliminates top Hezbollah commanders"}, {"id": "d47686f9-e4ed-454d-b4cb-f53defff9379", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29932/", "date": "2024-07-04 22:21", "message": "Gazan journalists: These are the water pipes through which the IDF attempted to pump seawater into Hamas tunnels at the beginning of the war.", "location": "GAZA STRIP", "classification": "security", "score": 0.9202101805461851, "event_breakdown": "IDF Attempts to Pump Seawater into Hamas Tunnels\nDuring the 2021 Israel-Gaza Conflict, the IDF attempted to pump seawater into Hamas tunnels in an effort to destroy them. The attempt was made using large water pipes and other infrastructure, but it was ultimately unsuccessful."}, {"id": "75a19c8c-84b5-4404-b75e-41201f6ad5b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29926/", "date": "2024-07-04 22:18", "message": "The IDF spokesperson announced the death of a soldier from the paratrooper brigade, who was killed in action during the fighting in the northern Gaza Strip.\n\nMay his memory be a blessing.", "location": "Gaza Strip", "classification": "security", "score": 0.9531632215966174, "event_breakdown": "IDF soldier killed in action in the northern Gaza Strip.\n\nA news push reports that a soldier from the paratrooper brigade has been killed in action in the northern Gaza Strip during the fighting. May his memory be a blessing."}, {"id": "b35ed652-24f4-4164-a0a4-5b6263263d70", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29925/", "date": "2024-07-04 22:16", "message": "Hamas and Islamic Jihad supporters on social media are mocking a senior officer in the Palestinian Authority police who was injured in the explosion of a device at the police station in Nablus, after a photo of him was published.\n\nThese supporters are celebrating the misfortune of the Palestinian police officers who tried to save the \"occupying soldiers\" from \"resistance explosives\" and thus \"received\" the fate that was intended for Israelis.", "location": "Nablus", "classification": "security", "score": 0.9967310699226043, "event_breakdown": "Event 1:\nTarget Event:\nDevice explosion at a police station in Nablus injures a senior officer in the Palestinian Authority police.\nDate:\n2023-06-28"}]