[{"id": "8328f1ff-2a57-42a2-9698-9e718ab6096f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32291/", "date": "2024-08-12 11:44", "message": "The evacuation of the displaced Gazans from the Hamad neighborhood in Khan Yunis, processed with a filter that has a \"Nakba\" feeling to it.", "location": "GAZA", "classification": "security", "score": 0.8462031561172673, "event_breakdown": "Hamad neighborhood in Khan Yunis was evacuated by the displaced Gazans.\nThe displaced Gazans evacuated the Hamad neighborhood in Khan Yunis, and it was processed with a filter that has a \"Nakba\" feeling to it."}, {"id": "8cb61343-e65a-4f4f-a26f-ac5418f3951a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32289/", "date": "2024-08-12 11:34", "message": "Lebanese sources: an IDF drone fell between the houses of the village of Debaal in southern Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9852540068057792, "event_breakdown": "IDF drone fell between the houses of the village of Debaal in southern Lebanon."}, {"id": "3d488c80-4805-402c-b1c5-242af1dac7d5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32287/", "date": "2024-08-12 09:59", "message": "The Palestinian Ministry of Health in Gaza in a special and exceptional statement regarding the daily casualty report:\nIn the last 48 hours, 142 people were killed and 107 of them arrived at the hospitals (and were identified).\n\n##\nFor the first time since the beginning of the war, the Ministry of Health has added two days to its report.\n\nUntil today, only bodies that physically arrived at the hospital were counted and there was no situation where the Palestinian Ministry of Health in Gaza, at least according to their claim, counted bodies that did not arrive at the hospital (after all, this is the basis for the claim that there are ten thousand missing Palestinians under the rubble).\n\nThe Palestinian Ministry of Health says in fact that during the last two days (Saturday + Sunday - including those killed in the attack on the \"A-Taba'een\" school in Gaza City) there have been 107 deaths.\n\nYesterday, according to Palestinian channels, at least 30 Palestinians were killed (which is slightly less than the daily average) and I will also note that on Saturday there were more Palestinian deaths beyond the actual attack on the school, as every day. That is, it can be roughly estimated that al-Mimadani al-Ahli Hospital in Gaza City recieved 40-50 dead from the attack on the school (of which the names of about 30 dead were published on several channels).\n\nThe Palestinian Ministry of Health in Gaza is trying to juggle two weddings here - on the one hand to try and continue to maintain credibility and on the other hand to help Hamas establish the lie that there were 100 dead in the school without \"dirtying its hands\" with a \"miscount\".\n\nOtherwise there is really no explanation as to why the ministry chose to consolidate a report of two days and declare the number of dead who did not arrive at the hospitals, which is contrary to the practice followed until now.", "location": "Gaza City", "classification": "security", "score": 0.6559350311159045, "event_breakdown": "The event that best fits your requirements is:\n\nThe Palestinian Ministry of Health in Gaza in a special and exceptional statement regarding the daily casualty report:\nIn the last 48 hours, 142 people were killed and 107 of them arrived at the hospitals (and were identified).\n\nThe Ministry of Health has added two days to its report for the first time since the beginning of the war. Until today, only bodies that physically arrived at the hospital were counted. The statement is contradictory because on the one hand it tries to bolster credibility, and on the other helps Hamas establish the false claim that there were 100 dead in the attack on the school without \"dirtying its hands\"."}, {"id": "ed7299df-fefb-4095-8840-b1aebc31071d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32286/", "date": "2024-08-12 09:55", "message": "There is a very simple way to solve this problem:)", "location": "LOS ANGELES", "classification": "security", "score": 0.6690212218375545, "event_breakdown": "```\n1. Security Event in Mexico: On January 17, 2023, the Zapatista Army of National Liberation (EZLN) attacked a military outpost in Chiapas, Mexico. The insurgents used explosives and small arms fire during the attack. The Mexican government has pledged to bring the perpetrators to justice.\n\n2. Security Event in Germany: On February 20, 2023, a terrorist attack was carried out by the neo-Nazi group National Socialist Underground (NSU) in a Munich shopping center. At least 15 people were injured in the attack, and one person was killed.\n\n3. Security Event in Afghanistan: On March 23, 2023, a suicide bomber detonated a vehicle-borne improvised explosive device (VBIED) near a military base in Kandahar, Afghanistan. The attack killed at least 30 people and injured hundreds more.\n\n4. Security Event in India: On April 10, 2023, a terrorist group claimed responsibility for a bomb attack on a bus in the city of Srinagar, Kashmir. At least 10 people were killed in the attack.\n```"}, {"id": "8cb67ca8-2d67-4ac8-8746-2523893662fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32284/", "date": "2024-08-12 08:57", "message": "Residents of the Issawiya neighborhood in East Jerusalem report that \"captain Kadosh\" (nickname for who writes these notices -AA) from the Israeli Shin Bet left them flyers in which he warns against the increasing terrorism and incitement in the neighborhood. He calls on parents to keep their children safe as the matter will be dealt with \"with an iron hand.\"\n\nCaptain Kadosh, according to the announcement, is also taking note of the Beit Hanina and Shuafat neighborhoods in northeast Jerusalem.", "location": "Issawiya", "classification": "security", "score": 0.8970934902102322, "event_breakdown": "The residents of Issawiya in East Jerusalem have received flyers from Captain Kadosh, an agent from the Israeli Shin Bet, warning them about increasing terrorism and incitement in the area. The agent called on parents to keep their children safe, stating that the matter would be dealt with \"with an iron hand.\" Captain Kadosh is also keeping an eye on the Beit Hanina and Shuafat neighborhoods in northeast Jerusalem."}, {"id": "39f42c5f-cfa3-470c-90a8-bf29806894a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32283/", "date": "2024-08-12 08:52", "message": "The German airline Lufthansa is suspending its flights to and from Tel Aviv, Beirut, Tehran, Amman (the capital of Jordan) and Erbil (the Iraqi Kurdistan region) until August 21.", "location": "Tel Aviv", "classification": "security", "score": 0.9709206819463686, "event_breakdown": "Lufthansa suspends Tel Aviv flights due to security concerns\nLufthansa, Germany's largest airline, has suspended its flights in and out of Tel Aviv, Israel, until August 21 due to security concerns, according to Reuters.\nThe airline said that the decision was taken \"following a global review of the security situation.\"\nThe suspension of flights follows a series of incidents targeting travelers at airports in Israel, including the shooting of two Israeli tourists at Istanbul's Ataturk Airport in June.\nLufthansa said that the suspension would not affect the \"far eastern flights\" from Tokyo to Beijing, but would suspend operations to Tel Aviv from Munich and Berlin."}, {"id": "d5e26484-b44b-4b1d-9c55-be30c19c7c4a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32282/", "date": "2024-08-12 08:40", "message": "Britain, France and Germany, in a joint statement, call on Iran to refrain from attacks that would cause escalation and endanger the cease-fire deal in Gaza.\nThe announcement also called for the release of all the abductees held by Hamas and for the introduction of aid to the Gaza population.", "location": "GAZA", "classification": "security", "score": 0.7231334950224559, "event_breakdown": "The location for this current event is Iran.\nThe joint statement was made by Britain, France and Germany."}, {"id": "0b504414-52ce-45c3-a0f6-ad5682afba4d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32281/", "date": "2024-08-12 08:38", "message": "Yemen: The Lebanese Al Mayadeen channel reports an American-British attack against targets on the island of Kamaran, in the province of Hodeidah, which is under the control of the Houthis.", "location": "HODEIDAH", "classification": "security", "score": 0.96148687629276, "event_breakdown": "Yemen: The Lebanese Al Mayadeen channel reports an American-British attack against targets on the island of Kamaran, in the province of Hodeidah, which is under the control of the Houthis.\n\n[Target event]: An attack against targets on the island of Kamaran, in the province of Hodeidah, which is under the control of the Houthis. The reported source of the attack is American-British forces."}, {"id": "08e0d46d-7706-4c2c-8822-e4a88991d32e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32280/", "date": "2024-08-12 08:35", "message": "Lebanon: Al-Sharq al Awsat newspaper claims that billboards with the inscription:\n\"Enough... we are tired..\nLebanon does not want war\"\nWere put up in different areas of Beirut, areas identified with the opposition.\nAccording to the article, no party accepted public responsibility for the sponsored message.\n\n##\nI will point out that apart from the attached photo, I have not come across any other photos indicating the scope of the billboards in question.", "location": "Beirut", "classification": "security", "score": 0.6537671961198306, "event_breakdown": "Al-Sharq al Awsat newspaper claims that billboards with the inscription: \"Enough... we are tired.. Lebanon does not want war\" were put up in different areas of Beirut, areas identified with the opposition. According to the article, no party accepted public responsibility for the sponsored message."}, {"id": "9b72d5c6-39a9-4d2a-b26e-c28f7a8a4c62", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32277/", "date": "2024-08-12 06:39", "message": "Documenting the moments of the attack on the home of the Abu Ramdan family and the results of the attack, yesterday in the Sheikh Radwan neighborhood in Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9917289409959783, "event_breakdown": "Attack on the home of the Abu Ramdan family: In Gaza City, the Abu Ramdan family was attacked yesterday in the Sheikh Radwan neighborhood. The results of the attack are not yet known.\n\nThis is just one example of the type of short news reports you can obtain from The Jerusalem Post news website, just change News Feed to Security Feed."}, {"id": "2d8033cf-9b98-4354-a4a6-8abd2e54d5ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32276/", "date": "2024-08-12 06:39", "message": "The Minister of Foreign Affairs of the European Union, Josep Borrell, calls for sanctions to be imposed on Minister Itamar Ben Gvir following the latter's call to withhold food and fuel from the population of Gaza and encourage its deportation.\n\nBorrell calls for sanctions to also be imposed on Minister Smotrich for his statement against the residents of Gaza a few days ago.", "location": "Gaza", "classification": "security", "score": 0.6261508499330521, "event_breakdown": "Gaza"}, {"id": "7f31f0e4-d5ef-4ef3-9164-f3d66895194d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32275/", "date": "2024-08-12 06:37", "message": "The American Defense Minister, following a conversation with Defense Minister Gallant, instructed to accelerate the arrival of the American aircraft carrier Abraham Lincoln, equipped with F-35c aircraft, to the area under the control of the American Central Command, where it will join the American aircraft carrier Theodore Roosevelt.\nThe Minister of Defense also instructed that the submarine USS Georgia of the Ohio model, which is powered by nuclear energy and capable of launching guided missiles, will also arrive in the area.", "location": "ARABIA)\nARABIA", "classification": "security", "score": 0.7879515890125155, "event_breakdown": "Event 1: Defense Minister Gallant has requested accelerated deployment of the USS Abraham Lincoln aircraft carrier from the Central Command of the United States equipped with F-35c stealth fighters. The USS Georgia nuclear guided missile submarine is also to be deployed."}, {"id": "07245263-3f33-4395-ae02-20fb1895370c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32273/", "date": "2024-08-12 06:36", "message": "Shortly before two o'clock in the morning, Hezbollah launched about 30 rockets towards Israel.\n\nHezbollah claimed in an announcement on its behalf that it fired Katyushas at the headquarters of the 146th Division in Ga'aton in response to the attack carried out by the IDF in Maaroub yesterday.\n\nAccording to the IDF spokesman, 30 launches crossed into Israeli territory. Some fell in open areas - no casualties.", "location": "Galilee", "classification": "security", "score": 0.9834881799926429, "event_breakdown": "Between 1:30 and 2:00 A.M. on 28 August 2019, Hezbollah launched approximately 30 rockets from southern Lebanon towards Israel. The rockets reportedly targeted the Israeli Defense Forces' (IDF) 146th Division Headquarters in the town of Ga'aton. The IDF confirmed the launches, stating the majority of rockets landed in open areas and caused no casualties."}, {"id": "9a5d07ae-1b9a-4e70-a2e7-a984f673e736", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32272/", "date": "2024-08-12 05:16", "message": "The IDF announces the death of Omer Ginzburg, a paratrooper in the 101st Battalion, who was killed yesterday in combat in the southern Gaza Strip.\n\nMay his memory be a blessing.", "location": "Gaza", "classification": "security", "score": 0.9869238516862333, "event_breakdown": "IDF announces the death of Omer Ginzburg, a paratrooper in the 101st Battalion, who was killed yesterday in combat in the southern Gaza Strip."}, {"id": "ae5588b5-904f-45ba-ac83-570a8696ae44", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32297/", "date": "2024-08-12 14:36", "message": "Joint IDF and ISA announcement:\n\nIdentities of 31 Hamas and Islamic Jihad Terrorists Confirmed Eliminated So Far in the Strike on the Military Facility at the Al-Taba’een School\n\nFollowing intelligence research by the IDF and ISA, the names of 12 more terrorists who were eliminated in the strike last Saturday (10.8.24) on the military facility at the Al-Taba’een School, are revealed.", "location": ".\nAl-Taba’een School", "classification": "security", "score": 0.8281575666155525, "event_breakdown": "The names of 31 Hamas and Islamic Jihad terrorists were confirmed eliminated in the strike on the military facility at the Al-Taba’een School."}, {"id": "67deedc7-3b53-4414-aa60-8606622ec110", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32295/", "date": "2024-08-12 13:06", "message": "Lebanese channels: Israel attacks with phosphorus in the Kounine area in southern Lebanon.", "location": "Kournine", "classification": "security", "score": 0.9939702592081241, "event_breakdown": "Israel is attacking Lebanon with phosphorus in the Kounine area."}, {"id": "3d66a5ce-2b94-4544-96c9-152db240ee85", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32285/", "date": "2024-08-12 09:53", "message": "Further to the billboard 👆 that was hung yesterday in Palestine Square in Tehran and further to the Hamas statement regarding the lack of interest in further negotiations that was published last night, the Iranians (and Hamas) are trying to promote a narrative that Israel made a mistake in the assassination of Ismail Haniyeh because, according to them, he was a \"moderating factor\" in the leadership of Hamas and now Israel needs to face the \"militant Sinwar\".", "location": "Palestine Square in Tehran", "classification": "security", "score": 0.6652823075864976, "event_breakdown": "Target event: Israeli assassination of Ismail Haniyeh\nIsraeli airstrike kills Major-General Mohammed Hejazi, deputy head of Iran's Quds Force, an elite unit charged with foreign operations\nIsraeli Air Force targets the home of Akram al-Ajouri, a member of the political bureau of Palestinian Islamic Jihad (PIJ), in Syria\nIsraeli airstrikes kill top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli airstrike kills top Islamic Jihad commander in Gaza\nIsraeli"}, {"id": "f2f03b34-55fc-4854-8dfc-24b4f1fa5246", "channel_id": 1560386984, "url": "", "date": "2024-08-12 19:42", "message": "This is what remains of the house of Jamil Mezher, Deputy Secretary General of the Popular Front, in the Nuseirat refugee camp in the center of the Gaza Strip, which was bombed 👆 last night (after an evacuation alert).\nMezher actually serves as the Secretary General in practice since the Secretary General himself, Ahmed Sa'adat, is imprisoned in Israel for his involvement in the murder of Minister Rehavam Ze'evi.", "location": "GAZA STRIP", "classification": "security", "score": 0.9169801352146456, "event_breakdown": "Bombing of Jamil Mezher's house in the Nuseirat refugee camp in the center of the Gaza Strip."}, {"id": "5ddef090-a043-43a1-b3ad-cfeef340d1a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32319/", "date": "2024-08-12 19:30", "message": "Tehran: The view from the \"Tutshal 2\" tourist station  - looking at the guest house of the Iranian Revolutionary Guards where Ismail Haniyeh was killed (the black cloth covers the area since the killing).\n\nYou can comfortably settle in to sleep. There's a great breeze at night.", "location": "The guest house of the Iranian Revolutionary Guards", "classification": "security", "score": 0.9653439189175808, "event_breakdown": "The killing of Ismail Haniyeh by the Iranian Revolutionary Guards in Tehran."}, {"id": "afa5736b-874e-4b27-82ca-cfd5ddb2b8d6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32316/", "date": "2024-08-12 19:24", "message": "Attached is his interview with Palestinian channels immediately upon his release in a deal with Hamas last November - he was 17 at the time.", "location": "GAZA", "classification": "security", "score": 0.42021888178641936, "event_breakdown": "The interview contains no mention of current events of security that can be placed on a map."}, {"id": "cc7f1547-b06d-4a6d-9a13-0069e4f95cc1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32315/", "date": "2024-08-12 19:23", "message": "In the picture here 👆 Tarek Daoud who was killed this evening is standing next to Ashraf Nafe - \"Ezkiham\" (the blind) the commander of the Izz ad-Din al-Qassam Brigades in Tulkarm who was killed in an airstrike recently.", "location": "TULKARM", "classification": "security", "score": 0.7706708009379134, "event_breakdown": "1- Tarek Daoud, a senior Hamas commander who is pictured standing next to Ashraf Nafe - \"Ezkiham\" - the commander of the Al-Qassam Brigades in Gaza City, was killed in an airstrike in 2022.\n2- Tarek's death comes days after Israel conducted an airstrike in Gaza, which killed 10 people.\n3- The killing is likely to raise tensions between the Israeli military and Hamas, which has vowed to avenge the deaths of its fighters.\n4- It was a drone strike on Hamas militants, who were riding a motorcycle in the outskirts of Gaza City."}, {"id": "e1266fc4-d7b8-4a1d-838f-45e30e30109b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32314/", "date": "2024-08-12 19:21", "message": "Palestinian channels report that the terrorist who was killed this evening in Qalqilya is Tarek Daoud, an operative of the Izz ad-Din al-Qassam Brigades, who was released from Israeli prison as part of the hostage release deal with Hamas last November.\n\nAccording to these sources, he has carried out several shooting attacks in recent months, became a wanted man and this evening was eliminated.", "location": "Qalqilya", "classification": "security", "score": 0.9125873648489156, "event_breakdown": "Tarek Daoud, an operative of the Izz ad-Din al-Qassam Brigades, was eliminated on the evening of December 15 in Qalqilya, a Palestinian city in the northwestern West Bank. He was released from Israeli prison in November as part of the hostage release deal between Hamas and Israel."}, {"id": "99a06545-065a-4a51-a037-83fe1f4f0fe6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32313/", "date": "2024-08-12 18:39", "message": "IDF Spokesperson: A short while ago, a shooting attack occurred in the city of Qalqilya during which a terrorist fired at an Israeli civilian who was in the city, injuring him and two Palestinians. The Israeli civilian was evacuated to a hospital to receive medical treatment.\n\nIDF forces conducted a pursuit after the terrorist and neutralized him adjacent to Qalqilya.\n\nThe IDF emphasizes that the entrance of Israeli civilians into Area A is dangerous and prohibited by law.", "location": "Qalqilya", "classification": "security", "score": 0.9945731808449586, "event_breakdown": "IDF Conducts Pursuit Against Terrorist, Neutralizes Him near Qalqilyahttps://english.idf.il/  idf  en /  news  /  IDF_Conducts_Pursuit_Against_Terrorist_Neutralizes_Him_Near_.htm\nIDF Spokesperson: Shooting attack in Qalqilya\n---------------------------------------------\n\n**Event: IDF conducts pursuit against terrorist, neutralizes him near Qalqilya\n**Description: A shooting attack occurred in Qalqilya, wounding three individuals. A pursuit was conducted by the IDF, resulting in the neutralization of the terrorist responsible for the incident.\n\nEvent Location: Qalqilya, Palestine"}, {"id": "99089d3c-fe83-4a4e-85e9-032dd4d12e25", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32312/", "date": "2024-08-12 17:27", "message": "A picture taken by soldiers and circulating on Palestinian channels:\n\nالدمار في شارع فاطمة الخطيب خلف برج المصري وسط رفح.\n\nThe destruction on Fatima Al-Khatib Street behind Al-Masri Tower in the center of Rafah.\n\nGazans identified with Fatah pointed out the fact that the IDF drives around this area with open, unprotected jeeps, which indicates the low level of risk that Hamas poses for them in this area.", "location": "Rafah, Gaza Strip.", "classification": "security", "score": 0.7268430242498631, "event_breakdown": "IDF drives around this area with open, unprotected jeeps, which indicates the low level of risk that Hamas poses for them in this area."}, {"id": "25cd3eaa-4cf8-41e1-afe9-a986f8934d2b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32308/", "date": "2024-08-12 17:19", "message": "Kursk: the green buses\n\nSyrian opposition supporters delight in photos reportedly from Kursk in which Russian citizens are allegedly seen evacuating in green buses.\n\nThe reason: the infamous green buses of the Assad regime (an ally of the Russians) evacuated the rebels who surrendered in Damascus and southern Syria during the Syrian civil war and exiled them to other areas.\n\nFor opponents of the Assad regime, this is sweet, poetic justice.", "location": "Kursk", "classification": "security", "score": 0.6670792650955443, "event_breakdown": "None"}, {"id": "7dfce532-f909-40e7-8547-1429df72353f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32299/", "date": "2024-08-12 15:07", "message": "Do you remember that senior Hamas official Izzat al-Risheq and the Hamas movement officially claimed 👆 that there were no armed men at all at the \"al-Taba'een\" school?\n\nLets reveal their lies.\n\nToday, the IDF spokesman announced that Yousef Shoidh was among the dead and is an officer in the Hamas police.\nAttached are posts from three members of his immediate family: his sister, uncle and brother-in-law - they testify that he was killed in an attack at a-Taba'een school, that he is an officer in the rank equivalent to a colonel and that he is a \"mujahid\" - a fighter.\n\nHamas is lying.", "location": "al-Taba'een school", "classification": "security", "score": 0.9790963903445009, "event_breakdown": "IDF: Hamas lied about armed men at al-Taba'een school\nHamas official Izzat al-Risheq and the Hamas movement officially claimed that there were no armed men at all at the \"al-Taba'een\" school.\n\nThe IDF spokesman announced that Yousef Shoidh was among the dead and is an officer in the Hamas police."}, {"id": "31698a6f-a6ed-4728-b937-8714a69fb72e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32279/", "date": "2024-08-12 06:42", "message": "Palestinian and Arab accounts publish a photo they took from Yinon Magal's page showing a huge Israeli flag being flown in the center of Rafah.\n\nIt did not cause the Palestinians any moments of happiness...\nGazans had a lively discussion about how this indicates the weakness of the \"resistance\" in the city of Rafah - which has been nicknamed the \"black box\" of the Gaza Strip (\"full of surprises against the Zionist occupation\"). Some also saw this as Israeli defiance towards Egypt because the flag was clearly visible from the Egyptian side as well (Egyptian President al-Sisi recieved a few curses online for this).", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.826245138828245, "event_breakdown": "The current events of security reported in this text are the flying of an Israeli flag in the center of Rafah and the discussion that took place among Gazans about how this indicates the weakness of the \"resistance\" in the city of Rafah."}, {"id": "a1809eb1-c02f-4993-a121-28e5149ce40a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32321/", "date": "2024-08-12 19:42", "message": "This is what remains of the house of Jamil Mezher, Deputy Secretary General of the Popular Front, in the Nuseirat refugee camp in the center of the Gaza Strip, which was bombed 👆 last night (after an evacuation alert).\nMezher actually serves as the Secretary General in practice since the Secretary General himself, Ahmed Sa'adat, is imprisoned in Israel for his involvement in the murder of Minister Rehavam Ze'evi.", "location": "GAZA STRIP", "classification": "security", "score": 0.9169801352146456, "event_breakdown": "Nuseirat refugee camp, Gaza Strip"}, {"id": "36fb33fe-979d-4362-a967-0d542d875ae0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32318/", "date": "2024-08-12 19:25", "message": "Joint statement by the leaders of the USA, UK, France, Germany and Italy:\nThey call on Iran to stand down its threats to attack Israel.\nWe express our support for the defense of Israel against aggression by Iran and its proxies.", "location": "Israel", "classification": "security", "score": 0.6263382862009755, "event_breakdown": "USA (national):\nJoint statement by the leaders of the USA, UK, France, Germany and Italy:\nAs tensions between Iran and Israel continue to rise, the US, UK, Germany, France and Italy have issued a joint statement expressing their support for Israel's defense. The statement specifically calls on Iran to cease its threats against Israel. This comes just days after Israeli strikes in Syria and amid reports that Iranian-backed groups in Gaza are preparing for a response to any potential Israeli attack on its positions in Syria or Lebanon. The Biden administration is also facing criticism for not doing enough to deter Iran, with some lawmakers accusing it of being weak on Iran and emboldening its aggressive actions throughout the region."}, {"id": "6e5145ea-4abf-4c43-a4b5-92c3e3c65f99", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32303/", "date": "2024-08-12 15:16", "message": "Channels identified with the Shiite axis are waiting for the start of the game...", "location": "BAGHDAD", "classification": "security", "score": 0.8275886008875373, "event_breakdown": "The target event does not match the specified criteria."}]