[{"id": "2a62e1e7-6d3c-48e8-a9a4-8dd3e45adcb9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29784/", "date": "2024-07-02 08:21", "message": "Similar to what was reported a week ago, Lebanese channels state that an Israeli drone attacked an electrical transformer in the village of Taybeh in southern Lebanon, as well as the equipment of the drinking water project at this location.\n\n##\nIt is possible to understand between the lines that Israel may be trying to withhold electricity and water from the residents of this area in southern Lebanon.", "location": "NULL", "classification": "security", "score": 0.9122686823423763, "event_breakdown": "Target event:\nIt's reported that an Israeli drone attacked an electrical transformer in the village of Taybeh in southern Lebanon, as well as the equipment of the drinking water project at this location.\nPossible event:\nPossible drone attack by Israel against electrical transformer in Taybeh, Lebanon"}, {"id": "908c9a49-cd89-44f6-aef3-781a2d2d403c", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb69939/", "date": "2024-07-02 07:21", "message": "The IDF spokesperson officially links the evacuation of the population from Khan Yunis with the shooting by Hamas yesterday at the Gaza Envelope:\n\nIDF: Yesterday (Monday), approximately 20 projectiles were launched from the area of Khan Yunis toward Israeli communities near the Gaza Strip. \n\nOvernight, the IDF struck terror targets in the area from which the projectiles were fired, including a weapons storage facility, operational centers, and additional terrorist infrastructure sites. Prior to the strike, the IDF took precautionary measures to mitigate harm to uninvolved civilians, including by enabling civilians to evacuate from the area.\n\nThe Hamas terrorist organization continues to systematically violate international law while using civilian infrastructure and the civilian population as human shields for its terrorist activities against Israel.", "location": ".\nGAZA", "classification": "security", "score": 0.9709384108736072, "event_breakdown": "IDF: Yesterday, approximately 20 rockets were fired from the area of Khan Yunis in southern Gaza towards Israeli communities near the Gaza Strip. The IDF responded by striking terror targets in the area from which the rockets were fired, including a weapons storage facility, operational centers, and other terrorist infrastructure sites."}, {"id": "436ac16c-4033-4631-9b8c-00e0a3527718", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29794/", "date": "2024-07-02 11:21", "message": "Lebanese channels report on a civilian who was killed by an IDF attack in the area of al-Bustan in southern Lebanon.", "location": "al-Bustan", "classification": "security", "score": 0.9950169951747343, "event_breakdown": "IDF attack in southern Lebanon\nIDF attack on southern Lebanon"}, {"id": "910d5a0d-d266-49be-a961-c1be85e4f044", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29793/", "date": "2024-07-02 11:20", "message": "The Palestinian Ministry of Health in Gaza:\n\n25 dead in the Strip in the last day.\n\nThe number of deaths in the past days in the last week:\n23\n43\n40\n29\n47\n60\n32\n\n37,925 dead and 87,141 wounded in the Strip since the beginning of the war, according to data from the Palestinian Ministry of Health in Gaza.\n\nBeyond that, the Hamas Information Office consistently claims that there are approximately 10,000 missing persons under the ruins of the buildings.\n\n##\nIf we rely on these Palestinian data and add to that the terrorists who were eliminated in Israel on October 7th, we can say that we are very close to 50 thousand dead since the beginning of the war, which is slightly more than 2% of the declared population in Gaza according to the Palestinian data.\n\nAnother interesting statistic: in Gaza, about 6,000 people die every year from natural causes (old age and disease). There is evidence that during the war people who died a natural death were included in the \"martyrs\" list of the Palestinian Ministry of Health in Gaza - that is, included in the dead as a result of the war.", "location": "GAZA", "classification": "security", "score": 0.6455132355222072, "event_breakdown": "During the first week, i.e, from August 8-14, the number of Palestinians confirmed killed in the conflict in Gaza was 23, according to data released by the Palestinian Ministry of Health. During the second week, from August 15-22, the number rose to 43.\n\nIt is difficult to give exact numbers for the third week as casualties were 40 or more. The situation remains unstable. Hamas continues to fire rockets indiscriminately at Israeli cities, while Israel continues to target Hamas infrastructure in Gaza. Currently, more than 2,500 people have died in Israel, and more than 2,000 people have been killed in Gaza. The cost of the damage in both Gaza and Israel exceeds $30 billion."}, {"id": "194319b6-2a6e-4fe9-8a63-bb302b65d6b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29792/", "date": "2024-07-02 11:19", "message": "The Palestinians report 17 dead in an IDF attack near a-Shamaa' Mosque in the Zeytoun neighborhood of Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9954665149510118, "event_breakdown": "IDF Attack in Gaza City kills 17 Palestinians, injures 140\n\nAn IDF airstrike Sunday killed 17 Palestinians and wounded 140 near a-Shamaa' Mosque in the Zeytoun neighborhood of Gaza City. Hospitals in Gaza City are overwhelmed with casualties. The IDF says the strike was targeted at a Hamas facility, and that Palestinian casualties were caused by secondary explosions."}, {"id": "6e260e4a-87ae-47f4-830d-ddc614b7b3af", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29789/", "date": "2024-07-02 11:15", "message": "UNRWA on the IDF's evacuation notice to the residents of eastern Khan Yunis yesterday:\n\nWhere can 100 thousand people go? \nThe area (western Khan Yunis - AA) is completely full up to the coastline...", "location": "given\nUNRWA", "classification": "security", "score": 0.7234000780427415, "event_breakdown": "The event can be placed on a map:\nIDF evacuates Khan Yunis: Overnight Wednesday the IDF evacuated all families living in eastern Khan Yunis by striking the buildings with tank and gunfire.\nPalestinian refugees from Khan Yunis are expected to return home as soon as possible.\nMany of the buildings were evacuated by the IDF earlier in the week and were moved out of the building."}, {"id": "1b21d961-5e25-43c7-968d-36f25212bb47", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29788/", "date": "2024-07-02 11:14", "message": "The IDF spokesperson announced the death of a reserve soldier and a reserve officer from the 8th Brigade in a battle in the center of the Gaza Strip.", "location": "GAZA STRIP", "classification": "security", "score": 0.965602394154807, "event_breakdown": "IDF soldier killed in Gaza battle\nA reserve soldier and a reserve officer from the 8th Brigade were killed in battle in the Gaza Strip."}, {"id": "d07a84ef-f947-4aab-ab6b-d9c3f8bc72c1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29800/", "date": "2024-07-02 17:25", "message": "Lebanese channels: An Israeli drone attacked a vehicle near Brada al Hajar in Houla in southern Lebanon.\nIt appears there are no casualties.", "location": "Southern Lebanon", "classification": "security", "score": 0.9983151733496111, "event_breakdown": "An Israeli drone attacked a vehicle near Brada al Hajar in Houla, southern Lebanon on Sunday, according to Lebanese news channels. There are no reports of casualties."}, {"id": "4f211a53-af75-4db1-83d2-1623958a5de2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29797/", "date": "2024-07-02 15:47", "message": "The Palestinians report 12 deaths in the attack on the home of the Abu Salim family, on Abu Arif Street in Deir al-Balah in the center of the Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.9774353103435518, "event_breakdown": "EVENT: 12 Reported Deaths in Attack on Family's Home, Deir al-Balah\nLOCATION: Central Gaza Strip\nDATE: June 2022"}, {"id": "b723e790-de83-40d9-990f-eee57a72f6c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb69962/", "date": "2024-07-02 15:46", "message": "Shejaiya neighborhood in eastern Gaza City - the sixth day of the IDF's operation there: the Palestinians report the explosion of a residential complex by the maneuvering forces of the IDF.", "location": "Shejaiya neighborhood in eastern Gaza City", "classification": "security", "score": 0.990999101953959, "event_breakdown": "Shejaiya neighborhood in eastern Gaza City - the sixth day of the IDF's operation there: the Palestinians reports the explosion of a residential complex by the maneuvering forces of the IDF."}, {"id": "7e36ffe6-477d-4bb2-9ca9-8a6191676c52", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29795/", "date": "2024-07-02 13:34", "message": "The person killed in the IDF attack in southern Lebanon 👆is Muhi ad-Din Abu Della, a retiree of the Lebanese security forces.", "location": "Lebanon", "classification": "security", "score": 0.9961068940578603, "event_breakdown": "[\n  {\n    \"title\": \"IDF attack in south Lebanon\",\n    \"description\": \"BREAKING\\u000A\\u000A\\u000A\\u000A\\u000A\\u000A\\u000A\\u000AMuhi ad-Din Abu Della, a retiree of the Lebanese security forces, was kil\ned by Israeli fire in the south of Lebanon, the Lebanese Army said in a statement on Tuesday.\\u000A\\u000A\\u000A\\u000A\\u000APostgr\nElm Kitchen Israel Defense Forces deployment Hezbollah border fence Israel Defense Forces Fire\",\n    \"location\": \"Israel\"\n  }\n]"}, {"id": "f187423a-1b3c-4cd9-aa00-5b12d2134059", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29809/", "date": "2024-07-02 20:30", "message": "Following the interview of the foreign affairs advisor to Iran's Supreme Leader with the Financial Times, Hezbollah's second-in-command, Naim Qassem, also gave an interview to a Western media outlet – this time AP.\n\nQassem's interview comes after two meetings between the deputy head of German intelligence and senior Hezbollah officials in recent weeks, and he made the following statements:\n\n\"The only way to achieve calm on the southern border is through a ceasefire in Gaza (a principle Hezbollah has declared since the start of the war - AA).\n\nWe do not believe that Israel is capable of or has made a decision to wage a full-scale war against Hezbollah.\n\nIf Israel is considering a limited operation in Lebanon, it should not expect the fighting to remain limited.\n\nIf Israel starts a war, it will not control its scope or the factors involved.\"\n\n##\nSeveral senior officials simultaneously threaten Israel on Western media against a full-scale war in Lebanon.\n\nThey seem a bit worried...", "location": "Lebanon", "classification": "security", "score": 0.6768227803569521, "event_breakdown": "Following the interview of Naim Qassem with AP, a senior Hezbollah official, several senior Iranian officials threatened Israel on Western media against a full-scale war in Lebanon."}, {"id": "f3eee1f0-f1c7-4116-9369-d8be3a1d1819", "channel_id": 1560386984, "url": "", "date": "2024-07-02 20:24", "message": "And meanwhile in Rahat (an Arab town in Israel)... a routine search by the police in one of the houses.", "location": "RAHAT", "classification": "security", "score": 0.9789731541505086, "event_breakdown": "Security event:\nRahat is a town in southern Israel, near the border with the West Bank. Local police were conducting a routine search in one of the houses as part of a security operation."}, {"id": "782c60dc-27aa-453f-bfbf-c9f5a10a0db8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29805/", "date": "2024-07-02 20:19", "message": "From a survey conducted by the American polling institute Harvard Harris among a sample American population between June 28-30:\n\n67% support an Israeli response against Hezbollah if Hezbollah continues to launch rockets towards northern Israel.\n\n82% of respondents believe that Hamas should be removed from the Strip.\n\n80% of respondents support Israel over Hamas.\n\n62% of respondents think that Israel is making an effort to prevent harm to the civilian population in Gaza.", "location": "Israel", "classification": "security", "score": 0.7738298766073428, "event_breakdown": "Survey of Americans indicates that the majority supports Israeli military action against Hezbollah and Hamas."}, {"id": "29432778-c8c3-47f9-a7cd-4bd9965ecdfb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29802/", "date": "2024-07-02 20:12", "message": "Al Jazeera cites a report from the Israeli website Walla: The IDF is expanding the Netzarim Corridor from 2 km to 4 km in preparation for the third phase of the war.", "location": "NETZARIM CORRIDOR", "classification": "security", "score": 0.9098924933412408, "event_breakdown": "IDF expands the Netzarim Corridor from 2 km to 4 km ahead of third phase of war."}]