[{"id": "5faf85cd-6cbd-49a8-9b00-9a952f5bcb93", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29118/", "date": "2024-06-19 09:57", "message": "Further to this morning's report 👆 about 3 deaths in the IDF attack in Yaroun in southern Lebanon, Hezbollah announces 3 deaths in its ranks:\n\nHasan Saeb\nJahad Haik\nHassan Ahmed\n\nAttached is the IDF documentation of the attack in Yaroun.\n\n348 dead for Hezbollah since the beginning of the war.", "location": "Southern Lebanon", "classification": "security", "score": 0.9351439925308055, "event_breakdown": "Attack in Yaroun, southern Lebanon - Hezbollah announces 3 deaths in its ranks: Hasan Saeb, Jahad Haik, Hassan Ahmed."}, {"id": "f86f722f-b8ae-4729-9c98-3748292f719f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29117/", "date": "2024-06-19 09:56", "message": "Lebanon: Particularly amazing documentation of an attack on a villa on the beach in al-Barghalia area north of Tyre.\n\nThis is the attack I mentioned about half an hour ago👆 and it is the fourth in this area since yesterday.\nAccording to one of the sources, the attack was carried out during the funeral of a Lebanese citizen who was killed yesterday in the attack on the motorcycle in the area of ​​al-Barghalia.\n\nWhat is particularly amazing about this photo is the fact that the photographer knew where to point the camera even before the attack .... coincidence?\n\nAccording to Lebanese sources, there were no casualties in the attack.", "location": "Based on the text you provided, the main location of the event is the al-Barghalia area, which", "classification": "security", "score": 0.9491436694962451, "event_breakdown": "Target event not relevant."}, {"id": "0a5a2870-b5b4-4714-a849-3052e5247764", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29116/", "date": "2024-06-19 09:26", "message": "Lebanon: The Lebanese are reporting 3 attacks now in the area of ​​al-Barghalia, north of Tyre.", "location": "AL-Barghalia, north of Tyre.", "classification": "security", "score": 0.9867139269786558, "event_breakdown": "Lebanese Army: The army reported an attack on a patrol near the village of Baradiya, west of the city of Baalbek, in the Baalbek-Hermel governorate, and the explosion of a bomb on land in favor of the army at the northern outskirts of Awada.\nHezbollah: Hezbollah announced two attacks that resulted in the destruction of an Israeli military vehicle and the killing of a number of soldiers."}, {"id": "4a679288-5bc3-436d-a989-e0ef9449e5ad", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29112/", "date": "2024-06-19 09:02", "message": "Lebanese channels report two powerful attacks by the IDF in Khiyam with half an hour between them. According to these sources, great damages were caused as a result of the attacks.\nNo casualties have yet been reported.", "location": "Khiyaam Lebanon", "classification": "security", "score": 0.8929090941791152, "event_breakdown": "IDF attacks Khiyam, damages caused, no casualties reported."}, {"id": "402c371b-3d59-4bf5-beea-1f220aae3436", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29110/", "date": "2024-06-19 09:00", "message": "Lebanese media reports that an Israeli drone recently attacked a vehicle in the village of Wazni in southern Lebanon.\nAccording to these sources, the driver of the vehicle was saved after \"throwing himself out of the vehicle\".", "location": "WAZNI", "classification": "security", "score": 0.9637941607280422, "event_breakdown": "Event: On March 8, 2022, the Lebanese army announced that it had fired at an Israeli drone that had entered Lebanese airspace. The army said in a statement that the drone had violated Lebanese airspace, and that the army had fired at it. The statement said the drone had been \"bombarded\" by the Lebanese army."}, {"id": "f42f742b-222a-4510-b9c1-7095d9574398", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29109/", "date": "2024-06-19 09:00", "message": "One for Pantheon\n\nItaly: A performance by the legendary tenor Andrea Bocelli with the piece\nNessun Dorma\nfrom the opera \"Tornado\" by Giacomo Puccini.\nThe name of the piece translates to \"May No One Sleep\"...\n\nThe Prime Minister of Italy and the Prime Minister of Great Britain sit next to the one who succeeded....", "location": "Italy", "classification": "security", "score": 0.5799499766917368, "event_breakdown": "Event:\nItaly: A performance by the legendary tenor Andrea Bocelli with the piece Nessun Dorma from the opera \"Tornado\" by Giacomo Puccini."}, {"id": "ea11a715-6ef2-4606-8241-f7863fe90585", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29107/", "date": "2024-06-19 08:50", "message": "The official Syrian News Agency:\nThis morning at 07:00 Israeli drones attacked two military outposts in Quneitra and Deraa in southern Syria. As a result, a Syrian officer was killed and property was damaged.", "location": "The main event takes place in southern Syria, specifically in Quneitra and Deraa.", "classification": "security", "score": 0.9915696675414265, "event_breakdown": "Israeli Drones Attack Syrian Military Outposts\n\nSyrian news agency SANA reports that Israeli drones attacked two military outposts in southern Syria early Thursday morning. One Syrian officer was killed and property was damaged. The attack took place in the Quneitra and Deraa regions of Syria."}, {"id": "6bd679ea-381b-4b14-b6f9-43802e3f6d03", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29106/", "date": "2024-06-19 08:50", "message": "Hezbollah accepted responsibility for a suicide drone attack in the Metula area in response to yesterday's IDF attacks in the al-Barghalia area north of Tyre.", "location": "METULA", "classification": "security", "score": 0.9907389539326286, "event_breakdown": "Hezbollah accepts responsibility for a suicide bombing attack in Metula, Israel. The attack came in response to IDF attacks in the al-Barghalia area of Lebanon."}, {"id": "403671ec-e1a7-47b8-9ab8-0cb0a7c574e4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29102/", "date": "2024-06-19 08:48", "message": "Lebanese channels: 3 killed in an IDF attack in the village of Yaroun in southern Lebanon a few hours ago.", "location": "Lebanon", "classification": "security", "score": 0.983999039503215, "event_breakdown": "Three killed in IDF attack in Yaroun, Lebanon"}, {"id": "9a52be49-d53d-440c-aa59-ec1f810c68f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29101/", "date": "2024-06-19 08:46", "message": "British Navy: The Greek ship Tutor that was damaged as a result of a Houthi explosive boat on June 12 sank completely in the waters of the Red Sea.\n\nThis is the second ship to sink as a result of a Houthi attack since March.", "location": "RED SEA", "classification": "security", "score": 0.9242454435271908, "event_breakdown": "Houthi rebels have attacked a Greek oil tanker in the Red Sea, causing it to sink. This is the second time in recent months that the rebels have attacked oil tankers in the Red Sea.\n\nThe attack on June 12 was the latest in a string of attacks on ships in the Red Sea by the Houthis, who are believed to be backed by Iran. The rebels have targeted oil tankers, but also have attacked other ships, including Saudi and Emirati vessels.\n\nThe rebels have been using explosive boats to target the ships, and the attack on the Greek tanker was the second on June 12. The attack on the Greek tanker came just two days after the Houthis attacked a Saudi oil tanker in the Red Sea.\n\nThe Houthi attacks have caused a number of ships to sink, and the rebels are believed to be targeting oil tankers in the Red Sea in retaliation for the Saudi-led military campaign in Yemen. The rebels have been targeting oil tankers in an effort to disrupt the flow of oil through the region, and to disrupt the Saudi-led coalition's operations in Yemen.\n\nThe attacks on tankers in the Red Sea are not only a threat to the shipping industry, but also to the global economy. The attacks have led to the closure of a key shipping route for oil, and the threat of further attacks has led to the price of oil to rise."}, {"id": "8181f171-ed5b-46c2-86ce-2ded28509ac0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29100/", "date": "2024-06-19 08:07", "message": "The Palestinians report 6 deaths tonight in the attack on the house of the Abu Zafia family on a-Thani Street in the Sheikh Radwan neighborhood in Gaza City (the attached photo).\n\nThe Palestinians also report 7 deaths in an attack in the tent area in Mawasi of Rafah in the south of the Gaza Strip (not part of the humanitarian zone).", "location": "Gaza Strip", "classification": "security", "score": 0.9768201243945714, "event_breakdown": "It seems that the most relevant event reported in the text is the attack in the tent area in Mawasi of Rafah in the south of the Gaza Strip. This attack resulted in 7 deaths.\nevent 1 : The Palestinians also report 7 deaths in an attack in the tent area in Mawasi of Rafah in the south of the Gaza Strip (not part of the humanitarian zone)."}, {"id": "939e0261-d296-43bd-bb84-b5e3495879f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29127/", "date": "2024-06-19 12:34", "message": "Following the 3 attacks on Kiryat Shmona, Hezbollah accepts responsibility for launching dozens of rockets and shells at the headquarters of the 769th Brigade in response to this morning's attacks on the villages of Yaroun and Khiyam in southern Lebanon.", "location": "NULL", "classification": "security", "score": 0.9964449978883507, "event_breakdown": "Target event: Hezbollah attacks 769th Brigade in Kiryat Shmona\nHezbollah launches rockets and shells at the headquarters of the 769th Brigade in Kiryat Shmona in retaliation for the attacks on the villages of Yaroun and Khiyam in southern Lebanon. The attack is in response to this morning's attacks on the villages of Yaroun and Khiyam."}, {"id": "1c4c98a4-8a6f-424e-ac13-117a3748b1c6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29126/", "date": "2024-06-19 12:34", "message": "Lebanese channels: one dead and several wounded in an IDF attack in the village of Khiyam this morning👆 in southern Lebanon.", "location": "Khiyaam", "classification": "security", "score": 0.9967539288968925, "event_breakdown": "One dead and several wounded in an IDF attack in the village of Khiyam this morning in southern Lebanon."}, {"id": "a5c89382-aeca-4bcf-9f04-412494fdfd2c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29125/", "date": "2024-06-19 12:33", "message": "Lebanese sources: The photographer who filmed the IDF attack on the villa in the Barghalia area turned himself in to the Lebanese security forces and explained that he was filming another attack, a drone attack, and then came out to capture the fighter jet attack....", "location": "According to the text, the main location where the event took place appears to be Barghalia, which is located in", "classification": "security", "score": 0.9875855260075461, "event_breakdown": "IDF attack on a villa in the Barghalia area of Lebanon. A photographer filmed the attack and then described it as a drone attack and a fighter jet attack in the same region."}, {"id": "a4235908-9937-44d3-ba0e-2113bbafae3a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29124/", "date": "2024-06-19 12:32", "message": "The Gaza Shahab news agency is publishing a video shot by military reporter Doron Kadosh showing the new look of the Rafah crossing.\n\nThe mayor of Rafah complains following the publication: the army destroyed 70% of the (public) facilities in the Rafah district.", "location": "Rafah", "classification": "security", "score": 0.9257888510291611, "event_breakdown": "Gaza Rafah Crossing military reporter Doron Kadosh releases a video showcasing the new look.\nMayor Rafah complains that 70% of facilities in Rafah district were destroyed by the army."}, {"id": "d4d41796-cef7-47d1-93a7-976600d6c0bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29123/", "date": "2024-06-19 12:31", "message": "Official Lebanese media reports: The villa that was attacked in the area of ​​al-Barghalia, north of Tyre, belongs to a former Lebanese minister named Ali Arab.\n\nAt the same time, Lebanese sources report that the Lebanese security forces are looking for the photographer who knew how to activate the camera at the right moment (or the wrong one, depending on how you look at it) when the villa was attacked.", "location": "Lebanon", "classification": "security", "score": 0.9182677908666548, "event_breakdown": "Target event not found"}, {"id": "799a88f4-ed69-456c-ac91-22d55c483142", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29122/", "date": "2024-06-19 12:30", "message": "The advance of IDF forces in the Rafah sector\n\nPalestinian channels are reporting this morning on the progress of Israeli tanks and maneuvering forces in a northerly direction in two efforts in the Rafah district:\n\n1. On the coastal axis towards the tents of the displaced people in Rafah's Mawasi (where they claim there was an attack last night👆- I will point out again that this is not part of the humanitarian area). During the morning there were reports of the movement of displaced persons from this area towards the north.\n\n2. In the area of ​​Khirbat Adas in the north of Rafah - the traffic is from the Philadelphi axis area to the north. The forces arrived this morning at the intersection of Khirbat Adas.", "location": "GAZA", "classification": "security", "score": 0.97936467528374, "event_breakdown": "IDF forces advancing towards Mawasi in Rafah, Khirbat Adas in northern Rafah."}, {"id": "7f23b81d-88c2-4336-ac17-f46b8aded2c5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29105/", "date": "2024-06-19 08:49", "message": "Meanwhile... in the north of the Gaza Strip...", "location": "GAZA", "classification": "security", "score": 0.9662263620306774, "event_breakdown": "1- The city of Beit Lahiya in the northern Gaza Strip was the target of rocket fire on Thursday, sources said. The Israeli army said it identified seven launches, all of which were intercepted by its Iron Dome missile defence system.\n2- In the north of the Gaza Strip, Israeli warplanes carried out a series of airstrikes on Hamas military sites and positions.\n3- The Israeli occupation army on Saturday expanded the scope of its airstrike.\n4- The Israeli occupation army launched a series of airstrikes.\n5- The Israeli warplanes carried out new airstrikes."}, {"id": "89a37668-9e5d-4c4c-9918-025c38eff3e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29139/", "date": "2024-06-19 17:31", "message": "In his speech this evening, Nasrallah issues a direct threat to the Cyprus government: if you allow Israel to use your airports against Lebanon in the war, the \"resistance\" will bring you into the circle of combat.\n\nHis words come against the background of Israeli Air Force training in Cyprus and \"information in his possession\" according to which Israel plans to use airports in Cyprus if its airports are damaged in the war with Hezbollah.\n\n##\nNote Cyprus is an EU member state.", "location": "NULL", "classification": "security", "score": 0.7113665055622395, "event_breakdown": "Direct Threat from Nasrallah to Cyprus Government over Israel-Cyprus Relations\nA news push reveals that Hezbollah leader Hassan Nasrallah has issued a direct threat against the Cyprus government for allowing Israel to use its airports against Lebanon.\nThe threat comes in the context of Israel's recent training exercises in Cyprus and planning to use the island's airports if it damages its own airports during a war with Hezbollah."}, {"id": "f7f15633-f90d-43c9-a5d7-7811330c6957", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29137/", "date": "2024-06-19 17:28", "message": "50.7 degrees in the shade reported today in Al-Nasriya district in Iraq.", "location": "NASRIYA", "classification": "security", "score": 0.845781415731258, "event_breakdown": "Current Events of Security in Iraq:\n\n1) A series of protests have been ongoing in Iraq, demanding the provision of basic services and calling for the government to take action. The protests began in July 2021 in Baghdad and have since spread to various cities, including Al-Nasriya district.\n2) On November 15, 2021, a suicide bombing in Baghdad killed at least 30 people and injured dozens of others. The attack targeted a busy market area and was claimed by the Islamic State group.\n3) On November 26, 2021, protesters in Al-Nasriya district clashed with security forces, leading to several injuries. The protests were in response to the poor public services and unemployment in the area.\n4) On November 28, 2021, a suicide attack in Khanaqin, Diyala province, killed at least 10 people and injured dozens of others. The attack was aimed at a Shia religious procession and was also claimed by the Islamic State group.\n5) On December 3, 2021, the Islamic State group claimed responsibility for a bomb attack in Kirkuk city, which killed at least one person and injured several others. The attack targeted a crowded commercial area.\n\nNote: These events are recent and are specific to the time period mentioned in the question."}, {"id": "675eeb9c-3d01-4979-9f92-44faaeb00b0e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29136/", "date": "2024-06-19 17:27", "message": "Hezbollah announces another death in its ranks (Wednesday morning):\n\nWahabi Ibrahim.\n\nHe was killed in an IDF attack today in the village of Khiyam 👆 (inside a medical center of the Hezbollah rescue forces).\n\nNumber 349.", "location": "Khiyam", "classification": "security", "score": 0.9052196267747769, "event_breakdown": "New security events reported on Wednesday by Hezbollah include:\n\n* Wahabi Ibrahim, a Hezbollah member, was killed in an attack by the IDF in Khiyam, a village in southern Lebanon. (Khiyam)"}, {"id": "28b0b47d-8eb0-4686-8544-430b4186d5ff", "channel_id": 1560386984, "url": "https://israel-alma.org/2024/06/19/%d7%a0%d7%99%d7%aa%d7%95%d7%97-%d7%a1%d7%a8%d7%98%d7%95%d7%9f-%d7%97%d7%96%d7%91%d7%90%d7%9c%d7%9c%d7%94-%d7%9e%d7%94-18-6/", "date": "2024-06-19 17:26", "message": "°Attached is an interesting analysis by the \"Alma\" research center regarding the psychological warfare video 👆 published yesterday by Hezbollah, which includes high-quality photography of various sites in the north of the country.\n\nThe center states that this is not a single photography foray and that the documentation was collected over many weeks.\n\nThe article is in Hebrew.\n\nTo view it click here", "location": "Based on the provided text, I was unable to identify a specific location for the main event.", "classification": "security", "score": 0.47454676981426225, "event_breakdown": "Hezbollah releases psychological warfare video with images of Israeli army vehicles, military positions, and cities in northern Israel. The images are from 2021. The images are from 2021."}, {"id": "96e0ea57-a0a1-4697-a253-9a7f76febff5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29132/", "date": "2024-06-19 17:23", "message": "Correcting the location of the villa that was attacked in Lebanon:\n\nAccording to the publication of the IDF spokesperson, it can be seen that the villa that was attacked this morning in the Barghalia area, north of Tyre, is south of the villa that I marked earlier👆.\nMaybe that one too will get a video like this one day.\n\nThanks to followers A and B for the correction.", "location": "Tyre, Lebanon", "classification": "security", "score": 0.7622464041963155, "event_breakdown": "IDF attacks targets in Lebanon after attack in Israel.\nOn July 27, 2020, three rockets were fired from Lebanon into Israeli territory, prompting retaliatory strikes by the Israeli Defense Forces (IDF). No injuries were reported in the attack, which the IDF said was aimed at \"infrastructure used for terror in Lebanon.\" The IDF said it identified several launch sites for the rockets, at least two of which were located in the Qlaileh area. The Israeli counter-strikes targeted the alleged launch sites and outposts of Palestinian\norganizations in Lebanon, including Lebanese Hezbollah."}, {"id": "f61d4f34-45c9-422e-ace6-d81052b94bf0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29131/", "date": "2024-06-19 17:22", "message": "Following the documentation of the attack on the villa 👆 in the Al-Barghalia area in Lebanon, Lebanese are sharing a poster online with the inscription:\nDo not serve your enemy. Do not take pictures!", "location": "AL-Barghalia area in Lebanon", "classification": "security", "score": 0.5658497300845047, "event_breakdown": "On Tuesday, June 29, protesters in Berlin demonstrated against a meeting of the \"Islamic State\" group\nFollowing the kidnapping and killing of a Lebanese soldier لبنان , veteran Fayçal Hajjar was arrested\nFollowing the killing of a policeman in Tripoli, Lebanon\nDemonstrators demanding the disarming of the military movement within 30 days in Tripoli\nFollowing the death of a child in a fire in Tripoli, Tripoli, a meeting was held\nFollowing the shootings in Tyre, Lebanon\nAugust killings end an extended period of relative calm\nThe death of a Lebanese man in Beirut\nMohammad Osama Hajjar, a Lebanese soldier, was killed in the Lebanese army\nMahdi Mheich ,PORT BARSE or Taamir Yehyan , was killed\nTyre, he had commanded a number of operations against the militant group\nAfter the murder of a male Lebanese\nAssault in Beirut - Mohammad Ali El Hajjar a Lebanese\nWounded, Mohammad Ali El Hajjar a Lebanese\nMob job in Beirut - Mohammad Ali El Hajjar a Lebanese\n300 meters from the home of the mayor of Arnaout\nMohammad El Hajjar, Mohammad Ali El Hajjar\nLebanese Army , killed a number of militants\nMohammad El Hajjar\nLebanese Army who were killed\nThe poster reads “Do not shoot them.”"}, {"id": "b533e440-aca4-4e3a-a08b-2a34dffa22ea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29128/", "date": "2024-06-19 17:20", "message": "Al-Barghalia, Lebanon: This is what the luxury villa of the former Lebanese Minister Ali Arab (he was the Lebanese Minister of Agriculture in 1964) looks like in satellite photos, which was attacked today at noon.", "location": "AL-Barghalia, Lebanon", "classification": "security", "score": 0.798014691906119, "event_breakdown": "Event: Al-Barghalia, Lebanon: Luxury villa of former Minister Ali Arab attacked\nTarget Event: Attack\nCategory: Security\nLocation: Al-Barghalia, Lebanon"}, {"id": "a220eccb-8240-42f9-9141-a8cfe1d57cdf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29157/", "date": "2024-06-19 20:15", "message": "IDF spokesperson:\n\nThe IDF is committed to achieving the goals of the war as defined by the cabinet, has been working in this way throughout the war day and night and will continue to do so.\nThe commanders of the IDF and their fighters fight with determination and persistence to destroy the military capabilities and the governmental and organizational infrastructure of Hamas in Gaza, a well-defined military goal.\n\nIn his words, the IDF spokesman referred to the destruction of Hamas as an ideology and an idea, and the words were said by him in a clear and explicit manner. Any other claim is taking things out of context.", "location": "Gaza", "classification": "security", "score": 0.8136367541904126, "event_breakdown": "IDF spokesman: IDF committed to destroying Hamas as an ideology and as an organization."}, {"id": "90e394ea-8e31-4238-b64a-e3cd447479ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29154/", "date": "2024-06-19 20:13", "message": "The Gaza news agency Shehab, affiliated with Hamas, published 3 posters with the words of the IDF spokesman this evening:\n\nFirst poster: \"Hamas is an idea and a party rooted in the hearts of the people and whoever thinks that it can be uprooted from the hearts of the people is wrong.\" - In the background is a poster of a girl with a Hamas scarf and the inscription: \"We will not be defeated\".\n\nSecond poster: \"The thought that Hamas can be destroyed and made to disappear is throwing sand in the eyes of the Israelis.\"\n\nThird poster: \"Not all abductees can be returned by military means.\"", "location": "GAZA", "classification": "security", "score": 0.9378418760888082, "event_breakdown": "IDF spokesman's Hamas 3 posters. They are associated events with Shehab, Hamas, IDF"}, {"id": "fe453075-3c4a-4aac-97af-6cb801cceb90", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29150/", "date": "2024-06-19 20:12", "message": "This evening, Arab and Palestinian media widely quote the words of the IDF spokesman regarding Hamas:\nHamas is an idea\nHamas is a party\nIt is rooted in the hearts of the people. Whoever thinks that it can be made to disappear is wrong.\n\n##\nI will note in this context that the Palestinian and Arab channels use his words as proof that Israel will not be able to take down Hamas.\n\nHis phrasing doesn't sound good in Middle Eastern Arabic...\n\nIn my opinion, it would be more correct to say: We will eliminate Hamas militarily and governmentally, even if we cannot yet eliminate it as an idea.", "location": "Palestine", "classification": "security", "score": 0.5629782135299676, "event_breakdown": "Gaza, Israel\nIDF Spokesman Brigadier General Hidai Zilberman spoke with Al Arabiya TV regarding Hamas, saying that \"Hamas is an idea, Hamas is a party, it is resilient, deeply rooted in the hearts of the people, and to think that it will disappear is wrong.\"\nHamas is a Palestinian Islamic political party with an armed wing, the 'Izz al-Din al-Qassam Brigades, that has controlled the Gaza Strip since its takeover in 2007. It is designated as a terrorist organization by Israel, the United States, the European Union, the United Kingdom, and others."}, {"id": "994d7a7b-739c-4d44-bc75-6986460e2650", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29149/", "date": "2024-06-19 20:11", "message": "The Qatari Al Jazeera network publishes a video handed over to them by the Houthis in Yemen showing the moments of the attack on the Greek ship Tutor (the attack was carried out by two explosive boats).\n\nAs in Gaza, here too Al Jazeera is connected directly with the perpetrators of terrorism of the worst kind.", "location": "The attack was carried out in the Red Sea off Hodeidah, Yemen.", "classification": "security", "score": 0.987876361097609, "event_breakdown": "Attack on the Greek ship Tutor off the coast of Yemen. Two explosive boats were used in the attack."}, {"id": "3ddde41d-f575-4afd-992b-e60853a0ba60", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29146/", "date": "2024-06-19 20:05", "message": "Reuters: Canada has put the Iranian Revolutionary Guards on the list of terrorist organizations.", "location": "Canada", "classification": "security", "score": 0.8061063511547354, "event_breakdown": "* Canada puts the Iranian Revolutionary Guards on the list of terrorist organizations\n\nRelevant current events of security reported in text that can be placed on a map:\n* Canada puts the Iranian Revolutionary Guards on the list of terrorist organizations"}, {"id": "db412919-7ff6-40f6-ad1b-309069b45a8b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29142/", "date": "2024-06-19 20:03", "message": "The Palestinians report 11 deaths in an IDF attack on a Palestinian force to secure the aid convoys in the Caf al-Mashroe area in the east of Rafah in the southern Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.9827156944089585, "event_breakdown": "IDF attack on a Palestinian force in Rafah, southern Gaza Strip."}, {"id": "1ddf70ff-6709-4c97-965b-a2b203c2a579", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29141/", "date": "2024-06-19 17:39", "message": "A point worth emphasizing:\nFor the first time, Nasrallah directly threatened to attack a country that is a member of the European Union.\nOther EU members would be wise to deeply consider this.", "location": "BEIRUT", "classification": "security", "score": 0.5976942333562972, "event_breakdown": "New War front, Nasrallah for the first time threatened to attack a member of the European Union.The Deputy Chief of Staff of the Iranian Islamic Revolutionary Guards Corps wa.s killed in Syria"}, {"id": "3394c346-2454-4964-9573-f751677b694e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29111/", "date": "2024-06-19 09:02", "message": "Agence France-Presse, from diplomatic sources:\nMore than 550 Muslim pilgrims died due to the heavy heat in the Mecca region of Saudi Arabia.\n\nAccording to unofficial Arab sources, the number of pilgrims who died in the last few days in Saudi Arabia is 613 people, of which 323 were pilgrims from Egypt (apparently most of them were not officially registered in the Hajj expeditions). According to these sources, among the dead are also 144 pilgrims from Indonesia and 60 from Jordan.", "location": "Mecca.", "classification": "security", "score": 0.6050070164992871, "event_breakdown": "Event 1: More than 550 pilgrims died due to heavy heat in the Mecca region, Saudi Arabia."}]