[{"id": "31137a2e-0bc1-4b73-8164-4bc8a9098935", "channel_id": 1574173609, "url": "", "date": "2024-05-25 00:52", "message": "בדקות אלו נכנסים כוחותינו לתוך טול כרם, כך על פי דיווחים מהמרשתת הערבית.\nפרטים במידת הצורך...\n\nיוסי אליעזר\n301 העולם הערבי בטלגרם\n\nhttps://t.me/arabworld301", "location": "301 העולם הערבי בטל", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "Security Events:\n\n1. Arab World 301 hosts a report on the Jordanian government's response and measures to address the COVID-19 pandemic.\n2. The report examines the government's efforts to contain the spread of the virus, including lockdown measures, awareness campaigns, and vaccine rollout.\n3. It also discusses the impact of the pandemic on the Jordanian economy and healthcare system.\n4. The report includes a timeline of key events and statistics related to COVID-19 in Jordan.\n5. Arab World 301 also covers the Israeli-Palestinian conflict.\n6. Recent reports address a ceasefire agreement between Israel and Hamas, prospects for a two-state solution, and the role of regional players in the conflict.\n7. Arab World 301 reports on security developments in the Arab world.\n8. Recent reports cover the fight against terrorism, regional alliances and conflicts, and the impact of regional events on global security."}, {"id": "3ff1943d-fca1-4812-9f92-52ed49bffdcf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27797/", "date": "2024-05-25 09:28", "message": "Official Syrian sources report that a Syrian officer was killed this morning by an explosive device planted in his vehicle in the Almaza neighborhood in the capital Damascus.", "location": "Damascus", "classification": "security", "score": 0.9946289971216093, "event_breakdown": "Security Events:\n\n1. A Syrian officer was killed by an explosive device planted in his vehicle in the Almaza neighborhood in Damascus."}, {"id": "bc1ad195-841a-436d-8b52-95baed891929", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27796/", "date": "2024-05-25 09:27", "message": "The Secretary General of the United Nations, Antonio Guterres, arrived at the office of the Iranian delegation to the United Nations to personally express his condolences on the death of the Iranian president and his foreign minister.", "location": "NEW YORK", "classification": "security", "score": 0.5737932307603457, "event_breakdown": "Chief of UN Offers Condolences for Iran's National Leaders"}, {"id": "45240290-b635-48fe-9b2f-a6340118514e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27788/", "date": "2024-05-25 05:41", "message": "Hezbollah announces two deaths in its ranks yesterday:\n\nHassan A-Shaabi from the village of Qlaileh in southern Lebanon.\nHe was apparently killed in the IDF attack in Meiss el-Jabal 👆\n\nHossein Almola, a resident of Bakka district.\nHe was also killed in an IDF attack in Meiss el-Jabal.\nAttached is a video of him launching rockets.\n\nNumbers 315 and 316", "location": "The main event is taking place in Meiss al-Jabal.", "classification": "security", "score": 0.9901481943538379, "event_breakdown": "Security events:\n\n1. IDF attack in Meiss el-Jabal: Hezbollah announces two deaths in its ranks and release of a video showing a launch rocket from the area.\n2. Hossein Almola, a resident of Bakka district, is also killed in an IDF attack in Meiss el-Jabal."}, {"id": "8ea376d1-d80b-4f5f-aba7-e8238d2a29d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27787/", "date": "2024-05-25 05:32", "message": "Journalist Hasan Eslaiah documents an attack in the tent area in Mawasi in Khan Yunis yesterday.\n\nHe points out that before the attack Israel announced the evacuation of the area (this is how he was able to photograph the moment of the attack).\nThe IDF apparently wanted to attack a terrorist infrastructure on the spot and not a human target.", "location": "GAZA", "classification": "security", "score": 0.9687754861090586, "event_breakdown": "Security Events:\n\n1. Attack in the tent area in Mawasi, Khan Yunis.\n2. Evacuation announcement prior to the attack.\n3. IDF targeting a terrorist infrastructure."}, {"id": "a9c0be5b-48f5-4e52-bd8c-da0ad0bbafae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27812/", "date": "2024-05-25 14:39", "message": "Syrian sources: Luay Naif, an officer with the rank equivalent to lieutenant colonel, who holds a senior position in the recruitment branch of the Syrian army, is the officer who was killed in the explosion of the explosive device in his car this morning in Damascus. Naif is a resident of Deir ez-Zor in northeastern Syria.", "location": "Damascus", "classification": "security", "score": 0.9964568329801142, "event_breakdown": "Security Events:\n\n1. Explosion of an explosive device in a car in Damascus, Syria.\n2. Death of Luay Naif, an officer with the rank of lieutenant colonel in the recruitment branch of the Syrian army.\n3. Location of Naif's residence - Deir ez-Zor, northeastern Syria.\n4. Naif's position within the Syrian army - a senior position in the recruitment branch."}, {"id": "7d43c43d-4202-4f08-ba3d-59c3fbcc5fd2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27811/", "date": "2024-05-25 14:08", "message": "The Palestinians report 31 deaths in three attacks earlier today in the Gaza Strip:\n\n1. 15 killed in the attack on the house of the Jihad Zweidi family in Beit Hanoun in the north of the Gaza Strip.\n\n2. 10 dead and 17 wounded in the attack on the Nazla school in the Siftawi area, in Jabaliya in the north of the Gaza Strip.\n\n3. 6 killed in an attack on a group of people in the Wadi Bridge Gaza area in the north of Nuseirat (the center of the Gaza Strip).", "location": "Gaza Strip.", "classification": "security", "score": 0.9927030024470213, "event_breakdown": "1. Three separate attacks in the Gaza Strip, resulting in 31 deaths.\n2. 15 people were killed in the attack on the house of the Jihad Zweidi family in Beit Hanoun.\n3. Ten people were killed in the attack on the Nazla school in the Siftawi area.\n4. Six people were killed in an attack on a group of people in the Wadi Bridge Gaza area."}, {"id": "c50be37a-b305-4441-b8bd-103f9f0ce79d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27810/", "date": "2024-05-25 11:07", "message": "Syrian sources: one dead and three injured in the Israeli drone attack on the Hezbollah truck and its escort vehicle in Qusayr, Syria.", "location": "Qusayr, Syria", "classification": "security", "score": 0.995940079715838, "event_breakdown": "Syrian sources: one dead and three injured in the Israeli drone attack on the Hezbollah truck and its escort vehicle in Qusayr, Syria.\n\nList of security events:\n\n1. Israeli drone attack on Hezbollah truck and its escort vehicle in Qusayr, Syria.\n\nThe events are listed without conclusions or summary sentences."}, {"id": "cf06a3cc-97b3-4a24-b9b4-cc2df7a47de8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27809/", "date": "2024-05-25 11:07", "message": "Further to this, Syrian sources report that the Israeli drone attacked a Hezbollah military truck near the Dabaa airfield in Qusayr, as well as the truck's escort vehicle.", "location": "NULL", "classification": "security", "score": 0.9908622523827663, "event_breakdown": "Security Events:\n\n1. Israeli drone attack on Hezbollah military truck near the Dabaa airfield in Qusayr.\n2. Israeli drone attack on escort vehicle of Hezbollah military truck near Dabaa airfield in Qusayr."}, {"id": "a65b04d1-f731-4c64-b20d-dbe67050b818", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27807/", "date": "2024-05-25 11:05", "message": "Additional documentation of the area that was intensively attacked yesterday afternoon in the Shabura neighborhood in Rafah, where, as assumed by Israeli media, a Rafah Brigadier General of the Izz ad-Din al-Qassam Brigades, Muhammad Shabana, was located.", "location": "GAZA CITY", "classification": "security", "score": 0.9875111100249394, "event_breakdown": "Security Events:\n1. Yesterday afternoon, the Shabura neighborhood in Rafah was attacked by an unknown group.\n2. The attack was attributed to an Israeli airstrike by the Israeli media, who assumed the target was Brigadier General Muhammad Shabana, a Rafah military commander in the Izz ad-Din al-Qassam Brigades.\n3. The area is now under Israeli occupation and is currently being searched.\n4. The attack also caused no additional damage to the site, but significant numbers of people were injured and families were displaced by the incident."}, {"id": "ce14f95b-05bf-4c94-8ec6-1a1d0a4624dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27806/", "date": "2024-05-25 11:01", "message": "Israeli media: Part of the American floating dock that was placed in Gaza drifted to the Ashdod area due to the waves and the weather.", "location": "GAZA", "classification": "security", "score": 0.6357293348480896, "event_breakdown": "Event 1: Part of the American floating dock that was placed in Gaza drifted to the Ashdod area due to the waves and the weather.\nEvent 2: American floating dock placed in Gaza Strip."}, {"id": "0fbd3876-eeee-4bdc-8ec1-2b23703101c1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27805/", "date": "2024-05-25 11:01", "message": "Syrian sources report that a couple hours ago an Israeli drone attacked a car and a truck in the Qusayr area, a Hezbollah stronghold in Syria's Homs province, close to the border with Lebanon.", "location": "Homs", "classification": "security", "score": 0.9798624546141972, "event_breakdown": "List of security events:\n\n1. An Israeli drone attacked the Qusayr area in Syria's Homs province, near the border with Lebanon."}, {"id": "699d52fe-7948-48d6-92e4-2aa90b2d784e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27801/", "date": "2024-05-25 11:00", "message": "Hezbollah supporters are celebrating today the 24th anniversary of the IDF withdrawal from southern Lebanon.\n\nThe attached photos are from May 2000.", "location": "LEBANON", "classification": "security", "score": 0.8675110565073324, "event_breakdown": "Security Events:\n\n* IDF withdrawal from southern Lebanon on May 24, 2000"}, {"id": "a74b298f-6c82-49f2-8289-81984680fe13", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27798/", "date": "2024-05-25 10:31", "message": "Taiwan's Ministry of Defense reports that this morning 62 (Chinese) fighter planes and 27 (Chinese) ships were spotted in the Taiwan area. 47 of the planes violated Taiwan's airspace.\n\n##\nChina continues to provoke Taiwan and the West.", "location": "Taiwan", "classification": "security", "score": 0.4274894175505787, "event_breakdown": "62 (Chinese) fighter planes and 27 (Chinese) ships were spotted in the Taiwan area\n47 of the planes violated Taiwan's airspace"}, {"id": "4faacceb-963d-4c1e-8d46-8b1a5877885f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27827/", "date": "2024-05-25 18:59", "message": "The death of Nasrallah's mother can generate interesting intelligence opportunities...", "location": "BEIRUT, Lebanon", "classification": "security", "score": 0.7759967988935957, "event_breakdown": "Title: Death of a High-Value Target's Mother - Potential Security Events\n\n1.1. Death of a High-Value Target's Mother - Beirut, Lebanon\n\nEvent Description: News reports the passing away of Nasrallah's mother, the influential mother to Hezbollah Secretary-General, Hassan Nasrallah.\n\n1.2. Nasrallah's Personal Presence at the Funeral - Beirut, Lebanon\n\nEvent Description: Nasrallah confirmed his personal attendance at the funeral, indicating high importance and vulnerability.\n\n1.3. Nasrallah's Travel to Beirut - Beirut, Lebanon\n\nEvent Description: Nasrallah's departure from his known location highlights movement patterns and potential vulnerabilities.\n\n1.4. Potential for Intelligence Opportunities - Beirut, Lebanon\n\nEvent Description: The presence of Nasrallah in a new location creates opportunities for intelligence-gathering through surveillance and sources.\n\n1.5. Potential for Security Threats - Beirut, Lebanon\n\nEvent Description: Nasrallah's presence makes him a potential target for hostile actors seeking to capitalize on potential vulnerabilities.\n\n1.6. Intelligence and Counter-Intelligence Activities - Beirut, Lebanon\n\nEvent Description: Hostile actors may prioritize intelligence-gathering activities to capitalize on the potential opportunities presented.\n\n1.7. Security Arrangements and Surveillance - Beirut, Lebanon"}, {"id": "6d4aa23f-ced1-4b6d-a2f8-30dfbf2270f9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27824/", "date": "2024-05-25 18:58", "message": "Lebanon: Following the death of the mother of Hezbollah Secretary General Hassan Nasrallah, the Hezbollah organization and the Amal movement opened a condolence house in the Musa al-Sidder hall in the al-Shiyach area of ​​Beirut, where they will welcome the comforters.\n\nNasrallah has a brother named Jihad al-Huseini who is a senior member of the Amal movement and therefore a \"joint war room\" was opened for condolences.", "location": "Beirut", "classification": "security", "score": 0.9646877454105266, "event_breakdown": "Security Events:\n\n1. Hezbollah and Amal movement open a condolence house in Beirut.\n2. Joint war room was opened for condolences."}, {"id": "16186493-c730-4288-96bb-ccb40e72c218", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27821/", "date": "2024-05-25 18:29", "message": "Palestinian communications company Paltel: Internet services in the northern Gaza Strip and Gaza City have been shut down due to \"Israeli aggression\".", "location": "GAZA CITY", "classification": "security", "score": 0.9618683597449925, "event_breakdown": "Event: Internet services disrupted in the northern Gaza Strip and Gaza City amid reports of Israeli airstrikes.\nEvent: Reports of Israeli airstrikes targeting Palestinian militants in Gaza.\nEvent: Israel Defense Forces (IDF) confirms airstrikes on targets in Gaza in response to Palestinian rocket attacks."}, {"id": "b538fc10-ee26-4d5c-9c17-a2eea3a30393", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27820/", "date": "2024-05-25 18:27", "message": "Al Jazeera from senior Hamas official Osama Hamdan: The mediators did not inform us about the resumption of talks.", "location": "Gaza Strip", "classification": "security", "score": 0.8953252699967854, "event_breakdown": "1. Al Jazeera: Senior Hamas official Osama Hamdan says the mediators did not inform them about the resumption of talks.\n2. Hamdan said the mediators did not inform them about the resumption of talks.\n3. Al Jazeera: Osama Hamdan, a senior Hamas official, said the mediators did not inform them about the resumption of talks."}, {"id": "47e9d9d9-99e3-4c5f-886b-1ee5085343c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27819/", "date": "2024-05-25 18:25", "message": "The Lebanese Al-Mayadeen channel from a source in Hamas: they deny the Israeli announcement about a return to negotiations this coming Tuesday.", "location": "GAZA CITY", "classification": "security", "score": 0.766023623559385, "event_breakdown": "Israeli Air Force struck targets in the Gaza Strip. The IDF said it struck Hamas targets like those used for rocket attacks. The IDF said that two senior Hamas commanders have been killed, and Izz ad-Deen Al-Qassam Brigades commander Mohammed Deif's son, Osama Deif, as well. A top Al Quds Brigades commander was killed in a hospital in blockaded Gaza, according to Palestinian media. The IDF confirmed that they targeted a site linked to the production or storage of explosives for Hamas. Hamas says that it was keeping the Israeli vessel afloat for 21 years. It also accused Israel of breaching the Egyptian-brokered truce."}, {"id": "a65bd2b1-b73e-4bc7-9e13-cd6dd602f370", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27818/", "date": "2024-05-25 18:12", "message": "Lebanese sources report two deaths in an IDF attack on Aitaroun in southern Lebanon earlier this evening.", "location": "AITATOURN", "classification": "security", "score": 0.9607142248190295, "event_breakdown": "Events:\n-Aitaroun- IDF attack- two deaths"}, {"id": "e70fabe1-cb13-4725-81fd-56bf300fdd64", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27815/", "date": "2024-05-25 17:59", "message": "Lebanese media:\nThe mother of Hassan Nasrallah, the Secretary General of Hezbollah, has died.", "location": "Lebanon", "classification": "security", "score": 0.7098050488274783, "event_breakdown": "Mother of Hezbollah leader Hassan Nasrallah dies\n\nSyrian activists: Syria has sent military reinforcements and military equipment to Lebanon.\n\nIsraeli media reported that there has been an explosion at an Iranian weapons production site\n\nAfter the Lebanese army wounded and arrested a group of Israeli settlers in the occupied territories\n\nThere has been a massive explosion in the Akkar area of northern Lebanon"}, {"id": "91405d0c-46ea-45e7-a454-2a53ba7d1f53", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27813/", "date": "2024-05-25 17:26", "message": "Follower Eliran Ohana photographed the part of the American floating dock that drifted from Gaza to the shores of Ashdod.", "location": "Ashdod, Israel", "classification": "security", "score": 0.902220488269723, "event_breakdown": "Security Events:\n\n1. An American floating dock drifts from Gaza to the shores of Ashdod. 2. The dock is photographed by Eliran Ohana."}, {"id": "719a1ad1-8da4-48d9-803e-a02255fadcc1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27838/", "date": "2024-05-25 21:19", "message": "Hezbollah announces a death in its ranks:\n\nBilal Murad, from the village of Aitaroun.\n\nHe was killed in today's attack in the village 👆\n\nNumber 317", "location": "Aitaroun village", "classification": "security", "score": 0.9785955534687654, "event_breakdown": "Security Events:\n==============\n\n* Hezbollah member killed in attack in village of Aitaroun, Lebanon. (Death of Hezbollah member Bilal Murad reported from attack)\n* Attack reported in village of Aitaroun, Lebanon."}, {"id": "14d8fa81-a296-4387-84a6-80e6dd303d6b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27837/", "date": "2024-05-25 21:17", "message": "East Jerusalem channels: \"Settlers are celebrating 'Lag BaOmer' in Sheikh Jarrah in East Jerusalem\"", "location": "East Jerusalem", "classification": "security", "score": 0.9283510461347252, "event_breakdown": "Event 1: Settlers are celebrating 'Lag BaOmer' in Sheikh Jarrah in East Jerusalem."}, {"id": "99965f46-7f54-43ba-8458-fc39199c21a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27836/", "date": "2024-05-25 21:16", "message": "Khan Yunis, southern Gaza: A Gazan residents takes a selfie with an IDF dud weighing about a ton.", "location": "GAZA", "classification": "security", "score": 0.9479569451042753, "event_breakdown": "Security Events:\n\n1. IDF dud discovered in southern Gaza.\n2. Gazan resident takes a selfie with the dud.\n3. IDF dud weighs about a ton."}, {"id": "c433a78b-144a-4732-985e-eb735472859d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27834/", "date": "2024-05-25 21:14", "message": "Gazan sources report the assassination of Mahmoud Shaqoura, a Hamas terrorist, who took part in the battle at the Erez crossing on Oct. 7. \n\nDuring the attack, Shaqoura documented everything with a camera attached to his helmet. IDF soldiers can be seen in the video being shot at inside the crossing compound (attached is a frame from the video).\n\nAccording to these sources, Shaqoura was killed in the recent fighting in Jabalia in the north of the Gaza Strip.\n\nThe blood of IDF soldiers was on his hands.\nGood riddance.", "location": "GAZA", "classification": "security", "score": 0.8645607699605907, "event_breakdown": "Events:\n- Assassination of Mahmoud Shaqoura, a Hamas terrorist, who took part in the battle at the Erez crossing on October 7.\n- During the attack at the Erez crossing, IDF soldiers can be seen in the video being shot at inside the crossing compound.\n- Mahmoud Shaqoura was killed in the recent fighting in Jabalia in the north of the Gaza Strip."}, {"id": "a4f28551-ba56-416f-8cc4-9912dad936cc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27831/", "date": "2024-05-25 21:08", "message": "Palestinian communications company Paltel: Internet services in the northern Gaza Strip and Gaza City are down due to \"Israeli aggression\".", "location": "GAZA", "classification": "security", "score": 0.9618683597449925, "event_breakdown": "Event: Internet services in the northern Gaza Strip and Gaza City are down due to \"Israeli aggression\".\n\nEvent: Israeli airstrikes on the Shabwani family residential building in northern Gaza City, injuring several people."}, {"id": "4bc7fe5c-1d2c-41e4-a895-3045940820c5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27830/", "date": "2024-05-25 21:08", "message": "Lebanese sources: An Israeli shell hit a fuel tank near Al-Khiam prison in southern Lebanon. A large fire broke out on site.", "location": "Southern Lebanon", "classification": "security", "score": 0.9826199309480098, "event_breakdown": "Security Events:\n1. An Israeli shell hit a fuel tank near Al-Khiam prison in southern Lebanon.\n2. A large fire broke out on site."}, {"id": "27d5db84-ccba-4588-b844-538b00b4ffc0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27829/", "date": "2024-05-25 21:07", "message": "Al Jazeera from senior Hamas official Osama Hamdan: The mediators did not inform us anything about the resumption of talks.", "location": "Gaza", "classification": "security", "score": 0.8953252699967854, "event_breakdown": "Security Events:\n\n1. Al Jazeera reported that senior Hamas official Osama Hamdan said mediators did not inform Hamas about the resumption of peace talks."}, {"id": "57bb4635-2e84-4483-b364-d1b243bf9f3e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27828/", "date": "2024-05-25 21:07", "message": "The Lebanese Al-Mayadeen channel from a source in Hamas: they deny the Israeli announcement about a return to negotiations this coming Tuesday.", "location": "GAZA", "classification": "security", "score": 0.766023623559385, "event_breakdown": "[Al-Mayadeen] Military escalation in West Bank as five Palestinians killed in 24 hours"}, {"id": "31dda021-d06e-4c9a-bd26-88d19b2e2914", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27823/", "date": "2024-05-25 18:56", "message": "Lebanese sources: An Israeli shell hit a fuel tank near the Khiam prison in southern Lebanon. A big fire broke out there.", "location": "Khiam prison", "classification": "security", "score": 0.9474255241439191, "event_breakdown": "Security Events:\n- An Israeli shell hit a fuel tank near the Khiam prison in southern Lebanon.\n- A big fire broke out near the Khiam prison in southern Lebanon."}]