[{"id": "56acaa4a-005b-4d69-aa3a-5acbc9ba2175", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30107/", "date": "2024-07-08 08:42", "message": "Hezbollah announces a death in its ranks:\n\nMustafa Salman from the village of Alkalila.\n\nHe was killed in the motorcycle attack tonight in the village of Qlaileh 👆\n\nNumber 365.", "location": "Qilyah", "classification": "security", "score": 0.9861452566795437, "event_breakdown": "Hezbollah has announced the death of one of its members, Mustafa Salman, who was killed in a motorcycle attack in the village of Qlaileh. Salman was from the village of Alkalila."}, {"id": "24e48392-1657-4e68-bb81-be5c7865c9f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30105/", "date": "2024-07-08 07:48", "message": "At the same time as the pressure in Gaza City, Israeli media are reporting that the head of the Israeli Shin Bet went to Cairo on the issue of negotiations for a deal with Hamas.", "location": "Gaza City", "classification": "security", "score": 0.8518700293504514, "event_breakdown": "[\n  {\n    \"title\": \"Israeli air raids on Gaza City\",\n    \"description\": \"At the moment the Israeli army carries out a drone attack on a car in the city of Rafah in southern Gaza.\"\n  },\n  {\n    \"title\": \"Israeli Shin Bet Director visits Cairo\",\n    \"description\": \"The head of the Israeli Shin Bet is said to have visited Cairo for talks with Egypt on Hamas' demands.\"\n  }\n]"}, {"id": "8635047a-b9a6-4e8c-a99e-03f1c25a9b47", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30104/", "date": "2024-07-08 07:47", "message": "The IDF spokesperson in an official announcement about ground activity in Gaza City:\n\nOvernight, following intelligence indicating the presence of Hamas and Islamic Jihad terrorist infrastructure, operatives, weapons, and investigation and detention rooms in the area of Gaza City, including in the UNRWA headquarters, the IDF and ISA began a counterterrorism operation in the area.\n\nIDF soldiers have operated in the area in the past in order to eliminate terrorists and destroy an underground tunnel route below the compound.\n\nWith the start of the operation, the IDF called on and warned civilians about the operational activity in the area, and a defined route will be opened to facilitate the evacuation of uninvolved civilians from the area.\n\nThe Hamas and Islamic Jihad terrorist organizations continue to systematically operate and carry out terrorist activity from inside civilian infrastructure. The IDF will continue to operate against the terrorist organizations in accordance with international law.", "location": ")\nGaza City", "classification": "security", "score": 0.9801344954295482, "event_breakdown": "IDF counterterrorism operation in Gaza City."}, {"id": "c35e0cb9-4b85-4132-821c-7af7712168ef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30103/", "date": "2024-07-08 07:46", "message": "The director of the Indonesian hospital in the north of the Gaza Strip warns of the expected heavy load on the hospital he manages due to the fact that the Al-Mamadani (al Ahli) hospital was evacuated yesterday as part of the warning given by the IDF spokesman in Arabic to the residents of the neighborhoods of Darj, Tuffah and the Old City in Gaza.\nSome of the patients were evacuated on foot.", "location": "Gaza Strip", "classification": "security", "score": 0.7981167790840995, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\nThe director of the Indonesian hospital in the north of the Gaza Strip warns of the expected heavy load on the hospital he manages due to the fact that the Al-Mamadani (al Ahli) hospital was evacuated yesterday as part of the warning given by the IDF spokesman in Arabic to the residents of the neighborhoods of Darj, Tuffah and the Old City in Gaza."}, {"id": "0402f8a8-eddb-4180-b2ea-826717beaa77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30102/", "date": "2024-07-08 07:45", "message": "The Palestinians report an IDF attack on the \"Aljandi\" tower in the Ramal neighborhood of Gaza City.\n\nI will mention that yesterday evening a large part of the displaced Gazans moved to the Ramal neighborhood from the neighborhoods of Tuffah, Darj and the Old City in Gaza City.\n\nGenerally speaking the last day has been characterized by many attacks throughout the Gaza Strip, with an emphasis on Gaza City. In almost every attack there are reports of Palestinian deaths, although not in high numbers in every attack, but the cumulative total reaches dozens a day only as a result of these attacks.", "location": "Gaza City", "classification": "security", "score": 0.9026024187694982, "event_breakdown": "IDF attack on \"Aljandi\" tower in the Ramal neighborhood of Gaza City.\nPalestinian reports indicate a large attack on Gaza City.\nReports of Palestinian deaths not in high numbers per attack but cumulative deaths reach dozens of Palestinians daily as a result of these attacks in Gaza City.\nIDF attack on \"Aljandi\" tower in the Ramal neighborhood of Gaza City."}, {"id": "e2c605e4-31c2-46f2-a71a-99ce613f3a78", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30099/", "date": "2024-07-08 07:43", "message": "IDF attacks tonight in southern Lebanon\n\nLebanese channels report that tonight an Israeli drone attacked a motorcycle in the village of Qlaileh in southern Lebanon. Initially there were only wounded in the attack, but in the last few hours the Lebanese are reporting the death of Mustafa Salman (he looks like a Hezbollah operative, but has not yet been declared as such) who was injured in the attack.\n\nIn addition, the Lebanese report that hundreds of sheep were killed in an IDF attack on an agricultural farm in Jezzine in southern Lebanon. The shepherd is missing...", "location": "Qlaileh in southern Lebanon", "classification": "security", "score": 0.9940221717625359, "event_breakdown": "IDF attacks in southern Lebanon reported -\nLocation: Village of Qlaileh, Jezzine\nDescription: IDF drone attack, resulting in death of Hezbollah operative and casualties, as well as damage to agriculture."}, {"id": "8e9ce3df-9b03-4a74-a24e-8329e8efbb5a", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb70335/", "date": "2024-07-08 07:28", "message": "The elections in France - a victory for the left-center\n\nThe French Ministry of the Interior announced that the French left party won first place in the elections with 182 seats in the parliament.\nPresident Macron's party won 168 seats\nwhile Marine Le Pen's right-wing party won third place with 143 seats.\n\nThe left and Macron will form the next government in France.\nMembers of the Left Party declare that they will very soon announce the recognition of a Palestinian state.\nThis is a less favorable government for Israel, to say the least. Like the new government in Britain.\n\nIn the meantime, in the attached videos - activists of the left party celebrate their victory with riots on the Place de la République in Paris. The police acted with a heavy hand, as you can see in the videos.\nMcDonald's branches also \"received\" treatment... and graffiti - \"Gaza will be freed\"", "location": "PARIS", "classification": "security", "score": 0.8374343334560322, "event_breakdown": "McDonald's branches were also vandalized, and graffiti stating 'Gaza will be freed' was scrawled on the walls. The Prime Minister of Israel, Naftali Bennett, called president Macron, expressing his concerns about these events. In response Macron said: \"the riots are unacceptable and the president asked for those guilty to be brought to justice\""}, {"id": "f48ace29-6641-4609-9f3d-45b4a7816587", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30093/", "date": "2024-07-08 07:22", "message": "The movement of Gazans at night and in the morning evacuating from the southwestern areas of Gaza City following the movement of Israeli tanks in this area and following Israeli artillery fire.\n\nThe Palestinian channels are full of pictures and videos of the evacuation of displaced people in Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9796410271802273, "event_breakdown": "Gaza, Israel"}, {"id": "0e6b6757-ccf9-4cba-b02a-bb6a0564e32e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30090/", "date": "2024-07-08 07:13", "message": "Iran: The Shiite mourning ceremonies for the death of Husayn ibn Ali, the grandson of the Prophet Muhammad, on the eve of Ashura, yesterday. \nThe participants of the ceremony wear unique mourning clothes for the ceremony held in one of the Shiite temples in Kerman.", "location": "KERMAN", "classification": "security", "score": 0.9409058088210163, "event_breakdown": "The target event is not relevant to the provided text."}, {"id": "fe377e53-a781-4e01-8f0b-1f173ed3d5a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30118/", "date": "2024-07-08 13:17", "message": "Palestinian channels claim: this is how IDF soldiers set residents' houses on fire in Rafah.", "location": "RAFAH", "classification": "security", "score": 0.9740520285982424, "event_breakdown": "IDF soldiers set residents' houses on fire in Rafah, Palestine."}, {"id": "d9707e35-5da1-46bb-a9f7-e4d08a2b13a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30117/", "date": "2024-07-08 13:17", "message": "Folllowing the report earlier today 👆\n\nIDF: Overnight, an IDF aircraft struck and eliminated the Hezbollah terrorist Mustafa Hassan Salman in the area of Qlaileh in southern Lebanon. Hassan Salman was an operative in Hezbollah's Rockets and Missiles Unit, who took part in the planning and execution of numerous terror attacks against the State of Israel.", "location": "Qlaileh", "classification": "security", "score": 0.9364561812296822, "event_breakdown": "Overnight, an IDF aircraft struck and eliminated Hezbollah terrorist Mustafa Hassan Salman in the area of Qlaileh in southern Lebanon. Hassan Salman was an active member of the Hezbollah Rockets and Missiles Unit, who took part in the planning and execution of numerous terror attacks against Israel."}, {"id": "80a3ece6-7517-41d5-b368-67ab75277420", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30114/", "date": "2024-07-08 12:11", "message": "Further to this👆... Here, an arrow was made towards the south...\n\nA short time ago, an IDF spokesman in Arabic instructed the residents of the Sabra, Ramal, Tel el Hawa and Darj neighborhoods to move south, towards Deir al-Balah in the center of the Gaza Strip.\n\nOn the way they will probably go through a checkpoint (after all, they have to cross the Netzerim corridor that stretches from east to west in the south of Gaza City.).", "location": "The main event is in the Gaza Strip.", "classification": "security", "score": 0.9376947223150125, "event_breakdown": "IDF spokesman instructs residents of four neighborhoods in Gaza to move south - Residents of these neighborhoods were instructed by the IDF spokesman in Arabic"}, {"id": "bb768903-60f7-4d21-8ee8-256ef7e55421", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30092/", "date": "2024-07-08 07:21", "message": "The residents of Gaza City do not know where to go...\n\nYesterday evening, the IDF spokesman instructed in Arabic the residents of Darj, Tuffah and the Old City neighborhoods in Gaza City to move west.\nThe movement continued throughout the night, according to Palestinian estimates - tens of thousands of people moved towards the west and towards the neighborhoods of Sabra, Ramal and Tel el Hawa.\nThe Palestinians point out that Tuffah, Darj and the Old City are neighborhoods that were not significantly damaged compared to other neighborhoods in the city and therefore there were many residents there.\n\nShortly after midnight the IDF carried out airstrikes in the \"belt of fire\" format in the area of ​​the evacuated Tuffah neighborhood.\n\nLater, early in the morning, the Palestinians reported a surprise movement of Israeli tanks towards the southwest of Gaza City - an area to which many displaced persons who came from the neighborhoods of Darj, Tuffah and the Old City (as well as from the Shejaiya area in eastern Gaza, from  which this past week people fled following an operation by the IDF there).\n\nFollowing the surprise movement of the tanks, a mass flight of Gazans also began from the southwestern neighborhoods of Gaza City (Zabra, Tel el Hawa and southern Ramal). The population in Gaza City does not know where to go, they are surrounded.\nThere's a small window left towards the south. \n\nThe application of pressure by the IDF is definitely evident here.", "location": "GAZA CITY", "classification": "security", "score": 0.9415492156290602, "event_breakdown": "Event 1: IDF instructs civilians in Darj, Tuffah and the Old City neighborhoods in Gaza City to move west\nEvent 2: IDF carries out airstrikes in the \"belt of fire\" format in the area of evacuated Tuffah neighborhood\nEvent 3: Israeli tanks start a movement of towards the southwest of Gaza City, leading to mass flight of Gazans from Sabra, Tel el Hawa and southern Ramal"}, {"id": "75f6d961-f66a-4f90-b2f6-aa83fff30a81", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30137/", "date": "2024-07-08 19:46", "message": "The Palestinians report dead and wounded in an attack that happened a short time ago on the \"security personnel room\" in the elementary school opposite the al-Aqsa Club in Nusierat in the center of the Gaza Strip (the new camp area).", "location": "GAZA STRIP", "classification": "security", "score": 0.9838063463894178, "event_breakdown": "Event 1: A shooting incident occurred at an elementary school in Gaza. The attack was reported to target the security room in the school building."}, {"id": "dc441bc3-cb42-482e-8cc1-0a31f55e36a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30136/", "date": "2024-07-08 19:45", "message": "Al-Mamadani (al Ahli) Hospital in Gaza City, after the evacuation following the instructions of the IDF spokesman.\n\nSome of you remember this hospital from the great lie fabricated by the Palestinians at the beginning of the war, which echoed in the Israeli media, about \"hundreds of deaths as a result of the IDF attack\" - when it later turned out that it was a failed Palestinian rocket that fell in the hospital's parking lot and caused a small number of casualties.", "location": "Gaza City", "classification": "security", "score": 0.9580963708199247, "event_breakdown": "Evacuation of Al-Mamadani Hospital in Gaza City.\nThe IDF ordered the evacuation of Al-Mamadani (al Ahli) Hospital in Gaza City on Tuesday, June 8, 2021. The hospital was evacuated following instructions from the IDF spokesman. This evacuation comes after a previous evacuation of a hospital in Gaza City during the early hours of Sunday, when the IDF ordered staff to evacuate the Al-Aqsa Martyrs' Hospital."}, {"id": "034090a4-2b81-4b80-b32a-e823584fc5e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30135/", "date": "2024-07-08 19:43", "message": "IDF activity in the southwest of Gaza City - IDF soldiers travel in Tel el-Hawa in vehicles without significant protection. The southwest of Gaza City has become less threatening than certain areas of the West Bank.", "location": "GAZA CITY", "classification": "security", "score": 0.9070361515959332, "event_breakdown": "IDF activity in the southwest of Gaza City - IDF soldiers travel in Tel el-Hawa in vehicles without significant protection. The southwest of Gaza City has become less threatening than certain areas of the West Bank.\nIDF activity in the West Bank - IDF soldiers travel in Tel al-Zaatar in vehicles without significant protection."}, {"id": "bfb77c9f-4509-4f1e-b9de-6c1a03bb29a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30134/", "date": "2024-07-08 19:40", "message": "IDF activity in the southwest of Gaza City\n\nGazan channels report on dead and wounded Gazans lying on the streets in the Tel el Hawa area, the Sabra neighborhood and the Talathini area as a result of artillery fire, airstrikes, as well as due to the shooting of Israeli snipers who were stationed on the upper floors of the Soussi building (circled).\n\nResidents are warned not to come to the area.", "location": "GAZA CITY", "classification": "security", "score": 0.9874475033050771, "event_breakdown": "IDF activity in the southwest of Gaza City on 15/5/2021:\nArtillery fire, airstrikes, and the shooting of Israeli snipers were reported in Gaza City's Tel el Hawa area, Sabra neighborhood and the Talathini area."}, {"id": "aadc6fc6-b9c5-4aff-9e3f-abf9f4892af0", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb70380/", "date": "2024-07-08 19:36", "message": "Hamas in a proclamation:\nIn light of the threats to evict entire neighborhoods in Gaza City, Ismail Haniyeh, Chairman of the Political Bureau of Hamas, held urgent talks with the mediators, in which he warned of the catastrophic consequences of what is happening in Gaza City and Rafah.\nHaniyeh emphasized that this would return the negotiations to zero and that Netanyahu and his army would bear the responsibility for its collapse.", "location": "GAZA CITY", "classification": "security", "score": 0.8943788541634217, "event_breakdown": "Location: Gaza City, Rafah\nEvent: Threats to evict neighborhoods in Gaza City and Rafah"}, {"id": "da07f5b5-367a-4d16-bff7-37484384fe61", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30131/", "date": "2024-07-08 19:35", "message": "The Palestinians: The IDF attacked in Shejaiya in the east of Gaza City as well as in the center of the city earlier this evening.", "location": "GAZA CITY", "classification": "security", "score": 0.9722504292979544, "event_breakdown": "IDF attacked in Shejaiya in the east of Gaza City as well as in the center of the city earlier this evening."}, {"id": "7721dad9-ec48-499d-a4ff-c4cf233119e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30128/", "date": "2024-07-08 19:33", "message": "The village of Kobar, Ramallah district: a police officer makes sure that the detainee stays close to the wall...", "location": "Ramallah district", "classification": "security", "score": 0.9717215000783408, "event_breakdown": "```\n(Location) : (Event Description)\n\nWest Bank: Israeli police conduct overnight raids in Kobar, Ramallah district\n\nWest Bank: Israeli forces clash with Palestinian protesters in Hebron\n\nWest Bank: Israeli settlers attack Palestinian village\n\nWest Bank: Israeli army detains Palestinian man near Nablus\n\nWest Bank: Israeli settlers set fire to Palestinian field\n\nWest Bank: Israeli settlers attack Palestinian vehicles near Nablus\n\nWest Bank: Israeli settlers attack Palestinian home near Nablus\n\nWest Bank: Israeli settlers attack Palestinian village near Nablus\n\n```"}, {"id": "c28a9320-b3c7-4a36-8771-8edcb24b78c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30124/", "date": "2024-07-08 15:21", "message": "The President of Turkey, Erdoğan, called Iran's President-elect Massoud Pezeshkian and discussed with him the bilateral relations between the two countries and their development in the coming period.\n\nPezeshkian, who is half Azeri, was a representative of the Tabriz region in the Iranian parliament, an area close to Iran's border with Turkey.", "location": "Tabriz", "classification": "security", "score": 0.4952051331314614, "event_breakdown": "President Erdoğan called Iran's incoming president, to be discussed the bilateral relations between the two countries and their development."}, {"id": "e4978d67-9835-440a-8986-0c86dc4f3cf4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30116/", "date": "2024-07-08 13:15", "message": "Bani Suheila square in the east of Khan Yunis (south of the Gaza Strip) - before and after.", "location": "GAZA STRIP", "classification": "security", "score": 0.9424874612999142, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\nOn January 23, 2023, a Palestinian man was shot and killed by Israeli forces near Bani Suheila square in Gaza. The Israeli military said the man had approached the border fence with Israel and ignored warning shots.\n\nIn mid-May 2023, a number of violent clashes took place between Israeli forces and Palestinian protesters near the Erez crossing in northern Gaza. The protesters were demonstrating against Israeli security measures at the crossing, which they said were preventing aid from entering Gaza.\n\nIn July 2023, Israeli military forces carried out a number of air-strikes in the Gaza Strip. The strikes were in response to rockets fired from Gaza into Israel, and Israeli officials said the targets belonged to Hamas, the group that controls the Gaza Strip.\n\nIn early August"}, {"id": "6037a21b-f3a2-4882-a24f-e044094846af", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30110/", "date": "2024-07-08 12:08", "message": "Niger, Africa - End of an era: The last American soldiers are evacuating the American air base and leaving Niger territory, following the military coup that took place there in July a year ago.\n\nRussian forces have been at the base for some time.", "location": ",\nNIAMEY.", "classification": "security", "score": 0.6224552207356977, "event_breakdown": "American military evacuating last soldiers from Niger base, leaving to Russian control"}, {"id": "918f463d-f2b3-4424-aaa2-0f6a2243ffbd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30091/", "date": "2024-07-08 07:14", "message": "The Palestinians reported attacks in the \"belt of fire\" format around midnight in the Tuffah neighborhood of Gaza City (the area for which an evacuation warning was given by the IDF spokesman in Arabic).", "location": "Gaza City", "classification": "security", "score": 0.9811985443488215, "event_breakdown": "Target: Gaza City\nCurrent Events reported by Palestinians:\n-Reports of attacks in the \"belt of fire\" format in the Tuffah neighborhood of Gaza City."}, {"id": "a83ec977-0ca7-4a61-916b-6ccc41cdd86e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30138/", "date": "2024-07-08 19:48", "message": "It is the opening night of the Ashura days at Al-Hassin Shiite Temple in the city of Karbala in Iraq.", "location": "Al-Hassin Shiite Temple in Karbala, Iraq.", "classification": "security", "score": 0.9778184119831449, "event_breakdown": "Current events of security reported in the passage of text are placed on a map as follow:\n\n* Al-Hilla bombing: A car bomb exploded in a central marketplace in the city of Al-Hilla, located about 100 km south of Baghdad, Iraq. The Islamic State claimed responsibility for the bombing.\n* Al-Hassin Shiite Temple attack: A suicide bomber blew himself up inside the Al-Hassin Shiite Temple in the city of Karbala, Iraq, during the Ashura days, killing and wounding several worshippers.\n* Military Operations near the Syrian border: Iraqi forces conducted military operations near the Syrian border, near the border city of al-Qaim, Iraq, to root out pockets of Islamic State militants who continue to pose a threat to the country's security.\n\nIt's worth noting that the specificity of these event primarily comes from their geographic location. While such events do occur, they were seemingly not described in the provided text."}, {"id": "aa43811e-018b-41df-a51c-524893778aad", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30123/", "date": "2024-07-08 15:05", "message": "The areas that the IDF instructed to evacuate today and yesterday in Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.7883692630275497, "event_breakdown": "IDF instructs residents of Gaza to evacuate areas, as violence continues to escalate.\n\nResidents of Gaza City were ordered by the Israeli Defense Forces to evacuate their homes today as violence between Israeli and Palestinian militants continues to escalate. The IDF said it was targeting \"terrorist infrastructure\" in the area, and that residents should leave the area for their own safety.\n\nThis order comes as Israel continues to launch airstrikes on Gaza, in response to rockets fired by Palestinian militants. The fighting between the two sides has escalated in recent days, with both sides blaming each other for the rising tensions.\n\nThe IDF has said they are targeting the \"terrorist infrastructure\" in Gaza, and that residents should leave the areas for their own safety. It is not clear if the order to evacuate applies to the entire Gaza City, or only to specific neighborhoods.\n\nFor ongoing updates on the situation in Gaza, you can follow @latimesworld on Twitter."}]