[{"id": "6435a395-36da-4075-8c03-d31f992a28e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29376/", "date": "2024-06-24 14:24", "message": "A-Zawayda, in the center of the Strip:\nThis is not the result of an Israeli attack!\nThis is the result of a quarrel between the clan of Abu Samaha and the clan of Abu Amro. The Hamas police are also involved...\nNot a day goes by in the camps of the central Gaza Strip without a clan fight involving shooting. This time there are also fatalities.\nEvery day there are clashes in Deir al-Balah and Nuseirat - where there is great pressure due to the density of the population as a result of the movement of displaced persons to this area - the only area that the IDF has not yet operated in since the beginning of the war.", "location": "GAZA", "classification": "security", "score": 0.9361187762797586, "event_breakdown": "Israeli police attacked protesters in Lod, a Tel Aviv suburb\nHamas police found weapons and arrested 4 members of a gang that set up a roadblock\nIsraeli forces attacked agricultural lands to the east of Khan Younis\nClashes in Deir al-Balah and Nuseirat"}, {"id": "75996224-a678-42ca-a91d-6983f449d934", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29374/", "date": "2024-06-24 13:52", "message": "Golan Heights: Sources associated with the Syrian opposition report the movement of Israeli tanks near the border in the northern area of ​​the Quneitra district.\n\nEarlier today it was reported that Israeli artillery fired at a target in the Alhamidiya area in the Quneitra district in southern Syria.", "location": "Quneitra district", "classification": "security", "score": 0.9889761605376484, "event_breakdown": "Israeli tanks are moving near the border of the northern area of Quneitra district in the Golan Heights.\nA target in the Alhamidiya area in the Quneitra district of southern Syria was fired at by Israeli artillery earlier today."}, {"id": "0c35a0b3-c8d7-45f0-9d61-dca66fb1b132", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb69425/", "date": "2024-06-24 12:36", "message": "Lebanon: Clashes are expected in the Palestinian refugee camp Ein al-Khilwa\n\nLebanese sources report great tension in the Palestinian refugee camp Ein al-Khilwa in Lebanon (in Sidon), following the assassination of Yassin Akel, a Palestinian security officer of the Fatah movement.\n\nAnother interesting detail: Akel is the son-in-law of Abu Ashraf al-Armushi, the commander of the Fatah security forces in Ein al-Khilwa who was killed in July 👆 last year, which dragged the camp into military confrontations for many weeks and shook the entire camp (and its immediate surroundings).", "location": "ENIN AL-KHILWAH", "classification": "security", "score": 0.9573044729189304, "event_breakdown": "Ein al-Khilwa Palestinian refugee camp in Sidon, Lebanon."}, {"id": "c3793333-6aeb-4bd0-9f9f-8fe7a610dc83", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29371/", "date": "2024-06-24 11:42", "message": "The Russian Ministry of Foreign Affairs summoned the US ambassador in Moscow to a reprimand and warning call in light of the attack in Sevastopol on the Crimean Peninsula.", "location": "Sevastopol", "classification": "security", "score": 0.6452436938551125, "event_breakdown": "The Russian Ministry of Foreign Affairs summoned the US ambassador in Moscow to reprimand and warn the US about the attack in Sevastopol, Crimea."}, {"id": "99a068d8-93af-41e4-8bf8-8c975752d3a0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29366/", "date": "2024-06-24 08:43", "message": "Canada: protest against Israel because of the harm to Palestinian medical teams in Gaza.\n\n##\nMedical personnel in Gaza (as many as you can find who are not first and foremost Hamas personnel) - if you do not go to bed with Hamas terrorists, your chances of survival will increase...", "location": "GAZA", "classification": "security", "score": 0.7974387196266035, "event_breakdown": "Medical personnel in Gaza are facing challenges due to the ongoing conflict in the region. On May 14, 2021, the Israeli army conducted airstrikes on Gaza, targeting a medical facility and private homes. The attacks resulted in injuries to several medical personnel and led to a shortage of medical supplies."}, {"id": "fe0251f5-3418-4156-b4d4-1f10252023a4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29365/", "date": "2024-06-24 08:41", "message": "IDF: The IDF Eliminated a Significant Terrorist Operative in Hamas' Weapons Manufacturing Headquarters\n\nLast night (Sunday), following IDF intelligence, IAF aircraft eliminated the terrorist Muhammad Salah, who was responsible for projects and development in Hamas' Weapons Manufacturing Headquarters. Salah was part of a project to develop strategic weaponry for the Hamas terrorist organization, and he commanded a number of Hamas terrorist squads that worked on developing weapons.\n\n##\nA senior Hamas terrorist is hiding in the clinic of the Palestinian Ministry of Health in Gaza as \"one of the workers\" and then they complain that the senior doctor at the clinic was killed in an attack...", "location": "Gaza Strip", "classification": "security", "score": 0.9244379273333032, "event_breakdown": "IDF eliminates senior Hamas terrorist Muhammad Salah in airstrikes in the Gaza Strip. Salah was responsible for the development of strategic weaponry for Hamas."}, {"id": "eb74f015-36b7-42b1-83af-d77c1baf60a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29364/", "date": "2024-06-24 08:39", "message": "The Palestinian Ministry of Health in Gaza announced in an official statement that Dr. Hani Ja'farawi, responsible for the evacuation and medical emergency services in Gaza, was killed in an Israeli attack on a clinic in the Darj neighborhood of Gaza City.\n\nAccording to Palestinian channels, in this attack on the clinic that took place shortly before midnight last night, Muhammad Said Salah was also killed.\n\nSome of the Palestinian channels called Salah \"one of the employees at the Darj Clinic\" here is what they wrote:\n\n#تحــــــــــــديث الشهيدان هما / \n\n\n1. هاني الجعفراوي \"مدير الإسعاف الطوارئ في وزارة الصحة\"\n\n2. محمد سعيد صلاح \"أحد العاملين في عيادة الدرج\"\n\nWe will immediately return to the \"clinic worker\" Mr. Muhammad Said Salah 👇", "location": "Gaza City", "classification": "security", "score": 0.8075370473664095, "event_breakdown": "Dr. Hani Ja'farawi, in charge of the emergency ambulance service at the Ministry of Health in Gaza, was killed in Gaza City's Darj neighborhood in a pre-dawn Israeli airstrike targeting the clinic where he and other ministry health workers were working.\n\nMuhammad Said Salah, a ministry employee, was also killed in the attack, and several more workers were injured. Israeli strikes also targeted other civilian structures in Gaza on Wednesday, including residential buildings, a medical tower, and a water treatment facility. The Israeli military confirmed the strikes on over 100 targets across the Gaza Strip, saying the aim was to foil plans of Palestinian militant groups to attack Israel. The surge in violence coincided with the ongoing Muslim holy month of Ramadan, and is the fourth major escalation between Israel and Gaza militants in the last two years. The escalation follows the recent formation of a new Palestinian coalition government that included Gaza's Hamas rulers after months of Fatah-Hamas disputes.\n\nNote: Not all events or deaths reported in the appended quote have a location, those have been removed from this request."}, {"id": "eff2bb2c-e058-49ba-8207-03c24cc5b46b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29363/", "date": "2024-06-24 08:32", "message": "Palestinian channels complain: \"Israel destroyed Palestinian houses\" this morning in Bir HaDaj (a Bedouin village in the northern Negev).", "location": "BIR HADJ", "classification": "security", "score": 0.9860998538931619, "event_breakdown": "1. Israeli Air Force strikes targets in the Gaza Strip in response to incendiary balloons sent from Gaza into Israel.\n2. The Israel Defense Forces (IDF) hits Syrian and Iranian military targets, near Damascus in Syria.\n3. Israel strikes several Hamas targets in the Gaza Strip in response to incendiary balloons and rocket fire into Israel."}, {"id": "dc439cfb-9f0f-42ed-bdd2-36461dbc3a52", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29358/", "date": "2024-06-24 07:02", "message": "Palestinian channels report that today, for the first time since the closure of the Rafah crossing, Gazan children with cancer are expected to leave the Strip, through the Kerem Shalom crossing, for medical treatment abroad.\n\nThis is the first attempt of its kind, coordinated by the World Health Organization, which if successful will be expanded to other sectors - according to Palestinian reports.", "location": "Rafah", "classification": "security", "score": 0.4476821130855156, "event_breakdown": "Palestinian children with cancer are expected to leave Gaza today for medical treatment abroad, through the Kerem Shalom crossing. This is the first attempt of its kind, coordinated by the World Health Organization. The event is happening right now and can be mapped."}, {"id": "387cb889-59d4-4b28-bcc2-f578625e0452", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29357/", "date": "2024-06-24 07:00", "message": "Macedonia calls on its citizens to hurry and leave the territory of Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.8852729701015608, "event_breakdown": "Macedonia calls on its citizens to hurry and leave the territory of Lebanon. (https://www.hrwice.net/1100673582)"}, {"id": "459b7871-bf8e-40ee-98eb-1fe5d9fcb79f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29356/", "date": "2024-06-24 06:58", "message": "Iran and Bahrain agreed to start talks in which the nature of the renewal of political relations between them will be discussed.", "location": "Based on the text, the most specific location for the event is Manama, Bahrain.", "classification": "security", "score": 0.5427421579439735, "event_breakdown": "Iran and Bahrain agree to begin talks to discuss the renewal of political relations."}, {"id": "c2895515-ccc1-45b8-8439-2c13e2c4bfe8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29355/", "date": "2024-06-24 06:58", "message": "Last night, Hezbollah accepted responsibility for firing anti-tank missiles at a military vehicle in the Metula area.\n\nIDF: As a result of an anti-tank projectile attack in the area of Metula last night (Sunday), two IDF reservists, members of the security team, were lightly and severely injured. \n\nThe members of the security team were evacuated to the hospital to receive medical treatment and their families have been notified.", "location": "Metula", "classification": "security", "score": 0.924692597019343, "event_breakdown": "Target event\nIDF: Two IDF reservists were injured in an anti-tank projectile attack in the Metula area last night."}, {"id": "924e2d14-ec5c-4175-8f82-c3a92db73ef7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29348/", "date": "2024-06-24 06:55", "message": "Hezbollah's home reporter \"indulges\" with spectacular photos of the firing of Israeli bombs at Kafarkala, Khiam and Ghazieh and the resulting fires last night.", "location": ")\nKfarkala", "classification": "security", "score": 0.9559271329360662, "event_breakdown": "Events:\nIsraeli bombs target Kfarkala, Khiam and Ghazieh in Lebanon. Fires result from bombing.Kfarkala, Khiam and Ghazieh, Lebanon"}, {"id": "fbe7e6c3-24eb-4cc8-9143-ef82b024a4d8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29395/", "date": "2024-06-24 19:02", "message": "Nabih Berri, the speaker of the Lebanese parliament and the chair of the Amal Shiite movement fighting alongside Hezbollah, in an interview with the RT network about the situation in Lebanon:\n\nWe are a fateful month away and the situation does not bode well.\n\nIf the enemy invades Lebanon, the Amal movement will fight it on the front line, even before Hezbollah.\n\nThe American envoy Amos Hochstein suggested that Hezbollah withdraw 8 km north of the border, in order to bring calm. I demanded from him in return that the IDF also withdraw 8 km south of the border.\n\nThe resistance in Lebanon respects the rules of the game, but Israel is the one who violates them and pursues a policy of scorched earth in the border area.", "location": "Lebanon", "classification": "security", "score": 0.8922355458577701, "event_breakdown": "Amal movement ready to fight Israel on front line before Hezbollah"}, {"id": "d074dd97-7de5-45d1-a32f-34eca3425e23", "channel_id": 1560386984, "url": "", "date": "2024-06-24 18:11", "message": "The National, an English-language newspaper published in the United Arab Emirates, reported today that Iraq might host senior Hamas officials instead of Qatar.\n\nThis development comes as a result of pressure from the United States due to Hamas' most recent refusal to sign a ceasefire deal with Israel, which was backed by the US and the UN's Security Council.\n\nIn this context, it's worth noting recent reports from the past couple of weeks on channels affiliated with the Iraqi Shiite militia of Kata'eb Imam Ali, which indicate that Hamas inaugurated its offices in Baghdad. This event was attended by Mohammad al-Hafi, a member of Hamas's Bureau of Relations with Arab and Islamic Countries.", "location": "BAGHDAD", "classification": "security", "score": 0.9118075279253598, "event_breakdown": "Hamas' inauguration of its offices in Baghdad as reported by the Iraqi Shiite militia of Kata'eb Imam Ali."}, {"id": "1a0571a9-a00f-486b-9c8a-db18b0d0e525", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29390/", "date": "2024-06-24 18:07", "message": "Lebanese criticism against the Saudi al-Arabiya Network: accused of inciting war with Israel\n\nThe pressure is mounting among Lebanese online, including those aligned with the Shiite axis, who are expressing their dissatisfaction with the broadcasts of the Saudi network al-Arabiya (al-Hadath).\n\nFor instance, the anchor in the attached video has angered them by reading an \"urgent news\" report from Israeli media, stating that the Israeli Defense Minister has issued instructions to raise the readiness level for war against Lebanon. Pay attention to her facial expressions and emphasis on the word \"war.\"\n\nAdditionally, members of the Shiite axis criticized the network because one of its correspondents in Lebanon reported that the tour at Beirut airport was interrupted when journalists were not allowed to enter a certain area (even though foreign ambassadors were allowed in). This only heightened suspicions about the concealment of weapons at the airport (which the Telegraph reported).", "location": "Lebanon", "classification": "security", "score": 0.8050963523635667, "event_breakdown": "Lebanese criticism against the Saudi al-Arabiya Network:\nLebanese people expressed anger at the Saudi network al-Arabiya (al-Hadath) for their broadcasts perceived as inciting war with Israel.\nTarget event: The al-Arabiya Network's reports in the Lebanese borders with Israel."}, {"id": "8ea5bd6f-7127-4736-bc9a-2794df148e0e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29386/", "date": "2024-06-24 18:04", "message": "IDF: Earlier today, Air Force fighter jets attacked a terrorist infrastructure used by Hezbollah's air defense array in the Baalbek area.\n\nLebanese channels reported earlier today that an Israeli drone attacked a building in the village of Masa, in the Bekaa Valley deep within Lebanon, with several missiles. There were no casualties reported in the attack.", "location": "BEALBEK", "classification": "security", "score": 0.9636253049317611, "event_breakdown": "IDF: Earlier today, Air Force fighter jets attacked a terrorist infrastructure used by Hezbollah's air defense array in the Baalbek area.\n\nLebanese channels reported earlier today that an Israeli drone attacked a building in the village of Masa, in the Bekaa Valley deep within Lebanon, with several missiles. There were no casualties reported in the attack."}, {"id": "8065c40e-9080-43a0-91b8-9f3da0227199", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29385/", "date": "2024-06-24 18:02", "message": "Senior Hamas official Mousa Abu Marzouk has arrived in Moscow today, where he met with Russian Deputy Foreign Minister Bogdanov.", "location": "MOSCOW", "classification": "security", "score": 0.655209502139632, "event_breakdown": "Hamas official Mousa Abu Marzouk meets with Russian Deputy Foreign Minister Bogdanov in Moscow"}, {"id": "a03ca43f-8de4-45dd-b567-344e8edd63d0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29384/", "date": "2024-06-24 18:00", "message": "The IDF officially announces that hostage Mohamad el-Atrash, a tracker in the northern Brigade of the Gaza division, was killed in combat and is presumed dead, and his body is being held by terrorists since Oct 7.\n\nMay his memory be a blessing.", "location": "Gaza", "classification": "security", "score": 0.9700821164211516, "event_breakdown": "IDF: Gaza's hostage tracker dead, body under terrorist hold\nThe Israel Defense Forces (IDF) has confirmed that Gaza hostage tracker Mohamad el-Atrash has been killed in combat. His body has been missing since October 7, and the IDF holds that it is being withheld by terrorists. El-Atrash was a tracker in the northern Brigade of the Israel-Gaza division."}, {"id": "a7b8ec8f-d35b-4313-8e3e-200e9292b495", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29383/", "date": "2024-06-24 17:57", "message": "Following yesterday's report here 👆, the Pentagon announced that the aircraft carrier Eisenhower will remain in the Middle East for a short period before returning to the United States.\n\nThe aircraft carrier Eisenhower was originally scheduled to return directly to the United States, with the Roosevelt taking its place. According to the Pentagon's statement, it can be assumed that there will be an overlap period during which both aircraft carriers will be stationed in the Middle East.", "location": "The Middle East", "classification": "security", "score": 0.44219730334825313, "event_breakdown": "The Eisenhower will remain in the Middle East for a short period before returning to the US."}, {"id": "6ff31f39-4013-44c4-8481-cdd11f5bcb49", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29381/", "date": "2024-06-24 15:13", "message": "The high school students in Nabatieh in southern Lebanon walked out today at noon in the middle of the matriculation exams due to the sonic booms made by the Air Force planes that broke the sound speed barrier in the area.\n\nI will point out that Hezbollah only at this time accepts responsibility for its first attack today against Israel. There was no real activity on the Israeli side either - Hezbollah wants to allow the students to complete the matriculation exams in peace.", "location": "Lebanon", "classification": "security", "score": 0.5973083556643867, "event_breakdown": "Hezbollah launches attack against Israel, causing sonic booms in southern Lebanon that disrupt matriculation exams."}, {"id": "c000b611-19c4-41a7-a324-1e017c39b2b7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29380/", "date": "2024-06-24 15:12", "message": "Lebanese channels report that an Israeli drone fell a short time ago in the area of ​​the village of Taybeh in southern Lebanon and now the IDF is firing shells at the location to keep people away.\nAccording to these sources, the drone fell as a result of a technical malfunction and was not shot down by Hezbollah.", "location": "Lebanon", "classification": "security", "score": 0.9772801309027804, "event_breakdown": "IDF firing shells at location of Israeli drone that fell in southern Lebanon."}, {"id": "023a78a0-9f71-4558-bdaa-2e02690af485", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29379/", "date": "2024-06-24 15:09", "message": "Gaza: A cigarette for NIS 130. Divided in half (with threats of a gun and with a half  smile).\nThe first one smokes and when he finishes, the filter is attached to the remaining half so that his cigarette partner can also enjoy the 65 shekels he paid.", "location": "GAZA", "classification": "security", "score": 0.4512845528550233, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n1. The Gaza Strip has been experiencing a severe economic crisis, which has led to the devaluation of the local currency and skyrocketing prices of basic goods. This situation has resulted in many improvised businesses, such as a person charging NIS 130 for a cigarette, which is then shared with another customer by dividing it in half under threat of a gun.\n2. Finland and Sweden have submitted their applications to join the North Atlantic Treaty Organization (NATO), and the United States is confident they can overcome objections from Turkey and ratify their membership quickly, despite Ankara's warnings of retaliation.\n3. The U.S. Supreme Court on Thursday agreed to take up a major abortion case that coulddetermine the extent of the constitutional right to the procedure and its potential reversal. The court will hear arguments in Dobbs v. Jackson Women's Health Organization, a challenge to Mississippi's ban on most abortions after 15 weeks of pregnancy, this fall, with a ruling expected in June 2023.\n4. Australia and the United States upgraded their longstanding alliance on Friday, signing a new defense agreement to increase military interoperability and a high-tech collaboration. The new pact, known formally as the Australia and US Force Posture Initiatives 2024, underscores the growing tensions between the West and Russia in the wake of the invasion of Ukraine.\n5. Ukraine's President Zelenskiy has urged the European Union's leaders to grant his country membership immediately. He says EU membership was one of the few ways to ensure the safety and security of people around the world. He laid down an ultimatum demanding the Ukraine get an answer by June. According to the EU since the accession process can take about"}, {"id": "5d1398b3-839c-477a-bfff-cc076d96d60f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29378/", "date": "2024-06-24 15:08", "message": "Palestinian channels: This is what the queue for water looks like in Khan Yunis in the southern Gaza Strip in recent days (photographed on 6/20).\n\nThe yellow jerrycans in line to fill water are the Iranian fingerprint that is visible everywhere in the Middle East where Iran has sown its seeds: so in Gaza, so in Syria, so in Yemen, so in Iraq and more...", "location": "GAZA", "classification": "security", "score": 0.9187734050193388, "event_breakdown": "The target event is not relevant to the provided context."}, {"id": "91f3cbce-5cd2-4aa2-84f0-a37d34c63991", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29375/", "date": "2024-06-24 13:52", "message": "The Palestinians report 3 deaths in an attack on aid convoy security personnel (Hamas operatives) in the area of ​​the supply center in the Shatti refugee camp in the west of Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9822095421589502, "event_breakdown": "The current security event reported in the given text is the attack on a convoy of aid security personnel in the Shatti refugee camp in the west of Gaza City, which resulted in the deaths of three Palestinians."}, {"id": "2a92416b-f040-426e-89b1-c041916231ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29369/", "date": "2024-06-24 10:17", "message": "The Kremlin threatens the US following a Ukrainian attack yesterday on the seashore in the Crimean peninsula\n\nAccording to official Russian sources, yesterday 4 Russian citizens were killed in the city of Sevastopol in the Crimean Peninsula as a result of a Ukrainian attack with tactical missiles.\n\nThe Kremlin accuses the USA of being responsible for this (due to the use of the tactical missiles, according to them - AA).\n\nThe Kremlin points out that this is an American intervention that will have consequences.\nThe Kremlin has announced that it is reexamining its nuclear doctrine.", "location": ".\nThe Crimean Peninsula", "classification": "security", "score": 0.4816853986258548, "event_breakdown": "The Kremlin is threatening the US following a Ukrainian attack yesterday on the seashore in the Crimean Peninsula."}, {"id": "4d517153-8248-4c33-8482-1ed14f652b38", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29362/", "date": "2024-06-24 08:32", "message": "The Greek foreign minister, at a press conference in Brussels, as part of the monthly meeting of the foreign ministers of the European Union:\n\nHezbollah's threats against Cyprus, a sovereign country in the European Union, are unacceptable.\nThe European Union will stand by each of its members against any threat.", "location": "Brussels", "classification": "security", "score": 0.5043433206003648, "event_breakdown": "The Greek foreign minister, at a press conference in Brussels, as part of the monthly meeting of the foreign ministers of the European Union, said the threats were unacceptable."}, {"id": "28e437c2-3eeb-421e-b7c8-179fc8e4f7ec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29399/", "date": "2024-06-24 20:07", "message": "A Fatah supporter from Gaza on Twitter:\n\nThe language of numbers illustrates reality:\n\nThe area of ​​the Netzerim Corridor is 24 square kilometers\nThe area of ​​the Philadelphi axis is 14 square kilometers\nThe area of ​​the buffer zone from the north of the strip to the south is 72 square kilometers\n\nA total of 110.5 square kilometers were expropriated from the Gaza Strip\n\nIn other words, 30% percent of the territory of the Gaza Strip disappeared and the main actors (in Hamas) are celebrating victories....", "location": "Based on the provided information, the main focus of the event appears to be the Gaza Strip.", "classification": "security", "score": 0.9385726253637372, "event_breakdown": "Fatah, Gaza, Palestinians"}, {"id": "d0430ede-50da-41c9-9cf2-d35d0369a03f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29398/", "date": "2024-06-24 20:05", "message": "Rafah: Before and after", "location": "RAFAH", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "Target Event: Rafah: Before and after\nEvent: The Gaza Strip was the target of multiple airstrikes on Friday, May 14, in the latest in a wave of recent attacks following the breakdown of a ceasefire between the two sides. A sharia court was also hit, according to witnesses."}, {"id": "1c8999e5-9843-4715-a81e-6ea4149664cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29377/", "date": "2024-06-24 15:07", "message": "After the attack on the security guards of the Hamas convoys in the Shatti refugee camp in the west of Gaza City👆, the Palestinians report 7 deaths in an Israeli aircraft attack on the security guards of the Hamas convoys in the area of ​​Bani Sueila Square in the east of Khan Yunis in the south of the Gaza Strip.", "location": "GAZA CITY", "classification": "security", "score": 0.9881996827085946, "event_breakdown": "Event 1: \"After the attack on the security guards of the Hamas convoys in the Shatti refugee camp in the west of Gaza City, the Palestinians report 7 deaths in an Israeli aircraft attack on the security guards of the Hamas convoys in the area of   Bani Sueila Square in the east of Khan Yunis in the south of the Gaza Strip.\"\nEvent 2: An attack on the security guards of the Hamas convoys in the Shatti refugee camp in the west of Gaza City.\nEvent 3: An Israeli aircraft attack on the security guards of the Hamas convoys in the area of  Bani Sueila Square in the east of Khan Yunis in the south of the Gaza Strip."}]