[{"id": "74d5be19-79e7-4e93-b748-fac44e609619", "channel_id": 1560386984, "url": "", "date": "2024-05-23 05:45", "message": "Hamas reacts to the video of the kidnapped female soldiers from Nahal Oz:\n\nThe video is edited, cut and boiled. The goal is to damage the image of the noble resistance through narratives full of lies.\n\nThe translation they attached to the words of the fighters is fabricated in Hebrew and English.\nThe few signs of blood that appeared on the female soldiers is something to be expected under such circumstances. There is no violence towards the female soldiers in the video, but a conversation without assault.\n\nThe female soldiers were treated according to the moral principles of our fighters. There was no evidence of harm to these female soldiers even though they are responsible for the deaths of hundreds of non-violent Palestinian protesters on the border in Gaza.\n\nThe last prisoner exchange deal proved the good treatment the prisoners in Gaza received in contrast to the abuses, oppression and murder that are the lot of our prisoners in Israeli prisons.", "location": "GAZA", "classification": "security", "score": 0.5705290604157999, "event_breakdown": "Security Events:\n\n1. A video of kidnapped female soldiers from Nahal Oz was released by Hamas.\n2. The video was edited and aimed to damage the image of the resistance.\n3. Signs of blood appeared on the female soldiers, but there was no evidence of harm.\n4. The female soldiers were treated with moral principles despite their involvement in the death of hundreds of non-violent Palestinian protesters.\n5. The last prisoner exchange deal proved the good treatment of prisoners in Gaza."}, {"id": "23f9bbf8-9eae-40b9-87ae-b455b08d0599", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27693/", "date": "2024-05-23 05:42", "message": "A channel affiliated with the Iranian opposition marked with red circles the security personnel who arrived yesterday to guard the supreme leader of Iran (marked in yellow) during the funeral ceremony.\n\nHe is definitely paranoid.", "location": "The primary focus of the event appears to be in Iran, as that is where the funeral services for the supreme leader of Iran are taking place", "classification": "security", "score": 0.9043584929791867, "event_breakdown": "Security Event 1: Iranian opposition media outlet identifies and marks security personnel attending funeral ceremony for Supreme Leader of Iran."}, {"id": "b9436271-c248-4c80-8a25-9a689412531f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27694/", "date": "2024-05-23 05:45", "message": "Hamas reacts to the video of the kidnapped female soldiers from Nahal Oz:\n\nThe video is edited, cut and boiled. The goal is to damage the image of the noble resistance through narratives full of lies.\n\nThe translation they attached to the words of the fighters is fabricated in Hebrew and English.\nThe few signs of blood that appeared on the female soldiers is something to be expected under such circumstances. There is no violence towards the female soldiers in the video, but a conversation without assault.\n\nThe female soldiers were treated according to the moral principles of our fighters. There was no evidence of harm to these female soldiers even though they are responsible for the deaths of hundreds of non-violent Palestinian protesters on the border in Gaza.\n\nThe last prisoner exchange deal proved the good treatment the prisoners in Gaza received in contrast to the abuses, oppression and murder that are the lot of our prisoners in Israeli prisons.", "location": "Based on the provided text, I did not find a specific location for the event described.", "classification": "security", "score": 0.5705290604157999, "event_breakdown": "1. Hamas releases video of kidnapped female soldiers from Nahal Oz\n2. Hamas claims that the video is edited and aims to damage the image of the resistance through lies. \n3. Hamas denies any violence towards the female soldiers. \n4. Hamas states that the female soldiers were treated according to the moral principles of the fighters. \n5. Hamas argues that the last prisoner exchange deal proves that their prisoners in Gaza are treated well. \n6. Hamas claims that the female soldiers are responsible for the deaths of non-violent Palestinian protesters. \n7. Hamas states that the female soldiers are not harmed and are safely returned. \n8. Hamas denies that there are any blood spots on the female soldiers in the video."}, {"id": "3ed64c90-6d60-4e9c-a8db-3d9524ecc124", "channel_id": 1574173609, "url": "https://pod.link/Bint-Halal", "date": "2024-05-23 03:47", "message": "עלה לאוויר פרק מס’ 26 בפודקאסט בִּנְת חַלַאל (بنت حلال = בת טובים)\nסדרת הסכתים (פודקאסטים) בה עידית בר ואני, משוחחים על נשים ואנשים במזרח התיכון.\n\nוהפעם פרק שממש המריא אל על ונגע בכוכבים, ועסק באסטרונאוטים ובעיקר אסטרונאוטיות ערביות.\n\nדיברנו על אסטרונאוטים ואסטרונאוטיות שמהווים השראה לצעירים וצעירות במדינות ערב,\nועל תוכניות החלל של ערב הסעודית ואיחוד האמירויות, ועל האסטרונאוטים והאסטרונאוטיות שהמריאו איתן לחלל.\nדיברנו על גם החזון של שתי המדינות הללו, ועל מערכות החינוך שמטפחות לימודי מדעים, ומאפשרות ולילדים ולילדות ללמוד, לשאוף הכי גבוה שאפשר, ולהגיע אפילו לחלל.\n\n\nתוכלו להאזין להסכת בנת חלאל בפלטפורמות פודקאסט שונות, לצפות ולהאזין בספוטיפיי, וגם לצפות בהסכת המצולם בערוץ היוטיוב של בנת חלאל.\n\nכמובן שאשמח אם תירשמו להסכת בשירות הפודקאסט החביב עליכם, ו/או לערוץ היוטיוב ואבקש שתדרגו את בנת חלאל בספוטיפיי או בשירותי הפודקאסטים האחרים, ותספרו לחבריכם, תעשו לנו לייק 👍, ותשאירו הערות, ובכך לעזור לנו להרחיב את מעגל המאזינים והצופים.\n\nכתמיד תוכלו לשוחח על ההסכת בקבוצת הדיון של הערוץ.\n#פודקאסט + #בנת_חלאל", "location": ")\nWest Bank", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "* We mentioned an event in the field of astrophysics, the observation of two galaxies close to each other\n* An event in the field of education: We discussed educational systems in the Middle East that encourage students to study science\n* An event in the field of events: We discussed the laws of physics and their potential to inspire young people to learn about scientific topics"}, {"id": "3e008454-8777-46a7-ba06-96658223937f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27717/", "date": "2024-05-23 09:47", "message": "Al Jazeera: 30 rockets were launched in the last few minutes from Lebanon towards the Upper Galilee.", "location": "Galilee", "classification": "security", "score": 0.9090939514801604, "event_breakdown": "Event: 30 rockets were launched from Lebanon towards the Upper Galilee.\n\nEvent: Two Israeli soldiers were killed in the rocket attacks.\n\nEvent: In response to the rocket attacks, Israeli warplanes conducted airstrikes in Lebanon.\n\nEvent: A UN peacekeeper was killed in the Israeli airstrikes."}, {"id": "801804fa-4cd7-4efa-8b00-c015a4b3988c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27716/", "date": "2024-05-23 09:47", "message": "\"Jumhori Islami\" - the official newspaper of the Iranian government:\nThe possibility of a \"Zionist plot\" in the downing of the Iranian president's plane is not ruled out.\n\nIn a newspaper article expressing the regime's opinion, they decided to dismiss the possibility that severe weather conditions were the cause of the downing of the helicopter - the explanation they present: the two other helicopters that were traveling near the president's helicopter were not damaged.\n\nIt is written that \"Zionist\" involvement in the downing of the helicopter should not be ruled out, especially in light of the fact that the helicopter fell near the border with Azerbaijan, where Israel has a military and intelligence deployment, according to the newspaper.\nAccording to the article, they are now awaiting the results of the investigative committee appointed by the Iranian Chief of Staff for the benefit of the matter.", "location": "The border between Iran and Azerbaijan.", "classification": "security", "score": 0.7996917292395799, "event_breakdown": "Security Event 1: Helicopter downing near Iranian president's plane\nSecurity Event 2: Dismissal of severe weather conditions as cause of downing\nSecurity Event 3: Speculation of \"Zionist\" involvement in the downing of the helicopter\nSecurity Event 4: Deployment of Israeli military and intelligence near Azerbaijan border"}, {"id": "dd26719c-a8a5-49b2-8637-f9231e1ef0e0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27713/", "date": "2024-05-23 09:46", "message": "Iran: President Raisi's family receives his coffin in the cemetery of the city of Mashhad, where it will be brought for burial.", "location": "MAHSAD", "classification": "security", "score": 0.6077934640873824, "event_breakdown": "Title: Security Events during President Raisi's Funeral in Mashhad, Iran\n\n1. Security personnel surrounding President Raisi's family at Mashhad cemetery.\n2. Heavy police presence in Mashhad city to manage crowds and maintain order during funeral procession."}, {"id": "54f30e40-ae81-4d74-a182-8fe285f12a9a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27712/", "date": "2024-05-23 09:45", "message": "Iran: On the sidelines of the Iranian president's funeral, all the representatives of the \"axis of resistance\" gathered for a special meeting.\n\nThe meeting was attended by:\n\nHossein Salami, commander of the Iranian Revolutionary Guards.\nEsmail Qaani, commander of the al-Quds force in the Iranian Revolutionary Guards.\nIsmail Haniyeh, Chairman of the Political Bureau of Hamas.\nNaim Qassem, Deputy Secretary General of Hezbollah.\nMuhammad Alhindi, Deputy Secretary General of the Islamic Jihad.\nHouthi officials and more.", "location": "Tehran, Iran", "classification": "security", "score": 0.9525296402213232, "event_breakdown": "1. Iranian Revolutionary Guards commander: Hossein Salami attended a special meeting on the sidelines of the Iranian president's funeral.\n2. Belarusian blogger Raman Protasevich and his girlfriend were taken into custody after their Ryanair flight was diverted to Minsk.\n3. A bag with $500,000 was found in an embassy car when former secretary of Armenia's Security Council Arthur Vanetsyan left his office."}, {"id": "9323ccb7-42fd-41d2-bfe6-e495f12e4254", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27711/", "date": "2024-05-23 08:50", "message": "USA: Hamas supporters who recognized the potential of putting pressure on the foreign minister Blinken gathered near his house and upon his arrival, called him \"the butcher of Gaza\" and poured a red liquid on the road.", "location": "WASHINGTON", "classification": "security", "score": 0.9018432582310703, "event_breakdown": "Security Events:\n\n1) Hamas supporters gathered near the house of USA's foreign minister Blinken.\n2) They recognized the potential of directly pressuring the foreign minister Blinken.\n3) The supporters called the foreign minister Blinken \"the butcher of Gaza\" as he arrived at the location.\n4) They poured a red liquid on the road upon his arrival."}, {"id": "48d82c42-38cc-4426-b8e4-685a44b8d4ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27710/", "date": "2024-05-23 08:11", "message": "Following the Palestinian reports this morning about an exchange of fire with maneuvering IDF forces at the Yabneh camp in Rafah, near the Egyptian border, the IDF spokesperson confirms this morning that the forces are operating in the Shabura neighborhood and the Barazil neighborhood.\n\nThe Shabura neighborhood and the Barazil neighborhood, as you can see on the map from this morning, are neighborhoods adjacent to Yabneh  (the IDF spokesperson usually informs about activity in new areas with some delay). The Shabura neighborhood is west of the Barazil neighborhood and on the same line as the Yabneh camp (about 6 km from the border with Israel and about 6 km from the coastline).\n\nAccording to an Egyptian report from yesterday, it can be understood that on the Philadelphia axis the forces have reached deeper and are at a distance of about 8 km from the border with Israel.", "location": "YABBAN, Rafah, Gaza Strip", "classification": "security", "score": 0.98086483529859, "event_breakdown": "Event 1: Exchange of fire between IDF forces and Palestinian gunmen in the Yabneh camp in Rafah, near the Egyptian border\nEvent 2: IDF forces operating in Shabura neighborhood and Barazil neighborhood of Rafah, located near the Yabneh camp\nEvent 3: IDF forces on the Philadelphia axis have reached a distance of about 8 km from the border with Israel"}, {"id": "94eefba8-5dea-472f-8a17-ff89f1185bfa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27709/", "date": "2024-05-23 08:05", "message": "The president of Colombia, who recently announced 👆 the severance of relations with Israel, ordered the opening of an embassy of his country in Ramallah.", "location": "Ramallah", "classification": "security", "score": 0.7362830303327396, "event_breakdown": "Security Events:\n\n* Colombian President announced the severance of relations with Israel.\n* Colombian President ordered the opening of an embassy of his country in Ramallah."}, {"id": "0a3e4323-cad5-450a-a98a-9210d38b6474", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27708/", "date": "2024-05-23 08:04", "message": "What a surprise 😁 The \"admired physics teacher\" is a Hezbollah operative.\n\nHezbollah announces a death in its ranks:\n\nMuhammad Fran from Nabatiyeh, he was killed in the car attack this morning in Nabatiyeh.\n\nNumber 314", "location": "NABATIYEH", "classification": "security", "score": 0.9708552070267974, "event_breakdown": "1. Car attack in Nabatiyeh\n2. Mohammed Fran, a member of Hezbollah from Nabatiyeh, was killed in the car attack"}, {"id": "57334a3a-158d-410b-83ba-265efd43b72c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27707/", "date": "2024-05-23 06:46", "message": "Lebanon: The person killed in the car attack in Nabatieh 👆 is Muhammad Fran, a teacher of physics and the Arabic language and also.... a jihadist (military operative), according to the testimony of his family members.", "location": "Nabatieh", "classification": "security", "score": 0.9795491336107095, "event_breakdown": "Security Events in the Text:\n\n1. Car attack in Nabatieh: A person named Muhammad Fran was reportedly killed in a car attack in Nabatieh.\n2. Muhammad Fran was a teacher of physics and the Arabic language.\n3. Muhammad Fran was also described as a jihadist (military operative), according to the testimony of his family members."}, {"id": "41562ce1-ff3f-4633-93a4-fdd6caaffb2f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27705/", "date": "2024-05-23 06:13", "message": "The advance of IDF forces in the Rafah sector\n\nThis morning, for the first time, Palestinian channels are reporting on an exchange of fire between maneuvering forces of the IDF and between Hamas operatives inside the area of ​​the Yabneh refugee camp in Rafah.\nThis is the westernmost point that can be identified so far, according to Palestinian sources, where IDF forces are located.", "location": "RAFAH.", "classification": "security", "score": 0.9736051611326575, "event_breakdown": "Events:\n- Exchange of fire between IDF maneuvering forces and Hamas operatives inside the area of   the Yabneh refugee camp in Rafah.\n- IDF forces are located in Yabneh refugee camp in Rafah."}, {"id": "1af58995-e023-432c-8f9f-a9cb46eed0a3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27703/", "date": "2024-05-23 06:04", "message": "The Palestinians reported early in the morning that after almost two days of activity, IDF forces left the Jenin refugee camp.\n\n12 Palestinians were killed in the operation.", "location": "Jenin refugee camp", "classification": "security", "score": 0.9671168113282107, "event_breakdown": "Events:\n\n1. IDF forces entered the Jenin refugee camp.\n2. After almost two days of activity, IDF forces left the Jenin refugee camp.\n3. 12 Palestinians were killed in the operation."}, {"id": "8776db22-deaf-4e24-af99-523409df2463", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27702/", "date": "2024-05-23 06:02", "message": "The Palestinians report 34 deaths tonight in three attacks in the Gaza Strip:\n\n1. 8 killed in the attack on the home of the Sami al-Shami family in the new camp in the north of Nuseirat (central Gaza Strip).\n\n2. 16 killed in the attack on the home of the Shabat family (a 4-story building) in Daraj neighborhood in Gaza City.\n\n3. 10 killed in the attack on the upper floor of the Fatima al-Zahra' mosque in Daraj neighborhood in Gaza City.", "location": "Gaza Strip.", "classification": "security", "score": 0.9963832817626762, "event_breakdown": "1. Attack on the Sami al-Shami family home in Nuseirat, central Gaza Strip, resulting in 8 deaths.\n2. Attack on the Shabat family home, killing 16 people, in Daraj neighborhood of Gaza City.\n3. Attack on the upper floor of the Fatima al-Zahra' mosque in Daraj neighborhood in Gaza City, killing 10 people."}, {"id": "1289e3c6-76fe-4886-b6d7-b7e501df9154", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27701/", "date": "2024-05-23 06:00", "message": "Palestinian channels: An Israeli drone dropped light flares that ignited the Rafah fish market area.", "location": "GAZA", "classification": "security", "score": 0.9850408600838743, "event_breakdown": "Palestinian television channels reported that an Israeli drone dropped light flares over the Rafah fish market area, which led to a fire that ignited the market. This incident occurred amidst heightened tensions between Israel and Palestine."}, {"id": "3570e8fb-bccb-4ee8-874b-d112e404f218", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27700/", "date": "2024-05-23 05:59", "message": "Lebanese media reports that a person was killed in a vehicle that was attacked in Kfar Dajjal in southern Lebanon.", "location": "Kfar Dajjala", "classification": "security", "score": 0.9813513198185226, "event_breakdown": "Security Event:\n\n1. Person killed in vehicle attack in Kfar Dajjal, southern Lebanon."}, {"id": "761a2ed9-b442-46ab-8405-c89110dd9536", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27699/", "date": "2024-05-23 05:58", "message": "The Lebanese report that the attack in Nabatieh (Kfar Dajjal) was around 07:30 and a school bus passing by was hit. 3 passengers of the shuttle were injured (apparently slightly).", "location": "NABATIEH", "classification": "security", "score": 0.9767347263132573, "event_breakdown": "Security Events:\n1. Attack in Nabatieh (Kfar Dajjal) at 07:30.\n2. School bus passing by was hit by the attack.\n3. 3 passengers of the shuttle were injured.\n\nNote: The events are not related to each other."}, {"id": "6f67a1d1-7dfd-42c4-8405-8a55c4ee1acb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27698/", "date": "2024-05-23 05:56", "message": "Lebanese channels: An Israeli drone attacked a vehicle in the Kfar Dajjal area in Nabatieh, in southern Lebanon, this morning.", "location": "Kfar Dajjal area, Nabatieh, southern Lebanon", "classification": "security", "score": 0.9958919892757779, "event_breakdown": "Event 1: An Israeli drone attacked a vehicle in the Kfar Dajjal area in Nabatieh, in southern Lebanon, this morning."}, {"id": "34f02348-3ad0-4839-8bf1-f4f652a7db07", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27695/", "date": "2024-05-23 05:54", "message": "The Palestinian Ministry of Health in Ramallah:\n\n\"The 15-year-old boy Wassim Jaradat was killed in the ongoing Israeli aggression in Jenin. This brings the number of martyrs in Jenin to 11.\"\n\n##\nThe next time they tell you that Israel is \"murdering Palestinian children\", remember the attached videos and photos of \"the boy\" i.e. child-operative Wassim Jaradat, 15 years old, who was killed this evening by IDF fire. He was an operative of the military wing of the Islamic Jihad. He is holding explosives and an assault rifle.", "location": "Jenin.", "classification": "security", "score": 0.9847546474232254, "event_breakdown": "* Israeli aggression in Jenin\n\n* Wassim Jaradat killed, an operative of the military wing of the Islamic Jihad"}, {"id": "4ae0976d-d546-49ea-8650-41abaa3b515a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27722/", "date": "2024-05-23 12:36", "message": "Following the report this morning 👆\n\nIDF: Earlier today (Thursday), the Hezbollah terrorist Muhammad Ali Nasser Faran, responsible for significant weapons manufacturing and proliferation infrastructure, was struck and eliminated by an IAF aircraft in the area of Nabatieh, southern Lebanon.\n\nIn recent years, Ali Nasser Faran was responsible for the manufacturing of strategic and specialized weapons for Hezbollah. Over the last few months, Hezbollah weapons manufacturing infrastructure that he was responsible for has been struck by the IDF.\n\nThe elimination of Ali Nasser Faran is part of the IDF and Israeli security forces' activities to impede Hezbollah’s stockpiling and build-up of weapons designated for use in attacks against Israeli civilians and communities.", "location": "Southern Lebanon", "classification": "security", "score": 0.8744057072919483, "event_breakdown": "null"}, {"id": "283e0a81-b307-414c-9825-14aa5a8cd533", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27720/", "date": "2024-05-23 12:26", "message": "Tehran: Ismail Haniyeh, the chairman of the political bureau of Hamas, rubs shoulders with Iran's new foreign minister, Ali Bagheri Khani.", "location": "Tehran", "classification": "security", "score": 0.8286076687383789, "event_breakdown": "null"}, {"id": "44fc49c2-6d25-458d-bbb0-78191cfcc7a3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27718/", "date": "2024-05-23 12:17", "message": "The body of the Turkish terrorist who carried out the stabbing attack in the Old City of Jerusalem 👆 at the end of last month has landed in Turkey.", "location": "Jerusalem", "classification": "security", "score": 0.9077289390687524, "event_breakdown": "null"}, {"id": "58195ac0-38df-4af8-9fc0-e34fa36307ac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27725/", "date": "2024-05-23 14:50", "message": "The very intimidation of the students is included in the response. An interesting benchmark.", "location": "Based on the text, the main location where the main event takes place is Kent State University.", "classification": "security", "score": 0.5815127740604357, "event_breakdown": "The text does not mention any specific security events. However, it mentions that students were intimidated by the professor's response, which can be seen as a security concern."}, {"id": "4f25b96f-91ff-4fa1-aa5b-6fd5d45e11f4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27724/", "date": "2024-05-23 14:49", "message": "Hezbollah publishes that the latest rocket launch towards Beit Hillel and the launch earlier this morning towards the headquarters of Division 91 (dozens of rockets at a time), are a response to this morning's killing in Nabatieh as well as to the harming and scaring of children (school students - AA).", "location": "BEIRUT", "classification": "security", "score": 0.5790703099703293, "event_breakdown": "Security Events:\nLaunch of rockets towards Beit Hillel\nLaunch of rockets towards Division 91 headquarters\nKilling in Nabatieh"}, {"id": "8269b494-6cb8-4b41-bd5c-0a39a1b78c29", "channel_id": 1574173609, "url": "https://t.me/Mabaterror1", "date": "2024-05-23 14:39", "message": "מנהיג החות'ים, עבד אל-מאלכ אל-חות'י מסכם שבוע וסוקר את פעילות החות'ים:\n\n\"ביצענו 8 פעולות עם 15 טילים ומזל\"טים בים האדום ובים הערבי, במפרץ עדן ובאוקיינוס   ההודי.\n\nאחד המבצעים הצבאיים שלנו השבוע בוצע לעבר הים התיכון.\n\nמספר הספינות שנורו עד כה הגיע ל-119, ספינות הקשורות לאויב הישראלי, אמריקאי ובריטי.\n\nבמהלך השבוע, שני מטוסי 9MQ אמריקאים הופלו במרחב האווירי של נפות מארב ואל-ביצ'אא'\n\nמטוס ה-MQ9 הוא אחד ממטוסי הסיור החמושים האמריקאיים החשובים ביותר, והפלתו נחשבת להישג חשוב להגנה אווירית.\"\n\nערן להב - מבטרור\n\n301 העולם הערבי בטלגרם", "location": ")\nנקבעה בתשובה הב", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "Event 1: The Navy of one country successfully conducted a military exercise over the Pacific and Indian Oceans.\nEvent 2: One of Israel's enemies, an American and British drone, crashed into the Mediterranean Sea.\nEvent 3: The number of sorties related to the Israeli, American, and British enemy reached 119."}, {"id": "6274efeb-3408-48cc-bb85-aaf8a322db0a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27737/", "date": "2024-05-23 19:01", "message": "The Palestinians report 12 deaths in an IDF attack on a warehouse of the Ministry of Welfare in Deir al-Balah in the center of the Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.9678332394420573, "event_breakdown": "Security Events:\n\n1. IDF attack on a warehouse of the Ministry of Welfare in Deir al-Balah in the center of the Gaza Strip.\n2. The Palestinians report 12 deaths in the IDF attack on the warehouse in Deir al-Balah."}, {"id": "171c8c50-60b9-4360-9252-181e8941dc9a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27736/", "date": "2024-05-23 18:30", "message": "IDF: The IDF and ISA eliminated the Commander of Hamas’ Beit Hanoun Battalion in an underground area in Jabaliya\n\nAs part of IDF operational activity in the area of Jabaliya, IAF special forces and the 'Yahalom' Unit eliminated the terrorist Hussein Fiad, the Commander of Hamas’ Beit Hanoun Battalion, during special operational activity in an underground area. \n\nFiad was responsible for launching a significant number of the anti-tank missiles that were fired at Israeli territory throughout the war, along with extensive mortar fire toward Israeli communities near the northern Gaza Strip.\n\nFiad's elimination is part of the IDF's operational activity above and below ground to locate tunnels and eliminate the terrorists operating within them.", "location": "Jabaliya", "classification": "security", "score": 0.9841791003672727, "event_breakdown": "Security Events:\n\n1. Operation in Jabaliya, Gaza to eliminate terrorist Hussein Fiad, Commander of Hamas’ Beit Hanoun Battalion.\n2. Special armed forces, including IAF special forces and ‘Yahalom’ Unit, involved in eliminating terrorist Fiad in underground area.\n3. Fiad responsible for firing anti-tank missiles and mortars at Israeli territory.\n4. Operational activity to locate and eliminate underground tunnels and terrorists operating within them."}, {"id": "d1086741-1d1c-4ff2-b0c6-94ecdf8a8e05", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27735/", "date": "2024-05-23 15:40", "message": "Turkey: The funeral of the Turkish terrorist who carried out the stabbing attack in the Old City of Jerusalem at the end of April.", "location": "JERUSALEM", "classification": "security", "score": 0.956739436890306, "event_breakdown": "Security Events:\n\n1. Stabbing attack in the Old City of Jerusalem at the end of April by a Turk.\n\n2. Funeral of the Turkish terrorist responsible for the attack in Jerusalem."}, {"id": "8a2b5378-4615-483b-b829-ed1dd106f710", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27733/", "date": "2024-05-23 15:40", "message": "The Palestinians complain: \"The occupation soldiers left behind packages of meals that they brought from McDonald's inside one of the Jenin community centers, where they stayed during the last activity there\"", "location": "JENIN", "classification": "security", "score": 0.9143536511074414, "event_breakdown": "Security Events:\n\n1. Israeli soldiers left packages of meals from McDonald's inside one of the Jenin community centers.\n2. Israeli soldiers stayed at the Jenin community center during the last activity held there."}, {"id": "c97126ea-432f-4a73-94cc-26b9f36bcca3", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb67330/", "date": "2024-05-23 15:15", "message": "Palestinian channels: Dia' a-Din al-Shurafa, the deputy commander of the Hamas national security forces in the Gaza Strip, in the rank equivalent to a general, was killed this morning in an IDF attack in the al-Saraya area of ​​Gaza City.\n\nFour Hamas officers who were near him were injured in the attack.\n\nThe Hamas Interior Ministry confirmed the elimination.", "location": "Gaza City", "classification": "security", "score": 0.9967710960109186, "event_breakdown": "Security Events:\n\n1. Death of Dia' a-Din al-Shurafa, deputy commander of the Hamas national security forces in the Gaza Strip, in an attack in the al-Saraya area of   Gaza City.\n2. Four Hamas officers were injured in the same attack."}, {"id": "09b40ced-9225-43a2-ad63-acc741717f70", "channel_id": 1574173609, "url": "https://t.me/tzevaadomm", "date": "2024-05-23 15:43", "message": "✈️ חדירת כלי טיס עוין (23/05/2024):\n\n18:42:\n• קו העימות: בית הלל, כפר גלעדי, כפר יובל, מטולה, מנרה, מעיין ברוך, מרגליות, משגב עם, קריית שמונה, תל חי, דפנה, הגושרים, ע'ג'ר, קיבוץ דן, שאר ישוב, שניר \n\nצופר - צבע אדום", "location": "חדירת כלי טיס", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "Security Events:\n1. Home Alone at Ben Gurion Airport\n2. North of Damascus, southeast, Crash site Eastern Ghouta\n3. Strikes on Qamishli Airport and Conon\n4. Ceasefire Violations in Eastern Syria\n5. Russian and Syrian Missile Strikes on Idlib\n6. Drones approaching Baghdad's Arc of Victory\n7. Missile Launch from Yemen towards UAE\n8. Israeli Strikes on Zeitun and Qaba, Damascus\n9. Libyan Air Force Strikes on Tarhuna Base"}]