[{"id": "2f96ad7f-9dcc-4e78-a007-43fe8b780c7a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26678/", "date": "2024-05-04 17:47", "message": "Palestinian channels report: The IDF attacked the home of the prominent journalist in the Gaza Strip, Hassan Aslih (Hamas-affiliated) in the Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip.\nThere were no casualties in the attack.", "location": "Manara neighborhood, Khan Yunis, Gaza Strip", "classification": "security", "score": 0.9953827602700771, "event_breakdown": "- IDF attack on the home of journalist Hassan Aslih in Manara neighborhood, eastern Khan Yunis, southern Gaza Strip."}, {"id": "709148be-427e-4742-8e7d-43d5014dc2d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26677/", "date": "2024-05-04 17:31", "message": "Palestinian channels: The Palestinian Authority's security mechanisms detonated, in a controlled manner, explosive devices they located in Tubas (Northeastern Samaria).", "location": "Tubas", "classification": "security", "score": 0.9948419961865298, "event_breakdown": "- Explosive devices located in Tubas, Northeastern Samaria, detonated by Palestinian Authority's security mechanisms in a controlled manner."}, {"id": "fe4d6126-252c-4b79-891e-bc9d569ae53e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26676/", "date": "2024-05-04 17:20", "message": "Hamas-identified channels: All four killed (whose names have been published) 👆 in the IDF's activity in the village of Deir al-Ghusun in the north of Tulkarm, were operatives of the military wing of Hamas.\nAlaa Sharitah was the commander of the military wing of Hamas in Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9934812200416727, "event_breakdown": "- IDF activity in the village of Deir al-Ghusun results in the killing of four Hamas operatives\n- Alaa Sharitah identified as the commander of the military wing of Hamas in Tulkarm"}, {"id": "58c1940b-5220-42bb-b902-932ab0af73b6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26675/", "date": "2024-05-04 17:19", "message": "Further to this👆\nA joint statement to the IDF spokesperson, the police spokesperson and the Shin Bet spokesperson:\n\nThe soldiers of Yamam, the IDF and the Shin Bet eliminated five terrorists who had barricaded themselves in a building in Tulkarm in a 12-hour battle\n\nThe soldiers of the Yamam, IDF and Shin Bet, under the precise intelligence guidance of the Shin Bet and IDF Intelligence, operated for over 12 hours in Tulkarm in a targeted activity to defeat a terrorist cell.\n\nThe soldiers closed in on a building where the terrorist squad was entrenched, which opened fire on them. The fighters responded by shooting with shoulder-fired missiles and other means from the building, and at the end of the exchange of fire, the five terrorists were eliminated.\nMilitary equipment and weapon parts were confiscated.\n\nDuring the activity, an IDF fighter was injured and brought to continue receiving medical treatment in a hospital; his family was informed.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9849329956770798, "event_breakdown": "- Joint operation by Yamam, IDF, and Shin Bet to eliminate five terrorists in Tulkarm after a 12-hour battle\n- Soldiers closed in on a building where the terrorists were hiding and engaged in a gunfight\n- Five terrorists were killed at the end of the exchange of fire\n- Confiscation of military equipment and weapon parts\n- An IDF fighter was injured during the operation and taken to a hospital for medical treatment"}, {"id": "c83774b6-721c-4412-93dd-b5a50504cf9a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26674/", "date": "2024-05-04 16:10", "message": "The Palestinians publish the names of four of the \"martyrs\" who were killed in the IDF operation tonight in the village of Deir el Ghusun in the north of Tulkarm:\n\n1. Alaa Sharith (the leftmost one).\n2. Tamer Fuqaha (next to Alaa' - both are behind the attack in which Elhanan Klein fell in November 2023. Tamer is also an operative of Erin al Aswad).\n3. Adnan Samara\n4. Asal Badran\n\nIn addition, there is the \"headless martyr\" who has not yet been identified - DNA tests will be conducted on him to confirm his identity.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9791185685870558, "event_breakdown": "1. Palestinians publish names of four \"martyrs\" killed in IDF operation in Deir el Ghusun:\n   - Alaa Sharith\n   - Tamer Fuqaha\n   - Adnan Samara\n   - Asal Badran\n\n2. Unidentified \"headless martyr\" to undergo DNA testing for identification."}, {"id": "dca2bb8d-cd34-4f15-86b4-7ec10da4eea0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26673/", "date": "2024-05-04 15:36", "message": "The Palestinians report that the IDF forces have finished their activities in Deir al-Ghusun in the north of Tulkarm and have left.\nSources in Tulkarm say that the Palestinian rescue forces located another Palestinian \"martyr\" among the ruins, apparently headless.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9671169206516085, "event_breakdown": "- IDF forces finish activities in Deir al-Ghusun, north of Tulkarm and leave\n- Palestinian rescue forces find another Palestinian \"martyr\" among the ruins, apparently headless"}, {"id": "77f7babc-2a0a-4b75-873c-3f08139ae1ce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26672/", "date": "2024-05-04 14:06", "message": "The Palestinians report that the person who came out from under the ruins of the house in Deir al-Ghusun and was arrested by IDF forces is the released prisoner Salma Badran, an operative of the military wing of Hamas with a \"heavy\" family lineage: he is the brother of the two \"martyrs\" of the wing - Fawaz and Seif Allah Badran. Salma is the owner of the apartment where the Hamas terrorists hid last night and which the IDF destroyed.\n\nFawaz (Salma's brother) was one of the senior bomb engineers of the Izz ad-Din al-Qassam Brigades in the West Bank and was the one who assembled the explosive device that exploded in the first suicide attack of the second intifada (March 2001), in which 3 Israeli citizens were killed in Netanya. Fawaz was also the one who recruited the suicide bomber for the attack and also guided other suicide bombers in Tulkarm. He was eliminated by the Israeli security forces that year using an explosive device planted in his car.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9989665591672134, "event_breakdown": "1. Salma Badran, a released prisoner and Hamas operative, was arrested by IDF forces after coming out from under the ruins of a house in Deir al-Ghusun.\n2. Salma Badran is the brother of two deceased members of the Hamas military wing, Fawaz and Seif Allah Badran.\n3. Fawaz Badran was a senior bomb engineer for the Izz ad-Din al-Qassam Brigades in the West Bank responsible for assembling an explosive device that caused casualties in Netanya during the second intifada.\n4. Fawaz Badran recruited suicide bombers and guided attacks in Tulkarm before being eliminated by Israeli security forces with an explosive device planted in his car."}, {"id": "3166e4c0-4034-4497-b9fb-ddbfd635a903", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26671/", "date": "2024-05-04 14:00", "message": "The official Palestinian news agency Wafa: 6 Palestinians were killed in the IDF operation in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9664112263099419, "event_breakdown": "- IDF operation in the village of Deir al-Ghusun, north of Tulkarm, Palestine:\n  - Six Palestinians killed"}, {"id": "eeb6b7a2-2daf-4f94-b987-d086611127b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26668/", "date": "2024-05-04 13:56", "message": "More footage from Deir al-Ghusun north of Tulkarm from the IDF operation today.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.5645468611123309, "event_breakdown": "1. More footage released from Deir al-Ghusun north of Tulkarm.\n2. The footage is from an IDF operation conducted on the same day."}, {"id": "f24fe8c0-168f-4cc4-ab7f-89e67fdd89b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Palestinian sources in Tulkarm claim that Tamer Fuqaha, an operative of the military wing of Hamas, (and the terrorist who carried out the attack in which Elhanan Klein fell on November 2, 2023), was killed in an IDF operation tonight in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9920826670749956, "event_breakdown": "- Tamer Fuqaha, a Hamas operative responsible for the attack on Elhanan Klein, was killed in an IDF operation in Deir al-Ghusun, Tulkarm."}, {"id": "6c16227a-511f-4207-9b7f-9f5b113bed18", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Deir al-Ghusun north of Tulkarm:\nThe IDF forces packed the body of the Palestinian who was killed in the area of ​​the building.\n\nPalestinian sources claim the IDF forces took 3 bodies.\n\nIDF forces then arrested a Palestinian who emerged from under the ruins of the house that the forces had besieged for many hours.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9879003899097348, "event_breakdown": "1. IDF forces packed the body of a Palestinian killed in Deir al-Ghusun, north of Tulkarm.\n2. Palestinian sources claim IDF forces took 3 bodies in Deir al-Ghusun.\n3. IDF forces arrested a Palestinian emerging from under the ruins of a house besieged for many hours in Deir al-Ghusun."}, {"id": "544c0737-9d3c-4a21-a574-3a999c89058d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26661/", "date": "2024-05-04 13:10", "message": "The \"Holy Fire\" ceremony held today in the Church of the Holy Sepulcher in East Jerusalem as part of the \"Sabbath of Light\" that Christians celebrate today.", "location": "Church of the Holy Sepulcher", "classification": "security", "score": 0.7164941467590658, "event_breakdown": "1. \"Holy Fire\" Ceremony at the Church of the Holy Sepulcher, East Jerusalem\n\n- The \"Holy Fire\" ceremony was held today at the Church of the Holy Sepulcher in East Jerusalem.\n- The ceremony is part of the \"Sabbath of Light\" observed by Christians.\n- Location: Church of the Holy Sepulcher, East Jerusalem."}, {"id": "86742bce-d146-459b-acb0-02e2a68389aa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26658/", "date": "2024-05-04 13:07", "message": "For nearly ten hours starting last night, IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm.\nAccording to the estimates, the terrorists Tamer Fakha and Alaa Sharitah, the operatives of the military wing of Hamas involved in the shooting attack in which Major General Elhanan Klein was killed near Beit Lid on November 2, 2023, were hiding in the house.\nSources associated with Hamas and Islamic Jihad operatives claim that the two managed to escape from the house which was surrounded by the IDF for many hours and fired upon by a large number of missles (and finally destroyed with a bulldozer - in the attached videos you can see the shooting and the demolition the house).", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9796365504234397, "event_breakdown": "- IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm\n- Terrorists Tamer Fakha and Alaa Sharitah, associated with Hamas, were believed to be hiding in the house\n- The house was surrounded by IDF for many hours and fired upon with missiles\n- The two terrorists managed to escape from the house\n- The house was eventually destroyed with a bulldozer"}, {"id": "60d68761-bb43-4a26-b333-2965c51cfaab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26657/", "date": "2024-05-04 13:02", "message": "The Al Jazeera network claims: an Israeli drone launched a missile a few hours ago at a vehicle in Bint Jabil in southern Lebanon.\n\nUnofficial Lebanese sources: No casualties.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9652451684275815, "event_breakdown": "- An Israeli drone launched a missile at a vehicle in Bint Jabil, southern Lebanon according to Al Jazeera.\n- Unofficial Lebanese sources reported no casualties."}, {"id": "cc1a94b8-8c9c-4042-940c-ffe15f522399", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26656/", "date": "2024-05-04 12:30", "message": "The Qatari Al Jazeera cites a report by Reuters according to which Qatar is considering closing the offices of the political office of Hamas in its territory as part of an overall plan to continue its function as a mediator in the conflict between Hamas and Israel.", "location": "Qatar", "classification": "security", "score": 0.9065846889429762, "event_breakdown": "- Al Jazeera cites Reuters report\n- Qatar considers closing Hamas political office in its territory\n- Part of a plan to mediate conflict between Hamas and Israel"}, {"id": "21e8991c-f57b-405a-8494-3643edbe4a0f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26655/", "date": "2024-05-04 12:29", "message": "At least 3 different Israeli military reporters publish the exact same message:\n\nPolitical actor:\n\nContrary to the publications, Israel will under no circumstances agree to the end of the war as part of an agreement to release our abductees.\n\nAs the political echelon decided, the IDF will enter Rafah and destroy the remaining Hamas battalions there - whether or not there will be a temporary respite for the release of our hostages.", "location": "Rafah", "classification": "security", "score": 0.6696081489195264, "event_breakdown": "- Three Israeli military reporters simultaneously publish the message that Israel will not agree to end the war as part of an agreement to release abductees\n- The Israeli political echelon decides that IDF will enter Rafah to destroy remaining Hamas battalions, regardless of temporary respite for hostage release"}, {"id": "b7d03e52-b726-4daf-b73a-3b9255ecc287", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26653/", "date": "2024-05-04 12:27", "message": "Today, Lebanese sources report: Hezbollah will soon submit its comments to the French proposal to end the war in southern Lebanon\n\nJournalist sources in Lebanon state that Hezbollah and the Amal movement discussed the French proposal and decided not to reject it (so as not to be perceived as refusers - AA) but to submit 10 comments to amend the proposal.\nThe comments will be forwarded to the Speaker of the Lebanese Parliament (who happens to also be the head of the Amal Shiite movement fighting alongside Hezbollah in southern Lebanon - AA) and he will discuss them with Prime Minister Mikati and forward them to the French side.", "location": "Southern Lebanon", "classification": "security", "score": 0.9143945024805114, "event_breakdown": "Lebanese sources report that Hezbollah will soon submit comments on the French proposal to end the war in southern Lebanon. Journalist sources state that Hezbollah and the Amal movement discussed the proposal and decided to submit 10 comments for amendment, which will be forwarded to the Speaker of the Lebanese Parliament for discussion with Prime Minister Mikati before being sent to the French side."}, {"id": "36034948-849d-4aee-95ff-fb0ae602966b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26650/", "date": "2024-05-03 20:33", "message": "The Saudi Asharq channel from its sources:\nHamas obtained American confirmation through the Egyptian and Qatari mediators that the term \"sustainable peace\" that appears in the agreement is in fact a permanent ceasefire.\n\n##\nI remind you, this will make or break the agreement.\nIf Hamas receives guarantees not to resume fighting, it will sign the agreement.\nThere are no disputes between the parties regarding the other sections.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.8031684638552474, "event_breakdown": "- Hamas obtains American confirmation on \"sustainable peace\" through Egyptian and Qatari mediators"}, {"id": "f0fa7ddc-8773-45f4-b049-d70a70bad241", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26649/", "date": "2024-05-03 20:30", "message": "Documentation of one of today's attacks in the area of ​​the displaced persons' tents in Rafah in the south of the Gaza Strip - note the rocket rising into the sky. This indicates a precise hit by the aircraft on the target.", "location": "Rafah", "classification": "security", "score": 0.9952821119807056, "event_breakdown": "- Location: Displaced persons' tents in Rafah, south of the Gaza Strip\n- Event: Attack on the area with a rocket rising into the sky, indicating a precise hit by an aircraft on the target"}, {"id": "e0f01a42-883c-420e-8c80-a0e525865317", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26648/", "date": "2024-05-03 20:27", "message": "Hamas in an official announcement:\n\nIn light of the recent contacts with the mediators, tomorrow a delegation of the movement will arrive in Cairo to complete the talks.\n\nWe emphasize that the leadership of the movement reacted in a positive spirit to the proposal it received while discussing it. We are going to Cairo in the same positive atmosphere to reach an agreement.\n\nWe are determined to reach an agreement that will realize the demands of our people for a total cessation of aggression, the withdrawal of forces, the return of the displaced, aid to our people, the beginning of the reconstruction of the Gaza Strip and a serious exchange deal.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.3907896760166591, "event_breakdown": "- Hamas announces a delegation will arrive in Cairo to complete talks\n- Hamas leadership reacted positively to the proposal received while discussing\n- Hamas determined to reach an agreement for cessation of aggression, withdrawal of forces, return of displaced, aid to people, beginning of Gaza Strip reconstruction, and exchange deal"}, {"id": "b9d8cb73-0f2c-455c-aed6-f1b7ccccc8a3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26644/", "date": "2024-05-03 17:44", "message": "Reuters from a senior Hamas official: a Hamas delegation will arrive in Cairo tomorrow.", "location": "Cairo, Egypt.", "classification": "security", "score": 0.9023652992005777, "event_breakdown": "- Hamas delegation to arrive in Cairo tomorrow"}, {"id": "19e77b82-1d60-448b-9906-22375b5baf93", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26643/", "date": "2024-05-03 16:51", "message": "The Houthis clarify the words of the Houthi military spokesman and point out that starting today every ship that docks in an Israeli port will be \"marked\" and as soon as it passes through an area within the reach of the Houthis it will be attacked even if it is not on its way to an Israeli port at the time.\n\nIf Israel enters Rafah, the next step for the Houthis will be to attack all ships belonging to companies that even one of their ships docks in Israeli ports.", "location": "Rafah", "classification": "security", "score": 0.4099593512202328, "event_breakdown": "- Houthis announce plans to attack any ship docking in Israeli ports\n- Houthis threaten to target ships passing through areas within their reach\n- Potential escalation if Israel enters Rafah: Houthis to target ships of companies with ties to Israeli ports"}, {"id": "4d8c08c2-18e3-48dc-91aa-486820ec7bda", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26642/", "date": "2024-05-03 16:36", "message": "One of the signs of abundance in the northern Gaza Strip: Gazan donkeys receive fresh pita bread\n\nA Gazan from the north of the Gaza Strip to the donkey: once (when there was a shortage of bread) we ate from your food, now take and eat bread from today. You are better than many people...", "location": "Gaza Strip", "classification": "security", "score": 0.8432632263954416, "event_breakdown": "- Gazan donkeys in the northern Gaza Strip receive fresh pita bread. \n- A Gazan from the north of the Gaza Strip offers fresh bread to the donkeys, expressing gratitude and acknowledging their importance."}, {"id": "4727e90d-f071-4a22-ae51-d4922a8dad89", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26641/", "date": "2024-05-03 16:28", "message": "American Central Command:\n\nDue to weather conditions, construction work on the floating pier off the coast of Gaza was stopped and it was moved to Ashdod port, where its construction will be completed.\n\nAfter the completion of its construction, it will be floated along the shores of Gaza to the place where it was planned to be placed.", "location": "Ashdod port", "classification": "security", "score": 0.8222928362890448, "event_breakdown": "- Construction work on the floating pier off the coast of Gaza was moved to Ashdod port due to weather conditions\n- The construction of the floating pier will be completed in Ashdod port\n- The completed floating pier will be floated along the shores of Gaza to its intended location"}, {"id": "e0fceb89-fe5f-441d-bb73-901dbea0be2e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26640/", "date": "2024-05-03 15:56", "message": "Reuters from an Egyptian source:\n\nThe head of the CIA, William Burns, arrived in Cairo to promote the ceasefire in Gaza.\n\n##\nThe Americans are using all their weight and are firing their heaviest guns to reach a ceasefire.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.8731912994868349, "event_breakdown": "- Head of the CIA, William Burns, arrives in Cairo to promote the ceasefire in Gaza, according to Reuters from an Egyptian source."}, {"id": "0e79cf9f-8851-4f79-870a-74c44f079ab3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26639/", "date": "2024-05-03 15:55", "message": "The Palestinian Ministry of Health in Gaza:\n26 dead in the Strip in the last day.\n\nThe number of deaths in the last few days:\n28\n33\n47\n34\n\nTotal dead in the Gaza Strip since the beginning of the war: 34,622. Total wounded: about 78 thousand.\n\n##\nIn the last day, the number of dead was the lowest in the Gaza Strip since the beginning of the war (with the exception of the hodna period in November 2023).", "location": "Gaza Strip", "classification": "security", "score": 0.8569080015487186, "event_breakdown": "- 26 dead reported in the Gaza Strip\n- Total number of deaths in the past few days: 28, 33, 47, 34\n- Total dead in the Gaza Strip since the beginning of the war: 34,622; total wounded: about 78,000\n- Lowest number of deaths in the Gaza Strip in the last day since the war started (excluding hodna period in November 2023)"}, {"id": "2799226b-8cc2-4365-ad08-0c48480ac41d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26633/", "date": "2024-05-03 13:36", "message": "Paris: French security forces break into Sciences Po the Institute of Political Science to break up an anti-Israel demonstration by the students there.", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.9281242816179448, "event_breakdown": "1. French security forces break into Sciences Po, the Institute of Political Science in Paris to break up an anti-Israel demonstration by students."}, {"id": "5994db2a-93b7-4074-9949-6f6528664478", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26630/", "date": "2024-05-03 13:15", "message": "About 100,000 Palestinians have left the Gaza Strip since the beginning of the war\n\nThe Palestinian ambassador in Egypt: since the beginning of the war and until April, 85 thousand Palestinians left the Gaza Strip for Egypt through the Rafah crossing.\n\nTaking the month of April into account, it can be estimated that about one hundred thousand Palestinians left the Strip since the beginning of the war.", "location": "Rafah crossing", "classification": "security", "score": 0.8683848530412968, "event_breakdown": "- About 100,000 Palestinians have left the Gaza Strip since the beginning of the war, with 85 thousand leaving for Egypt through the Rafah crossing until April."}, {"id": "57bb76ad-b3cc-4fbb-a4df-1ff3ca4946e0", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65962/", "date": "2024-05-03 13:11", "message": "A must watch:\n\nStudents from the \"Free Palestine Army\" charge Portland police officer with shields made from trash cans.\n\n##\nNot the sharpest tools in the shed...", "location": "PORTLAND", "classification": "security", "score": 0.7716378859605466, "event_breakdown": "- Students from the \"Free Palestine Army\" charge at Portland police officer\n- Students use shields made from trash cans"}, {"id": "2b5f4dc6-40e2-437c-adf0-83b387540b13", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26628/", "date": "2024-05-03 13:11", "message": "Fox News: The Iranian flag was raised by the students at the University of Irvine in California.\n\nIran is offering scholarships to students who will be expelled from US universities following the protests.", "location": "University of Irvine, California", "classification": "security", "score": 0.38395330639266484, "event_breakdown": "1. Iranian flag raised by students at University of Irvine in California\n2. Iran offers scholarships to US students facing expulsion after protests"}, {"id": "798a87a0-5080-4dd8-ac1a-279efc9fa5a6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26625/", "date": "2024-05-03 11:05", "message": "Reuters from the Turkish Minister of Commerce:\n\nThe suspension of trade with Israel will continue until a permanent cease-fire in Gaza and until Israel allows all aid into the strip. \n\n##\nTurkey has de-facto joined the Shiite axis - like the Houthis... they are harming the Israeli economy until a ceasefire is reached. The Sultan became a Houthi pirate.\n\nIsrael should remember this when Turkey wants to resume trade between the countries.", "location": "Gaza", "classification": "security", "score": 0.9341793288581125, "event_breakdown": "Turkish Minister of Commerce announces the continuation of the suspension of trade with Israel until a permanent ceasefire in Gaza and until Israel allows all aid into the strip. This move is seen as Turkey aligning with the Shiite axis and is perceived as harming the Israeli economy until a ceasefire is achieved."}, {"id": "fe428771-f057-47be-9f91-8c4ef5433637", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26624/", "date": "2024-05-03 11:04", "message": "The Shia militias in Iraq claim:\nYesterday afternoon (May 2nd) we launched two cruise missiles from Iraq at a target in Tel Aviv and at a target in Be'er Sheva.\n\nThe militias in Iraq also claim that they attacked an Israeli target in the Dead Sea early this morning \"with appropriate weapons\".\n\n###\nSources of the Lebanese al-Mayadeen claim that the Iraqi cruise missiles were launched at the Glilot Base in Tel Aviv and the Avraham Base in Be'er Sheva.", "location": "Tel Aviv", "classification": "security", "score": 0.9833649319691411, "event_breakdown": "null"}, {"id": "77ceabf7-2c92-44d5-8541-7468b0544791", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26623/", "date": "2024-05-03 10:23", "message": "The coup in Niger: Russian soldiers reportedly enter a military base where the American troops are stationed\n\nAccording to Reuters, Russian soldiers have entered a military air base housing American forces in the capital of Niger.\n\nAs you might remember, last year there was a coup in Niger and the military junta that seized power demanded that the US terminate the agreement with it and... remove all American forces from Niger.\n\nThe American forces have not yet evacuated and now they have new \"guests\" at their base.\n\nAmerican officials state that the Russian and American soldiers remain in separate areas at the base. The American Secretary of Defense spoke out on the matter and said that there is no fear that the Russians will get their hands on American equipment.\n\n##\nThe Taliban send their regards..", "location": "该ip请求过多已被暂时限流 过两分钟再试试吧(目前限制了每小时60次 正常人完全够用,学校网络和公司网络等同网络下共用额度,如果限制了可以尝试切换网络使用 ),本网站正版地址是 https://chat18.aichatos.xyz 如果你在其他网站遇到此报错，请访问https://chat18.aichatos8.xyz ，如果你已经在本网站，请关闭代理，不要使用公共网络访问,如需购买独立次数请访问 https://binjie09.shop", "classification": "security", "score": 0.7709916187413431, "event_breakdown": "Russian soldiers reportedly enter a military base housing American forces in the capital of Niger, according to Reuters. This comes after a coup in Niger last year, where the military junta demanded the removal of all American forces. American officials state that Russian and American soldiers remain in separate areas at the base, with no fear of Russians accessing American equipment."}, {"id": "c7ff0879-b3d9-4b9c-9a88-2933dc661a71", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26620/", "date": "2024-05-03 06:44", "message": "Last night's attack in Damascus, attributed to Israel\n\nSyrian sources identified with the Shiite axis report that the target of the Israeli attack in Damascus was the \"State Security School\" (of the Syrian Army - AA), near the village of Najaha, and as a result, a three-story building was severely damaged there.\nAccording to these sources, the target of the attack belonged to the Syrian army and not to Iranian elements in Syria.\n\nThe Syrian Ministry of Defense officially announced that Israel carried out an airstrike last night at 10:05 PM which resulted in the injury of 8 Syrian soldiers and damage to property.", "location": "Damascus", "classification": "security", "score": 0.9816944407775801, "event_breakdown": "- Last night's attack in Damascus, attributed to Israel, targeted the \"State Security School\" near the village of Najaha, severely damaging a three-story building\n- Syrian Ministry of Defense officially announced that an Israeli airstrike at 10:05 PM resulted in the injury of 8 Syrian soldiers and property damage."}, {"id": "3567a12a-2fd1-45e1-9447-88c08053ad0f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26618/", "date": "2024-05-02 20:19", "message": "Palestinian sources report the death of officer Muhammad Adas, one of the companions of Palestinian Authority Chairman Abu Mazen from the Presidential Guard, as a result of an IDF shot that hit him in the head during the entry of IDF forces into the village of Anbata in the Tulkarm district in the last hour.", "location": "Anbata", "classification": "security", "score": 0.9884898904177141, "event_breakdown": "- Death of officer Muhammad Adas in the village of Anbata, Tulkarm district\n- Officer Muhammad Adas was shot in the head by IDF forces during their entry into the village"}]