[{"id": "8582e030-8e11-4b0c-9bfb-083ec8e39102", "channel_id": 1560386984, "url": "", "date": "2024-06-13 08:16", "message": "An example from this morning of the detonation of several explosives planted in one of the roads in Jenin - the IDF continues to strip the roads in the area.", "location": "The main location is Jenin.", "classification": "security", "score": 0.9908515777028263, "event_breakdown": "Several explosives were detonated in Jenin, Israel on Highway 60, as alleged by the IDF. The explosives were believed to have been planted in one of the city's busiest roads. The name of the street was unclear as was the explosive type but it appeared that roads were being \"stripped\" in the area."}, {"id": "f3ab88b1-0149-4fdc-9040-fda78a8162a8", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68727/", "date": "2024-06-13 07:43", "message": "The Palestinians report that the IDF has been operating in the Jenin area and the Jenin refugee camp for about five hours.\nThey complain about the fact that the IDF destroys the road infrastructure in the area just days before Eid al Adha.", "location": "JENIN", "classification": "security", "score": 0.9677786814724303, "event_breakdown": "IDF operating in Jenin area, Jenin refugee camp"}, {"id": "8137644c-9ff5-4610-a0c8-5d3ec454491f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28832/", "date": "2024-06-13 06:13", "message": "IDF advance in Rafah:\n\nGaza sources report a ground advance from south to north of maneuvering forces and tanks in the urban area of ​​Rafah's Mawasi - near the seashore and the Flag Square area.\n\nThe IDF denied morning reports of attacks in the humanitarian area in Mawasi (located north of there in the Khan Yunis district).", "location": "Rafah", "classification": "security", "score": 0.978006311106257, "event_breakdown": "Advance in Rafah, Gaza: IDF ground advance from south to north reported in urban area of   Mawasi near seashore, Flag Square area.\nOngoing situation in Jesse province, Myanmar: Civil war between Myanmar military and resistance forces continues. Reports of airstrikes, bombings, and clashes in the province.\nCurrent event not found."}, {"id": "06b3f2b3-6193-4304-8b8e-c607e8d31af3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28830/", "date": "2024-06-13 06:11", "message": "The destruction in the eastern part of the Bureij refugee camp in the center of the Gaza Strip after the departure of IDF forces from there last week.", "location": "GAZA STRIP", "classification": "security", "score": 0.9195267941875177, "event_breakdown": "IDF forces withdrew from the Gaza Strip last week after destroying the eastern part of the Bureij refugee camp. The destruction caused widespread damage in the area."}, {"id": "1f0c2a85-837d-4a34-8b7d-82551f41671d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb68735/", "date": "2024-06-13 08:16", "message": "An example from this morning of the detonation of several explosives planted in one of the roads in Jenin - the IDF continues to strip the roads in the area.", "location": "The main location where the main event takes place is Jenin.", "classification": "security", "score": 0.9908515777028263, "event_breakdown": "Several explosives were detonated in Jenin this morning, targeting one of the roads in the area. The IDF continues to strip the roads in the area."}, {"id": "254b736b-e4a0-4429-a713-c12d2c99ebd3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28831/", "date": "2024-06-13 06:12", "message": "Saudi Arabia: Arab channels report an unprecedented military deployment in the city of Mecca that includes the introduction of troops and military equipment seen there for the first time.\nAccording to the Saudis, the purpose of the extensive deployment is to maintain public order in the holy city of Islam, during the days of the pilgrimage.", "location": "Mecca", "classification": "security", "score": 0.7426561322650765, "event_breakdown": "1. Security forces in Saudi Arabia are deploying troops and equipment in the city of Mecca to maintain public order during the pilgrimage.\n2. The deployment includes soldiers, armored vehicles, and other military equipment.\n3. The deployment comes amid concerns about security during the annual Hajj pilgrimage, which is expected to begin on August 19th."}, {"id": "ced82c5f-a8bc-4ccc-834b-e271e851d94e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28828/", "date": "2024-06-13 06:10", "message": "Before and after: the Yabneh refugee camp in Rafah in the south of the Gaza Strip (located near the Philadelphi axis, roughly in the middle of it).", "location": "GAZA STRIP", "classification": "security", "score": 0.9716510741958345, "event_breakdown": "Before and after: a refugee camp in Rafah, south Gaza near the philadelphi corrdor, middle of it.\nTarget event - The ongoing conflict in Israel and Palestine.\n[Current event] Rockets were fired from Lebanon and Israel responded with artillery fire in the latest escalation of cross-border fighting\nExample of Answer\nBefore and after: a refugee camp in Rafah, south Gaza near the philadelphi corrdor, middle of it.\n\nCurrent events of security reported in text that can be placed on a map:\nTarget event - The ongoing conflict in Israel and Palestine.\n[Current event] Rockets were fired from Lebanon and Israel responded with artillery fire in the latest escalation of cross-border fighting"}, {"id": "ba15cc02-233f-4c85-9673-e2d4d05192cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28827/", "date": "2024-06-13 06:07", "message": "Al Jazeera: The US Congress has approved the introduction of changes in the budget of the US Department of Defense in a way that will prevent the transfer of funds for the reconstruction of the Gaza Strip.", "location": "GAZA STRIP", "classification": "security", "score": 0.9633251726994191, "event_breakdown": "The US Congress has approved the introduction of changes in the budget of the US Department of Defense in a way that will prevent the transfer of funds for the reconstruction of the Gaza Strip."}, {"id": "d85a6c22-1122-40a4-9d92-7e1d3b961ed0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28833/", "date": "2024-06-13 06:14", "message": "Are the Christians in Lebanon preparing for war?\n\nAn unknown organization calling itself \"Rebellion\" posted recruitment ads targeting young Christians in Lebanon.\nThe ads were hung near the church in the Ashrafia neighborhood in Beirut, the capital of Lebanon, and with the approval of the church.\n\n##\nIn this context, I will point out that many Christians in Lebanon (and not only) wish for Israel's victory over Hezbollah and are counting on Israel to rescue Lebanon from the suffocating grip of Hezbollah.\nThis is part of recent Lebanese discourse.\nIsrael has important allies in Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9675642951544215, "event_breakdown": "2022 Israeli military operation, targeting the Gaza-Khan Yunis Governorate and Damascus Governorate\n2022 Russian military operation, targeting the \nSecurity,Hama Governorate,Syria\nIsraeli military operation, targeting the"}]