[{"id": "24cad392-5381-4a17-bc43-63fda065b432", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "The Shiite militias in Iraq claim to have attacked the Israeli port of Haifa yesterday evening with a cruise missile.", "location": "Haifa", "classification": "security", "score": 0.9938263803343869, "event_breakdown": "- Shiite militias claim to have attacked Israeli port of Haifa with a cruise missile"}, {"id": "d282602a-4abe-47d1-b2df-c4b45014dd4c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "University of Virginia, US:\n\nPolice officers armed with transparent plastic shields slowly advance in a single line towards anti-Israeli protesters armed with umbrellas, chanting \"shame, shame\".\n\n##\nLike a medieval battle...", "location": "University of Virginia, Charlottesville", "classification": "security", "score": 0.9091059072642654, "event_breakdown": "- Police officers advance towards anti-Israeli protesters at the University of Virginia\n- Anti-Israeli protesters at the University of Virginia chant \"shame, shame\""}, {"id": "b43bc7ae-f15f-408a-8e9d-d907a850f64d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26683/", "date": "2024-05-05 02:31", "message": "The follower Ben Zion Mekels points out that in the past week you can see in satellite images a new road that was broken (by IDF forces) in the area of ​​the Kerem Shalom crossing (near Rafah).\n\nGetting ready for Rafah...", "location": "Rafah", "classification": "security", "score": 0.8487874688356394, "event_breakdown": "- A new road was broken by IDF forces in the area of the Kerem Shalom crossing, near Rafah."}, {"id": "241f1337-60ec-415c-9978-ed17965715a3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26681/", "date": "2024-05-05 00:04", "message": "USA: The police of Wisconsin do not make exceptions for academic staff: Samir Elatot, professor of sociology at the University of Wisconsin was arrested after taking an (over) active part in anti-Israel demonstrations.", "location": "University of Wisconsin", "classification": "security", "score": 0.3495209627959089, "event_breakdown": "- Samir Elatot, a professor of sociology at the University of Wisconsin, was arrested in Wisconsin after participating actively in anti-Israel demonstrations."}, {"id": "c54940ba-71da-4dac-996b-f3ab15363dfd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26678/", "date": "2024-05-04 17:47", "message": "Palestinian channels report: The IDF attacked the home of the prominent journalist in the Gaza Strip, Hassan Aslih (Hamas-affiliated) in the Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip.\nThere were no casualties in the attack.", "location": "Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip", "classification": "security", "score": 0.9953827602700771, "event_breakdown": "- The IDF attacked the home of the prominent journalist in the Gaza Strip, Hassan Aslih (Hamas-affiliated) in the Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip."}, {"id": "0f5c1284-d7e3-44ba-8dbb-6aff1fd0b473", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26677/", "date": "2024-05-04 17:31", "message": "Palestinian channels: The Palestinian Authority's security mechanisms detonated, in a controlled manner, explosive devices they located in Tubas (Northeastern Samaria).", "location": "Tubas", "classification": "security", "score": 0.9948419961865298, "event_breakdown": "- Palestinian Authority's security mechanisms detonated explosive devices in Tubas, Northeastern Samaria"}, {"id": "72f9f396-54f2-41f9-a168-efcbb8ff0193", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26676/", "date": "2024-05-04 17:20", "message": "Hamas-identified channels: All four killed (whose names have been published) 👆 in the IDF's activity in the village of Deir al-Ghusun in the north of Tulkarm, were operatives of the military wing of Hamas.\nAlaa Sharitah was the commander of the military wing of Hamas in Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9934812200416727, "event_breakdown": "- Four operatives of the military wing of Hamas killed in IDF activity in the village of Deir al-Ghusun in the north of Tulkarm\n- Alaa Sharitah identified as the commander of the military wing of Hamas in Tulkarm"}, {"id": "a1617ad0-9cd7-4a1f-9cf2-b81beb90f55a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26675/", "date": "2024-05-04 17:19", "message": "Further to this👆\nA joint statement to the IDF spokesperson, the police spokesperson and the Shin Bet spokesperson:\n\nThe soldiers of Yamam, the IDF and the Shin Bet eliminated five terrorists who had barricaded themselves in a building in Tulkarm in a 12-hour battle\n\nThe soldiers of the Yamam, IDF and Shin Bet, under the precise intelligence guidance of the Shin Bet and IDF Intelligence, operated for over 12 hours in Tulkarm in a targeted activity to defeat a terrorist cell.\n\nThe soldiers closed in on a building where the terrorist squad was entrenched, which opened fire on them. The fighters responded by shooting with shoulder-fired missiles and other means from the building, and at the end of the exchange of fire, the five terrorists were eliminated.\nMilitary equipment and weapon parts were confiscated.\n\nDuring the activity, an IDF fighter was injured and brought to continue receiving medical treatment in a hospital; his family was informed.", "location": "Tulkarm", "classification": "security", "score": 0.9849329956770798, "event_breakdown": "- Soldiers of Yamam, IDF, and Shin Bet eliminate five terrorists barricaded in a building in Tulkarm after a 12-hour battle\n- Joint operation under precise intelligence guidance of Shin Bet and IDF Intelligence in Tulkarm to defeat terrorist cell\n- Terrorist squad entrenched in a building opens fire on soldiers, who respond with shoulder-fired missiles and other means leading to elimination of five terrorists\n- Confiscation of military equipment and weapon parts\n- IDF fighter injured during the operation and taken to hospital for medical treatment, family notified"}, {"id": "f722adfb-a988-4afc-b41e-72976c8afff1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26674/", "date": "2024-05-04 16:10", "message": "The Palestinians publish the names of four of the \"martyrs\" who were killed in the IDF operation tonight in the village of Deir el Ghusun in the north of Tulkarm:\n\n1. Alaa Sharith (the leftmost one).\n2. Tamer Fuqaha (next to Alaa' - both are behind the attack in which Elhanan Klein fell in November 2023. Tamer is also an operative of Erin al Aswad).\n3. Adnan Samara\n4. Asal Badran\n\nIn addition, there is the \"headless martyr\" who has not yet been identified - DNA tests will be conducted on him to confirm his identity.", "location": "Deir el Ghusun", "classification": "security", "score": 0.9791185685870558, "event_breakdown": "1. Palestinians publish names of four \"martyrs\" killed in IDF operation in Deir el Ghusun, Tulkarm:\n   - Alaa Sharith\n   - Tamer Fuqaha (linked to attack in November 2023)\n   - Adnan Samara\n   - Asal Badran\n2. Unidentified \"headless martyr\" subject to DNA tests for identification."}, {"id": "001e68eb-f949-469b-91ce-2a548614065e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26673/", "date": "2024-05-04 15:36", "message": "The Palestinians report that the IDF forces have finished their activities in Deir al-Ghusun in the north of Tulkarm and have left.\nSources in Tulkarm say that the Palestinian rescue forces located another Palestinian \"martyr\" among the ruins, apparently headless.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9671169206516085, "event_breakdown": "- IDF forces finish activities in Deir al-Ghusun, North of Tulkarm\n- Palestinian rescue forces find headless martyr in Tulkarm"}, {"id": "caa79d5b-91f9-4dd1-b7d9-bf32bd8ae8fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26672/", "date": "2024-05-04 14:06", "message": "The Palestinians report that the person who came out from under the ruins of the house in Deir al-Ghusun and was arrested by IDF forces is the released prisoner Salma Badran, an operative of the military wing of Hamas with a \"heavy\" family lineage: he is the brother of the two \"martyrs\" of the wing - Fawaz and Seif Allah Badran. Salma is the owner of the apartment where the Hamas terrorists hid last night and which the IDF destroyed.\n\nFawaz (Salma's brother) was one of the senior bomb engineers of the Izz ad-Din al-Qassam Brigades in the West Bank and was the one who assembled the explosive device that exploded in the first suicide attack of the second intifada (March 2001), in which 3 Israeli citizens were killed in Netanya. Fawaz was also the one who recruited the suicide bomber for the attack and also guided other suicide bombers in Tulkarm. He was eliminated by the Israeli security forces that year using an explosive device planted in his car.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9989665591672134, "event_breakdown": "- Salma Badran, a Hamas operative and brother of two Hamas \"martyrs\", is arrested by IDF forces in Deir al-Ghusun\n- Fawaz Badran, a senior bomb engineer for the Izz ad-Din al-Qassam Brigades, assembled explosive device for a suicide attack in Netanya in March 2001, killing 3 Israeli citizens\n- Fawaz Badran recruited a suicide bomber for the attack and guided other suicide bombers in Tulkarm; he was eliminated by Israeli security forces using an explosive device planted in his car"}, {"id": "0d3f1a4a-45a4-4a52-beff-c4410ab9777a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26671/", "date": "2024-05-04 14:00", "message": "The official Palestinian news agency Wafa: 6 Palestinians were killed in the IDF operation in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9664112263099419, "event_breakdown": "- 6 Palestinians killed in IDF operation in Deir al-Ghusun\n- Location: Deir al-Ghusun, Tulkarm"}, {"id": "e1a386e2-16ad-4499-9530-3995e41b9423", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26668/", "date": "2024-05-04 13:56", "message": "More footage from Deir al-Ghusun north of Tulkarm from the IDF operation today.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.5645468611123309, "event_breakdown": "- IDF operation in Deir al-Ghusun north of Tulkarm\n- Footage captured from the operation"}, {"id": "a1af0143-3861-41cb-98a4-be7be5e00d1c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Palestinian sources in Tulkarm claim that Tamer Fuqaha, an operative of the military wing of Hamas, (and the terrorist who carried out the attack in which Elhanan Klein fell on November 2, 2023), was killed in an IDF operation tonight in the village of Deir al-Ghusun in the north of Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9920826670749956, "event_breakdown": "1. Tamer Fuqaha, a Hamas operative responsible for an attack in which Elhanan Klein was killed, was reportedly killed in an IDF operation in the village of Deir al-Ghusun in Tulkarm."}, {"id": "85f678bc-3f73-4196-87f3-76712ee926e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26667/", "date": "2024-05-04 13:52", "message": "Deir al-Ghusun north of Tulkarm:\nThe IDF forces packed the body of the Palestinian who was killed in the area of ​​the building.\n\nPalestinian sources claim the IDF forces took 3 bodies.\n\nIDF forces then arrested a Palestinian who emerged from under the ruins of the house that the forces had besieged for many hours.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9879003899097348, "event_breakdown": "- IDF forces packed the body of a Palestinian killed in Deir al-Ghusun north of Tulkarm\n- Palestinian sources claim IDF forces took 3 bodies\n- IDF forces arrested a Palestinian who emerged from under the ruins of the house they besieged in Deir al-Ghusun"}, {"id": "51344902-6497-4cbf-9646-34538335dc32", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26661/", "date": "2024-05-04 13:10", "message": "The \"Holy Fire\" ceremony held today in the Church of the Holy Sepulcher in East Jerusalem as part of the \"Sabbath of Light\" that Christians celebrate today.", "location": "Church of the Holy Sepulcher", "classification": "security", "score": 0.7164941467590658, "event_breakdown": "- \"Holy Fire\" ceremony held at the Church of the Holy Sepulcher in East Jerusalem as part of the \"Sabbath of Light\" celebrated by Christians."}, {"id": "874b3afa-e356-43e5-ae3c-956e8ce84eb6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26658/", "date": "2024-05-04 13:07", "message": "For nearly ten hours starting last night, IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm.\nAccording to the estimates, the terrorists Tamer Fakha and Alaa Sharitah, the operatives of the military wing of Hamas involved in the shooting attack in which Major General Elhanan Klein was killed near Beit Lid on November 2, 2023, were hiding in the house.\nSources associated with Hamas and Islamic Jihad operatives claim that the two managed to escape from the house which was surrounded by the IDF for many hours and fired upon by a large number of missles (and finally destroyed with a bulldozer - in the attached videos you can see the shooting and the demolition the house).", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9796365504234397, "event_breakdown": "- IDF forces conducted an operation around a house in the village of Deir al-Ghusun north of Tulkarm\n- Tamer Fakha and Alaa Sharitah, terrorists associated with the military wing of Hamas, were believed to be hiding in the house\n- The house was surrounded by IDF for many hours and fired upon by a large number of missiles\n- The house was eventually destroyed with a bulldozer"}, {"id": "fdeb8b62-e2a8-4132-b97b-9bd2b5e239e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26657/", "date": "2024-05-04 13:02", "message": "The Al Jazeera network claims: an Israeli drone launched a missile a few hours ago at a vehicle in Bint Jabil in southern Lebanon.\n\nUnofficial Lebanese sources: No casualties.", "location": "Bint Jabil", "classification": "security", "score": 0.9652451684275815, "event_breakdown": "- Israeli drone launches missile at a vehicle in Bint Jabil, southern Lebanon\n- No casualties reported"}, {"id": "aba59fec-5e10-4bea-928d-a2eecc3ff90e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26656/", "date": "2024-05-04 12:30", "message": "The Qatari Al Jazeera cites a report by Reuters according to which Qatar is considering closing the offices of the political office of Hamas in its territory as part of an overall plan to continue its function as a mediator in the conflict between Hamas and Israel.", "location": "Doha", "classification": "security", "score": 0.9065846889429762, "event_breakdown": "null"}, {"id": "14165a38-d2c3-41cb-af86-a362e42445a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26655/", "date": "2024-05-04 12:29", "message": "At least 3 different Israeli military reporters publish the exact same message:\n\nPolitical actor:\n\nContrary to the publications, Israel will under no circumstances agree to the end of the war as part of an agreement to release our abductees.\n\nAs the political echelon decided, the IDF will enter Rafah and destroy the remaining Hamas battalions there - whether or not there will be a temporary respite for the release of our hostages.", "location": "Rafah", "classification": "security", "score": 0.6696081489195264, "event_breakdown": "1. Multiple Israeli military reporters publish the same message regarding Israel's stance on ending the war and the release of abductees.\n2. Israel states it will not agree to end the war as part of an agreement to release abductees.\n3. The IDF is instructed to enter Rafah and destroy remaining Hamas battalions, regardless of any temporary respite for hostage release."}, {"id": "ba68c03f-7ea4-4dc7-a203-9b75553255d1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26654/", "date": "2024-05-04 12:28", "message": "Heavy political pressure on Israel from all directions to silence all sectors, (mainly) at the expense of the Israeli interest. It will only get worse.", "location": "Israel", "classification": "security", "score": 0.7257546953647328, "event_breakdown": "1. Heavy political pressure on Israel from various directions\n2. Pressure to silence all sectors\n3. Impact on Israeli interest"}, {"id": "09e4dcdc-dbd8-4b2a-9050-abd1ab65328c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26649/", "date": "2024-05-03 20:30", "message": "Documentation of one of today's attacks in the area of ​​the displaced persons' tents in Rafah in the south of the Gaza Strip - note the rocket rising into the sky. This indicates a precise hit by the aircraft on the target.", "location": "Rafah", "classification": "security", "score": 0.9952821119807056, "event_breakdown": "- Attack in the area of ​​the displaced persons' tents in Rafah, Gaza Strip\n- Rocket rising into the sky indicating a precise hit by aircraft on the target"}, {"id": "5f8c1f7e-1007-4930-bc53-3c5352bda4d6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26648/", "date": "2024-05-03 20:27", "message": "Hamas in an official announcement:\n\nIn light of the recent contacts with the mediators, tomorrow a delegation of the movement will arrive in Cairo to complete the talks.\n\nWe emphasize that the leadership of the movement reacted in a positive spirit to the proposal it received while discussing it. We are going to Cairo in the same positive atmosphere to reach an agreement.\n\nWe are determined to reach an agreement that will realize the demands of our people for a total cessation of aggression, the withdrawal of forces, the return of the displaced, aid to our people, the beginning of the reconstruction of the Gaza Strip and a serious exchange deal.", "location": "Cairo", "classification": "security", "score": 0.3907896760166591, "event_breakdown": "- Hamas delegation to arrive in Cairo to complete talks\n- Hamas leadership reacted positively to the proposal\n- Determination to reach an agreement for cessation of aggression, withdrawal of forces, return of displaced, aid, reconstruction of Gaza Strip, and exchange deal"}, {"id": "14598d6c-16ad-49b3-9b44-4c8d1f127e20", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26644/", "date": "2024-05-03 17:44", "message": "Reuters from a senior Hamas official: a Hamas delegation will arrive in Cairo tomorrow.", "location": "Cairo", "classification": "security", "score": 0.9023652992005777, "event_breakdown": "- Hamas delegation to arrive in Cairo tomorrow"}, {"id": "234da03e-dd8d-4e4b-a54d-4bd726088868", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26643/", "date": "2024-05-03 16:51", "message": "The Houthis clarify the words of the Houthi military spokesman and point out that starting today every ship that docks in an Israeli port will be \"marked\" and as soon as it passes through an area within the reach of the Houthis it will be attacked even if it is not on its way to an Israeli port at the time.\n\nIf Israel enters Rafah, the next step for the Houthis will be to attack all ships belonging to companies that even one of their ships docks in Israeli ports.", "location": "Rafah", "classification": "security", "score": 0.4099593512202328, "event_breakdown": "- Houthis announce plans to mark and attack any ship docking in Israeli ports.\n- Threat to attack ships passing through areas within Houthi reach, regardless of destination.\n- Warning of potential attacks on ships belonging to companies with vessels docking in Israeli ports."}, {"id": "25dba510-437b-452d-8c1b-65481b531366", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26642/", "date": "2024-05-03 16:36", "message": "One of the signs of abundance in the northern Gaza Strip: Gazan donkeys receive fresh pita bread\n\nA Gazan from the north of the Gaza Strip to the donkey: once (when there was a shortage of bread) we ate from your food, now take and eat bread from today. You are better than many people...", "location": "Gaza Strip", "classification": "security", "score": 0.8432632263954416, "event_breakdown": "- Gazan donkeys in northern Gaza receive fresh pita bread\n- Gazan from northern Gaza offers bread to donkeys as a sign of abundance"}, {"id": "4918eedb-74bf-4ade-9536-c673a434b833", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26641/", "date": "2024-05-03 16:28", "message": "American Central Command:\n\nDue to weather conditions, construction work on the floating pier off the coast of Gaza was stopped and it was moved to Ashdod port, where its construction will be completed.\n\nAfter the completion of its construction, it will be floated along the shores of Gaza to the place where it was planned to be placed.", "location": "Ashdod\tsizeof ", "classification": "security", "score": 0.8222928362890448, "event_breakdown": "- Construction work on floating pier off Gaza coast halted due to weather conditions.\n- Floating pier moved to Ashdod port for completion of construction.\n- Pier to be floated to planned location along Gaza shores after construction."}, {"id": "5e6f0994-5eed-460c-bc47-792df82d0964", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26640/", "date": "2024-05-03 15:56", "message": "Reuters from an Egyptian source:\n\nThe head of the CIA, William Burns, arrived in Cairo to promote the ceasefire in Gaza.\n\n##\nThe Americans are using all their weight and are firing their heaviest guns to reach a ceasefire.", "location": "Cairo", "classification": "security", "score": 0.8731912994868349, "event_breakdown": "- Head of the CIA, William Burns, arrives in Cairo to promote Gaza ceasefire efforts.\n- American officials exert significant diplomatic pressure to achieve a ceasefire."}, {"id": "b6e14d45-70cf-433e-a09d-20cf32ba7993", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26639/", "date": "2024-05-03 15:55", "message": "The Palestinian Ministry of Health in Gaza:\n26 dead in the Strip in the last day.\n\nThe number of deaths in the last few days:\n28\n33\n47\n34\n\nTotal dead in the Gaza Strip since the beginning of the war: 34,622. Total wounded: about 78 thousand.\n\n##\nIn the last day, the number of dead was the lowest in the Gaza Strip since the beginning of the war (with the exception of the hodna period in November 2023).", "location": "Gaza", "classification": "security", "score": 0.8569080015487186, "event_breakdown": "- 26 dead in the Gaza Strip in the last day.\n- Total dead in the Gaza Strip since the beginning of the war: 34,622.\n- Total wounded in the Gaza Strip since the beginning of the war: about 78 thousand."}, {"id": "685a76d6-05f1-4ab9-b644-9358361a661c", "channel_id": 1560386984, "url": "", "date": "2024-05-03 15:14", "message": "Berlin: A large fire at the Diehl company's weapons manufacturing plant. \nThe Diehl company manufactures defensive weapon systems and guided missiles.", "location": "Berlin", "classification": "security", "score": 0.7984412808819542, "event_breakdown": "- Large fire reported at Diehl company's weapons manufacturing plant in Berlin.\n- Diehl company known for manufacturing defensive weapon systems and guided missiles."}, {"id": "a1ee8216-b5f3-4940-99ee-25c98a74fd5b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26633/", "date": "2024-05-03 13:36", "message": "Paris: French security forces break into Sciences Po the Institute of Political Science to break up an anti-Israel demonstration by the students there.", "location": "Paris", "classification": "security", "score": 0.9281242816179448, "event_breakdown": "- French security forces break into Sciences Po, the Institute of Political Science, to break up an anti-Israel demonstration by the students."}, {"id": "2b20aaf2-7f86-4666-b416-2f4d4c14bd90", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26630/", "date": "2024-05-03 13:15", "message": "About 100,000 Palestinians have left the Gaza Strip since the beginning of the war\n\nThe Palestinian ambassador in Egypt: since the beginning of the war and until April, 85 thousand Palestinians left the Gaza Strip for Egypt through the Rafah crossing.\n\nTaking the month of April into account, it can be estimated that about one hundred thousand Palestinians left the Strip since the beginning of the war.", "location": "Rafah crossing", "classification": "security", "score": 0.8683848530412968, "event_breakdown": "- Approximately 100,000 Palestinians have fled the Gaza Strip since the war began.\n- Palestinian Ambassador in Egypt reports that 85,000 Palestinians left Gaza for Egypt through the Rafah crossing from the start of the war until April.\n- Accounting for April, an estimated total of 100,000 Palestinians have left the Strip since the conflict's onset."}, {"id": "bea26802-d486-4054-b25a-669f31dd9eab", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65962/", "date": "2024-05-03 13:11", "message": "A must watch:\n\nStudents from the \"Free Palestine Army\" charge Portland police officer with shields made from trash cans.\n\n##\nNot the sharpest tools in the shed...", "location": "Portland", "classification": "security", "score": 0.7716378859605466, "event_breakdown": "null"}, {"id": "1a457697-3ef1-4715-9261-846884330da3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26628/", "date": "2024-05-03 13:11", "message": "Fox News: The Iranian flag was raised by the students at the University of Irvine in California.\n\nIran is offering scholarships to students who will be expelled from US universities following the protests.", "location": "University of Irvine, California", "classification": "security", "score": 0.38395330639266484, "event_breakdown": "- Iranian flag raised by students at University of Irvine in California\n- Iran offering scholarships to students facing expulsion from US universities after protests"}, {"id": "01257436-546b-40c5-9dfd-b1d437710534", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26624/", "date": "2024-05-03 11:04", "message": "The Shia militias in Iraq claim:\nYesterday afternoon (May 2nd) we launched two cruise missiles from Iraq at a target in Tel Aviv and at a target in Be'er Sheva.\n\nThe militias in Iraq also claim that they attacked an Israeli target in the Dead Sea early this morning \"with appropriate weapons\".\n\n###\nSources of the Lebanese al-Mayadeen claim that the Iraqi cruise missiles were launched at the Glilot Base in Tel Aviv and the Avraham Base in Be'er Sheva.", "location": "Tel Aviv", "classification": "security", "score": 0.9833649319691411, "event_breakdown": "- Shia militias in Iraq claim responsibility for launching cruise missiles at targets in Tel Aviv and Be'er Sheva from Iraq.\n- Further claim of attacking an Israeli target in the Dead Sea with unspecified weapons.\n- Sources from Lebanese al-Mayadeen allege that the Iraqi cruise missiles targeted the Glilot Base in Tel Aviv and the Avraham Base in Be'er Sheva."}]