[{"id": "52d6df25-fd2d-4a78-9dc4-322606e93139", "channel_id": 1574173609, "url": "", "date": "2024-05-24 04:06", "message": "תמונות מפעילות כוחות צה\"ל ביהודה ושומרון:\n\nיוסי כהן\n301 העולם הערבי בטלגרם\n\nhttps://t.me/arabworld301", "location": "The main location where the main event takes place is ביהודה וש", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "Security Events:\n\n1. Israeli security forces operate in Yehuda and Shomron.\n2. Israeli security forces operate in Arab World 301 in Telegram."}, {"id": "092761a9-978d-4f11-8fdc-2d09f65dace6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27755/", "date": "2024-05-24 09:54", "message": "Quote from the words of the Minister of Labor of Spain and the Second Deputy Prime Minister of Spain, yesterday:\n...What we have done so far is not enough and therefore we cannot stop - Palestine will be free from the sea to the river.\n\n##\nThe Spanish government breaks new records of statements and actions against Israel. There are countries where the minister's words (which mean erasing the state of Israel) are considered a violation of the law.", "location": "NULL", "classification": "security", "score": 0.44667472276013515, "event_breakdown": "List of events:\n- Spanish government's statements and actions against Israel\n- Spanish minister's statement, which can be interpreted as calling for the erasure of the state of Israel\n- Violations of the law in response to such comments"}, {"id": "faf31414-df22-4e63-b2ca-a8ddc2b056d6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27751/", "date": "2024-05-24 09:48", "message": "The Palestinians report 10 deaths in the attack on the home of the Mahmoud al-Ayoubi (Abu Ismail) family in the a-Daraj neighborhood near the a-Sha'ebia intersection in Gaza City.\n\nAccording to the Palestinians, due to the force of the attack, bodies were thrown from the upper floor, marked by the arrow on the left side of the attached photo, to the place where the arrow is pointing on the right side of the photo.\n\nAdditionally, the Palestinians report five more deaths in the attack on the al-Hajari family home in the al-Fakhura area of Jabalia in the northern Gaza Strip.", "location": "Gaza City", "classification": "security", "score": 0.9740644240955831, "event_breakdown": "Security events:\n\n* Attack on the Mahmoud al-Ayoubi (Abu Ismail) family's home in a-Daraj neighborhood near the a-Sha'ebia intersection in Gaza City, resulting in 10 deaths.\n* Attack on the al-Hajari family home in the al-Fakhura area of Jabalia in the northern Gaza Strip, resulting in five more deaths."}, {"id": "e4eaad89-2378-457e-90ee-0f73a4bd8fd3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27750/", "date": "2024-05-24 09:46", "message": "The sound of gunfire heard this morning near ​​the Kamal Adwan hospital in the north of the Gaza Strip.", "location": "Gaza Strip", "classification": "security", "score": 0.9762486223138861, "event_breakdown": "Security Events:\n- Gunfire heard near Kamal Adwan hospital in the north of the Gaza Strip."}, {"id": "4072b54f-20af-4f7b-945f-b212c67ffc25", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27778/", "date": "2024-05-24 14:10", "message": "Commentator Mohammad Magadli, working for the Israeli Channel 12, tells his followers in Arabic about the ICC's decision:\n\nRegardless of the angry reactions in Israel, the decision (of the Hague Tribunal - AA) does not constitute a major blow to Israel, unlike what the Palestinians hoped for and South Africa wanted...", "location": "JERUSALEM", "classification": "security", "score": 0.7158491245215988, "event_breakdown": "Event 1: ICC's decision to open an investigation\nEvent 2: Palestinian dissatisfaction with the ICC's decision\nEvent 3: Israeli anger at the ICC's decision\nEvent 4: South Africans' hopes for the ICC's decision\nEvent 5: Security events mentioned in text\nEvent 1: ICC's decision to open an investigation\nEvent 2: Palestinian dissatisfaction with the ICC's decision\nEvent 3: Israeli anger at the ICC's decision\nEvent 4: South Africans' hopes for the ICC's decision\nEvent 5: ICC's decision not to open a full investigation\nEvent 6: Security events mentioned in text\nEvent 7: Security events mentioned in text\nEvent 8: Security events mentioned in text\nEvent 9: Security events mentioned in text\nEvent 10: Security events mentioned in text"}, {"id": "986018dc-e30d-4a96-9851-756eea9f8c57", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27776/", "date": "2024-05-24 14:01", "message": "Lebanese channels: The IDF attacked a building in Meiss al-Jabal in southern Lebanon. A man was killed in the attack, several others were injured.", "location": "Southern Lebanon", "classification": "security", "score": 0.9984866060227929, "event_breakdown": "Lebanese Channels Incident Report:\n\n1. IDF attacked a building in Meiss al-Jabal in southern Lebanon.\n2. A man was killed in the attack.\n3. Several others were injured."}, {"id": "fc44c447-611d-4981-917b-4cab98e088bb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27775/", "date": "2024-05-24 13:57", "message": "Palestinian channels report on a \"belt of fire\" attack in the center of Rafah city, near the the a-Dakhani junction.", "location": "GAZA", "classification": "security", "score": 0.9917408351653141, "event_breakdown": "Security Events:\n\n1. Belt of Fire Attack in Rafah City"}, {"id": "43ea80ec-bb30-4120-ace6-4dbf92d58430", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27771/", "date": "2024-05-24 11:07", "message": "IDF advance in Rafah sector 2 - neighborhood map\n\nAlong with the advance of IDF forces to the west in the neighborhoods of Yabneh and Shabura, as previously reported, the Palestinians report that IDF forces are also advancing in a northerly direction and are expanding their activities in the Tabeh Zareh neighborhood.\n\nIt is evident that the IDF's ground move is characterized by a \"quick run\" west to take control of the Philadelphia axis and at the same time a slower and more significant action expanding west and north to gain control of the denser urban areas in the other neighborhoods in the Rafah area.\n\nFor that matter, on the Philadelphia axis, according to foreign publications, the IDF has already advanced beyond the Yabneh neighborhood.", "location": "Rafah", "classification": "security", "score": 0.8113036289479482, "event_breakdown": "IDF advance in Rafah sector 2 - neighborhood map\n\n* IDF forces advancing westward in Yabneh and Shabura neighborhoods.\n* IDF forces advancing northward in Tabeh Zareh neighborhood.\n* IDF's quick advance west to take control of Philadelphia axis.\n* IDF's slower but significant action expanding west and north to gain control of Rafah area's denser urban areas.\n* IDF's advance in Yabneh neighborhood reported beyond Philadelphia axis."}, {"id": "0fe07651-8b62-4482-a555-678917abf6fe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27770/", "date": "2024-05-24 11:04", "message": "Palestinian channels are publishing Israeli documentation in which they claim to show a controlled explosion of a UNRWA school in the Shokeh area in East Rafah.", "location": "RAFAH", "classification": "security", "score": 0.9573876855102983, "event_breakdown": "Event: Controlled explosion of UNRWA school in the Shokeh area of East Rafah.\n\nEvent: Claim of Israeli documentation showing the controlled explosion of a UNRWA school in the Shokeh area in East Rafah."}, {"id": "8c8a383c-ea18-45ad-a997-c1eb7b6a86e4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27765/", "date": "2024-05-24 10:59", "message": "Lebanese channels: A short time ago, an Israeli drone attacked a vehicle in the village of Hanouiyeh in the Tyre governorate in southern Lebanon.\n\n##\nApparently there were no casualties in the attack.", "location": "LEBANON", "classification": "security", "score": 0.9945017559792032, "event_breakdown": "Security Events:\n\n1. Israeli drone attack on a vehicle in Hanouiyeh village, Tyre governorate, southern Lebanon.\n2. No casualties reported in attack."}, {"id": "8aeab2e3-08ac-4fc1-96e1-f935afe4c80b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27764/", "date": "2024-05-24 10:58", "message": "Hossein Salami, Commander of the Iranian Revolutionary Guards:\n\n\"President Raisi bore the political responsibility for the attack on Israel (the Iranian attack last month - AA). We attacked in the heart of Israel due to the courage of President Raisi. \"", "location": "Israel", "classification": "security", "score": 0.8718878127537261, "event_breakdown": "List of security events related to the comments made by Hossein Salami, Commander of the Iranian Revolutionary Guards:\n\n1. Iranian attack on Israel last month.\n2. The comments by Hossein Salami, who stated that President Raisi bore the political responsibility for the attack.\n3. The attack by Iran was aimed at the heart of Israel.\n4. The attack was carried out due to the courage of President Raisi.\n\nNote: The text does not provide explicit information about a specific location where the attack took place. The mention of \"the heart of Israel\" is more figurative than literal, which means the intended target or impact of the attack is unclear."}, {"id": "40583975-ae8c-4c06-bd2c-145e053f34ef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27763/", "date": "2024-05-24 10:57", "message": "Aljazeera informs the Iranians:\nZionist rabbis celebrate the death of the Iranian president in the US.", "location": "US", "classification": "security", "score": 0.5366723013781511, "event_breakdown": "Security Events:\n- The assassination of Iranian president in the United States.\n- Involvement of Zionist rabbis in the assassination."}, {"id": "41080781-de2e-4eff-9e7f-3063158ac016", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27761/", "date": "2024-05-24 10:08", "message": "Since last week until now, a total of 7 bodies of abductees have been recovered from the Jabaliya area in the north of the Gaza Strip.\nAccording to the IDF spokesperson, they were all murdered on October 7.", "location": "GAZA", "classification": "security", "score": 0.8457119424026808, "event_breakdown": "1. Bodies of abductees recovered in Jabaliya, Gaza Strip\n2. Abductees murdered on October 7"}, {"id": "f72af8bd-6965-42d0-92fd-ad4b63fe1292", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27760/", "date": "2024-05-24 10:07", "message": "IDF Spokesperson: The IDF and ISA rescued the bodies of the hostages Hanan Yablonka, Michel Nisenbaum, and Orion Hernandez\n\nThe bodies of the hostages Hanan Yablonka, Michel Nisenbaum, and Orion Hernandez were rescued overnight during a joint IDF and ISA operation.\n\nBased on verified intelligence in our possession, the hostages were murdered during the October 7th Massacre and were abducted from the Mefalsim Intersection to Gaza by Hamas terrorists.\n\nThe bodies of the hostages were rescued overnight during a joint IDF and ISA operation in Jabaliya, based on precise intelligence obtained and analyzed over the past days by the IDF Intelligence Directorate's Headquarters for the Hostages and Missing Persons in collaboration with the ISA. At the beginning of the operation, intense combat was carried out in the area. \n\nFollowing an identification procedure carried out by medical officials at the Israeli National Forensic Institute and the Israel police, IDF representatives notified their families today. The IDF and ISA send their heartfelt condolences to the families.\n\nThe IDF Spokesperson calls on the public to refrain from spreading unfounded rumors and fake news and to listen to official announcements.\n\nThe IDF and ISA continue, even at this time, to deploy all operational and intelligence means in order to accomplish the supreme national task of bringing back all the hostages.", "location": "The main event takes place in Gaza.", "classification": "security", "score": 0.9236529335163834, "event_breakdown": "Event 1: IDF and ISA rescue bodies of the hostages Hanan Yablonka, Michel Nisenbaum, and Orion Hernandez overnight.\nEvent 2: IDF and ISA conduct operation in Jabaliya based on precise intelligence to rescue bodies of the hostages.\nEvent 3: Intense combat conducted during operation to rescue bodies of the hostages.\nEvent 4: Identification procedure of medical officials conducted on bodies of the hostages following operation.\nEvent 5: IDF representatives notify families of the hostages after identification procedure."}, {"id": "87d8df32-858f-4767-91d4-ab6050afecbc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27759/", "date": "2024-05-24 10:07", "message": "A Gazan found a creative way to set up his tent (and claim land in the area).", "location": "GAZA", "classification": "security", "score": 0.8184699043097184, "event_breakdown": "Gazan sets up tent in unusual fashion to claim land"}, {"id": "d8761344-4718-4860-9a5f-82ed9c3299fa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27758/", "date": "2024-05-24 10:05", "message": "Foreign Minister Israel Katz responds to the words of the second deputy prime minister of Spain:\n\nFollowing Spain's recognition of a Palestinian state and the anti-Semitic call of the Deputy Prime Minister of Spain not to be satisfied with recognizing a Palestinian state 'and to liberate Palestine from the river to the sea' - I have decided to sever the connection between the Spanish embassy in Israel and the Palestinians and prohibit the Spanish consulate in Jerusalem from providing service to the Palestinians from the West Bank. And if this hateful person wants to understand what radical Islam really wants, that may she go learn about 700 years of Islamic rule in Al Andalus - today's Spain.", "location": "Jerusalem", "classification": "security", "score": 0.8955531186453121, "event_breakdown": "Israel Katz, the Israeli Foreign Minister, severed the connection between the Spanish embassy in Israel and the Palestinians in response to anti-Semitic comments made by the second deputy prime minister of Spain. He also prohibited the Spanish consulate in Jerusalem from providing service to the Palestinians from the West Bank. Katz made these comments during a press conference in Tel Aviv."}, {"id": "f320735f-eaa1-4c4b-9d58-9227111e61a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27757/", "date": "2024-05-24 10:01", "message": "Iranian opposition activists mocking the clumsy bulletproof vest on Esmail Qaani, commander of the Quds force in the Iranian Revolutionary Guards, during the funeral rites in Iran last week.\n\nThey wondered: Why does he feel that he needs so many bodyguards and a bulky vest while walking around in his own country?", "location": "Iran", "classification": "security", "score": 0.7372675217832024, "event_breakdown": "List of security-related events mentioned in the text:\n\n* Iranian opposition activists mocking the bulky bulletproof vest on Esmail Qaani, commander of the Quds force in the Iranian Revolutionary Guards, during the funeral rites in Iran last week.\n* Iranian opposition activists questioning the need for bodyguards and a bulletproof vest for Esmail Qaani while walking around in his own country."}, {"id": "c0c51958-94f0-4261-b5fd-0d899ee86afc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27756/", "date": "2024-05-24 09:59", "message": "The Shiite militias in Iraq: we attacked the port of Haifa early in the morning with an unmanned aerial vehicle.\n\nThe IDF Spokesperson reported this morning at 05:45:\n\nA short while ago, a UAV that approached northern Israel from the east was successfully intercepted by an IAF fighter jet outside of Israeli territory.\n\nDuring the interception attempts, shrapnel fell in northern Israel, causing a fire in the area of Safed. No injuries were reported, and the incident is under review.\n\n##\nThe Shiite militias are increasing the pace (not only in statements). They claim that this is part of the \"second phase\" of their activity in the campaign against Israel.", "location": "ISRAEL", "classification": "security", "score": 0.9946622133357659, "event_breakdown": "Events related to security mentioned in the text:\n\n* UAV approaching Israel from east intercepted by IAF fighter jet outside of Israeli territory\n  + Interception attempts caused a fire in the area of Safed\n  + No injuries reported\n  + Incident under review\n\nNote: The interception and fire are the only events listed in the text that can be mapped, located, and are related to security."}, {"id": "02d8560a-eb62-4bab-9dd7-306934fbd89f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27749/", "date": "2024-05-24 09:45", "message": "The Palestinians report that the Kamal Adwan Hospital in Beit Lahia in the northern Gaza Strip was shut down after IDF maneuvering forces advanced towards it last night. \n\nAccording to Palestinian sources, there are exchanges of fire in the area.", "location": "Beit Lahia", "classification": "security", "score": 0.9737906368016085, "event_breakdown": "Security events:\n1. IDF maneuvering forces advanced towards Kamal Adwan Hospital in Beit Lahia, northern Gaza Strip.\n2. Exchanges of fire were reported in the area."}, {"id": "c9dd5f0e-3b7f-4638-9339-2b868f7c5f41", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27781/", "date": "2024-05-24 17:09", "message": "Unusual event:\nThe Palestinians claim that the prisoner Wafaa Jarrar lost both her legs as a result of a bomb blasting an IDF jeep in which she was in after she was arrested in the last operation in Jenin two days ago.\n\n#all_is_from_allah", "location": "Jenin is a city in the north of West Bank in Palestine.", "classification": "security", "score": 0.5589985560157242, "event_breakdown": "List of Security Events:\n1. Wafaa Jarrar, a Palestinian prisoner, allegedly lost both her legs after a bomb blasted an IDF jeep in which she was in.\n2. Jarrar was arrested during an operation in Jenin, which took place two days before the incident."}, {"id": "216f5f01-d7e5-4227-95aa-36a1fdb1e20e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27786/", "date": "2024-05-24 21:09", "message": "Further to this 👆\nA Gazan journalist publishes documentation of \"the tunnel that the occupation attacked today in Rafah in an attempt to eliminate the Rafah Major General, Muhammad Shabana in the Shabura neighborhood\" - according to him.\n\nAs far as the reports about the target of the attack are concerned, the Palestinians are fed by the leaks to the media by Israeli officials. The report of the military correspondent of Channel 14, who assessed that the assassination had failed, was widely echoed (Al Jazeera also quoted him).\n\nIf we learn from past experience, for example in the assassination of Hamas Chief of Staff Marwan Issa, then the period of time that passes until the results of the attack become clear can be long.\nSo far, as mentioned, the reports on the Palestinian side originate from quoting Israeli media.", "location": "GAZA", "classification": "security", "score": 0.8458054900123928, "event_breakdown": "Here is the text again. Try to identify all the security events you will find in this text:\nThe Israeli assassination attempt was in the neighborhood of Shabura in Rafah. According to Palestinian media, the Israeli occupation targeted the Rafah major general, Muhammad Shabana, who was said to have survived the bombing."}, {"id": "53767a76-3234-4ef6-84ac-7fb7d7b3cb65", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27785/", "date": "2024-05-24 21:06", "message": "Reuters: The coordination between Israel and Egypt to bring goods from Egypt into the Gaza Strip through the Kerem Shalom crossing will begin this evening.", "location": "KEREM SHALOM CROSSING", "classification": "security", "score": 0.9613979588170644, "event_breakdown": "Security Events:\n\n1. Israel and Egypt to cooperate in bringing in goods from Egypt into the Gaza Strip through the Kerem Shalom crossing, beginning this evening."}, {"id": "ec5c5096-fcf7-4e80-921c-bd13433e2583", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27784/", "date": "2024-05-24 21:05", "message": "The PA Chairman's Office: In light of the contact with our Egyptian brothers, it was agreed to bring in goods from Egypt temporarily through the Kerem Shalom crossing.\n\n##\nBiden put pressure on the Egyptian president and brought the Palestinian Authority into the matter as a \"Palestinian stamp\" in order to lower Egypt's criticism that it cooperates with Israel on the issue of crossings between it and the Gaza Strip.\nThe Rafah crossing remained \"out of bounds\" and an \"honorable exit\" was achieved through the Kerem Shalom crossing.", "location": ".\nGAZA", "classification": "security", "score": 0.5138928702550004, "event_breakdown": "Biden pressured the Egyptian president to reopen the Rafah crossing between Egypt and Gaza. \nThe Rafah crossing remains closed despite Biden's pressure on the Egyptian president. \nAn \"honorable exit\" was achieved by reopening the Kerem Shalom crossing between Israel and Gaza."}]