[{"id": "c8a670a9-0b3b-4e6b-99cf-5f0ed2a0bc61", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30426/", "date": "2024-07-14 09:50", "message": "The Russian Ministry of Defense today publishes documentation of an attack in Ukraine using a 3-ton \"gliding bomb\" of the FAB 3000 type\n\nApparently no eviction notice was given...", "location": "Ukraine", "classification": "security", "score": 0.644628207368581, "event_breakdown": "The Russian Federation published evidence of the military attack in the Ukraine region, using a 3-ton \"gliding bomb\" of the FAB 3000 type."}, {"id": "325e638f-9021-474b-ae9a-a38809270a0f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30425/", "date": "2024-07-14 09:49", "message": "Further to this report, Hezbollah announces the death of Samir Kabani, Abu Samra.\n\nHe was killed by gunfire from Amal activists in the Maadi district of Beirut's Dahieh.\n\nThis poster did not say that he was a \"martyr on the way to Jerusalem\" as it is written when Hezbollah operatives are killed in action against Israel - I circled in red the place where the inscription is missing..\n\nHe also does not appear in the Hezbollah death toll in the fighting.\nHe is just a martyr... (:", "location": "BEIRUT", "classification": "security", "score": 0.9352002185555018, "event_breakdown": "The event can be placed on a map of Beirut's Dahieh district in the area of Maadi."}, {"id": "39c77d86-08c8-4685-b7ac-ca519e3c4abc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30424/", "date": "2024-07-14 09:48", "message": "Lebanese sources:\nWater and electricity outages in some of the villages in southern Lebanon following an Israeli attack that hit the \"Ein Tanya station\" in Marjayoun.", "location": "MARJAYOUN", "classification": "security", "score": 0.9814975774365817, "event_breakdown": "Israeli attack hits Ein Tanya station in Marjayoun, causing water and electricity outages in villages in southern Lebanon."}, {"id": "b5f1652d-073f-434c-93e3-765263a81cc7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30423/", "date": "2024-07-14 08:19", "message": "Another senior official was killed in an attack 👆 yesterday in the Shatti refugee camp in the west of Gaza City, in which 22 people were killed.\nIt appears to be a particularly high-quality attack.\nThe Al-Aqsa Martyrs' Brigades in Gaza officially announced this morning that Izz al-Din Akhila, the commander of the Gaza City Brigades and a member of the General Staff of the Al-Aqsa Martyrs' Brigades in the Gaza Strip, was also killed in the attack.\n\n##\nIt is true that the Al-Aqsa Martyrs' Brigades are not a significant function in the fighting in Gaza and they had less than two thousand military operatives on the eve of the war, but the elimination of their most senior members in Gaza City is certainly a nice addition to yesterday's attack on the Shatti refugee camp.", "location": "Gaza City", "classification": "security", "score": 0.9919376830342004, "event_breakdown": "New Attack in Gaza - 22 Killed\nhttps://www.kan.org.il/Article/574201/\nYedioth AhronothThe Al-Aqsa Martyrs' Brigades officially announced that he was killed yesterday in an attack in Gaza."}, {"id": "8528b7cf-7b6b-4545-9194-2e307e7928e1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30422/", "date": "2024-07-14 08:16", "message": "Senior Hamas official Mahmoud Mardawi repeats the words of Khalil al-Hayya, Yahya Sinwar's deputy, from last night:\nMuhammad Deif is safe and sound and he hears the claims of the occupation about his elimination...", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.6195734389521921, "event_breakdown": "Hamas leader Muhammad Deif is safe and unharmed, according to Hamas officials. This comes in response to Israeli media reports that Deif was injured in an airstrike on his home last night."}, {"id": "92be8aec-7bc6-45c4-ac41-32a0742e991b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30418/", "date": "2024-07-14 07:16", "message": "Berlin: German policemen practice punching at an anti-Israel demonstration.", "location": "BERLIN", "classification": "security", "score": 0.9552393930612302, "event_breakdown": "German policemen practice punching at an anti-Israel demonstration in Berlin."}, {"id": "4b5f070a-d4d6-47c8-82f1-7aa21bd122a4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30413/", "date": "2024-07-14 07:06", "message": "Trump survived an assassination attempt during an election rally in Pennsylvania\n\nThe assassin fired several bullets at him from a distance of about 120 meters. Trump slightly injured his ear, visited the hospital and was released after a short time.\nThe assassin was eliminated by the American secret service, one of the participants of the rally was killed and another was wounded.", "location": "Trump assassination attempt during Pennsylvania rally", "classification": "security", "score": 0.5462629173226561, "event_breakdown": "Target event:\nTrump survived an assassination attempt during an election rally in Pennsylvania. The assassin fired several bullets at him from a distance of about 120 meters. Trump slightly injured his ear, visited the hospital and was released after a short time. The assassin was eliminated by the American secret service, one of the participants of the rally was killed and another was wounded."}, {"id": "30d5609c-9980-4fb3-a31c-845c64a016b0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30408/", "date": "2024-07-14 07:02", "message": "The newspaper \"Asharq al-Awsat\" claims, from sources in Hamas, that Rafa Salama, the Khan Yunis brigade general and one of the targets of yesterday's attack in Khan Yunis, was indeed killed.\n\nAccording to the newspaper, his body was found and he was hastily buried.\n\nThe newspaper also notes, from sources in Hamas, that it is still not known whether Muhammad Deif has also been eliminated, and even if he is eliminated, it is only a symbolic blow and the person who will replace him in the position is Mohammad Sinwar (Yahia Sinwar's brother).\n\n##\nBy the way, in the announcement distributed by Israel at the start of the war, Muhammad Deif was \"priced\" less than Brigadier General of Khan Yunis Rafa Salama.", "location": "Gaza Strip", "classification": "security", "score": 0.7536050656724664, "event_breakdown": "New event:\nRafa Salama, a Khan Yunis brigade general and one of the targets of an attack in Khan Yunis on Wednesday, has been killed, according to London-based newspaper Asharq al-Awsat."}, {"id": "f5d3fa99-af31-4263-9393-75df23b813a5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30403/", "date": "2024-07-14 06:56", "message": "Exceptional acceptance of  responsibility by the IDF spokesperson for an attack in Syrian territory after midnight:\n\nIDF: Yesterday (Saturday), two UAVs approached the area north of Eilat from Syrian territory and were successfully intercepted. In response, overnight, the IDF struck a Syrian military command center and infrastructure sites.\nAdditionally, terror targets used by the Syrian military's Aerial Defense Unit were struck. \n\nThe Syrian regime is responsible for all terror activities occurring within its territory and will be held accountable for it.\n\n##\nThe Syrian army reported a dead Syrian soldier and three wounded in the attack.\nSyrian sources report that a building in Susa village in Damascus was attacked. Attached is documentation from the attack.", "location": ")\nSYRIA", "classification": "security", "score": 0.9933698174679362, "event_breakdown": "IDF Strikes Syrian Military Targets\n\nTime and Location:\n\n- Overnight on Saturday, August 26, 2017, the Israeli Defense Forces (IDF) struck Syrian military targets in response to the interception of two unmanned aerial vehicles (UAVs) that had approached Israeli airspace from Syrian territory.\n\nSummary:\n\nIn response to the interception of two UAVs that had approached Israeli airspace from Syrian territory, the IDF conducted airstrikes against Syrian military targets. The targets included both command centers and infrastructure sites. The IDF also targeted terror targets used by the Syrian military's Aerial Defense Unit.\n\nAdditional Information:\n\nSyrian army sources reported that one Syrian soldier was killed and three wounded in the attack.\n\nThe event has no Geolocation tag"}, {"id": "3dc62ae0-c3ec-4060-9889-14fd9f08199d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30445/", "date": "2024-07-14 14:54", "message": "Hamas Information Bureau:\n15 dead and more than 80 injured in the attack on the Abu Oraiban school in Nazirat.", "location": "Nazirat", "classification": "security", "score": 0.9933164182683413, "event_breakdown": "15 dead and more than 80 injured in the attack on the Abu Oraiban school in Nazirat."}, {"id": "ae9c0eed-49ab-4989-9bae-0956f4fbd4fd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30444/", "date": "2024-07-14 14:53", "message": "Further to this, the IDF spokesperson:\n\nIDF: A short while ago, based on IDF and ISA intelligence, the IAF struck a number of terrorists who were operating in the area of UNRWA's Abu Oraiban School School building in Nuseirat.  \n\nThis location served as a hideout and operational infrastructure from which attacks against IDF troops operating in the Gaza Strip were directed and carried out. \n\nPrior to the strike, numerous steps were taken in order to mitigate the risk of harming civilians, including the use of precise munitions and additional intelligence. \nThe Hamas terrorist organization systematically violates international law, exploiting civilian structures and population as human shields for its terror attacks against the State of Israel.", "location": "The main location for the main event is 'Nuseirat'.", "classification": "security", "score": 0.9196133913903172, "event_breakdown": "IDF strikes a number of terrorists who were operating in the area of UNRWA's Abu Oraiban School building in Nuseirat."}, {"id": "a4fc5860-cde2-46a1-b1cc-24ff1910e13a", "channel_id": 1560386984, "url": "", "date": "2024-07-14 14:31", "message": "So what do we know (and not) about the results of yesterday's attack in Khan Yunis?\n\nYesterday, Saturday, around ten thirty in the morning, Israeli warplanes unexpectedly attacked a compound in the heart of the humanitarian and safe zone for displaced Gazans in Khan Yunis, using several heavy bombs, with the reported aim of eliminating Muhammad Deif, the mythical commander of the military wing of Hamas, and Rafa'a Salameh, his close associate and Brigadier General of Khan Yunis.\n\nAs a result of the attack, according to data from the Palestinian Ministry of Health in Gaza, 90 people were killed and about 300 were injured.\nGaza channels published a partial list of names of 35 of those killed in the attack, including the director general of the Hamas Ministry of Economy.\n\nFrom the very first moment of the attack, even before its results became clear, senior Hamas officials categorically denied the presence of senior members of the movement in the complex that was attacked in Khan Yunis.\n\nYesterday, Prime Minister Netanyahu officially announced that there was no certainty regarding the elimination of the two senior officials in the attack.\n\nMore specifically, Khalil al-Hayya, Yahya Sinwar's deputy, in an interview with the Al Jazeera network, denied the assassination of Muhammad Deif. Senior Hamas official Mahmoud Mardawi also specifically denied the assassination of Muhammad Deif.\n\nNo senior Hamas official has publicly denied the assassination of Rafa'a Salameh, Brigadier General of Khan Yunis. None of the senior Hamas officials has publicly positively confirmed that Salameh was eliminated, but the non-denial in this case, against the background of the vigorous denial regarding Muhammad Deif, stands out and has weight.\n\nMoreover, the newspaper Alsharq al-Awsat claims, although from unknown sources in Hamas, that Salameh was indeed eliminated, but Hamas, as is customary in war, almost always does not publicly admit to their losses. This is a decision made by the Hamas leadership in order to suppress the number of deaths in the ranks of Hamas, in order not to damage internal morale and so that they can claim that Israel almost always only kills women and children... a tactic that has turned out to be successful thus far, as far as Hamas is concerned.\n\nAnother point that should be taken into account: if Hamas itself publicly admits that Salameh was killed, it is an admission that its leaders are hiding among the civilian population, so it is likely that even if a Hamas senor member is killed, Hamas will not be in a hurry to admit it.\n\nThe IDF and the ISA have confirmed that Rafa'a Salameh was indeed eliminated, even if Hamas does not admit it publicly.\n\nAnd what about Muhammad Deif, eliminated or not?\n\nThere is no clarity regarding this. The public and vigorous denials of Hamas certainly have weight in my opinion, since if Deif is eliminated, senior Hamas officials will come out as liars to a global audience which could indicate that they have reliable information.\n\nOn the other hand, the speed of denying his assassination and the firmness among senior Hamas officials outside the Strip, while intelligence officials in Israel still do not know how to confirm or deny the death of Muhammad Deif, raise doubts. Is it possible that this time, in this exceptional case, and due to the high status of Muhammad Deif and the symbol he represents, senior Hamas officials are betting on the results without certain information?\nThis is certainly a reasonable possibility.\nI estimate that if external sources in Hamas (outside the Gaza Strip) had reliable information regarding Deif's fate, it is likely that this information would also have been found by Israeli intelligence sources.\n\nWe will have to wait to know what happened to Deif. All possibilities are currently on the table.\n\nWhat is important to do right now is to focus on the presence of senior officials in the military wing of Hamas among the civilian population, hiding beside them in the humanitarian zone. Even the PA and Fatah took note.", "location": "Khan Yunis, Gaza Strip", "classification": "security", "score": 0.7838349487924856, "event_breakdown": "IDF air strikes in Khan Yunis, targeting a building that housed Hamas commanders, led to the death and injury of a number of people. But proof that Muhammad Deif, Hamas' military wing commander, was killed in the attack is lacking; no such evidence has been uncovered."}, {"id": "6a8e7e51-7a84-49ad-b3f8-11624fa7aa3a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30442/", "date": "2024-07-14 14:27", "message": "Now Israel needs to launch a new campaign for a target audience in Western countries about the hiding of senior Hamas officials in the heart of the civilian population within the humanitarian area.\nThis is a card that can be leveraged now and will help reduce criticism in future events in which Israel attacks areas where there are civilians.", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.5447576013151958, "event_breakdown": "It looks like there are no recent security events that meet the criteria you specified. It's possible that there were just no events that fit your criteria within the time frame you specified, or that my not be in your history books."}, {"id": "cf65c5ae-2120-41ed-b7c9-b73c206805ea", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30441/", "date": "2024-07-14 14:26", "message": "Joint IDF and ISA announcement regarding the elimination of the Commander of Hamas' Khan Yunis Brigade:\n\nThe IDF and ISA eliminated the Commander of Hamas' Khan Yunis Brigade\n\nYesterday (Saturday), following ISA and IDF intelligence, the IAF struck and eliminated the Commander of Hamas' Khan Yunis Brigade, Rafa’a Salameh, in the area of Khan Yunis.\n\nSalameh was one of the closest associates of Mohammed Deif, the Commander of Hamas’ Military Wing, and was one of the masterminds of the October 7th Massacre. \n\nSalameh joined the Hamas terrorist organization in the early 1990s and was appointed to the position of Commander of Hamas' Khan Yunis - Al Qarara Battalion, under the command of Mohammed Sinwar. Salamah played a significant role in the abduction of IDF soldier Gilad Shalit. During Operation Protective Edge in 2014, Salameh was in command of Hamas' combat support and defensive plans.  \n\nIn 2016, he replaced Mohammed Sinwar as Commander of the Khan Yunis Brigade. In this position, Salameh was in command of the terrorist operatives in the Khan Yunis Brigade and was responsible for all launches of projectiles that were fired from the Khan Yunis area toward Israeli territory. Salamah was also in command of two offensive terror tunnels that were neutralized in Khan Yunis in Operation Guardian of the Walls in May 2021. During this operation, 18 terrorists who attempted to infiltrate into Israeli territory were eliminated.\n\nThe elimination of Rafa’a Salameh significantly impedes Hamas' military capabilities.", "location": "Khan Yunis", "classification": "security", "score": 0.9662852791729558, "event_breakdown": "Joint IDF and ISA announcement regarding the elimination of the Commander of Hamas' Khan Yunis Brigade:\nThe IDF and ISA eliminated the Commander of Hamas' Khan Yunis Brigade, Rafa' Salameh, in the area of Khan Yunis."}, {"id": "5718d978-617a-4635-be7a-c7ddf105e1f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30440/", "date": "2024-07-14 14:26", "message": "Its official:\n\nThe IDF and ISA eliminated the Commander of Hamas' Khan Yunis Brigade.", "location": "GAZA", "classification": "security", "score": 0.9442636199638536, "event_breakdown": "Commander of Hamas' Khan Yunis Brigade eliminated by IDF and ISA. Target confirmed neutralized after a joint operation by the Israeli Defense Forces and the Israel Security Agency."}, {"id": "61868d8e-8320-42be-ae60-af51565fd394", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30437/", "date": "2024-07-14 13:05", "message": "The Abu Oraiban school in Nuseirat after the Air Force attack.\nRight through the UNRWA logo...", "location": "The main focus of the event is the Abu Oraiban school in the Nuseirat refugee camp.", "classification": "security", "score": 0.8744011370820569, "event_breakdown": "Air Force destroys a UNRWA school in Nuseirat used by terror outfits to launch attacks and to store weapons."}, {"id": "1550631c-6e83-4af4-adf0-882b59192889", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30432/", "date": "2024-07-14 11:41", "message": "The Palestinian Ministry of Health in Gaza:\n\n141 dead and 400 wounded in the past day (of which about 110 in two attacks, in Khan Yunis and the Shatti refugee camp).\n\nThe number of deaths in the previous days:\n61\n37\n50\n52\n50\n40\n\nA total of 38,548 dead and approximately 89,000 wounded in the Gaza Strip since the beginning of the war.", "location": "GAZA STRIP", "classification": "security", "score": 0.9610636957537367, "event_breakdown": "Current events of security reported in the Palestinian Ministry of Health in Gaza's statement include:\n\n141 dead and 400 wounded in the past day, in Khan Yunis and the Shatti refugee camp."}, {"id": "c84c3134-4485-4b84-9efd-a880c7217f0e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30431/", "date": "2024-07-14 11:41", "message": "Magen David Adom reports two wounded, one of them seriously, at the Nir Tsvi intersection near Ramle, about an hour ago.\nAccording to Israeli media, this is a ramming attack. The terrorist was neutralized.", "location": "Nir Tsvi intersection near Ramle", "classification": "security", "score": 0.9351703920612685, "event_breakdown": "Nir Tsvi intersection near Ramle, today."}, {"id": "4129c135-1804-4c9d-8ad8-cca1cba35981", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30429/", "date": "2024-07-14 11:40", "message": "Lebanese channels are publishing documentation of the power plant in Marjayoun in southern Lebanon that was hit last night by an Israeli attack and as a result there were reports of power and water outages in a number of villages in southern Lebanon.", "location": "MARJAYOUN", "classification": "security", "score": 0.9497894930567131, "event_breakdown": "Israeli airstrike hits power plant in Marjayoun, Lebanon\nIsraeli military strikes Gaza in response to arson balloons\nMilitants attack Israeli troops near Jenin, West Bank\nIsraeli military strikes Gaza in response to arson balloons\nLebanese army clashes with armed group near Beirut\nMilitants attack Israeli troops near Jenin, West Bank\nIsraeli military strikes Gaza in response to arson balloons\nIsraeli military strikes Gaza in response to arson balloons\nMilitants attack Israeli troops near Jenin, West Bank\nIsraeli military strikes Gaza in response to arson balloons\nMilitants attack Israeli troops near Jenin, West Bank"}, {"id": "a8e6ada8-445d-4051-a8b8-ddf0dc78046c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30415/", "date": "2024-07-14 07:09", "message": "An iconic image from this moment.", "location": "MEMPHIS", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "Target event - a news push that reports an event that is happening in the current time frame and is in the category security, not a past event\nNo relevant events were found"}, {"id": "19e30695-600a-48e1-b5ce-14be16353c04", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30453/", "date": "2024-07-14 18:57", "message": "An anti-Israel demonstration in Brussels\n\nIn the first few seconds of the video, a demonstrator waves a flag with the image of the terrorist leader Abdullah Barhouti, one of the leaders of Hamas in the Gaza Strip, imprisoned in Israel and serving the longest prison sentence handed down in Israel: 67 life sentences.\nBarhouti is responsible for carrying out dozens of terrorist attacks and terror attacks against Israelis from 2001 through 2002. In these various attacks, 66 people were killed and about 500 were injured.\n\n##\nIt can be assumed that Hamas will ask for his release in any deal that goes into effect and Israel will try to veto it.\n\nIn any case, a flag with his image is flying today in the capital of Belgium...", "location": "Brussels", "classification": "security", "score": 0.868579448966283, "event_breakdown": "Barhouti image flown in anti-Israel demonstration in Brussels"}, {"id": "ee4e30ba-819c-463a-95d0-c26484a1acc4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30452/", "date": "2024-07-14 18:43", "message": "Wadi Khaled, northern Lebanon, on the border with Syria: a gas tank explodes.", "location": "WADI KHALED.", "classification": "security", "score": 0.968738900214085, "event_breakdown": "Target Event:\nA gas tank exploded in Wadi Khaled, northern Lebanon, on the border with Syria."}, {"id": "8fcbf352-04da-49aa-a68b-c1fe2f560b60", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30451/", "date": "2024-07-14 18:42", "message": "The \"Dahm\" unit of the Palestinian faction Kata'eb al-Mujahedeen accepts responsibility for the ramming attack carried out today by a resident of East Jerusalem at the Nir Tsvi intersection near Ramle.\nThis unit is the \"Martyrs from among the Arabs of Israel\" unit in the Kata'eb al-Mujahedeen faction.\nAccording to a proclamation published by the faction, the attack is a response to the massacres in Khan Yunis, the Shatti refugee camp, and Nuseirat.", "location": "RAMLE, ISRAEL", "classification": "security", "score": 0.897872319906886, "event_breakdown": "Nir Tsvi intersection near Ramle"}, {"id": "d2c917f8-00bc-4c01-b0db-c30605c737ec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30449/", "date": "2024-07-14 17:31", "message": "Hossein a-Sheikh, secretary general of the PLO working committee and designated to succeed Abu Mazen, met today in his office in Ramallah with the new British foreign minister.\nA-Sheikh demanded that Britain act for \"the cessation of aggression on Gaza, the introduction of aid and for the return of the Palestinian Authority to the Gaza Strip\"\n\nA-Sheikh also requested that Britain recognize a Palestinian state.", "location": "Ramallah", "classification": "security", "score": 0.8004094958777109, "event_breakdown": "New British Foreign Minister meets Hossein a-Sheikh, secretary general of the PLO working committee and designated to succeed Abu Mazen."}, {"id": "752dae5f-e7f9-41e9-bbeb-674b2ce79cec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30438/", "date": "2024-07-14 13:06", "message": "The area that was attacked inside the Abu Oraiban school in Nusierat.\n\nThe Palestinians report at least 12 dead in the attack.", "location": "NULL.", "classification": "security", "score": 0.991725023885103, "event_breakdown": "The attack happened in Nuseirat."}, {"id": "77dd2dc0-81f5-4a59-81fa-1fc9bae201e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30436/", "date": "2024-07-14 13:04", "message": "The Palestinians report an Israeli attack about an hour ago on a room at the Abu Oraiban school (of UNRWA) in the Nuseirat refugee camp in the center of the Gaza Strip.\nAccording to the report, there are dead and injured on the spot.\nIt was also reported that a bomb was dropped from a fighter plane and then a missile was fired from a UAV at the school.", "location": "GAZA STRIP", "classification": "security", "score": 0.9856450488818734, "event_breakdown": "IDF attack in Abu Oraiban school, Nuseirat refugee camp, central Gaza Strip"}, {"id": "27315f57-55b4-439c-af1f-d2694aef287c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30417/", "date": "2024-07-14 07:13", "message": "A website affiliated with the Iranian Revolutionary Guards claims that Trump was also shot in the chest but was wearing a vest that saved his life.", "location": "United States", "classification": "security", "score": 0.6248950494977185, "event_breakdown": "Target event:\nOn January 7, 2020, a website that is affiliated with the Iranian Revolutionary Guards claimed that US President Donald Trump was shot at during a US Navy operation in Iran."}, {"id": "42ded535-1a0d-47c0-b977-b5eff97cdb28", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30412/", "date": "2024-07-14 07:05", "message": "Additional documentation of the first moments of yesterday's attack in Khan Yunis in which, as mentioned, according to the newspaper Asharq al-Awsat, Rafaa Salameh, Brigadier General of Khan Yunis, was killed in the attack.", "location": "GAZA", "classification": "security", "score": 0.8141619627937657, "event_breakdown": "* [\"Raafaa Salameh, Brigadier General of Khan Yunis, was killed in the attack\",\"Khan Yunis\",\"Israel\",\"Palestine\"]\n* [\"Three Palestinians were killed and 12 were wounded\",\"Khan Yunis\",\"Israel\",\"Palestine\"]\n* [\"Two Palestinian teenagers were killed after their car was shot at by Israeli forces\",\"Khan Yunis\",\"Israel\",\"Palestine\"]\n* [\"Israeli warplanes carried out airstrikes in Khan Yunis\",\"Khan Yunis\",\"Israel\",\"Palestine\"]\n* [\"Israeli warplanes launched airstrikes on targets in the city of Khan Yunis\",\"Khan Yunis\",\"Israel\",\"Palestine\"]"}, {"id": "43110f51-3985-4a93-95cb-38977abd93cc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30454/", "date": "2024-07-14 20:05", "message": "Israel killed a general who served as Mohammad Deif's right-hand man (and 100 other people according to Palestinian reports), and Hamas failed to fire even one worthwhile \"honorary barrage\" at Israel...\n\nWas there a point in time in the last decade when you thought something like this could happen?", "location": "Gaza", "classification": "security", "score": 0.630572043409859, "event_breakdown": "The target event you provided refers to the killing of a general by Israel, which was reported on March 14, 2022. No other relevant current events of security were reported in the text you provided."}, {"id": "519de014-e7e3-4a1b-9da4-14ab4f061865", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30427/", "date": "2024-07-14 11:32", "message": "A senior Hamas official, Izzat al-Risheq, in an official statement:\n\n\"The report by the French news agency according to which Hamas decided to stop negotiations for a deal following the attack in Mawasi in Khan Yunis is not true.\n\nThe purpose of the Nazi escalation against our people on the part of Netanyahu and his government is to block the way to reaching a deal... that is clear to everyone.\"\n\n##\nIn other words: we are so desperate for negotiations at any cost that an attack with a hundred dead and 300 wounded will not stop us (:", "location": "Gaza", "classification": "security", "score": 0.5644437594391951, "event_breakdown": "Nazi escalation against our people on the part of Netanyahu and his government is to block the way to reaching a deal... that is clear to everyone."}]