[{"id": "a8ad1a95-6f9b-4994-a5a6-1475e3de727b", "channel_id": 1560386984, "url": "", "date": "2024-06-16 11:11", "message": "The chairman of the political bureau of Hamas in a speech on the occasion of the holiday: victory is near. The enemy is broken.\n\nFrom the speech of Ismail Haniyeh, Chairman of the Political Bureau of Hamas, on the occasion of the Feast of Sacrifice:\n\n\"Tufan al-Aqsa\" is a historical campaign whose first results can already be seen and are expressed in the helplessness of the leadership of the occupation and its supporters who show despair and brokenness on their part.\n\nIt is also possible to notice signs of disintegration in the occupation government that foreshadow its defeat and breakdown.\n\nThe criminal enemy who is committing barbaric genocide has failed to achieve any of his stated goals.\n\nOur nation will took revenge on October 7th for the oppression and restrictions imposed on it and it will not back down until it achieves the end of the occupation and the realization of freedom, independence and return.\n\nThe residents of the Gaza Strip sacrificed everything that was dear to them while standing firm and patient, despite all the suffering and pain they experienced.\n\nEven though the enemy is trying to destroy the capabilities of the military wing of Hamas, it shows its heroic deeds as happened yesterday in Rafah. Allah will bring about a victory that is near thanks to the military activists. Victory and freedom for our prisoners are near.\n\nThe hunger in Gaza and especially in the north of the Gaza Strip that we see in the photos coming from the Gaza Strip rests on the shoulders of the international community and especially on the countries that support the murderous occupation.\n\nThe solution to the situation in Gaza will come through negotiations on a comprehensive agreement. Hamas is serious about this.\n\n##\nHaniyeh presents a militant line. He talks about the defeat of the enemy, about an imminent victory and congratulates the people of Gaza for their firm stand. This is in fact the narrative that the Palestinian media outlets are pumping from morning to evening, using quotes taken from the Israeli media. They use this as proof of Haniyeh's narrative and fuel for its continued marketing.", "location": "GAZA", "classification": "antisemitism", "score": 0.5103400577392718, "event_breakdown": "Target event:\nThe target event is Haniyeh presenting a militant line. He uses quotes from Israeli media as proof of his narrative and fuel for its continued marketing."}]