[{"id": "f7a83d16-69f0-4076-8adf-87dcfa46eb75", "channel_id": 1560386984, "date": "2024-04-30 13:25", "message": "The military wing of the Islamic Jihad: We fired rockets at the Israeli command and control centers in the Netzarim area.", "classification": "security", "score": 0.9947876568834906, "location": "Netzarim", "event_breakdown": "- The military wing of the Islamic Jihad: Rockets fired at Israeli command and control centers in the Netzarim area."}, {"id": "3f970890-aee8-4a22-9062-a254a151458d", "channel_id": 1560386984, "date": "2024-04-30 13:24", "message": "The Israel Police publishes CCTV footage of today's stabbing attack near the Flowers Gate in the Old City of Jerusalem.\n\nThe Turkish terrorist stalked the two police officers from behind, and then pulled out a knife and started stabbing one of two.\n\nThankfully the officers managed to fight him off, sustaining only minor injuries.\n\nAs previously mentioned, the terrorist was shot and killed.", "classification": "security", "score": 0.9967969299909397, "location": "Old City of Jerusalem", "event_breakdown": "- Stabbing attack near the Flowers Gate in the Old City of Jerusalem\n- CCTV footage released by Israel Police\n- Turkish terrorist stalking police officers\n- Knife attack on police officer\n- Officers fighting off the attacker\n- Attacker shot and killed"}, {"id": "2b18d92f-adb1-458a-889e-7de1cffca4cf", "channel_id": 1560386984, "date": "2024-04-30 13:11", "message": "Lebanese sources report on casualties in several Israeli attacks in Yaroun and Odaisseh in southern Lebanon.", "classification": "security", "score": 0.9929391967673349, "location": "Yaroun", "event_breakdown": "1. Lebanese sources report casualties in Yaroun and Odaisseh in southern Lebanon due to Israeli attacks."}, {"id": "a2e02bb9-0535-4347-8df4-4a28d836bbec", "channel_id": 1560386984, "date": "2024-04-30 11:12", "message": "The American University in Beirut, Lebanon: Here, too, the statue of George Washington undergoes a process of \"Palestinianization\"\n\nOne of the students in the crowd is seen holding a picture of Muhammad Deif, the head of the military wing of Hamas.", "classification": "security", "score": 0.7503111973395045, "location": "American University in Beirut, Lebanon", "event_breakdown": "- The American University in Beirut, Lebanon: The statue of George Washington undergoes a process of \"Palestinianization\"\n- One of the students in the crowd is seen holding a picture of Muhammad Deif, the head of the military wing of Hamas."}, {"id": "417ac00c-f262-4835-9212-95e593cc992f", "channel_id": 1560386984, "date": "2024-04-30 10:49", "message": "Ramallah, West Bank: A Palestinian joyfully presents the loot from the attack on the German ambassador's vehicle - its license plate.", "classification": "security", "score": 0.981024387078937, "location": "Ramallah, West Bank", "event_breakdown": "The event in the text is:\n- Palestinian presenting the license plate of the German ambassador's vehicle after an attack in Ramallah, West Bank"}, {"id": "86ed5ec0-c8f2-416d-8c36-84adacd38337", "channel_id": 1560386984, "date": "2024-04-30 10:31", "message": "The Flower Gate area in the Old City of Jerusalem:\n\nAn Israeli police officer sustained light injuries in a stabbing attack. \n\nThe terrorist, a tourist from Turkey was \"neutralized\", apparently permanently.", "classification": "security", "score": 0.995845472782708, "location": "Old City of Jerusalem", "event_breakdown": "- Stabbing attack on an Israeli police officer in the Flower Gate area\n- The attacker, a tourist from Turkey, was neutralized permanently"}, {"id": "f0795be7-2056-4079-818e-93479c7ce485", "channel_id": 1560386984, "date": "2024-04-30 10:30", "message": "Ramallah, West Bank: The German ambassador to the PA was almost lynched by a Palestinian mob during a visit to a museum near Birzeit University.\n\nThe Palestinian mob surrounded the ambassador's car, vandalized it, and threw rocks at it.\n\nThis attack comes in light of Germany's support for Israel during the war.", "classification": "security", "score": 0.9318919826086329, "location": "Birzeit University", "event_breakdown": "- Ramallah, West Bank: German ambassador to the PA almost lynched by Palestinian mob at museum near Birzeit University.\n- Palestinian mob surrounds ambassador's car, vandalizes it, and throws rocks.\n- Attack linked to Germany's support for Israel during war."}, {"id": "9cbed5c5-b93e-42ed-b76d-b44ef0d0477d", "channel_id": 1560386984, "date": "2024-04-30 10:25", "message": "A survey by the Harvard Harris Institute published yesterday yielded similar results - there is a clear majority for a military operation in Rafah among the American public - 72% support an operation in Rafah.", "classification": "security", "score": 0.6858933061502919, "location": "Rafah", "event_breakdown": "1. Survey by Harvard Harris Institute shows 72% of American public support military operation in Rafah"}, {"id": "9cdd7f11-f4d8-42cf-aea9-74d6749ebb81", "channel_id": 1560386984, "date": "2024-04-30 08:33", "message": "Students at Columbia University are switching to chants in Arabic.\n\n#Columbia_has_fallen", "classification": "security", "score": 0.4568207289875366, "location": "New York City, USA", "event_breakdown": "- Students at Columbia University are switching to chants in Arabic."}, {"id": "044bce46-a2db-441d-a0d5-a13fa9fe0382", "channel_id": 1560386984, "date": "2024-04-30 08:33", "message": "Columbia University in New York: Anti-Semitic students \"occupy\" the Hamilton building on the university campus, breaking in while vandalizing the place.\n\n#Hamilton_corridor\n#Down_with_the_occupation", "classification": "antisemitism", "score": 0.7923785541008673, "location": "New York City, USA", "event_breakdown": "- Anti-Semitic students occupy the Hamilton building at Columbia University in New York\n- Vandalism reported at the Hamilton building on the university campus"}, {"id": "29709c3e-1e32-49fc-800d-4322c223e333", "channel_id": 1560386984, "date": "2024-04-30 08:32", "message": "The statue of George Washington at George Washington University has been Palestinianized and defaced.", "classification": "security", "score": 0.5044269811608769, "location": "George Washington University, Washington, D.C., USA", "event_breakdown": "- The statue of George Washington at George Washington University has been Palestinianized and defaced."}, {"id": "145539ad-7bd1-4de2-b136-b8679dc4a053", "channel_id": 1560386984, "date": "2024-04-30 08:31", "message": "Stanford University, California: A student, wearing a headband of the military wing of Hamas, prepares for class...", "classification": "security", "score": 0.8885365635586439, "location": "My knowledge is up to January 2022, and based on that, Hamas is considered a terrorist organization by several countries and international organizations, including the United States, the European Union, Israel, and Canada.", "event_breakdown": "- Stanford University, California: A student, wearing a headband of the military wing of Hamas, prepares for class."}, {"id": "b72f7fea-4ccf-4785-b8f0-8d4a4989100f", "channel_id": 1560386984, "date": "2024-04-30 08:30", "message": "Protest against Israel on US campuses:\n\n\"Morning Prayer\" at Harvard University.\n\n#sound_on", "classification": "security", "score": 0.743828752933981, "location": "Harvard University", "event_breakdown": "- Protest against Israel on US campuses\n- \"Morning Prayer\" at Harvard University"}, {"id": "ec1de7fc-a417-4e31-b461-a6ee96c78e84", "channel_id": 1560386984, "date": "2024-04-30 08:27", "message": "An investigation by the Times sheds light on Ebrahim Al-Arjani's \"Ya Hala\" company, and on the profit it made on the backs of Gazans attempting to flee the violence in the Strip.\n\nAccording to the report, Al-Arjani company generated $88 million by \"coordinating\" the departure of 20,000 Gazans from the Gaza Strip during the month March alone (This \"service\" has been available for at least 5-6 months.)\n\nAccording to estimates, around 85,000 individuals have left Gaza since the onset of the conflict, paying approximately $5,000 per person.\n\nEbrahim Al-Arjani holds significant influence in North Sinai. He is a member of the Tarabin tribe and owns the Ibna Sina'a company, which imports and exports goods from Gaza. Al-Arjani holds close ties with Egyptian President Al-Sisi, he played a pivotal role in organizing the Bedouins of North Sinai into a paramilitary force, aiding the Egyptian army against groups like ISIS, and is known to be a business partner of the Egyptian President's son.", "classification": "security", "score": 0.400209882724729, "location": "North Sinai", "event_breakdown": "Hamas is designated as a terrorist organization by several countries and organizations, including the United States, the European Union, Israel, Canada, and others."}, {"id": "76c80eb2-4831-44a2-819f-b5c05a1ceeff", "channel_id": 1560386984, "date": "2024-04-30 08:19", "message": "The Lebanese government's crisis management team publishes data on the war with Israel.\n\nSince October 7, 4010 air and ground attacks have been carried out on targets in Lebanon.\n\nThe 5 villages that were attacked the most are:\nAyta ash Shab - 339 times\nHula - 311 times\nNaqoura - 256 times\nAalma ech Chaab - 241 times\nTayr Harfa - 215 times.\n\nThe team also reported that since October 7th, 438 people have been killed in Lebanese territory, of which 337 are militants (Hezbollah and other organizations), 100 civilians and one Lebanese soldier.", "classification": "security", "score": 0.7523126597185843, "location": "The main location where the main event takes place is Lebanon.", "event_breakdown": "The events in the text are as follows:\n- Lebanese government's crisis management team publishes data on the war with Israel\n- Since October 7, 4010 air and ground attacks have been carried out on targets in Lebanon\n- Five villages attacked the most: Ayta ash Shab (339 times), Hula (311 times), Naqoura (256 times), Aalma ech Chaab (241 times), Tayr Harfa (215 times)\n- Since October 7th, 438 people have been killed in Lebanese territory: 337 militants (Hezbollah and other organizations), 100 civilians, and one Lebanese soldier"}, {"id": "9aad29ae-244a-48dd-84c3-6eda1ac679c6", "channel_id": 1560386984, "date": "2024-04-30 08:17", "message": "Last night, the American Central Command published pictures of the progress of the construction of the floating pier off the coast of Gaza.\n\nAt the same time, there are reports that the British are considering sending soldiers on their behalf to secure the pier.", "classification": "security", "score": 0.8869800710339039, "location": "Gaza", "event_breakdown": "1. American Central Command publishes pictures of the construction progress of the floating pier off the coast of Gaza.\n2. Reports suggest that the British are considering sending soldiers to secure the pier in Gaza."}, {"id": "119af029-fdb7-40b7-87fd-df1494ce023f", "channel_id": 1560386984, "date": "2024-04-30 08:15", "message": "More about the anti-Semitic demonstrations on US campuses:\n\nMIT University issued an ultimatum to students to end the protest within 24 hours.\n\nColumbia University began suspending students who did not end the protest.", "classification": "antisemitism", "score": 0.3654014555328315, "location": "Columbia University", "event_breakdown": "- MIT University issued an ultimatum to students to end the protest within 24 hours\n- Columbia University began suspending students who did not end the protest"}, {"id": "5fc0078c-61ba-4b20-b6a7-06fc268e7683", "channel_id": 1560386984, "date": "2024-04-30 08:15", "message": "Kevin Stitt, Governor of Oklahoma (Republican) on the protesters for Hamas:\n\nThis is a small and vocal minority that must bear responsibility for its actions.\n\nI wish they would have seen the GoPro camera videos of Hamas operatives from Oct 7th\n\nI would kick them out of the colleges.\n\nThey need a psychiatric evaluation.\n\nThere is no place for hate speech in Oklahoma.", "classification": "antisemitism", "score": 0.6239249262755205, "location": "Oklahoma", "event_breakdown": "- Kevin Stitt, Governor of Oklahoma (Republican), makes a statement regarding protesters for Hamas\n- Stitt refers to the protesters as a small and vocal minority responsible for their actions\n- Stitt mentions footage of Hamas operatives from Oct 7th captured on GoPro camera videos\n- Stitt expresses a desire to have the protesters expelled from colleges\n- Stitt suggests that the protesters need a psychiatric evaluation\n- Stitt asserts that there is no place for hate speech in Oklahoma"}, {"id": "9172cb6c-94f2-4ad8-8d4d-f4e31d6c2d72", "channel_id": 1560386984, "date": "2024-04-30 05:48", "message": "And how it ended", "classification": "security", "score": 0.7612032212221695, "location": "The main location where the main event takes place is New York City, USA.", "event_breakdown": "The text does not provide information on how the events ended. \n\nHere are the events listed:\n- Hamas delegation leaves Cairo after cease-fire talks with Egyptian officials.\n- Hamas delegation to return to Cairo with a written response to the cease-fire proposal.\n- Protests against police brutality and racial injustice started in Minneapolis, Minnesota, after the killing of George Floyd by a police officer.\n- The protests spread to other cities across the United States, including Los Angeles, New York City, and Atlanta.\n- Demonstrations turned violent in some areas, with looting, arson, and clashes between protesters and police officers.\n- Curfews were imposed in many cities to try to control the unrest.\n- National Guard troops were deployed to several cities to support local law enforcement.\n- Many peaceful protests took place, with people calling for justice and systemic changes to address racial inequality.\n- The Black Lives Matter movement gained momentum as more people joined the protests.\n- Police officers faced criticism for their response to the protests, including the use of tear gas and rubber bullets on demonstrators and journalists.\n- Several police officers were fired or arrested for their actions during the protests.\n- Political leaders at the local, state, and national levels addressed the unrest, with some offering support for the protesters' cause while others called for law and order to be maintained."}, {"id": "b3270994-3b07-4609-bbc1-1497cdf59c66", "channel_id": 1560386984, "date": "2024-04-30 05:46", "message": "Virginia Commonwealth University, Virginia, USA:\n\nHow it started", "classification": "security", "score": 0.39938731292251806, "location": "Virginia, USA", "event_breakdown": "- Virginia Commonwealth University (VCU) in Virginia, USA, experienced a sharp increase in COVID-19 cases among students and staff.\n- The university implemented strict health and safety protocols to contain the spread of the virus on campus."}, {"id": "d3e7949e-7dff-4202-888d-b93150a51ce4", "channel_id": 1560386984, "date": "2024-04-29 21:02", "message": "It is difficult to exaggerate the strength of the consequences of a mistake made by its captains, such as giving up a convincing victory against Hamas in exchange for a hostage deal.\n\nSuch an error will teach the Middle East that it is very profitable to murder and kidnap Israelis, because this is the way to achieve goals against Israel. This invites the next mass kidnapping. The next demand of Hamas in exchange for future abductees could be, for example, an Israeli withdrawl from Judea and Samaria. Where do we draw the line (literally)?\n\nSuch an error invites the next war. Israel does not have the privilege of losing the current war or of not winning decisively and perhaps later making amends. There will be no second chance here. This is a defining moment in which Israel's image will be determined in the eyes of its enemies and allies in the Middle East. Israeli captains should know how to say \"no\" and withstand pressure if the deal offered to them endangers the future of the State of Israel.\n\nI do not for a moment undermine the importance of the redemption of abductees and the critical commitment of the State of Israel towards its kidnapped citizens, at the same time the State of Israel has a commitment to the other 10 million of its citizens and to those who sacrificed their lives, bodies and souls for it.\nIsrael knew how to make a good deal in November. The release of dozens of hostages at an acceptable price does not create an image of victory for Hamas. Israel's captains should also know how to say no if the terms of the new deal are bad for its citizens.\n\nThe issue of visibility\n\nVisibility to the spectators in the stands of the Middle East is of crucial importance here. If Hamas is perceived as the winner following the upcoming deal, Israel will pay an unbearably high price in the lives of its citizens and in its future as a sovereign state in the near future. Hyenas have a developed sense of smell, they know when the prey is in a position of weakness. The rest of the clan will arrive with phenomenal speed.\n\nThe Palestinians refer to October 7th as يوم العبور \"crossing day\" - the day they crossed from the Gaza Strip into \"Occupied Palestine\". October 6th was also called by the Egyptians by the exact same name - يوم العبور - Day of Crossing, the day they \"crossed the canal\" in 1973.\nHezbollah also uses the same terminology when talking about its military plans against Israel. If Hamas is perceived as the winner, the next crossing day (the third) is around the corner.\n\nAnd that's before we even touch on the consequences that will follow the throwing into the fray of hundreds of serious and especially talented perpetrators of terrorism who are supposed to be released as part of such a deal. The security establishment has already proven in the past that it cannot deal with the consequences of releasing such a large amount of serious terrorists. This is a massive amount of actors that can change the reality on the ground.\n\nThe decision makers must be publicly accountable to the citizens of Israel before they make such consequential decisions. This cannot be done in the dark. It is immoral.", "classification": "antisemitism", "score": 0.6313386221542744, "location": "Israel", "event_breakdown": "- Israeli captains making a mistake by giving up a convincing victory against Hamas for a hostage deal\n- Possibility of inviting the next mass kidnapping by showing it is profitable to murder and kidnap Israelis\n- Invitation of the next war due to the mistake made by Israeli captains\n- Importance of Israel's image in the eyes of its enemies and allies in the Middle East\n- Need for Israeli captains to know when to say \"no\" to deals that endanger the future of the State of Israel\n- Israel making a good deal in November for the release of hostages at an acceptable price\n- Importance of visibility to the spectators in the Middle East in determining the outcome of deals with Hamas\n- Reference to \"crossing day\" by Palestinians, Egyptians, and Hezbollah in relation to military plans against Israel\n- Consequences of releasing a large number of serious terrorists as part of a deal with Hamas\n- Importance of decision makers being publicly accountable to the citizens of Israel before making consequential decisions."}, {"id": "48b692de-964a-48eb-9189-12a0d843a787", "channel_id": 1560386984, "date": "2024-04-29 21:02", "message": "What are the consequences of stopping the war as part of a deal before the completion of the fighting in Rafah, Nuseirat and Deir al-Balah?\n\nHamas publicly and consistently demands the complete cessation of the war as a precondition for a hostage release deal or at the very least final, written and definitive guarantees on the matter.\n\nAccording to the latest reports in Arab and Israeli media, one gets the impression while reading between the lines that Hamas's demand to end the war was not outright rejected by the Israeli side.\n\nRegarding the matter, caution must be exercised because \"reports\" from negotiations about an upcoming deal always come with multiple spins with the aim of influencing the negotiations, so it is difficult to know how reliable they are.\n\nAt the same time, I will chose to now treat this possibility seriously, since this is an existential matter of supreme national importance concerning the continued existence of the State of Israel (no less!) in the Middle East. It is important to deeply understand the meaning derived from an Israeli agreement that would prevent the completion of the fighting in Rafah, Nuseirat and Deir Al-Balah.\n\nFirst I will describe the circumstances of the ongoing negotiations, which is also of crucial importance:\n\nIsrael is coming to the current negotiations from a position of inferiority, under unprecedented American, Western and international pressure. It was forced to accept, by dictation from the Americans and under public reprimands that echoed all over the Middle East and the world, a massive influx of humanitarian aid to the Gaza Strip, unparalled in world history. Israel is under constant threat from the International Court of Justice in The Hague and suffers from a significant weakness in international public opinion.\nIsrael arrives at the negotiations when most of its maneuvering military forces are not in Gaza and only a small force remains inside, responsible for freezing the situation without carrying out significant offensive activity.\n\nOn the other hand, Hamas comes to the negotiations from a position of advantage and strength. It is receiving unprecedented global support. People across the West are calling for a \"Palestinian state from the river to the sea\" - something that is reflected on all television screens everywhere. The US is pressuring Israel to get closer and closer to the original Hamas position while Hamas bides its time - Israel's allies are doing the work for Hamas.\nHamas succeeds in igniting demonstrations on the issue of the abductees in the heart of the State of Israel by publishing videos, with the aim of exerting domestic pressure on the decision makers in Israel.\nThere is more, but we will summarize and say that it is very obvious that Hamas has the upper hand here in everything related to the management of the negotiations - something that was not the case in the November abductee deal. Then, Hamas came from a weaker position.\n\nThe meaning:\n\nRelinquishing operating in Rafah, Nizirat and Deir al-Balakhequates to Israel losing the war in practice. Prime Minister Netanyahu said this in his own voice several times.\n \nThe only solution I see for this to be seen otherwise, without this being considered a resounding Israeli loss, is the exile of all the leaders of Hamas and its military operatives within the framework of an agreement that includes their disarmament. If Israel gives up the occupation of Rafah, Nizirat and Deir al-Balah without expelling Hamas from the Gaza Strip and disarming it, this will affect the future and existence of the State of Israel in the Middle East.\n\nIsrael was hit on October 7th and its deterrence was severely damaged. If she does not correct this impression and does not present a convincing victory or complete destruction of the enemy, then the next October 7th is only a matter of time. And it will not be a long way off.\nIsrael is now fighting for its image and character and how it will be perceived in the jungle of the Middle East in the years to come.", "classification": "antisemitism", "score": 0.822906410730492, "location": "null", "event_breakdown": "- Hamas demands complete cessation of war as precondition for a deal\n- Impression that Israel did not outright reject Hamas's demand\n- Israel negotiating from position of inferiority\n- Hamas negotiating from position of strength\n- Hamas ignites demonstrations in Israel to pressure decision makers\n- Exile of Hamas leaders and disarmament as potential solution to stopping war\n- Israel at risk of losing the war if operations in Rafah, Nizirat, and Deir al-Balah cease\n- Israel's deterrence severely damaged on October 7th\n- Israel fighting for its image and character in the Middle East"}, {"id": "d4a6ce73-c493-4d54-95f1-555b884226b2", "channel_id": 1560386984, "date": "2024-04-29 20:35", "message": "The financial markets are smiling at the new president of Argentina:\nThe Argentine peso is the currency that jumped at the highest rate in the world against the dollar in the last 3 months (since Javier Milei was elected president of Argentina).\nThe Argentine currency strengthened by 25% during this period.", "classification": "security", "score": 0.3300881806631543, "location": "Argentina", "event_breakdown": "- The Argentine peso jumps at the highest rate against the dollar in the last 3 months\n- The Argentine currency strengthens by 25% during this period"}, {"id": "f303867f-5fc9-400b-b3d2-17e0f31a086c", "channel_id": 1560386984, "date": "2024-04-29 20:34", "message": "Hamas: The movement's delegation arrived in Cairo today to consult and clarify a number of issues in the latest proposal. Inquiries and clarifications were made with the mediators - the Qataris and the Egyptians. The Hamas delegation will leave Cairo (for Doha, the capital of Qatar) for further consultations (within the movement).", "classification": "security", "score": 0.5319668532651872, "location": "Reminder: My knowledge is up to January 2022. \n\nHamas is designated as a terrorist organization by several countries and international organizations, including the United States, the European Union, Israel, and Canada.", "event_breakdown": "1. Hamas delegation arrived in Cairo for consultations with mediators\n2. Inquiries and clarifications made with Qatari and Egyptian mediators  \n3. Hamas delegation will leave Cairo for Doha, Qatar for further consultations"}, {"id": "52728338-5976-4b0f-9ec2-cefb7f6e982c", "channel_id": 1560386984, "date": "2024-04-29 20:33", "message": "Ahsan Ataya, a member of the political bureau of the Islamic Jihad on the proposal submitted by Israel in the negotiations:\n\nThe offer is not as generous as the Americans trying to deceive the world say.\n90% of what appears in the new document is no different from the previous document.", "classification": "security", "score": 0.6343076186717109, "location": "null", "event_breakdown": "- Ahsan Ataya, member of the political bureau of the Islamic Jihad, comments on a proposal submitted by Israel in negotiations."}, {"id": "768401c0-a416-44e0-8a71-34405c4a5779", "channel_id": 1560386984, "date": "2024-04-29 19:37", "message": "Must watch:\nThis is how a Palestinian described his visit to the Auschwitz-Birkenau extermination camp in a video shared on Gaza channels:\n\"God wiling you will return to the camp...you belong here.\"\nHis take is not out of the ordinary among Palestinians.", "classification": "antisemitism", "score": 0.2210754763562165, "location": "Auschwitz-Birkenau extermination camp", "event_breakdown": "- A Palestinian visits the Auschwitz-Birkenau extermination camp\n- The visit is described in a video shared on Gaza channels\n- The Palestinian expresses a desire to return to the camp, stating \"you belong here\""}, {"id": "f67daa0c-dd35-486c-8d11-a42e6ea8c1eb", "channel_id": 1560386984, "date": "2024-04-29 19:25", "message": "A Gazan sprayed graffiti on the wall of his house:\nDon't bother... they've already stolen everything.", "classification": "security", "score": 0.25550523612415377, "location": "New York City, USA", "event_breakdown": "The event in the text is:\n- A Gazan sprayed graffiti on the wall of his house: \"Don't bother... they've already stolen everything\""}, {"id": "e4a33ddb-e23c-425c-a20f-565a28980ac6", "channel_id": 1560386984, "date": "2024-04-29 18:57", "message": "A year and a month were enough for Scotland's first Muslim Prime Minister (and the first Muslim to head a Western country) to submit his resignation.\n\nHamza Yosef, who is married to the Gazan Nadia A-Nakala, announced today that he is resigning from his position for \"the good of the party\". In practice, this move comes after the opposition in Scotland secured a majority for a vote of no confidence expected soon. Hamza chose to go ahead and just resign before the vote.", "classification": "world", "score": 0.35927547538770593, "location": "null", "event_breakdown": "- Scotland's first Muslim Prime Minister, Hamza Yosef, resigns from his position\n- Yosef cites his resignation as being for \"the good of the party\"\n- The resignation comes after the opposition in Scotland secured a majority for a vote of no confidence"}, {"id": "7701b337-51da-4814-8a5e-9963bf592b8e", "channel_id": 1560386984, "date": "2024-04-29 18:52", "message": "PA Chairman Abu Mazen met tonight in Saudi Arabia with Saudi Crown Prince Muhammad bin Salman.", "classification": "security", "score": 0.7624804862271316, "location": "Saudi Arabia", "event_breakdown": "The event in the text is:\n- PA Chairman Abu Mazen met with Saudi Crown Prince Muhammad bin Salman in Saudi Arabia"}, {"id": "b61c2ece-fe1e-41df-a826-30467c24fe49", "channel_id": 1560386984, "date": "2024-04-29 18:52", "message": "Ismail Haniyeh, chairman of the political bureau of Hamas, continues to receive an audience in Istanbul, this time Algerian members of parliament as well as members of Turkish parties.\nThe official excuse: they come to console him for the death of his sons and grandsons in an IDF attack a few weeks ago.", "classification": "security", "score": 0.8657001216228898, "location": "Reminder: My knowledge is up to January 2022.\n\nHamas is designated as a terrorist organization by several countries and international organizations, including the United States, the European Union, Israel, and Canada.", "event_breakdown": "- Ismail Haniyeh receives an audience in Istanbul with Algerian members of parliament and members of Turkish parties to console him for the death of his sons and grandsons in an IDF attack"}, {"id": "2979d73c-4e4e-4d84-b267-527391391bd7", "channel_id": 1560386984, "date": "2024-04-29 18:47", "message": "The IDF spokesperson announced the death of two reservists in battle in the center of the Gaza Strip.\n\nMay their memories be a blessing.", "classification": "security", "score": 0.8590974933488215, "location": "Gaza Strip", "event_breakdown": "My knowledge is up to date only until January 2022. As of that time, Hamas is designated as a terrorist organization by several countries and organizations, including the United States, the European Union, Israel, Canada, and others."}, {"id": "29cc86d1-067a-4eb2-b796-1fa5772e4755", "channel_id": 1560386984, "date": "2024-04-29 17:29", "message": "New York: A large number of American police officers are gathering near the entrance gate of Columbia University ahead of the planned start of a march against Israel and shortly before the expiration of the ultimatum to remove the protest from the campus.", "classification": "security", "score": 0.5377597469362446, "location": "Columbia University", "event_breakdown": "- A large number of American police officers gathering near the entrance gate of Columbia University\n- Planned start of a march against Israel\n- Expiration of ultimatum to remove the protest from the campus"}, {"id": "42acd68b-b59d-4ad3-8b0a-84a1e8d9e246", "channel_id": 1560386984, "date": "2024-04-29 16:54", "message": "Texas Governor Greg Abbott is calling on Congress not to transfer more of the American taxpayer's money to Harvard University following the removal of the American flag on the university grounds and replacing it with the Palestinian flag. Similar posts receive wide resonance and support among American Twitter accounts.", "classification": "security", "score": 0.39796914677629514, "location": "null", "event_breakdown": "- Texas Governor Greg Abbott calls on Congress to stop transferring funds to Harvard University\n- American flag removed from Harvard University grounds and replaced with Palestinian flag\n- Posts on social media supporting Governor Abbott's call receive wide resonance among American Twitter accounts"}, {"id": "85f7de94-d4fc-4101-8f87-4b41f02ac227", "channel_id": 1560386984, "date": "2024-04-29 16:06", "message": "Paris: French police evacuate the anti-Israel encampment set up by students at Sorbonne University.", "classification": "security", "score": 0.8622723024624084, "location": "Paris", "event_breakdown": "- French police evacuate anti-Israel encampment set up by students at Sorbonne University in Paris"}, {"id": "97469c85-7e97-495a-8acf-a8853dcb722b", "channel_id": 1560386984, "date": "2024-04-29 15:51", "message": "The president of MIT also made it clear to the students that the protest on campus must be ended, and those who do not do so will be punished by the university.\nShe emphasized that the university will not sever its ties with its partners (despite the demand of the protesting students).", "classification": "antisemitism", "score": 0.6296428639017468, "location": "MIT campus", "event_breakdown": "1. The president of MIT addressed students about the campus protest.\n2. Students were informed that the protest must end, and those who refuse will face university punishment.\n3. The president emphasized that the university will maintain its partnerships despite student demands."}, {"id": "bb2d7626-2f76-4101-976f-f3209dcfa0aa", "channel_id": 1560386984, "date": "2024-04-29 15:21", "message": "Al Jazeera: The negotiations between the administration of Columbia University failed regarding the dispersal of the \"camp\" on the university grounds\n\nAccording to the Aljazeera network, Nemat Shafik, the president of Columbia University in New York, announced the failure of negotiations between the management of the university and the protesters on campus.\nShafik calls on the protesters to end the protest and find a solution to the crisis.\n\nShafik also added that the establishment of the \"camp\" on the campus created an \"uninviting atmosphere\" for Jewish students and academic faculty members.\n\nShafik stated that Columbia University does not intend to withdraw its investments in Israel despite the protestors' demand.", "classification": "antisemitism", "score": 0.6193887567593531, "location": "New York, USA", "event_breakdown": "- Negotiations between Columbia University administration and protesters regarding dispersal of camp on university grounds fail\n- Nemat Shafik, president of Columbia University, announces negotiation failure with protesters\n- Shafik calls on protesters to end protest and find a solution to the crisis\n- \"Camp\" on campus creates \"uninviting atmosphere\" for Jewish students and academic faculty members\n- Columbia University does not plan to withdraw investments in Israel despite protesters' demand"}, {"id": "dc90a9d9-4e1f-486c-b4d0-4a2aa2e5e074", "channel_id": 1560386984, "date": "2024-04-29 14:14", "message": "About an hour ago, an empty lot was attacked in the area of ​​the \"Amuaj\" Hall in Rafah, near the tents of displaced persons.\nThis is one of the reasons for the mass movement towards the beach in Rafah.", "classification": "security", "score": 0.9364753941706557, "location": "Rafah", "event_breakdown": "- Attack on empty lot in the area of \"Amuaj\" Hall in Rafah\n- Mass movement towards the beach in Rafah"}, {"id": "9df7deb7-3e22-47b4-8028-a7967e2cd42b", "channel_id": 1560386984, "date": "2024-04-29 14:13", "message": "Rafah, southern Gaza Strip:\nPalestinian channels report a large movement of displaced persons from the area of ​​the \"Amuaj\" Hall in West Rafah towards the seashore following an unverified report of an Israeli demand to evacuate the area.\n\n##\nThe pressure there is high.", "classification": "security", "score": 0.97327936418155, "location": "Rafah, southern Gaza Strip", "event_breakdown": "The events in the text are as follows:\n- Palestinian channels report a large movement of displaced persons from the area of ​​the \"Amuaj\" Hall in West Rafah towards the seashore following an unverified report of an Israeli demand to evacuate the area\n- There is high pressure in the area"}, {"id": "ea9b40d6-854a-4401-af54-c974cccdec74", "channel_id": 1560386984, "date": "2024-04-29 13:59", "message": "Hamas Information Bureau:\n\n\"Approximately 10% of the bombs and shells fired by the occupation into the Gaza Strip did not explode, according to UN estimates, which we back up.\nAccording to the estimates, this is 7.5 million tons of bombs out of 75 million tons of bombs that were fired into the Gaza Strip.\nThey pose a great danger to the residents of the Gaza Strip, even if the war ends.\"", "classification": "security", "score": 0.9552587785400188, "location": "Gaza Strip", "event_breakdown": "- Approximately 7.5 million tons of unexploded bombs pose danger in Gaza Strip, according to UN estimates and Hamas Information Bureau"}, {"id": "b0bb5e99-4c38-4b55-b64b-44e544d8f452", "channel_id": 1560386984, "date": "2024-04-29 13:41", "message": "Abdel Latif Al Qanouna, Hamas spokesman:\n\"Without achieving the just demands of our people regarding a permanent ceasefire, the withdrawal of the forces and the return of the displaced, no agreement with the occupation will succeed.\"", "classification": "security", "score": 0.9003667224030794, "location": "Reminder: My knowledge is up to January 2022.\n\nnull", "event_breakdown": "My knowledge cut-off date is January 2022.\n\nHamas is designated as a terrorist organization by multiple countries, including the United States, European Union, Israel, and others."}, {"id": "9b913acc-f48a-43e6-9473-218cdb46146c", "channel_id": 1560386984, "date": "2024-04-29 12:51", "message": "Updated cigarette price list in Gaza:\nSingle cigarette - 45 NIS\nA box of cigarettes (20 cigarettes) - NIS 900\nPacket of cigarettes (10 boxes) - NIS 9,000", "classification": "security", "score": 0.9487145512186439, "location": "Gaza", "event_breakdown": "- Updated cigarette price list in Gaza:\n  - Single cigarette - 45 NIS\n  - A box of cigarettes (20 cigarettes) - NIS 900\n  - Packet of cigarettes (10 boxes) - NIS 9,000"}, {"id": "6f47f2a4-190f-44d8-a36d-5e77f8bd3036", "channel_id": 1560386984, "date": "2024-04-29 11:13", "message": "Egyptian Foreign Minister: Cairo is optimistic about a new Hudna agreement between Hamas and Israel.", "classification": "security", "score": 0.7877756101604338, "location": "Cairo", "event_breakdown": "- Egyptian Foreign Minister expresses optimism about a new Hudna agreement between Hamas and Israel"}, {"id": "b9faa5e6-fee8-4d00-9010-0e2034a19837", "channel_id": 1560386984, "date": "2024-04-29 10:50", "message": "American Secretary of State Blinken, during his visit to Saudi Arabia:\n\nHamas has an extraordinarily generous proposal for a ceasefire, it needs to decide, and decide quickly.\n\nThe US did not receive from Israel a plan for an attack on Rafah that includes the protection of civilians.\n\nThe conflict in Gaza must be ended, the blueprint for the establishment of a Palestinian state and progress towards normalization must be laid.\n\n###\nAll these statements are very disturbing and indicate that the Americans do not understand a thing and a half about the Middle East and conducting negotiations.", "classification": "security", "score": 0.478609025083583, "location": "Rafah", "event_breakdown": "- Hamas offers a ceasefire proposal during Blinken's visit to Saudi Arabia\n- Israel did not provide the US with a plan for an attack on Rafah including civilian protection\n- Blinken emphasizes the need to end the conflict in Gaza and lay out a blueprint for a Palestinian state and normalization progress"}, {"id": "e23ad4e6-a2ec-43a4-924a-4fd287dd5246", "channel_id": 1560386984, "date": "2024-04-29 10:45", "message": "Beirut: Hezbollah militants detained two trucks of the Spanish battalion in UNIFIL while they were passing through the Shahdaa square at the entrance to the Dahiya district, a Hezbollah stronghold in the Lebanese capital.\n\nLebanese army soldiers were sent to rescue the trucks.", "classification": "security", "score": 0.9886881123805346, "location": "Dahiya district, Beirut", "event_breakdown": "- Hezbollah militants detain two trucks of the Spanish battalion in UNIFIL in Beirut\n- Incident takes place at Shahdaa square at the entrance to the Dahiya district\n- Dahiya district is a Hezbollah stronghold in Beirut\n- Lebanese army soldiers are sent to rescue the trucks"}, {"id": "7d8f070f-209e-4283-9d2c-5403d6d4ed8c", "channel_id": 1560386984, "date": "2024-04-29 10:43", "message": "The Palestinian Ministry of Health in Gaza:\n\n34 dead in the Strip in the last day.\nIn the days preceding it, the number of deaths per day was as follows:\n66\n32\n51\n\n34,488 dead and 76,643 wounded in the Gaza Strip since the beginning of the war.", "classification": "security", "score": 0.8428716611514787, "location": "Gaza Strip", "event_breakdown": "- 34 dead in the Gaza Strip in the last day\n- In the days preceding it, the number of deaths per day were:\n   - 66\n   - 32\n   - 51\n- Total of 34,488 dead and 76,643 wounded in the Gaza Strip since the beginning of the war"}, {"id": "ca46ca42-0184-4f21-8c7b-d102c34a89c5", "channel_id": 1560386984, "date": "2024-04-29 09:07", "message": "Lebanon: concern over the strengthening of the \"Al-Jama'a al-Islamiya\" organization, with Iran's support\n\nThe sights that came yesterday from Akkar in northern Lebanon, where a funeral was held for two senior members of the Al-Jama'a al-Islamiyya organization in Lebanon, whom Israel killed in a targeted strike on their vehicle, are causing concern among the circles opposed to the Iranian axis in Lebanon.\n\nThe amount of weapons seen at the funeral arouses criticism and concern that the Sunni organization, which is apparently supported by Iran, is also planning to follow the path of Hezbollah and establish military strongholds in Lebanon, such as Hezbollah's Dahiya district in Beirut.", "classification": "security", "score": 0.9877908941332691, "location": "Akkar, Lebanon", "event_breakdown": "1. Funeral held in Akkar, northern Lebanon for two senior members of the Al-Jama'a al-Islamiyya organization killed in a targeted strike by Israel.\n2. Concern among anti-Iran circles in Lebanon over the strengthening of the Al-Jama'a al-Islamiyya organization with Iranian support.\n3. Criticism and concern raised over the large amount of weapons seen at the funeral, leading to fears that the Sunni organization, backed by Iran, may establish military strongholds in Lebanon similar to Hezbollah's Dahiya district in Beirut."}, {"id": "e9f5472d-a240-42b9-a72e-448616a32140", "channel_id": 1560386984, "date": "2024-04-29 09:04", "message": "The military arm of Hamas in Lebanon accepts responsibility for launching 30 rockets from southern Lebanon towards the headquarters of the 769th Brigade in Camp Gibor, a short while ago.", "classification": "security", "score": 0.9928750408641094, "location": "Camp Gibor", "event_breakdown": "1. The military arm of Hamas in Lebanon launches 30 rockets from southern Lebanon.\n2. The rockets target the headquarters of the 769th Brigade in Camp Gibor."}, {"id": "c68f1d7a-d030-49aa-bb62-fc9ce0e70df4", "channel_id": 1560386984, "date": "2024-04-29 09:03", "message": "The Palestinians report a total of 20 deaths tonight, in attacks on 3 houses in Rafah in the southern Gaza Strip:\n\n1. The house of the Abu Ta family in the A-Salam neighborhood in the southeast of Rafah.\n2. The house of the Khatib family in the Janineh neighborhood in eastern Rafah.\n3. The house of the Khawaja family in the Shaboura neighborhood in the center of Rafah.\n\nIn addition, it was reported that four Palestinians were killed tonight in an attack on the house of the A-Tarturi family in the Harbor neighborhood in the west of Gaza City.", "classification": "security", "score": 0.9892727354111946, "location": "Rafah", "event_breakdown": "- 20 Palestinians reported killed in attacks on 3 houses in Rafah, Gaza Strip (Abu Ta family in A-Salam neighborhood, Khatib family in Janineh neighborhood, Khawaja family in Shaboura neighborhood).\n- 4 Palestinians reported killed in attack on A-Tarturi family house in Harbor neighborhood, Gaza City."}, {"id": "46d6b90c-9a7c-47d3-a9fd-94a70265690e", "channel_id": 1560386984, "date": "2024-04-29 09:01", "message": "Palestinian terrorist Basem Khandakji, who is serving three life sentences in Israel for his involvement in the Carmel market suicide attack in November 2004, in which three Israelis were killed and more than 50 were injured, won the International Prize for Arabic Fiction, funded by the UAE, for his book \"a mask the color of the sky,\" which he wrote in prison.\n\nThe terrorist's brother received the award on his behalf. The host of the ceremony wished that Khandakji's release from the Israeli prison would come soon.", "classification": "security", "score": 0.8078816578138898, "location": "null", "event_breakdown": "1. Palestinian terrorist Basem Khandakji wins the International Prize for Arabic Fiction for his book \"a mask the color of the sky\"\n2. Basem Khandakji's brother receives the award on his behalf\n3. The host of the ceremony expresses hope for Khandakji's release from Israeli prison"}, {"id": "8f55e7b1-895f-4970-be36-b2d6d54e9287", "channel_id": 1560386984, "date": "2024-04-29 08:53", "message": "Senior Hamas official Izzat al-Risheq, earlier this morning:\n\n\"It should be emphasized that Hamas has not published any statement in its name or on its behalf, or on behalf of its sources regarding the Israeli proposal we received from the mediators. We are still studying the proposal.\n\nEverything that the media in Israel publishes on the matter is meant to cause confusion.", "classification": "security", "score": 0.6408431748300185, "location": "null", "event_breakdown": "The events in the text are as follows:\n\n- Senior Hamas official Izzat al-Risheq stated earlier in the morning that Hamas has not published any statement or comment regarding the Israeli proposal received from mediators, emphasizing that Hamas is still studying the proposal.\n- He mentioned that media reports in Israel about the matter are intended to cause confusion."}, {"id": "2cf70ac0-8d73-4d48-9dc8-d4b1cb3f4703", "channel_id": 1560386984, "date": "2024-04-28 18:12", "message": "The military wing of Hamas recently accepted responsibility for firing mortar shells at the Netzarim base in the Gaza Strip.", "classification": "security", "score": 0.9954151926266827, "location": "Netzarim base in the Gaza Strip.", "event_breakdown": "- Hamas military wing fires mortar shells at Netzarim base in Gaza Strip"}, {"id": "bc64ecc4-0b50-4c2a-b552-4808da63f0c9", "channel_id": 1560386984, "date": "2024-04-28 18:12", "message": "Ismail Haniyeh, chairman of the political bureau of Hamas, started \"receiving an audience\" in Istanbul, Turkey.\nAmong the visitors: Jordanian members of parliament and Nelson Mandela's grandson.", "classification": "security", "score": 0.9003730260470113, "location": "Istanbul, Turkey", "event_breakdown": "- Ismail Haniyeh starts \"receiving audience\" in Istanbul, Turkey\n- Visitors include Jordanian members of parliament and Nelson Mandela's grandson"}, {"id": "b047b69f-0098-49d3-aecc-0651988c8010", "channel_id": 1560386984, "date": "2024-04-28 18:12", "message": "And meanwhile in Aqar in northern Lebanon... Al-Jama'a al-Islamiyya supporters are demonstrating what \"real\" shooting in the air is as part of the funeral of the two senior leaders, Masab and Bilal Khalaf, who were killed by the IDF in an attack on their vehicle...\n\nFor Jama'a, anything less than RPG shooting in the air is dishonoring the dead...", "classification": "security", "score": 0.9698828394719469, "location": "null", "event_breakdown": "- Al-Jama'a al-Islamiyya supporters in Aqar, northern Lebanon, demonstrate shooting in the air as part of the funeral for two senior leaders, Masab and Bilal Khalaf, who were killed by the IDF in an attack on their vehicle"}, {"id": "77407d9c-9e4f-4332-b69c-7ca9e946b7cf", "channel_id": 1560386984, "date": "2024-04-28 18:12", "message": "The international organization World Central Kitchen has announced a return to activity in the Gaza Strip for the first time since 7 of its people were killed in an Israeli attack following a mistaken identity about a month ago.\n\n##\nAt the same time, the White House reports that within two to three weeks the floating sea dock in the Gaza Strip will begin operating.", "classification": "security", "score": 0.658052673588795, "location": "Gaza Strip", "event_breakdown": "The events in the text are as follows:\n- World Central Kitchen announces a return to activity in the Gaza Strip for the first time since 7 of its people were killed in an Israeli attack about a month ago\n- The White House reports that within two to three weeks, the floating sea dock in the Gaza Strip will begin operating"}]