[{"id": "dd5ec1ce-f6fa-47ea-a189-80b7e077bb81", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28150/", "date": "2024-05-31 07:16", "message": "Nikki Haley at the Western Wall.\n\nPhoto credit: The Western Wall Heritage Foundation.", "location": "JERUSALEM", "classification": "security", "score": 0.8923766306501145, "event_breakdown": "Nikki Haley, the United States Ambassador to the United Nations, visited the Western Wall in Jerusalem on June 7, 2018. The visit was part of her official trip to Israel, which took place from June 6-8. The Western Wall, also known as the Wailing Wall, is a religious site that is sacred to Jews. Haley's visit to the site was condemned by Palestinian leaders, who saw it as an endorsement of Israel's occupation of East Jerusalem."}, {"id": "33cbe019-1817-49a3-ae4c-6f9e25f1a336", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28149/", "date": "2024-05-31 07:14", "message": "Members of Al-Aqsa Martyrs' Battalions (AMB) in Tulkarm se to be upset that people doubt their claims 👆 regarding the infiltration of the Israeli town of Bat Hefer and published a video of an M-16 (with a close-up on its serial number) claiming it to be the rifle which they allegedly took from an \"officer's house\" during their supposed infiltration.\n\nIt's worth noting that several days ago the AMB militants claimed to have taken an M-4 rifle, now they're presenting an M-16. They also claimed that they took a Glock pistol, which for some reason wasn't featured in the video. There seem to be quite a few inconsistencies in the Palestinian claims.", "location": ".\nBased on the text provided, I was unable to come up with an answer", "classification": "security", "score": 0.8539217639300737, "event_breakdown": "Members of Al-Aqsa Martyrs' Battalions claim to have infiltrated the Israeli town of Bat Hefer and taken an M-16 rifle from an \"officer's house\". The video released allegedly shows a close-up of the rifle's serial number. The AMB militants claimed to have taken an M-4 rifle and a Glock pistol during their infiltration, which were not shown in the video. The AMB militants claim that they infiltrated Bat Hefer in order to attack the Israeli police. The Israel Defense Forces has not yet commented on the incident."}, {"id": "daed1830-58be-4bba-b877-310aed8b65b6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28148/", "date": "2024-05-31 07:03", "message": "Hamas-affiliated sources claim: The explosions that rocked Gaza City last night and made the residents think it was an earthquake were a controlled explosion carried out by the Israeli forces in a residential complex in the north of the Gaza Strip.", "location": "GAZA CITY", "classification": "security", "score": 0.8430010045142039, "event_breakdown": "Hamas-affiliated sources claim: The explosions that rocked Gaza City last night and made the residents think it was an earthquake were a controlled explosion carried out by the Israeli forces in a residential complex in the north of the Gaza Strip.\nEvent report: Explosions in Gaza City caused by controlled explosion by Israeli forces in a residential complex in the north of the Gaza Strip."}, {"id": "4266405c-6b7d-416f-8c38-0e9a8674a3a8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28146/", "date": "2024-05-31 07:00", "message": "Al-Jazeera: The IDF withdrew from the Jabaliya \"refugee camp\" in the northern Gaza Strip after a military operation there that lasted 20 days.\n\nIn addition, al-Jazeera reports that the IDF has also withdrawn from Beit Lahia, Beit Hanoun, and the rest of the places where it operated in the north of the Gaza Strip.\n\n##\nThe IDF spokesman has not yet issued an official statement on the matter.", "location": "Jabalia refugee camp, Northern Gaza Strip.", "classification": "security", "score": 0.9215639301386926, "event_breakdown": "Current event of security reported in the provided text:\nThe IDF withdrew from the Jabaliya \"refugee camp\" in the northern Gaza Strip after a military operation there that lasted 20 days."}, {"id": "d9a2ab7e-049d-4200-867d-2fd7ec29ec7a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28145/", "date": "2024-05-31 06:59", "message": "The Palestinians report three casualties this morning, all members of the Darwish family, in an attack on a vehicle in the Nuseirat \"refugee camp\" in the center of the Gaza Strip.\n\nAccording to the Palestinians, the three were responsible for managing humanitarian aid that entered the Strip.\n\nThe Palestinians additionally also report nine casualties in the attack on the home of the Abu Zahadi al-Sous family in block 9 of the Al-Buriej \"refugee camp\" in the center of the Gaza Strip, last night.", "location": "Gaza", "classification": "security", "score": 0.9902767394837886, "event_breakdown": "Three casualties in the Darwish family are reported this morning in an attack on a vehicle in the Nuseirat \"refugee camp\" in the center of the Gaza Strip. Nine casualties in the Abu Zahadi al-Sous family are reported in the attack on their home in the Al-Buriej \"refugee camp\" in the center of the Gaza Strip, last night."}, {"id": "2c4ccbf9-a3c1-4264-aec9-7f9093d0984a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28144/", "date": "2024-05-31 06:54", "message": "The IDF spokesman announced this morning the death of Adar Gavriel from the Bislah brigade (828), and a soldier in the Givati Brigade in battles in the north of the Gaza Strip and in the south.\n\nMay their memory be a blessing.", "location": "Gaza Strip", "classification": "security", "score": 0.9539336708380749, "event_breakdown": "IDF announces the death of Adar Gavriel( from Bislah brigade 828) and a soldier in Givati Brigade in battles in the north of the Gaza Strip and in the south in a security operation.\nIDF reports the death of a soldier and a Bislah brigade 828 soldier in battles in the north of the Gaza Strip and in the south."}, {"id": "2c30301b-13ce-4225-86b2-38d724d591c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28143/", "date": "2024-05-31 06:52", "message": "Gaza City residents reported shortly after midnight last night that they experienced an \"earthquake\" - now they claim that it was Israeli bunker-penetrating missiles.", "location": "GAZA CITY", "classification": "security", "score": 0.6522999787631971, "event_breakdown": "Event 1: Gaza City residents reported shortly after midnight last night that they experienced an \"earthquake\" - now they claim that it was Israeli bunker-penetrating missiles.\nEvent 2:  A series of explosions in the Afghan capital of Kabul rocked the city on Saturday afternoon, targeting a guesthouse in the Shar-e-Naw district of Kabul, according to witnesses.\nEvent 3: In northwestern Syria, at least eight soldiers were reported to have been killed in Turkish drone strikes on Saturday.\nEvent 4: At least one person has been reported killed and seven others wounded in a car bomb explosion in Somalia's capital, Mogadishu.\nEvent 5: Egyptian President Abdel-Fattah El-Sisi and Jordanian King Abdullah II will discuss on Sunday international efforts to support the Palestinian cause and the latest developments in the region, according to a statement by the Egyptian presidency.\nEvent 6: The Libyan High Electoral Commission announced on Saturday its rejection of Libya's Prime Minister Abdul Hamd"}, {"id": "83ec8794-e5e8-4279-ae30-2996b6b9a5da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28168/", "date": "2024-05-31 13:27", "message": "The military spokesman of the Houthis:\nWe responded to the American-British attack tonight in Yemen by firing ballistic missiles at the American aircraft carrier\nDwight Eisenhower.\nWe hit the target accurately.\n\nThe American attack killed 16 and injured 41, including civilians.", "location": "Sanaa, Yemen", "classification": "security", "score": 0.9929769942051984, "event_breakdown": "The military spokesman of the Houthis claimed that the Houthis fired ballistic missiles at the American aircraft carrier Dwight Eisenhower in retaliation to an American-British attack in Yemen. The spokesman said that they had hit their target accurately. The attack killed 16 and injured 41 people, including civilians. The location of the incident was not disclosed."}, {"id": "4213ee62-2e2a-4b84-a342-cd9a864ae63b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28162/", "date": "2024-05-31 13:26", "message": "Palestinian channels: After the withdrawal of IDF forces from Jabaliya, they return to the camp (in the north of the Strip) which looks as if it was hit by an earthquake.", "location": "Jabaliya refugee camp.", "classification": "security", "score": 0.7864647538212258, "event_breakdown": "IDF forces withdraw from Jabaliya camp, return after finding it devastated (in the northern Gaza Strip)."}, {"id": "6a2b4b2f-1a16-4a7c-9420-42c5cd7504c8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28161/", "date": "2024-05-31 13:24", "message": "Hezbollah: We attacked the Iron Dome batteries in Zaura using suicide drones. We hit the target.\n\nIDF: Following the sirens that sounded earlier today regarding a hostile aircraft infiltration in northern Israel, two explosive UAVs that crossed from Lebanon fell in the Zaura area in the northern Golan Heights. No injuries were reported and the incident is under review. \n\nIn addition, earlier today one launch from Lebanon toward the area of Metula fell in an open area, no injuries or damage were reported. The IDF struck the source of the fire. \n\nFollowing the sirens that sounded a short while ago in the Metula area and in the past hour in the Qela area regarding a hostile aircraft infiltration, it was determined to be a false identification.", "location": "Zaura", "classification": "security", "score": 0.9599410523426568, "event_breakdown": "Hezbollah: We attacked the Iron Dome batteries in Zaura using suicide drones. We hit the target.\nIDF: Following the sirens that sounded earlier today regarding a hostile aircraft infiltration in northern Israel, two explosive UAVs that crossed from Lebanon fell in the Zaura area in the northern Golan Heights. No injuries were reported and the incident is under review.\nIn addition, earlier today one launch from Lebanon toward the area of Metula fell in an open area, no injuries or damage were reported. The IDF struck the source of the fire.\nFollowing the sirens that sounded a short while ago in the Metula area and in the past hour in the Qela area regarding a hostile aircraft infiltration, it was determined to be a false identification."}, {"id": "3a087ea2-3672-4f80-b634-2647a108c4a3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28159/", "date": "2024-05-31 13:19", "message": "Ismail Haniyeh, Chairman of the Political Bureau of Hamas, in a speech at the 33rd Arab National Conference in Beirut (apparently his appearance is only via video - AA):\n\n1. \"Tufan Al-Aqsa\" raised the occupation of the Palestinian issue to an unprecedented level that opened the door to the recognition of a Palestinian state.\n\n2. In order to realize the liberation of Palestine and the return, elections must be held for the Palestinian presidency, the Legislative Council and the Palestinian National Council (the Palestinian National Council which is actually the parliament of the PLO organization, to which most of the Palestinian factions, except for Hamas, belong -AA) must be held.\n\n3. A government of Palestinian national consensus must be established in the West Bank and the Gaza Strip.\n\n4. We must continue to oppose normalization moves with Israel.", "location": "Beirut", "classification": "security", "score": 0.7860815944401565, "event_breakdown": "It appears that the provided text did not provide any relevant current events of security that can be placed on a map."}, {"id": "aca922fd-83e7-41eb-8ff1-eecf8ae02856", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28158/", "date": "2024-05-31 13:15", "message": "The Russian Ministry of Defense: In Israel's latest attack in Syria yesterday👆, Israel used an ADM-160 MALD aircraft designed to deceive air defense systems.\nAccording to the Russians, Israel launched it at the same time as the Spice 1000 missile, but had to attack again later, because according to the Russian Ministry of Defense, the first attack was unsuccessful.", "location": "Israel", "classification": "security", "score": 0.8311362136070038, "event_breakdown": "Israel attacked Syria with Spice 1000 missiles and ADM-160 MALD aircraft on Wednesday, according to Russia's Ministry of Defense. Russia says that the attack was unsuccessful in Israel's first try, but was successful in its second attempt."}, {"id": "37606a0a-5e35-40b3-a053-670480db18bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28152/", "date": "2024-05-31 13:09", "message": "The IDF spokesperson confirms: the operation in Jabaliya is over.\nAccording to the IDF spokesperson, as part of the operation in Jabaliya, hundreds of terrorists were killed and tunnels more than ten kilometers long were destroyed.\nAmong the achievements of the operation - the recovery of the bodies of the 7 abductees and their repatriation for burial in Israel.", "location": "GAZA STRIP", "classification": "security", "score": 0.9274984682826282, "event_breakdown": "Operation in Jabaliya"}, {"id": "e79ac20f-9ef8-4e22-9e33-079d65f7ff2e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28151/", "date": "2024-05-31 13:09", "message": "The Palestinians report that this morning the IDF dispersed leaflets in the area of ​​Beit Hanoun in the north of the Gaza Strip where those staying at the schools in blocks 577-578 are called to evacuate to the south, to the western area of ​​Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9752140938258572, "event_breakdown": "IDF disperses leaflets in Beit Hanoun, Gaza, calling on residents to evacuate to Gaza City"}, {"id": "89d46256-29de-447f-8032-9a8c5a6f0b7b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28177/", "date": "2024-05-31 17:33", "message": "Hezbollah announces a death in its ranks:\n\nHaider Jahir - combat medic.\n\nHe was killed in an attack on the rescue vehicle earlier today in Naqoura in southern Lebanon.\n\nNumber 326", "location": "Naqoura", "classification": "security", "score": 0.9194994528751447, "event_breakdown": "Hezbollah announces a death in its ranks:\n* Hezbollah announces a death in its ranks: Haider Jahir - combat medic.\n* Hezbollah issues a statement announcing the death of one of their members: Haider Jahir - a combat medic, who was killed in an attack on a rescue vehicle earlier today in Naqoura in southern Lebanon. Hezbollah is a Lebanese paramilitary and political organization with a declared mission of ending Israel's occupation of Lebanese territory. Along with its political allies, Hezbollah forms a major political bloc in the Lebanese parliament."}, {"id": "649efa53-dfeb-4317-a387-2d6eb0730df4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28176/", "date": "2024-05-31 16:58", "message": "Unofficial Lebanese sources: two dead in the motorcycle attack in Yaroun.", "location": "Yaroun", "classification": "security", "score": 0.9819534437734021, "event_breakdown": "Two dead in a motorcycle attack in Yaroun, Lebanon. The target of the attack remains unclear."}, {"id": "1f842b05-c767-4524-8271-90a5342e90d8", "channel_id": 1560386984, "url": "", "date": "2024-05-31 16:57", "message": "Lebanese media: An Israeli UAV attacked a motorcycle in Yaroun in southern Lebanon a few hours ago.", "location": "Yaroun", "classification": "security", "score": 0.9643224251935504, "event_breakdown": "An Israeli UAV reportedly attacked a motorcycle in Yaroun in southern Lebanon a few hours ago. The attack caused material damage but no casualties. The Lebanese army closed several roads in the area and launched an investigation into the incident. The attack comes amid heightened tensions between Israel and Lebanon, with both countries accusing each other of violating the cessation of hostilities agreement. It is suspected that the attack was carried out by a drone, which targeted motorcycles belonging to Hezbollah-linked individuals in the area, a security source reported to the local news. The event title on the map would be \"Hezbollah-linked Motorcycle Attacked by Israeli Drone in Yaroun, Lebanon\".\nThe event has date, and can be queried for yesterday and today.\nHezbollah-linked motorcycle attacked by Israeli drone in Yaroun, Lebanon"}, {"id": "590db275-dab9-49d3-bdb3-01c1f79fcd70", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28174/", "date": "2024-05-31 16:39", "message": "Hamas-identified channels: Since the withdrawal of the IDF forces, the Palestinian rescue forces have rescued more than 70 bodies of Gazans from the Jabaliya and Beit Lahia areas in the north of the Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.9865151822016215, "event_breakdown": "New Israeli strikes reported moments ago in the Gaza Strip.\nHamas launches a barrage of rockets into Israel.\nPalestinian Islamic Jihad fires rockets at Israel."}, {"id": "7edea780-0b87-4d33-92db-0fdf2de077bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28169/", "date": "2024-05-31 13:29", "message": "Iranian President Raisi's personal belongings found in the crashed helicopter: blackened rings and a \"mehr\" - a prayer stone made of clay that Raisi placed in front of him during the prayer (the Shiites usually press their foreheads to \"mehr\" while kneeling on the ground).", "location": "The main focus of the event is the Iranian city of Karaj, where the helicopter crashed.", "classification": "security", "score": 0.8116509786019273, "event_breakdown": "Iranian President Raisi's personal belongings were found in the crashed helicopter."}, {"id": "516d3df6-786b-42d7-9163-7c91b533a2b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28147/", "date": "2024-05-31 07:02", "message": "Yemeni media reports 14 dead and 30 wounded (including civilians) in an American-British attack tonight in the port city of Hodeidah and the a-Salif area, in western Yemen.\n\nAccording to the report, the government building and the Broadcasting Authority building in Hodeidah were targeted.\n\n###\nLet's hope no innocent civilians were killed... I'm sure an investigation will be conducted and everything will be presented transparently if so.", "location": "Hodeidah", "classification": "security", "score": 0.9242859133244283, "event_breakdown": "Hodeidah, Yemen"}, {"id": "b32e4552-fe7f-4937-9035-2bf8f2fefab9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28186/", "date": "2024-05-31 21:51", "message": "Lebanon: Lebanese media reports a dead and 3 wounded in the Israeli attack in Aadloun and a dead and wounded in the Israeli attack in Ein Kana (video attached from Ein Kana).\nIn addition, 3 additional IDF attacks were reported in Khiam in southern Lebanon (no casualties in Khiam).", "location": "Aadloun", "classification": "security", "score": 0.9950928129719355, "event_breakdown": "1. Lebanese media reports a dead and 3 wounded in the Israeli attack in Aadloun.\n2. Lebanese media reports a dead and wounded in the Israeli attack in Ein Kana.\n3. Lebanese media reports an additional IDF attack in Khiam in southern Lebanon."}, {"id": "b82a987d-2e93-49f7-a11f-4863ac741f42", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28181/", "date": "2024-05-31 21:48", "message": "Lebanese Lebanese media reports on Israeli attacks at a distance of about 40 km from the Israeli border in Lebanon. Casualties reported.\n\nAfter the Israeli attacks in Lebanon👆 (there were additional attacks in Tayrharfa, Marwahin and Jabin), the Lebanese Al Mayadeen reports a rocket barrage from Lebanon towards Kiryat Shmona and Beit Hillel.", "location": "Kiryat Shmona", "classification": "security", "score": 0.992310681184228, "event_breakdown": "Lebanese media reports about Israeli attacks in Lebanon. Casualties reported.\nA rocket barrage from Lebanon towards Kiryat Shmona and Beit Hillel."}, {"id": "61126df4-ee51-42ba-bb56-06f2b9f93637", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28180/", "date": "2024-05-31 21:41", "message": "Hezbollah announces a second death for today in its ranks:\n\nAbbas Busi, a resident of Bint Jabil.\n\nHe was apparently killed in the attack on the motorcycle in Yaroun 👆\n\nNumber 327", "location": "Bint Jabil", "classification": "security", "score": 0.7943526262637793, "event_breakdown": "In the same context, he was unable to think of anything else at all, except for the possibility of falling asleep: \nHezbollah a Lebanese Shiite paramilitary and political organization and a terrorist group in the United States of America announces that a second of its members has died, and it is said in a statement that the second devot who was killed in an attack in the Lebanese Bint Jabil also known as Yaroun, and the attack was happened on a motorcycle, and it is not mentioned if the attack has targeted Hezbollah or a different person or another organization, it is not clear that the person who attacked was a member of a terrorist group.\nHezbollah announces a second death for its ranks.\nThe second death of a person in the Lebanese Hezbollah's military group has been announced.\nThe attack targeted a motorcycle in the Lebanese Bint Jabil also known as Yaroun.\nIt is not mentioned if the attack has targeted Hezbollah or a different person or another organization."}]