[{"id": "a10c2a71-4954-4140-9722-03b9ef202887", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26559/", "date": "2024-05-01 14:03", "message": "California, UCLA:\n\nLos Angeles police officers arrive at the university grounds and are greeted with sympathetic chants from the pro-Israel students:\n\nUSA, USA, USA !", "location": "UCLA", "classification": "security", "score": 0.7240329419690582, "event_breakdown": "- Los Angeles police officers arrive at UCLA\n- Pro-Israel students chant \"USA, USA, USA!\""}, {"id": "d855ef83-a56b-4394-b4ac-113da8e1e310", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26558/", "date": "2024-05-01 13:45", "message": "An important statement yesterday by the spokesperson of the American State Department, regarding the lawsuits against Israel for the war in Gaza:\n\nWe believe that the International Criminal Court in The Hague has no jurisdiction in this matter.", "location": "The Hague", "classification": "security", "score": 0.6211716807888927, "event_breakdown": "- Statement by the spokesperson of the American State Department regarding lawsuits against Israel for the war in Gaza: Asserts that the International Criminal Court in The Hague lacks jurisdiction in the matter."}, {"id": "7938b667-2d2f-4041-9582-d971e59a1732", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26557/", "date": "2024-05-01 13:44", "message": "Hezbollah announces a death in its ranks:\n\nVahid Tefili, born in 2000 from the village of Deir al-Zahrani in southern Lebanon.\n\nVahid was seriously injured more than four days ago and died tonight from his wounds. The circumstances of his death are not specified.\nIn addition to being a Hezbollah military operative, he was a \"commander\" in the local Hezbollah scout tribe.\n\nNumber 291", "location": "Deir al-Zahrani, Lebanon", "classification": "security", "score": 0.9744458110938735, "event_breakdown": "- Vahid Tefili, a Hezbollah military operative and \"commander\" in the local Hezbollah scout tribe, announced dead in Deir al-Zahrani, southern Lebanon"}, {"id": "e7fd5f0c-f442-4011-9c3b-b252c6cbb180", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26556/", "date": "2024-05-01 13:42", "message": "It is important to emphasize: as written in the title above 👆, this is the proposal that Israel allegedly forwarded to Hamas. That is, if the report is true, then Israel has agreed to these terms and Hamas has not yet...", "location": "I am sorry, but as an AI text-based model, I do not have access to external sources or the ability to browse the internet to locate specific information outside of the text you provide me. Therefore, I am unable to identify the main location where the main event takes place based on the information in the text.", "classification": "security", "score": 0.6078237228963291, "event_breakdown": "- Ceasefire in the Gaza Strip\n- Opening of the Kerem Shalom border crossing\n- Expansion of the fishing zone off the coast of Gaza\n- Transfer of Qatari aid to Gaza\n- Release of Palestinian prisoners\n- Reconstruction of Gaza"}, {"id": "153a9559-c5b9-4e87-bc9b-11472f19ca41", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26555/", "date": "2024-05-01 13:42", "message": "The Lebanese Al-Akhbar newspaper (affiliated with Hezbollah) publishes the details of the Israeli proposal that it claims was submitted to Hamas through Egypt on April 26:\n\nFirst stage (40 days - subject to extension)\n\nThe Israeli forces will withdraw from the densely populated areas (not from Netzarim Corridor).\nAircraft traffic in the Gaza Strip will be suspended for 8-10 hours every day.\nThe displaced citizens will be able to return to their homes.\nOn the seventh day after the release of the women among the abductees, IDF forces will clear the coastal axis to allow the movement of humanitarian aid.\nOn the 22nd, after the release of two-thirds of the agreed upon hostages, the IDF forces will withdraw from Netzarim Corridor. At this stage, it will be possible to bring in 500 aid trucks a day, 50 of which will be diesel for the operation of the power plant in Gaza. Heavy equipment will also be brought into the Gaza Strip to clear the rubble and the hospitals, clinics will be retrained and the bakeries all over the strip.\n\nDuring this period, Hamas will release at least 33 abductees under the category: women, children up to the age of 19, adults over the age of 50, sick and wounded.\nIsrael will release 20 Palestinian prisoners for each abductee, in a matching category: women and children for women and children. Adults against adults, when the proportion of 20 prisoners is kept for each abductee.\nIn this category, Palestinian prisoners whose remaining sentence exceeds 10 years will not be released.\n\nSoldiers category:\nFor each kidnapped female soldier, 20 prisoners sentenced to life imprisonment and another 20 prisoners with up to 10 years remaining in prison will be released. Israel has the right to veto the names of the prisoners up to 200 names cumulatively.\nThe prisoners will be released to the Gaza Strip or abroad.\n\nRate of release: Hamas will release 3 Israeli hostages every 3 days.\nThe Palestinian prisoners who will be released will not be able to be re-arrested for the crimes they committed before their prison term (ie they will receive amnesty).\n\nStarting on the 14th, there was an agreement for more wounded military operatives, according to an agreed list, to go through the Rafah crossing for medical treatment abroad.\n\nSecond stage of the agreement (42 days)\n\nThe completion of the agreement for a comprehensive calm (ceasefire) and its announcement before the release of surviving abductees (men and soldiers) in exchange for the release of additional Palestinian prisoners.\nThe beginning of the necessary arrangements for the total rehabilitation of the strip.\n\nStep 3 of the agreement (42 days)\nKidnapped-prisoner body swap.\nBeginning of the implementation of a 5-year rehabilitation plan for the Strip.", "location": "Null", "classification": "security", "score": 0.9000418392132419, "event_breakdown": "- Lebanese Al-Akhbar newspaper publishes Israeli proposal details claimed to be submitted to Hamas through Egypt on April 26\n- First stage of the proposal:\n   - Israeli forces will withdraw from densely populated areas except Netzarim Corridor\n   - Aircraft traffic in Gaza Strip suspended for 8-10 hours daily\n   - Displaced citizens allowed to return home\n   - IDF to clear coastal axis after release of women abductees\n   - IDF to withdraw from Netzarim Corridor after releasing two-thirds of hostages\n   - Aid trucks to enter Gaza, including diesel for power plant and heavy equipment for reconstruction\n   - Hamas to release specific categories of abductees\n   - Israel to release Palestinian prisoners in exchange based on matching categories\n- Agreement for wounded military operatives to go abroad for medical treatment\n- Second stage of the agreement:\n   - Comprehensive calm (ceasefire) announcement before the release of remaining abductees\n   - Start of arrangements for total rehabilitation of the strip\n- Step 3 of the agreement:\n   - Kidnapped-prisoner body swap\n   - Implementation of a 5-year rehabilitation plan for the Strip"}, {"id": "a34d373d-a668-49d5-aaaf-c1b296063374", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26554/", "date": "2024-05-01 13:36", "message": "The operation in Rafah - the Lebanese Al-Akhbar newspaper (Hezbollah-affiliated) from its sources:\n\nThe US demands that Israel evacuate at least 800,000 displaced people from Rafah before the attack in the area. 40,000 tents arrived in Israel from China, paid for by the United Arab Emirates. Each tent can accommodate 20 people (a total of 800,000 people).\n\nThere is a concentration of about a thousand IDF vehicles, including tanks and APCs in the southern area of ​​the Gaza Strip (on the Israeli side).\nIsrael is planning to break into Rafah from the area of ​​the Sofa crossing and the Kerem Shalom crossing.\n\nThe Egyptians asked to check with the leadership of Hamas, whether its military arm is planning to blow up the fences in the border area with Egypt in order to cause crowds to flee to Egyptian territory.", "location": "Rafah", "classification": "security", "score": 0.9569005729564938, "event_breakdown": "- US demands Israel to evacuate 800,000 displaced people from Rafah before an attack\n- 40,000 tents arrive in Israel from China, paid for by the United Arab Emirates\n- Concentration of about a thousand IDF vehicles, including tanks and APCs in the southern area of the Gaza Strip\n- Israel plans to break into Rafah from the area of the Sofa crossing and the Kerem Shalom crossing\n- Egyptians ask to check with the leadership of Hamas about potential plans to blow up the fences in the border area with Egypt"}, {"id": "a3350193-c8ef-458d-bf1c-8e97646f6376", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26552/", "date": "2024-05-01 06:52", "message": "Florida: Security forces dispersed a demonstration on the campus of the University of South Florida by firing tear gas.\n\nPro-Palestinian rioters were also arrested there.", "location": "University of South Florida", "classification": "security", "score": 0.8859654747405098, "event_breakdown": "- Security forces dispersed a demonstration on the campus of the University of South Florida by firing tear gas and arrested pro-Palestinian rioters."}, {"id": "cb252068-b060-44a9-bd9a-0caa00b87ce2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26547/", "date": "2024-05-01 06:50", "message": "Outside Columbia University: \"NYPD, KKK, IDF they're all the same\" \n\nArrests were made there as well.", "location": "Columbia University", "classification": "security", "score": 0.8221939130531482, "event_breakdown": "- Arrests at Columbia University"}, {"id": "5ed705e5-3720-4074-ba88-c7c257017321", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26544/", "date": "2024-05-01 06:48", "message": "NYPD buses with the detainees from tonight leave the grounds of Columbia University.", "location": "New York City", "classification": "security", "score": 0.5229719379429217, "event_breakdown": "- NYPD buses with detainees leave Columbia University"}, {"id": "5a3ebd62-b3fe-4b42-a1b1-5bca69b5caf6", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65853/", "date": "2024-05-01 06:46", "message": "US media channels reports that the NYPD arrested about a hundred people on Columbia University's campus.\n\nIn a statement, Columbia University claimed that the leaders of the protest on campus are not even students of the university, but rather external parties.\n\nThe president of the university asked the police forces to remain on the university campus until May 17th to maintain order and make sure that no tent camps are set up on campus.", "location": "Columbia University", "classification": "antisemitism", "score": 0.5850521548096034, "event_breakdown": "- NYPD arrests about a hundred people on Columbia University's campus.\n- Columbia University states that protest leaders are not students of the university.\n- Columbia University president requests police to stay on campus until May 17th to prevent disorder and tent camps."}, {"id": "00ae521a-4a6d-4300-bd6e-374f48af31e5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26538/", "date": "2024-05-01 06:44", "message": "At the center of it all - the removal of the Palestinian rioters occupying Hamilton Hall, which they had vandalized while taking over the building and barricading themselves inside.", "location": "Hamilton Hall", "classification": "security", "score": 0.942578494351582, "event_breakdown": "- Removal of Palestinian rioters occupying Hamilton Hall"}, {"id": "42e8d7a0-e29c-427e-8eee-402c35a8656d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26537/", "date": "2024-05-01 06:40", "message": "New York: In the last few hours, the signal was finally given and the New York police entered Columbia University in large forces to disperse the hate demonstration against Israel.", "location": "Columbia University", "classification": "antisemitism", "score": 0.3014433288682847, "event_breakdown": "- New York police entered Columbia University to disperse hate demonstration against Israel"}, {"id": "5866e142-3cc0-463a-8cf4-0bca68720051", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26536/", "date": "2024-04-30 21:25", "message": "University of Ottawa in Canada - chants in Arabic:\nFree Free Palestine\nOut out with Israel", "location": "University of Ottawa in Canada", "classification": "security", "score": 0.48927072203212124, "event_breakdown": "- University of Ottawa in Canada - Chants in Arabic: \"Free Free Palestine\", \"Out out with Israel\""}, {"id": "3aaf4526-3aae-40c0-a967-307659a6dfd8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26535/", "date": "2024-04-30 20:55", "message": "Tomorrow will be a month since the last attack attributed to Israel in Damascus, the capital of Syria - the attack in which Muhammad Reza Zahedi, the commander of the Quds Force in the Iranian Revolutionary Guards in the Syrian and Lebanese sector, was killed.\n\nAccording to Syrian sources, this is the longest quiet period in the skies of Damascus in recent years.\n\nIs the Iranian deterrence working?", "location": "Damascus", "classification": "security", "score": 0.8725166052039606, "event_breakdown": "- Last attack attributed to Israel in Damascus, the capital of Syria\n- Killing of Muhammad Reza Zahedi, commander of the Quds Force in the Syrian and Lebanese sector"}, {"id": "156765a4-f7a9-4386-9f39-570c5a2068ee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26534/", "date": "2024-04-30 20:50", "message": "The Houthis, Iran's loyalists in Yemen, publish documentation of a UAV they launched yesterday at the Greek ship CYCLADES, according to the US Central Command, there were no casualties as a result and the ship continued on its way. Damage was not denied.", "location": "CYCLADES", "classification": "security", "score": 0.891526682381482, "event_breakdown": "- The Houthis in Yemen launch a UAV targeting the Greek ship CYCLADES\n- The US Central Command confirms the incident with no casualties reported\n- The ship CYCLADES continues on its way after the attack"}, {"id": "f1d7bffc-6d63-4ebc-b1d3-794ced398026", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26532/", "date": "2024-04-30 19:10", "message": "The American Washington Post:\n1200 students have been arrested so far as part of protests at universities across the US.", "location": "universities across the US", "classification": "security", "score": 0.4446909162405631, "event_breakdown": "- Arrest of 1200 students across universities in the US as part of protests"}, {"id": "1012113f-528f-4993-bf05-877a8932a7e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26531/", "date": "2024-04-30 17:14", "message": "About Al Jazeera:\nThe Qatari network will soon broadcast a special program in which it will glorify and praise Yahya Sinwar, the leader of Hamas in the Gaza Strip - \"the man who managed to put the whole world on one foot\".", "location": "Gaza Strip", "classification": "security", "score": 0.8212158042349625, "event_breakdown": "- Al Jazeera plans to broadcast a special program praising Yahya Sinwar, the leader of Hamas in the Gaza Strip"}, {"id": "7290b39d-fe61-4225-8389-657d073ac439", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26530/", "date": "2024-04-30 16:32", "message": "A young Jewish man does not allow Al Jazeera's reporter, Najwan Simri, to broadcast a report (which is not sympathetic to Israel, to put it mildly) regarding the stabbing attack by the Turkish citizen today in the Old City of Jerusalem.\nHe repeats to the camera: don't listen to their nonsense.\nShe later turns to the Israeli police stationed in the area, complaining about the young man and falsely claiming he is touching her.\nIt is worth noting they are members of the same force (Israeli Border Police) that was attacked.", "location": "Old City of Jerusalem", "classification": "security", "score": 0.9339038273219109, "event_breakdown": "- Altercation between a young Jewish man and Al Jazeera reporter Najwan Simri in the Old City of Jerusalem: The man prevents Simri from broadcasting a report on a stabbing attack by a Turkish citizen, discourages viewers from listening to her, and is later accused by Simri of physical contact.\n- False claim made by Najwan Simri to Israeli police regarding physical contact by the young Jewish man: Simri complains to Israeli police stationed in the area about the man, alleging physical contact, despite both being members of the same force (Israeli Border Police) targeted in the attack."}, {"id": "b0ab3dac-9ed3-473c-8cf4-bee749004eb5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26529/", "date": "2024-04-30 16:00", "message": "Members of the Palestinian Authority's security forces confront Palestinian protesters near the Canadian Embassy in Ramallah. The protesters are protesting Canada's support for Israel regarding the fighting in Gaza.", "location": "Ramallah", "classification": "security", "score": 0.9876206410667714, "event_breakdown": "1. Members of the Palestinian Authority's security forces confront Palestinian protesters near the Canadian Embassy in Ramallah.\n2. The protesters are protesting Canada's support for Israel regarding the fighting in Gaza."}, {"id": "854000e6-38d8-497f-9ef0-26e6c1092447", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26527/", "date": "2024-04-30 15:38", "message": "The military arm of the Islamic Jihad in Jenin is trying to thwart the entry of the undercover forces into the refugee camp and placed signs with instructions for the driving public:\n\n1. The car windows must be opened.\n2. At night, the interior light in the car must be turned on.\n3. Owners of commercial vehicles - your vehicle will be checked before entering the area.", "location": "Jenin", "classification": "security", "score": 0.9594313959113322, "event_breakdown": "- The military arm of the Islamic Jihad in Jenin placing signs with driving instructions for the public in an attempt to thwart undercover forces from entering the refugee camp, including requirements to open car windows and have interior lights on at night.\n- Commercial vehicle owners being informed that their vehicles will be checked before entering the area."}, {"id": "0034602c-f4a2-45fb-bed2-4e8222fbe24d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26526/", "date": "2024-04-30 14:58", "message": "A clear majority of Israelis and Americans support an operation in Rafah. The keys to this move lie in the hands of Netanyahu and Biden.\n\n##\nThe attached photo from the 1930s shows the train station in Rafah.\n\nNext stop: Rafah?", "location": "Rafah", "classification": "world", "score": 0.37831268763995485, "event_breakdown": "1. A clear majority of Israelis and Americans support an operation in Rafah.\n2. The keys to this move lie in the hands of Netanyahu and Biden.\n3. An attached photo from the 1930s shows the train station in Rafah."}, {"id": "840a2c59-63dd-42fc-9aee-e5695f32adcf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26524/", "date": "2024-04-30 14:52", "message": "Two public promises today made by the Prime Minister and Minister Ben Gvir regarding entry to Rafah.\nArab and Palestinian media quote them extensively.", "location": "Rafah", "classification": "security", "score": 0.4280292525387717, "event_breakdown": "1. Prime Minister and Minister Ben Gvir make two public promises regarding entry to Rafah.\n2. Arab and Palestinian media extensively quote the promises."}, {"id": "410bdf96-71a7-4f87-bf50-d637100d74f9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26523/", "date": "2024-04-30 14:51", "message": "The White House: Soon, trucks with flour will enter Gaza through a new crossing.", "location": "Gaza.", "classification": "security", "score": 0.43932515330510435, "event_breakdown": "- Trucks with flour entering Gaza through a new crossing at The White House"}, {"id": "b196d93f-c604-40d1-9324-f39a8573fc71", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26522/", "date": "2024-04-30 14:50", "message": "Esra Erdoğan, the daughter of the President of Turkey, praises and praises in Arabic the Turkish terrorist who carried out the stabbing attack today in East Jerusalem.\nShe calls him by the nickname \"Lion of Lions of Turkey\" and calls to pray for the sake of the \"heroic martyr\".\n\nAfter the terrorist's name was revealed, she tweeted another tweet in his honor.", "location": "East Jerusalem", "classification": "security", "score": 0.5620430139992374, "event_breakdown": "- Esra Erdoğan praises Turkish terrorist in Arabic in East Jerusalem\n- Esra Erdoğan calls the terrorist by the nickname \"Lion of Lions of Turkey\" and calls for prayers for the \"heroic martyr\"\n- Esra Erdoğan tweets in honor of the terrorist after his name is revealed"}, {"id": "b30862b4-3376-460e-9fee-fcc5f993bbe8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26521/", "date": "2024-04-30 13:25", "message": "The military wing of the Islamic Jihad: We fired rockets at the Israeli command and control centers in the Netzarim area.", "location": "Netzarim", "classification": "security", "score": 0.9949691837335627, "event_breakdown": "- Rocket attack by the military wing of the Islamic Jihad targeting Israeli command and control centers in the Netzarim area."}, {"id": "26e83040-9087-4816-9d65-1fb3c7c0dc44", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26520/", "date": "2024-04-30 13:24", "message": "The Israel Police publishes CCTV footage of today's stabbing attack near the Flowers Gate in the Old City of Jerusalem.\n\nThe Turkish terrorist stalked the two police officers from behind, and then pulled out a knife and started stabbing one of two.\n\nThankfully the officers managed to fight him off, sustaining only minor injuries.\n\nAs previously mentioned, the terrorist was shot and killed.", "location": "Old City of Jerusalem", "classification": "security", "score": 0.9972743688563904, "event_breakdown": "- Stabbing attack near the Flowers Gate in the Old City of Jerusalem\n- Turkish terrorist stalked two police officers and stabbed one of them\n- Officers managed to fight off the attacker with minor injuries\n- The terrorist was shot and killed"}, {"id": "c9f89ce2-4aa1-480c-8a09-ddc1df167278", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26517/", "date": "2024-04-30 13:11", "message": "Lebanese sources report on casualties in several Israeli attacks in Yaroun and Odaisseh in southern Lebanon.", "location": "Yaroun and Odaisseh", "classification": "security", "score": 0.9926602654668037, "event_breakdown": "- Lebanese sources report casualties in Yaroun and Odaisseh in southern Lebanon due to Israeli attacks."}, {"id": "6cabc5c5-f04a-47c6-95ba-d68a5d504ebf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26516/", "date": "2024-04-30 11:12", "message": "The American University in Beirut, Lebanon: Here, too, the statue of George Washington undergoes a process of \"Palestinianization\"\n\nOne of the students in the crowd is seen holding a picture of Muhammad Deif, the head of the military wing of Hamas.", "location": "American University in Beirut, Lebanon", "classification": "security", "score": 0.6905892484369863, "event_breakdown": "- Statue of George Washington undergoes \"Palestinianization\" at American University in Beirut, Lebanon\n- Student in the crowd holds a picture of Muhammad Deif, head of Hamas military wing"}, {"id": "a3bd02d3-9f0f-43ab-8c7c-09216b27d86b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26515/", "date": "2024-04-30 10:49", "message": "Ramallah, West Bank: A Palestinian joyfully presents the loot from the attack on the German ambassador's vehicle - its license plate.", "location": "Ramallah", "classification": "security", "score": 0.9812876088138319, "event_breakdown": "- Ramallah, West Bank: Palestinian joyfully presents loot from attack on German ambassador's vehicle, specifically its license plate."}, {"id": "d636d108-ff85-443e-9500-f9d5f143f9b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26514/", "date": "2024-04-30 10:31", "message": "The Flower Gate area in the Old City of Jerusalem:\n\nAn Israeli police officer sustained light injuries in a stabbing attack. \n\nThe terrorist, a tourist from Turkey was \"neutralized\", apparently permanently.", "location": "Jerusalem", "classification": "security", "score": 0.9953919204555158, "event_breakdown": "- Altercation between a young Jewish man and Al Jazeera reporter Najwan Simri in the Old City of Jerusalem: The man prevents Simri from broadcasting a report on a stabbing attack by a Turkish citizen, discourages viewers from listening to her, and is later accused by Simri of physical contact. False claim made by Najwan Simri to Israeli police regarding physical contact by the young Jewish man: Simri complains to Israeli police stationed in the area about the man, alleging physical contact, despite both being members of the same force (Israeli Border Police) targeted in the attack.\n- Rocket attack by the military wing of the Islamic Jihad targeting Israeli command and control centers in the Netzarim area.\n- Ramallah, West Bank: Palestinian joyfully presents loot from attack on German ambassador's vehicle, specifically its license plate.\n- Flower Gate area in the Old City of Jerusalem: An Israeli police officer sustained light injuries in a stabbing attack. The terrorist, a tourist from Turkey, was \"neutralized\", apparently permanently."}, {"id": "402fcf6a-fbbd-49b8-9090-af80701adfb8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26513/", "date": "2024-04-30 10:30", "message": "Ramallah, West Bank: The German ambassador to the PA was almost lynched by a Palestinian mob during a visit to a museum near Birzeit University.\n\nThe Palestinian mob surrounded the ambassador's car, vandalized it, and threw rocks at it.\n\nThis attack comes in light of Germany's support for Israel during the war.", "location": "Ramallah, West Bank", "classification": "security", "score": 0.9413258241893517, "event_breakdown": "- Attempted lynching of the German ambassador to the Palestinian Authority near Birzeit University in Ramallah, West Bank: A Palestinian mob surrounds the ambassador's car, vandalizes it, and pelts it with rocks.\n- Motivation for the attack attributed to Germany's support for Israel during the conflict."}, {"id": "f59f4909-1ae1-4052-8828-091ad11e557d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26512/", "date": "2024-04-30 10:25", "message": "A survey by the Harvard Harris Institute published yesterday yielded similar results - there is a clear majority for a military operation in Rafah among the American public - 72% support an operation in Rafah.", "location": "Rafah", "classification": "security", "score": 0.6975851679334045, "event_breakdown": "- Survey results by the Harvard Harris Institute: 72% of the American public support a military operation in Rafah."}, {"id": "21fd5bd2-51b3-4393-805a-0ac592d156b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26510/", "date": "2024-04-30 08:33", "message": "Students at Columbia University are switching to chants in Arabic.\n\n#Columbia_has_fallen", "location": "New York City", "classification": "security", "score": 0.4835643031151498, "event_breakdown": "- Students at Columbia University switch to chants in Arabic"}, {"id": "5d4c15a0-6647-4130-8509-d264e3819bce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26510/", "date": "2024-04-30 08:33", "message": "Columbia University in New York: Anti-Semitic students \"occupy\" the Hamilton building on the university campus, breaking in while vandalizing the place.\n\n#Hamilton_corridor\n#Down_with_the_occupation", "location": "Columbia University", "classification": "antisemitism", "score": 0.8018934140844742, "event_breakdown": "- Anti-Semitic students \"occupy\" the Hamilton building at Columbia University in New York\n- Vandalism reported in the Hamilton building on the university campus"}, {"id": "f95d5a3f-9732-481a-8cf9-2b87f5d5a85e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26508/", "date": "2024-04-30 08:32", "message": "The statue of George Washington at George Washington University has been Palestinianized and defaced.", "location": "George Washington University", "classification": "security", "score": 0.3831179570317771, "event_breakdown": "- Statue of George Washington at George Washington University defaced"}, {"id": "180faf96-5547-46cf-a52c-bcab518a9832", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26507/", "date": "2024-04-30 08:31", "message": "Stanford University, California: A student, wearing a headband of the military wing of Hamas, prepares for class...", "location": "Stanford University, California", "classification": "security", "score": 0.7733456335938974, "event_breakdown": "null"}, {"id": "d9cafe93-2db3-42ca-8735-c191f76f03a0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26506/", "date": "2024-04-30 08:30", "message": "Protest against Israel on US campuses:\n\n\"Morning Prayer\" at Harvard University.\n\n#sound_on", "location": "Harvard University", "classification": "security", "score": 0.7488853793510446, "event_breakdown": "- Protest against Israel at US campuses\n- \"Morning Prayer\" event at Harvard University"}, {"id": "bb24026e-3f41-407c-acca-332af9e3f300", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26505/", "date": "2024-04-30 08:27", "message": "An investigation by the Times sheds light on Ebrahim Al-Arjani's \"Ya Hala\" company, and on the profit it made on the backs of Gazans attempting to flee the violence in the Strip.\n\nAccording to the report, Al-Arjani company generated $88 million by \"coordinating\" the departure of 20,000 Gazans from the Gaza Strip during the month March alone (This \"service\" has been available for at least 5-6 months.)\n\nAccording to estimates, around 85,000 individuals have left Gaza since the onset of the conflict, paying approximately $5,000 per person.\n\nEbrahim Al-Arjani holds significant influence in North Sinai. He is a member of the Tarabin tribe and owns the Ibna Sina'a company, which imports and exports goods from Gaza. Al-Arjani holds close ties with Egyptian President Al-Sisi, he played a pivotal role in organizing the Bedouins of North Sinai into a paramilitary force, aiding the Egyptian army against groups like ISIS, and is known to be a business partner of the Egyptian President's son.", "location": "North Sinai", "classification": "security", "score": 0.4058430507307752, "event_breakdown": "null"}, {"id": "6a5f69fc-cc92-4ad3-9a85-64caf96f2006", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26500/", "date": "2024-04-30 08:17", "message": "Last night, the American Central Command published pictures of the progress of the construction of the floating pier off the coast of Gaza.\n\nAt the same time, there are reports that the British are considering sending soldiers on their behalf to secure the pier.", "location": "Gaza", "classification": "security", "score": 0.8247471719227055, "event_breakdown": "1. American Central Command publishes pictures of the construction of a floating pier off the coast of Gaza.\n2. Reports suggest that the British are considering sending soldiers to secure the pier."}, {"id": "f40a6e0d-d9d8-4a0b-a817-e2862719271b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26499/", "date": "2024-04-30 08:15", "message": "More about the anti-Semitic demonstrations on US campuses:\n\nMIT University issued an ultimatum to students to end the protest within 24 hours.\n\nColumbia University began suspending students who did not end the protest.", "location": "Cambridge, Massachusetts", "classification": "antisemitism", "score": 0.37022353244060985, "event_breakdown": "- Cambridge, Massachusetts (MIT University): MIT University issues ultimatum to students to end protest within 24 hours.\n- New York, New York (Columbia University): Columbia University begins suspending students who did not end the protest."}, {"id": "db264ebe-f5be-49d2-bff1-3dc80c8171b0", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb65799/", "date": "2024-04-30 08:15", "message": "Kevin Stitt, Governor of Oklahoma (Republican) on the protesters for Hamas:\n\nThis is a small and vocal minority that must bear responsibility for its actions.\n\nI wish they would have seen the GoPro camera videos of Hamas operatives from Oct 7th\n\nI would kick them out of the colleges.\n\nThey need a psychiatric evaluation.\n\nThere is no place for hate speech in Oklahoma.", "location": "Oklahoma", "classification": "antisemitism", "score": 0.7415916233952934, "event_breakdown": "- Governor Kevin Stitt, a Republican, comments on protesters for Hamas in Oklahoma\n- Stitt mentions a small and vocal minority of protesters and their responsibility for their actions\n- Stitt references GoPro camera videos of Hamas operatives from Oct 7th\n- Stitt expresses a desire to kick protesters out of colleges\n- Stitt suggests protesters need a psychiatric evaluation\n- Stitt states there is no place for hate speech in Oklahoma"}, {"id": "fc88c7e6-9ac8-40fb-bbea-c6a4bb76f312", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26491/", "date": "2024-04-30 05:46", "message": "Virginia Commonwealth University, Virginia, USA:\n\nHow it started", "location": "Virginia Commonwealth University, Virginia, USA", "classification": "security", "score": 0.42015051221981486, "event_breakdown": "- Virginia Commonwealth University in Virginia, USA, experienced a surge in COVID-19 cases among students and staff."}, {"id": "9ea5f135-5bbd-4330-8495-523ed4836406", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26490/", "date": "2024-04-29 21:02", "message": "It is difficult to exaggerate the strength of the consequences of a mistake made by its captains, such as giving up a convincing victory against Hamas in exchange for a hostage deal.\n\nSuch an error will teach the Middle East that it is very profitable to murder and kidnap Israelis, because this is the way to achieve goals against Israel. This invites the next mass kidnapping. The next demand of Hamas in exchange for future abductees could be, for example, an Israeli withdrawl from Judea and Samaria. Where do we draw the line (literally)?\n\nSuch an error invites the next war. Israel does not have the privilege of losing the current war or of not winning decisively and perhaps later making amends. There will be no second chance here. This is a defining moment in which Israel's image will be determined in the eyes of its enemies and allies in the Middle East. Israeli captains should know how to say \"no\" and withstand pressure if the deal offered to them endangers the future of the State of Israel.\n\nI do not for a moment undermine the importance of the redemption of abductees and the critical commitment of the State of Israel towards its kidnapped citizens, at the same time the State of Israel has a commitment to the other 10 million of its citizens and to those who sacrificed their lives, bodies and souls for it.\nIsrael knew how to make a good deal in November. The release of dozens of hostages at an acceptable price does not create an image of victory for Hamas. Israel's captains should also know how to say no if the terms of the new deal are bad for its citizens.\n\nThe issue of visibility\n\nVisibility to the spectators in the stands of the Middle East is of crucial importance here. If Hamas is perceived as the winner following the upcoming deal, Israel will pay an unbearably high price in the lives of its citizens and in its future as a sovereign state in the near future. Hyenas have a developed sense of smell, they know when the prey is in a position of weakness. The rest of the clan will arrive with phenomenal speed.\n\nThe Palestinians refer to October 7th as يوم العبور \"crossing day\" - the day they crossed from the Gaza Strip into \"Occupied Palestine\". October 6th was also called by the Egyptians by the exact same name - يوم العبور - Day of Crossing, the day they \"crossed the canal\" in 1973.\nHezbollah also uses the same terminology when talking about its military plans against Israel. If Hamas is perceived as the winner, the next crossing day (the third) is around the corner.\n\nAnd that's before we even touch on the consequences that will follow the throwing into the fray of hundreds of serious and especially talented perpetrators of terrorism who are supposed to be released as part of such a deal. The security establishment has already proven in the past that it cannot deal with the consequences of releasing such a large amount of serious terrorists. This is a massive amount of actors that can change the reality on the ground.\n\nThe decision makers must be publicly accountable to the citizens of Israel before they make such consequential decisions. This cannot be done in the dark. It is immoral.", "location": "Jerusalem", "classification": "antisemitism", "score": 0.6756562441251525, "event_breakdown": "- Israel gives up a convincing victory against Hamas in exchange for a hostage deal\n- Middle East learns that it is profitable to murder and kidnap Israelis\n- Next mass kidnapping may occur with more demands from Hamas\n- Possibility of future demand for Israeli withdrawal from Judea and Samaria\n- Error invites the next war with no second chance for Israel\n- Importance of Israel's image in the eyes of enemies and allies in the Middle East\n- Israeli captains should know how to say \"no\" to deals endangering the future of Israel\n- Israel made a good deal in November for the release of hostages\n- Captains should know when to reject bad terms for citizens in new deals\n- Visibility to the Middle East spectators is crucial\n- If Hamas is perceived as the winner, Israel will pay a high price in lives and future sovereignty\n- Reference to \"Crossing Day\" by Palestinians, Egyptians, and Hezbollah\n- Consequences of releasing talented perpetrators of terrorism in a deal with Hamas\n- Security establishment may struggle to deal with released terrorists\n- Decision makers must be publicly accountable to citizens for consequential decisions"}, {"id": "9c929a3f-6e65-420b-a05b-233d9ec16547", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26489/", "date": "2024-04-29 21:02", "message": "What are the consequences of stopping the war as part of a deal before the completion of the fighting in Rafah, Nuseirat and Deir al-Balah?\n\nHamas publicly and consistently demands the complete cessation of the war as a precondition for a hostage release deal or at the very least final, written and definitive guarantees on the matter.\n\nAccording to the latest reports in Arab and Israeli media, one gets the impression while reading between the lines that Hamas's demand to end the war was not outright rejected by the Israeli side.\n\nRegarding the matter, caution must be exercised because \"reports\" from negotiations about an upcoming deal always come with multiple spins with the aim of influencing the negotiations, so it is difficult to know how reliable they are.\n\nAt the same time, I will chose to now treat this possibility seriously, since this is an existential matter of supreme national importance concerning the continued existence of the State of Israel (no less!) in the Middle East. It is important to deeply understand the meaning derived from an Israeli agreement that would prevent the completion of the fighting in Rafah, Nuseirat and Deir Al-Balah.\n\nFirst I will describe the circumstances of the ongoing negotiations, which is also of crucial importance:\n\nIsrael is coming to the current negotiations from a position of inferiority, under unprecedented American, Western and international pressure. It was forced to accept, by dictation from the Americans and under public reprimands that echoed all over the Middle East and the world, a massive influx of humanitarian aid to the Gaza Strip, unparalled in world history. Israel is under constant threat from the International Court of Justice in The Hague and suffers from a significant weakness in international public opinion.\nIsrael arrives at the negotiations when most of its maneuvering military forces are not in Gaza and only a small force remains inside, responsible for freezing the situation without carrying out significant offensive activity.\n\nOn the other hand, Hamas comes to the negotiations from a position of advantage and strength. It is receiving unprecedented global support. People across the West are calling for a \"Palestinian state from the river to the sea\" - something that is reflected on all television screens everywhere. The US is pressuring Israel to get closer and closer to the original Hamas position while Hamas bides its time - Israel's allies are doing the work for Hamas.\nHamas succeeds in igniting demonstrations on the issue of the abductees in the heart of the State of Israel by publishing videos, with the aim of exerting domestic pressure on the decision makers in Israel.\nThere is more, but we will summarize and say that it is very obvious that Hamas has the upper hand here in everything related to the management of the negotiations - something that was not the case in the November abductee deal. Then, Hamas came from a weaker position.\n\nThe meaning:\n\nRelinquishing operating in Rafah, Nizirat and Deir al-Balakhequates to Israel losing the war in practice. Prime Minister Netanyahu said this in his own voice several times.\n \nThe only solution I see for this to be seen otherwise, without this being considered a resounding Israeli loss, is the exile of all the leaders of Hamas and its military operatives within the framework of an agreement that includes their disarmament. If Israel gives up the occupation of Rafah, Nizirat and Deir al-Balah without expelling Hamas from the Gaza Strip and disarming it, this will affect the future and existence of the State of Israel in the Middle East.\n\nIsrael was hit on October 7th and its deterrence was severely damaged. If she does not correct this impression and does not present a convincing victory or complete destruction of the enemy, then the next October 7th is only a matter of time. And it will not be a long way off.\nIsrael is now fighting for its image and character and how it will be perceived in the jungle of the Middle East in the years to come.", "location": "The main location where the main event takes place is Gaza Strip.", "classification": "antisemitism", "score": 0.8615579227479133, "event_breakdown": "1. Hamas demands complete cessation of war as precondition for hostage release deal\n2. Reports suggest Israeli side did not outright reject Hamas' demand\n3. Caution advised due to potential spin in negotiation reports\n4. Israel negotiates under pressure from international community and limited military presence in Gaza\n5. Hamas negotiates from position of advantage with global support\n6. Hamas ignites demonstrations in Israel to pressure decision makers\n7. Relinquishing control in Rafah, Nuseirat, and Deir al-Balah is equated to Israeli loss in the war\n8. Exile of Hamas leaders and disarmament proposed as alternative solution for Israeli victory\n9. Israeli deterrence damaged on October 7th, corrective action needed for future security\n10. Israel fighting to maintain image and perception in the Middle East"}, {"id": "0f64fae8-3e89-41a6-a6ce-33812ffb99e7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26487/", "date": "2024-04-29 20:35", "message": "The financial markets are smiling at the new president of Argentina:\nThe Argentine peso is the currency that jumped at the highest rate in the world against the dollar in the last 3 months (since Javier Milei was elected president of Argentina).\nThe Argentine currency strengthened by 25% during this period.", "location": "Buenos Aires", "classification": "world", "score": 0.43392220763195205, "event_breakdown": "- The Argentine peso jumps at the highest rate against the dollar in the last 3 months, strengthening by 25% since Javier Milei was elected president of Argentina."}, {"id": "e4a8283f-08db-4d73-a93d-9b6e8c00e811", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26486/", "date": "2024-04-29 20:34", "message": "Hamas: The movement's delegation arrived in Cairo today to consult and clarify a number of issues in the latest proposal. Inquiries and clarifications were made with the mediators - the Qataris and the Egyptians. The Hamas delegation will leave Cairo (for Doha, the capital of Qatar) for further consultations (within the movement).", "location": "Cairo", "classification": "security", "score": 0.6150094041786179, "event_breakdown": "null"}, {"id": "deebeed1-fc48-4644-9e11-7185289f2d89", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26484/", "date": "2024-04-29 19:37", "message": "Must watch:\nThis is how a Palestinian described his visit to the Auschwitz-Birkenau extermination camp in a video shared on Gaza channels:\n\"God wiling you will return to the camp...you belong here.\"\nHis take is not out of the ordinary among Palestinians.", "location": "Auschwitz-Birkenau extermination camp", "classification": "antisemitism", "score": 0.23996110688309147, "event_breakdown": "- A Palestinian describes his visit to the Auschwitz-Birkenau extermination camp in a video shared on Gaza channels."}, {"id": "b3472a03-5e9f-41e0-9ca0-34112cda4419", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26481/", "date": "2024-04-29 18:52", "message": "PA Chairman Abu Mazen met tonight in Saudi Arabia with Saudi Crown Prince Muhammad bin Salman.", "location": "Riyadh, Saudi Arabia", "classification": "security", "score": 0.8201277390222063, "event_breakdown": "- PA Chairman Abu Mazen meets with Saudi Crown Prince Muhammad bin Salman in Saudi Arabia"}, {"id": "6b8a01da-23d9-477d-9793-29d967af46a1", "channel_id": 1560386984, "url": "", "date": "2024-04-29 18:52", "message": "Ismail Haniyeh, chairman of the political bureau of Hamas, continues to receive an audience in Istanbul, this time Algerian members of parliament as well as members of Turkish parties.\nThe official excuse: they come to console him for the death of his sons and grandsons in an IDF attack a few weeks ago.", "location": "Istanbul", "classification": "security", "score": 0.9058050621174512, "event_breakdown": "1. Ismail Haniyeh, chairman of Hamas, receives an audience in Istanbul from Algerian members of parliament and Turkish party members to console him for the death of his sons and grandsons in an IDF attack."}, {"id": "e223fd54-662a-4e8b-ba1a-e1f2287c2bcc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26477/", "date": "2024-04-29 18:47", "message": "The IDF spokesperson announced the death of two reservists in battle in the center of the Gaza Strip.\n\nMay their memories be a blessing.", "location": "Gaza Strip", "classification": "security", "score": 0.944319386655642, "event_breakdown": "- Death of two IDF reservists in battle in the center of the Gaza Strip"}, {"id": "52ec630a-b790-4093-903a-f93851616776", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26476/", "date": "2024-04-29 17:29", "message": "New York: A large number of American police officers are gathering near the entrance gate of Columbia University ahead of the planned start of a march against Israel and shortly before the expiration of the ultimatum to remove the protest from the campus.", "location": "Columbia University", "classification": "security", "score": 0.5594224391550054, "event_breakdown": "- New York: American police officers gather near the entrance gate of Columbia University ahead of a planned march against Israel and shortly before the expiration of an ultimatum to remove the protest from the campus."}, {"id": "795b6c54-ad63-405c-b97e-3836b958845d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26473/", "date": "2024-04-29 16:54", "message": "Texas Governor Greg Abbott is calling on Congress not to transfer more of the American taxpayer's money to Harvard University following the removal of the American flag on the university grounds and replacing it with the Palestinian flag. Similar posts receive wide resonance and support among American Twitter accounts.", "location": "Harvard University", "classification": "security", "score": 0.40498556178769163, "event_breakdown": "- Texas Governor Greg Abbott urges Congress not to allocate more taxpayer money to Harvard University after the American flag is removed from campus and replaced with the Palestinian flag.\n- American Twitter accounts widely support similar sentiments regarding the flag incident at Harvard University."}, {"id": "c3a2ad93-2031-4e81-9ef7-f0be6c1de866", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26472/", "date": "2024-04-29 16:06", "message": "Paris: French police evacuate the anti-Israel encampment set up by students at Sorbonne University.", "location": "Paris", "classification": "security", "score": 0.8753638409910214, "event_breakdown": "- French police evacuate the anti-Israel encampment set up by students at Sorbonne University in Paris."}]