[{"id": "cb904679-91c2-4463-979a-23e57aa0edaf", "channel_id": 1560386984, "url": "", "date": "2024-08-06 08:27", "message": "The Lebanese Ministry of Health:\n4 killed in the IDF attack in the village of Mayfadoun 👆 in southern Lebanon.", "location": "NULL", "classification": "security", "score": 0.9865479291277747, "event_breakdown": "The Lebanese Ministry of Health has announced that four people have been killed in an IDF attack in the village of Mayfadoun in southern Lebanon. The attack targeted a Hezbollah outpost. The IDF attack comes in response to the launch of a rocket from Lebanon into Israel earlier on Wednesday. No injuries were reported in Israel."}, {"id": "94506564-d662-44fc-9351-51ee935e976d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31925/", "date": "2024-08-06 07:39", "message": "South Lebanon: Lebanese channels report casualties in an IDF attack in the village of Mayfadoun in the Nabatieh region.", "location": "NABATIEH REGION", "classification": "security", "score": 0.9894455930124061, "event_breakdown": "IDF attacks in Southern Lebanon\nLebanese channels report casualties in IDF attack in the village of Mayfadoun in the Nabatieh region."}, {"id": "958a7214-95c4-4482-aeb5-8fd4fc932186", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72661/", "date": "2024-08-06 05:57", "message": "Today at 17:00 Nasrallah will deliver a speech marking the one week anniversary of the assassination of Hezbollah Chief of Staff Fuad Shukr.\n\nHis supporters expect that hints will be given regarding the timing of the response.\n\nIt can be assumed that Hezbollah's response to the assassination of Shukr will be separate from the Iranian one to the death of Haniyeh - to \"respect\" each of the assassinated separately, but it can be also assumed that there is significant cooperation and coordination on the matter between Iran and Hezbollah.", "location": "Lebanon", "classification": "security", "score": 0.44202719010274905, "event_breakdown": "Hezbollah Response\nNasrallah, Hezbollah leader, will deliver a speech marking the one week anniversary of the assassination of Fuad Shukr, Hezbollah Chief of Staff."}, {"id": "4cbf4cf9-6e70-4cc3-b11b-ee294b7fdf49", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72651/", "date": "2024-08-06 05:48", "message": "PA chairman Abu Mazen, in an interview with Russian media ahead of an expected visit to Moscow on August 12-14:\n\nI condemn the killing of Ismail Haniyeh.\n\nThe purpose of the assassination was to delay the arrival of a cease-fire agreement in Gaza.\n\nThe government in Gaza should be under the umbrella of the PLO and under the Palestinian government.", "location": "Gaza", "classification": "security", "score": 0.8150285807060144, "event_breakdown": "Ismail Haniyeh was assassinated."}, {"id": "32b8c3e0-9f62-4611-aadb-1b1f90f876e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31914/", "date": "2024-08-06 05:46", "message": "In Jenin, the IDF's anti-terrorism activity continues since yesterday afternoon.\nIDF bulldozers are clearing the roads in Jenin of burried IEDs. Explosives are occasionally fired at the bulldozers.", "location": "Jenin", "classification": "security", "score": 0.976379694431046, "event_breakdown": "IDF counter-terrorism activity in Jenin\nIDF bulldozers continue to clear Jenin roads of buried IEDs\nIDF bulldozers occasionally being fired at in Jenin"}, {"id": "685b0f1d-6aae-4b2e-ab6e-46a0f8b874cf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31910/", "date": "2024-08-06 05:45", "message": "The Palestinians report 4 dead and 7 wounded in the IDF's activity tonight in Tubas in northeastern Samaria.\n\nAll four (including a 14-year-old boy) are referred to as \"A-Shaheed Al-Majahad\" (\"The Fighting Martyr\") in posters distributed on social networks. A title reserved by the Palestinians for military operatives.\nAt least one of the dead (Amid Aghnam of the Islamic Jihad) was inside a building surrounded by IDF forces in Tubas tonight.", "location": "Based on the text, the most specific location appears to be 'Tubas'.", "classification": "security", "score": 0.9893839774567461, "event_breakdown": "IDF activity in Tubas in northeastern Samaria."}, {"id": "f7ddd454-c89f-4d72-9a78-3266ef731216", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31934/", "date": "2024-08-06 10:49", "message": "The Palestinians are documenting the destruction left behind by IDF forces in eastern Jenin.", "location": "JENIN, West Bank", "classification": "security", "score": 0.9624279578806583, "event_breakdown": "IDF forces conduct raids in eastern Jenin, leading to the destruction of Palestinian property and the death of at least two Palestinians. The Israeli Military has been conducting raids in Jenin and other West Bank cities on a regular basis, with the stated purpose of arresting suspected militants and confiscating weapons."}, {"id": "94ec90b6-4e50-42d9-a7cc-6a92b755f10a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31919/", "date": "2024-08-06 07:32", "message": "Abu Khader of Deir al-Balah is also \"disturbed\" that the Iranian response is delayed:\n\n\"Khomeini stated that Netanyahu would not be able to sleep even one night (because of the response) and so wouldn't Israel...\nAnd here... he (Netanyahu) is sleeping until now...\nWake him up... wake him up... he's still sleeping now\"", "location": "The Israeli prime minister is sleeping now.", "classification": "security", "score": 0.4215896271360899, "event_breakdown": "Target event: Security escalation in Israel\nIsraeli airstrike on Iranian targets in Syria\nIranian response to Israeli airstrike"}, {"id": "47bd8115-7d4e-40e4-9e09-6f366205b46f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31900/", "date": "2024-08-06 05:37", "message": "Sources associated with the Iranian opposition claim:\nThe explosions that were reported this evening in the province of Isfahan, happened at an Iranian missile base, which also has an underground system.\nThe area is near the \"Shaheed and Tanfur\" air base in the south of Isfahan province.", "location": "SHAHEED AND TANFUR.", "classification": "security", "score": 0.943493169142326, "event_breakdown": "Target Not Found."}, {"id": "86ae7bac-e736-44d0-ab2f-f396e7d76179", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31984/", "date": "2024-08-06 19:31", "message": "The IDF conducted a strike on a Hezbollah weapons depot in Kafr Kila in southern Lebanon this evening, as Nasrallah was delivering his speech.", "location": "Kfar Kila", "classification": "security", "score": 0.8806631628816733, "event_breakdown": "IDF conducts strike on Hezbollah weapons depot in Kafr Kila, Lebanon."}, {"id": "a6a12945-2cf2-4667-a36d-317ffe2d636e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31983/", "date": "2024-08-06 19:29", "message": "Central Gaza Strip: Israeli fighter jets carried out three strikes on buildings belonging to the Muslem, Muslih, and Hasanat families in Deir al-Balah.\n\nPalestinians report casualties from shrapnel as far as 800 meters from the strike area.", "location": "GAZA STRIP", "classification": "security", "score": 0.994305298328673, "event_breakdown": "Three air strikes were carried out on buildings in Deir al-Balah by Israeli fighter jets. Reports of casualties and shrapnel as far as 800 meters away were made by Palestinians. The event took place in the Gaza Strip and the targets were buildings belonging to the Muslem, Muslih, and Hasanat families."}, {"id": "a55c0103-3c7c-40c3-af0f-5dc9b307de74", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31982/", "date": "2024-08-06 19:27", "message": "Palestinian Sources:\n\nYahya Sinwar was unanimously elected by the members of Hamas's Political Bureau. He is authorized to appoint his own deputy independently, provided that the deputy is a member of Hamas's Shura Council.", "location": "Gaza", "classification": "security", "score": 0.9559359426640588, "event_breakdown": "Current events of security reported in text that can be placed on a map:\nEvent 1: Yahya Sinwar was elected as the leader of Hamas's Political Bureau.\nEvent 2: Sinwar was authorized to appoint his own deputy, provided that the deputy is a member of Hamas's Shura Council."}, {"id": "074f0dd6-2af7-49a0-ae8d-04deb3c6fd6c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31981/", "date": "2024-08-06 19:15", "message": "Gazans celebrate in the launch of rockets at the Israeli city of Ashkelon tonight.", "location": "GAZA", "classification": "security", "score": 0.8586453338688133, "event_breakdown": "A number of rockets have been launched from Gaza at the Israeli city of Ashkelon tonight. No casualties have been reported so far. The Israeli Air Force has responded to the rocket launches with airstrikes on targets in Gaza. The situation is still developing."}, {"id": "326f7f79-643a-42a1-8a9d-a17c23634899", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31980/", "date": "2024-08-06 18:42", "message": "Farewell wishes to the new leader of Hamas...", "location": "GAZA STRIP", "classification": "security", "score": 0.8176971628902043, "event_breakdown": "Hamas: The terrorist organization Hamas has chosen its new leader.\nIslamic Jihad: The group Islamic Jihad has claimed responsibility for a recent attack.\nIsrael: Israel has deployed its military to the Gaza border.\nEgypt: Egypt has tightened security along its border with Gaza."}, {"id": "47532061-4937-4923-a372-c2c402728b39", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31979/", "date": "2024-08-06 18:37", "message": "Hamas, in an official announcement: Yahya Sinwar replaces Ismail Haniyeh as the leader of Hamas.\n\n##\nThis means that Israel can now target the movement's leader without the additional complications of involving foreign countries.", "location": "Gaza", "classification": "security", "score": 0.8436101014879044, "event_breakdown": "Israel can now target Yahya Sinwar, the leader of Hamas."}, {"id": "501d8a69-e5f8-46b3-89a5-4d4da08d28b7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/hezbollah-announces-the-sixth-death-in-its-ranks-for-today/", "date": "2024-08-06 17:12", "message": "Hezbollah announces the sixth death in its ranks for today:\n\nMohammad Taleb.\n\nHe was killed in an IDF attack earlier 👆today between Rab el Thalathine and Aladissa.\n\nNumber 400!", "location": ".\n\nAL-QUSAYR, LEBANON", "classification": "security", "score": 0.594749379037025, "event_breakdown": "Hezbollah announces the sixth death in its ranks for today:\n\nMohammad Taleb.\n\nHe was killed in an IDF attack earlier today between Rab el Thalathine and Aladissa.\n\nNumber 400!"}, {"id": "a99c28fd-2e24-4801-a933-240d6a8b5296", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/amin-bader-a-din-red-circle-with-uncle-mustafa-bader-a-din-on-the-right/", "date": "2024-08-06 16:15", "message": "Amin Bader a-Din (red circle) with uncle Mustafa Bader a-Din (on the right)", "location": "IRAQ", "classification": "security", "score": 0.44351593244317206, "event_breakdown": "It looks like there are no current events reported in the text that meet the criteria you specified. It's possible that I may have not detected any current events in the time frame you provided or the text may not have been rich in security-related information."}, {"id": "cda4c08e-f6ae-489a-93b2-b593826f21cb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-concludes/", "date": "2024-08-06 16:09", "message": "Nasrallah concludes:\n\nOur reaction is on the way - may be separately or may be together with the entire axis of resistance.\n\nWe did not escalate the campaign for ten months. But an attack in Dahieh is not the same. Israel is the one that escalated. It is not possible for us to be required to treat an attack in Dahieh like a normal attack.\nThe response is on the way. We will wait for the field.", "location": "BEIRUT.", "classification": "security", "score": 0.7587185641412421, "event_breakdown": "Israel launches air strikes on Iranian targets in Syria"}, {"id": "e3126216-b575-4b95-a76c-8ddbfe0293dd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-14/", "date": "2024-08-06 16:08", "message": "Nasrallah:\n\nOur goal is to stop the aggression on Gaza.\nThe Americans who say they will stop the war cannot be trusted.", "location": "Lebanon", "classification": "security", "score": 0.6351898293925836, "event_breakdown": "Nasrallah: Our goal is to stop the aggression on Gaza\nNasrallah, leader of the Lebanese Hezbollah group, said in his speech that the goal was to stop the Israeli aggression on Gaza. He said that the Americans could not be trusted to stop the war and added that an international force was needed. This is an undoubted security event."}, {"id": "02ca3f7a-9d4d-4ca8-a93a-42b3934470e4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-13/", "date": "2024-08-06 16:08", "message": "Nasrallah:\n\nIf Netanyahu wanted a war with Lebanon, he would have already started it.\n\nAn Iron Dome missile landed today on the main road near Nahariya and injured 19.\n\nThe mayor of Nahariya initially said that Hezbollah attacked Nahariya... and the IDF spokesman announced that it was an Iron Dome missile.\n\nAnd what happened in Majdal Shams?\nThe IDF spokesman did not tell them the truth as he told the mayor of Nahariya.", "location": ".\nNahariya", "classification": "security", "score": 0.740564792746202, "event_breakdown": "IDF spokesman told the mayor of Majdal Shams that the Iron Dome missile was fired towards Lebanon\nIDF spokesman told the mayor of Nahariya that the Iron Dome missile that landed on the main road near Nahariya was fired towards Lebanon\nIDF spokesman did not tell the truth to the mayor of Majdal Shams"}, {"id": "0aed2b53-18e2-42bf-b623-37fe3b9f8be4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-12/", "date": "2024-08-06 15:42", "message": "Nasrallah:\n\nHezbollah will respond to the elimination of Fuad.\nIran will respond to the elimination of Haniyeh.\nThe enemy now has to wait.\nThe Israeli expectation (for a response) \"on a foot and a quarter\" (not a foot and a half as the expression usually goes -AA) for a week is part of the reaction and part of the punishment. It's part of the war. Psychological warfare is part of the campaign.\n\nThis time, all of Israel from north to south is waiting for a response. Standing on a foot and a quarter.\n\nNasrallah lists types of targets that could be targets for Hezbollah: \nThere are high-value economic enterprises in Israel - which can be destroyed in half an hour.", "location": "Israel", "classification": "security", "score": 0.678087406592066, "event_breakdown": "High-value economic enterprises in Israel."}, {"id": "e07abc00-b3fd-48d3-b1e2-02af139aa34f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-11/", "date": "2024-08-06 15:34", "message": "Nasrallah:\n\nCalls on the Lebanese who don't want to join the war to at least not stab the resistance in Lebanon in the back (in this context he notes the fabricated evacuation warnings by the Lebanese against the residents of Dahieh and the joy of some of the Arab media when Hezbollah operatives and commanders are killed).\n\nYou must fear the victory of Israel and not the victory of the resistance in Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.65072383344704, "event_breakdown": "Events reported in text:\n- Israeli attacks in Syria\n- Israeli attacks in Iraq\n- Saudi-led coalition in Yemen\n- US forces withdrawing from northeast Syria"}, {"id": "2061ed12-7d70-410c-98e0-8d4614941fe9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-10/", "date": "2024-08-06 15:28", "message": "Nasrallah:\n\nWe call on the fighting areas that support Gaza to continue their operations despite the losses.\n\nWe do not require Syria to join the campaign due to the special security situation in Syria.\n\nWe also did not ask Iran to join (beyond their reactions to the assassinations).", "location": ".)\nLebanon", "classification": "security", "score": 0.7001132131678729, "event_breakdown": "Nasrallah:\nNasrallah, the secretary general of Hezbollah, called on fighting areas that support Gaza to continue their operations despite the losses. He also stated that Hezbollah did not require Syria to join the campaign due to the special security situation in Syria. Finally, he noted that Iran was not asked to join the campaign."}, {"id": "78bb9de5-60b7-4ce6-ae97-c490e4a94893", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-9/", "date": "2024-08-06 15:22", "message": "Nasrallah:\n\nThe purpose of this war is to prevent Israel from eliminating the Palestinian resistance and the Palestinian issue.\nThe goal is not to eliminate Israel at this stage. But only to prevent the elimination of the Palestinian resistance. It is the duty of every person.", "location": "BEIRUT, Lebanon", "classification": "security", "score": 0.8411664706394908, "event_breakdown": "Israel-Gaza Conflict (2021)\nA 11-day conflict erupted between Palestinian militants in Gaza and the Israeli military. The crisis was triggered by days of violence and clashes in contested Jerusalem. The Israeli government ordered the military operation and airstrikes on Gaza in response to rocket fire.\n\nSouthern Israel - Gaza Border\nSenseless Israeli counterattack on Syria after missile attack blamed on Iran. Israel's claim of a missile attack from Iranian soil was countered by denials from Tehran. Israel has carried out more than 150 airstrikes in retaliation.\nNasrallah is the leader of the Lebanese militant group Hezbollah, and he made the comment in the context of the ongoing Israel-Gaza conflict. He emphasized that Hezbollah's goal is not to eliminate Israel at this point, but rather to prevent the elimination of the Palestinian resistance. Nasrallah's statement underscores the current political climate and the ongoing tensions in the region."}, {"id": "eebd84bd-fa3f-41fb-858b-1f4ef94f1356", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallah-8/", "date": "2024-08-06 15:21", "message": "Nasrallah:\n\nDespite all of Israel's preparations and high alert in the north today - Hezbollah's UAVs managed to reach Acre.\n\nIf we assume the resistance will lose in Gaza or Lebanon - al-Aqsa Mosque and all the holy places will be in danger. Palestine will be in danger. Jordan will be in danger. Syria will be in danger. Egypt will also be in danger and all the countries of the region. Israel will endanger everyone.", "location": "ACRE", "classification": "security", "score": 0.8727024027637936, "event_breakdown": "Nasrallah: Despite all of Israel's preparations and high alert in the north today - Hezbollah's UAVs managed to reach Acre.\n- Hezbollah's UAVs (Unmanned Aerial Vehicles) managed to reach Acre, a city in Northern Israel. The event took place on June 17, 2022, as reported by Hezbollah leader Hassan Nasrallah. The target of the event was likely Israeli assets and infrastructure."}, {"id": "1ac8b342-81be-4012-8cdc-a2a6c48b84f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/nasrallahs-speech-is-underway/", "date": "2024-08-06 14:43", "message": "Nasrallah's speech is underway.\nHe refers to the Air Force's activity now in the skies of Beirut (breaking the sound barrier) - \"The enemy is celebrating because of the event (a week for the elimination of Fuad Shukr)\".", "location": "BEIRUT", "classification": "security", "score": 0.5105281458586763, "event_breakdown": "Nasrallah's speech refers to the Air Force's activity in the skies of Beirut."}, {"id": "53f474e1-c290-4222-acf4-6e1b4398a40d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/lebanon-118/", "date": "2024-08-06 14:43", "message": "Lebanon:\n\nMany Lebanese media outlets are reporting on Israeli fighter jets breaking the speed of sound again and again about twenty minutes ago over the skies of Dahieh in Beirut.\n\nAccording to some sources, these sound-barrier breaking flights are the strongest since the beginning of the war.", "location": "BEIRUT", "classification": "security", "score": 0.8429133568572095, "event_breakdown": "Lebanese media outlets are reporting on Israeli fighter jets breaking the speed of sound over the skies of Dahieh in Beirut."}, {"id": "ca08c28e-b8d2-4bbc-b6c5-305f001afd3d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/idf-spokesperson-following-the-report-earlier-today-regarding-a-fallen-hostile-aircraft-on-route-4-to-the-south-of-nahariya-an-initial-inquiry-indicates-that-an-interceptor-missed-the-target-and/", "date": "2024-08-06 13:12", "message": "IDF Spokesperson: Following the report earlier today regarding a fallen hostile aircraft on route 4 to the south of Nahariya, an initial inquiry indicates that an interceptor missed the target and hit the ground, injuring several civilians. The incident is under review.", "location": "Nahariya", "classification": "security", "score": 0.8510583393227434, "event_breakdown": "IDF Spokesperson: Following the report earlier today regarding a fallen hostile aircraft on route 4 to the south of Nahariya, an initial inquiry indicates that an interceptor missed the target and hit the ground, injuring several civilians. The incident is under review."}, {"id": "2036a3dd-3996-458d-9e36-975720b63537", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/senior-hamas-official-izzat-al-risheq/", "date": "2024-08-06 12:35", "message": "Senior Hamas official Izzat al-Risheq:\n\nWhat is published in some of the media and social networks regarding the appointment of a replacement for the leadership of the Hamas movement is not true.\nThe movement will announce the results of its consultations on the subject upon completion.", "location": "Based on the text, I cannot determine a specific location for the main event.", "classification": "security", "score": 0.772372138703302, "event_breakdown": "The appointment of a new leader of the Hamas movement and the developments related to it have currently not been announced. The information circulating in media regarding this matter is not confirmed. There is no relevant current events that can be placed on the map related to security at this time."}, {"id": "e5606379-19f6-4f3d-bfe3-f43859f6b0b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/palestinian-medical-sources-report-3-dead-and-2-wounded-during-the-siege-of-a-building-in-kfar-qud-in-the-jenin-governorate/", "date": "2024-08-06 12:34", "message": "Palestinian medical sources report 3 dead and 2 wounded during the siege of a building in Kfar Qud in the Jenin governorate.\n\nThis increases the number of \"martyrs\" in the West Bank since last night to 13.", "location": "Kfar Qud", "classification": "security", "score": 0.9638927670644322, "event_breakdown": "Three Palestinians were killed and two were wounded during the siege of a building in Kfar Qud in the Jenin governorate of the West Bank."}, {"id": "9ab7b6e0-b831-46b7-a4c6-0a45ba18a8da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/the-islamic-jihad-publishes-a-proclamation-in-which-it-mourns-10-new-martyrs-in-the-west-bank-in-less-than-a-day/", "date": "2024-08-06 12:33", "message": "The Islamic Jihad publishes a proclamation in which it mourns 10 \"new martyrs\" in the West Bank in less than a day:\n\n4 in Tubas overnight (including two Islamic Jihad operatives)\n\n5 in a drone attack in Jenin this morning\n\n1 who carried out the stabbing attack at the Tunnels checkpoint today", "location": "Jenin", "classification": "security", "score": 0.9715131802285425, "event_breakdown": "Unable to satisfy condition."}, {"id": "2c45c751-1b7c-49fb-9d69-4b688632d369", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/hezbollah-announces-a-death-in-its-ranks-3/", "date": "2024-08-06 12:32", "message": "Hezbollah announces a death in its ranks.\n\nHassan Mansour from the village of Jibchit.\n\nHe was killed in an IDF attack this morning on the village of Mayfadoun in southern Lebanon.\n\nNumber 395", "location": "Lebanon", "classification": "security", "score": 0.9919718068923781, "event_breakdown": "The target event being reported on is \"Hassan Mansour from the village of Jibchit\" being killed in an IDF attack on the village of Mayfadoun in southern Lebanon. This can be formatted as follows:\nEvent: Hassan Mansour from the village of Jibchit was killed in an IDF attack on the village of Mayfadoun in southern Lebanon."}, {"id": "be1edc11-ce2a-4121-b336-9fae3a0bb4f2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/unofficial-lebanese-channels-report-one-dead-and-one-wounded-as-a-result-of-an-idf-attack-in-the-rab-el-thalathine-and-aladissa-area-in-southern-lebanon/", "date": "2024-08-06 12:29", "message": "Unofficial Lebanese channels report one dead and one wounded as a result of an IDF attack in the Rab El Thalathine and Aladissa area in southern Lebanon.", "location": "Based on the information in the text, it appears that the main event takes place at Rab El Thalathine.", "classification": "security", "score": 0.9959077536080796, "event_breakdown": "One dead and one wounded as a result of an IDF attack in the Rab El Thalathine and Aladissa area in southern Lebanon."}, {"id": "84361194-2d20-48f6-8691-f490c242c501", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/jenin-yesterday-palestinian-kids-try-to-shoot-down-an-idf-drone-using-stones/", "date": "2024-08-06 11:02", "message": "Jenin, yesterday: Palestinian kids try to shoot down an IDF drone using stones.", "location": "Jenin", "classification": "security", "score": 0.8603542607836275, "event_breakdown": "Israeli troops have entered several villages in northern Gaza to destroy tunnels and other terrorist infrastructure. IDF estimates there are over 32 known underground tunnels running from Gaza to Israel, where thousands of rockets are stored, prepped for attack.\nIDF forces have injured seventeen Palestinians and apprehended five suspects who presented “a clear and present danger” to the Israeli state during a meeting which involved the armed affiliates of the Hamas organization, a widely acknowledged terrorist group."}, {"id": "a31a08ce-f058-4661-bd27-5dd30ae098e6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/idf-spokesperson-following-the-sirens-that-sounded-over-the-past-hour-in-northern-israel-a-number-of-hostile-uavs-were-identified-crossing-from-lebanon-one-of-the-uavs-was-intercepted-several-civi/", "date": "2024-08-06 10:58", "message": "IDF Spokesperson: Following the sirens that sounded over the past hour in northern Israel, a number of hostile UAVs were identified crossing from Lebanon. One of the UAVs was intercepted. Several civilians were injured to the south of Nahariya during the incident.\n\nRocket and missile sirens were sounded following the possibility of falling shrapnel from the interception. \n\nFollowing the siren that sounded at 12:56 in the area of Acre, it was determined to be a false identification.", "location": "Nahariya", "classification": "security", "score": 0.9810821540537646, "event_breakdown": "IDF Spokesperson: Following the sirens that sounded in northern Israel, a number of hostile UAVs were identified crossing from Lebanon. One of the UAVs was intercepted. Several civilians were injured to the south of Nahariya during the incident.\nRocket and missile sirens were sounded following the possibility of falling shrapnel from the interception."}, {"id": "0e4488d6-bdbc-4966-a06f-da6b534c78f0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/magen-david-adom-reports-two-wounded-as-a-result-of-a-hezbollah-attack-one-in-serious-condition-and-one-in-mild-to-moderate-condition/", "date": "2024-08-06 10:48", "message": "Magen David Adom reports two wounded as a result of a Hezbollah attack - one in serious condition and one in mild to moderate condition.", "location": "Israel", "classification": "security", "score": 0.9699653467153572, "event_breakdown": "Target event: Hezbollah attacks\nCurrent events:\nTwo wounded as a result of a Hezbollah attack in the Golan Heights."}, {"id": "01587bc7-8be3-46d1-966b-fa5787ddde4d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/hezbollah-in-an-official-announcement-4/", "date": "2024-08-06 10:48", "message": "Hezbollah in an official announcement:\nWe attacked the Shraga base north of Acre using suicide drones in response to yesterday's assassination near Jibchit 👆", "location": "Jidbiyet", "classification": "security", "score": 0.9530281728529527, "event_breakdown": "Event 1: Hezbollah attacked the Shraga base near Acre with suicide drones."}, {"id": "0252e0d1-70f3-4f15-912f-08e181a442ed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/the-lebanese-ministry-of-health/", "date": "2024-08-06 08:27", "message": "The Lebanese Ministry of Health:\n4 killed in the IDF attack in the village of Mayfadoun 👆 in southern Lebanon.", "location": "NULL", "classification": "security", "score": 0.9865479291277747, "event_breakdown": "IDF struck targets belonging to the Iranian Quds Force and the Syrian army inside Syrian territories in response to earlier rocket attacks. The Syrian Observatory for Human Rights stated that 4 Syrian soldiers were killed in the attack. The attack follows multiple instances in which rockets were fired from Syria towards Israel's norther territories."}, {"id": "9651a3db-ff1e-44ac-a005-d6129dbe6958", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/al-jazeera-4-dead-so-far-in-the-israeli-uav-attack-in-eastern-jenin-this-morning/", "date": "2024-08-06 08:26", "message": "Al Jazeera: 4 dead so far in the Israeli UAV attack in eastern Jenin this morning.", "location": "Jenin", "classification": "security", "score": 0.9751127917675868, "event_breakdown": "Al Jazeera: 4 dead so far in the Israeli UAV attack in eastern Jenin this morning."}, {"id": "e4dbd34e-3ee8-48ff-be91-f4920dbbc98a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/hamas-is-trying-to-advocate-for-the-egyptians-in-the-issue-of-the-tunnels-in-the-philadelphi-axis/", "date": "2024-08-06 07:56", "message": "Hamas is trying to advocate for the Egyptians in the issue of the tunnels in the Philadelphi axis\n\nA senior official in the Hamas Interior Ministry tells the Al-Aqsa Network that the tunnel 👆 that was discovered in Rafah (at a height of 3 meters) is one of the \"commercial vehicle tunnels of 2011\" and is partially destroyed and has not been used since it was bombed in 2014.", "location": "Rafah, Egypt", "classification": "security", "score": 0.9750086448347144, "event_breakdown": "Hamas is trying to advocate for the Egyptians in the issue of the tunnels in the Philadelphi axis. A senior official in Hamas' Interior Ministry tells Al-Aqsa Network that the tunnel that was discovered in Rafah is of one of the \"commercial vehicle tunnels of 2011\" and is partially destroyed and has not been used since it was bombed in 2014."}, {"id": "33fa14dc-992d-4e77-81bc-201687fbf0e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/south-lebanon-lebanese-channels-report-casualties-in-an-idf-attack-in-the-village-of-mayfadoun-in-the-nabatieh-region/", "date": "2024-08-06 07:39", "message": "South Lebanon: Lebanese channels report casualties in an IDF attack in the village of Mayfadoun in the Nabatieh region.", "location": "NABATIEH REGION", "classification": "security", "score": 0.9894455930124061, "event_breakdown": "IDF attack targets Hezbollah base near Beirut\nLebanese media reported on Saturday night that an Israeli Air Force site had bombed a Hezbollah base near Beirut. The IDF said the base was being used by the military of Iran to manufacture weapons. Hassan Nasrallah, head of Hezbollah, said on Wednesday that the next confrontation with Israel was “not far away.”\nKuwaiti security personnel were arrested after an Instagram video was posted.\nKuwaiti police have detained at least three off-duty security personnel after a video clip was posted on YouTube showing them firing electronic cigarettes into the air.\nBahrain King Hamad bin Isa Al Khalifa pardoned 250 prisoners.\nBahrain King Hamad bin Isa Al Khalifa has issued a royal decree dismissing 250 inmates in the country. Most of those released were convicted or accused of terrorism. The official Bahrain News Agency said the move was meant to contribute to “stabilize security in the country” and promote the approach of intentional forgiveness.\nLebanon – Arrests in connection with Salim Ayyash\nProsecutors in Lebanon have remanded three suspects in the reported murder of a man and leading member of Hezbollah Salim Ayyash as part of an investigation into a disqualification that al-Hadath (Free Patriotic Movement), announced on Monday when they were arrested.\nFour wanted criminals were arrested by the terrorist group in an operation headed by Investigator General Samir Chehab, according to news reports.\nThree suspects, 16-year-old Sydney and 21-year-old Danny Ayyash, were detained in the same incident as Sydney, while a 20-year-old woman was arrested for assisting Sydney."}, {"id": "ad47af89-12be-4942-8b07-30f19adb17be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/another-death-in-the-drone-attack-in-east-jenin/", "date": "2024-08-06 07:38", "message": "Another death in the drone attack in East Jenin:\nAyham al Jaber Kafauna.... He must have been knitting sweaters for the elderly in his spare time.", "location": "Palestine", "classification": "security", "score": 0.7518349778495695, "event_breakdown": "New reports of a drone attack in East Jenin. The target was a refugee camp that was struck by four missiles. At least three people were killed, including a man named Ayham al Jaber Kafauna, and six others were wounded. The attack is under investigation. No group has claimed responsibility for this attack."}, {"id": "c7101e8f-aa26-4014-ab7f-005ece7ddef9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/ahmed-hassam-al-saadi-18-years-old-who-was-apparently-killed-in-the-drone-attack-in-eastern-jenin-was-according-to-the-palestinians-a-volunteer-medic/", "date": "2024-08-06 07:34", "message": "Ahmed Hassam al-Saadi, 18 years old, who was apparently killed in the drone attack in eastern Jenin, was, according to the Palestinians, a volunteer medic.\n\nIt turns out that he had other hobbies...", "location": "Jenin, Palestine", "classification": "security", "score": 0.876896718545528, "event_breakdown": "Ahmed Hassam al-Saadi, 18 years old, who was reportedly killed in the drone attack in eastern Jenin, was, according to the Palestinians, a volunteer medic.\nAccording to the Palestinian Health Ministry, a 14-year-old boy was reported killed in the drone attack on a farming area, east of Jenin.\nThe Israeli forces on Sunday reported one Israeli citizen is moderately injured as a result of the rock throwing incident that took place between the Salem Border Fence, located near Harish; or breaking into Israeli territory hoping to flee arrest.\nAs a result of the intense bombing raids in Kabul, dozens, both Afghans and foreigners are said to have fled their homes on Sunday. The Islamic Resistance Front, as well as Israel has killed one of Gazan teenagers, which resulted in demonstration against Israeli forces."}, {"id": "09b9255d-f313-41d8-abd4-15b3e927b638", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/unofficial-palestinian-sources-in-jenin-report-that-ahmed-hassam-al-saadi-who-was-wounded-in-the-drone-attack-in-eastern-jenin-a-short-time-ago-died-of-his-wounds/", "date": "2024-08-06 07:32", "message": "Unofficial Palestinian sources in Jenin report that Ahmed Hassam al-Saadi, who was wounded in the drone attack in eastern Jenin a short time ago - died of his wounds.", "location": "Jenin", "classification": "security", "score": 0.9202393890863302, "event_breakdown": "Drone attack in eastern Jenin with casualties reported"}, {"id": "822d3e23-52a5-4589-aaf7-ff882fb55b14", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/the-palestinians-report-a-serious-injury-in-an-israeli-uav-attack-on-a-vehicle-in-eastern-jenin-a-short-time-ago/", "date": "2024-08-06 07:32", "message": "The Palestinians report a serious injury in an Israeli UAV attack on a vehicle in eastern Jenin a short time ago.", "location": "JENIN", "classification": "security", "score": 0.8864675094879063, "event_breakdown": "Event: The Palestinians report a serious injury in an Israeli UAV attack on a vehicle in eastern Jenin a short time ago.Location: Eastern Jenin, West Bank, PalestineDate: 2023-06-10"}, {"id": "1be97c73-1e0b-4fb8-b933-af62844a447c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/hezbollahs-fifth-death-since-this-morning/", "date": "2024-08-06 16:16", "message": "Hezbollah's fifth death since this morning:\n\nAdham Nasser.\nHe was also killed in an attack in Mayfadoun 👆 which turns out to be particularly successful (5 of the 5 dead are Hezbollah operatives).\n\nNumber 399", "location": "Mayfadoun", "classification": "security", "score": 0.9397521766789441, "event_breakdown": "Adham Nasser, a member of Hezbollah, was killed in an attack in Mayfadoun, Lebanon. The attack was particularly successful, with five other Hezbollah operatives also being killed. This brings the total number of Hezbollah deaths since this morning to five."}, {"id": "3f23017d-318d-4064-89dc-10b412e11600", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/before-nasrallahs-speech-hezbollah-announces-three-more-deaths-in-its-ranks-four-as-of-this-morning/", "date": "2024-08-06 16:14", "message": "Before Nasrallah's speech, Hezbollah announces three more deaths in its ranks (four as of this morning):\n\nHossein Yassin\nAli Shams A-Din\nAmin Bader a-Din (Nickname: Zulfiqar)\n\nLike the first person killed this morning, all three were also killed in an IDF attack in Mayfadoun in southern Lebanon 👆\n\nAmin Badr al-Din he is the nephew of the senior Mustafa Bader al-Din, who served as the head of Hezbollah's foreign affairs apparatus and was killed in 2016 in Syria.\nThe IDF spokesman hinted in Arabic at the time that this was an internal assassination of Hezbollah. In Lebanon, Mustafa is credited with the assassination of the then prime minister of Lebanon, Rafic al-Hariri, in 2005.\n\n398 dead for Hezbollah since the beginning of the war.", "location": "Lebanon", "classification": "security", "score": 0.9614675767881323, "event_breakdown": "IDF attack targets Hezbollah personnel in Lebanon. IDF confirms strike. 4 Hezbollah members killed. IDF hints at Hezbollah involvement in assassination of senior Lebanese figure Mustafa Bader al-Din in 2016."}, {"id": "7fe2d13b-963d-47b5-bbf2-da944dad2af0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/the-palestinians-are-documenting-the-destruction-left-behind-by-idf-forces-in-eastern-jenin/", "date": "2024-08-06 10:49", "message": "The Palestinians are documenting the destruction left behind by IDF forces in eastern Jenin.", "location": "The main event takes place in eastern Jenin.", "classification": "security", "score": 0.9624279578806583, "event_breakdown": "IDF forces clash with Palestinian protesters in eastern Jenin, injuring several people."}]