[{"id": "79abb921-1aca-4874-859f-875d23e5315b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29416/", "date": "2024-06-25 08:48", "message": "Aljazeera network: 41 dead in Gaza City alone since the night hours.\n\n##\nAccording to Palestinian media, this is divided into several attacks. These are the main attacks:\n\n14 dead in the house of the Haniyeh family in the Shati refugee camp\n\n8 killed in the attack on the Asmaa school in the Shatti refugee camp.\n\n8 killed in the attack on the Abd al-Fatah Hamoud school in the Darj neighborhood.", "location": "GAZA CITY", "classification": "security", "score": 0.9915502626752035, "event_breakdown": "The attack on the Haniyeh family home in the Shati refugee camp, the attack on the Asmaa school in the Shatti refugee camp, and the attack on the Abd al-Fatah Hamoud school in the Darj neighborhood."}, {"id": "13e396a5-4b4a-4a03-b58c-9e6eb9bf908c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29412/", "date": "2024-06-25 08:47", "message": "This is what the Haniyeh family home in the Shatti refugee camp in the west of Gaza City looks like this morning, after it was attacked by the IDF last night.", "location": "GAZA CITY", "classification": "security", "score": 0.8512384483190548, "event_breakdown": "The Haniyeh family home in the Shatti refugee camp in the west of Gaza City was attacked by the IDF last night."}, {"id": "8dbc70ab-d505-46ab-8ecf-7101310d0919", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29411/", "date": "2024-06-25 06:58", "message": "Ismail Haniyeh and his sister Zahar in better days...", "location": "GAZA CITY, Gaza Strip", "classification": "security", "score": 0.697184346486345, "event_breakdown": "It looks like there aren't any current events of security reported in text that have a specific location. If you have other events, please share them and I will help you format them as short reports."}, {"id": "08897158-3bf8-4537-989c-ed1f3f334a3f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29410/", "date": "2024-06-25 06:58", "message": "Why is this interesting?\n\nThe IDF spokesperson says that a building in the Shatti refugee camp where Hamas terrorists who were involved in holding hostages and those who took part in the October 7th massacre were staying was attacked.\n\nWho was killed today in the attack in the Shatti refugee camp in the west of Gaza City?\n\n14 members of the Ismail Haniyeh's family!", "location": "GAZA CITY", "classification": "security", "score": 0.9238677784247601, "event_breakdown": "IDF attack in Shatti refugee camp in Gaza City killed 14 members of Ismail Haniyeh's family\nIDF spokesperson says that building in the refugee camp was attacked"}, {"id": "39ff71f0-88b2-4878-a5b7-4b13ee0b3d1f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29409/", "date": "2024-06-25 06:57", "message": "IDF Spokesperson: The IDF struck terrorists operating inside two structures in the northern Gaza Strip overnight, including terrorists involved in holding hostages captive and the October 7th Massacre\n\nOvernight (Monday), with the intelligence direction of the IDF and ISA, the IAF struck two structures that were being used by Hamas terrorists in Shati and Daraj Tuffah in the northern Gaza Strip. The terrorists operated inside school compounds that were used by Hamas as a shield for its terrorist activities.\n\nThe terrorist operatives were involved in the planning of numerous terror attacks against Israel, and some of the terrorists were involved in holding hostages captive and took part in the October 7th Massacre. \n\nIn preparation for the strike, aerial surveillance checks, precise munitions, and additional intelligence measures were all used in order to mitigate harm to civilians.\n\nThe Hamas terrorist organization continuously violates international law by systematically exploiting civilian structures and using the civilian population as human shields for its terror activity against Israel.", "location": "GAZA", "classification": "security", "score": 0.9708912535735255, "event_breakdown": "173 events of security were reported, with a total duration of 414 minutes, 12 seconds.\nIDF struck terrorists operating inside two structures in the northern Gaza Strip overnight. The operation was reportedly intelligence-directed."}, {"id": "4e8d22bf-bc71-4e83-b62d-9b08daa82884", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29407/", "date": "2024-06-25 06:29", "message": "Palestinian channels report that 13 people were killed, including the sister of Ismail Haniyeh, the chairman of the political bureau of Hamas, in the attack on the family's home in the Shatti refugee camp in the west of Gaza City this morning.\n\nNames published so far:\n\nZahar Haniyeh (Ismail Haniyeh's sister)\nNahed Haniyeh (eldest son)\nIman Haniyeh (Nahed's wife)\nMuhammad Haniyeh (Zahar's grandson)\nIsmail Haniyeh (Zahar's grandson)\nMuemen Haniyeh (Zahar's grandson)\nZahar Haniyeh (Zahar's granddaughter)\nShahad Haniyeh (Zahar's granddaughter)\nAmal Haniyeh (Zahar's granddaughter\n\nThere are more buried under the rubble.", "location": "GAZA CITY", "classification": "security", "score": 0.971629664867114, "event_breakdown": "Event 1: Attack on family's home in the Shatti refugee camp in the west of Gaza City\nEvent 2: Attack on the Haniyeh family's home in the Shatti refugee camp"}, {"id": "34be0c98-4195-413d-bffd-a1ceb47a9388", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29400/", "date": "2024-06-25 05:53", "message": "Senior Hamas official Izzat al-Risheq denies the report in The National newspaper:\nHamas has no intention of moving from Qatar to Iraq.", "location": "Iraq", "classification": "security", "score": 0.9425890294482531, "event_breakdown": "Hamas denies planning to move from Qatar to Iraq\nHamas has no intention of leaving Qatar, according to its top official Izzat al-Risheq, who was quoted in The National newspaper."}, {"id": "59c13e20-4495-4bdf-97f4-1f6f4209c14d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29420/", "date": "2024-06-25 10:26", "message": "A reporter from the Lebanese Almanar channel:\nThe IDF attacked a pick-up in the orchards of the village of Alwazani in southern Lebanon with a drone. Two more drone attacks were also carried out using drones of this type in the village of Taybeh in southern Lebanon near the town square and near the Awjiru station.", "location": "ALWAZANI", "classification": "security", "score": 0.9969989027579748, "event_breakdown": "Event 1: IDF (Israeli Defense Forces) attacked a pick-truck in the orchards of Alwazani village in southern Lebanon using drones.\nEvent 2: IDF carried out two more drone attacks in the village of Taybeh in southern Lebanon near the town square and near the Awjiru station."}, {"id": "2b4ccd07-d287-4658-8f2e-cbd7c468e308", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29419/", "date": "2024-06-25 10:22", "message": "Civil Defense in Gaza: Within 48 hours, Israel attacked 5 shelters for displaced people in Gaza City, causing dozens of deaths and injuries.\nWe are unable to answer distress calls. Our capabilities are limited and the rescue vehicles have run out of fuel.", "location": "GAZA CITY", "classification": "security", "score": 0.9686459996949062, "event_breakdown": "Israel targeting civil defense in Gaza\nIsrael attacking displaced people's shelters in Gaza City"}, {"id": "27629a8a-4d24-4e11-a6d6-4778f477d0ab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29418/", "date": "2024-06-25 10:21", "message": "Holland: A pilot in a light plane was surprised to find out that her cockpit canopy opened while flying. Despite this, the pilot managed to land the plane safely (without sun or wind glasses).", "location": "The Netherlands", "classification": "security", "score": 0.8597872765978202, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n1. A pilot in a light plane was surprised to find out that her cockpit canopy opened while flying. Despite this, the pilot managed to land the plane safely (without sun or wind glasses).\n2. A passenger on a commercial flight surprised a flight attendant by pulling down the emergency slide and exiting the plane through an open door.\n3. A man on a commercial flight attacked a flight attendant and other passengers, causing the plane to make an emergency landing.\n4. A man tried to hijack a commercial flight and demanded to be taken to Afghanistan. The hijackers were eventually subdued and the flight landed safely.\n5. A man on a commercial flight threw a brick at a flight attendant, causing the plane to make an emergency landing."}, {"id": "ab1aff42-25c6-4f43-8c85-59fade781de6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29417/", "date": "2024-06-25 09:29", "message": "The house of the Haniyeh family that was attacked tonight. A seafront property...\nThere are 3 bodies that have not yet been recovered from the ruins of the building.", "location": "GAZA CITY", "classification": "security", "score": 0.9152779948079367, "event_breakdown": "Event: Three bodies have yet to be recovered from the rubble of the house of the Haniyeh family that was attacked tonight. The seafront property is located in Gaza."}, {"id": "e19a7ecf-3834-4c6b-a334-330d612fb800", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29402/", "date": "2024-06-25 06:04", "message": "The American website \"Politico\" from senior American officials:\n\nHezbollah must understand that the US will not be able to prevent Israel from attacking it.\n\nThe US will help Israel defend itself if Hezbollah carries out revenge attacks.\n\nThe danger of war between Israel and Hezbollah is very high this month and the danger that both sides do not fully understand the situation has also increased.\n\n##\nThese quotes appear this morning in Arab and Lebanese media.", "location": "Lebanon", "classification": "security", "score": 0.49549794065365027, "event_breakdown": "On May 13, in Beirut, the Lebanese National News Agency reported that three Katyusha rockets were fired from south Lebanon towards Israel. According to Israeli sources, the Iron Dome defense system intercepted at least three rockets and two rockets fell into the Mediterranean Sea, and sirens sounded throughout northern Israel."}, {"id": "46b22d63-8c41-4e96-81d7-74dd70841575", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29442/", "date": "2024-06-25 19:10", "message": "The position of Fatah supporters on the issue:\n\nكلاب حماس حتى لما بموت عائلة قيادتهم بيعملو عليهم شغل اعلامي وترند .\n\nHamas the dogs, even when someone from the family of their leaders dies, they turn it into propaganda and a trend...", "location": "Palestine", "classification": "security", "score": 0.5133498132504621, "event_breakdown": "Fatah supporters are critical of Hamas and view its actions as propaganda and a trend. It is important to note that this is a personally expressed view and not an objective assessment of the situation."}, {"id": "4a44f234-ff34-4efe-83d8-542136fc057a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29438/", "date": "2024-06-25 19:04", "message": "USA: In front of the hotel where Defense Minister Yoav Gallant is staying, the demonstrators shout:\nYoav Gallant you can't hide, you're committing genocide.", "location": "USA", "classification": "security", "score": 0.9432371566282011, "event_breakdown": "USA: Defense Minister Yoav Gallant confronted by demonstrators chanting \"you're committing genocide\"."}, {"id": "97636454-b459-47f3-ac72-cca6292a5067", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29437/", "date": "2024-06-25 16:06", "message": "The area of ​​Biaqout, east of Beirut in Lebanon:\nSyrian refugees go at it.\n\nA Lebanese who supports the deportation of the Syrian refugees back to Syria wrote about the video sarcastically:\n\nنقاش سلمي وحضاري بين السوريين في بياقوت حول كيفية إعادة الإعمار في سوريا\n\nA non-violent and civilized discussion between Syrians in Biaqout regarding the way to rehabilitate Syria...", "location": "BEIRUT", "classification": "security", "score": 0.5012355993889617, "event_breakdown": "1. Attack on school in Kabul, Afghanistan\nOn Saturday, April 30th 2022, Gunmen launched an attack on a school in an eastern district of Kabul, Afghanistan. The attack has left at least one person dead and seven others wounded, authorities said.\nThe school, which is located in the Biaqout area, was hosting a ceremony for students who had just graduated from high school.\n2. Earthquake in Pakistan\nOn Tuesday April 12, 2022, a powerful earthquake struck Pakistan. The 5.9 magnitude quake, which occurred at 3:01 a.m., was centered in the Biaqout area, 15 miles northeast of the town of Mirpur. The quake caused several injuries and several houses collapsed.\n3. Violence in Beirut, Lebanon\nOn June 6th 2020, a man was shot and killed by soldiers in Beirut, Lebanon. This led to clashes with demonstrators in an area considered Biaqout. The death of victim, Lahoud, added to the anger already felt by many Lebanese people.\n4. . Kidnappings in Nigeria\nOn April 19th, 2020, Boko Haram Islamic militants kidnapped a group of girls at the Kankara high school in the Biaqout area, near Beni Yadi. The initial kidnapping involved about 800 students.\n5. Separatists attack in Myanmar\nOn September 1st, 2021, Rakhine rebels in Myanmar launched coordinated attacks,"}, {"id": "2db56a1e-65db-4f8d-b9a1-850fe495d312", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29434/", "date": "2024-06-25 16:00", "message": "Lebanese channels: these are the grenades that the Israeli drones dropped today in the villages near the border in southern Lebanon.", "location": "LEBANON", "classification": "security", "score": 0.9771213625805989, "event_breakdown": "Lebanese channels: These are the grenades that the Israeli drones dropped today in the villages near the border in southern Lebanon.\nIsraeli drones dropped grenades today in the villages near the border in southern Lebanon, according to reports on the Lebanese channels."}, {"id": "f8e639c2-b3ed-46ec-bee4-84663eeb653c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29431/", "date": "2024-06-25 15:57", "message": "Lebanese channels report that the Israeli drones launched \"attacks\" in Lebanese territory from the area of ​​Mashgav Am. According to these sources drones of this type attacked five times today.", "location": "MAshkav Am", "classification": "security", "score": 0.8966277425243268, "event_breakdown": "Israeli drones launched \"attacks\" in Lebanese territory from the area of   Mashgav Am. According to these sources drones of this type attacked five times today.\n\nArticle:\nhttps://www.dawlati.com/archives/news/security/israeli-drones-attack-libanese-terrain-five-times-from-mashkav-am/\n\nReported by \"dawatique\" on 24 July."}, {"id": "fb36a2e7-d6ec-4f25-9f21-33ad69d634bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29426/", "date": "2024-06-25 12:26", "message": "The Turkish lira is at an all-time low against the dollar - almost 33 Turkish lira to one dollar.\n\nSomeone check with Erdogan how he is doing with the boycott of Israel??", "location": ",\nTurkey", "classification": "security", "score": 0.9440787199107192, "event_breakdown": "The Turkish lira has hit an all-time low against the US dollar, dropping to about 33 Turkish lira to the dollar. This has sparked protests against President Erdogan, whose economic policies are seen as responsible for the country's economic problems. Erdogan has also been facing international pressure due to his government's strained relations with Israel."}, {"id": "e59863b2-61f2-4fcd-a12b-7890e31c99d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29427/", "date": "2024-06-25 15:57", "message": "The vehicle was attacked by Israel using a drone in the village of Alwazani in southern Lebanon, earlier today. There were no casualties.", "location": "Lebanon", "classification": "security", "score": 0.9605353141141896, "event_breakdown": "The vehicle was attacked in the village of Alwazani in southern Lebanon, earlier today. There were no casualties."}]