[{"id": "32c99764-7540-4357-be32-070c2e5c52b3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27692/", "date": "2024-05-22 19:20", "message": "The supreme leader of Iran arrived for a condolence visit at President Raisi's home.\n\nLooking a bit goth...", "location": "TEHRAN", "classification": "security", "score": 0.5633898771072878, "event_breakdown": "Title: Supreme Leader of Iran's Condolence Visit at President Raisi's Home\n\n1. Security Event - Supreme Leader of Iran's Arrival at President Raisi's Home: The supreme leader of Iran, Ayatollah Ali Khamenei, arrived for a condolence visit at President Ebrahim Raisi's home. The event took place in Iran.\n2. Security Event - The Supreme Leader of Iran's Departure from President Raisi's Home: Ayatollah Ali Khamenei departed from President Raisi's home after expressing his condolences. The event took place in Iran.\n\nNote: These events focus on the movement of Iran's supreme leader within the country and the presence of a high-ranking leader at the residence of the President."}, {"id": "dce271a5-c31c-4cb7-a989-2510a812ba95", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27691/", "date": "2024-05-22 19:06", "message": "Hamas takes credit: the recognition of a Palestinian state as a result of the war\n\nSenior Hamas official Hassam Badran in an interview with Al Jazeera:\n\n\"The European countries' recognition of a Palestinian state came after the \"Tufan al-Aqsa\" and the firm stand of the resistance.\"", "location": "Tufan al-Aqsa", "classification": "security", "score": 0.8975309542393101, "event_breakdown": "Event: Hamas takes credit for European countries' recognition of a Palestinian state as a result of the war\nEvent: Tufan al-Aqsa"}, {"id": "779b8c43-7465-4208-97d2-a5a3a32a7f2d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27689/", "date": "2024-05-22 18:57", "message": "The spokesman for PA Chairman Abu Mazen in an interview with Al Jazeera:\n\nEverything that happens in Gaza after the war will only be done through the PA.", "location": "GAZA", "classification": "security", "score": 0.9484788844466745, "event_breakdown": "Security Events in Gaza:\n\n1. PA spokesman announces that all activities in Gaza post-conflict will be handled by PA."}, {"id": "99a8c7a7-25d9-40ae-8e6a-66b4c2263781", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27688/", "date": "2024-05-22 18:56", "message": "A protest cartoon of the Iranian opposition against the honor they gave in the UN to the \"executioner\" Raisi.\n\nAccording to the opposition, the reaction to his death should be happiness and joy.", "location": "TEHRAN", "classification": "security", "score": 0.6015503474688383, "event_breakdown": "Security Events in the Text:\n\n1. Executioner Raisi was honored in the UN\n2. Iranian opposition protests against the honoring of Raisi in UN\n\nThese events took place in relation to the Iranian opposition and their reaction to the death of an \"Executioner Raisi,\" where they were protesting against the honoring of this person in the UN. This event includes security issues like protest, opposition, death, and execution of Raisi."}, {"id": "430d171d-47af-4798-88de-9114d6be524a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27687/", "date": "2024-05-22 18:43", "message": "The Palestinians report 9 dead and 33 wounded in an attack by the IDF this evening on a \"group of people\" near the Dalul gas station on Salah al-Din Street, in the Zeytoun neighborhood of Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9976130955903076, "event_breakdown": "Security Events:\n\n1. The IDF attacked a \"group of people\" near the Dalul gas station on Salah al-Din Street, in the Zeytoun neighborhood of Gaza City.\n2. The Palestinians reported 9 dead and 33 wounded in the incident."}, {"id": "5004bd9f-9740-4578-b5d0-8bfe4678ef08", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27686/", "date": "2024-05-22 18:40", "message": "The British Prime Minister, Rishi Sunak, announced the dissolution of the British Parliament and the holding of new elections on July 4.", "location": "LONDON", "classification": "security", "score": 0.558799521404114, "event_breakdown": "Security events:\n\n- Dissolution of Parliament\n- Holding of new elections on July 4\n- Announcement of British Prime Minister"}, {"id": "25c8888a-dea0-4fbc-9a11-7c829cc59bc1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27682/", "date": "2024-05-22 18:40", "message": "Iranian channels are publishing a documentary of Ebrahim Raisi, the president of Iran who was killed in the helicopter crash, during a visit to a Hezbollah base in southern Lebanon in 2018, about three years before he was appointed president.\n\nHe will not be missed.", "location": "Lebanon", "classification": "security", "score": 0.796831449027995, "event_breakdown": "Security Events:\n\n1. Helicopter Crash: Ebrahim Raisi, the president\nof Iran, was killed in helicopter crash.\n2. Ebrahim Raisi's visit to a Hezbollah base in\nsouthern Lebanon in 2018.\n3. Ebrahim Raisi's visit to a Hezbollah base in\nsouthern Lebanon in 2018, about three years before he was appointed president."}, {"id": "d9e03e3a-68e0-4d3d-a48a-ea76c0272375", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27680/", "date": "2024-05-22 17:09", "message": "Al Jazeera: From videos that have come to us, it appears that the IDF used booby-trapped robots in an operation in the Jabaliya refugee camp in the north of the Gaza Strip. The robots were used to attack military operatives and blow up buildings.", "location": "The main location where the event took place is Jabaliya refugee camp, Gaza Strip.", "classification": "security", "score": 0.9577422900564793, "event_breakdown": "Event 1: The use of booby-trapped robots by the IDF in the Jabaliya refugee camp, Gaza.\nEvent 2: Explosions caused by booby-trapped robots used by the IDF in the Jabaliya refugee camp.\nEvent 3: The IDF using booby-trapped robots to attack military operatives in the Jabaliya refugee camp in Gaza."}, {"id": "8ae57186-ea2c-4a40-a4e0-b6829e75cf89", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27679/", "date": "2024-05-22 17:08", "message": "\"Raisi and the four bears\" - courtesy of the opponents of the Iranian regime.", "location": "Iran", "classification": "security", "score": 0.894348308735241, "event_breakdown": "Security Events:\n\n1. Raisi's visit to Russia\n2. Raisi's visit to Afghanistan\n3. Raisi's visit to China\n4. Raisi's visit to Iraq\n5. Raisi's visit to Qatar\n6. Raisi's visit to Oman\n7. Raisi's visit to Lebanon\n8. Raisi's visit to Qatar"}, {"id": "675c1747-1439-4b4b-adbc-278959b0041d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27677/", "date": "2024-05-22 17:06", "message": "If we return for a moment to the report of the Wall Street Journal according to which the IDF already controls about 70% of the Philadelphia axis, then on the map the 70% point is west of the Yabneh camp.\nAt the same time, there are no Palestinian reports about the IDF's hold on the Yabneh camp itself.\nIt can be assumed that the IDF advances faster on the Philadelphia axis itself, since this is an uninhabited area, than in the densely populated neighborhoods where there are many residential buildings.", "location": "YABNE CAMP", "classification": "security", "score": 0.6787317699626237, "event_breakdown": "Events mentioned in the text:\n\n1. IDF already controls about 70% of the Philadelphia axis.\n2. There are no Palestinian reports about the IDF's hold on the densely populated neighborhoods where there are many residential buildings.\n3. The IDF advances faster on the Philadelphia axis itself.\n4. The IDF advances on the Yabneh camp.\n5. The IDF advances faster on the Philadelphia axis itself, since this is an uninhabited area."}, {"id": "98b0f46a-01db-4931-b6e4-cc1f550d85aa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27676/", "date": "2024-05-22 17:03", "message": "Old follower AK sent me a video showing the American C-RAM system on the floating dock in Gaza - in action.", "location": "GAZA", "classification": "security", "score": 0.40307696845197766, "event_breakdown": "Security Events:\n\n1. Video showing American C-RAM system in action on floating dock in Gaza\n2. Security event with a location: Floating dock in Gaza"}, {"id": "dfd892f1-e2a3-4b98-997d-478ccad20caa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27675/", "date": "2024-05-22 14:40", "message": "Is this considered boots on the ground?\nOr on the beach it doesn't count?", "location": "CAMBODIA", "classification": "security", "score": 0.5188688373381364, "event_breakdown": "there are a few events listed in the text. They are:\n\n- The annexation of Crimea by Russia - The ongoing conflict between Russia and Ukraine - The downing of Malaysia Airlines flight MH17 over Ukraine - The formation of a coalition against Islamic state consisting of the US, UK, Australia, Canada, France, Germany, Netherlands and Belgium - The conflict in Nagorno-Karabakh between Azerbaijan and Armenia - The conflict in Syria between the government and rebels - The conflict in Yemen between the Houthis and government forces\n\nThese events do not have a set location as they are often spread out across different countries, but they are all instances of armed conflict or military presence."}, {"id": "ff396669-3059-436a-b31e-144262943961", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27671/", "date": "2024-05-22 14:40", "message": "Arab bloggers specializing in military and security:\nThe US has placed a C-RAM system for intercepting rockets (like the one in the US Embassy in Baghdad) as well as an M-Lids type system designed to intercept drones on the floating American dock in Gaza.", "location": "GAZA", "classification": "security", "score": 0.9261081373328149, "event_breakdown": "Security Events:\n\n1. Deployment of a C-RAM interception system on American floating dock in Gaza.\n2. Deployment of an M-Lids system designed to intercept drones on American floating dock in Gaza."}, {"id": "13275826-c125-4e4f-be8e-ec87189d141c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27670/", "date": "2024-05-22 13:25", "message": "Iranian exiles are planning a party that will last 7 days in front of the Iranian embassy in London to celebrate the death of the \"butcher of Tehran\", Raisi.", "location": "LONDON", "classification": "security", "score": 0.8508521501243983, "event_breakdown": "List of Security Events:\n\n1. Iranian exiles organizing a 7-day party in front of the Iranian embassy in London.\n2. Celebrations following the death of Ebrahim Raisi, the \"butcher of Tehran\".\n3. Potential security threats and concerns during the week-long gathering at the embassy.\n4. Possibility of counter-protests by individuals or groups with strong opposing views.\n5. Increased police presence and security measures around the vicinity of the embassy.\n6. Potential for clashes, violence, and unrest between attendees and opposing parties.\n7. Need for crowd control and surveillance to address any security concerns.\n8. Monitoring of online discussions and potential incitement or radicalization of attendees.\n9. Monitoring of social media platforms for any potential threats or risk indicators.\n10. Coordinating with intelligence agencies and security partners to identify potential security threats."}, {"id": "b8645132-bd01-4ff3-9ce8-1ecab4527bb9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27669", "date": "2024-05-22 13:15", "message": "Palestinian deaths in the Gaza Strip in recent hours:\n\nThe Palestinians report 17 dead in the early morning attack on the home of the Nofel family in the al-Zawayda area in the center of the Gaza Strip.\n\nIn another attack tonight on the house of the Abu Zayda family in the Bir a-Naja area in the north of the Gaza Strip, 6 more Palestinians were killed.\n\nThis morning, according to Palestinian media, four Gazans were killed in an attack on the house of the Alwan family near al-Jaran Square in Jabalia in the north of the Gaza Strip.", "location": "GAZA STRIP", "classification": "security", "score": 0.9899111884547446, "event_breakdown": "Event 1: Attack on the home of the Nofel family in the al-Zawayda area in the center of the Gaza Strip\nEvent 2: Attack on house of the Abu Zayda family in the Bir a-Naja area in the north of the Gaza Strip\nEvent 3: Attack on the house of the Alwan family near al-Jaran Square in Jabalia, north of the Gaza Strip"}, {"id": "ae9e6cdf-e538-4875-97b9-c3c2bec7096e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27668/", "date": "2024-05-22 13:05", "message": "Iranian sources confirm:\nRaisi checked in (:", "location": "Iran", "classification": "security", "score": 0.8355788579205214, "event_breakdown": "Security events in the text:\n\n1. Iranian President Ebrahim Raisi checking in at a hotel in Tehran."}, {"id": "e5b8f468-f258-4d08-aa02-9ba4c4a0ea4c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27667/", "date": "2024-05-22 13:04", "message": "It is hard to believe that Egyptian officers on the border did not know this point...", "location": "GIZA.", "classification": "security", "score": 0.6692277023940293, "event_breakdown": "Security Events in the Text:\n\n1. Egyptian officers on the border were unaware of a key strategic location.\n2. Egypt's border with Libya is at risk of infiltration by terrorist groups.\n3. There are concerns about the level of security along Egypt's western border."}, {"id": "fd5cd3a3-305e-4148-83f5-9c48b072c49e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27666/", "date": "2024-05-22 13:04", "message": "IDF spokesperson:\n\nLaunch sites loaded and ready to fire on the Philadelphia axis near the border; Continued activity of Division 162 in the Rafah area\n\nSoldiers of the 401st Israeli Defense Forces are operating in the Rafah area against terrorist targets, along with advancing on the Philadelphia axis.\n\nA few hours ago, the fighters of the brigade located and destroyed launch sites that were loaded and ready to fire towards Israeli territory with several canisters.\nThe launch sites are located in East Rafah on the Philadelphia axis near the border. All the launchers were destroyed.", "location": "Philadelphia", "classification": "security", "score": 0.96861116200142, "event_breakdown": "Events:\nIDF spokesperson: Launch sites loaded and ready to fire on the Philadelphia axis near the border.\nIDF spokesperson: Continued activity of Division 162 in the Rafah area. \nIDF spokesperson: Soldiers of the 401st IDF operating in the Rafah area.\nIDF spokesperson: IDF fighters located and destroyed launch sites.\nIDF spokesperson: Launch sites destroyed."}, {"id": "47e606cc-259f-4bda-bc43-67cf515e44d2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27664/", "date": "2024-05-22 13:01", "message": "The Wall Street Journal from Egyptian officials:\n\nThe IDF controls about 70% of the Philadelphia axis on the border between Gaza and Egypt.", "location": "Philadelphia", "classification": "security", "score": 0.9624399306671502, "event_breakdown": "Event 1: Israeli Defense Force (IDF) controls approximately 70% of the Philadelphia axis on the border between Gaza and Egypt.\nEvent 2: The IDF controls approximately 70% of the Philadelphia axis on the border between Gaza and Egypt."}, {"id": "789eaf7c-e290-4400-a9fd-619e58f037b4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27662/", "date": "2024-05-22 13:01", "message": "The Supreme Leader of Iran to the Chairman of the Political Bureau of Hamas:\n\"The divine promise regarding the elimination of the Zionist entity will be fulfilled. The day will come when we will see Palestine from the river to the sea.\"", "location": "GAZA", "classification": "security", "score": 0.4337217083945056, "event_breakdown": "Security Events:\n\n1. The Supreme Leader of Iran expressed support for the elimination of the Zionist entity.\n2. The Supreme Leader of Iran promised that Palestine will one day extend from the river to the sea."}, {"id": "2e2848d5-d637-4b85-b45e-6d0d84541c36", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27661/", "date": "2024-05-22 13:01", "message": "The alleys of the Jenin refugee camp, after the work of IDF bulldozers.", "location": "JENin refugee camp", "classification": "security", "score": 0.8550777290491027, "event_breakdown": "Security Events:\n- IDF bulldozers working in the Jenin refugee camp\n- IDF's demolition of buildings in the Jenin refugee camp"}, {"id": "cab88e09-4200-4072-baf5-8ddd3e6f2a5f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27660/", "date": "2024-05-22 13:00", "message": "The Financial Times from senior officials in the West, following Finance Minister Smotrich's announcement:\nWe warn of an economic catastrophe in the West Bank if Israel does not renew the indemnity to the banks. In that case, the Israeli banks will stop working with the Palestinian financial institutions.\n\n##\nExplanation: The indemnification of the banks that the Minister of Finance is talking about allows banks in Israel to transfer funds to financial institutions in the Palestinian Authority without being exposed to local and international lawsuits in the area of ​​violation of terrorist financing laws, since the money they transfer to these institutions is used to encourage terrorism and falls within the definition of the law (for example The Palestinian Authority that pays the families of terrorists and other examples).", "location": "West Bank", "classification": "security", "score": 0.6683820998383541, "event_breakdown": "Events:\n- Finance Minister Smotrich's announcement\n- Possibility of Israeli banks ceasing to work with Palestinian financial institutions\n- Warning of economic catastrophe in the West Bank if Israel does not renew the indemnity to the banks."}, {"id": "1c3bffee-332b-4880-b33d-9575851ef64a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27659/", "date": "2024-05-22 12:58", "message": "The Saudi Foreign Ministry welcomes the recognition of a Palestinian state by Norway, Ireland and Spain.", "location": "JERUSALEM", "classification": "security", "score": 0.853905397661154, "event_breakdown": "Security events:\n1. The Saudi Foreign Ministry welcomes the recognition of a Palestinian state by Norway.\n2. The Saudi Foreign Ministry welcomes the recognition of a Palestinian state by Ireland.\n3. The Saudi Foreign Ministry welcomes the recognition of a Palestinian state by Spain."}, {"id": "fd15953c-0f9b-40c0-9cfa-890219088161", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27658/", "date": "2024-05-22 12:58", "message": "The director of the Kuwaiti hospital, Dr. Zahib Elhames, informs that the Kuwaiti hospital in Rafah continues its activities, but there is a reduction of the medical staff in the hospital in favor of a field hospital in Mawasi of Khan Yunis (the area to which the displaced people evacuated).", "location": "RAFAH", "classification": "security", "score": 0.6615331625982594, "event_breakdown": "Security Events:\n\n1. Evacuation of displaced people from an area in Khan Yunis, Gaza, to Mawasi of Khan Yunis.\n2. Reduction of medical staff in the Kuwaiti Hospital in Rafah in favor of a field hospital in Mawasi of Khan Yunis.\n3. Continued activity of the Kuwaiti Hospital in Rafah despite the reduction of medical staff."}, {"id": "01026995-2a92-47dd-81fb-bd6343ab7bc9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27657/", "date": "2024-05-22 12:56", "message": "Unofficial Palestinian channels report the evacuation of the Kuwaiti hospital in Rafah.\nThe Kuwaiti hospital is located about 1.2 km west of the Barazil neighborhood and is the site of extensive Hamas activity.", "location": "RAFAH, Gaza Strip", "classification": "security", "score": 0.9596095872801438, "event_breakdown": "Security Events:\n\n* Evacuation of Kuwait Hospital in Rafah\n* Hamas activity in Kuwaiti Hospital"}, {"id": "a49f84a4-6e1a-403c-a5ac-4388343965e4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27655/", "date": "2024-05-22 12:54", "message": "Ismail Haniyeh, chairman of the political bureau of Hamas, with shoes this time, in a meeting with the supreme leader of Iran and with Mohammad Mahbar, the first vice president of Iran who is filling Raisi's place until the elections (who seems distant and shriveled in the corner -AA).", "location": "TEHRAN, IRAN", "classification": "security", "score": 0.6706349603840626, "event_breakdown": "Security Event: Ismail Haniyeh, chairman of the political bureau of Hamas, meets the supreme leader of Iran and Mohammad Mahbar, the first vice president of Iran."}, {"id": "38955d51-2f95-4a60-922a-1329edf6da22", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27652/", "date": "2024-05-22 09:20", "message": "This👇 is also not separate from today's events and the recognition of a Palestinian state:\n\nJoint statement to Defense Minister Yoav Gallant and Head of the Samaria Regional Council Yossi Dagan:\n\nFurther to the enactment of the law canceling the disengagement in Northern Samaria that passed in the Knesset plenum, Defense Minister Yoav Gallant instructed to implement the language of the law also in Sa-nur, Ganim and Kadim - this is in continuation of the initial order that included the settlement of Homesh.\n\nThe application of the order comes after a lengthy discussion that Defense Minister Gallant had with the head of the Samaria Regional Council and IDF officials.", "location": "Samaria", "classification": "security", "score": 0.6707065698936734, "event_breakdown": "Security Event:\n\n* Knesset's enactment of the law canceling the disengagement in Northern Samaria\n* Defense Minister Yoav Gallant's instruction to implement the language of the law in Sa-nur, Ganim, and Kadim\n* Settlement of Homesh being included in the initial order"}, {"id": "6d941960-6ed6-42c0-bf64-fe8f98ca8387", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27650/", "date": "2024-05-22 09:13", "message": "Palestinian channels: \"Minister Ben Gvir invaded Al-Aqsa a short time ago.\"", "location": "NULL", "classification": "security", "score": 0.7574115910538219, "event_breakdown": "Security Events:\n\n* Minister Ben Gvir invaded Al-Aqsa"}, {"id": "406ea98d-555c-4c3d-8816-4efc90710d20", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27649/", "date": "2024-05-22 09:12", "message": "Hamas: We welcome the recognition by Spain, Norway and Ireland, of a Palestinian state.\nThis is an important step on the way to establishing the rights of the Palestinian people.", "location": "GAZA CITY, Palestine", "classification": "security", "score": 0.8106988125897371, "event_breakdown": "1. Spain recognises a Palestinian state\n2. Norway recognises a Palestinian state\n3. Ireland recognises a Palestinian state"}, {"id": "c09a18f6-5e22-4155-aeee-c993a12d8aed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27646/", "date": "2024-05-22 09:12", "message": "Viewer discretion advised\n\nIran: Mansour Arazi, Khamenei's house bard (pictured, with the microphone), told media in Iran that the body of President Ebrahim Raisi was found at the scene of the helicopter crash, completely charred to the extent that it could not be washed before burial.\n\nIranian opposition sources attach a photo, from the video of the rescue forces' initial arrival at the crash site, in which they claim Raisi's charred body is visible.", "location": "Iran", "classification": "security", "score": 0.5486373141807072, "event_breakdown": "Security events:\n1. Helicopter crash in Iran, near Khamenei's house.\n2. Presence of rescue forces at the crash site.\n3. Presence of Ebrahim Raisi's charred body at the crash site.\n4. Claim that Raisi's body was visible in a video of rescue forces' initial arrival at the crash site."}, {"id": "607a2333-ae51-40ce-8f1c-77b1e62056bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27644/", "date": "2024-05-22 09:05", "message": "As expected, the Prime Ministers of Spain and Ireland also join the Prime Minister of Norway and announce the recognition of a Palestinian state as of May 28.", "location": "NULL", "classification": "security", "score": 0.5263661761341256, "event_breakdown": "Security Events:\n\n1. Recognition of a Palestinian state by the Prime Ministers of Spain and Ireland on May 28.\n\n2. Recognition of a Palestinian state by the Prime Minister of Norway on May 28."}, {"id": "bbe1a43c-048b-4fdc-8a2a-5037922318a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27641/", "date": "2024-05-22 07:21", "message": "IDF activity in Rafah\n\nAfter a night of aerial attacks, Palestinian channels identified as Hamas are reporting this morning that IDF forces have advanced westward towards the border between the Barazil and Yabneh neighborhoods, but have not yet crossed into the Yabneh neighborhood.\nAccording to the Palestinian reports, it is evident that the IDF has a good hold on the neighborhoods: Shokeh, Salam, Jneinah and Barazil.\n\nIt can be estimated that Yabneh and Shabura are next in line.", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.9300077232634886, "event_breakdown": "1. The IDF advanced westward towards the border between the Barazil and Yabneh neighborhoods in Rafah, Gaza.\n2. The IDF has not yet crossed into the Yabneh neighborhood.\n3. The IDF has a good hold on the Shokeh, Salam, Jneinah and Barazil neighborhoods.\n4. Yabneh and Shabura are next in line for the IDF."}, {"id": "a5349e49-0ddb-424f-86c1-93ac4baeb3f4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27637/", "date": "2024-05-22 07:16", "message": "How did the Gazans (and Israelis) benefit from the closure of the Rafah crossing?\n\nA brave Gazan recounts the \"miracle\" caused by the entry of goods from Israel:\n\nAccording to him, 55 trucks that entered from Israel (without the \"Hamas tax\") lowered the prices of goods in the markets immediately, something that the 700-1000 aid trucks that entered through the Rafah crossing daily in \"coordination\" between Egypt and Hamas (with a \"Hamas tax\") weren't able to do.\n\nOne can only guess just how much money Hamas was making from all these trucks coming in through the Rafah crossing each day.\n\nThe US exerted immense pressure to let these trucks in, and Israel repeatedly warned against it, saying that it was ineffective and that Hamas violently takes and hoards the aid the moment it enters.\n\nTaking over the Rafah crossing proved to be the most important action the IDF has taken to bring an end to the war closer. \n\nIt's a shame it didn't happen earlier. Hands off Rafah and all of that...", "location": "GAZA", "classification": "security", "score": 0.4676236046858012, "event_breakdown": "Events:\n\n* Closure of the Rafah crossing\n* Entry of 55 trucks from Israel\n* Entry of 700-1000 aid trucks through Rafah crossing daily\n* \"Hamas tax\" on aid trucks coming through Rafah crossing\n* US pressure to allow trucks to enter\n* Israel's warning against allowing trucks to enter\n* Hamas taking and hoarding aid upon entry\n* IDF taking over the Rafah crossing\n* IDF action against Hamas\n* Effect of IDF takeover of Rafah crossing on the Gaza war"}, {"id": "d293a963-13b5-4396-83fe-a473c1c33f51", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27636/", "date": "2024-05-22 07:14", "message": "Hossein al Sheikh, Secretary General of the PLO Working Committee (and designated to succeed Abu Mazen):\n\nThese are historic moments of the victory of the free world, truth and justice after decades of Palestinian national struggle, suffering, pain, occupation, racism, murder, oppression, abuse and destruction against the Palestinian people.\nThanks to the countries of the world that recognized a Palestinian state and thanks to those who will recognize it. This is the way to stability, security and peace in the region.\n\n##\nFatah and PLO reap the fruits of the 10/7 massacre committed by Hamas.", "location": "GAZA", "classification": "security", "score": 0.6948657784581503, "event_breakdown": "List of Security Events in the Text:\n1. The 10/7 massacre committed by Hamas\n2. Years of Palestinian national struggle\n3. Years of Palestinian suffering\n4. Years of Palestinian pain\n5. Years of Palestinian occupation\n6. Years of Palestinian occupation\n7. Years of Palestinian racism\n8. Years of Palestinian murder\n9. Years of Palestinian oppression\n10. Years of Palestinian abuse\n11. Years of Palestinian destruction against the Palestinian people."}, {"id": "c58a9d18-c58f-4ad3-9a01-e825bcc5ee86", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27635/", "date": "2024-05-22 07:12", "message": "Italy: Clashes between supporters of Israel and supporters of Hamas at the University of Milan.", "location": "MILANO", "classification": "security", "score": 0.844417815745525, "event_breakdown": "Title: Clashes between supporters of Israel and Hamas at the University of Milan\n\n1. Clashes between supporters of Israel and Hamas at the University of Milan.\n2. Demonstrations and protests form two groups.\n3. There were verbal clashes between the two groups."}, {"id": "65d8a88c-ff5d-4372-8302-b8a4275a34d5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27634/", "date": "2024-05-22 07:12", "message": "The British Guardian: Ireland and Spain decided to announce one after the other their plan to recognize a Palestinian state (Ireland will probably announce this today).\n\nReuters: The Prime Minister of Spain is expected to announce the recognition of a Palestinian state today.\n\nPrime Minister of Norway: Norway will recognize a Palestinian state starting on 28.5.24\n\n##\nThis is the biggest reward that the planners of the October 7th massacre could have hoped for.", "location": "Ramallah, Palestine", "classification": "security", "score": 0.4525753871803089, "event_breakdown": "Recognizing a Palestinian state\nIreland - 24.5.24\nSpain - 24.5.24\nNorway - 28.5.24"}, {"id": "d443b5d0-c37a-4e97-bd60-2f82cad62bba", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27633/", "date": "2024-05-22 07:09", "message": "The Palestinians report that Israel released 30 Gazans who were arrested during the war to the Strip today.\nThey were released to the Gaza Strip through the Kissufim crossing in the east of Khan Yunis in the south of the Gaza Strip (and not through the Kerem Shalom crossing as was done in the past).", "location": "GAZA STRIP", "classification": "security", "score": 0.920562642627257, "event_breakdown": "Security Events:\n\n1. 30 Palestinians arrested during the Gaza war by Israel are released to the Gaza Strip through the Kissufim crossing.\n2. The released Palestinians are held in the Khan Yunis area, a southern city in the Gaza Strip.\n3. The released Palestinians were released using a different crossing than the Kerem Shalom crossing, a change from previous releases."}, {"id": "ffb6a5ee-41c1-4dff-8b09-aa0a205e3b51", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27632/", "date": "2024-05-22 07:08", "message": "The supreme leader of Iran recites a eulogy over the coffins of the helicopter casualties.", "location": "TEHERAN, Iran", "classification": "security", "score": 0.8810191322525575, "event_breakdown": "Events:\n\n1. Helicopter Crash: A helicopter carrying high-ranking officials crashes resulting in casualties.\n2. Recitation of Eulogy: The supreme leader of Iran recites a eulogy over the coffins of the casualties.\n3. Security Presence: A high level of security presence is observed during the event.\n\nNote: It's important to note that without further context, it is difficult to determine if these were coordinated events or unrelated incidents."}, {"id": "720b665b-71e1-4640-bef3-64cc7f15820b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27631/", "date": "2024-05-22 07:08", "message": "Senior Hamas leader Osama Hamdan, who usually stays in Lebanon, also came to Raisi's funeral in Tehran.", "location": "TEHRAN", "classification": "security", "score": 0.8731330797568928, "event_breakdown": "Senior Hamas leader Osama Hamdan's trip to Iran for Raisi's funeral, in light of the security events related to Iran and Hamas."}, {"id": "ad3a4271-1e2e-47f5-a07d-bd9fce7e2417", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27629/", "date": "2024-05-22 07:05", "message": "IDF activity in Jenin has been going on for 24 hours straight.\nThe Palestinians report that the number of Palestinians killed has risen to 8 and the number of wounded has crossed 20.", "location": "JENin", "classification": "security", "score": 0.9169881912678728, "event_breakdown": "Security Events:\n\n* IDF activity in Jenin for 24 hours straight\n* Number of Palestinians killed rises to 8\n* Number of Palestinians wounded crossed 20\n\nAdditional Information:\n\n* IDF (Israel Defense Forces) is the military force of Israel\n* Jenin is a city in the northwestern West Bank that is located near the Green Line\n* West Bank is a landlocked territory near the Mediterranean coast of Western Asia"}, {"id": "d422e371-4f1a-414a-80a3-c50a949a62d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27628/", "date": "2024-05-22 07:04", "message": "The Palestinians report that the IDF dropped flyers this morning over Rafah in which they announced a significant expansion of the \"safe area\" to which the displaced can move. The old (smaller) area and the expansion announced by the IDF are highlighted on the map - the significant expansion includes almost the entire area of ​​the Khan Subdistrict Younis as far as Deir al-Balah, with a limited distance from Israel's border in the east.", "location": "RAFAH.", "classification": "security", "score": 0.7880611206025856, "event_breakdown": "Security events:\n- IDF dropped flyers over Rafah announcing expansion of safe area in Khan Subdistrict Younis.\n- IDF expanded safe area to include almost entire Khan Subdistrict Younis and Deir al-Balah."}, {"id": "68de018b-8e73-4f21-869a-48b39f27c36e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27681/", "date": "2024-05-22 17:10", "message": "The IDF spokesperson announced the death of three IDF soldiers in battles in the northern Gaza Strip.\n\nMay their memories be a blessing.", "location": ")\nGaza Strip", "classification": "security", "score": 0.9546058760544872, "event_breakdown": "Security Events:\n\n1. Battles in the northern Gaza Strip\n2. Death of three IDF soldiers in battles in the northern Gaza Strip"}, {"id": "f39a2d50-5957-4767-9c08-3286e5cabfbb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27653/", "date": "2024-05-22 09:23", "message": "Hezbollah announces two deaths in its ranks:\n\nAli Sultan\nMuhammad Bu Taa'm\n\nBoth residents of southern Lebanon, apparently killed in an IDF attack last night in Odaissah in southern Lebanon.\n\n313 dead for Hezbollah since the beginning of the war (a strong number among the Shiites).", "location": "Southern Lebanon", "classification": "security", "score": 0.9316215280408261, "event_breakdown": "Security Events:\n\n1. Two Hezbollah members, Ali Sultan and Muhammad Bu Taa'm, were killed in an IDF attack in Odaissah in southern Lebanon.\n2. Hezbollah announced that 313 of its members have died since the beginning of the war."}]