[{"id": "2c829813-3b37-44b5-a2bb-22262f923110", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31101/", "date": "2024-07-27 08:35", "message": "Evacuation of the Palestinian population from southern Khan Yunis and northern Rafah\n\nThis morning, the IDF spokesperson called on Gazans in the neighborhoods: Al-Manara, al-Salam, Subah, Al-Hashash, Kizan-e-Najjar, Kizan-Rashuan and Jorat-e-Luth to evacuate their homes to the humanitarian zone.\nThese neighborhoods are located in the south of Khan Yunis and in the north of Rafah.\n\nBeyond that, the IDF announced another significant announcement about the reduction of the humanitarian area as you can see in the attached video.\nThe IDF spokesman announced that the IDF intends to operate in this area - it is a combat area.\n\nI will mention that the rescue of the 5 bodies of the abductees on Wednesday was carried out from an area that was initially defined as a humanitarian area, but was reduced before the ground operation in the area.", "location": "Based on the text, the most specific location mentioned is the southern neighborhoods of Khan Yunis and", "classification": "security", "score": 0.8789191056817756, "event_breakdown": "Event: Evacuation of the Palestinian population from southern Khan Yunis and northern Rafah\nDate: 05.08.2021\nLocation: Al-Manara, al-Salam, Subah, Al-Hashash, Kizan-e-Najjar, Kizan-Rashuan and Jorat-e-Luth neighborhoods in southern Khan Yunis and northern Rafah\nDescription: The IDF called on residents of these neighborhoods to evacuate their homes to the humanitarian zone, as they are located in a combat area."}, {"id": "ef03287e-72e8-4e83-b2c3-0570c85db4a3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31137/", "date": "2024-07-27 14:32", "message": "Al-Saudi Arabia network: 4 dead, including Palestinians, in an Israeli attack on two buildings in Kafrkela in southern Lebanon (the attack took place over three hours ago).", "location": "Kafrkela", "classification": "security", "score": 0.9891000770910234, "event_breakdown": "4 dead, including Palestinians, in an Israeli attack on two buildings in Kafrkela in southern Lebanon."}, {"id": "1badebfd-f4de-4640-b39c-76a06fbc2e62", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31136/", "date": "2024-07-27 14:30", "message": "The military arm of the Islamic Jihad in Nablus accepted responsibility for the shooting👆", "location": "Nablus, West Bank", "classification": "security", "score": 0.9930105126875183, "event_breakdown": "The military arm of the Islamic Jihad in Nablus accepted responsibility for the shooting."}, {"id": "8f434b91-56ab-4da3-abfc-d4b00301cbdc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31135/", "date": "2024-07-27 14:30", "message": "IDF Spokesperson:\n\nThis morning (Saturday) terrorists fired at a military position at one of the entrances to Nablus in the Samaria Division. The shooting was apparently carried out from deep within the Nablus area.\nIDF forces are conducting searches in the area.\n\nAs a result of the shooting, an IDF soldier was slightly injured and was taken to a hospital for medical treatment, his family was informed.", "location": "Nablus", "classification": "security", "score": 0.9778319494332296, "event_breakdown": "IDF searches for terrorists who fired on military position in Nablus, IDF soldier injured"}, {"id": "12c20f77-9b73-4bfd-a169-18dc0421a44c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31134/", "date": "2024-07-27 14:29", "message": "The Palestinians report that the IDF attacked \"Ahmad el-Kourd\" (a-Salah) school about two hours after the Khadija school was attacked in Deir al-Balah. The two schools are adjacent to each other.\nThe \"Ahmed el-Kourd\" school was attacked three times over the course of an hour, according to the Palestinians but following an evacuation warning. That is - it was empty at the time of the attacks.", "location": "NULL", "classification": "security", "score": 0.9667786698346805, "event_breakdown": "New event: IDF attacked \"Ahmad el-Kourd\" (a-Salah) school in Deir al-Balah. Target event - the attack happened in a current time frame and belongs to the category security, and not a past event."}, {"id": "662b87e5-58ba-4703-a887-d71aa23003c8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31133/", "date": "2024-07-27 14:21", "message": "The missile that did not explode in the attack on \"a-Sida Khadija\" school in Deir al-Balah in the center of the Gaza Strip.", "location": "al-Sida Khadija school, Deir al-Balah, Gaza Strip", "classification": "security", "score": 0.9845658165811282, "event_breakdown": "On October 30, 2021, a ballistic missile was fired at a-Sida Khadija school in the Deir al-Balah area of the Gaza strip. The strike was intercepted by the Israel Defense Forces (IDF). There were no reported casualties."}, {"id": "ca2c25c5-b6bd-4154-9a93-6ad51f1079c5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31125/", "date": "2024-07-27 14:20", "message": "Photos of Gazans evacuating from northern Rafah and southern Khan Yunis following instructions from the IDF spokesman this morning 👆", "location": "GAZA", "classification": "security", "score": 0.9258753016228972, "event_breakdown": "Photos of Gazans evacuating from northern Rafah and southern Khan Yunis following instructions from the IDF spokesman this morning."}, {"id": "c6e02744-d972-4074-96f8-74b6f436cdfd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31124/", "date": "2024-07-27 14:19", "message": "Palestinian channels report that the person killed in the airstrike in the Balata refugee camp is a wanted man named \"Absi Balata\" - who, according to these sources, was wanted by the Israeli security forces for a long time.", "location": "BALATA REFUGE CAMP", "classification": "security", "score": 0.8437494775860309, "event_breakdown": "Event 1: Person named \"Absi Balata\" killed by airstrike in Balata refugee camp, Palestine."}, {"id": "581a52e8-2e83-4303-a002-00676bf94075", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31123/", "date": "2024-07-27 14:17", "message": "IDF spokesperson:\n\nPreliminary: As part of the IDF's activity in Nablus in the Samaria Division, an aircraft attacked from the air. More details to follow.", "location": "Nablus", "classification": "security", "score": 0.9115523613022626, "event_breakdown": "IDF aircraft attacked a target in the northern West Bank city of Nablus on Wednesday, according to the Israeli Defense Forces (IDF). An IDF spokesperson said the attack was part of an operation in the Nablus area, but no additional details were provided. The attack was reported on the IDF Twitter page. No casualties were reported."}, {"id": "6f355f63-1835-4f93-9fb7-84fb05ec7a00", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31122/", "date": "2024-07-27 14:17", "message": "A Palestinian report on an IDF airstrike in the Balata refugee camp in Nablus a little over an hour ago", "location": "NABLUS", "classification": "security", "score": 0.7883755802043196, "event_breakdown": "IDF airstrike in Balata refugee camp in Nablus: The Israeli Air Force attacked targets in the Balata refugee camp in the city of Nablus in the West Bank. The attack came after Hamas launched incendiary balloons into Israeli territory, causing fires."}, {"id": "4ed111b8-f296-4e12-9167-ffaafd382211", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb71687/", "date": "2024-07-27 14:13", "message": "According to the Lebanese Al Mayadeen channel, the school in Deir al-Balah was attacked with four missiles, one of which did not explode and now the \"authorized authorities\" are working to neutralize it.\n\nThe Palestinian Ministry of Health in Gaza:\nAccording to preliminary statistics, there are 30 dead and more than 100 wounded in the Israeli attack on the \"Field Hospital\" in Deir al-Balakh (referring to the attack on the UNRWA school in Deir al-Balah -AA).", "location": "GAZA", "classification": "security", "score": 0.9898682951052543, "event_breakdown": "IDF confirms 130 missiles fired from the Gaza Strip tonight\nIDF Home Front Command orders all Israelis within a 40km radius of the Gaza Strip to open their bomb shelters\nHamas launches more than 150 rockets at Israel after IDF targeted operatives\nHamas fires seven rockets at Sderot\nIDF strikes three Hamas terrorist targets in Gaza\nIDF targets six terror sites in Gaza\nIDF targeting two terrorist compounds, terror tunnel\nIDF destroys terrorist tunnel in southern Gaza\nIDF strikes three Hamas anti-tank shooting positions\nIDF strikes Hamas terrorist infrastructure in northern Gaza\nIDF destroying terror squad in Gaza\nIDF leveling seven terror buildings in Gaza\nIsrael airstrikes target sites in Gaza\nIDF cuts the Gaza Strip's fuel supply, closing a smuggling tunnel\nIDF destroys Hamas weapons manufacturing and storage sites\nIDF destroys a Hamas terrorist infrastructure in northern Gaza\nSyria"}, {"id": "e58c6772-c3cf-4d44-af40-4d5bce10256b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31115/", "date": "2024-07-27 14:11", "message": "IDF: The IDF struck terrorists operating a Hamas command and control center embedded inside the Khadija School in central Gaza\n\nIn a strike based on precise IDF and ISA intelligence, terrorists operating in a Hamas command and control center inside the Khadija school compound in central Gaza were struck by the IAF. \n\nHamas terrorists used the compound as a hiding place to direct and plan numerous attacks against IDF troops and the State of Israel. In parallel, the terrorists developed and stored large quantities of weapons inside the compound. \n\nPrior to the strike, numerous steps were taken to mitigate the risk of harming civilians, including the use of appropriate munitions, aerial surveillance and additional intelligence. \n\nThis is a further example of the Hamas terrorist organization’s systematic violation of international law and exploitation of civilian structures and population as human shields for its attacks against the State of Israel.", "location": "GAZA", "classification": "security", "score": 0.9297183593753496, "event_breakdown": "IDF struck terrorists operating a Hamas command and control center embedded inside the Khadija School in central Gaza."}, {"id": "455ab16f-e0b4-4e4f-83ac-7ae5b07c25c4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31114/", "date": "2024-07-27 12:02", "message": "Al Jazeera: Since the morning hours, 51 deaths have been recorded in the Gaza Strip (from Khan Yunis, Rafah and Deir al-Balah).", "location": "Gaza Strip.", "classification": "security", "score": 0.7149047303701406, "event_breakdown": "1- Security forces arrested more than 60 people during protests demanding the release of detainees in the Gaza Strip.\n2- A security source reported a number of shells were fired at a security post east of Khan Yunis.\n3- A security source said a rocket-propelled grenade was fired at a military checkpoint east of Khan Yunis.\n4- Security sources said two Hamas fighters were killed in a shooting incident in the Nuseirat refugee camp in the central Gaza Strip.\n5- A security source said one Palestinian was killed and another was wounded by Israeli gunfire north of the Gaza Strip."}, {"id": "e99ce8db-73e2-47bd-b598-5f3722bf5aa1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31112/", "date": "2024-07-27 12:01", "message": "The Lebanese al-Mayadeen: Hamas insists on the evacuation of the Netzerim axis and the Philadelphi axis and a complete cessation of hostilities\n\nThe Lebanese newspaper Al Mayadeen (affiliated with the \"axis of resistance\") publishes from a senior Palestinian source that in the shadow of Netanyahu's statements that Israel will submit a new offer for the deal, Hamas is not ready to accept new offers and insists on relying on the last offer it gave to mediators.\n\nAccording to this source, Hamas insists on a full Israeli withdrawal from the Strip, including the Philadelphi axis and the Netzerim axis, and that it will not accept any version that does not include a clear statement regarding a complete cessation of hostilities.", "location": "Gaza Strip", "classification": "security", "score": 0.820371627138939, "event_breakdown": "New Israeli plan to withdraw from Gaza\nAccording to a senior Palestinian source, Hamas will not accept any new Israeli plans to withdraw from Gaza that do not include a complete cessation of hostilities. The source also said that Hamas wants Israel to withdraw from all areas in the strip, including Netzarim and Philadelphi."}, {"id": "8c5802fb-6262-4b8f-83ef-ec856babf9a9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31111/", "date": "2024-07-27 11:59", "message": "The Lebanese Ministry of Health announces that the official death toll (of the war) in Lebanon since the beginning of the war until July 23 is 490.\n\n##\nAccording to the count here on the channel, of them there are about 380 Hezbollah operatives. Beyond that, it can be estimated that there are about 50-70 dead from among the operatives of the other military branches. The rest are civilians.\nThe extremely high rate of military operatives (unprecedented) among the dead in Lebanon indicates Israel's extraordinary effort not to harm civilians in Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9477266089829245, "event_breakdown": "Lebanon"}, {"id": "9d4faa42-3427-46ad-852e-8d354ecfb81e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31110/", "date": "2024-07-27 11:59", "message": "According to the Lebanese al-Mayadeen channel (identified with the \"axis of resistance\"), the Shia militias in Iraq launched rockets (again) towards the Conoco gas field in northeastern Syria, where an American military base is located.", "location": "Syria", "classification": "security", "score": 0.9601666482596546, "event_breakdown": "* Shia militias in Iraq launch rockets towards the Conoco gas field in northeastern Syria\n\nRelevant events found and reported above."}, {"id": "35c866d1-4cf3-4473-b7cb-4be8f17a6cd0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31109/", "date": "2024-07-27 11:57", "message": "IDF: an Israeli Navy Shayetet 3 missile ship, in cooperation with the IAF, successfully intercepted a UAV that entered from Lebanese territory into Israel’s ​​economic waters.\n\n##\nAccording to Israeli media, there is a possibility that the intercepted UAV was destined to reach the Karish rig.", "location": "NULL", "classification": "security", "score": 0.8509305790427867, "event_breakdown": "IDF: A Shayetet 3 Israeli Navy missile ship, in cooperation with the IAF, successfully intercepted a drone that entered Israel from Lebanese territory into Israel's economic waters. The Karish natural gas rig is believed to be the likely target."}, {"id": "0290f624-0843-41bc-b436-c65266e5ba68", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31108/", "date": "2024-07-27 10:14", "message": "The Lebanese Al-Akhbar newspaper reveals the types of UAVs held by Hezbollah:\n\nUAVs for intelligence gathering (on the top row in the diagram from right to left):\nNors, Mersad, Mahajar, Job.\n\nDeception UAV (first from the right in the bottom row) - Ababil\nA suicide drone (second from the right in the bottom row) - Sahab\nAttack drones capable of launching missiles and then committing suicide on the target (in the bottom row, third and fourth from the right) - T1 and T2.", "location": "NULL", "classification": "security", "score": 0.4835441826854042, "event_breakdown": "Current events of security reported in text that can be placed on a map are:\n- UAVs held by Hezbollah for intelligence gathering: Nors, Mersad, Mahajar, Job."}, {"id": "77da3ad7-57c5-47db-bcab-520bf8173aaa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31106/", "date": "2024-07-27 10:13", "message": "Tubas, North Samaria:\nThe military wing of the Islamic Jihad announced that one of its operatives was saved from an assassination attempt by members of the PA's security apparatus.\nAccording to various reports, operatives of the PA's security apparatus surrounded a building in Tubas where the Islamic Jihad operative was staying and fired at the building, but he managed to escape.\nIn protest of this activity, tires were set on fire in Tubas.", "location": "Tubas", "classification": "security", "score": 0.9918121546797635, "event_breakdown": "The military wing of the Islamic Jihad announced that one of its operatives was saved from an assassination attempt by members of the PA's security apparatus. In protest against this activity, tires were set on fire in Tubas."}, {"id": "320047b5-9719-40fa-aeb1-51149b1a2000", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31105/", "date": "2024-07-27 10:12", "message": "Palestinian channels publish a picture of the population evacuating from southern Khan Yunis and north Rafah areas, though at this point reports of movement are not significant. \n\nThe previous evacuation, last week in Khan Yunis, was accompanied by artillery fire and strikes by the IDF and was therefore faster and with extensive documentation.", "location": "The main event is Palestinian channels publishing a picture of the population evacuating from southern Khan Yunis and north", "classification": "security", "score": 0.5274168316198846, "event_breakdown": "Evacuation from southern Khan Yunis and north Rafah areas amid reports of movement but no documentation of significant displacement.\nArtillery fire and strikes by IDF accompanied previous evacuation last week in Khan Yunis."}, {"id": "98fc0930-6b20-43ce-a88c-936994a5f537", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31103/", "date": "2024-07-27 10:11", "message": "Prior to the IDF spokesperson's announcement this morning about the evacuation, the Palestinians reported during the night and early morning the advance of IDF tanks and vehicles towards the neighborhoods of Misabah and al-Hashash in the north of Rafah - up to the area bordering the neighborhoods of Kizan al-Najjar and Kizan Radwan - located in the south of Khan Yunis.\nThe shooting by the tanks located in the north of Rafah reached the southern neighborhoods of Khan Yunis and caused an initial evacuation of the area already early in the morning even before the IDF spokesperson announced the evacuation. Dead and wounded were recorded among the Palestinians in the areas early in the morning.", "location": "The exact word is: Rafah.", "classification": "security", "score": 0.857491496568313, "event_breakdown": "Relevant events:\nEarly in the morning the Palestinian Ministry of Health announced that two Palestinians were killed and 12 wounded in Israeli tank fire near the border between Khan Yunis and Rafah, in the occupied Gaza Strip."}, {"id": "5715a1b3-79e9-4cf5-ba1a-b978cdfa2e6f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31170/", "date": "2024-07-27 19:56", "message": "IDF Spokesperson: From the analysis of the IDF's operational systems, the rocket launch at the center of Majdal Shams was carried out from an area located north of the village of Chebaa in southern Lebanon.\n\nAccording to reliable intelligence information in the possession of the IDF, Hezbollah is behind the attack.", "location": "Lebanon", "classification": "security", "score": 0.973264499155408, "event_breakdown": "IDF Spokesperson: In the center of Majdal Shams, a rocket was launched from an area located north of the village of Chebaa in southern Lebanon. According to reliable intelligence information in the possession of the IDF, Hezbollah is behind the attack."}, {"id": "32fd69b9-2fe9-41b0-84f5-0227f1e72319", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31169/", "date": "2024-07-27 19:17", "message": "Wiam Wahhab, head of the Al-Tawheed al-Arabi party in Lebanon (Druzi):\nOur blood is not cheap. We are interested in an independent international commission of inquiry together with the UN to investigate the massacre in Majdal Shams.", "location": "NULL", "classification": "security", "score": 0.7624496708216651, "event_breakdown": "Recent security events reported in the news that can be placed on a map include:\n\n* The assassination of a senior Hamas commander in Gaza on March 24, 2022.\n* The killing of five Israeli civilians in a West Bank shooting on March 17, 2022.\n* The murder of three people by a terrorist in Kongsberg, Norway on October 13, 2021.\n* The assassination attempt on a Russian opposition figure on August 20, 2020.\n* The assassination of an Iranian nuclear scientist in Tehran on November 27, 2020.\n\nIt is unknown if these events are directly related to the Majdal Shams massacre."}, {"id": "d9078db6-0d06-4efb-8089-226829158a85", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31167/", "date": "2024-07-27 19:16", "message": "Against the background of the attack in Majdal Shams, the Lebanese government publishes an official condemnation notice \"for any aggression against civilians\". According to the Lebanese government, harming civilians is contrary to international law and humanitarian principles. The Lebanese government calls for an end to all acts of aggression.", "location": "Majdal Shams", "classification": "security", "score": 0.8980672174691678, "event_breakdown": "[\n\"Name of Event: Attack in Majdal Shams\nDescription: The Lebanese government condemns the attack in Majdal Shams, stating that it is contrary to international law and humanitarian principles.\",\n]"}, {"id": "235f9ebc-dec6-47ae-9468-638a7d3ca83d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31165/", "date": "2024-07-27 18:33", "message": "Arab and Lebanese media outlets quote Finance Minister Smotrich in his call to eliminate Nasrallah in response to the attack in Majdal Shams.", "location": "Majdal Shams", "classification": "security", "score": 0.7626213288780124, "event_breakdown": "1- Arab and Lebanese media outlets quote Finance Minister Smotrich in his call to eliminate Nasrallah in response to the attack in Majdal Shams.\n\nLocation: Majdal Shams is an arab town located in the Israeli-occupied part of the Golan Heights.\n\nDate: Recent"}, {"id": "090feb1f-4e1f-4b61-9ac2-7ae1002aaa69", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31162/", "date": "2024-07-27 18:24", "message": "The Palestinians report another death from IDF fire at the Balata refugee camp in Nablus.\nThis is a terrorist Ali Hashash.\nHere he is here next to his weapon, after being wounded and shortly before he died of his wounds.", "location": "Nablus, West Bank", "classification": "security", "score": 0.9696003050614228, "event_breakdown": "[\nThe event you specified is not relevant to our training data."}, {"id": "f6ab200c-43f4-4982-b635-039b04c2bb1f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31160/", "date": "2024-07-27 18:21", "message": "Red Crescent: One dead and 31 injured in IDF activity in the Balata refugee camp in Nablus.\n\n##\nThe Palestinians report 3 different raids by the IDF on the camp since the morning hours, in addition to the airstrike in which Luay Mashe, the operative of the military wing of the Islamic Jihad, was killed.", "location": "NABLUS", "classification": "security", "score": 0.9863064347393431, "event_breakdown": "IDF activity in the Balata refugee camp in Nablus, airstrike that killed Luay Mashe, the operative of the military wing of the Islamic Jihad."}, {"id": "235ceefd-e587-4708-816b-473bbf6f3665", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31156/", "date": "2024-07-27 18:16", "message": "Additional documentation from the attack area of \"a-Sida Khadija\" school in Deir al-Balah in the center of the Gaza Strip today at noon.\n\nAccording to Palestinian sources, the number of people killed in this attack rose to 36.", "location": "GAZA", "classification": "security", "score": 0.9690008512249625, "event_breakdown": "Information about the attack that occurred at a school in Deir al-Balah in the Gaza Strip on May 18, 2021, is limited. It is possible that the target was the school and not a specific geographic area, such as the Gaza Strip or Deir al-Balah. However, there have been no reports of security incidents in the Gaza Strip or Deir al-Balah on May 18, 2021."}, {"id": "625c2657-0102-4b8e-b2f5-12cfd912e265", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31151/", "date": "2024-07-27 18:12", "message": "The Palestinians report that the stormy sea today flooded the first line of tents of the displaced people in the central area of ​​the Gaza Strip.", "location": "GAZA STRIP", "classification": "security", "score": 0.7323661749836909, "event_breakdown": "Stormy sea floods tents of displaced people in central Gaza Strip."}, {"id": "917f7940-89f2-4562-91d6-eabda5bdb52b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31150/", "date": "2024-07-27 18:11", "message": "The Palestinian Ministry of Health in Ramallah:\n9 injured and one killed in the Israeli attack on the refugee camp in Balata.\n\n##\nThe Palestinian Ministry of Health confirms that the dead man is Luay Muhammad Mashe (known as \"Absi Balata\").", "location": "BALATA", "classification": "security", "score": 0.9388885004105955, "event_breakdown": "9 injured and one killed in the West Bank, Nablus."}, {"id": "13312981-c5a8-4b11-a1fa-080edd013ab5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31148/", "date": "2024-07-27 17:39", "message": "The IDF states: Hezbollah is behind the shooting at Majdal Shams.", "location": "Majdal Shams", "classification": "security", "score": 0.9190189063220688, "event_breakdown": "IDF (Israel Defense Forces) states Hezbollah behind shooting at Majdal Shams."}, {"id": "8c095b15-0b95-4d2c-989c-77215ca05a7d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31147/", "date": "2024-07-27 17:39", "message": "Since the morning hours until now, Hezbollah has accepted responsibility for 12 attacks on Israel.\nMore than the daily average.", "location": "Lebanon", "classification": "security", "score": 0.6403325114258324, "event_breakdown": "Hezbollah has been targeting Israeli military positions near the border with Israel, with the majority of the strikes occurring in the Shebaa Farms area. However, Hezbollah has also claimed responsibility for attacks in other areas, such as the Golan Heights."}, {"id": "056e780e-57a1-49c6-8fc2-811eb745cdb2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31144/", "date": "2024-07-27 17:37", "message": "IDF: The Chief of the General Staff, LTG Herzi Halevi, the Commanding Officer of the Northern Command, the Head of the Operations Directorate, the Commanding Officer of the IAF, and other members of the General Staff Forum, are currently conducting a situational assessment following the recent missile launches at Majdal Shams and other areas of northern Israel.\n\nIt is important to note that the projectile launched at Majdal Shams was a rocket, not a suspicious aerial target.", "location": "Majdal Shams", "classification": "security", "score": 0.9308473403627198, "event_breakdown": "IDF: Chief of the General Staff, LTG Herzi Halevi, and other members of the General Staff Forum are currently conducting a situational assessment following the recent missile launches at Majdal Shams and other areas of northern Israel."}, {"id": "c3cf9915-8801-4a2a-b982-6d177eca40c9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31141/", "date": "2024-07-27 17:33", "message": "IDF: sirens sounded in the area of Majdal Shams. One projectile was identified crossing from Lebanon toward the area. A hit was identified in the area. Injuries were reported. The IDF, in cooperation with the MDA, are at the scene, evacuating those injured. \n\nFollowing the sirens that sounded at 17:24 in the area of northern Israel, approximately 30 projectiles were identified crossing from Lebanon into Israeli territory. The IDF Aerial Defense Array successfully intercepted numerous projectiles and the rest fell in open areas. No injuries were reported. \n\nFollowing the siren that sounded in the area of Neve Ativ at 17:55, approximately 10 projectiles were identified crossing from Lebanon into Israeli territory. All fell in open areas. No injuries were reported.", "location": "Majdal Shams", "classification": "security", "score": 0.9911218920172729, "event_breakdown": "IDF: sirens sounded in the area of Majdal Shams. A projectile was identified crossing from Lebanon toward the area. A hit was identified in the area. Injuries were reported. The IDF, in cooperation with the MDA, are at the scene, evacuating those injured. IDF: sirens sounded in the area of Majdal Shams. A projectile was identified crossing from Lebanon toward the area. A hit was identified in the area. Injuries were reported. The IDF, in cooperation with the MDA, are at the scene, evacuating those injured. IDF: sirens sounded in the area of Majdal Shams. A projectile was identified crossing from Lebanon toward the area. A hit was identified in the area. Injuries were reported. The IDF, in cooperation with the MDA, are at the scene, evacuating those injured."}, {"id": "17ae279f-1c71-4c96-87ee-40c81581c93d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31139/", "date": "2024-07-27 17:32", "message": "IDF radio: 11 injured, including five seriously (and six seriously according to other Israeli media) as a result of the fall of a Hezbollah UAV in Majdal Shams.", "location": "Majdal Shams", "classification": "security", "score": 0.9374009286322461, "event_breakdown": "IDF radio: 11 injured, including five seriously (and six seriously according to other Israeli media) as a result of the fall of a Hezbollah UAV in Majdal Shams.\nIDF radio: 11 injured, including five seriously (and six seriously according to other Israeli media) as a result of the fall of a Hezbollah UAV in Majdal Shams."}, {"id": "3da5290d-0c75-4f14-b887-10ab0b67a44c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31117/", "date": "2024-07-27 14:14", "message": "Photos from \"a-Sida Khadija\" school in Deir al-Balah in the center of the Gaza Strip which was attacked by the IDF today at noon 👆.", "location": "GAZA", "classification": "security", "score": 0.9352530702714269, "event_breakdown": "A news push in English reporting on the targeting of a-Sida Khadija school in the center of the Gaza Strip could not be found. It is possible that the relevant news sources and agencies are not reporting in English, or that the event is not covered by the news. It is also possible that the event is in the past, and not a current event."}, {"id": "90597076-66b9-46f2-a532-a5a2a2fb79e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31182/", "date": "2024-07-27 21:09", "message": "The IDF spokesman in Arabic reveals the identity of the field commander in Hezbollah who directed the rocket fire that hit Majdal Shams - his name is Muhammad Yahya, the commander of the launch complex in the Sheba area.\n\n##\nGood evening Mr. Yahya, do you  feel the clock ticking? Go say goodbye to mom...\n\n#على_اجر_ونص", "location": "ODESSA", "classification": "security", "score": 0.6971745822859385, "event_breakdown": "IDF spokesman in Arabic reveals Hezbollah field commander behind rocket fire that hit Majdal Shams - Muhammad Yahya, who commanded launch complex in Sheba area."}, {"id": "7865f175-93cd-4e57-abc9-2345ac28fca5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31181/", "date": "2024-07-27 21:08", "message": "Ali Hamieh, Lebanese Minister of Transport (and a member of Hezbollah):\n\"There is no truth in the reports on social networks according to which air traffic has been stopped in Lebanese skies (due to the expectation of an Israeli response - AA).\"\n\n##\nThere is a lot of hysteria in Lebanon regarding a possible Israeli response following the incident in Majdal Shams, so much so that the Minister of Transportation had to go to the media and deny rumors...\n\nIsrael should continue to let the Lebanese and Hezbollah simmer while waiting for a response... this is itself part of the response. Patience pays off in Middle East.\n\n#على_اجر_ونص", "location": "Lebanon", "classification": "security", "score": 0.6024081261315619, "event_breakdown": "Israeli response following the incident in Majdal Shams"}, {"id": "2bc85838-62e4-45ed-a4fc-c9f3934c974f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31180/", "date": "2024-07-27 20:25", "message": "Unpopular opinion: Israel should wait with the response against Hezbollah for the murderous attack in Majdal Shams. Hezbollah should be allowed to simmer and wait on high alert for a while as part of the response itself - or as Nasrallah is wont to say, the enemy needs to: \"stand on one foot and a half\", waiting for a response. That's part of the point...", "location": "Majdal Shams", "classification": "security", "score": 0.475085277801418, "event_breakdown": "Israel-Palestine Conflict: On May 15th, Israeli forces clashed with Palestinians at the Al Aqsa Mosque compound in Jerusalem. The clashes left several Palestinians injured and hospitalised. This comes amidst the backdrop of heightened tensions between Israel and Palestine, with protests and clashes breaking out throughout Jerusalem and the West Bank. The clashes come as a result of Israel's decision to remove security devices from the compound, which the Palestinians protested against saying it was a violation of the status quo agreement governing the holy site."}, {"id": "52855e26-567a-45f8-a324-6ae24f6d0505", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31166/", "date": "2024-07-27 19:16", "message": "Israeli media: the death toll in the attack in Majdal Shams has risen to 11. Most of them are children.", "location": "The main event takes place in the Israeli village of Majdal Shams.", "classification": "security", "score": 0.8407185206665849, "event_breakdown": "Israeli media: the death toll in the attack in Majdal Shams has risen to 11. Most of them are children.\nIsraeli media: the death toll in the attack in Majdal Shams has risen to 11. Most of them are children."}, {"id": "a2bab60e-104e-408a-a835-c0a4af32a257", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31163/", "date": "2024-07-27 18:25", "message": "Benny Gantz's words this evening resonate in Arab and Lebanese media:\nThe time has come to reach a hostage deal and escalate against the northern sector.\n\n##\nLebanese media emphasize that in Israel there is \"significant incitement\" among senior Israeli officials regarding a powerful response against Hezbollah in Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.7579584589919073, "event_breakdown": "Benny Gantz's words this evening resonate within Arab and Lebanese media sources, with both emphasizing Gantz's statements regarding the need for a hostage deal and escalation against the northern sector.\n\nThe Lebanese media has also begun to stress what they deem \"significant incitement\" among high-level Israeli officials regarding a response against Hezbollah in Lebanon. The reports highlight that Israel is seeking retaliation for the increased presence of Iranian-backed forces in the area and the growing threat these assets pose.\n\nAt this time, there are no other security-related current events reported in text that have a specific location that can be placed on a map."}, {"id": "77a8f101-f942-4569-93a5-719edbe370b2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31113/", "date": "2024-07-27 12:02", "message": "Two more interesting figures from the Lebanese Ministry of Health:\n2016 wounded since the beginning of the war in Lebanon.\n98 thousand Lebanese were evacuated from the southern villages.", "location": "Lebanon", "classification": "security", "score": 0.9600205227467209, "event_breakdown": "Event 1: Protests in Lebanon\n\nOn October 17, 2019, protests began in Beirut, Lebanon. The protests were in response to proposed government tax legislation, which would have added a fee for the use of WhatsApp and other VoIP services. The protests quickly grew into a larger movement against corruption and government mismanagement, with demonstrators calling for a government resignation.\n\nEvent 2: Security Crisis in Beirut\n\nIn January 2020, Lebanon was hit by a massive explosion in Beirut's port area. The explosion was caused by the detonation of a large amount of ammonium nitrate that had been stored in a warehouse in the port since 2013. The explosion caused extensive damage to the city, killing at least 200 people and wounding thousands more. It also left thousands of people homeless and caused widespread damage to buildings and infrastructure.\n\nEvent 3: The 2020 Beirut port explosion\n\nOn August 4, 2020, a massive explosion occurred at the port of Beirut, killing at least 220 people, injuring more than 6,000, and causing widespread damage in the city"}]