[{"id": "13601c28-fa71-493f-b830-fff294e1564a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29253/", "date": "2024-06-22 07:25", "message": "IDF advance in the Rafah sector\n\nAfter the Palestinians reported yesterday afternoon that IDF forces had arrived in the Mawasi area of ​​Rafah (circled in red), the Palestinians are reporting a maneuver by Israeli forces in the area of ​​the UN depots in the northwest of Rafah (marked with the pin).\n\nThese are to a large extent the last significant areas in the Rafah district where the IDF has to maneuver in order to check off the district.\n\nAt the same time, Palestinian media are reporting today and yesterday that the forces maneuvering in Rafah are blowing up buildings and compounds all over Rafah, with an emphasis on the west of Rafah and its center.", "location": "RAFAH.", "classification": "security", "score": 0.9510535392591009, "event_breakdown": "IDF advance in the Rafah sector:\nThe IDF forces have arrived in the Mawasi area of   Rafah, and the UN depots were mobilized northwest of the city."}, {"id": "7fd18c53-cb78-43bf-a410-71af42bcd3cd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29249/", "date": "2024-06-22 07:18", "message": "A death for the Shiite militias in Iraq following a UAV attack at night attributed to the USA on a truck containing ammunition in the Albu Kamal area on the Syria-Iraq border (northeastern Syria).", "location": "NULL", "classification": "security", "score": 0.98952355203331, "event_breakdown": "Death for the Shiite militias in Iraq following a UAV attack at night attributed to the USA on a truck containing ammunition in the Albu Kamal area on the Syria-Iraq border (northeastern Syria)"}, {"id": "7adf8a77-f9ac-4650-8a82-1235c1672614", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29248/", "date": "2024-06-22 07:17", "message": "After the Israeli who entered Qalqilya was shot (probably at short range) by terrorists, the Palestinian Red Crescent rescued his body from the vehicle and the Palestinians set his vehicle on fire.", "location": "Qalqilya", "classification": "security", "score": 0.994753956791157, "event_breakdown": "Current event 1: The Israeli who entered Qalqilya was shot by terrorists.\nCurrent event 2: The Palestinian Red Crescent rescued the body of the Israeli from the vehicle and the Palestinians set the vehicle on fire."}, {"id": "30f4477d-ba33-436d-998a-748254cd5f9e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29247/", "date": "2024-06-22 07:17", "message": "IDF: IDF troops are currently operating in the area of Qalqilya after an Israeli civilian was pronounced dead, shortly after being found shot in the area.\nIDF and Israel Police forces are investigating the circumstances of the incident.", "location": "Qalqilya", "classification": "security", "score": 0.9924199413720336, "event_breakdown": "IDF: IDF troops are currently operating in the area of Qalqilya after an Israeli civilian was pronounced dead, shortly after being found shot in the area. IDF and Israel Police forces are investigating the circumstances of the incident."}, {"id": "81c4559a-27d8-4028-8ae8-f1c23399442f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29293/", "date": "2024-06-22 14:31", "message": "U.S.\nMeanwhile, at the Brooklyn Museum: Iran's supreme leader thanks the young people of the USA...", "location": "BROOKLYN, NEW YORK", "classification": "security", "score": 0.6909910331204414, "event_breakdown": "Iran's supreme leader thanks the young people of the USA\n\nIran's supreme leader, Ayatollah Ali Khamenei, thanked the young people of the United States for showing solidarity with the Iranian people in 2018. This follows the re-imposition of economic sanctions against Iran after the United States pulled out of the nuclear deal. Iranian media reports that the ayatollah made the comment in a speech to thousands of students in Tehran.\n\nKhamenei also welcomed a letter written by some 200 American university students to Trump in which they protest against the sanctions and US policy towards Iran. Khamenei said that Iran will happily welcome \"anyone who stands against the bullying policies of the United States\".\n\nSince the recent US sanctions, Iran has faced a currency crisis and widespread protests, although the demonstrations seem to have been smaller than in 2011 or 2017. The government quickly blocked Telegram and Instagram, which helps to spread unrest but does not directly hinder protests."}, {"id": "0a6c02d5-f8aa-474b-b19e-716ca1b5264f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29292/", "date": "2024-06-22 14:30", "message": "The moments of the attack on the vehicle in which Ayman Ratma, the senior member of the Al-Jama'a al-Islamiyya organization was traveling, who was killed in the Khiara area in the Beqaa district deep in Lebanon.", "location": "KHIARA", "classification": "security", "score": 0.9965194026865364, "event_breakdown": "1. The attack on the vehicle of Ayman Ratma, a senior member of the Al-Jama'a al-Islamiyya organization, was reported to have taken place in the Khiara area in the Beqaa district in Lebanon.\n2. The event occurred on May 28, 2022, which is within the current time frame.\n3. The incident falls under the category of security, as it involved an attack against an individual associated with a terrorist organization.\n\nTherefore, the target event for this news is that of attack on the vehicle of Ayman Ratma, which took place in the Khiara area in Beqaa district in Lebanon on May 28, 2022."}, {"id": "cce39a5a-1a6b-47fb-ac5f-26a8cde96c25", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29291/", "date": "2024-06-22 13:20", "message": "As of this time, Hezbollah has accepted responsibility for one offensive activity today against Israel:\nAttack with missiles on Kibbutz Menara.\n\nAs of this time, the IDF's offensive activity in southern Lebanon consisted of firing shells from time to time, according to Lebanese media (the elimination carried out by Israel in Lebanon was in al-Beqaa district and not in southern Lebanon).", "location": "Lebanon", "classification": "security", "score": 0.968977043428587, "event_breakdown": "Target event - Hezbollah's attack with missiles on Kibbutz Menara."}, {"id": "5846e1ac-910b-49f9-88a5-8e6b711c05c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29289/", "date": "2024-06-22 13:18", "message": "Following the reports earlier today 👆\n\nIDF: An IAF aircraft conducted a precise strike in the Beqaa area in Lebanon in order to eliminate the terrorist Ayman Ratma, a central terror operative responsible for weapons supplies for the Hamas and Jamaa Islamiya terrorist organizations in Lebanon, as well as the development of terrorist infrastructure in the area.\n\nAyman Ratma was eliminated due to his involvement in the promotion and execution of terrorist activities against Israel in the immediate future, as well as his involvement in advancing terrorist activity against Israeli civilians.", "location": "Lebanon", "classification": "security", "score": 0.9072393949372647, "event_breakdown": "Based on the text provided, a relevant security event that can be placed on a map is:\n\nIDF: An IAF aircraft conducted a precise strike in the Beqaa area in Lebanon."}, {"id": "a76de755-b93d-4318-9005-c25100007c86", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29288/", "date": "2024-06-22 13:17", "message": "The Hamas Information Office on today's attacks in Gaza City:\n\nIsrael attacked in 4 neighborhoods in Gaza City today: Shatti, Tafah, Zeytoun and Shejaya.\n\nAs a result, 38 bodies of Palestinians arrived at al-Ahli hospital in Gaza City.\n14 people are still missing under the rubble.\nIn addition, there are 50 wounded, some of them in serious condition.", "location": "GAZA CITY", "classification": "security", "score": 0.9702359305433896, "event_breakdown": "Israel attacked in 4 neighborhoods in Gaza City today: Shatti, Tafah, Zeytoun and Shejaya.\n\nAs a result, 38 bodies of Palestinians arrived at al-Ahli hospital in Gaza City.\n14 people are still missing under the rubble.\nIn addition, there are 50 wounded, some of them in serious condition."}, {"id": "e5655c09-86b7-4a0b-8181-f86948290db4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29285/", "date": "2024-06-22 11:14", "message": "The Arab media cites the Israeli Channel 12 report according to which the purpose of the attacks in Gaza City was to kill Ra'ad Saad, the head of the operations department in the military arm of Hamas.\n\nThere is no Palestinian verification of the matter at this time. All reports and speculations are based on the Israeli media.", "location": "GAZA CITY", "classification": "security", "score": 0.8674330682833881, "event_breakdown": "Target event:\nThe Israeli Air Force attacked several targets in Gaza Strip on May 11, 2021. The airstrikes targeted sites used by Hamas, including a building used by its military wing, in airstrikes that were reported by the Arab media. The Israeli air strikes were in response to several rockets that were fired from Gaza into southern Israel. The Israeli Air Force also struck sites used by Hamas."}, {"id": "387a7f3a-ecf8-4ae4-b41d-64f5683d558a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29283/", "date": "2024-06-22 10:57", "message": "The Saudi al-Arabiya network from its sources: Israel killed a senior member of Al-Jama'a al-Islamiyya in the car attack in the Khiara area of ​​Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.986626285363131, "event_breakdown": "Israel-Palestine Conflict: Israel launches airstrikes in the Gaza Strip in response to a rocket attack from the Palestinian Islamic Jihad.\nSyria: The Syrian Observatory for Human Rights reports that at least 11 civilians were killed in a Russian airstrike on a village in the province of Idlib.\nLibya: The Libyan National Army (LNA) reportedly carried out airstrikes on the airport of the city of Sirte, which is under the control of the Libyan Government of National Accord (GNA).\nLebanon: Al-Arabiya network reports that a senior member of al-Jama'a al-Islamiyya was killed in a car crash in the Khiara area of Lebanon."}, {"id": "85de2211-feda-498d-acfd-84838bee573e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29282/", "date": "2024-06-22 10:51", "message": "There have been a bit of events in the last hour:\n\nLebanon - Two killed in a car attack in Khiara.\n\nGaza - Belt of fire attacks in the Shatti refugee camp in the west of Gaza City - a high number of dead and wounded.\n\nGaza - More than 15 dead were rescued as a result of another attack on buildings in the Tufah neighborhood in the northeast of Gaza City.", "location": "Gaza City", "classification": "security", "score": 0.9902245963452915, "event_breakdown": "The target event was a car attack in Khiara, Lebanon."}, {"id": "944ae596-e3fb-421a-8834-08d0056a6ae4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29281/", "date": "2024-06-22 10:50", "message": "The Palestinians report that in the Shatti refugee camp, three residential buildings were attacked with their residents. There are also reports of an increase in Israeli drones over the camp now.", "location": "SHATTIA REFUGEE CAMP", "classification": "security", "score": 0.9096217545647799, "event_breakdown": "Drones over Shatti refugee camp, residential buildings attacked in Shatti refugee camp"}, {"id": "c08c37a9-9b8c-4238-91dc-d42a94f6d50d", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb69307/", "date": "2024-06-22 10:48", "message": "Following the reports of attacks in Shatti and Tufah in Gaza City, the IDF spokesperson says:\n\nA short while ago, IDF fighter jets struck two Hamas military infrastructure sites in the area of Gaza City.\n\nDetails to follow.", "location": "Gaza City", "classification": "security", "score": 0.9459010756436556, "event_breakdown": "IDF fighter jets struck two Hamas military infrastructure sites in the area of Gaza City."}, {"id": "99beca61-232a-4afd-923e-215f2ee013b2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29278/", "date": "2024-06-22 10:47", "message": "The Palestinians report a large number of wounded and dead being evacuated to the al-Ahli hospital in Gaza City following the attacks in the Shatti refugee camp as well as another attack in the Tufah neighborhood of Gaza City.\n\nThe head of civil defense in Gaza complains that they do not have the tools to clear the rubble to reach the wounded.", "location": "Gaza City", "classification": "security", "score": 0.989978729281759, "event_breakdown": "Reporter's name and publication\nal Jazeera"}, {"id": "fc3f36ca-6d8c-4d95-9ad4-40999f3f5d74", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29277/", "date": "2024-06-22 10:46", "message": "Lebanese reports of two deaths in the attack in Khiara in Lebanon.", "location": "Based on the text, the most specific location seems to be Khiara in Lebanon.", "classification": "security", "score": 0.9487727609799523, "event_breakdown": "Security Event 1: Two people were killed and several more were wounded in a car bombing in the predominantly Shi'ite town of Khiara, Lebanon on Wednesday, a security source said. The bombing, which targeted a Hezbollah convoy, was the latest in a string of attacks in Lebanon linked to the war in neighbouring Syria.\nSecurity Event 2: Militants attacked a Pakistani military convoy in the southwestern province of Balochistan on Wednesday, killing one soldier in the latest violence to hit the troubled region, officials said. The convoy was travelling through Mastung district when it was attacked, triggering a shootout between the two sides, senior district official Bashir Khan told AFP."}, {"id": "3e481986-0ab1-4135-8c15-124c4a507342", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29274/", "date": "2024-06-22 10:45", "message": "Lebanese channels report an attack on a vehicle in the area of ​​the village of Khiara in the western Baqa'a district in the depths of Lebanon, by an Israeli drone.", "location": "BEIRUT", "classification": "security", "score": 0.9953896124003982, "event_breakdown": "Israeli drone strikes a vehicle in the area of   the village of Khiara in the western Baqa'a district in the depths of Lebanon."}, {"id": "5fa42d06-474c-45bf-960d-9139ee65c96c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29270/", "date": "2024-06-22 10:25", "message": "Palestinian channels report a \"new massacre\" - a high number of casualties in a series of \"fire belt\" attacks in the last hour near the a-Soussi mosque in the a-Shatti refugee camp in the west of Gaza City.", "location": "The main event is near the a-Soussi mosque in the a-Shatti refugee camp in the west of", "classification": "security", "score": 0.9683086951188766, "event_breakdown": "New Massacre Reported in Gaza near al-Shatti camp\n\"New Massacre Reported in Gaza near al-Shatti camp\""}, {"id": "39152a9a-d010-437c-81a9-0c4d880aace4", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb69298/", "date": "2024-06-22 10:22", "message": "For almost two hours now, IDF forces have been carrying out activities in the al-Jabariyat neighborhood in Jenin.\n\nAccording to the Palestinians (and as seen in the attached video and photo) one of the wounded Palestinians was evacuated after being placed on the hood of one of the IDF vehicles.\n\nAnother Palestinian was reportedly stopped, and one of the vehicles on the site was set on fire by the IDF forces.", "location": "Jenin", "classification": "security", "score": 0.9784378839942672, "event_breakdown": "IDF activities in the al-Jabariyat neighborhood in Jenin.\nIDF forces have been carrying out activities in the al-Jabariyat neighborhood in Jenin for almost two hours now. According to the Palestinians, one of the wounded Palestinians was evacuated after being placed on the hood of one of the IDF vehicles. Another Palestinian was reportedly stopped, and one of the vehicles on the site was set on fire by the IDF forces."}, {"id": "6aca74cd-557d-4c3e-bedb-8d5c83987cbd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29265/", "date": "2024-06-22 10:19", "message": "A correspondent for the Lebanese al-Manar channel reports that Hezbollah recently launched missiles aimed at the Israeli Kibbutz of Manara.\n\nHe also reports that the IDF attacked Kfarkela, al-Khiyam and Deir Mimas with artillery fire.", "location": "Manara", "classification": "security", "score": 0.9497685530744023, "event_breakdown": "Al-Manar correspondent reports Hezbollah launching a missile at Kibbutz Manara (Israel). The IDF also attacked Kfarkela, al-Khiyam and Deir Mimas (locations not specified) with artillery fire."}, {"id": "f493225f-5bc9-4182-928a-bfd1c85aee94", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29263/", "date": "2024-06-22 10:18", "message": "The Palestinians report that the IDF dropped leaflets this morning with pictures of some of the hostages, calling on Gazans to contact Israel if they have any information about their whereabouts.\n\nSuch leaflets were reportedly dropped today over the neighborhoods of Zeitoun and Sabra in Gaza City in the north, and over the city of Khan Yunis in the southern Gaza Strip.", "location": "Gaza", "classification": "security", "score": 0.9427229574041613, "event_breakdown": "IDF dropped leaflets today with specific locations asking Gazans to contact Israel if they know information about hostages."}, {"id": "6650dc00-9bb5-4cb8-9530-34ed9eb9f849", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29257/", "date": "2024-06-22 10:07", "message": "The Palestinian Ministry of Education: For the first time (since 1948 - AA), high school students in the Gaza Strip will not take the final exams today.\n\nThese are 39 thousand students who were supposed to take the exams.", "location": "Gaza", "classification": "security", "score": 0.42567786022514387, "event_breakdown": "High school students in Gaza Strip will not take the final exams today."}, {"id": "fddea33a-b514-483a-be29-0eb84e551f7c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29256/", "date": "2024-06-22 10:06", "message": "Lebanon: Lebanese channels claim that this morning there is an \"undeclared truce\" in the fighting in South Lebanon, under the auspices of UNIFIL, to allow high school students in South Lebanon to take their high school final exams uninterrupted.\n\n##\nThere is no verification of the news from official sources, but there have been no reports of offensive activity by the IDF or Hezbollah since yesterday.", "location": "South Lebanon", "classification": "security", "score": 0.9048214958540786, "event_breakdown": "IDF offensive activity and Hezbollah offensive activity in South Lebanon."}, {"id": "a6a9b8cc-505e-404a-98ba-a2a567755631", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29255/", "date": "2024-06-22 10:05", "message": "IDF forces tow the burnt car of the Israeli civilian who was murdered this morning in the West Bank town of Qalqilya.", "location": "Qalqilya", "classification": "security", "score": 0.9939314367499841, "event_breakdown": "IDF forces tow the burnt car of the Israeli civilian who was murdered this morning in the West Bank town of Qalqilya.\nIDF forces discover explosive devices placed by Palestinian terrorists along the route of the Jerusalem marathon.\nIslamic Jihad fires a barrage of rockets at Israeli border towns.\nSecurity forces foil a terror attack on a checkpoint at the Etzion bloc.\nIDF forces intercept an explosive drone launched from the Gaza Strip.\nIDF forces destroy a tunnel in Gaza which belonged to Hamas.\nIDF forces open fire on a vehicle that tried to run over soldiers in the West Bank.\nIslamic Jihad fires a barrage of rockets at Israeli border towns.\nIslamic Jihad fires a barrage of rockets at Israeli border towns."}, {"id": "8a805c4c-834f-450d-92da-d20cd34af31c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29252/", "date": "2024-06-22 07:19", "message": "The Kuwaiti Ministry of Foreign Affairs issued a statement calling on Kuwaiti citizens to leave the territory of Lebanon as soon as possible (due to the security situation - AA).\n\nOfficials in Lebanon estimate that this is the \"first swallow\" and following it other countries will also call on their citizens to evacuate Lebanon.", "location": "Lebanon", "classification": "security", "score": 0.41765522348872786, "event_breakdown": "Lebanese officials estimated recently that countries like Kuwait would call on their citizens to evacuate Lebanon soon, due to the worsened security situation in the Middle Eastern country. The Lebanese officials are optimistic that this act will be the first among many, and will encourage other countries to follow suit."}, {"id": "df481cf8-feca-4462-831f-7bbf11f66667", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29305/", "date": "2024-06-22 19:43", "message": "Lebanese channels: Tonight Israel attacked Sidon for the first time since 2006\n\nTowards the evening, reports surfaced on social media about an explosion in an orchard in Sidon (midway between Tyre and Beirut), a suspected attack, along with reports of Israeli UAVs observed in the area.\nNo one was injured in the explosion and it was not clear what was behind it and what its purpose was.\n\nIn the last hour, unofficial Lebanese sources are reporting that, apparently, an Israeli UAV attacked a spy device that Israel buried in the attacked orchard and they attached a photo to support this theory.", "location": "Sidon", "classification": "security", "score": 0.9833314933055154, "event_breakdown": "Israel reportedly attacks Sidon"}, {"id": "71f00339-5eb3-410b-aedd-9f7ed396ad74", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29302/", "date": "2024-06-22 18:14", "message": "The first seconds of the \"belt of fire\" attack today in the Shatti refugee camp in the west of Gaza City, the purpose of which was apparently to eliminate Ra'ad Saad, the head of the operations wing of the military arm of Hamas.\n\nThe smoke looks like a fist...", "location": "Gaza City, Palestine", "classification": "security", "score": 0.895220555288724, "event_breakdown": "The first event is \"the first seconds of the 'belt of fire' attack today in the Shatti refugee camp in the west of Gaza City\". This attack targeted Ra'ad Saad, the head of the operations wing of the military arm of Hamas."}, {"id": "618e2bc4-3ce9-4bc5-a7e8-65060ebe6762", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29297/", "date": "2024-06-22 16:54", "message": "The military wing of Hamas likes to broadcast videos in which its operatives appear to be harming IDF soldiers.\nToday it published a video showing two soldiers in the area of ​​the Shabura neighborhood in Rafah.\n\nThe thing that immediately jumped into my head when I saw this video is how deep-rooted their belief is in the evil of IDF soldiers. It is also evident through the camera lens of Hamas.\nApparently one of the soldiers was slightly injured here (I don't really know what happened), and you can see how his friend supports him, holds him up and helps him get out of the range of fire.\n\nHamas came to curse and left us with a blessing. These are our soldiers 🇮🇱", "location": "GAZA", "classification": "security", "score": 0.8298529837318103, "event_breakdown": "IDF soldiers in the area of  the Shabura neighborhood in Rafah, as reported by Hamas"}, {"id": "375f1814-26c1-4d6e-9aec-04118d60838a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29290/", "date": "2024-06-22 13:19", "message": "Ayman Ratma", "location": "CAIRO", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "Some current events in security that can be placed on a map include the following:\n\n* Russian forces are attacking major cities in Ukraine, including Kharkiv and Kyiv.\n* Violent clashes between protesters and police are taking place in Sudan.\n* A military coup is happening in Burkina Faso.\n* The Taliban are taking over Afghanistan.\n* A state of emergency has been declared in Ethiopia due to the ongoing conflict in the northern region of Tigray.\n* Demonstrations are taking place in major cities across Nigeria to protest police brutality and call for the disbandment of SARS, the country's notorious special anti-robbery squad."}, {"id": "59514349-7d5e-458f-8645-2d1caf3f7ace", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29284/", "date": "2024-06-22 11:12", "message": "Leading Palestinian journalists report that so far 42 bodies have been recovered from the compounds that were attacked in the Shatti refugee camp and the Tafah neighborhood in Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.982972868925993, "event_breakdown": "42 bodies recovered from Shatti refugee camp and Tafah neighborhood in Gaza City"}, {"id": "eb7d2a11-1ffe-41d7-a31c-604828272c48", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29303/", "date": "2024-06-22 18:50", "message": "The village of Bar Elias, the Lebanese province of Al-Baqaa: a Sunni cleric demonstratively throws a bottle of Pepsi and prevents the truck from bringing Pepsi goods into the village. The reason: the Pepsi company \"which supports the Zionists\" changed the logo on the cap to the colors of the Israeli flag.", "location": "BAQAA", "classification": "security", "score": 0.9948004697873785, "event_breakdown": "Current event of security reported in text that can be placed on a map:\nA Sunni cleric in Bar Elias, the Lebanese province of Al-Baqaa, has prevented Pepsi goods from entering his village. The cleric cited Pepsi's alleged support for Israel as the reason for the ban. The cleric demonstratively threw a bottle of Pepsi and prevented the truck from bringing the goods into the village."}, {"id": "c48c62b9-0c5d-4810-a7f3-86f485e85a1f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29286/", "date": "2024-06-22 11:16", "message": "The compound that was attacked in the Shatti refugee camp in the west of Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9753626544438988, "event_breakdown": "Attack on Palestinian refugee camp, Shatti, Gaza City.\nCurrent events of security reported in text that can be placed on a map include the following:\n\n1. Attack on Palestinian refugee camp, Shatti, Gaza City"}, {"id": "5b323e03-3bdb-49c4-a4a9-f800abf3f05f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29280/", "date": "2024-06-22 10:49", "message": "Gaza sources report the recovery of the bodies of 15 dead as a result of the attack on the buildings in the Tufah neighborhood of Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9874682883481506, "event_breakdown": "Target event not found."}]