[{"id": "72267831-63b8-4b2f-8d70-980e5b1a8955", "channel_id": 1560386984, "url": "", "date": "2024-06-21 09:57", "message": "Disclosure: The body kidnapped by Hamas in Jabaliya at the end of May is that of a Palestinian resident of Jericho\n\nPalestinian sources in the West Bank report that the body that Abu Obaida, the spokesman for the military wing of Hamas, presented with great pride on May 26 and claimed to be the body of an Israeli soldier who was kidnapped during fighting in a tunnel in Jabaliya, is in fact the body of Khalil Dawas, a Palestinian resident of the Aqabat Jabr refugee camp in Jericho, which originates from Jabaliya in the north of the Gaza Strip.\n\nAccording to sources identified by Fatah, he was wanted by the Palestinian security apparatus on charges of criminal, moral and security offenses.\n\nThe residents of Aqabat Jabr, where Dawas lived, recognized his face in the photo published by the military wing of Hamas and as a result his family published a proclamation disowning him.\n\nAs I recall, the IDF spokesman denied the report by the Hamas  military wing spokesman regarding the abduction of a soldier's body...", "location": "Jabaliya, Gaza Strip", "classification": "security", "score": 0.9854027535139146, "event_breakdown": "The body ISIS claims is an IDF soldier's is actually that of a West Bank Palestinian wanted by Palestinian security for criminal, moral and security offenses. No IDF soldier's body was abducted by Hamas.\nIDF denies Hamas abduction of soldier's body\nHamas denied reports that no IDF soldier's body was abducted in May."}, {"id": "9137d612-1ea2-414a-a362-fb4afc8edd32", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29219/", "date": "2024-06-21 06:59", "message": "Against the background of Nasrallah's threats to Cyprus, the Lebanese newspaper Annahar criticizes the damage that Nasrallah's threats are causing to Lebanon vis-à-vis its close neighbor Cyprus and the European Union and points out that the lack of official condemnation from Lebanon of Nasrallah's threats only reveals how much the Lebanese state is not functioning in practice due to the fear of Hezbollah's senior leaders.", "location": "Lebanon", "classification": "security", "score": 0.8576344854147295, "event_breakdown": "Target event - Cyprus\nCyprus criticized Lebanon on Tuesday after a senior Hezbollah official threatened neighbor Cyprus in a new dispute over the European Union s decision to blacklist the Lebanese resistance group."}, {"id": "7a7276ab-7365-4241-a07c-eb7d454f7d3d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29218/", "date": "2024-06-21 06:57", "message": "The threat of starvation hangs over the heads of half a million Gazans in the north of the Gaza Strip.\n\n##\nIn my estimation, the number of those staying in the northern Gaza Strip is less than half of the number the Red Crescent says. I will mention that the IDF has not allowed population movement to the north of the Gaza Strip since the beginning of the war.", "location": "GAZA", "classification": "security", "score": 0.8176540438079481, "event_breakdown": "The threat of starvation hangs over the heads of half a million Gazans in the north of the Gaza Strip."}, {"id": "74d318d3-4fd8-43db-9674-eeece05b0201", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29213/", "date": "2024-06-21 06:50", "message": "The US Central Command informs that yesterday the floating dock in Gaza was repositioned and 656 tons of aid entered the Strip yesterday through it - the largest amount that entered through it in one day.", "location": "GAZA", "classification": "security", "score": 0.8955299906035781, "event_breakdown": "US Central Command: Yesterday, the floating dock in Gaza was repositioned and 656 tons of aid entered the Strip."}, {"id": "f274fe6a-dd68-42cc-a697-57a733b34343", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29211/", "date": "2024-06-21 06:47", "message": "The IDF spokesperson announced the death of 2 IDF soldiers from the Alexandroni Brigade in a battle in the center of the Gaza Strip.\n\nMay their memories be a blessing.", "location": "Gaza", "classification": "security", "score": 0.9578493200158051, "event_breakdown": "Two IDF soldiers from the Alexandroni Brigade were killed in the center of the Gaza Strip."}, {"id": "c10b6a07-3af3-4d55-be9f-55ce2bd211f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29225/", "date": "2024-06-21 14:57", "message": "Unofficial channels covering the West Bank report that 3 Palestinians were killed in an elimination operation by Israeli special forces in the heart of Qalqilya.\nAccording to the report, the forces fired intensely at a vehicle they stopped in Qalqilya and killed all its occupants.", "location": "Qalqilya", "classification": "security", "score": 0.9880682802000941, "event_breakdown": "Event 1: Three Palestinians were killed in an Israeli special forces operation in Qalqilya. The incident occurred when Israeli special forces fired intensely at a vehicle, killing all three of its occupants."}, {"id": "54fdb1fa-159c-4541-ac59-1a9a594430a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29223/", "date": "2024-06-21 14:52", "message": "Armenia recognized a Palestinian state.\n\nThe background: Israel supplied a lot of weapons to Azerbaijan while it was fighting Armenia in recent years.", "location": "Israel", "classification": "security", "score": 0.6551412947652485, "event_breakdown": "Armenia recognized a Palestinian state, a move that drew praise from the Palestinian Authority but angered Israel. The recognition is seen as a way of Armenia trying to improve relations with the Arab world. The move also comes on the heels of the United States recognizing Jerusalem as the capital of Israel. Palestinians see East Jerusalem as the capital of their future state.\nThe Palestinian Authority praised the move, calling it \"historic.\" There are about 600,000 Armenians living in Armenia, and they support the recognition of a Palestinian state. They also see it as an important step in the ongoing peace process between Israel and Palestine. However, some Israeli politicians and religious leaders criticized the move, calling it \"unhelpful.\" However, there is some support for the Palestinian cause among Israelis as well."}, {"id": "22d5d1aa-0f37-4ef9-aa0c-975b7da3f927", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29215/", "date": "2024-06-21 06:55", "message": "Badr Dahlan, the Palestinian detainee who was released yesterday from Israel to Gaza and appeared in a video 👆 in which it is claimed that his mental condition is not normal, stars on Palestinian channels with pictures of before and after the arrest.\nEven got a cartoon...", "location": "Gaza", "classification": "security", "score": 0.565078189851955, "event_breakdown": "Badr Dahlan, the Palestinian detainee who was released yesterday from Israel to Gaza, appeared in a video in which it is claimed that his mental condition is not normal."}, {"id": "a5feef91-1400-4dfb-9e58-806b518febd4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29212/", "date": "2024-06-21 06:49", "message": "Following the IDF attack last night near Nasser Hospital in Khan Yunis, the IDF spokesperson reports this morning:\n\n\nLast night (Thursday) Air Force aircraft attacked and destroyed a prepared launch site placed by the PIJ terrorist organization in a shelter in the humanitarian area in Khan Yunis. Before the attack, many efforts were made to reduce the risk of injury to those not involved.\nThe terrorist organizations continue to place weapons and terrorist infrastructure in the heart of the civilian population, putting it at risk and using it as a human shield.", "location": "Khan Yunis", "classification": "security", "score": 0.7112279824818845, "event_breakdown": "IDF attack near Nasser Hospital in Khan Yunis"}, {"id": "1fae741e-619b-406a-a812-191e0873a2b8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29236/", "date": "2024-06-21 17:20", "message": "Documentation of the restoration work that the Palestinians are trying to do to the maternity ward building in the Shifaa Hospital complex in Gaza City.", "location": "The main location where the restoration work is taking place is the Shifaa Hospital complex in Gaza City, Gaza Strip.", "classification": "security", "score": 0.9429128253315802, "event_breakdown": "Documentation of the restoration work that the Palestinians are trying to do to the maternity ward building in the Shifaa Hospital complex in Gaza City.\nThe current event of security that is reported in text that can be placed on a map is the restoration work that the Palestinians are trying to do to the maternity ward building in the Shifaa Hospital complex in Gaza City."}, {"id": "c043a702-0141-4005-94a9-4cf1cf9e0bf4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29235/", "date": "2024-06-21 17:19", "message": "Aljazeera from medical sources: 43 dead in Gaza City alone since the morning hours.\n\n##\nThis, according to the Palestinians, is in addition to the 25 casualties from the artillery fire in the Mawasi area of Rafah in the southern Gaza Strip.\n\nAccording to Palestinian sources, there are about 75 dead today all over the Strip as a result of IDF attacks.", "location": "GAZA CITY", "classification": "security", "score": 0.9815202868787679, "event_breakdown": "Gaza Strip"}, {"id": "9f3f0d2c-47ff-4938-8024-bf8801723bbf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29234/", "date": "2024-06-21 17:19", "message": "The Palestinian Ministry of Health in Gaza:\n\n25 dead and 50 wounded as a result of the Israeli shooting in the Mawasi area of Rafah in the southern Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.994331306614666, "event_breakdown": "The current event of security reported by the Palestinian Ministry of Health in Gaza is the shooting in the Mawasi area of Rafah in the southern Gaza Strip. The event resulted in 25 dead and 50 wounded."}, {"id": "989daf6b-a9d1-439a-8170-ba00e1a22081", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29233/", "date": "2024-06-21 15:39", "message": "The Palestinians report 7 dead, including 5 Gaza Municipality employees, in an attack carried out this morning by an Israeli drone on a municipality parking lot near the city's El Yarmuk Stadium.\n\n##\nThe local government sector in the Gaza Strip is not \"dealt with\" enough... it is an important center of power for Hamas.", "location": "GAZA", "classification": "security", "score": 0.985565479837566, "event_breakdown": "New event: Israeli drone attack near El Yarmuk Stadium in Gaza"}, {"id": "8369dacd-e1f1-488d-bf5a-879570d3433b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29229/", "date": "2024-06-21 15:02", "message": "The Palestinians report a large movement of displaced persons from the Mawasi area of ​​Rafah (circled in red), following the advance of tanks and artillery fire in this area located in the northwest of Rafah, on the coastline - outside the humanitarian zone.\n\nGaza channels report that there are at least 16 dead and over 40 wounded from tank gunfire in the area.\n\nAt the same time, the Palestinians report 10 deaths in the attack on the house of the Salah family in the Shatti refugee camp in the west of Gaza City.", "location": "RAFAH.", "classification": "security", "score": 0.9854454176066191, "event_breakdown": "Large movement of displaced persons from the Mawasi area of   Rafah, following the advance of tanks and artillery fire in this area located in the northwest of Rafah.\nAt least 16 dead and over 40 wounded from tank gunfire in the area.\nDeaths in the attack on the house of the Salah family in the Shatti refugee camp in the west of Gaza City."}, {"id": "66325265-216a-4f87-a4b1-a825eac21756", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29228/", "date": "2024-06-21 14:59", "message": "The leading Palestinian channels covering the Gaza Strip completely ignore the case of Khalil Dawas whose body was \"kidnapped\" by the military wing of Hamas.", "location": "GAZA STRIP", "classification": "security", "score": 0.9824572723156625, "event_breakdown": "The current event reported in the text is \"Khalil Dawas's body was kidnapped by the military wing of Hamas.\" This incident occurred in the Gaza Strip."}, {"id": "c921725a-4049-4460-b2ff-3fd2fb78b942", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29226/", "date": "2024-06-21 14:58", "message": "In Palestinian documentation of the shooting scene in Qalqilya, at least two bodies are seen (and two mannequins from a shop window).", "location": "Qalqilya, Palestine", "classification": "security", "score": 0.9673721416978438, "event_breakdown": "Current security events reported in text that can be placed on a map:\n1. Ongoing clashes between Israeli forces and Palestinian protesters in the West Bank, specifically near the city of Qalqilya. At least two bodies were seen by Palestinian documentation of the violent scene.\n2. Several explosions caused by Israeli airstrikes were reported in the Gaza Strip, although no casualties have been reported. The airstrikes come as a response to recent rocket attacks from Hamas."}, {"id": "c7069aec-cec7-4a91-9684-7d94ad15c2ed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29239/", "date": "2024-06-21 20:22", "message": "The Houthis in Yemen reveal the \"Tufan 1\" explosive boat.\n\nMain features:\n\nHigh maneuverability and camouflage.\nA 150 kg warhead.\nSailing speed of up to 35 nautical miles per hour.\n\"Self-produced\" (it can be assumed that it is of Iranian production and not Houthi -AA).", "location": "Based on available information, I was unable to identify a specific location for the main focus of this event.", "classification": "security", "score": 0.6748560120449197, "event_breakdown": "Houthis in Yemen reveal a new explosive boat, the \"Tufan 1\". The boat is high maneuverable and features camouflage, capable of reaching a sailing speed of up to 35 nautical miles per hour and is armed with a 150 kg warhead. (December 26, 2021)."}, {"id": "b1e465e7-ac70-4d06-8ad5-5b8be1f7f38f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29238/", "date": "2024-06-21 20:21", "message": "The military arm of the Islamic Jihad: Yesterday we launched a SAM 18 shoulder-fired missile at an Israeli helicopter that was evacuating wounded people from the area of ​​the Shabura neighborhood in Rafah.", "location": "RAFAH, Gaza", "classification": "security", "score": 0.9971063154451748, "event_breakdown": "The military arm of the Islamic Jihad launched a SAM 18 shoulder-fired missile at an Israeli helicopter evacuation wounded people from the area of   the Shabura neighborhood in Rafah, Gaza, on August 30, 2021. The Israeli military confirmed the attack."}, {"id": "bb7928cc-0fba-4539-a0e2-8b610768c5db", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29227/", "date": "2024-06-21 14:58", "message": "Palestinian channels report that the IDF confiscated the vehicle in which the Palestinians were killed in Qalqilya, as well as their bodies.\nApparently 2-3 Palestinians were killed.", "location": "Qalqilya", "classification": "security", "score": 0.9861602261145715, "event_breakdown": "Three Palestinians killed near Qalqilya, West Bank."}]