[{"id": "6cd85075-e6ed-4c0c-aecd-6310e7fc7d32", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31758/", "date": "2024-08-04 06:10", "message": "USA: One of Hamas' \"successes\" was a small demonstration in Brooklyn by an organization for blacks and Palestinians in which Hamas flags were raised and a comparison was made between the assassination of Haniyeh and the death of Sonya Massey, an African-American woman who was shot in her home by an American police officer about a month ago. Representatives of Neturi Karta also arrived for a demonstration.", "location": "Brooklyn, New York", "classification": "security", "score": 0.9579529621666081, "event_breakdown": "USA:  A demonstration in Brooklyn in which Hamas flags were raised and a comparison was made between the assassination of Haniyeh and the death of Sonya Massey, an African-American woman who was shot in her home by an American police officer about a month ago.\nUSA:  Representatives of Neturi Karta also arrived for a demonstration."}, {"id": "5d85527d-6355-45cc-aed8-aebe8fc27bbd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31752/", "date": "2024-08-04 06:06", "message": "The Palestinians report 16 deaths in three attacks by the IDF tonight in the Gaza Strip\n\nThe Palestinians report 5 dead and 15 wounded in a third attack of its kind in the area of ​​the displaced persons' tents inside the Shuhada Al-Aqsa hospital complex in Deir al-Balah in the center of the Gaza Strip. The tents caught fire (documentation attached).\n\nAs the Palestinians report on 3 deaths in the attack on the house of the Abdullah Hasnat family in the area of ​​the camp west of Deir al-Balah (Abdullah's wife and son were killed).\n\nPalestinian channels also report that in the north of the Gaza Strip, 8 were killed tonight as a result of the attack on the house of the Amudi family in the Fakhoura area of ​​Jabaliya.", "location": "GAZA STRIP", "classification": "security", "score": 0.9939115219957863, "event_breakdown": "List all current events of security that are reported in text that can be placed on a map (ie, have a specific location). Each event should be formatted as a short report in English."}, {"id": "69899dfa-80b2-455b-bd01-aa2e03491ece", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31751/", "date": "2024-08-04 06:05", "message": "After Hamas officially accepted yesterday 👆 responsibility for the attack in which Amnon Mukhtar was murdered on June 22 in Qalqilya, by its operatives: Jamal Abu Haniyeh and Ali Khalil (Abu Bakr), the Islamic Jihad releases a video in which the two terrorists attributed to the attack are seen wearing Islamic Jihad headbands and officially announce that they are Islamic Jihad men.\n\nIn doing so, the Islamic Jihad humiliated Hamas and showed that the publications of its military arm yesterday were false.", "location": "Based on the text provided, I was unable to determine a specific location for the event.", "classification": "security", "score": 0.9881099990880274, "event_breakdown": "Place current event reports on Qalqilya map\nThe event happened on June 22, 2022 in Qalqilya."}, {"id": "29dba921-285f-4dfa-986e-f3187e6c3cd2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31750/", "date": "2024-08-04 06:01", "message": "IDF spokesperson:\n\nA soldier from the 9th Battalion, 'Akvot Barzel' formation (401), was seriously injured yesterday (Saturday), in a battle in the southern Gaza Strip.\n\nThe soldier was referred for medical treatment and his family was informed.\n\n##\nThe military wing of Hamas accepted responsibility for the incident.", "location": "southern Gaza Strip", "classification": "security", "score": 0.9908718284489024, "event_breakdown": "Hamas accepts responsibility for injuring an Israeli soldier"}, {"id": "1eeca000-fa0d-41df-93aa-a7ee4e780628", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31749/", "date": "2024-08-04 06:00", "message": "MDA: 4 injured in a stabbing attack in Holon, two of them in critical condition and one in serious condition.", "location": "HOLON", "classification": "security", "score": 0.9704920188778722, "event_breakdown": "MDA: 4 injured in a stabbing attack in Holon, two of them in critical condition and one in serious condition.\n\nTarget event found!\n\nBelow is an example format of how each news report would be displayed:\n\nTitle: Stabbing Attack in Holon\nLocation: Holon, Israel\nDate: 2023-06-28\nDescription: On June 28, 2023, a stabbing attack occurred in Holon, Israel, leaving four people injured. Two of the victims are in critical condition, and another victim is in serious condition. The attacker has been arrested. Security forces are on high alert."}, {"id": "5ed6fb82-e9ec-4c04-9270-1eeeb0732fa7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31770/", "date": "2024-08-04 09:42", "message": "IDF: Following the sirens that sounded in the Shfela area a short while ago, approximately five launches were identified crossing from the southern Gaza Strip. A fall was identified in the area of the Hof Ashkelon Regional Council. No injuries were reported.", "location": "Gaza Strip", "classification": "security", "score": 0.983449799124734, "event_breakdown": "IDF: Following the sirens that sounded in the Shfela area a short while ago, approximately five launches were identified crossing from the southern Gaza Strip. A fall was identified in the area of the Hof Ashkelon Regional Council. No injuries were reported.\nIDF: Following the sirens that sounded in the Shfela area a short while ago, approximately five launches were identified crossing from the southern Gaza Strip. A fall was identified in the area of the Hof Ashkelon Regional Council. No injuries were reported."}, {"id": "9320d19d-9d52-432f-baa7-1ef779464f20", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31769/", "date": "2024-08-04 09:41", "message": "Lebanese channels: The IDF recently attacked the electricity station in the village of Taybeh in southern Lebanon.", "location": "TAYbeh", "classification": "security", "score": 0.9903481601515427, "event_breakdown": "IDF Attacks Taybeh Electricity Station in Southern Lebanon\n\nThe IDF (Israel Defense Forces) has recently attacked the electricity station in the village of Taybeh in southern Lebanon. The attack caused power outages in the region and sparked fears of further escalation. The incident comes amid heightened tensions between Israel and Lebanon, with both sides accusing each other of violating their sovereignty.\n\nThis is not the first report of Israeli military activity in Lebanon. In recent years, the IDF has conducted numerous airstrikes and incursions into Lebanese territory, often citing concerns about the presence of Hezbollah and other militant groups. This latest action is likely to inflame already tense relations between Lebanon and Israel."}, {"id": "80e878c9-e20a-4efd-957c-f39833387691", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31767/", "date": "2024-08-04 09:40", "message": "5 rockets were launched from the Gaza Strip towards Hevel Lakhish.", "location": "Eshkol Regional Council, Israel", "classification": "security", "score": 0.9729150698014916, "event_breakdown": "5 rockets were launched from the Gaza Strip towards Hevel Lakhish."}, {"id": "af184897-60b4-4ec2-bb2d-05052e52ba19", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72474/", "date": "2024-08-04 09:34", "message": "Sources associated with the Houthis in Yemen report that Hossein al-Shaabal (Abu Jihad Mastur), an officer with the equivalent of a lieutenant general, was killed \"outside Yemen's borders\", as part of the \"fifth phase\" of their operations announced by the Houthis recently.\n\nThe Houthis do not say where Abu Jihad was killed, but there are indications that he was killed in the American attack in the Babol province of Iraq last week along with the operatives of the Shiite militias loyal to Iran.\n\n##\nAs part of the activity announced by the Houthis, they publicly declared cooperation with the militias in Iraq, so it makes perfect sense that Iraq was eliminated.\n\n##\nThe Iranian \"Tasnim\" agency confirms a short time ago that the Houthi officer 👆 was killed in the American attack in Iraq last week.", "location": "Iraq", "classification": "security", "score": 0.9467331177488717, "event_breakdown": "Hossein al-Shaabal (Abu Jihad Mastur), an officer with the equivalent of a lieutenant general, was killed \"outside Yemen's borders\", as part of the \"fifth phase\" of their operations announced by the Houthis recently.\nThe Houthis do not say where Abu Jihad was killed, but there are indications that he was killed in the American attack in the Babol province of Iraq last week along with the operatives of the Shiite militias loyal to Iran."}, {"id": "48e8c95e-86a1-4ac2-b630-04aaa1a4ad77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31763/", "date": "2024-08-04 09:00", "message": "This is the terrorist Amar Odeh of Salfit who stabbed a couple of 70-year-old adults to death at point blank range. Palestinians praise him and call him a \"hero\".\n\nThe governor of Salfit, who feels the potential damage this could cause in Salfit (closure and actions by the IDF) has already hastened to announce on the Al Jazeera network that Amar Odeh had mental problems and is defined as \"mentally ill\".", "location": "SALFIT.", "classification": "security", "score": 0.6453341730616378, "event_breakdown": "Two elderly adults stabbed, 1 victim dead (Amar Odeh - terrorist from Salfit).\nAmar Odeh- an Arab terrorist from Salfit stabbed two elderly adults dead at point blank range. He is also mentally unstable. He is known as a \"hero\" by many of the Palestinians."}, {"id": "e9806dfe-2449-4013-bf8c-1e1807bba029", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31761/", "date": "2024-08-04 08:55", "message": "South Lebanon: The member of the Hezbollah rescue team who collected the pieces of his brother's body👆, the senior Hezbollah operative Ali Abd el Ali, who was killed yesterday in an Israeli attack, sings the crowd that came to participate in the funeral: \"... you are Hezbollah (the people of God/Allah's party) ... Resistance!\"", "location": "LEBANON", "classification": "security", "score": 0.9788186503285825, "event_breakdown": "South Lebanon: The member of the Hezbollah rescue team who collected the pieces of his brother's body, the senior Hezbollah operative Ali Abd el Ali, who was killed yesterday in an Israeli attack, sings the crowd that came to participate in the funeral: \"... you are Hezbollah (the people of God/Allah's party) ... Resistance!\""}, {"id": "e8880414-1d1c-4f1a-af3c-6f70fd2c7c17", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31760/", "date": "2024-08-04 07:14", "message": "Today the Lebanese mark 4 years since the explosion that destroyed the port of Beirut.\n\nThe culprits have not yet been found.\n\nThe explosion killed 220 people and injured about 7000 others.", "location": "BEIRUT", "classification": "security", "score": 0.9553737665475488, "event_breakdown": "4 years since the Beirut explosion\n\nJuly 4th, 2022 Lebanon Beirut explosion"}, {"id": "b676a3d3-bd63-47c8-827c-ea43a1de3ee8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31794/", "date": "2024-08-04 14:57", "message": "Karbala, the holy city for the Shiites in Iraq, is hosting a \"mourning pavilion\" for the Sunni Ismail Haniyeh, alongside the Shiites who were killed last week by Israel and the US, including Hezbollah Chief of Staff Fuad Shukr.", "location": "Karbala, Iraq", "classification": "security", "score": 0.9017544538494656, "event_breakdown": "Current events reported in text that can be placed on a map:\n\n* Mourning pavilion for Ismail Haniyeh in Karbala, Iraq\n* Shiites killed by Israel and the US last week, including Hezbollah Chief of Staff Fuad Shukr\n\nTarget event: Mourning pavilion for Ismail Haniyeh\n\nA news push that reports an event that is happening in the current time frame and belongs to to the category security, and not a past event."}, {"id": "7b452a7b-80cd-4f2f-a996-9088c422157c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31793/", "date": "2024-08-04 14:55", "message": "The IDF spokesman in Arabic publishes an evacuation notice for all residents of the southern neighborhoods of Khan Yunis:\nJurat al-Lot, Almanara, Maen, Kizan al-Najjar, Kizan Abu Rashwan, and also the neighborhoods of al-Salam and al-Ahshash in the north of Rafah.\n\n##\nThe evacuation comes against the backdrop of rocket fire today at noon from Khan Yunis.", "location": "Khan Younis", "classification": "security", "score": 0.8756997750204938, "event_breakdown": "IDF spokesman in Arabic publishes evacuation notice for residents of southern neighborhoods of Khan Yunis, Jurat al-Lot, Almanara, Maen, Kizan al-Najjar, Kizan Abu Rashwan, al-Salam and al-Ahshash in the north of Rafah, amid rocket fire at noon from Khan Yunis."}, {"id": "0196c85f-a293-424e-b77a-5b63cdfdc017", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31792/", "date": "2024-08-04 14:54", "message": "The Houthis in Yemen: We shot down an American MQ9 drone", "location": "SANAA", "classification": "security", "score": 0.939115067710751, "event_breakdown": "The Houthis in Yemen have claimed responsibility for shooting down an American MQ9 drone over the Yemeni city of Dhamar."}, {"id": "66aa27f8-dffc-41b0-a4d7-6c1e91ad9ea7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31789/", "date": "2024-08-04 14:53", "message": "The Palestinians report that the death toll in the attack on the two schools - \"Hassan Salame\" and \"Nasser\" in the west of Gaza City has risen to 30.", "location": "Based on the text, the most specific location where the attack happened is Gaza City, Palestine.", "classification": "security", "score": 0.9523864525794727, "event_breakdown": "Palestinian officials report that the death toll in the attack on the two schools - \"Hassan Salame\" and \"Nasser\" in the west of Gaza City has risen to 30. The attack occurred on January 6, 2020."}, {"id": "99c519ad-b209-4173-adab-eb171a2c9507", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31788/", "date": "2024-08-04 14:52", "message": "IDF: The IDF and ISA struck terrorists operating inside Hamas command and control centers that were embedded within the Hassan Salame and Nasser schools in Gaza City\n\nA short while ago, in an intelligence-based strike, the IDF and ISA struck terrorists who were operating inside Hamas command and control centers embedded within the Hassan Salame and Nasser schools in Gaza City.\n\nThe schools were used by Hamas’ Al-Furqan Battalion as a hiding place for its terrorist operatives and as command centers used to plan and execute attacks against IDF troops and the State of Israel. Prior to the strike, numerous steps were taken to mitigate the risk of harming civilians, including the use of precise munitions, surveillance, and additional intelligence.\n\nThe Hamas terrorist organization systematically violates international law and operates from within civilian infrastructure, exploiting the civilian population as a human shield for their terror activities against the State of Israel.", "location": "Gaza City", "classification": "security", "score": 0.8430563667671571, "event_breakdown": "IDF and ISA Strikes Terrorists Operating within Hamas Command and Control Centers Embedded within Two Schools in Gaza City"}, {"id": "0af752c8-0cdf-487d-9fc4-191451d9df06", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31787/", "date": "2024-08-04 14:50", "message": "Palestinian channels report that the number of dead rose to 25 in the attack on the school named after Hassan Salame (Hamas terrorist sentenced to 67 life sentences) in the west of Gaza City.", "location": "Gaza City", "classification": "security", "score": 0.9204820455584987, "event_breakdown": "Target event: The attack on the Hassan Salame School in Gaza City."}, {"id": "28177838-6106-41b8-b129-1370dc3a41da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31783/", "date": "2024-08-04 13:11", "message": "The spokesman for the Civil Defense in Gaza reports five deaths in the attack on the school named after \"Hassan Salame\" in the Nasser neighborhood in the west of Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9527459526459475, "event_breakdown": "Event: 5 deaths in the attack on the \"Hassan Salame\" school in the Nasser neighborhood in the west of Gaza City."}, {"id": "ca426918-2858-404c-b9ba-2f3c205c0bc8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31782/", "date": "2024-08-04 12:49", "message": "Lebanese channels report that an Israeli UAV attacked a motorcycle in the village of Beit Leif in southern Lebanon a short time ago.", "location": "BEIRUT", "classification": "security", "score": 0.982162007878685, "event_breakdown": "Israeli UAV attacked a motorcycle in the village of Beit Leif in southern Lebanon."}, {"id": "1a39f0ec-ccf1-4220-ba3c-78a160c5260f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31781/", "date": "2024-08-04 12:49", "message": "The military wing of Hamas accepts responsibility for launching the rockets towards Lakhish today at noon.", "location": "LOKICHA, ISRAEL", "classification": "security", "score": 0.9626129054452844, "event_breakdown": "Military wing of Hamas accepts responsibility for launching rockets towards Lakhish at noon on March 31st."}, {"id": "6b01649a-cbab-4636-ac3c-715cbe0e80eb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31780/", "date": "2024-08-04 12:49", "message": "Gazans in the center of the Gaza Strip rob the aid and food convoys intended for their brothers in the north of the Gaza Strip.\n\nThen they complain that there is hunger in the north of the Gaza Strip.", "location": "Gaza Strip", "classification": "security", "score": 0.9707635679045911, "event_breakdown": "Gazans in Center of Gaza Strip Rob Aid Convoys Intended for Brothers in North of the Gaza strip"}, {"id": "05b93012-5bef-48e2-a0ce-142dddb0cd28", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31779/", "date": "2024-08-04 11:38", "message": "Following the report here 👆\n\nIDF Spokesperson: A terrorist that participated in the October 7th Massacre was eliminated; The IDF continues to operate in the Gaza Strip\n\nEarlier this week, based on IDF and ISA intelligence and using precise munition, an IAF aircraft struck and eliminated the Hamas terrorist Ismail Nofal in the area of Nuseirat, who was responsible for rocket launches toward Israeli territory and participated in the October 7th Massacre.", "location": "Gaza Strip", "classification": "security", "score": 0.923878038655366, "event_breakdown": "Current event:\nA Hamas terrorist responsible for rocket launches toward Israeli territory and participating in the October 7th Massacre was eliminated by the IAF aircraft in the area of Nuseirat."}, {"id": "5ea2820c-cdce-43bb-a8fe-05e2654842e1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31777/", "date": "2024-08-04 11:36", "message": "IDF Spokesperson: \n\nOn the Philadelphi Corridor: IDF Troops Located Dozens of Underground Tunnel Routes in the Area; A Three Meter High Tunnel Was Located\n\nRecently, IDF troops have been working to locate and destroy underground tunnel routes in the Philadelphi area, and so far, the troops have located and destroyed dozens of routes.\n\nAt the beginning of last week, in one of the operations to locate underground tunnel routes in the Philadelphi area, a three meter high tunnel was uncovered on the Philadelphi Corridor.\n\nAt this stage, the troops are continuing with the investigation and neutralization of the underground tunnel route, as well as other large-scale routes that were found.\n\nThe IDF will thoroughly destroy all the underground infrastructure on the Philadelphi Corridor and will act with determination to prevent their formation in the future.", "location": "Philadelphi Corridor", "classification": "security", "score": 0.8509950317752909, "event_breakdown": "IDF Troops Locate Underground Tunnel on Route, Taking out Dozens of routes along Philadelphi Corridor"}, {"id": "05d73ea7-2261-4edd-b57e-152a57a78e44", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31776/", "date": "2024-08-04 11:05", "message": "Afghanistan: The Taliban regime erected a mourning pavilion in honor of Ismail Haniyeh in the capital Kabul.", "location": "Kabul, Afghanistan", "classification": "security", "score": 0.9473082285329085, "event_breakdown": "1. Taliban regime erected a mourning pavilion in honor of Ismail Haniyeh in Kabul, Afghanistan.\n2. A news push about national security in Afghanistan."}, {"id": "9b42066c-ffa9-4fbd-ad11-cddb8cdd3348", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31775/", "date": "2024-08-04 11:04", "message": "Agence France-Presse: The French Ministry of Foreign Affairs calls on French citizens staying in Iran to leave the territory of the country temporarily.", "location": "Iran", "classification": "security", "score": 0.58658739627926, "event_breakdown": "French Ministry of Foreign Affairs calls on French citizens staying in Iran to leave the territory of the country temporarily."}, {"id": "089597a2-7f08-4b25-a002-c29f5b765244", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31773/", "date": "2024-08-04 11:04", "message": "The village of Taybeh, South Lebanon: The station that was attacked by an Israeli drone is responsible for supplying electricity to the drinking water pumping facilities in South Lebanon.", "location": "TAYbeh, South Lebanon", "classification": "security", "score": 0.9896122124142607, "event_breakdown": "Israel launches two airstrikes on Hizbollah targets in Syria\nIran-Backed Militia Attack Bases of Western-Backed Forces in Syria and Iraq\nSecurity forces intercept a truck carrying explosives in Afghanistan\nTaliban Attack Security Forces in Farah Province\nSecurity forces arrest a terrorist cell in Baghdad\nBomb Explodes at Police Station in Northern Yemen\nSecurity Forces Recapture Key Town in Eastern Ghouta"}, {"id": "594fdadc-d036-4e1e-a6ba-bc8ecd8c99a5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31772/", "date": "2024-08-04 11:03", "message": "Palestinian sources report that the terrorist Amar Odeh, who carried out this morning's attack in Holon, was arrested by the Palestinian Authority's security forces on July 15 due to a post he published on Facebook and was released from custody last Tuesday.", "location": "JERUSALEM", "classification": "security", "score": 0.54734192322738, "event_breakdown": "Amar Odeh, the terrorist who carried out this morning's attack in Holon, was arrested by the Palestinian Authority's security forces on July 15 due to a post he published on Facebook and was released from custody last Tuesday."}, {"id": "a2e938f6-d072-4615-82cc-2a6055053836", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31771/", "date": "2024-08-04 11:03", "message": "The Iranians continue to pump themselves up regarding the reaction to the assassination of Haniyeh\n\nToday a special meeting was held in the Iranian parliament to discuss the assassination of Haniyeh.\nMohammad Ghalibaf, the Speaker of the Iranian Parliament, stated that the Iranian forces will teach the Zionist enemy and its American supporters a historical lesson.\n\nGhalibaf added that the Iranian parliament, as the representative of the Iranian people, demands a deterrent response that will protect Iranian national interests as revenge for the assassination of the \"guest\" Haniyeh.\n\n##\nMuhammad \"Deif\" is also considered a \"guest\"... two guests in one month (:", "location": "Iran", "classification": "security", "score": 0.7286291425228593, "event_breakdown": "It is not clear what \"Deif\" is referring to. The only security-related event reported in the text is the assassination of Iranian military leader Qassem Soleimani in Baghdad."}, {"id": "f5741ff7-a41a-416c-ad97-0b322b491b3e", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb72477/", "date": "2024-08-04 09:41", "message": "Hamas and Islamic Jihad in an official announcement about the attack in which two elderly people were stabbed to death this morning:\n\n\"Heroic Act\"", "location": "Palestine", "classification": "security", "score": 0.9714691916693444, "event_breakdown": "Hamas and Islamic Jihad has officially claimed responsibility for the attack in which two elderly people were stabbed to death this morning in the West Bank. The attack took place at the Gush Etzion Junction, an Israeli settlement in the West Bank. Hamas and Islamic Jihad describe the attack as a \"heroic act\" against Israel. This attack comes amid heightened tensions between Israel and the Palestinians following the recent clashes at the Al-Aqsa Mosque in Jerusalem."}, {"id": "ea7c4ad9-8968-4b0e-953b-554ab49d2ba1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31759/", "date": "2024-08-04 06:52", "message": "Two of the injured in the attack in Holon this morning were pronounced dead.", "location": "Holon", "classification": "security", "score": 0.9855820651232493, "event_breakdown": "Target event:\nTwo Killed in Holon attack, Israel"}, {"id": "d385d8d5-932d-4efd-b50d-c94278d410be", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31805/", "date": "2024-08-04 19:07", "message": "The IDF spokesman publishes documentation of today's attacks in Houla and Beit Leif in southern Lebanon.\n\nAccording to unofficial Lebanese sources, only two people were injured in the attack in Beit Leif (on a motorcycle), while two were killed in the attack in Houla.", "location": "Houla", "classification": "security", "score": 0.9969229498662827, "event_breakdown": "IDF attacks in Houla and Beit Leif in southern Lebanon reported on IDF spokesman site. IDF spokesman publishes documentation of today's attacks in Houla and Beit Leif in southern Lebanon.\nIDF attacks in Houla and Beit Leif in southern Lebanon reported on IDF spokesman site. IDF spokesman publishes documentation of today's attacks in Houla and Beit Leif in southern Lebanon.\nIDF attacks in Houla and Beit Leif in southern Lebanon reported on IDF spokesman site. IDF spokesman publishes documentation of today's attacks in Houla and Beit Leif in southern Lebanon.\nIDF attacks in Houla and Beit Leif in southern Lebanon reported on IDF spokesman site. IDF spokesman publishes documentation of today's attacks in Houla and Beit Leif in southern Lebanon.\nIDF attacks in Houla and Beit Leif in southern Lebanon reported on IDF spokesman site. IDF spokesman publishes documentation of today's attacks in Houla and Beit Leif in southern Lebanon.\nIDF attacks in Houla and Beit Leif in southern Lebanon reported on IDF spokesman site. IDF spokesman publishes documentation of today's attacks in Houla and Beit Leif in southern Lebanon.\nIDF attacks in Houla and Beit Leif in southern Lebanon reported on IDF spokesman site. IDF spokesman publishes documentation of today's attacks in Houla and Beit Leif in southern Lebanon.\nIDF attacks in Houla and Beit Leif in southern Lebanon reported on IDF spokesman site. IDF spokesman publishes documentation of today's attacks in Houla"}, {"id": "d5923115-6bfb-453c-a61f-e61035cec6dc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31803/", "date": "2024-08-04 17:32", "message": "Lebanese sources report one killed and one missing in the attack on the Hossein family home in the Almaaqab neighborhood in Houla in southern Lebanon.", "location": "HULA", "classification": "security", "score": 0.9933459506263488, "event_breakdown": "Lebanese sources report one killed and one missing in the attack on the Hossein family home in the Almaaqab neighborhood in Houla in southern Lebanon."}, {"id": "b9ea82e3-aa9c-4067-ad6e-d9aa3a9afa47", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31802/", "date": "2024-08-04 17:32", "message": "The Lebanese are reporting casualties and extensive destruction in an IDF attack on a building in the village of Houla in southern Lebanon about an hour ago.", "location": "Lebanon", "classification": "security", "score": 0.9880686573552026, "event_breakdown": "IDF attacks building in southern Lebanon village, casualties reported."}, {"id": "f2b3dabf-7ee8-425e-82bf-26b1f348dbce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31801/", "date": "2024-08-04 17:31", "message": "This is what the Nasser school looks like in the west of Gaza City after the IDF attack earlier today.\nAbout 30 people were killed in the attack on the \"Nasser\" and \"Hassan Salama\" schools.", "location": "GAZA CITY", "classification": "security", "score": 0.81257720646379, "event_breakdown": "IDF attack on schools in Gaza City\nAt least 30 people were killed in an IDF attack on a school in Gaza City today. Two schools, the \"Nasser\" and \"Hassan Salama\" schools, were attacked."}, {"id": "6e852c60-9d82-4c17-a0ce-38ef26719bd1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31799/", "date": "2024-08-04 17:29", "message": "Yesterday, with the elimination of the 9 terrorists in Tulkarm with airstrikes, Israel came to account with those responsible for the fall of two members of the security forces and the murder of an Israeli civilian.\n\nIDF Spokesperson: Nine terrorists were eliminated yesterday (Saturday) in Tulkarm, including a terrorist who took part in the killings of Sergeant First Class (Res.) Elhanan Ariel Klein, Superintendent Yitav Lev Halevi, and Amnon Mukhtar\n\nYesterday (Saturday), the IDF and ISA eliminated nine terrorists in two IAF strikes in the area of Tulkarm. \n\nFollowing the precise elimination of a terrorist cell that was on its way to carry out a terror attack, the security forces initiated a counterterrorism operation in the Tulkarm area. \n\nAs part of the counterterrorism operation, an IDF aircraft struck an armed terrorist cell that fired at the forces in the area of Tulkarm. A large amount of weaponry was located on the eliminated terrorists.\n\nIn the precise IDF and ISA strike yesterday morning (Saturday), five terrorists were eliminated, including:\n\nHaitham Balidi, a significant Hamas terrorist in Tulkarm. Balidi was part of the terrorist cell that killed SSGT (Res.) Elhanan Ariel Klein, who was killed in a terror attack adjacent to the community of Einav, and 'Yamam' fighter Superintendent Yitav Lev Halevi, who succumbed to his wounds after being critically injured during encounters with terrorists in a counterterrorism operation in Tulkarm. \nThe terrorist Haitham Balidi was responsible for many terror attacks throughout Judea and Samaria in which Israeli civilians were injured.\n\nAlso eliminated was the Islamic Jihad terrorist Abed Al-Jabbar Al-Sabbagh, affiliated with the terrorist network in the Nur Shams Camp, who was involved in a large number of shooting and explosive attacks against Israeli communities, including Bat Hefer, Avnei Hefetz, and Einav. \n\nIn addition, the terrorists Ali Khalil and Jamal Abu Haniyeh, who murdered Amnon Mukhtar in Qalqilya, were eliminated in the strike.\n\nOver the past few months, cooperation was identified between the Hamas terrorist organization in Tulkarm and additional terrorists in Nur Shams, in an attempt to carry out terror attacks against Israeli targets.", "location": "Tulkarm, a city in the West Bank.", "classification": "security", "score": 0.9891771112100657, "event_breakdown": "Nine terrorists were eliminated in a drone strike in Tulkarm, a city in the northwestern West Bank. The terrorists were planning to carry out a terror attack against Israeli targets. The IDF and ISA (Israeli Security Agency) initiated a joint counterterrorism operation in the Tulkarm area in response to the killings of Elhanan Ariel Klein, a reserve Sergeant First Class, Superintendent Yitav Lev Halevi and Amnon Mukhtar."}, {"id": "345b9621-8b9b-4911-a94e-2d6af5bd3c71", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31798/", "date": "2024-08-04 15:59", "message": "The Palestinians report that Abdel Fattah al-Zarii, who is in charge of the Ministry of Economy in Gaza on behalf of Hamas, was killed in an attack on his house on Salah al-Din Street in Deir al-Balah (the central strip), a short time ago.\nHis mother was also killed in the attack.", "location": "GAZA", "classification": "security", "score": 0.9806911708557092, "event_breakdown": "Event 1:\nTarget: Abdel Fattah al-Zarii, in charge of the Ministry of Economy in Gaza on behalf of Hamas, was killed in an attack on his house located in Deir al-Balah (the central strip ).\n\nApplicable Event:\n\"Hamas official killed in attack in Gaza\""}, {"id": "bf485564-ad3c-4baa-9da6-77e37378911d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31797/", "date": "2024-08-04 15:59", "message": "Iranian sources report significant GPS disruptions in the western region of Iran (Karmanshah), where Iran's missile bases are located (the shortest range for firing from Iran to Israel is from there).", "location": "The main location where the GPS disruptions in Iran took place is 'Karmanshah'.", "classification": "security", "score": 0.8169643571969674, "event_breakdown": "GPS disruptions reported in western Iran, near missile bases."}, {"id": "6e8f2db3-8564-476e-8dec-3dcb4fa6a687", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31809/", "date": "2024-08-04 20:55", "message": "Hezbollah announces two deaths in its ranks:\n\nAli Amru\nMuhammad Farahat\n\nBoth were killed in an Israeli attack in Houla in southern Lebanon earlier today 👆\n\n392 casualties for Hezbollah since the beginning of the war.", "location": "Houla, Lebanon", "classification": "security", "score": 0.9448090149892708, "event_breakdown": "The target event for this question is:\nEvent: Two Hezbollah members were killed in an Israeli attack in Houla in southern Lebanon on May 15, 2022."}, {"id": "e0437e78-0824-49f2-b0e7-ccc9a683868b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31808/", "date": "2024-08-04 20:01", "message": "The Syrian national airline has postponed flights to Dubai (United Arab Emirates) scheduled for tomorrow \"due to urgent circumstances\".", "location": "Dubai", "classification": "security", "score": 0.7339214403799132, "event_breakdown": "The Syrian national airline has postponed flights to Dubai (United Arab Emirates) scheduled for tomorrow \"due to urgent circumstances\"."}, {"id": "d26dfccc-e7bd-40c7-86d3-fe1f1f642398", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31807/", "date": "2024-08-04 20:00", "message": "Look how beautiful the Philadelphi axis is at night... (:", "location": "Based on the text, the main location where the event takes place seems to be 'Philadelphi axis'.", "classification": "security", "score": 0.7903600880916937, "event_breakdown": "Current events of security that are reported in text that can be placed on a map include:\n\n- A bomb blast has occurred near a hotel in Colombo, Sri Lanka.\n\n- Suspected terrorists have attacked a military convoy in Pakistan, killing two soldiers.\n\n- A bomb has exploded in a hotel in Kabul, Afghanistan, killing one person and injuring several others.\n\n- Gunmen have kidnapped two aid workers in northeastern Nigeria.\n\n- A riot has broken out in a jail in Colombia, killing one inmate and injuring several others.\n\n- Police in Brazil have arrested a man they say was involved in the kidnapping of a British journalist.\n\n- A bomb blast has killed two people and injured several others in a crowded market in Pakistan."}, {"id": "64137e77-023c-4256-9641-59e3fcc043fe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en31806/", "date": "2024-08-04 20:00", "message": "Hezbollah claims, contrary to the statement of the IDF spokesman, that in the attack in the village of Leif in southern Lebanon (motorcycle attack) there were only wounded and no deaths.", "location": "FAIRFIELD COUNTY, SOUTHERN LEBANON", "classification": "security", "score": 0.9853552979993568, "event_breakdown": "Target Event: Hezbollah Claims No Deaths in Motorcycle Attack\n\nEvent Report:\nHezbollah Claims No Deaths in Motorcycle Attack-Leif, Lebanon\nA news push reports that a Hezbollah claim of no deaths in a motorcycle attack in the village of Leif, in southern Lebanon. The attack is said to only resulted in wounded and no other fatalities."}]