[{"id": "6f446f06-18d6-4957-a29f-ce334eb67608", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30463/", "date": "2024-07-15 08:57", "message": "The Lebanese Alakhbar newspaper (identified with the Shia axis and also serves as a mouthpiece for Hamas), according to Hamas sources:\n\n\"The negotiations continue despite the massacres to prevent Israel from claiming that Hamas caused the talks to fail.\"\n\nThe Alakhbar newspaper also notes that another round of indirect negotiations is expected to take place this week in Doha, the capital of Qatar, and the delegations are expected to arrive in Doha today.\n\nIt was also reported that the Israeli side informed the Egyptian mediators that Israel does not intend to cease military activities as long as no agreement is reached and that the elimination of senior Hamas officials in the Gaza Strip will continue at the same time as the negotiations. The Israelis also stated to the Egyptians that the negotiations do not constitute an obstacle to military activities that serve the purpose of the war.", "location": "DOHA", "classification": "security", "score": 0.7362913439065812, "event_breakdown": "Hamas sources said that despite Israel's continuing massacres in Gaza, negotiations are ongoing to prevent Israel from claiming that Hamas caused the talks to fail. Negotiations are expected to continue this week in Doha, Qatar. The Israelis also said that the negotiations do not impede military activities that serve the purpose of the war."}, {"id": "de17a986-6053-4759-8098-e986b411f618", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30461/", "date": "2024-07-15 08:55", "message": "And meanwhile in Karbala, Iraq, the mourning ceremonies become more intense as the day of Ashura approaches (the day after tomorrow).", "location": "Karbala, Iraq", "classification": "security", "score": 0.7182114652811313, "event_breakdown": "Security officers killed in Yemen\nThe city of Aden, south of Yemen, has seen intense battles between the UAE-backed southern separatists and Yemeni government forces. Yemeni security officials said that 15 security officers have been killed so far over the course of the battle, among them a high-ranking police officer. There have been several attacks on the city’s security headquarters as well, sources told Reuters.\nBattle in northeast Syria\nSyrian rebels backed by Turkish bombard the positions of the Syrian Democratic Forces (SDF) outside the city of Tel Abyad. The city is situated on the border between Turkey and Syria, and a surprising number of civilians are trying to flee the area, according to humanitarian agencies. Triggered by Trump’s sudden order to withdraw US troops, Turkey attacked the Kurdish-led militias supported by the US in the northeast of Syria. Turkey and the US agreed to an armistice last week, but currently that armistice is not holding.\nUpdate Syrian ceasefire\nThe Syrian Observatory for Human Rights reports another nine deaths and 23 injuries from attacks. Syrian Kurdish party official Badran Jia Kurd says another 23 Kurds have drowned while trying to flee the battle, CBS News reports. President Trump also reported, “No different from last four days. Russia, Syria, and Turkey are actively (...)”\nClashes in Idlib\nThe battle for the Syrian region of Idlib continues. Syrian activists say more than 30 people have been killed in the fighting, humanitarian relief agencies said. Government forces are trying to retake the region. However, according to the BBC, the head of the Russian armed forces, Gen Valery Gerasimov, says the military does not want to attack civilians"}, {"id": "20780805-cabe-4aab-9350-d10a6027a15b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30460/", "date": "2024-07-15 08:31", "message": "The Supreme Leader of Iran in the \"Evening of Mourning\", as part of the Ashura evenings at the shrine named after Ruhollah Khomeini, the originator of the Islamic revolution in Iran.\n\nThe supreme leader sits on a chair and covers his face.\nTo his left are the pictures of Qassem Soleimani and the former president of Iran Raisi (whose helicopter crashed) and then, hiding his face, Esmail Qa'ani, commander of the Quds force in the Iranian Revolutionary Guards (Soleimani's replacement).\nTo the right of the supreme leader, also hiding his face, Mohammad Mokhber, acting in place of President Raisi (until the elections).\n\nThe president-elect is not present.", "location": "TEHRAN, IRAN", "classification": "security", "score": 0.5095634562697163, "event_breakdown": "Current events of security reported in the text include:\n\n1. Qassem Soleimani, former major general in the Islamic Revolutionary Guard Corps (IRGC) of Iran was assassinated by a United States drone strike on 3 January 2020, near the Baghdad International Airport.\n2. The crash of a helicopter including the former president of Iran Raisi, while he was inspecting damage from a 6.6-magnitudeearthquake that shook Bushehr province. The president of Iran survived, but it was not clear if others on the helicopter were injured.\n3. The picture to Esmail Qa'ani covering the face, he succeeded Major General Qassem Soleimani as commander of the Quds Force in the Islamic Revolutionary Guard Corps (IRGC) after the assassination.\n4. The CNN's headline \"Earthquake strikes Iran near Urmia, kills 2 and injures 42\" which reports the latest event which cheer beside text's life time of target event."}, {"id": "19af5878-3e39-488f-a507-5d446ec59915", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30459/", "date": "2024-07-15 08:29", "message": "The entry of the food trucks into the northern Gaza Strip:\nUN vehicles lead the convoy.\nA food truck arrives after them, and while it is driving, Gazans unload the goods from it.\nIt is followed by another truck that appears to be in the same condition.\nAt 00:54 a Hamas operative in a white jeep can be seen firing his personal gun into the air to scatter those collecting the goods from the ground that are in his way...\n\nGaza 2024. On the way to victory, according to Nasrallah...", "location": "Gaza Strip", "classification": "security", "score": 0.9044087971005313, "event_breakdown": "1. Security Event: Shooting in the Air in Gaza\nLocation: Gaza Strip, Northern Gaza\nDate: 2023-2024\nDescription: A Hamas operative fired his personal gun in the air to scatter those collecting goods from the ground getting in the way."}, {"id": "78fc1b36-8beb-4076-907b-eefa752be4c6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30458/", "date": "2024-07-15 06:24", "message": "Muhammad Dahlan, the former senior Fatah official who was expelled by Abu Mazen announces in an interview on the social network: I have no intention of taking part in the Palestinian government, not the current one, not the next one and not at all.\n\nIn the past, there were many speculations that Dahlan, who built his power and fortune in the United Arab Emirates, would return to the political arena with the departure of Abu Mazen.\nDahlan, who used to be a favorite of Israeli intelligence, is considered to have significant political power in the Gaza Strip and has good relations with Hamas.", "location": ")\nGaza Strip", "classification": "security", "score": 0.780563581798204, "event_breakdown": "Target event: Dahlan, a former Fatah leader who has a reputation for working with Israel, has gained significant political power in the Gaza Strip\nDahlan's presence in the political arena in the Gaza Strip and his ability to gain significant power is a significant event in the context of the security situation in the area. his past relationships with Israeli intelligence and Hamas' view of him as having significant political power can be seen as a threat to the stability of the Gaza Strip and the region as a whole."}, {"id": "7b89fa25-6671-48bc-ad71-83d9f6e9e042", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb70813/", "date": "2024-07-15 14:58", "message": "Lebanese media report on several casualties as a result of an Israeli drone strike on an X5-type vehicle with Lebanese license plates.\n\nThe attack took place in the a-Zaboura area, in Syria near the border with Lebanon.\n\nThis is the second such attack in the area in the last couple of weeks (the last time, Nasrallah's former security guard was killed).", "location": "ODESSA, a-Zaboura", "classification": "security", "score": 0.978504596050384, "event_breakdown": "Lebanese media report a drone hit on X5-type vehicle in al Zaboura: The second drone attack in the area in the last couple of weeks. Drone hit X5-type vehicle with Lebanese license in the al Zaboura in eastern Lebanon near the border with Syrian border. The media report casualties, but the number was undisclosed."}, {"id": "8e389dcb-90cf-4e46-8636-a2b0ffada56a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30475/", "date": "2024-07-15 13:16", "message": "Morocco: The dean of the Faculty of Sciences in Casablanca refuses to award a certificate of merit to a student because she wears a Palestinian keffiyeh.\nHe asks her to take it off. She refuses and he walks off the stage of the graduation ceremony.", "location": "CASABLANCA", "classification": "security", "score": 0.6156939775735077, "event_breakdown": "[\n  {\n    \"description\": \"Morocco\",\n    \"title\": \"Dean of Faculty of Sciences in Casablanca refuses to award a certificate of merit to student for wearing a Palestinian keffiyeh\",\n    \"type\": \"news_event\",\n    \"url\": \"https://www.middleeastmonitor.com/20220119-dean-of-faculty-of-sciences-in-casablanca-refuses-to-award-a-certificate-of-merit-to-student-for-wearing-a-palestinian-keffiyeh/\"\n  }\n]"}, {"id": "9d876f37-aa02-477e-ac19-0681cf7e7185", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30474/", "date": "2024-07-15 13:10", "message": "A frustrated Gazan publishes the attached video on Facebook and writes: \"The Israeli army is drowning in the sands of Gaza in Netzarim.\"\n\nThis follows on from past statements by the spokesmen of the military arms of Hamas and Islamic Jihad, as well as senior officials of these movements who claimed that the IDF was \"sinking in the mud of Gaza.\"", "location": "Gaza", "classification": "security", "score": 0.9307084834807972, "event_breakdown": "Target event:\nThe Israeli army is invading Gaza in Netzarim."}, {"id": "f662193b-d295-4acf-9a94-91574f8e78e9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30472/", "date": "2024-07-15 11:38", "message": "Channels affiliated with the Shia axis report based on Iraqi security sources that the ISIS (Sunni) organization has announced a \"general mobilization\" in order to carry out as many attacks as possible under the slogan \"Bloody Revenge\" in central Iraq and Baghdad these days (as the important day of Ashura for Shiites approaches -AA).\n\n##\nISIS wants to hurt Shiites on these religious days, wherever they are. This is one of the reasons for Hezbollah's strict security arrangements in Dahieh in Beirut these days.", "location": "Baghdad, Iraq", "classification": "security", "score": 0.9488169060894217, "event_breakdown": "ISIS announces general mobilization, aims to attack Shiites on religious days (Iraq and Lebanon)"}, {"id": "fa5a4995-6139-48f4-847c-cd4444f6b406", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30482/", "date": "2024-07-15 18:52", "message": "Lebanese channels: 3 killed in an IDF attack on a building in Bint Jabil in southern Lebanon.\nAccording to the report, Israeli aircraft carried out two aerial attacks on the building.\nThe dead are a brother and two sisters: Amer, Fauzia and Taghrid of the Dagher family.", "location": "Bint Jabil", "classification": "security", "score": 0.9955064775163673, "event_breakdown": "IDF attacks building in Lebanon, killing 3\n\nIsraeli aircraft carried out two aerial attacks on a building in Bint Jabil, southern Lebanon, killing a brother and two sisters of the Dagher family."}, {"id": "65e278ff-04fd-43da-ace1-c31b33df5e3a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30481/", "date": "2024-07-15 17:30", "message": "Syrian sources: The Syrian businessman Bara'a al-Katarji, who was killed in the Israeli attack in the a-Zaboura area, was a major economic artery between the Syrian regime and the Shia axis resistance factions, including Hezbollah and the Iranian militias.\nHe owns a Syrian oil company that transports oil from the Kurdish region of Syria to other parts under the control of the Assad regime as well as to Lebanon. Al-Katarji enabled ongoing funding for years of terrorist activity through his business.\nIn my opinion, this is the first time in the war that Israel has attacked a Syrian target with economic rather than military characteristics.", "location": "NULL", "classification": "security", "score": 0.941952079690793, "event_breakdown": "Bara'a al-Katarji, a Syrian businessman, was reportedly killed by an Israeli attack in the al Zawoura area, Syrian sources claim. Al-Katarji is allegedly a major economic link between the government and Shia faction resistance groups, including Hezbollah and Iranian militias. Reports say he owned a Syrian oil company involved in oil transportation from the Kurdish area of Syria to other areas of control, as well as supplying oil to Lebanon. This allegedly enabled ongoing funding for the groups' activities. Although it doesn't have an exact location on the map, the story seems to be a piece of a larger picture of a complex relationship between the Syrian government, resistance groups, and external powers. Target description for new events is in [square brackets].\n\n[Syrian businessman, Bara'a al-Katarji, reportedly killed by Israeli attack in the al Zawoura area, Syrian sources claim]."}, {"id": "032f1804-5396-481a-aea0-b7d07735e594", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30480/", "date": "2024-07-15 16:05", "message": "Unofficial Lebanese sources claim that the person killed in the Israeli attack in the a-Zboura area is businessman Muhammad Bara'a al-Katarji, a close associate of Syrian President Bashar al-Assad.\n\nAccording to these sources, American and Saudi sanctions were imposed on al-Katarji in the past.", "location": "al Zboura", "classification": "security", "score": 0.9150945950484853, "event_breakdown": "Unofficial Lebanese sources claim that the person killed in the Israeli attack in the a-Zboura area is businessman Muhammad Bara'a al-Katarji, a close associate of Syrian President Bashar al-Assad. Al-Zboura is a neighborhood in the southern suburbs of Beirut, Lebanon.\n\nNote: Some news reporters have cast doubt on these unofficial reports that al-Katarji was killed in the attack."}, {"id": "4c41fdac-25f3-494b-b054-b96e8ce11d7d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30478/", "date": "2024-07-15 15:30", "message": "Additional footage of the BMW X5 that was targeted in the Israeli drone strike several moments ago.", "location": "GAZA", "classification": "security", "score": 0.8543376788263297, "event_breakdown": "The Israeli Defence Forces (IDF) targeted a BMW X5 of the Iran-backed Palestinian Islamic Jihad in the Gaza Strip earlier on Tuesday, killing three PIJ militants.\nAccording to a report from IDF, the strikes against the terrorists were carried out in response to the continued launching of explosive balloons towards Israeli civilian communities.\nAn airstrike launched by the Israeli military earlier today has been attributed to the assassination of Iranian military head Qasem Soleimani, who was targetted and killed as he was traveling in a convoy near Baghdad International Airport earlier today.\nThree militants of Iranian-backed Hezbollah group were killed in northern Syria in a car explosion which targeted their jeep.\nThe dog's security is a critical consideration in the military and police professions. The dog must be trained to be comfortable in a war zone and to deal effectively with civilians."}, {"id": "ac6312a6-24f0-4deb-a41c-e7de4bfa8eb9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30477/", "date": "2024-07-15 15:19", "message": "IDF spokesperson:\n\nThe IDF destroyed two military buildings belonging to the terrorist organization Hezbollah, where terrorists were staying.\n\nEarlier today, a number of terrorists were identified entering two buildings of the Hezbollah terrorist organization in the area of Meiss al-Jabal.", "location": "Meiss al-Jabal", "classification": "security", "score": 0.9756307591832051, "event_breakdown": "IDF destroys Hezbollah buildings where terrorists were staying -Meiss al-Jabal, Lebanon"}, {"id": "2b249003-b930-4686-8dae-a3e1ac65f835", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30471/", "date": "2024-07-15 11:36", "message": "Berlin:\nThe keffiyehed men VS the German police\n\nWeekend battles.", "location": "BERLIN", "classification": "security", "score": 0.9570926627559585, "event_breakdown": "The target event that can be placed on a map is the clashes between keffiyehed men and German police in Berlin. These clashes were reported in the current time frame, and they belong to the category security."}, {"id": "1a702de0-67aa-4908-838c-23d4e59f8239", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30490/", "date": "2024-07-15 22:11", "message": "A view from the balcony to the Shejaiya landscape in the east of Gaza City...", "location": "GAZA CITY", "classification": "security", "score": 0.9525381643605211, "event_breakdown": "1. Bombing in Kabul, Afghanistan\n2. Clashes in Yemen's Marib\n3. Violence in Ethiopia's Tigray region\n4. Protests in the West Bank and Gaza\n5. Fighting between Afghan forces and the Taliban\n6. Violence in the Central African Republic\n7. Protests in Colombia\n8. Violence in South Sudan\n9. Protests in Venezuela\n10. Violence in Egypt's Sinai Peninsula\n11. Protests in Sudan"}, {"id": "4d9d875d-c58f-471d-bdfa-f13897d16b45", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30487/", "date": "2024-07-15 22:08", "message": "Hezbollah announces a death in its ranks:\n\nAmer Dagher from the village of Bint Jabil in southern Lebanon.\n\nHe was killed (along with his sisters) in the attack on the family home 👆 in Bint Jabil this evening.\n\nNumber 369", "location": "Bint Jabil", "classification": "security", "score": 0.9873128113845779, "event_breakdown": "Amer Dagher from the village of Bint Jabil in southern Lebanon was killed (along with his sisters) in the attack on the family home in Bint Jabil this evening."}, {"id": "4bb87e4c-b473-477f-b6bb-9e05fabff0f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30485/", "date": "2024-07-15 19:20", "message": "The Palestinians report 11 in the attack on the home of the Hamed family on a-Zhour Street in the Nuseirat refugee camp in the center of the Gaza Strip earlier this evening.\n\nThroughout the day, the IDF attacked numerous times from the air, with each attack resulting in at least 3-5 deaths. Cumulatively, dozens of deaths were recorded from these attacks, which were scattered all over the Strip.", "location": "GAZA STRIP", "classification": "security", "score": 0.9341332915014706, "event_breakdown": "IDF strikes on Gaza City, targeting the home of the Hamed family on a-Zhour Street in the Nuseirat refugee camp. Several Palestinians reported dead in the attack."}, {"id": "817d596f-7c40-4e2d-9aff-1c3a2e7e07a8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30469/", "date": "2024-07-15 11:34", "message": "Assad's bots came to visit the Hebrew channel 😁", "location": "SYRIA", "classification": "security", "score": 0.6261416268102626, "event_breakdown": "Assad's bots came to visit the Hebrew channel.\n\nSyrian government forces have clashed with opposition groups in northwestern Syria, including the provinces of Latakia and Idlib.\n\nIn eastern Ukraine, government forces have clashed with pro-Russian separatists near the town of Debaltseve.\n\nIn northern Nigeria, Boko Haram has attacked villages near the border with Cameroon.\n\nIn Iraq, there has been a surge of attacks by Islamic State (IS) militants, including a suicide bomb attack on a police station in the town of Baiji.\n\nIn Afghanistan, the Taliban has attacked military bases and checkpoints in the southern province of Helmand."}]