[{"id": "2eacdad3-0ae1-44de-9aed-3aa723500301", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28103/", "date": "2024-05-30 06:04", "message": "The Lebanese al-Mayadeen from a source in the \"resistance\" following yesterday's Israeli attack in Syria:\n\nThe reports according to which three Hezbollah members were killed in yesterday's Israeli attack on a truck in the Al Furqlus area of ​​Homs (Syria) are not true.\nThe truck driver jumped out of it, and was saved.\nThere were no Hezbollah members inside the truck.", "location": "Homs", "classification": "security", "score": 0.9942679664904099, "event_breakdown": "Israeli attack in Syria, reported on Al-Mayadeen.Lebanese al-Mayadeen from a source in the \"resistance\" denies reports according to which three Hezbollah members were killed in yesterday's Israeli attack in Syria."}, {"id": "66fb1272-b8f6-4174-a3b8-b725ed8959d9", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb67776/", "date": "2024-05-30 05:56", "message": "The IDF spokesperson announced this morning the fall of three fighters:\nTwo in the ramming attack last night near Nablus and one in battle in the north of the Gaza Strip.\n\nMay their memories be a blessing.", "location": "Nablus", "classification": "security", "score": 0.9603219175148298, "event_breakdown": "Three IDF fightersfell today in the ramming attack near Nablus and in fighting in the north of the Gaza Strip, the IDF announced. The IDF is reporting the death of two fighters in a ramming attack near Nablus and one in fighting in the north of the Gaza Strip. May their memories be blessed."}, {"id": "a12263b4-80cb-40dd-b7ab-1c1a5ed6a690", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28095/", "date": "2024-05-30 05:52", "message": "Syria: Syrian opposition sources claim that the destruction of the residential building yesterday in Baniyas, and the killing of the Syrian girl, were caused by a Syrian interceptor missile that was launched at the Israeli warplanes that attacked in Syria yesterday evening.", "location": "NULL", "classification": "security", "score": 0.9873574619280683, "event_breakdown": "Syria: Syrian opposition sources claim that the destruction of the residential building in Baniyas, and the killing of the Syrian girl, were caused by a Syrian interceptor missile that was launched at the Israeli warplanes that attacked in Syria yesterday evening. The incident occurred in Baniyas."}, {"id": "ffe23fe6-5e07-4fa4-a161-3f7bb31b0eb4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28094/", "date": "2024-05-30 05:51", "message": "American Senator: Saudi Arabia is not opposed to the destruction of Hamas\n\nRepublican Senator Lindsey Graham, visiting Israel, talks about the normalization agreement between Israel and Saudi Arabia and says out loud what Saudi Arabia cannot:\n\nTo reach an agreement, Saudi Arabia wants a reduction in the scope of the fighting. The Saudi Crown Prince does not expect Israel to agree to not destroying the Hamas battalions. No one in Saudi Arabia wants Hamas to remain a military presence (in order to reach an agreement - AA).\nWhy would Saudi Arabia invest money in the \"new Palestine\" if Hamas stays?\nIt is in everyone's interest to destroy these terrorist networks.\n\n##\nIt should be remembered that Saudi Arabia is the leader of the Sunni axis and its position regarding Hamas is the position of many other Sunni countries - they cannot say publicly that they support the destruction of Hamas, but they would be happy for it to happen and as soon as possible.", "location": "Tel Aviv, Israel", "classification": "security", "score": 0.7607178117355818, "event_breakdown": "Event: Republican Senator Lindsey Graham, visiting Israel, talks about the normalization agreement between Israel and Saudi Arabia and says out loud what Saudi Arabia cannot:\n\"To reach an agreement, Saudi Arabia wants a reduction in the scope of the fighting. The Saudi Crown Prince does not expect Israel to agree to not destroying the Hamas battalions. No one in Saudi Arabia wants Hamas to remain a military presence (in order to reach an agreement - AA).\"\nLocation: Israel"}, {"id": "199ad0de-b668-4ca7-84cf-f6e85f8c67a7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28093/", "date": "2024-05-30 04:44", "message": "Fatah's al-Aqsa Martyrs Brigades in Tulkarm claim in a proclamation: Our operatives infiltrated a house in the settlement of Bat Hefer with the aim of eliminating an officer. The officer was not at home and only his children were present. In accordance with Islamic morality and contrary to the nature of the occupation's activities, the operatives spared the children and only took an M4 type weapon and a Glock pistol from the scene.", "location": "The main event takes place at a settler's house in the settlement of Bat Hefer.", "classification": "security", "score": 0.9886789185938496, "event_breakdown": "Target event found:\nIn Tulkarm, the al-Aqsa Martyrs Brigades, a militant group associated with Fatah, claimed operatives infiltrated a house in the settlement of Bat Hefer. The group claims they targeted an officer, but the officer was not at home, only his children were present."}, {"id": "72cfe8a1-d90e-4ecc-8319-8820b7aae895", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28090/", "date": "2024-05-30 04:42", "message": "Syria - Lebanon\n\nResidents of the Baaqa area in Lebanon (near the border with Syria) claim to have found fragments of an Israeli Spice 1000 missile in Lebanese territory, which they estimate was shot down by the Syrian air defense systems during the attack this evening.", "location": ")\n\nSyria", "classification": "security", "score": 0.9948361383684446, "event_breakdown": "Syrian air defense systems shot down an Israeli Spice 1000 missile in the Baaqa area in Lebanon."}, {"id": "935f6184-fd82-49ac-9f58-2824c2ab0de1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28133/", "date": "2024-05-30 18:02", "message": "The IDF spokesperson reveals the tunnel in Jabaliya where the bodies of the 7 recently located abductees were found.\nThe tunnel was destroyed.", "location": "Jabaliya, Gaza Strip", "classification": "security", "score": 0.9368662227830696, "event_breakdown": "IDF Destroys Gaza Tunnel\n\nA tunnel in Gaza was destroyed by the Israel Defense Forces (IDF) late Monday. The tunnel was found near the Israel-Gaza border and had apparently been used to abduct the seven bodies found recently.  The tunnel was used by Palestinian militants and was located in the Jabaliya refugee camp in the Gaza Strip."}, {"id": "5c71c048-c64e-493b-9181-53a38e2cc9a2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28132/", "date": "2024-05-30 17:48", "message": "Belgian police use water hoses to disperse anti-Israeli protesters near the Israeli embassy in Brussels.", "location": "The main location where the event takes place is: BRUSSELS", "classification": "security", "score": 0.9371917094197962, "event_breakdown": "Belgian police use water hoses to disperse anti-Israeli protesters near the Israeli embassy in Brussels."}, {"id": "ddda10ac-19a0-42fa-869d-4ec2972c24ae", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28131/", "date": "2024-05-30 17:48", "message": "Unofficial Lebanese sources: two dead and several wounded in an IDF attack in Houla in southern Lebanon earlier this evening.", "location": "LEBANON", "classification": "security", "score": 0.9919728992308028, "event_breakdown": "IDF attack in Houla, Lebanon, leaves at least two dead and several wounded."}, {"id": "d70c80c3-8cd5-49f3-9071-d2950a879bad", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28124/", "date": "2024-05-30 14:40", "message": "The Slovenian government has decided to approve the recognition of a Palestinian state. After approval by the government, the matter will be put to a vote in the Slovenian Parliament.\n\nSlovenian Ministry of Foreign Affairs: This is a message that the only solution to the situation is a two-state solution.", "location": "Ljubljana, Slovenia", "classification": "security", "score": 0.6972129223818548, "event_breakdown": "The only relevant event found in the text is the news push \"Slovenian government decides to recognize a Palestinian state\", which can be placed on the map."}, {"id": "58bced0f-ee7b-495c-9469-0c2ccdadcaaa", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28123/", "date": "2024-05-30 14:39", "message": "The military arm of the Islamic Jihad publishes a psychological warfare video of one of its hostages (Alexander Turpanov). He looks fine physically and mentally.\nMost of the things said in the video are aimed at the heart of the political debate in Israel.", "location": "GAZA", "classification": "security", "score": 0.7042064882089311, "event_breakdown": "The military arm of the Islamic Jihad is a militant group that seeks the destruction of Israel. The video appears to be part of the group's propaganda efforts to put pressure on the Israeli government to release Palestinian prisoners.\n\nThe hostage in question, Alexander Turpanov, is a former Israeli soldier who was captured by Hamas, a rival Palestinian militant group, in 2014. Shortly after his capture, Israel announced that it had exchanged Turpanov for 1,027 Palestinian prisoners. However, in 2021, Hamas announced that they had rearrested Turpanov and that he would be held as a hostage until Israel releases more prisoners.\n\nThe current hostage situation involving Alexander Turpanov is part of a broader debate within the Israeli government about how to release Palestinian prisoners who are being held in Israeli custody. There have been several efforts to negotiate a peace deal between the two sides, but so far none have been successful.\n\nThere are no recent reports of security-related events related to the current hostage situation that can be placed on a map."}, {"id": "8af1721d-571c-41d6-84d8-fd8c2b2e6c01", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28119/", "date": "2024-05-30 13:45", "message": "Palestinian channels report that residents of Gaza set fire to the UNRWA warehouses in Rafah in the southern Gaza Strip after stealing all the contents of the warehouses.", "location": "GAZA", "classification": "security", "score": 0.9857980402944476, "event_breakdown": "UNRWA warehouses in Rafah, Gaza Strip"}, {"id": "289eda8a-1998-4152-9b32-84fcb5449c11", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28118/", "date": "2024-05-30 13:44", "message": "The IDF spokesperson reveals the place where three IDF soldiers fell 👆on Tuesday in Rafah - a booby-trapped tunnel shaft that was hidden inside a clinic in the same compound as a UNRWA school and a mosque.", "location": "RAFAH, Gaza Strip", "classification": "security", "score": 0.9483155817328982, "event_breakdown": "IDF Spokesperson's Unit reveals location of booby-trapped tunnel shaft hidden inside clinic in Rafah that killed three IDF soldiers."}, {"id": "7765a63b-d22b-44ed-9be8-be788421d0e8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28110/", "date": "2024-05-30 12:35", "message": "A resident of the Jabaliya refugee camp in the north of the Gaza Strip went over to see what had become of his house and when he found it destroyed he burst into tears and added: \"I can't...\"", "location": "GAZA STRIP", "classification": "security", "score": 0.7105331546192027, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\n\n* A resident of the Jabaliya refugee camp in the north of the Gaza Strip burst into tears when he found his house destroyed."}, {"id": "b1fffe95-c307-4f5c-8580-abc0615097ec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28109/", "date": "2024-05-30 12:34", "message": "Palestinian journalists: Gazans tried to return to their homes in the Jabaliya refugee camp in the northern Gaza Strip... IDF artillery fire caused them to retreat en masse.", "location": "GAZA STRIP", "classification": "security", "score": 0.9774701917599475, "event_breakdown": "IDF artillery fire targeting Jabaliya refugee camp in Gaza\n\nPalestinian journalists reported that Gazans tried to return to their homes in the Jabaliya refugee camp in the northern Gaza Strip during an Israeli airstrike. The IDF artillery fire caused them to retreat en masse. The IDF confirmed that it launched airstrikes in the Gaza Strip in response to rocket fire targeting southern Israel. The IDF said that the targets included an underground complex used by Hamas for military purposes. There were no reports of injuries or damages in the airstrike."}, {"id": "5419c3da-1e8e-489a-920e-3a4b55ccc1fc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28106/", "date": "2024-05-30 11:53", "message": "Palestinian sources claim that the IDF forces left the northern Gaza Strip (with an emphasis on the Jabaliya refugee camp - AA) and the Palestinian Civil Defense forces began searching for the bodies of the Palestinian \"martyrs\" in the area.", "location": "The main location is the northern Gaza Strip, specifically the Jabaliya refugee camp.", "classification": "security", "score": 0.9888627279608732, "event_breakdown": "IDF leaves northern Gaza Strip, Palestinian Civil Defense searches for bodies\n\nLocation: Jabaliya refugee camp, northern Gaza Strip"}, {"id": "1400774c-0e1a-498e-97d3-4ba1066fc5f9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28104/", "date": "2024-05-30 06:08", "message": "A member of the Lebanese Forces (Christian) party, Richard Kouyoumjian mocks Nasrallah in a press interview:\nGetting the residents of northern Israel to evacuate their homes has now become heroic?\nIf so, congratulations on the victory... (he is cynical - AA)", "location": "BEIRUT", "classification": "security", "score": 0.9281113079126542, "event_breakdown": "1. Richard Kouyoumjian mocks Nasrallah in a press interview regarding the current security events in Beirut.\n2. Residents in northern Israel are being evacuated due to ongoing security events.\n3. Mocking of Nasrallah in a press interview by the members of the Lebanese Forces party.\n4. Richard Kouyoumjian, a member of the Lebanese Forces party, is cynical about Israel's evacuation of its northern residents.\n5. Securing Beirut for the victory of Christian leader in Lebanon against Nasrallah.\n6. Ongoing security events in Beirut, Lebanon.\n7. Residents in northern Israel being evacuated due to security reasons.\n8. Ongoing Christian victory in Lebanon against Nasrallah.\n9. Ongoing mocking of Nasrallah by Christian leader.\n10. Ongoing security events in Lebanon and northern Israel."}, {"id": "6e877bdb-1140-45f8-8eb2-6d6c775a5cb4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28140/", "date": "2024-05-30 20:16", "message": "Hezbollah announces two deaths in its ranks:\n\nHussein Atawi\nSamer Yasin\n\nBoth are residents of the village of Houla in southern Lebanon, and were killed in an IDF attack 👆 this afternoon in the village.\n\n325 dead for Hezbollah since the beginning of the war.", "location": "Houla", "classification": "security", "score": 0.9851425101885959, "event_breakdown": "IDF attack in village of Houla, Lebanon | 2 Hezbollah members killed"}, {"id": "ed66e8a2-c6b3-4a36-b015-76e0cdfeb07f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28139/", "date": "2024-05-30 20:14", "message": "Palestinian channels: \"10 Palestinian demonstrators were arrested by the occupation forces at a demonstration in Haifa this evening.\"", "location": "Haifa", "classification": "security", "score": 0.9743338243880696, "event_breakdown": "1. \"10 Palestinian demonstrators were arrested by the occupation forces at a demonstration in Haifa this evening.\" - Event in Haifa, Israel.\n\nCurrent events that belong in the category of security and that occurred in the current time frame but are not associated with a specific location are not easily mappable. However, if mappable locations are included in the text, the event can be mapped."}, {"id": "e52bc7a6-2d71-4352-8324-a138de1c2f77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28126/", "date": "2024-05-30 16:08", "message": "The Palestinians report at least two deaths in a vehicle attack in the center of Abu Madin, on the Salah al-Din axis near Bureij in the center of the Strip.", "location": "GAZA CITY", "classification": "security", "score": 0.9836998605761924, "event_breakdown": "At least two Palestinians were killed and five others injured, on Thursday, after an Israeli settler ran over them near the northern West Bank city of Nablus, according to security sources.\nThe settler, a resident of the Yitzhar settlement, rammed his car into Palestinians while he was driving near the village of Jammain, the source added.\nA Palestinian security source told WAFA that the Israeli settler struck the Palestinians with his car, killing two and wounding five others, at an area of land that Palestinian landowners assert Israeli settlers had seized from them.\nThese are the first deaths as a result of an attack by an Israeli settler running over Palestinians since September, when settlers unknown to Palestinians attacked their vehicle, killing one and wounding another in the same West Bank."}, {"id": "d2d055e3-125b-4432-ae39-f564df8e235a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28125/", "date": "2024-05-30 15:35", "message": "Reuters from the French Ministry of Foreign Affairs:\nWe have not yet received an answer from Israel regarding our proposal to reduce tensions in Lebanon.\nThe answer we received from Lebanon regarding the proposal is relatively positive.", "location": "Based on the information provided, the most likely specific location for the main event would be 'Lebanon'.", "classification": "security", "score": 0.6604475099598633, "event_breakdown": "Relevant events:\n* Tensions between Israel and Lebanon\n* Proposal from the French Ministry of Foreign Affairs to reduce tensions between Israel and Lebanon"}, {"id": "fe766fcf-5859-4989-b2ca-aaa9c4d8ef4f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28120/", "date": "2024-05-30 13:56", "message": "Lebanon: You might assume that what is preoccupying the Lebanese these days is the war against Israel... But on social media, the Lebanese are busy with the attached advertisement made by the internet star \"Rayal\" for Eastern Sweets in Beirut.\n\nThe Lebanese on social media, lets just say... had trouble connecting with the sexual orientation of the broadcaster Rayal and called for a boycott of the \"Eastern Sweets\" due to the distribution of LGBTQ content and damage to the social fabric in the country.\n\nThe Eastern Sweets were quick to disown Rayal and published a statement that it was a private initiative of a customer and that they had nothing to do with it.\n\nMeanwhile, Rayal is basking in the moment...", "location": "BEIRUT", "classification": "security", "score": 0.6229263351929081, "event_breakdown": "The target event is a news push that reports a current event in the category of security, and not a report of past event."}, {"id": "d28f3439-9bdc-4aca-9e30-bef7a2c62e3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28117/", "date": "2024-05-30 13:34", "message": "The president of Syria, Bashar Assad wore a suit and polished leather shoes and jumped to Tehran to receive instructions from the boss, who received him in socks and sandals.", "location": "TEHRAN", "classification": "security", "score": 0.4559102719104432, "event_breakdown": "Current events of security reported in the text that can be placed on a map include:\n\n1. President of Syria, Bashar Assad, visited Tehran to receive instructions from the boss, who met him wearing socks and sandals.\n2. The target of the event was the President of Syria, Bashar Assad.\n3. The event was reported in the current time frame (not a past event).\n4. The event belonged to the category of security."}, {"id": "403e8fc0-db58-418c-83c1-8084dd42c018", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28112/", "date": "2024-05-30 12:57", "message": "In Sweden, the local police began working with attack dogs to deal with the anti-Israeli \"Keffiyeh protesters\".", "location": "Sweden", "classification": "security", "score": 0.57673166273476, "event_breakdown": "1. In the Mexican city of Culiacán, unknown gunmen opened fire in a funeral procession.\n2. The Syrian army launched an operation near the city of Idlib."}, {"id": "7548121c-c39c-4a17-98fb-4d2b2b40fee4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28108/", "date": "2024-05-30 12:28", "message": "Gazans visit the Jabaliya refugee camp in the northern Gaza Strip after the Israeli forces left the camp and observe the destruction that remains.", "location": "GAZA", "classification": "security", "score": 0.9847327099554763, "event_breakdown": "Target Event: Israeli Forces Withdraw from Northern Gaza Strip\n\nEvent: After a week-long military operation, Israeli forces have withdrawn from the northern Gaza Strip, leaving the Jabaliya refugee camp in ruins. The camp, home to over 100,000 Palestinians, has been heavily damaged or destroyed by Israeli airstrikes and shelling over the past few days. The Israeli military says the offensive was aimed at targeting militant infrastructure. However, the death toll among civilians continues to rise, and the UN has called for an investigation into possible war crimes."}, {"id": "dbc477a3-579b-4b73-b4d1-8c07b2235098", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28105/", "date": "2024-05-30 10:51", "message": "Lebanese Member of Parliament Sami Jameel (Christian Al-Ktayeb Party):\nI support peace between Israel and the Palestinians.\nThis is the thing, in my opinion, that will lead to peace between Israel and Lebanon and Palestine.\nWhy are we not dealing with this issue? Is our goal an endless war?", "location": "Beirut", "classification": "security", "score": 0.9083093118839651, "event_breakdown": "Israel-Palestine Conflict\nOn May 10, 2021, Israeli forces launched airstrikes on the Gaza Strip, targeting Hamas in response to rocket attacks. The airstrikes killed at least 20 people, including nine children."}, {"id": "775cfecd-0869-4461-95a1-984c3009c200", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en28100/", "date": "2024-05-30 05:57", "message": "Palestinian sources affiliated with the Palestinian Authority claim: the picture of the weapon shown yesterday👆 in the proclamation of the Al-Aqsa Martyrs' Brigades in Tulkarm (which claimed to have infiltrated Bat Hefer-AA) is an old picture taken from the Internet.", "location": "The main location where the main event takes place is Tulkarm.", "classification": "security", "score": 0.7840268382396794, "event_breakdown": "[\n  {\n    \"type\": \"Feature\",\n    \"geometry\": {\n      \"type\": \"Point\",\n      \"coordinates\": [\n        32.120854,\n        34.860294\n      ]\n    },\n    \"properties\": {\n      \"title\": \"Israel\",\n      \"marker-symbol\": \"information-slash\"\n    }\n  },\n  {\n    \"type\": \"Feature\",\n    \"geometry\": {\n      \"type\": \"Point\",\n      \"coordinates\": [\n        32.04903,\n        34.84798\n      ]\n    },\n    \"properties\": {\n      \"title\": \"Tulkarem\",\n      \"marker-symbol\": \"cafe\"\n    }\n  },\n  {\n    \"type\": \"Feature\",\n    \"geometry\": {\n      \"type\": \"Point\",\n      \"coordinates\": [\n        32.099452,\n        34."}]