[{"id": "36dead6c-97b2-4486-9a50-5a033406ecd1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27296/", "date": "2024-05-16 11:24", "message": "IDF spokesperson:\n\nAt the end of a three-hour manhunt: the IDF and the Shin Bet arrested the suspect behind today's stabbing attack at the Yitzhar Junction.", "location": "Yitzhar Junction", "classification": "security", "score": 0.8984087000940275, "event_breakdown": "Security Events:\n\n1. Stabbing attack at Yitzhar Junction.\n2. Manhunt for the suspect behind the stabbing attack.\n3. Arrest of the suspect at the end of the three-hour manhunt by IDF and Shin Bet."}, {"id": "14ccaf0b-9cd6-4171-ba23-d86d192eee24", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27294/", "date": "2024-05-16 11:11", "message": "Lebanese channels report on an Israeli drone strike on a vehicle near the village of Qana in southern Lebanon.\n\nA man was killed and another was reportedly injured in the attack.", "location": "Qana", "classification": "security", "score": 0.9977076528309929, "event_breakdown": "Drone Strike\n\nReported Israeli Drone Strike in Lebanon"}, {"id": "cf38e254-cbe4-4d9b-81d3-ca2587545601", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27291/", "date": "2024-05-16 10:25", "message": "The Lebanese army today raided the Palestinian drug den called the Shatila refugee camp.\nArmy forces arrested 15 drug dealers and raided production laboratories. One drug dealer was killed.\nAccording to Lebanese sources, Shatila is responsible for 40% of the drugs that reach Beirut.", "location": "BEIRUT", "classification": "security", "score": 0.970534292474081, "event_breakdown": "Security Event:\n\n1. Lebanese army raids Palestinian drug den - Shatila refugee camp.\n2. Army arrests 15 drug dealers and raids production laboratories.\n3. Drug dealer killed during raid.\n4. Lebanese sources claim Shatila responsible for 40% of drugs reaching Beirut."}, {"id": "96e2a708-b219-4cc9-9cb9-603d4cffd530", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27289/", "date": "2024-05-16 08:23", "message": "Hezbollah:\nWe launched 60 rockets at Nafah, Kela and Yoav bases in response to the overnight attacks in the Al-Beqah area.", "location": "BEQAH", "classification": "security", "score": 0.9480701140052669, "event_breakdown": "Events:\n1. Hezbollah launching 60 rockets at Nafah, Kela and Yoav bases.\n2. Overnight attacks in the Al-Beqah area."}, {"id": "dffec349-cd0d-4b53-a1ac-4bdd60a67f3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27288/", "date": "2024-05-16 08:12", "message": "IDF Spokesperson: Following the report of a stabbing attack in the Samaria area, a short while ago, a terrorist arrived at the Yitzhar junction, stabbed an IDF NCO who was in his vehicle and fled. IDF soldiers are searching for the terrorist and have blocked roads in the area. \nThe NCO was moderately injured and has been evacuated to the hospital for medical treatment. His family has been notified.", "location": "Yitzhar junction", "classification": "security", "score": 0.9511409962679175, "event_breakdown": "Security Events:\n\n1. Stabbing attack in the Samaria area\n2. Terrorist arrived at Yitzhar junction\n3. Terrorist stabbed an IDF NCO\n4. IDF soldiers are searching for the terrorist\n5. Roads have been blocked in the area"}, {"id": "0e8cb846-797c-499d-bf50-04a2b963d884", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27284/", "date": "2024-05-16 08:11", "message": "The Palestinians report that the IDF dropped leaflets this morning in the Deir al-Balah area in the center of the Gaza Strip, in which the details of Hamas operatives who carried out surveillance and spying operations on residents in the Gaza Strip to monitor that they are not acting against Hamas and its interests were revealed.\nThe IDF publishes a long list of identity card numbers of Gaza residents that appeared in Hamas's surveillance reports and invites each and every resident of Gaza to check if he was also followed by Hamas's intelligence personnel, according to the reports located in the Strip.", "location": ".\nGAZA STRIP", "classification": "security", "score": 0.8626600393646978, "event_breakdown": "IDF dropped leaflets revealing Hamas operatives in Gaza\nIDF invites residents of Gaza to check if they were followed by Hamas's intelligence personnel"}, {"id": "fe62ac16-d0db-4ba5-8000-8fa87e693cf8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27283/", "date": "2024-05-16 08:10", "message": "Al Jazeera: About 40 rockets were launched about an hour ago from Lebanon towards the Golan and the Galilee.", "location": "Golan Heights", "classification": "security", "score": 0.893564740417503, "event_breakdown": "Event 1: About 40 rockets were launched from Lebanon towards the Golan and the Galilee.\nEvent 2: Al Jazeera reported that rockets had been launched from Lebanon towards the Golan and the Galilee."}, {"id": "b7126f28-59e2-418a-973b-b54e1ee04ed9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27282/", "date": "2024-05-16 08:09", "message": "US Central Command:\nThe floating pier off the coast of Gaza has been completed.\nIn the coming days, the aid containers will start arriving. American soldiers did not enter the territory of the Gaza Strip as part of the construction of the pier.", "location": "GAZA STRIP", "classification": "security", "score": 0.8964437417262475, "event_breakdown": "Security Events:\n\n1. Completion of a pier off the coast of Gaza.\n2. Arrival of aid."}, {"id": "1f5c5873-092f-4740-bde3-3e33b5a03a3b", "channel_id": 1560386984, "url": "", "date": "2024-05-16 07:57", "message": "An operative of Fatah's Al-Aqsa Martyrs Brigades cooperated with an operative of the military wing of Hamas, shooting together at the Tibba checkpoint this morning in revenge for the death of three Palestinians in Tulkarm tonight during the IDF's activity there.", "location": "TULKARM", "classification": "security", "score": 0.9906753163341292, "event_breakdown": "Security Events:\n\n1. Shooting attack by operatives of Fatah's Al-Aqsa Martyrs Brigades and Hamas's military wing at a Tibba checkpoint.\n2. Death of three Palestinians in Tulkarm during IDF's activity.\n3. Revenge attack by the operatives at the checkpoint in response to the deaths in Tulkarm."}, {"id": "b5600dc0-491d-4160-af9d-490b8439006f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27275/", "date": "2024-05-16 06:36", "message": "The scenes of destruction from the Zeitoun neighborhood in the south of Gaza City, after, according to the Palestinians, IDF forces withdrew from the area yesterday.", "location": "GAZA CITY", "classification": "security", "score": 0.9871717466534873, "event_breakdown": "* IDF forces withdraw from Zeitoun neighborhood in Gaza Strip\n* Destruction and scenes of destruction in Zeitoun neighborhood after IDF withdrawal\n* Palestinians claim destruction of neighborhood after IDF withdrawal"}, {"id": "78bebfb9-9aee-4491-9403-ee937805bbec", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27273/", "date": "2024-05-16 06:34", "message": "The American NBC network reported last night that the construction of the floating dock of the US Army for the purpose of bringing goods into the Gaza Strip, will be completed within 24-48 hours.", "location": "GAZA STRIP", "classification": "security", "score": 0.9126366614506656, "event_breakdown": "Floating dock of the US Army being constructed for purpose of bringing goods into Gaza Strip"}, {"id": "9051418c-1730-4d34-b11d-c83f8d37fe8e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27272/", "date": "2024-05-16 06:34", "message": "The Shiite militias in Iraq claim that they attacked a target in Eilat and the refineries in Haifa early in the morning using drones.", "location": "EILAT", "classification": "security", "score": 0.9721557679441066, "event_breakdown": "Events:\n\n* Shiite militias in Iraq claim to attack target in Eilat, Israel using drones\n* Shiite militias in Iraq claim to attack refineries in Haifa, Israel using drones\n\nNote that these events have not been verified by official sources and should be treated with caution."}, {"id": "7dced053-e811-4020-ac67-9696179f2685", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27271/", "date": "2024-05-16 06:33", "message": "The Israel Police publishes documentation of the neutralization of a terrorist who tried to stab security forces soldiers around three in the morning in the Old City of Jerusalem.\nThere are no casualties among the police officers.", "location": "JERUSALEM", "classification": "security", "score": 0.9869465570219929, "event_breakdown": "Security Events:\n\n- Neutralization of a terrorist who tried to carry out a stabbing attack against security forces soldiers in the Old City of Jerusalem.\n- No casualties reported among the police officers."}, {"id": "7b03e589-8a24-4bbb-8b84-668b93aee168", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27267/", "date": "2024-05-16 06:32", "message": "Tonight's IDF attacks deep in Lebanon\n\nThe Lebanese Al Mayadeen channel notes that the Israeli Air Force carried out 14 attacks tonight on targets in the Baalbek area (Al Baqa district).\n\nAccording to Lebanese sources, targets were attacked in the villages: Nabi Chit, Brital, Jarud and Al-Khariba.\n\nThere were no reports of casualties, it seems that the IDF mainly attacked infrastructure.\n\nThe attached diagram published by the IDF spokesperson in September 2019 shows an area in the village of Nabi Chit where Hezbollah's precision missile factories are located.\nAccording to Lebanese sources, this may have been one of the targets of the attack.", "location": "Nabi Chit village.", "classification": "security", "score": 0.9952657589630971, "event_breakdown": "IDF carried out 14 attacks on targets in the Baalbek area (Al Baqa district), Nabi Chit, Brital, Jarud and Al-Khariba."}, {"id": "9613e20b-dfa0-41d3-bc54-0fed1f055ef4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27266/", "date": "2024-05-16 06:21", "message": "The IDF spokesperson announced this morning the death of 5 soldiers of the 202nd Battalion in the Paratrooper Brigade in battle in the northern Gaza Strip.\n\nMay their memories be a blessing.\n\nIn this battle, three more soldiers of the 202nd Battalion were seriously injured.", "location": "Northern Gaza Strip", "classification": "security", "score": 0.9825323085026546, "event_breakdown": "Security Events:\n\n1. 5 IDF soldiers from the 202nd Battalion in the Paratrooper Brigade were killed in the northern Gaza Strip.\n2. 3 IDF soldiers from the 202nd Battalion in the Paratrooper Brigade were seriously wounded in the same battle."}, {"id": "faf1cc47-78ce-42f6-bcaf-27699ecfc720", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27265/", "date": "2024-05-16 06:19", "message": "Fires broke out at the site that was attacked in Baalbek.", "location": "Baalbek", "classification": "security", "score": 0.9254473129445957, "event_breakdown": "Fires broke out at the site that was attacked in Baalbek.\n\nSecurity events:\n\n* Fires broke out at Baalbek site.\n* Site was attacked in Baalbek."}, {"id": "1f0dbc9c-6bba-49a5-886c-54dff8505cfe", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27261/", "date": "2024-05-16 06:18", "message": "Lebanese channels reported on at least 4 powerful attacks by the Air Force in the area of ​​Nabi Chit, in Baalbek deep in Lebanon, this morning.\nSyrian sources report that echoes of the attacks are also heard on the Syrian side of the border.\n\nThis is apparently an Israeli response to Hezbollah's drone attack this evening west of Tiberias, 50 km from the border into Israeli territory.", "location": "Lebanon", "classification": "security", "score": 0.9842137456111656, "event_breakdown": "1. Powerful attacks by the Lebanese Air Force in the area of Nabi Chit, Baalbek, in Lebanon. This is an Israeli response to a drone attack by Hezbollah tonight west of the Israeli city of Tiberias.\n2. Echoes of the attacks were also heard on the Syrian side of the border, according to Syrian sources."}, {"id": "051c56d0-7ce2-446f-bb2d-9bddf8d218ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27306/", "date": "2024-05-16 14:23", "message": "The Crown Prince of Saudi Arabia, Muhammad bin Salman, met today with Syrian President Bashar Assad, in Manama, the capital of Bahrain, as part of the 33rd Arab Summit.", "location": "MANAMA", "classification": "security", "score": 0.4578367987621772, "event_breakdown": "Crown Prince of Saudi Arabia Muhammad bin Salman met with Syrian President Bashar Assad in Manama during the 33rd Arab Summit."}, {"id": "2f8395cf-4d19-4ba0-ba86-a94e033ed2bb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27305/", "date": "2024-05-16 14:22", "message": "Palestinian channels are publishing footage of an Israeli attack today in the Jabaliya camp in the north of the Gaza Strip.", "location": "GAZA", "classification": "security", "score": 0.9409647916720274, "event_breakdown": "Palestinian channels are publishing footage of an Israeli attack today in the Jabaliya camp in the north of the Gaza Strip.\n\n1. Israeli attack in the Jabaliya camp in the north of the Gaza Strip."}, {"id": "74c0385d-0f98-4b35-a2d8-617cfac1bc02", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27302/", "date": "2024-05-16 14:20", "message": "Hezbollah: At 13:38 we attacked a post in Metula using an attack drone that carried two S5 missiles. After launching them at the selected targets, the drone completed the operation and \"suicided\" itself on the designated target.\n\n##\nHezbollah describes here a situation of a suicide drone that launched missiles before carrying out the action of crashing on the target.\nThis is the first time that Hezbollah has claimed this type of action.", "location": "Metula", "classification": "security", "score": 0.945958305629445, "event_breakdown": "##\nEvents:\n\n1. Hezbollah claims to have carried out a suicide drone attack targeting a post in Metula using two S5 missiles.\n2. The drone completed its operation by crashing on the designated target post-missile launch."}, {"id": "7f9f4162-9749-4e5a-8241-66fa86fa70b0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27301/", "date": "2024-05-16 14:09", "message": "PA Chairman Abu Mazen, at the 33rd Arab Summit in Bahrain:\nThe military operation carried out by Hamas on October 7 was an independent decision by Hamas and provided Israel with many pretexts to attack Gaza.", "location": "Palestine", "classification": "security", "score": 0.9390653100823106, "event_breakdown": "Event: Hamas military attack on October 7\nEvent: Israel's attack on Gaza in response to Hamas' attack"}, {"id": "13af5839-c6c4-4487-a5d8-e76790a271d5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27300/", "date": "2024-05-16 14:08", "message": "The Minister of Defense Gallant said at the end of the visit:\n\n\"I am now in the Rafah area after meeting the commander of the Southern Command, the commander of the 162nd division, the 84th brigade, the 401st brigade, and the fire brigade, all of them are working in unique ways, they are shooting in the field, hundreds of targets have already been attacked, the forces are maneuvering and have come close to their lines.'\n\n\"This operation will continue through additional forces that will enter. Several tunnels in the area have been destroyed by our forces and more tunnels will be destroyed soon. This operation will intensify and Hamas is not an organization that can renew itself now - it has no reserves, it has no ability to produce weapons, it has no supplies, it has no armament, it has no ability to properly treat terrorists who are injured and the meaning is that we are wearing it down.\"", "location": "RAFAH", "classification": "security", "score": 0.9764217374258585, "event_breakdown": "Security events:\n\n* Minister of Defense visited Rafah area and met with the commander of the Southern Command, the commander of the 162nd division, the 84th brigade, the 401st brigade, and the fire brigade.\n* Forces shooting in the field, attacking hundreds of targets.\n* Forces maneuvering and getting close to Hamas lines.\n* Operation will continue with additional forces entering.\n* Several tunnels in the area destroyed by forces.\n* Operation will intensify.\n* Hamas does not have reserves, cannot produce weapons, has no supplies, cannot properly treat terrorists who are injured."}, {"id": "4f910a4a-0c19-49f5-9140-1f879d844e6d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27299/", "date": "2024-05-16 14:07", "message": "Defense Minister Gallant at the end of an assessment of the situation at the border of the Gaza Strip, in the Rafah area: \"Additional forces will join the ground operation in Rafah, a number of tunnels in the area have already been destroyed - the Hamas taps are getting shut off\"\n\nYesterday, Defense Minister Yoav Gallant visited the headquarters of Division 162 operating in the Rafah area and held a situation assessment together with the commander of the command, Colonel Yaron Finkelman, the commander of the division, Lieutenant Colonel Itzik Cohen and the commanders of the brigades fighting in the field.", "location": "Rafah", "classification": "security", "score": 0.9581720080224806, "event_breakdown": "1. Defense Minister Gallant visited the headquarters of Division 162 in the Rafah area\n2. Defense Minister Gallant held a situation assessment together with commanders of the brigades in the field."}, {"id": "bb2140ee-97ee-4307-a339-f6e74013ed03", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27298/", "date": "2024-05-16 12:28", "message": "East Rafah: The Palestinians report that IDF forces are blowing up (from the ground) buildings in the Jneineh neighborhood (as they did in the A-Salam neighborhood in the last two days).\nThis indicates a good grip also in the Jneineh neighborhood 👆 in east Rafah.", "location": "EAST RAFAH", "classification": "security", "score": 0.9194380239899982, "event_breakdown": "Security Events:\n1. Palestinians report that IDF forces are blowing up buildings in the Jneineh neighborhood in east Rafah.\n2. IDF forces blowing up buildings in the A-Salam neighborhood in east Rafah over the last two days."}, {"id": "3890e831-7159-46c4-9f08-0c3f3e22d9d4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27297/", "date": "2024-05-16 11:52", "message": "Lebanese channels: The second person injured in the attack was pronounced dead.", "location": "The second person injured in the attack was pronounced dead.Based on the information in the text, please identify the main location where", "classification": "security", "score": 0.9776239338117487, "event_breakdown": "Security Events:\n\n- Attack in Beirut, Lebanon\n- Second victim dies following the attack"}, {"id": "622dba12-b8f2-46b1-9519-b386f09bbc3a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27322/", "date": "2024-05-16 19:09", "message": "Key points from the IDF spokesman's announcements this evening:\n\nThe commando brigade joined the fighting in Rafah.\n\nThe two Hezbollah militants who were killed today were operating suicide drones and were on their way to carry out an attack against Israel.\n\nTwo of the Thai workers kidnapped by Hamas on Oct 7th to Gaza are not alive (they were murdered that day and their bodies were taken to Gaza, thus bringing the number of hostages officially confirmed dead to 40).\n\n\"Tal Shamaim\", the IDF's observation balloon, was damaged while on the ground as a result of Hezbollah's suicide drone attack yesterday west of Tiberias. It was not operational.", "location": "Gaza Strip", "classification": "security", "score": 0.9864594452388467, "event_breakdown": ".\nEvents from the text:\n1. Commando brigade joined the fighting in Rafah.\n2. Hezbollah militants were operating suicide drone and were going to carry out an attack against Israel.\n3. Two Thai workers who were kidnapped by Hammas on Oct 7th are not alive because they were murdered by Hammas."}, {"id": "bd82275e-81d0-4421-b2f2-0d1a3cb61ae5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27321/", "date": "2024-05-16 19:00", "message": "The IDF reports on the death of a soldier, 39-year-old Ran Yavetz, from the 6862 battalion of the 828 brigade.\n\nMay his memory be a blessing.", "location": "JERUSALEM", "classification": "security", "score": 0.9041771016750295, "event_breakdown": "Security Events:\n1. Death of IDF soldier, Ran Yavetz (39 years old, 6862 battalion, 828 brigade)."}, {"id": "5cd460e3-8945-4574-b5d8-1460e02db647", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27320/", "date": "2024-05-16 18:01", "message": "Leading Arab media cite the reports on the Israeli \"Kan11\" news channel this evening:\n\nThe delayed shipment of weapons from the US has landed in Israel.", "location": "I did not find any specific location in the context provided.", "classification": "security", "score": 0.8213212956610391, "event_breakdown": "1. Delayed shipment of US weapons to Israel\n2. Arrival of US weapons in Israel"}, {"id": "100962c7-4188-40af-9e36-1fdfed2642ef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27319/", "date": "2024-05-16 17:58", "message": "Hamas against Abu Mazen\n\nHamas in an official announcement: We regret Abu Mazen's remarks about the heroic \"Tufan al-Aqsa\" (Hamas's name for the Oct 7th attack, and the war that followed - AA) at the Arab summit in Manama today. The enemy doesn't need a reason to commit its crimes.\n\n \"Tufan al-Aqsa\"  is the most important chapter in the Palestinian struggle against the occupation. It returned the Palestinian issue to the top of the agenda and achieved strategic achievements - we got closer to freedom and \"self-determination\".", "location": ".\n\nGAZA", "classification": "security", "score": 0.49215372942365915, "event_breakdown": "Security Event: Hamas issued a statement expressing their regret over comments made by Palestinian Authority President Mahmoud Abbas about the Palestinian resistance attack \"Tufan al-Aqsa\", which took place on October 7th."}, {"id": "cde5d3de-95cf-4bf0-93b4-a21695a67667", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27318/", "date": "2024-05-16 17:52", "message": "For the second time today, rockets wee launched towards Kerem Shalom - from there, Israel has been bringing goods into the Gaza Strip, on top of dozens of trucks, for two nights in a row.\n\nThis is the only route for goods to enter the southern Gaza Strip since Israel took control of the Rafah crossing.", "location": "GAZA STRIP", "classification": "security", "score": 0.8991505783899678, "event_breakdown": "Rockets launched towards Kerem Shalom"}, {"id": "c7643e2d-652f-452e-ac67-26fba9f42b3e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27314/", "date": "2024-05-16 17:48", "message": "IDF spokesperson:\n\n*Rocket launchers, ready for launch, found in eastern Rafah; Fighters of the Shaked Battalion continue raids targeting the area*\n\nFighters of the 401st Brigade combat team under the 162nd Division continue to lead the raid in East Rafah.\n\nDuring the attack, female fighters of Unit 414, operating under the 401 Military Command, flew drones that located launchers loaded and ready to fire long-range rockets into Israeli territory. These launchers were used by the terrorist organizations in the Gaza Strip and launched towards the territory of the country in recent months. The launchers were destroyed.\n\nIn a raid on another launch area, soldiers located a central and branched launch infrastructure in the Rafah area that contains dozens of launch canes that were connected to each other and with rockets ready for launch. The launch infrastructure was used in firing rockets at Israel in recent months and was also destroyed.", "location": ")\nEast Rafah", "classification": "security", "score": 0.8454233785403606, "event_breakdown": "IDF spokesperson:\n\n1. Rocket launchers found in eastern Rafah and destroyed.\n2. Female fighters of Unit 414 locate rocket launchers loaded with rockets ready for launch using a drone.\n3. Launch infrastructure containing dozens of launch canes and rockets ready for launch located in the Rafah area and destroyed."}, {"id": "b008c66b-45a7-461c-a5b9-8b50bc08e6d7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27312/", "date": "2024-05-16 17:41", "message": "Hezbollah announced two casualties in its rank:\n\nAli Ayoub\nMohammed Fares\n\nThe two were likely killed in today's drone strike at a vehicle near Qana in southern Lebanon 👆\n\nNumber 300 and 301.", "location": ".\n\nQana, Lebanon", "classification": "security", "score": 0.984637446996737, "event_breakdown": "Event 1: Hezbollah announces two casualties in its ranks, Ali Ayoub and Mohammed Fares.\nEvent 2: The two were likely killed in a drone strike on a vehicle near Qana in southern Lebanon."}, {"id": "4fdd48c0-e6aa-418e-8bf5-37096b1d5c56", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27308/", "date": "2024-05-16 17:38", "message": "The connection of the floating pier in the Gaza Strip has been completed. In recent weeks, the IDF and the Ministry of Defense have made extensive preparations for the reception of the floating pier.\n\nThe preparations were carried out in the last few weeks by the engineering and construction division at the Ministry of Defense, the PADM engineering formation, the 563rd construction division, the Navy, ATL, the coordinator of government operations in the territories and in cooperation with the US Army.", "location": "Gaza Strip", "classification": "security", "score": 0.9034594162586667, "event_breakdown": "Security Events:\n- Completion of floating pier connection in the Gaza Strip\n- Extensive IDF and Ministry of Defense preparations for reception of floating pier in the Gaza Strip"}, {"id": "999fdf6a-013d-49a8-a3ae-040d287d01b7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27307/", "date": "2024-05-16 17:34", "message": "Following the reports here 👆: Earlier today (Thursday), an explosive UAV crossed from Lebanese territory into northern Israel and exploded in the area of Metula. The incident is under review. \n\nAs a result of the explosion, an IDF soldier was severely injured and two additional soldiers were lightly injured. The soldiers were evacuated to the hospital for medical treatment. Their families have been notified.", "location": "METULA", "classification": "security", "score": 0.9743796360681555, "event_breakdown": "Security Events:\n\n1. Explosive UAV crossed from Lebanese territory into northern Israel near Metula.\n2. An IDF soldier seriously injured in explosion.\n3. Two additional IDF soldiers lightly injured in explosion.\n4. Injured soldiers evacuated for medical treatment.\n5. Families of injured soldiers notified."}, {"id": "bbc6bbf2-9d17-4fc1-81c6-c0e0bbb760bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27328/", "date": "2024-05-16 21:50", "message": "The original article on the attack in September 1993 which was carried out by Emad Akel, one of the founding members of the Izz a-Din al-Qassam Brigades, in which three Israeli soldiers were killed (courtesy of the Israeli National Library).", "location": "GAZA", "classification": "security", "score": 0.9947910768764695, "event_breakdown": "1. Attack carried out by Emad Akel, one of the founding members of the Izz a-Din al-Qassam Brigades, in which three Israeli soldiers were killed."}, {"id": "9ec6db99-6e2e-4e6e-837a-9e1d17df2189", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en27326/", "date": "2024-05-16 21:27", "message": "Hezbollah publishes a recording of the UAV that today launched two S5 missiles at an Israeli military target in Metula and then exploded at another target.", "location": "Metula", "classification": "security", "score": 0.9651115858053737, "event_breakdown": "Event 1: Hezbollah UAV launches two S5 missiles at an Israeli military target in Metula.\nEvent 2: Hezbollah UAV explodes at another target.\nEvent 3: Hezbollah publishes a recording of the UAV involved in the missile launch and explosion."}]