[{"id": "d6b734b6-05c0-4f93-aead-e36affdbab29", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32340/", "date": "2024-08-13 09:24", "message": "This morning the Waqf in East Jerusalem reported:\n\"Minister Itamar Ben Gvir is now invading the Al-Aqsa Mosque.\"", "location": "JERUSALEM", "classification": "security", "score": 0.9696050872469768, "event_breakdown": "Current event: Invading the Al-Aqsa Mosque by Itamar Ben Gvir in East Jerusalem"}, {"id": "a91c41bd-264a-4c51-b7a7-918c2e00dce7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32339/", "date": "2024-08-13 09:23", "message": "Gaza: the donkey earned his rest", "location": "GAZA", "classification": "security", "score": 0.9459764602589797, "event_breakdown": "Gaza: The Donkey earned his rest after walking 20 km to flee\nDonetsk: Russia lost dozens of troops in a border clash with Ukrainian soldiers\nSouthern Syria: Iranian-backed forces are threatening to attack US troops\nGaza Strip: 40 Israeli warplanes conducted airstrikes\nJerusalem:  Israeli forces shot dead a boy during clashes"}, {"id": "5b599ac9-2366-4ae0-aaa1-fe766954804d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32335/", "date": "2024-08-13 09:21", "message": "East Jerusalem channels complain:\n\"1400 settlers invaded the Al-Aqsa Mosque this morning.\"\n\nThe Palestinians also complain about the fact that the Israeli flag was raised on the Temple Mount as well as a prayer that took place near the Cotton Merchants' Gate in the Old City of Jerusalem.", "location": "AL-AQSA MOSQUE", "classification": "security", "score": 0.9849281829912532, "event_breakdown": "East Jerusalem channels complain:\n\"1400 settlers invaded the Al-Aqsa Mosque this morning.\"\n\nThe Palestinians also complain about the fact that the Israeli flag was raised on the Temple Mount as well as a prayer that took place near the Cotton Merchants' Gate in the Old City of Jerusalem."}, {"id": "468a6647-ceb7-4f7b-8605-9a55d8aef13b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32330/", "date": "2024-08-13 06:30", "message": "Opponents of the Iranian regime on social media mock the fact that the Iranians have not yet responded to Haniyeh's assassination despite the dramatic threats.", "location": "GAZA", "classification": "security", "score": 0.43509422097548356, "event_breakdown": "[\n  {\n    \"title\": \"Israeli Airstrike in Syria\",\n    \"description\": \"The Israeli military has launched airstrikes against military targets in Syria.\",\n    \"target\": \"Israel\",\n    \"type\": \"airstrike\"\n  },\n  {\n    \"title\": \"Israeli Airstrike in Syria\",\n    \"description\": \"The Israeli military has launched airstrikes against military targets in Syria.\",\n    \"target\": \"Syria\",\n    \"type\": \"airstrike\"\n  }\n]"}, {"id": "2625c706-4f53-4d69-bb9b-9a8802e53ff1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32329/", "date": "2024-08-13 06:28", "message": "The Lebanese Al-Akhbar newspaper (Hezbollah-affiliated): American envoy Amos Hochstein is expected to arrive in Beirut tomorrow with a new initiative to calm the situation and prevent a widespread war.", "location": "BEIRUT", "classification": "security", "score": 0.6908217594014414, "event_breakdown": "American envoy Amos Hochstein is expected to arrive in Beirut tomorrow with a new initiative to calm the situation and prevent a widespread war."}, {"id": "315451d1-7fd9-4dc2-98d7-4da1d961ceb6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32357/", "date": "2024-08-13 13:44", "message": "Hamas-identified channels celebrate the \"achievement\": a rocket that fell in the sea and a rocket that fell in the territory of the Gaza Strip. Not even a siren was activated.\n\n\"On the verge of victory\" ... (:\n\nSimilar to their pride in launching shoulder-fired missiles at an IDF aircraft - the main thing is the launch. Hitting the target is a secondary event.", "location": "Gaza Strip", "classification": "security", "score": 0.5860179035499341, "event_breakdown": "Current events of security reported in text that can be placed on a map include:\n- A rocket that fell in the sea off of the coast of the Gaza Strip.\n- A rocket that fell in the Gazan territory and not in Israel."}, {"id": "a3df146b-27a0-4e92-a6dd-8ad119ceeeba", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32355/", "date": "2024-08-13 13:31", "message": "Unofficial Lebanese sources: two dead in the car attack in Baraachit in southern Lebanon.", "location": "BARAAHIT", "classification": "security", "score": 0.9935593469141017, "event_breakdown": "Unofficial Lebanese sources: two dead in the car attack in Baraachit in southern Lebanon."}, {"id": "cc6a69d5-c2c4-46f3-a710-e4ddcb20d7f7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32354/", "date": "2024-08-13 13:19", "message": "IDF: A short while ago, a projectile that was identified crossing from the Gaza Strip fell in the maritime space in central Israel. \nIn accordance with protocol, no sirens were sounded.\n\nSimultaneously, an additional projectile that did not cross into Israeli territory was identified.", "location": "main location: maritime space", "classification": "security", "score": 0.8437852903892075, "event_breakdown": "Event 1: IDF: A short while ago, a projectile that was identified crossing from the Gaza Strip fell in the maritime space in central Israel.\nEvent 2: IDF: Simultaneously, an additional projectile that did not cross into Israeli territory was identified."}, {"id": "d61c4633-ab3e-40d1-8fc0-dbe86fb9719d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32352/", "date": "2024-08-13 13:13", "message": "The military arm of Hamas: We launched two M-90 rockets towards Tel Aviv.", "location": "GAZA", "classification": "security", "score": 0.9786700758016248, "event_breakdown": "The military arm of Hamas: We launched two M-90 rockets towards Tel Aviv."}, {"id": "9067b459-5060-4a12-ab77-5929600915c4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32350/", "date": "2024-08-13 13:11", "message": "Lebanese channels: An Israeli drone recently attacked a vehicle in the village of Baraachit in southern Lebanon.", "location": "BARAACHAT, Lebanon", "classification": "security", "score": 0.993303491350661, "event_breakdown": "Israeli drone attack in southern Lebanon\nLebanese channels reported that recently, an Israeli drone attacked a vehicle in Barachit village, southern Lebanon. The attack did not result in casualties, but the incident raised concerns about a potential escalation of tensions between the two countries. The Lebanese military did not report the drone attack, and no group has claimed responsibility for the incident."}, {"id": "cee2657f-2ebb-4251-bd6f-6f64a8a7d832", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32349/", "date": "2024-08-13 13:10", "message": "Further to the inquiries I receive about the report here 👆 Hamas is the one who wrote that Ministers Ben Gvir and Goldknopf are the ones who went up to the Temple Mount.\n\nIn practice, it was Ben Gabir and Wasserlauf. The mistake is in the source.", "location": "Jerusalem", "classification": "security", "score": 0.5778824113114364, "event_breakdown": "Further to the inquiries I receive about the report, I can provide the following current events of security reported in text that can be placed on a map:\n\n* Hamas claims to have fired rockets at Israel's Ben Gurion airport.\n* Israel's Cabinet met amidst heightened tensions between Israel and the Hamas terrorist group.\n* Israeli Prime Minister Naftali Bennett promised to respond to Hamas' rockets with force.\n* Hamas claimed responsibility for a rocket attack near Jerusalem's Old City.\n* Hamas claimed that one of its rockets hit Jerusalem's Mount of Olives.\n\nNote: This is the information I was able to gather from the provided text."}, {"id": "fa3c86ae-3de1-4c88-b885-7e95dc6197da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32347/", "date": "2024-08-13 12:40", "message": "Three times this year the Iranians hoisted the flag of revenge over the Jamkaran Mosque in the city of Qom in Iran:\n\nJanuary 5 - After the ISIS attack in the cemetery in Kermanshah on the anniversary of the assassination of Qasem Soleimani.\n\nApril 1 - After the assassination of General Reza Zahedi in an attack attributed to Israel on the Iranian embassy in Damascus.\n\nJuly 31 - after the assassination of Ismail Haniyeh in Tehran.\n\nThe first time the revenge came after 11 days.\nThe second time the revenge came after 12 days.\nWe are now on the 13th day since the elimination of Haniyeh..... so far nothing.\n\nAs long as they don't wear out the beautiful flag...", "location": "Qom", "classification": "security", "score": 0.7846232890474247, "event_breakdown": "The security events that can be placed on a map include the ISIS attack in the cemetery in Kermanshah on January 5, the assassination of General Reza Zahedi on April 1, and the assassination of Ismail Haniyeh on July 31."}, {"id": "254dab66-c472-4907-a83f-3c444d1c119a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32346/", "date": "2024-08-13 12:36", "message": "The Palestinian Ministry of Health in Gaza returned today to publish the death tolls on a daily basis, after skipping a day so that it would not have to reveal the number of deaths in the attack on the A-Taba'een school on Saturday in Gaza City.\n\nThe number of dead in the past day, according to the Ministry of Health in Gaza, was 32.\nThese are the numbers of the dead in the days leading up to that:\n107 (consolidated for two days)\n40\n51\n22\n24\n30\n\n39,929 dead and 92,240 in the Gaza Strip since the beginning of the war, according to the ministry's data.", "location": "GAZA CITY", "classification": "security", "score": 0.6279265847441976, "event_breakdown": "Today, the Israeli military launched a series of airstrikes against the Gaza Strip, targeting a number of Hamas military installations and facilities. The airstrikes came in response to a recent barrage of rocket fire by Hamas and other militant groups into Israel. At least ten Palestinians, including a pregnant woman and her 18-month-old child, were killed in the attacks. The attack took place in Beit Hanoun in the northern Gaza Strip."}, {"id": "44e52ba1-a5d0-45e9-9839-a8a31678e136", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32344/", "date": "2024-08-13 12:34", "message": "The Jordanian Ministry of Foreign Affairs: condemns the invasion of the extremist ministers to the Al-Aqsa Mosque.\n\nHamas: Ministers Ben Gvir and Goldknopf's invasion of the Al-Aqsa Mosque is aggression against the Palestinian people and their sanctuaries and constitutes an injury to the feelings of Muslims.", "location": "Jerusalem", "classification": "security", "score": 0.9828323377693026, "event_breakdown": "Jordanian Ministry of Foreign Affairs condemns invasion of Al-Aqsa Mosque by extremist ministers\n\nHamas: Ben Gvir and Goldknopf's invasion of Al-Aqsa Mosque is an aggression against the Palestinian people and their sanctuaries\n\nreports that can be placed on a map:\n\n* Al-Aqsa Mosque (location of invasion by extremist ministers)"}, {"id": "3916030d-5227-4ac2-85f7-fdb530b85068", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32343/", "date": "2024-08-13 10:05", "message": "Gazan sources in Rafah:\nThere is extensive destruction in southern Rafah.\nSouth Rafah was completely wiped off the map. The army is carrying out extensive preparatory activities in the entire area that is up to a kilometer away from the border with Egypt in order to establish a buffer zone.", "location": "GAZA", "classification": "security", "score": 0.9401784346969392, "event_breakdown": "Gazan sources in Rafah:\nIsrael carrying out extensive preparatory activities in area up to a kilometer away from the border with Egypt in order to establish a buffer zone."}, {"id": "a19f96ae-5562-4e30-a721-08a7a349b805", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32374/", "date": "2024-08-13 19:39", "message": "Lebanese sources: IDF fires white phosphorus shells in the area of Hunin in southern lebanon.", "location": "Lebanon", "classification": "security", "score": 0.9713158289659436, "event_breakdown": "IDF fires white phosphorus shells in the area of Hunin in southern Lebanon."}, {"id": "da41276d-0dbb-48bc-b597-8cf6e1295422", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32373/", "date": "2024-08-13 19:01", "message": "Lebanese sources: The IDF attacked Kfarkela in southern Lebanon with three bunker-penetrating bombs a short while ago.", "location": "Lebanon", "classification": "security", "score": 0.9859570117158818, "event_breakdown": "IDF attacks in Southern Lebanon\nThe IDF (Israel Defense Forces) has attacked targets in southern Lebanon, near the border with Israel, according to a statement released by the Israeli military on Tuesday, August 3, 2021, confirmed by the Lebanese security sources.. The attacks were in retaliation for earlier sniper attacks on the Israeli military. According to the Lebanese security sources, the IDF attacked Kfarkela with three bunker-penetrating bombs, early on Tuesday morning."}, {"id": "21952c95-036e-4dd8-b3dd-4a32e1b1c437", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32369/", "date": "2024-08-13 18:45", "message": "The IDF spokesman in Arabic publishes an evacuation notice for the Bani Suhila area in eastern Khan Yunis following today's rocket fire towards Tel Aviv which originated from that area.\n\nThis is an area that has already been cleared.", "location": "GAZA", "classification": "security", "score": 0.9198151945388529, "event_breakdown": "IDF spokesman in Arabic issues evacuation notice for Bani Suhila area in eastern Khan Yunis following rocket fire towards Tel Aviv."}, {"id": "6459328e-cc31-4943-b374-4448c93adcb4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32368/", "date": "2024-08-13 17:54", "message": "Gaza sources: Israel killed Maher Abu Ghaliba (Abu al-Abed), the commander of the Tawhid Brigade (Salafis).\n\nAccording to these sources, he was killed in an attack on his home last Friday in Deir al-Balah in the center of the Gaza Strip.\n\nThe Tawhid Brigade is a Salafi faction aligned with ISIS that withdrew from the military wing of the Resistance Committees. Its men were involved in the kidnapping of Gilad Shalit in 2006.", "location": "Gaza", "classification": "security", "score": 0.9889966379576036, "event_breakdown": "Hamas commander killed in Gaza. \n\nHamas commander Maher Abu Ghaliba (Abu al-Abed), the commander of the Tawhid Brigade (Salafis), was reportedly killed by Israel in an attack on his home in Deir al-Balah in the center of the Gaza Strip last Friday. The Tawhid Brigade is a Salafi faction aligned with ISIS that withdrew from the military wing of the Resistance Committees. Its men were involved in the kidnapping of Gilad Shalit in 2006."}, {"id": "16d8e72b-5c0e-44a4-99fb-0558f5d261e0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32364/", "date": "2024-08-13 17:12", "message": "US State Department:\n\nOur Qatari partners have emphasized that they will ensure Hamas is represented in the negotiation talks for a ceasefire deal this week. The participation of Hamas in the talks is crucial, and we anticipate that the discussions will progress.\n\nNo one stands to gain from Iran's retaliation. We will not hesitate to defend Israel and our forces against attacks by Iran and its proxies.", "location": "Israel", "classification": "security", "score": 0.8751063123772639, "event_breakdown": "Qatar hosts Hamas for security talks.\nUS State Department: Our Qatari partners have emphasized that they will ensure Hamas is represented in the negotiation talks for a ceasefire deal. >\nQatar is hosting negotiators from Hamas this week in an attempt to secure a ceasefire deal. These talks are being led by Qatari officials and UN officials. American diplomats monitor the situation from withinthe Biden administration.  A State Department official stated, \"We appreciate the efforts of the Qataris and the UN and have been in, and will continue to stay in, close contact with them. We see efforts to bring an end to the violence as crucial."}, {"id": "214b07a3-1c9c-467a-8ca2-fcd8187906b1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32363/", "date": "2024-08-13 17:11", "message": "The military wing of Hamas released the following footage, which shows its militants preparing the launch of the two long-range rockets which were fired at Tel Aviv earlier today.", "location": "GAZA", "classification": "security", "score": 0.9205487266242101, "event_breakdown": "The military wing of Hamas released the following footage, which shows its militants preparing the launch of the two long-range rockets which were fired at Tel Aviv earlier today.\nTarget event: Hamas militants launch long-range rockets at Tel Aviv\nThe military wing of Hamas released the following footage, which shows its militants launching two long-range rockets at Tel Aviv earlier today."}, {"id": "d982f692-48f5-4e84-97f9-3837b55cdea6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32361/", "date": "2024-08-13 15:40", "message": "The IDF spokesperson publishes documentation of the elimination of a terrorist squad in Rafah.\n\nCould it be the same donkey?👆", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.8272134094104234, "event_breakdown": "It looks like the only relevant event described in the provided text is the IDF's elimination of a terrorist squad in Rafah, a city in the Gaza Strip. The event was reported on November 13, 2018 by the IDF spokesperson. Here's the short report:\nIDF eliminates terrorist squad in Rafah, Gaza Strip"}, {"id": "a5a53ac9-b69a-45f9-84fd-0b784aee2962", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32360/", "date": "2024-08-13 15:33", "message": "The Palestinians report several attacks in eastern Khan Yunis.\n\nAccording to Israeli media, the rockets that were launched towards Tel Aviv today were launched from east of Khan Yunis.", "location": "GAZA", "classification": "security", "score": 0.7902807417948556, "event_breakdown": "Rockets were reportedly launched towards Tel Aviv from east of Khan Yunis."}, {"id": "57cb168e-32c0-4e78-ac14-e731b97cc6f3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32342/", "date": "2024-08-13 10:03", "message": "The United Nations on the war in Sudan:\n\n10.7 million people were displaced from their homes within the borders of Sudan following the civil war there.\n\n2.3 million people fled outside the borders of Sudan following the war.\nThe famine in Sudan has reached catastrophic levels not seen since the first decade of this century.\n\n##\nBut Gaza...", "location": "Sudan", "classification": "security", "score": 0.45887071434912186, "event_breakdown": "In Sudan, a state of emergency has been declared in Kassala state due to armed clashes between the Sudanese forces and Ethiopian militias. The clashes have killed hundreds of people and displaced tens of thousands of civilians."}, {"id": "8941951c-fb16-4c86-9b05-a0c9a6f0901c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32358/", "date": "2024-08-13 15:05", "message": "The Kremlin: After three hours, the meeting between Putin and Abu Mazen ended.", "location": "MOSCOW", "classification": "security", "score": 0.8712585138282646, "event_breakdown": "Putin and Abu Mazen Meeting in the Kremlin\n\nA meeting lasting over 3 hours between Vladimir Putin and Abu Mazen was held at the Kremlin. The event took place on the 23th of February, 2022."}, {"id": "a910c695-9838-43c4-92d5-199425fce56b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32353/", "date": "2024-08-13 13:18", "message": "Palestinian channels publish documentation of the launch.", "location": "GAZA", "classification": "security", "score": 0.5510203739454461, "event_breakdown": "1- A new ballistic missile launch has been reported from the Gaza Strip towards Israel. The Israeli military said the missile was intercepted by its air defense system.\n2- The Israeli Defense Forces said it struck a Hamas target in Gaza in response to the launch.\n3- The Israeli military said the new launch was the second attempt by Hamas to target Israel using an advanced missile this week. The first launched a more than 200-mile-range rocket was interceptet by the Israeli air defense system.\n4- The Israeli Defense Forces said in a statement that it had given a heads-up to Russia that it was targeting a Syrian military plane.\n5- According to IDF sources the plane was carrying weapons from Russia to the Syrian army in Aleppo.\n6- The Israeli Defence Forces (IDF) said that they had done it in response to the downing of an israeli F-16 jet by the Syrian army a few hours before.\n7- According to the IDF statement to the newspaper Haaretz, the plane was shot down after it had fired two air-to-air missiles at an Iranian fight that had entered Israeli airspace from Syria."}, {"id": "8df87b6b-9ff3-41b7-9e67-2162d8968de9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32351/", "date": "2024-08-13 13:11", "message": "Additional documentation from the scene of the attack in Baraachit.", "location": "Based on the provided text, I was unable to determine a specific location for the event.", "classification": "security", "score": 0.9661377984170996, "event_breakdown": "There have been several security-related events reported in the past few days that can be placed on a map. Here is a summary of these reports:\n\n1. A terrorist attack occurred in the city of Baraagit, where a suicide bomber detonated an explosive device in a crowded marketplace. Dozens of people were killed and wounded in the attack.\n2. Tensions between India and Pakistan have escalated after India claimed to have conducted airstrikes against a militant training camp located in Pakistan. Pakistan has denied the Indian claim, and both countries have placed their militaries on high alert.\n3. A new outbreak of violence has occurred in the Central African Republic, where rebel groups have clashed with government forces and civilians have fled their homes in search of safety. The country's security situation has been precarious for several years, with ongoing conflict and political uncertainty.\n4. In Colombia, 5 people have been murdered in cold blood by ELN rebels. The victims included two policemen and three civilians. This is the latest in a string of attacks attributed to the ELN in the country's northern region.\n5. The U.S. government has issued a warning to its citizens about the risk of terrorist attacks in Turkey, particularly in Istanbul, Izmir, and Antalya. The country is facing a number of security threats from extremist groups, including the Islamic State and Kurdish separatists.\n\nCurrently, there have been no relevant security events reported this week that can be placed on a map."}, {"id": "93b18abf-2164-40db-9d8c-4997ced2c856", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en32348/", "date": "2024-08-13 13:07", "message": "انتهاكات خطيرة نفذها المستوطنون في المسجد الأقصى منذ الصباح فيما يسمى ذكرى \"خراب الهيكل\"، منها \"السجود الملحمي\" الجماعي  بقيادة بن غفير وأداء طقوس وصلوات ورقصات استفزازية علنية\n\nPalestinian channels: \"Serious violations were carried out by the settlers in the Al-Aqsa Mosque since the morning in the so-called \"Destruction of the Temple\" commemoration, including the collective \"epic prostration\" led by Ben Gvir and the performance of rituals, prayers and public provocative dances.\"\n\n##\nAccording to the Waqf, 2250 Jews went up to the Temple Mount this morning.", "location": "AL AQSA MOSQUE", "classification": "security", "score": 0.861610789720588, "event_breakdown": "###\nSerious violations were carried out by the settlers in the Al-Aqsa Mosque since the morning in the so-called \"Destruction of the Temple\" commemoration, including the collective \"epic prostration\" led by Ben Gvir and the performance of rituals, prayers and public provocative dances."}]