[{"id": "4537ea9d-62e4-420d-938b-cd88815404e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30551/", "date": "2024-07-17 04:44", "message": "The IDF spokesperson publishes a video of the impact on a motorcycle at al-Khardli bridge in southern Lebanon yesterday.\n\nAccording to Lebanese sources, the two dead have Syrian citizenship.", "location": "LEBANON", "classification": "security", "score": 0.8946274522311939, "event_breakdown": "IDF (Israel Defense Forces) published a video yesterday of the impact on a motorcycle at al-Khardli bridge in southern Lebanon."}, {"id": "1d7f37f4-622f-47f2-8ef3-7e682a253255", "channel_id": 1560386984, "url": "", "date": "2024-07-17 04:39", "message": "Palestinians from Jenin recorded the interceptions of Hezbollah's barrage towards the Galilee last night.\n\nHezbollah accepted responsibility for launching dozens of Katyusha rockets at various towns in the north, including Miron, in response to IDF strikes that caused the death of Syrian civilians in the Umm al-Tut area in southern Lebanon.", "location": "Galilee is the main focus of the event.", "classification": "security", "score": 0.9462274916157766, "event_breakdown": "After the intercepts of Hezbollah's barrage towards the Galilee by Palestinians from Jenin were recorded, Hezbollah assumed responsibility for launching dozens of Katyusha rockets at several towns in northern Israel, including Miron, in response to the deaths ofSyrian civilians in IDF strikes in the Umm al-Tut area in southern Lebanon."}, {"id": "5bd53965-921b-4931-8cab-d533f513026a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30545/", "date": "2024-07-17 04:35", "message": "The parliamentary elections in France: President Macron accepted the government's resignation yesterday. The government will continue to function as a \"transitional government\".", "location": "France", "classification": "security", "score": 0.5225566297887626, "event_breakdown": "Current events of security in France:\n\n* Terrorist attack in Nice: Three people were killed in a terrorist attack in Nice, France, on October 29, 2020. A man with a knife attacked people at the Notre Dame Basilica. The police shot the assailant and detained him.\n* Protests in Paris: Riot police clashed with protesters in Paris, France on October 28, 2020. The protests were against proposed security legislation that would make it a crime to share images of police officers."}, {"id": "12b3e356-b843-4d01-8f68-2b3fd1ebeca0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30568/", "date": "2024-07-17 09:22", "message": "Quotes from Nasrallah's speech this morning on the occasion of Ashura Day\n\nWhat the resistance did on October 7th is its full right.\n\nFor the first time in its history, the Zionist entity is living in the most difficult period for it, in every field, as senior Israeli army and politicians admit.\n\nFor the first time after ten months of fighting, Israel is helpless and does not achieve its goals.\n\nFor the first time the captains of the Zionist entity and its chosen ones are talking about the \"destruction of the house\".\n\nFor the first time the Israeli army is talking about a shortage of fighters.\n\nFor the first time the Israeli army talks about a shortage of tanks following the war in Gaza and Lebanon.\n\nI say to the Israeli enemy: if you enter Lebanon you will not suffer from a shortage of tanks because you simply will not have any tanks left...\n\nThe Lebanese battlefield will not stop until the aggression on Gaza stops.\n\nWe will rebuild our houses and strengthen the villages on the front, because they are the symbol of our firm stand and resistance.\n\n##\nNotice how many quotes in the Israeli media 👆👆 on the topic of the lack of tanks took a central place in his speech.", "location": "Lebanon", "classification": "security", "score": 0.4785177888366984, "event_breakdown": "Nasrallah's speech mentions a shortage of tanks in the Israeli army, which is likely to be related to current events of security. It highlights that the Lebanese battlefield will not stop until the aggression on Gaza stops, indicating that the situation in the region remains unstable."}, {"id": "53a7b92f-a990-46af-9064-ca1ac7df2e89", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb70932/", "date": "2024-07-17 08:17", "message": "The Palestinians report that Israel released 13 Palestinian prisoners to the Strip this morning. They arrived at the Shuhada al-Aqsa hospital in Deir al-Balah.", "location": "GAZA", "classification": "security", "score": 0.9709256928229444, "event_breakdown": "Israel released 13 Palestinian prisoners to the Strip this morning. They arrived at the Shuhada al-Aqsa hospital in Deir al-Balah."}, {"id": "9520263a-09f5-4b5e-a129-13ef6e4f4194", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30559/", "date": "2024-07-17 07:28", "message": "The Palestinian Authority's security mechanisms destroy explosive devices in Tulkarm\n\nResidents living in the quarry area in Akhtaba in Tulkarm complain: At three o'clock in the morning the PA decided to detonate the explosive devices - we thought it was an attack from the air. Where to go? We have no peace neither from the Jews nor from the PA...", "location": "TULKARM", "classification": "security", "score": 0.9691171357472358, "event_breakdown": "Residents of Akhtaba in Tulkarm complain of damage to their homes by the detonation of explosive devices by the PA security forces.\nExplosive devices detonated by the PA security forces in Tulakm cause damage to residential homes in the Akhtaba area."}, {"id": "edf34506-285f-41b3-a4de-73a4e100943c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30558/", "date": "2024-07-17 07:24", "message": "Ismail Haniyeh, chairman of the political bureau of Hamas, spoke tonight with the Turkish foreign minister and told him:\n\nWe responded positively to all the proposals brought by the brokers. It is the occupation that wants to avoid reaching a ceasefire agreement.", "location": "GAZA", "classification": "security", "score": 0.7991488077340752, "event_breakdown": "Hamas's political bureau chief Ismail Haniyeh spoke with the Turkish foreign minister on Thursday and said that his group had responded positively to all proposals from the mediators. He added that it was the Israeli government that wanted to avoid reaching a ceasefire agreement.\n\nThis conversation came amid ongoing violence between Israel and Hamas, with both sides launching airstrikes and rockets at each other. At least 230 Palestinians, including 65 children, have been killed in the fighting, while Israel has reported 12 deaths, including one child.\n\nThe current round of violence began last week when tensions over the potential eviction of Palestinian families from their homes in East Jerusalem spilled over into violent confrontations between Palestinian protesters and Israeli police. Hamas then began launching rockets into Israel, and Israel responded with airstrikes on Gaza.\n\nEfforts to reach a ceasefire have been ongoing, with Egypt and Qatar acting as intermediaries between the two sides. However, no agreement has yet been reached."}, {"id": "001b7421-9f0f-42ca-8d1c-b84593d05c90", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30557/", "date": "2024-07-17 07:02", "message": "Throughout the night, the IDF attacked numerous times in the area of ​​the central camp (they did not sleep tonight in the center of the Strip). One of the attacks was on the home of the Diab family in the south of the Nusierat, where 8 Gazans were killed, according to the Palestinian channels. Attached is a video from the scene.", "location": "The main event is attack on the Diab family home in the Nusierat, which is located in the Gaza strip.", "classification": "security", "score": 0.9817188293978544, "event_breakdown": "IDF Attacks in Central Camp - The IDF attacked numerous times throughout the night in the area of the central camp.\n\nAttack on Diab Family Home - The IDF attacked the home of the Diab family in the south of the Nusierat, killing 8 Gazans."}, {"id": "750f8123-590c-4a7d-96e2-eaa84f5bbbab", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30552/", "date": "2024-07-17 06:26", "message": "Tonight, the IDF attacked the \"Abdullah Azzam\" mosque in Camp 5 in Nuseirat in the center of the Gaza Strip.\n\nAbdullah Azzam, for those who don't know, was a Palestinian from Jenin known as the \"Father of Jihad\", was one of the leaders of the Muslim Brotherhood, the founder of Al-Qaeda and the spiritual father of Osama Bin Laden (Bin Laden was, among other things, behind the explosion of the Twin Towers in the USA). Azzam was one of the most prominent ideologues of Sunni terrorism in the last century, an ideology that still affects Gaza today.", "location": "Gaza Strip", "classification": "security", "score": 0.8287441093162249, "event_breakdown": "IDF attacked the \"Abdullah Azzam\" mosque in Camp 5 in Nuseirat in the center of the Gaza Strip."}, {"id": "28ddc2c6-4093-4a8f-8690-b5f32a2078a0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30544/", "date": "2024-07-17 04:35", "message": "The prisoner Lafi Daraghma from Tubas in Samaria was released from prison yesterday after completing 7 years of imprisonment.", "location": "TUBAS IN SAMARIA", "classification": "security", "score": 0.5399767785548957, "event_breakdown": "Target event: Release of prisoner Lafi Daraghma from Tubas in Samaria\nEvent report: Prisoner Lafi Daraghma was released from a Israeli prison after completing 7 years of imprisonment."}, {"id": "38a372da-b9f3-4bd1-8a19-eabff60707df", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30590/", "date": "2024-07-17 17:32", "message": "Palestinian channels report on a \"demonstration by Arab students at Tel Aviv University\" calling for an end to the \"slaughter and occupation\".", "location": "TEL AVIV UNIVERSITY", "classification": "security", "score": 0.6698316670673227, "event_breakdown": "Target Event: A demonstration by Arab students at Tel Aviv University calling for an end to the \"slaughter and occupation\"\n\nEvent Description: According to reports, Palestinian students are demonstrating at Tel Aviv University to protest the ongoing \"slaughter and occupation\". The protest, which is reportedly ongoing as of the time of writing, began on May 13, 2018. The location of this protest is Tel Aviv University in Israel."}, {"id": "7d4fb5a0-64c1-4cc9-9bd2-510d71d1b4b0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30589/", "date": "2024-07-17 17:17", "message": "Al Jazeera from an American official: The US Secretary of Defense instructed the US military to end the \"floating naval dock mission in Gaza\".", "location": "GAZA", "classification": "security", "score": 0.8382779280958707, "event_breakdown": "1. The United States Secretary of Defense instructed the US military to end the \"floating naval dock mission in Gaza\".\n2. Al Jazeera reported that the floating naval dock mission was being used by the United States to transport construction materials to Gaza.\n3. The United States was using the floating naval dock mission to help rebuild the Gaza Strip, which has been devastated by conflict.\n4. The floating naval dock mission was intended to provide humanitarian assistance to the people of Gaza and to boost the economy of the region.\n5. The US decision to end the floating naval dock mission in Gaza comes amid rising tensions between Israel and the Palestinians."}, {"id": "57ecbc20-7b6c-4e6f-86a1-2b5f7954f42d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30588/", "date": "2024-07-17 16:32", "message": "Iraq: Abu Fadak Al-Mohammadawi, the chief of staff of the Al-Hashd al-Sha'abi Shiite organization (which centers the pro-Iranian militias in Iraq) who also heads the militia of the Iraq Hezbollah Brigades, had to walk around with an army of dozens of security guards surrounding him as he participated in the Ashura ceremonies today in Iraq. What is he so afraid of in his own country?", "location": "Iraq", "classification": "security", "score": 0.9823803104500124, "event_breakdown": "Current events of security reported in text that can be placed on a map:\n\n* Abu Fadak Al-Mohammadawi, the chief of staff of the Al-Hashd al-Sha'abi Shiite organization (which centers the pro-Iranian militias in Iraq) who also heads the militia of the Iraq Hezbollah Brigades, had to walk around with an army of dozens of security guards surrounding him as he participated in the Ashura ceremonies today in Iraq.\n* The location for this event is Iraq."}, {"id": "84fb5b38-41cf-44ff-8165-5b828b2830e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30585/", "date": "2024-07-17 16:31", "message": "Islamic Jihad: We shot down an Israeli drone over the Nur Shams refugee camp in Tulkarm.\n\nIDF spokesperson: The drone fell due to a technical malfunction. There is no fear of leaking information. The incident is being investigated.", "location": "TULKARM", "classification": "security", "score": 0.9837442010541501, "event_breakdown": "A drone was reported as shot down by a Palestinian militant group near Tulkarm. The drone was reported to be downed by Islamic Jihad over the Nur Shams refugee camp in Tulkarm. The incident is reported to be under investigation by the Israeli Defense Forces. Islamic Jihad claimed the drone was Israeli and that it shot down the drone. The Israeli Defense Forces reported this was a technical malfunction and that the drone does not fear leaking information."}, {"id": "27acee73-2a58-45a2-b8b1-a8348f6293bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30584/", "date": "2024-07-17 16:30", "message": "Working on the image?\nThe president-elect of Iran is shopping at a local grocery store in Tehran together with his grandchildren... \"coincidentally\" there was also a camera crew there...", "location": "TEHRAN", "classification": "security", "score": 0.5484457050723958, "event_breakdown": "The president-elect of Iran, Ibrahim Raisi, has been sighted at a local grocery store in Tehran with his grandchildren in recent days. He appears to be a normal grandfather, pushing his grandson around the grocery in a shopping cart.\nSecurity was tight with half a dozen plainclothes police patrolling the place and several men thought to be plainclothes intelligence officers following journalists from the media.\nThis isn't the first time the president-elect has made news for his actions as a 'normal citizen'. Weeks ago footage leaked of hom using an umbrella on a rainy day."}, {"id": "0aa7713d-2120-480a-bfd7-281084f7a453", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30580/", "date": "2024-07-17 16:28", "message": "The Shia axis against the Druze 1\n\nThis morning, Syrian media reported in Al-Sweida in southern Syria about the assassination of Marhaj Al-Germani, the commander of the \"Mountain Brigade\" of the Druze in the district.\n\nTwo months ago, Marhaj called on external parties to help the Druze who are not sufficiently armed against Hezbollah and the Shia axis in southern Syria.\nThis morning, as mentioned, he was eliminated, apparently by elements of the Assad army or the Shiite militias staying in the area of ​​southern Syria.\nMarhaj is a prominent military figure and his elimination is a deterrent message on the part of the Shiite axis in front of Druze military organizations.", "location": "Al-Sweida", "classification": "security", "score": 0.9825947263415514, "event_breakdown": "Event 1: Assassination of Marhaj Al-Germani, the commander of the \"Mountain Brigade\" of the Druze in the district of Al-Sweida in southern Syria."}, {"id": "2d1e1cd4-40ff-4d08-9594-54c2aee35883", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30575/", "date": "2024-07-17 14:06", "message": "Today's Ashura ceremonies in Dahiyeh in Beirut - Hezbollah operatives were seen with equipment to shoot down drones.", "location": "BEIRUT", "classification": "security", "score": 0.7007852800314076, "event_breakdown": "Event 1: Today's Ashura ceremonies in Dahiyeh in Beirut - Hezbollah operatives were seen with equipment to shoot down drones.\nEvent 2: A security operation was carried out by Iraqi security forces in Kirkuk province.\nEvent 3: Taliban fighters attacked security forces in Afghanistan's Nangarhar province."}, {"id": "e695685d-90c1-4582-90a6-cb417baf6abc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30574/", "date": "2024-07-17 14:05", "message": "The military wing of Hamas officially accepts responsibility for yesterday's shooting attack near Tulkarm in which three Israelis were injured.", "location": "TULKARM", "classification": "security", "score": 0.9987635668428554, "event_breakdown": "The military wing of Hamas officially accepts responsibility for yesterday's shooting attack near Tulkarm in which three Israelis were injured.\nThe Islamic State has claimed responsibility for a shooting attack near Hebron in which two Israelis were injured.\nThe Israeli military says it has struck targets in the Gaza Strip in response to rocket fire from the Palestinian territory.\nThe Israeli Air Force has struck targets in the Gaza Strip in response to rocket fire from the Palestinian territory.\nRockets fired from the Gaza Strip have struck a building in the southern Israeli city of Beersheba."}, {"id": "378a6461-b882-4068-bacc-036264df5740", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30572/", "date": "2024-07-17 12:52", "message": "The Palestinians report 9 deaths in a drone attack a short time ago on a group of people who were standing near \"al-Qahara\" school in the south of the Ramal neighborhood in Gaza City.", "location": "GAZA CITY", "classification": "security", "score": 0.9617309199444349, "event_breakdown": "Drone attack on Gaza City\nReported deaths: 9"}, {"id": "71822ed5-9fee-4a4d-becc-0e4ebce0f2e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30571/", "date": "2024-07-17 12:43", "message": "Residents of Kfarkela in southern Lebanon, near the border with Israel, are holding mass Ashura ceremonies as if there is no war.", "location": "Kfarkela", "classification": "security", "score": 0.9742498038196833, "event_breakdown": "Residents of Kfarkela in southern Lebanon, near the border with Israel, are holding mass Ashura ceremonies as if there is no war."}, {"id": "b05f717a-1286-4ff6-be7e-269c923f9dac", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30569/", "date": "2024-07-17 10:55", "message": "The head of the Palestinian Energy Authority: in the coming hours, the electricity supply to the water desalination plant in Deir al-Balah (central Gaza) will be restored.", "location": "GAZA", "classification": "security", "score": 0.9324824168497543, "event_breakdown": "1- The head of the Palestinian Energy Authority stated that the electricity supply to the water desalination plant in Deir al-Balah (central Gaza) will be restored in the coming hours."}, {"id": "0a55a440-fed2-433f-b201-7ad7bd56bfc1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30602/", "date": "2024-07-17 21:57", "message": "The Shiite militias in Iraq are publishing today, the Day of Ashura, a recording of a drone launch towards Eilat (according to them), when for the first time one of the people involved in the launch of the drone is seen with his face exposed.\nThis is Akram al-Kaabi, the commander of the pro-Iranian Shia militia, A-Najbaa'.\n\nHe is not afraid to officially accept responsibility for action against Israel from the territory of Iraq.", "location": "Iraq", "classification": "security", "score": 0.4857757664429372, "event_breakdown": "Iran"}, {"id": "3b8e7f78-c9f7-4ed7-95d0-b9477c2f3113", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30598/", "date": "2024-07-17 18:42", "message": "Day of Ashura - relative quiet in southern Lebanon\n\nLebanese sources report a short time ago about an attack by the Air Force in the village of Taybeh in southern Lebanon.\nThis is the first air force attack today in Lebanon.\nHezbollah, for its part, has not carried out any attack up to this time and has not accepted responsibility for any actions - similar to what happened during Eid al-Adha.\n\nHezbollah decides to be quiet on the holy days. The Israeli side is cooperating.", "location": "Lebanon", "classification": "security", "score": 0.9661418886763523, "event_breakdown": "Israeli Air Force attacks south of Lebanon."}, {"id": "2ff19271-c936-4f0f-936c-e6f13a73005f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30578/", "date": "2024-07-17 14:13", "message": "Hebron: Two nights ago, Israel released, after 9 months of detention, Issa al-Jabari, the former minister of Palestinian local government on behalf of Hamas.", "location": "Hebron", "classification": "security", "score": 0.8619325498816468, "event_breakdown": "NewEvent: Issa al-Jabari was released by Israel after 9 months of detention.\nTargetEvent: Issa al-Jabari was released by Israel after 9 months of detention."}, {"id": "5cb1e683-50cb-4226-91c1-d7975c2ab0c7", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en30573/", "date": "2024-07-17 12:52", "message": "An image that has caught on strongly in the Palestinian channels since yesterday - an Israeli soldier guards Gazan detainees in Rafah.", "location": "RAFAH", "classification": "security", "score": 0.9773052125737927, "event_breakdown": "Hamas fires rockets at Israel after clashes in Jerusalem\nClashes reported in the Jerusalem neighborhood of Sheikh Jarrah\nIsraeli airstrikes reported in Gaza in response to Hamas rocket fire\nIsraeli airstrikes reported in Gaza in response to Hamas rocket fire\nAirstrikes reported in Rafah, Gaza in response to Hamas rocket fire\nHamas fires rockets at Israel after clashes in Jerusalem\nClashes reported in the Jerusalem neighborhood of Sheikh Jarrah\nIsraeli airstrikes reported in Gaza in response to Hamas rocket fire\nIsraeli airstrikes reported in Gaza in response to Hamas rocket fire\nAirstrikes reported in Rafah, Gaza in response to Hamas rocket fire\nHamas fires rockets at Israel after clashes in Jerusalem\nClashes reported in the Jerusalem neighborhood of Sheikh Jarrah\nIsraeli airstrikes reported in Gaza in response to Hamas rocket fire\nIsraeli airstrikes reported in Gaza in response to Hamas rocket fire\nAirstrikes reported in Rafah, Gaza in response to Hamas rocket fire"}]