[{"id": "018bb304-bc38-4830-af75-2c294e30803f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29175/", "date": "2024-06-20 07:30", "message": "The Lebanese Al-Akhbar newspaper (Hezbollah-affiliated): \n\nFollowing Nasrallah's speech (and the threat to Cyprus), senior Cypriot officials began a series of talks with senior officials in Lebanon last night. \n\nApparently, a high-ranking Cypriot official will arrive in Beirut today to hold a series of meetings with Lebanese officials and with senior members of the Lebanese army.\n\n##\nHezbollah supporters are quite amused by the pressure the Cypriots are demonstrating following one short statement in Nasrallah's speech.\n\nYesterday, following the speech, the president of Cyprus emphasized that his country is not part of the conflicts in the regions and is not involved.", "location": "Lebanon", "classification": "security", "score": 0.5074566943397592, "event_breakdown": "Lebanese Al-Akhbar newspaper reports that various Cypriot officials held discussions with Lebanese officials in the wake of the recent speech made by Hezbollah Secretary-General Hassan Nasrallah. Nasrallah's speech was perceived to contain a threat to Cyprus.\n\nThe article also notes that a high-ranking Cypriot official will arrive in Beirut today, intending to organize further meetings with Lebanese officials and senior members of the Lebanese army."}, {"id": "e052a2ab-9686-49af-937c-444c91465179", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29174/", "date": "2024-06-20 07:27", "message": "Palestinian channels report that Israel released 33 Gazan prisoners back to the Gaza Strip this morning.\n\nThey arrived at the al-Aqsa Martyrs Hospital in Deir al-Balah in the center of the Gaza Strip.", "location": "Gaza Strip.", "classification": "security", "score": 0.9753161487852113, "event_breakdown": "Three 33 prisoners were released by Israel in the Gaza Strip on the morning of Oct. 22, 2021.The prisoners were brought to al-Aqsa Martyrs Hospital in Deir al-Balah in the Gaza Strip.The event is an \\ current security event that has three locations: Gaza, Gaza Strip, and Deir al-Balah."}, {"id": "b80f198a-17f3-4021-a9db-c4aea043c47f", "channel_id": 1560386984, "url": "https://abualiexpress.com/heb69164/", "date": "2024-06-20 06:28", "message": "Hamas condemns in an official statement on its behalf the \"barbaric\" rearrest last night of the senior member of its ranks, Aziz Dweik, the chairman of the Palestinian Legislative Council.\n\nDweik was arrested last night by IDF forces, a week after he was released from a 9-month detention following October 7th.", "location": "Palestine", "classification": "security", "score": 0.8101397119400789, "event_breakdown": "IDF soldiers arrested Hamas leader Aziz Dweik yesterday evening. Dweik is the chairman of the Palestinian Legislative Council and was previously arrested and detained for 9 months by Israel. His rearrest has sparked controversy."}, {"id": "c33fe05f-202d-4cec-b706-4b3a7760121c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29168/", "date": "2024-06-20 05:59", "message": "The Lebanese Druze leader, Walid Jumblatt against Nasrallah's threats to Cyprus: Cyprus served as a refuge for the Lebanese during the Cold War and for decades.", "location": "Based on the text, the main location of the event is Cyprus.", "classification": "security", "score": 0.8721049744233432, "event_breakdown": "Lebanese Druze leader Walid Jumblatt has criticized Sheikh Hassan Nasrallah, the secretary-general of the Iran-backed Lebanese Shiite Hezbollah militia for his military threats against Cyprus. In an Arabic tweet Nasrallah had threatened to target the island nation over its cooperation with the US in sanctions against Lebanon, Jumblatt protested the threats; \"Cyprus has served as a refuge for the Lebanese during the Cold War and for decades.\" Jumblatt's words come weeks after Hezbollah blew up a gas truck stood in the fire."}, {"id": "7f1f0ec7-e420-4a1f-809b-72332f67875d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29161/", "date": "2024-06-20 05:39", "message": "Doha, Qatar: Ismail Haniyeh, the chairman of the political bureau of Hamas and a number of senior Hamas officials receive with hugs and kisses Ali Bagheri, acting in place of the Iranian foreign minister who was killed in the crash of the Iranian president's helicopter.", "location": "Doha, Qatar", "classification": "security", "score": 0.931828485803267, "event_breakdown": "Target event: Slain Iranian official met with Hamas officials in Qatar\nEvent: Slain Iranian official met with Hamas officials in Qatar"}, {"id": "98d94932-d738-49df-9eeb-fad36f2d739d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29159/", "date": "2024-06-20 05:35", "message": "Senior Hamas leader Izzat al-Risheq in an official press release:\n\nThe words of the spokesman of the Zionist army and the clarification he issued following them are one of the strategic changes caused by the \"Tufan Al-Aqsa\" system on the blessed October 7th.\n\n\"Hamas is an idea in the hearts of the people and its elimination is an illusion and throwing sand in the eyes of the Israelis.\" Hagari is right and he is a liar (usually).\n\nThe idea that (Hagari) spoke of is the idea of ​​resistance, which is getting stronger and renewed, until the victory of the determined ones over their enemies, until the occupation ends and the land is cleansed of its impurity.\n\nFor more than a century, the British mandate and then the occupation have been trying to eliminate this idea and today they publicly confirm that these attempts have failed and that they are powerless against the resistance and especially against the Hamas movement.", "location": "Palestine", "classification": "security", "score": 0.7586123233052777, "event_breakdown": "Hamas leader Izzat al-Risheq says \"Tufan Al-Aqsa\" system a strategic change, Israel powerless against resistance - English\nHamas leader Izzat al-Risheq says the Israeli army is powerless against the \"resistance\" and specifically the Hamas movement."}, {"id": "1215f987-2820-4a28-8a9d-72ae7402b83b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29195/", "date": "2024-06-20 14:06", "message": "The spokesperson of the European Union responded to Nasrallah's threats to Cyprus by stating:\n\nCyprus is a member of the European Union, and any threat made against it is a threat against all members of the European Union.", "location": "The EU", "classification": "security", "score": 0.7484302674832579, "event_breakdown": "Nasrallah's threats regarding Cyprus should be considered as current security threats that can be placed on a map. Cyprus, as a member of the European Union, is under the protection of other member states in the event of a threat. The European Union has responded by warning Hezbollah that any threats against Cyprus will be treated as threats against the entire Union."}, {"id": "d854c21a-b3fe-45ca-a385-7f1c7885e182", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29193/", "date": "2024-06-20 13:11", "message": "Unofficial Lebanese channels report on several casualties in another drone strike, which took place a short time ago in the Hanouiyeh area in southern Lebanon.\n\nThe third vehicle in southern Lebanon to explode so far today.", "location": "Lebanon", "classification": "security", "score": 0.9447551536982001, "event_breakdown": "Drone strike reported in Hanouiyeh area, southern Lebanon, resulting in several casualties."}, {"id": "c1957268-3d81-496a-86bf-ed6debef1c0d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29190/", "date": "2024-06-20 13:05", "message": "Lebanese media reports on a second car explosion today, this time in the village of Houmine al-Faouqa, about 40 km from the border with Israel.\n\nAccording to estimates, an Israeli drone attacked the vehicle here as well, but there is no official confirmation yet.\n\nAccording to Lebanese sources, the deceased is Hadi Muhammad Jameh, a Hezbollah operative and the son of the Shia sheikh Muhammad Jameh.", "location": "Lebanon", "classification": "security", "score": 0.9044379035716421, "event_breakdown": "Second car explosion reported in Houmine al-Faouqa, Lebanon. Israeli drone attack suspected, with no official confirmation. The deceased is Hadi Muhammad Jameh, a Hezbollah operative and the son of Muslim leader Muhammad Jameh."}, {"id": "76ec421e-20d4-488d-8161-119d2bb96b87", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29189/", "date": "2024-06-20 12:52", "message": "And just moments after Hezbollah's announcement 👆, the IDF spokesperson made an announcement of his own:\n\nIDF: Earlier today (Thursday), the terrorist Fadel Ibrahim was eliminated by an IAF aircraft in a precise strike in the area of Deir Kifa in southern Lebanon. \n\nIbrahim was the commander of Hezbollah operations in the Jouaiyya area.\n\nAs part of his role, Ibrahim was responsible for planning and carrying out terror attacks against Israel and commanding Hezbollah ground forces in the area of Jouaiyya. Over the past few months, Ibrahim worked to further embed Hezbollah’s forces in southern Lebanon as part of efforts to improve the terrorist organization's ground combat capabilities. \n\nSimultaneously, a Hezbollah surface-to-air missile launcher that posed a threat to aircraft operating over Lebanon was struck by IAF fighter jets in the area of Rihan. The IAF will continue to operate in Lebanese airspace to fulfill the missions of the IDF and maintain the aerial operational freedom of the IDF.", "location": "Lebanon", "classification": "security", "score": 0.9463701225621071, "event_breakdown": "IDF eliminated Hezbollah commander Fadel Ibrahim in a precise strike in southern Lebanon earlier today, Thursday. Ibrahim was responsible for planning and carrying out terror attacks against Israel and commanding Hezbollah ground forces. Additionally, a Hezbollah surface-to-air missile launcher was struck by IAF fighter jets in the area of Rihan."}, {"id": "4a0bbce3-6cc7-4d11-b9c8-ff1f0e5752b2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29188/", "date": "2024-06-20 12:50", "message": "Hezbollah announces a death in its ranks:\n\nAbbas Ibrahim Hamadeh (Fadel), a resident of the village of Shahabiya in southern Lebanon.\n\nHe was killed in a drone strike this morning while driving his car in Deir Kifa👆\n\nNumber 350.", "location": "Deir Kifa", "classification": "security", "score": 0.9904910539092134, "event_breakdown": "The target event in the provided text is the reported death of Hezbollah member Abbas Ibrahim Hamadeh (Fadel) in a drone strike in Deir Kifa, Lebanon. This can be placed on a map marking the specific location, Deir Kifa."}, {"id": "dbffb0f7-3194-41d8-b8cb-b5a03e9b89f5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29187/", "date": "2024-06-20 11:56", "message": "Palestinian sources report that the IDF forces evacuated the now-destroyed Rafah crossing complex and are now stationed outside it.", "location": "RAFAH", "classification": "security", "score": 0.9687166375022801, "event_breakdown": "IDF evacuation of Rafah crossing complex, outside which they are currently stationed."}, {"id": "f54bc3fe-c4c2-496c-9793-c7e22c86492a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29186/", "date": "2024-06-20 10:48", "message": "According to Lebanese sources, the person killed in today's drone strike on a vehicle in Deir Kifa is Abbas Hamadeh, a Hezbollah operative.", "location": "BEIRUT", "classification": "security", "score": 0.9280249002328645, "event_breakdown": "Abbas Hamadeh, a Hezbollah operative, was killed in a drone strike on a vehicle in Deir Kifa on August 22, 2022, in Lebanon."}, {"id": "50f31551-73e7-4296-95c9-cfede8f3b510", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29183/", "date": "2024-06-20 10:43", "message": "IDF spokesperson:\n\nAn IAF aircraft, with the help of the IDF's Gaza Division, Military Intelligence Directorate and the Shin Bet, attacked and killed Hamas terrorist Ahmed Hassan Salmi al-Sawarkeh in the Beit Hanun area.\n\nAl-Sawarkeh served as a squad commander in Hamas' Nukhba force, and participated in the October 7 attacks on Israeli towns bordering the strip.\n\nIn addition, the terrorist led and directed sniper activities in the Beit Hanoun area and took part in terrorist operations against IDF forces.\n\n##\nPalestinian sources report that  al-Sawarkeh was killed on Sunday this week in a targeted drone strike while on the roof of the Ghazi a-Shawa government school in Beit Hanoun (north of the Gaza Strip).\n\nHe was seriously injured, and was evacuated to a nearby hospital. At one point, al-Sawarkeh was even revived, but despite this he died of his injuries after a while.\n\nHamas terrorists seem to like to congregate near schools - which they see as safe hiding places.", "location": "Beit Hanun", "classification": "security", "score": 0.9623853152493252, "event_breakdown": "IDF spokesperson and Palestinian sources report that Hamas terrorist Ahmed Hassan Salmi al-Sawarkeh was killed this week in a targeted drone strike in the Beit Hanoun (north of the Gaza Strip). He was seriously injured and was evacuated to a nearby hospital, where he later died of his injuries. [This is the target event.]"}, {"id": "22e4be8c-3acb-43c7-8108-5209fc36c67f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29179/", "date": "2024-06-20 10:13", "message": "Lebanese channels report that at least one person was killed in a targeted drone strike on a vehicle near the village of Deir Kifa in southern Lebanon.", "location": "BEIRUT", "classification": "security", "score": 0.9955332512467254, "event_breakdown": "Lebanese channels report that at least one person was killed in a targeted drone strike on a vehicle near the village of Deir Kifa in southern Lebanon."}, {"id": "3bfb29b2-feaf-46a6-a065-6ba4071e1878", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29178/", "date": "2024-06-20 10:11", "message": "The Palestinians report that the IDF is blowing up residential complexes at this time in West Rafah.", "location": "RAFAH (West)", "classification": "security", "score": 0.8777124140561191, "event_breakdown": "IDF blowing up residential complexes in West Rafah, Palestine."}, {"id": "9f2f345d-474d-422b-96b6-d9591543ffe5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29176/", "date": "2024-06-20 10:08", "message": "IDF activity in Rafah: Before and after photos of the part connecting the neighborhoods of Yabneh and Shaboura in the center of Rafah, in the area of the al-Hada and al-Abrar mosques.\n\nThe Yabneh neighborhood (on the left, south) borders the Philadelphia axis - note the strip that was cleared from the border and almost up to the main road that passed through the neighborhood.", "location": "RAFAH.", "classification": "security", "score": 0.9862077553337224, "event_breakdown": "IDF activity in Rafah, Rafah is a city in southern Gaza near the Egypt border. On Sunday, the IDF carried out airstrikes against \"multi-barrel rocket launching sites and underground infrastructures\" in the area, according to the IDF Spokesperson's Unit. Earlier that morning, a rocket was fired towards Beersheva from\n\"a Hamas-ruled Rafah in the southern Gaza Strip.\"*"}, {"id": "15301394-17d2-4839-b3ee-412ba8d4c698", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29206/", "date": "2024-06-20 18:48", "message": "Lebanese throw Pepsi products in protest, following the change in the colors of the company's logo from red, white and blue to just white and blue, which are the colors of the Israeli flag...", "location": "BEIRUT", "classification": "security", "score": 0.4137211862225395, "event_breakdown": "Lebanese throw Pepsi products in protest, following the change in the colors of the company's logo from red, white and blue to just white and blue, which are the colors of the Israeli flag.\n\nThe target event is that Lebanese are throwing Pepsi products in protest. The location where this event is happening is Lebanon."}, {"id": "f7a32c46-1081-4f78-bbdf-63fafde1c24d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29200/", "date": "2024-06-20 18:00", "message": "Palestinian journalists are reporting at this time that IDF forces are blowing up additional buildings near the Netzer Corridor south of Gaza City with the aim of expanding it.", "location": "GAZA CITY", "classification": "security", "score": 0.9885676059758456, "event_breakdown": "IDF forces are blowing up buildings near the Netzer Corridor south of Gaza City with the aim of expanding it."}, {"id": "8182a7de-15d5-45c0-9906-5008956fda10", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29198/", "date": "2024-06-20 17:57", "message": "\"The road to Jerusalem goes through Ayia Napa...\"\n\nH. Nasrallah", "location": ")\nAIYA napa", "classification": "security", "score": 0.9397274395155647, "event_breakdown": "Ayia Napa is a city in southeast Cyprus and it can be used as a stepping stone towards visiting Jerusalem."}, {"id": "84636c1d-db37-493f-ba02-7301529dab7c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29197/", "date": "2024-06-20 17:56", "message": "Hossein al-Sheikh, Secretary General of the PLO Working Committee and designated to succeed Abu Mazen, in an interview:\n\nIsrael does not transfer to us 100% of the clearing funds (the funds that Israel clears for the Palestinian Authority according to the Oslo Accords - AA).\n\nIsrael is seriously causing the collapse of the Palestinian Authority.\nWashington is aware of the PA's difficult economic situation.\n\nThe alternative to PA is chaos.\n\nThe Palestinian Authority will not be ready for any conditions on the part of Israel in order to receive the clearing money. Israel wants to prevent us from transferring money to Gaza and we refuse to do so.\n\nWe are in contact with Hamas. We will return to control the Rafah crossing only in agreement with Hamas.\n\nIsrael established a buffer zone two kilometers deep in the Gaza Strip. Israel has no intention of withdrawing from the Strip, it intends to divide it in two and separate the north from the south.\n\nIf the PLO does not return to the Strip, a (Palestinian) civil war will break out.", "location": "Gaza", "classification": "security", "score": 0.8827275251637132, "event_breakdown": "Hossein al-Sheikh, Secretary General of the PLO Working Committee and designated to succeed Abu Mazen, said in an interview that Israel is not willing to transfer 100% of the funds to the Palestinian Authority, which seriously threatens the collapse of the PA. Israel is preventing the transfer of money to Gaza. Israel is preventing the PA from receiving clearing funds in according to the Oslo Accords.\n\nAccording to al-Sheikh, the US is aware of the PA's difficult economic situation. The alternative to a functioning Palestinian Authority is chaos. Al-Sheikh also confirmed that the PLO is in communication with Hamas.\n\nAl-Sheikh criticized the buffer zone established in the Gaza Strip by Israel, which divides the Strip in two. According to al-Sheikh, Israel intends to occupy the Strip on a permanent basis. If the PLO does not return to Gaza, a (Palestinian) civil war will break out."}, {"id": "c0264beb-9fe1-4232-9380-529695b22511", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29173/", "date": "2024-06-20 07:27", "message": "The view from the bedroom of an apartment in the Jabalia \"refugee camp\" in the north of the Gaza Strip.", "location": "GAZA STRIP", "classification": "security", "score": 0.9662263620306774, "event_breakdown": "Hamas launching rockets at Israel on 5/12/22 in the West Bank\nLocal firefight breaks out between army and militia groups in Yemen overnight\nMilitants storm army base, kill 12 soldiers in eastern Ukraine on 5/19/22\nPresident Biden signs executive order implementing sanctions on Russia on 5/20/22\nTaliban regaining control of Afghanistan on 8/30/21\nLocal firefight breaks out between army and Houthi militia groups in Yemen overnight\nHundred's protest new military draft law in tel Aviv\nTargets army base in southern Syria on 5/10/22\nMultiple terrorist attacks take place in Nigeria on 5/13/22\nLocal firefight breaks out between army and Taliban forces in Afghanistan overnight\nTaliban forces and isis fight battle in gardez on 9/14/21\nIsraeli forces attack Syrian military targets on 5/5/22\nPresident bouteflika back in power in algeria\nMilitants storm army base, kill 12 soldiers in eastern Ukraine on 5/19/22"}, {"id": "8d1f916a-0f62-4053-9c1a-778610cef6bc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en29210/", "date": "2024-06-20 20:19", "message": "A short time ago, the IDF attacked the Hamdan family home next to the journalists' tents in the Nasser hospital complex in Khan Yunis in the southern Gaza Strip.\n\nThe attack was preceded by an evacuation notice that allowed the attached documentation.", "location": ")\nKhan Yunis", "classification": "security", "score": 0.9451975458036531, "event_breakdown": "IDF attacked the Hamdan family home in Khan Yunis, Gaza Strip."}]