[{"id": "a2856dab-3500-4ce8-b590-8d398f0c4bfc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26784/", "date": "2024-05-06 16:33", "message": "Despite the report of \"Al-Arabi Al-Jadid\" 👆 Al-Qahara channel reports from an Egyptian source that a Hamas delegation is expected to return to Cairo tomorrow to complete the talks regarding a ceasefire.\n\n##\nSuch conflicting reports point to media spins. Meanwhile, there are no public statements by senior Hamas officials on the issue and they maintain ambiguity to allow Hamas room to maneuver.", "location": "Cairo", "classification": "security", "score": 0.5829639453992771, "event_breakdown": "- Hamas delegation expected to return to Cairo for ceasefire talks"}, {"id": "eb50ab53-c752-4df8-a5a6-cfe3e2c05d2a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26781/", "date": "2024-05-06 16:33", "message": "IDF activity in the Tulkarm refugee camp:\nThe Palestinians report that IDF forces blew up the house of Ashraf Nafe, a senior member of the Hamas military wing in Tulkarm, as well as a vehicle in which weapons were discovered.\nAttached are photos of the explosion of the building and the vehicle.", "location": "Tulkarm", "classification": "security", "score": 0.9944000176094396, "event_breakdown": "- IDF forces blew up the house of Ashraf Nafe, a senior member of the Hamas military wing, in the Tulkarm refugee camp, Palestine.\n- IDF forces blew up a vehicle in the Tulkarm refugee camp, where weapons were discovered."}, {"id": "b39d1124-b0ff-47a1-90f0-a3bbaaf638bd", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26780/", "date": "2024-05-06 16:10", "message": "Mahmoud Elhabash, advisor to the PA chairman in an interview with the Al-Arabiya network:\n\nHamas gave Israel all the justifications for it to go to war against Gaza.\n\nHamas is also responsible for what happened and what will happen in Rafah.\n\nHamas wants to stay in power more than it wants to release prisoners.\n\nThe innocent abductees in the Gaza Strip (meaning the residents of the Gaza Strip - AA) are paying the price for Hamas's adventures.\n\nHow does Hamas say it is ready militarily. We are a defenseless people.", "location": "Rafah.", "classification": "security", "score": 0.8778452720962142, "event_breakdown": "1. Mahmoud Elhabash, advisor to the PA chairman, accuses Hamas of providing justifications for Israel to go to war against Gaza in an interview with Al-Arabiya network.\n2. He holds Hamas responsible for the events in Rafah and suggests that the group prioritizes staying in power over releasing prisoners.\n3. Elhabash claims that innocent residents of Gaza are paying the price for Hamas's actions and questions Hamas's readiness for military defense."}, {"id": "60b8359b-a339-409e-9e6e-8983a78d94ef", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26776/", "date": "2024-05-06 14:58", "message": "Gazans on their way from Rafah towards Khan Yunis following the evacuation order of the IDF this morning.\nPalestinian reports of a significant evacuation movement since this morning.", "location": "Khan Yunis", "classification": "security", "score": 0.8010250207974416, "event_breakdown": "- Gazans evacuating from Rafah to Khan Yunis following IDF evacuation order\n- Significant evacuation movement reported by Palestinians since this morning"}, {"id": "2dd2aa1c-1c67-42dc-b79e-b5a2ed1d3b47", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26775/", "date": "2024-05-06 14:58", "message": "\"Al Arabi Aljadid\" from a source in Hamas:\n\nAfter consulting with the opposition factions, Hamas decided to suspend the ceasefire talks.\nThe return of the Hamas delegation to Cairo will be postponed pending the results of the mediators' efforts.\n\n##\nIt is important to note that there is still no official announcement by Hamas about this.", "location": "Cairo", "classification": "security", "score": 0.8445724979695316, "event_breakdown": "- Hamas decides to suspend ceasefire talks after consulting with opposition factions\n- Postponement of the return of Hamas delegation to Cairo pending mediators' efforts"}, {"id": "b6f1e43c-ac90-4896-a46b-ecaa6c618f02", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26771/", "date": "2024-05-06 13:27", "message": "A reporter for the Lebanese Almanar channel (Hezbollah-affiliated) claims: an Israeli F15 fighter jet tried to intercept the Hezbollah UAV that eventually hit the target in Metula.", "location": "Metula", "classification": "security", "score": 0.9211375934321663, "event_breakdown": "- A reporter from the Lebanese Almanar channel claims that an Israeli F15 fighter jet attempted to intercept a Hezbollah UAV.\n- The Hezbollah UAV successfully hit its target in Metula."}, {"id": "8d73c708-5cbd-49a7-a72d-e8186c9e77c0", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26770/", "date": "2024-05-06 13:24", "message": "Palestinian channels publish documentation of one of the IDF attacks in eastern Rafah a short time ago.", "location": "Rafah", "classification": "security", "score": 0.9068726379997347, "event_breakdown": "- Palestinian channels publish documentation of an IDF attack in eastern Rafah."}, {"id": "deeb974d-1a2b-46bb-8b85-994ba63f0e3b", "channel_id": 1560386984, "url": "", "date": "2024-05-06 13:21", "message": "Residents of eastern Rafah are evacuating to the Khan Yunis area following the instructions of the IDF.", "location": "Khan Yunis", "classification": "security", "score": 0.8786388897752188, "event_breakdown": "- Residents of eastern Rafah evacuating to the Khan Yunis area"}, {"id": "10ebeb40-069a-4335-97a4-2156f9beec16", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26759/", "date": "2024-05-06 13:19", "message": "The Palestinians report IDF attacks a few hours ago in the eastern Rafah area.", "location": "Rafah", "classification": "security", "score": 0.9109490512355808, "event_breakdown": "- IDF attacks in the eastern Rafah area"}, {"id": "7165f851-efc6-4a02-8f18-9c33e34fb563", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26759/", "date": "2024-05-06 13:18", "message": "Lebanese channels are publishing documentation of some of the 15 attacks carried out by the IDF in the last hour 👆 in the al-Lwaiza area in southern Lebanon.", "location": "Al-Lwaiza area, southern Lebanon", "classification": "security", "score": 0.977651478859723, "event_breakdown": "- IDF carries out 15 attacks in al-Lwaiza area in southern Lebanon"}, {"id": "2af43307-6f48-457f-add4-c2daa1baf70a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26757/", "date": "2024-05-06 13:17", "message": "Hezbollah accepted responsibility for a suicide drone attack in the Metula area.", "location": "Metula", "classification": "security", "score": 0.9952909530248407, "event_breakdown": "- Hezbollah accepted responsibility for a suicide drone attack in the Metula area."}, {"id": "8dfa6a2f-6274-4517-9133-b2c25e08f9ed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26756/", "date": "2024-05-06 13:16", "message": "IDF Spokesperson: Following the sirens that sounded in northern Israel regarding a hostile aircraft infiltration, a UAV was identified crossing from Lebanon into the area of Metula in northern Israel.\n\nMoreover, a short while ago, IDF fighter jets struck approximately 15 military structures and terror infrastructure located in a military compound belonging to Hezbollah's Radwan Force in the area of Al-Lwaiza in southern Lebanon.", "location": "Metula", "classification": "security", "score": 0.986302644746115, "event_breakdown": "- Sirens sounded in northern Israel regarding a hostile aircraft infiltration.\n- A UAV was identified crossing from Lebanon into the area of Metula in northern Israel.\n- IDF fighter jets struck approximately 15 military structures and terror infrastructure.\n- The strike targeted a military compound belonging to Hezbollah's Radwan Force.\n- The military compound is located in the area of Al-Lwaiza in southern Lebanon."}, {"id": "4fc7ee68-54e2-42d1-9cf6-cfafedfcddb2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26755/", "date": "2024-05-06 13:07", "message": "The IDF spokesperson announced the fall of a fighter from the Nahal Brigade.\n\nHe fell together with 3 others yesterday as a result of the rockets fired at Kerem Shalom.\n\nMay his memory be a blessing.", "location": "Kerem Shalom", "classification": "security", "score": 0.9159475538793057, "event_breakdown": "- IDF soldier from the Nahal Brigade fell as a result of rockets fired at Kerem Shalom"}, {"id": "2e6d0bd3-609d-472e-8905-4ef13cea712c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26754/", "date": "2024-05-06 13:07", "message": "Senior Hamas official Musa Abu Marzouk, in an interview with MBC:\nWe were not asked to leave Qatar. We are in Qatar according to the will of the USA which requested it from Qatar after we left Jordan.\n\nAbu Marzouk added in the interview - our victory is around the corner and we will dedicate it to the Egyptian president and Arab leaders.", "location": "Qatar", "classification": "security", "score": 0.5075478510075391, "event_breakdown": "Event 1: Interview with senior Hamas official Musa Abu Marzouk\n- Location: Qatar\n\nEvent 2: USA requested Hamas to be in Qatar after leaving Jordan\n- Location: Qatar, Jordan\n\nEvent 3: Abu Marzouk states victory is imminent and dedicated to Egyptian president and Arab leaders"}, {"id": "4c6cb52c-4e85-4e78-b842-ce52eb36d9ff", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26750/", "date": "2024-05-06 13:05", "message": "Movement of displaced persons from east Rafah to the Moasi area in Khan Yunis.", "location": "Khan Yunis", "classification": "security", "score": 0.9304662511947411, "event_breakdown": "- Movement of displaced persons from east Rafah to the Moasi area in Khan Yunis."}, {"id": "e084a0c4-8868-42c7-9358-3abc0171ea77", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26750/", "date": "2024-05-06 13:05", "message": "Assassination of Hezbollah senior Iyad al-Saleh yesterday in Hasakah, Syria👆:\nThe moment the luggage exploded in his luxury car.", "location": "Hasakah, Syria", "classification": "security", "score": 0.9626867687429024, "event_breakdown": "1. Assassination of Hezbollah senior Iyad al-Saleh in Hasakah, Syria.\n2. Explosion of luggage in his luxury car."}, {"id": "6fda68cc-ceb4-4470-b0d5-c11c761e17c6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26748/", "date": "2024-05-06 13:02", "message": "The Embassy of the United Arab Emirates in Tel Aviv expresses its sorrow and sympathy on the occasion of the Remembrance Day of the Holocaust and Heroism. We will not forget the horrors of the past and we will work for a better future.", "location": "Tel Aviv", "classification": "security", "score": 0.4471810925397736, "event_breakdown": "- The Embassy of the United Arab Emirates in Tel Aviv expresses sympathy on Holocaust Remembrance Day."}, {"id": "5305aea6-bc20-42e1-b990-5f16167dd17e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26746/", "date": "2024-05-06 12:58", "message": "Hezbollah: This morning at 09:00 we attacked the Nafah base in the Golan with dozens of Katyushas in response to the IDF attack 👆", "location": "Nafah base", "classification": "security", "score": 0.9581725330617198, "event_breakdown": "- Hezbollah attacks Nafah base in the Golan with dozens of Katyusha rockets in response to IDF attack."}, {"id": "aab53559-405f-4376-962b-6dd2fd0765fc", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26745/", "date": "2024-05-06 12:52", "message": "The Lebanese Al Mayadeen from a source in the \"Palestinian Resistance\":\n\nIn light of recent events and Israel's threat of action in Rafah, Hamas is inclined to stop the negotiations now.\nThe movement emphasizes that the threat of action in Rafah does not constitute pressure on it in conducting the negotiations.", "location": "Rafah", "classification": "security", "score": 0.7859906865396947, "event_breakdown": "null"}, {"id": "a0732b01-18ff-4a19-95f2-ada8da17b767", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26741/", "date": "2024-05-06 12:51", "message": "Passenger traffic this morning at the Rafah crossing - the Egyptians cannot give up an industry worth millions of dollars a month for \"coordinating exit from Gaza\".", "location": "Rafah crossing", "classification": "security", "score": 0.7662507057135044, "event_breakdown": "- Passenger traffic at Rafah crossing this morning\n- Egyptians unable to give up industry worth millions of dollars for coordinating exit from Gaza"}, {"id": "7f34aa7c-5b9d-4323-b3bc-9f2d2bba5815", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26740/", "date": "2024-05-06 12:49", "message": "The public relations officer of the Rafah crossing Wa'el Abu Mahsan: Civilian movement is still possible at the Rafah crossing (there is a passage for passengers and there is a passage for trucks and goods - apparently the goods passage is the one that is currently blocked - AA).", "location": "Rafah crossing", "classification": "security", "score": 0.9077901936349307, "event_breakdown": ""}, {"id": "a311ac21-0c80-4b69-9c3b-62176c27297f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26739/", "date": "2024-05-06 12:48", "message": "In the announcements distributed by the IDF, the residents of Rafah were warned not to approach the eastern and southern border fences (the southern fence is the border with Egypt - this message is to help alleviate the Egyptians' fears of mobs at the border -AA).", "location": "Rafah", "classification": "security", "score": 0.8833194863412972, "event_breakdown": "- IDF announces warning to residents of Rafah not to approach eastern and southern border fences"}, {"id": "f3f31143-df88-4102-8227-46cff0fb0754", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26738/", "date": "2024-05-06 12:46", "message": "This has far-reaching consequences in regards to the entry of goods into the Strip as this is the main artery that was used throughout the months of the war.", "location": "Gaza Strip", "classification": "security", "score": 0.8381938214403987, "event_breakdown": "- Israel strikes a building in Gaza City, causing significant damage\n- A major fire breaks out at a plastics factory in southern Israel\n- Israel closes a key commercial crossing into Gaza\n- Israeli military says the target in Gaza was a Hamas intelligence facility\n- Hamas accuses Israel of trying to damage civilian infrastructure\n- Confrontation between Israel and Hamas escalates in the region"}, {"id": "2ca866fc-323b-4b80-b4ae-b4cda4881098", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26737/", "date": "2024-05-06 12:45", "message": "Palestinian reports about the closure of the Rafah crossing with concrete structures by the Egyptians.", "location": "", "classification": "security", "score": 0.8983341879844648, "event_breakdown": "- Egyptians close Rafah crossing with concrete structures, as reported by Palestinians."}, {"id": "1c99f57e-fd87-4d41-8ca5-d37d3221c461", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26735/", "date": "2024-05-06 06:31", "message": "The Palestinians report that the IDF dropped leaflets over Rafah in the south of the Gaza Strip stating that the humanitarian area from the Moasi area in Khan Yunis has been expanded to the Deir al-Balah area in the center of the Gaza Strip, as shown on the attached map - where you can see the size of the previous area and its significant expansion (more than 2 times larger).", "location": "RAFAH", "classification": "security", "score": 0.9459642057667838, "event_breakdown": "1. The IDF drops leaflets over Rafah in the south of the Gaza Strip.\n2. Palestinians report the expansion of the humanitarian area from the Moasi area in Khan Yunis to the Deir al-Balah area in the center of the Gaza Strip.\n3. Leaflets include a map showing the size of the previous area and its significant expansion, which is now more than 2 times larger."}, {"id": "bc00d80a-675f-4d74-a29f-7f1567f853a3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26734/", "date": "2024-05-06 06:30", "message": "Now, after the official announcement to evacuate Rafah, it is time to remember senior Hamas official Osama Hamdan's remarks from a few days ago 👆:\n\n\"If Israel takes action in Rafah, we will stop the negotiations. We will not negotiate under fire.\"", "location": "RAFAH", "classification": "security", "score": 0.7279512055568285, "event_breakdown": "1. Official announcement to evacuate Rafah.\n2. Senior Hamas official Osama Hamdan's remarks regarding Israel's potential action in Rafah.\n3. Hamas's decision to halt negotiations if Israel takes action in Rafah."}, {"id": "fcaa5214-8dc3-4247-ad64-56a1c63e0852", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26733/", "date": "2024-05-06 05:41", "message": "Italy: Students at the University of Bologna set up a \"Gaza camp\" on campus.", "location": "Bologna, Italy", "classification": "security", "score": 0.6244282037822166, "event_breakdown": "- Students at the University of Bologna set up a \"Gaza camp\" on campus in Italy."}, {"id": "2fafee41-20d4-4c91-bf3c-db52fa8a69ee", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26731/", "date": "2024-05-06 05:41", "message": "Lebanon: Lebanese media reports that around 01:30 AM the IDF attacked a \"plastic factory\" in the A-Safri area in Baalbek, deep in Lebanese territory.\n\nAccording to Lebanese sources, three civilians were slightly injured in the attack.", "location": "A-Safri area in Baalbek", "classification": "security", "score": 0.9763097415613333, "event_breakdown": "- IDF attacks a \"plastic factory\" in the A-Safri area in Baalbek, Lebanon\n- Three civilians slightly injured in the attack"}, {"id": "fd5b8275-5a24-4525-b228-95788bcd41e3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26729/", "date": "2024-05-06 05:35", "message": "Shiite militias in Iraq claim that they attacked a target in Eilat and another target \"in the territory of Palestine\" using suicide drones.\n\nIn this context, the IDF spokesman published the following message this morning:\n\nLast night, Israeli fighter jets successfully intercepted an unmanned aircraft that made its way to Israeli territory from the east.\n\nThe drone was being monitored by IDF forces, did not pose a threat and no alerts were activated in accordance with policy. There were no casualties and no damage was caused.\n\n##\nAccording to past experience in most cases that the militias in Iraq do not specify the target of the attack in their announcement, it's a sign that the drone or missile didn't reach its target.", "location": "", "classification": "security", "score": 0.9842719209371784, "event_breakdown": "- Shiite militias claim attacking targets in Eilat and \"territory of Palestine\" with suicide drones\n- IDF intercepts an unmanned aircraft heading towards Israeli territory from the east"}, {"id": "993c3cbf-fd24-45f3-9c75-79b752d7e2f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26726/", "date": "2024-05-06 05:26", "message": "Palestinian channels report that the IDF attacked 12 targets in the Rafah district last night, including several attacks in the eastern neighborhoods of A-Salam and Jenineh, which are currently under evacuation.\n\nAccording to the Palestinians, over 20 casualties were recorded as a result of these series of attacks.\n\nThe attack on the eastern neighborhoods of Rafah and and evacuation from the area may help reduce short-range rocket fire towards assembly areas, such as the one we saw yesterday in Kerem Shalom.", "location": "Rafah", "classification": "security", "score": 0.9533609739067478, "event_breakdown": "- IDF attacked 12 targets in the Rafah district, including A-Salam and Jenineh neighborhoods\n- Evacuation of eastern neighborhoods of Rafah\n- Over 20 casualties recorded as a result of the attacks\n- Reduction of short-range rocket fire towards assembly areas, such as Kerem Shalom"}, {"id": "2653716c-7cf4-482b-ae39-0c9e218851a3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26725/", "date": "2024-05-06 05:07", "message": "The evacuation of Rafah has begun\n\nThe IDF spokesman in Arabic calls on the residents of the eastern neighborhoods of Rafah, including the neighborhoods of A-Salam and Janineh, to evacuate to the Khan Yunis area - as seen in the attached video.", "location": "Rafah", "classification": "security", "score": 0.6725013943973019, "event_breakdown": "- Evacuation of Rafah has begun: IDF spokesman in Arabic calls on residents of eastern neighborhoods of Rafah, including A-Salam and Janineh, to evacuate to Khan Yunis area."}, {"id": "b007f685-6e04-463d-9828-79b756a2872a", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26723/", "date": "2024-05-05 21:34", "message": "The IDF spokesperson announced the fall of three fighters from the Givati ​​Brigade and the Nahal Brigade in today's event at Kerem Shalom.\n\nMay their memories be a blessing.", "location": "Kerem Shalom", "classification": "security", "score": 0.7720907030744106, "event_breakdown": "- Three fighters from the Givati ​​Brigade and the Nahal Brigade fall in event at Kerem Shalom, as announced by IDF spokesperson."}, {"id": "3daf7914-071b-4940-9dc8-12ce3c5a1375", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26723/", "date": "2024-05-05 21:34", "message": "University of California, UCLA:\nPro-Hamas trash removal.", "location": "", "classification": "security", "score": 0.32550113580331097, "event_breakdown": "- Pro-Hamas trash removal event at University of California, UCLA"}, {"id": "144328d5-e3e4-4a93-8406-060c1bd589ce", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26716/", "date": "2024-05-05 19:11", "message": "Following this report here 👆\n\nIDF Spokesperson: The IDF and ISA struck a Hamas command and control center located  in an UNRWA complex in central Gaza which served as a staging ground for multiple attacks against IDF troops and humanitarian efforts\n\nFollowing precise IDF and ISA intelligence, IAF fighter jets struck a Hamas command and control center in the central Gaza Strip which served as central terrorist infrastructure. The strike was carefully planned and carried out using precise munition in order to minimize harm to uninvolved civilians. \n\nThe command and control center was used as a staging ground for multiple attacks on IDF troops located in Gaza's central corridor in recent weeks. Furthermore, the forward operations base was used to carry out attacks on humanitarian efforts, which aims to increase the distribution of humanitarian aid to Gazan civilians.\n\nIn addition, Hamas oversaw the supply of weapons to dozens of Hamas terrorists from inside the command and control center, including those located and operating inside underground terror tunnels. \n\nHamas intentionally positioned the command and control position within the vicinity of an active UNRWA location, jeopardizing the Gazan civilians taking refuge there.\n\nThe Hamas terrorist organization systematically exploits the civilian population and institutions as human shields for their terrorist activities against the State of Israel.\n\nAs a result of the strike, the Hamas’ command and control center located in the UNRWA complex is no longer operational.", "location": "central Gaza Strip", "classification": "security", "score": 0.9315464166616569, "event_breakdown": "- IDF and ISA struck a Hamas command and control center located in an UNRWA complex in central Gaza\n- IAF fighter jets struck a Hamas command and control center in central Gaza Strip\n- The command and control center was used for multiple attacks on IDF troops and humanitarian efforts\n- Hamas oversaw the supply of weapons to terrorists from inside the center\n- Hamas positioned the center near an active UNRWA location\n- The center is no longer operational due to the strike"}, {"id": "076c6436-66d6-455c-8d75-4c11235ce7da", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26715/", "date": "2024-05-05 17:36", "message": "IDF: Over the last few hours, approximately 40 launches were identified crossing from Lebanon into Israeli territory, a number of which were intercepted. No injuries were reported. In response, the IDF struck the sources of the fire. \n\nA short while ago, IAF fighter jets struck Hezbollah military structures and terrorist infrastructure in the areas of Markaba, Kfarkela, and Odaisseh in southern Lebanon. In addition, this morning (Sunday), IAF fighter jets struck a military site in the area of Meiss El Jabal in southern Lebanon.\n\nFurthermore, IDF artillery struck in order to remove a threat in the area of Chebaa in southern Lebanon.", "location": "Southern Lebanon", "classification": "security", "score": 0.9755126961797929, "event_breakdown": "- Approximately 40 launches from Lebanon into Israeli territory intercepted by IDF.\n- IDF strikes sources of fire in response to launches from Lebanon.\n- IAF fighter jets strike Hezbollah military structures and terrorist infrastructure in Markaba, Kfarkela, and Odaisseh in southern Lebanon.\n- IAF fighter jets strike a military site in Meiss El Jabal in southern Lebanon.\n- IDF artillery strikes in Chebaa area of southern Lebanon to remove a threat."}, {"id": "624b2d44-6006-4d8b-b918-79913005598d", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26712/", "date": "2024-05-05 17:36", "message": "Syrian sources report that Iyad al-Saleh, a senior Hezbollah official responsible for recruiting volunteers to fight in the Hasakah area, in northeastern Syria, was killed as a result of an explosive device planted in his vehicle.\nThe vehicle exploded on Alkachaa street in the city of Hasakah inside a security compound under the control of Assad forces.", "location": "Hasakah", "classification": "security", "score": 0.9947713961658057, "event_breakdown": "null"}, {"id": "f8d9f1f6-83b3-4b11-83f1-963b68b121d8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26711/", "date": "2024-05-05 17:32", "message": "The military wing of Hamas publishes documentation of the launch of \"Rajum\" rockets towards Kerem Shalom earlier today.", "location": "Kerem Shalom", "classification": "security", "score": 0.7112693064771131, "event_breakdown": "- Hamas military wing launches \"Rajum\" rockets towards Kerem Shalom"}, {"id": "444dc6dc-af21-4748-a72c-4aa92ac2a3c3", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26710/", "date": "2024-05-05 17:31", "message": "The Palestinians report 6 deaths in the attack on a Hamas police container at the Aljaauni elementary school in the Nuseirat refugee camp in the center of the Gaza Strip.", "location": "Aljaauni elementary school in the Nuseirat refugee camp in the center of the Gaza Strip.", "classification": "security", "score": 0.9765586093354613, "event_breakdown": ""}, {"id": "2d2b5efa-5680-4ca3-af6e-a9838496660f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26709/", "date": "2024-05-05 17:29", "message": "Hamas senior Osama Hamdan:\n\nThe operation (rocket attack this morning -AA) in Kerem Shalom is a message from Hamas's military arm to the occupation that the consequences of any adventure carried out by his army will be different from what he imagines.", "location": "Kerem Shalom", "classification": "security", "score": 0.9755908976599748, "event_breakdown": "- Rocket attack in Kerem Shalom by Hamas military arm"}, {"id": "0ebe5b09-be76-4eb0-ace4-c237c05c0874", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26708/", "date": "2024-05-05 17:28", "message": "Reuters: The head of the CIA left Qatar (Cairo) due to the fact that the talks regarding Gaza are facing collapse.\n\n##\nI wonder if he took the same flight as the Hamas delegation from Cairo to Doha...", "location": "Cairo", "classification": "security", "score": 0.8322369078311902, "event_breakdown": "- Head of the CIA leaves Qatar (Cairo) due to talks on Gaza facing collapse"}, {"id": "14c1845e-0b08-427f-af65-2c04db91ed3b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26707/", "date": "2024-05-05 17:28", "message": "Documentation of the moments of the attack on the home of the Shatiwi family near the Rafah crossing (after an evacuation alert).", "location": "", "classification": "security", "score": 0.9622204096287527, "event_breakdown": "- Attack on the home of the Shatiwi family near the Rafah crossing\n- Evacuation alert issued to the Shatiwi family"}, {"id": "664ff706-65d1-4182-8958-430ff696d595", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26706/", "date": "2024-05-05 17:25", "message": "The Palestinians report 6 deaths from among members of the Almasri and Elatar families in an attack on a house in the Yabna camp in Rafah earlier today (the house belongs to the Elatar family).", "location": "", "classification": "security", "score": 0.6391017690620457, "event_breakdown": "- 6 deaths reported in an attack on a house in Yabna camp, Rafah (Almasri and Elatar families)\n- Location: Yabna camp, Rafah"}, {"id": "5651a879-0e29-40ec-857f-9c1669b8d595", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26704/", "date": "2024-05-05 17:18", "message": "Al Jazeera from a senior Hamas source:\nThe movement delegation left Cairo for consultations after two days of talks.", "location": "Cairo", "classification": "security", "score": 0.9425929695497295, "event_breakdown": "- Hamas delegation leaves Cairo after two days of talks"}, {"id": "18e2a8ca-3daa-45ba-8bf8-db86895b4f64", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26703/", "date": "2024-05-05 17:18", "message": "Several attacks in the last few hours in Rafah, usually on agricultural lands or houses that received an evacuation notice in advance. The Palestinians report one death.\nThe home of the Shatiwi family (the attached video) near the Rafah crossing was attacked.", "location": "Rafah", "classification": "security", "score": 0.911214583607436, "event_breakdown": "- Several attacks in Rafah, targeting agricultural lands and houses with evacuation notices, resulting in one death\n- Attack on the home of the Shatiwi family near Rafah crossing"}, {"id": "fd4b6edd-9bc8-4408-8d43-af21477d987c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26702/", "date": "2024-05-05 13:48", "message": "Hezbollah in an official announcement:\n\nWe launched dozens of Katyushas at Israel's artillery batteries in the Zaoura area (in the territory of Israel-AA) in response to the attack in Meiss el-Jabal in which civilians were killed and wounded.\n\n##\nIsraeli media report 65 rockets fired from southern Lebanon towards Israel in the last volley.", "location": "Zaoura", "classification": "security", "score": 0.9900671289197039, "event_breakdown": ""}, {"id": "ed8bcaea-be83-4836-abb8-4aee6b2709c5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26700/", "date": "2024-05-05 12:59", "message": "The IDF: The Kerem Shalom crossing has been closed to truck crossing.\n\n##\nHamas bites the hand that feeds them and shoot at the place that brings them goods.\n\nThe Palestinians report air force attacks in the al-Salam neighborhood in East Rafah.", "location": "East Rafah", "classification": "security", "score": 0.9868789289955291, "event_breakdown": "- IDF closes Kerem Shalom crossing for truck crossing\n- Hamas attacks place that brings them goods\n- Palestinian report air force attacks in al-Salam neighborhood, East Rafah"}, {"id": "53d20ef6-37f7-44de-b346-37a3c8ffed8f", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26699/", "date": "2024-05-05 12:57", "message": "Channels identified by Fatah:\n\nThe firing of Hamas from Rafah towards Kerem Shalom gave Israel justification for the action in Rafah, saved them, and gave them a way out in the eyes of the whole world. How stupid is Hamas.", "location": "Rafah", "classification": "security", "score": 0.8645762385475463, "event_breakdown": "- Hamas fires towards Kerem Shalom from Rafah\n- Israel uses this as justification for their actions in Rafah"}, {"id": "3ae7b28f-41e4-4eb0-825d-b5891f794718", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26698/", "date": "2024-05-05 12:56", "message": "Israeli media reports on Israeli casualties in Kerem Shalom as a result of falling explosives.\n\nAt 13:41, the military wing of Hamas accepted responsibility for launching short-range rockets of the \"Rajum\" type with a diameter of 114 mm towards assembly areas in Kerem Shalom.\n\n##\nKerem Shalom is very close to Rafah.", "location": "", "classification": "security", "score": 0.9874250957946622, "event_breakdown": "- Israeli casualties reported in Kerem Shalom due to falling explosives\n- Military wing of Hamas claims responsibility for launching short-range rockets towards assembly areas in Kerem Shalom\n- Kerem Shalom is located close to Rafah"}, {"id": "0d999b86-f077-4fd4-b9a4-9a3c6d413076", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26694/", "date": "2024-05-05 11:08", "message": "Lebanese channels: The number of civilians killed in the IDF attack in Meiss Ej Jabal in southern Lebanon has risen to four. The four are reportedly members of the same family (father, mother and their two children).\n\nHezbollah in an official announcement:\nWe attacked Kiryat Shmona with dozens of Katyusha and Flak type rockets, in response to the killing and wounding of the civilians in  Meiss Ej Jabal.\n\nIsrael's Magen David Adom reports that a 65-year-old man was lightly injured from the rocket fire, and that an ambulance was also damaged.", "location": "", "classification": "security", "score": 0.9991968429482292, "event_breakdown": "- Four civilians killed in IDF attack in Meiss Ej Jabal, southern Lebanon, identified as members of the same family (father, mother, and two children).\n- Hezbollah claims responsibility for attacking Kiryat Shmona with dozens of Katyusha and Flak type rockets in retaliation for the civilian casualties in Meiss Ej Jabal.\n- 65-year-old man lightly injured from rocket fire in Kiryat Shmona, Israel, with damage to an ambulance reported by Magen David Adom."}, {"id": "427d67a9-65a2-4d03-86bd-adeb72b66aa5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26692/", "date": "2024-05-05 11:01", "message": "Israel Police publishes CCTV footage of an arrest of a Palestinian woman who pulled a knife on police officers in the Old City of Jerusalem.\n\nNo officers were injured in the incident, and neither was the Palestinian woman.\n\n##\nI wonder how this situation would've ended for the woman in any of the Arab or Western countries...", "location": "Jerusalem", "classification": "security", "score": 0.9735874257227601, "event_breakdown": "- Israel Police publishes CCTV footage of arrest of Palestinian woman who pulled knife on officers in Old City of Jerusalem.\n- No injuries reported for officers or Palestinian woman in the incident."}, {"id": "977bc735-f133-4f3d-a655-2776ed52c1bf", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26691/", "date": "2024-05-05 08:32", "message": "Lebanese sources update that three people were killed in the latest attack on Meiss Ej Jabal 👆, and report that another person was injured.", "location": "Meiss Ej Jabal", "classification": "security", "score": 0.9654846051668978, "event_breakdown": "- Three people killed in the latest attack on Meiss Ej Jabal in Lebanon.\n- Another person reported injured in the same attack."}, {"id": "dca58180-71f0-4cab-afd5-9999a80244f8", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26690/", "date": "2024-05-05 08:12", "message": "The IDF and Israeli Shit Bet announce that senior Islamic Jihad commander Aiman Zaarab was killed in a targeted strike,\n\nAccording to the announcement, Zaarab took part in the Oct. 7th attacks, and lead terrorist from the PIJ's elite Nukhba Force in their attack on the Kibbutz of Sufa and a neighboring military outpost.", "location": "Sufa", "classification": "security", "score": 0.9804161595100885, "event_breakdown": "- Senior Islamic Jihad commander Aiman Zaarab killed in targeted strike announced by IDF and Israeli Shit Bet.\n- Zaarab implicated in Oct. 7th attacks and led terrorists from PIJ's elite Nukhba Force in attack on Kibbutz of Sufa and neighboring military outpost."}, {"id": "a8e8f661-503b-4cdb-8613-49fc6f01b68c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26689/", "date": "2024-05-05 08:09", "message": "The Lebanese report a number of wounded in an Israeli attack in Meiss Ej Jabal in southern Lebanon, which took place about an hour ago.", "location": "Meiss Ej Jabal", "classification": "security", "score": 0.9757043804391585, "event_breakdown": "- Number of wounded reported in Israeli attack in Meiss Ej Jabal, southern Lebanon."}, {"id": "73dc8160-a28a-4f36-9176-8409a20c2088", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26688/", "date": "2024-05-05 08:07", "message": "The Palestinians report: an Apache helicopter attacked targets in Rafah in the southern Gaza Strip this morning.", "location": "Rafah, Gaza Strip", "classification": "security", "score": 0.9904248373796724, "event_breakdown": "Event 1: An Apache helicopter attacked targets in Rafah in the southern Gaza Strip."}, {"id": "f3bc4aad-8377-4f11-8e41-0d1b23ab5715", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26687/", "date": "2024-05-05 08:06", "message": "Hezbollah's answer to the French proposal\n\nSources report that tomorrow morning Nabih Berri, the Speaker of the Lebanese Parliament (and the head of the Shiite Amal movement, fighting against Israel alongside Hezbollah) is expected to deliver Hezbollah's and the Amal movement's response to the French proposal for a cease-fire with Israel.\n\nAccording to Arab sources, the answer is likely to be that Lebanon is bound by UN Resolution 1701 and that the document will be the basis for negotiations after there is a ceasefire in Gaza.\n\n###\n\nResolution 1701, which ended the Second Lebanon War, spoke of 15,000 armed UNIFIL soldiers with powers south of Litani river, tasked with preventing the introduction of weapons and the presence of Hezbollah militants in the area - which were both violated. If Resolution 1701 had been enforced, we would not have reached the situation we are in today, with a massive deployment of Hezbollah in the south to the Litani.\n\nThe current situation shows how invaluable such agreements are - they shouldn't be taken seriously as they do not hold water.\n\nI suggest that France and the US, who are so keen on ending the fighting in Lebanon with a diplomatic solution, put themselves as guarantors to any new ceasefire agreement - so that any violation of the agreement will be met with with a French or American aerial strike. \n\nI wonder if they'd be willing to agree to this.", "location": "Lebanon", "classification": "security", "score": 0.9300229810162296, "event_breakdown": "- Nabih Berri, Speaker of the Lebanese Parliament, expected to deliver Hezbollah's and Amal movement's response to French proposal for ceasefire with Israel.\n- Response likely to affirm Lebanon's commitment to UN Resolution 1701 as basis for negotiations post-ceasefire in Gaza.\n- Resolution 1701 aimed to deploy 15,000 armed UNIFIL soldiers south of Litani river to prevent weapon introduction and Hezbollah presence, not fully enforced.\n- Proposal for France and US to act as guarantors for new ceasefire agreement, with aerial strike response to any violations, raised as suggestion."}, {"id": "ff0f4370-7403-4815-8af9-95ff35fd2456", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "The Shiite militias in Iraq claim to have attacked the Israeli port of Haifa yesterday evening with a cruise missile.", "location": "Haifa", "classification": "security", "score": 0.9938263803343869, "event_breakdown": "- Shiite militias in Iraq claim to have attacked Israeli port of Haifa with cruise missile yesterday evening."}, {"id": "8d5d5732-1e37-4e92-bb49-2b36adc32550", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26686/", "date": "2024-05-05 07:58", "message": "University of Virginia, US:\n\nPolice officers armed with transparent plastic shields slowly advance in a single line towards anti-Israeli protesters armed with umbrellas, chanting \"shame, shame\".\n\n##\nLike a medieval battle...", "location": "University of Virginia, US", "classification": "security", "score": 0.9091059072642654, "event_breakdown": "- Police officers armed with transparent plastic shields advancing towards anti-Israeli protesters at the University of Virginia, US\n- Anti-Israeli protesters armed with umbrellas chanting \"shame, shame\" at the University of Virginia, US."}, {"id": "5a34e6e1-c5e6-4c83-8762-cbd1f429f270", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26683/", "date": "2024-05-05 02:31", "message": "The follower Ben Tzion Macales points out that in the past week you can see in satellite images a new road that was broken (by IDF forces) in the area of ​​the Kerem Shalom crossing (near Rafah).\n\nGetting ready for Rafah...", "location": "Rafah", "classification": "security", "score": 0.8487874688356394, "event_breakdown": "1. Satellite images reveal a new road that was broken in the area of ​​the Kerem Shalom crossing near Rafah.\n2. IDF forces were responsible for breaking the new road.\n3. The breaking of the road occurred in the past week.\n4. Ben Tzion Macales, a follower, pointed out the presence of the new road break in satellite images.\n5. There is preparation happening for an upcoming event in Rafah, although specific details are not provided."}, {"id": "7bbe7b2e-1b71-44d2-ab12-c40cb0c5f781", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26681/", "date": "2024-05-05 00:04", "message": "USA: The police of Wisconsin do not make exceptions for academic staff: Samir Elatot, professor of sociology at the University of Wisconsin was arrested after taking an (over) active part in anti-Israel demonstrations.", "location": "University of Wisconsin", "classification": "security", "score": 0.3495209627959089, "event_breakdown": "1. Samir Elatot, a professor of sociology at the University of Wisconsin, was arrested by the police in Wisconsin.\n2. The arrest took place after Samir Elatot participated in anti-Israel demonstrations.\n3. The arrest of Samir Elatot occurred due to his allegedly overactive involvement in the demonstrations."}, {"id": "59615396-bb26-4b6d-9592-4e69891f3f9e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26678/", "date": "2024-05-04 17:47", "message": "Palestinian channels report: The IDF attacked the home of the prominent journalist in the Gaza Strip, Hassan Aslih (Hamas-affiliated) in the Manara neighborhood in eastern Khan Yunis in the southern Gaza Strip.\nThere were no casualties in the attack.", "location": "Khan Yunis", "classification": "security", "score": 0.9953827602700771, "event_breakdown": "null"}, {"id": "af8f4e4b-c7ab-41d4-a715-eaf3dbbbba02", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26677/", "date": "2024-05-04 17:31", "message": "Palestinian channels: The Palestinian Authority's security mechanisms detonated, in a controlled manner, explosive devices they located in Tubas (Northeastern Samaria).", "location": "Tubas (Northeastern Samaria)", "classification": "security", "score": 0.9948419961865298, "event_breakdown": "- Palestinian Authority's security mechanisms detonate explosive devices found in Tubas, Northeastern Samaria, in a controlled manner."}, {"id": "13e03741-69ac-42e9-b528-b07e23d399c2", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26676/", "date": "2024-05-04 17:20", "message": "Hamas-identified channels: All four killed (whose names have been published) 👆 in the IDF's activity in the village of Deir al-Ghusun in the north of Tulkarm, were operatives of the military wing of Hamas.\nAlaa Sharitah was the commander of the military wing of Hamas in Tulkarm.", "location": "Deir al-Ghusun", "classification": "security", "score": 0.9934812200416727, "event_breakdown": "- IDF activity in the village of Deir al-Ghusun in the north of Tulkarm resulting in the death of four Hamas operatives\n- Alaa Sharitah identified as the commander of the military wing of Hamas in Tulkarm"}, {"id": "32292151-e318-4afb-b7c7-f1f50f27a9bb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26788/", "date": "2024-05-06 16:54", "message": "If the pressure from the operation in Rafah did the job and made Hamas flexible, perhaps more pressure could improve the terms of the deal...\nThis is how negotiations are done in the Middle East. Under fire.", "location": "Rafah", "classification": "security", "score": 0.6229125631869445, "event_breakdown": "- According to reports, there was an Israeli operation in the city of Rafah in the Gaza Strip.\n- The operation aimed to put pressure on Hamas.\n- The pressure from the operation in Rafah made Hamas more flexible in negotiations.\n- It is suggested that more pressure could potentially improve the terms of the deal in negotiations with Hamas."}, {"id": "3668f146-a696-4cac-bf2b-c50294be167c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26719/", "date": "2024-05-05 21:31", "message": "To comment, follow this link", "location": "", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "1. Explosion at the Beirut port in Lebanon\n2. Protests erupting in Beirut following the explosion\n3. International aid and assistance being offered to Lebanon\n4. Removal of government officials in Lebanon following public outrage"}, {"id": "844f4318-e8c0-490a-87eb-4dc9e3af3c71", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26693/", "date": "2024-05-05 11:04", "message": "Al-Jazeera reports that its offices in Israel have just been closed:\n\nFinally, the Israeli government decided to shut down the Al-Jazeera's offices in Israel - a propaganda channel, owned by the rulers of Qatar, masquerading as a legitimate news network.\n\nGood riddance...", "location": "Israel", "classification": "security", "score": 0.8886573442292728, "event_breakdown": ""}, {"id": "788e5ce1-9028-461c-970b-1ca79b43d2b6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26679/", "date": "2024-05-04 22:00", "message": "Al Jazeera from a Hamas official:\n\"The movement will in no way sign an agreement that does not sincerely include the cessation of the war in Gaza.\"", "location": "", "classification": "security", "score": 0.934171742227279, "event_breakdown": ""}, {"id": "90d753f3-25d7-4276-bb48-5022d2c13cb4", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26801/", "date": "2024-05-06 17:33", "message": "Viewer Warning:\n\nA video shows a number of Gazans falling from the top of a half-destroyed building as they try to release aid that was parachuted and got stuck on the building in western Gaza City.\nThe video was taken last Friday.\nAt least one person was killed in the incident. Several others were injured according to Palestinian reports.", "location": "Gaza City", "classification": "security", "score": 0.7036735642620764, "event_breakdown": "- An aid package got stuck on the top of a half-destroyed building in western Gaza City.\n- Gazans tried to release the aid package.\n- A video shows a number of Gazans falling from the top of the building.\n- At least one person was killed in the incident.\n- Several others were injured."}, {"id": "10c63c08-f8dc-408f-b51b-8ffbd84bbb32", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26800/", "date": "2024-05-06 17:30", "message": "The IDF's extensive attack this morning 👆 in al-Lwaiza area in southern Lebanon (in response to Hezbollah's drone attack) - it is possible to distinguish several shades of gray as a result of the Israeli attacks. Lebanese sources hint that strategic assets of Hezbollah were attacked there. The place is 45 km from the border with Israel.", "location": "al-Lwaiza", "classification": "security", "score": 0.9928981140624145, "event_breakdown": "1. IDF's extensive attack in the al-Lwaiza area in southern Lebanon\n2. Israeli attacks resulting in shades of gray\n3. Lebanese sources hinting at strategic assets of Hezbollah being attacked\n4. Location: 45 km from the border with Israel"}, {"id": "788e63a8-fb86-4959-92f2-0ac345585da9", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26794/", "date": "2024-05-06 17:27", "message": "Palestinian channels: Emad Al-Aufi, a Palestinian police officer, was killed by Israeli sniper fire during an IDF operation in the Tulkarm refugee camp today.", "location": "Tulkarm refugee camp", "classification": "security", "score": 0.980424572032486, "event_breakdown": "1. Emad Al-Aufi, a Palestinian police officer, was killed by Israeli sniper fire in the Tulkarm refugee camp during an IDF operation."}, {"id": "5676b035-0633-4cbd-8071-70a142502966", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26789/", "date": "2024-05-06 17:05", "message": "Against the backdrop of the announcement by Hamas of its agreement to a ceasefire, Gaza residents took to the streets to celebrate.", "location": "Gaza", "classification": "security", "score": 0.9356099001595864, "event_breakdown": "1. Announcement of ceasefire by Hamas.\n2. Gaza residents taking to the streets to celebrate.\n\nNote: These two events are related, as the announcement of the ceasefire prompted the celebration of Gaza residents."}, {"id": "fa8b75a7-00d8-437e-8ca0-3ac210e307a5", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26759/", "date": "2024-05-06 13:18", "message": "Lebanese channels are publishing documentation of some of the 15 attacks carried out by the IDF in the last hour 👆 in al-Lwaiza area in southern Lebanon.", "location": "", "classification": "security", "score": 0.977651478859723, "event_breakdown": "- Lebanese channels publish documentation of IDF attacks in al-Lwaiza area, southern Lebanon"}, {"id": "71c75101-7a6d-4109-9a57-fadb47cb566e", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26747/", "date": "2024-05-06 13:00", "message": "The Palestinian cellular company Jawwal announced \"service malfunctions\", without specifying a specific region earlier today.", "location": "", "classification": "security", "score": 0.25638828754240167, "event_breakdown": "1. Jawwal, a Palestinian cellular company, announces \"service malfunctions\" without specifying a specific region.\n"}, {"id": "5729b64c-53cf-436a-a0e0-557b64bd9fa6", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26736/", "date": "2024-05-06 06:32", "message": "Pay attention - according to Palestinian channels, the Rafah crossing is included in the area subject to evacuation...", "location": "Rafah", "classification": "security", "score": 0.8717910735605542, "event_breakdown": "- Evacuation of the Israeli settlement of Gush Katif in the Gaza Strip\n- Evacuation of the Israeli settlement of Neve Dekalim in the Gaza Strip\n- Closure of the Rafah crossing between Gaza and Egypt"}, {"id": "f00883c8-38f6-4f25-8360-ecb3b9a48819", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26697/", "date": "2024-05-05 12:19", "message": "Hamas in an official announcement:\n\n\"We strongly condemn the decision of the criminal Netanyahu and his Nazi government to close the offices of the Al-Jazeera network.\"", "location": "", "classification": "security", "score": 0.7607563168384598, "event_breakdown": "- Hamas condemns the decision of Israeli Prime Minister Netanyahu and his government to close Al-Jazeera offices."}, {"id": "dd36f06a-60f1-4665-9554-ef7b383b3e47", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26696/", "date": "2024-05-05 11:30", "message": "Ismail Haniyeh, Chairman of the Political Bureau of Hamas:\n\nWe conducted negotiations in a positive and flexible spirit. The movement's priority is to stop the aggression. This is essential and logical.\nWhat does the agreement mean if a ceasefire is not its first stage?", "location": "", "classification": "security", "score": 0.2923656283049672, "event_breakdown": ""}, {"id": "fb78a605-58b7-41b0-9c13-b215079b3965", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26814", "date": "2024-05-06 19:40", "message": "Airstrikes in Janineh, eastern Rafah.", "location": "Janineh", "classification": "security", "score": 0.8281741041868073, "event_breakdown": "- Airstrikes in Janineh, eastern Rafah"}, {"id": "35bd1433-2322-4b9a-8f51-43052823c783", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26813/", "date": "2024-05-06 19:22", "message": "The Israeli Prime Minister's Office:\n\nThe war cabinet has unanimously decided that Israel should continue with a military operation in Rafah to exert pressure on Hamas militarily, with the aim of advancing the release of our hostages and achieving our objectives.\n\nDespite Hamas's offer being far from meeting Israel's crucial demands, Israel will send work crews to the mediators to maximize the possibility of reaching an agreement acceptable to Israel.", "location": "Rafah", "classification": "security", "score": 0.908859392841682, "event_breakdown": "- Israel continues military operation in Rafah\n- Israel sends work crews to mediators to maximize possibility of reaching an agreement"}, {"id": "ef9ed2e8-3a36-4aad-8497-13be5898d39b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26812/", "date": "2024-05-06 19:17", "message": "The IDF: IDF forces are now attacking and operating against targets of the terrorist organization Hamas in eastern Rafah.\n\nMore details to follow.", "location": "Rafah", "classification": "security", "score": 0.9709683398024609, "event_breakdown": "1. IDF forces are currently conducting attacks and operations against targets of the terrorist organization Hamas in eastern Rafah.\n2. Specific details about the ongoing military actions will be provided later."}, {"id": "4885ff9f-c6cd-4474-b0b9-20f6a7b92e9c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26811/", "date": "2024-05-06 19:15", "message": "The Palestinians report that Israeli airplanes are conducting \"fire belt\" type air strikes in the in the eastern neighborhoods of Rafah.", "location": "Rafah", "classification": "security", "score": 0.9569364180620141, "event_breakdown": "- Israeli airplanes conducting \"fire belt\" type air strikes in the eastern neighborhoods of Rafah"}, {"id": "c142e6fb-fc91-4943-a584-11cc63167a8b", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26810/", "date": "2024-05-06 19:11", "message": "Gaza channels:\n\nA surprise ground attack now in East Rafah.\n\n(Israeli - AA) tank movement under heavy artillery cover.", "location": "East Rafah", "classification": "security", "score": 0.932993333127104, "event_breakdown": "1. Surprise ground attack in East Rafah, Gaza.\n2. Tank movement by Israeli forces under heavy artillery cover."}, {"id": "d3d3dcbe-373c-43f6-be82-d50044d998eb", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26807/", "date": "2024-05-06 18:33", "message": "Against the background of Hamas's agreement - chants in praise of Muhammad Deif, the head of Hamas's military wing, in the square of the Shuhada al-Aqsa hospital in Deir al-Balah.", "location": "Deir al-Balah", "classification": "security", "score": 0.9536802995119938, "event_breakdown": "- Chants in praise of Muhammad Deif, the head of Hamas's military wing\n- Location: Square of the Shuhada al-Aqsa hospital in Deir al-Balah"}, {"id": "6410157e-be5a-478a-ac4a-79b019366f9c", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26806/", "date": "2024-05-06 18:32", "message": "An important question to ask tonight:\nWhat does the ceasefire agreement say about the continued presence of Hamas in the Gaza Strip and its continued rule?\n\nWill senior Hamas officials finish their journey in the Strip and be deported or will they stay in the Strip and renew their control over the Strip?\n\nThis is a question that Israel should ask itself and also present this question to the Americans.\n\nIf the war ends before the second phase of the deal and before the release of all the abductees, what will happen to senior Hamas officials who are in the Strip?\n\nThis should appear in the agreement.", "location": "Gaza Strip", "classification": "security", "score": 0.8697658509370266, "event_breakdown": "Ceasefire agreement negotiations between Israel and Hamas\nPresence and continued rule of Hamas in the Gaza Strip\nPotential deportation or continued control of senior Hamas officials in the Strip\nPotential impact on senior Hamas officials if the war ends before the release of all abductees"}, {"id": "f68d7cff-43f6-4ce2-8ee7-a6f0a5230fed", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26803/", "date": "2024-05-06 18:04", "message": "Hamas knows that its public announcement will direct all the international pressure from it towards the Israeli government. \n\nHamas knows that the announcement will create pressure on the Israeli government at home, just as the recent videos of the abductees did.\n\nThrough the announcement, Hamas hopes to neutralize the wheels of action in Rafah that have begun to move and stall the Israeli momentum.", "location": "Rafah", "classification": "security", "score": 0.937812983140713, "event_breakdown": "1. Hamas makes a public announcement.\n2. The announcement directs international pressure towards the Israeli government.\n3. The announcement creates pressure on the Israeli government at home.\n4. Recent videos of abductees also create pressure on the Israeli government.\n5. Hamas hopes the announcement will neutralize the wheels of action in Rafah.\n6. The wheels of action in Rafah have started to move.\n7. The wheels of action in Rafah stall the Israeli momentum."}, {"id": "19419a93-2290-46a0-9dfb-9ff1fa620cca", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26793/", "date": "2024-05-06 17:24", "message": "The Gazans are ecstatic.", "location": "Gaza City, Gaza Strip", "classification": "security", "score": 0.7546257161641778, "event_breakdown": "- Celebrations in Gaza City\n- People gathering in the streets\n- Cheering and waving flags\n- Honking of car horns\n- Fireworks lighting up the sky"}, {"id": "c6d0a79b-b3a1-4d5d-bb6f-397730a634f1", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26787/", "date": "2024-05-06 16:54", "message": "Hamas is shifting the public and international pressure in Israel's direction.\nNow we have to wait to understand what exactly Hamas agreed to and what guarantees they received.", "location": "Israel", "classification": "security", "score": 0.8520506006363026, "event_breakdown": "- Hamas shifting public and international pressure towards Israel"}, {"id": "f0cb5a4b-fa15-4c4d-99d9-b0c69505d797", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26786/", "date": "2024-05-06 16:53", "message": "The Hamas movement in an official announcement:\nIsmail Haniyeh, chairman of the political bureau of Hamas, called the Prime Minister of Qatar and the Egyptian Minister of Intelligence and informed them that Hamas accepts their proposal for a ceasefire.", "location": "", "classification": "security", "score": 0.8661965276179877, "event_breakdown": "1. Ismail Haniyeh, chairman of the political bureau of Hamas, makes an official announcement.\n2. Haniyeh calls the Prime Minister of Qatar and the Egyptian Minister of Intelligence.\n3. Hamas accepts the proposal for a ceasefire by Qatar and Egypt."}, {"id": "0ed36b4b-6b3a-4c0f-af66-9f81512a8684", "channel_id": 1560386984, "url": "https://abualiexpress.com/en/en26718/", "date": "2024-05-05 21:31", "message": "Senior Hamas official, Musa Abu Marzouk:\n\n\"The leaders of the occupation have already admitted defeat to Hamas and only Netanyahu is still insisting.\n\nThe positions of the American government are related to the interests of elections and therefore the government makes contradictory statements.\n\nOur demands are to stop the war, withdraw the occupation, restore the Gaza Strip, lift the blockade and deal with prisoners.\n\nThe opposition insists that there be a permanent ceasefire.\n\nAs far as we are concerned, the American guarantees cannot be trusted. We aim to add Russia, Turkey and China as guarantors.\"", "location": "Gaza Strip", "classification": "security", "score": 0.6101216916600589, "event_breakdown": ""}]