{"d1e4300a-90fe-4a72-ab35-30c2131c8fd2": {"messages": [{"id": "d1e4300a-90fe-4a72-ab35-30c2131c8fd2", "message": "advertisementIsrael has vowed retaliation against Hezbollah in Lebanon, and Israeli jets hit targets in southern Lebanon during the day on Sunday.\nThe White House on Sunday also blamed Hezbollah for the Majdal Shams strike.\n\"A heavy tragedy, a dark day has come to Majdal Shams,\" said Dolan Abu Saleh, head of the Majdal Shams local council, in comments broadcast on Israeli television.\nISRAEL SAYS ROCKET IRANIAN-MADEHowever, Israel said the rocket was an Iranian-made missile fired from an area north of the village of Chebaa in southern Lebanon, placing the blame squarely on Iranian-backed Hezbollah.\nWhile some serve in the Israeli military and identify with Israel, many feel marginalised in Israel and some also reject Israeli citizenship.", "url": "https://www.indiatoday.in/world/story/israel-cabinet-authorises-government-to-respond-to-hezbollah-rocket-strike-2573057-2024-07-29", "date": "2024-07-29 00:00", "source": "GDELT"}, {"id": "0a66efc0-f427-437e-b5c8-84826891573c", "message": "Israel has vowed retaliation against Hezbollah in Lebanon, and Israeli jets hit targets in southern Lebanon during the day on Sunday.\nMembers of the Druze faith make up more than half the 40,000-strong population of the Golan Heights.\n“A heavy tragedy, a dark day has come to Majdal Shams,” said Dolan Abu Saleh, head of the Majdal Shams local council, in comments broadcast on Israeli television.\nIsraeli strikes have killed some 350 Hezbollah fighters in Lebanon and more than 100 civilians, including medics, children and journalists.\nWhile some serve in the Israeli military and identify with Israel, many feel marginalized in Israel and some also reject Israeli citizenship.", "url": "https://yalibnan.com/2024/07/29/israeli-cabinet-authorizes-gov-to-respond-to-hezbollah-rocket-strike/", "date": "2024-07-29 04:30", "source": "GDELT"}, {"id": "31f20404-6585-4d8e-82f1-e3bf0f6298fc", "message": "Israel has vowed retaliation against Hezbollah in Lebanon, and Israeli jets hit targets in southern Lebanon during the day on Sunday.\nMembers of the Druze faith, which is related to Islam, Christianity and Judaism, make up more than half the 40,000-strong population of the Golan Heights.\n“A heavy tragedy, a dark day has come to Majdal Shams,” said Dolan Abu Saleh, head of the Majdal Shams local council, in comments broadcast on Israeli television.\nDruze communities live on both sides of the line between southern Lebanon and northern Israel as well as in the Golan Heights and Syria.\nWhile some serve in the Israeli military and identify with Israel, many feel marginalized in Israel and some also reject Israeli citizenship.", "url": "https://www.stabroeknews.com/2024/07/29/news/world/israel-cabinet-authorizes-government-to-respond-to-hezbollah-rocket-strike/", "date": "2024-07-29 11:30", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.8808486622277008, "count": 2, "average_score": 0.4404243311138504, "final_score": 0.5182970317796952}, "3fb8e89a-04ff-4fb8-ac3b-303aa4280ddd": {"messages": [{"id": "3fb8e89a-04ff-4fb8-ac3b-303aa4280ddd", "message": "Israel vows retaliation after rocket kills 12 youths in GolanMourners carry the coffin of person killed in a rocket strike from Lebanon a day earlier, in the Druze town of Majdal Shams in the Israel-annexed Golan Heights, on July 28, 2024.\nMAJDAL SHAMS, Undefined — Israel vowed on Sunday to \"hit the enemy hard\" after rocket fire from Lebanon killed 12 young people in the Israeli-annexed Golan Heights and fanned fears that the war in Gaza will spread.\nIsrael blamed Lebanon's Hezbollah movement for firing a Falaq-1 Iranian rocket but the Iran-backed group -- which has regularly targeted Israeli military positions -- said it had \"no connection\" to the incident.\nIt said, however, that it had fired one such rocket on Saturday towards an Israeli military target in the Golan.\nMany residents of the Druze town have not accepted Israeli nationality since Israel seized the Golan Heights from Syria in 1967.", "url": "https://www.philstar.com/world/2024/07/29/2373871/israel-vows-retaliation-after-rocket-kills-12-youths-golan", "date": "2024-07-29 04:15", "source": "GDELT"}, {"id": "d9acdd01-945c-4f64-a78d-fdb6386cb5ce", "message": "Israel vows retaliation as fears grow of wider war in Middle EastJERUSALEMIsrael vowed on Sunday to \"hit the enemy hard\" after rocket fire from Lebanon killed 12 young people in the Israeli-annexed Golan Heights and fanned fears that the war in Gaza will spread.\nIran warned Israel that any new military \"adventures\" in Lebanon could lead to \"unforeseen consequences\".\nIt said, however, that it had fired one such rocket on Saturday towards an Israeli military target in the Golan.\nDefense Minister Yoav Gallant earlier Sunday visited the scene of the attack and vowed Israel would \"hit the enemy hard\".\nIsrael's military said later Sunday it had hit Hezbollah targets \"both deep inside Lebanese territory and in southern Lebanon\".", "url": "https://www.hurriyetdailynews.com/israel-vows-retaliation-as-fears-grow-of-wider-war-in-middle-east-198959", "date": "2024-07-29 05:15", "source": "GDELT"}], "location": "MAJDAL SHAMS", "total_score": 0.6212236409579821, "count": 1, "average_score": 0.6212236409579821, "final_score": 0.6148565486705875}, "927b3551-7e41-4288-97e7-047982770ef3": {"messages": [{"id": "927b3551-7e41-4288-97e7-047982770ef3", "message": "TOKYO, July 29 (Reuters) - Oil prices rose on Monday, paring last week's loss, on fears of a widening conflict in the Middle East following a rocket strike in the Israeli-occupied Golan Heights, which Israel and the United States blamed on Lebanese armed group Hezbollah.\nBrent crude futures gained 20 cents, or 0.3%, to $81.33 a barrel at 0010 GMT.\nU.S. West Texas Intermediate (WTI) crude futures climbed 9 cents, or 0.1%, to $77.25 a barrel.\nLast week, Brent lost 1.8% while WTI fell 3.7% on sagging Chinese demand and hopes of a Gaza ceasefire agreement.\nThat conflict has spread to several fronts and risks spilling into a wider regional conflict.", "url": "https://www.marketscreener.com/quote/stock/BAKER-HUGHES-COMPANY-40311111/news/Oil-prices-rise-on-fears-of-wider-Middle-East-conflict-after-rocket-strike-in-Golan-Heights-47489189/", "date": "2024-07-29 00:45", "source": "GDELT"}, {"id": "e2b7bfbb-9d33-4d43-adfd-e52cb0825034", "message": "Oil gains on fears of wider Middle East conflict after rocket strike in Golan HeightsBusiness Business Oil gains on fears of wider Middle East conflict after rocket strike in Golan HeightsBrent crude futures gained 33 cents to $81.46 a barrel and WTI climbed 23 cents to $77.39 per barrelFollow on Published On: Mon, 29 Jul 2024 11:07:04 PKT(Reuters) – Oil prices rose on Monday, paring last week's loss, on fears of a widening conflict in the Middle East following a rocket strike in the Israeli-occupied Golan Heights, which Israel and the United States blamed on Lebanese armed group Hezbollah.\nOn Sunday, Israel's security cabinet authorised Prime Minister Benjamin Netanyahu's government to decide on the \"manner and timing\" of a response to the Saturday's rocket strike in the Golan Heights that killed 12 teenagers and children.\nThat conflict has spread to several fronts and risks spilling into a wider regional conflict.\n\"Worries over escalating tensions in the Middle East prompted fresh buying, but gains were limited by lingering concerns of weakening demand in China,\" said Toshitaka Tazawa, an analyst at Fujitomi Securities.\n\"Demand concerns remain a key factor that presses on crude oil prices.", "url": "https://dunyanews.tv/en/Business/827181-oil-gains-on-fears-of-wider-middle-east-conflict-after-rocket-strike-i", "date": "2024-07-29 07:45", "source": "GDELT"}, {"id": "5a634ab6-25c9-404a-b85e-a3b88376ebaa", "message": "Home BusinessOil gains on fears of wider Middle East conflictAmmon News - Oil prices rose on Monday, paring last week's loss, on fears of a widening conflict in the Middle East following a rocket strike in the Israeli-occupied Golan Heights, which Israel and the United States blamed on Lebanese armed group Hezbollah.\nLast week, Brent lost 1.8% while WTI fell 3.7% on sagging Chinese demand and hopes of a Gaza ceasefire agreement.\nThat conflict has spread to several fronts and risks spilling into a wider regional conflict.\n\"Worries over escalating tensions in the Middle East prompted fresh buying, but gains were limited by lingering concerns of weakening demand in China,\" said Toshitaka Tazawa, an analyst at Fujitomi Securities.\n\"Demand concerns remain a key factor that presses on crude oil prices.", "url": "https://en.ammonnews.net/article/74122", "date": "2024-07-29 08:15", "source": "GDELT"}], "location": "GOLAN HEIGHTS", "total_score": 1.1963996623622624, "count": 2, "average_score": 0.5981998311811312, "final_score": 0.6287398818267917}, "cd38e68d-2a6d-4049-a020-7949c70c3884": {"messages": [{"id": "cd38e68d-2a6d-4049-a020-7949c70c3884", "message": "Impassioned speakers at the ceremony urged the Ukrainian government to work harder to get the soldiers freed in a prisoner exchange.\nThe Olenivka explosion was one of the most painful pages in the war, according to many soldiers.\nRussia has claimed that the Olenivka explosion was caused by Ukrainian forces firing a missile that hit the prison barracks.\nMany were also pressing for the release of Ukrainian soldiers who were defending the Avovstal steel works and were captured when Mariupol fell in 2022.\nHe was treated in the army base inside the Azovstal steel works before he was taken captive by the Russian forces and then released.", "url": "https://www.bostonglobe.com/2024/07/29/world/thousands-ukraine-honor-soldiers-killed-blast-urge-government-get-prisoners-freed/", "date": "2024-07-29 07:45", "source": "GDELT"}, {"id": "0e451234-e128-4e50-bd9d-979a1b88bb2d", "message": "KYIV, Ukraine -- Ukrainians urged their government to do more to get Russia to release prisoners of war, voicing their anger on Sunday at a ceremony commemorating the second anniversary of an explosion that killed more than 50.\nThe Olenivka explosion was one of the most painful pages in the war, according to many soldiers.\nRussia has claimed that the Olenivka explosion was caused by Ukrainian forces firing a missile that hit the prison barracks.\nBut increasing evidence suggests that Russian forces set off the explosion, according to an investigation by The Associated Press.\nTwo years after the explosion, many Ukrainians still want to know exactly how it happened.", "url": "https://www.arkansasonline.com/news/2024/jul/29/ukrainians-demand-prisoners-release/", "date": "2024-07-29 11:15", "source": "GDELT"}], "location": "MARIUPOL", "total_score": 0.6116408985764311, "count": 1, "average_score": 0.6116408985764311, "final_score": 0.6081486290035018}, "bc4bfe3a-a242-4fac-8a07-53473fd2aeb5": {"messages": [{"id": "bc4bfe3a-a242-4fac-8a07-53473fd2aeb5", "message": "Residents mourn at a soccer field that was hit by a rocket, killing 12 children and teenagers, in the Israeli-occupied Golan Heights on Sunday, July 28th, 2024.\nPhotograph: Avishag Shaar-Yashuv/The New York TimesAn Israeli drone strike killed two people and wounded three more in southern Lebanon on Monday, the Lebanese civil defence said, as Lebanon braced for Israeli retaliation following a rocket strike that killed 12 teenagers and children at the weekend.\nLate on Sunday, Israel’s security cabinet authorised prime minister Binyamin Netanyahu’s government to decide on the “manner and timing” of a response to the rocket strike in the Israeli-occupied Golan Heights.\nMonday's Israeli drone strike in southern Lebanon wounded three people including an infant, an official in the Lebanese civil defence told Reuters.\nThe Israeli military said its air defences downed a drone that crossed from Lebanon into the area of Western Galilee on Monday.", "url": "https://www.irishtimes.com/world/middle-east/2024/07/29/israel-lebanon-hizbullah-hamas-war-gaza-strip-latest-news/", "date": "2024-07-29 09:30", "source": "GDELT"}, {"id": "de6ac848-7464-4857-bdf1-fed495227e3b", "message": "BEIRUT/JERUSALEM (Reuters) - An Israeli drone strike killed two people and wounded three more in southern Lebanon on Monday, the Lebanese civil defence said, as Lebanon braced for Israeli retaliation following a rocket strike that killed 12 teenagers and children at the weekend.\nLate on Sunday, Israel's security cabinet authorized Prime Minister Benjamin Netanyahu's government to decide on the \"manner and timing\" of a response to the rocket strike in the Israeli-occupied Golan Heights.\nIsrael and the United States blamed Lebanon's Hezbollah for Saturday's strike.\nMonday's Israeli drone strike in southern Lebanon wounded three people including an infant, an official in the Lebanese civil defence told Reuters.\nThe Israeli military said its air defences downed a drone which crossed from Lebanon into the area of Western Galilee on Monday.", "url": "https://www.marketscreener.com/news/latest/Lebanon-braces-for-Israeli-retaliation-strike-kills-2-in-south-Lebanon-47490592/", "date": "2024-07-29 07:45", "source": "GDELT"}, {"id": "5e063b9d-03c3-467e-82b1-aeda24f76d65", "message": "ReutersAn Israeli drone strike killed two people and wounded three more in southern Lebanon on Monday, the Lebanese civil defence said, as Lebanon braced for Israeli retaliation following a rocket strike that killed 12 teenagers and children at the weekend.\nLate on Sunday, Israel’s security cabinet authorised Prime Minister Benjamin Netanyahu’s government to decide on the “manner and timing” of a response to the rocket strike in the Israeli-occupied Golan Heights.\nMonday’s Israeli drone strike in southern Lebanon wounded three people including an infant, an official in the Lebanese civil defence told Reuters.\nThe Israeli military said its air defences downed a drone which crossed from Lebanon into the area of Western Galilee on Monday.\nFlights at Beirut’s international airport have been cancelled or delayed as airlines responded to the possibility of an Israeli response.", "url": "https://www.firstpost.com/world/day-after-security-cabinet-nod-israeli-strike-kills-2-in-south-lebanon-13798241.html", "date": "2024-07-29 11:15", "source": "GDELT"}], "location": "GOLAN HEIGHTS", "total_score": 0.6992288210190711, "count": 2, "average_score": 0.34961441050953557, "final_score": 0.45473008735667486}, "5d0221f1-a3b5-47b5-ab1a-abbf7b734905": {"messages": [{"id": "5d0221f1-a3b5-47b5-ab1a-abbf7b734905", "message": "Lebanon braces for Israeli retaliation, strike kills 2 in south Lebanonreuters_tickers3 minutesBEIRUT/JERUSALEM (Reuters) – An Israeli drone strike killed two people and wounded three more in southern Lebanon on Monday, the Lebanese civil defence said, as Lebanon braced for Israeli retaliation following a rocket strike that killed 12 teenagers and children at the weekend.\nLate on Sunday, Israel’s security cabinet authorized Prime Minister Benjamin Netanyahu’s government to decide on the “manner and timing” of a response to the rocket strike in the Israeli-occupied Golan Heights.\nIsrael and the United States blamed Lebanon’s Hezbollah for Saturday’s strike.\nMonday’s Israeli drone strike in southern Lebanon wounded three people including an infant, an official in the Lebanese civil defence told Reuters.\nThe Israeli military said its air defences downed a drone which crossed from Lebanon into the area of Western Galilee on Monday.", "url": "https://www.swissinfo.ch/eng/lebanon-braces-for-israeli-retaliation,-strike-kills-2-in-south-lebanon/85340031", "date": "2024-07-29 09:00", "source": "GDELT"}, {"id": "0e5f1a7c-53bf-4e6d-8c95-f3368bad00bd", "message": "(MENAFN- AsiaNet News) India has urged citizens in Lebanon to 'exercise caution' & avoid amid escalating Israel-Hezbollah tensions.\nOn Monday, an Israeli drone strike in southern Lebanon killed two people and three others, according to Lebanese civil defense sources.\nThis attack occurred as Lebanon prepared for possible Israeli retaliation following a rocket strike over the weekend that resulted in the deaths of 12 teenagers and children.\nLate on Sunday, Israel's security cabinet granted Prime Minister Benjamin Netanyahu's government the authority to determine the \"manner and timing\" of a response to the rocket strike in the Israeli-occupied Golan Heights.\nThe incident has heightened tensions, with international calls for both sides to exercise restraint to prevent further escalation.", "url": "https://menafn.com/1108492904/India-Urges-Citizens-In-Lebanon-To-Exercise-Caution-Avoid-Travel-Amid-Escalating-Israel-Hezbollah-Tensions", "date": "2024-07-29 10:15", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.6480530804654078, "count": 1, "average_score": 0.6480530804654078, "final_score": 0.6336371563257854}, "f7c92625-edae-4cce-910c-f9a75164540d": {"messages": [{"id": "f7c92625-edae-4cce-910c-f9a75164540d", "message": "Two other Israeli officials said Israel was preparing for the possibility of a few days of fighting following Sunday's rocket strike at a sports field in a Druze village.\n\"The estimation is that the response will not lead to an all-out war,\" said the diplomatic source.\nPrompted by the Gaza war, the hostilities between Israel and Hezbollah have been their worst since they went to war in 2006.\nDRONE STRIKEOn Monday, an Israeli drone strike killed two people and wounded three more in southern Lebanon, the Lebanese civil defence said.\nBoth Israel and Hezbollah have appeared at pains to avoid a full-scale war since they began trading blows in October.", "url": "https://www.yahoo.com/news/lebanon-braces-israeli-retaliation-strike-072410434.html", "date": "2024-07-29 07:45", "source": "GDELT"}, {"id": "84dcf95a-6296-4ee8-9687-1b0b8882b435", "message": "All four Israeli officials, who included a senior defence official and a diplomatic source, spoke to Reuters on condition of anonymity and gave no further information about Israel’s plans for retaliation.\n“The estimation is that the response will not lead to an all-out war,” said the diplomatic source.\nWashington has also blamed Hezbollah for the rocket strike.\nAn Israeli drone strike killed two Hezbollah fighters in south Lebanon on Monday, security sources said.\nBoth Israel and Hezbollah have appeared at pains to avoid a full-scale war since they began trading blows in October.", "url": "https://www.theglobeandmail.com/world/article-israeli-strike-kills-two-in-south-lebanon/", "date": "2024-07-29 12:45", "source": "GDELT"}, {"id": "0b6c958e-625d-4ab5-b53b-3231bcc31354", "message": "Israeli officials say they seek to avoid all-out war in Lebanon retaliationreuters_tickers5 minutesBy Maayan Lubell and Maya GebeilyJERUSALEM/BEIRUT (Reuters) -Israel wants to hurt Hezbollah but not drag the Middle East into all-out war, two Israeli officials said on Monday, as Lebanon braced for retaliation after a rocket strike that killed 12 children and teenagers in the Israeli-occupied Golan Heights.\nAll four Israeli officials, who included a senior defence official and a diplomatic source, spoke to Reuters on condition of anonymity and gave no further information about Israel’s plans for retaliation.\n“The estimation is that the response will not lead to an all-out war,” said the diplomatic source.\nAn Israeli drone strike killed two Hezbollah fighters in south Lebanon on Monday, security sources said.\nBoth Israel and Hezbollah have appeared at pains to avoid a full-scale war since they began trading blows in October.", "url": "https://www.swissinfo.ch/eng/israeli-officials-say-they-seek-to-avoid-all-out-war-in-lebanon-retaliation/85340031", "date": "2024-07-29 13:15", "source": "GDELT"}], "location": "BEIRUT", "total_score": 1.1793853372099115, "count": 2, "average_score": 0.5896926686049557, "final_score": 0.622784868023469}, "9c2ecf34-d417-458a-a0bf-83fb8b7038f9": {"messages": [{"id": "9c2ecf34-d417-458a-a0bf-83fb8b7038f9", "message": "Israeli strikes killed two people and injured three others in southern Lebanon early Monday, Lebanon’s state-run news agency said.\nLebanese state media said a Monday morning strike hit a motorcycle traveling close to the Lebanon-Israel border, killing two riders and injuring a child.\nAlso Monday, two were injured in a separate strike in southern Lebanon, Lebanese state media reported.\nIsraeli military officials said only that the military had struck Hezbollah operatives and infrastructure but did not give more information.\nSaturday’s strike raised fears of a broader regional war between Israel and Hezbollah, which in a rare move denied it was responsible.", "url": "https://www.winnipegfreepress.com/world/2024/07/29/israel-hamas-war-latest-israeli-strike-killed-2-people-in-southern-lebanon-lebanese-media-say", "date": "2024-07-29 09:30", "source": "GDELT"}, {"id": "461e92a7-614f-42a4-a494-f1d7ce9f4a3d", "message": "Israeli strikes have killed two people and injured three others in southern Lebanon, state media said.\nMonday’s early morning strikes seemed to be more routine action rather than Israel’s response to the deadly weekend attack.\nThe Hezbollah strike hit Majdal Shams, in the Israeli-annexed Golan Heights (AP)No more information about the dead or injured was immediately available.\nAlso on Monday, two were injured in a separate strike in southern Lebanon, Lebanese state media reported.\nIsraeli military officials said only that the military had struck Hezbollah operatives and infrastructure but did not give more information.", "url": "https://www.lbc.co.uk/world-news/f1133cc680874be6a5ea5ca175d59a92/", "date": "2024-07-29 10:45", "source": "GDELT"}], "location": "Southern Lebanon", "total_score": 0.5545353458620955, "count": 1, "average_score": 0.5545353458620955, "final_score": 0.5681747421034669}, "7a12c511-1fdf-4f6a-86c8-d8c4ca4c35e6": {"messages": [{"id": "7a12c511-1fdf-4f6a-86c8-d8c4ca4c35e6", "message": "Hezbollah began trading fire with Israel on Oct 8, a day after Hamas attacked communities in southern Israel and sparked the Gaza offensive.\nThe Gaza conflict has drawn in Iran-backed militants across the region.\nIsraeli airstrikes have pounded areas where Hezbollah operates in southern Lebanon and struck the Bekaa Valley near the Syrian border.\nAny move by Israel to expand the conflict would be met by “devastation, destruction and displacement” in Israel, Hezbollah deputy leader Sheikh Naim Qassem said in an interview with Al Jazeera in June.\nA ceasefire there could help bring about a rapid de-escalation of tensions in southern Lebanon.", "url": "https://www.dawn.com/news/1848736/why-the-israel-hezbollah-conflict-is-heating-up-again", "date": "2024-07-29 08:00", "source": "GDELT"}, {"id": "6408a58a-fa38-4bda-a61c-9ea0e7906187", "message": "Hezbollah began trading fire with Israel on Oct. 8, a day after the Palestinian militant group Hamas attacked communities in southern Israel and sparked the Gaza war.\nHezbollah, a Hamas ally, says its attacks aim to support Palestinians who are under Israeli bombardment in Gaza.\nThe Gaza war has drawn in Iran-backed militants across the region.\nIsraeli airstrikes have pounded areas where Hezbollah operates in southern Lebanon and struck the Bekaa Valley near the Syrian border.\nA ceasefire there could help bring about a rapid de-escalation of tensions in southern Lebanon.", "url": "https://www.bworldonline.com/world/2024/07/29/610783/explainer-why-the-israel-hezbollah-conflict-is-heating-up-again/", "date": "2024-07-29 06:30", "source": "GDELT"}], "location": "GAZA", "total_score": 0.48534008502125536, "count": 1, "average_score": 0.48534008502125536, "final_score": 0.5197380595148787}, "424aca4f-f3d8-4a49-99b9-dc760fd527f4": {"messages": [{"id": "424aca4f-f3d8-4a49-99b9-dc760fd527f4", "message": "Beirut airport cancels flights amid fears of Israeli attackWorld World Beirut airport cancels flights amid fears of Israeli attackLufthansa and Turkish Airlines cancelled flights as tensions escalate between Israel and HezbollahFollow on Updated On: Mon, 29 Jul 2024 14:15:29 PKT(Reuters) – Some flights at Beirut airport have been cancelled or delayed, with Lebanon's Middle East Airlines (MEA) saying disruptions to its schedule were related to insurance risks, as tensions escalate between Israel and armed political group Hezbollah.\nLufthansa and Lufthansa's Eurowings have cancelled three flights to Beirut scheduled for Monday afternoon, according to the information board at the airport and flight tracking website Flightradar24.\nTurkish Airlines also cancelled two flights overnight on Sunday and Turkey-based budget carrier SunExpress, Turkish Airlines subsidiary AJet, Greek carrier Aegean Airlines, Ethiopian Air and MEA have also cancelled flights scheduled to land in Beirut on Monday, Flightradar24 showed.\nOn Sunday, MEA said it had delayed the departure of some flights set to land in Beirut overnight.\nLufthansa has already suspended night-time flights to and from Beirut for July due to \"current developments\" in the Middle East.", "url": "https://dunyanews.tv/en/World/827142-beirut-airport-cancels-flights-amid-fears-of-israeli-attack", "date": "2024-07-29 07:45", "source": "GDELT"}, {"id": "520e00ac-6ff0-47bb-a591-55a67d59f7cb", "message": "Israel's security cabinet has authorised its military to respond to a rocket strike that killed 12 people in Israel.\nThe Australian government has issued a fresh warning against travel to Lebanon, amid fears Israel will launch a retaliatory strike on the country.\nIt's now warning Beirut airport could close, flight prices could become extortionate and people could become trapped.\nBeirut flights cancelledGermany's Lufthansa and Lufthansa's budget airline Eurowings have cancelled three flights to Beirut scheduled for Monday afternoon, according to the information board at the airport and flight tracking website Flightradar24.\nTurkish Airlines also cancelled two flights overnight on Sunday and Turkey-based budget carrier SunExpress, Turkish Airlines subsidiary AJet, Greek carrier Aegean Airlines, Ethiopian Air and MEA have also cancelled flights scheduled to land in Beirut on Monday, Flightradar24 showed.", "url": "https://www.sbs.com.au/news/article/australians-warned-beirut-airport-could-close-as-some-flights-cancelled-amid-attack-fears/k5j22t92e", "date": "2024-07-29 08:45", "source": "GDELT"}, {"id": "587f5381-54f7-4526-8fda-50cc47fd37d8", "message": "Flights at Beirut airport have been cancelled or delayed with Lebanon's Middle East Airlines (MEA) saying disruptions to its schedule were related to insurance risks, as tensions escalate between Israel and armed political group Hezbollah.\nTurkey-based budget carrier SunExpress, Turkish Airlines subsidiary AJet, Greek carrier Aegean Airlines, Ethiopian Air and MEA have also cancelled flights scheduled to land in Beirut on Monday, Flightradar24 shows.\nIt has been targeted in the country's civil war, and previous fighting with Israel, including in the last war between Hezbollah and Israel in 2006.\nEscalation on Israel-Lebanon borderOn Sunday, MEA said it had delayed the departure of some flights set to land in Beirut overnight.\nLufthansa has already suspended night-time flights to and from Beirut for July due to \"current developments\" in the Middle East.", "url": "https://www.jpost.com/breaking-news/article-812300", "date": "2024-07-29 05:30", "source": "GDELT"}, {"id": "53557301-b73b-40ff-a2ba-6179521e5e0e", "message": "Beirut airport's flight information board and flight tracking website Flightradar24 show Turkish Airlines also cancelled two flights overnight on Sunday.\nTurkey-based budget carrier SunExpress, Turkish Airlines subsidiary AJet, Greek carrier Aegean Airlines, Ethiopian Air and MEA have also cancelled flights scheduled to land in Beirut on Monday, Flightradar24 shows.\nIt has been targeted in the country's civil war, and previous fighting with Israel, including in the last war between Hezbollah and Israel in 2006.\nOn Sunday, MEA said it had delayed the departure of some flights set to land in Beirut overnight.\nLufthansa has already suspended night-time flights to and from Beirut for July due to \"current developments\" in the Middle East.", "url": "https://www.devdiscourse.com/article/business/3033382-update-1-beirut-flights-cancelled-delayed-amid-fears-of-israeli-attack", "date": "2024-07-29 06:30", "source": "GDELT"}], "location": "BEIRUT", "total_score": 1.6663331486330215, "count": 3, "average_score": 0.5554443828776738, "final_score": 0.6288110680143717}, "018085bb-ec33-4b0c-8e6e-dadd27ced45c": {"messages": [{"id": "018085bb-ec33-4b0c-8e6e-dadd27ced45c", "message": "MINNEAPOLIS (FOX 9) - Minneapolis has had nine shootings and one stabbing since Thursday, and three of those incidents were homicides.\n10 violent incidents in Minneapolis in the last few daysViolent incidents since Thursday.\nFridayOn Friday, July 26, around 1:57 a.m., officers responded to the 200 block of Oak Grove Street for a shooting.\nREAD MORE: Minneapolis stabbing at party leaves 1 man deadPolice say there has been an arrest made in relation to this incident.\nHelp for Minneapolis policeIn response to the shootings and homicides, Minneapolis Police Chief Brian O’Hara met with the U.S. Attorney’s Office, the Hennepin County Attorney’s Office, the FBI, ATF, and the Bureau of Criminal Apprehension (BCA).", "url": "https://www.yahoo.com/news/minneapolis-police-9-shootings-1-004813175.html", "date": "2024-07-29 06:15", "source": "GDELT"}, {"id": "df886b81-0c29-4500-8579-63e75c37d30f", "message": "Minneapolis has had nine shootings and one stabbing since Thursday, and three of those incidents were homicides.\nFridayOn Friday, July 26, around 1:57 a.m., officers responded to the 200 block of Oak Grove Street for a shooting.\nResponding officers found a 45-year-old man with life-threatening gunshot wounds lying on the ground near Lowry Avenue North and Penn Avenue North.\nThe final incident was a stabbing that happened inside a home on the 3400 block of Penn Avenue North around 3:15 a.m.\nHelp for Minneapolis policeIn response to the shootings and homicides, Minneapolis Police Chief Brian O’Hara met with the U.S. Attorney’s Office, the Hennepin County Attorney’s Office, the FBI, ATF, and the Bureau of Criminal Apprehension (BCA).", "url": "https://www.fox9.com/news/minneapolis-violent-incidents-thursday", "date": "2024-07-29 05:15", "source": "GDELT"}], "location": "Minneapolis", "total_score": 0.4637961490902667, "count": 1, "average_score": 0.4637961490902667, "final_score": 0.5046573043631867}, "74d66669-0455-4875-8071-bf94638442dc": {"messages": [{"id": "74d66669-0455-4875-8071-bf94638442dc", "message": "Cross-border fighting between Israel and Hezbollah has occurred almost daily since the war with Hamas in Gaza began in October.\nIsrael is weighing its response after a weekend rocket attack in the Israeli-controlled Golan Heights killed 12 children and teens.\nIsrael and Hezbollah have exchanged cross-border fire since Oct. 8, a day after the Hamas attack that sparked the war in Gaza.\nThe foes have exchanged cross-border fire since Oct. 8, a day after the Hamas attack that sparked the war in Gaza.\nSaturday's strike raised fears of a broader regional war between Israel and Hezbollah, which in a rare move denied it was responsible.", "url": "https://www.durangoherald.com/articles/israel-hamas-war-latest-israeli-strike-killed-2-people-in-southern-lebanon-lebanese-media-say/", "date": "2024-07-29 11:15", "source": "GDELT"}, {"id": "47224fa7-e03c-43c8-a7b9-9be7191ba719", "message": "Cross-border fighting between Israel and Hezbollah has occurred almost daily since the war with Hamas in Gaza began in October.\nIsrael is weighing its response after a weekend rocket attack in the Israeli-controlled Golan Heights killed 12 children and teens.\nIsraeli leaders are weighing a response to the weekend rocket attack that killed 12 young people in the Israeli-controlled Golan Heights.\nIsrael and Hezbollah have exchanged cross-border fire since Oct. 8, a day after the Hamas attack that sparked the war in Gaza.\nThe foes have exchanged cross-border fire since Oct. 8, a day after the Hamas attack that sparked the war in Gaza.", "url": "https://www.whec.com/national-world/israel-hamas-war-latest-israeli-strike-kills-2-in-southern-lebanon-lebanese-media-say/", "date": "2024-07-29 13:15", "source": "GDELT"}], "location": "The correct answer is Israel.", "total_score": 0.32627214902317125, "count": 1, "average_score": 0.32627214902317125, "final_score": 0.4083905043162198}, "1fbd20ae-510b-4404-9899-8c1563f4a953": {"messages": [{"id": "1fbd20ae-510b-4404-9899-8c1563f4a953", "message": "Israel blamed Lebanon’s Hezbollah movement for firing a Falaq-1 Iranian rocket but the Iran-backed group - which has regularly targeted Israeli military positions - said it had “no connection” to the incident.\nThe cross-border exchanges of fire have largely been limited to the border area, but Israel has repeatedly struck deep inside Lebanon, including overnight.\nHezbollah had already abandoned positions in Syria in early June after Israeli raids, according to the Britain-based Observatory, which relies on a network of sources inside Syria.\nSince Syria’s civil war erupted in 2011, Israel has carried out hundreds of strikes in the country, mainly targeting army positions and Iran-backed fighters, including from Hezbollah.\nThat strike prompted Iran to launch a first-ever direct missile and drone attack against Israel on April 13-14, sending regional tensions skyrocketing.", "url": "https://gulfnews.com/world/mena/hezbollah-evacuates-positions-ahead-of-expected-israel-raids-1.103646300", "date": "2024-07-29 11:00", "source": "GDELT"}, {"id": "e80c2d00-046e-4fd3-93f9-b5ef71c20ecd", "message": "Hezbollah has evacuated positions in south and east Lebanon after Israeli threats of reprisals for a deadly strike on the annexed Golan Heights, a source close to the group said.\nIsrael blamed Lebanon's Hezbollah movement for firing a Falaq-1 Iranian rocket but the Iran-backed group -- which has regularly targeted Israeli military positions -- said it had \"no connection\" to the incident.\nHezbollah had already abandoned positions in Syria in early June after Israeli raids, according to the Britain-based Observatory, which relies on a network of sources on the ground.\nSince Syria's civil war erupted in 2011, Israel has carried out hundreds of strikes in the country, mainly targeting army positions and Iran-backed fighters, including from Hezbollah.\nIsraeli strikes have killed at least 25 Hezbollah fighters in Syria since the Gaza war erupted, according to an AFP tally.", "url": "https://www.naharnet.com:443/stories/en/306846-hezbollah-evacuates-positions-ahead-of-expected-israel-raids", "date": "2024-07-29 10:00", "source": "GDELT"}], "location": "BEIRUT.", "total_score": 0.5029378233798123, "count": 1, "average_score": 0.5029378233798123, "final_score": 0.5320564763658686}, "0015e883-91f9-4619-b49f-d8562b0a2d8b": {"messages": [{"id": "0015e883-91f9-4619-b49f-d8562b0a2d8b", "message": "Lebanon: additional flights from and to the airport in Beirut are delayed or canceled.\n\nThe German airline Lufthansa is suspending all flights to Lebanon for the next day.", "url": "https://abualiexpress.com/en/en31273/", "date": "2024-07-29 05:38", "source": "Telegram"}, {"id": "cf4b7a87-bbef-4dcc-9b5b-5b5912738569", "message": "The German airline Lufthansa extends the suspension of flights to and from Beirut airport until August 5.\nThe Swiss airline is also suspending all its flights to and from Beirut.", "url": "https://abualiexpress.com/en/en31292/", "date": "2024-07-29 10:01", "source": "Telegram"}], "location": "Lebanon", "total_score": 0.6409844836811129, "count": 1, "average_score": 0.6409844836811129, "final_score": 0.628689138576779}, "c885e88d-1159-44eb-ad39-dccfe61e4a7d": {"messages": [{"id": "c885e88d-1159-44eb-ad39-dccfe61e4a7d", "message": "The German Foreign Ministry calls on its citizens to urgently leave the territory of Lebanon.", "url": "https://abualiexpress.com/en/en31296/", "date": "2024-07-29 10:21", "source": "Telegram"}, {"id": "d8d973d7-5419-41eb-895f-ca8f3a69d90c", "message": "The USA and Italy call on their citizens to leave the territory of Lebanon.", "url": "https://abualiexpress.com/en/en31297/", "date": "2024-07-29 11:13", "source": "Telegram"}], "location": "Lebanon", "total_score": 0.45779569892473115, "count": 1, "average_score": 0.45779569892473115, "final_score": 0.5004569892473119}}