{"dff4eb9d-6015-47cd-b833-2a7e7714213c": {"messages": [{"id": "dff4eb9d-6015-47cd-b833-2a7e7714213c", "message": "The Lebanese resistance movement Hezbollah has fired dozens of projectiles into the northern occupied territories in retaliation for an Israeli attack in southern Lebanon.\nIn a statement on Thursday, Hezbollah said its fighters targeted an Israeli barracks with \"dozens of Katyusha rockets”.\nIt said the attack was carried out in response to the assassination of one of its fighters in an Israeli strike in the village of Deir Kifa earlier in the day.\nHezbollah has been carrying out almost daily rocket attacks on Israeli positions in retaliation for the regime’s aggression against Lebanon and in response to the ongoing Israeli onslaught against Palestinians in the Gaza Strip.\nTwo Israeli wars waged against Lebanon in 2000 and 2006 were met with strong resistance from Hezbollah, resulting in the retreat of the regime in both conflicts.", "url": "https://www.presstv.ir/Detail/2024/06/20/727841/Lebanon-Hezbollah-Israel", "date": "2024-06-20 20:15", "source": "GDELT"}, {"id": "2119ea90-197e-458f-949f-e18454cb68c4", "message": "Hezbollah strikes Israeli military factory, outposts in response to attack on LebanonIran Press TVWednesday, 19 June 2024 9:56 AMThe Lebanese Hezbollah resistance forces have conducted a strike against Israeli military positions in the northern side of the 1948 occupied territories in retaliation for a deadly attack on a town in southern Lebanon.\nThe statement added that the attack hit the designated targets precisely.\nHezbollah said that the operation was conducted in reprisal for an Israeli drone strike that targeted a car in Lebanon's southern town of Borgholiya, killing a man.\nEarlier, missiles launched by Hezbollah had hit an Israeli military factory.\nTwo Israeli wars waged against Lebanon in 2000 and 2006 were met with strong resistance from Hezbollah, resulting in the retreat of the regime in both conflicts.", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240619-presstv06.htm", "date": "2024-06-20 11:45", "source": "GDELT"}], "location": ".\nSouthern Lebanon", "total_score": 0.6119800879365239, "count": 1, "average_score": 0.6119800879365239, "final_score": 0.6083860615555667}, "cd656abb-bac5-4d27-ad36-aee673c04159": {"messages": [{"id": "cd656abb-bac5-4d27-ad36-aee673c04159", "message": "A 750ft cargo ship has sunk in the Red Sea days after Yemen's Houthi rebels said they launched a blistering drone attack on the vessel, reportedly killing one mariner on board.\nIt would be the second ship sunk as part of the rebels' campaign targeting Red Sea shipping after the Rubymar, which was carrying more than 41,000 tonnes of fertiliser, went down in March around two weeks after being struck by missiles.\nIn March, the Belize-flagged Rubymar carrying fertilizer cargo sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the US Defense Intelligence Agency said that container shipping through the Red Sea has declined by 90 per cent since December because of the attacks.\nIt also claimed destroying two Houthi drone boats in the Red Sea as well over the last 24 hours.", "url": "https://www.dailymail.co.uk/news/article-13550069/Houthi-drones-750ft-cargo-ship-deadly-explosion-vessel-sank-Red-Sea.html", "date": "2024-06-20 10:15", "source": "GDELT"}, {"id": "7f84127d-a845-4f29-9d27-ac6f6a35624e", "message": "The Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nThe Cole is now part of a U.S. Navy operation led by the aircraft carrier USS Dwight D. Eisenhower in the Red Sea to try and halt the Houthi attacks, though the rebels continue their assaults.\nIn March, the Belize-flagged Rubymar carrying a load of fertilizer sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency acknowledged container shipping through Red Sea has declined by 90% since December over the attacks.", "url": "https://news.yahoo.com/news/ship-attacked-yemen-houthi-rebels-021433370.html", "date": "2024-06-20 08:00", "source": "GDELT"}, {"id": "79209f2a-e8f1-40eb-9ad3-5ecfca5856dc", "message": "A bulk carrier sank days after an attack by Yemen’s Houthi rebels believed to have killed one mariner on board, authorities said early Wednesday, the second ship sunk in the rebels’ campaign.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carried a load of fertilizer sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency acknowledged container shipping through Red Sea has declined by 90% since December over the attacks.", "url": "https://www.newdelhitimes.com/ship-attacked-by-yemens-houthi-rebels-in-fatal-assault-sinks-in-red-sea-in-their-second-sinking/", "date": "2024-06-20 04:45", "source": "GDELT"}, {"id": "1293fde0-b87b-4c69-a042-3cf7827579f4", "message": "It was the second ship sunk in the rebels' campaign targeting Red Sea shipping.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military's United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carrying fertilizer cargo sank in the Red Sea after taking on water for days following a rebel attack.\nIt also claimed destroying two Houthi drone boats in the Red Sea as well over the last 24 hours.", "url": "https://www.pressdemocrat.com/article/trending/ship-attacked-by-yemens-houthi-rebels-in-fatal-assault-sinks-in-red-sea-in/", "date": "2024-06-20 04:15", "source": "GDELT"}, {"id": "03d12592-ae3d-4665-9681-a886d667ef6d", "message": "It was the second ship sunk in the rebels' campaign targeting Red Sea shipping.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carrying fertilizer cargo sank in the Red Sea after taking on water for days following a rebel attack.\nAbout a week earlier, the Houthis said similar strikes killed two people and wounded nine others, without saying if those hurt were fighters or civilians.\nIt also claimed destroying two Houthi drone boats in the Red Sea as well over the last 24 hours.", "url": "https://www.independent.co.uk/news/red-sea-ap-houthi-israel-yemen-b2565676.html", "date": "2024-06-20 03:00", "source": "GDELT"}, {"id": "69f36d38-8f50-4446-b544-9a011bf44247", "message": "It was the second ship sunk in the rebels' campaign targeting Red Sea shipping.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nJohn Kirby, a White House national security spokesman, said on Monday that the attack killed \"a crew member who hailed from the Philippines.\"\nIn March, the Belize-flagged Rubymar carrying fertilizer cargo sank in the Red Sea after taking on water for days following a rebel attack.\nIt also claimed destroying two Houthi drone boats in the Red Sea as well over the last 24 hours.", "url": "https://www.timesfreepress.com/news/2024/jun/20/ship-attacked-by-yemens-houthi-rebels-in-fatal-assault-sinks-in-red-sea-in-their-second-sinking/", "date": "2024-06-21 01:45", "source": "GDELT"}], "location": "The main focus of the event is in the Red Sea.", "total_score": 3.02665553819383, "count": 5, "average_score": 0.605331107638766, "final_score": 0.7237317753471362}, "c2045bad-d767-4685-be7d-f4efc1462027": {"messages": [{"id": "c2045bad-d767-4685-be7d-f4efc1462027", "message": "(MENAFN- Kuwait News Agency (KUNA)) WASHINGTON, June 19 (KUNA) - The US Central Command said Wednesday that its forces have killed a senior Islamic State group in an in Syria early this week.\nIn a press statement, the CENTCOM announced that it had conducted an airstrike in Syria on June 16, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior official and facilitator.\n\"His death will disrupt ISIS's ability to resource and conduct terror attacks,\" reads the statement.\nIt vowed that it, alongside allies and partners in the region, will continue to execute operations to degrade ISIS operational capabilities and ensure its enduring defeat.\nIt affirmed that there is no indication any civilians were harmed in this strike.", "url": "https://menafn.com/1108351166/CENTCOM-US-Airstrike-In-Syria-Kills-Senior-ISIS-Militant", "date": "2024-06-20 01:15", "source": "GDELT"}, {"id": "9d4b4370-f98c-48ff-9a20-13e30ac3a5cc", "message": "DAMASCUS —A U.S. airstrike in Syria killed a Senior ISIS Official, according to a statement Wednesday from the U.S. Central Command.\nOn June 16, U.S. Central Command conducted an airstrike in Syria, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior ISIS official and facilitator.\nHis death will disrupt ISIS’s ability to resource and conduct terror attacks.\nCENTCOM, alongside allies and partners in the region, will continue to execute operations to degrade ISIS operational capabilities and ensure its enduring defeat.\nIn addition, U.S. forces destroyed a ground control station, command and control node in an area of Yemen controlled by Iranian-backed Houthi rebels and destroyed two Houthi drone boats in the Red Sea.according to a statement from U.S. Central Command.", "url": "https://greatbendpost.com/posts/7175a8cf-e73c-4cb7-85ae-7311ab60054b", "date": "2024-06-20 13:15", "source": "GDELT"}], "location": "Syria", "total_score": 0.6053710597795918, "count": 1, "average_score": 0.6053710597795918, "final_score": 0.6037597418457142}, "8bad20b5-64b6-485a-a612-9ee8affada8c": {"messages": [{"id": "8bad20b5-64b6-485a-a612-9ee8affada8c", "message": "Hezbollah head says 'fight without limitations' in case of war with Israel.\nImage Source: IANS NewsBeirut, June 20 : Hezbollah leader Hassan Nasrallah has pledged a fight \"without limitations\" if Israel starts a war with the militant group.\nIsrael has threatened over the past days to expand its war against the Shia militant group, Xinhua news agency reported.\nIn response, the Hezbollah leader said they are \"not afraid of these threats,\" claiming that Hezbollah's missiles and rockets can cause significant damage to the Israeli side.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel on October 7.", "url": "https://www.prokerala.com/news/articles/a1540781.html", "date": "2024-06-20 02:15", "source": "GDELT"}, {"id": "1caaa737-cdcb-44cd-ab1c-6d48aee63b62", "message": "Beirut, June 21 : The Lebanese-Cypriot ties are strong, said the Lebanese Ministry of Foreign Affairs and Emigrants, a day after Hezbollah Leader Sayyed Hassan Nasrallah threatened to wage a war against Cyprus.\n\"The Lebanese-Cypriot relations are based on a rich history of diplomatic cooperation; also, bilateral communication and consultation are ongoing at the highest levels between the two countries to discuss issues of common interest,\" the Ministry added on Thursday.\nThe Ministry's statement comes a day after Nasrallah threatened to wage war against Cyprus if the latter allows Israel to use its airports in the event of a war with Hezbollah, Xinhua news agency reported.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel on October 7.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "url": "https://www.prokerala.com/news/articles/a1541058.html", "date": "2024-06-20 22:00", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.6224698773751264, "count": 1, "average_score": 0.6224698773751264, "final_score": 0.6157289141625885}, "add18f72-4d41-42f2-832a-3850a61ff52b": {"messages": [{"id": "add18f72-4d41-42f2-832a-3850a61ff52b", "message": "X | ANIWashington, DC: A senior ISIS official was killed in a US airstrike in Syria on Sunday, the US Central Command said in a statement on Wednesday (local time).\nThe senior ISIS official and facilitator have been identified as Usamah Jamal Muhammad Ibrahim al-Janabi.\nThe US Central Command said that his death would disrupt ISIS's ability to conduct terror attacks.\nIn a statement shared on X, US Central Command stated, \"US Central Command Airstrike in Syria Kills Senior ISIS Official On June 16, US Central Command conducted an airstrike in Syria, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior ISIS official and facilitator.\"\nU.S. Central Command Airstrike in Syria Kills Senior ISIS OfficialOn June 16, U.S. Central Command conducted an airstrike in Syria, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior ISIS official and facilitator.", "url": "https://www.freepressjournal.in/world/us-key-isis-official-usamah-al-janabi-killed-in-airstrike-in-syria-central-command-confirms", "date": "2024-06-20 05:30", "source": "GDELT"}, {"id": "8c5d967e-d8d2-4b83-9308-61ac42f3439a", "message": "HomeNewsUS Army Says It Killed Senior ISIS Official In SyriaUS Army Says It Killed Senior ISIS Official In SyriaFrom January to March, CENTCOM and its partners killed seven ISIS operatives and detained 27 others in Syria.\nUS Army Says It Killed Senior ISIS Official In SyriaWashington: A senior ISIS official was killed in a US airstrike in Syria on Sunday, the US Central Command said in a statement on Wednesday (local time).\nThe senior ISIS official and facilitator have been identified as Usamah Jamal Muhammad Ibrahim al-Janabi.\nIn a statement shared on X, US Central Command stated, “US Central Command Airstrike in Syria Kills Senior ISIS Official On June 16, US Central Command conducted an airstrike in Syria, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior ISIS official and facilitator.”“His death will disrupt ISIS’s ability to resource and conduct terror attacks.\nFrom January to March, CENTCOM and its partners killed seven ISIS operatives and detained 27 others in Syria.", "url": "https://www.india.com/news/world/us-army-says-it-killed-senior-isis-official-usamah-jamal-muhammad-ibrahim-al-janabi-in-syria-7026750/", "date": "2024-06-20 04:00", "source": "GDELT"}], "location": ".\nSYRIA", "total_score": 0.5268662590058728, "count": 1, "average_score": 0.5268662590058728, "final_score": 0.548806381304111}, "05d7f930-a54a-4695-9051-fdf6b61221e6": {"messages": [{"id": "05d7f930-a54a-4695-9051-fdf6b61221e6", "message": "Smoke rises above Lebanon, following an Israeli strike, as seen from Israel's border with Lebanon in northern Israel, on May 5.\nHundreds killed near Lebanon border since Oct. 7Israel views Hezbollah as its most direct threat, and the two fought a 34-day war in 2006 that ended in a stalemate.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also over 80 civilians and non-combatants.\nIn northern Israel, 16 soldiers and 11 civilians have been killed by strikes launched from Lebanon.", "url": "https://www.cbc.ca/news/world/israel-hezbollah-lebanon-1.7240784", "date": "2024-06-20 14:30", "source": "GDELT"}, {"id": "70cdc537-35a5-4a96-a2c0-fd2895acff6f", "message": "Nasrallah in his speech Wednesday said Hezbollah has much more footage — an apparent threat it could reach sites deep in Israel.\nIsrael views Hezbollah as its most direct threat, and the two fought a 34-day war in 2006 that ended in a stalemate.\nHezbollah said at least four of its fighters were killed in Israeli strikes on Wednesday as Hochstein returned to Israel for a new round of meetings there.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also over 80 civilians and non-combatants.\nIn northern Israel, 16 soldiers and 11 civilians have been killed by strikes launched from Lebanon.", "url": "https://www.thehindu.com/news/international/hezbollah-chief-warns-archenemy-israel-against-wider-war-with-lebanon/article68309857.ece", "date": "2024-06-20 01:15", "source": "GDELT"}, {"id": "39b194e2-f527-490a-85a4-9c64585024ab", "message": "Lebanon's Hezbollah has new weapons and intelligence capabilities that could help it target more critical positions deeper inside Israel in case of an all-out war , the militant group's leader has warned.\nHezbollah supporters watch a speech given by Hezbollah leader Sayyed Hassan Nasrallah on a screen during a ceremony to commemorate the death of senior Hezbollah commander Taleb Sami Abdullah.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also more than 80 civilians and non-combatants.\nIn northern Israel, 16 soldiers and 11 civilians have been killed by strikes launched from Lebanon.", "url": "https://www.9news.com.au/world/israel-gaza-update-leader-of-lebanons-hezbollah-militant-group-warns-archenemy-israel-against-wider-war/cb71a28f-28c4-4129-a986-2aa98349c5b0", "date": "2024-06-20 15:45", "source": "GDELT"}, {"id": "33adf376-00e0-4d96-a08b-24882dc24dc5", "message": "The leader of Lebanon’s Hezbollah militant group warns archenemy Israel against wider warBilal Hussein / APBEIRUT — Lebanon’s Hezbollah has new weapons and intelligence capabilities that could help it target more critical positions deeper inside Israel in case of an all-out war, the militant group's leader warned on Wednesday.\nIsrael views Hezbollah as its most direct threat, and the two fought a 34-day war in 2006 that ended in a stalemate.\nHezbollah said at least four of its fighters were killed Wednesday in Israeli strikes as Hochstein returned to Israel for a new round of meetings there.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also over 80 civilians and non-combatants.", "url": "https://lasvegassun.com/news/2024/jun/19/the-leader-of-lebanons-hezbollah-militant-group-wa/", "date": "2024-06-20 08:30", "source": "GDELT"}, {"id": "a9628bf5-53bd-4094-8807-3657343ca0f5", "message": "The leader of Lebanon's Hezbollah militant group warns archenemy Israel against wider warBEIRUT (AP) — Lebanon’s Hezbollah has new weapons and intelligence capabilities that could help it target more critical positions deeper inside Israel in case of an all-out war, the militant group's leader warned on Wednesday.\nIsrael views Hezbollah as its most direct threat, and the two fought a 34-day war in 2006 that ended in a stalemate.\nHezbollah said at least four of its fighters were killed in Israeli strikes on Wednesday as Hochstein returned to Israel for a new round of meetings there.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also over 80 civilians and non-combatants.", "url": "https://isp.netscape.com/news/world/story/0001/20240619/d3296bff6264582b7e7b90fe6061b16f", "date": "2024-06-20 03:00", "source": "GDELT"}, {"id": "6d55da3b-51b4-4231-b0ac-34c1d1cf74ec", "message": "(AP) — Lebanon’s Hezbollah has new weapons and intelligence capabilities that could help it target more critical positions deeper inside Israel in case of an all-out war, the militant group’s leader warned on Wednesday.\nIsrael views Hezbollah as its most direct threat, and the two fought a 34-day war in 2006 that ended in a stalemate.\nHezbollah said at least four of its fighters were killed in Israeli strikes on Wednesday as Hochstein returned to Israel for a new round of meetings there.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also over 80 civilians and non-combatants.\nIn northern Israel, 16 soldiers and 11 civilians have been killed by strikes launched from Lebanon.", "url": "https://www.kurv.com/the-leader-of-lebanons-militant-hezbollah-group-warns-archenemy-israel-against-wider-war/", "date": "2024-06-20 00:00", "source": "GDELT"}], "location": "Lebanon", "total_score": 2.6051516487632735, "count": 5, "average_score": 0.5210303297526547, "final_score": 0.6647212308268583}, "440e0f56-f71e-40e1-a070-79ccb6640d9a": {"messages": [{"id": "440e0f56-f71e-40e1-a070-79ccb6640d9a", "message": "A senior ISIS official was killed in a US airstrike on Sunday in Syria, the US military says.\nNearly three weeks ago, an airstrike in a remote area near Dhaardaar in Somalia was assessed to have killed three ISIS militants, according to US Africa Command.\nBetween January and March 2024, CENTCOM and its partners killed seven ISIS operatives in Syria and detained 27 more.\nThe staggering sums countries spend on defending themselves View GalleryIn Iraq during the same time period, 11 operatives were killed and 36 people were detained.\n\"We continue to focus our efforts on specifically targeting those members of ISIS who are seeking to conduct external operations outside of Iraq and Syria and those ISIS members attempting to break out ISIS members in detention in an attempt to reconstitute their forces.\"", "url": "https://www.9news.com.au/world/us-claims-senior-isis-officer-killed-in-syria-airstrike/72e587c2-0342-43f0-8213-c2c2f5e9f896", "date": "2024-06-20 06:15", "source": "GDELT"}, {"id": "68bdcbc4-8363-4d14-8138-6f04a90795d2", "message": "(CNN) — A senior ISIS official was killed in a US airstrike on Sunday in Syria, the US military said Wednesday in a post on X.\n“On June 16, US Central Command conducted an airstrike in Syria, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior ISIS official and facilitator,” the post from US Central Command said.\nNearly three weeks ago, an airstrike in a remote area near Dhaardaar in Somalia was assessed to have killed three ISIS militants, according to US Africa Command.\nBetween January and March 2024, CENTCOM and its partners killed seven ISIS operatives in Syria and detained 27 more.\n“We continue to focus our efforts on specifically targeting those members of ISIS who are seeking to conduct external operations outside of Iraq and Syria and those ISIS members attempting to break out ISIS members in detention in an attempt to reconstitute their forces.”The-CNN-Wire™ & © 2024 Cable News Network, Inc., a Warner Bros.", "url": "https://ktvz.com/politics/cnn-us-politics/2024/06/19/us-military-says-it-killed-a-senior-isis-official-in-syria-airstrike/", "date": "2024-06-20 01:30", "source": "GDELT"}, {"id": "7d3dede6-f3a3-4b70-8df3-e4db4fb5b8b4", "message": "US military says it killed a senior ISIS official in Syria airstrikeDaniel Slim/AFP/Getty Images via CNN NewsourceBy Haley Britzky(CNN) — A senior ISIS official was killed in a US airstrike on Sunday in Syria, the US military said Wednesday in a post on X.\n“On June 16, US Central Command conducted an airstrike in Syria, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior ISIS official and facilitator,” the post from US Central Command said.\nNearly three weeks ago, an airstrike in a remote area near Dhaardaar in Somalia was assessed to have killed three ISIS militants, according to US Africa Command.\nBetween January and March 2024, CENTCOM and its partners killed seven ISIS operatives in Syria and detained 27 more.\n“We continue to focus our efforts on specifically targeting those members of ISIS who are seeking to conduct external operations outside of Iraq and Syria and those ISIS members attempting to break out ISIS members in detention in an attempt to reconstitute their forces.”The-CNN-Wire™ & © 2024 Cable News Network, Inc., a Warner Bros.", "url": "https://www.cbs58.com/news/us-military-says-it-killed-a-senior-isis-official-in-syria-airstrike", "date": "2024-06-20 01:15", "source": "GDELT"}, {"id": "c0f15eed-637c-49fa-8f3d-58124426d506", "message": "By Haley Britzky, CNN(CNN) — A senior ISIS official was killed in a US airstrike on Sunday in Syria, the US military said Wednesday in a post on X.\n“On June 16, US Central Command conducted an airstrike in Syria, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior ISIS official and facilitator,” the post from US Central Command said.\nNearly three weeks ago, an airstrike in a remote area near Dhaardaar in Somalia was assessed to have killed three ISIS militants, according to US Africa Command.\nBetween January and March 2024, CENTCOM and its partners killed seven ISIS operatives in Syria and detained 27 more.\n“We continue to focus our efforts on specifically targeting those members of ISIS who are seeking to conduct external operations outside of Iraq and Syria and those ISIS members attempting to break out ISIS members in detention in an attempt to reconstitute their forces.”The-CNN-Wire™ & © 2024 Cable News Network, Inc., a Warner Bros.", "url": "https://abc17news.com/politics/national-politics/cnn-us-politics/2024/06/19/us-military-says-it-killed-a-senior-isis-official-in-syria-airstrike/", "date": "2024-06-20 00:00", "source": "GDELT"}], "location": "Syria", "total_score": 1.3906805098101862, "count": 3, "average_score": 0.4635601699367287, "final_score": 0.56449211895571}, "d843ba5e-5916-4941-846d-c96a49e2f250": {"messages": [{"id": "d843ba5e-5916-4941-846d-c96a49e2f250", "message": "(Reuters-Yonhap)CAIRO -- Israeli tanks backed by warplanes and drones advanced deeper into the western part of the Gaza Strip city of Rafah on Wednesday, killing eight people, according to residents and Palestinian medics.\nThey did not identify the fatalities, and the Israeli military said it was looking into the report.\nThe Israeli military remained in control of the border between Rafah and Egypt.\nThe Israeli military said aid into Gaza had not been impeded by the damage.\nLater Wednesday, Palestinian gunmen fired rockets at the Kerem Shalom crossing in southern Gaza, the Israeli military said.", "url": "http://www.koreaherald.com/view.php?ud=20240620050648", "date": "2024-06-20 08:00", "source": "GDELT"}, {"id": "b6273a19-9ad3-45c9-8d0d-a8a93ca2dba5", "message": "They did not identify the fatalities, and the Israeli military said it was looking into the report.\nThe Israeli military remained in control of the border between Rafah and Egypt.\nAdvertisementThe Israeli military said aid into Gaza had not been impeded by the damage.\nIn another Gaza City suburb, Sheikh Radwan, an Israeli air strike on a house killed four Palestinians, including a child, medics said.\nAdvertisementLater on Wednesday, Palestinian gunmen fired rockets at the Kerem Shalom crossing in southern Gaza, the Israeli military said.", "url": "https://www.firstpost.com/world/israel-goes-deeper-into-rafah-more-people-flee-gaza-city-13784166.html", "date": "2024-06-20 03:15", "source": "GDELT"}], "location": "GAZA", "total_score": 0.5314336825964734, "count": 1, "average_score": 0.5314336825964734, "final_score": 0.5520035778175314}, "97dff228-1527-4664-8a0f-036f5fc258c0": {"messages": [{"id": "97dff228-1527-4664-8a0f-036f5fc258c0", "message": "There are fears of all out war between Israel and Lebanon.\nHezbollah on Wednesday said none of Israel would be spared in a war, after Israel said it had approved plans for a Lebanon offensive, stoking fears of the Gaza conflict spreading.\nHezbollah chief Hassan Nasrallah said \"no place\" in Israel would \"be spared our rockets\", in a televised address broadcast amid spiralling tensions across the Israel-Lebanon border.\nFears that Israel might launch a full-blown war in Lebanon have spiked, with the Israeli military on Tuesday announcing that \"operational plans for an offensive in Lebanon were approved and validated\".\nIsrael said the Hezbollah attack caused no casualties and that its own \"artillery struck the sources of fire\".", "url": "https://www.news24.com/news24/world/news/no-place-in-israel-would-be-spared-fears-grow-for-all-out-war-after-hezbollah-threatens-israel-20240620", "date": "2024-06-20 08:00", "source": "GDELT"}, {"id": "5291693e-7f35-47be-9281-3a6c8dde391a", "message": "Hezbollah on Wednesday said none of Israel would be spared in a war, after Israel said it had approved plans for a Lebanon offensive, stoking fears of the Gaza conflict spreading.\nMeanwhile, the war between Israel and Hamas raged in Gaza, with Israeli air strikes and clashes between troops and Palestinian militants.\n'Greater capabilities'Fears that Israel might launch a full-blown war in Lebanon have spiked, with the Israeli military on Tuesday announcing that \"operational plans for an offensive in Lebanon were approved and validated\".\nIsrael said the Hezbollah attack caused no casualties and that its own \"artillery struck the sources of fire\".\nHochstein said the plan would ultimately lead to \"the end of the conflict in Gaza\", which would in turn quell fighting between Israel and Hezbollah.", "url": "https://www.hurriyetdailynews.com/hezbollah-threatens-israel-after-military-says-lebanon-offensive-ready-197620", "date": "2024-06-20 06:30", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.41815425523290695, "count": 1, "average_score": 0.41815425523290695, "final_score": 0.4727079786630348}, "d15e6a7e-95b8-4012-92c7-a3ea43c4edf7": {"messages": [{"id": "d15e6a7e-95b8-4012-92c7-a3ea43c4edf7", "message": "Investigators hope it will help them trace the supply chain for the latest generation of retrofitted Russian “glide bombs” that are laying waste to eastern Ukraine.\nThe next Russian bomb streaked down like a comet seconds later, unleashing flames that left the megastore an ashen shell.\nStore manager Oleksandr Lutsenko inside the Epicenter shopping complex in Kharkiv, Ukraine.\nIn all, glide bombs have hit the city more than 50 times this year, according to Spartak Borysenko of the Kharkiv regional prosecutor’s office.\nPhotos on Russian Telegram channels linked to the military show glide bombs being launched three and four at a time.", "url": "https://www.scmp.com/news/world/europe/article/3267349/russia-obliterates-frontline-ukraine-towns-retrofitted-glide-bombs", "date": "2024-06-20 08:45", "source": "GDELT"}, {"id": "3f98fb7d-1290-4a1f-a473-2d05aca3359f", "message": "KHARKIV, Ukraine (AP) — The first shock wave shattered aisles stacked almost to the ceiling with home improvement products.\nThe next Russian bomb streaked down like a comet seconds later, unleashing flames that left the megastore an ashen shell.\nStore manager Oleksandr Lutsenko walks inside the Epicenter shopping complex in Kharkiv, Ukraine, Thursday, June 6, 2024.\nThe bombing of the Epicenter with glide bombs by the Russian military in May killed 19 people, including two children.\nPhotos on Russian Telegram channels linked to the military show glide bombs being launched three and four at a time.", "url": "https://www.winnipegfreepress.com/world/2024/06/20/russia-obliterates-front-line-ukraine-towns-by-retrofitting-bombs-and-expanding-its-air-base-network", "date": "2024-06-20 07:00", "source": "GDELT"}, {"id": "30997ec8-302e-4e9e-864c-994a776c7c4f", "message": "Russia is intensifying its use of glide bombs to lay waste to cities in eastern Ukraine.\nInvestigators hope it will help them trace the supply chain for the latest generation of retrofitted Russian “glide bombs” that are laying waste to eastern Ukraine.\nThe Soviet-era bombs are adapted on the cheap with imported electronics that allow distant Russian warplanes to launch them at Ukraine.\nIn all, glide bombs have hit the city more than 50 times this year, according to Spartak Borysenko of the Kharkiv regional prosecutor’s office.\nPhotos on Russian Telegram channels linked to the military show glide bombs being launched three and four at a time.", "url": "https://www.firstpost.com/world/russia-obliterates-front-line-ukraine-towns-by-retrofitting-bombs-expanding-air-base-network-13784291.html", "date": "2024-06-20 11:00", "source": "GDELT"}, {"id": "a05c3d16-a154-4bda-aaeb-ed15630b6bd6", "message": "Russia obliterates Ukraine’s front-line towns faster with hacked bombs and expanded air base networkKHARKIV, Ukraine (AP) — The first shock wave shattered aisles stacked almost to the ceiling with home improvement products.\nThe next Russian bomb streaked down like a comet seconds later, unleashing flames that left the megastore an ashen shell.\nInvestigators hope it will help them trace the supply chain for the latest generation of retrofitted Russian “glide bombs” that are laying waste to eastern Ukraine.\nIn all, glide bombs have hit the city more than 50 times this year, according to Spartak Borysenko of the Kharkiv regional prosecutor’s office.\nPhotos on Russian Telegram channels linked to the military show glide bombs being launched three and four at a time.", "url": "https://lasvegassun.com/news/2024/jun/20/russia-obliterates-ukraines-front-line-towns-faste/", "date": "2024-06-20 17:45", "source": "GDELT"}, {"id": "d26c1182-0b28-4f3a-b8f0-5849028b4557", "message": "KHARKIV, Ukraine — The first shock wave shattered aisles stacked almost to the ceiling with home improvement products.\nInvestigators hope it will help them trace the supply chain for the latest generation of retrofitted Russian \"glide bombs\" that are laying waste to eastern Ukraine.\nPhotos on Russian Telegram channels linked to the military show glide bombs being launched three and four at a time.\n1 of 2 — Russia Ukraine War Scorched Earth This Planet Labs satellite image shows a field in the Belgorod Oblast, Russia, in August 2023.\nPlanet Labs / AP 2 of 2 — Russia Ukraine War Scorched Earth This Planet Labs satellite image shows a newly constructed airfield in the Belgorod Oblast, Russia in June 2024.", "url": "https://www.kalw.org/npr-news/2024-06-20/russia-wages-a-scorched-earth-war-in-ukraine-with-retrofitted-bombs-and-new-airstrips", "date": "2024-06-20 17:00", "source": "GDELT"}], "location": "Kharkiv, Ukraine", "total_score": 1.9135341832716444, "count": 4, "average_score": 0.4783835458179111, "final_score": 0.6048684820725377}, "853b4c97-1c78-4651-964a-600f34084d40": {"messages": [{"id": "853b4c97-1c78-4651-964a-600f34084d40", "message": "The leader of the military junta has since appeared on state TV in an attempt to debunk the rumours.\nBurkina Faso has been battling Islamist insurgents for several years and about half the country is outside government control.\nCommenting for the first time since the attack, Capt Ibrahim Traoré said the military had launched an operation after the attack, and sent reinforcement troops.\nBut Capt Traoré denied reports of mutiny within the army.\nLocal media outlets in Burkina Faso have downplayed the RTB incident and the Mansila attack, perhaps over fears of a crackdown.", "url": "https://www.yahoo.com/news/attack-army-fuels-burkina-faso-160229748.html", "date": "2024-06-20 17:15", "source": "GDELT"}, {"id": "876da334-27fc-4fba-bd31-2b69ece7fe62", "message": "The leader of the military junta has since appeared on state TV in an attempt to debunk the rumors.\nBurkina Faso has been battling Islamist insurgents for several years and about half the country is outside government control.\nBut Capt Traoré denied reports of mutiny within the army.\nLocal media outlets in Burkina Faso have downplayed the RTB incident and the Mansila attack, perhaps over fears of a crackdown.\nCapt Traoré has largely kept a low profile since the Mansila attack.", "url": "https://saudigazette.com.sa/article/643746/World/Africa/Attack-on-army-base-fuels-Burkina-Faso-mutiny-rumors", "date": "2024-06-21 11:00", "source": "GDELT"}], "location": "Ouagadougou", "total_score": 0.35170494908832584, "count": 1, "average_score": 0.35170494908832584, "final_score": 0.42619346436182803}, "9f9e2769-a705-41c4-a504-16a353265fdd": {"messages": [{"id": "9f9e2769-a705-41c4-a504-16a353265fdd", "message": "Alsauarka led and directed sniper activity in the area of Beit Hanoun and took part in Hamas' attacks on IDF troops.\nFollowing an extensive search, Alsauarka was identified by IDF troops and eliminated in the area of Beit Hanoun.\nMeanwhile, IDF troops are continuing to operate in the area of the central Gaza Strip.\nOver the past day, a mortar shell launch post used to fire at IDF troops was struck by IDF aerial and artillery forces.\nIn addition, two terrorists who posed a threat to IDF troops in the area were targeted using an Iron Sting precision missile.", "url": "http://www.israelnationalnews.com/news/391831", "date": "2024-06-20 11:00", "source": "GDELT"}, {"id": "13653485-f34f-45d7-a787-28cbdef70c3d", "message": "Alsauarka was a key figure in the October 7th Massacre, leading sniper attacks and infiltrating Israeli communities in southern Israel.\nAccording to IDF and ISA intelligence, Alsauarka was a squad commander in the Nukhba Forces and played a significant role in Hamas’ attacks on IDF troops.\nFollowing an extensive search, IDF troops identified and eliminated him in the Beit Hanoun area.\nAdditionally, two terrorists posing a threat to IDF troops were targeted with an Iron Sting precision missile.\nIn the Rafah area, IDF troops continue to conduct precise, intelligence-based operations, eliminating several terrorists in close-quarters encounters and conducting targeted raids to locate rocket launchers.", "url": "https://www.theyeshivaworld.com/news/israel-news/2291609/watch-idf-eliminates-hamas-commander-who-led-terrorists-during-october-7th-massacre.html", "date": "2024-06-21 04:00", "source": "GDELT"}], "location": "Beit Hanoun", "total_score": 0.6639848914069877, "count": 1, "average_score": 0.6639848914069877, "final_score": 0.6447894239848914}, "8b6b150e-ba01-48b6-a39a-c4715afc90be": {"messages": [{"id": "8b6b150e-ba01-48b6-a39a-c4715afc90be", "message": "(Bloomberg) -- Ukraine said Russia targeted energy facilities overnight as President Vladimir Putin’s forces continue attacks to disrupt the country’s power system.\nDTEK, the country’s largest non-state power producer, said three workers were wounded in the barrage, which did serious damage to a thermal power plant.\nFive out of nine missiles launched by Russia overnight were downed, as were all 27 explosive-laden drones, Air Force commander Mykola Oleshchuk said.\nThe overnight drone attack against Russian facilities was organized by the Security Service of Ukraine (SBU), an official with the knowledge of the operation said.\n(Updates with information on grid damage, SBU drone attack)Most Read from Bloomberg Businessweek©2024 Bloomberg L.P.", "url": "https://www.yahoo.com/news/russia-targets-ukrainian-power-system-063006455.html", "date": "2024-06-20 08:45", "source": "GDELT"}, {"id": "18d1b47e-3774-412c-ae92-e436987c78a8", "message": "Russia destroyed and damaged Ukrainian energy facilities overnight as President Vladimir Putin’s forces continue attacks to disrupt the country’s power system.\nDTEK, the country’s largest power producer, said three workers were wounded in the barrage, which did serious damage to one of its thermal power plants.\nThis was the seventh attack against the company’s power plants over the past three months, DTEK said on Telegram.\nRussia said the Ukrainian military also launched drone attacks overnight against its territory.\nTambov governor Maksim Yegorov said that a presumed drone attack lit a fuel reservoir in the region on fire.", "url": "https://time.com/6990131/russia-attacks-ukraine-power-plants/", "date": "2024-06-20 10:45", "source": "GDELT"}], "location": "Ukraine", "total_score": 0.5714497920380273, "count": 1, "average_score": 0.5714497920380273, "final_score": 0.580014854426619}, "1fcfdcc0-d046-4b67-a905-73b228a14e23": {"messages": [{"id": "1fcfdcc0-d046-4b67-a905-73b228a14e23", "message": "GRAND ISLAND, Neb.\n(AP) — Witnesses say they heard an Ohio man demand the keys to a Jeep that was being towed behind a Missouri couple's RV before he brutally stabbed them both and killed the man at an Interstate 80 rest area.\nJames Thompson Jr., 22, was formally charged with first-degree murder and 10 other felonies Thursday morning — a day after the attack at a rest area just outside Grand Island in eastern Nebraska.\nThe 72-year-old died later at a Grand Island hospital.\nThompson fled the rest area in a Ford Focus before officers arrived, but a Nebraska State Trooper quickly spotted him exiting the highway at Wood River.", "url": "https://siouxcityjournal.com/news/state-regional/nebraska/witnesses-say-ohio-man-demanded-jeep-before-he-stabbed-couple-at-a-nebraska-interstate-rest/article_e7bb40cc-4322-545b-a40f-dea2e37909c3.html", "date": "2024-06-20 22:00", "source": "GDELT"}, {"id": "672feddf-b2e2-46cb-aeec-8296672b415b", "message": "GRAND ISLAND, Neb.\n(AP) — Witnesses say they heard an Ohio man demand the keys to a Jeep that was being towed behind a Missouri couple’s RV before he brutally stabbed them both and killed the man at an Interstate 80 rest area.\nThompson — who is from Elyria, Ohio — is represented by the Hall County public defender, who declined to comment on the case.\nThe 72-year-old died later at a Grand Island hospital.\n$70K of cocaine seized in bust on Ohio interstateThe Jeep had been detached from the RV and had blood on it.", "url": "https://www.yahoo.com/news/witnesses-elyria-man-demanded-jeep-230707491.html", "date": "2024-06-21 02:00", "source": "GDELT"}], "location": "Nebraska", "total_score": 0.5014008735485245, "count": 1, "average_score": 0.5014008735485245, "final_score": 0.5309806114839671}, "b4de5496-2d68-4a33-a509-8442902b0fb2": {"messages": [{"id": "b4de5496-2d68-4a33-a509-8442902b0fb2", "message": "Israeli tanks have moved deeper inside southern Gaza's Rafah as airplanes pounded areas in the central parts of the strip overnight, killing at least three people and wounding dozens of others.\nIn Deir al-Balah, a city packed with displaced people in the central Gaza Strip, an Israeli airstrike killed one Palestinian and wounded several others Thursday, medics said.\nRafah housed over half of Gaza's 2.3 million people until May 7 when Israeli forces began the ground offensive into the city.\n(AA Photo)On Thursday, Israeli authorities freed 33 Palestinians who had been detained during the past months by Israeli forces in different areas of the enclave.\nThe freed detainees were admitted into Al-Aqsa Hospital in Deir al-Balah in the central Gaza Strip after they complained of torture and mistreatment by Israeli jailers.", "url": "https://www.dailysabah.com/world/mid-east/israel-mounts-rafah-ground-invasion-batters-central-gaza-camps", "date": "2024-06-20 16:15", "source": "GDELT"}, {"id": "7e161ecc-033d-4fea-94ff-48ed5ceccc40", "message": "In Deir al-Balah, a city packed with displaced people in the central Gaza Strip, an Israeli air strike killed one Palestinian and wounded several others on Thursday, medics said.\nLater on Thursday, an Israeli air strike on a house in the Zeitoun neighbourhood in Gaza City killed seven Palestinians, medics said.\nAnother air strike on a house west of the city killed a journalist of the Hamas-run Al-Aqsa TV, Hamas media said.\nRafah housed over half of Gaza's 2.3 million people until 7 May when Israeli forces began the ground offensive into the city.\nThe freed detainees were admitted into Al-Aqsa Hospital in Deir Al-Balah in the central Gaza Strip after they complained of torture and mistreatment by Israeli jailers.", "url": "https://chronicle.lu/category/international-news/50334-israel-pounds-central-gaza-camps-deepens-invasion-of-rafah", "date": "2024-06-21 08:45", "source": "GDELT"}], "location": "GAZA", "total_score": 0.5334255053942146, "count": 1, "average_score": 0.5334255053942146, "final_score": 0.5533978537759502}, "fb3990f3-6d1f-47ef-8cf0-07120ee80273": {"messages": [{"id": "fb3990f3-6d1f-47ef-8cf0-07120ee80273", "message": "SEOUL, South Korea — South Korea said Thursday that it would consider sending arms to Ukraine, a major policy change that was suggested after Russia and North Korea rattled the region and beyond by signing a pact to come to each other's defense in the event of war.\nHe said that South Korea ''shouldn't worry'' about the agreement, if Seoul isn't planning any aggression against Pyongyang.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow's military intervention if the North came under attack.\nNow with any ambiguity of Russia's partnership with North Korea removed, how will Seoul respond?''\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on South Korea with balloons, and Seoul broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.startribune.com/north-korea-says-deal-between-putin-and-kim-requires-immediate-military-assistance-in-event-of-war/600374727/", "date": "2024-06-20 03:15", "source": "GDELT"}, {"id": "2993cdd8-8544-41e9-bd9f-2033afacc4c2", "message": "North Korea's people attend the official welcome ceremony with Russian President Vladimir Putin and North Korea's leader Kim Jong Un in the Kim Il Sung Square in Pyongyang, North Korea, on Wednesday, June 19, 2024.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\nThe deal was made as Putin visited North Korea for the first time in nearly a quarter-century, a trip that showcased their personal and geopolitical ties.\nNow with any ambiguity of Russia’s partnership with North Korea removed, how will Seoul respond?” she said.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on South Korea with balloons, and Seoul broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.local10.com/news/world/2024/06/20/north-korea-says-deal-between-putin-and-kim-requires-immediate-military-assistance-in-event-of-war/", "date": "2024-06-20 02:45", "source": "GDELT"}, {"id": "298fdfc3-8cae-47a9-868e-18fcfec94eb8", "message": "Mr Putin called it a “breakthrough document” reflecting shared desires to move relations to a higher level.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe deal was made as Mr Putin visited North Korea for the first time in 24 years.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping rubbish on the South via balloons and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.belfasttelegraph.co.uk/news/world-news/north-korea-says-deal-with-russia-means-immediate-military-aid-in-event-of-war/a914865603.html", "date": "2024-06-20 05:30", "source": "GDELT"}, {"id": "f0206ed1-62de-452d-9e5d-22ddb6261475", "message": "SEOUL, South Korea — South Korea’s presidential office on Thursday condemned an agreement reached by Russia and North Korea that vowed mutual defense assistance in the event of war and said it will reconsider its policy of limiting its support to Ukraine to non-lethal supplies.\nSouth Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.military.com/daily-news/2024/06/20/south-korea-blasts-russia-north-korea-deal-says-it-will-consider-possible-arms-supplies-ukraine.html", "date": "2024-06-20 12:45", "source": "GDELT"}, {"id": "796e5f8c-b6b7-46de-a224-efb1c3a88c19", "message": "South Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nBut it has not directly provided arms to Ukraine, citing a long-standing policy of not supplying weapons to countries actively engaged in conflict.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.voanews.com/a/south-korea-blasts-russia-north-korea-deal-says-it-will-consider-possible-arms-supplies-to-ukraine-/7663155.html", "date": "2024-06-20 12:45", "source": "GDELT"}, {"id": "2ee5d472-cb69-4d3c-9903-c0c2c2d0bb1a", "message": "South Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nBut it has not directly provided arms to Ukraine, citing a long-standing policy of not supplying weapons to countries actively engaged in conflict.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow's military intervention if the North came under attack.\nNow with any ambiguity of Russia's partnership with North Korea removed, how will Seoul respond?\"\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.naharnet.com/stories/en/306023-seoul-blasts-russia-n-korea-deal-says-will-consider-supplying-arms-to-kyiv", "date": "2024-06-20 16:00", "source": "GDELT"}, {"id": "853671af-ede3-4d64-9ab7-311ad04667e2", "message": "North Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\nThe deal was made as Putin visited North Korea for the first time in nearly a quarter-century, a trip that showcased their personal and geopolitical ties.\nHow the pact affects Russia’s relations with South Korea is a key development to watch, said Jenny Town, a senior fellow at the Stimson Center in Washington and director of the North Korea-focused 38 North website.\nNow with any ambiguity of Russia’s partnership with North Korea removed, how will Seoul respond?” she said.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on South Korea with balloons, and Seoul broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://time.com/6990464/south-korea-arms-ukraine-north-russia-pact/", "date": "2024-06-21 03:15", "source": "GDELT"}, {"id": "507a0014-48cf-4d77-8672-527c73dfbfc4", "message": "But it hasn’t directly provided arms to Kyiv, citing a longstanding policy of not supplying weapons to countries actively engaged in conflict.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\nThe deal was made as Putin visited North Korea for the first time in nearly a quarter-century, a trip that showcased their personal and geopolitical ties.\nNow with any ambiguity of Russia’s partnership with North Korea removed, how will Seoul respond?” she said.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on South Korea with balloons, and Seoul broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.asahi.com/ajw/articles/15314546", "date": "2024-06-21 06:15", "source": "GDELT"}], "location": "SEOUL, South Korea.", "total_score": 3.59483998155886, "count": 7, "average_score": 0.5135485687941228, "final_score": 0.7194839981558859}, "fb3e6582-8226-4f32-9a73-5c7aadbc5314": {"messages": [{"id": "fb3e6582-8226-4f32-9a73-5c7aadbc5314", "message": "They're strategising on what to do about Hezbollah and Iran.”A peace agreement between Israel and Hezbollah looks increasingly unlikely.\nSupplied largely by Tehran via Syria or Iraq, Hezbollah’s weapons capabilities are considerable.\nAmid escalating tensions with Hezbollah, Israel has kept up constant airstrikes on Gaza, largely in the Jabalia region (pictured).\nTunnels on the Lebanese-Israeli border are a primary conduit of Hezbollah warfare, which Israel targeted with ‘Operation North Shield’ in 2019.\nAll eyes now turn to the intensity of Hezbollah’s aerial assaults into Israel – and any potential escalation into Cyprus.", "url": "https://www.army-technology.com/features/hezbollah-threatens-cyprus-as-conflict-with-israel-escalates/", "date": "2024-06-20 16:00", "source": "GDELT"}, {"id": "153bf457-bf10-464c-bc47-f680afe56de8", "message": "Hezbollah, one of the most heavily armed non-state groups in the world, responded to Abdallah’s death last week by launching its biggest salvo of rockets into Israel yet.\nThey're strategising on what to do about Hezbollah and Iran.”A peace agreement between Israel and Hezbollah looks increasingly unlikely.\nAmid escalating tensions with Hezbollah, Israel has kept up constant airstrikes on Gaza, largely in the Jabalia region (pictured).\nTunnels on the Lebanese-Israeli border are a primary conduit of Hezbollah warfare, which Israel targeted with ‘Operation North Shield’ in 2019.\nAll eyes now turn to the intensity of Hezbollah’s aerial assaults into Israel – and any potential escalation into Cyprus.", "url": "https://www.naval-technology.com/features/hezbollah-threatens-cyprus-as-conflict-with-israel-escalates/", "date": "2024-06-21 13:45", "source": "GDELT"}], "location": "GAZA", "total_score": 0.3265075916730328, "count": 1, "average_score": 0.3265075916730328, "final_score": 0.4085553141711229}, "4aefb955-a583-4b63-b913-bc0a8ce5a4b0": {"messages": [{"id": "4aefb955-a583-4b63-b913-bc0a8ce5a4b0", "message": "North Korea's people attend the official welcome ceremony with Russian President Vladimir Putin and North Korea's leader Kim Jong Un in the Kim Il Sung Square in Pyongyang, North Korea, on Wednesday, June 19, 2024.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\nThe deal was made as Putin visited North Korea for the first time in nearly a quarter-century, a trip that showcased their personal and geopolitical ties.\nNow with any ambiguity of Russia’s partnership with North Korea removed, how will Seoul respond?” she said.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on South Korea with balloons, and Seoul broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.clickondetroit.com/news/world/2024/06/20/north-korea-says-deal-between-putin-and-kim-requires-immediate-military-assistance-in-event-of-war/", "date": "2024-06-20 05:30", "source": "GDELT"}, {"id": "c69b29fd-f085-4e9d-9b92-3a66aa265bed", "message": "Mr Putin called it a “breakthrough document” reflecting shared desires to move relations to a higher level.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe deal was made as Mr Putin visited North Korea for the first time in 24 years.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping rubbish on the South via balloons and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.bournemouthecho.co.uk/news/national/24399175.north-korea-says-deal-russia-means-immediate-military-aid-event-war/", "date": "2024-06-20 04:15", "source": "GDELT"}, {"id": "21a74104-1f1f-4be3-9062-bb96255c88e6", "message": "North Korean leader Kim Jong Un and Russian President Vladimir Putin signed the pact at a summit Wednesday in Pyongyang.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\nNow with any ambiguity of Russia’s partnership with North Korea removed, how will Seoul respond?” she said.\n(Vladimir Smirnov, Sputnik, Kremlin Pool Photo via AP)A motorcade with Russian President Vladimir Putin drives along a street in Pyongyang, North Korea, on Wednesday, June 19, 2024.\n(Gavriil Grigorov, Sputnik, Kremlin Pool Photo via AP)A motorcade with Russian President Vladimir Putin drives along a street in Pyongyang, North Korea, on Wednesday, June 19, 2024.", "url": "https://www.theday.com/nation/20240621/s-korea-will-consider-supplying-arms-to-ukraine-after-russia-north-korea-sign-strategic-pact/", "date": "2024-06-21 04:45", "source": "GDELT"}], "location": "PYONGYANG", "total_score": 1.1053064571821898, "count": 2, "average_score": 0.5526532285910949, "final_score": 0.5968572600137664}, "de41bb85-591b-4265-8686-1c43d83f2b9f": {"messages": [{"id": "de41bb85-591b-4265-8686-1c43d83f2b9f", "message": "North Korea's people attend the official welcome ceremony with Russian President Vladimir Putin and North Korea's leader Kim Jong Un in the Kim Il Sung Square in Pyongyang, North Korea, on Wednesday, June 19, 2024.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\nThe deal was made as Putin visited North Korea for the first time in nearly a quarter-century, a trip that showcased their personal and geopolitical ties.\nNow with any ambiguity of Russia’s partnership with North Korea removed, how will Seoul respond?” she said.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on South Korea with balloons, and Seoul broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.news4jax.com/news/world/2024/06/20/north-korea-says-deal-between-putin-and-kim-requires-immediate-military-assistance-in-event-of-war/", "date": "2024-06-20 05:45", "source": "GDELT"}, {"id": "d6efd705-e45b-4732-9178-fb7c4e2f9186", "message": "Mr Putin called it a “breakthrough document” reflecting shared desires to move relations to a higher level.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe deal was made as Mr Putin visited North Korea for the first time in 24 years.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping rubbish on the South via balloons and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.theargus.co.uk/news/national/24399175.north-korea-says-deal-russia-means-immediate-military-aid-event-war/", "date": "2024-06-20 05:00", "source": "GDELT"}], "location": "PYONGYANG", "total_score": 0.506656604488724, "count": 1, "average_score": 0.506656604488724, "final_score": 0.5346596231421068}, "e3b37c69-c4da-413d-b78a-f9d14cae9eb4": {"messages": [{"id": "e3b37c69-c4da-413d-b78a-f9d14cae9eb4", "message": "South Korea’s military said it had fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border for the third time this month.\nMeanwhile, an activists’ group said it flew more balloons carrying propaganda leaflets toward North Korea, continuing a campaign that has aggravated animosities between the rivals and prompted a resumption of Cold War-style psychological warfare along their border.\nThe intrusions are likely related to the large number of troops North Korea has been deploying in frontline areas to fortify their side of the border, possibly to prevent civilians and soldiers from defecting to the South, as Pyongyang’s leadership continues to tighten its grip over the population.\nSouth Korea has recently retaliated for North Korea’s trash-carrying balloon launches with propaganda loudspeaker broadcasts at border areas (South Korea Defence Ministry via AP, File)Analysts say Pyongyang resents such material and fears it could demoralise frontline troops and residents and weaken leader Kim Jong Un’s grip on power.\nAfter previous leafletting by Mr Park’s group and other South Korean activists, North Korea launched more than 1,000 balloons that dropped rubbish in South Korea, smashing roof tiles and windows and causing other property damage.", "url": "https://guernseypress.com/news/world-news/2024/06/21/south-korean-troops-fire-more-warning-shots-at-border/", "date": "2024-06-21 04:30", "source": "GDELT"}, {"id": "73a5af9f-8c18-4e3d-9cba-25cae87ae979", "message": "South Korea’s military said it had fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border for the third time this month.\nThe intrusions are likely related to the large number of troops North Korea has been deploying in frontline areas to fortify their side of the border, possibly to prevent civilians and soldiers from defecting to the South, as Pyongyang’s leadership continues to tighten its grip over the population.\nSouth Korea has recently retaliated for North Korea’s trash-carrying balloon launches with propaganda loudspeaker broadcasts at border areas (South Korea Defence Ministry via AP, File)The South Korean civilian activists, led by North Korean defector Park Sang-hak, said it floated 20 balloons attached with 300,000 propaganda leaflets, 5,000 USB sticks with South Korean pop songs and TV dramas, and 3,000 US dollar bills from the South Korean border town of Paju on Thursday night.\nAnalysts say Pyongyang resents such material and fears it could demoralise frontline troops and residents and weaken leader Kim Jong Un’s grip on power.\nAfter previous leafletting by Mr Park’s group and other South Korean activists, North Korea launched more than 1,000 balloons that dropped rubbish in South Korea, smashing roof tiles and windows and causing other property damage.", "url": "https://www.irishexaminer.com/world/arid-41420785.html", "date": "2024-06-21 05:15", "source": "GDELT"}], "location": "South Korea", "total_score": 0.36430474921480915, "count": 1, "average_score": 0.36430474921480915, "final_score": 0.43501332445036645}, "921eb7f8-4fa7-4739-8ff2-10ec71ec9eb7": {"messages": [{"id": "921eb7f8-4fa7-4739-8ff2-10ec71ec9eb7", "message": "The South Korean ministry said Mr Zinoviev promised to convey Seoul’s concerns to his superiors in Moscow.\nThe South Korean civilian activists, led by North Korean defector Park Sang-hak, said it sent 20 balloons carrying 300,000 propaganda leaflets, 5,000 USB sticks with South Korean pop songs and TV dramas, and 3,000 US dollar bills from the South Korean border town of Paju on Thursday.\nAfter previous leafletting by South Korean activists, North Korea launched more than 1,000 balloons that dropped tons of rubbish in South Korea, smashing roof tiles and windows and causing other property damage.\nIn 2015, when South Korea restarted loudspeaker broadcasts for the first time in 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire, according to South Korean officials.\nThe South Korean military broadcast a warning and fired warning shots, after which the North Korean soldiers retreated.", "url": "https://www.swindonadvertiser.co.uk/news/national/24401821.south-korean-troops-fire-warning-shots-border/", "date": "2024-06-21 04:45", "source": "GDELT"}, {"id": "34498654-3ce2-4e09-9865-7bde32838874", "message": "A North Korean military guard post, top, and a South Korean post, bottom, are seen from Paju, South Korea, near the border with North Korea on June 18, 2024.\n(Ahn Young-joon/AP)SEOUL, South Korea — South Korea summoned the Russian ambassador to protest the country’s new defense pact with North Korea on Friday, as border tensions continued to rise with vague threats and brief, seemingly accidental incursions by North Korean troops.\nAfter previous leafletting by South Korean activists, North Korea launched more than 1,000 balloons that dropped tons of trash in South Korea, smashing roof tiles and windows and causing other property damage.\nIn 2015, when South Korea restarted loudspeaker broadcasts for the first time in 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire, according to South Korean officials.\nThe South Korean military broadcast a warning and fired warning shots, after which the North Korean soldiers retreated.", "url": "https://www.stripes.com/theaters/asia_pacific/2024-06-21/korea-border-warning-shots-14250243.html", "date": "2024-06-21 05:30", "source": "GDELT"}], "location": "South Korea", "total_score": 0.41389849532823686, "count": 1, "average_score": 0.41389849532823686, "final_score": 0.46972894672976584}, "a8d64701-a408-4711-91d9-f90158936a01": {"messages": [{"id": "a8d64701-a408-4711-91d9-f90158936a01", "message": "The IDF announced on Friday the names of two soldiers who were killed in battle in the Gaza Strip from mortar fire.\nOmer Smadga, 25, from Ganot Hadar, from the 9203 Battalion in the Alexandroni Brigade, fell in combat in the central Gaza Strip.\nSaadia Yaakov Dery, 27, from Tel Aviv, from the 9203 Battalion in the Alexandroni Brigade, fell in combat in the central Gaza Strip.\nThe evacuation of the injured was complicated, with IDF soldiers firing heavily towards the area where the terrorists launched the mortars.\nIDF medical teams provided quick initial treatment and evacuated the injured soldiers using 669 helicopters to hospitals in central Israel.", "url": "https://www.jpost.com/breaking-news/article-807145", "date": "2024-06-21 07:00", "source": "GDELT"}, {"id": "f61e15bd-1c4b-471d-8069-ab10324c29d4", "message": "Saadia Yaakov Dery, aged 27, from Tel Aviv, was one of the two soldiers who the IDF announced on Friday had fallen in battle in the Gaza Strip from mortar fire.\nDery was from the 9203 Battalion in the Alexandroni Brigade and fell in combat in the central Gaza Strip.\nDery was studying for rabbinical exams before he was drafted on October 7 for reserves.\nHis parents, Lilly and Chaim Dery, are considered central figures in the Israeli settlement Eli.\nSaadia Yaakov Dery (credit: FACEBOOK, IDF SPOKESPERSON'S UNIT)\"He was also a wonderful father to his children Halili and Yinon.", "url": "https://www.jpost.com/israel-hamas-war/article-807148", "date": "2024-06-21 07:00", "source": "GDELT"}], "location": "Gaza", "total_score": 0.6724964820079837, "count": 1, "average_score": 0.6724964820079837, "final_score": 0.6507475374055885}, "80e8e1d0-7e9d-4d51-8f48-720dff0682b3": {"messages": [{"id": "80e8e1d0-7e9d-4d51-8f48-720dff0682b3", "message": "Palestinian Civil Defense authorities said an Israeli airstrike on Gaza City hit a municipal garage, killing five people.\nThe strike on the garage in the center of Gaza City came Friday and killed four municipal workers and one passer-by, while leaving an unknown number of others buried under the rubble of the damaged building, the Civil Defense said.\nThe Gaza municipality confirmed that the strike hit its employees but did not give a breakdown on the casualties.\nIsrael launched the war after Hamas’ surprise Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nIsrael’s war against Hamas in Gaza has killed more than 37,400 people, according to Gaza’s Health Ministry, which does not distinguish between combatants and civilians in its count.", "url": "https://www.naharnet.com/stories/en/306064-israeli-airstrike-levels-gaza-municipal-garage-killing-5", "date": "2024-06-21 12:30", "source": "GDELT"}, {"id": "a025c6e3-2046-4f2f-a45a-b56517655a9b", "message": "The Latest | Armenia recognizes a Palestinian state, as malnutrition spreads among children in GazaThe Latest | Armenia recognizes a Palestinian state, as malnutrition spreads among children in Gaza View PhotoArmenia said it would recognize a Palestinian state on Friday, prompting Israel to summon its ambassador for what the Foreign Ministry described as a “severe reprimand.”Dozens of countries have recognized a Palestinian state, though none of the major Western powers has done so.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\n— A rare public rift appears between Israel’s political and military leadership over how the war in Gaza is being conducted.\nLast week, an explosion in southern Gaza killed eight Israeli soldiers.\nIsraeli airstrike levels Gaza municipal garage, killing 5DEIR AL-BALAH, Gaza Strip — Palestinian Civil Defense authorities say an Israeli airstrike on Gaza City hit a municipal garage, killing five people.", "url": "https://www.mymotherlode.com/news/world/3379154/the-latest-armenia-recognizes-a-palestinian-state-and-israel-summons-its-ambassador.html", "date": "2024-06-21 13:15", "source": "GDELT"}], "location": "Gaza City", "total_score": 0.6719224237794118, "count": 1, "average_score": 0.6719224237794118, "final_score": 0.6503456966455883}, "9a04583b-459d-4bf7-bc0b-82842f5b2c7a": {"messages": [{"id": "9a04583b-459d-4bf7-bc0b-82842f5b2c7a", "message": "Israel launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\n— A rare public rift appears between Israel’s political and military leadership over how the war in Gaza is being conducted.\nLast week, an explosion in southern Gaza killed eight Israeli soldiers.\nArmenia recognizes a Palestinian stateJERUSALEM — Armenia's foreign ministry said Friday that the former Soviet republic would recognize a Palestinian state, prompting Israel to summon its ambassador for a “severe reprimand.\"\nIsraeli airstrike levels Gaza municipal garage, killing 5DEIR AL-BALAH, Gaza Strip — Palestinian Civil Defense authorities say an Israeli airstrike on Gaza City hit a municipal garage, killing five people.", "url": "https://isp.netscape.com/news/world/story/0001/20240621/33b01e5076a584fa3017a39a889db80e", "date": "2024-06-21 13:30", "source": "GDELT"}, {"id": "0aa79f37-258a-4689-8525-1d7a8f9f6024", "message": "The Latest | Armenia recognizes a Palestinian state, as malnutrition spreads among children in GazaFILE - Palestinians storm rucks loaded with humanitarian aid brought in through a new U.S.-built pier, in the central Gaza Strip, Saturday, May 18, 2024.\n— Israel’s pledge to guard an aid route into Gaza falls flat as lawlessness blocks distribution.\n— A rare public rift appears between Israel’s political and military leadership over how the war in Gaza is being conducted.\nLast week, an explosion in southern Gaza killed eight Israeli soldiers.\nIsraeli airstrike levels Gaza municipal garage, killing 5DEIR AL-BALAH, Gaza Strip — Palestinian Civil Defense authorities say an Israeli airstrike on Gaza City hit a municipal garage, killing five people.", "url": "https://infotel.ca/newsitem/ml-mideast-tensions-the-latest/cp1086194554", "date": "2024-06-21 12:30", "source": "GDELT"}], "location": ".\nGaza City", "total_score": 0.5653961391132856, "count": 1, "average_score": 0.5653961391132856, "final_score": 0.5757772973793}, "37877c62-99ff-4222-87bf-65d6ff909610": {"messages": [{"id": "37877c62-99ff-4222-87bf-65d6ff909610", "message": "Israeli strikes on tent camps near Rafah kill at least 25 and wound 50, Gaza health officials sayFILE - Palestinians buy supplies at the market in Rafah, Gaza Strip, on Feb. 18, 2024.\nThe Health Ministry in Gaza reported the number of people killed and wounded in the attacks.\nAt least 10 Palestinians were killed by Israeli fire elsewhere in the Gaza Strip on Friday.\nThe top United Nations court has concluded there is a “plausible risk of genocide” in Gaza — a charge Israel strongly denies.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.", "url": "https://www.yahoo.com/news/israeli-strikes-tent-camps-near-182117630.html", "date": "2024-06-21 18:45", "source": "GDELT"}, {"id": "79aeb76e-d22c-41e4-90f8-3dcf297fba0d", "message": "FILE - Palestinians buy supplies at the market in Rafah, Gaza Strip, on Feb. 18, 2024.\n(AP Photo/Fatima Shbair, File)DEIR EL-BALAH – Israeli forces shelled tent camps for displaced Palestinians north of Gaza's southern city of Rafah on Friday, killing at least 25 people and wounding another 50, according to the territory's Heath Ministry and emergency workers.\nAt least 10 Palestinians were killed by Israeli fire elsewhere in the Gaza Strip on Friday.\nThe top United Nations court has concluded there is a “plausible risk of genocide” in Gaza — a charge Israel strongly denies.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.", "url": "https://www.ksat.com/news/world/2024/06/21/israeli-strikes-on-tent-camps-near-rafah-kill-at-least-25-and-wound-50-gaza-health-officials-say/", "date": "2024-06-21 18:45", "source": "GDELT"}], "location": "GAZA", "total_score": 0.3410663715984321, "count": 1, "average_score": 0.3410663715984321, "final_score": 0.4187464601189025}}