{"e28ae83b-6862-48a2-9727-3d03b3d94013": {"messages": [{"id": "e28ae83b-6862-48a2-9727-3d03b3d94013", "message": "Three deans at Columbia University have been put on leave after sending hostile text messages, including a vomiting face emoji, during a panel discussion about antisemitism at a recent alumni event.\nImages of the text exchange between Josef Sorett, Susan Chang-Kim, Matthew Patashnick and Cristen Kromm, all associate deans and administrators at the Ivy League school, were captured by an alumnus sitting in the crowd during the May 31 panel about Jewish life on campus.\n4 Susan Chang-Kim, Columbia College’s vice dean and chief administrative officer, was among the university brass placed on leave in the wake of the exchange.\nAnother exchange shows Pataschnick, Columbia’s associate dean for student and family support, accuse an unknown member of the panel of exploiting the situation.\n4 Columbia’s campus has been a hotbed of anti-Israel demonstrations since the Jewish state began its retalitatory strike against Hamas after the Oct. 7 terror attack.", "url": "https://nypost.com/2024/06/21/us-news/three-columbia-deans-placed-on-leave-over-disparaging-text-exchange-during-antisemitism-panel/", "date": "2024-06-22 01:00", "source": "GDELT"}, {"id": "4d26f932-d9f1-497a-8498-60f835d29a5c", "message": "Here are the messages exchanged in those 2 hoursAt a panel discussion about antisemitism at an alumni event of the Columbia University , three deans were found sending hostile text messages including a vomiting face emoji in a group chat, the screenshot of which was leaked online.\nThe university authorities have put all of them on leave.\nImages of the text exchange between Susan Chang-Kim, Matthew Patashnick and Cristen Kromm, all associate deans and administrators at the Ivy League school, were captured by an alumnus sitting in the crowd during the May 31 panel about Jewish life on campus, report said.“We are committed to combating antisemitism and taking sustained, concrete action to ensure Columbia is a campus where Jewish students and everyone in our community feels safe, valued, and able to thrive,” a university official told the New York Jewish Week on Friday.The disparaging messaging went on for two hours as long as the panel lasted.\nThey were mocking the panelists' remarks and an audience member sitting behind one of the deans took photos of the conversation.In one exchange, Kromm, the dean of undergraduate student life, used the queasy and vomiting emojis in reference to an October, 2023 op-ed in the Spectator titled “Sounding the alarm,” written by Yonah Hain, the school’s campus rabbi.In it, he warned the university community had “lost its moral compass” as troubling anti-Israel demonstrations began engulfing campus in the fall.Another exchange shows Pataschnick, Columbia’s associate dean for student and family support, accuse an unknown member of the panel of exploiting the situation.“He knows exactly what he’s doing and how to take full advantage of this moment.\nHuge fundraising potential,” to which Chang-Kim, vice dean and chief administrative officer of Columbia College, replied “Double Urgh.”The incident came as Columbia saw major pro-Palestinian student protests leading to the arrests of more than 199 students.", "url": "https://timesofindia.indiatimes.com/world/us/vomiting-face-emoji-3-deans-at-columbia-university-placed-on-leave-for-belittling-campus-jews-worries/articleshow/111191185.cms", "date": "2024-06-22 13:15", "source": "GDELT"}], "location": "Based on the context provided, I was unable to find a specific location for the main event described in the text.", "total_score": 0.6584430885016441, "count": 1, "average_score": 0.6584430885016441, "final_score": 0.6409101619511509}}