{"d29ef3f5-e266-4658-9eea-4fa99c258696": {"messages": [{"id": "d29ef3f5-e266-4658-9eea-4fa99c258696", "message": "Residents of Nashville, Tennessee, are showing solidarity with the city's Jewish community, pushing a message of peace in the face of harassment from neo-Nazi and white supremacist groups descending on the city to spew antisemitic hate.\nLaw enforcement officials and local leaders urged residents not to engage with the group, which authorities said was coming in from outside the city.\nAccording to Nashville police, a member of a \"Neo Nazi protest group\" carrying a Nazi flag got into an argument with a bartender.\nIt is the city that welcomes immigrants, and it is a city that preaches love for all of us.\nThey included Mayor Freddie O'Connell, faith leaders from around the city and Gnash, the mascot of the Nashville Predators of the NHL.", "url": "https://www.nbcnews.com/news/us-news/nashville-residents-push-jewish-solidarity-wake-neo-nazis-converging-rcna163083", "date": "2024-07-23 02:45", "source": "GDELT"}, {"id": "3a6d8fed-0a9c-4c4f-b5d6-397ae4b38337", "message": "Residents of Nashville, Tennessee, are showing solidarity with the city's Jewish community, pushing a message of peace in the face of harassment from neo-Nazi and white supremacist groups descending on the city to spew antisemitic hate.\nBut community members communicated to the Jewish Federation that they were beginning to feel \"under siege,\" Oleshansky said.\nCommunity deals with a 'very vexing problem'Police Chief John Drake sent a letter to community leaders Wednesday after days of incidents caused tension and fear among residents.\nOleshansky said the idea for the solidarity event came together that day, as Jewish Federation leaders continued to hear people struggling with what was happening.\nThey included Mayor Freddie O'Connell, faith leaders from around the city and Gnash, the mascot of the Nashville Predators of the NHL.", "url": "https://www.yahoo.com/news/nashville-residents-show-jewish-solidarity-032541339.html", "date": "2024-07-23 04:15", "source": "GDELT"}], "location": "Nashville, Tennessee", "total_score": 0.4945795073014846, "count": 1, "average_score": 0.4945795073014846, "final_score": 0.5262056551110392}}