{"b23e346a-b71c-47ad-85fc-218bb977941c": {"messages": [{"id": "b23e346a-b71c-47ad-85fc-218bb977941c", "message": "BEIRUT, Lebanon: Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Palestinian militant group Hamas in Gaza.\nIsrael, accused by Hamas, Iran and others of carrying out the attack, has not directly commented on it.\nIran said on Saturday it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.", "url": "https://www.channelnewsasia.com/world/israel-hamas-war-fear-conflict-spread-middle-east-retaliation-4525466", "date": "2024-08-04 05:45", "source": "GDELT"}, {"id": "6b01f51d-8ad7-442a-92fa-a23f31733a1f", "message": "However, he stressed that the unprecedented scale of US support for Israel since October 7 should leave Iran, Hezbollah, and other groups with no doubt about US resolve.\nIsrael, accused by Hamas, Iran and others of carrying out the attack, has not directly commented on it.\nIran said on Saturday it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nSoon after, Hezbollah announced it had fired dozens of Katyusha rockets at the northern Israeli settlement of Beit Hillel.", "url": "https://www.news18.com/world/israel-prepares-for-potential-iranian-strike-coordinates-with-allies-us-and-uk-8989524.html", "date": "2024-08-04 06:00", "source": "GDELT"}, {"id": "3024b1df-baf7-4c1e-a195-9bbef43a2ed4", "message": "(MENAFN- Gulf Times) Middle East tensions soared yesterday as Iran and its allies readied their response to the assassination of Hamas's leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Palestinian group Hamas.\nIran said it expects Hezbollah to hit deeper inside Israel and to no longer be confined to military targets.\nWith such talk growing, the Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nThe New York Times, citing unnamed sources, reported that the explosion which killed Haniyeh was a bomb that was covertly smuggled into the guesthouse where he was staying in Tehran two months ago.", "url": "https://menafn.com/1108514431/Fears-Of-Middle-East-War-Grow-After-Haniyehs-Killing", "date": "2024-08-04 08:45", "source": "GDELT"}, {"id": "b48860ba-5f35-4a2f-9cfa-b88897aac33d", "message": "Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and the Palestinian militant group Hamas in Gaza.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nHis death came hours after Israel struck south Beirut, killing Hezbollah military commander Fuad Shukr.\nHezbollah has been exchanging near-daily cross-border fire with Israeli forces since October, saying it is acting in support of Hamas.", "url": "https://timesofmalta.com/article/fears-middle-east-war-grow-hamas-leader-killing.1096297", "date": "2024-08-04 07:15", "source": "GDELT"}, {"id": "98f60ea6-19c1-4578-a60b-f9bcef5cdff6", "message": "### Tensions in the Middle East Escalate Following AssassinationsTensions in the Middle East have reached a boiling point as Iran and its allies prepare to respond to the assassination of Hamas’ political leader, an act attributed to Israel, sparking fears of a regional war.\nIsrael, accused by Hamas, Iran, and others of the assassination, has not commented on the matter.\nIran stated on Saturday that it expects Hezbollah to strike deeper into Israel, not limiting its targets to military ones.\nFollowing Israel’s strike that killed Hezbollah military chief Fouad Shukur, both Britain and the United States have urged their citizens to leave Lebanon immediately.\nIsrael has vowed to destroy Hamas in response to the group’s October 7 attack, which initiated the current Gaza conflict.", "url": "https://dailystar.com.lb/fears-middle-east-war-grow-hamas-leader-killed/", "date": "2024-08-04 13:00", "source": "GDELT"}, {"id": "8690ede3-ba62-4856-b795-eecda911fef2", "message": "Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas’s political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Palestinian militant group Hamas in Gaza.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nHis death came hours after Israel struck south Beirut, killing Hezbollah military commander Fuad Shukr.\nHezbollah has been exchanging near-daily cross-border fire with Israeli forces since October, saying it is acting in support of Hamas.", "url": "https://punchng.com/fears-of-middle-east-war-grow-after-hamas-leaders-killing/", "date": "2024-08-04 07:15", "source": "GDELT"}], "location": "BEIRUT", "total_score": 2.546705473283707, "count": 5, "average_score": 0.5093410946567414, "final_score": 0.656538766259719}, "e15469e3-310d-422f-adee-15ddf038558e": {"messages": [{"id": "e15469e3-310d-422f-adee-15ddf038558e", "message": "A Palestinian woman inspects the site of a former school, which was destroyed in an Israeli air strike.\nGAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "url": "https://www.odt.co.nz/news/world/israeli-strike-gaza-school-sheltering-refugees-kills-15", "date": "2024-08-04 02:00", "source": "GDELT"}, {"id": "dc2a60e6-d2a0-4ae1-aeb3-609bdb08a307", "message": "GAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City’s Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nEgypt’s foreign minister, Badr Abdelatty, stressed in a phone call with Iran’s acting foreign minister, Ali Bagheri Kani, that recent developments in the region were “unprecedented, very dangerous” and threatening to stability, Egypt’s government said.", "url": "https://www.timesofearth.com/2024/08/04/israeli-strikes-kill-15-palestinians-in-gaza-school-nine-west-bank-militants/", "date": "2024-08-04 01:30", "source": "GDELT"}, {"id": "a39ef67d-756b-4fd7-9712-1dbf2bedaa7f", "message": "In the Gaza Strip, at least 15 people were killed in the Israeli strike on a school.\nGAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nEgypt's foreign minister, Badr Abdelatty, stressed in a phone call with Iran's acting foreign minister, Ali Bagheri Kani, that recent developments in the region were \"unprecedented, very dangerous\" and threatening to stability, Egypt's government said.", "url": "https://www.ndtv.com/world-news/15-killed-in-israeli-airstrike-on-gaza-school-being-used-as-shelter-6259495", "date": "2024-08-04 08:45", "source": "GDELT"}, {"id": "1c085c5f-481e-4843-80ec-d0e35c289507", "message": "Israeli strikes kill 15 Palestinians in Gaza school, nine fighters in West BankWorld World Israeli strikes kill 15 Palestinians in Gaza school, nine fighters in West BankThe school is sheltering displaced people in Gaza City's Sheikh Radwan neighbourhood, the Hamas saidFollow on Published On: Sun, 04 Aug 2024 09:36:31 PKTCAIRO/RAMALLAH (Reuters) – An Israeli airstrike on a school sheltering displaced people in Gaza City killed at least 15 Palestinians on Saturday, hours after two strikes in the occupied West Bank killed nine fighters, including a local Hamas commander, Hamas said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide fighters and manufacture weapons.\nEarlier on Saturday, Israeli strikes in the enclave killed six people in a house in the southern area of Rafah and two others in Gaza City, Gaza health officials said.\nThe Israeli military said its forces had struck and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "url": "https://dunyanews.tv/en/World/828535-israeli-strikes-kill-15-palestinians-in-gaza-school-nine-fighters-in-", "date": "2024-08-04 06:45", "source": "GDELT"}, {"id": "20ad26ff-e460-40b7-a159-8040da737705", "message": "Palestinians inspect the site of Israeli strikes on a school sheltering displaced people, amid Israel-Hamas conflict, in Gaza City, August 3, 2024.\n(Reuters)An Israeli airstrike on a school sheltering displaced persons in Gaza City killed at least 15 Palestinians on Saturday, hours after two strikes in the occupied West Bank killed nine militants including a local Hamas commander, Hamas said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "url": "https://www.thestandard.com.hk/breaking-news/section/6/219045/Israeli-strikes-kill-15-Palestinians-in-Gaza-school,-nine-West-Bank-militants", "date": "2024-08-04 06:45", "source": "GDELT"}, {"id": "ee1f63ba-1c29-4723-8174-81c0554e98fc", "message": "(MENAFN- Gulf Times) An Israeli on a school sheltering displaced persons in Gaza City killed at least 15 Palestinians yesterday, hours after two strikes in the occupied West killed nine, Palestinian resistance movement Hamas said.\nThe Israeli military said the first of two West Bank hit a vehicle in a town near the city of Tulkarm.\nIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nEarlier yesterday, Israeli strikes in the enclave killed six people in a house in the southern area of Rafah and two others in Gaza City, Gaza health officials said.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "url": "https://menafn.com/1108514432/15-Displaced-Civilians-Killed-In-Israeli-Strike-On-Gaza-School", "date": "2024-08-04 08:45", "source": "GDELT"}, {"id": "b81e668b-2c89-40c1-853d-230da097c3be", "message": "By Nidal al-MughrabiCAIRO (Reuters) -An Israeli airstrike hit two schools in Gaza City on Sunday, killing at least 25 people, the Palestinian official news agency said, while the Israeli military said it struck a Hamas military compound embedded in the schools.\nAn Israeli air strike hit a tent camp inside a hospital in central Gaza earlier in the day.\nThe Israeli military said it struck militants inside a Hamas command embedded within the schools, accusing Hamas of operating from within civilian property.\nEarlier in the day, an Israeli strike inside the Al-Aqsa Hospital compound started a fire, and wounded at least 18 people as well as killing five, medical authorities said.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, Gaza health officials say.", "url": "https://www.aol.com/israeli-strikes-kill-five-hospital-095920432.html", "date": "2024-08-04 12:15", "source": "GDELT"}, {"id": "cf4c63bd-8cbf-4f44-a9e3-f6d67413c4cf", "message": "CAIRO (Reuters) - An Israeli airstrike hit a tent inside a hospital compound in central Gaza, killing at least five people, bringing the total of Palestinians killed on Sunday to 19, Gaza health officials said, after another round of talks ended without result.\nThe Israeli military said it struck a militant who \"conducted terror activities\" and that secondary explosions were identified, indicating the presence of weaponry in the area.\nSirens went off in the area of Ashdod, further north than seen in recent weeks, and the Israeli military said five rockets were launched from southern Gaza.\nHaniyeh's death was one in a series of killings of senior Hamas figures as the Gaza war nears its 11th month.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "url": "https://www.marketscreener.com/quote/index/FTSE-EGYPT-INDEX-121232409/news/Israeli-strikes-kill-five-at-hospital-Gaza-officials-say-after-abortive-talks-47551556/", "date": "2024-08-04 11:30", "source": "GDELT"}, {"id": "e6bc3259-33e8-4d85-9e69-d703fed267ea", "message": "At least 15 Palestinians were killed in an Israeli strike on a school sheltering displaced people in Gaza City late Saturday.\nThe attack came just hours after two strikes in the occupied West Bank killed nine people, including a local Hamas leader, Hamas said.\n(AFP Photo)Gaza strikesIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighborhood, the local media office said.\nThe Israeli military wrongly alleged the school was being used as a command center for Hamas, to hide members and manufacture weapons.\nEgypt's foreign minister, Badr Abdelatty, stressed in a phone call with Iran's acting foreign minister, Ali Bagheri Kani, that recent developments in the region were \"unprecedented, very dangerous\" and threatening to stability, Egypt's government said.", "url": "https://www.dailysabah.com/world/mid-east/15-killed-in-israeli-strikes-on-gaza-school-9-dead-in-west-bank", "date": "2024-08-04 11:45", "source": "GDELT"}, {"id": "2a7eefec-d79e-4e93-a4c8-0870a6e13578", "message": "Thousands of displaced Palestinians have sought refuge in the hospital in Deir al-Balah, one of the few operational hospitals in central Gaza.\nIt was extremely difficult.”The attack brought the total number of Palestinians killed across Gaza on Sunday to 19, health officials said.\nIn northern Gaza, an Israeli strike destroyed a house, killing at least eight people, including three children, their parents and their grandmother, the Palestinian health ministry said.\nSunday’s strikes came hours after an Israeli air strike killed at least 17 people and wounded 21 others sheltering in a school in Gaza City.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza since the war began in October 2023, according to the Palestinian health ministry.", "url": "https://www.middleeasteye.net/news/four-killed-strike-tents-housing-displaced-palestinians", "date": "2024-08-04 11:45", "source": "GDELT"}, {"id": "0b6df91b-3fb9-43cd-9d4b-d1b485c4aa9d", "message": "Palestinians inspect the site of an Israeli strike on a house in Deir Al-Balah in the central Gaza Strip, August 4, 2024.\nPHOTO: REUTERSAn Israeli airstrike hit a tent inside a hospital compound in central Gaza, killing at least five people, bringing the total of Palestinians killed on Sunday to 19, Gaza health officials said, after another round of talks ended without result.\nThe Israeli military said it struck a fighter who \"conducted terror activities\" and that secondary explosions were identified, indicating weapons were present in the area.\nSirens went off in the area of Ashdod, further north than seen in recent weeks, and the Israeli military said five rockets were launched from southern Gaza.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "url": "https://tribune.com.pk/story/2485504/israeli-airstrike-on-gaza-hospital-kills-five", "date": "2024-08-04 15:30", "source": "GDELT"}], "location": "GAZA STRIP", "total_score": 5.541713030044379, "count": 10, "average_score": 0.554171303004438, "final_score": 0.8379199121031066}, "9715d982-c98e-4680-91c3-918d5daec8ff": {"messages": [{"id": "9715d982-c98e-4680-91c3-918d5daec8ff", "message": "Reuters FileA suspected missile attack by Yemen’s Houthi rebels struck a container ship travelling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometres (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nOther missiles and drones have been either intercepted by a US-led coalition in the Red Sea or splashed down before reaching their targets.\nMeanwhile Saturday, the US military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.", "url": "https://www.firstpost.com/world/suspected-missile-attack-by-yemens-houthi-strikes-container-ship-first-assault-in-two-weeks-13800620.html", "date": "2024-08-04 02:30", "source": "GDELT"}, {"id": "df2726b4-06aa-4a7c-9854-bd580a69b940", "message": "DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen’s Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.\nIn the time since, Israel has killed at least 39,550 Palestinians in the Gaza Strip and 590 in the Israeli-occupied West Bank, Palestinian health officials say.", "url": "https://www.winnipegfreepress.com/business/2024/08/03/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks", "date": "2024-08-04 03:00", "source": "GDELT"}, {"id": "db4f4c0e-8cb4-4c8e-8218-aa3953fe681c", "message": "DUBAI, United Arab Emirates (AP) — A missile attack by Yemen’s Houthi rebels struck a Liberian-flagged container ship traveling through the Gulf of Aden, authorities said Sunday, the first assault by the group since Israeli airstrikes targeted them.\nThe rebels separately claimed to have shot down another U.S. military spy drone, without offering evidence.\nGen. Yahya Saree, a Houthi military spokesman, claimed the attack in a prerecorded statement Sunday afternoon.\nThe rebels have targeted more than 70 vessels with missiles and drones in a campaign that has killed four sailors.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.", "url": "https://www.whec.com/business/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "date": "2024-08-04 06:00", "source": "GDELT"}], "location": "The most relevant specific location mentioned in the provided context is \"Gulf of Aden.\"", "total_score": 1.0720721169600005, "count": 2, "average_score": 0.5360360584800002, "final_score": 0.5852252409360001}, "392af48c-ca5b-459d-bf02-0ec4e51f1924": {"messages": [{"id": "392af48c-ca5b-459d-bf02-0ec4e51f1924", "message": "Hezbollah says it has launched “dozens” of rockets from Lebanon, as fears grow that a full-scale war with Israel could soon break out following the assassination of Hamas’s political leader in Tehran.\nThe Iran-backed group said it was acting in response to Israel’s attacks on Kfar Kela and Deir Siriane in Lebanon which, it said, had injured civilians there.\nIt comes amid reports that 50 rockets have been fired from southern Lebanon towards upper Galilee alone, according to Israeli media.\nThe crisis in the Middle East has intensified following the assassination of Ismail Haniyeh, Hamas’ top leader, a day after an Israeli strike in Beirut killed senior Hezbollah commander Fuad Shukr.\nThe escalating tensions have prompted Britain, the US and Australia to tell their citizens to evacuate Lebanon.", "url": "https://www.telegraph.co.uk/world-news/2024/08/04/israel-iran-hamas-hezbollah-war-latest/", "date": "2024-08-04 02:30", "source": "GDELT"}, {"id": "c102b078-4ead-46ca-95e4-324c250f575d", "message": "Hezbollah launched dozens of rockets from Lebanon, as fears of full-scale war with Israel continue to mount.\nThe Iran-backed group said it was acting in response to Israel’s attacks on Kfarkela and Deir Siriane in Lebanon which, it said, had injured civilians there.\nSome 50 rockets were reportedly fired from southern Lebanon towards upper Galilee, according to Israeli media.\nThe crisis in the Middle East has intensified following the assassination of Ismail Haniyeh, the political leader of Hamas, a day after an Israeli strike in Beirut killed Fuad Shukr, a senior Hezbollah commander.\nRecent video footage revealed Israel’s Iron Dome defence system being activated.", "url": "https://www.telegraph.co.uk/world-news/2024/08/04/hezbollah-launches-rockets-into-israel/", "date": "2024-08-04 13:00", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.3988703737345378, "count": 1, "average_score": 0.3988703737345378, "final_score": 0.4592092616141765}, "5518d2c8-65f7-4eb0-a0ca-a4b342902f38": {"messages": [{"id": "5518d2c8-65f7-4eb0-a0ca-a4b342902f38", "message": "Recommended VideosTensions have soared across the region since Hamas' Oct. 7 attack ignited the war in Gaza last year.\nIsrael is bracing for retaliation after the killing of a senior Hezbollah commander in a strike in Lebanon and Hamas' top political leader in an attack in Iran's capital last week.\nThe rescuers said the wounded were found in three different locations, each about 500 meters (yards) apart.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October, triggering the ongoing war.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state.", "url": "https://www.ksat.com/news/world/2024/08/04/a-woman-was-killed-and-3-others-were-wounded-in-a-stabbing-attack-in-israel/", "date": "2024-08-04 06:30", "source": "GDELT"}, {"id": "09e7f8ec-76c7-4d9c-a943-3ef677d24c06", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "url": "https://www.voanews.com/a/strikes-on-gaza-kill-12-and-stabbing-in-israel-kills-2-as-fears-of-wider-war-spike/7729191.html", "date": "2024-08-04 08:45", "source": "GDELT"}, {"id": "651845aa-e143-4d41-99e9-71e5804e6ec9", "message": "Those killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth targeted killings were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state.", "url": "https://www.thehindu.com/news/international/fears-of-wider-war-spike-after-strikes-on-gaza-kill-18-and-stabbing-in-israel-kills-2/article68484859.ece", "date": "2024-08-04 13:45", "source": "GDELT"}, {"id": "26a0a32f-22c7-4737-a02b-68ddea18d489", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nThe continuous strikes and counterstrikes have grown in severity in recent months, raising fears of an even more destructive regional war.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state.", "url": "https://www.theweek.in/wire-updates/international/2024/08/04/fgn19-israel-hamas-ld-war.html", "date": "2024-08-04 11:45", "source": "GDELT"}], "location": "GAZA", "total_score": 1.8699376624371746, "count": 3, "average_score": 0.6233125541457248, "final_score": 0.6763187879020074}, "ce66669b-a3a4-453b-a4cf-70ca845083eb": {"messages": [{"id": "ce66669b-a3a4-453b-a4cf-70ca845083eb", "message": "Iran’s Islamic Revolution Guards Corps (IRGC) has said that Hamas Politburo Chief Ismail Haniyeh was assassinated by a “short-range projectile loaded with an almost 7-kg warhead”.\n“Given the conducted investigations, the terrorist operation has been carried out through firing from outside the guests’ residence a short-range projectile loaded with an almost 7 kg warhead, causing an intense explosion,” the IRGC said on Saturday in its third statement about Haniyeh’s assassination in an alleged Israeli attack in the Iranian capital Tehran, according to the armed force’s official news outlet Sepah News.\nThe statement added the “terrorist” attack had been designed and carried out by Israel with the US government’s support, Xinhua news agency reported.\nAdvertisementThe IRGC stressed that “the revenge for Haniyeh’s blood will be definite,” adding the “adventurist and terrorist” Israel would receive a “decisive response to this crime, which is a harsh punishment, at the appropriate time and place and with the appropriate quality”.\nHaniyeh, who had been invited to attend the swearing-in ceremony of Iranian President Masoud Pezeshkian on Tuesday, was killed along with his bodyguard early Wednesday when their residence in Tehran was hit.", "url": "https://www.thestatesman.com/world/iran-says-hamas-chief-killed-by-short-range-projectile-1503327940.html", "date": "2024-08-04 05:45", "source": "GDELT"}, {"id": "526c6208-4fe3-4649-895e-9499fa4ead12", "message": "视频播放位置 下载安装Flash播放器Iran's Islamic Revolution Guards Corps (IRGC) said on Saturday that Hamas Politburo Chief Ismail Haniyeh was assassinated by a \"short-range projectile loaded with an almost 7-kg warhead.\"\nThis photo shows Hamas Politburo Chief Ismail Haniyeh (C) in Tehran, Iran, July 30, 2024.\nThe statement added the \"terrorist\" attack had been designed and carried out by Israel with the U.S. government's support.\nThe IRGC stressed that \"the revenge for Haniyeh's blood will be definite,\" adding the \"adventurist and terrorist\" Israel would receive a \"decisive response to this crime, which is a harsh punishment, at the appropriate time and place and with the appropriate quality.\"\nHaniyeh, who had been invited to attend the swearing-in ceremony of Iranian President Masoud Pezeshkian on Tuesday, was killed along with his bodyguard early Wednesday when their residence in Tehran was hit.", "url": "http://www.china.org.cn/world/2024-08/04/content_117348092.htm", "date": "2024-08-04 02:30", "source": "GDELT"}], "location": "Tehran, Iran", "total_score": 0.4348990844777362, "count": 1, "average_score": 0.4348990844777362, "final_score": 0.4844293591344153}, "0ad51541-2775-40c7-a026-f35d8e8b6b6e": {"messages": [{"id": "0ad51541-2775-40c7-a026-f35d8e8b6b6e", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "url": "https://www.theweek.in/wire-updates/international/2024/08/04/fgn13-israel-hamas-war.html", "date": "2024-08-04 08:30", "source": "GDELT"}, {"id": "18c9ebfc-5043-4cc7-9447-9f4b1a125378", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nA separate strike flattened a house in northern Gaza, killing at least eight people, including three children, their parents and their grandmother, according to the ministry.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "url": "https://www.swindonadvertiser.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "date": "2024-08-04 08:45", "source": "GDELT"}, {"id": "2781d16d-b600-487d-8a8a-ac3c37c79878", "message": "Israeli air strikes have killed 18 people in Gaza, including four who were sheltering at a tent camp housing displaced people inside a hospital complex, while a stabbing attack carried out by a Palestinian killed two people in a Tel Aviv suburb.\nTensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "url": "https://www.lbc.co.uk/world-news/a24337bd08cc432281f1c74dbb3883b4/", "date": "2024-08-04 10:15", "source": "GDELT"}, {"id": "4e63286f-61f1-4a98-8642-b3cc5b5400ed", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "url": "https://www.edp24.co.uk/news/national/24496249.18-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "date": "2024-08-04 13:30", "source": "GDELT"}, {"id": "a91c0da8-992b-4f9c-852c-0c7965beaddc", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nIsrael's military, which regularly accuses Palestinian militants of sheltering in civilian areas, said it struck a Hamas command center.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.", "url": "https://knpr.org/npr/2024-08-04/strikes-on-gaza-kill-12-and-stabbing-in-israel-kills-2-as-fears-of-wider-war-spike", "date": "2024-08-04 12:15", "source": "GDELT"}, {"id": "ec227b86-fc50-471a-b847-93eb7a3aedd8", "message": "Both were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nGaza's Health Ministry does not differentiate between civilians and militants in its tallies.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nIsrael's massive offensive launched in Gaza has killed at least 39,550 Palestinians, according to the territory's Health Ministry, which does not say how many were militants.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "url": "https://www.nbcnewyork.com/news/national-international/israeli-strikes-on-gaza-kill-at-least-12-after-knife-attack-in-tel-aviv-leaves-2-dead/5667500/", "date": "2024-08-04 09:45", "source": "GDELT"}, {"id": "9fc7c370-3d1e-4778-b322-d08bd2a10678", "message": "Israeli air strikes have killed 18 people in Gaza, including four who were sheltering at a tent camp housing displaced people inside a hospital complex, while a stabbing attack carried out by a Palestinian killed two people in a Tel Aviv suburb.\nTensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nAdvertisementA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAdvertisementMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "url": "https://www.breakingnews.ie/world/twelve-dead-in-israeli-air-strikes-on-gaza-after-tel-aviv-stabbing-1657873.html", "date": "2024-08-04 09:45", "source": "GDELT"}, {"id": "bcff9f4d-f3a6-4969-809b-a30da1e4662b", "message": "Those killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth targeted killings were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state.", "url": "https://www.theweek.in/wire-updates/international/2024/08/04/fgn23-israel-hamas-2ndld-war.html", "date": "2024-08-04 13:15", "source": "GDELT"}], "location": "GAZA", "total_score": 3.338854617524718, "count": 7, "average_score": 0.4769792310749597, "final_score": 0.6938854617524718}, "51a1dd8c-8ab9-4710-8535-fa3e1e4ac602": {"messages": [{"id": "51a1dd8c-8ab9-4710-8535-fa3e1e4ac602", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nA separate strike flattened a house in northern Gaza, killing at least eight people, including three children, their parents and their grandmother, according to the ministry.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "url": "https://www.oxfordmail.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "date": "2024-08-04 08:30", "source": "GDELT"}, {"id": "2eacc3c2-348a-4b5b-a639-cc0b742c1132", "message": "Both were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nGaza's Health Ministry does not differentiate between civilians and militants in its tallies.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nIsrael's massive offensive launched in Gaza has killed at least 39,550 Palestinians, according to the territory's Health Ministry, which does not say how many were militants.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "url": "https://www.nbcwashington.com/news/national-international/israeli-strikes-on-gaza-kill-at-least-12-after-knife-attack-in-tel-aviv-leaves-2-dead/3684247/", "date": "2024-08-04 09:45", "source": "GDELT"}], "location": "GAZA", "total_score": 0.6098705263673858, "count": 1, "average_score": 0.6098705263673858, "final_score": 0.60690936845717}, "f6d39b5e-6393-4a31-82eb-5406d62014e2": {"messages": [{"id": "f6d39b5e-6393-4a31-82eb-5406d62014e2", "message": "Israeli strikes kill five at hospital, Gaza officials say, after abortive talksreuters_tickers4 minutesBy Nidal al-MughrabiCAIRO (Reuters) – An Israeli airstrike hit a tent inside a hospital compound in central Gaza, killing at least five people, bringing the total of Palestinians killed on Sunday to 19, Gaza health officials said, after another round of talks ended without result.\nThe Israeli military said it struck a militant who “conducted terror activities” and that secondary explosions were identified, indicating weapons were present in the area.\nResidents in areas east of the southern Gaza city of Khan Younis and to the north of Rafah, where there was heavy fighting last month, reported receiving evacuation orders from the Israeli military.\nSirens went off in the area of Ashdod, further north than seen in recent weeks, and the Israeli military said five rockets were launched from southern Gaza.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "url": "https://www.swissinfo.ch/eng/israeli-strikes-kill-five-at-hospital,-gaza-officials-say,-after-abortive-talks/85985002", "date": "2024-08-04 11:45", "source": "GDELT"}, {"id": "4107ffcc-5db1-42d3-90c5-a8fd4768f8d7", "message": "The Israeli military said it struck a militant who “conducted terror activities” and that secondary explosions were identified, indicating weapons were present in the area.\nResidents in areas east of the southern Gaza city of Khan Younis and to the north of Rafah, where there was heavy fighting last month, reported receiving evacuation orders from the Israeli military.\nSirens went off in the area of Ashdod, further north than seen in recent weeks, and the Israeli military said five rockets were launched from southern Gaza.\nHaniyeh’s death was one in a series of killings of senior Hamas figures as the Gaza war nears its 11th month.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.", "url": "https://www.theglobeandmail.com/world/article-israeli-strikes-kill-five-in-tent-at-hospital-gaza-officials-say-as/", "date": "2024-08-04 14:00", "source": "GDELT"}], "location": "GAZA", "total_score": 0.4261692381870781, "count": 1, "average_score": 0.4261692381870781, "final_score": 0.4783184667309547}, "7a4f7f0c-f1da-4281-ac3d-f2ff902d25c4": {"messages": [{"id": "7a4f7f0c-f1da-4281-ac3d-f2ff902d25c4", "message": "HOLAN: Two people were killed Sunday and two others wounded in a stabbing attack near Tel Aviv , Israeli medics said, with police reporting a Palestinian suspect was \"neutralised\" and later died in hospital.The Magen David Adom emergency service said in a statement that the \"terrorist attack\" took place in several locations in Holon, a southern suburb of Israel's commercial hub of Tel Aviv.It comes at a moment of heightened tension in Israel and the wider Middle East, nearly 10 months into the Israel-Hamas war in the Gaza Strip.The stabbing suspect, from the Israeli-occupied West Bank, was \"neutralised\" by a police officer who arrived at the scene, the force said in a statement without elaborating.The Shamir Medical Centre said the assailant was pronounced dead shortly after being taken to the hospital near Holon in a critical condition.A 66-year-old woman and a man aged around 80 were badly wounded and died from their injuries shortly after the attack, the Wolfson hospital in the city said.Israeli news website Ynet said the pair, whose ages Magen David Adom earlier gave as 70, were married.Two other men were wounded, the emergency service said.A 68-year-old was in serious condition and a 26-year-old was moderately wounded.\n\"This was a complex and difficult terrorist attack, with the victims located in three different places, around 500 metres (yards) from each other,\" Magen David Adom said.Regional tensions have soared as Iran and Middle East armed groups it backs threatened retaliation for the assassination of Hamas political chief Ismail Haniyeh in Tehran on Wednesday, which they blame on Israel, and an Israeli strike in Beirut hours earlier that killed top Hezbollah commander Fuad Shukr.Israel's National Security Minister Itamar Ben-Gvir visited the scene of Sunday's attack, where he told journalists: \"Our war is not only against Iran, but also here in the streets\".\n\"This is why we have armed the Israeli population with more than 150,000 gun permits,\" said the far-right politician who has loosened gun laws and repeatedly called on ordinary Israelis to carry arms.", "url": "https://timesofindia.indiatimes.com/world/middle-east/two-dead-in-israel-stabbing-assailant-killed-medics/articleshow/112264364.cms", "date": "2024-08-04 13:00", "source": "GDELT"}, {"id": "aff6374d-3ff6-4576-ad6d-f1b50d489842", "message": "The stabbing suspect, from the Israeli-occupied West Bank, was \"neutralised\" by a police officer who arrived at the scene, the force said in a statement without elaborating.\nThe Shamir Medical Centre said the assailant was pronounced dead shortly after being taken to the hospital near Holon in a critical condition.\nA 66-year-old woman and a man aged around 80 were badly wounded and died from their injuries shortly after the attack, the Wolfson hospital in the city said.\nIsraeli news website Ynet said the pair, whose ages Magen David Adom earlier gave as 70, were married.\n\"This was a complex and difficult terrorist attack, with the victims located in three different places, around 500m from each other,\" Magen David Adom said.", "url": "https://www.channelnewsasia.com/world/israel-stabbing-tel-aviv-holon-two-dead-two-injured-middle-east-heightened-tension-4525561", "date": "2024-08-04 14:45", "source": "GDELT"}], "location": "HOLON", "total_score": 0.6641232348029946, "count": 1, "average_score": 0.6641232348029946, "final_score": 0.6448862643620962}, "f0cb41d7-756d-4103-aea6-85f89de122c1": {"messages": [{"id": "f0cb41d7-756d-4103-aea6-85f89de122c1", "message": "Lebanon's Iran-backed Hezbollah movement, which has traded near-daily fire with Israeli forces since the Gaza war broke out in October, announced its fighters had fired a barrage of rockets at Israel's north overnight.\nThe Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance, Canada and Jordan were among the latest governments to issue calls for their citizens to leave Lebanon.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck \"approximately 50 terror targets throughout the Gaza Strip\" in the past 24 hours.", "url": "https://www.voanews.com/a/foreign-nationals-told-to-leave-lebanon-as-war-fears-surge-/7729252.html", "date": "2024-08-04 12:30", "source": "GDELT"}, {"id": "b282bffb-b7fb-4893-98a7-9429faaa5c79", "message": "(Representational)Urgent calls for foreign nationals to leave Lebanon grew on Sunday with France warning of \"a highly volatile\" situation as Iran and its allies ready their response to high-profile killings blamed on Israel.\nThe Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance on Sunday also urged its nationals living in Iran to \"temporarily leave\", warning Iranian airspace and airports could close.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military was \"determined to continue fighting until we fundamentally change the security situation in the north\", said Home Front Command chief Rafi Gilo.", "url": "https://www.ndtv.com/world-news/highly-volatile-situation-foreign-nationals-urged-to-leave-lebanon-6261722", "date": "2024-08-04 13:00", "source": "GDELT"}], "location": "The main event takes place in Lebanon.", "total_score": 0.591998948173647, "count": 1, "average_score": 0.591998948173647, "final_score": 0.5943992637215528}, "86d0dd59-6e7f-4751-b5ed-dc807b608540": {"messages": [{"id": "86d0dd59-6e7f-4751-b5ed-dc807b608540", "message": "Palestinian kills two, wounds two in stabbing attack in IsraelWorld World Palestinian kills two, wounds two in stabbing attack in IsraelThe stabbings took place during morning rush hour in the city of Holon, just outside Tel AvivFollow on Updated On: Sun, 04 Aug 2024 15:11:47 PKTHOLON, Israel (Reuters) – A Palestinian attacker killed two people and wounded two others in a stabbing spree in central Israel on Sunday before being shot dead by police, Israeli authorities said.\nThe stabbings took place during morning rush hour in the city of Holon, near Tel Aviv.\nTwo senior citizens, a man and woman, were killed and two other people were wounded and rushed to hospital, medical officials said.\nThe Islamist group Hamas, which is at war with Israel in Gaza, said in a statement that the stabbing attack was a \"natural response\" to Israeli attacks on Palestinians and to the assassination of the group's leader, Ismail Haniyeh, last week in Tehran.\nHowever, it stopped short of claiming responsibility for Sunday's attack.", "url": "https://dunyanews.tv/en/World/828558-palestinian-kills-two-wounds-two-in-stabbing-attack-in-israel", "date": "2024-08-04 11:30", "source": "GDELT"}, {"id": "78218aa2-9e0c-4f24-9b4a-7799c214b072", "message": "The stabbing attack was a \"natural response\" to Israeli attacks on Palestinians, said HamasA Palestinian attacker killed two people and wounded two others in a stabbing spree in central Israel on Sunday before being shot dead by police, Israeli authorities said.\nThe attacker stabbed people near a gas station and a park, Israel's ambulance service said.\nA police statement said police were present in force at the scene and were \"conducting extensive searches with a helicopter and additional resources\".\nThe Islamist group Hamas, which is at war with Israel in Gaza, said in a statement that the stabbing attack was a \"natural response\" to Israeli attacks on Palestinians and to the assassination of the group's leader, Ismail Haniyeh, last week in Tehran.\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)", "url": "https://www.ndtv.com/world-news/2-stabbed-to-death-in-israel-hamas-calls-it-natural-response-to-attacks-6261833", "date": "2024-08-04 15:30", "source": "GDELT"}], "location": "HOLON, Israel", "total_score": 0.5435105691272675, "count": 1, "average_score": 0.5435105691272675, "final_score": 0.5604573983890873}, "91898c84-ed0d-401c-9d1a-494053b19e9e": {"messages": [{"id": "91898c84-ed0d-401c-9d1a-494053b19e9e", "message": "Urgent calls for foreign nationals to leave Lebanon grew on Sunday with France warning of \"a highly volatile\" situation as Iran and its allies ready their response to high-profile killings blamed on Israel.\nThe Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance, Canada and Jordan were among the latest governments to issue calls for their citizens to leave Lebanon.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck \"approximately 50 terror targets throughout the Gaza Strip\" in the past 24 hours.", "url": "https://www.al-monitor.com/originals/2024/08/foreign-nationals-told-leave-lebanon-war-fears-surge", "date": "2024-08-04 14:00", "source": "GDELT"}, {"id": "be06419e-26e1-4c9d-a9ec-84ff94570eab", "message": "The Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance on Sunday also urged its nationals living in Iran to \"temporarily leave\", warning Iranian airspace and airports could close.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck \"approximately 50 terror targets throughout the Gaza Strip\" in the past 24 hours.\nThe Israeli military was \"determined to continue fighting until we fundamentally change the security situation in the north\", said Home Front Command chief Rafi Gilo.", "url": "https://www.yahoo.com/news/foreign-nationals-told-leave-lebanon-115004076.html", "date": "2024-08-04 12:30", "source": "GDELT"}, {"id": "f42de1e3-2bcb-4e23-926a-9092a9cec754", "message": "The Israeli military said 30 projectiles were launched from Lebanon, with most of them intercepted.\nFrance on Sunday also urged its nationals living in Iran to “temporarily leave”, warning Iranian airspace and airports could close.\nIsrael, accused by Hamas, Iran and others of carrying out the attack that killed Haniyeh, has not directly commented on it.\nThe Israeli military said its air forces had struck “approximately 50 terror targets throughout the Gaza Strip” in the past 24 hours.\nThe Israeli military was “determined to continue fighting until we fundamentally change the security situation in the north”, said Home Front Command chief Rafi Gilo.", "url": "https://www.scmp.com/news/world/middle-east/article/3273161/foreign-nationals-told-leave-lebanon-war-fears-surge", "date": "2024-08-04 13:30", "source": "GDELT"}], "location": "LEBANON", "total_score": 1.2141555777796298, "count": 2, "average_score": 0.6070777888898149, "final_score": 0.6349544522228704}, "bd636bc5-b04a-4fde-86a2-c8274883d96b": {"messages": [{"id": "bd636bc5-b04a-4fde-86a2-c8274883d96b", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "url": "https://www.theargus.co.uk/news/national/24496249.18-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "date": "2024-08-04 14:00", "source": "GDELT"}, {"id": "5afcebdd-5a3c-41f4-adf3-8263d376d3bd", "message": "Both were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nGaza's Health Ministry does not differentiate between civilians and militants in its tallies.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nIsrael's massive offensive launched in Gaza has killed at least 39,550 Palestinians, according to the territory's Health Ministry, which does not say how many were militants.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "url": "https://www.nbclosangeles.com/news/national-international/israeli-strikes-on-gaza-kill-at-least-12-after-knife-attack-in-tel-aviv-leaves-2-dead/3478090/", "date": "2024-08-04 09:45", "source": "GDELT"}], "location": "GAZA CITY", "total_score": 0.5935259105775286, "count": 1, "average_score": 0.5935259105775286, "final_score": 0.59546813740427}, "43c8d58b-e233-41ae-bfba-4d4b5e9d3ddc": {"messages": [{"id": "43c8d58b-e233-41ae-bfba-4d4b5e9d3ddc", "message": "Israeli airstrikes struck a tent camp in Gaza and left 18 Palestinians killed and dozens wounded, according to the Palestinian Ministry of Health.\nIsraeli air strikes have killed 18 people in Gaza, including four who were sheltering at a camp housing displaced people inside a hospital complex, while a stabbing attack carried out by a Palestinian killed two people in a Tel Aviv suburb.\nA woman (70s) and a man (80s) were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7th attack in Israel.\nIsraeli police inspect the scene of the knife attack in Tel Aviv.", "url": "https://www.irishtimes.com/world/middle-east/2024/08/04/israel-hamas-war-gaza-latest-news/", "date": "2024-08-04 10:30", "source": "GDELT"}, {"id": "92ab7c37-780d-430e-a429-9271301fe1f9", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "url": "https://www.wcti12.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "date": "2024-08-04 19:00", "source": "GDELT"}], "location": "GAZA", "total_score": 0.694055680121671, "count": 1, "average_score": 0.694055680121671, "final_score": 0.6658389760851696}, "0d325e1d-9e7d-43eb-a4eb-1bc3a9a87476": {"messages": [{"id": "0d325e1d-9e7d-43eb-a4eb-1bc3a9a87476", "message": "JERUSALEM – Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\nIran and its allies have blamed Israel and threatened retaliation, raising fears of an even more destructive regional war.\nRecommended Videos“The state of Israel is in a multi-front war,” Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "url": "https://www.wsls.com/news/world/2024/08/04/a-woman-was-killed-and-3-others-were-wounded-in-a-stabbing-attack-in-israel/", "date": "2024-08-04 10:45", "source": "GDELT"}, {"id": "69014a6f-2ece-4ddb-b77c-dbc84b8bcd2c", "message": "Israeli strikes killed 18 people in Gaza early Sunday, including four Palestinians in a tent camp inside a hospital complex, while a stabbing attack by a Palestinian killed two people in a Tel Aviv suburb.\n\"The state of Israel is in a multi-front war,\" Israeli Prime Minister Benjamin Netanyahu told a Cabinet meeting, and said the country was ready for any scenario in defense or attack.\nPalestinian militants in Gaza fired at least five projectiles at Israeli communities near the border without causing casualties or damage, the military said.\nIsrael's massive offensive in response has killed at least 39,580 Palestinians, according to Gaza's Health Ministry, which does not distinguish between civilians and combatants.\nIn the occupied West Bank, over 590 Palestinians have been killed by Israeli fire since the war in Gaza began, according to the Palestinian Health Ministry.", "url": "https://katu.com/news/nation-world/israeli-strikes-on-gaza-kill-18-palestinian-stabs-2-in-tel-aviv-hamas-terrorists-iran-middle-east-war", "date": "2024-08-04 18:15", "source": "GDELT"}], "location": "GAZA", "total_score": 0.3041092456285732, "count": 1, "average_score": 0.3041092456285732, "final_score": 0.39287647194000125}, "1a02d8e8-15de-40a1-90be-82e2e71510ed": {"messages": [{"id": "1a02d8e8-15de-40a1-90be-82e2e71510ed", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nAn Israeli strike on a school-turned-shelter in Gaza City on Saturday killed at least 16 people and wounded another 21, according to Gaza’s Health Ministry, which announced the toll on Sunday.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "url": "https://www.thetelegraphandargus.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "date": "2024-08-04 09:45", "source": "GDELT"}, {"id": "abdf002b-fa86-455a-ae9e-600ee85d9397", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry.", "url": "https://www.npr.org/2024/08/04/g-s1-15285/strikes-on-gaza-kill-12-and-stabbing-in-israel-kills-2", "date": "2024-08-04 09:45", "source": "GDELT"}], "location": "GAZA.", "total_score": 0.46799651097588835, "count": 1, "average_score": 0.46799651097588835, "final_score": 0.5075975576831219}, "b5dcaeca-f2d9-4c2b-8bf1-cf41b3fb3877": {"messages": [{"id": "b5dcaeca-f2d9-4c2b-8bf1-cf41b3fb3877", "message": "An Israeli woman was killed and three others were injured in a terror stabbing attack in Israel’s Holon on Sunday morning, The Times of Israel reported, citing police and medics.\nMagen David Adom ambulance service medics said, “This was a complex and difficult terror attack, the casualties were at three separate locations, approximately 500 meters from each other,” The Times of Israel reported.\nOn July 31, the Islamic Revolutionary Guard Corps (IRGC) said that Hamas political bureau chief Ismail Haniyeh was killed in an attack in Tehran.\nSince then, 24 Israelis, including security personnel, have been killed in Palestinian terror attacks in Israel and the West Bank, including in Sunday’s attack, the report said.\nFurthermore, five Israeli security forces members were killed in clashes with terror operatives in the West Bank.", "url": "https://www.newsx.com/world/woman-killed-three-injured-in-terror-stabbing-attack-in-holon/", "date": "2024-08-04 10:30", "source": "GDELT"}, {"id": "411edcc3-a04b-4433-8e9e-dfeb7a5aea34", "message": "An Israeli woman was killed and three others were injured in a terror stabbing attack in Israel's Holon on Sunday morning, The Times of Israel reported, citing police and medics.\nMagen David Adom ambulance service medics said, \"This was a complex and difficult terror attack, the casualties were at three separate locations, approximately 500 meters from each other,\" The Times of Israel reported.\nThe first victim was stabbed at the entrance to a park on Moshe Dayan Street, where the woman was killed and the man (68) was seriously injured, The Times of Israel reported.\nPolice further said they were carrying out the search in the area for possible additional suspects who were involved in the area, The Times of Israel reported.\nSince then, 24 Israelis, including security personnel, have been killed in Palestinian terror attacks in Israel and the West Bank, including in Sunday's attack, the report said.", "url": "https://news.webindia123.com/news/Articles/World/20240804/4221774.html", "date": "2024-08-04 09:45", "source": "GDELT"}], "location": "Israel", "total_score": 0.45445468509984643, "count": 1, "average_score": 0.45445468509984643, "final_score": 0.4981182795698925}, "659f76cc-15da-4fba-a9b1-cc02c331969b": {"messages": [{"id": "659f76cc-15da-4fba-a9b1-cc02c331969b", "message": "Yemen’s Houthi rebels have claimed responsibility for a missile attack on the cargo ship Groton in the Gulf of Aden, marking their first such strike since recent Israeli actions in Hodeida.\nREUTERS/File PhotoYemen’s Houthi rebels on Sunday claimed a strike on a cargo ship in the Gulf of Aden in the first such attack since Israel struck the rebel-controlled Hodeida port last month.\nAdvertisementBritish maritime security agency UKMTO and maritime security firm Ambrey said the Liberian-flagged Groton was struck twice by missiles near the coast of Aden.\nThe Houthis have attacked at least 88 commercial ships, according to the Washington Institute fro Near East Policy.\nIn an attempt to halt the attacks, American and British forces have carried out strikes on Houthi positions in Yemen since January 12.", "url": "https://www.firstpost.com/world/missile-attack-by-houthi-rebels-hits-cargo-ship-near-aden-port-13800830.html", "date": "2024-08-04 18:45", "source": "GDELT"}, {"id": "04c3f311-56a9-4e17-be21-0766b8628d45", "message": "Yemen’s Houthi rebels on Sunday claimed a strike on a cargo ship in the Gulf of Aden in the first such attack since Israel struck the rebel-controlled Hodeida port last month.\nBritish maritime security agency UKMTO and maritime security firm Ambrey said the Liberian-flagged Groton was struck twice by missiles near the coast of Aden.\nHouthi supporters during a protest following the death of Hamas and Hezbollah leaders in Sana’a, Yemen on Friday.\nHouthi military spokesman Yahya Saree speaks at a rally against the US and Israel in Sanaa, Yemen last month.\nIn an attempt to halt the attacks, American and British forces have carried out strikes on Houthi positions in Yemen since January 12.", "url": "https://www.scmp.com/news/world/middle-east/article/3273166/missile-attack-yemens-houthi-rebels-hits-container-ship-first-attack-2-weeks", "date": "2024-08-04 15:45", "source": "GDELT"}], "location": "ADDIS ABABA", "total_score": 0.4699111757361192, "count": 1, "average_score": 0.4699111757361192, "final_score": 0.5089378230152835}, "66aa27f8-dffc-41b0-a4d7-6c1e91ad9ea7": {"messages": [{"id": "66aa27f8-dffc-41b0-a4d7-6c1e91ad9ea7", "message": "The Palestinians report that the death toll in the attack on the two schools - \"Hassan Salame\" and \"Nasser\" in the west of Gaza City has risen to 30.", "url": "https://abualiexpress.com/en/en31789/", "date": "2024-08-04 14:53", "source": "Telegram"}, {"id": "28177838-6106-41b8-b129-1370dc3a41da", "message": "The spokesman for the Civil Defense in Gaza reports five deaths in the attack on the school named after \"Hassan Salame\" in the Nasser neighborhood in the west of Gaza City.", "url": "https://abualiexpress.com/en/en31783/", "date": "2024-08-04 13:11", "source": "Telegram"}], "location": "Based on the text, the most specific location where the attack happened is Gaza City, Palestine.", "total_score": 0.6239888776541962, "count": 1, "average_score": 0.6239888776541962, "final_score": 0.6167922143579373}}