{"88f5b014-282d-44b2-9a1f-4663746033c3": {"messages": [{"id": "88f5b014-282d-44b2-9a1f-4663746033c3", "message": "Palestinian authorities said five people were killed in Israeli strikes in the West Bank city of Jenin as people and emergency services attended the aftermath on Friday.\nThe Israeli military said it was conducting counterterrorism activity that included an airstrike in Jenin.\nThe military said Israeli soldiers had “encircled a building where terrorists have barricaded themselves in” and the soldiers were exchanging fire, while an airstrike had “struck several armed terrorists” in the area.\nThe clashes in Jenin, a known stronghold of resistance fighters, came a day after an Israeli anti-settlement monitoring group said the government plans to build nearly 5,300 new homes in settlements in the occupied West Bank.\nViolence has spiraled in the West Bank since the start of Israel’s war on Gaza.", "url": "https://www.africanews.com/2024/07/05/at-least-five-killed-in-israeli-attack-on-occupied-west-bank-city/", "date": "2024-07-05 15:30", "source": "GDELT"}, {"id": "b07494e9-e0d6-42b1-ae41-2ac51af2dece", "message": "7 Palestinians killed in West Bank by an Israeli raid and airstrike in the Jenin areaWorld World 7 Palestinians killed in West Bank by an Israeli raid and airstrike in the Jenin area7 Palestinians killed in West Bank by an Israeli raid and airstrike in the Jenin areaFollow on Published On: Fri, 05 Jul 2024 23:08:50 PKTJERUSALEM (AP) — Palestinian authorities say seven people were killed Friday during an Israeli military operation in the area of the West Bank city of Jenin, where the Israeli military said it had been carrying out “counterterrorism activity” that included an airstrike.\nThe clashes in Jenin, a known militant stronghold where the army frequently operates, came a day after an Israeli anti-settlement monitoring group said the government plans to build nearly 5,300 new homes in settlements in the occupied West Bank.\nThe construction plans revealed by the Peace Now group are part of the hard-line government’s efforts to beef up settlements as part of a strategy of cementing Israel’s control over the West Bank to prevent a future Palestinian state.\nThe Palestinians seek the West Bank, east Jerusalem and Gaza — areas captured by Israel in the 1967 Mideast war — for an independent state.\nIn Gaza, the war has so far killed more than 38,000 Palestinians, Gaza’s Health Ministry says.", "url": "https://dunyanews.tv/en/World/822557-7-Palestinians-killed-in-West-Bank-by-an-Israeli-raid-and-airstrike-in-t", "date": "2024-07-05 19:30", "source": "GDELT"}, {"id": "62025587-2f58-43cd-840b-a4ff490021c8", "message": "Smoke rises during an Israeli military operation in the West Bank city of Jenin, Friday, July 5, 2024.\nThe Israeli military said Friday it was conducting counterterrorism activity that included an airstrike in the area of the West Bank city of Jenin.\n(Majdi Mohammed/AP)JERUSALEM — Palestinian authorities say seven people were killed Friday during an Israeli military operation in the area of the West Bank city of Jenin, where the Israeli military said it had been carrying out “counterterrorism activity” that included an airstrike.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nThe dead also include bystanders and Palestinians killed in attacks by Jewish settlers.", "url": "https://www.stripes.com/theaters/middle_east/2024-07-05/israel-hamas-war-raid-jenin-palestinians-killed-14393786.html", "date": "2024-07-05 16:00", "source": "GDELT"}], "location": "The West Bank city of Jenin.", "total_score": 1.3596049491124091, "count": 2, "average_score": 0.6798024745562046, "final_score": 0.6858617321893432}, "31dccc6f-1824-4bb0-8d68-113be16ad491": {"messages": [{"id": "31dccc6f-1824-4bb0-8d68-113be16ad491", "message": "The Israel Defense Forces (IDF) said in a statement that about 160 rockets and missiles, as well as more than 15 drones, were fired at northern Israel.\n\"The IDF is currently striking launch posts in southern Lebanon,\" read the statement.\nMeanwhile, Hezbollah confirmed earlier in the day that it attacked several Israeli sites in response to Israel's assassination of a senior commander, Mohammad Naameh Nasser, in Lebanon's southwest city of Tyre.\nTensions along the Lebanon-Israel border escalated on Oct. 8, 2023, following a barrage of rockets launched by Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "url": "http://en.ce.cn/main/latest/202407/05/t20240705_39060936.shtml", "date": "2024-07-05 06:15", "source": "GDELT"}, {"id": "4b36514e-3e3f-4e03-baca-627e67273c47", "message": "Israel launches airstrikes on S. Lebanon after Hezbollah's retaliatory attacksXinhua) 09:26, July 05, 2024This photo posted on social media shows Israeli air defense systems launched for interception in northern Israel on July 4, 2024.\nThe Israel Defense Forces (IDF) said in a statement that about 160 rockets and missiles, as well as more than 15 drones, were fired at northern Israel.\nTensions along the Lebanon-Israel border escalated on Oct. 8, 2023, following a barrage of rockets launched by Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.\nThis photo posted on social media shows Israeli air defense systems launched for interception in northern Israel on July 4, 2024.", "url": "http://en.people.cn/n3/2024/0705/c90000-20189919.html", "date": "2024-07-05 02:15", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.5805865932647523, "count": 1, "average_score": 0.5805865932647523, "final_score": 0.5864106152853266}, "8bc43023-5ec3-4725-ae9f-1778e757860d": {"messages": [{"id": "8bc43023-5ec3-4725-ae9f-1778e757860d", "message": "Fighters from the Lebanese Hezbollah resistance movement have conducted new operations against Israeli military targets in reprisal for the regime's assassination of a top commander of Hezbollah in southern Lebanon.\nHezbollah also published video footage of its strikes on Israeli military barracks and bases in the occupied Syrian Golan Heights as well as in northern occupied Palestinian lands.\nOn Thursday, the resistance group said it launched more than 200 rockets and drones targeting Israeli military positions in response to the assassination.\nIsraeli army officer killed in Hezbollah rocket fireLater on Thursday, the Israeli military said in a press statement that an officer had been killed in Hezbollah rocket fire.\n‘Hezbollah response to Israeli assassinations beyond expectations’Meanwhile, a Lebanese lawmaker from the political wing of Hezbollah has warned of surprises in retaliation for the assassination of the resistance group’s commanders.", "url": "http://www.presstv.ir/Detail/2024/07/05/728731/Hezbollah-launches-fresh-attacks-on-Israeli-outposts-over-commander", "date": "2024-07-05 09:15", "source": "GDELT"}, {"id": "46b9b3cd-1012-40de-912d-0bf603109ab3", "message": "Lebanon’s resistance movement Hezbollah has conducted new military operations against Israel amid rising tensions along Lebanon’s southern borders.\nSeveral launches from Lebanon were identified in different areas of the Upper Galilee, Israeli sources said, claiming that some of them were intercepted.\nHezbollah also published video footage of its strikes on Israeli military barracks and bases in the occupied Syrian Golan Heights as well as in northern occupied Palestinian lands.\nOn Thursday, the resistance group said it launched more than 200 rockets and drones targeting Israeli military positions in response to the assassination.\nIsrael and Hezbollah have exchanged fire on an almost daily basis since Israel launched its genocidal war on Gaza.", "url": "http://www.presstv.ir/Detail/2024/07/05/728785/Hezbollah-conducts-new-operations-against-Israel", "date": "2024-07-06 00:00", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.5753569756554306, "count": 1, "average_score": 0.5753569756554306, "final_score": 0.5827498829588015}, "4310ac59-f570-48e1-bce7-cde4bb92fa45": {"messages": [{"id": "4310ac59-f570-48e1-bce7-cde4bb92fa45", "message": "On Thursday, Day 272 of the Israeli genocide of the Palestinians in the destroyed Gaza Strip, the Israeli army continued the bombing and shelling of various parts of the coastal enclave, killing and wounding dozens of Palestinians, including many children and women.\nIn the Daraj neighborhood in Gaza City, the army fired a missile at a home, killing at least two Palestinians and wounding more than six.\nIn addition, the army destroyed the historic gold market, one of the last remaining prominent landmarks in Gaza, after firing many missiles at it.\nAlso, PRCS medics retrieved the bodies of two Palestinian children and evacuated two wounded residents, including children and women, after the army fired a missile at a house on Yaffa Street, in Gaza City.\nOn December 6, 2023, he was assassinated in an Israeli airstrike along with his brother, sister, and their children in Israel’s ongoing genocidal siege of Gaza of 2023.", "url": "https://imemc.org/article/day-272-update-ongoing-bombing-across-gaza-dozens-killed/", "date": "2024-07-05 03:00", "source": "GDELT"}, {"id": "ca0329a0-f1fa-4928-95d4-2efc49cc0716", "message": "On Friday, Day 273 of the ongoing Israeli genocide of the Palestinians in several areas of the devastated, starved, and destroyed Gaza Strip, the Israeli army continued the bombing and shelling of various parts of the coastal enclave, killing and wounding dozens of Palestinians, including women, children, and journalists.\n|Earlier Article: Day 273: Israeli Army Kills Dozens In Gaza|The army also fired a missile at a home for the Midwekh family in the Sahaba area in the Daraj neighborhood in Gaza City, killing five Palestinians and wounding many others.\nIn addition, five Palestinians were killed, and many were injured when the army fired missiles at homes in the Zeitoun neighborhood in Gaza City.\nLiyan, Suar, and Abdulrahman Al-Khatib pic.twitter.com/yZkrZ1YP3J — Gaza Notifications (@gazanotice) July 6, 2024In northern Gaza, the army fired missiles at a UNRWA school sheltering hundreds of displaced Palestinian families, causing dozens of casualties, and displacing, yet again, the families including dozens of children and women.\nAl-Nijmeh intersection in Rafah, before being detonated by Israeli occupation forces, despite not posing any threats to their forces.", "url": "https://imemc.org/article/day-273-update-israeli-missiles-kill-dozens-across-the-gaza-strip/", "date": "2024-07-06 02:30", "source": "GDELT"}], "location": "GAZA CITY, Gaza Strip.", "total_score": 0.5810356057316544, "count": 1, "average_score": 0.5810356057316544, "final_score": 0.586724924012158}, "38641453-0e31-43d8-bcc8-6bce9ab0c696": {"messages": [{"id": "38641453-0e31-43d8-bcc8-6bce9ab0c696", "message": "Nasser Hospital sits in the western part of the city, which is inside the Israeli-designated humanitarian \"safe zone\" where Palestinians have been told to go, according to maps provided by Israel's military.\nThe latest Israeli evacuation order affected about 250,000 people earlier this week across wide swathes of Gaza, the United Nations estimated.\nWednesday's airstrike hit an area that also includes a school-turned-shelter for displaced people, many of whom are living in makeshift tents.\nThe Israeli military did not immediately comment on the strike.\nThe Israeli military said Tuesday it estimates at least 1.8 million Palestinians are now in the humanitarian zone it declared, covering a stretch of about 14 kilometers (8.6 miles) along the Mediterranean.", "url": "https://naharnet.com/stories/en/306358-life-and-death-in-gaza-s-safe-zone-where-food-is-scarce-and-israel-strikes-without-warning", "date": "2024-07-05 14:30", "source": "GDELT"}, {"id": "869df97a-db03-48ff-806a-2efcd754a482", "message": "An Israeli airstrike slammed into a residential building next to the main medical center in Gaza’s southern city of Khan Younis, wounding at least seven people, hospital authorities and witnesses said Wednesday.\nNasser Hospital sits in the western part of the city, which is inside the Israeli-designated humanitarian “safe zone” where Palestinians have been told to go, according to maps provided by Israel’s military.\nThe latest Israeli evacuation order affected about 250,000 people earlier this week across wide swathes of Gaza, the United Nations estimated.\nAn Israeli airstrike Tuesday killed a prominent Palestinian doctor and eight members of his extended family, just hours after they complied with military orders to evacuate their home and moved to the Israeli-designated safe zone.\nThe Israeli military said Tuesday it estimates at least 1.8 million Palestinians are now in the humanitarian zone it declared, covering a stretch of about 14 kilometers 8.6 miles along the Mediterranean.", "url": "http://www.surinametimes.com/life-and-death-in-gazas-safe-zone-where-food-is-scarce-and-israel-strikes-without-warning/", "date": "2024-07-05 00:00", "source": "GDELT"}], "location": "Gaza City", "total_score": 0.44763178424161376, "count": 1, "average_score": 0.44763178424161376, "final_score": 0.4933422489691296}, "743da578-338f-41e7-bcc7-d8c214456258": {"messages": [{"id": "743da578-338f-41e7-bcc7-d8c214456258", "message": "LOS ANGELES, July 5 (Xinhua) -- Two people were killed and three others injured in a stabbing attack on July 4th in Huntington Beach, a seaside city in Southern California, authorities said on Friday.\nPolice officers responded to a report of an assault with a deadly weapon near 16th Street and Pecan Avenue at about... read full story\"As a result of this incident, unfortunately 2 individuals succumbed to their injuries.\nAn additional 3 individuals were transported to a local area hospital with non-life threatening injuries,\"", "url": "https://article.wn.com/view/2024/07/05/2_killed_3_injured_in_Southern_California_stabbing_on_US_Ind/", "date": "2024-07-05 19:30", "source": "GDELT"}, {"id": "ec7ece9b-d8d0-4197-af5d-ba2ef2db4219", "message": "LOS ANGELES, July 5 (Xinhua) -- Two people were killed and three others injured in a stabbing attack on July 4th in Huntington Beach, a seaside city in Southern California, authorities said on Friday.\nAn additional 3 individuals were transported to a local area hospital with non-life threatening injuries,\" said the police department.\nWitnesses told the news outlet that a man pulled up to the group in a vehicle, got out of a car and started stabbing people on the sidewalk.\nTwo men who were part of the gathering tackled the assailant and held him until police arrived, said the report, citing authorities.\nOfficials said that they have \"no reason to believe there is any further public safety threat related to this incident.\"", "url": "https://english.news.cn/northamerica/20240706/fec9e9e97abc49789f6166bb2d8d1b78/c.html", "date": "2024-07-05 22:15", "source": "GDELT"}], "location": "HUNTINGTON BEACH", "total_score": 0.5642009132420092, "count": 1, "average_score": 0.5642009132420092, "final_score": 0.5749406392694064}, "3ed5949b-ecf9-4707-848d-eb4e26482613": {"messages": [{"id": "3ed5949b-ecf9-4707-848d-eb4e26482613", "message": "A barrage of rockets was fired on Friday evening from Lebanon towards northern Israel, triggering sirens in Kiryat Shmona and the area shortly before 7:00 p.m.Several rockets hit the city of Kiryat Shmona, with one of them directly hitting a building and causing a fire.\nThe IDF Spokesperson’s Unit said, “Over the last few hours, several projectiles were identified crossing from Lebanon toward several areas in northern Israel.\nAs a result of the projectile attack toward Kiryat Shmona, two IDF soldiers were lightly injured and were evacuated to the hospital to receive medical treatment.\nOn Thursday, a barrage of more than 200 rockets and dozens of UAVs was fired by Hezbollah terrorists towards northern Israel.\n(Israel National News' North American desk is keeping you updated until the start of Shabbat in New York.", "url": "https://www.israelnationalnews.com/news/392616", "date": "2024-07-05 19:45", "source": "GDELT"}, {"id": "d85e799a-2cca-413b-9719-5a41bc8ccf5b", "message": "US Defense Secretary Lloyd Austin spoke by phone on Friday with Defense Minister Yoav Gallant, the Pentagon said in a statement.\nOn Friday, Hezbollah terrorists fired a barrage of rockets at Kiryat Shmona and the area.\nSeveral rockets hit the city of Kiryat Shmona, with one of them directly hitting a building and causing a fire.\nThe IDF said that as a result of the projectile attack toward Kiryat Shmona, two IDF soldiers were lightly injured and were evacuated to the hospital to receive medical treatment.\n(Israel National News' North American desk is keeping you updated until the start of Shabbat in New York.", "url": "https://www.israelnationalnews.com/news/392621", "date": "2024-07-05 23:00", "source": "GDELT"}], "location": "Israel", "total_score": 0.4998013833068511, "count": 1, "average_score": 0.4998013833068511, "final_score": 0.5298609683147958}, "e1ed2b39-9170-4ffb-bbfe-5fe001900d10": {"messages": [{"id": "e1ed2b39-9170-4ffb-bbfe-5fe001900d10", "message": "Tragedy struck the Russian-controlled town of Volnovakha, Donetsk, when Ukrainian army shelling resulted in the deaths of two people, according to Denis Pushilin, the Russian-installed regional head.\nAn additional fifteen people, including a teenager and two employees of Russia's Emergencies Ministry, were wounded in the attack.\nPushilin mentioned that U.S.-supplied HIMARS rockets and drones were used.\nThe attack left several residential buildings damaged.\nImages and videos from Russian army news outlet Zvezda depicted the aftermath, but Reuters has not independently verified these accounts and Ukraine has yet to comment.", "url": "https://www.devdiscourse.com/article/law-order/3006847-tragedy-strikes-volnovakha-ukrainian-shelling-claims-lives", "date": "2024-07-05 14:15", "source": "GDELT"}, {"id": "0d8fa48f-14a7-4fe6-b7b0-2d5acbbae081", "message": "Two killed in Ukrainian strike on Donetsk region, Russian-backed official says1 minuteMOSCOW (Reuters) – Two people were killed by Ukrainian army shelling of the Russian-controlled town of Volnovakha in Donetsk, eastern Ukraine, Denis Pushilin, the Russian-installed regional head, said on Friday.\nAn additional fifteen people, including a teenage girl and two employees of Russia’s Emergencies Ministry, were wounded, Pushilin said.\nHe said U.S.-supplied HIMARS rockets and drones had been used in the attack, which damaged seven residential buildings in multiple settlements.\nVideo and pictures published by Russian army news outlet Zvezda showed a woman covered in blood lying on the ground next to a car, as well as a bus and several buildings with their windows shattered.\nReuters could not independenly verify that had happened and there was no immediate comment from Ukraine.", "url": "https://www.swissinfo.ch/eng/two-killed-in-ukrainian-strike-on-donetsk-region%2c-russian-backed-official-says/82808240", "date": "2024-07-05 14:15", "source": "GDELT"}], "location": "VOLNOVAKHA.", "total_score": 0.596596626816407, "count": 1, "average_score": 0.596596626816407, "final_score": 0.5976176387714849}, "3a48c48c-3c23-4d23-9e2c-6e3e4a113aaf": {"messages": [{"id": "3a48c48c-3c23-4d23-9e2c-6e3e4a113aaf", "message": "(MENAFN- UkrinForm) In Dnipro, the death toll from a Russian missile attack on July 3 has risen to eight as a 72-year-old woman died in hospital.\nSerhiy Lysak, the head of the Dnipropetrovsk Regional Military Administration, announced this on Facebook, Ukrinform reports.\nAccording to him, \"another woman who was wounded in Dnipro the day before died in hospital.\nLysak also said that from the Air Command East shot down three Russian Shahed drones in the Dnipropetrovsk region at night.\nAs Ukrinform reported, on the morning of July 3, Russians attacked Dnipro with missiles and drones.", "url": "https://menafn.com/1108409325/Death-Toll-From-Russias-July-3-Missile-Attack-On-Dnipro-Rises-To-Eight", "date": "2024-07-05 05:45", "source": "GDELT"}, {"id": "fa31ac40-40d7-463c-a45e-ec81ae2a9b8d", "message": "(MENAFN- UkrinForm) In Dnipro, the number of of the missile attack carried out by the Russian Federation on July 3 has increased to seven - a 58-year-old woman died in hospital.\nThe head of the Dnipropetrovsk Regional State Administration, Serhii Lysak, reported this onTelegram , Ukrinform reports.\n\"Another loss... A 58-year-old woman died in hospital.\nShe was during yesterday's Russian attack on Dnipro.\nAs Ukrinform reported, on the morning of July 3, Russians attacked Dnipro with missiles and drones.", "url": "https://menafn.com/1108408860/Strike-On-Dnipro-Death-Toll-Rises-To-Seven", "date": "2024-07-05 00:00", "source": "GDELT"}], "location": "Dnipro", "total_score": 0.5075675447365087, "count": 1, "average_score": 0.5075675447365087, "final_score": 0.5352972813155561}, "33982e46-24fd-4295-97c6-1b1f94c8842e": {"messages": [{"id": "33982e46-24fd-4295-97c6-1b1f94c8842e", "message": "Islamabad, July 5 : At least three people were killed and eight others injured when a blast went off in Pakistan's northwest Khyber Pakhtunkhwa province on Friday, the police said.\nThe blast took place on a bridge in the Takht-i-Bahi area of Mardan district of the province, killing three people while injuring eight others, including policemen, District Police Officer Mardan Zahoor Babar Afridi told the media.\nRescue teams, police, and security forces immediately reached the site following the blast and shifted the injured to a nearby hospital.\nThe area has been cordoned off while a search operation is underway to arrest the culprits.\nEarlier on Thursday, five people, including a former member of the Senate, were killed in an explosion in Bajaur district of the province.", "url": "https://www.prokerala.com/news/articles/a1544891.html", "date": "2024-07-05 13:00", "source": "GDELT"}, {"id": "72580384-9065-4c12-92fc-c62e21f16f56", "message": "People gathering at the site of the blast near Jalala bridge in the Takhtbhai area of Mardan, Khyber Pakhtunkhwa, on July 5, 2024.\n— reportersMARDAN: At least three people were killed and seven others injured in a blast near a police van in Mardan, Khyber Pakhtunkhwa (KP) on Friday.\nRescue teams, police and security forces immediately reached the site following the blast and shifted the injured to a nearby hospital.\nThe Mardan District Police Officer (DPO) Zahoor Barbar Afridi confirmed the number of casualties of the bomb blast that targeted police.\nHidayat, who was a former independent senator from erstwhile Federally Administered Tribal Areas (Fata), was killed in the bomb explosion along with four others.", "url": "https://www.thenews.com.pk/latest/1206638-blast-near-police-van-kills-three-in-mardan", "date": "2024-07-05 14:15", "source": "GDELT"}], "location": "Mardan", "total_score": 0.6261721611721611, "count": 1, "average_score": 0.6261721611721611, "final_score": 0.6183205128205128}, "42df7c4e-6d97-4286-9e21-8cba4d716dd8": {"messages": [{"id": "42df7c4e-6d97-4286-9e21-8cba4d716dd8", "message": "This is a locator map for Pakistan with its capital, Islamabad, and the Kashmir region.\n(AP Photo)PESHAWAR, Pakistan (AP) — A roadside bomb planted on a bridge struck a rickshaw in northwest Pakistan on Friday, killing at least three people and wounding seven others, officials said.\nHe said a police vehicle crossing the bridge was the target, but the bomb hit a speeding rickshaw, causing civilian casualties.\nMany TTP leaders and fighters have found sanctuaries and are even living openly in Afghanistan since the Taliban takeover, which also emboldened the TTP.\nPakistan has blamed some attacks on the Islamic State group and some breakaway factions of the TTP, which insists it only targets security forces.", "url": "https://www.yahoo.com/news/roadside-bomb-planted-bridge-hits-083942061.html", "date": "2024-07-05 09:15", "source": "GDELT"}, {"id": "b3432b63-2da7-4677-8c5d-c202b5ad6715", "message": "PESHAWAR, Pakistan (AP) — A roadside bomb planted on a bridge struck a rickshaw in northwest Pakistan on Friday, killing at least two people and wounding eight others, officials said.\nThis is a locator map for Pakistan with its capital, Islamabad, and the Kashmir region.\nWinnipeg Free Press | Newsletter Business Weekly Monday mornings The latest local business news and a lookahead to the coming week.\nMany TTP leaders and fighters have found sanctuaries and are even living openly in Afghanistan since the Taliban takeover, which also emboldened the TTP.\nPakistan has blamed some attacks on the Islamic State group and some breakaway factions of the TTP, which insists it only targets security forces.", "url": "https://www.winnipegfreepress.com/world/2024/07/05/a-roadside-bomb-planted-on-a-bridge-hits-a-rickshaw-in-pakistan-killing-2-people-and-wounding-8", "date": "2024-07-05 09:15", "source": "GDELT"}, {"id": "ce20f417-b7dc-42b9-a643-376b83d116d6", "message": "A roadside bomb planted on a bridge hits a rickshaw in Pakistan, killing 2 people and wounding 8PESHAWAR, Pakistan (AP) — A roadside bomb planted on a bridge struck a rickshaw in northwest Pakistan on Friday, killing at least two people and wounding eight others, officials said.\nThe attack happened in Mardan district in Khyber Pakhtunkhwa province, police official Sabir Khan said.\nHe said police transported the wounded people to a hospital where two were in critical condition.\nMany TTP leaders and fighters have found sanctuaries and are even living openly in Afghanistan since the Taliban takeover, which also emboldened the TTP.\nPakistan has blamed some attacks on the Islamic State group and some breakaway factions of the TTP, which insists it only targets security forces.", "url": "https://infotel.ca/newsitem/as-pakistan-bombing/cp573341952", "date": "2024-07-05 09:15", "source": "GDELT"}], "location": "ISLAMABAD", "total_score": 0.7342177200122086, "count": 2, "average_score": 0.3671088600061043, "final_score": 0.46697620200427303}, "8117f34e-864c-4e50-99ff-5ef7464bfd96": {"messages": [{"id": "8117f34e-864c-4e50-99ff-5ef7464bfd96", "message": "Hezbollah fires 200 rockets at Israel after commander killedLebanese group warns new sites will be targetedFirefighters work after Lebanon's Hezbollah said it launched more than 200 rockets and a swarm of drones at Israeli military sites, near the border between Israel and Lebanon on the Israeli side.\nPhoto: ReutersLaila Bassam Yesterday at 03:30Lebanon’s Hezbollah launched a big rocket and drone attack at Israel yesterday and threatened to hit new targets in retaliation for the killing of a top commander, in the latest surge of violence in the steadily worsening conflict across the border.", "url": "https://www.independent.ie/world-news/middle-east/hezbollah-fires-200-rockets-at-israel-after-commander-killed/a1950212530.html", "date": "2024-07-05 02:30", "source": "GDELT"}, {"id": "2621dcf9-792f-43d5-8d1a-ae67893e7358", "message": "• Sonic booms rattle Beirut, other parts of Lebanon • Five killed in Israeli strike at a Gaza City school BEIRUT: Lebanon’s Hezbollah launched a big rocket and drone attack at Israel on Thursday and threatened to hit new targets in retaliation for the killing of a top commander, in the latest surge of violence in... read full story\"200 projectiles and over 20 suspicious aerial targets were identified crossing from Lebanon into Israeli territory\"", "url": "https://article.wn.com/view/2024/07/05/Hezbollah_rains_200_rockets_on_Israeli_military_sites/", "date": "2024-07-05 03:45", "source": "GDELT"}], "location": "Lebanon-Israel border", "total_score": 0.6683153299304924, "count": 1, "average_score": 0.6683153299304924, "final_score": 0.6478207309513446}, "cbc29181-e7f2-42b0-84cf-743dee870abf": {"messages": [{"id": "cbc29181-e7f2-42b0-84cf-743dee870abf", "message": "BRATISLAVA, Slovakia (AP) — Slovakia’s populist Prime Minister Robert Fico made his first public appearance on Friday since he was seriously wounded in an assassination attempt, attacking his liberal political opponents and praising his Hungarian counterpart.\nFILE - Slovakia's Prime Minister Robert Fico arrives for a cabinet's away-from-home session in the town of Handlova, Slovakia, on May, 15, 2024.\nFico made his first public appearance on Friday July 5, 2024 since he was seriously wounded in an assassination attempt, attacking his liberal political opponents and praising his Hungarian counterpart.\nIn his adress, Fico, who was standing on the stage, attacked what he called liberal and progressivist ideologies and praised Hungary’s Prime Minister Viktor Orbán for his recent trips to Kyiv and Moscow.\nHis critics worry that Slovakia could abandon its pro-Western course and follow the direction of Hungary under Prime Minister Viktor OrbánThousands have repeatedly rallied in the capital and across Slovakia to protest Fico’s policies.", "url": "https://www.winnipegfreepress.com/world/2024/07/05/slovakias-prime-minister-makes-1st-public-appearance-since-assassination-attempt", "date": "2024-07-05 21:45", "source": "GDELT"}, {"id": "599ab6de-7941-4279-8401-d1eb474e490f", "message": "Slovakia’s populist Prime Minister Robert Fico made his first public appearance on Friday since he was seriously wounded in an assassination attempt.\nAdvertisementIn his address Mr Fico, who was standing on the stage, attacked what he called liberal and progressivist ideologies and praised Hungary’s Prime Minister Viktor Orban for his recent trips to Kyiv and Moscow.\nMr Fico ended his country’s military aid for Ukraine after his coalition government was sworn in on October 25.\nHis critics worry that Slovakia could abandon its pro-Western course and follow the direction of Hungary under Mr Orban.\nThousands have repeatedly rallied in the capital and across Slovakia to protest Mr Fico’s policies.", "url": "https://www.breakingnews.ie/world/slovakias-pm-makes-first-public-appearance-since-assassination-attempt-1646564.html", "date": "2024-07-05 22:45", "source": "GDELT"}, {"id": "4b32153b-56be-486e-9279-c3bb77d8f0a6", "message": "Slovakia’s populist Prime Minister Robert Fico made his first public appearance on Friday since he was seriously wounded in an assassination attempt.\nIn his address Mr Fico, who was standing on the stage, attacked what he called liberal and progressivist ideologies and praised Hungary’s Prime Minister Viktor Orban for his recent trips to Kyiv and Moscow.\nMr Fico ended his country’s military aid for Ukraine after his coalition government was sworn in on October 25.\nHis critics worry that Slovakia could abandon its pro-Western course and follow the direction of Hungary under Mr Orban.\nThousands have repeatedly rallied in the capital and across Slovakia to protest Mr Fico’s policies.", "url": "https://www.irishexaminer.com/world/arid-41430988.html", "date": "2024-07-06 00:15", "source": "GDELT"}, {"id": "6539791c-517e-4bc9-a6fa-5157491e2282", "message": "BRATISLAVA, Slovakia (AP) – Slovakia’s populist Prime Minister Robert Fico made his first public appearance on Friday since he was seriously wounded in an assassination attempt, attacking his liberal political opponents and praising his Hungarian counterpart.\nFico ended his country’s military aid for Ukraine after his coalition government was sworn in on Oct. 25.\nHe has long been a divisive figure in Slovakia and beyond.\nHis critics worry that Slovakia could abandon its pro-Western course and follow the direction of Hungary under Prime Minister Viktor OrbánThousands have repeatedly rallied in the capital and across Slovakia to protest Fico’s policies.\nSlovak Gunman Attacked Because of Views on Ukraine War, According to Confession https://t.co/iNd9g0UO2q — Breitbart London (@BreitbartLondon) May 24, 2024", "url": "https://www.breitbart.com/europe/2024/07/06/slovakia-pm-fico-makes-first-public-appearance-since-assassination-attempt/", "date": "2024-07-06 15:00", "source": "GDELT"}], "location": "Bratislava", "total_score": 1.5669171501115335, "count": 3, "average_score": 0.5223057167038445, "final_score": 0.6056140016926912}, "0faf9010-ef01-4f19-bd05-e93b859663bc": {"messages": [{"id": "0faf9010-ef01-4f19-bd05-e93b859663bc", "message": "NEW YORK -- A police officer shot and killed a man who allegedly stabbed an 8-year-old boy to death in Queens on Thursday, the New York City Police Department said.\nPolice said the 20-year-old suspect and the 8-year-old male victim may be brothers or step-brothers.\nPolice say when officers entered the apartment, they found the suspect holding his 43-year-old father at knifepoint.\nThe suspect allegedly refused repeated commands to drop the knife, and an officer then fired one round, striking the suspect, police said.\nOfficers immediately rendered aid, and the suspect was taken to an area hospital, where he died.", "url": "https://www.yahoo.com/news/8-old-stabbed-death-queens-231700416.html", "date": "2024-07-05 01:00", "source": "GDELT"}, {"id": "1a0e54aa-c441-4ea4-818b-8c434126d641", "message": "8-year-old stabbed to death in Queens.\nSuspect fatally shot by police 8-year-old stabbed to death in Queens.\nSuspect fatally shot by police 01:30NEW YORK -- A police officer shot and killed a man who allegedly stabbed an 8-year-old boy to death in Queens on Thursday, the New York City Police Department said.\nPolice said the 20-year-old suspect and the 8-year-old male victim may be brothers or step-brothers.\nThe suspect allegedly refused repeated commands to drop the knife, and an officer then fired one round, striking the suspect, police said.", "url": "https://www.cbsnews.com/news/queens-deadly-stabbing-police-shooting/", "date": "2024-07-05 01:00", "source": "GDELT"}], "location": "QUEENS", "total_score": 0.5158629104992307, "count": 1, "average_score": 0.5158629104992307, "final_score": 0.5411040373494616}, "337ce17e-19f4-44a7-81d2-8fb01453793a": {"messages": [{"id": "337ce17e-19f4-44a7-81d2-8fb01453793a", "message": "Cease-fire talks between Israel and Hamas appear to be reviving after having stalled for weeks, as U.S., Qatari and Egyptian mediators try to overcome differences that have repeatedly thwarted a deal.\nIsrael launched the war in Gaza after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\n— Israel weighs Hamas’ latest response to Gaza cease-fire proposal as diplomatic efforts are revived.\nHezbollah says it will stop its attacks if Israel agrees to a cease-fire with Hamas in its nine-month war in the Gaza Strip.\nViolence has spiraled in the West Bank since the start of Israel’s war against Hamas in Gaza.", "url": "https://wtop.com/national/2024/07/the-latest-hamas-says-it-got-a-positive-response-from-mediators-to-its-cease-fire-amendments/", "date": "2024-07-05 21:45", "source": "GDELT"}, {"id": "89e39266-4ef3-4fd9-826e-9ecec2566788", "message": "Cease-fire talks between Israel and Hamas appear to be reviving after having stalled for weeks, as U.S., Qatari and Egyptian mediators try to overcome differences that have repeatedly thwarted a deal.\nIn the occupied West Bank, Palestinian health officials say an Israeli military operation and airstrike on Friday.\nViolence has surged throughout the West Bank during nearly nine months of war in Gaza.\nIsrael launched the war in Gaza after Hamas’ Oct. 7 attack, in which terrorist stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nThe top U.N. court has concluded there is a “plausible risk of genocide” in Gaza — a charge Israel strongly denies.", "url": "https://katu.com/news/nation-world/hamas-says-its-cease-fire-amendments-met-with-positive-response-as-talks-continue-terrorist-group-israel-war-middle-east-negotiations-humanitarian-crisis-ground-offensives-war-zones-bombardments", "date": "2024-07-06 04:15", "source": "GDELT"}], "location": "GAZA", "total_score": 0.5444930875576037, "count": 1, "average_score": 0.5444930875576037, "final_score": 0.5611451612903227}, "71e45d30-9fc7-4c13-b80d-d0e4a9929619": {"messages": [{"id": "71e45d30-9fc7-4c13-b80d-d0e4a9929619", "message": "Jerusalem -Palestinian authorities say seven people were killed Friday during an Israeli military operation in the area of the West Bank city of Jenin, where the Israeli military said it had been carrying out “counterterrorism activity” that included an airstrike.\nThe Palestinians seek the West Bank, east Jerusalem and Gaza — areas captured by Israel in the 1967 Mideast war — for an independent state.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nThe dead also include bystanders and Palestinians killed in attacks by Jewish settlers.\nIn Gaza, the war has so far killed more than 38,000 Palestinians, Gaza’s Health Ministry says.", "url": "https://www.ctvnews.ca/world/israel-conducts-military-operation-in-the-area-of-the-west-bank-city-of-jenin-7-palestinians-killed-1.6952519", "date": "2024-07-05 15:00", "source": "GDELT"}, {"id": "3f191dfd-1b74-4da0-a06e-f6b1a2f28cdb", "message": "Image-APAn Israeli delegation led by spy chief David Barnea left Doha after meeting with Qatari mediators about Gaza ceasefire talks, a source with knowledge of the talks told Reuters on Friday.\nThe Palestinians seek the West Bank, east Jerusalem and Gaza — areas captured by Israel in the 1967 Mideast war — for an independent state.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nThe dead also include bystanders and Palestinians killed in attacks by Jewish settlers.\nIsraeli negotiators are expected to arrive in Doha, Qatar’s capital, for the talks as early as Friday, with American, Egyptian and Qatari officials present.", "url": "https://www.firstpost.com/world/gaza-ceasefire-talks-israeli-delegation-left-doha-after-meeting-qatari-mediators-13789961.html", "date": "2024-07-05 19:45", "source": "GDELT"}, {"id": "aca386a3-37ed-486d-ab1f-3b295ae7a8e0", "message": "Palestinian authorities say seven people were killed Friday during an Israeli military operation in the area of the West Bank city of Jenin, where the Israeli military said it had been carrying out counterterrorism activity that included an airstrike.\n(AP Photo/Majdi Mohammed)JERUSALEM – Palestinian authorities say seven people were killed Friday during an Israeli military operation in the area of the West Bank city of Jenin, where the Israeli military said it had been carrying out “counterterrorism activity” that included an airstrike.\nThe Palestinians seek the West Bank, east Jerusalem and Gaza — areas captured by Israel in the 1967 Mideast war — for an independent state.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nThe dead also include bystanders and Palestinians killed in attacks by Jewish settlers.", "url": "https://www.clickorlando.com/news/world/2024/07/05/israel-conducts-military-operation-in-the-area-of-the-west-bank-city-of-jenin-5-palestinians-killed/", "date": "2024-07-05 09:00", "source": "GDELT"}, {"id": "c2af268d-fd79-473e-b156-f503052ea3a5", "message": "JERUSALEM (AP) — Palestinian authorities say seven people were killed Friday during an Israeli military operation in the area of the West Bank city of Jenin, where the Israeli military said it had been carrying out “counterterrorism activity” that included an airstrike.\nThe Palestinians seek the West Bank, east Jerusalem and Gaza — areas captured by Israel in the 1967 Mideast war — for an independent state.\nPalestinian first responders work inside a home destroyed in an Israeli military operation in the West Bank city of Jenin, Friday, July 5, 2024.\nThe Israeli military said Friday it was conducting counterterrorism activity that included an airstrike in the area of the West Bank city of Jenin.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.", "url": "https://www.kob.com/news/us-and-world-news/israel-conducts-military-operation-in-the-area-of-the-west-bank-city-of-jenin-5-palestinians-killed/", "date": "2024-07-05 09:00", "source": "GDELT"}, {"id": "1ae09d4e-eefa-4539-8e29-15ea1e2eb50f", "message": "Israeli officials have expressed concern that Hamas will do the same, drawing out the talks and the initial cease-fire indefinitely without releasing the remaining hostages.\nThe Palestinian Health Ministry says over 500 Palestinians have since been killed by Israeli fire in the West Bank.\nThe dead also include bystanders and Palestinians killed in attacks by Jewish settlers.\nIn Gaza, Israeli bombardments and ground offensives have so far killed more than 38,000 Palestinians, Gaza’s Health Ministry says.\nThe top U.N. court has concluded there is a “plausible risk of genocide” in Gaza — a charge Israel strongly denies.", "url": "https://www.boston.com/news/world-news/2024/07/05/israeli-strikes-kill-6-in-gaza-including-kids-and-un-worker-as-truce-talks-show-signs-of-progress/", "date": "2024-07-06 02:30", "source": "GDELT"}, {"id": "74be3c34-7cfb-449a-9eda-f72d912a5a1d", "message": "Israeli officials have expressed concern that Hamas will do the same, drawing out the talks and the initial cease-fire indefinitely without releasing the remaining hostages.\nAway from the negotiating table, senior Hamas officials met with Hassan Nasrallah, the leader of the Lebanese militant group Hezbollah, as well as the leader of the Islamic Group.\nThe Palestinian Health Ministry says over 500 Palestinians have since been killed by Israeli fire in the West Bank.\nThe dead also include bystanders and Palestinians killed in attacks by Jewish settlers.\nIn Gaza, Israeli bombardments and ground offensives have so far killed more than 38,000 Palestinians, Gaza’s Health Ministry says.", "url": "https://www.nashuatelegraph.com/top-headlines/2024/07/06/israeli-strikes-kill-6-in-gaza-including-kids-and-un-worker-as-truce-talks-show-signs-of-progress/", "date": "2024-07-06 04:30", "source": "GDELT"}, {"id": "e6c16aae-230f-4443-86f4-35035500a910", "message": "Palestinian firefighters work in the rubble of a home destroyed in an Israeli military operation in the West Bank city of Jenin, Friday, July 5, 2024.\nThe Israeli military said Friday it was conducting counterterrorism activity that included an airstrike in the area of the West Bank city of Jenin.\nThe Israeli military did not immediately comment on the strikes.\nThe Israeli military said Friday it was conducting counterterrorism activity that included an airstrike in the area of the West Bank city of Jenin.\nIn Gaza, Israeli bombardments and ground offensives have so far killed more than 38,000 Palestinians, Gaza’s Health Ministry says.", "url": "https://www.newsday.com/news/nation/israel-palestinians-hamas-war-news-07-05-2024-t00699", "date": "2024-07-06 06:15", "source": "GDELT"}, {"id": "7b49e69b-eb57-46b3-bef2-3e80728ec682", "message": "Away from the negotiating table, senior Hamas officials met with Hassan Nasrallah, the leader of the Lebanese militant group Hezbollah, as well as the leader of the Islamic Group.\nThe Palestinian Health Ministry says over 500 Palestinians have since been killed by Israeli fire in the West Bank.\nThe dead also include bystanders and Palestinians killed in attacks by Jewish settlers.\nIn Gaza, Israeli bombardments and ground offensives have so far killed more than 38,000 Palestinians, Gaza’s Health Ministry says.\nThe top U.N. court has concluded there is a “plausible risk of genocide” in Gaza — a charge Israel strongly denies.", "url": "https://www.stltoday.com/news/nation-world/israeli-strikes-kill-at-least-6-in-central-gaza-including-kids-and-a-un-worker/article_84ee7d3c-3b83-11ef-b4d3-4741dddfe3a9.html", "date": "2024-07-06 13:15", "source": "GDELT"}], "location": "West Bank", "total_score": 3.800302318698521, "count": 7, "average_score": 0.5429003312426459, "final_score": 0.7400302318698522}, "3ff529fe-b50f-45cd-b902-3647538f4fab": {"messages": [{"id": "3ff529fe-b50f-45cd-b902-3647538f4fab", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn the Lyman direction Russian zagarbniki 14 times tried to advance near Grekivka, Makiyivka and Terniv.\nRussian forces attacked near Northern, Toretsk and New York 18 times unsuccessfully.\nIn the oríhívs Оkomu direction, there were two Russian attacks in the areas of small tokmački and robotinogo.", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-07-04.htm", "date": "2024-07-05 06:00", "source": "GDELT"}, {"id": "112f05c5-3b6d-4bb2-abfe-27c91f385c9b", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn the Kharkiv direction, Russian forces attacked five times in the vicinity of globokoye and lipcív.\nIn the Kupians ційkomu direction, Russian forces tried to advance to Ukrainian positions near synkivka five times a day.\nTwice the Russian occupiers unsuccessfully stormed Ukrainian positions in the oríhiv direction, in the area of small tokmačka.", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-07-05.htm", "date": "2024-07-06 06:00", "source": "GDELT"}], "location": "LYMAN", "total_score": 0.3547582794061668, "count": 1, "average_score": 0.3547582794061668, "final_score": 0.42833079558431675}, "4a652f48-7784-4de1-9adf-eac56f5261be": {"messages": [{"id": "4a652f48-7784-4de1-9adf-eac56f5261be", "message": "Jerusalem -Palestinian authorities say seven people were killed Friday during an Israeli military operation in the area of the West Bank city of Jenin, where the Israeli military said it had been carrying out “counterterrorism activity” that included an airstrike.\nThe Palestinians seek the West Bank, east Jerusalem and Gaza — areas captured by Israel in the 1967 Mideast war — for an independent state.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nThe dead also include bystanders and Palestinians killed in attacks by Jewish settlers.\nIn Gaza, the war has so far killed more than 38,000 Palestinians, Gaza’s Health Ministry says.", "url": "https://www.ctvnews.ca/world/israel-conducts-military-operation-in-the-area-of-the-west-bank-city-of-jenin-5-palestinians-killed-1.6952519", "date": "2024-07-05 13:15", "source": "GDELT"}, {"id": "921353bc-5dc1-4917-a375-3bacea82b5b6", "message": "Israeli officials have expressed concern that Hamas will do the same, drawing out the talks and the initial cease-fire indefinitely without releasing the remaining hostages.\nThe Palestinian Health Ministry says over 500 Palestinians have since been killed by Israeli fire in the West Bank.\nThe dead also include bystanders and Palestinians killed in attacks by Jewish settlers.\nIn Gaza, Israeli bombardments and ground offensives have so far killed more than 38,000 Palestinians, Gaza’s Health Ministry says.\nThe top U.N. court has concluded there is a “plausible risk of genocide” in Gaza — a charge Israel strongly denies.", "url": "https://www.adn.com/nation-world/2024/07/05/israeli-strikes-kill-6-in-gaza-including-children-and-a-un-worker/", "date": "2024-07-06 02:30", "source": "GDELT"}], "location": "Jenin, West Bank", "total_score": 0.6469212261628943, "count": 1, "average_score": 0.6469212261628943, "final_score": 0.6328448583140259}, "21dc8dcc-f4f3-42a1-8fbf-6d80080037ec": {"messages": [{"id": "21dc8dcc-f4f3-42a1-8fbf-6d80080037ec", "message": "JERUSALEM — Palestinian authorities say seven people were killed Friday during an Israeli military operation in the area of the West Bank city of Jenin, where the Israeli military said it had been carrying out ''counterterrorism activity'' that included an airstrike.\nThe Palestinians seek the West Bank, east Jerusalem and Gaza — areas captured by Israel in the 1967 Mideast war — for an independent state.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nThe dead also include bystanders and Palestinians killed in attacks by Jewish settlers.\nIn Gaza, the war has so far killed more than 38,000 Palestinians, Gaza's Health Ministry says.", "url": "https://www.startribune.com/israel-conducts-military-operation-in-the-area-of-the-west-bank-city-of-jenin-4-palestinians-killed/600378567/", "date": "2024-07-05 09:00", "source": "GDELT"}, {"id": "67f8f5c0-a859-4d67-98ca-d78771c4c9fa", "message": "Associated PressJERUSALEM — Palestinian authorities say seven people were killed Friday during an Israeli military operation in the area of the West Bank city of Jenin, where the Israeli military said it had been carrying out “counterterrorism activity” that included an airstrike.\nThe Palestinian Health Ministry said a total of seven people had been killed, but did not specify whether they died in the exchange of fire or the airstrike.\nThe Palestinians seek the West Bank, east Jerusalem and Gaza — areas captured by Israel in the 1967 Mideast war — for an independent state.\nThe Palestinian Health Ministry says over 500 Palestinians have been killed by Israeli fire in the West Bank since the start of the war.\nThe dead also include bystanders and Palestinians killed in attacks by Jewish settlers.", "url": "https://www.pasadenastarnews.com/2024/07/05/seven-people-reportedly-killed-in-israeli-raid-in-west-bank/", "date": "2024-07-05 18:45", "source": "GDELT"}], "location": "JERUSALEM", "total_score": 0.3218031464300122, "count": 1, "average_score": 0.3218031464300122, "final_score": 0.40526220250100853}, "c821f697-a981-4a3c-a99f-b2c794c84870": {"messages": [{"id": "c821f697-a981-4a3c-a99f-b2c794c84870", "message": "Related video: Several people injured after shots fired in Tampa, police sayShootings and other violence during the extended Fourth of July weekend have left at least 20 people dead, including 11 in Chicago, and injured dozens more nationwide, authorities said.\nAnd a year before that, a mass shooting at a Fourth of July parade left seven people dead near Chicago.\nViolence and mass shootings often increase in the summer months, with more people gathering for social events, teens out of school and hotter temperatures.\nThat violence included a mass shooting on Thursday that killed two women and an 8-year-old boy.\nBoston-area shootings leave 1 dead, 5 woundedThree shootings occurred in the Boston area following the city’s Fourth of July celebrations, leaving one man dead.", "url": "https://www.yahoo.com/news/july-fourth-violence-kills-least-193729905.html", "date": "2024-07-05 22:30", "source": "GDELT"}, {"id": "9cf62163-883d-4344-a8a3-b09d6a22c704", "message": "Shootings and other violence during the extended Fourth of July weekend have left at least 20 people dead, including 11 in Chicago, and injured dozens more nationwide, authorities said.\nA flurry of shootings around the holiday a year ago left more than a dozen people dead and over 60 wounded.\nAnd a year before that, a mass shooting at a Fourth of July parade left seven people dead near Chicago.\nThat violence included a mass shooting on Thursday that killed two women and an 8-year-old boy.\nBoston-area shootings leave 1 dead, 5 woundedThree shootings occurred in the Boston area following the city’s Fourth of July celebrations, leaving one man dead.", "url": "https://www.bangordailynews.com/2024/07/05/nation/july-fourth-violence-kills-at-least-20-wounds-dozens-nationwide/", "date": "2024-07-05 20:45", "source": "GDELT"}, {"id": "113c7c79-35f0-4357-ab92-0ac755b53d55", "message": "Shootings and other violence during the extended July 4 weekend have left at least 33 people dead across the US, including 11 in Chicago, and injured dozens more nationwide, authorities said.\nA flurry of shootings around the holiday a year ago left more than a dozen people dead and over 60 wounded.\nThe recent violence “has left our city in a state of grief,” Mayor Brandon Johnson said.\nThree shootings occurred in the Boston area following the city’s July 4 celebrations, leaving one man dead.\nShootings at two St Louis-area July 4 gatherings left two men dead and five others injured, two critically, police said.", "url": "https://www.irishexaminer.com/world/arid-41431000.html", "date": "2024-07-06 00:15", "source": "GDELT"}, {"id": "a14334dc-e573-40a2-8601-918a10167ff8", "message": "Shootings and other violence during the extended Fourth of July weekend have left at least 33 people dead, including 11 in Chicago, and injured dozens more nationwide, authorities said.\nAnd a year before that, seven people died in a mass shooting at a Fourth of July parade near Chicago.\nAdvertisementThe recent violence “has left our city in a state of grief,” Mayor Brandon Johnson said.\nBoston-area shootings leave 1 dead, 5 woundedThree shootings occurred in the Boston area following the city’s Fourth of July celebrations, leaving one man dead.\nShootings at two St. Louis-area Fourth of July gatherings left two men dead and five others injured, two critically, police said.", "url": "https://www.dallasnews.com/news/crime/2024/07/05/july-fourth-violence-nationwide-kills-at-least-33-chicago-in-state-of-grief-mayor-says/", "date": "2024-07-06 03:45", "source": "GDELT"}, {"id": "1edfd6a7-4dbc-43df-b701-e9cc948e9792", "message": "(AP) — Shootings and other violence during the extended Fourth of July weekend have left at least 33 people dead, including 11 in Chicago, and injured dozens more nationwide, authorities said.\nAnd a year before that, seven people died in a mass shooting at a Fourth of July parade near Chicago.\nThe recent violence “has left our city in a state of grief,” Mayor Brandon Johnson said.\nBoston-area shootings leave 1 dead, 5 woundedThree shootings occurred in the Boston area following the city’s Fourth of July celebrations, leaving one man dead.\nShootings at two St. Louis-area Fourth of July gatherings left two men dead and five others injured, two critically, police said.", "url": "https://wsvn.com/news/us-world/july-fourth-violence-nationwide-kills-at-least-33-including-4-hurt-in-tampa-nightclub/", "date": "2024-07-06 06:00", "source": "GDELT"}], "location": "Chicago", "total_score": 2.023528320988596, "count": 4, "average_score": 0.505882080247149, "final_score": 0.6241174561730043}, "2ffb606e-81fe-4b22-9958-60ecb72f958a": {"messages": [{"id": "2ffb606e-81fe-4b22-9958-60ecb72f958a", "message": "Anti-landing barricades are pictured on the beach, with China's Xiamen city in the background, in Kinmen, Taiwan February 21, 2024.\nTaiwan has detected at least 127 Chinese military aircraft operating near the island since the start of JulyTAIPEI, Taiwan – Taiwan on Friday, July 5, reported renewed Chinese military activity nearby with another “combat patrol” as the government called on Beijing not to escalate tensions after the seizure of a Taiwanese fishing boat.\nTaiwan’s defense ministry said that starting just before 7 am (2300 GMT) on Friday, it had detected 26 Chinese military aircraft, including J-16 fighters, carrying out a “joint combat readiness patrol” with Chinese warships.\nThe Chinese aircraft flew into airspace to the north, centre and southern part of Taiwan, the ministry said.\nTaiwan has detected at least 127 Chinese military aircraft operating near the island since the start of this month.", "url": "https://www.rappler.com/world/asia-pacific/taiwan-reports-more-chinese-military-activity-de-escalation-call/", "date": "2024-07-05 08:45", "source": "GDELT"}, {"id": "f28235cb-3783-4be4-8d11-a62d761edeff", "message": "More Chinese military activity reportedBy Ben Blanchard / Reuters, TAIPEIThe Ministry of National Defense yesterday reported renewed Chinese military activity nearby with another “combat patrol,” as the government called on Beijing not to escalate tensions after the seizure of a Taiwanese fishing boat.\nThe ministry said that starting just before 7am yesterday, it had detected 26 Chinese military aircraft, including J-16 fighters, carrying out a “joint combat readiness patrol” with Chinese warships.\nA map shows activity by the Chinese People’s Liberation Army near Taiwan in the 24 hours that ended at 6am yesterday.\nPhoto courtesy of the Ministry of National DefenseThe Chinese aircraft flew into airspace to the north, center and southern part of Taiwan, the ministry said.\nThe ministry said it had “monitored the situation and responded accordingly.”At least 127 Chinese military aircraft operating nearby since the start of this month.", "url": "https://www.taipeitimes.com/News/taiwan/archives/2024/07/06/2003820408", "date": "2024-07-05 19:30", "source": "GDELT"}], "location": "TAIPEI, Taiwan", "total_score": 0.521779221919733, "count": 1, "average_score": 0.521779221919733, "final_score": 0.5452454553438131}, "522ffb06-978f-4848-80b8-fe6adbfb59a1": {"messages": [{"id": "522ffb06-978f-4848-80b8-fe6adbfb59a1", "message": "JENIN: An Israeli military raid on Jenin in the occupied West Bank on Friday left five people dead, the Palestinian Authority health ministry said.\nAt least 12 Palestinians have now been killed in Israeli operations this week in the occupied West Bank, where tensions have intensified since the start of the Gaza war in October.\n“During the exchanges of fire, an IDF (Israeli military) aircraft struck several armed terrorists in the area,” the Israeli statement said.\nThe occupied West Bank has suffered from mounting violence since the start of the Gaza war on October 7.\nAccording to Palestinian figures, at least 565 Palestinians have died in the West Bank in military raids and in violence with Israeli settlers.", "url": "https://www.brecorder.com/news/40311410/five-killed-in-israeli-raid-in-west-bank-palestinian-health-ministry", "date": "2024-07-05 09:15", "source": "GDELT"}, {"id": "93afa77b-b6cc-4727-9b1a-8efb8ef9af04", "message": "JENIN: Israeli troops killed seven Palestinians in a raid on Jenin in the occupied West Bank on Friday, officials said.\nAt least 14 Palestinians have now been killed in Israeli operations this week in the occupied West Bank, where the Gaza war has fuelled tensions since October last year.\nAn Israeli military statement claimed there was a gun battle in the Jenin refugee camp.\nHowever, according to the Israeli military, two Palestinians who took part in an attack on Israeli forces last week were killed.\nBefore the latest Israeli raid in Jenin, seven Palestinians were killed in military operations this week.", "url": "https://www.dawn.com/news/1844136/seven-killed-in-israeli-raid-in-occupied-west-bank", "date": "2024-07-06 05:00", "source": "GDELT"}], "location": "JENIN.", "total_score": 0.6245067523896997, "count": 1, "average_score": 0.6245067523896997, "final_score": 0.6171547266727898}, "a9df7cde-d8c6-43ff-9c43-6ac110db5670": {"messages": [{"id": "a9df7cde-d8c6-43ff-9c43-6ac110db5670", "message": "Cease-fire talks between Israel and Hamas appear to be reviving after having stalled for weeks, as U.S., Qatari and Egyptian mediators try to overcome differences that have repeatedly thwarted a deal.\nIn the occupied West Bank, Palestinian health officials say an Israeli military operation and airstrike on Friday.\nViolence has surged throughout the West Bank during nearly nine months of war in Gaza.\nIsrael launched the war in Gaza after Hamas’ Oct. 7 attack, in which terrorist stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nThe top U.N. court has concluded there is a “plausible risk of genocide” in Gaza — a charge Israel strongly denies.", "url": "https://wpde.com/news/nation-world/hamas-says-its-cease-fire-amendments-met-with-positive-response-as-talks-continue-terrorist-group-israel-war-middle-east-negotiations-humanitarian-crisis-ground-offensives-war-zones-bombardments", "date": "2024-07-06 03:45", "source": "GDELT"}, {"id": "b1d87fd4-438e-4a74-b976-6cd9d1178f18", "message": "Cease-fire talks between Israel and Hamas appear to be reviving after having stalled for weeks, as U.S., Qatari and Egyptian mediators try to overcome differences that have repeatedly thwarted a deal.\nIsrael launched the war in Gaza after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\n— Israel weighs Hamas’ latest response to Gaza cease-fire proposal as diplomatic efforts are revived.\nHezbollah says it will stop its attacks if Israel agrees to a cease-fire with Hamas in its nine-month war in the Gaza Strip.\nViolence has spiraled in the West Bank since the start of Israel’s war against Hamas in Gaza.", "url": "https://www.click2houston.com/news/2024/07/05/the-latest-hamas-says-it-got-a-positive-response-from-mediators-to-its-cease-fire-amendments/", "date": "2024-07-06 11:30", "source": "GDELT"}], "location": "GAZA", "total_score": 0.5444930875576037, "count": 1, "average_score": 0.5444930875576037, "final_score": 0.5611451612903227}, "37dcee5d-6c42-4db7-b3cd-4b90fad02a0d": {"messages": [{"id": "37dcee5d-6c42-4db7-b3cd-4b90fad02a0d", "message": "Israeli troops killed seven Palestinians — with Hamas claiming five as members — in a raid on Jenin in the occupied West Bank on Friday, officials said.At least 14 Palestinians have now been killed in Israeli operations this week in the West Bank, where the Gaza war has fuelled tensions October.The Israeli military said the raid was carried out to find fighters behind an attack last week in which an Israeli captain was killed.\nOne, Ahmed Mahmud al-Aridi, 30, was named as a Hamas “commander”.\nMounting violence has gripped the West Bank since the start of the Gaza war in the first week of October last year.\nSeven Palestinians were killed in military operations this week, before the latest deadly operation.\nA woman and child died in an Israeli raid in a refugee camp near Tulkarem on Monday, four men in a drone attack on the same Nur Shams camp on Tuesday and one man in Jenin on Wednesday, according to the health ministry.Fourteen people died in one two-day Israeli operation in Nur Shams in April, according to the Palestinian Red Crescent.", "url": "https://www.gulf-times.com/article/686131/region/troops-kill-seven-in-west-bank-raid", "date": "2024-07-06 02:15", "source": "GDELT"}, {"id": "566486bc-2eec-4c4f-a8e6-cdd9827aa444", "message": "(MENAFN- Gulf Times) Israeli troops killed seven Palestinians - with Hamas claiming five as members - in a raid on Jenin in the occupied West on Friday, officials said.\nAt least 14 Palestinians have now been killed in Israeli operations this week in the West Bank, where the Gaza war has fuelled tensions October.\nThe Israeli military said the raid was carried out to find fighters behind an attack last week in which an Israeli captain was killed.\nAn Israeli military statement said there was a gun battle in the Jenin refugee camp and then troops surrounded a building in which“fighters barricaded themselves”.\nSeven Palestinians were killed in military operations this week, before the latest deadly operation.", "url": "https://menafn.com/1108411973/Troops-Kill-Seven-In-West-Bank-Raid", "date": "2024-07-06 03:45", "source": "GDELT"}], "location": "Jenin, West Bank", "total_score": 0.5081246664036574, "count": 1, "average_score": 0.5081246664036574, "final_score": 0.5356872664825602}, "77b6a5e9-3271-45b8-a142-a29d1e9f0cf8": {"messages": [{"id": "77b6a5e9-3271-45b8-a142-a29d1e9f0cf8", "message": "Xinhua | Updated: 2024-07-06 13:12A fire truck extinguishes a fire caused by a shelling attack near Israel's northern border, July 4, 2024.\n[Photo/Xinhua]UNITED NATIONS - The United Nations expressed grave concerns on Friday about intensified clashes along the Lebanon-Israel frontier, known as the Blue Line.\nThe world body highlighted the mounting tensions following an increase in exchanges of fire between Lebanese and Israeli forces.\nThis recent surge in hostilities, which occurred on Thursday, \"heightens the risk of a full-scale war,\" according to a note from the office of the spokesperson for the UN secretary-general.\nThe note underscored the necessity of restraint, noting, \"Escalation can and must be avoided.", "url": "http://global.chinadaily.com.cn/a/202407/06/WS6688d255a31095c51c50cc03.html", "date": "2024-07-06 09:30", "source": "GDELT"}, {"id": "0a79e22d-af7d-4d12-bda3-95d93cbfa3e2", "message": "UN warns of escalation of tension on Lebanon-Israel borderXinhua) 10:32, July 06, 2024UNITED NATIONS, July 5 (Xinhua) -- The United Nations expressed grave concerns on Friday about intensified clashes along the Lebanon-Israel frontier, known as the Blue Line.\nThe world body highlighted the mounting tensions following an increase in exchanges of fire between Lebanese and Israeli forces.\nThis recent surge in hostilities, which occurred on Thursday, \"heightens the risk of a full-scale war,\" according to a note from the office of the spokesperson for the UN secretary-general.\nThe note underscored the necessity of restraint, noting, \"Escalation can and must be avoided.\nWe reiterate that the danger of miscalculation leading to a sudden and wider conflagration is real,\" and emphasized that \"a political and diplomatic solution is the only viable way forward.\"", "url": "http://en.people.cn/n3/2024/0706/c90000-20190526.html", "date": "2024-07-06 05:30", "source": "GDELT"}], "location": "Israel", "total_score": 0.4117432393793923, "count": 1, "average_score": 0.4117432393793923, "final_score": 0.46822026756557455}, "bb1a31c0-ac11-40f2-a63d-63cede690b1a": {"messages": [{"id": "bb1a31c0-ac11-40f2-a63d-63cede690b1a", "message": "Hamas has accepted a US proposal to begin talks on releasing Israeli hostages, including soldiers and men, 16 days after the first phase of an agreement aimed at ending the Israel-Gaza war , a senior Hamas source told Reuters on Saturday.\nThat was in sharp contrast to past instances in the nine-month-old war in Gaza, when Israel said conditions attached by Hamas were unacceptable.\nThe new proposal ensures that mediators would guarantee a temporary ceasefire, aid delivery and the withdrawal of Israeli troops as long as indirect talks continue to implement the second phase of the agreement, the Hamas source said.\nThe Israeli military said it eliminated a Hamas rocket cell that operated from inside a humanitarian-designated area.\nHamas denies Israeli accusations it uses civilian properties for military purposes.", "url": "https://www.scmp.com/news/world/middle-east/article/3269454/israel-gaza-war-hamas-accepts-us-proposal-talks-over-israeli-hostages", "date": "2024-07-06 13:45", "source": "GDELT"}, {"id": "95800706-225f-43d9-afc1-c20637693271", "message": "Hamas accepts US proposal on talks over Israeli hostages, Hamas source saysDUBAI/CAIRO, July 6 (Reuters) - Hamas has accepted a U.S. proposal to begin talks on releasing Israeli hostages, including soldiers and men, 16 days after the first phase of an agreement aimed at ending the Gaza war, a senior Hamas source told Reuters on Saturday.\nPalestinians asses the damage following an Israeli strike in the Nuseirat refugee camp in the central Gaza Strip on July 6, 2024.\nThat was in sharp contrast to past instances in the nine-month-old war in Gaza, when Israel said conditions attached by Hamas were unacceptable.\nThe new proposal ensures that mediators would guarantee a temporary ceasefire, aid delivery and the withdrawal of Israeli troops as long as indirect talks continue to implement the second phase of the agreement, the Hamas source said.\nThis article originally appeared on USA TODAY: Hamas accepts US proposal on talks over Israeli hostages, source says", "url": "https://www.yahoo.com/news/hamas-accepts-us-proposal-talks-150708633.html", "date": "2024-07-06 15:45", "source": "GDELT"}], "location": "GAZA", "total_score": 0.4252452228218444, "count": 1, "average_score": 0.4252452228218444, "final_score": 0.47767165597529104}, "bd81c93a-83ca-48e4-9f46-f7324a5012f4": {"messages": [{"id": "bd81c93a-83ca-48e4-9f46-f7324a5012f4", "message": "×KYIV, Ukraine (AP) — Russian strikes overnight left over 100,000 households without power in northern Ukraine and cut off the water supply to a regional capital, Ukrainian authorities reported Saturday, while civilian casualties rose sharply in the country's embattled east.\nThe northern Sumy region, which borders Russia, was plunged into dark after Russian strikes late Friday damaged energy infrastructure, the Ukrainian Energy Ministry said.\nThe Ukrainian General Staff on Saturday morning said that Ukrainian and Russian forces clashed 45 times near Pokrovsk over the previous day.\nA Ukrainian military spokesperson on Thursday told the AP that Ukrainian forces had retreated from a neighbourhood on the outskirts of Chasiv Yar.\nIn Russia, two civilians were wounded after Ukrainian forces overnight shelled a border town in the southern Belgorod region, its Gov.", "url": "https://www.durangoherald.com/articles/russian-strikes-leave-thousands-in-northern-ukraine-without-power-and-water/", "date": "2024-07-06 14:15", "source": "GDELT"}, {"id": "e65079bb-a579-49af-843e-c99c5c0e4500", "message": "In the Donetsk region in the east, Russian shelling on Friday and overnight killed 11 civilians and wounded 43, local Gov.\nThe Ukrainian General Staff on Saturday morning said that Ukrainian and Russian forces clashed 45 times near Pokrovsk over the previous day.\nA Ukrainian military spokesperson on Thursday told the AP that Ukrainian forces had retreated from a neighborhood on the outskirts of Chasiv Yar.\nIn Russia, two civilians were wounded after Ukrainian forces overnight shelled a border town in the southern Belgorod region, its Gov.\nThe Russian Defense Ministry said its troops overnight shot down a total of eight drones over the Kursk and Belgorod regions in the south.", "url": "https://indianexpress.com/article/world/russian-strikes-leave-thousands-in-northern-ukraine-power-water-9437299/", "date": "2024-07-06 17:45", "source": "GDELT"}, {"id": "3f1159e9-615b-47b8-9557-2a16422750fe", "message": "Hours later, the Ukrainian public broadcaster reported that Russian drones hit the provincial capital, also called Sumy, cutting off water by hitting power lines that feed its system of pumps.\nIn the Donetsk region in the east, Russian shelling on Friday and overnight killed 11 civilians and wounded 43, local Gov.\nThe Ukrainian General Staff on Saturday morning said that Ukrainian and Russian forces clashed 45 times near Pokrovsk over the previous day.\nA Ukrainian military spokesperson on Thursday told the AP that Ukrainian forces had retreated from a neighborhood on the outskirts of Chasiv Yar.\nIn Russia, two civilians were wounded after Ukrainian forces overnight shelled a border town in the southern Belgorod region, its Gov.", "url": "https://www.local10.com/news/world/2024/07/06/russian-strikes-leave-thousands-in-northern-ukraine-without-power-and-water/", "date": "2024-07-06 15:30", "source": "GDELT"}], "location": "KYIV, Ukraine", "total_score": 0.9924861737123291, "count": 2, "average_score": 0.49624308685616453, "final_score": 0.5573701607993151}, "f1bdd0a1-92c4-4966-8de2-d35378cf2621": {"messages": [{"id": "f1bdd0a1-92c4-4966-8de2-d35378cf2621", "message": "Peter Fouche, 49, died “in the battlefield” on June 27 as his unit clashed with Russian troops, according to his colleague at Project Konstantin, the volunteer group that since 2022 has ferried drones, vehicles, uniforms and food to Ukrainian soldiers in the east.\nComrades of Peter Fouche at the funeral in Kyiv (Alex Babenko/AP)According to its website, it has also helped evacuate 219 Ukrainian soldiers from combat zones.\nAt the funeral ceremony, Ukrainian soldiers carried Mr Fouche’s coffin through Kyiv’s landmark Independence Square, the site of mass protests in 2014 that forced out a pro-Russian president.\nMr Fouche’s comrades held back tears as they lined up to say goodbye.\nAt least five other Britons have been killed while volunteering in Ukraine since Russia’s full-scale invasion in February 2022.", "url": "https://www.theargus.co.uk/news/national/24435259.ukrainian-troops-pay-last-respects-briton-killed-clash-russian-forces/", "date": "2024-07-06 14:15", "source": "GDELT"}, {"id": "551dbbfa-05f0-4322-be26-904fcfcf9104", "message": "Ukrainian service members have gathered in Kyiv to pay last respects to a British combat medic who set up a charity delivering essential supplies to frontline fighters.\nPeter Fouche, 49, died “in the battlefield” on June 27 as his unit clashed with Russian troops, according to his colleague at Project Konstantin, the volunteer group that since 2022 has ferried drones, vehicles, uniforms and food to Ukrainian soldiers in the east.\nOthers read prayers as they held up Ukrainian flags and military insignia.\nHis partner, wearing a traditional Ukrainian embroidered shirt, knelt down to embrace the coffin.\nAt least five other Britons have been killed while volunteering in Ukraine since Russia’s full-scale invasion in February 2022.", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/07/06/ukrainian-troops-pay-last-respects-to-briton-killed-in-clash-with-russian-forces/", "date": "2024-07-06 16:00", "source": "GDELT"}, {"id": "40af8400-cd98-41de-9bea-9bac92ebeac4", "message": "Ukrainian soldiers fought back tears as they gathered in Kyiv today to pay last respects to a British combat medic and former cab driver killed in action.\nPeter Fouche, 49, helped set up a charity called Project Konstantin which since 2022 has delivered essential supplies to frontline Ukrainian fighters in the bloody conflict against Russia.\nAccording to its website, it has also helped evacuate 219 Ukrainian soldiers from combat zones.\nCo-founder Mr Fouche - a former London taxi driver - died 'on the battlefield' on June 27 as his unit clashed with Russian troops, a colleague at Project Konstantin said.\nUpon his arrival in Ukraine, Fouché volunteered to fight for Kyiv with one of many territorial defence units that were created following the outbreak of war.", "url": "https://www.dailymail.co.uk/news/article-13607027/ukraine-british-cabbie-peter-fouche-funeral-project-konstantin.html", "date": "2024-07-06 15:45", "source": "GDELT"}], "location": "KYIV, UKRAINE", "total_score": 1.2645902802152802, "count": 2, "average_score": 0.6322951401076401, "final_score": 0.652606598075348}, "55fce6f4-f522-495d-9694-9217e2151fee": {"messages": [{"id": "55fce6f4-f522-495d-9694-9217e2151fee", "message": "KYIV, Ukraine — Russian strikes overnight left over 100,000 households without power in northern Ukraine and cut off the water supply to a regional capital, Ukrainian authorities reported Saturday, while civilian casualties rose sharply in the country's embattled east.\nThe northern Sumy region, which borders Russia, was plunged into dark after Russian strikes late Friday damaged energy infrastructure, the Ukrainian Energy Ministry said.\nThe Ukrainian General Staff on Saturday morning said that Ukrainian and Russian forces clashed 45 times near Pokrovsk over the previous day.\nA Ukrainian military spokesperson on Thursday told the AP that Ukrainian forces had retreated from a neighbourhood on the outskirts of Chasiv Yar.\nIn Russia, two civilians were wounded after Ukrainian forces overnight shelled a border town in the southern Belgorod region, its Gov.", "url": "https://www.startribune.com/russian-strikes-leave-thousands-in-northern-ukraine-without-power-and-water/600378786/", "date": "2024-07-06 12:15", "source": "GDELT"}, {"id": "3b53a1b1-11e6-4457-9061-7c0631fed216", "message": "Hours later, the Ukrainian public broadcaster reported that Russian drones hit the provincial capital, also called Sumy, cutting off water by hitting power lines that feed its system of pumps.\nIn the Donetsk region in the east, Russian shelling on Friday and overnight killed 11 civilians and wounded 43, local Gov.\nThe Ukrainian General Staff on Saturday morning said that Ukrainian and Russian forces clashed 45 times near Pokrovsk over the previous day.\nA Ukrainian military spokesperson on Thursday told the AP that Ukrainian forces had retreated from a neighborhood on the outskirts of Chasiv Yar.\nIn Russia, two civilians were wounded after Ukrainian forces overnight shelled a border town in the southern Belgorod region, its Gov.", "url": "https://www.news4jax.com/news/world/2024/07/06/russian-strikes-leave-thousands-in-northern-ukraine-without-power-and-water/", "date": "2024-07-06 15:00", "source": "GDELT"}], "location": "KYIV, Ukraine", "total_score": 0.44095966717391, "count": 1, "average_score": 0.44095966717391, "final_score": 0.488671767021737}, "80e7e88a-7026-476e-981e-53f34be7cc48": {"messages": [{"id": "80e7e88a-7026-476e-981e-53f34be7cc48", "message": "There has been no truce since a one-week pause in November during which 80 Israeli hostages were freed in return for 240 Palestinians held in Israeli prisons.\nAccording to UNRWA, which coordinated much of the aid delivered to Gaza, 194 of its employees have been killed in the war.\nThis included an initial six-week truce, Israeli withdrawal from Gaza population centres and the freeing of hostages by Palestinian militants.\nThe militants also seized hostages, 116 of whom remain in Gaza including 42 the military says are dead.\n- Sirens and air strikes -Cross-border fire between Israel and Lebanon's Iran-backed Hezbollah movement has occurred almost daily since the Gaza war began, but has escalated notably over the past month.", "url": "https://www.yahoo.com/news/deadly-strikes-gaza-israel-commits-132422979.html", "date": "2024-07-06 14:15", "source": "GDELT"}, {"id": "82bbd075-9953-4f41-9a72-d2eeaeecec28", "message": "(MENAFN- Gulf Times) Israel carried out deadly in Gaza on Saturday and engaged in combat with Hamas fighters, while to the north it exchanged fire with Hezbollah across the Lebanese border.\n\"It was agreed that next week Israeli negotiators will travel to Doha to continue the talks.\nAccording to UNRWA, which coordinated much of the aid delivered to Gaza, 194 of its employees have been killed in the war.\nThis included an initial six-week truce, Israeli withdrawal from Gaza population centres and the freeing of hostages.\nCross-border fire between Israel and Lebanon's Hezbollah movement has occurred almost daily since the Gaza war began, but has escalated notably over the past month.", "url": "https://menafn.com/1108412991/Deadly-Strikes-In-Gaza-As-Israel-Commits-To-Talks", "date": "2024-07-06 19:00", "source": "GDELT"}, {"id": "1d08ac0b-2f5b-4eff-8af8-6eef3e24636a", "message": "GAZA STRIP: Israel carried out deadly airstrikes in Gaza on Saturday and engaged in combat with Hamas fighters, while to the north it exchanged fire with Hezbollah fighters across the Lebanese border.\n“It was agreed that next week Israeli negotiators will travel to Doha to continue the talks.\nHezbollah, Hamas discuss latest developments in Gaza ceasefire talks, Hezbollah saysAccording to UNRWA, which coordinated much of the aid delivered to Gaza, 194 of its employees have been killed in the war.\nThis included an initial six-week truce, Israeli withdrawal from Gaza population centres and the freeing of hostages by Palestinian group.\nSirens and air strikesCross-border fire between Israel and Lebanon’s Iran-backed Hezbollah movement has occurred almost daily since the Gaza war began, but has escalated notably over the past month.", "url": "https://www.brecorder.com/news/40311571/deadly-strikes-in-gaza-as-israel-commits-to-talks", "date": "2024-07-06 17:15", "source": "GDELT"}], "location": "Gaza", "total_score": 1.0798431291885926, "count": 2, "average_score": 0.5399215645942963, "final_score": 0.5879450952160074}, "a3c2788c-c426-4b7c-9784-4a08c508c5e7": {"messages": [{"id": "a3c2788c-c426-4b7c-9784-4a08c508c5e7", "message": "KYIV, Ukraine (AP) — Russian strikes overnight left over 100,000 households without power in northern Ukraine and cut off the water supply to a regional capital, Ukrainian authorities reported Saturday, while civilian casualties rose sharply in the country’s embattled east.\nThe northern Sumy region, which borders Russia, was plunged into dark after Russian strikes late Friday damaged energy infrastructure, the Ukrainian Energy Ministry said.\nHours later, the Ukrainian public broadcaster reported that Russian drones hit the provincial capital, also called Sumy, cutting off water by hitting power lines that feed its system of pumps.\nThe Ukrainian General Staff on Saturday morning said that Ukrainian and Russian forces clashed 45 times near Pokrovsk over the previous day.\nIn Russia, two civilians were wounded after Ukrainian forces overnight shelled a border town in the southern Belgorod region, its Gov.", "url": "https://www.whec.com/national-world/russian-strikes-leave-thousands-in-northern-ukraine-without-power-and-water/", "date": "2024-07-06 13:45", "source": "GDELT"}, {"id": "3483e663-a137-4ce3-bc4b-d6808cc7b076", "message": "KYIV, Ukraine — Russian strikes overnight left over 100,000 households without power in northern Ukraine and cut off the water supply to a regional capital, Ukrainian authorities reported Saturday, while civilian casualties rose sharply in the country's embattled east.\nIn the Donetsk region in the east, Russian shelling on Friday and overnight killed 11 civilians and wounded 43, local Gov.\nThe Ukrainian General Staff on Saturday morning said that Ukrainian and Russian forces clashed 45 times near Pokrovsk over the previous day.\nA Ukrainian military spokesperson on Thursday told the AP that Ukrainian forces had retreated from a neighborhood on the outskirts of Chasiv Yar.\nIn Russia, two civilians were wounded after Ukrainian forces overnight shelled a border town in the southern Belgorod region, its Gov.", "url": "https://www.newsday.com/news/nation/russia-ukraine-war-energy-sumy-donetsk-j40372", "date": "2024-07-06 17:45", "source": "GDELT"}, {"id": "a164779f-c159-450e-aae3-b9857401ca1c", "message": "(Alex Babenko/AP)KYIV, Ukraine — Russian strikes overnight left over 100,000 households without power in northern Ukraine and cut off the water supply to a regional capital, Ukrainian authorities reported Saturday, while civilian casualties rose sharply in the country’s embattled east.\nIn the Donetsk region in the east, Russian shelling on Friday and overnight killed 11 civilians and wounded 43, local Gov.\nThe Ukrainian General Staff on Saturday morning said that Ukrainian and Russian forces clashed 45 times near Pokrovsk over the previous day.\nA Ukrainian military spokesperson on Thursday told the AP that Ukrainian forces had retreated from a neighborhood on the outskirts of Chasiv Yar.\nIn Russia, two civilians were wounded after Ukrainian forces overnight shelled a border town in the southern Belgorod region, its Gov.", "url": "https://www.stripes.com/theaters/europe/2024-07-06/russian-strikes-northern-ukraine-power-water-14403570.html", "date": "2024-07-06 18:30", "source": "GDELT"}, {"id": "bd973d30-f487-46d8-b586-a570d31c569f", "message": "Hours later, the Ukrainian public broadcaster reported that Russian drones hit the provincial capital, also called Sumy, cutting off water by hitting power lines that feed its system of pumps.\nIn the Donetsk region in the east, Russian shelling on Friday and overnight killed 11 civilians and wounded 43, local Gov.\nThe Ukrainian General Staff on Saturday morning said that Ukrainian and Russian forces clashed 45 times near Pokrovsk over the previous day.\nA Ukrainian military spokesperson on Thursday told the AP that Ukrainian forces had retreated from a neighborhood on the outskirts of Chasiv Yar.\nIn Russia, two civilians were wounded after Ukrainian forces overnight shelled a border town in the southern Belgorod region, its Gov.", "url": "https://www.wsls.com/news/world/2024/07/06/russian-strikes-leave-thousands-in-northern-ukraine-without-power-and-water/", "date": "2024-07-06 14:45", "source": "GDELT"}], "location": "KYIV, Ukraine", "total_score": 1.4240298251744044, "count": 3, "average_score": 0.47467660839146814, "final_score": 0.5722736258740277}, "11c7a8dc-d607-4344-b84a-4839dc39c562": {"messages": [{"id": "11c7a8dc-d607-4344-b84a-4839dc39c562", "message": "The co-owner of a greenhouse in northern Israel, she said her home was once a lush paradise.\nMeanwhile, Israel and Hezbollah have exchanged cross-border fire as tensions have escalated in the region.\nOn June 12, Hezbollah fired hundreds of rockets into northern Israel, the largest attack on the country since the war in Gaza began.\n\"It's dangerous, it's coming next to the houses,\" Malachi told ABC News of the fires.\nOthers also began venturing back in June to cut grass, remove dried herbs and perform other tasks to help prevent future fires, Malachi said.", "url": "https://wkjc.com/world/2af072dab1b024a04654e94841177ae5", "date": "2024-07-06 18:30", "source": "GDELT"}, {"id": "15a6b262-939c-4aff-b60a-a9012f6eeeca", "message": "The co-owner of a greenhouse in northern Israel, she said her home was once a lush paradise.\nOn June 12, Hezbollah fired hundreds of rockets into northern Israel, the largest attack on the country since the war in Gaza began.\nPHOTO: Satellite image taken, June 13, 2024, shows land that burned in northern Israel.\nPHOTO: A firefighter douses a fire that broke out after a rocket strike fired from Lebanon, on July 4, 2024, in Northern Israel.\nHezbollah rocket attacks on northern Israel spark fires, destroy thousands of acres originally appeared on abcnews.go.com", "url": "https://www.yahoo.com/news/hezbollah-rocket-attacks-northern-israel-091451011.html", "date": "2024-07-06 09:45", "source": "GDELT"}], "location": "Israel", "total_score": 0.6456005408439206, "count": 1, "average_score": 0.6456005408439206, "final_score": 0.6319203785907445}, "5c664bbc-fd12-4ddc-915a-99b7203b8b3b": {"messages": [{"id": "5c664bbc-fd12-4ddc-915a-99b7203b8b3b", "message": "Hamas still wants “written guarantees” from mediators that Israel will continue to negotiate a permanent cease-fire deal once the first phase goes into effect, the officials said.\nMonths of on-again off-again cease-fire talks have stumbled over Hamas’ demand that any deal include a complete end to the war.\nIsraeli officials have said they are worried Hamas will draw out the talks and the initial cease-fire indefinitely, without releasing all the hostages.\nIsrael launched the war in Gaza after Hamas’ October attack in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nIsrael says Hamas is still holding about 120 hostages — about a third of them now thought to be dead.", "url": "https://www.military.com/daily-news/2024/07/06/hamas-clears-way-possible-cease-fire-after-dropping-key-demand-officials-say.html", "date": "2024-07-06 16:00", "source": "GDELT"}, {"id": "b5d31068-637d-40ae-ba0a-0bc36fab7372", "message": "Hamas has given initial approval for a US-backed proposal for a phased cease-fire deal in Gaza, dropping a key demand that Israel give an up-front commitment for a complete end to the war, a Hamas and an Egyptian official said on Saturday.\nHamas still wants written guarantees from mediators that Israel will continue to negotiate a permanent cease-fire deal once the first phase goes into effect, the officials said.\nMonths of on-again off-again cease-fire talks have stumbled over Hamas' demand that any deal include a complete end to the war.\nIsraeli officials have said they are worried Hamas will draw out the talks and the initial cease-fire indefinitely, without releasing all the hostages.\nIsrael launched the war in Gaza after Hamas' October attack in which militants stormed into southern Israel, killed some 1,200 people mostly civilians and abducted about 250.", "url": "https://www.theweek.in/news/world/2024/07/06/hamas-clears-way-for-a-possible-cease-fire-after-dropping-key-demand-officials.html", "date": "2024-07-06 17:30", "source": "GDELT"}, {"id": "f4e360c4-b1b4-46a0-a6d2-174569c6be78", "message": "Hamas has given initial approval for a U.S.-backed proposal for a phased cease-fire deal in Gaza, dropping a key demand that Israel give an up-front commitment for a complete end to the war, a Hamas and an Egyptian official said Saturday.\nHamas still wants “written guarantees” from mediators that Israel will continue to negotiate a permanent cease-fire deal once the first phase goes into effect, the officials said.\nMonths of on-again off-again cease-fire talks have stumbled over Hamas’ demand that any deal include a complete end to the war.\nIsraeli officials have said they are worried Hamas will draw out the talks and the initial cease-fire indefinitely, without releasing all the hostages.\nIsrael launched the war in Gaza after Hamas’ October attack in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.", "url": "https://www.nbcconnecticut.com/news/national-international/israel-hamas-war-possible-cease-fire/3329291/", "date": "2024-07-06 17:00", "source": "GDELT"}, {"id": "08f67e30-4186-4d81-8d16-a84e9517f914", "message": "DEIR AL-BALAH, Gaza — Hamas has given its initial approval of a U.S.-backed proposal for a phased cease-fire deal in Gaza, dropping a key demand that Israel commit up front to a complete end to the war, a Hamas official and an Egyptian official said Saturday.\nHamas still wants written guarantees from mediators that Israel will continue to negotiate a permanent cease-fire deal once the first phase goes into effect, the officials said.\nMonths of on-again off-again cease-fire talks have stumbled over Hamas’ demand that any deal include a complete end to the war.\nIsraeli officials have said they are worried Hamas will draw out the talks and the initial cease-fire indefinitely without releasing all the hostages.\nIsrael launched the war in Gaza after Hamas’ October attack in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.", "url": "https://www.twincities.com/2024/07/06/hamas-clears-the-way-for-a-possible-cease-fire-after-dropping-key-demand-officials-say/", "date": "2024-07-06 17:45", "source": "GDELT"}], "location": "GAZA", "total_score": 1.1482491578852527, "count": 3, "average_score": 0.3827497192950842, "final_score": 0.507924803506559}, "54a25a66-3285-4893-b026-8cfc8689c8bb": {"messages": [{"id": "54a25a66-3285-4893-b026-8cfc8689c8bb", "message": "The IDF confirmed: \"A short while ago, the IAF operated in the area of Baalbek to strike and eliminate the terrorist Meitham Mustafa Altaar, a key operative in Hezbollah's Aerial Defense Unit.\"\n\"His elimination significantly harms the capabilities of Hezbollah's Aerial Defense Unit.\"\nThe IDF also stated: \"Following the sirens that sounded at 8:14 in northern Israel, a suspicious aerial target that crossed from Lebanon was successfully intercepted by the IDF Aerial Defense Array.\nTwo suspicious aerial targets that crossed from Lebanon fell in an open area in Beit Hillel.\nLater on Saturday morning, the IDF confirmed that, \"Following the sirens that sounded in Kiryat Shmona a short while ago, a suspicious aerial target that crossed from Lebanon was successfully intercepted by the IDF Aerial Defense Array.", "url": "https://www.israelnationalnews.com/news/392629", "date": "2024-07-06 19:00", "source": "GDELT"}, {"id": "69715018-c65a-46e5-8d7d-fe978bc7e7f0", "message": "IDF Spokesperson: Following the sirens that sounded at 8:14 in northern Israel, a suspicious aerial target that crossed from Lebanon was successfully intercepted by the IDF Aerial Defense Array. No injuries were reported. \n\nShortly after, additional sirens regarding a hostile aircraft infiltration sounded in the area. Two suspicious aerial targets that crossed from Lebanon fell in an open area in Beit Hillel. No injuries were reported.", "url": "https://abualiexpress.com/en/en29994/", "date": "2024-07-06 10:54", "source": "Telegram"}], "location": "Lebanon", "total_score": 0.6401408152012555, "count": 1, "average_score": 0.6401408152012555, "final_score": 0.6280985706408788}}