{"258f1ddc-a2c1-4176-8adb-252bb3508902": {"messages": [{"id": "258f1ddc-a2c1-4176-8adb-252bb3508902", "message": "Smoke rises in the sky over the city after a Russian missile strike, amid Russia's attack on Ukraine, in Kyiv, Ukraine August 26, 2024.\nPHOTO:REUTERSRussia launched several waves of missile and drone attacks overnight targeting Kyiv and other regions, Ukraine's military said early on Tuesday, a day after Moscow's biggest such attack of the war.\nAt least one person was killed when a civilian object was \"wiped out\" in the central Ukraine city of Kryvyi Rih, regional officials said.\nKyiv region's air defence systems were deployed several times overnight to repel missiles and drones targeting the Ukrainian capital, the region's military administration said on Telegram.\nFive civilians may be still under the rubble and four were injured as a result of the Russian attack, Oleksandr Vilkul, head of Kryvyi Rih's military administration, said on Telegram.", "url": "https://tribune.com.pk/story/2491375/russia-pounds-ukraine-with-missiles-for-second-day", "date": "2024-08-27 09:15", "source": "GDELT"}, {"id": "f56f867d-06c3-4148-9989-9a5e58dc135e", "message": "At least five people were killed across Ukraine on Tuesday when heavy Russian airstrikes targeted the country for a second consecutive day.\nThe missile and drone attacks targeted scores of Ukrainian regions, the military said early Tuesday, a day after Moscow's biggest air attack of the war on its neighbor.\nTwo people were killed when a hotel was \"wiped out\" in the central Ukraine city of Kryvyi Rih, regional officials said.\nThe Russian Defense Ministry said that its strikes Monday hit \"all designated targets\" in Ukraine's critical energy infrastructure.\nIn Zaporizhzhia, two people were killed and four injured overnight, Ivan Fedorov, governor of the Zaporizhzhia region, said on Telegram.", "url": "https://www.dailysabah.com/world/europe/heavy-russian-strikes-hitting-ukraine-for-2nd-day-kill-at-least-5", "date": "2024-08-27 09:30", "source": "GDELT"}], "location": ".\nKYIV", "total_score": 0.39524884582212977, "count": 1, "average_score": 0.39524884582212977, "final_score": 0.30667419207549085}, "18b5d7c4-83dd-4aaa-993e-39c2cc8050f5": {"messages": [{"id": "18b5d7c4-83dd-4aaa-993e-39c2cc8050f5", "message": "Tel Aviv | The near-term risk of a broader war in the Middle East has eased after Israel and Lebanon’s Hezbollah exchanged fire without further escalation, but Iran still poses a significant danger as it weighs a strike on Israel, America’s top general says.\nAir Force General C.Q.\nBrown, chairman of the Joint Chiefs of Staff, spoke on Monday (Tuesday AEST) following a three-day trip to the Middle East in which he flew into Israel just hours after Hezbollah launched hundreds of rockets and drones at the country, and Israel’s military struck Lebanon to thwart a larger attack.\nLoading...Reuters", "url": "https://www.afr.com/world/middle-east/risk-of-broader-middle-east-war-has-eased-top-us-general-20240827-p5k5th", "date": "2024-08-27 07:45", "source": "GDELT"}, {"id": "2cdb005b-264c-405a-9ad9-544f8f92be31", "message": "The near-term risk of a broader war in the Middle East has eased somewhat after Israel and Lebanon's Hezbollah exchanged fire without further escalation but Iran still poses a significant danger as it weighs a strike on Israel, America's top general said on Monday.\nThis was the assessment of Air Force Gen. C.Q.\nBrown, chairman of the Joint Chiefs of Staff, after emerging from a three-day trip to the Middle East that saw him fly into Israel just hours after Hezbollah launched hundreds of rockets and drones at Israel, and Israel's military struck Lebanon to thwart a larger attack.\nIt was one of the biggest clashes in more than 10 months of border warfare, but it also ended with limited damage in Israel and without immediate threats of more retaliation from either side.", "url": "https://www.japantimes.co.jp/news/2024/08/27/world/politics/us-general-israel-hezbollah-exchange/", "date": "2024-08-27 04:45", "source": "GDELT"}], "location": "Tel Aviv", "total_score": 0.5681771997561471, "count": 1, "average_score": 0.5681771997561471, "final_score": 0.42772403982930296}, "321520e5-2c07-4b1b-a5cd-494e08fa9ffa": {"messages": [{"id": "321520e5-2c07-4b1b-a5cd-494e08fa9ffa", "message": "Palestinian officials say Israeli airstrikes across the Gaza Strip have killed at least 18 people, including eight children.\nAnother strike late Monday hit a building in downtown Gaza City, killing a child, three women and a man, according to the Gaza Health Ministry.\nPalestinian health officials do not say whether those killed in Israeli strikes are civilians or fighters.\nJereal Dorsey, Brown’s spokesperson, said the chairman met with Israeli Defense Minister Yoav Gallant and Israeli Chief of the General Staff Lt. Gen. Herzi Halevi in Tel Aviv, and he participated in operational updates with Israeli Defense Force senior leaders.\n(AP Photo/Abdel Kareem Hana)RAMALLAH, West Bank — Palestinian health officials say an Israeli airstrike has killed five Palestinians in the northern West Bank.", "url": "https://www.winnipegfreepress.com/world/2024/08/27/israel-hamas-war-latest-israeli-strikes-across-gaza-kill-14-including-children-palestinians-say", "date": "2024-08-27 07:00", "source": "GDELT"}, {"id": "7ec2bbb3-9d20-4bcc-8e84-0e85f37b7b59", "message": "(AP Photo/Abdel Kareem Hana)Palestinian officials say Israeli airstrikes across the Gaza Strip have killed at least 18 people, including eight children.\nRecommended VideosAnother strike late Monday hit a building in downtown Gaza City, killing a child, three women and a man, according to the Gaza Health Ministry.\nPalestinian health officials do not say whether those killed in Israeli strikes are civilians or fighters.\nThe Israeli military said Palestinians had thrown rocks at an Israeli vehicle and at Israeli civilians in the area.\nIsraeli airstrike kills 5 Palestinians in the West Bank, health officials sayRAMALLAH, West Bank — Palestinian health officials say an Israeli airstrike has killed five Palestinians in the northern West Bank.", "url": "https://www.ksat.com/news/world/2024/08/27/israel-hamas-war-latest-israeli-strikes-across-gaza-kill-14-including-children-palestinians-say/", "date": "2024-08-27 11:00", "source": "GDELT"}], "location": "GAZA CITY", "total_score": 0.6393448219940423, "count": 1, "average_score": 0.6393448219940423, "final_score": 0.4775413753958295}, "4e6c5432-1f8d-4418-87ca-04a63e3a926b": {"messages": [{"id": "4e6c5432-1f8d-4418-87ca-04a63e3a926b", "message": "CAIRO (Reuters) - Palestinians displaced by fighting in the Gaza Strip crowded onto the seashore as Israeli forces continued to battle Hamas fighters in central and southern areas, with health officials reporting at least 17 people killed in strikes on Tuesday.\n\"Every day they say talks are progressing, an agreement is close, then all falls like dust.\nDo negotiators know that every day more families get wiped out by Israeli bombardment?\nMore than 40,400 Palestinians have been killed in the war, according to Gaza's health ministry.\nThe conflict was triggered after Hamas militants stormed into southern Israel on Oct. 7 killing 1,200 and taking more than 250 hostages, by Israeli tallies.", "url": "https://www.marketscreener.com/quote/currency/EURO-ISRAELI-NEW-SHEKEL-E-60037304/news/Israel-battles-Hamas-in-Gaza-as-space-for-displaced-families-narrows-47738176/", "date": "2024-08-27 09:30", "source": "GDELT"}, {"id": "d0a48ad1-5edd-454c-a582-d12e1a090fff", "message": "Video obtained by Reuters shows the moment a building in Gaza’s Nuseirat was hit by an Israeli strike.\nVideo: ReutersPalestinians displaced by fighting in the Gaza Strip crowded on to the seashore as Israeli forces continued to battle Hamas fighters in central and southern areas, with health officials reporting at least 17 people killed in strikes on Tuesday.\nPalestinian health officials said Israeli strikes killed nine Palestinians in Bureij and Maghazi, two of Gaza's eight historic refugee camps, while another strike killed five people in Khan Younis and a third killed three others in Rafah.\nMore than 40,400 Palestinians have been killed in the war, said Gaza's health ministry.\nThe conflict was triggered after Hamas militants stormed into southern Israel on October 7th killing 1,200 and taking more than 250 hostages, by Israeli tallies.", "url": "https://www.irishtimes.com/world/middle-east/2024/08/27/seventeen-killed-as-israel-battles-hamas-in-gaza/", "date": "2024-08-27 11:15", "source": "GDELT"}], "location": "GAZA", "total_score": 0.5515196078431372, "count": 1, "average_score": 0.5515196078431372, "final_score": 0.4160637254901961}}