{"9136d3a2-0f08-48c2-a218-8fba09f8b7ac": {"messages": [{"id": "9136d3a2-0f08-48c2-a218-8fba09f8b7ac", "message": "NEW YORK (AP) — Three deans at Columbia University have resigned after exchanging disparaging texts during a campus discussion about Jewish life and antisemitism, the school confirmed Thursday.\nThe resignations come a month after Columbia said it had removed the administrators from their positions and would keep them on leave indefinitely.\nThe Washington Free Beacon obtained some of the private messages through someone who attended the event and took photos of one of the deans’ phones.\nOne suggested that a panelist speaking about antisemitism planned to use it as a fundraising opportunity.\nShafik has promised to launch a “vigorous program of antisemitism and antidiscrimination training for faculty and staff” in the fall, as well as related training for students.", "url": "https://www.winnipegfreepress.com/world/2024/08/08/columbia-university-deans-resign-after-exchanging-disparaging-texts-during-meeting-on-antisemitism", "date": "2024-08-09 01:30", "source": "GDELT"}, {"id": "8e4513ba-e297-4942-a1f0-158ac4cc6788", "message": "The deans said Jews came from a ‘place of privilege’ and it was ‘hard to hear ... woe is me.’Several deans at Columbia University have resigned after exchanging texts disparaging Jews during an event exploring anti-Semitism on the New York school’s campus.\nA university spokesperson said on Aug. 8 that three deans who exchanged the messages have stepped down.\nThe Washington Free Beacon first published portions of the group text in photographs captured by event attendees sitting near the deans.\n“These text messages once again confirm the need for serious accountability across Columbia’s campus.”The administrators have not commented publicly since their messages became public.\nShafik has promised to launch a “vigorous program of antisemitism and antidiscrimination training for faculty and staff” in the fall, as well as related training for students.", "url": "https://www.theepochtimes.com/us/columbia-university-deans-step-down-after-disparaging-texts-during-anti-semitism-meeting-5702757", "date": "2024-08-09 14:45", "source": "GDELT"}], "location": "Based on the text, the most specific location is 'New York.' Columbia University is located in New York, and the events", "total_score": 0.6141848347730701, "count": 1, "average_score": 0.6141848347730701, "final_score": 0.6099293843411491}, "650e52ef-cdc2-46a2-9da9-1fc0e2385766": {"messages": [{"id": "650e52ef-cdc2-46a2-9da9-1fc0e2385766", "message": "Three Columbia University deans who engaged in what the school's administration called troubling text message exchanges that touched on \"ancient antisemitic tropes\" have resigned, a university spokesperson said late on Thursday.\nCristen Kromm, former dean of undergraduate student life; Matthew Patashnick, former associate dean for student and family support; and Susan Chang-Kim, former vice dean and chief administrative officer, were earlier placed on leave as an investigation proceeded.\nA person stands watch at an entrance to the encampment on the university grounds as protests continue at Columbia University, during the ongoing conflict between Israel and the Palestinian Islamist group Hamas, in New York City, US, April 25, 2024.\n(credit: REUTERS/DAVID 'DEE' DELGADO)\"This incident revealed behavior and sentiments that were not only unprofessional but also disturbingly touched on ancient antisemitic tropes,\" the university said in July.\nThe three deans who resigned could not be contacted, and the university spokesperson who confirmed their resignation did not provide further details.", "url": "https://www.jpost.com/diaspora/antisemitism/article-814008", "date": "2024-08-09 06:00", "source": "GDELT"}, {"id": "dbbca40d-eb96-43f5-a292-2dbb8e5293d1", "message": "Three Columbia University deans have resigned following an investigation into troubling text message exchanges that the school’s administration said touched on “ancient antisemitic tropes.”The resignations come amid ongoing protests on college campuses across the US over the country’s support for Israel’s recent war in Gaza, which has sparked allegations of antisemitic and Islamophobic rhetoric.Cristen Kromm, the former dean of undergraduate student life, Matthew Patashnick, the former associate dean for student and family support, and Susan Chang-Kim, the former vice dean and chief administrative officer, were all placed on leave as the investigation proceeded.The message exchanges took place during an event on the Columbia campus titled “Jewish Life on Campus: Past, Present, and Future.” The university said the incident revealed “behavior and sentiments that were not only unprofessional, but also, disturbingly touched on ancient antisemitic tropes.”The three deans who resigned could not be reached for comment.\nThe university did not provide further details on the contents of the text messages or the specific reasons for the resignations.", "url": "https://dailythepatriot.com/three-columbia-deans/", "date": "2024-08-09 07:30", "source": "GDELT"}], "location": ".\nNew York City", "total_score": 0.5631674871293826, "count": 1, "average_score": 0.5631674871293826, "final_score": 0.5742172409905678}}