{"491ac38c-26e0-428b-85be-82624237398c": {"messages": [{"id": "491ac38c-26e0-428b-85be-82624237398c", "message": "An Israeli airstrike in Gaza City killed a senior official in the Hamas-run government Sunday, according to the organization.\nHamas said that Ehab al-Ghussein, the Deputy Minister of Labor, was among four people killed by an Israeli airstrike on the Holy Family School in Gaza City.\nIn May, his sister Muna Jamal and wife Amani Sakeek were killed in an Israeli airstrike, according to reports at the time.\n(AP Photo/Ohad Zwigenberg, Pool)It's not clear whether the strikes were those in which a senior Hamas official was killed.\n(AP Photo/Ohad Zwigenberg, Pool)The strike took place at UNRWA's Al-Jaouni school in al-Nuseirat camp in central Gaza on Saturday.", "url": "https://www.9news.com.au/national/hamas-says-senior-government-official-in-gaza-killed-in-airstrike/40ad4542-8a71-4f8e-b040-64024dc05fa6", "date": "2024-07-08 00:15", "source": "GDELT"}, {"id": "d8919583-5767-469f-a925-81c9ee6d12b3", "message": "CNN —An Israeli airstrike in Gaza City killed a senior official in the Hamas-run government Sunday, according to the organization.\nHamas said that Ehab al-Ghussein, the Deputy Minister of Labor, was among four people killed by an Israeli airstrike on the Holy Family School in Gaza City.\nIn May, his sister Muna Jamal and wife Amani Sakeek were killed in an Israeli airstrike, according to reports at the time.\nThe strike took place at UNRWA’s Al-Jaouni school in al-Nuseirat camp in central Gaza on Saturday.\nThe Israeli military said in a statement on Saturday militants were operating in structures located in the school area.", "url": "https://www.egyptindependent.com/hamas-says-senior-government-official-in-gaza-killed-in-airstrike/", "date": "2024-07-08 12:30", "source": "GDELT"}], "location": "GAZA CITY", "total_score": 0.3125037936267071, "count": 1, "average_score": 0.3125037936267071, "final_score": 0.398752655538695}, "fa0869c4-304f-472a-9d96-ab8095e9badd": {"messages": [{"id": "fa0869c4-304f-472a-9d96-ab8095e9badd", "message": "People work to put out fires after Hezbollah launched projectiles at Israel, amid hostilities between Hezbollah and Israeli forces, in the GalileePeople work to put out fires after Hezbollah launched projectiles at Israel, amid hostilities between Hezbollah and Israeli forces, in the GalileeAMMAN (Reuters) - The Iranian-backed Hezbollah militant group said on Sunday it launched a drone attack on Mount Hermon in the Israeli-occupied Syrian Golan Heights where Israel has a key surveillance centre.\nHezbollah says it would halt operations only when the war ends.\nAlthough it had hit other areas in the occupied Syrian Golan Heights repeatedly, Lebanon's Hezbollah said it was the first time to hit the military target that is at the highest elevation in the Israeli-controlled territory.\nIsrael blames Iranian-backed Hezbollah for the increase in violence and has repeated its vows to restore security to the border.\nThe Israel Defence Forces did not immediately reply to a request for comment on the latest Hezbollah strike.", "url": "https://uk.news.yahoo.com/hezbollah-launches-drone-attack-mount-224349624.html", "date": "2024-07-08 00:00", "source": "GDELT"}, {"id": "577f0c0b-ea90-41e0-9228-5eedd5ee53b0", "message": "Hezbollah launches drone attack on Mount Hermon in Israeli-occupied Syrian Golan HeightsWorld World Hezbollah launches drone attack on Mount Hermon in Israeli-occupied Syrian Golan HeightsIt said this was its first such bombing since it began trading fire with Israel on Oct. 8Follow on Published On: Mon, 08 Jul 2024 11:15:56 PKTAMMAN (Reuters) – The Iranian-backed Hezbollah militant group said on Sunday it launched a drone attack on Mount Hermon in the Israeli-occupied Syrian Golan Heights where Israel has a key surveillance centre.\nAlthough it had hit other areas in the occupied Syrian Golan Heights repeatedly, Lebanon's Hezbollah said it was the first time to hit the military target that is at the highest elevation in the Israeli-controlled territory.\nIsrael has key surveillance, espionage and air defence installations on Mount Hermon where it overlooks the Syrian capital and serves to monitor Syria, Iraq, Jordan and parts of Saudi Arabia since the 1973 Oct. Arab-Israeli war.\nIsrael blames Iranian-backed Hezbollah for the increase in violence and has repeated its vows to restore security to the border.\nThe Israel Defence Forces did not immediately reply to a request for comment on the latest Hezbollah strike.", "url": "https://dunyanews.tv/en/World/822993-Hezbollah-launches-drone-attack-on-Mount-Hermon-in-Israeli-occupied-Syri", "date": "2024-07-08 07:15", "source": "GDELT"}], "location": "Mount Hermon", "total_score": 0.4818513944633117, "count": 1, "average_score": 0.4818513944633117, "final_score": 0.5172959761243182}, "6318aef5-eacb-457e-bc4d-3f7e42d7cafc": {"messages": [{"id": "6318aef5-eacb-457e-bc4d-3f7e42d7cafc", "message": "All times Eastern:Jul 07, 5:07 PMAmerican hurt by Hezbollah rocket fire: US EmbassyA U.S. citizen was injured Sunday by one of multiple rockets fired into Israel from Lebanon by the terrorist group Hezbollah, according to the U.S. embassy in Israel.\nThe answer is yes,” Israel Defense Forces spokesman Daniel Hagari told ABC News.\nFires broke out in several areas of northern Israel due to UAVs and shrapnel from interceptions of the projectiles falling in the area, the Israel Defense Forces said.\nAs the sirens began “numerous projectiles and suspicious aerial targets crossed from Lebanon into Israeli territory,” the Israel Defense Forces said.\nA senior Hezbollah official said this week it can only sign the deal after Israel reaches a cease-fire with Hamas in Gaza.", "url": "https://www.kdks.fm/syndicated-article/?id=1572857", "date": "2024-07-08 00:45", "source": "GDELT"}, {"id": "6384e45e-557c-47ae-9063-c7a71f27e730", "message": "Tents sheltering displaced Palestinians in Rafah in the southern Gaza Strip are pictured on June 4, 2024 amid the ongoing conflict in the Palestinian territory between Israel and Hamas.\nThe answer is yes,\" Israel Defense Forces spokesman Daniel Hagari told ABC News.\nFires broke out in several areas of northern Israel due to UAVs and shrapnel from interceptions of the projectiles falling in the area, the Israel Defense Forces said.\nAs the sirens began \"numerous projectiles and suspicious aerial targets crossed from Lebanon into Israeli territory,\" the Israel Defense Forces said.\n\"A number of the projectiles were intercepted and some of the projectiles fell inside southern Israel.", "url": "https://hitsfm.net/world/85ef484998d1c610a8b8b6278b43abda", "date": "2024-07-08 00:00", "source": "GDELT"}], "location": ".\nIsrael", "total_score": 0.47861108474897984, "count": 1, "average_score": 0.47861108474897984, "final_score": 0.5150277593242859}, "c107db05-2b00-4b6c-9adf-afb01dcbe767": {"messages": [{"id": "c107db05-2b00-4b6c-9adf-afb01dcbe767", "message": "FILE - Kim Yo Jong attends a wreath-laying ceremony at Ho Chi Minh Mausoleum in Hanoi, Vietnam, March 2, 2019.\nThe powerful sister of North Korean leader Kim Jong Un called South Koreas recent front-line live-fire drills suicidal hysteria as she threatened unspecified military steps Monday, July 8, 2024, if further provoked.\n(Jorge Silva/Pool Photo via AP, File)SEOUL – The powerful sister of North Korean leader Kim Jong Un called South Korea’s recent front-line live-fire drills “suicidal hysteria” as she threatened unspecified military steps Monday if further provoked.\nThe warning by Kim Yo Jong came after South Korea resumed firing exercises near its tense land and sea borders with North Korea in the past two weeks.\nShe accused South Korea’s conservative government of deliberately escalating tensions as a way to escape a domestic political crisis.", "url": "https://www.wsls.com/news/world/2024/07/08/sister-of-north-korean-leader-kim-calls-south-koreas-live-fire-drills-suicidal-hysteria/", "date": "2024-07-08 03:45", "source": "GDELT"}, {"id": "02db8a44-503d-4908-9c9f-9bd96f35a8a3", "message": "The powerful sister of North Korean leader Kim Jong-un called South Korea’s recent front-line live-fire drills “suicidal hysteria” as she threatened unspecified military steps on Monday if further provoked.\nThe warning by Kim Yo Jong came after South Korea performed firing exercises in its tense land and sea borders with North Korea in the past two weeks.\nThe powerful sister of North Korean leader Kim Jong Un called South Koreas recent front-line live-fire drills suicidal hysteria as she threatened unspecified military steps.\nShe accused South Korea’s conservative government of deliberately escalating tensions as a way to escape a domestic political crisis.\nNorth Korean leaders Kim Jong-un (AP)North Korea has been engaged in a provocative run of weapons tests since 2022.", "url": "https://www.9news.com.au/world/north-korean-leader-kim-sister-calls-south-koreas-livefire-drills-suicidal-hysteria/bebf7e0f-26ff-4737-a618-e0822a515802", "date": "2024-07-08 05:00", "source": "GDELT"}, {"id": "cbd39f74-258b-4daf-8289-17f0454788d7", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}The sister of North Korean leader Kim Jong Un has called South Korea’s front-line live-fire drills “suicidal hysteria” as she threatened unspecified military steps.\nThe warning by Kim Yo Jong came after South Korea performed firing exercises in its tense land and sea borders with North Korea in the past two weeks.\nShe accused South Korea’s conservative government of deliberately escalating tensions as a way to escape a domestic political crisis.\nNorth Korean leader Kim Jong Un’s younger sister Kim Yo Jong, center ( Copyright 2018 The Associated Press.", "url": "https://www.independent.co.uk/asia/east-asia/kim-jong-un-sister-south-korea-b2575811.html", "date": "2024-07-08 09:45", "source": "GDELT"}], "location": "NULL", "total_score": 1.0256545330552784, "count": 2, "average_score": 0.5128272665276392, "final_score": 0.5689790865693474}, "3b585262-7edf-40f1-a4e4-563fadc5c9b6": {"messages": [{"id": "3b585262-7edf-40f1-a4e4-563fadc5c9b6", "message": "Tel Aviv: Marking nine months since the war in Gaza started, Israeli protesters blocked highways across the country Sunday, calling on Prime Minister Benjamin Netanyahu to step down and pushing for a cease-fire that could bring back the hostages held by Hamas.\nNear the border with Gaza, Israeli protestors released 1,500 black and yellow balloons to symbolize those who were killed and abducted.\nAbout 120 hostages remain captive after more than 100 hostages were released as part of a November cease-fire deal.\nMeanwhile, fighting in Gaza continued, with nine Palestinians reported dead from Israeli strikes overnight and into the early hours of Sunday.\nThe Israeli military said they were targeting Hamas militants and had taken numerous steps to reduce civilian casualties.", "url": "https://www.deccanchronicle.com/world/asia/israeli-protesters-block-highways-1809003", "date": "2024-07-08 09:15", "source": "GDELT"}, {"id": "606672b4-db1c-42cd-a43f-dfe989bb14e8", "message": "Tel aviv (AP):Marking nine months since the war in Gaza started, Israeli protesters blocked highways across the country on Sunday, calling on Prime Minister Benjamin Netanyahu to step down and pushing for a ceasefire to bring back scores of hostages held by Hamas.\nThe militant group is still seeking a permanent ceasefire, while Netanyahu has vowed to keep fighting until Hamas is destroyed.\nNear the border with Gaza, Israeli protesters released 1,500 black and yellow balloons to symbolise those fellow citizens who were killed and abducted.\nShe added: “It’s nine months today, to this black day, and still nobody in our government takes responsibility.”About 120 hostages remain captive after more than 100 hostages were released as part of a November ceasefire deal.\nThe United States has rallied the world behind a proposal for a phased ceasefire in which Hamas would release the remaining captives in return for a lasting ceasefire and the withdrawal of Israeli forces from Gaza.", "url": "https://jamaica-gleaner.com/article/world-news/20240708/protesters-block-highways-call-ceasefire-return-hostages", "date": "2024-07-08 06:00", "source": "GDELT"}, {"id": "a5023019-4bbb-4147-a1c6-41f7dd21fd14", "message": "The militant group still wants mediators to guarantee a permanent cease-fire, while Netanyahu is vowing to keep fighting until Israel destroys Hamas' military and governing capabilities.\nNear the border with Gaza, Israeli protesters released 1,500 black and yellow balloons to symbolize those fellow citizens who were killed and abducted.\nShe added: \"It's nine months today, to this black day, and still nobody in our government takes responsibility.\"\nAbout 120 hostages remain captive after more than 100 hostages were released as part of a November cease-fire deal.\nIsraeli airstrikes overnight and into Sunday meanwhile killed at least 13 Palestinians, including the undersecretary of labor in the largely dismantled Hamas-run government.", "url": "https://www.arkansasonline.com/news/2024/jul/08/israeli-protests-block-highways-push-deal/", "date": "2024-07-08 10:00", "source": "GDELT"}, {"id": "68c2e792-01d5-41b6-b8a6-1f542e6ee43e", "message": "Israel’s war with Hamas militants reached the nine-month mark Sunday, with Israeli protesters blocking highways across the country, calling for Prime Minister Benjamin Netanyahu to resign and pushing for a cease-fire.\nNear the border with Gaza, Israeli protesters released 1,500 black and yellow balloons to symbolize those who were killed and abducted.\nMeanwhile, fighting raged on, with at least nine Palestinians killed in Israeli strikes.\nThe Israeli military said it was looking into the report.\nIsrael and Hamas, however, may be inching closer to an elusive cease-fire after Hamas dropped its demand that any deal include a complete end to the war, although both sides said significant gaps remain.", "url": "https://www.newdelhitimes.com/protests-in-israel-mark-9-months-of-war-with-hamas/", "date": "2024-07-08 18:45", "source": "GDELT"}, {"id": "16e48e54-53b2-4388-aca0-c1ee4e84937c", "message": "Near the border with Gaza, Israeli protestors released 1,500 black and yellow balloons to symbolize those fellow citizens who were killed and abducted.\nAbout 120 hostages remain captive after more than 100 hostages were released as part of a November cease-fire deal.\nOn Sunday, Israel issued new evacuation orders for parts of Gaza City, which was heavily bombed and largely emptied early in the war.\nHezbollah began launching rocket and mortar attacks after the outbreak of the war in Gaza.\nHezbollah has said it will halt its attacks if there is a cease-fire in Gaza.", "url": "https://wsvn.com/news/us-world/israeli-protesters-block-highways-call-for-cease-fire-to-return-hostages-9-months-into-war-in-gaza/", "date": "2024-07-08 15:30", "source": "GDELT"}], "location": "Tel Aviv", "total_score": 2.415253895391806, "count": 4, "average_score": 0.6038134738479515, "final_score": 0.6926694316935661}, "dfaa4454-daf3-40be-b79e-a35750c4d0db": {"messages": [{"id": "dfaa4454-daf3-40be-b79e-a35750c4d0db", "message": "A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.\nAn entire section of a residential multistory building in one district of Kyiv was destroyed, officials said.", "url": "https://www.theyeshivaworld.com/news/general/2295363/no-jews-no-protests-russia-fires-40-missiles-one-hits-kyiv-childrens-hospital-kills-at-least-31-injures-130.html", "date": "2024-07-08 14:30", "source": "GDELT"}, {"id": "25f3dac8-441d-4f83-b11e-940ddbc3864f", "message": "Rescuers, volunteers and medical workers clean up the rubble and search victims after Russian missile hit oncology clinic, left, and dialysis clinic, right, of the country's main children hospital Okhmadit in Kyiv, Ukraine, Monday, July 8, 2024.\nA major Russian missile attack across Ukraine killed at least 20 people and injured more than 50 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched rubble for casualties.\n(AP Photo/Efrem Lukatsky)KYIV, Ukraine — A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.", "url": "https://www.adn.com/nation-world/2024/07/08/russian-missile-strikes-childrens-hospital-as-5-ukrainian-cities-targeted-in-major-attack/", "date": "2024-07-08 13:30", "source": "GDELT"}, {"id": "5e65fe48-c835-4e3f-85f1-9e77c6a05dee", "message": "We stand with Ukraine against Russian aggression – our support won’t falter.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers are searching for people under the rubble of a partially collapsed, two-storey wing of the facility.\nA major Russian missile attack across Ukraine killed at least 20 people and injured more than 50 (AP)On the hospital’s main 10-storey building, windows and doors were blown out and walls were blackened.\nIt denied aiming at any civilian facilities and claimed without offering evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defence missile.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.", "url": "https://www.oxfordmail.co.uk/news/national/24437689.russian-missile-strike-ukraine-kills-28-hits-kyiv-childrens-hospital/", "date": "2024-07-08 14:30", "source": "GDELT"}, {"id": "2f139ac8-befb-4ae7-b1ba-92f78a0f85d0", "message": "Russian missiles killed at least seven people and struck a children's hospital in the Ukrainian capital, Kyiv, on Monday, while another attack in the central Ukrainian city of Kryvyi Rih killed at least 10.\nAt the Okhmatdyt children's hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed wing of the facility, Zelenskyy said, adding that the number of casualties was not yet known.\nA two-story building at the children's hospital was partly destroyed.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.\nThe Kyiv city administration reported falling debris, presumably from intercepted missiles, in a handful of Kyiv areas, starting fires.", "url": "https://news4sanantonio.com/news/nation-world/russian-missiles-strike-kyiv-childrens-hospital-killing-at-least-20-across-ukraine", "date": "2024-07-08 13:30", "source": "GDELT"}, {"id": "c7be0c86-6b08-4658-805b-0f81f3f7df74", "message": "A major Russian missile attack across Ukraine killed at least 20 people and injured more than 50 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv.\nEmergency crews searched rubble for casualties after a Russian barrage targeted five Ukrainian cities with more than 40 missiles of different types, hitting apartment buildings and public infrastructure.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed wing of the facility, Ukrainian president Volodymyr Zelensky said, adding that the number of casualties was not yet known.", "url": "https://www.independent.co.uk/tv/news/ukraine-childrens-hospital-kyiv-missile-attack-b2575946.html", "date": "2024-07-08 14:15", "source": "GDELT"}, {"id": "eff1b5b0-c189-4793-9b6f-dd3b9071b095", "message": "A major Russian missile attack on Ukraine kills at least 28 people and hits a children’s hospitalBy Hanna Arhirova And Illia Novikov, The Associated Press on July 8, 2024.\nShare this story:KYIV, Ukraine (AP) – A major Russian missile attack across Ukraine killed at least 28 people and injured almost 100 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nWestern leaders who have backed Ukraine in the war are holding a three-day NATO summit in Washington beginning Tuesday.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.", "url": "https://medicinehatnews.com/news/world-news/2024/07/08/a-major-russian-missile-attack-on-ukraine-kills-at-least-28-people-and-hits-a-childrens-hospital/", "date": "2024-07-08 13:30", "source": "GDELT"}, {"id": "a7903986-1fc9-48dc-a245-3684d2d81555", "message": "A major Russian missile attack across Ukraine on July 8 killed at least 31 people and injured 154, officials said, with one striking a large children’s hospital in the capital of Kyiv, where emergency crews searched the rubble for victims.\nStrikes in Kryvyi Rih, Mr. Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nMr. Zelenskyy said during a visit to Poland he hopes the summit will provide more air defense systems for Ukraine.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers searched for victims under the rubble of a partially collapsed, two-story wing of the facility.\nAbout three hours after the first strikes, more missiles hit Kyiv and partially destroyed a private medical center.", "url": "https://www.csmonitor.com/World/Europe/2024/0708/russia-ukraine-children-hospital-bombing", "date": "2024-07-08 17:15", "source": "GDELT"}, {"id": "43623267-a0fc-48ab-b88e-95846081580d", "message": "It was Russia’s heaviest bombardment of Kyiv in almost four months, hitting seven of the city’s 10 districts.\nSeven people were killed in the capital, including two staff members at the hospital, where three children were hurt.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers searched for victims under the rubble of a partially collapsed, two-story wing of the facility.\nIt denied aiming at any civilian facilities and claimed without evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defense missile.\nSome of the weapons used in the attack, Ukraine’s air force said, were Kinzhal hypersonic missiles, which are among the most advanced Russian weapons.", "url": "https://www.airdriecityview.com/world-news/russias-heaviest-bombardment-of-kyiv-in-4-months-hits-a-childrens-hospital-9188575", "date": "2024-07-08 17:45", "source": "GDELT"}, {"id": "2a2880ec-5fad-44d0-a4c6-fb4170596836", "message": "A Kyiv children’s hospital is struck by a cruise missile as Russia bombards UkraineBy Hanna Arhirova And Illia Novikov, The Associated Press on July 8, 2024.\nShare this story:KYIV, Ukraine (AP) – A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nWestern leaders who have backed Ukraine in the war are holding a three-day NATO summit in Washington beginning Tuesday.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.", "url": "https://medicinehatnews.com/news/world-news/2024/07/08/a-kyiv-childrens-hospital-is-struck-by-a-cruise-missile-as-russia-bombards-ukraine/", "date": "2024-07-08 13:30", "source": "GDELT"}], "location": "Kyiv", "total_score": 4.472580046843278, "count": 8, "average_score": 0.5590725058554098, "final_score": 0.7813507540987868}, "ac84f23a-5c4f-4bc2-9e0a-f3b7bb11df22": {"messages": [{"id": "ac84f23a-5c4f-4bc2-9e0a-f3b7bb11df22", "message": "At least 20 people have been killed after Russia launched a massive missile attack against cities across Ukraine, according to officials.\nIn the capital, Kyiv, at least seven people were killed in a rare daytime attack.\nThe city's mayor said a children's hospital was hit by the missile strike and was being evacuated.\nResidential buildings, infrastructure and a children's hospital were damaged,\" he said.\nPlumes of smoke could be seen across the capital Kyiv, while video posted on social media showed the destruction inside and outside of the Okhmadyt children's hospital.", "url": "https://www.the-star.co.ke/news/world/2024-07-08-at-least-20-dead-in-russian-attack-on-ukraine-cities/", "date": "2024-07-08 10:45", "source": "GDELT"}, {"id": "4c794e94-71c6-402f-b13c-ae7799bbd70c", "message": "Photo: Anatolii Stepanov / AFPAt least 20 people have been killed after Russia launched a massive missile attack against cities across Ukraine, according to officials.\nThe city's mayor said a children's hospital was hit by the missile strike and was being evacuated.\nResidential buildings, infrastructure and a children's hospital were damaged,\" Zelensky said.\nRussian terrorists have once again launched a massive missile attack on Ukraine.\nApartment buildings, infrastructure, and a children's hospital have been damaged.", "url": "https://www.rnz.co.nz/news/world/521617/at-least-20-dead-in-russian-attack-on-ukraine-cities", "date": "2024-07-08 11:15", "source": "GDELT"}, {"id": "4739db9d-6d3c-459b-8552-6d796ddf0f44", "message": "Spread the loveBy Agency ReportsAt least 20 people have been killed after Russia launched a large-scale missile attack on cities across Ukraine, according to officials.\nThe city’s mayor reported that a children’s hospital was hit by the missile strike and was being evacuated.\n“Different cities: Kyiv, Dnipro, Kryvy Rih, Sloviansk, Kramatorsk.\nResidential buildings, infrastructure, and a children’s hospital were damaged,” he said.\nPlumes of smoke were visible across the capital, Kyiv, while videos posted on social media showed the destruction both inside and outside the Okhmadyt children’s hospital.", "url": "https://dailyreviewonline-ng.com/2024/07/08/73691/", "date": "2024-07-08 18:45", "source": "GDELT"}], "location": "KYIV", "total_score": 0.8987244457241579, "count": 2, "average_score": 0.44936222286207894, "final_score": 0.5245535560034552}, "274dfa35-b89a-4135-a633-3aac9a679dad": {"messages": [{"id": "274dfa35-b89a-4135-a633-3aac9a679dad", "message": "KYIV, Ukraine (AP) — A major Russian missile attack across Ukraine on Monday killed at least 31 people and injured 154, officials said, with one striking a large children’s hospital in the capital of Kyiv, where emergency crews searched the rubble for victims.\nStrikes in Kryvyi Rih, Zelenskyy’s birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nZelenskyy said during a visit to Poland he hopes the summit will provide more air defense systems for Ukraine.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers searched for victims under the rubble of a partially collapsed, two-story wing of the facility.\nAbout three hours after the first strikes, more missiles hit Kyiv and partially destroyed a private medical center.", "url": "https://apnews.com/article/russia-ukraine-war-kyiv-attack-33aecd50cf252ff6184c0c14f90588b5", "date": "2024-07-08 13:00", "source": "GDELT"}, {"id": "68d09d1f-35c3-400f-8c3f-4e1c010761e4", "message": "A major Russian missile attack across Ukraine killed at least 31 people and injured almost 130 on Monday, officials said, with one missile striking a large children’s hospital in the capital, Kyiv, where emergency crews searched the rubble for casualties.\nStrikes in Kryvyi Rih, Zelenskyy's birthplace in central Ukraine, killed 10 people and injured 47 in what the head of city administration, Oleksandr Vilkul, said was a massive missile attack.\nWestern leaders who have backed Ukraine in the war are holding a in Washington beginning Tuesday.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers were searching for people under the rubble of a partially collapsed, two-story wing of the facility.\nAn entire section of a residential multistory building in one district of Kyiv was destroyed, officials said.", "url": "https://wgme.com/news/nation-world/russian-missiles-strike-kyiv-childrens-hospital-killing-at-least-20-across-ukraine", "date": "2024-07-08 13:30", "source": "GDELT"}], "location": "Kyiv", "total_score": 0.39071580439404685, "count": 1, "average_score": 0.39071580439404685, "final_score": 0.4535010630758328}, "b53c5c8e-4cf2-42a7-87a8-c574ee0c45d9": {"messages": [{"id": "b53c5c8e-4cf2-42a7-87a8-c574ee0c45d9", "message": "People shelter in a metro station during Russian missile strikes on Kyiv, amid Russia’s attack on Ukraine, in Kyiv, Ukraine, July 8, 2024.\n(Reuters)Russia launched a barrage of missiles on Kyiv and other Ukrainian cities in a rare daytime attack on Monday, killing at least 20 people across the country and hitting a key children's hospital, officials said.\nPresident Volodymyr Zelenskiy said the Russian forces fired more than 40 missiles targeting different cities and damaging infrastructure, commercial and residential buildings in different Ukrainian cities.\nKyiv city authorities said seven people were killed and at least 25 were wounded in the strike on the capital.\nAnother three people died in Pokrovsk in eastern Ukraine when missiles hit an industrial facility, said Donetsk regional governor.", "url": "https://www.thestandard.com.hk/breaking-news/section/6/218201/Russian-daytime-attack-on-Ukraine-kills-at-least-20,-hits-children", "date": "2024-07-08 11:00", "source": "GDELT"}, {"id": "53c86c5f-804d-4af1-bb6c-62c51ad5d037", "message": "Russian daytime attack on Ukraine kills at least 20, hits children’s hospital in Kyivreuters_tickers2 minutesBy Olena Harmash and Max HunderKYIV (Reuters) -Russia launched a barrage of missiles on Kyiv and other Ukrainian cities in a rare daytime attack on Monday, killing at least 20 people across the country and hitting a key children’s hospital, officials said.\nPresident Volodymyr Zelenskiy said the Russian forces fired more than 40 missiles targeting different cities and damaging infrastructure, commercial and residential buildings in different Ukrainian cities.\nKyiv city authorities said seven people were killed and at least 25 were wounded in the strike on the capital.\nAnother three people died in Pokrovsk in eastern Ukraine when missiles hit an industrial facility, said Donestk regional governor.\nThe major attack on Ukraine came as Hungarian Prime Minister Viktor Orban met Chinese President Xi Jinping to discuss a potential Ukraine peace deal, paying an unexpected visitto Beijing.", "url": "https://www.swissinfo.ch/eng/ukrainian-air-defence-engaged-in-repelling-russian-missile-attack-on-kyiv%2c-officials/83102460", "date": "2024-07-08 11:15", "source": "GDELT"}, {"id": "07308d73-15e0-4c0b-bd56-6c8b71931529", "message": "KYIV: Russia launched a barrage of missiles on Kyiv and other Ukrainian cities in a rare daytime attack on Monday, killing at least 20 people across the country and hitting a key children’s hospital, officials said.\nPresident Volodymyr Zelenskiy said the Russian forces fired more than 40 missiles targeting different cities and damaging infrastructure, commercial and residential buildings in different Ukrainian cities.\nKyiv city authorities said seven people were killed and at least 25 were wounded in the strike on the capital.\nAnother three people died in Pokrovsk in eastern Ukraine when missiles hit an industrial facility, said Donestk regional governor.\nAt least seven wounded in Russian attack on Ukraine’s Chuhuiv, governor saysLocal and regional authorities said industrial facilities, infrastructure and residential and commercial buildings were damaged in Kyi, Kryviy Rih, Dnipro, Pokrovsk, Kramatarosk and others.", "url": "https://www.brecorder.com/news/40311792/russian-daytime-attack-on-ukraine-kills-at-least-20-hits-childrens-hospital-in-kyiv", "date": "2024-07-08 12:15", "source": "GDELT"}], "location": "KYIV", "total_score": 0.7523809533546372, "count": 2, "average_score": 0.3761904766773186, "final_score": 0.473333333674123}, "8d2824cf-62e8-48ec-b8f3-4ae23db58852": {"messages": [{"id": "8d2824cf-62e8-48ec-b8f3-4ae23db58852", "message": "Russian missiles have killed at least seven people and struck a children’s hospital in the Ukrainian capital Kyiv, authorities said.\nAnother Russian attack in the central Ukrainian city of Kryvyi Rih is said to have killed at least 10 people.\nAdvertisementThe Russian barrage targeted five Ukrainian cities with more than 40 missiles of different types, hitting apartment buildings and public infrastructure, Ukrainian president Volodymyr Zelenskiy said in a social media post.\nOkhmatdyt Children's Hospital in Kyiv.\nApartment buildings, infrastructure, and a children's hospital have been damaged.", "url": "https://www.breakingnews.ie/ukraine/childrens-hospital-struck-in-russian-missile-attack-on-ukrainian-cities-1647200.html", "date": "2024-07-08 10:45", "source": "GDELT"}, {"id": "d582a437-e6ab-4cfb-b478-16692f7c9e4f", "message": "Russian missiles have struck a children's hospital in Kyiv and killed at least three people elsewhere in the Ukrainian capital, authorities have said.\n'More than 40 missiles of various types Residential buildings, infrastructure, and a children's hospital have been damaged.'\n'Russia's strike on the Okhmatdyt Children's Hospital in Kyiv is an appalling attack on Ukrainian civilians,' Mr Lammy wrote on Twitter.\nFrance's foreign ministry called the day-time bombardment of a children's hospital in Kyiv 'barbaric'.\nThe Ohmatdyt Children's Hospital in Kyiv is the largest children's hospital in Ukraine, and is famous around Europe for its excellence.", "url": "https://www.dailymail.co.uk/news/article-13611309/Childrens-hospital-blown-genocidal-missile-strike-Kyiv.html", "date": "2024-07-08 09:45", "source": "GDELT"}, {"id": "bdf1f1c1-df81-424a-a35c-76834a40f62a", "message": "In the Ukrainian capital of Kyiv, at least seven people were killed after a Russian missile struck a children’s hospital on Monday.\nAdvertisementZelenskyy condemns the incidentIn a post on X, the Ukrainian leader mentioned that over 40 missiles struck different cities across the country.\nIn a separate post, Zelenskyy shared the video of the devastation from the Okhmatdyt Children’s Hospital in Kyiv.\nApartment buildings, infrastructure, and a children's hospital have been damaged.\nOkhmatdyt Children's Hospital in Kyiv.", "url": "https://www.firstpost.com/world/several-dead-as-russian-missiles-strike-childrens-hospital-multiple-ukrainian-cities-13790695.html", "date": "2024-07-08 11:00", "source": "GDELT"}], "location": "Kyiv", "total_score": 1.3389885126561143, "count": 2, "average_score": 0.6694942563280571, "final_score": 0.67864597942964}, "65750737-f46c-45da-ab36-d35f27cbb13c": {"messages": [{"id": "65750737-f46c-45da-ab36-d35f27cbb13c", "message": "The FSB claimed on its website on Monday that it had thwarted a plot by Ukrainian special services supported by other Western intelligence agencies to hijack a Tu-22M3 supersonic strategic bomber, without producing any verifiable evidence.\nAccording to its announcement which was reported by TASS, Ukrainian intelligence officers had offered an unnamed pilot from Russia’s Aerospace Forces $2 million along with an offer of Italian citizenship to fly and land the missile carrier in Ukraine.\nDuring its operation, the FSB said it had received information that allowed Russia to carry out a strike on the Ozerne airfield in northwestern Ukraine.\nHowever, no details of when the operation to prevent the hijacking or when the alleged strike on the airfield occurred.\nIn return for his actions he received $500,000 and a Ukrainian passport in the name of Igor Shevchenko.", "url": "https://www.kyivpost.com/post/35472", "date": "2024-07-08 09:45", "source": "GDELT"}, {"id": "cb6000fe-e2c6-4fe6-8bee-d215e70c6648", "message": "Home WorldRussia says it foils Ukraine bid to hijack strategic bomberAmmon News - Russia's Federal Security Service (FSB) blocked an attempt by Ukraine to organise the hijacking of a Russian Tu-22M3 strategic bomber and fly it to Ukraine, the FSB said on Monday.\n\"Ukrainian intelligence intended to recruit a Russian military pilot for a monetary reward and the provision of Italian citizenship, to persuade him to fly and land a missile carrier in Ukraine,\" the FSB, the main successor to the Soviet-era KGB, said on its website.\nDuring the operation, Russia received information that helped its forces to strike the Ozerne airfield in northwestern Ukraine, the FSB added in its statement.\nThe timings of the operation and the alleged strikes on the Ozerne airfield in Ukraine's Zhytomyr were both unclear.", "url": "https://en.ammonnews.net/article/73688", "date": "2024-07-08 13:30", "source": "GDELT"}], "location": "The operation mentioned by the FSB, however, did not explicitly state where the operation actually took place", "total_score": 0.6743584530586428, "count": 1, "average_score": 0.6743584530586428, "final_score": 0.65205091714105}, "dca81cd3-00f3-4deb-a6d2-e6593b2aac52": {"messages": [{"id": "dca81cd3-00f3-4deb-a6d2-e6593b2aac52", "message": "It was Russia's heaviest bombardment of Kyiv in almost four months, hitting seven of the city's 10 districts.\nAt the Okhmatdyt children's hospital in Kyiv, rescuers searched for victims under the rubble of a partially collapsed, two-story wing of the facility.\nHospitals and other medical facilities are protected from military strikes under international law unless they are being used for military operations.\nRussia's Defence Ministry said the strikes targeted Ukrainian defense plants and military air bases and were successful.\nIt denied aiming at any civilian facilities and claimed without evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defence missile.", "url": "https://www.ctvnews.ca/world/russian-missiles-hit-a-children-s-hospital-in-the-ukrainian-capital-and-kill-at-least-20-elsewhere-1.6955050", "date": "2024-07-08 12:30", "source": "GDELT"}, {"id": "6764cf88-36a5-4c76-98fa-0361651ea639", "message": "Zelenskyy said during a visit to Poland that he hopes the summit will provide more air defense systems for Ukraine.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers searched for victims under the rubble of a partially collapsed, two-story wing of the facility.\nRussia’s Defense Ministry said the strikes targeted Ukrainian defense plants and military air bases and were successful.\nIt denied aiming at any civilian facilities and claimed without evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defense missile.\nAbout three hours after the first strikes, more missiles hit Kyiv and partially destroyed a private medical center.", "url": "https://www.nbcnewyork.com/news/national-international/dozens-killed-kyiv-childrens-hospital-hit-as-russia-bombards-ukraine/5575923/", "date": "2024-07-08 18:15", "source": "GDELT"}, {"id": "9517ce1a-0562-4da3-823b-f49df1aa7ed3", "message": "United Nations Secretary-General António Guterres condemned the attacks, calling the strikes on the Kyiv hospital and on another medical facility in the capital’s Dniprovsky district “particularly shocking,” spokesman Stephane Dujarric said.\nThe United Nations Security Council will meet on Tuesday to discuss the Russian attack, diplomats said.\nRussia's defense ministry said the strikes targeted Ukrainian defense plants and military air bases and were successful.\nIt denied aiming at any civilian facilities and claimed without evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defense missile.\nThe Russian attack overnight included a fourth Kh-101 missile, as well as two Iskander-M ballistic missiles, the Ukrainian air force said.", "url": "https://www.voanews.com/a/russia-hits-children-s-hospital-in-ukraine-s-capital-during-widespread-deadly-missile-attack-/7688979.html", "date": "2024-07-08 11:45", "source": "GDELT"}, {"id": "4c057290-4e8e-40fe-99f8-50bc4a878728", "message": "We stand with Ukraine against Russian aggression – our support won’t falter.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers are searching for people under the rubble of a partially collapsed, two-storey wing of the facility.\nA major Russian missile attack across Ukraine killed at least 20 people and injured more than 50 (AP)On the hospital’s main 10-storey building, windows and doors were blown out and walls were blackened.\nIt denied aiming at any civilian facilities and claimed without offering evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defence missile.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.", "url": "https://www.freepressseries.co.uk/news/national/24437689.russian-missile-strike-ukraine-kills-28-hits-kyiv-childrens-hospital/", "date": "2024-07-08 15:15", "source": "GDELT"}], "location": "KYIV, UKRAINE", "total_score": 1.7847303107583588, "count": 3, "average_score": 0.5949101035861196, "final_score": 0.6564370725102837}, "dcee980d-ce3f-48c7-848b-dc0158e14f5f": {"messages": [{"id": "dcee980d-ce3f-48c7-848b-dc0158e14f5f", "message": "Zelenskyy said during a visit to Poland that he hopes the summit will provide more air defense systems for Ukraine.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers searched for victims under the rubble of a partially collapsed, two-story wing of the facility.\nRussia’s Defense Ministry said the strikes targeted Ukrainian defense plants and military air bases and were successful.\nIt denied aiming at any civilian facilities and claimed without evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defense missile.\nAbout three hours after the first strikes, more missiles hit Kyiv and partially destroyed a private medical center.", "url": "https://www.nbcdfw.com/news/national-international/dozens-killed-kyiv-childrens-hospital-hit-as-russia-bombards-ukraine/3586285/", "date": "2024-07-08 18:45", "source": "GDELT"}, {"id": "77003228-d426-4fec-b9d5-9c58410f15d6", "message": "We stand with Ukraine against Russian aggression – our support won’t falter.\nAt the Okhmatdyt children’s hospital in Kyiv, rescuers are searching for people under the rubble of a partially collapsed, two-storey wing of the facility.\nA major Russian missile attack across Ukraine killed at least 20 people and injured more than 50 (AP)On the hospital’s main 10-storey building, windows and doors were blown out and walls were blackened.\nIt denied aiming at any civilian facilities and claimed without offering evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defence missile.\nThe daylight attacks included Kinzhal hypersonic missiles, one of the most advanced Russian weapons, the Ukrainian air force said.", "url": "https://www.dumbartonreporter.co.uk/news/national/24437689.russian-missile-strike-ukraine-kills-28-hits-kyiv-childrens-hospital/", "date": "2024-07-08 15:15", "source": "GDELT"}, {"id": "b5d72105-cc49-4cf5-b50f-4d9cf73a2bcf", "message": "United Nations Secretary-General António Guterres condemned the attacks, calling the strikes on the Kyiv hospital and on another medical facility in the capital’s Dniprovsky district “particularly shocking,” spokesman Stephane Dujarric said.\nThe United Nations Security Council will meet on Tuesday to discuss the Russian attack, diplomats said.\nRussia's defense ministry said the strikes targeted Ukrainian defense plants and military air bases and were successful.\nIt denied aiming at any civilian facilities and claimed without evidence that pictures from Kyiv indicated the damage was caused by a Ukrainian air defense missile.\nThe Russian attack overnight included a fourth Kh-101 missile, as well as two Iskander-M ballistic missiles, the Ukrainian air force said.", "url": "https://www.voanews.com/a/russia-targets-multiple-ukrainian-regions-with-missiles-drones/7688979.html", "date": "2024-07-08 07:30", "source": "GDELT"}], "location": "KYIV", "total_score": 1.1392679769966354, "count": 2, "average_score": 0.5696339884983177, "final_score": 0.6087437919488223}, "82f2afe2-1cf4-49f5-807d-f7d6c4c64a5f": {"messages": [{"id": "82f2afe2-1cf4-49f5-807d-f7d6c4c64a5f", "message": "'Radioactive'The campaigns, which look well-resourced, appear designed to rile up sentiment against Qatar across the United States, Britain and European Union.\nAnother site -- \"It's in your hands\" (IIYH) -- targets Qatar's queen mother, Sheikha Moza bint Nasser, accusing her country of supporting terrorists and criticizing her for failing to secure the release of Israeli hostages held in Hamas-run Gaza.\nThe queen mother has no official role in the emirate's mediation efforts.\nThe IIYH logo also popped up offline, appearing in February in an ad targeting the queen mother at New York's Times Square.\nFake petitionThe IIYH website links to a change.org petition targeting Qatar's queen mother.", "url": "https://www.tuko.co.ke/business-economy/technology/554424-shadow-campaign-global-influence-op-targets-qatar-wartime/", "date": "2024-07-08 07:15", "source": "GDELT"}, {"id": "38dd3910-0e0a-4423-816f-4561e2bb8674", "message": "The sprawling anti-Qatar campaign illustrates the ease with which an entire country can be tarnished in the age of disinformation.\n– ‘Radioactive’ –The campaigns, which look well-resourced, appear designed to rile up sentiment against Qatar across the United States, Britain and European Union.\nThe queen mother has no official role in the emirate’s mediation efforts.\nThe IIYH logo also popped up offline, appearing in February in an ad targeting the queen mother at New York’s Times Square.\n– Fake petition –The IIYH website links to a change.org petition targeting Qatar’s queen mother.", "url": "https://www.digitaljournal.com/social-media/shadow-campaign-global-influence-op-targets-qatar-in-wartime/article", "date": "2024-07-08 06:30", "source": "GDELT"}], "location": "Based on the text, it is not possible to determine a specific location for the event.", "total_score": 0.4678763966784053, "count": 1, "average_score": 0.4678763966784053, "final_score": 0.5075134776748838}}