{"dc239d7e-c098-4dc3-b1fd-cd2ecf2e6ffc": {"messages": [{"id": "dc239d7e-c098-4dc3-b1fd-cd2ecf2e6ffc", "message": "MANAMA, Bahrain (AP) — A missile attack by Yemen's Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, the latest assault on shipping in the region.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire in the same area off Aden, saying “damage control is underway.\"\nGen. Yahya Saree claimed the attack in a prerecorded video message Sunday, saying the vessel had been targeted with both missiles and drones.\nHe identified the vessel as the Norderney, a ship that tracking data analyzed by The Associated Press showed was still in the Gulf of Aden on Sunday afternoon.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.", "url": "https://www.yahoo.com/news/cargo-ship-hit-missile-gulf-022827213.html", "date": "2024-06-09 03:30", "source": "GDELT"}, {"id": "0cca05d0-83ac-4b00-9bb9-8fa379e42552", "message": "Dubai, Jun 9 (AP) A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said.\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported an attack late Saturday in the same area off Aden, but provided no further details.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.", "url": "https://www.theweek.in/wire-updates/international/2024/06/09/fgn3-yemen-houthi-ship-attack.html", "date": "2024-06-09 06:15", "source": "GDELT"}, {"id": "91d6b17a-1a05-422c-ad73-824468a736b6", "message": "LONDON, June 9, 2024 (BSS/AFP) - An Antigua and Barbuda-flagged cargo ship caught fire after it was hit by a missile off the coast of Yemen, maritime security firm Ambrey said on Saturday.\n\"The ship was heading southwest along the Gulf of Aden at a speed of 8.2kts when the forward station was struck by a missile.\n\"No injuries were reported,\" the security firm added.\nThe attack comes amid a campaign of drone and missile strikes against Israeli-linked shipping by Yemen's Iran-backed Huthi rebels.\nSince January, the United States and Britain have launched retaliatory strikes on Huthi targets in Yemen in response to the attacks on shipping.", "url": "https://www.bssnews.net/news/194108", "date": "2024-06-09 04:00", "source": "GDELT"}, {"id": "0a9c2e16-484c-461f-a86b-b82e6ccb2fa3", "message": "2 cargo ships caught fire after being hit by projectiles in suspected Houthi attacks off the coast of YemenTwo cargo ships sailing near Yemen caught fire after being hit by projectiles.\nThe missiles are suspected to have been fired by Houthi rebels.\nTwo cargo ships traveling off Yemen's southern port city of Aden caught fire after being hit by projectiles suspected to have been fired by Houthi rebels, UK maritime agencies reported.\nThe ship caught fire but it was contained.\nOn Monday, the Houthi rebels said they had fired a new solid-fuel missile called the \"Palestine\" at the southern Israeli city of Eilat on Monday.", "url": "https://www.yahoo.com/news/2-cargo-ships-caught-fire-102615889.html", "date": "2024-06-09 12:30", "source": "GDELT"}, {"id": "4dc09eb6-398d-4918-a458-5f43e40ca9c4", "message": "DUBAI: A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said.The missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nIt began after Hamas-led militants attacked Israel on Oct. 7, killing about 1,200 people and taking around 250 hostage.The Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the US Maritime Administration.\nA US-led airstrike campaign has targeted the Houthis since January, with a series of strikes May 30 killing at least 16 people and wounding 42 others, the rebels say.But while gaining more attention internationally, the secretive group has cracked down at dissent at home.\nEleven Yemeni employees of United Nations agencies and others working for aid groups have been detained by the Houthis under unclear circumstances, as the rebels face increasing financial pressure and airstrikes from the US-led coalition.\nThe rebels also recently sentenced 44 people to death.", "url": "https://timesofindia.indiatimes.com/world/middle-east/cargo-ship-hit-by-missile-in-gulf-of-aden-in-suspected-attack-by-yemen-houthi-rebels-no-one-hurt/articleshow/110830596.cms", "date": "2024-06-09 07:15", "source": "GDELT"}, {"id": "e88a1d1f-49cc-416f-930b-826fa49e7c8d", "message": "A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden on Sunday in a suspected attack by Houthi rebels in Yemen, authorities said.\n...... read full story", "url": "https://article.wn.com/view/2024/06/09/Cargo_ship_hit_by_missile_in_Gulf_of_Aden_in_suspected_attac_y/", "date": "2024-06-09 04:00", "source": "GDELT"}, {"id": "a38194c7-0326-4e70-879e-556fb2e66586", "message": "LONDON: Projectiles struck two cargo ships off the coast of Yemen on Saturday night without causing any casualties, maritime security agencies said.\nAn Antigua and Barbuda-flagged cargo ship caught fire after being hit by a missile off Yemen on Saturday night, maritime security firm Ambrey said.\n“No injuries were reported,” the security firm added.\nIn a separate incident on Saturday night, the UKMTO reported another projectile struck a ship “on the aft section”, resulting in a fire.\nSince January, the United States and Britain have launched retaliatory strikes on Huthi targets in Yemen in response to the attacks.", "url": "https://gulfnews.com/world/gulf/yemen/projectiles-strike-ships-off-yemen-security-firms-1.103028632", "date": "2024-06-09 10:45", "source": "GDELT"}, {"id": "2f65b36b-48c3-4aaa-aa26-11c3fab8b61d", "message": "British security firm Ambrey confirmed to Reuters that an Antigua-and Barbuda-flagged cargo ship was struck 83 nautical miles south-east of Aden and caught fire.\n“The ship was heading south-west along the Gulf of Aden at a speed of 8.2 knots when the forward station was struck by a missile.\nPersons on board small boats in the vicinity opened fire on the ship during the incident.”A second incident was reported, 70 nautical miles south-west of Aden three hours after the initial strike.\n“The vessel was hit by an unknown projectile on the aft section, which resulted in a fire,” UKMTO said.\nHouthi rebels have begun striking ships in the Red Sea and the Gulf of Aden since November, in support of Palestinians in Gaza, but have not claimed either attack.", "url": "https://www.thenationalnews.com/news/mena/2024/06/09/two-vessels-catch-fire-in-the-gulf-of-aden-after-unknown-projectiles-strike/", "date": "2024-06-09 06:45", "source": "GDELT"}, {"id": "c48e72c6-febe-4df5-82dc-66a5a7c88aa1", "message": "Over 200 soldiers, 24 various artillery pieces: Ukraine's Security Service estimates losses inflicted on Russians over past weekThe Russians being targeted by the SSU Special Forces.\nPhoto: Screenshot from video by SSUThe Special Forces of the Security Service of Ukraine (SSU) have reported that their combat operations over the past week have resulted in estimated Russian losses of 212 soldiers, 24 artillery systems and multiple-launch rocket systems (MLRS), 4 air defence systems, and 9 tanks.\nSource: SSU on FacebookDetails: The post states that the SSU Special Forces destroyed the following equipment belonging to the Russians with attack drones and other weapons:9 tanks13 armoured combat vehicles24 artillery systems and MLRS4 air defence systems167 vehicles4 UAVs16 communication antennas and 1 automatic surveillance system3 boats94 Russian positions and fortifications2 ammunition storage pointsQuote: \"In addition, 212 invaders have been killed\".\nSupport UP or become our patron!", "url": "https://www.yahoo.com/news/over-200-soldiers-24-various-235226555.html", "date": "2024-06-09 07:15", "source": "GDELT"}, {"id": "76fb12d9-62b1-4361-b3b6-338b91710850", "message": "- Advertisement -An Antigua and Barbuda-flagged cargo ship caught fire after it was hit by a missile off the coast of Yemen on Saturday night, maritime security firm Ambrey said.\n“The ship was heading southwest along the Gulf of Aden at a speed of 8.2kts when the forward station was struck by a missile.\nA second missile missed and “small boats in the vicinity opened fire on the ship” causing it to change direction to port.\nThe attack comes amid a campaign of drone and missile strikes against Israeli-linked shipping by Yemen’s Iran-backed Huthi rebels.\nSince January, the United States and Britain have launched retaliatory strikes on Huthi targets in Yemen in response to the attacks on shipping.", "url": "https://manilastandard.net/news/314457081/missile-strikes-cargo-ship-off-yemen-security-firm.html", "date": "2024-06-09 03:45", "source": "GDELT"}, {"id": "01318974-cd70-4cce-b236-ff45c31cb49e", "message": "Incident reported near Yemen port city - UKMTOAn incident has been reported near Yemen's port city of Aden, the UK Maritime Trade Operations has said.\nIn an alert on X, the organisation said it received a report and authorities were investigating.\nVessels have been warned to take caution in the area.\nYemen's Houthi group has been attacking vessels in the area for months, saying it is targeting ships linked to Israel in retaliation for the country's war in Gaza.\nBut many ships have no Israeli connection.", "url": "https://news.sky.com/story/israel-hamas-war-latest-three-israeli-hostages-killed-during-rescue-operation-hamas-says-12978800", "date": "2024-06-09 16:00", "source": "GDELT"}, {"id": "714e90fb-c5bc-494c-b8fb-421a46517b74", "message": "A suspected attack by Yemen’s Houthi rebels has targeted an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden, with a missile hitting the vessel ...... read full story", "url": "https://article.wn.com/view/2024/06/09/Cargo_ship_hit_by_missile_in_Gulf_of_Aden_in_suspected_attac_q/", "date": "2024-06-09 04:30", "source": "GDELT"}, {"id": "f89fbb74-9c10-4ee8-8da7-5d6741466c88", "message": "Ambrey said the ship changed its course to port with increased speed.\nThe British security firm Ambrey said on Sunday an Antigua and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Yemen's Aden and caught fire before it was contained.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel on an incident 80 nautical miles southeast of Yemen's Aden.\n\"The ship was heading southwest along the Gulf of Aden at speed 8.2kts when the forward station was struck by a missile.\nAmbrey said the ship changed its course to port with increased speed, adding that \"no injuries were reported.\"", "url": "https://www.ndtv.com/world-news/cargo-ship-catches-fire-after-hit-by-missile-off-yemen-uk-maritime-agency-5849012", "date": "2024-06-09 00:30", "source": "GDELT"}, {"id": "1417fe84-f03a-4bf3-9754-6ff55490406d", "message": "Two vessels catch fire after missile strikes off Yemen's AdenWorld World Two vessels catch fire after missile strikes off Yemen's AdenThe British security firm Ambrey said on Sunday an Antigua- and Barbuda-flagged cargo ship was hitFollow on Updated On: Sun, 09 Jun 2024 10:35:46 PKTCAIRO (Reuters) – Two ships caught on fire after being hit by projectiles off Yemen's Aden, two UK maritime agencies reported on Sunday.\nThe British security firm Ambrey said on Sunday an Antigua- and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Aden and caught fire.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel of an incident 80 nautical miles southeast of Aden.\n\"The ship was heading southwest along the Gulf of Aden at a speed of 8.2 knots when the forward station was struck by a missile.\nSeparately, Ambrey and UKMTO said they had received a report about another incident 70 nautical miles southwest of Aden.", "url": "https://dunyanews.tv/en/World/817395-Two-vessels-catch-fire-after-missile-strikes-off-Yemen-s-Aden", "date": "2024-06-09 08:15", "source": "GDELT"}, {"id": "32870a74-6ac5-46d5-b12b-be6c8b4be0e1", "message": "British security firm Ambrey said Sunday an Antigua and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Yemen's Aden and caught fire, which was later contained.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel regarding an incident 80 nautical miles southeast of Yemen's Aden.\nUKMTO said it also received a report from a master of a vessel about another incident 70 nautical miles southwest of Aden.\n\"The ship was heading southwest along the Gulf of Aden at speed 8.2kts when the forward station was struck by a missile.\n\"A second missile was sighted but did not hit the ship.", "url": "https://www.voanews.com/a/cargo-ship-hit-by-missile-southeast-of-yemen-security-firm-says/7648596.html", "date": "2024-06-09 03:15", "source": "GDELT"}, {"id": "913612cb-9311-4c24-a21f-cba58a52a945", "message": "In a remarkable show of resilience, Ukraine announced on Sunday that its forces have successfully hit a Russian Su-57 fighter aircraft stationed at an air base nearly 600 kilometers from the front lines.\nThis achievement follows the recent authorization from Western allies, allowing Kyiv to utilize their weapons for targeted strikes inside Russia.\nThe strike stands as the first known successful attack on Moscow's most advanced military aircraft, potentially carried out by drones.\nThe United States and Germany have recently greenlit Ukraine's use of long-range weapons, shifting the dynamics of the conflict.\nMeanwhile, Russian shelling has continued to claim civilian lives in Ukraine, intensifying the urgency for robust defense strategies.", "url": "https://www.devdiscourse.com/article/politics/2976619-ukraine-strikes-russian-su-57-fighter-in-bold-counteroffensive", "date": "2024-06-09 10:45", "source": "GDELT"}, {"id": "b4d24ba4-86f0-4e14-b0b7-7945fce718bc", "message": "A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by the Houthis in Yemen, authorities said Sunday.\nThe missile hit the ship’s forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nThe Houthis did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.", "url": "https://www.ynetnews.com/article/byeqfhzh0", "date": "2024-06-09 06:15", "source": "GDELT"}, {"id": "61bb2b63-20b2-4bdd-96d8-15f1214989f9", "message": "British security firm Ambrey said on Sunday an Antigua and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Yemen’s Aden and caught fire before it was contained.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel on an incident 80 nautical miles southeast of Yemen’s Aden.\nUKMTO said it also received a report from a master of a vessel about another incident 70 nautical miles southwest of Aden.\n“The ship was heading southwest along the Gulf of Aden at speed 8.2kts when the forward station was struck by a missile.\n“A second missile was sighted but did not hit the ship.", "url": "https://www.theglobeandmail.com/world/article-cargo-ship-hit-by-missile-southeast-of-yemens-aden-british-security/", "date": "2024-06-09 00:30", "source": "GDELT"}, {"id": "df0266e7-7075-45ea-b796-3070ffef2fa2", "message": "NNA - Two ships caught on fire after being hit by projectiles off Yemen's Aden, two UK maritime agencies reported on Sunday.\nThe British security firm Ambrey said on Sunday an Antigua- and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Aden and caught fire.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel of an incident 80 nautical miles southeast of Aden.\n\"The ship was heading southwest along the Gulf of Aden at a speed of 8.2 knots when the forward station was struck by a missile.\nSeparately, UKMTO said it received a report from a master of a vessel about another incident 70 nautical miles southwest of Aden.", "url": "https://www.nna-leb.gov.lb/en/regional/700376/two-vessels-catch-fire-after-missile-strikes-off-y", "date": "2024-06-09 08:30", "source": "GDELT"}, {"id": "665575c6-2dbc-4a08-b623-d4af68af40f5", "message": "CAIRO: Two ships caught on fire after being hit by projectiles off Yemen’s Aden, two UK maritime agencies reported on Sunday.\nThe British security firm Ambrey said on Sunday an Antigua- and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Aden and caught fire.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel of an incident 80 nautical miles southeast of Aden.\n“The ship was heading southwest along the Gulf of Aden at a speed of 8.2 knots when the forward station was struck by a missile.\n“A second missile was sighted but did not hit the ship.", "url": "https://www.brecorder.com/news/40307572/two-vessels-catch-fire-after-missile-strikes-off-yemens-aden", "date": "2024-06-09 06:00", "source": "GDELT"}, {"id": "8b21caa3-f01e-4563-9102-c1e1f52499e6", "message": "London: An Antigua and Barbuda-flagged cargo ship caught fire after it was hit by a missile off the coast of Yemen, maritime security firm Ambrey said on Saturday.\n“The ship was heading southwest along the Gulf of Aden at a speed of 8.2kts when the forward station was struck by a missile.\n“No injuries were reported,“ the security firm added.\nThe attack comes amid a campaign of drone and missile strikes against Israeli-linked shipping by Yemen’s Iran-backed Huthi rebels.\nSince January, the United States and Britain have launched retaliatory strikes on Huthi targets in Yemen in response to the attacks on shipping.", "url": "https://thesun.my/world/missile-strikes-cargo-ship-off-yemen-security-firm-MC12549445", "date": "2024-06-09 01:45", "source": "GDELT"}, {"id": "81573675-4991-469e-99e2-b9e3818607d5", "message": "(Adds new incident in paragraph 3) CAIRO, June 9 (Reuters) -British security firm Ambrey said on Sunday an Antigua and Barbuda-flagged general cargo ship was struck by a missile 83 nautical miles southeast of Yemen's Aden and caught fire before it was contained.\nEarlier, the United Kingdom Maritime Trade Operations (UKMTO) said it had received a report from a captain of a vessel on an incident 80 nautical miles southeast of Yemen's Aden.\nUKMTO said it also received a report from a master of a vessel about another incident 70 nautical miles southwest of Aden.\n\"The ship was heading southwest along the Gulf of Aden at speed 8.2kts when the forward station was struck by a missile.\nAmbrey said the ship changed its course to port with increased speed, adding that \"no injuries were reported.\"", "url": "https://www.devdiscourse.com/article/law-order/2976420-missile-strikes-cargo-ship-near-yemens-aden-ignites-fire", "date": "2024-06-09 03:45", "source": "GDELT"}, {"id": "9a490d2c-7a73-4bdd-9c2c-d61aa04d9ee3", "message": "IDF Spokesperson: Following the sirens that sounded at 12:15 regarding a hostile aircraft infiltration in northern Israel, two UAVs were identified crossing from Lebanon. The UAVs fell in the area of the northern Golan Heights. No injuries were reported. The incident is under review. As a result of the UAV attacks, fires were ignited in the area. Israel Fire and Rescue Services are currently operating at the scene to extinguish the fires.  \n\nFollowing the sirens that sounded at 12:07 regarding rocket and missile fire in northern Israel, approximately ten projectiles were identified crossing from Lebanon. The projectiles fell in open areas in the area of Zaura, igniting fires in the area. No injuries were reported. The IDF struck the sources of the launches.", "url": "https://abualiexpress.com/en/en28664/", "date": "2024-06-09 11:37", "source": "Telegram"}], "location": "NULL", "total_score": 6.873984917998314, "count": 22, "average_score": 0.31245385990901425, "final_score": 0.8787177019363099}, "59a8d30a-0617-49eb-858f-499ff205b941": {"messages": [{"id": "59a8d30a-0617-49eb-858f-499ff205b941", "message": "A missile attack by Yemen’s Houthi rebels has hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of AdenMANAMA, Bahrain -- A missile attack by Yemen's Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, the latest assault on shipping in the region.\nThe missile hit the ship's forward station late Saturday, starting a fire that those on board later put out, the private security firm Ambrey said.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire in the same area off Aden, saying “damage control is underway.\"\nGen. Yahya Saree claimed the attack in a prerecorded video message Sunday, saying the vessel had been targeted with both missiles and drones.\nHe identified the vessel as the Norderney, a ship that tracking data analyzed by The Associated Press showed was still in the Gulf of Aden on Sunday afternoon.", "url": "https://abcnews.go.com/International/wireStory/cargo-ship-hit-missile-gulf-aden-suspected-attack-110960108", "date": "2024-06-09 03:45", "source": "GDELT"}, {"id": "1ae05b50-d4ea-40ff-99f9-e4ec179d5ddb", "message": "The missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people \"on board small boats in the vicinity opened fire on the ship during the incident,\" Ambrey added, though no one was hurt onboard.\nThe British military's United Kingdom Maritime Trade Operations centre has also reported an attack in the same area off Aden, but provided no further details.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the US Maritime Administration.", "url": "https://www.sheppnews.com.au/world/cargo-ship-hit-in-suspected-yemen-houthi-attack/", "date": "2024-06-09 03:45", "source": "GDELT"}], "location": ".\nThe Gulf of Aden.", "total_score": 0.3577369749546051, "count": 1, "average_score": 0.3577369749546051, "final_score": 0.2804158824682236}, "1dbe0d23-d280-4c85-b43a-8399297f6d35": {"messages": [{"id": "1dbe0d23-d280-4c85-b43a-8399297f6d35", "message": "(MENAFN- Gulf Times) Two people were killed on Saturday in an Israeli on the outskirts of the southern Lebanese town of Aitaroun, Lebanon's state news agency NNA said.\nThe Israeli military said in a statement that its had identified a Hezbollah fighter in the Aitaroun area, and that soon afterwards an Israeli aircraft had carried out an airstrike that hit the individual.\nIsraeli forces launched two missiles targeting a cafe at a station, causing significant damage to the premises and to the surrounding area, NNA said.\nA security source told Reuters it was the first time the group used that model of rockets, having used the Falaq 1 previously.\nIsrael Defence Forces (IDF)“identified a Hezbollah fighter in the area of Aitaroun in southern Lebanon, and shortly afterward an IAF aircraft struck the fighter,” the Israeli military said in a statement.", "url": "https://menafn.com/1108311328/Israeli-Airstrike-Kills-Two-In-Lebanon", "date": "2024-06-09 06:45", "source": "GDELT"}, {"id": "52371113-a178-4b90-9f8c-9a17c6ed7991", "message": "Four people, including two Hezbollah members, were killed, and five others were injured in Israeli airstrikes on villages in southern Lebanon, Lebanese military sources told the media.\nThe sources, who spoke anonymously, said on Saturday that an Israeli warplane targeted a house in the village of Houla, killing two Hezbollah members and injuring three civilians, Xinhua news agency reported.\nThe sources added that another Israeli airstrike targeted, with two air-to-surface missiles, a commercial market in the village of Aitaroun, killing two civilians and wounding two others.\nTensions increased between Hezbollah and the Israeli army in the wake of the latter’s announcement of completing deployment for a major offensive against the former.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "url": "https://www.thestatesman.com/world/4-killed-5-injured-in-israeli-airstrikes-in-lebanon-1503308214.html", "date": "2024-06-09 07:45", "source": "GDELT"}, {"id": "c5f66d20-1e80-41d4-b748-d2cc84cad4b8", "message": "BEIRUT: Israeli strikes on Saturday killed two people and sparked wildfires in southern Lebanon, state media said, with Hezbollah announcing the death of one fighter.\nHezbollah, a Hamas ally, has traded near-daily fire with Israeli forces in the eight months since the Gaza conflict began, triggered by Hamas’ October 7 raid.\nThe deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border.\nThe movement later announced that one of its fighters was killed by Israeli fire.\nMore than eight months of border violence, which began on October 8, has killed 458 people in Leba­non, mostly fighters but including about 90 civilians, according to a tally.", "url": "https://www.dawn.com/news/1838745/two-killed-fires-rage-in-lebanon-after-israeli-strikes", "date": "2024-06-09 03:45", "source": "GDELT"}, {"id": "f80dbde0-cc4a-4498-8afc-55d36764fc96", "message": "Hezbollah launches drone strike against Israeli artillery position in Shebaa FarmsIran Press TVSaturday, 08 June 2024 10:20 AMFighters from Lebanon's Hezbollah resistance movement have launched a retaliatory drone strike against an Israeli artillery position in the occupied Shebaa Farms in response to the regime's ongoing war on Gaza.\nEarlier in the day, Hezbollah fighters targeted a group of Israeli soldiers, who had moved into the al-Raheb military base, with a salvo of artillery shells.\nOn Friday evening, the Lebanese resistance group struck a gathering of Israeli soldiers in the al-Tayhat Triangle region with a barrage of rockets.\nHezbollah fighters also launched a rocket barrage at Israeli troops stationed in an area at Netu'a Forest and targeted an Israeli military vehicle at the Birkat Risha outpost.\nPreviously, the group had pounded Israeli artillery bunkers in the Khirbet Maar base and a group of Israeli troops deployed nearby with artillery shells.", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240608-presstv11.htm", "date": "2024-06-09 05:15", "source": "GDELT"}, {"id": "cd04ab41-ea34-4760-909e-cfd50095fd86", "message": "Beirut, June 9 (UNI) Four people, including two Hezbollah members, were killed, and five others were injured on Saturday in Israeli airstrikes on villages in southern Lebanon, Lebanese military sources told Xinhua.\nThe sources, who spoke anonymously, said that an Israeli warplane targeted a house in the village of Houla, killing two Hezbollah members and injuring three civilians.\nThe sources added that another Israeli airstrike targeted, with two air-to-surface missiles, a commercial market in the village of Aitaroun, killing two civilians and wounding two others.\nTensions increased between Hezbollah and the Israeli army in the wake of the latter’s announcement of completing deployment for a major offensive against the former.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "url": "https://www.centralchronicle.com/4-killed-5-injured-in-israeli-airstrikes-in-lebanon/", "date": "2024-06-09 10:00", "source": "GDELT"}, {"id": "c07e10f5-6c45-492e-a175-07dea747d3b5", "message": "The onslaught persisted, despite scrutiny on Israel after its warplanes carried out an attack on a UN-run school that a Gaza hospital said killed at least 37 people.\nThe Israeli military acknowledged it conducted the strike on the Nuseirat refugee camp, saying it targeted “terrorists”.\nThe UN agency for Palestinian refugees that ran the school, condemned Israel for striking the facility housing 6,000 displaced people.\nThe war, now in its ninth month, has brought widespread devastation to Gaza, with one in 20 people dead or wounded, according to the Palestinian health ministry.\nMeanwhile, in a new diplomatic push, US Secretary of State Antony Blinken is set to visit Israel, Egypt, Jordan and Qatar from Monday.", "url": "https://www.dawn.com/news/1838764/israel-pummels-refugee-camps-in-gaza", "date": "2024-06-09 08:30", "source": "GDELT"}, {"id": "68147df3-58dc-47da-9687-54445e622091", "message": "In one photo, black soot marks and small craters can be seen dotting a concrete strip around the parked aircraft.\nIt wasn’t immediately clear what weapons were used, but the airfield’s distance from Ukraine suggests that it was likely hit by drones.\nRussia’s Defense Ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nElsewhere, Ukrainian forces kept up drone attacks on Russia’s southern border regions, according to local Russian officials.\nThe easing of restrictions on the use of Western weapons will help Ukraine protect Kharkiv by targeting Russian capabilities across the border.", "url": "https://whdh.com/news/ukraine-says-it-struck-one-of-russias-most-advanced-warplanes/", "date": "2024-06-09 14:00", "source": "GDELT"}, {"id": "279d749a-b58c-482f-afe0-122fea43b5f0", "message": "The deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border.\nThe Shiite Muslim movement later announced that one of its fighters was killed by Israeli fire.\nOn the Israeli side of the border, at least 15 soldiers and 11 civilians have been killed, according to the army.\nLebanese authorities and several international rights groups have accused Israel of using white phosphorus rounds in its strikes on its northern neighbour.\nA security source told AFP on condition of anonymity that fires broke out near military positions but have not reached them or caused any casualties.", "url": "http://www.jordantimes.com/news/region/two-dead-fires-south-lebanon-after-israeli-strikes-%E2%80%94-state-media", "date": "2024-06-09 01:45", "source": "GDELT"}, {"id": "87fa096a-4873-4c05-b5fe-f7a249309042", "message": "If confirmed, it would mark Ukraine’s first known successful strike on a Su-57 fighter plane, a twin-engine stealth fighter lauded as Moscow’s most advanced military aircraft.\nIn one photo, black soot marks and small craters can be seen dotting a concrete strip around the parked aircraft.\nIt wasn’t immediately clear what weapons were used, but the airfield’s distance from Ukraine suggests that it was likely hit by drones.\nRussia’s Defense Ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nElsewhere, Ukrainian forces kept up drone attacks on Russia’s southern border regions, according to local Russian officials.", "url": "https://www.news18.com/world/ukraine-claims-it-struck-russias-ultra-modern-most-advanced-su-57-warplane-8926789.html", "date": "2024-06-09 15:15", "source": "GDELT"}, {"id": "05db97ff-befc-49a3-b17f-94ac95ccd70a", "message": "If confirmed, it would mark Ukraine's first known successful strike on a Su-57 fighter plane, a twin-engine stealth fighter lauded as Moscow's most advanced military aircraft.\nIn one photo, black soot marks and small craters can be seen dotting a concrete strip around the parked aircraft.\nIt wasn’t immediately clear what weapons were used, but the airfield’s distance from Ukraine suggests that it was likely hit by drones.\nRussia's Defense Ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nElsewhere, Ukrainian forces kept up drone attacks on Russia's southern border regions, according to local Russian officials.", "url": "https://www.ctvnews.ca/world/ukraine-says-it-struck-one-of-russia-s-most-advanced-warplanes-1.6919502", "date": "2024-06-09 12:30", "source": "GDELT"}, {"id": "457763cc-e9c3-4911-b6f6-9eb93dd43148", "message": "If confirmed, it would mark Ukraine's first known successful strike on a Su-57 fighter plane, a twin-engine stealth fighter lauded as Moscow's most advanced military aircraft.\nIn one photo, black soot marks and small craters can be seen dotting a concrete strip around the parked aircraft.\nIt wasn’t immediately clear what weapons were used, but the airfield’s distance from Ukraine suggests that it was likely hit by drones.\nRussia's Defense Ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nElsewhere, Ukrainian forces kept up drone attacks on Russia's southern border regions, according to local Russian officials.", "url": "https://www.newsmax.com/newsfront/russia-ukraine-war-su57-fighter/2024/06/09/id/1168017/", "date": "2024-06-09 11:15", "source": "GDELT"}, {"id": "3e205a17-b7a9-4307-8d8a-5a7cea86da32", "message": "[Rabih Daher/AFP] June, 8 , 2024Latest attacks come as Israeli officials have been calling for expansion of fighting along Israel-Lebanon border.\nAt least two people have been reported killed in southern Lebanon as cross-border fighting between Hezbollah and Israel continues amid the threat of wider war.\nThe two killings were the result of Israeli attacks on the outskirts of the town of Aitaroun, Lebanon’s state-run National News Agency (NNA) reported on Saturday.\nIsraeli attacks since October 7 have killed more than 300 members of Hezbollah and about 80 civilians, according to the group and Lebanese officials.\nAttacks from Lebanon on Israel have killed 18 Israeli soldiers and 10 civilians, the Israeli military has said.", "url": "https://yalibnan.com/2024/06/09/two-killed-in-south-lebanon-as-hezbollah-israel-fighting-escalates/", "date": "2024-06-09 02:15", "source": "GDELT"}, {"id": "0af27a80-c9cd-4e3d-b38a-619352ee9fe6", "message": "Palestinians remained in shock over Saturday's death toll, the worst over a 24-hour period of the Gaza war for months and including many women and children, Palestinian medics said.\nSixty-four of the dead were children and 57 were women, the Hamas-run Gaza government media office said on Sunday.\nHamas' armed wing said on Sunday three Israeli hostages, including one with U.S. citizenship, were killed during the raid, but provided no names.\nA Hamas assertion on Saturday that some hostages had died was rejected as \"a blatant lie\" by the Israeli military.\nPalestinian medics said an Israeli airstrike on a house in Tel Al-Sultan in western Rafah killed two people.", "url": "https://www.newsmax.com/headline/israel-gaza/2024/06/09/id/1168019/", "date": "2024-06-09 15:00", "source": "GDELT"}, {"id": "c377f2d1-084b-4e5c-a445-95f8ab36c141", "message": "BEIRUT: Israeli strikes on Saturday killed two people and sparked wildfires in southern Lebanon, state media said, with Hezbollah announcing the death of one fighter.\nHezbollah, a Hamas ally, has traded near-daily fire with Israeli forces in the eight months since the Gaza conflict began, triggered by Hamas’ October 7 raid.\nThe deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border.\nThe movement later announced that one of its fighters was killed by Israeli fire.\nMore than eight months of border violence, which began on October 8, has killed 458 people in Leba­non, mostly fighters but including about 90 civilians, according to a tally.", "url": "https://www.dawn.com/news/1838745/2-killed-fires-rage-in-lebanon-after-israeli-strikes", "date": "2024-06-09 08:30", "source": "GDELT"}, {"id": "5c609ecc-ccfc-4386-84f1-8d9d8894cc81", "message": "4 killed, 5 injured in Israeli airstrikes in LebanonBeirut: Four people, including two Hezbollah members, were killed, and five others were injured in Israeli airstrikes on villages in southern Lebanon, Lebanese military sources told the media.\nThe sources, who spoke anonymously, said on Saturday that an Israeli warplane targeted a house in the village of Houla, killing two Hezbollah members and injuring three civilians, Xinhua news agency reported.\nThe sources added that another Israeli airstrike targeted, with two air-to-surface missiles, a commercial market in the village of Aitaroun, killing two civilians and wounding two others.\nTensions increased between Hezbollah and the Israeli army in the wake of the latter’s announcement of completing deployment for a major offensive against the former.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.", "url": "https://www.mangalorean.com/4-killed-5-injured-in-israeli-airstrikes-in-lebanon/", "date": "2024-06-09 07:15", "source": "GDELT"}, {"id": "29638bac-aee5-44d3-9dba-14cbea59a1c9", "message": "If confirmed, it would mark Ukraine's first known successful strike on a Su-57 fighter plane, a twin-engine stealth fighter lauded as Moscow's most advanced military aircraft.\nIt wasn't immediately clear what weapons were used, but the airfield's distance from Ukraine suggests that it was likely hit by drones.\nRussia's Defense Ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nElsewhere, Ukrainian forces kept up drone attacks on Russia's southern border regions, according to local Russian officials.\nThe easing of restrictions on the use of Western weapons will help Ukraine protect Kharkiv by targeting Russian capabilities across the border.", "url": "https://www.theweek.in/wire-updates/international/2024/06/09/fgn33-ukraine-russia-ld-warplane.html", "date": "2024-06-09 16:00", "source": "GDELT"}, {"id": "48a6fad4-7bc0-44e3-afdb-0876de7ec9fe", "message": "Tehran, June 9 : Iranian Foreign Ministry Spokesman Nasser Kanaani has strongly condemned deadly Israeli airstrikes on the Nuseirat camp in the central Gaza Strip.\nIn a statement released on Saturday by the Ministry, Kanaani denounced Israel's killing of hundreds of Palestinian civilians during the attacks as a \"horrendous and shocking crime\".\nHe blamed the US and certain European countries for providing arms to Israel and backing it in its offensive, Xinhua news agency reported.\nAt least 210 Palestinians were killed and more than 400 others injured in the Israeli airstrikes on Saturday in central Gaza.\nThe Palestinian death toll from the ongoing Israeli attacks in the enclave has risen to 36,801, with 83,680 people injured, as updated by the health authorities in Gaza on Saturday.", "url": "https://www.prokerala.com/news/articles/a1538023.html", "date": "2024-06-09 00:00", "source": "GDELT"}, {"id": "862278b0-1d3a-4c28-8d0a-b824dc0997a8", "message": "Israel pressed its bombardment of Gaza on Saturday as an Israeli war cabinet minister looked set to carry through on his threat to quit a government under mounting pressure over its conduct of the military campaign.\nThe onslaught persisted, despite scrutiny on Israel after its warplanes carried out an attack Thursday on a U.N.-run school that a Gaza hospital said killed 37 people.\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including UN-run facilities, as operational centres -- charges the militants deny.\nIsrael's retaliatory military offensive has killed at least 36,731 people in Gaza, also mostly civilians, according to the Hamas-run territory's health ministry.\nMajor sticking points include Hamas insisting on a permanent truce and full Israeli withdrawal -- demands Israel has rejected.", "url": "https://www.naharnet.com/stories/en/305796-israel-bombs-gaza-as-gantz-poised-to-quit-government", "date": "2024-06-09 09:30", "source": "GDELT"}, {"id": "36d328da-8597-49f0-8b81-2e2f63ff09e8", "message": "Israeli strikes have killed two people and sparked wildfires in southern Lebanon, state media said, with Hezbollah announcing the death of two fighters.\nHezbollah later announced that one of its fighters had been killed by Israeli fire.\nOn the Israeli side of the border, at least 15 soldiers and 11 civilians have been killed, according to the army.\n- 'Phosphorus shells' -\"Israeli artillery bombarded today the outskirts of the town of Alma al-Shaab with incendiary phosphorus shells, causing fires in the forests that spread to the vicinity of some homes,\" NNA reported earlier on Saturday.\nA security source told AFP on condition of anonymity that fires broke out near military positions but have not reached them or caused any casualties.", "url": "https://naharnet.com/stories/en/305803-two-killed-fires-in-south-lebanon-after-israeli-strikes", "date": "2024-06-09 10:45", "source": "GDELT"}, {"id": "6812e6da-c7ff-43b8-b244-07b3b7118721", "message": "Gaza City, (AA): Government Media Office in Gaza Strip said that at least 210 Palestinians were killed and more than 400 injured in severe Israeli airstrikes targeting Nuseirat refugee camp, areas east of Deir al-Balah, and al-Bureij and al-Maghazi camps in central Gaza.\nPalestine demanded an emergency session of the UN Security Council to discuss a “massacre” committed by Israeli forces in the Nuseirat refugee camp in the central Gaza Strip on Saturday.\nAt least 36,801 Palestinians have been killed in Israel’s ongoing offensive on the Gaza Strip since last October, the Health Ministry in the besieged enclave said on Saturday.\nWitnesses also reported that Israeli vehicles also advanced near the Gaza Valley on Salah al-Din Road in the central Gaza Strip.\nMeanwhile, the Israeli army confirmed on Saturday launching a “large-scale and unprecedented attack” on the Nuseirat camp and other areas in the central Gaza Strip.", "url": "https://muslimnews.co.uk/news/palestine/gaza-210-palestinians-killed-and-400-injured-by-indiscriminate-israeli-airstrikes-in-nuseirat-refugee-camp/", "date": "2024-06-09 01:45", "source": "GDELT"}, {"id": "43795521-d762-4999-bd5d-fa26f7a58e82", "message": "Hospital officials in Hamas-controlled Gaza have reported a death toll of 210 Palestinians following Israel’s operation to rescue four hostages earlier today.\nHowever, these figures have not been verified and, as always, do not distinguish between terrorists and civilians.\nAccording to Al-Aqsa Martyrs Hospital spokesperson Khalil Degran, the hospital received the bodies of 109 Palestinians, including 23 children and 11 women.\nAn additional 101 bodies were taken to Al-Awda Hospital, according to the hospital’s director.\nThe IDF has acknowledged that Palestinian civilians were killed during the operation, but attribute the blame to Hamas for holding hostages and engaging in combat within densely populated civilian areas.", "url": "https://www.theyeshivaworld.com/news/israel-news/2289354/hamas-claims-200-civilians-killed-in-daring-idf-raid-that-rescued-4-hostages.html", "date": "2024-06-09 06:30", "source": "GDELT"}, {"id": "85c8ace7-b431-42d2-b293-0ad5fcc94867", "message": "KYIV, Ukraine, June 9, 2024 (BSS/AFP) - Ukraine said Sunday it had hit an Su-57 fighter jet parked at an airfield in southern Russia, its first ever attack on Moscow's latest generation stealth aircraft.\nThe flagship Su-57 entered into service with Russia's aerospace forces in December 2020 and was designed to replace ageing Soviet-designed fighter aircraft like the Su-27 and MiG-29.\n\"On 8 June 2024, a Su-57 multi-purpose fighter jet of the aggressor state was struck at the Akhtubinsk airfield in Russia's Astrakhan region, 589 kilometres (366 miles) from the line of contact,\" Ukraine's GUR military intelligence said.\nIt also published before-and-after satellite imagery of what it said showed fire damage and debris around an Su-57 jet parked on an airfield.\nUkraine often targets military and energy facilities on Russian territory in drone attacks, sometimes hundreds of kilometres from the front line.", "url": "https://www.bssnews.net/international/194169", "date": "2024-06-09 12:30", "source": "GDELT"}, {"id": "ca2721f0-e690-4593-a2b1-2ca1d02111ef", "message": "Palestinians remained in shock over yesterday's death toll, the worst over a 24-hour period of the Gaza war for months and including many women and children, Palestinian medics said.\nOf the dead, 64 were children and 57 were women, the Hamas-run Gaza government media office said.\nNuseirat has often been caught up in the current warHamas' armed wing said three Israeli hostages, including one with US citizenship, were killed during the raid, but provided no names.\nA Hamas assertion yesterday that some hostages had died was rejected as \"a blatant lie\" by the Israeli military.\n37,084 Palestinians killed during war - health ministryIsrael's ensuing air and ground war in Gaza has killed at least 37,084 Palestinians, the health ministry in the Hamas-run territory said.", "url": "https://www.rte.ie/news/world/2024/0609/1453849-274-palestinians-killed-in-hostage-rescue-raid/", "date": "2024-06-09 17:15", "source": "GDELT"}, {"id": "0891fefa-cd11-421f-a773-746e94f98c0a", "message": "Palestinians remained in shock over Saturday’s death toll, the worst over a 24-hour period of the Gaza war for months and including many women and children, Palestinian medics said.\nSixty-four of the dead were children and 57 were women, the Hamas-run Gaza government media office said on Sunday.\nOn Sunday, three Palestinians were killed and several hurt in an Israeli airstrike on a house in Al-Bureij in the central Gaza Strip, while tanks shelled parts of nearby Al-Maghazi and Al-Nuseirat.\nPalestinian medics said an Israeli airstrike on a house in Tel Al-Sultan in western Rafah killed two people.\nIsrael’s ensuing air and ground war in Gaza has killed at least 37,084 Palestinians, the health ministry in the Hamas-run territory said in its Sunday update.", "url": "https://www.pakistantoday.com.pk/2024/06/09/palestinian-death-toll-in-hostage-rescue-raid-reaches-274-as-israel-strikes-central-gaza/", "date": "2024-06-09 18:30", "source": "GDELT"}, {"id": "8f15aa07-320a-496b-a929-d04e92fe3068", "message": "Lebanese sources report a large fire in Kfar Shihin in southern Lebanon following the launch of an Israeli surface-to-surface missile at a target in this area.\nAccording to these sources, another Israeli surface-to-surface missile was fired at the area of ​​Zalloutiyeh in southern Lebanon.", "url": "https://abualiexpress.com/en/en28667/", "date": "2024-06-09 12:23", "source": "Telegram"}, {"id": "96111801-8399-4d25-81ac-e5bab112bce8", "message": "The Palestinian Ministry of Health in Gaza:\n\nYesterday, 283 people were killed in the Gaza Strip and 814 were injured, of which 274 were killed and 698 were injured as a result of the Israeli attack on the Nuseirat refugee camp.\n\n37,084 dead and 84,494 injured in the Gaza Strip since October 7.", "url": "https://abualiexpress.com/en/en28666/", "date": "2024-06-09 11:39", "source": "Telegram"}, {"id": "9b39cdd8-ea04-4d6c-b9f3-02e22f46378d", "message": "Additional documentation from the skies of southern Lebanon following the launch of Hezbollah's air defense missile.", "url": "https://abualiexpress.com/en/en28676/", "date": "2024-06-09 16:40", "source": "Telegram"}, {"id": "5be9da0f-6733-4340-9b9b-65afed2a2603", "message": "Lebanese channels: Hezbollah launched an air defense missile at an Israeli fighter jet that broke the sound barrier and caused ultrasonic booms in southern Lebanon.", "url": "https://abualiexpress.com/en/en28675/", "date": "2024-06-09 16:39", "source": "Telegram"}, {"id": "37bbeb3b-f1d0-4f9f-9d89-39fe8c13ba4f", "message": "South Lebanon: A Lebanese bride was frightened by the supersonic booms caused by Israeli Air Force planes.\n\nHezbollah claims it fired the anti-air missiles to deter Israeli planes from flying over Lebanon and scaring civilians in this manner.", "url": "https://abualiexpress.com/heb68529/", "date": "2024-06-09 18:49", "source": "Telegram"}, {"id": "d6c96c94-9628-4517-add4-91659c6aa3e1", "message": "Following today's reports 👆 of Hezbollah firing air defense missiles at Israeli fighter jets flying over Lebanon:\n\nIDF spokesperson:\n\nThe IDF eliminated a terrorist squad that launched anti-aircraft missiles at fighter jets operating in Lebanon. The planes were not in danger and there were no casualties.\n\nA few minutes after the missile fire, an Air Force aircraft attacked and eliminated the terrorist squad that carried out the launches.", "url": "https://abualiexpress.com/en/en28689/", "date": "2024-06-09 19:53", "source": "Telegram"}], "location": "Aitaroun", "total_score": 9.511865228414536, "count": 29, "average_score": 0.3279953527039495, "final_score": 1.0995967468927645}, "100e333d-3e11-4110-acff-9ecb6d3f749f": {"messages": [{"id": "100e333d-3e11-4110-acff-9ecb6d3f749f", "message": "Manama, Bahrain -A missile attack by Yemen's Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, the latest assault on shipping in the region.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire in the same area off Aden, saying “damage control is underway.\"\nGen. Yahya Saree claimed the attack in a prerecorded video message Sunday, saying the vessel had been targeted with both missiles and drones.\nHe identified the vessel as the Norderney, a ship that tracking data analyzed by The Associated Press showed was still in the Gulf of Aden on Sunday afternoon.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.", "url": "https://www.ctvnews.ca/world/yemen-houthi-rebels-claim-latest-attack-on-cargo-ship-in-the-gulf-of-aden-1.6919516", "date": "2024-06-09 14:00", "source": "GDELT"}, {"id": "cd7eb1a0-3fc9-4bf0-bdb3-eb7a0766f1d7", "message": "The British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire late Saturday in the same area off Aden, saying “damage control is underway.\"\nThe missile hit the ship's forward station, starting a fire that those on board later put out, the private security firm Ambrey said.\nA second missile fired at the ship missed and people “on board small boats in the vicinity opened fire on the ship during the incident,” Ambrey added, though no one was hurt onboard.\nDUBAI, United Arab Emirates (AP) — A missile struck an Antigua and Barbuda-flagged cargo ship in the Gulf of Aden in a suspected attack by Houthi rebels in Yemen, authorities said Sunday.\nThe rebels did not immediately claim the assault, though it can sometimes take hours or even days for them to acknowledge their attacks.", "url": "https://www.bostonglobe.com/2024/06/08/world/cargo-ship-hit-by-missile-gulf-aden-suspected-attack-by-yemen-houthi-rebels-no-one-hurt/", "date": "2024-06-09 05:45", "source": "GDELT"}], "location": "The Gulf of Aden.", "total_score": 0.34242767095565796, "count": 1, "average_score": 0.34242767095565796, "final_score": 0.2696993696689606}, "1c9dc16d-7593-424e-84f6-1c49abf41880": {"messages": [{"id": "1c9dc16d-7593-424e-84f6-1c49abf41880", "message": "A missile attack by Yemen's Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, the latest assault on shipping in the region.\nThe British military's United Kingdom Maritime Trade Operations centre similarly reported the attack and fire in the same area off Aden, saying “damage control is underway.\"\nHe identified the vessel as the Norderney, a ship that tracking data analysed by The Associated Press showed was still in the Gulf of Aden on Sunday afternoon.\nThe war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the U.S. Maritime Administration.", "url": "https://indianexpress.com/article/world/yemen-houthi-rebels-claim-latest-attack-cargo-ship-gulf-aden-9381779/", "date": "2024-06-09 15:15", "source": "GDELT"}, {"id": "1c5a0741-9b11-43fd-a07b-97795753f026", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "url": "https://www.canberratimes.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=14232", "date": "2024-06-09 06:15", "source": "GDELT"}, {"id": "d57d7c14-943f-4092-8a93-95af7ce6b488", "message": "ALBAWABA- The Somali government announced that five soldiers were killed in an Al-Shabaab attack approximately 350 kilometers north of Mogadishu.\nThe government stated that its forces received intelligence about a planned attack in the Seldir area and set up an ambush for the militants.\nDuring the ensuing clashes in the Galgadud region, north of the capital, at least 47 Al-Shabaab militants were killed alongside the five soldiers, according to government authorities.\nLocal resident, Mohamed Hussein reported to AFP, \"There was intense fighting in Seldir this morning after Al-Shabaab attacked from multiple directions.\nOn May 26, 2023, Al-Shabaab attacked a base in Bulo Marer, occupied by Ugandan soldiers from the African Union force, resulting in the deaths of at least 54 soldiers according to Ugandan authorities.", "url": "https://www.albawaba.com/news/five-somali-soldiers-and-47-al-shabaab-1571466", "date": "2024-06-09 08:30", "source": "GDELT"}, {"id": "56ecf25f-5c49-4a6d-bd28-34a2ba003b86", "message": "The Hamas-run health ministry in Gaza says an Israeli raid on a refugee camp - which led to the rescue of four hostages - killed 274 people, including children and other civilians.\nOn Saturday Israel's forces, backed by air strikes, fought intense gun battles with Hamas in and around the Nuseirat refugee camp, freeing the captives.\nBut the latest figures from the Hamas-run health ministry in Gaza would, if confirmed, make it one of the deadliest days of the conflict so far.\n\"Reports from Gaza of another massacre of civilians are appalling,\" he wrote on X.\nAn Israeli minister said that instead of condemning Hamas for hiding behind civilians, the EU had condemned Israel for saving its citizens.", "url": "https://www.bbc.co.uk/news/articles/cw44ve90dppo", "date": "2024-06-09 10:45", "source": "GDELT"}, {"id": "f0392a98-13c3-42c5-9da5-c33eb0e2cde7", "message": "Jordan, Egypt Condemn Israeli Rescue of Hostages; EU, UN Officials Join InBreitbart ^ | 06/08/2024 | Joel B PollackPosted on by ChicagoConservative27Egypt and Jordan, two countries that have peace treaties with Israel, condemned the Israeli rescue of four hostages on Saturday — as did officials from the European Union (EU) and United Nations (UN) — over Palestinian casualties.\nby 2 posted onby CatOwner (Don't expect anyone, even conservatives, to have your back when the SHTF in 2021 and beyond.)\nby 3 posted onby Erik Latranyi (This is the end of the Republic....because we could not keep it.)\nby 4 posted onby Erik Latranyi (This is the end of the Republic....because we could not keep it.)\nTruly 200 “palestinians” some 80% of whom support Hamas, were killed as well as the Israeli Police commando chief to rescue 4 hostages... alive.", "url": "https://freerepublic.com/focus/f-news/4243118/posts", "date": "2024-06-09 01:30", "source": "GDELT"}, {"id": "353ff0b4-4b6d-46d2-984b-cf2bb4dbf559", "message": "June 9, 2024 — Gaza Strip (Palestinian Territories) (AFP)Israelis on Sunday cheered the rescue of four hostages from war-torn Gaza while Palestinians counted the cost, with Hamas officials saying 274 people were killed and hundreds wounded during the daytime raid.\nFinancial newspaper Calcalist hailed a \"heroic operation\" that had given Israelis \"a few hours of grace\", while the left-leaning Haaretz daily called the rescue operation a \"morale boost\" for the nation.\n- Renewed clashes -Hamas's Ezzedine Al-Qassam Brigades claimed that other hostages were killed during the rescue operation, without providing details or proof, and warned that conditions would worsen for the remaining captives.\nAfter Saturday's rescue operation, 116 hostages remain in Gaza, although the army says 41 of them are dead.\nHamas has insisted on a permanent truce and full Israeli withdrawal from all parts of Gaza -- demands that Israel has firmly rejected.", "url": "https://www.al-monitor.com/originals/2024/06/israel-cheers-rescue-4-hostages-hamas-says-raid-killed-274", "date": "2024-06-09 11:30", "source": "GDELT"}, {"id": "c87c6d9e-3505-4a83-ac84-05f3f440d707", "message": "Home WorldGCC condemns Israeli attack on Nuseirat CampAmmon News - The Gulf Cooperation Council has condemned in the strongest terms that Israeli attack on the Nuseirat Camp in Central Gaza, which left at least 200 people and wounded hundreds.\nThe GCC said the international community must act to stop Israel’s repeated and systematic crimes against the Palestinians.\nIt said the attack in Nuseirat “a heinous and terrorist crime.”Earlier, the Organization of Islamic Cooperation (OIC) has condemned an Israeli bombing of a school in Gaza affiliated with the United Nations Relief and Works Agency for Palestine Refugees (UNRWA), which was sheltering displaced persons.\nThe attack killed over 200 Palestinians and injured numerous civilians, accroding to Gaza's health ministry, most of whom were women and children.", "url": "https://en.ammonnews.net/article/73173", "date": "2024-06-09 16:00", "source": "GDELT"}, {"id": "563cbdaf-3306-44b0-aa64-88f94702e427", "message": "The Hamas armed wing announced on Sunday that three Israeli hostages were killed, including a US citizen, during the Israel hostage freeing operation in Gaza on Saturday.\nHamas propaganda video claiming that three Israeli hostages were killed during the IDF rescue mission in Gaza, June 9, 2024.\nPrevious psychological warfare from terror groupsThis was not the first time Hamas and other terror groups in Gaza have waged psychological warfare against Israel.\nWhile hostages have been murdered in the past, Hamas has preferred to say they were killed in Israeli air raids.\nNotably, the spelling in Hebrew featured in the video contains multiple typos, and the identities of the alleged killed hostages have yet to be revealed.", "url": "https://www.jpost.com/breaking-news/article-805577", "date": "2024-06-09 16:00", "source": "GDELT"}, {"id": "54af3d60-49f3-4be8-ba99-38fc1b93d8ee", "message": "More than 200 killed as Israel rescues four Gaza hostagesGAZA CITYIsrael announced its forces rescued four hostages on Saturday from a Gaza refugee camp in an operation which the Hamas-run government media office said left 274 Palestinians dead and hundreds wounded.\nThe Israeli military said Noa Argamani, 26, Almog Meir Jan, 22, Andrey Kozlov, 27, and Shlomi Ziv, 41, were pulled out in a \"complex\" mission.\n\"They won't be able to release all of them in a military operation,\" said Michael Levy, whose brother Or is still being held.\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including U.N.-run facilities, as operational centres, charges the militants deny.\nHe was speaking in Paris alongside French President Emmanuel Macron, who said: \"We rejoice at the release of the four Israeli hostages.\"", "url": "https://www.hurriyetdailynews.com/hamas-says-more-than-200-killed-as-israel-rescues-four-gaza-hostages-197207", "date": "2024-06-09 07:00", "source": "GDELT"}, {"id": "808da82c-302c-49ff-9b86-f03326f1bda8", "message": "Iranian Foreign Ministry Spokesman Nasser Kanaani has strongly condemned deadly Israeli airstrikes on the Nuseirat camp in the central Gaza Strip.\nIn a statement released on Saturday by the Ministry, Kanaani denounced Israel’s killing of hundreds of Palestinian civilians during the attacks as a “horrendous and shocking crime”.\nAdvertisementHe blamed the US and certain European countries for providing arms to Israel and backing it in its offensive, Xinhua news agency reported.\nAt least 210 Palestinians were killed and more than 400 others injured in the Israeli airstrikes on Saturday in central Gaza.\nThe Palestinian death toll from the ongoing Israeli attacks in the enclave has risen to 36,801, with 83,680 people injured, as updated by the health authorities in Gaza on Saturday.", "url": "https://www.thestatesman.com/world/iran-condemns-israels-airstrikes-in-gaza-1503308218.html", "date": "2024-06-09 07:45", "source": "GDELT"}, {"id": "dc8c5ef7-7407-4a95-9302-5df1ce62daeb", "message": "In Gaza, the Hamas media office said \"the number of victims from the Israeli occupation's massacre in the Nuseirat camp has risen to 210 martyrs and more than 400 wounded\".\nHe was speaking in Paris alongside French President Emmanuel Macron, who said: \"We rejoice at the release of the four Israeli hostages.\"\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including UN-run facilities, as operational centres -- charges the militants deny.\nGantz had earlier cancelled a news conference scheduled for Saturday where Israeli media had speculated he would announce his resignation.\nMajor sticking points include Hamas insisting on a permanent truce and full Israeli withdrawal from all parts of Gaza -- demands Israel has rejected.", "url": "https://www.philstar.com/world/2024/06/09/2361545/hamas-says-more-200-killed-israel-rescues-four-gaza-hostages", "date": "2024-06-09 04:15", "source": "GDELT"}, {"id": "7f14217a-2615-4812-9da7-1dfb5ffe9367", "message": "An Israeli soldier committed suicide after being ordered to return to military service in the Gaza Strip, the Israeli Radio reported, according to Al-Jazeera.\nIn mid-March, the Israeli army acknowledged facing its most significant mental health crisis since 1973, stemming from the fighting with Palestinian Resistance groups in the Gaza Strip since the Al-Aqsa Flood operation on October 7.\nThe Israeli army has reported 3,763 soldiers wounded since the war began on October 7, with 1,902 injuries occurring since the start of ground battles on October 27.\nThe official death toll for the Israeli army stands at 646 soldiers and officers since the war began, including 294 killed in ground battles in Gaza.\nThe Israeli war has resulted in an acute famine, mostly in northern Gaza, resulting in the death of many Palestinians, mostly children.", "url": "https://www.palestinechronicle.com/israeli-soldier-commits-suicide-after-receiving-orders-to-return-to-gaza/", "date": "2024-06-09 15:15", "source": "GDELT"}, {"id": "f8cdbcee-9af7-43dd-9b06-cb9a248c8839", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "url": "https://www.yasstribune.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=14264", "date": "2024-06-09 03:45", "source": "GDELT"}, {"id": "ffc068f4-a9ed-4088-bd70-a868bace9d8d", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "url": "https://www.juneesoutherncross.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=6417", "date": "2024-06-09 03:45", "source": "GDELT"}, {"id": "d68e6b7c-c9f7-43ff-b0aa-a16eb25397b0", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "url": "https://www.easternriverinachronicle.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=6364", "date": "2024-06-09 03:45", "source": "GDELT"}, {"id": "a9512357-07bb-433d-854d-5fc31f30dec4", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "url": "https://www.goulburnpost.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=14264", "date": "2024-06-09 04:30", "source": "GDELT"}, {"id": "1424d22b-4c47-4db4-a8a0-1664f53433f8", "message": "Israel killed at least 274 Palestinians during a raid on central Gaza's Nuesirat that saw four hostages rescued on Saturday.\nIn Nuseirat, where the hostages were reportedly being held, Palestinians described coming under intense bombardment and heavy gunfire.\nPosters that read 'Home Now' depicting the portraits of the four rescued Israeli hostages, in Tel Aviv, Israel, June 8, 2024.\nHe was speaking in Paris alongside French President Emmanuel Macron, who said: \"We rejoice at the release of the four Israeli hostages.\"\nMajor sticking points include Hamas insisting on a permanent truce and full Israeli withdrawal from all parts of Gaza – demands Israel has rejected.", "url": "https://www.dailysabah.com/world/mid-east/over-200-palestinians-killed-as-israel-rescues-4-gaza-hostages", "date": "2024-06-09 10:45", "source": "GDELT"}, {"id": "6b417b9c-3935-4064-8bf6-4bfcda1ef03d", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "url": "https://www.sconeadvocate.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/", "date": "2024-06-09 03:30", "source": "GDELT"}, {"id": "4978ca7d-8f8f-442b-8700-8f1bd1f60ac6", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "url": "https://www.maitlandmercury.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=7607", "date": "2024-06-09 03:45", "source": "GDELT"}, {"id": "5d44ee2f-fbdd-4090-b3b7-781d6caf745c", "message": "The war in Gaza has killed more than 36,000 Palestinians there, while hundreds of others have been killed in Israeli operations in the West Bank.\nIt began after Hamas-led militants attacked Israel on October 7, killing about 1,200 people and taking around 250 hostage.", "url": "https://www.juneesoutherncross.com.au/story/8656636/cargo-ship-hit-in-suspected-yemen-houthi-attack/?cs=6409", "date": "2024-06-09 03:45", "source": "GDELT"}, {"id": "3bf7fd1b-d724-4d0d-92dd-5af9b6f74951", "message": "The \"strict\" Gazans claim: these are not only the 274 killed yesterday, but we must add another 37,000 dead, ten thousand missing and 85,000 wounded so far in the Gaza Strip on the way to the release of the four abductees yesterday.", "url": "https://abualiexpress.com/en/en28672/", "date": "2024-06-09 16:31", "source": "Telegram"}], "location": "GULF OF ADEN", "total_score": 4.47113761305809, "count": 20, "average_score": 0.22355688065290452, "final_score": 0.7564898164570332}, "377b9b49-7044-4d01-9ade-6c4d1afc7bc5": {"messages": [{"id": "377b9b49-7044-4d01-9ade-6c4d1afc7bc5", "message": "1 dead, multiple injured after shooting and stabbing at Lake Berryessa, Napa Co. sheriff saysOne person is dead and multiple people are injured after a shooting and stabbing at Lake Berryessa on Saturday, the Napa County Sheriff's Office said.\nOne person is dead and multiple people are injured after a shooting and stabbing at Lake Berryessa on Saturday, the Napa County Sheriff's Office said.\nOne person is dead and multiple people are injured after a shooting and stabbing at Lake Berryessa on Saturday, the Napa County Sheriff's Office said.\nOne person is dead and multiple people are injured after a shooting and stabbing at Lake Berryessa on Saturday, the Napa County Sheriff's Office said.\nNAPA COUNTY, Calif. (KGO) -- One person is dead and multiple people are injured after a shooting and stabbing at the Oak Shore Day Use area of Lake Berryessa on Saturday, the Napa County Sheriff's Office said.", "url": "https://abc7news.com/post/1-dead-multiple-injured-after-shooting-stabbing-lake/14927183/", "date": "2024-06-09 06:15", "source": "GDELT"}, {"id": "450bfd89-ec2f-4840-97d2-54841909d647", "message": "MODESTO — Detectives say they believe a stabbing that left one person dead in Modesto Saturday night is an isolated incident.\nThe Modesto Police Department says officers responded to the 1300 block of Trenary Way just before 8 p.m. to investigate reports of a stabbing.\nAt the scene, first responders found one victim who was quickly transported to the hospital.\nDetectives with Modesto police's Investigative Services Division are at the scene, and a heavy police presence remained in the area throughout the night.\nPolice say there is no threat to the public.", "url": "https://www.cbsnews.com/sacramento/news/1-dead-in-modesto-stabbing-police-say-there-is-no-threat-to-the-public/", "date": "2024-06-09 08:15", "source": "GDELT"}], "location": "in english\nLake Berryessa", "total_score": 0.2304428666830063, "count": 1, "average_score": 0.2304428666830063, "final_score": 0.19131000667810438}, "2ee3902a-2afe-4c3e-a27f-3ade6b9d96d9": {"messages": [{"id": "2ee3902a-2afe-4c3e-a27f-3ade6b9d96d9", "message": "Lebanese army forces turn back motorists as they close a road near the US embassy in Beirut on Wednesday (AFP photo)Lebanese army forces turn back motorists as they close a road near the US embassy in Beirut on Wednesday (AFP photo)(MENAFN- Jordan Times) BEIRUT - A Syrian was arrested after a shooting near the US embassy in Beirut on Wednesday, the Lebanese said, with the embassy saying its staff were safe.\nThe embassy, in the northern suburb of Awkar, \"was subjected to gunfire by a person holding Syrian nationality\", the army said in a statement on X, formerly Twitter.\n\"Thanks to the quick reaction\" of the Lebanese army, security forces \"and our embassy security team, our facility and our team are safe\", it said on X.\nAn AFP photographer said access to the area around the embassy was blocked off, with a heavy army deployment in the area.\nA judicial source told AFP that security forces were combing wooded areas near the embassy for any accomplices, adding that the shooter's wounds were \"serious\".", "url": "https://menafn.com/1108311426/Syrian-Arrested-After-Shooting-Near-US-Embassy-In-Beirut-Army", "date": "2024-06-09 06:45", "source": "GDELT"}, {"id": "3295c47f-7413-4802-b26b-1e902d261723", "message": "Lebanese authorities have arrested 20 people after a shooting near the U.S. embassy in Beirut said to be in solidarity with Palestinians in Gaza, a judicial source told AFP.\nA Syrian man was arrested Wednesday after the shooting at the embassy, and a judicial official said at the time that the assailant carried out the attack \"in support of Gaza.\"\nThe U.S. embassy said on X that \"small arms fire was reported in the vicinity of the entrance\" and that \"thanks to the quick reaction\" of the Lebanese army, security forces \"and our embassy security team, our facility and our team are safe.\"\nThe judicial source said \"the number of people arrested over the attack on the American embassy has risen to 20, including the Syrian assailant Qais Farraj, who is receiving care at the military hospital in Beirut.\"\nBut the source said existing evidence suggested it was unlikely the attack was part of an organized operation.", "url": "https://naharnet.com/stories/en/305802-20-so-far-arrested-over-us-embassy-attack", "date": "2024-06-09 10:45", "source": "GDELT"}, {"id": "0f2c22ee-c812-45a5-be2a-dda6eca3ec89", "message": "The US Central Command did not forget to congratulate the Israeli security forces and the Israeli people on the occasion of the hostage rescue operation.\n\n##\nThank you very much 🇮🇱🇺🇸❤️", "url": "https://abualiexpress.com/en/en28647/", "date": "2024-06-09 06:06", "source": "Telegram"}], "location": "BEIRUT.", "total_score": 0.5325089544057846, "count": 2, "average_score": 0.2662544772028923, "final_score": 0.2463781340420246}, "13b0d8c4-5bb3-4e74-b43b-182d4beb2596": {"messages": [{"id": "13b0d8c4-5bb3-4e74-b43b-182d4beb2596", "message": "Police were called to Bradford Street in Bolton on Friday evening [PA Media]A man has been charged with murder by police investigating a fatal stabbing.\nThe attack happened on Bradford Street in Bolton at about 19:15 BST on Friday.\nPaul Simmons, 48, of Bradford Street, Bolton has been charged with murder.\nA 31-year-old man, of no fixed address, has been charged with assisting an offender, while a woman aged 37, also of no fixed address, has been charged with obstructing police.\nListen to the best of BBC Radio Manchester on Sounds and follow BBC Manchester on Facebook, X and Instagram.", "url": "https://www.yahoo.com/news/murder-charge-man-stabbed-street-100339275.html", "date": "2024-06-09 11:00", "source": "GDELT"}, {"id": "b3d6c924-cb9e-4ae9-a9bd-89f78d5af712", "message": "Two men have been arrested after a man was stabbed to death in south-east London (Picture: UKNIP)A 21-year-old has died after he was stabbed repeatedly in a ‘brutal’ attack on a London street.\nDespite the efforts of emergency service workers, Mr Robinson sadly died at the scene at Carteret Way in Deptford.\nTwo men have been arrested on suspicion of murder, with a 50-year-old man released on bail, while a 44-year-old remains in custody.\nSpeaking with News Shopper, one local woman said she was ‘not really surprised’ to see news of a fatal crime.\n‘A young man has died in brutal circumstances and his family are grieving.", "url": "https://metro.co.uk/2024/06/09/man-dies-london-stabbed-multiple-times-20999052/", "date": "2024-06-09 09:45", "source": "GDELT"}, {"id": "fa0f767c-4ce5-41b1-a5bf-726865c59288", "message": "Detectives are appealing for witnesses, footage and information as they continue to investigate a murder in Deptford.\nPolice were called at approximately 22:35hrs on Thursday, 6 June to reports of a stabbing in Carteret Way, SE8.\nOfficers and London Ambulance Service attended but despite their best efforts the victim sadly died at the scene.\nHis family has been informed and the man has been identified as 21-year-old Robert Robinson who lived locally.\nFootage, images and information can be uploaded, anonymously if you wish, to: https://mipp.police.uk/operation/01MPS24W58-PO1You can also provide information 100% anonymously to the independent charity Crimestoppers on 0800 555 111.", "url": "https://news.met.police.uk/news/detectives-issue-further-appeal-as-deptford-murder-victim-named-484871", "date": "2024-06-09 11:15", "source": "GDELT"}, {"id": "616aa3bd-f7e4-42db-8f74-3810094de3b2", "message": "A manhunt is underway for a convicted killer who is suspected of stabbing a man to death on Sunday.\nA man in his 30s was fatally stabbed in Finglas, Dublin, shortly after 1am.\n\"Shortly after 1am, gardaí and emergency services attended a residence in the Scribblestown area where a man in his 30s was found with serious injuries.\n\"A senior investigating officer (SIO) has been appointed to lead the inquiry, and an incident room has been established at Finglas Garda Station.\nGardaí are appealing for witnesses to come forward, particularly those who were in the Scribblestown area between midnight and 1am.", "url": "https://www.irishexaminer.com/news/arid-41412559.html", "date": "2024-06-09 12:30", "source": "GDELT"}, {"id": "7c8c7aed-7ee0-4f8e-8244-a825b1f2ffdf", "message": "Omaha Police are investigating a stabbing they say happened early Saturday morning.\nAccording to a statement, at just after 3:40 a.m. officers were called to Immanuel Hospital at 6901 N 72nd Street in response to a cutting victim that had arrived.\nOfficers says they spoke with the victim, 23-year-old Emonia Ross, who stated she was cut by an unknown female at the Los Diablos Motorcycle Club at 2501 Ames Avenue.\nRoss' injuries are not believed to be life threatening.\nAnyone with information is urged to contact Omaha Crime Stoppers anonymously at (402) 444-STOP, at www.omahacrimestoppers.org or on the P3 Tips mobile app.", "url": "https://kfab.iheart.com/content/2024-06-08-omaha-police-investigate-cutting-early-saturday/", "date": "2024-06-09 03:30", "source": "GDELT"}, {"id": "9a159913-3282-42f3-be04-73ee2d0f45d2", "message": "NASHVILLE, Tenn. (WSMV) - A man was hospitalized with non-life-threatening injuries after he was stabbed in the chest in South Nashville.\nEarly Saturday morning police responded to a call about a stabbing in the 300 block of Bakertown Road.\nWhen officers arrived at the scene, they found a man stabbed in the chest.\nDuring the argument, the victim, unrelated to the suspect and a friend, intervened in the fight.\nThe suspect allegedly stabbed the victim in the chest.", "url": "https://www.wsmv.com/2024/06/08/man-hospitalized-after-being-stabbed-chest-south-nashville/", "date": "2024-06-09 03:15", "source": "GDELT"}], "location": "Bolton", "total_score": 0.8510474413633347, "count": 5, "average_score": 0.17020948827266694, "final_score": 0.26914664179086684}, "22729bc6-0390-4c63-a893-9124bb4b208b": {"messages": [{"id": "22729bc6-0390-4c63-a893-9124bb4b208b", "message": "JURUPA VALLEY, Calif. — A Riverside County Deputy shot a knife-wielding man during a welfare check in Jurupa Valley Saturday morning, according to deputies.\nThat's when the department said the man came at a deputy with the knife, and the deputy shot him.\nSUGGESTED: LASD deputy shot in back while sitting at traffic light; suspect arrestedNo other details were immediately available.\nThe man has not been identified, and the deputy who shot him has been placed on paid administrative leave.\nThe Riverside County District Attorney's Office and the Riverside Sheriff's Force Investigations Detail are investigating the shooting.", "url": "https://www.foxla.com/news/deputy-shoots-knife-wielding-man-jurupa-valley", "date": "2024-06-09 04:00", "source": "GDELT"}, {"id": "3264e095-5025-4b72-915a-218a1eee8244", "message": "MEMPHIS, Tenn. — The Mississippi Bureau of Investigation (MBI) is investigating an officer-involved shooting in Corinth, Mississippi involving the Alcorn County Sheriff’s Office that occurred on June 8.\nDeputies with the Alcorn County Sheriff’s Office responded to a call for service on County Road 575 in Corinth, Mississippi at approximately 3:30 p.m.\nThe first deputy on the scene observed a white male striking a white female, later identified as his mother in the head with an object.\nAs the subject continued to strike his mother in the head the deputy then fired his service weapon striking the male subject.\nUpon completing the investigation, MBI agents said they would share their findings with the Attorney General’s office.", "url": "https://www.yahoo.com/news/mbi-investigating-officer-involved-shooting-225955949.html", "date": "2024-06-09 01:45", "source": "GDELT"}], "location": "JURUPA VALLEY, California.", "total_score": 0.2975388765335083, "count": 1, "average_score": 0.2975388765335083, "final_score": 0.2382772135734558}, "fcb14e55-bc56-470f-a9f6-001362b604f0": {"messages": [{"id": "fcb14e55-bc56-470f-a9f6-001362b604f0", "message": "Russian-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a US-supplied HIMARS missile.\nEmergency Ministry employees carry a wounded person from the side of the damaged apartment building following Friday's Ukrainian missile attack on Luhansk, the capital of Russian-controlled Luhansk region, eastern Ukraine.\nUkrainian air defence overnight shot down nine out of 13 Russian drones over the central Poltava region, southeastern Zaporizhzhia and Dnipropetrovsk regions, and the Kharkiv region in the northeast, Ukraine’s air force said.\nUkrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday.", "url": "https://www.newstalkzb.co.nz/news/world/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-appointed-officials-say/", "date": "2024-06-09 03:15", "source": "GDELT"}, {"id": "5bd87dc2-85c9-4a9c-b338-546b03cd7b4a", "message": "Russians drop explosives from UAV on ambulance in Kherson OblastRussian forces dropped explosives on an ambulance that was responding to a call after a shelling in Kherson Oblast on the evening of June 8, regional governor Oleksandr Prokudin reported on Telegram.\nОлександр Прокудін/TelegramAs a result of the attack, the driver and paramedic of the medical team were injured.\nRead also: Russia destroys another Epicentr hypermarket in Kherson – Photo\"The occupiers dropped explosives on a medical team that was rushing to a call after the shelling in the Bilozerka municipality,\" he wrote.\nToday, a paramedic of the medical team also turned to the hospital for help.\nThe victim was diagnosed with concussion.”Read also: Russia kills one, injures another after shelling KhersonKherson Oblast suffers daily from attacks by the Russian army.", "url": "https://www.yahoo.com/news/ambulance-hit-kherson-oblast-russian-143700146.html", "date": "2024-06-09 15:30", "source": "GDELT"}, {"id": "265aa706-cb64-4618-bb8f-4c451baecc13", "message": "First Time The Most Modern Su-57 Fighter Was Damaged In Russia 48 9.06.2024, 9:2626,510The aircraft fell under attack at the Akhtubinsk air base 600 km from the front line.\nOn June 8, a Su-57 multifunctional fighter of the aggressor state was hit on the territory of the Akhtubinsk airfield in the Astrakhan region of the Russian Federation, located 589 kilometers from the line of contact.\nThis is reported by the Ukrainian Defence Intelligence (GUR) with reference to satellite images of the aircraft location at the airfield.\nReferenceThe Su-57 is the most modern Russian fighter jet, which is capable of using the Kh-59 and Kh-69 missiles.\nFew units of these combat aircraft are in service with the Russian Aerospace Forces.", "url": "https://charter97.org/en/news/2024/6/9/598220/", "date": "2024-06-09 10:00", "source": "GDELT"}, {"id": "8a6c17ff-dcb4-4df5-8136-6d8c9a89b1b0", "message": "Its distance from Ukraine suggests it was most likely hit by drones.\nBut the airstrip's distance from Ukraine, as well as unofficial comments from Russia, points to the likely use of Ukrainian-made drones.\nThe ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nRussia's Su-57 fleet has been largely absent from the skies over Ukraine, and has instead been used to fire long-range missiles across the border.\nThree drones hit Belgorod province late on Saturday, damaging a power line and blowing out windows but causing no casualties, said Gov.", "url": "https://abcnews.go.com/International/wireStory/ukraine-struck-russias-advanced-warplanes-110962448", "date": "2024-06-09 10:45", "source": "GDELT"}, {"id": "fee668cd-b944-4b70-9ca2-616b7f91ab85", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nRussians carried out more than 2,800 shelling on the positions of Ukrainian troops and settlements using different types of weapons.\nIn the Lyman direction, Russian forces tried seven times to advance in the direction of settlements Nevske, Terni, Ivanivka, Torske and Dibrova.\nThe AFU losses amounted to up to 135 Ukrainian troops, five motor vehicles, and one 122-mm 2S1 Gvozdika self-propelled artillery system.", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-08.htm", "date": "2024-06-09 00:30", "source": "GDELT"}, {"id": "9126e787-8f7a-492e-a7e8-5bbca82549ac", "message": "(MENAFN- UkrinForm) Russia has lost a total of 518,560 and officers killed and wounded in action since the full-scale invasion, according to the estimates drawn by the Ukrainian side.\nThat's according to the General Staff of Ukraine's Armed Forces, Ukrinform reports.\nIn the past day alone, these losses rose by 1,270, the Ukrainian military notes.\nFinland's military aid to Ukraine includes latest products under developmentThe latest reports on enemy losses are being verified.\nAs Ukrinform reported earlier, special operations units from Ukraine's Security Service in the past week engaged nine Russian tanks and four air defense systems, as well as eliminated 212 invaders.", "url": "https://menafn.com/1108311711/Russias-Combat-Losses-Up-By-1270-In-Past-Day", "date": "2024-06-09 08:15", "source": "GDELT"}, {"id": "494b0fa3-f20c-4bc3-9709-627e0a4cfecf", "message": "The strike came shortly after its Western allies allowed Kyiv to use their weapons for limited strikes inside Russia.\nBut the airstrip's distance from Ukraine, as well as unofficial comments from Russia, point to the likely use of Ukrainian-made drones.\nSince Moscow’s full-scale invasion more than two years ago, Kyiv has ramped up domestic drone production and used the munitions to strike deep inside Russia.\nThe ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nThree drones hit Belgorod province late on Saturday, damaging a power line and blowing out windows but causing no casualties, said Gov.", "url": "https://www.ksat.com/news/world/2024/06/09/ukraine-says-it-struck-one-of-russias-most-advanced-warplanes/", "date": "2024-06-09 15:00", "source": "GDELT"}, {"id": "51fe380c-0c3b-4595-b64c-593a42558aec", "message": "The strike came shortly after its Western allies allowed Kyiv to use their weapons for limited strikes inside Russia.\nBut the airstrip's distance from Ukraine, as well as unofficial comments from Russia, point to the likely use of Ukrainian-made drones.\nSince Moscow’s full-scale invasion more than two years ago, Kyiv has ramped up domestic drone production and used the munitions to strike deep inside Russia.\nThe ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nThree drones hit Belgorod province late on Saturday, damaging a power line and blowing out windows but causing no casualties, said Gov.", "url": "https://www.clickondetroit.com/news/world/2024/06/09/ukraine-says-it-struck-one-of-russias-most-advanced-warplanes/", "date": "2024-06-09 14:00", "source": "GDELT"}, {"id": "27e0a31f-9f1c-4f72-8cbc-9bfc3192e8b2", "message": "The strike came shortly after its Western allies allowed Kyiv to use their weapons for limited strikes inside Russia.\nBut the airstrip’s distance from Ukraine, as well as unofficial comments from Russia, point to the likely use of Ukrainian-made drones.\nIn January, drones hit a gas terminal near St. Petersburg that lies over 1,000 kilometres (620 miles) north of the border.\nThe ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nThree drones hit Belgorod province late on Saturday, damaging a power line and blowing out windows but causing no casualties, said Gov.", "url": "https://www.metro.us/ukraine-says-it-struck-one-of-russias-most-advanced-warplanes/", "date": "2024-06-09 15:45", "source": "GDELT"}, {"id": "d45af0bc-08e1-49cc-bd91-c4e2411007ef", "message": "Ukraine claims it may have damaged a Russian Sukhoi Su-57 fighter at the Akhtubinsk airbase, 365 miles from Ukraine.\nSummary and Key Points: Ukraine claims it may have damaged a Russian Sukhoi Su-57 fighter at the Akhtubinsk airbase, 365 miles from Ukraine.\n-Russian sources on Telegram confirmed shrapnel damage to the Su-57, but the Kremlin has not acknowledged the incident.\n-If true, this raises questions about the effectiveness of Russia's air defenses.\nUkraine Allegedly Damages Russia's Su-57 Fighter on the GroundNo fifth-generation fighter jet has been lost in aerial combat – but Ukraine claimed that its forces may have at least damaged one of the Russian Aerospace Force's Sukhoi Su-57 (NATO reporting name \"Felon\") on Saturday.", "url": "https://nationalinterest.org/blog/buzz/images-show-russian-su-57-felon-stealth-fighter-attacked-ukraine-211366", "date": "2024-06-09 15:15", "source": "GDELT"}, {"id": "d0243d25-42b5-4369-aa6c-5839a80cd3df", "message": "Ukraine hit a Su-57 fighter jet stationed in Russia for the first time, Ukraine's military intelligence agency (HUR) reported on June 9.\nThe plane is Russia’s most modern fighter jet with only a few units in service in the Russian air force.\nIt can carry Kh-59 and Kh-69 cruise missiles that regularly attack Ukraine, including civilian targets.\nUkraine managed to down six Russian fighter jets last month across front line regions.\nOn May 17, Ukraine hit the Balbek Airfield in occupied Crimea.", "url": "https://www.yahoo.com/news/ukraine-hits-russian-su-57-072508315.html", "date": "2024-06-09 08:45", "source": "GDELT"}, {"id": "c75349e5-cf5e-41f3-94c7-a18830dbd479", "message": "A Ukrainian warplane has for the first time fired a weapon that struck a target inside Russia, a Ukrainian military source has told Sky News.\nThe source said a \"Russian command node\" was hit on Sunday in the area of Belgorod, western Russia.\nThe United States and France recently said the Ukrainian armed forces were permitted to use their arms to strike military targets inside Russia - from where Russian forces are launching attacks against Ukraine.\nBut the use of a warplane to strike targets inside Russia could be seen by Moscow as a new escalation.\nThe details of the latest Ukrainian strikes come after AP, quoting a US senator and a Western official, reported on Wednesday that Ukraine had used US weapons to strike inside Russia in recent days.", "url": "https://news.sky.com/story/ukrainian-warplane-fires-weapon-at-target-inside-russia-for-first-time-13150251", "date": "2024-06-09 16:00", "source": "GDELT"}, {"id": "36fa5ecc-91ad-4bb8-864e-648b6a5dd5f5", "message": "According to senior Polish officials, Poland’s Eastern Shield defensive line will be capable of thwarting “all forms of aggression.”Poland, next door to Ukraine, wants to deter a Russian air and ground invasion.\nThe Eastern Shield will cover Poland’s border with Belarus and its border with Russia’s Kaliningrad Oblast (on the Baltic Sea).\n“Fixed defenses” is a classic military term for fortifications and obstacles that stop or hinder the movement of enemy military forces.\nThe Russian Air Force can’t handle Ukrainian air defenses, so Russia fires long-range missiles.\nPoland has published sketches of Eastern Shield defenses.", "url": "https://www.sunjournal.com/2024/06/09/austin-bay-polands-eastern-shield-on-natos-eastern-flank-part-2/", "date": "2024-06-09 07:45", "source": "GDELT"}, {"id": "8e07087f-627f-4f04-8d6b-54b3c8e77ae3", "message": "No one knows exactly how many Russian soldiers have been shot dead by their officers for refusing to fight or for trying to walk away from the fighting.\nRussia conscripts a quarter million young Russian men each year for one year of conscript service.\nThis forced the government to spend a lot more money to get more nominally volunteer contract soldiers by forcing men with prior military service, and many with none, into the military as better paid contract soldiers.\nThis worked initially until reports of the high casualty rates of contract soldiers in Ukraine became widely known.\nPay for contract soldiers was competitive with similar jobs, which was not a bad deal when there was not a war going on in Ukraine.", "url": "http://www.strategypage.com/htmw/htmoral/articles/202406090548.aspx", "date": "2024-06-09 07:00", "source": "GDELT"}, {"id": "5f3133b3-5a11-4b45-adef-5ff5ff75977d", "message": "Ukraine on Sunday said its forces hit an ultra-modern Russian warplane stationed on an air base nearly 600 kilometers (370 miles) from the front lines.\n6 Ukraine on Sunday said its forces hit an ultra-modern Russian warplane stationed on an air base nearly 370 miles from the front lines.\nAPBut the airstrip’s distance from Ukraine, as well as unofficial comments from Russia, points to the likely use of Ukrainian-made drones.\nRussia’s Su-57 fleet has been largely absent from the skies over Ukraine, and has instead been used to fire long-range missiles across the border.\nThe move drew a furious response from Moscow, and warnings it could embroil NATO in a war with Russia.", "url": "https://nypost.com/2024/06/09/world-news/ukraine-says-it-struck-one-of-russias-most-advanced-warplanes/", "date": "2024-06-09 18:30", "source": "GDELT"}], "location": "Kharkiv, Ukraine", "total_score": 4.323311343789101, "count": 14, "average_score": 0.3088079531277929, "final_score": 0.636165567189455}, "acfe82bd-6b10-4556-b95c-a018cd200745": {"messages": [{"id": "acfe82bd-6b10-4556-b95c-a018cd200745", "message": "A conspiracy theorist purposefully blew up his Virginia home while authorities were trying to serve a search warrant in December, according to a new video released by law enforcement.\nOn December 4, a patrol officer was in the area when he heard what sounded like gunshots, officials said.\nHe ran into children at a nearby park who told him they were “scared,” body cam footage shows.\nSeveral gunshots were heard from inside the home and officers at the scene can be ducking for cover.\nPolice then deployed tear gas inside the home in the hopes Yoo would finally give up, but to no avail.", "url": "https://nypost.com/2024/06/09/us-news/conspiracy-theorist-blew-up-virginia-house-on-purpose-last-year-shocking-new-body-cam-footage-shows/", "date": "2024-06-09 05:45", "source": "GDELT"}, {"id": "19d73626-5467-4632-88fc-2fe951e44bdb", "message": "The case has no ties to terrorism, and 56-year-old James Yoo acted alone, FBI counterterrorism agent Sanjay Virmani said.\nARLINGTON, Va. -- A man who died in a house explosion six months ago outside the nation's capital deliberately detonated gasoline canisters in his basement that caused the blast, authorities said Friday.\nAuthorities showed dramatic video of the explosion at Friday's news conference, taken from police dash cams and body-worn cameras of officers.\nIt also showed body cam video of children in a nearby park frightened by the flare gun shots and efforts by officers to talk to Yoo and get him to come out of his house.\nThey had also turned off the natural gas connection to the home in the early phase of the standoff.", "url": "https://abc7.com/post/house-explosion-northern-virginia-december-2023-was-caused/14927001/", "date": "2024-06-09 06:45", "source": "GDELT"}], "location": "Virginia", "total_score": 0.22520755231380463, "count": 1, "average_score": 0.22520755231380463, "final_score": 0.18764528661966323}, "13e5a349-ac95-4abf-8f4c-62b72f7dd7aa": {"messages": [{"id": "13e5a349-ac95-4abf-8f4c-62b72f7dd7aa", "message": "Photo : TwitterA 39-year-old Polish man was remanded in custody for 12 days on Saturday following an assault on Danish Prime Minister Mette Frederiksen , which occurred the previous day.\nThe prime minister was hit by the suspect as he approached him in Copenhagen's downtown center.\nIt's incredibly touching,\" Frederiksen told Ritzau news agency in a written statement.\nA representative told Polish state radio, \"Danish authorities have informed us that the person detained is a Polish citizen, who has been staying in Denmark for some time.\"\nThis event happened shortly after Slovakia's Prime Minister Robert Fico was the target of a botched assassination attempt that left him gravely injured.", "url": "https://www.timesnownews.com/world/europe/mette-frederiksen-all-on-polish-man-who-attacked-denmarks-prime-minister-article-110829698", "date": "2024-06-09 02:00", "source": "GDELT"}, {"id": "85a49a72-6993-4100-8ea6-51e1e1d89ea7", "message": "NYPD releases image of suspect accused of stabbing MTA bus driver in the neck in BrooklynEAST NEW YORK, Brooklyn (WABC) -- Police released the image of the man accused of stabbing a MTA bus driver while he was on duty in Brooklyn.\nThe incident occurred around 11:30 a.m. on Saturday aboard a B99 bus near Pitkin Avenue and Alabama Avenue.\nNYPDAccording to the NYPD, the suspect got into a verbal dispute with the 60-year-old bus driver before he stabbed him in the neck with an unknown sharp object.\nPolice say the suspect managed to exit the bus and flee westbound on Pitkin Avenue.\nWATCH | MTA bus driver stabbed in neck during dispute in BrooklynAnthony Carlo has the latest from East New York.", "url": "https://abc7ny.com/post/east-new-york-stabbing-nypd-searches-suspect-accused-attack-mta-bus-driver-brooklyn-nyc/14928765/", "date": "2024-06-09 18:30", "source": "GDELT"}], "location": "Copenhagen", "total_score": 0.20156091451644897, "count": 1, "average_score": 0.20156091451644897, "final_score": 0.17109264016151426}, "f6c3ede0-87a8-4467-acba-705a9cde3d37": {"messages": [{"id": "f6c3ede0-87a8-4467-acba-705a9cde3d37", "message": "GAZA STRIP: sraelis on Sunday cheered the rescue of four hostages from war-torn Gaza while Palestinians counted the cost, with Hamas officials saying 274 people were killed and hundreds wounded during the daytime raid.\nFinancial newspaper Calcalist hailed a “heroic operation” that had given Israelis “a few hours of grace”, while the left-leaning Haaretz daily called the rescue operation a “morale boost” for the nation.\nRenewed clashesHamas’s Ezzedine Al Qassam Brigades claimed that other hostages were killed during the rescue operation, without providing details or proof, and warned that conditions would worsen for the remaining captives.\nAfter Saturday’s rescue operation, 116 hostages remain in Gaza, although the army says 41 of them are dead.\nAmid the death and suffering, Israel has faced growing diplomatic isolation, with international court cases accusing it of war crimes.", "url": "https://gulfnews.com/world/mena/this-horror-must-stop-more-than-200-killed-as-israel-rescues-four-gaza-hostages-1.103029182", "date": "2024-06-09 10:45", "source": "GDELT"}, {"id": "7cf6178a-f5d0-4c81-9571-b8b20e11904a", "message": "CNN —Four hostages have been rescued in an Israeli operation that took weeks of planning – but killed scores of Palestinians in Gaza and left behind a trail of devastation.\nHagari said Israeli forces had to enter civilian areas to reach hostages as this was where Hamas had embedded itself.\nOne officer was shot and killed during the operation, according to Israeli police.\n“While under fire, under fire inside the buildings, under fire on the way out from Gaza, our forces rescued our hostages,” he said.\nMore than 100 hostages were freed under a temporary truce last year, while Israel has rescued seven hostages by military means.", "url": "https://www.cnn.com/2024/06/09/middleeast/israel-hostage-rescue-gaza-intl-hnk/", "date": "2024-06-09 06:15", "source": "GDELT"}, {"id": "440752d3-90e1-485e-9aee-858f494c9cba", "message": "CNN —Four hostages have been rescued in an Israeli operation that took weeks of planning – but killed scores of Palestinians in Gaza and left behind a trail of devastation.\nHagari said Israeli forces had to enter civilian areas to reach hostages as this was where Hamas had embedded itself.\nOne officer was shot and killed during the operation, according to Israeli police.\n“While under fire, under fire inside the buildings, under fire on the way out from Gaza, our forces rescued our hostages,” he said.\nMore than 100 hostages were freed under a temporary truce last year, while Israel has rescued seven hostages by military means.", "url": "https://us.cnn.com/2024/06/09/middleeast/israel-hostage-rescue-gaza-intl-hnk/", "date": "2024-06-09 09:45", "source": "GDELT"}, {"id": "604d25c7-d845-4350-9103-46d265280b05", "message": "Yamam Commander Arnon Zamora, H”yd, 36, heroically led Israeli forces in one of the most daring rescue operations in IDF history and tragically paid with his life.\nAfter he retrieved the hostages, he was critically wounded when dozens of terrorists opened fire on the Israeli forces with RPGs, machine guns and rifles.\nZamora also saved countless lives on October 7th when he led the battle against Hamas terrorists near the southern community of Yad Mordechai.\nHe killed dozens of terrorists and prevented them from infiltrating the kibbutz.\nWhen the battle at Yad Mordechai ended, he continued battling terrorists at the Nachal Oz and Be’eeri kibbutzimThe rescue operation has been renamed Operation Arnon in his honor.", "url": "https://www.theyeshivaworld.com/news/israel-news/2289284/%D7%92%D7%99%D7%91%D7%95%D7%A8-%D7%99%D7%A9%D7%A8%D7%90%D7%9C-fallen-officer-also-saved-countless-lives-on-oct-7th.html", "date": "2024-06-09 01:45", "source": "GDELT"}, {"id": "a17e0823-1473-4e11-8cd1-e453c3783b85", "message": "The Washington Post seemed quite irritated, even outraged, that Israeli forces in Gaza staged a successful rescue operation that liberated four hostages on Saturday.\nNot for nothing, the area is also home to a refugee camp, another instance of Hamas terrorists trying to hide behind and among civilians.\nIn this case, not only was Hamas keeping hostages in a civilian area, but the hostages were being held in civilian homes and civilians knew the hostages were there.\n“More than 200 Palestinians killed in Israeli hostage raid in Gaza,” read the headline (via WaPo):“How dare those Jews rescue their hostages!” — WaPo, outraged.\nAlso, these deaths are the fault of Hamas, who refuses to release the remaining Israeli hostages from the October 7 attacks.", "url": "https://townhall.com/tipsheet/mattvespa/2024/06/09/the-washington-post-pens-the-worst-headline-about-the-israel-rescuing-hostages-n2640195", "date": "2024-06-09 10:45", "source": "GDELT"}, {"id": "6ca2a42f-253e-4a8f-afc9-f21e610a7bb8", "message": "The Israeli military said Noa Argamani, 26, Almog Meir Jan, 22, Andrey Kozlov, 27, and Shlomi Ziv, 41, were pulled out in a \"complex\" mission.\nThe hostages are among seven that Israeli forces have freed alive since Palestinian Hamas seized 251 people in their October attack on southern Israel.\n\"They won't be able to release all of them in a military operation,\" said Michael Levy, whose brother Or is still being held.\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including UN-run facilities, as operational centres, charges the deny.\nHe was speaking in Paris alongside French President Emmanuel Macron, who said: \"We rejoice at the release of the four Israeli hostages.\"", "url": "https://www.bssnews.net/news/194123", "date": "2024-06-09 08:30", "source": "GDELT"}, {"id": "a4bf7944-4d3c-4c11-88f0-0bde43757da3", "message": "An Israel Defense Forces (IDF) rescue mission recovered four hostages from Hamas custody on Saturday but killed dozens of Palestinians and injured hundreds.\n“Part of this mission were the air strikes,” Raddatz said.\n“And is that the reason for the air strikes?\n“There can be a rescue mission like what happened yesterday.\nOne Egyptian official with knowledge of the negotiations told CNN that the rescue mission will have a “negative effect.”“[It] won’t be easy,” the Egyptian official said.", "url": "https://www.rollingstone.com/politics/politics-news/idf-spokesman-palestinian-civilian-deaths-hostage-rescue-1235036244/", "date": "2024-06-09 19:30", "source": "GDELT"}, {"id": "de1c34c3-a0c2-4b90-a9e9-09eee9df18a1", "message": "An Israel Defense Forces (IDF) rescue mission recovered four hostages from Hamas custody on Saturday but killed dozens of Palestinians and injured hundreds.\n“Part of this mission were the air strikes,” Raddatz said.\nDid they come from those air strikes in broad daylight?” Raddatz asked Lerner.\n“There can be a rescue mission like what happened yesterday.\nOne Egyptian official with knowledge of the negotiations told CNN that the rescue mission will have a “negative effect.”“[It] won’t be easy,” the Egyptian official said.", "url": "https://www.yahoo.com/news/israel-defense-forces-spokesman-grilled-164245417.html", "date": "2024-06-09 18:45", "source": "GDELT"}, {"id": "e7125901-97e7-411e-a531-0a73b3f728b5", "message": "תיעוד ממצלמות הקסדה של לוחמי שייטת 13 צילום: דובר צה\"לDuring Operation \"Arnon\" to rescue the hostages by the Israel Police ‘Yamam’ (National Counter-Terrorism Unit) and the ISA yesterday (Saturday), IDF soldiers rescued the hostages and the special forces under fire.\nThe Paratrooper Reconnaissance Unit Combat Team led the rescue of the hostages and the Yamam and ISA forces from the vehicles while under fire while continuing to eliminate terrorists.\nThe Shaldag special forces of the IAF and the Yamam directed the airstrikes and activation of fire throughout the operation.\nSoldiers of Unit 669 and the Shaldag Unit protected the life of Israel Police ‘Yamam’ Squad Commander, Chief Inspector Arnon Zamora z”l, from the moment of the encounter until arriving at the hospital, where he died of his wounds.", "url": "https://www.israelnationalnews.com/news/391325", "date": "2024-06-09 19:00", "source": "GDELT"}, {"id": "c4dede44-9a67-410a-82b9-53dcee1caddd", "message": "A closer look at one of the houses in the Nuseirat \"camp\" where part of the hostages were kept\n\nA Gazan journalist shows the remains of a truck he claims was used by Israeli special forces in yesterday's hostage rescue operation.\n\nAt 00:25 of the video he points to the remains of the truck. According to him, the forces destroyed the truck before leaving the scene.\n\nAt 00:35 the journalist points to one of the buildings where the hostages were (the hostages were rescued from two different locations - AA), which was apparently attacked from the air after the rescue.", "url": "https://abualiexpress.com/en/en28661/", "date": "2024-06-09 09:21", "source": "Telegram"}, {"id": "7af6daf1-76cd-4185-be16-d5069949847a", "message": "A photo sent to me by the follower R. in which we see Sergeant Saif Bisan who was killed in battle in the Gaza Strip on April 9, 2008. In an operation of the \"Egoz\" unit in the south of the Gaza Strip, near the Kissufim crossing, together with his friend Arnon Zamora, who was killed yesterday in the operation to rescue the hostages. Arnon is the one with the big smile on the right side of the picture.\n\nSometime during their course in 2005.\n2 heroes.", "url": "https://abualiexpress.com/en/en28654/", "date": "2024-06-09 08:32", "source": "Telegram"}, {"id": "263cc75b-434d-4506-b012-30b61f859df1", "message": "IDF spokesperson:\n\nAfter inspections by the IDF and Shin Bet, it can be confirmed that Abdallah al-Jamal was a Hamas operative who held the abductees Almog Meir, Andrey Kozlov and Shlomi Ziv in his family home in Nuseirat.\n\nThe hostages were held in the same house his family members lived in. This is further proof that the terrorist organization Hamas uses civilians as a human shield.\n\nIsraeli security forces will continue making all efforts necessary for the return of the hostages.", "url": "https://abualiexpress.com/en/en28677/", "date": "2024-06-09 18:47", "source": "Telegram"}], "location": "GAZA STRIP", "total_score": 3.133151724934578, "count": 11, "average_score": 0.28483197499405255, "final_score": 0.5293823824958368}, "0afd43bf-755d-4fae-a2b3-294ad8920a8d": {"messages": [{"id": "0afd43bf-755d-4fae-a2b3-294ad8920a8d", "message": "Israelis on Sunday cheered the rescue of four hostages from war-torn Gaza while Palestinians counted the cost, with Hamas officials saying 274 people were killed and hundreds wounded during the daytime raid.\n\"We all felt that we wouldn't survive,\" she told AFP, condemning \"this brutal occupation that will not let us live.\"\nFinancial newspaper Calcalist hailed a \"heroic operation\" that had given Israelis \"a few hours of grace,\" while the left-leaning Haaretz daily called the rescue operation a \"morale boost\" for the nation.\nRenewed clashesHamas's Ezzedine Al-Qassam Brigades claimed that other hostages were killed during the rescue operation, without providing details or proof, and warned that conditions would worsen for the remaining captives.\nAfter Saturday's rescue operation, 116 hostages remain in Gaza, although the army says 41 of them are dead.", "url": "https://www.koreatimes.co.kr:443/www/world/2024/06/501_376208.html", "date": "2024-06-09 04:30", "source": "GDELT"}, {"id": "edda83ff-60dd-4bff-b434-f7591ef2dc70", "message": "The Israeli rescue operation in Gaza's Nuseirat camp has left dozens killed, Hamas authorities say - Copyright AFP Bashar TALEBHumanitarian aid began trickling back into the devastated Gaza Strip on Saturday via a rebuilt, temporary pier, US forces said.\nCENTCOM stressed that the pier, its personnel and assets were in no way connected to the hostage rescue operation.\nIsraeli police said an officer was mortally wounded during the rescue operation.\nGantz had earlier cancelled a news conference scheduled for Saturday where Israeli media had speculated he would announce his resignation.\nMajor sticking points include Hamas insisting on a permanent truce and full Israeli withdrawal from all parts of Gaza — demands Israel has rejected.", "url": "https://www.digitaljournal.com/world/aid-deliveries-to-gaza-resume-through-rebuilt-pier/article", "date": "2024-06-09 04:30", "source": "GDELT"}], "location": "GAZA", "total_score": 0.23121310770511627, "count": 1, "average_score": 0.23121310770511627, "final_score": 0.19184917539358137}, "46d72608-83f4-49e3-adb2-cda43a58d305": {"messages": [{"id": "46d72608-83f4-49e3-adb2-cda43a58d305", "message": "The Israeli military said Noa Argamani, 26, Almog Meir Jan, 22, Andrey Kozlov, 27, and Shlomi Ziv, 41, were pulled out in a \"complex\" mission.\n\"They won't be able to release all of them in a military operation,\" said Michael Levy, whose brother Or is still being held.\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including UN-run facilities, as operational centres, charges the militants deny.\nHe was speaking in Paris alongside French President Emmanuel Macron, who said: \"We rejoice at the release of the four Israeli hostages.\"\nMajor sticking points include Hamas insisting on a permanent truce and full Israeli withdrawal from all parts of Gaza -- demands Israel has rejected.", "url": "https://www.al-monitor.com/originals/2024/06/hamas-says-more-200-killed-israel-rescues-four-gaza-hostages-0", "date": "2024-06-09 06:45", "source": "GDELT"}, {"id": "5e517b51-2231-4dd3-8cb1-5b0fb1419f18", "message": "Spain, Ireland and Norway said Wednesday that they would recognize a Palestinian state on May 28, a step toward a long-held Palestinian aspiration that came amid international outrage over the civilian death toll and humanitarian crisis in the Gaza Strip following Israel’s offensive.\nSome 140 of 190 represented in the U.N. countries have already recognized a Palestinian state.\nThe 1948 U.N. decision that created Israel envisaged a neighboring Palestinian state, but some 70 years later control of the Palestinian territories remains divided and bids for U.N. membership have been denied.\nThe leaders of Spain, Ireland, Malta and Slovenia said in March they were considering recognizing a Palestinian state as “a positive contribution” toward ending the war.\nFrench President Emmanuel Macron said in February it’s not “taboo” for France to recognize a Palestinian state.", "url": "https://tulsaworld.com/news/nation-world/government-politics/spain-ireland-and-norway-will-recognize-a-palestinian-state-on-may-28-why-does-that/article_d9993390-2ec2-5339-8ac2-84bf43179072.html", "date": "2024-06-09 04:45", "source": "GDELT"}, {"id": "3058f0e4-784b-43a0-b5e1-3e6a72a4ad30", "message": "Senior Hamas official Muhammad Mardawi:\n\nThere are steps we are taking now to prevent the possibility of another Israeli operation like the one in Nuseirat.", "url": "https://abualiexpress.com/en/en28648/", "date": "2024-06-09 06:06", "source": "Telegram"}, {"id": "108ca0fd-e719-4d07-8281-bebfc789c57f", "message": "The Americans are worried that following the Palestinian claims, Hamas operatives will attack the pier.", "url": "https://abualiexpress.com/en/en28646/", "date": "2024-06-09 06:05", "source": "Telegram"}, {"id": "2e9f1e66-4e9d-48df-9533-21f4ccd35074", "message": "The IDF spokesperson published:\nDocumentation from the helmet cameras of Shayetet 13 fighters from the moments when the four abductees were transferred from the Yamam and Shin Bet forces to the IDF; A rescue that took a few minutes, under fire in the heart of Nuseirat", "url": "https://abualiexpress.com/en/en28673/", "date": "2024-06-09 16:36", "source": "Telegram"}], "location": "Gaza", "total_score": 1.3082815110683441, "count": 4, "average_score": 0.32707037776708603, "final_score": 0.34894926443696017}, "bf850c88-36b8-4d23-88e8-99770fed7daf": {"messages": [{"id": "bf850c88-36b8-4d23-88e8-99770fed7daf", "message": "June 8, 2024: The Ukraine War is very much an American war because Russia and the United States have been the major military powers, and opponents, since the end of World War II.\nThis includes Korea (1950-53), Vietnam (1964-73), Kosovo War (1989-96), Gulf (Iraq) War (1990-91), Afghanistan War (2001-2021), Iraq/Islamic terrorists (2003-2011), Iraq Intervention (2014-2021), Syrian Civil War (ongoing since 2014).\nIn addition to these wars that involved American forces, often mainly airpower, there were dozens of smaller interventions which also involved few American troops other than airpower or warships offshore.\nThis includes the Ukraine War (ongoing since 2022) that began when Russia invaded Ukraine.\nThis has been the case since victory in the Spanish American War that lasted from April to December 1898.", "url": "http://www.strategypage.com/%5Chtmw%5Chtworld%5Carticles%5C2024060802636.aspx", "date": "2024-06-09 07:00", "source": "GDELT"}, {"id": "01cabfbf-350d-44d2-9daa-19ece9613bd7", "message": "For much of the war, Ukraine has been constrained when it comes to using powerful Western weapons against Russia.\nKostiantyn Liberov/Libkos/Getty ImagesNortheast of Kharkiv, Russian forces continue to maintain a foothold in the town of Vovchansk.\nBut “most of the city is under the control of the Ukrainian Defense Forces” Voloshyn told CNN.\nFurther south along the eastern front line, Russians have made advances to the west of the city of Avdiivka which fell to Russian forces in February.\nWestern weapons and a new push to draft more soldiers in to the Ukrainian military could give Ukraine the boost it needs.", "url": "https://www.egyptindependent.com/ukraine-stabilizes-the-north-after-surprise-russian-push-but-faces-fresh-pressure-in-the-east/", "date": "2024-06-09 16:00", "source": "GDELT"}, {"id": "8ce4121a-30a8-4100-8b41-fa7c5b53eb7e", "message": "Russia-Ukraine war: List of key events, day 835As the war enters its 835th day, these are the main developments.", "url": "https://www.aljazeera.com/news/2024/6/9/russia-ukraine-war-list-of-key-events-day-835", "date": "2024-06-09 11:15", "source": "GDELT"}], "location": "KYIV", "total_score": 0.6901747286319733, "count": 2, "average_score": 0.34508736431598663, "final_score": 0.30156115502119063}, "e2ed92d4-c900-45fe-a4c6-7e29e18da4fd": {"messages": [{"id": "e2ed92d4-c900-45fe-a4c6-7e29e18da4fd", "message": "About 330 balloons carrying bags of trash had been sent by North Korea since Saturday night, of which about 80 have landed in South Korea, Seoul’s Joint Chiefs of Staff (JCS) said on Sunday.\nSouth Korea’s National Security Council held an emergency meeting Sunday to discuss responses to the latest wave of balloons.\nTrash from a balloon presumably sent by North Korea lies on scattered the ground in Seoul, South Korea on June 9, 2024.\nSouth Korea Joint Chiefs of Staff/APIn May, North Korea responded by sending its own giant balloons south – containing trash, soil, pieces of paper and plastic, and what South Korean authorities described as “filth.”Kim said the balloons were “strictly a responsive act” to South Korea’s years-long practice of sending balloons with anti-North Korea leaflets the other way.\nSouth Korea’s JCS said Saturday night that North Korea was “boosting its presumed trash balloons,” and warned that the wind direction may lead to balloons moving south.", "url": "https://www.cnn.com/2024/06/09/asia/north-korea-balloons-response-intl-hnk/", "date": "2024-06-09 07:45", "source": "GDELT"}, {"id": "d93e9ed8-4581-4ef8-91ec-5763fcff0754", "message": "(File)South Korea resumed loudspeaker broadcasts directed at North Korea on Sunday, its military said, following through on a warning demanding Pyongyang stop sending balloons carrying trash into the South.\nSouth Korea had warned the North it would take retaliatory measures which could include propaganda broadcasts from huge loudspeakers set up at the border.\nThe broadcasts were made Sunday afternoon and whether more will follow depends on how North Korea responds, South Korea's military said.\nSouth Korea's broadcasts include world news and information about democratic and capitalist society with a mix of popular K-pop music.\nThe sound is believed to travel more than 20 kilometres (12.4 miles) into North Korea.", "url": "https://www.ndtv.com/world-news/south-korea-resumes-loudspeaker-broadcasts-after-norths-trash-balloons-5854344", "date": "2024-06-09 18:45", "source": "GDELT"}], "location": "Seoul", "total_score": 0.3535816967487335, "count": 1, "average_score": 0.3535816967487335, "final_score": 0.2775071877241134}, "235ebceb-9c4a-40dc-b9c9-2a04b7578e76": {"messages": [{"id": "235ebceb-9c4a-40dc-b9c9-2a04b7578e76", "message": "A World War II veteran and centenarian and his 96-year-old sweetheart bride tied the knot near the D-Day beaches of Normandy.\nOn June 8, Harold Terens and Jeanne Swerlin tied the knot inland of the D-Day beaches in Normandy, France.\nOn D-Day, Terens was sent to repair returning planes from France to they could rejoin the battle.\nOn D-Day, Terens was sent to repair returning planes from France to they could rejoin the battle.\nWhen he returned from the war, Terens married his first wife Thelma in 1948.", "url": "https://www.dailymail.co.uk/news/article-13510147/WWII-veteran-100-96-Normandy-D-Day-beaches.html", "date": "2024-06-09 06:30", "source": "GDELT"}, {"id": "ed40d979-624d-4354-ac91-4ff3452b5181", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he’s 100, she’s a youngster of just 96 — made their nuptials an almost double-century celebration.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nTerens himself went to France 12 days later, helping transport freshly captured Germans and just-freed American POWs to England.\nFollowing the Nazi surrender in May 1945, Terens again helped transport freed Allied prisoners to England before he shipped back to the U.S. a month later.", "url": "https://www.nbcbayarea.com/news/national-international/world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches/3561050/", "date": "2024-06-09 07:00", "source": "GDELT"}, {"id": "65c540be-fd37-4610-af2f-8e1c603c01bd", "message": "Love can be found at any age and this couple is the best example.\n100-year-old Harold Terens, a World War II veteran, married his 96-year-old sweetheart Jeanne Swerlin on Saturday in a romantic ceremony near the historic D-Day beaches of Normandy, France.\nThe New York City natives exchanged vows at the town hall of Carentan, a site marked by the famous World War II Battle of Carentan, just two days after the 80th anniversary of the D-Day landings.", "url": "https://www.outlookindia.com/international/us/100-year-old-wwii-veteran-marries-96-year-old-sweetheart-near-historic-d-day-beaches-of-normandy", "date": "2024-06-09 14:00", "source": "GDELT"}], "location": "Normandy, France", "total_score": 0.6943302750587463, "count": 2, "average_score": 0.34716513752937317, "final_score": 0.3030155962705612}, "5d21c476-ffbf-410f-9441-de96579f2815": {"messages": [{"id": "5d21c476-ffbf-410f-9441-de96579f2815", "message": "US Bombs Used in Israeli Massacre of 40 in Gaza Refugee CampBy Sharon Zhang / Truthout June 7, 2024, https://scheerpost.com/2024/06/07/us-bombs-used-in-israeli-massacre-of-40-in-gaza-refugee-camp/The targeting of the UN school-turned-shelter is a “blatant” violation of international law, one UN official said.\nn Israeli bombing that killed 40 Palestinians and wounded 74 sheltering in a UN school-turned-shelter in a refugee camp in central Gaza on Thursday was carried out using U.S.-made weapons, an analysis finds.\nThe bombing, which Gaza officials say killed at least 14 children and wounded 23, is a “blatant” violation of international law, human rights groups have said.\nInternational law prohibits targeting civilians and civilian infrastructure in war.\nU.S. weapons have been used in many war crimes committed by Israeli forces in recent months, previous reports have found.", "url": "https://nuclear-news.net/2024/06/09/2-b1-us-bombs-used-in-israeli-massacre-of-40-in-gaza-refugee-camp/", "date": "2024-06-09 05:30", "source": "GDELT"}, {"id": "92cd66e8-8904-4c2f-a749-7f36568e8ae8", "message": "A Gazan resident exclaims in amazement: \n\n\"These Jews are bomb engineers. How do they manage to bomb a building and leave an entire column unscathed?\"", "url": "https://abualiexpress.com/en/en28679/", "date": "2024-06-09 18:51", "source": "Telegram"}], "location": "GAZA REFUGEE CAMP", "total_score": 0.28967955708503723, "count": 1, "average_score": 0.28967955708503723, "final_score": 0.23277568995952605}, "b3f08d15-5986-4264-a17a-524f351eb7e5": {"messages": [{"id": "b3f08d15-5986-4264-a17a-524f351eb7e5", "message": "Hennadiy Matsehora was mayor of Kupyansk in the Kharkiv region during northeast Ukraine before it was liberated by Ukrainian forces in autumn 2022.\nA new… pic.twitter.com/Iddp1n2cIi — Volodymyr Zelenskyy / Володимир Зеленський (@ZelenskyyUa) June 8, 2024ORIGINAL ENTRY: Ukraine Prime Minister Denys Shmyhal has detailed the serious damage from Russia’s protracted campaign to break Ukrainian energy infrastructure.\nA Ukrainian official acknowledged that Russian forces damaged 1.2 gigawatts of capacity in overnight strikes on May 31 and June 1.\nUkraine’s production now is below 20 gigawatts per year, compared to 55 gigawatts before Russia’s invasion.\nThe Prime Minister added that Ukraine is currently importing 1.7 gigawatts from the European Union, with the bloc able to export a maximum of 2.2 gigawatts.", "url": "https://eaworldview.com/2024/06/ukraine-war-russia-energy-war-damage/", "date": "2024-06-09 10:45", "source": "GDELT"}, {"id": "cc2a74dd-ddd5-4e88-b15d-66a25b243d7b", "message": "Finnish Defense Forces believe that weapons donations for Ukraine will be useful for mastering Finnish military equipment, said Lieutenant General Mikko Heiskanen, head of military economy department of Finnish Defense Forces, Yle reported on June 8.\nRead also: Finland hands over combat boats to UkraineNot only weapons stored in warehouses are exported to Ukraine.\nAccording to Heiskanen, the latest innovations of the Finnish defense industry are also being supplied, and some of them are still under development.\n\"Feedback on the use of Finnish products has been positive,” military official said in an interview with STT, adding that experience gained in Ukraine will be useful for the development of the latest Finnish equipment.\nRead also: Finland may ban asylum seekers entry from RussiaHeiskanen also noted that production reserves made by the defense forces for Finnish companies could be activated to support Ukraine.", "url": "https://www.yahoo.com/news/military-aid-ukraine-includes-innovative-075100731.html", "date": "2024-06-09 09:45", "source": "GDELT"}, {"id": "f1f932f3-2037-4db1-a75d-1393ebdae815", "message": "Russia loses 1,270 more soldiers, 60 artillery systems and 26 tanks over past 24 hoursRussian forces have lost 1,270 soldiers, 60 artillery systems and 26 tanks over the past 24 hours.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 9 June 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:around 518,560 (+1,270) military personnel;7,869 (+26) tanks;15,131 (+26) armoured combat vehicles;13,593 (+60) artillery systems;1,097 (+2) multiple-launch rocket systems;836 (+2) air defence systems;357 (+0) fixed-wing aircraft;326 (+0) helicopters;10,982 (+37) strategic and tactical UAVs;2,277 (+0) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;18,562 (+78) vehicles and tankers;2,253 (+5) special vehicles and other equipment.\nSupport UP or become our patron!", "url": "https://www.yahoo.com/news/russia-loses-1-270-more-042020099.html", "date": "2024-06-09 09:45", "source": "GDELT"}], "location": "Kharkiv region", "total_score": 0.5235681533813477, "count": 2, "average_score": 0.26178407669067383, "final_score": 0.24324885368347166}, "75c6cbe4-55ad-4a79-b18e-752dceaf1084": {"messages": [{"id": "75c6cbe4-55ad-4a79-b18e-752dceaf1084", "message": "CNN —Israeli war cabinet member Benny Gantz has resigned from Benjamin Netanyahu’s government, delivering a blow to the prime minister who has been celebrating the rare rescue of hostages held in Gaza.\nIsraeli Minister Benny Gantz addresses the media after announcing his resignation from Israeli Prime Minister Benjamin Netanyahu’s emergency government on June 9, 2024.\nBesides the prime minister, the only other remaining member of the emergency government with decision-making power is Defense Minister Yoav Gallant, also from Likud.\nEyad Baba/AFP/Getty ImagesThe United States has repeatedly called on the prime minister to present a tangible post-war plan for Gaza.\n“The more identical his positions are to those of the prime minister, the more he’ll lose on both sides.", "url": "https://us.cnn.com/2024/06/09/middleeast/benny-gantz-resignation-post-war-plan-gaza-intl-latam/", "date": "2024-06-09 19:30", "source": "GDELT"}, {"id": "5e9965e8-0784-469a-9303-3da3f75be350", "message": "Middle Eastern channels are heavily covering Benny Gantz's announcement this evening, in which the Israeli minister announced his leaving of the war cabinet and coalition government.\n\nThe Iranian Tasnim News Agency chose the following hashtag for the announcement: \"IsraelHasFallen.\"\n\n##\nDramatic...", "url": "", "date": "2024-06-09 18:56", "source": "Telegram"}, {"id": "35e9c112-1236-4f2b-ba4d-1263dd1fcce0", "message": "Middle Eastern channels are heavily covering Benny Gantz's announcement this evening, in which the Israeli minister announced his leaving of the war cabinet and coalition government.\n\nThe Iranian Tasnim News Agency chose the following hashtag for the announcement: \"IsraelHasFallen.\"\n\n##\nDramatic...", "url": "https://abualiexpress.com/en/en28680/", "date": "2024-06-09 18:56", "source": "Telegram"}], "location": "Gaza", "total_score": 0.47672155499458313, "count": 2, "average_score": 0.23836077749729156, "final_score": 0.22685254424810408}, "b9ed234b-776e-4698-ade1-20814b805d03": {"messages": [{"id": "b9ed234b-776e-4698-ade1-20814b805d03", "message": "Palestinian channels publish a photo of what they claim was the vehicle (and ladders) used by the Israeli special forces yesterday in the operation that freed the hostages.", "url": "https://abualiexpress.com/en/en28662/", "date": "2024-06-09 09:53", "source": "Telegram"}, {"id": "51cabb25-a721-4db7-87b0-904a2a729f82", "message": "A Gazan journalist gives a tour of the route taken by part of the Israeli rescue force that freed the abductees and shows how they cut a hole in the wall to reach the house where the abductees were located.", "url": "https://abualiexpress.com/en/en28658/", "date": "2024-06-09 08:43", "source": "Telegram"}], "location": "GAZA", "total_score": 0.6055615544319153, "count": 1, "average_score": 0.6055615544319153, "final_score": 0.45389308810234064}, "606ec65f-aad0-41f8-ab74-68634552ae31": {"messages": [{"id": "606ec65f-aad0-41f8-ab74-68634552ae31", "message": "The \"hot\" story of Saturday for the Palestinians in the West Bank was not the release of the abductees in Nuseirat...\n\nWhat drew a lot of interest on social networks was a video of a swimming pool in Ramallah (probably in one of the villas) in which mixed swimming was observed between men and women in swimwear, in a style that is not usually the first choice for Muslim women...\n\nMany complaints reached the PA police, who dispatched their officers to the scene and closed the pool due to \"violation of morals\".\n\nGazans, for their part, lamented that while they are counting more than 200 dead in Nuseirat, their brothers (and sisters) in the West Bank are spending time at pool parties...", "url": "https://abualiexpress.com/en/en28656/", "date": "2024-06-09 08:39", "source": "Telegram"}, {"id": "25895c47-cb06-41ac-84b3-9d6343adf5c1", "message": "A prominent Gazan wrote: the men in the pool video 👆 from Ramallah are Israeli Arabs who came to find refuge from their wives...\n\nNow the Arabs of Israel are in trouble with the Arabs of the West Bank who are in trouble with the Arabs of the Gaza Strip... a complicated business...", "url": "https://abualiexpress.com/en/en28674/", "date": "2024-06-09 16:39", "source": "Telegram"}], "location": "Ramallah", "total_score": 0.478036493062973, "count": 1, "average_score": 0.478036493062973, "final_score": 0.3646255451440811}}