{"4441c8c0-c14f-41ce-a669-daa079a5ce0c": {"messages": [{"id": "4441c8c0-c14f-41ce-a669-daa079a5ce0c", "message": "The Houthis in Yemen launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nAssociated Press journalists saw the Cole in the Red Sea on Wednesday, now taking part in the U.S. campaign while visiting one of her sister ships, the USS Laboon.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.", "url": "https://www.ynetnews.com/article/hjzp00x00h0", "date": "2024-06-13 05:45", "source": "GDELT"}, {"id": "6a87ef4d-e373-4e95-b45d-563475936f3e", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — Yemen’s Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\n“These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they’re paying for it,” he said.", "url": "https://www.metro.us/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-in-red-sea/", "date": "2024-06-13 02:15", "source": "GDELT"}, {"id": "35a0bc9a-e9fe-42c6-9764-4eb13f59ede7", "message": "Yemen's Houthi rebels launch boat-borne bomb attack against Greek-owned ship in Red SeaABOARD THE USS LABOON IN THE RED SEA (AP) — Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nAssociated Press journalists saw the Cole in the Red Sea on Wednesday, now taking part in the U.S. campaign while visiting one of her sister ships, the USS Laboon.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nEric Blomberg, the commanding officer of the Arleigh Burke-class guided missile destroyer Laboon, when the alert came in on the attack.\n“These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they're paying for it,” he said.", "url": "https://isp.netscape.com/news/world/story/0001/20240612/12e8bf184bfa08669bbe17b8e1f99b0f", "date": "2024-06-13 00:45", "source": "GDELT"}, {"id": "50534cb0-359a-447d-9d9c-1049e600b351", "message": "Dubai, Jun 13 (AP) Yemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a US-led campaign trying to protect the vital waterway.\nAssociated Press journalists saw the Cole in the Red Sea on Wednesday, now taking part in the US campaign while visiting one of her sister ships, the USS Laboon.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe captain “reports the vessel is taking on water, and not under command of the crew,” the UKMTO said.\nThough he and others stressed at the time they were still investigating the attack, he stressed it appeared the vessel targeted had nothing to do with the war.", "url": "https://www.latestly.com/agency-news/world-news-yemens-houthi-rebels-launch-boat-borne-attack-against-greek-owned-ship-in-red-sea-6034005.html", "date": "2024-06-13 01:15", "source": "GDELT"}, {"id": "7be3351b-f3cc-4e3c-aef6-fb63375ac704", "message": "ADVERTISEMENTYemen's Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, marking another escalation in the face of a US-led campaign trying to protect the vital waterway.\nYemen's military spokesman, Brigadier General Yahya Saree, claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe US military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\nAn HSC-7 helicopter lands on the Arleigh Burke-class guided missile destroyer USS Laboon in the Red Sea.", "url": "https://www.euronews.com/2024/06/13/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-in-red-sea", "date": "2024-06-13 08:45", "source": "GDELT"}, {"id": "896b62ef-f8c0-43a8-947e-c8d853758525", "message": "ABOARD THE USS LABOON IN THE RED SEA (AP) — Yemen’s Houthi rebels launched a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday, authorities said, the latest escalation despite a U.S.-led campaign trying to protect the vital waterway.\nGen. Yahya Saree claimed responsibility for the attack, identifying the vessel targeted as the Liberian-flagged, Greek-owned bulk carrier Tutor.\nThe U.S. military separately destroyed three anti-ship cruise missile launchers in Houthi-held Yemen, as well as one rebel drone over the Red Sea.\nThe Houthis launched two anti-ship ballistic missiles over the Red Sea, but they caused no damage, Central Command said.\n“These are just innocent merchant sailors carrying goods through the Red Sea, trying to get it through the least-expensive route, and they’re paying for it,” he said.", "url": "https://www.bostonglobe.com/2024/06/13/world/yemens-houthi-rebels-launch-boat-borne-bomb-attack-against-greek-owned-ship-red-sea/", "date": "2024-06-13 06:00", "source": "GDELT"}], "location": "The Houthis launched two anti-ship ballistic missiles over the Red Sea.", "total_score": 2.881157767787165, "count": 5, "average_score": 0.5762315535574329, "final_score": 0.553362087490203}, "50695376-9425-415e-8d12-711f85288e6d": {"messages": [{"id": "50695376-9425-415e-8d12-711f85288e6d", "message": "Meanwhile, Hamas has called for the US to put “direct pressure” on Israel to secure a permanent ceasefire.\nA senior Hamas official, Osama Hamdan, said it sought “a permanent ceasefire and complete withdrawal” of Israeli troops from Gaza, demands rejected by Israel.\nHezbollah rocketsAs the bloody Gaza war rages into its ninth month, deadly violence has intensified along Israel’s northern border with Lebanon.\nThe Gaza war broke out after Hamas’s 7 October attack which resulted in the deaths of 1,194 people, mostly civilians.\n‘Starvation’A UN investigation concluded yesterday that Israel has committed crimes against humanity during the Gaza war, including that of “extermination”.", "url": "https://www.thejournal.ie/hamas-gaza-israel-antony-blinked-ceasefire-plan-6407843-Jun2024/", "date": "2024-06-13 06:15", "source": "GDELT"}, {"id": "09a5d27b-0e31-49e0-8070-6e6e716e3fb6", "message": "Blinken, in Doha for the last stop of a tour to promote President Joe Biden's Gaza ceasefire roadmap, said the United States would work with regional partners to \"close the deal\".\nA senior Hamas official, Osama Hamdan, said it sought \"a permanent ceasefire and complete withdrawal\" of Israeli troops from Gaza, demands rejected by Israel.\nHezbollah rocketsAs the bloody Gaza war rages into its ninth month, deadly violence has intensified along Israel's northern border with Lebanon.\nHezbollah also claimed more than 10 other attacks on the Israeli military, including one with drones.\n'Starvation'A UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the Gaza war, including that of \"extermination\".", "url": "https://www.ndtv.com/world-news/hamas-urges-us-to-put-pressure-on-israel-for-permanent-gaza-ceasefire-5878753", "date": "2024-06-13 05:30", "source": "GDELT"}], "location": "GAZA", "total_score": 0.5789891795644433, "count": 1, "average_score": 0.5789891795644433, "final_score": 0.4352924256951103}, "209438ef-22da-4786-b307-242be82c2231": {"messages": [{"id": "209438ef-22da-4786-b307-242be82c2231", "message": "An argument led to a stabbing on a TTC bus in Etobicoke that left two people injured late Wednesday afternoon, Toronto police said.\nOfficers received a call for a stabbing near Berry and Park Lawn roads, north of the Queensway, shortly before 6 p.m.Two males were reportedly having a verbal argument on a TTC bus and stabbed each other, police said.\nWhen officers arrived, they located one of the males with a stab wound.\nPolice said the second male fled the scene but was later located by officers.\nIt is unclear if the two males know each other and what led to the argument.", "url": "https://www.cp24.com/news/one-person-seriously-injured-in-stabbing-on-ttc-bus-in-etobicoke-1.6924592", "date": "2024-06-13 01:30", "source": "GDELT"}, {"id": "bfcdae75-d276-4c98-8e74-1ca77410bbe8", "message": "A stabbing on a TTC bus in Etobicoke has left two males injured, one of whom is now in custody, police said on Wednesday.\nPolice were called to the bus at about 5:50 p.m.Police said on X, formerly Twitter, that they received a report of two males arguing on the bus and two males being stabbed.\nWhen they arrived, they found one male suffering from serious but non-life-threatening injuries.\nThe second male fled the bus, but was located later in hospital, where he was getting treatment for non-life-threatening injuries.\nPolice said they don't know if the accused and victim were known to each other, and the circumstances that led to the stabbing are unclear.", "url": "https://www.cbc.ca/news/canada/toronto/ttc-bus-stabbing-1.7233448", "date": "2024-06-13 06:15", "source": "GDELT"}], "location": "Etobicoke", "total_score": 0.33230786235354803, "count": 1, "average_score": 0.33230786235354803, "final_score": 0.2626155036474836}, "046da668-2b5a-4046-a4b5-ca67361159b6": {"messages": [{"id": "046da668-2b5a-4046-a4b5-ca67361159b6", "message": "GENEVA, June 13: A UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the war in Gaza, including that of \"extermination\", while saying Israeli and Palestinian armed groups have both committed war crimes.\nIt found that Israel had committed war crimes, crimes against humanity and violations of international humanitarian law (IHL) and international human rights law (IHRL).\nThe commission found that in that attack, members of the military wings of Hamas and other Palestinian armed groups and Palestinian civilians committed war crimes, as well as violations and abuses of IHL and IHRL.\nSince October 7, the three-member commission has focused on the Gaza war between Israel and Hamas.\n\"These actions constitute war crimes and violations and abuses of IHL and IHRL,\" it said.", "url": "https://myrepublica.nagariknetwork.com/news/un-probe-accuses-israel-of-crimes-against-humanity-hamas-of-war-crimes/", "date": "2024-06-13 06:45", "source": "GDELT"}, {"id": "9d38a811-58fa-4cec-b8e8-86343a74d99c", "message": "A UN investigation concluded Wednesday that Israel had committed crimes against humanity during the war in Gaza, including that of “extermination”, while Israeli and Palestinian armed groups had both committed war crimes.\nIt found that Israel “has committed war crimes, crimes against humanity” and other international law violations.\nThe commission determined that in that attack, members of the military wings of Hamas and other Palestinian armed groups, as well as Palestinian civilians, committed war crimes and other international law violations.\nThese acts were committed against civilians and members of the Israeli security forces, and constituted “war crimes”, it said.\n“Israel obstructed the commission’s investigations and prevented its access to Israel and the Occupied Palestinian Territory,” it added.", "url": "https://www.news18.com/world/un-probe-accuses-israel-of-crimes-against-humanity-hamas-of-war-crimes-8931054.html", "date": "2024-06-13 05:30", "source": "GDELT"}], "location": ")\nGAZA", "total_score": 0.5423190041888238, "count": 1, "average_score": 0.5423190041888238, "final_score": 0.40962330293217664}, "06b3f2b3-6193-4304-8b8e-c607e8d31af3": {"messages": [{"id": "06b3f2b3-6193-4304-8b8e-c607e8d31af3", "message": "The destruction in the eastern part of the Bureij refugee camp in the center of the Gaza Strip after the departure of IDF forces from there last week.", "url": "https://abualiexpress.com/en/en28830/", "date": "2024-06-13 06:11", "source": "Telegram"}, {"id": "ced82c5f-a8bc-4ccc-834b-e271e851d94e", "message": "Before and after: the Yabneh refugee camp in Rafah in the south of the Gaza Strip (located near the Philadelphi axis, roughly in the middle of it).", "url": "https://abualiexpress.com/en/en28828/", "date": "2024-06-13 06:10", "source": "Telegram"}], "location": "GAZA STRIP", "total_score": 0.3280952380952381, "count": 1, "average_score": 0.3280952380952381, "final_score": 0.25966666666666666}}