{"c4d27cf0-b398-4b3d-94ca-9b3e74dcdb54": {"messages": [{"id": "c4d27cf0-b398-4b3d-94ca-9b3e74dcdb54", "message": "The Palestinian militant group Islamic Jihad fired a barrage of rockets into Israel on Monday as fighting raged in Gaza and Israeli tanks advanced deeper in parts of the enclave, residents and officials said.\nadvertisementThe volley of about 20 rockets caused no casualties, the Israeli military said.\nThe Israeli military said in a statement earlier on Monday the rockets were fired from the Khan Younis area.\nThe Israeli military announced the death of a soldier in southern Gaza without providing details.\nIsraeli authorities released 54 Palestinians it had detained during the war, Palestinian border officials said.", "url": "https://www.indiatoday.in/world/story/palestinian-group-islamic-jihad-fires-rockets-into-israel-no-casualties-reported-2560990-2024-07-02", "date": "2024-07-02 03:45", "source": "GDELT"}, {"id": "908c192a-58da-482d-bbf1-bb8b5ef3d542", "message": "The volley of about 20 rockets caused no casualties, the Israeli military said.\nThe Israeli military said in a statement earlier on Monday the rockets were fired from the Khan Younis area.\nIsraeli tanks deepened incursions into the Shejaia suburb of eastern Gaza City for a fifth day, and tanks advanced further in western and central Rafah, in southern Gaza near the border with Egypt, residents said.\nThe Israeli military announced the death of a soldier in southern Gaza without providing details.\nIsrael says 317 of its soldiers have been killed in Gaza and that at least a third of the Palestinian dead are fighters.", "url": "https://www.asiaone.com/world/palestinian-militants-fire-rockets-israel-tanks-advance-gaza", "date": "2024-07-02 04:15", "source": "GDELT"}, {"id": "bea8499d-bc96-4cea-b79b-650ab1bb71a9", "message": "The volley of about 20 rockets caused no casualties, the Israeli military said.\nThe Israeli military said in a statement earlier on Monday the rockets were fired from the Khan Younis area.\nIn some parts of Gaza, fighters continue to stage attacks on Israeli forces in areas that the army had left months ago.\nThe Israeli military announced the death of a soldier in southern Gaza without providing details.\nIsrael says 317 of its soldiers have been killed in Gaza and that at least a third of the Palestinian dead are fighters.", "url": "https://www.tbsnews.net/hamas-israel-war/palestinian-militants-fire-rockets-israel-tanks-advance-gaza-889516", "date": "2024-07-02 03:45", "source": "GDELT"}], "location": "GAZA", "total_score": 1.119499914661205, "count": 2, "average_score": 0.5597499573306025, "final_score": 0.6018249701314218}, "d6271bac-441e-4232-aa9d-bcb05904e72e": {"messages": [{"id": "d6271bac-441e-4232-aa9d-bcb05904e72e", "message": "Beirut, July 2 : A Hezbollah member was killed in an Israeli airstrike in the village of Aitaroun in southern Lebanon, said Lebanese military sources.\nAn Israeli warplane fired two air-to-surface missiles at a house in the center of Aitaroun, killing a Hezbollah member on Monday, Lebanese military sources told Xinhua.\nThe military sources added that Israel launched seven airstrikes on five towns and villages and fired 45 shells on ten border towns and villages in southern Lebanon during the day.\nFor its part, Hezbollah announced that it attacked several Israeli sites, including Al-Samaqa, Dovev, and Ramot Naftali.\nSince the start of the confrontations with Israeli forces on the border, 357 members of the Lebanese armed group have been killed, according to Lebanese security and medical reports.", "url": "https://www.prokerala.com/news/articles/a1544004.html", "date": "2024-07-02 10:30", "source": "GDELT"}, {"id": "f109037e-bea8-40ab-9c3a-edea63a4d362", "message": "BEIRUT, July 3 (Xinhua) -- A Hezbollah military leader was killed on Wednesday in an Israeli airstrike that targeted a civilian car in the Al-Hosh area, east of Lebanon's southwestern city Tyre, Lebanese military sources told Xinhua.\nThe sources said that the driver was identified as a commander of a military unit in Hezbollah whose nickname was Hajj Abu Ni'mah.\nHe came from the village of Haddatha in southern Lebanon and worked at the borderline in the western and central sectors of the southern border area.\nThe military sources said that Israel also launched three airstrikes on villages and towns in southern Lebanon and fired about 30 shells at five border villages and towns.\nThe level of tension between Hezbollah and the Israeli army has escalated recently, as the Israeli military announced \"its approval of operational plans for an attack on Lebanon.\"", "url": "https://english.news.cn/20240703/28e7d1ebdcbc4d82a275e6a82408fa0a/c.html", "date": "2024-07-03 14:30", "source": "GDELT"}], "location": "Aitaroun, southern Lebanon", "total_score": 0.6850134813820408, "count": 1, "average_score": 0.6850134813820408, "final_score": 0.6595094369674285}, "b72a59ba-a20c-45b0-88b0-32253dae2307": {"messages": [{"id": "b72a59ba-a20c-45b0-88b0-32253dae2307", "message": "The overnight strike came after Israel ordered the evacuation of parts of the city on Monday ahead of a likely ground operation.\nThe strike hit a home near the European Hospital, which is inside the zone that Israel said should be evacuated.\nAfter the initial evacuation orders, the military said the facility itself was not included, but its director says most patients and medics have already been relocated.\nAbout 250,000 people live in the latest mass-evacuation zone ordered by Israel, UNRWA official says.\nThe camp has been a frequent target of the Israeli military and is known as a militant stronghold.", "url": "https://www.swindonadvertiser.co.uk/news/national/24424350.strike-kills-nine-khan-younis-hours-israel-ordered-mass-evacuation/", "date": "2024-07-02 22:45", "source": "GDELT"}, {"id": "fe0dfe1a-84c0-4bb9-a818-5d9785fd9f7f", "message": "Palestinian health officials say an Israeli strike has killed at least nine people in the southern Gaza city of Khan Younis.\nThe overnight strike came after Israel ordered the evacuation of parts of the city on Monday ahead of a likely ground operation.\nPalestinians displaced by the Israeli air and ground offensive on the Gaza Strip flee from parts of Khan Younis following an evacuation order by the Israeli army (Jehad Alshrafi/AP)Associated Press reporters at the hospital counted the bodies.\nAdvertisementThe strike hit a home near the European Hospital, which is inside the zone that Israel said should be evacuated.\nThe camp has been a frequent target of the Israeli military and is known as a militant stronghold.", "url": "https://www.breakingnews.ie/israel-hamas/strike-kills-nine-in-khan-younis-hours-after-israel-ordered-mass-evacuation-1644887.html", "date": "2024-07-02 12:15", "source": "GDELT"}], "location": "GAZA CITY.", "total_score": 0.5580754343160096, "count": 1, "average_score": 0.5580754343160096, "final_score": 0.5706528040212067}, "794b6bfa-25fa-4328-9e74-dcabd85cdea9": {"messages": [{"id": "794b6bfa-25fa-4328-9e74-dcabd85cdea9", "message": "Palestinians fled parts of southern Gaza in droves on Tuesday as Israeli forces launched deadly strikes and clashed with militants after issuing an evacuation order.\nThe latest evacuation order has renewed fears among Palestinians, many of whom have been displaced multiple times by the Israel-Hamas war that started in October, with thousands fleeing.\nThe Israeli evacuation order sparked \"fear and extreme anxiety\", said Ahmad al-Najjar, a 26-year-old resident of Bani Suhaila.\n- 'Maelstrom of misery' -Six consecutive days of intense battles followed a similar evacuation order issued last week for the Gaza City district of Shujaiya.\nThe Israeli army said it identified \"approximately 15 projectiles... crossing from Lebanon, and 10 were successfully intercepted\" without causing casualties.", "url": "https://www.guampdn.com/news/national/thousands-of-palestinians-flee-as-israel-pounds-gaza/article_f4238fbe-ddec-584c-b196-06ce47cc645c.html", "date": "2024-07-02 22:15", "source": "GDELT"}, {"id": "e557f2f1-0c20-465d-a0a1-433064978b2e", "message": "Israel pounds Gaza after evacuation orderIsraeli forces launched deadly strikes on southern Gaza, impacting 250,000 Palestinians, says UN.\nALSO READ: Gaza hospital chief says tortured in Israel detentionSome displaced people with nowhere to go were sleeping on the streets, witnesses said.\nAhmad Najjar, a resident of the town of Bani Suhaila, said the Israeli evacuation order had caused “a large displacement of residents” and spurred “fear and extreme anxiety”.\nSix consecutive days of intense battles followed a similar evacuation order issued last week for the Gaza City district of Shujaiya.\nIsrael has accused Hamas of using Al-Shifa and other hospitals as a cover for military operations, claims Gaza militants have rejected.", "url": "https://www.citizen.co.za/news/news-world/israel-pounds-gaza-after-evacuation-order/", "date": "2024-07-03 01:45", "source": "GDELT"}], "location": "Gaza", "total_score": 0.6388584174345473, "count": 1, "average_score": 0.6388584174345473, "final_score": 0.6272008922041831}, "eb066117-d3c8-45b7-a995-5bb28b13df8d": {"messages": [{"id": "eb066117-d3c8-45b7-a995-5bb28b13df8d", "message": "Home WorldDay 270 of genocide: Israeli forces kill Palestinians in several Gaza areasAmmon News - A number of Palestinians were killed and others were injured at dawn on Tuesday in missile and artillery shelling and gunfire launched by the Israeli occupation army on several areas in the Gaza Strip.\nEight citizens were killed and more than 30 others were injured as a result of Israeli missile and artillery shelling that targeted various areas of the cities of Khan Yunis and Rafah.\nHe pointed out that citizens were able to extinguish a fire that broke out in a residential apartment in Al-Zaharna Building on Al-Jalaa Street in Gaza City, after it was targeted by an Israeli bombing.\nThe Israeli artillery also targeted the eastern areas of Al-Shuja’iya and Al-Zaytoun neighborhoods in Gaza City, and the eastern areas of the city of Rafah.\nThe Palestinian Red Crescent Society reported that Al-Amal Hospital in the city of Khan Yunis is crowded with large numbers of injured people after the occupation notified citizens to evacuate the eastern areas of the city.", "url": "https://en.ammonnews.net/article/73547", "date": "2024-07-02 11:00", "source": "GDELT"}, {"id": "5779b85c-ba59-41bb-b9ab-993f321c5986", "message": "Home WorldDay 271 of Genocide: Palestinian civilians killed, injured, in Israeli bombardment of GazaAmmon News - A number of Palestinian were killed and injured at dawn on Wednesday in missile and artillery shelling and gunfire by Israeli occupation vehicles on various areas of the Gaza Strip.\nThe city's Shuja'iya neighborhood saw violent explosions, artillery shelling, and gunfire from military vehicles, Quadcopter drones, and an Apache helicopter.\nTal al-Hawa neighborhood, southwest of Gaza City, saw artillery shelling and shooting by Israeli occupation army vehicles on citizens’ homes.\nAn Israeli warplane also targeted with a single missile Al-Ghafri printing press on Jaffa Street in Al-Tuffah neighborhood, east of Gaza City.\nIsraeli artillery shelling targeted several areas in Nuseirat camp, the city of Al-Zahra, and Al-Mughraqa area in the central Gaza Strip, coinciding with heavy gunfire.", "url": "https://en.ammonnews.net/article/73571", "date": "2024-07-03 09:00", "source": "GDELT"}], "location": "GAZA CITY", "total_score": 0.6442503015298673, "count": 1, "average_score": 0.6442503015298673, "final_score": 0.630975211070907}, "0783a5b2-2396-462a-b17c-f763421b857d": {"messages": [{"id": "0783a5b2-2396-462a-b17c-f763421b857d", "message": "Starokostiantyniv, a small city in western Ukraine, has faced an influx of Russian strikes due to the anticipated arrival of F-16 fighter aircraft.\nFrequent attacks, including drone and hypersonic missile strikes, have become a grim reality for Starokostiantyniv's 30,000 residents.\nExplosions reverberated across the pre-dawn sky as Ukrainian air defenses fended off a Russian attack on this small city in western Ukraine, home to an important air base and a frequent target of Moscow's strikes.\nThe air base has come under frequent attack since the first days of Russia's February 2022 invasion, including from drones and hypersonic missiles.\nA Ukrainian air force spokesman said the strikes presented \"certain difficulties\", but would not undermine the delivery of F-16s or their use in battle.", "url": "https://www.foxnews.com/world/russian-drone-hypersonic-missile-strikes-escalate-ukrainian-air-base-ahead-arrival-f-16s", "date": "2024-07-02 13:15", "source": "GDELT"}, {"id": "52481bcb-4982-41ed-962e-b29631f7154a", "message": "By Dan PeleschukSTAROKOSTIANTYNIV, Ukraine (Reuters) -Explosions reverberated across the pre-dawn sky as Ukrainian air defences fended off a Russian attack on this small city in western Ukraine, home to an important air base and a frequent target of Moscow's strikes.\nThe air base has come under frequent attack since the first days of Russia's February 2022 invasion, including from drones and hypersonic missiles.\nA Ukrainian air force spokesman said the strikes presented \"certain difficulties\", but would not undermine the delivery of F-16s or their use in battle.\nThe Ukrainian military, which is low on air-defence ammunition, is also likely to be forced to move the prized planes around airfields, said Justin Bronk, of the Royal United Services Institute.\nDEBRIS IN CHERRY TREESAfter last Thursday's attack, Governor Serhiy Tyurin said air defences had destroyed nine targets over his region.", "url": "https://uk.news.yahoo.com/ukrainian-air-under-fire-russia-050143712.html", "date": "2024-07-02 05:45", "source": "GDELT"}], "location": "Starokostiantyniv, Ukraine", "total_score": 0.5944256120527307, "count": 1, "average_score": 0.5944256120527307, "final_score": 0.5960979284369115}, "6a0075b0-ff52-459b-b083-7e7606e3e236": {"messages": [{"id": "6a0075b0-ff52-459b-b083-7e7606e3e236", "message": "Explosions reverberated across the pre-dawn sky as Ukrainian air defences fended off a Russian attack on the small city of Starokostiantyniv in western Ukraine, home to an important air base and a frequent target of Moscow’s strikes.\nThe air base has come under frequent attack since the first days of Russia’s February 2022 invasion, including from drones and hypersonic missiles.\nA Ukrainian air force spokesman said the strikes presented “certain difficulties”, but would not undermine the delivery of F-16s or their use in battle.\nThe Ukrainian military, which is low on air-defence ammunition, is also likely to be forced to move the prized planes around airfields, said Justin Bronk, of the Royal United Services Institute.\nDebris in cherry treesAfter last Thursday’s attack, Governor Serhiy Tyurin said air defences had destroyed nine targets over his region.", "url": "https://www.euractiv.com/section/global-europe/news/ukrainian-air-base-under-fire-as-russia-aims-at-f-16-arrivals/", "date": "2024-07-02 06:30", "source": "GDELT"}, {"id": "8e341f91-0a92-4c11-b5d9-df42cde283ca", "message": "The air base has come under frequent attack since the first days of Russia’s February 2022 invasion, including from drones and hypersonic missiles.\nA Ukrainian air force spokesman said the strikes presented “certain difficulties”, but would not undermine the delivery of F-16s or their use in battle.\nSeparately on Tuesday, Russia’s defence ministry said it had destroyed five Ukrainian SU-27 fighter jets at Myrhorod airfield in Poltava region.\nMilitary analysts said the Russians were probably targeting air base infrastructure such as runways and storage facilities to make getting F-16s airborne more difficult, and, when they arrive, the Western jets themselves.\nAfter last Thursday’s attack, Governor Serhiy Tyurin said air defences had destroyed nine targets over his region.", "url": "https://www.theglobeandmail.com/world/article-ukrainian-air-base-under-frequent-fire-as-russia-targets-f-16-arrivals/", "date": "2024-07-02 11:15", "source": "GDELT"}], "location": "The main location where the main event takes place is Starokostiantyniv, Ukraine.", "total_score": 0.5842826374652931, "count": 1, "average_score": 0.5842826374652931, "final_score": 0.5889978462257052}, "f0622c76-3c85-4072-a252-7788d00ecae0": {"messages": [{"id": "f0622c76-3c85-4072-a252-7788d00ecae0", "message": "On Tuesday, cars loaded with personal belongings streamed out of eastern Khan Younis, though the number of those fleeing was not immediately known.\n\"Once we settle in a place and start to cope,'' the Israeli military “forces people to move again,” he said.\nThe Israeli military did not immediately respond to requests for comment on the strike.\nFlight from Khan YounisMonday’s evacuation order suggested Israel would launch a new ground assault into Khan Younis, though there was no immediate sign of troops moving in.\nOvernight, another Israeli strike in the evacuation zone killed at least nine people, including three children and two women, according to hospital records.", "url": "https://www.aol.com/family-killed-israel-evacuation-order-194026253.html", "date": "2024-07-02 21:00", "source": "GDELT"}, {"id": "08010520-15d2-4660-9a2f-cb0a74f250a0", "message": "DEIR AL-BALAH, Gaza Strip -- Cars loaded with personal belongings streamed Tuesday out of eastern Khan Younis, though the number of those fleeing was not immediately known.\n\"We left everything behind,\" said Munir Hamza, a father of three children who on Monday night fled his home in an eastern district of Khan Younis for the second time.\nISRAEL'S PLANSMonday's evacuation order suggested Israel would launch a new ground assault into Khan Younis, though there was no immediate sign of troops moving in.\nThe military said it launched retaliatory strikes after Palestinian militants fired a barrage of some 20 projectiles into Israel from Khan Younis on Monday.\nOn Tuesday, more families fleeing Khan Younis were trying to find space in the zone.", "url": "https://www.arkansasonline.com/news/2024/jul/03/khan-younis-evacuated-by-israel/", "date": "2024-07-03 12:30", "source": "GDELT"}], "location": "GAZA CITY", "total_score": 0.574103304408522, "count": 1, "average_score": 0.574103304408522, "final_score": 0.5818723130859654}, "38d8844d-b9ed-43c1-a06e-6542d6e1fbff": {"messages": [{"id": "38d8844d-b9ed-43c1-a06e-6542d6e1fbff", "message": "MOSCOW—Russia claimed on Tuesday it had destroyed five Ukrainian SU-27 fighter jets with Iskander-M missiles and damaged two more at the Myrhorod airfield in Ukraine’s central Poltava region.\nUkraine claimed there had been a strike at the airfield but that Russia was exaggerating the damage caused.\n“As a result of the Russian strike, five active SU-27 multi-purpose fighters were destroyed and two were damaged,” the ministry said.\nRussia is targeting Ukrainian airfields just as Kyiv prepares to receive the first U.S.–designed F-16s, which Moscow has vowed to destroy.\nUkrainian military bloggers reported that a Russian reconnaissance drone had been able to fly above the airfield to help conduct the strike.", "url": "https://www.theepochtimes.com/world/russia-says-it-destroys-5-ukrainian-su-27-jet-fighters-at-airfield-5678691", "date": "2024-07-02 11:15", "source": "GDELT"}, {"id": "11308fc1-734a-4e8c-b68a-759342282e6c", "message": "Russia said Tuesday it had destroyed five Ukrainian SU-27 fighter jets with Iskander-M missiles and damaged two more at the Myrhorod airfield in Ukraine's central Poltava region.\nUkraine said there had been a strike at the airfield but that Russia was exaggerating the damage caused.\n\"As a result of the Russian strike, five active SU-27 multi-purpose fighters were destroyed and two were damaged,\" the ministry said.\nUkrainian military bloggers reported that a Russian reconnaissance drone had been able to fly above the airfield to help conduct the strike.\n\"There is not enough means to destroy (reconnaissance) drones,\" Ihnat told Reuters on Tuesday when asked about such drones, which he said present a \"very serious threat.\"", "url": "https://www.newsmax.com/globaltalk/russia-war-ukraine/2024/07/02/id/1170921/", "date": "2024-07-02 22:45", "source": "GDELT"}], "location": "MYRHEVOGRAD - MYRHEVOGRAD OBLAST, UK", "total_score": 0.3576221148684917, "count": 1, "average_score": 0.3576221148684917, "final_score": 0.4303354804079442}, "d37c9897-3ba7-4e95-aae9-c447777fa9c1": {"messages": [{"id": "d37c9897-3ba7-4e95-aae9-c447777fa9c1", "message": "Lebanese soldiers shot and arrested the gunman in early June, later identified as Kaiss Farraj from Syria, after a shootout that lasted almost 30 minutes and injured an embassy security guard.\nThe so-called Islamic State group has not claimed responsibility for the attack, nor has any other group.\nFollowing that attack, the embassy was moved from central Beirut to the Christian suburb of Aukar, north of the capital.\nIn September 2023, Lebanese security forces detained a Lebanese man who opened fire outside the US Embassy.\nIn October 2023, hundreds of protesters clashed with Lebanese security forces in demonstrations near the US Embassy in support of Gaza’s people and the militant group Hamas in its war with Israel.", "url": "https://www.bournemouthecho.co.uk/news/national/24426458.lebanon-charges-us-embassy-gunman-affiliation-islamic-state/", "date": "2024-07-02 20:15", "source": "GDELT"}, {"id": "8cfd16eb-d828-4866-886e-080bf004366e", "message": "A judge at Lebanon’s military court on Tuesday charged the gunman who opened fire at the US embassy near Beirut with being affiliated to the militant Islamic State group, security and judicial officials said.\nThe so-called Islamic State group has not claimed responsibility for the attack, nor has any other group.\nUS officials blame the attack on the Lebanese militant group Hezbollah.\nFollowing that attack, the embassy was moved from central Beirut to the Christian suburb of Aukar, north of the capital.\nIn September 2023, Lebanese security forces detained a Lebanese man who opened fire outside the US Embassy.", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/07/02/lebanon-charges-us-embassy-gunman-with-affiliation-to-islamic-state/", "date": "2024-07-02 23:30", "source": "GDELT"}], "location": "BEIRUT", "total_score": 0.5652230338536839, "count": 1, "average_score": 0.5652230338536839, "final_score": 0.5756561236975787}, "cfe04280-b739-4828-8d13-ad7e20fbf88a": {"messages": [{"id": "cfe04280-b739-4828-8d13-ad7e20fbf88a", "message": "Most Read from BloombergThe Israel Defense Forces warned people in eastern neighborhoods of the second-biggest city in Gaza to evacuate.\nIsraeli ground forces began fighting in Khan Younis late last year and by February said they’d mostly defeated Hamas’ units.\n“Where shall we go?” said Ahmed Al-Shami, who’s in Khan Younis.\nIsrael and Hezbollah have traded fire almost daily since Hamas’ attack on southern Israeli communities on Oct. 7, which triggered the war in Gaza.\nAlmost 38,000 Palestinians have been killed in Gaza since Israel began an air and ground offensive, according to the Hamas-run health ministry.", "url": "https://finance.yahoo.com/news/israel-tells-palestinians-leave-khan-073738100.html", "date": "2024-07-02 08:45", "source": "GDELT"}, {"id": "a0652c24-9bad-4317-8ebc-8706b9508863", "message": "Internally displaced Palestinians leave with their belongings following an evacuation order issued by the Israeli army, Khan Younis, southern Gaza Strip, on 2 July 2024.\nIsraeli ground forces began fighting in Khan Younis late last year and by February said they’d mostly defeated Hamas’ units.\nMuch of Khan Younis has been reduced to rubble but some residents moved back in the past two months, and Israel’s evacuation order was met with anger.\n“Where shall we go?” said Ahmed Al-Shami, who is in Khan Younis.\nMany Palestinians were gathering near the Nasser Hospital in the west of Khan Younis.", "url": "https://www.dailymaverick.co.za/article/2024-07-03-israel-orders-palestinians-to-evacuate-gazas-khan-younis-military-leaders-want-ceasefire-new-york-times/", "date": "2024-07-03 03:00", "source": "GDELT"}], "location": "GAZA", "total_score": 0.6657467532467533, "count": 1, "average_score": 0.6657467532467533, "final_score": 0.6460227272727272}, "b5154f5d-0ce5-4b3e-b685-efdfdcc83000": {"messages": [{"id": "b5154f5d-0ce5-4b3e-b685-efdfdcc83000", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nRussian forces have made minor advances across a relatively broad front towards the villages of Niu-York, Pivnichne, and Pivdenne.\nIn the Kharkiv direction Russian occupiers 11 times forced to storm the defense borders in the area of deep, liptiv and vovchansk.\nIn the Kurakhiv direction, Russian forces tried to advance seven times in the settlements of Krasnogorivka, Georgiyivka and Paraskoviyvka, but unsuccessfully.", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-07-01.htm", "date": "2024-07-02 03:00", "source": "GDELT"}, {"id": "70348e49-b0e2-4b36-9915-8fdec9499e27", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn addition, Russian forces committed 41 air strikes - in particular, dropped 58 cabív.\nThe count down is onTen times Russian forces attacked Ukrainian positions in the Kupyan direction.\nIn addition, attacked Ukrainian positions in the areas of nevs Оkogo and makíí̈vka.", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-07-02.htm", "date": "2024-07-03 02:45", "source": "GDELT"}], "location": "NULL", "total_score": 0.43287060976094827, "count": 1, "average_score": 0.43287060976094827, "final_score": 0.4830094268326638}, "0d697afa-877b-4ae7-a92c-73311eaaefce": {"messages": [{"id": "0d697afa-877b-4ae7-a92c-73311eaaefce", "message": "North Korea is believed to be sending thousands of tunnelling troops to Russia to open a new 'underground front' on the border with Ukraine as part of a deal with Vladimir Putin.\n'Judging by various sources, approximately five engineering brigades of the North Korean army may arrive in Donbas,' he said.\nIn eastern Ukraine 'underground tactics can be used for a 'creeping offensive' and breaking through complex, layered defences, and to minimise losses from drone and artillery strikes', he said.\nIn Avdiivka, Russian commander Anton 'Zima' Morozov, 28, led troops on all fours down a one and a quarter mile concrete pipe - which the Russians had spent months clearing.\nHe was shot 11 times in an apparent Ukrainian operation.", "url": "https://www.dailymail.co.uk/news/article-13591645/Putin-deploy-thousands-North-Korean-soldiers-dig-tunnels-lines-attack-Ukraine.html", "date": "2024-07-02 11:00", "source": "GDELT"}, {"id": "428ba0d4-ad7b-4eb6-944e-65ad3ac50cd9", "message": "“According to various sources, around five engineering brigades of the North Korean army could reach Donbass,” he said.\nHe warned: “Who can dig better than Koreans?”Pyongyang has “developed its own theory of underground warfare” based on its operations in the Korean War.\nKorea’s underground warfare techniques are said to have been developed amid paranoia over a Western nuclear attack.\nIn eastern Ukraine, “underground tactics can be used for a ‘creeping offensive’ and to break through complex and layered defenses, and to minimize losses caused by drone and artillery attacks,” he said.\nIn Avdiivka, Russian commander Anton “Zima” Morozov, 28, led his troops on all fours through a mile-long concrete pipe that the Russians had spent months clearing.", "url": "https://whatsnew2day.com/putin-plans-to-deploy-thousands-of-north-korean-soldiers-to-dig-tunnels-under-the-front-lines-and-attack-ukraine-from-behind/", "date": "2024-07-02 13:30", "source": "GDELT"}], "location": "Donbas", "total_score": 0.5928381962864722, "count": 1, "average_score": 0.5928381962864722, "final_score": 0.5949867374005305}, "833316dc-634d-474c-ba72-eee42dd784cc": {"messages": [{"id": "833316dc-634d-474c-ba72-eee42dd784cc", "message": "A mum who used taekwondo moves to stop a thief stealing her motorbike said she felt \"let down\" by police.\nXristina, 31, wrestled the robber, claiming to be a 12-year-old boy, to the ground at Hatters Way retail park in Luton, but gave up and released him after 10 minutes.\nShe said a police car had passed the scene earlier and only returned after the thief had escaped.\nBedfordshire Police said it had carried out several lines of inquiry and an investigation was ongoing.", "url": "https://www.bbc.co.uk/news/articles/c4ngmj108lno", "date": "2024-07-02 11:00", "source": "GDELT"}, {"id": "886b99a5-d87b-4ea7-8260-d67e2258c4cd", "message": "A mum who used taekwondo moves to stop a thief stealing her motorbike said she felt \"let down\" by police.\nShe said a police car had passed the scene earlier and only returned after the thief had escaped.\n\"I felt like I was being attacked and I had to protect myself, and what's mine,\" she said.\nShe then put the thief into a headlock and wrestled him to the ground, with help from a member of the public.\nThe moment a thief took Xristina's motorbikeAlthough a \"supportive\" police officer arrived shortly afterwards, Xristina felt frustrated.", "url": "https://www.myjoyonline.com/biker-mum-who-stopped-thief-let-down-by-police/", "date": "2024-07-03 02:30", "source": "GDELT"}], "location": "Hatters Way retail park", "total_score": 0.604722807319205, "count": 1, "average_score": 0.604722807319205, "final_score": 0.6033059651234435}, "693313bd-cb07-48d8-9925-7d2eab5b8fa6": {"messages": [{"id": "693313bd-cb07-48d8-9925-7d2eab5b8fa6", "message": "The Israeli military said its forces had struck areas in Khan Younis from where around 20 rockets had been fired on Monday.\nProduction will jump fourfold to 20,000 cubic metres of drinking water per day from, the Israeli military said.\nThough that is far from enough to supply the population of Gaza, Israeli officials said it was significant.\nHamas and Islamic Jihad continue to stage attacks against Israeli forces operating inside Gaza and fire rockets into Israel.\nHamas says any deal must end the war and bring a full Israeli withdrawal from Gaza.", "url": "https://www.theglobeandmail.com/world/article-thousands-of-palestinians-flee-their-homes-as-israeli-forces-bomb/", "date": "2024-07-02 11:15", "source": "GDELT"}, {"id": "1bbb9656-7e30-4703-b59a-5aa7cecf1f38", "message": "Thousands flee their homes as Israeli forces bomb southern Gazareuters_tickers6 minutesBy Nidal al-Mughrabi and Mohammad SalemCAIRO/GAZA (Reuters) -Israeli forces bombarded several areas of the southern Gaza Strip on Tuesday and thousands of Palestinians fled their homes in what could be part of a final push of Israel’s intensive military operations in nine months of war.\nThe Israeli military said its forces had struck areas in Khan Younis from where around 20 rockets had been fired on Monday.\nProduction will jump fourfold to 20,000 cubic metres of drinking water per day from, the Israeli military said.\nThough that is far from enough to supply the population of Gaza, Israeli officials said it was significant.\nHamas and Islamic Jihad continue to stage attacks against Israeli forces operating inside Gaza and fire rockets into Israel.", "url": "https://www.swissinfo.ch/eng/thousands-flee-their-homes-as-israeli-forces-bomb-southern-gaza/82454061", "date": "2024-07-02 12:45", "source": "GDELT"}], "location": "GAZA", "total_score": 0.49099199288256234, "count": 1, "average_score": 0.49099199288256234, "final_score": 0.5236943950177937}, "18eecc59-b238-40b1-bec9-62cae1a1c20b": {"messages": [{"id": "18eecc59-b238-40b1-bec9-62cae1a1c20b", "message": "The bombardment followed a rocket attack on southern Israel, claimed by the militant group Islamic Jihad, which has been fighting alongside Hamas.\nAhmad Najjar, a resident of Bani Suhaila, described the Israeli order as causing “fear and extreme anxiety” and noted a large displacement of residents.\nSix consecutive days of intense battles followed a similar evacuation order issued last week for the Shujaiya district in Gaza City.\nIn Shujaiya, Palestinian militants were “eliminated,” and dozens of terrorist infrastructure sites, including tunnel shafts, were dismantled.\nIsrael has accused Hamas of using Al-Shifa and other hospitals for military operations, claims that Gaza militants have denied.", "url": "https://dailystar.com.lb/israel-intensifies-gaza-strikes-khan-younes-evacuation/", "date": "2024-07-02 22:45", "source": "GDELT"}, {"id": "d125945d-2c69-4159-a997-68db146ec7ac", "message": "The bombardment came after a rocket barrage at southern Israel claimed by the group Islamic Jihad, which has fought alongside Hamas.\nBani Suhaila resident Ahmad Najjar said the Israeli order has spurred \"fear and extreme anxiety\", and \"there is a large displacement of residents\".\nSix consecutive days of intense battles followed a similar evacuation order issued last week for the Gaza City district of Shujaiya.\nSpeaking after his release, Abu Salmiya said he had suffered \"severe torture\" during his detention.\nAccording to Abu Salmiya, Israel brought no charges against him during his seven-month detention.", "url": "https://www.ndtv.com/world-news/israel-hamas-war-8-killed-as-israel-attacks-gaza-khan-yunis-after-evacuation-order-6016520", "date": "2024-07-02 11:00", "source": "GDELT"}, {"id": "be751184-0691-494e-9f77-6ff52e74e387", "message": "The bombardment came after a rocket barrage at southern Israel claimed by the militant group Islamic Jihad, which has fought alongside Hamas.\nSix consecutive days of intense battles followed a similar evacuation order issued last week for the Gaza City district of Shujaiya.\nSpeaking after his release, Abu Salmiya said he had suffered \"severe torture\" during his detention.\n- 'Try peace' -Israel has accused Hamas of using Al-Shifa and other hospitals as a cover for military operations, claims Gaza militants have rejected.\nAccording to Abu Salmiya, Israel brought no charges against him during his seven-month detention.", "url": "https://naharnet.com/stories/en/306289-israel-pounds-gaza-after-ordering-khan-younes-evacuation", "date": "2024-07-02 10:00", "source": "GDELT"}], "location": "GAZA CITY", "total_score": 1.1596485743037466, "count": 2, "average_score": 0.5798242871518733, "final_score": 0.6158770010063113}, "9a3c4fbb-5843-4f5a-a2b5-11171bae0ed8": {"messages": [{"id": "9a3c4fbb-5843-4f5a-a2b5-11171bae0ed8", "message": "The Palestinian Authority's health ministry said an Israeli strike killed four Palestinians in the Nur Shams camp in the occupied West Bank.\nThe Ramallah-based health ministry said four people had been \"killed as a result of the occupation's bombing of Nur Shams camp\" near the northern West Bank town of Tulkarm.\nViolence in the West Bank, already elevated before the 7 October attack by Hamas that ignited Israel's offensive in Gaza, has spiked since then.\nAt least 556 Palestinians have been killed by Israeli soldiers and settlers in the West Bank since the conflict in Gaza began, according to a health ministry tally.\nIn the West Bank, at least 15 Israelis have been killed in Palestinian attacks over the same period, according to an AFP tally based on official Israeli figures.", "url": "https://www.rte.ie/news/world/2024/0703/1457847-four-killed-west-bank/", "date": "2024-07-03 04:15", "source": "GDELT"}, {"id": "a6ab0a9b-0adb-4b7f-bda8-609f45a21eb2", "message": "An Israeli air strike killed four people in the occupied West Bank, the Palestinian Authority said Wednesday, with the Israeli military saying they were a \"terrorist cell\" planting an explosive device.\nThe Palestinian Authority's health ministry said four people had been \"killed as a result of the occupation's bombing of Nur Shams camp\" near the northern West Bank town of Tulkarm.\nViolence in the West Bank, already elevated before the October 7 attack by Hamas that ignited Israel's offensive in Gaza, has spiked since then.\nIn April, a two-day Israeli raid left 14 people dead in Nur Shams, the Palestinian Red Crescent said at the time.\nAt least 15 Israelis have been killed in Palestinian attacks in the West Bank over the same period, according to an AFP tally based on official Israeli figures.", "url": "https://tribune.com.pk/story/2476166/israeli-strike-in-west-bank-kills-four-says-palestinian-authority", "date": "2024-07-03 09:00", "source": "GDELT"}], "location": "Nur Shams Camp, West Bank", "total_score": 0.3869920314159325, "count": 1, "average_score": 0.3869920314159325, "final_score": 0.4508944219911528}, "4e0c2c28-632e-4ef1-841a-f10b599d32af": {"messages": [{"id": "4e0c2c28-632e-4ef1-841a-f10b599d32af", "message": "The order also prompted a frantic flight from European General Hospital, Gaza’s second-largest hospital, located in the evacuation area.\nHours after ordering the evacuation, the Israeli military said the hospital was not included on that order.\nOn Tuesday, cars loaded with personal belongings streamed out of eastern Khan Younis, though the number of those fleeing was not immediately known.\nThe Israeli military did not immediately respond to requests for comment on the strike.\nFlight from Khan YounisMonday’s evacuation order suggested a new ground assault into Khan Younis could be coming though there was no immediate sign of one.", "url": "https://www.bostonherald.com/2024/07/02/strike-kills-family-as-israeli-evacuation-order-sparks-panicked-flight-from-southern-gaza-city/", "date": "2024-07-03 00:45", "source": "GDELT"}, {"id": "68961e1c-bf2d-41ab-8f26-0dce3cd958a4", "message": "The Hamdan family — around a dozen people from three generations — fled their home in the middle of the night after the Israeli military ordered an evacuation from the southern Gaza city of Khan Younis.\nPalestinians displaced by the Israeli air and ground offensive on the Gaza Strip flee from parts of Khan Younis (AP Photo/Saher Alghorra)The Israeli military did not immediately respond to requests for comment on the strike.\nThe order also prompted a frantic flight from European General Hospital, Gaza’s second-largest hospital, located in the evacuation area.\nHours after ordering the evacuation, the Israeli military said the hospital was not included in that order.\nBut the staff said they feared a repeat of previous Israeli raids on other Gaza hospitals.", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/07/03/strike-kills-family-as-israeli-military-orders-evacuation-of-southern-gaza-city/", "date": "2024-07-03 13:30", "source": "GDELT"}], "location": "GAZA", "total_score": 0.6514457732634338, "count": 1, "average_score": 0.6514457732634338, "final_score": 0.6360120412844036}, "a3ed61b4-c5ba-4989-8923-4e3e0d814e9b": {"messages": [{"id": "a3ed61b4-c5ba-4989-8923-4e3e0d814e9b", "message": "KYIV (Reuters) - One person was killed and another four wounded in Russian attacks in Ukraine's northeastern Kharkiv region on Wednesday, according to local authorities.\nKharkiv regional prosecutors said one person was killed and two wounded in an attack in the village of Borova that also damaged 10 homes, stores and an administrative building.\nRussia has repeatedly denied targeting civilians since launching a full-scale invasion of its neighbour in February 2022.\nRegional governor Oleh Syniehubov said in June that attacks near the village of Borova had intensified as Russian forces sought to strike logistics and probe weaknesses in the Ukrainian defences.\nRussia pressed its ground assault into the north of the Kharkiv region in May, opening a new front in the 28-month war.", "url": "https://www.thestar.com.my/news/world/2024/07/03/russian-attacks-on-kharkiv-region-kill-one-injure-four", "date": "2024-07-03 09:15", "source": "GDELT"}, {"id": "6203afce-cad4-4fd3-8811-a538279cd7d1", "message": "Thousands of civilians have been killed since Russia launched its full-scale invasion of Ukraine in February 2022.\n“This Russian terror can only be stopped by modern air defences and our long-ranged weapons,” Zelenkiy said.\nThe Ukrainian Air Force said the Russian forces targeted the Dnipropetrovsk region with seven missiles and five Shahed drones.\nIn Ukraine’s northeastern Kharkiv region on Wednesday, one person was killed and another four wounded in Russian attacks, according to local authorities.\nRegional governor Oleh Syniehubov said in June that attacks near the village of Borova had intensified as Russian forces sought to strike logistics and probe weaknesses in the Ukrainian defences.", "url": "https://www.theglobeandmail.com/world/article-russian-air-strike-kills-five-in-dnipro-ukraine-says/", "date": "2024-07-03 13:00", "source": "GDELT"}], "location": "Kharkiv", "total_score": 0.6114407719609583, "count": 1, "average_score": 0.6114407719609583, "final_score": 0.6080085403726708}, "57473588-da18-425e-94d5-8219087779eb": {"messages": [{"id": "57473588-da18-425e-94d5-8219087779eb", "message": "(Hezbollah Media Relations Office via AP)BEIRUT – An Israeli strike in southern Lebanon on Wednesday killed a senior Hezbollah commander as tensions between the two sides continue to boil, a Hezbollah official told The Associated Press.\nA Hezbollah official speaking anonymously in line with regulations, said he was head of the group's Aziz Unit, one of three regional divisions in southern Lebanon.\nThe Israeli military did not immediately comment on the attack.\nThe attacks have since gradually escalated, with Hezbollah introducing new weapons in their attacks and Israel striking deeper into Lebanon.\nIsraeli officials have threatened to launch a larger military operation should Hezbollah not stop its attacks.", "url": "https://www.local10.com/news/world/2024/07/03/israeli-strike-kills-another-senior-hezbollah-commander-as-diplomats-scramble-for-calm-in-lebanon/", "date": "2024-07-03 14:30", "source": "GDELT"}, {"id": "04820a24-e3e0-41ef-b217-089f4be278a0", "message": "BEIRUT — An Israeli strike in southern Lebanon on Wednesday killed a senior Hezbollah commander as tensions between the two sides continue to boil, a Hezbollah official told The Associated Press.\nA Hezbollah statement identified the killed commander as Mohammad Naameh Nasser, who went by the name “Abu Naameh,” his nom de guerre.\nA Hezbollah official speaking anonymously in line with regulations, said he was head of the group’s Aziz Unit, one of three regional divisions in southern Lebanon.\nThe Israeli military acknowledged the attack, saying that Nasser alongside Abdullah are “two of the most significant Hezbollah” militants in southern Lebanon.\nThe attacks have since gradually escalated, with Hezbollah introducing new weapons in their attacks and Israel striking deeper into Lebanon.", "url": "https://www.stltoday.com/news/nation-world/israeli-strike-kills-senior-hezbollah-commander-as-diplomats-scramble-for-calm-in-lebanon/article_11a449b0-395d-11ef-be38-3399d33b5893.html", "date": "2024-07-03 17:45", "source": "GDELT"}, {"id": "72b7fead-425e-40c1-a2da-6bd02cf124dd", "message": "BEIRUT — An Israeli strike in southern Lebanon on Wednesday killed a senior Hezbollah commander as tensions between the two sides continue to boil, a Hezbollah official told The Associated Press.\nA Hezbollah statement identified the killed commander as Mohammad Naameh Nasser, who went by the name ''Abu Naameh,'' his nom de guerre.\nA Hezbollah official speaking anonymously in line with regulations, said he was head of the group's Aziz Unit, one of three regional divisions in southern Lebanon.\nThe Israeli military acknowledged the attack, saying that Nasser alongside Abdullah are ''two of the most significant Hezbollah'' militants in southern Lebanon.\nThe attacks have since gradually escalated, with Hezbollah introducing new weapons in their attacks and Israel striking deeper into Lebanon.", "url": "https://www.startribune.com/israeli-strike-kills-another-senior-hezbollah-commander-as-diplomats-scramble-for-calm-in-lebanon/600378149/", "date": "2024-07-03 16:00", "source": "GDELT"}, {"id": "364b94d4-c427-409b-b3fa-99a52aea0473", "message": "(Hezbollah Media Relations Office via AP)BEIRUT – An Israeli strike in southern Lebanon on Wednesday killed a senior Hezbollah commander as tensions between the two sides continue to boil, a Hezbollah official told The Associated Press.\nA Hezbollah official speaking anonymously in line with regulations, said he was head of the group's Aziz Unit, one of three regional divisions in southern Lebanon.\nThe Israeli military acknowledged the attack, saying that Nasser alongside Abdullah are “two of the most significant Hezbollah” militants in southern Lebanon.\nHezbollah launched rockets on northern Israel a day after a Hamas surprise attack on southern Israel in October, leading to limited clashes along the tense border.\nThe attacks have since gradually escalated, with Hezbollah introducing new weapons in their attacks and Israel striking deeper into Lebanon.", "url": "https://www.clickondetroit.com/news/world/2024/07/03/israeli-strike-kills-another-senior-hezbollah-commander-as-diplomats-scramble-for-calm-in-lebanon/", "date": "2024-07-03 16:15", "source": "GDELT"}, {"id": "5e38f218-3308-4575-ab0d-46dcfaf56c1f", "message": "A Hezbollah statement identified the killed commander as Mohammad Naameh Nasser, who went by the name “Abu Naameh,” his nom de guerre.\nA Hezbollah official speaking anonymously in line with regulations, said he was head of the group’s Aziz Unit, one of three regional divisions in southern Lebanon.\nThe Israeli military acknowledged the attack, saying that Nasser alongside Abdullah are “two of the most significant Hezbollah” militants in southern Lebanon.\nHezbollah launched rockets on northern Israel a day after a Hamas surprise attack on southern Israel in October, leading to limited clashes along the tense border.\nThe attacks have since gradually escalated, with Hezbollah introducing new weapons in their attacks and Israel striking deeper into Lebanon.", "url": "https://www.theglobeandmail.com/world/article-israeli-strike-kills-another-senior-hezbollah-commander-as-diplomats/", "date": "2024-07-03 15:45", "source": "GDELT"}], "location": "SOUTHERN LEBANON", "total_score": 1.985792181070412, "count": 4, "average_score": 0.496448045267603, "final_score": 0.6175136316873221}, "a2cba1b2-7148-4ac2-a6c2-2597591999c5": {"messages": [{"id": "a2cba1b2-7148-4ac2-a6c2-2597591999c5", "message": "Russian missiles and drones strike eastern Ukraine's Dnipro in a daylight attack that kills 5KYIV, Ukraine (AP) — A Russian missile and drone attack on the eastern Ukrainian city of Dnipro on Wednesday killed five civilians and injured 47 others, including a 14-year-old girl, authorities said.\nBlasts blew out some windows of a shopping mall, raining shards onto the street, photos published by local officials showed.\nMayor Borys Filatov said the daytime attack also shattered windows in two schools and three kindergartens.\nIn the Kharkiv region in the northeast, Russian shelling struck a village council building, killing one person and injuring two others, regional head Oleh Suniehubov said.\nElsewhere in the region, a Russian glide bomb struck a residential building in the village of Ruska Lozova, injuring at least two people.", "url": "https://isp.netscape.com/news/world/story/0001/20240703/b919644e3d8572e5ac78a91dd22d8c46", "date": "2024-07-03 13:45", "source": "GDELT"}, {"id": "bf999589-11fc-448f-a202-63fad632054e", "message": "Blasts blew out some windows of a shopping mall, raining shards onto the street, photos published by local officials showed.\nMayor Borys Filatov said the daytime attack also shattered windows in two schools and three kindergartens.\nDebris struck the intensive care unit of a children’s hospital and a fire broke out in another hospital.\nIn the Kharkiv region in the north east, Russian shelling struck a village council building, killing one person and injuring two others, regional head Oleh Suniehubov said.\nAlso on Wednesday, Ukraine received 2.2 billion dollars (£1.7 billion) from the International Monetary Fund under an ongoing credit facility, Prime Minister Denys Shmyhal announced.", "url": "https://www.bournemouthecho.co.uk/news/national/24428107.russian-daylight-attack-eastern-ukraine-kills-five/", "date": "2024-07-03 14:30", "source": "GDELT"}, {"id": "15ff49c7-247c-4031-a4a4-2fd66e13ddb5", "message": "In this photo released by the Dnipro Regional Administration, people stand near shop windows damaged following Russia's missile attack in Dnipro, Ukraine, Wednesday, July 3, 2024.\n(Dnipro Regional Administration via AP)KYIV – A Russian missile and drone attack on the eastern Ukrainian city of Dnipro on Wednesday killed five civilians and injured 47 others, including a 14-year-old girl, authorities said.\nMayor Borys Filatov said the daytime attack also shattered windows in two schools and three kindergartens.\nIn the Kharkiv region in the northeast, Russian shelling struck a village council building, killing one person and injuring two others, regional head Oleh Suniehubov said.\nElsewhere in the region, a Russian glide bomb struck a residential building in the village of Ruska Lozova, injuring at least two people.", "url": "https://www.local10.com/news/world/2024/07/03/russian-missiles-and-drones-strike-eastern-ukraines-dnipro-in-a-daylight-attack-that-kills-5/", "date": "2024-07-03 14:30", "source": "GDELT"}], "location": "Dnipro", "total_score": 0.960092403870197, "count": 2, "average_score": 0.4800462019350985, "final_score": 0.5460323413545689}, "d263e002-e9b0-4f1f-8fa9-8271a80a172e": {"messages": [{"id": "d263e002-e9b0-4f1f-8fa9-8271a80a172e", "message": "KYIV, Ukraine — A Russian missile and drone attack on the eastern Ukrainian city of Dnipro on Wednesday killed five civilians and injured 47 others, including a 14-year-old girl, authorities said.\nBlasts blew out some windows of a shopping mall, raining shards onto the street, photos published by local officials showed.\nMayor Borys Filatov said the daytime attack also shattered windows in two schools and three kindergartens.\nIn the Kharkiv region in the northeast, Russian shelling struck a village council building, killing one person and injuring two others, regional head Oleh Suniehubov said.\nElsewhere in the region, a Russian glide bomb struck a residential building in the village of Ruska Lozova, injuring at least two people.", "url": "https://www.startribune.com/russian-missiles-and-drones-strike-eastern-ukraines-dnipro-in-a-daylight-attack-that-kills-5/600378139/", "date": "2024-07-03 14:30", "source": "GDELT"}, {"id": "2f404d89-e9e7-46a3-9fec-5fbd81e9f3f9", "message": "In this photo released by the Dnipro Regional Administration, people stand near shop windows damaged following Russia's missile attack in Dnipro, Ukraine, Wednesday, July 3, 2024.\n(Dnipro Regional Administration via AP)KYIV – A Russian missile and drone attack on the eastern Ukrainian city of Dnipro on Wednesday killed five civilians and injured 47 others, including a 14-year-old girl, authorities said.\nMayor Borys Filatov said the daytime attack also shattered windows in two schools and three kindergartens.\nIn the Kharkiv region in the northeast, Russian shelling struck a village council building, killing one person and injuring two others, regional head Oleh Suniehubov said.\nElsewhere in the region, a Russian glide bomb struck a residential building in the village of Ruska Lozova, injuring at least two people.", "url": "https://www.clickondetroit.com/news/world/2024/07/03/russian-missiles-and-drones-strike-eastern-ukraines-dnipro-in-a-daylight-attack-that-kills-5/", "date": "2024-07-03 16:15", "source": "GDELT"}], "location": "Dnipro", "total_score": 0.35183307495705374, "count": 1, "average_score": 0.35183307495705374, "final_score": 0.42628315246993764}, "9dbac683-563d-4f45-a5b7-ec5dd7dd3bfd": {"messages": [{"id": "9dbac683-563d-4f45-a5b7-ec5dd7dd3bfd", "message": "Lebanese sources: In the attack on the vehicle in the area of ​​Khush in the city of Tyre, Hajj Abu Nee'ma Naser, a senior commander of the Aziz unit in Hezbollah was killed.\n\nThe Aziz unit, together with the Nasser unit, is responsible for the entire southern Lebanese sector of Hezbollah.\n\nLess than a month ago, Taleb Abdullah 👆 commander of the Nasser unit in Hezbollah was killed.", "url": "https://abualiexpress.com/en/en29848/", "date": "2024-07-03 13:09", "source": "Telegram"}, {"id": "6f503a81-de7a-47f0-9c40-f234b38f7787", "message": "Lebanese channels: an Israeli aircraft attacked a vehicle in the Khush area of ​​the city of Tyre in southern Lebanon.\n\nHajj Abu Nee'ma was reportedly was killed in the attack. He is the commander of the Aziz unit in Hezbollah. His son was injured.\n\nA very impressive elimination by the IDF.\nHezbollah will have to respond...", "url": "", "date": "2024-07-03 13:07", "source": "Telegram"}], "location": "Tyre, Lebanon", "total_score": 0.6772385509227614, "count": 1, "average_score": 0.6772385509227614, "final_score": 0.654066985645933}, "39e98a5b-184f-4d6d-b587-360a85797d9b": {"messages": [{"id": "39e98a5b-184f-4d6d-b587-360a85797d9b", "message": "The IDF spokesperson announced the death of a soldier from the 188th Brigade in the stabbing attack in Karmiel.\n\nMay his memory be a blessing.", "url": "https://abualiexpress.com/en/en29873/", "date": "2024-07-03 16:35", "source": "Telegram"}, {"id": "9afe303d-7ce8-49b3-8dd5-7ba3b444616c", "message": "The IDF spokesperson announced the fall of a commander in a battle in the northern Gaza Strip.\n\nMay his memory be a blessing.", "url": "https://abualiexpress.com/en/en29880/", "date": "2024-07-03 20:20", "source": "Telegram"}], "location": "Karmiel", "total_score": 0.4225352112676056, "count": 1, "average_score": 0.4225352112676056, "final_score": 0.47577464788732393}}