{"59b42995-8b85-48f7-bb12-b9e842fd88eb": {"messages": [{"id": "59b42995-8b85-48f7-bb12-b9e842fd88eb", "message": "In the news today: Was the Toronto byelection swayed by views on antisemitism?\nAn organizer who encouraged Jewish residents to vote against the Liberals in this week's Toronto byelection suggests a rise in antisemitism motivated many to show up at the polls.\nThe close race ended with the Liberals suffering a stunning loss and the Tories' Don Stewart winning by nearly 600 votes.\nAngela Roberts, who's based at Western University in London, Ont., is the Canadian research lead on an international study looking to uncover what contributes to the long, healthy lives of people like Charlebois.\nIt took an unexpected call from Toronto superstar Drake to give the singer a boost of confidence and encouragement to give his career another shot.", "url": "https://infotel.ca/newsitem/in-the-news/cp1674845080", "date": "2024-06-26 09:15", "source": "GDELT"}, {"id": "9871dd35-7b18-4b3b-a7b1-d7ce6af0f66c", "message": "Here is a roundup of stories from The Canadian Press designed tobring you up to speed…Did views on antisemitism sway Toronto byelection?\nAn organizer who encouraged Jewish residents to vote against the Liberals in this week’s Toronto byelection suggests a rise in antisemitism motivated many to show up at the polls.\nAngela Roberts, who’s based at Western University in London, Ont., is the Canadian research lead on an international study looking to uncover what contributes to the long, healthy lives of people like Charlebois.\nIt took an unexpected call from Toronto superstar Drake to give the singer a boost of confidence and encouragement to give his career another shot.\n—This report by The Canadian Press was first published June 26, 2024", "url": "https://www.winnipegfreepress.com/canada/2024/06/26/in-the-news-today-was-the-toronto-byelection-swayed-by-views-on-antisemitism", "date": "2024-06-26 08:45", "source": "GDELT"}], "location": "TORONTO", "total_score": 0.3903645047316372, "count": 1, "average_score": 0.3903645047316372, "final_score": 0.45325515331214605}}