{"5dcb03a9-4ea2-484a-9d74-d522fc60e44b": {"messages": [{"id": "5dcb03a9-4ea2-484a-9d74-d522fc60e44b", "message": "Columbia University announced Monday it has permanently removed three deans from their posts after finding they engaged in “very troubling” text messages that touched on antisemitic tropes.\n“The incident revealed behavior and sentiments that were not only unprofessional, but also, disturbingly touched on ancient antisemitic tropes,” Shafik said in the Monday statement.\nHowever, Columbia signaled that a fourth official involved in the text messages, Josef Sorett, the dean of Columbia College, is staying in power after apologizing and taking responsibility.\nOn Monday Sorett sent a message to Columbia College students apologizing for his actions.\n“Jewish students deserve better than to have harassment and threats against them dismissed as ‘privilege,’ and Jewish faculty members deserve better than to be mocked by their colleagues,” Foxx said in the statement last week.", "url": "https://www.aol.com/columbia-removes-three-deans-power-162231891.html", "date": "2024-07-08 18:15", "source": "GDELT"}, {"id": "4b7f3c82-20f6-4e4f-b077-8258e8fede9c", "message": "Columbia University removed three deans from their positions after they were caught sending text messages that touched on “antisemitic tropes” during a campus event on Jewish life.\nThe three are on indefinite leave and will not return to their previous jobs, according to a Monday message to the campus community.\n“This incident revealed behavior and sentiments that were not only unprofessional, but also, disturbingly touched on ancient antisemitic tropes.\nColumbia College Dean Josef Sorett, who was also a part of the text exchange, will continue in his role at the college, according to the letter.\nAll republished articles must include our logo, our reporter’s byline and their DCNF affiliation.", "url": "https://dailycaller.com/2024/07/08/columbia-university-removes-deans-caught-sending-texts-antisemitic-tropes-campus-event-jewish-life/", "date": "2024-07-08 19:45", "source": "GDELT"}], "location": "Based on the provided text, I did not find a specific location for the event that took place the focus of the event described in the text.", "total_score": 0.6731891905348719, "count": 1, "average_score": 0.6731891905348719, "final_score": 0.6512324333744103}}