{
    "1d9e270a-8094-4d1d-9eb2-c1270b42b889": {
        "messages": [
            {
                "id": "1d9e270a-8094-4d1d-9eb2-c1270b42b889",
                "message": "Hezbollah launches rockets at Israel after deadly south Lebanon strikeBEIRUTA local official and state media in Lebanon said an Israeli strike on a southern village on Sunday killed several people from the same family, with Hezbollah announcing rocket fire in retaliation.\nIsrael and Lebanon's Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas's unprecedented October attack on southern Israel sparked the war in Gaza.\nFighting has intensified in recent weeks, with Israel striking deeper into Lebanese territory, while Hezbollah has stepped up its missile and drone attacks on military positions in northern Israel.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed \"four civilians\".\nHezbollah in a statement said it fired \"dozens of Katyusha and Falaq rockets\" at Kiryat Shmona in northern Israel \"in response to the horrific crime that the Israeli enemy committed in Mais al-Jabal\".",
                "url": "https://www.hurriyetdailynews.com/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike-193163",
                "date": "2024-05-05 15:30",
                "source": "GDELT"
            },
            {
                "id": "3c4fae58-f744-4238-aa4c-5785f29519da",
                "message": "BEIRUT (AFP): A local official and state media in Lebanon said an Israeli strike on a southern village on Sunday killed several people from the same family, with Hezbollah announcing rocket fire in retaliation.\nIsrael and Lebanon’s Iran-backed Hezbollah group have exchanged regular cross-border fire since Palestinian militant group Hamas’s unprecedented October attack on southern Israel sparked the war in Gaza.\nFighting has intensified in recent weeks, with Israel striking deeper into Lebanese territory, while Hezbollah has stepped up its missile and drone attacks on military positions in northern Israel.\nA Lebanese security source, requesting anonymity as they were not authorised to speak to the media, confirmed the strike killed “four civilians”.\nHezbollah in a statement said it fired “dozens of Katyusha and Falaq rockets” at Kiryat Shmona in northern Israel “in response to the horrific crime that the Israeli enemy committed in Mais al-Jabal”.",
                "url": "https://thefrontierpost.com/hezbollah-launches-rockets-at-israel-after-deadly-south-lebanon-strike/",
                "date": "2024-05-05 16:30",
                "source": "GDELT"
            }
        ],
        "location": "MAIS AL-JABAL",
        "total_score": 0.8713759516412996,
        "count": 1,
        "average_score": 0.8713759516412996,
        "final_score": 1.0
    },
    "ee801263-9765-456f-823d-f85c9a638dec": {
        "messages": [
            {
                "id": "ee801263-9765-456f-823d-f85c9a638dec",
                "message": "Jerusalem, May 5: The Israel Defense Forces (IDF) announced on Saturday that Aiman Zaarab, a senior commander of the Islamic Jihad Rafah Brigade, was killed in an airstrike on the southernmost Gazan city of Rafah.\nZaarab directed the Islamic Jihad’s elite forces during the Oct. 7 onslaught on Kibbutz Sufa and the Sufa military post bordering the Gaza Strip, said the IDF in a statement.\nZaarab had “commanded and directed” several attacks, and over the past few days, he led the Islamic Jihads’ preparations for a combat in the southern Gaza Strip against the Israeli military, according to the statement.\nAlong with Zaarab, two other Islamic Jihad operatives were killed during the strike, the IDF added.",
                "url": "https://www.dailyexcelsior.com/islamic-jihad-commander-killed-in-rafah-israeli-army/",
                "date": "2024-05-05 06:15",
                "source": "GDELT"
            },
            {
                "id": "bde69589-1554-4591-8c92-b2171cea0eee",
                "message": "The Israel Defense Forces (IDF) has announced that Aiman Zaarab, a senior commander of the Islamic Jihad Rafah Brigade, was killed in an airstrike on the southernmost Gazan city of Rafah.\nZaarab directed the Islamic Jihad’s elite forces during the October 7 onslaught on Kibbutz Sufa and the Sufa military post bordering the Gaza Strip, the IDF was quoted as saying on Saturday by Xinhua news agency.\nZaarab had “commanded and directed” several attacks, and over the past few days, he led the Islamic Jihads’ preparations for combat in the southern Gaza Strip against the Israeli military, according to the IDF statement.\nAdvertisementAlong with Zaarab, two other Islamic Jihad operatives were killed during the strike, the IDF added.",
                "url": "https://www.thestatesman.com/world/islamic-jihad-commander-killed-in-rafah-israeli-army-1503297279.html",
                "date": "2024-05-05 06:15",
                "source": "GDELT"
            }
        ],
        "location": "Rafah",
        "total_score": 0.8411742166212535,
        "count": 1,
        "average_score": 0.8411742166212535,
        "final_score": 0.9767669557400827
    }
}