{"8344b5f6-9bb9-4245-b204-50e31bd928ec": {"messages": [{"id": "8344b5f6-9bb9-4245-b204-50e31bd928ec", "message": "IDF: Following the sirens that sounded a short while ago in southern Israel, one projectile crossed from the southern Gaza Strip and fell in an open area.\n\n##\nOne for Haniyeh, for the record, hours after he was buried (perhaps half the rocket was for Mohammad Deif?)", "url": "https://abualiexpress.com/en/en31644/", "date": "2024-08-02 14:14", "source": "Telegram"}, {"id": "97c4bb9c-ab42-43ee-b090-c2f6db36ee5f", "message": "IDF: Following the sirens that sounded a short while ago in Sufa and Nir Yitzhak, ten launches were identified crossing from the southern Gaza Strip. Some of the launches were intercepted and the rest fell in open areas. No injuries were reported.", "url": "https://abualiexpress.com/en/en31648/", "date": "2024-08-02 16:46", "source": "Telegram"}], "location": "Gaza Strip", "total_score": 0.6162649270234409, "count": 1, "average_score": 0.6162649270234409, "final_score": 0.6113854489164087}, "78cdfda1-6225-4171-9905-90a727f6f894": {"messages": [{"id": "78cdfda1-6225-4171-9905-90a727f6f894", "message": "Meanwhile in Tehran, Iran's supreme leader prayed over the body of Hamas' political leader, who was killed in a presumed Israeli assassination.\nThis picture released by Hezbollah Military Media, shows Hezbollah leader Sayyed Hassan Nasrallah, right, with Fouad Shukur, a Hezbollah top commander who was killed by an Israeli airstrike.\n(AP)Iran has vowed retaliation against Israel for the strike that killed Hamas' Ismail Haniyeh on Wednesday in the Iranian capital of Tehran.\nIran's Supreme Leader prayed over the body of Hamas leader Ismail Haniyeh in Tehran.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad militant group and Hezbollah, and Iranian media showed him and Pezeshkian hugging.", "url": "https://www.9news.com.au/world/israel-hezbollah-war-enters-new-stage-says-militants-leader/9fadef83-e75f-445b-8932-f90f996d8f8f", "date": "2024-08-01 23:30", "source": "GDELT"}, {"id": "14dc9f78-7e38-4dc0-aba0-15075ddcd459", "message": "Meanwhile in Tehran, Iran’s supreme leader prayed over the body of Hamas’ political leader, who was killed in a presumed Israeli assassination.\nIran has vowed retaliation against Israel for the strike that killed Hamas’ Ismail Haniyeh on Wednesday in the Iranian capital of Tehran.\nIsrael and Iran risked plunging into war earlier this year when Israel hit Iran’s embassy in Damascus in April.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad militant group and Hezbollah, and Iranian media showed him and Pezeshkian hugging.\nBlinken did not mention Israel, Iran or Hamas by name in his comments.", "url": "https://wsvn.com/news/us-world/hezbollah-leader-says-war-with-israel-has-entered-new-phase-after-killings-of-top-militant-figures/", "date": "2024-08-01 22:15", "source": "GDELT"}, {"id": "d555df14-a502-4295-9c6a-a2102c65786f", "message": "Meanwhile in Tehran, Iran’s supreme leader prayed over the body of Hamas’ political leader, who was killed in a presumed Israeli assassination.\nIran has vowed retaliation against Israel for the strike that killed Hamas’ Ismail Haniyeh on Wednesday in the Iranian capital of Tehran.\nIsrael did confirm it carried out the strike Tuesday in Beirut that killed Hezbollah commander Fouad Shukur, along with an Iranian military adviser and at least five civilians.\nHezbollah denied being behind that strike, a denial that Hezbollah leader Hassan Nasrallah reiterated.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad terrorist group and Hezbollah, and Iranian media showed him and Pezeshkian hugging.", "url": "https://www.reviewjournal.com/news/nation-and-world/hezbollah-leader-says-war-with-israel-has-entered-new-phase-after-killings-of-top-militant-figures-3106243/", "date": "2024-08-02 00:15", "source": "GDELT"}, {"id": "db80b04c-0bad-4ae4-b9f6-f5d5e70d2d71", "message": "The remarks came as prayers were held by Iran’s Supreme Leader Ayatollah Ali Khamenei and representatives of Palestinian militia groups for Hamas leader Ismail Haniyeh and his bodyguard.\nAnd the Israeli military said Thursday it confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\n4 killed in Israeli strike on Lebanese village, officials sayBEIRUT — Lebanon’s Health Ministry says an Israeli airstrike on a southern village has killed four people and wounded five.\nMore than 90 other people, including displaced civilians in nearby tents, were killed in the strike, Gaza health officials said at the time.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad militant group and Hezbollah, and Iranian media showed him and Pezeshkian hugging.", "url": "https://www.newsday.com/news/nation/israel-hamas-war-latest-1-august-2024-t39005", "date": "2024-08-02 07:00", "source": "GDELT"}, {"id": "a76d551f-dee6-4782-86bf-050acbfcad6c", "message": "Hezbollah’s leader warned the conflict with Israel has entered a “new phase,” as he addressed mourners at the funeral of a commander from the group who was killed by an Israeli airstrike.\nMeanwhile in Tehran, Iran’s supreme leader prayed over the body of Hamas’ political leader, who was killed in a presumed Israeli assassination.\nIran has vowed retaliation against Israel for the strike that killed Hamas’ Ismail Haniyeh on Wednesday in the Iranian capital of Tehran.\nIsrael did confirm it carried out the strike Tuesday in Beirut that killed Hezbollah commander Fouad Shukur, along with an Iranian military adviser and at least five civilians.\nHezbollah denied being behind that strike, a denial that Hezbollah leader Hassan Nasrallah reiterated.", "url": "https://www.reviewjournal.com/news/nation-and-world/hezbollah-leader-says-war-with-israel-has-entered-new-phase-after-killings-of-top-figures-3106243/", "date": "2024-08-02 19:30", "source": "GDELT"}], "location": "Tehran", "total_score": 2.184948265710904, "count": 4, "average_score": 0.546237066427726, "final_score": 0.6523659464994082}, "61f5f7f2-b064-472f-80be-f973ef390698": {"messages": [{"id": "61f5f7f2-b064-472f-80be-f973ef390698", "message": "Iran's supreme leader Ayatollah Ali Khamenei prayed over Haniyeh’s coffin at Tehran University while Iran’s new President Masoud Pezeshkian stood next to himIran's supreme leader prayed over the coffin of Hamas leader Ismail Haniyeh after his assassination raised fears of an all-out war.\nAyatollah Ali Khamenei was pictured next to Haniyeh’s coffin and his bodyguard at Tehran University while Iran’s new President Masoud Pezeshkian stood next to him.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad militant group and Hezbollah, and Iranian media showed him and Pezeshkian hugging.\nIran supports Hamas, as well as Hezbollah and other Palestinian militant groups fighting Israel in Gaza.\nImage: Getty Images) Getty Images)Bitter regional rivals, Israel and Iran risked plunging into war earlier this year when Israel hit Iran’s embassy in Damascus in April.", "url": "https://www.mirror.co.uk/news/world-news/irans-supreme-leader-prays-over-33372824", "date": "2024-08-01 13:15", "source": "GDELT"}, {"id": "f7b9f6e6-bb4a-4c26-864a-4b4247ae0c67", "message": "Meanwhile in Tehran, Iran’s supreme leader prayed over the body of Hamas’ political leader, who was killed in a presumed Israeli assassination.\nIran has vowed retaliation against Israel for the strike that killed Hamas’ Ismail Haniyeh on Wednesday in the Iranian capital of Tehran.\nIsrael and Iran risked plunging into war earlier this year when Israel hit Iran’s embassy in Damascus in April.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad militant group and Hezbollah, and Iranian media showed him and Pezeshkian hugging.\nBlinken did not mention Israel, Iran or Hamas by name in his comments.", "url": "https://www.coastreporter.net/world-news/hezbollah-leader-says-war-with-israel-has-entered-new-phase-after-killings-of-top-militant-figures-9297502", "date": "2024-08-01 21:00", "source": "GDELT"}], "location": "Tehran University", "total_score": 0.6243176421629826, "count": 1, "average_score": 0.6243176421629826, "final_score": 0.6170223495140879}, "dc481250-e811-481d-9915-41e3eb70a234": {"messages": [{"id": "dc481250-e811-481d-9915-41e3eb70a234", "message": "Dubai: Amid speculation about how Israel managed to target Hamas leader Ismail Haniyeh in Tehran, the New York Times (NYT) reported that he was killed by a bomb smuggled into the guesthouse where he was staying a few months earlier.\nIt shook the building, shattered windows, and partially collapsed an exterior wall.\nThe report noted that the bomb had been hidden in the guesthouse approximately two months ago, quoting five Middle Eastern officials.\nThe bomb was detonated remotely once it was confirmed that Haniyeh was inside his room at the guesthouse.\nHaniyeh, who had led Hamas’s political office in Qatar, had stayed at the guesthouse several times when visiting Tehran, according to the Middle Eastern officials.", "url": "https://gulfnews.com/world/mena/was-hamas-chief-haniyeh-killed-by-bomb-smuggled-into-guest-house-1.103694697", "date": "2024-08-01 17:45", "source": "GDELT"}, {"id": "6f358c9b-34b7-43aa-8a3f-9428e78bc8d3", "message": "As Katie wrote on Tuesday, a top Hamas leader is now sleeping with the fishes.\nIsmail Haniyah, who was the terror group’s political director, was taken out in an attack that some speculated was a missile or drone strike.\nThe bomb had been hidden approximately two months ago in the guesthouse, according to five of the Middle Eastern officials.\nMr. Haniyeh, who had led Hamas’s political office in Qatar, had stayed at the guesthouse several times when visiting Tehran, according to the Middle Eastern officials.\nAll of the officials spoke on the condition of anonymity to share sensitive details about the assassination.", "url": "https://townhall.com/tipsheet/mattvespa/2024/08/01/how-israel-was-able-to-kill-one-of-hamas-top-leaders-inside-one-of-irans-most-heavily-guarded-buildings-n2642848", "date": "2024-08-01 20:45", "source": "GDELT"}], "location": "Tehran, Iran", "total_score": 0.6556202553485162, "count": 1, "average_score": 0.6556202553485162, "final_score": 0.6389341787439613}, "7f16fcf6-d468-4855-8dcf-821190ccedf0": {"messages": [{"id": "7f16fcf6-d468-4855-8dcf-821190ccedf0", "message": "Beirut, Aug 2 : Lebanese militant group Hezbollah has announced that it targeted Israeli sites with rockets in response to an airstrike on southern Lebanon that killed four Syrians.\nHezbollah added that it also attacked the Jal al-Alam site with rockets, Xinhua news agency reported.\nThe Israeli army in a statement said that five projectiles crossed from Lebanon into Israel, some of which were intercepted, and the rest fell in open areas.\nThe latest attacks came amid rising tensions between Hezbollah and Israel following Tuesday's Israeli attack on Dahieh in Beirut's southern suburbs, killing Hezbollah's top military commander, Fouad Shokor.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli attack at the appropriate time and place.", "url": "https://www.prokerala.com/news/articles/a1552490.html", "date": "2024-08-01 23:30", "source": "GDELT"}, {"id": "958a794b-afd3-4024-b0fc-480419756d33", "message": "(PHOTO / AFP)BEIRUT/SANAA - Lebanese militant group Hezbollah announced on Thursday that it targeted Israeli sites with rockets in response to an airstrike on southern Lebanon that killed four Syrians.\nThe latest attacks came amid rising tensions between Hezbollah and Israel following Tuesday's Israeli attack on Dahieh in Beirut's southern suburbs, killing Hezbollah's top military commander, Fouad Shokor.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli attack at the appropriate time and place.\n(PHOTO / AFP)\"The stance of the 'axis of resistance' is unequivocal: There must be a military response to Israeli transgressions,\" al-Houthi said in a televised address.\nIran has accused Israel of carrying out the assassination, though Israel has not confirmed its involvement.", "url": "https://www.chinadailyhk.com/hk/article/589666", "date": "2024-08-02 07:30", "source": "GDELT"}], "location": "Israel", "total_score": 0.572503008423586, "count": 1, "average_score": 0.572503008423586, "final_score": 0.5807521058965103}, "7055fdf6-8f2e-4901-b8b7-7ef6c2c70755": {"messages": [{"id": "7055fdf6-8f2e-4901-b8b7-7ef6c2c70755", "message": "Ismail Al-Ghoul and his cameraman, Rami Al-Rifi, who lived in the besieged enclave, were killed in an airstrike on their car in the al Shati refugee camp, according to the Qatar-based network.\nIsraeli strikes in Gaza have since killed more than 39,000 Palestinians and injured another 90,000, according to the Ministry of Health there.\nIsrael must stop killing journalists.”Khader Al-Za’anoun of Wafa, the official Palestinian news agency, recalled his friendship with the Al Jazeera journalist.\nAl Jazeera reporters Yousef Al Saudi and Anas Al Sharif could be seen breaking down as they held Al-Ghoul’s bloodied flak jacket.\n“Our colleague Ismail was wearing this blood-stained vest,” fellow Al Jazeera journalist Yousef Al Saudi said, as he removed the “PRESS” sign from the jacket.", "url": "https://edition.cnn.com/2024/07/31/middleeast/al-jazeera-journalists-killed-airstrike-gaza-intl-latam/", "date": "2024-08-01 00:00", "source": "GDELT"}, {"id": "c7e4ae40-5109-41ad-8a0d-e33c35e49a12", "message": "Al Jazeera journalists killed in reported Israeli airstrike in Gaza, network saysObtained by CNN via CNN NewsourceBy Abeer Salman, Kareem Khadder, Hira Humayun, Sana Noor Haq and Tim Lister(CNN) — Two Al Jazeera correspondents were killed in a reported Israeli airstrike in Al-Shati refugee camp, northern Gaza, on Wednesday, according to the news network, sparking condemnation from advocacy groups and highlighting the dangers for local reporters covering the war.\nIsraeli strikes in Gaza have since killed more than 39,000 Palestinians and injured another 90,000, according to the Ministry of Health there.\nIsrael must stop killing journalists.”Khader Al-Za’anoun of Wafa, the official Palestinian news agency, recalled his friendship with the Al Jazeera journalist.\nAl Jazeera reporters Yousef Al Saudi and Anas Al Sharif could be seen breaking down as they held Al-Ghoul’s bloodied flak jacket.\n“Our colleague Ismail was wearing this blood-stained vest,” fellow Al Jazeera journalist Yousef Al Saudi said, as he removed the “PRESS” sign from the jacket.", "url": "https://www.abc57.com/news/al-jazeera-journalists-killed-in-reported-israeli-airstrike-in-gaza-network-says", "date": "2024-08-01 18:00", "source": "GDELT"}, {"id": "f2d36458-049d-4ef0-b2c2-8a0552ded5e8", "message": "Undated photos of Al Jazeera staffers Ismail Al-Ghoul and Rami Al-Rifi (L-R).\nThe Al Jazeera bureau chief for Israel and Palestine, Walid Al Omari, said Thursday the claim Al-Ghoul was a member of Hamas' military wing was \"completely false.\"\nThe CPJ asked Israel to explain the killing of both Al Jazeera staffers, in what it said, \"appears to be a direct strike.\"\nKhader Al-Za'anoun of Wafa, the official Palestinian news agency, recalled his friendship with the Al Jazeera journalist.\nAl Jazeera reporters Yousef Al Saudi and Anas Al Sharif could be seen breaking down as they held Al-Ghoul's bloodied flak jacket.", "url": "https://www.9news.com.au/world/al-jazeera-journalists-killed-in-reported-israeli-airstrike-in-gaza-network-says/4ab411bb-81a3-4bbf-b1d1-0cd73a2ceb29", "date": "2024-08-02 00:00", "source": "GDELT"}, {"id": "23c8f140-2ef9-4a8b-8dea-a21d8c73c911", "message": "DOHA — Two Al Jazeera correspondents were killed in a reported Israeli airstrike in Al-Shati refugee camp, northern Gaza, on Wednesday, according to the news network, sparking condemnation from advocacy groups and highlighting the dangers for local reporters covering the war.\nThe teenager had been riding his orange bicycle to deliver food for an elderly resident in the local neighborhood, before he was killed, according to Saudi-backed broadcaster Al-Arabiya.\nIsrael must stop killing journalists.”Khader Al-Za’anoun of Wafa, the official Palestinian news agency, recalled his friendship with the Al Jazeera journalist.\nAl Jazeera reporters Yousef Al Saudi and Anas Al Sharif could be seen breaking down as they held Al-Ghoul’s bloodied flak jacket.\n“Our colleague Ismail was wearing this blood-stained vest,” fellow Al Jazeera journalist Yousef Al Saudi said, as he removed the “PRESS” sign from the jacket.", "url": "https://saudigazette.com.sa/article/644609/World/Mena/Al-Jazeera-journalists-killed-in-reported-Israeli-airstrike-in-Gaza", "date": "2024-08-02 14:45", "source": "GDELT"}], "location": "GAZA CITY", "total_score": 1.425801356334631, "count": 3, "average_score": 0.4752671187782103, "final_score": 0.5726869831447472}, "70dd309c-0a09-45db-92ed-c89d40197a28": {"messages": [{"id": "70dd309c-0a09-45db-92ed-c89d40197a28", "message": "Iranian advisor among victims of Israeli assassination op.\nIran Press TVWednesday, 31 July 2024 9:18 PMAn Iranian military advisor has been named among the victims of a recent Israeli assassination operation against Lebanon's capital Beirut that claimed the life of a senior commander of the Lebanese resistance movement Hezbollah.\nAccording to Lebanon's' health ministry, two children were also among the victims of the operation that wounded another 74 people.\nAlso on Wednesday, another assassination operation claimed the lives of the Palestinian resistance movement Hamas' Political Bureau Chief Ismail Haniyeh and one of his bodyguards in Tehran.\nThe Palestinian resistance leader was in the Iranian capital to attend the inauguration ceremony of Iranian President Masoud Pezeshkian.", "url": "https://www.globalsecurity.org/military/library/news/2024/07/mil-240731-presstv05.htm", "date": "2024-08-01 11:15", "source": "GDELT"}, {"id": "2fb02a55-ddbf-4b1a-9aea-0bdbf2d29365", "message": "An Iranian military advisor has been named among the victims of a recent Israeli assassination operation against Lebanon’s capital Beirut that claimed the life of a senior commander of the Lebanese resistance movement Hezbollah.\nThe advisor, identified as Milad Bidi, was martyred on Tuesday, when the attack targeted the building accommodating the Hezbollah commander Fuad Shukr, Fars News Agency reported on Wednesday.\nAccording to Lebanon’s’ health ministry, two children were also among the victims of the operation that wounded another 74 people.\nAlso on Wednesday, another assassination operation claimed the lives of the Palestinian resistance movement Hamas’ Political Bureau Chief Ismail Haniyeh and one of his bodyguards in Tehran.\nThe Palestinian resistance leader was in the Iranian capital to attend the inauguration ceremony of Iranian President Masoud Pezeshkian.", "url": "https://www.presstv.ir/Detail/2024/07/31/730453/Iran-military-advisor-killed-Israeli-assassination-Hezbollah-commander-Shukr-Beirut", "date": "2024-08-01 00:30", "source": "GDELT"}], "location": "BEIRUT", "total_score": 0.33235321463437306, "count": 1, "average_score": 0.33235321463437306, "final_score": 0.4126472502440611}, "8addf590-3aad-431b-846a-13d794ecf601": {"messages": [{"id": "8addf590-3aad-431b-846a-13d794ecf601", "message": "By Euronews with APThe leader of Hamas' military operations Mohammed Deif was killed by an Israeli-targeted airstrike in Gaza in July, the IDF confirmed on Thursday.\nADVERTISEMENTThe leader of Hamas' al-Qassam Brigades, Mohammed Deif, was killed by an Israeli-targeted airstrike in Gaza in July, the IDF confirmed on Thursday.\nThe Israeli confirmation came a day after an apparent Israeli airstrike in Tehran killed Hamas' top political leader, Ismail Haniyeh.\nAlong with Deif and Haniyeh, Israel has vowed to eliminate Hamas' top leader in Gaza, Yahya Sinwar, but he has so far remained elusive.\nDeif was one of the founders of Hamas’ military wing, the al-Qassam Brigades, in the 1990s and led the unit for decades.", "url": "https://www.euronews.com/2024/08/01/hamas-military-operations-chief-killed-in-july-airstrike-israel-says", "date": "2024-08-01 11:15", "source": "GDELT"}, {"id": "7852310e-c51a-4eea-8fff-63309efb2419", "message": "The Israeli military said on Thursday that it has confirmed that the head of Hamas’s military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe announcement comes a day after an apparent Israeli strike in the Iranian capital killed Hamas’s top political leader.\nHamas has said Mr Deif survived the July attack in Gaza and did not immediately comment on the military’s announcement of confirmation.\nIsrael targeted Mr Deif in a July 13 strike that hit a compound on the outskirts of the southern Gaza city of Khan Younis.\nAdvertisementMr Deif was one of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s and led the unit for decades.", "url": "https://www.breakingnews.ie/israel-hamas/hamas-military-wing-chief-mohammed-deif-died-in-gaza-strike-israel-says-1656765.html", "date": "2024-08-01 11:15", "source": "GDELT"}, {"id": "2e22ddfa-35f1-4a50-9518-a23855cb92bc", "message": "GAZA (AP): The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nMore than 90 other people, including displaced civilians in nearby tents, were killed in the strike, Gaza health officials said at the time.\nThe Israeli confirmation came a day after an apparent Israeli airstrike in Tehran killed Hamas’ top political leader, Ismail Haniyeh.\nAlong with Deif and Haniyeh, Israel has vowed to eliminate Hamas’ top leader in Gaza, Yehya Sinwar, but he has so far remained elusive.\nDeif was one of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s and lead the unit for decades.", "url": "https://thefrontierpost.com/israeli-military-confirms-death-of-hamas-military-leader-mohammed-deif-in-july-strike-in-gaza/", "date": "2024-08-01 13:30", "source": "GDELT"}, {"id": "2b810c41-eed5-4595-baa9-c6f819ab9055", "message": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strikeBy Melanie Lidman, The Associated Press on August 1, 2024.\nJERUSALEM (AP) – The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nMore than 90 other people, including displaced civilians in nearby tents, were killed in the strike, Gaza health officials said at the time.\nThe Israeli confirmation came a day after an apparent Israeli airstrike in Tehran killed Hamas’ top political leader, Ismail Haniyeh.\nDeif was one of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s and lead the unit for decades.", "url": "https://lethbridgeherald.com/news/world-news/2024/08/01/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike/", "date": "2024-08-01 09:30", "source": "GDELT"}, {"id": "65536bc1-d47d-4e87-a60e-a5832487b7be", "message": "Israel says it has confirmed Hamas military wing chief Mohammed Deif was killed in a July strikeBy Melanie Lidman, The Associated Press on August 1, 2024.\nHamas immediately rejected the claim that Mohammed Deif was in the area.\n(AP Photo/Jehad Alshrafi)Share this story:JERUSALEM (AP) – The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe Israeli confirmation came a day after an apparent Israeli airstrike in Tehran killed Hamas’ top political leader, Ismail Haniyeh.\nDeif was one of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s and lead the unit for decades.", "url": "https://medicinehatnews.com/news/world-news/2024/08/01/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike/", "date": "2024-08-01 11:00", "source": "GDELT"}], "location": "GAZA", "total_score": 2.2483558624123408, "count": 4, "average_score": 0.5620889656030852, "final_score": 0.6634622759221597}, "294e31d7-b437-4da7-bd5c-8106d507d187": {"messages": [{"id": "294e31d7-b437-4da7-bd5c-8106d507d187", "message": "BEIRUT (AP) — Hamas’ top political leader was killed Wednesday by a predawn airstrike in the Iranian capital, Iran and the militant group said, blaming Israel for a shock assassination that risked escalating into an all-out regional war.\nMost dangerous was the potential to push Iran and Israel into direct confrontation if Iran retaliates.\nThe strike also killed three women and two children, according to the Lebanese Health Ministry.\nIsrael has targeted Hamas figures in Lebanon and Syria during the war, but going after Haniyeh in Iran was vastly more sensitive.\nOne of his bodyguards was killed, Iranian officials said.", "url": "https://whdh.com/news/hamas-top-political-leader-is-killed-in-iran-in-strike-that-risks-triggering-all-out-regional-war/", "date": "2024-08-01 00:15", "source": "GDELT"}, {"id": "323e3f53-dcdb-4864-b63b-3da044603b57", "message": "Iran’s supreme leader vowed revenge against Israel after Hamas top political leader Ismail Haniyeh was killed Wednesday in a predawn airstrike in the Iranian capital.\n(AP Photo/Vahid Salemi)Hamas chief Ismail Haniyeh arrives at the Iranian parliament to attend the swearing-in ceremony of newly-elected President Masoud Pezeshkian, in Tehran, Iran, Tuesday, July 30, 2024.\n(AP Photo/Vahid Salemi)BEIRUT — Iran’s supreme leader vowed revenge against Israel after Hamas top political leader Ismail Haniyeh was killed Wednesday in a predawn airstrike in the Iranian capital.\nMost dangerous was the potential to push Iran and Israel into direct confrontation if Iran retaliates.\nIsrael has targeted Hamas figures in Lebanon and Syria during the war, but going after Haniyeh in Iran was vastly more sensitive.", "url": "https://www.reviewjournal.com/news/nation-and-world/iran-vows-to-retaliate-after-hamas-leader-assassinated-in-tehran-3105564/", "date": "2024-08-01 00:45", "source": "GDELT"}, {"id": "a872bc20-0bef-4cf2-8d2b-2e57edfed33d", "message": "Most dangerous was the potential to push Iran and Israel into direct confrontation if Iran retaliates.\nBitter regional rivals, Israel and Iran risked plunging into war earlier this year when Israel hit Iran's embassy in Damascus in April.\nHe did not mention the Haniyeh killing, and a U.S.-provided summary of his call with Austin did not mention it.\nIsrael has targeted Hamas figures in Lebanon and Syria during the war, but going after Haniyeh in Iran was vastly more sensitive.\nOne of his bodyguards was killed, Iranian officials said.", "url": "https://www.ctvnews.ca/world/hamas-top-political-leader-is-killed-in-iran-in-strike-that-risks-triggering-all-out-regional-war-1.6983898", "date": "2024-08-01 00:45", "source": "GDELT"}, {"id": "63f68814-c07a-4666-87f5-ba536d21ab82", "message": "Israel had pledged to kill Ismail Haniyeh and other Hamas leaders over the group’s Oct. 7 attack on southern Israel that sparked the war in Gaza.\nMost dangerous was the potential to push Iran and Israel into direct confrontation if Iran retaliates.\nIsrael carried out a rare strike Tuesday evening in the Lebanese capital that it said killed a top Hezbollah commander allegedly behind the rocket strike.\nIsrael has targeted Hamas figures in Lebanon and Syria during the war, but going after Haniyeh in Iran was vastly more sensitive.\nHours later, the strike hit a residence Haniyeh uses in Tehran, killing him, Hamas said.", "url": "https://whmp.com/news/030030-hamas-top-political-leader-is-killed-in-iran-in-strike-that-risks-triggering-all-out-regional-war/", "date": "2024-08-01 19:00", "source": "GDELT"}, {"id": "8fd3fc9a-9883-45c5-ac13-73e119835b40", "message": "Iranian workers install a huge banner on a wall showing a portrait of Hamas leader Ismail Haniyeh.\nMost dangerous was the potential to push Iran and Israel into direct confrontation if Iran retaliates.\nHe did not mention the Haniyeh killing, and a US-provided summary of his call with Austin did not mention it.\nIsrael has targeted Hamas figures in Lebanon and Syria during the war, but going after Haniyeh in Iran was vastly more sensitive.\nOne of his bodyguards was killed, Iranian officials said.", "url": "https://www.9news.com.au/world/israel-iran-hamas-head-killed-in-airstrike-war-fears-un-security-council-meets/9ec1cf89-5717-45fb-bf59-0e1a0984015f", "date": "2024-08-01 00:30", "source": "GDELT"}], "location": "IRAN", "total_score": 2.276448613971212, "count": 4, "average_score": 0.569112153492803, "final_score": 0.6683785074449621}, "d80f0905-342a-4d61-8fb3-a9b2ebaa1a79": {"messages": [{"id": "d80f0905-342a-4d61-8fb3-a9b2ebaa1a79", "message": "(AP Photo/Jehad Alshrafi, File)JERUSALEM – The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe announcement came a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.\nRecommended VideosThere was no immediate comment on the Israeli claim by Hamas, which had previously said Deif survived the strike in Gaza.\nMore than 90 other people, including displaced civilians in nearby tents, were also killed, Gaza health officials said.\n“The results of this operation reflect that Hamas is an organization in disintegration,” he wrote on X.Deif was one of the founders of Hamas’ military wing in the 1990s.", "url": "https://www.wsls.com/news/world/2024/08/01/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike/", "date": "2024-08-01 09:30", "source": "GDELT"}, {"id": "ba122cce-a77d-402c-9750-2f33a087522f", "message": "JERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nIsrael targeted Deif in a July 13 strike that hit a compound on the outskirts of the southern Gaza city of Khan Younis, but there had been no immediate confirmation Deif was killed.\nMore than 90 other people, including displaced civilians in nearby tents, were killed in the strike, Gaza health officials said at the time.\nIn a statement Thursday, the Israeli military said that “following an intelligence assessment, it can be confirmed that Mohammed Deif was eliminated in the strike.”One of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nThis material may not be published, broadcast, rewritten, or redistributed.)", "url": "https://whdh.com/news/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike/", "date": "2024-08-01 09:30", "source": "GDELT"}, {"id": "27f0637f-e3b9-49ab-8977-99de834d5e88", "message": "JERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nJERUSALEM (AP) — The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe announcement came a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.\nMore than 90 other people, including displaced civilians in nearby tents, were also killed, Gaza health officials said.\n“The results of this operation reflect that Hamas is an organization in disintegration,” he wrote on X.Deif was one of the founders of Hamas’ military wing in the 1990s.", "url": "https://www.newwestrecord.ca/world-news/israel-says-it-has-confirmed-hamas-military-wing-chief-mohammed-deif-was-killed-in-a-july-strike-9297569", "date": "2024-08-01 09:30", "source": "GDELT"}, {"id": "cef84fe8-a207-4bfb-a736-35910bcde2d6", "message": "The Israeli military said Thursday that it has confirmed that the head of Hamas’ military wing, Mohammed Deif, was killed in an airstrike in Gaza in July.\nThe announcement comes a day after an apparent Israeli strike in the Iranian capital killed Hamas’ top political leader.\nMore than 90 other people, including displaced civilians in nearby tents, were killed in the strike, Gaza health officials said at the time.\n“The results of this operation reflect that Hamas is an organization in disintegration,” he wrote on X.Deif was one of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s.\n4:41 Iran, Hezbollah, Houthis vow to retaliate against Israel after Hamas leader killed in TehranHe remained a mysterious, underground figure in Gaza.", "url": "https://globalnews.ca/news/10674778/hamas-mohammed-deif-killed-israel-strike/", "date": "2024-08-01 12:45", "source": "GDELT"}, {"id": "592f6872-aa41-45f8-91fd-b0252471b8e8", "message": "Hamas commander Mohammed Deif has been assassinated in an airstrike, the Israeli military revealed today, a day after group leader Ismail Haniyeh was killed in Iran.\nThe one-eyed Hamas commander was allegedly killed on July 13, confirmed Thursday after Hamas' political chief was killed by an 'airborne projectile' in Tehran.\nIsrael believes that Deif, the head of Hamas's military, and Yahya Sinwar, the top Hamas leader in Gaza, were the chief architects of the October 7 attack.\nMore than 90 other people, including displaced civilians in nearby tents, were killed in the strike, Gaza health officials said at the time.\n'During the war, he commanded Hamas's terrorist activity in the Gaza Strip by issuing commands and instructions to senior members of Hamas's military wing,' it added.", "url": "https://www.dailymail.co.uk/news/article-13697249/One-eyed-Hamas-commander-architect-October-7-atrocities-eliminated-Israel-confirms-latest-blow-terror-group-leader-blown-Iran.html", "date": "2024-08-01 09:15", "source": "GDELT"}], "location": "GAZA", "total_score": 2.0522528484734606, "count": 4, "average_score": 0.5130632121183651, "final_score": 0.6291442484828556}, "76d294ef-4ac3-467f-8b7a-ec31b3f0b39c": {"messages": [{"id": "76d294ef-4ac3-467f-8b7a-ec31b3f0b39c", "message": "Associated PressBEIRUT (AP) — Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nAnalysts said both Hezbollah and Iran will feel compelled to retaliate, but their calculations differ.\n“They can also hit Israeli or Jewish targets globally.”Trita Parsi, executive vice president of the Quincy Institute for Responsible Statecraft, said he expects Iran’s response to be another direct hit on Israel.\nIf the response to the strikes does not cause Israeli casualties, a wider war could still be avoided, Ali said.", "url": "https://localnews8.com/news/national-world/ap-national/2024/07/31/for-iran-and-hezbollah-calibrating-response-to-israeli-strikes-leaves-no-room-for-error/", "date": "2024-08-01 10:15", "source": "GDELT"}, {"id": "6133aebf-3fe0-478b-889e-dd1381ed992f", "message": "in Tehran, Iran, Wednesday, July 31, 2024.\nTwo back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hezbollah and Hamas, have left Hezbollah and Iran in a quandary.\n(AP Photo/Vahid Salemi)BEIRUT – Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nIf the response to the strikes does not cause Israeli casualties, a wider war could still be avoided, Ali said.", "url": "https://www.clickondetroit.com/news/world/2024/08/01/for-iran-and-hezbollah-calibrating-response-to-israeli-strikes-leaves-no-room-for-error/", "date": "2024-08-01 06:15", "source": "GDELT"}, {"id": "ab8df4c4-0d77-4250-a727-f407f5c100d9", "message": "For Iran and Hezbollah, calibrating response to Israeli strikes leaves no room for errorBEIRUT (AP) — Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nAnalysts said both Hezbollah and Iran will feel compelled to retaliate, but their calculations differ.\n“I think Hezbollah has been hit much harder, much more where it hurts” than Iran, he said.\nIf the response to the strikes does not cause Israeli casualties, a wider war could still be avoided, Ali said.", "url": "http://lasvegassun.com/news/2024/aug/01/for-iran-and-hezbollah-calibrating-response-to-isr/", "date": "2024-08-01 07:00", "source": "GDELT"}], "location": "BEIRUT", "total_score": 0.8389817862628923, "count": 2, "average_score": 0.41949089313144616, "final_score": 0.5036436251920123}, "482ae565-793c-4ff8-ad5b-75635e1e1d42": {"messages": [{"id": "482ae565-793c-4ff8-ad5b-75635e1e1d42", "message": "For Iran and Hezbollah, calibrating response to Israeli strikes leaves no room for errorBEIRUT (AP) — Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nAnalysts said both Hezbollah and Iran will feel compelled to retaliate, but their calculations differ.\n“I think Hezbollah has been hit much harder, much more where it hurts” than Iran, he said.\nIf the response to the strikes does not cause Israeli casualties, a wider war could still be avoided, Ali said.", "url": "https://isp.netscape.com/news/world/story/0001/20240801/262194a2d70273207ed1d1a5cb9ab09b", "date": "2024-08-01 07:45", "source": "GDELT"}, {"id": "9ef570a4-e18e-4151-9d8b-5b9ff1153498", "message": "BEIRUT (AP) — Two back-to-back strikes in Beirut and Tehran, both attributed to Israel and targeting high-ranking figures in Hamas and Hezbollah, have left Hezbollah and Iran in a quandary.\nAnalysts agree that both strikes hit too close to home to pass without a response, and were serious security breaches for Iran and Hezbollah.\nAnalysts said both Hezbollah and Iran will feel compelled to retaliate, but their calculations differ.\n“They can also hit Israeli or Jewish targets globally.”Trita Parsi, executive vice president of the Quincy Institute for Responsible Statecraft, said he expects Iran’s response to be another direct hit on Israel.\nIf the response to the strikes does not cause Israeli casualties, a wider war could still be avoided, Ali said.", "url": "https://www.timesfreepress.com/news/2024/aug/01/for-iran-and-hezbollah-calibrating-response-to-israeli-strikes-leaves-no-room-for-error/", "date": "2024-08-02 00:15", "source": "GDELT"}], "location": "BEIRUT", "total_score": 0.3440900969191618, "count": 1, "average_score": 0.3440900969191618, "final_score": 0.4208630678434132}, "5daf2b52-15e6-4f15-8a9a-06a04838fbba": {"messages": [{"id": "5daf2b52-15e6-4f15-8a9a-06a04838fbba", "message": "Israel said it targeted Hamas' military commander Mohammed Deif in a massive strike Saturday.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing “an intelligence assessment.” There was no immediate comment from Hamas officials on Israel's claim.\nOne of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas’ political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the “Al Aqsa Flood” operation.", "url": "https://www.yahoo.com/news/mohammed-deif-hamas-military-leader-103616068.html", "date": "2024-08-01 11:00", "source": "GDELT"}, {"id": "68bb9c1b-8304-461a-add0-160024f7be68", "message": "Mohammed Deif, Hamas' longtime shadowy military leader and one of the alleged masterminds of the Oct. 7 attack on Israel that sparked the war in Gaza, is said to be dead following an Israeli airstrike last month.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing \"an intelligence assessment.\"\nOne of the founders of Hamas' military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas' political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the \"Al Aqsa Flood\" operation.", "url": "https://wjla.com/news/nation-world/israel-claims-killing-of-hamas-military-leader-mohammed-deif-in-gaza-airstrike-oct-7-attack-masterminds-yahya-sinwar-intelligence-assessment-qassam-brigades-suicide-bombings-palestinians", "date": "2024-08-01 15:30", "source": "GDELT"}], "location": "Gaza", "total_score": 0.38428813349304036, "count": 1, "average_score": 0.38428813349304036, "final_score": 0.4490016934451283}, "5b37a99b-6f07-4e5d-90f1-7fb78576ce1d": {"messages": [{"id": "5b37a99b-6f07-4e5d-90f1-7fb78576ce1d", "message": "Israel said it targeted Hamas' military commander Mohammed Deif in a massive strike Saturday.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing “an intelligence assessment.” There was no immediate comment from Hamas officials on Israel's claim.\nRecommended VideosOne of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas’ political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the “Al Aqsa Flood” operation.", "url": "https://www.clickondetroit.com/news/world/2024/08/01/mohammed-deif-hamas-military-leader-who-eluded-israel-for-decades-is-claimed-to-be-dead/", "date": "2024-08-01 15:00", "source": "GDELT"}, {"id": "3a417467-4143-4faa-90e8-e768c6de8486", "message": "Mohammed Deif, Hamas' longtime shadowy military leader and one of the alleged masterminds of the Oct. 7 attack on Israel that sparked the war in Gaza, is said to be dead following an Israeli airstrike last month.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing \"an intelligence assessment.\"\nOne of the founders of Hamas' military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas' political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the \"Al Aqsa Flood\" operation.", "url": "https://katv.com/news/nation-world/israel-claims-killing-of-hamas-military-leader-mohammed-deif-in-gaza-airstrike-oct-7-attack-masterminds-yahya-sinwar-intelligence-assessment-qassam-brigades-suicide-bombings-palestinians", "date": "2024-08-01 13:15", "source": "GDELT"}], "location": "GAZA", "total_score": 0.404967008797654, "count": 1, "average_score": 0.404967008797654, "final_score": 0.4634769061583578}, "0f0ecf91-452d-4bec-8e51-86ad67269a61": {"messages": [{"id": "0f0ecf91-452d-4bec-8e51-86ad67269a61", "message": "Mohammed Deif, Hamas' longtime shadowy military leader and one of the alleged masterminds of the Oct. 7 attack on Israel that sparked the war in Gaza, is said to be dead following an Israeli airstrike last month.\nThe Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing \"an intelligence assessment.\"\nOne of the founders of Hamas' military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael says Deif and Hamas' political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the \"Al Aqsa Flood\" operation.", "url": "https://turnto10.com/news/nation-world/israel-claims-killing-of-hamas-military-leader-mohammed-deif-in-gaza-airstrike-oct-7-attack-masterminds-yahya-sinwar-intelligence-assessment-qassam-brigades-suicide-bombings-palestinians", "date": "2024-08-01 11:15", "source": "GDELT"}, {"id": "b4f46d38-613e-417d-a689-ddaebef32fed", "message": "The Israeli military said it killed Deif in a massive strike in southern Gaza on July 13, citing “an intelligence assessment.” There was no immediate comment from Hamas officials on Israel’s claim.\nOne of the founders of Hamas’ military wing, the Qassam Brigades, in the 1990s, Deif led the unit for decades.\nIsrael said it targeted Hamas' military commander Mohammed Deif in a massive strike Saturday.\nIsrael says Deif and Hamas’ political leader in Gaza, Yahya Sinwar, were the chief architects of the Oct. 7 attack.\nOn the morning of the attack, Hamas issued a rare voice recording of Deif announcing the “Al Aqsa Flood” operation.", "url": "https://www.winnipegfreepress.com/world/2024/08/01/mohammed-deif-hamas-military-leader-who-eluded-israel-for-decades-is-claimed-to-be-dead", "date": "2024-08-02 04:45", "source": "GDELT"}], "location": "Gaza", "total_score": 0.4532030895047705, "count": 1, "average_score": 0.4532030895047705, "final_score": 0.4972421626533393}, "e60b7ed6-d78d-4d87-aa17-0e33dffaae3c": {"messages": [{"id": "e60b7ed6-d78d-4d87-aa17-0e33dffaae3c", "message": "Hezbollah launched rockets at northern Israel on Thursday in response to an Israeli air strike that killed four Syrian nationals in south Lebanon.\nThis follows the killing of a top Hezbollah commander, Fuad Shukr, by Israel earlier in the week.Hezbollah confirmed its actions through a statement, saying, \"launched dozens of Katyusha rockets... in response to the Israeli enemy's attack on...(the southern village of Shama) that killed a number of civilians.\"\n\"The health ministry announces... four Syrian nationals were martyred\" in an \"Israeli strike\" on Shama, read the ministry's statement.\nHezbollah's leader Hassan Nasrallah has stated that operations would resume on Friday morning.Compounding the tension, hours after Shukr's death, Hezbollah ally Hamas's chief Ismail Haniyeh was killed in a strike in Tehran.\nIsrael has not commented on Haniyeh's death, while both Iran and Hamas blame Israel for the attack.", "url": "https://timesofindia.indiatimes.com/world/middle-east/hezbollah-launches-rockets-at-israel-in-retaliation-for-airstrike-over-lebanon/articleshow/112205615.cms", "date": "2024-08-01 21:30", "source": "GDELT"}, {"id": "2b7438df-36bb-4b83-9338-c9f5a5fcca40", "message": "BEIRUT, Lebanon, Aug 2, 2024 (BSS/AFP) - Hezbollah said it launched rockets at northern Israel Thursday \"in response\" to a deadly Israeli strike in south Lebanon -- the group's first attack after Israel killed a top commander earlier this week.\nThe Iran-backed group said in a statement that it \"launched dozens of Katyusha rockets... in response to the Israeli enemy's attack on... (the southern village of Shama) that killed a number of civilians\".\nThe Israeli military said that shortly after the rocket fire, the air force \"struck the Hezbollah launcher from which the projectiles were launched\".\nEarlier Thursday, the Lebanese health ministry said four Syrians were killed in an Israeli strike on the south, where Hezbollah and Israel have exchanged near-daily fire since the Gaza war began in October.\n\"The health ministry announces... four Syrian nationals were martyred\" in an \"Israeli strike\" on the southern village of Shama, it said in a statement.", "url": "https://www.bssnews.net/news/202325", "date": "2024-08-02 03:30", "source": "GDELT"}, {"id": "a1c13725-32ee-4246-92b2-c14ca6f7efc6", "message": "Hezbollah fired overnight anti-aircraft missiles on Israeli warplanes in south Lebanon, forcing them to retreat beyond the border.\nThe group had launched rockets at northern Israel Thursday \"in response\" to a deadly Israeli strike in south Lebanon -- the group's first attack after Israel killed a top commander earlier this week.\nHezbollah said in a statement that it \"launched dozens of Katyusha rockets... in response to the Israeli enemy's attack on... (the southern village of Shamaa) that killed a number of civilians\".\nEarlier Thursday, the Lebanese health ministry said four Syrians were killed in an Israeli strike on the south, where Hezbollah and Israel have exchanged near-daily fire since the Gaza war began in October.\n\"The health ministry announces... four Syrian nationals were martyred\" in an \"Israeli strike\" on the southern village of Shamaa, it said in a statement.", "url": "https://www.naharnet.com/stories/en/307009-hezbollah-says-fired-dozens-of-rockets-at-north-israel", "date": "2024-08-02 08:15", "source": "GDELT"}], "location": "NULL", "total_score": 1.2486621307154597, "count": 2, "average_score": 0.6243310653577299, "final_score": 0.6470317457504109}, "33b186c4-949b-4c6a-ab46-8e59e10a3417": {"messages": [{"id": "33b186c4-949b-4c6a-ab46-8e59e10a3417", "message": "Hezbollah’s leader has warned that the conflict with Israel has entered a “new phase”.\nAdvertisementMeanwhile in Tehran, Iran’s supreme leader prayed over the body of Hamas’s political leader, who was killed in a presumed Israeli assassination.\nIran has vowed retaliation against Israel for the strike that killed Hamas’s Ismail Haniyeh on Wednesday in the Iranian capital of Tehran.\nIsrael said Mr Shukur was behind a rocket attack days earlier that hit a football field in the Israeli-held Golan Heights, killing 12 children.\nIsrael and Iran risked plunging into war earlier this year when Israel hit Iran’s embassy in Damascus in April.", "url": "https://www.breakingnews.ie/world/hezbollah-leader-says-war-with-israel-has-entered-new-phase-1657167.html", "date": "2024-08-01 23:15", "source": "GDELT"}, {"id": "5ed21387-4c97-470e-b059-fdd2f5b0d11d", "message": "Meanwhile in Tehran, Iran’s supreme leader prayed over the body of Hamas’ political leader, who was killed in a presumed Israeli assassination.\nIran has vowed retaliation against Israel for the strike that killed Hamas’ Ismail Haniyeh on Wednesday in the Iranian capital of Tehran.\nIsrael and Iran risked plunging into war earlier this year when Israel hit Iran’s embassy in Damascus in April.\nAssociated Press photos showed the Hamas leader seated alongside leaders from the Palestinian Islamic Jihad militant group and Hezbollah, and Iranian media showed him and Pezeshkian hugging.\nBlinken did not mention Israel, Iran or Hamas by name in his comments.", "url": "https://www.thereminder.ca/world-news/hezbollah-leader-says-war-with-israel-has-entered-new-phase-after-killings-of-top-militant-figures-9297502", "date": "2024-08-01 20:00", "source": "GDELT"}], "location": "Tehran", "total_score": 0.5508178844056707, "count": 1, "average_score": 0.5508178844056707, "final_score": 0.5655725190839694}, "fba2d659-5700-4b26-9d83-66fd9a66eca4": {"messages": [{"id": "fba2d659-5700-4b26-9d83-66fd9a66eca4", "message": "Deif is believed to have been one of the masterminds of Hamas’ Oct. 7 attack on southern Israel which triggered the Gaza war.\nIran and Hamas have blamed Haniyeh’s killing on Israel, which has neither denied nor confirmed a role in the assassination.\nSTRING OF DEATHSOn Thursday, Hamas official Sami Abu Zuhri said Haniyeh’s death would not weaken the group’s fighters in Gaza.\nIsraeli Defense Minister Yoav Gallant said Deif’s death was a milestone in Israel‘s goal of destroying Hamas’ military wing, known as Al-Qassam Brigades.\nIsrael responded with a military campaign aimed at freeing the hostages and dismantling Hamas’ military and governing capabilities in Gaza.", "url": "https://www.algemeiner.com/2024/08/01/israel-confirms-death-hamas-terror-chief-mohammed-deif-oct-7-mastermind/", "date": "2024-08-01 17:30", "source": "GDELT"}, {"id": "8f763b5b-109c-48dc-a240-c114f4436689", "message": "Estimated read time: 4-5 minutesJERUSALEM — The head of Hamas' military wing, Mohammed Deif, was killed in an Israeli airstrike in Gaza last month, the Israeli military said on Thursday, a day after the group's political leader was assassinated in Tehran.\nHamas neither confirmed nor denied the killing of Deif, but one official, Ezzat Rashaq, said any word on deaths of its leaders was its responsibility alone.\nIran and Hamas have blamed Haniyeh's killing on Israel, which has neither denied nor confirmed a role in the assassination.\nPicture said to show leader of Hamas' military wing, known as Al-Qassam Brigades, Mohammed Deif in a location given as Gaza Strip in this handout picture released on Jan. 7.\n(Photo: Israel Defense Forces)Israeli Defense Minister Yoav Gallant said Deif's death was a milestone in Israel's goal of destroying Hamas' military wing, known as Al-Qassam Brigades.", "url": "https://www.ksl.com:443/article/51086400/death-of-hamas-military-leader-mohammed-deif-oct-7-mastermind-confirmed-israel-says", "date": "2024-08-02 02:45", "source": "GDELT"}], "location": "GAZA", "total_score": 0.6960422596249576, "count": 1, "average_score": 0.6960422596249576, "final_score": 0.6672295817374703}, "4c0301bc-d004-4c04-b23f-92b18393b293": {"messages": [{"id": "4c0301bc-d004-4c04-b23f-92b18393b293", "message": "The bomb was hidden inside the guesthouse approximately two months before Haniyeh’s visit, five of the Middle Eastern officials told the Times.\nQuoting sources, the Times said the bomb detonated remotely once it was confirmed Haniyeh was inside the room at around 2 a.m. local time.\nThe guesthouse Haniyeh was staying at is run and protected by the Islamic Revolutionary Guards Corps in Neshat, a neighborhood of northern Tehran.\nIn 2006, President Mahmoud Abbas appointed Haniyeh as Palestinian prime minister after Hamas won the most seats in national elections.\nHe was then elected head of Hamas’ political bureau in 2017 and was widely considered Hamas’ overall leader until his assassination.", "url": "https://www.urdupoint.com/en/world/haniyeh-killed-by-bomb-planted-in-tehran-gues-1849443.html", "date": "2024-08-02 00:00", "source": "GDELT"}, {"id": "802b0d9f-be6d-4e27-9343-5340e5f58e12", "message": "Haniyeh killed by bomb planted in Tehran guesthouse: NYTWorld World Haniyeh killed by bomb planted in Tehran guesthouse: NYTQuoting sources, the Times said the bomb detonated remotely once it was confirmed Haniyeh was insideFollow on Published On: Fri, 02 Aug 2024 11:16:00 PKTNEW YORK (APP) – Top Hamas leader Ismail Haniyeh was assassinated on Wednesday by a bomb that was covertly smuggled into the Tehran guesthouse where he was staying two months before his arrival, according to a leading American newspaper.\nThe bomb was hidden inside the guesthouse approximately two months before Haniyeh’s visit, five of the Middle Eastern officials told the Times.\nQuoting sources, the Times said the bomb detonated remotely once it was confirmed Haniyeh was inside the room at around 2 am local time.\nThe guesthouse Haniyeh was staying at is run and protected by the Islamic Revolutionary Guards Corps in Neshat, a neighborhood of northern Tehran.\nHe was then elected head of Hamas’ political bureau in 2017 and was widely considered Hamas’ overall leader until his assassination.", "url": "https://dunyanews.tv/en/World/828142-haniyeh-killed-by-bomb-planted-in-tehran-guesthouse-nyt", "date": "2024-08-02 06:45", "source": "GDELT"}], "location": "Northern Tehran.", "total_score": 0.5554502721425038, "count": 1, "average_score": 0.5554502721425038, "final_score": 0.5688151904997526}, "2351fbf9-3f42-4e49-88cb-24ee88d0a43c": {"messages": [{"id": "2351fbf9-3f42-4e49-88cb-24ee88d0a43c", "message": "The Republic of Korea’s summers are famous for cloudy skies and torrential downpours that may appear at a moment’s notice.\nThe nearly three-week, multi-national training called Joint Combined Exchange Training, was hosted by the Special Operations Command Korea from July 15-31, 2024.\nThe goal of the training was to ensure interoperability with coalition special operations forces (SOF) partners in realistic training environments.\nTo do this, mission organizers created challenging scenarios in different domains to replicate adversarial tactics in combat scenarios.\n“Our Airmen here at the Wolf Pack demonstrate daily what it means to be forward-deployed and ready to fight tonight.", "url": "https://www.pacom.mil/Media/News/News-Article-View/Article/3859036/special-operations-forces-cut-through-kunsans-rainy-skies-to-demonstrate-strike/", "date": "2024-08-02 03:15", "source": "GDELT"}, {"id": "2de52e34-2de6-4cfe-a396-979550a5aba9", "message": "South Korea’s summers are famous for cloudy skies and torrential downpours that may appear at a moment’s notice.\nHowever, during a week in mid-July, members of the Wolf Pack at Kunsan Air Base observed a spectacle precipitate from the open skies unlike the typical monsoon rains.\nThe nearly three-week, multinational training called Joint Combined Exchange Training, was hosted by the Special Operations Command Korea from July 15-31.\nThe goal of the training was to ensure interoperability with coalition special operations forces partners in realistic training environments.\n“Our Airmen here at the Wolf Pack demonstrate daily what it means to be forward-deployed and ready to fight tonight.", "url": "https://www.afrc.af.mil/News/Article/3858815/special-operations-forces-cut-through-kunsans-rainy-skies-to-demonstrate-strike/", "date": "2024-08-02 13:45", "source": "GDELT"}], "location": "Republic of Korea", "total_score": 0.4396456256921373, "count": 1, "average_score": 0.4396456256921373, "final_score": 0.4877519379844961}, "925d1ff6-2314-40c5-828f-73c19fba0128": {"messages": [{"id": "925d1ff6-2314-40c5-828f-73c19fba0128", "message": "Mourners gathered in Doha on August 2 to hold funeral prayers for slain Hamas leader Ismail Haniyeh as Iran and its regional allies vowed to retaliate against Israel.\nAl-Hayya told family members that Haniyeh was “no better or dearer” than the children killed in Gaza.\nSome 39,480 Palestinians have been killed throughout the war, according to Gaza’s Health Ministry, which does not differentiate between civilians and combatants.\nIsrael has yet to claim or deny a role in the killing of Haniyeh, but Hamas and its allies say it was responsible.\nBut Haniyeh had been among Hamas' main negotiators throughout the cease-fire discussions and his assassination could throw into disarray months of talks.", "url": "https://www.thehindu.com/news/international/slain-hamas-leader-haniyehs-funeral-held-in-qatar-as-worries-of-regional-war-mount/article68478536.ece", "date": "2024-08-02 16:00", "source": "GDELT"}, {"id": "3a3fee77-9298-4e62-a63d-ba9ec006c53b", "message": "DOHA, Qatar — Mourners gathered in Doha on Friday to hold funeral prayers for slain Hamas leader Ismail Haniyeh as Iran and its regional allies vowed to retaliate against Israel.\nAl-Hayya told family members that Haniyeh was “no better or dearer” than the children killed in Gaza.\nIsrael has yet to claim or deny a role in the killing of Haniyeh, but Hamas and its allies say it was responsible.\n“We’ve entered a new phase that is different from the previous period,” Hezbollah’s leader, Hassan Nasrallah, told mourners, vowing a “well-studied retaliation” against Israel.\nBut Haniyeh had been among Hamas’ main negotiators throughout the cease-fire discussions and his assassination could throw into disarray months of talks.", "url": "https://www.stltoday.com/news/nation-world/mourners-pay-respects-to-slain-hamas-leader-haniyeh-as-worries-of-regional-war-mount/article_16f21f04-50ce-11ef-84dc-d7a735a6fb96.html", "date": "2024-08-02 15:15", "source": "GDELT"}, {"id": "6cc17c4d-b526-4f1b-b6fd-25e8702054b7", "message": "That included two men seen as his possible successors: Khalil Al-Hayya, a Hamas senior official and the head of Palestinian Islamic Jihad, and former Hamas chief Khaled Mashaal, a close aide to Mr Haniyeh.\nPeople pray during the absent funeral prayer for Hamas leader Ismail Haniyeh in Islamabad, Pakistan (AP Photo/W.K.\nYousafzai)Mr Al-Hayya told family members that Mr Haniyeh was “no better or dearer” than the children killed in Gaza.\nFrom Morocco to Iran, demonstrators took to the streets in a show of support for Mr Haniyeh.\nBut Mr Haniyeh had been among Hamas’ main negotiators throughout the ceasefire discussions and his assassination could throw into disarray months of talks.", "url": "https://www.belfasttelegraph.co.uk/news/world-news/mourners-pay-respects-to-slain-hamas-leader-as-worries-of-regional-war-mount/a430664294.html", "date": "2024-08-02 16:45", "source": "GDELT"}, {"id": "5bb0345f-b058-4a73-b1c9-2094b88a7c50", "message": "DOHA, Qatar — Mourners gathered in Doha on Friday to hold funeral prayers for slain Hamas leader Ismail Haniyeh as Iran and its regional allies vowed to retaliate against Israel.\nThat included two men seen as his possible successors: Khalil al-Hayya, a Hamas senior official, and former Hamas chief Khaled Mashaal, a close Haniyeh aide.\nAl-Hayya told family members that Haniyeh was “no better or dearer” than the children killed in Gaza.\nSome 39,480 Palestinians have been killed throughout the war, according to Gaza’s Health Ministry, which does not differentiate between civilians and combatants.\nHaniyeh had been among Hamas’ main negotiators throughout the cease-fire discussions, and his assassination could throw into disarray months of talks.", "url": "https://www.newsday.com/news/nation/israel-palestinians-hama-haniyeh-funeral-d75264", "date": "2024-08-02 16:15", "source": "GDELT"}, {"id": "ad4e972b-e876-472b-9a25-1ca907f8e7b0", "message": "People pray during the absent funeral prayer for Hamas leader Ismail Haniyeh in Islamabad, Pakistan (AP Photo/W.K.\nYousafzai)Mr Al-Hayya told family members that Mr Haniyeh was “no better or dearer” than the children killed in Gaza.\nIsrael has yet to claim or deny a role in the killing of Mr Haniyeh, but Hamas and its allies say it was responsible.\nFrom Morocco to Iran, demonstrators took to the streets in a show of support for Mr Haniyeh.\nBut Mr Haniyeh had been among Hamas’ main negotiators throughout the ceasefire discussions and his assassination could throw into disarray months of talks.", "url": "https://www.echo-news.co.uk/news/national/24494315.mourners-pay-respects-slain-hamas-leader-worries-regional-war-mount/", "date": "2024-08-02 15:15", "source": "GDELT"}, {"id": "670d4f8f-3976-4753-b8d4-3f0033a50017", "message": "DOHA (AP): Mourners gathered in Doha on Friday to hold funeral prayers for slain Hamas leader Ismail Haniyeh as Iran and its regional allies vowed to retaliate against Israel.\nThat included two men seen as his possible successors: Khalil Al-Hayya, a Hamas senior official and the head of Palestinian Islamic Jihad, and former Hamas Chief Khaled Mashaal, a close Haniyeh aide.\nAl-Hayya told family members that Haniyeh was “no better or dearer” than the children killed in Gaza.\nIsrael has yet to claim or deny a role in the killing of Haniyeh, but Hamas and its allies say it was responsible.\nBut Haniyeh had been among Hamas’ main negotiators throughout the cease-fire discussions and his assassination could throw into disarray months of talks.", "url": "https://thefrontierpost.com/mourners-pay-respects-to-slain-hamas-leaders-as-worries-of-regional-war-mount/", "date": "2024-08-02 13:45", "source": "GDELT"}, {"id": "2879cf5b-fdf8-4bae-880b-f679dea74f56", "message": "DOHA, Qatar (AP) — Mourners gathered in Doha on Friday to hold funeral prayers for slain Hamas leader Ismail Haniyeh as Iran and its regional allies vowed to retaliate against Israel.\nThat included two men seen as his possible successors: Khalil Al-Hayya, a Hamas senior official and the head of Palestinian Islamic Jihad, and former Hamas Chief Khaled Mashaal, a close Haniyeh aide.\nAl-Hayya told family members that Haniyeh was “no better or dearer” than the children killed in Gaza.\nIsrael has yet to claim or deny a role in the killing of Haniyeh, but Hamas and its allies say it was responsible.\nBut Haniyeh had been among Hamas’ main negotiators throughout the cease-fire discussions and his assassination could throw into disarray months of talks.", "url": "https://www.ktsa.com/mourners-pay-respects-to-slain-hamas-leaders-as-worries-of-regional-war-mount/", "date": "2024-08-02 17:00", "source": "GDELT"}, {"id": "a7b97d59-1b41-4f2b-bd1a-57c456e2524f", "message": "DOHA, Qatar (AP) — Mourners gathered in Doha today to hold funeral prayers for slain Hamas leader Ismail Haniyeh as Iran and its regional allies vowed to retaliate against Israel.\nAl-Hayya told family members that Haniyeh was “no better or dearer” than the children killed in Gaza.\nIsrael has yet to claim or deny a role in the killing of Haniyeh, but Hamas and its allies say it was responsible.\n“We’ve entered a new phase that is different from the previous period,” Hezbollah’s leader, Hassan Nasrallah, told mourners, vowing a “well-studied retaliation” against Israel.\nBut Haniyeh had been among Hamas’ main negotiators throughout the cease-fire discussions and his assassination could throw into disarray months of talks.", "url": "https://www.vindy.com/news/latest-news/2024/08/mourners-pay-respects-to-slain-hamas-leader-haniyeh-as-worries-of-regional-war-mount/", "date": "2024-08-02 16:00", "source": "GDELT"}, {"id": "9dd27ab5-447c-41e7-82d9-8224174742fb", "message": "Mourners pay respects to slain Hamas leader Haniyeh as worries of regional war mountDOHA, Qatar — Mourners gathered in Doha on Friday to hold funeral prayers for slain Hamas leader Ismail Haniyeh as Iran and its regional allies vowed to retaliate against Israel.\nThat included two men seen as his possible successors: Khalil al-Hayya, a Hamas senior official, and former Hamas chief Khaled Mashaal, a close Haniyeh aide.\nAl-Hayya told family members that Haniyeh was “no better or dearer” than the children killed in Gaza.\nIsrael has yet to claim or deny a role in the killing of Haniyeh, but Hamas and its allies say it was responsible.\n“We’ve entered a new phase that is different from the previous period,” Hezbollah’s leader, Hassan Nasrallah, told mourners, vowing a “well-studied retaliation” against Israel.", "url": "http://lasvegassun.com/news/2024/aug/02/mourners-pay-respects-to-slain-hamas-leader-haniye/", "date": "2024-08-02 16:00", "source": "GDELT"}, {"id": "b7d08120-c7af-41ee-96f9-f2e8d06e1f5c", "message": "Mourners gathered in Doha on Friday to hold funeral prayers for slain Hamas leader Ismail Haniyeh as Iran and its regional allies vowed to retaliate against Israel.\nThat included two men seen as his possible successors: Khalil Al-Hayya, a Hamas senior official and the head of Palestinian Islamic Jihad, and former Hamas chief Khaled Mashaal, a close aide to Mr Haniyeh.\nPeople pray during the absent funeral prayer for Hamas leader Ismail Haniyeh in Islamabad, Pakistan (AP Photo/W.K.\nIsrael has yet to claim or deny a role in the killing of Mr Haniyeh, but Hamas and its allies say it was responsible.\nBut Mr Haniyeh had been among Hamas’ main negotiators throughout the ceasefire discussions and his assassination could throw into disarray months of talks.", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/08/02/mourners-pay-respects-to-slain-hamas-leader-as-worries-of-regional-war-mount/", "date": "2024-08-02 16:15", "source": "GDELT"}], "location": "Doha", "total_score": 3.97117801004892, "count": 9, "average_score": 0.44124200111654666, "final_score": 0.7288694007815827}, "3602baa6-171b-4859-8cab-52cc12d7742f": {"messages": [{"id": "3602baa6-171b-4859-8cab-52cc12d7742f", "message": "JERUSALEM (AP) — Thousands of mourners converged around the flag-draped coffin of Hamas' slain political chief, Ismail Haniyeh , in the emirate of Qatar on Friday as the fallout surged from his death in an alleged Israeli attack.\nJERUSALEM (AP) — Thousands of mourners converged around the flag-draped coffin of Hamas' slain political chief, Ismail Haniyeh, in the emirate of Qatar on Friday as the fallout surged from his death in an alleged Israeli attack.\n“Let Friday be a day of rage to denounce the assassination,” said Izzat al-Risheq, a senior Hamas official.\nHaniyeh had lived in Qatar, along with other senior members of Hamas’s political leadership.\nOn Thursday, Israel announced that it killed the shadowy leader of Hamas’ military wing, Mohammed Deif, in a July airstrike.", "url": "https://www.richmond-news.com/world-news/mourners-pay-respects-to-slain-hamas-leader-haniyeh-as-worries-of-regional-war-mount-9303004", "date": "2024-08-02 13:45", "source": "GDELT"}, {"id": "c92c5e9b-6685-4170-95b2-94bca4af300d", "message": "JERUSALEM (AP) — Thousands of mourners converged around the flag-draped coffin of Hamas' slain political chief, Ismail Haniyeh, in the emirate of Qatar on Friday as the fallout surged from his death in an alleged Israeli attack.\n“Let Friday be a day of rage to denounce the assassination,” said Izzat al-Risheq, a senior Hamas official.\nHaniyeh had lived in Qatar, along with other senior members of Hamas’s political leadership.\nOn Thursday, Israel announced that it killed the shadowy leader of Hamas’ military wing, Mohammed Deif, in a July airstrike.\n“We ask God Almighty to have mercy on him and to grant him a place in His spacious gardens,” the imam said, adding that the Palestinians in Jerusalem were mourning the late Hamas leader.", "url": "https://www.airdriecityview.com/world-news/mourners-pay-respects-to-slain-hamas-leader-haniyeh-as-worries-of-regional-war-mount-9302999", "date": "2024-08-02 14:15", "source": "GDELT"}], "location": "JERUSALEM.", "total_score": 0.4594922646477946, "count": 1, "average_score": 0.4594922646477946, "final_score": 0.5016445852534562}, "9420b8fc-1c37-4352-b124-1a45b0381a4c": {"messages": [{"id": "9420b8fc-1c37-4352-b124-1a45b0381a4c", "message": "BEIRUT (Reuters) - Hezbollah forces on Friday resumed rocket and artillery attacks against Israel, ending the lull along the border following Israel's killing of the Lebanese group's military commander in Beirut.\nIts forces also carried out two artillery attacks and two rocket strikes at military positions in northern Israel, it said.\nThe Israeli military said in a statement it had successfully intercepted an aerial target coming from Lebanon into the Israeli-occupied Golan Heights.\nThe Israeli military also said it had hit two Hezbollah fighters in southern Lebanon.\nIsrael and the United States have accused Hezbollah of killing 12 youths in a July 27 rocket attack on the Israeli-occupied Golan Heights, a claim Hezbollah has denied.", "url": "https://www.yahoo.com/news/hezbollah-resumes-steady-rocket-artillery-145154092.html", "date": "2024-08-02 15:15", "source": "GDELT"}, {"id": "25d30f48-aeda-4f61-a711-363d5b6106f3", "message": "Hezbollah forces on Friday resumed rocket and artillery attacks against Israel, breaking a brief lull along the border after Israel killed the Lebanese group's military commander in Beirut.\nAdditional artillery and rocket attacks targeted military positions in northern Israel.\nThe Israeli military intercepted an aerial target from Lebanon over the Israeli-occupied Golan Heights, according to a statement.\nNasrallah indicated that Hezbollah would retaliate but needed to deliberate their response while continuing usual military operations against Israel.\nFor nearly 10 months, Hezbollah and the Israeli military have exchanged fire amid the Gaza war, typically concentrating their actions along the border.", "url": "https://www.devdiscourse.com/article/law-order/3040058-hezbollah-resumes-rocket-attacks-on-israel-amid-rising-tensions", "date": "2024-08-02 18:15", "source": "GDELT"}], "location": "BEIRUT", "total_score": 0.5972596585804133, "count": 1, "average_score": 0.5972596585804133, "final_score": 0.5980817610062893}}