{"97fc22bc-1d82-4891-92c4-926289740145": {"messages": [{"id": "97fc22bc-1d82-4891-92c4-926289740145", "message": "Long, fraught time line of tensions over Iran's nuclear program ahead of its presidential electionFILE - A worker rides a bike in front of the reactor building of the Bushehr nuclear power plant, just outside the southern city of Bushehr, Iran, on Oct. 26, 2010.\nIran’s nuclear program goes fallow under international pressure.\nApril 2015 — A framework nuclear deal is announced after months of negotiations, outlining long-term restrictions on Iran’s nuclear program and the removal of many international sanctions.\nJune 20, 2019 — Iran’s Revolutionary Guard shoots down a U.S. spy drone in the Strait of Hormuz with a surface-to-air missile.\nJune 28, 2022 — Iran and the United States begin a series of indirect talks in Qatar over the nuclear deal.", "url": "https://www.yahoo.com/news/long-fraught-time-line-tensions-053221351.html", "date": "2024-06-25 06:00", "source": "GDELT"}, {"id": "4079aac9-7b8a-4cf5-8080-070b1045fde4", "message": "Iran’s nuclear program goes fallow under international pressure.\nApril 2015 — A framework nuclear deal is announced after months of negotiations, outlining long-term restrictions on Iran’s nuclear program and the removal of many international sanctions.\nJune 20, 2019 — Iran’s Revolutionary Guard shoots down a U.S. spy drone in the Strait of Hormuz with a surface-to-air missile.\nMarch 13, 2022 — Iran's Revolutionary Guard claims responsibility for a ballistic missile attack that strikes near the U.S. Consulate in northern Iraq.\nJune 28, 2022 — Iran and the United States begin a series of indirect talks in Qatar over the nuclear deal.", "url": "https://www.independent.co.uk/news/world/europe/iran-ap-ebrahim-raisi-american-tehran-b2568287.html", "date": "2024-06-25 06:00", "source": "GDELT"}, {"id": "8b9619ba-cd5a-4884-aa9a-358f3c4641c3", "message": "Iran's nuclear program goes fallow under international pressure.\nApril 2015 — A framework nuclear deal is announced after months of negotiations, outlining long-term restrictions on Iran's nuclear program and the removal of many international sanctions.\nJune 20, 2019 — Iran's Revolutionary Guard shoots down a U.S. spy drone in the Strait of Hormuz with a surface-to-air missile.\nMarch 13, 2022 — Iran's Revolutionary Guard claims responsibility for a ballistic missile attack that strikes near the U.S. Consulate in northern Iraq.\nJune 28, 2022 — Iran and the United States begin a series of indirect talks in Qatar over the nuclear deal.", "url": "https://www.startribune.com/long-fraught-time-line-of-tensions-over-irans-nuclear-program-ahead-of-its-presidential-election/600375909/", "date": "2024-06-25 06:15", "source": "GDELT"}, {"id": "61078afa-32db-4f18-9f2f-28a97dccdf8d", "message": "Iran’s nuclear program goes fallow under international pressure.\nApril 2015 — A framework nuclear deal is announced after months of negotiations, outlining long-term restrictions on Iran’s nuclear program and the removal of many international sanctions.\nJune 20, 2019 — Iran’s Revolutionary Guard shoots down a U.S. spy drone in the Strait of Hormuz with a surface-to-air missile.\nMarch 13, 2022 — Iran’s Revolutionary Guard claims responsibility for a ballistic missile attack that strikes near the U.S. Consulate in northern Iraq.\nJune 28, 2022 — Iran and the United States begin a series of indirect talks in Qatar over the nuclear deal.", "url": "https://www.winnipegfreepress.com/world/2024/06/25/long-fraught-time-line-of-tensions-over-irans-nuclear-program-ahead-of-its-presidential-election", "date": "2024-06-25 06:00", "source": "GDELT"}], "location": "Iran", "total_score": 1.4858633941604422, "count": 3, "average_score": 0.4952877980534807, "final_score": 0.5867014586374365}, "d763d9e5-7158-4df4-b515-bf2b9d94125b": {"messages": [{"id": "d763d9e5-7158-4df4-b515-bf2b9d94125b", "message": "A possible attack by Yemen’s Houthi rebels on Monday targeted a ship farther away from nearly all of the previous assaults they’ve launched in the Gulf of Aden, officials said, potentially part of a widening escalation by the group.\nThe attack was just off to the northeast of Yemen’s Socotra Island, also held by allies of the exiled government.\n“The master of a merchant vessel reports an explosion in close proximity to the vessel,” the UKMTO said.\n“JMIC assesses that the vessel was likely attacked due to perceived Israeli association.”Another MSC-associated vessel, the MSC Orion, was targeted in May in a deep-sea attack claimed by the Houthis.\nOf the more than 60 attacks launched by the Houthis since November that specifically targeted vessels, this would be one of the farthest.", "url": "https://www.theglobeandmail.com/world/article-suspected-yemen-houthi-attack-targets-vessel-in-waters-farther-away/", "date": "2024-06-25 03:15", "source": "GDELT"}, {"id": "ba983d1b-04ed-4e16-9c65-fda6990aadda", "message": "An attack by Yemen's Houthi rebels on Monday targeted a ship farther away from nearly all of the previous assaults they've launched in the Gulf of Aden, potentially part of a widening escalation by the group.\n\"The master of a merchant vessel reports an explosion in close proximity to the vessel,\" the UKMTO said.\nAnother MSC-associated vessel, the MSC Orion, was targeted in May in a deep-sea attack claimed by the Houthis.\nThe attack happened near the outer reaches of the Gulf of Aden where it becomes the Arabian Sea and then ultimately the Indian Ocean.\nOf the more than 60 attacks launched by the Houthis since November that specifically targeted vessels, this would be one of the farthest.", "url": "https://www.voanews.com/a/yemen-houthi-attack-targets-vessel-farther-out-in-gulf-of-aden/7674178.html", "date": "2024-06-26 03:30", "source": "GDELT"}], "location": "The Gulf of Aden.", "total_score": 0.3884291359129203, "count": 1, "average_score": 0.3884291359129203, "final_score": 0.45190039513904423}, "208e9f5b-1ec3-4b96-b98a-996ba33f8ed9": {"messages": [{"id": "208e9f5b-1ec3-4b96-b98a-996ba33f8ed9", "message": "Gaza's civil defense agency said an Israeli air strike early Tuesday killed 10 family members of Hamas's Qatar-based chief Ismail Haniyeh, including his sister.\nThe strike hit the Haniyeh family home in Al-Shati refugee camp, in the northern Gaza Strip, said Mahmud Basal, spokesman for the Hamas-ruled territory's civil defense.\n\"There are 10 martyrs... as a result of the strike, including Zahr Haniyeh, sister of Hamas political bureau chief Ismail Haniyeh,\" Basal told AFP.\nHamas in a statement named the Haniyeh family home as being bombed in a list of \"massacres\" it said were committed by Israel in the Palestinian territory.\nHaniyeh lost three sons and four grandchildren in an Israeli strike in April in central Gaza, with the military accusing them of \"terrorist activities\".", "url": "https://www.naharnet.com:443/stories/en/306127-israeli-strike-kills-10-relatives-of-hamas-chief-haniyeh", "date": "2024-06-25 09:45", "source": "GDELT"}, {"id": "a0400a56-fbe1-4ff4-a555-dfa07dddee5f", "message": "GAZA STRIP: Hamas said an Israeli air strike on Tuesday killed 10 family members of its Qatar-based chief Ismail Haniyeh, who vowed to continue the “resistance” movement against Israel.\nThe strike hit the Haniyeh family home in the Al-Shati refugee camp in the northern Gaza Strip, Hamas and Gaza’s civil defence agency said.\n“There are 10 martyrs […] as a result of the strike, including Zahr Haniyeh, sister of Hamas political bureau chief Ismail Haniyeh,” Mahmud Basal, spokesman for the civil defence, said.\nIn a statement, Hamas named the Haniyeh family home as having been bombed in a list of “massacres” it said were committed by Israel in the Palestinian territory.\nHaniyeh at the time said that about 60 members of his family had been killed since fighting broke out on October 7.", "url": "https://www.dawn.com/news/1842032/israeli-strike-kills-10-relatives-of-hamas-chief", "date": "2024-06-26 04:15", "source": "GDELT"}], "location": "GAZA", "total_score": 0.4577573133475461, "count": 1, "average_score": 0.4577573133475461, "final_score": 0.5004301193432823}, "8511d7d9-1cc5-467c-b38a-e46ccc72210e": {"messages": [{"id": "8511d7d9-1cc5-467c-b38a-e46ccc72210e", "message": "MOSCOW: The Kremlin on Monday directly blamed the United States for an attack on Crimea with US-supplied ATACMS missiles that killed at least four people and injured 151, and Moscow formally warned the US ambassador that retaliation would follow.\nAt least two children were killed in the attack on Sevastopol on Sunday, according to Russian officials.\nRussia said that the United States had supplied the weapons, while US military specialists had aimed the weapons and provided data for them.\nNeither Ukraine nor the United States has commented on the attack.\nThe attack, Russia told Tracy, would “not go unpunished.", "url": "https://www.dawn.com/news/1841793/russia-blames-us-for-missile-attack-on-crimea-vows-reprisal", "date": "2024-06-25 04:00", "source": "GDELT"}, {"id": "b2d183f4-726e-4313-b7a2-f66ad7037029", "message": "The Kremlin on Monday squarely blamed the United States for an attack on Crimea with US-supplied ATACMS missiles that killed at least four people and injured 151, and Moscow formally warned the US ambassador that retaliation would follow.\nBut directly blaming the United States for an attack on Crimea - which Russia unilaterally annexed in 2014 although most of the world considers it part of Ukraine - is a step further.\nRussia said the United States had supplied the weapons, while the US military had aimed them and provided data.\nAfter the United States allowed Ukraine to direct some US weapons into Russia, the Kremlin sent signals that it viewed this as a serious escalation.\n\"Of course, the involvement of the United States in the fighting, as a result of which peaceful Russians are dying, cannot but have consequences,\" Peskov said.", "url": "https://indianexpress.com/article/world/russia-retaliation-against-us-ukraine-strike-crimea-9412946/", "date": "2024-06-25 01:15", "source": "GDELT"}], "location": ")\nThe Kremlin blames US for attack on Crimea, and a battle killed at least four people.", "total_score": 0.5402384965973653, "count": 1, "average_score": 0.5402384965973653, "final_score": 0.5581669476181558}, "f9c9e66c-a573-4c4f-9af5-805af03ed64b": {"messages": [{"id": "f9c9e66c-a573-4c4f-9af5-805af03ed64b", "message": "(AP) — Two Montana inmates were charged with attempted murder Tuesday after allegedly using makeshift weapons to attack corrections officers in a county jail, sending one of the officers to the hospital with stab wounds to the head.\nThe two inmates pleaded not guilty during court appearances via video from the Yellowstone County jail.\nGoes Ahead and Ashtin Glen, both inmates at the Yellowstone County jail, pleaded not guilty to attempted murder after they allegedly attacked officers with makeshift weapons, sending one to the hospital.\nJudge Bradley Kneeland set bond on Tuesday at $1 million for Myron Scott Goes Ahead, 20, and $500,000 for Ashtin Zant Glen, 18.\nGlen was being held on charges including attempted murder.", "url": "https://www.winnipegfreepress.com/world/2024/06/25/2-inmates-charged-with-attempted-murder-after-attack-on-montana-jail-guards", "date": "2024-06-25 18:15", "source": "GDELT"}, {"id": "f464a36e-7cec-426a-abc3-14b0ae3fc2c4", "message": "2 inmates charged with attempted murder after attack on Montana jail guardsMyron Scott Goes Ahead, left, is seen on a video monitor during a court appearance with his public defender, Tuesday, June 25, 2024, in Billings, Mont.\nGoes Ahead and Ashtin Glen, both inmates at the Yellowstone County jail, pleaded not guilty to attempted murder after they allegedly attacked officers with makeshift weapons, sending one to the hospital.\n(AP) — Two Montana inmates were charged with attempted murder Tuesday after allegedly using makeshift weapons to attack corrections officers in a county jail, sending one of the officers to the hospital with stab wounds to the head.\nThe two inmates pleaded not guilty during court appearances via video from the Yellowstone County jail.\nGlen was being held on charges including attempted murder.", "url": "https://infotel.ca/newsitem/us-jail-guards-attacked/cp1758684764", "date": "2024-06-25 18:00", "source": "GDELT"}, {"id": "a1a10c21-bae1-44f8-ac60-003d4f1e3a41", "message": "(AP) — Two Montana inmates were charged with attempted murder Tuesday after allegedly using makeshift weapons to attack corrections officers in a county jail, sending one of the officers to the hospital with stab wounds to the head.\nThe two inmates pleaded not guilty during court appearances via video from the Yellowstone County jail.\nThe two officers were targeted in an unprovoked attack Saturday night, Sheriff Mike Linder said.\nThe attack was captured on security cameras but Linder declined to release the footage.\nGlen was being held on charges including attempted murder.", "url": "https://kstp.com/world/2-inmates-charged-with-attempted-murder-after-attack-on-montana-jail-guards/", "date": "2024-06-26 01:15", "source": "GDELT"}], "location": "BILLINGS, MONTANA", "total_score": 0.905362160294588, "count": 2, "average_score": 0.452681080147294, "final_score": 0.5268767561031058}, "4cc75d6f-ece9-4fc2-8a8d-9bdc59a7836b": {"messages": [{"id": "4cc75d6f-ece9-4fc2-8a8d-9bdc59a7836b", "message": "Elimination of Fadi Al-Wadiya IDF Spokesperson's UnitAn IAF aircraft, directed by IDF intelligence, on Tuesday struck and eliminated the terrorist Fadi Al-Wadiya, who served as a significant operative in the Islamic Jihad terrorist organization.\n\"As part of his role, Fadi Al-Wadiya developed and advanced the terrorist organization's rocket array and was a central figure in the terrorist organization's knowledge of electronics and chemistry,\" the IDF Spokesperson's Unit said.\nOn Monday, IAF aircraft guided by military and Israel Security Agency (Shin Bet) intelligence struck two buildings in Al-Shati and Tuffah in northern Gaza, which served the Hamas terror group.\nThe IDF noted that the buildings are part of a school compound which Hamas used as a shield for its terror activities.\nAs part of the preparations for the strike, a number of steps were taken to reduce harm and risks to those uninvolved, the IDF stressed.", "url": "http://www.israelnationalnews.com/news/392116", "date": "2024-06-25 22:45", "source": "GDELT"}, {"id": "5d0be3a2-cb92-4b0d-9443-08b724955e12", "message": "Pay attention to the following report by the IDF spokesperson last night:\n\nIDF: The IDF eliminated a significant Islamic Jihad terrorist\n\nEarlier today (Tuesday), an IAF aircraft directed by IDF intelligence struck and eliminated the terrorist Fadi Al-Wadiya, who served as a significant operative in the Islamic Jihad terrorist organization.\n\nAs part of his role, Fadi Al-Wadiya developed and advanced the terrorist organization's rocket array and was a central figure in the terrorist organization's knowledge of electronics and chemistry.\n\n##\nThe assassination took place yesterday morning in Gaza City.\n\nNow take a look at the reactions on the Palestinian side about the terrorist Fadi 👇👇👇", "url": "https://abualiexpress.com/en/en29451/", "date": "2024-06-26 06:48", "source": "Telegram"}], "location": "Al-shati and Tuffah in northern Gaza", "total_score": 0.601979916635089, "count": 1, "average_score": 0.601979916635089, "final_score": 0.6013859416445623}, "c8ee5b95-9dd0-4571-9321-640944e63db0": {"messages": [{"id": "c8ee5b95-9dd0-4571-9321-640944e63db0", "message": "US Secretary of State, Antony Blinken, during his meeting with Israeli Defence Minister Yoav Gallant on Monday (local time), underscored the importance of avoiding further escalation of the conflict, as tensions between Israel and Lebanon have further escalated the conflict in the Middle East.\nSecretary Blinken discussed ongoing efforts to achieve a ceasefire in Gaza and also spoke about the efforts to advance security, governance, and reconstruction in Gaza during a post-conflict period.\n\"Secretary of State Antony J. Blinken met with Israeli Defence Minister Yoav Gallant today.\nTensions between Israel and Lebanon have risen sharply since the October 7 Hamas attack on Israel and the ensuing military campaign by Israel in Gaza.\nThe Iran-backed militant group Hezbollah has been firing missiles, mortars and drones into Israel, and Israel has returned that fire, CNN reported.", "url": "https://news.webindia123.com/news/Articles/World/20240625/4208914.html", "date": "2024-06-25 15:15", "source": "GDELT"}, {"id": "45871aab-74cc-4df3-841c-e6a6e4826410", "message": "HomeNewsAntony Blinken Cautions Israel Against Further Escalation Of Conflict With Lebanon, Discusses Gaza CeasefireAntony Blinken Cautions Israel Against Further Escalation Of Conflict With Lebanon, Discusses Gaza CeasefireSecretary Blinken discussed ongoing efforts to achieve a ceasefire in Gaza and also spoke about the efforts to advance security, governance, and reconstruction in Gaza during a post-conflict period.\nSecretary of State Antony J. Blinken met with Israeli Defence Minister Yoav Gallant.\nSecretary Blinken discussed ongoing efforts to achieve a ceasefire in Gaza and also spoke about the efforts to advance security, governance, and reconstruction in Gaza during a post-conflict period.\nTensions between Israel and Lebanon have risen sharply since the October 7 Hamas attack on Israel and the ensuing military campaign by Israel in Gaza.\nThe Iran-backed militant group Hezbollah has been firing missiles, mortars and drones into Israel, and Israel has returned that fire, CNN reported.", "url": "https://www.india.com/news/world/antony-blinken-cautions-israel-against-further-escalation-of-conflict-with-lebanon-discusses-gaza-ceasefire-7037380/", "date": "2024-06-25 03:00", "source": "GDELT"}], "location": "Israel", "total_score": 0.44864864864864873, "count": 1, "average_score": 0.44864864864864873, "final_score": 0.4940540540540541}, "149bfa07-9705-4c73-a3ff-3b0d9fa9aedb": {"messages": [{"id": "149bfa07-9705-4c73-a3ff-3b0d9fa9aedb", "message": "Russia keeps up pressure on the front line as Ukraine gets a boost from Western military aidDONETSK REGION, Ukraine (AP) — Relentless Russian attacks on Ukrainian positions defending the strategically important eastern town of Chasiv Yar are disrupting troop rotations and the delivery of some supplies, soldiers in the area say.\nA six-month delay in U.S. aid threw Ukraine’s military onto the defensive.\nPentagon spokesman Maj. Gen. Pat Ryder said Austin emphasized the importance of maintaining lines of communication amid Russia’s ongoing war against Ukraine.\nLate Tuesday, the Russian Defense Ministry and Ukrainian President Volodymyr Zelenskyy announced that each side had released 90 war prisoners to the other.\n___Follow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine© Copyright The Associated Press.", "url": "https://isp.netscape.com/news/world/story/0001/20240625/73646205f876a1819b07ab5bc0742ad9", "date": "2024-06-25 12:15", "source": "GDELT"}, {"id": "0334d420-1838-46c6-ba86-1b0a8e372060", "message": "Russia keeps up pressure on the front line as Ukraine gets a boost from Western military aidDONETSK REGION, Ukraine (AP) — Relentless Russian attacks on Ukrainian positions defending the strategically important eastern town of Chasiv Yar are disrupting troop rotations and the delivery of some supplies, soldiers in the area say.\nIts monthslong campaign to cripple Ukraine’s electricity supply aims to sap public morale and deny energy to Ukraine’s burgeoning arms industry.\nUkraine is racing to stabilize parts of the about 1,000-kilometer (620-mile) front line after badly needed military assistance was approved by the United States in April.\nA six-month delay in U.S. aid threw Ukraine’s military onto the defensive.\n___Follow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine© Copyright The Associated Press.", "url": "https://isp.netscape.com/news/world/story/0001/20240626/73646205f876a1819b07ab5bc0742ad9", "date": "2024-06-26 05:15", "source": "GDELT"}], "location": "DONETSK REGION", "total_score": 0.43392857142857144, "count": 1, "average_score": 0.43392857142857144, "final_score": 0.48375}, "62b9f205-d7b4-45a9-a36f-86bc4309a6e7": {"messages": [{"id": "62b9f205-d7b4-45a9-a36f-86bc4309a6e7", "message": "Sanaa, June 26 : Yemen's Houthi group has claimed responsibility for launching a missile attack against an \"Israeli\" ship in the Arabian Sea.\n\"The (Houthi) naval forces carried out a qualitative military operation targeting the Israeli ship, MSC SARAH V, in the Arabian Sea, and the hit was accurate and direct,\" Yahya Sarea, the Houthi military spokesman, said in a statement aired on Tuesday by the Houthi-run al-Masirah TV.\nThe Houthi group would \"continue to develop their military capabilities ... to support the Palestinian resistance militarily and to defend Yemen in the face of the American-British aggression,\" he said.\nThe United Kingdom Maritime Trade Operations (UKMTO) reported on Monday that a vessel operating in waters southeast of Yemen's Nishtun port had been attacked.\nSince last November, the Houthi group has been launching ballistic missiles and drones targeting what it said were Israeli-linked ships, to show solidarity with the Palestinians in the Gaza Strip.", "url": "https://www.prokerala.com/news/articles/a1542312.html", "date": "2024-06-26 01:45", "source": "GDELT"}, {"id": "104414dd-cf27-47a9-b189-80172bd25e4e", "message": "(MENAFN- Nam News Network) SANAA, Jun 26 (NNN-SABA) – Yemen's Houthis, yesterday, claimed responsibility for launching a missile attack against an“Israeli” ship in the Arabian Sea.\n“The (Houthi) naval forces carried out a qualitative military operation, targeting the Israeli ship, MSC SARAH V, in the Arabian Sea, and the hit was accurate and direct,” Yahya Sarea, the Houthi military spokesman, said in a statement, aired by the Houthi-run al-Masirah TV.\nThe United Kingdom Maritime Trade Operations (UKMTO) reported on Monday that, a vessel operating in waters south-east of Yemen's Nishtun port had been attacked.\nAccording to the UKMTO statement, the ship's captain reported an explosion in the vicinity of the merchant vessel.\n“The crew is reported safe and the vessel is proceeding to its next port of call,” the UKMTO added.– NNN-SABA", "url": "https://menafn.com/1108373475/Yemens-Houthis-Claim-Attack-OnIsraeli-Ship-In-Arabian-Sea", "date": "2024-06-26 03:15", "source": "GDELT"}], "location": "Arabian Sea", "total_score": 0.5024008080389516, "count": 1, "average_score": 0.5024008080389516, "final_score": 0.5316805656272661}, "3ded726e-96fe-4d25-900e-76f41316818b": {"messages": [{"id": "3ded726e-96fe-4d25-900e-76f41316818b", "message": "(AP Photo)DUBAI, United Arab Emirates (AP) — Suspected attacks by Yemen's Houthi rebels early Wednesday targeted a ship in the Gulf of Aden and the southern Israeli port city of Eilat, authorities said.\nThe ship attack happened off the coast of Aden, the British military's United Kingdom Maritime Trade Operations center said.\nMeanwhile, the Israeli military early Wednesday said a drone “fell off the coast of Eilat.” The military activated air raid sirens in the area.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nLate Tuesday, Houthi military spokesman Brig.", "url": "https://www.yahoo.com/news/suspected-houthi-attacks-target-ship-021037412.html", "date": "2024-06-26 02:45", "source": "GDELT"}, {"id": "dd88dc04-43b3-4212-9dda-0c1094ab85bb", "message": "\"The crew are reported safe and the vessel is proceeding to its next port of call.\n\"The UKMTO did not say if the ship had been damaged.Meanwhile, the Israeli military early Wednesday said a drone \"fell off the coast of Eilat.\"\nThe military activated air raid sirens in the area.The drone \"was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,\" the Israeli military said.\n\"During the incident, an interceptor was launched toward the\" drone.The Houthis have targeted Eilat before with drones and missiles.The Houthis did not immediately claim either attack.\nHowever, many of the ships attacked have little or no connection to the Israel-Hamas war - including those bound for Iran Late Tuesday, Houthi military spokesman Brig.", "url": "https://economictimes.indiatimes.com/news/defence/suspected-houthi-attacks-target-a-ship-in-gulf-of-aden-and-israeli-port-city-of-eilat/articleshow/111271897.cms", "date": "2024-06-26 03:00", "source": "GDELT"}, {"id": "974e46a2-aea5-4601-951b-ccd0d5b52bee", "message": "(AP Photo)DUBAI – Suspected attacks by Yemen's Houthi rebels early Wednesday targeted a ship in the Gulf of Aden and the southern Israeli port city of Eilat, authorities said.\nMeanwhile, the Israeli military early Wednesday said a drone “fell off the coast of Eilat.” The military activated air raid sirens in the area.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nThe Houthis have targeted Eilat before with drones and missiles.\nLate Tuesday, Houthi military spokesman Brig.", "url": "https://www.news4jax.com/news/world/2024/06/26/suspected-houthi-attacks-target-a-ship-in-gulf-of-aden-and-israeli-port-city-of-eilat/", "date": "2024-06-26 03:45", "source": "GDELT"}, {"id": "1741467f-156b-4077-947f-e0e90daa7003", "message": "Suspected Houthi attacks target a ship in Gulf of Aden and Israeli port city of Eilat View PhotoDUBAI, United Arab Emirates (AP) — Suspected attacks by Yemen’s Houthi rebels early Wednesday targeted a ship in the Gulf of Aden and the southern Israeli port city of Eilat, authorities said.\nMeanwhile, the Israeli military early Wednesday said a drone “fell off the coast of Eilat.” The military activated air raid sirens in the area.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nThe Houthis have targeted Eilat before with drones and missiles.\nLate Tuesday, Houthi military spokesman Brig.", "url": "https://www.mymotherlode.com/news/world/3381454/suspected-houthi-attacks-target-a-ship-in-gulf-of-aden-and-israeli-port-city-of-eilat.html", "date": "2024-06-26 04:15", "source": "GDELT"}, {"id": "bd86bf27-191a-41f8-834b-256bbe99964f", "message": "DUBAI – Suspected attacks by Yemen's Houthi rebels early Wednesday targeted a ship in the Gulf of Aden, while a separate attack claimed by Iraqi militants allied with the rebels targeted the southern Israeli port city of Eilat, authorities said.\nThe ship attack happened off the coast of Aden, the British military's United Kingdom Maritime Trade Operations center said.\nThe captain “of a merchant vessel reported a missile impacted the water in close proximity to the vessel,” the UKMTO said.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nThe Houthis did not immediately claim the ship attack.", "url": "https://www.clickorlando.com/news/world/2024/06/26/suspected-houthi-attacks-target-a-ship-in-gulf-of-aden-and-israeli-port-city-of-eilat/", "date": "2024-06-26 02:45", "source": "GDELT"}, {"id": "97c2c298-d186-4921-a62d-81ed265df1c1", "message": "Suspected Houthi attack targets a ship in the Gulf of Aden, while Iraq-claimed attack targets EilatDUBAI, United Arab Emirates (AP) — Suspected attacks by Yemen's Houthi rebels early Wednesday targeted a ship in the Gulf of Aden, while a separate attack claimed by Iraqi militants allied with the rebels targeted the southern Israeli port city of Eilat, authorities said.\nThe ship attack happened off the coast of Aden, the British military's United Kingdom Maritime Trade Operations center said.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nThe Houthis did not immediately claim the ship attack.\nYemen’s exiled government in Aden and other nations criticized the move, saying the Houthis are turning to counterfeiting.", "url": "https://isp.netscape.com/news/world/story/0001/20240626/93db9eb116510da1c108d110d0db42f8", "date": "2024-06-26 05:15", "source": "GDELT"}, {"id": "5760bf2d-043d-448f-9085-06c2c41b61ba", "message": "Suspected attacks by Yemen's Houthi rebels early Wednesday targeted a ship in the Gulf of Aden, while a separate attack claimed by Iraqi militants allied with the rebels targeted the southern Israeli port city of Eilat, authorities said.\nThe ship attack happened off the coast of Aden, the British military's United Kingdom Maritime Trade Operations (UKMTO) center said.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nThe Houthis did not immediately claim the ship attack.\nAlso Read | Yemen’s Houthis conduct ‘operations’ in Indian Ocean, leader saysThe Houthis have maintained that their attacks target ships linked to Israel, the United States or Britain.", "url": "https://indianexpress.com/article/world/suspected-houthi-attack-targets-ship-gulf-of-aden-iraq-eilat-dubai-9415932/", "date": "2024-06-26 08:45", "source": "GDELT"}, {"id": "7bfa44ab-faa9-4570-b4f6-c1dad163de7d", "message": "DUBAI, United Arab Emirates (AP) — Suspected attacks by Yemen’s Houthi rebels early Wednesday targeted a ship in the Gulf of Aden, while a separate attack claimed by Iraqi militants allied with the rebels targeted the southern Israeli port city of Eilat, authorities said.\nThe ship attack happened off the coast of Aden, the British military’s United Kingdom Maritime Trade Operations center said.\nThe captain “of a merchant vessel reported a missile impacted the water in close proximity to the vessel,” the UKMTO said.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nThe Houthis did not immediately claim the ship attack.", "url": "https://www.whec.com/business/suspected-houthi-attack-targets-a-ship-in-the-gulf-of-aden-while-iraq-claimed-attack-targets-eilat/", "date": "2024-06-26 07:45", "source": "GDELT"}, {"id": "9493758c-78f7-4564-9522-0699bd896c27", "message": "DUBAI, United Arab Emirates (AP) — Suspected attacks by Yemen's Houthi rebels early Wednesday targeted a ship in the Gulf of Aden, while a separate attack claimed by Iraqi militants allied with the rebels targeted the southern Israeli port city of Eilat, authorities said.\nThe ship attack happened off the coast of Aden, the British military's United Kingdom Maritime Trade Operations center said.\nThe captain “of a merchant vessel reported a missile impacted the water in close proximity to the vessel,” the UKMTO said.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nThe Houthis did not immediately claim the ship attack.", "url": "https://accesswdun.com/article/2024/6/1249705", "date": "2024-06-26 08:30", "source": "GDELT"}, {"id": "64675128-e6fc-4760-8fc6-4c1d216692f7", "message": "In the early hours of Wednesday, suspected attacks by Yemen's Houthi rebels targeted a ship in the Gulf of Aden and the southern Israeli port city of Eilat, intensifying regional tensions, authorities reported.\nThese assaults follow the recent departure of the USS Dwight D. Eisenhower after a significant eight-month deployment in the area, leading the American response to previous Houthi threats.\nAccording to the British military's UK Maritime Trade Operations center, the ship attack occurred off the coast of Aden.\nSimultaneously, an Israeli military statement detailed a drone incident off the coast of Eilat, triggering air raid sirens.\nThe drone was tracked by Israeli soldiers and intercepted without breaching Israeli territory.", "url": "https://www.devdiscourse.com/article/politics/2995753-houthi-rebel-attacks-ignite-tensions-in-gulf-of-aden-and-eilat", "date": "2024-06-26 05:15", "source": "GDELT"}], "location": "EILAT", "total_score": 4.289362342803431, "count": 9, "average_score": 0.47659581586704786, "final_score": 0.7536170711069335}, "9499c6d9-3cf4-4824-9cb7-dfdf11baec27": {"messages": [{"id": "9499c6d9-3cf4-4824-9cb7-dfdf11baec27", "message": "DUBAI, United Arab Emirates (AP) — Suspected attacks by Yemen's Houthi rebels early Wednesday targeted a ship in the Gulf of Aden and the southern Israeli port city of Eilat, authorities said.\nThe ship attack happened off the coast of Aden, the British military's United Kingdom Maritime Trade Operations center said.\nMeanwhile, the Israeli military early Wednesday said a drone “fell off the coast of Eilat.” The military activated air raid sirens in the area.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nLate Tuesday, Houthi military spokesman Brig.", "url": "https://www.aol.com/suspected-houthi-attacks-target-ship-021037535.html", "date": "2024-06-26 04:00", "source": "GDELT"}, {"id": "80ac0624-c6b9-45a8-96ef-b7629d896800", "message": "Authorities say a suspected attack by Yemen’s Houthi rebels has targeted a ship in the Gulf of AdenDUBAI, United Arab Emirates -- Suspected attacks by Yemen's Houthi rebels early Wednesday targeted a ship in the Gulf of Aden, while a separate attack claimed by Iraqi militants allied with the rebels targeted the southern Israeli port city of Eilat, authorities said.\nThe ship attack happened off the coast of Aden, the British military's United Kingdom Maritime Trade Operations center said.\nThe captain “of a merchant vessel reported a missile impacted the water in close proximity to the vessel,” the UKMTO said.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nThe Houthis did not immediately claim the ship attack.", "url": "https://abcnews.go.com/International/wireStory/suspected-houthi-attacks-target-ship-gulf-aden-israeli-111426947", "date": "2024-06-26 04:00", "source": "GDELT"}, {"id": "61007db7-04d3-466e-b3f2-ad7c0164ab8e", "message": "DUBAI – Suspected attacks by Yemen's Houthi rebels early Wednesday targeted a ship in the Gulf of Aden, while a separate attack claimed by Iraqi militants allied with the rebels targeted the southern Israeli port city of Eilat, authorities said.\nThe ship attack happened off the coast of Aden, the British military's United Kingdom Maritime Trade Operations center said.\nThe captain “of a merchant vessel reported a missile impacted the water in close proximity to the vessel,” the UKMTO said.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nThe Houthis did not immediately claim the ship attack.", "url": "https://www.wsls.com/news/world/2024/06/26/suspected-houthi-attacks-target-a-ship-in-gulf-of-aden-and-israeli-port-city-of-eilat/", "date": "2024-06-26 04:45", "source": "GDELT"}, {"id": "9f7caaf5-a402-4eb4-8780-fb5a366c3b42", "message": "DUBAI, United Arab Emirates (AP) — Suspected attacks by Yemen's Houthi rebels early Wednesday targeted a ship in the Gulf of Aden, while a separate attack claimed by Iraqi militants allied with the rebels targeted the southern Israeli port city of Eilat, authorities said.\nThe ship attack happened off the coast of Aden, the British military's United Kingdom Maritime Trade Operations center said.\nThe captain “of a merchant vessel reported a missile impacted the water in close proximity to the vessel,” the UKMTO said.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nThe Houthis did not immediately claim the ship attack.", "url": "https://www.wral.com/story/suspected-houthi-attacks-target-a-ship-in-gulf-of-aden-and-israeli-port-city-of-eilat/21498200/", "date": "2024-06-26 07:00", "source": "GDELT"}], "location": "Aden", "total_score": 1.2821979681302484, "count": 3, "average_score": 0.4273993227100828, "final_score": 0.539179525897058}, "41c6cc07-2a65-459f-abbc-d5da35d132e5": {"messages": [{"id": "41c6cc07-2a65-459f-abbc-d5da35d132e5", "message": "DUBAI, United Arab Emirates (AP) — Suspected attacks by Yemen’s Houthi rebels early Wednesday targeted a ship in the Gulf of Aden and the southern Israeli port city of Eilat, authorities said.\nThe ship attack happened off the coast of Aden, the British military’s United Kingdom Maritime Trade Operations center said.\nMeanwhile, the Israeli military early Wednesday said a drone “fell off the coast of Eilat.” The military activated air raid sirens in the area.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nLate Tuesday, Houthi military spokesman Brig.", "url": "https://apnews.com/article/yemen-houthi-rebels-attacks-israel-hamas-war-93db9eb116510da1c108d110d0db42f8", "date": "2024-06-26 03:30", "source": "GDELT"}, {"id": "98cc2f7a-6a65-4a74-8770-48b579a05bb8", "message": "Authorities say a suspected attack by Yemen’s Houthi rebels has targeted a ship in the Gulf of AdenDUBAI, United Arab Emirates -- Suspected attacks by Yemen's Houthi rebels early Wednesday targeted a ship in the Gulf of Aden, while a separate attack claimed by Iraqi militants allied with the rebels targeted the southern Israeli port city of Eilat, authorities said.\nThe ship attack happened off the coast of Aden, the British military's United Kingdom Maritime Trade Operations center said.\nThe captain “of a merchant vessel reported a missile impacted the water in close proximity to the vessel,” the UKMTO said.\nThe drone “was monitored by (Israeli) soldiers throughout the incident and it did not cross into Israeli territory,” the Israeli military said.\nThe Houthis did not immediately claim the ship attack.", "url": "https://abcnews.go.com/Business/wireStory/suspected-houthi-attacks-target-ship-gulf-aden-israeli-111426949", "date": "2024-06-26 08:00", "source": "GDELT"}], "location": ".\nGulf of Aden", "total_score": 0.46869639794168094, "count": 1, "average_score": 0.46869639794168094, "final_score": 0.5080874785591767}, "81568b01-6589-40d2-8c4d-1b2fd4566b14": {"messages": [{"id": "81568b01-6589-40d2-8c4d-1b2fd4566b14", "message": "A news program broadcasts a file image of a missile launch by North Korea, at Seoul Railway Station in Seoul, South Korea, Wednesday, June 26, 2024.\n(AP Photo/Ahn Young-joon)SEOUL – A suspected hypersonic missile launched by North Korea exploded in flight on Wednesday, South Korea's military said, a development that comes as North Korea is protesting the regional deployment of a U.S. aircraft carrier for a trilateral military drill with South Korea and Japan.\nSince 2021, North Korea has performed a series of hypersonic missile tests in an apparent bid to penetrate its rivals' missile defense shields.\nSouth Korea said Tuesday night that North Korea floated huge balloons carrying trash across the border for a second consecutive day.\nSouth Korean media reported Wednesday that about 100 North Korean balloons with bags of waste papers eventually fell on South Korean territory.", "url": "https://www.news4jax.com/news/world/2024/06/25/north-korea-fires-a-ballistic-missile-toward-sea-south-korea-says/", "date": "2024-06-26 00:15", "source": "GDELT"}, {"id": "6fb37c93-50ce-46d0-a06d-08a929aafb5b", "message": "SEOUL, South Korea — A suspected hypersonic missile launched by North Korea exploded in flight on Wednesday, South Korea’s military said, a development that comes as North Korea is protesting the regional deployment of a U.S. aircraft carrier for a trilateral military drill with South Korea and Japan.\nSouth Korea said that North Korea floated huge balloons carrying trash across the border Tuesday night in its sixth such campaign since late May.\nAbout 100 North Korean balloons with bags of paper waste reportedly fell on South Korean territory.\nNorth Korea calls its balloon launches a tit-for-tat response to South Korean activists flying political leaflets via their own balloons.\nThe USS Theodore Roosevelt arrived in South Korea on Saturday and South Korean President Yoon Suk Yeol boarded the aircraft carrier on Tuesday, the first sitting South Korean president to board a U.S. aircraft carrier since 1994.", "url": "https://www.nbcnews.com/news/world/north-korea-latest-missile-test-appears-failed-rcna158967", "date": "2024-06-26 04:15", "source": "GDELT"}, {"id": "4a20fb0a-5834-47ab-9118-d0727ba9169b", "message": "Suspected North Korean hypersonic missile exploded in flight, South Korea saysA North Korean soldier stands at the North's military guard post as a North Korean flag flutters in the wind, seen from Paju, South Korea, Wednesday, June 26, 2024.\nA suspected hypersonic missile launched by North Korea exploded in flight on Wednesday, South Korea's military said, a development that comes as North Korea is protesting the regional deployment of a U.S. aircraft carrier for a trilateral military drill with South Korea and Japan.\n(AP Photo/Lee Jin-man)Original Publication Date June 25, 2024 - 2:06 PMSEOUL, South Korea (AP) — A suspected hypersonic missile launched by North Korea exploded in flight on Wednesday, South Korea’s military said, as North Korea protests the regional deployment of a U.S. aircraft carrier for a military drill with South Korea and Japan.\nSouth Korea said North Korea launched large balloons carrying trash across their border Tuesday night for the sixth time since late May.\nNorth Korea says it is responding to balloons launched by South Korean activists that carried political leaflets into the North.", "url": "https://infotel.ca/newsitem/as-koreas-tensions/cp1225257041", "date": "2024-06-26 05:15", "source": "GDELT"}, {"id": "9fe63e7d-2af3-42eb-87ab-c56722a1a5b7", "message": "Suspected North Korean hypersonic missile exploded in flight, South Korea saysSEOUL, South Korea (AP) — A suspected hypersonic missile launched by North Korea exploded in flight on Wednesday, South Korea’s military said, as North Korea protests the regional deployment of a U.S. aircraft carrier for a military drill with South Korea and Japan.\nOn Wednesday night, South Korea said that North Korea was flying large balloons likely carrying trash across the border for a third consecutive day.\nNorth Korea says it is responding to balloons launched by South Korean activists that carried political leaflets into the North.\nAlso Wednesday, South Korea and the U.S. flew 30 advanced fighter jets as part of joint drills this week.\nSouth Korean President Yoon Suk Yeol visited the vessel on Tuesday, becoming the first sitting South Korean president to board a U.S. aircraft carrier since 1994.", "url": "https://isp.netscape.com/news/world/story/0001/20240626/2e5e567b5e556fa89093334501798712", "date": "2024-06-26 05:15", "source": "GDELT"}], "location": "Seoul, South Korea", "total_score": 1.8185012996353302, "count": 3, "average_score": 0.6061670998784434, "final_score": 0.6643169699149104}, "9e1f9cbe-840b-49f2-b1ce-cc84c1123101": {"messages": [{"id": "9e1f9cbe-840b-49f2-b1ce-cc84c1123101", "message": "The allegations provide a window into the scale and force of this Israeli operation to free hostages taken during the attack on Israel last October.\nThe UN human rights office (OHCHR) warned that Israeli forces and Palestinian armed groups may have committed war crimes through their actions.\nRasha told CNN the raid “felt like an earthquake,” adding that soldiers confiscated their cell phones.\n“I called the ambulance, but they said they cannot come because the area is dangerous,” Mohammad told CNN.\nPalestinian men and boys delicately cover dead bodies with blankets, trying to give dignity to those killed in the Israeli operation.", "url": "https://krdo.com/news/national-world/cnn-world/2024/06/25/this-is-the-blood-of-my-son-while-israel-hailed-rescue-of-four-hostages-palestinians-recall-the-horrors/", "date": "2024-06-26 08:00", "source": "GDELT"}, {"id": "35343ce1-3c95-4505-b29f-8e30974369aa", "message": "Courtesy Rasha Abdel MiqdadThe allegations provide a window into the scale and force of this Israeli operation to free hostages taken during the attack on Israel last October.\nThe UN human rights office (OHCHR) warned that Israeli forces and Palestinian armed groups may have committed war crimes through their actions.\nCNNMohammad told CNN that before the Israeli forces withdrew, they threatened to shoot his relatives, after which he heard gunshots.\nPalestinian men and boys delicately cover dead bodies with blankets, trying to give dignity to those killed in the Israeli operation.\nPalestinians inspect the damage a day after Israeli forces launched an operation to rescue four hostages, in Nuseirat, central Gaza, on June 9.", "url": "https://edition.cnn.com/2024/06/26/middleeast/israel-gaza-rescue-operation-palestinian-family-intl-cmd/", "date": "2024-06-26 14:00", "source": "GDELT"}], "location": "Gaza City", "total_score": 0.4532206353832702, "count": 1, "average_score": 0.4532206353832702, "final_score": 0.49725444476828917}}