{"d8e4c6f0-5b0e-42f6-8960-a0ec05e72204": {"messages": [{"id": "d8e4c6f0-5b0e-42f6-8960-a0ec05e72204", "message": "An Israeli airstrike recently resulted in the deaths of a Hezbollah fighter and his sister in southern Lebanon, as reported by the National News Agency (NNA) and confirmed by Hezbollah.\nFollowing this, Hezbollah retaliated by launching rockets towards northern Israel.\nThe Israeli military disclosed that its targets on Monday were an arms depot and a military installation used by Hezbollah, the Iran-supported group.\nAccording to the NNA, the strike in the town of Bint Jbeil killed a brother and sister from the Dagher family and severely injured another sister when their home was hit twice and destroyed.\nLater, Hezbollah acknowledged the loss of one of its fighters from the Dagher family in these strikes.", "url": "https://dailystar.com.lb/israel-strike-bint-jbeil-kills-hezbollah-fighter-sister/", "date": "2024-07-16 15:30", "source": "GDELT"}, {"id": "852279fd-bc9c-49e4-830e-4f5863236ca5", "message": "An Israeli air strike killed a Hezbollah fighter and his sister in south Lebanon, the National News Agency (NNA) and the Islamist movement said.\nLater, Hezbollah said it fired rockets at northern Israel in response.\nIsrael's military said it had targeted an arms depot and a military installation belonging to... read full story\"The Israeli enemy committed a massacre of civilians in the town of Bint Jbeil, with one brother and a sister killed,\"", "url": "https://article.wn.com/view/2024/07/16/Hezbollah_say_Israel_strike_kills_two_in_Lebanon/", "date": "2024-07-16 01:00", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.6319684528954193, "count": 1, "average_score": 0.6319684528954193, "final_score": 0.6223779170267935}, "28622db2-62ba-4f94-a4a0-14714a95ac77": {"messages": [{"id": "28622db2-62ba-4f94-a4a0-14714a95ac77", "message": "(MENAFN- Nam News Network) GAZA, Jul 16 (NNN-WAFA) – At least nine more Palestinian civilians were killed, in an Israeli targeting the Nuseirat refugee camp, in the central Gaza Strip, Palestinian sources said, yesterday.\nThe Israeli airstrike targeted a home with a missile, destroying it and causing damage to neighbouring houses, security sources, said.\nThe airstrike killed nine people and several others, all transported to the hospital, medical sources said.\nMeanwhile, the al-Qassam Brigades announced that, some Zionist soldiers were killed and injured, due to the explosion of a leftover missile in two tanks, in the Tel Al-Hawa neighbourhood, in western Gaza City.\nThey must never be used for military or fighting purposes,” UNRWA Commissioner-General, Philippe Lazzarini, said on social media platform X.– NNN-WAFA", "url": "https://menafn.com/1108442554/Nine-More-Palestinian-Civilians-Killed-In-Israeli-Airstrike-On-Central-Gaza", "date": "2024-07-16 02:15", "source": "GDELT"}, {"id": "36f47d57-69da-4a6c-8207-020ceb327a5c", "message": "Gaza, July 16 (UNI) At least nine Palestinians were killed in an Israeli airstrike targeting the Nuseirat refugee camp in the central Gaza Strip, Palestinian sources said Monday.\nThe Israeli airstrike targeted a home with a missile, destroying it and causing damage to neighboring houses, security sources told Xinhua.\nThe airstrike killed nine people and injured several others, all transported to the hospital, medical sources told Xinhua.\nThere was no immediate comment from the Israeli army on this incident.\nMeanwhile, al-Qassam Brigades, the armed wing of Hamas, announced that some Israeli soldiers were killed and injured due to the explosion of a leftover missile in two tanks in the Tel Al-Hawa neighborhood in western Gaza City.", "url": "https://www.centralchronicle.com/9-palestinians-killed-in-israeli-airstrike-on-central-gaza/", "date": "2024-07-16 04:30", "source": "GDELT"}], "location": "GAZA", "total_score": 0.4706060606060606, "count": 1, "average_score": 0.4706060606060606, "final_score": 0.5094242424242424}, "9a74f064-db2a-43ed-a59e-0044ca16de30": {"messages": [{"id": "9a74f064-db2a-43ed-a59e-0044ca16de30", "message": "GAZA: Israeli forces battled Hamas-led fighters in several parts of the Gaza Strip on Tuesday (Jul 16), and Palestinian health officials said at least 50 people were killed in Israeli bombardments of southern and central areas.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house, the Gaza health officials said.\nAn Israeli airstrike killed four in Sheikh Zayed in northern Gaza, they said.\nHours later, an Israeli air strike on a school in the Nuseirat camp killed 16 people and wounded many others, health officials said.\nThe Israeli military said troops continued \"intelligence-based\" activities in Rafah, and that airstrikes had targeted militants, tunnels, and other Hamas military infrastructure.", "url": "https://www.channelnewsasia.com/world/israeli-strikes-across-gaza-kill-least-50-palestinian-health-officials-say-4482826", "date": "2024-07-16 15:45", "source": "GDELT"}, {"id": "0aa8b4d7-1957-4156-a188-cd34efb55560", "message": "Israeli strikes across Gaza kill at least 57, Palestinian health officials say5 minutesBy Nidal al-Mughrabi and Hatem KhaledCAIRO/GAZA (Reuters) – Israeli forces battled Hamas-led fighters in several parts of the Gaza Strip on Tuesday, and Palestinian health officials said at least 57 people were killed in Israeli bombardments of southern and central areas.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house, Gaza health officials said.\nThe Israeli military said the strike targeted a senior militant of the Islamic Jihad group, an ally of Hamas.\nAt least 38,713 Palestinians have been killed in Israel’s retaliatory offensive since then, Gaza health authorities said in their latest update on Tuesday.\nThat attack killed more than 90 people in the Khan Younis area, according to Gaza health authorities.", "url": "https://www.swissinfo.ch/eng/israeli-strikes-across-gaza-kill-at-least-57%2c-palestinian-health-officials-say/83950363", "date": "2024-07-16 15:45", "source": "GDELT"}, {"id": "b25ef6c1-6b94-4218-959f-c6673bfb15cc", "message": "Palestinian health officials said at least 57 people were killed in Israeli bombardments of southern and central areas.\nLater on Tuesday, an Israeli airstrike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, the officials said.\nAn Israeli airstrike also killed four in Sheikh Zayed in northern Gaza, they said.\nAt least 38,713 Palestinians have been killed in Israel's retaliatory offensive since then, Gaza health authorities said in their latest update on Tuesday.\nThat attack killed more than 90 people in the Khan Younis area, according to Gaza health authorities.", "url": "https://tribune.com.pk/story/2480352/at-least-57-killed-in-airstrikes-as-israel-steps-up-attacks-in-gaza", "date": "2024-07-16 23:00", "source": "GDELT"}, {"id": "64015784-0340-48ad-99c1-51353115b6e5", "message": "GAZA: Israeli strikes hit several parts of the Gaza Strip on Tuesday, and Palestinian health officials said at least 57 people were killed in Israeli bombardments of southern and central areas.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house, Gaza health officials said.\nIn the historic Nuseirat camp in central Gaza, at least four Palestinians were killed in separate shelling and aerial strikes in central Gaza, medics said.\nAn Israeli airstrike killed four in Sheikh Zayed in northern Gaza, they said.\nRelatives visited Al Aqsa Hospital in Deir Al Balah in central Gaza to say farewell to relatives before funerals.", "url": "https://www.omanobserver.om/article/1156427/world/region/israeli-strikes-across-gaza-kill-at-least-57", "date": "2024-07-16 19:45", "source": "GDELT"}, {"id": "6799d5db-072e-4d97-8c33-64d92d916c81", "message": "Talks pausedCAIRO: Israeli forces battled Hamas-led fighters in several areas across Gaza on Tuesday, while Palestinian health officials said at least 13 people were killed in Israeli bombardments in southern and central areas of the enclave.In Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an air strike on a house, while in nearby Khan Younis, a man, his wife and two children were killed, they said.In central Gaza in Nuseirat, one of the enclave's eight historic refugee camps, at least four Palestinians were killed in separate shelling and aerial strikes, medics said.\nIsraeli tanks bombed the southern sector of Gaza City earlier on Tuesday, residents said.The Israeli military said troops continued \"intelligence-based\" activities in Rafah, killing many Palestinian gunmen over the past 24 hours.\nThe attack in the Khan Younis area killed more than 90 people and wounded hundreds of others, health authorities in Gaza said.A Palestinian official close to the talks told Reuters on Tuesday that Hamas was keen not to be seen as halting the talks despite the stepped-up Israeli attacks.\n\"Hamas wants the war to end, not at any price.\nThe effort would need 100+ trucks and cost over $500 million.", "url": "https://timesofindia.indiatimes.com/world/middle-east/israeli-strikes-across-gaza-kill-at-least-13-people-palestinian-health-officials-say/articleshow/111780270.cms", "date": "2024-07-16 14:15", "source": "GDELT"}, {"id": "56736a41-966f-4e4d-88f1-4e8d79576117", "message": "CAIRO (Reuters) - Israeli forces battled Hamas-led fighters in several areas across Gaza on Tuesday, while Palestinian health officials said at least 13 people were killed in Israeli bombardments in southern and central areas of the enclave.\nIn central Gaza in Nuseirat, one of the enclave's eight historic refugee camps, at least four Palestinians were killed in separate shelling and aerial strikes, medics said.\nIsraeli tanks bombed the southern sector of Gaza City earlier on Tuesday, residents said.\nThe Israeli military said troops continued \"intelligence-based\" activities in Rafah, killing many Palestinian gunmen over the past 24 hours.\nIt said air strikes had targeted militants, tunnels, and other Hamas military infrastructure.", "url": "https://www.marketscreener.com/quote/currency/EURO-ISRAELI-NEW-SHEKEL-E-60037304/news/Israeli-strikes-across-Gaza-kill-at-least-13-people-Palestinian-health-officials-say-47389561/", "date": "2024-07-16 09:45", "source": "GDELT"}, {"id": "d5346dac-fcbc-489b-a419-dca9576962ab", "message": "An Israeli air strike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, officials said.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an air strike on a house, Gaza health officials said.\nAn Israeli air strike killed four in Sheikh Zayed in northern Gaza, they said.\nAt least 38,713 Palestinians have been killed in Israel’s retaliatory offensive since then, Gaza health authorities said in their latest update on Tuesday.\nThe attack killed more than 90 people in the Khan Younis area, according to Gaza health authorities.", "url": "https://www.irishtimes.com/world/middle-east/2024/07/16/israel-hamas-latest/", "date": "2024-07-16 07:45", "source": "GDELT"}, {"id": "d110d5fa-b4c5-4ff9-a7db-a49564726d22", "message": "(MENAFN- Gulf Times) Palestinian officials said at least 57 people were killed yesterday in Israeli bombardments of southern and central areas of the Gaza Strip.\nIn nearby Khan Younis, a man, his wife, and two children were killed.\nLater yesterday, an Israeli airstrike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, the officials said.\nHours later, an Israeli air strike on a UN-run school that housed displaced families in the Nuseirat camp killed 23 people and wounded many others, health officials said.\nThere are no more safe agency schools, or safe clinics, no more safe houses, no safe streets.", "url": "https://menafn.com/1108447524/57-More-Gazans-Perish-In-Israeli-Genocide-UN-Run-School-Hit-Again", "date": "2024-07-17 03:30", "source": "GDELT"}, {"id": "dce81c32-e005-4a6f-890f-7bf21f8092c4", "message": "Israeli forces battled Hamas-led fighters in several parts of the Gaza Strip on Tuesday, and Palestinian health officials said at least 57 people were killed in Israeli bombardments of southern and central areas.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house, Gaza health officials said.\nLater on Tuesday, an Israeli airstrike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, the officials said.\nAt least 38,713 Palestinians have been killed in Israel's retaliatory offensive since then, Gaza health authorities said in their latest update on Tuesday.\nThat attack killed more than 90 people in the Khan Younis area, according to Gaza health authorities.", "url": "https://www.koreatimes.co.kr:443/www/world/2024/07/501_378809.html", "date": "2024-07-17 05:00", "source": "GDELT"}, {"id": "71d428a7-2f82-4f02-9576-5195d4eb791d", "message": "The Gaza health ministry said an Israeli strike on a fuel station in Al-Mawasi in southern Gaza killed 17 people and wounded at least 26.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house, Gaza health officials said.\nHours earlier, US Secretary of State Antony Blinken told two senior Israeli officials of Washington’s “serious concern” following the deadly Israeli strikes in Gaza, his spokesman said.\nThe Israeli strikes have forced 90 per cent of Gaza’s 2.4 million people to flee homes.\nMany have sought refuge in UN-run schools, seven of which have been hit by Israeli strikes since July 6.", "url": "https://www.dawn.com/news/1846250/over-50-more-gazans-killed-in-israeli-strikes", "date": "2024-07-17 06:00", "source": "GDELT"}], "location": "GAZA STRIP", "total_score": 5.001841778116444, "count": 9, "average_score": 0.5557601975684938, "final_score": 0.8090321382979456}, "ce5688a3-e784-438a-a7cb-bd5171cb3067": {"messages": [{"id": "ce5688a3-e784-438a-a7cb-bd5171cb3067", "message": "Israeli strikes in Gaza have since killed 38,713 Palestinians and injured another 89,166, according to the Ministry of Health there.\nOn Sunday, the Israeli military claimed to have targeted Hamas’ military chief and killed a Hamas brigade commander in an airstrike in Khan Younis.\nThe Israeli military claimed its air force struck the location where “a number of terrorists” were operating.\nPalestinians and UN workers examine the destroyed UNRWA school in Nuseirat refugee camp of Deir al-Balah, Gaza on July 15, 2024.\nThe Israeli military is verifying whether he was killed while Netanyahu acknowledged it is uncertain whether he died.", "url": "https://edition.cnn.com/2024/07/16/middleeast/gaza-israel-strikes-weekend-devastation-intl-hnk/", "date": "2024-07-16 09:45", "source": "GDELT"}, {"id": "3e0e162c-6bdf-4d50-b643-5d390ce6c31a", "message": "“Young children were sitting here safely, each one sitting in his mother or father’s lap,” one eyewitness in Nuseirat, central Gaza, told CNN.\nIsraeli strikes in Gaza have since killed 38,713 Palestinians and injured another 89,166, according to the Ministry of Health there.\nOn Sunday, the Israeli military claimed to have targeted Hamas’ military chief and killed a Hamas brigade commander in an airstrike in Khan Younis.\nThe Israeli military claimed its air force struck the location where “a number of terrorists” were operating.\nFresh pressure on negotiationsThe latest Israeli strikes have put new pressure on the success of ongoing ceasefire and hostage negotiations, which hit yet another roadblock last week.", "url": "https://ktvz.com/news/national-world/cnn-world/2024/07/16/gazans-endure-deadly-weekend-of-israeli-strikes-as-un-chief-laments-incomprehensible-and-inexcusable-destruction/", "date": "2024-07-16 12:30", "source": "GDELT"}], "location": "GAZA", "total_score": 0.49539458391445845, "count": 1, "average_score": 0.49539458391445845, "final_score": 0.5267762087401209}, "cce1c187-3792-4371-8f2e-219b8afd6928": {"messages": [{"id": "cce1c187-3792-4371-8f2e-219b8afd6928", "message": "Israeli strikes in Gaza have since killed 38,713 Palestinians and injured another 89,166, according to the Ministry of Health there.\nOn Sunday, the Israeli military claimed to have targeted Hamas’ military chief and killed a Hamas brigade commander in an airstrike in Khan Younis.\nThe Israeli military claimed its air force struck the location where “a number of terrorists” were operating.\nPalestinians and UN workers examine the destroyed UNRWA school in Nuseirat refugee camp of Deir al-Balah, Gaza on July 15, 2024.\nThe Israeli military is verifying whether he was killed while Netanyahu acknowledged it is uncertain whether he died.", "url": "https://www.cnn.com/2024/07/16/middleeast/gaza-israel-strikes-weekend-devastation-intl-hnk/", "date": "2024-07-16 08:45", "source": "GDELT"}, {"id": "a4cc7b11-6f62-4028-a237-d676064c73e5", "message": "“Young children were sitting here safely, each one sitting in his mother or father’s lap,” one eyewitness in Nuseirat, central Gaza, told CNN.\nIsraeli strikes in Gaza have since killed 38,713 Palestinians and injured another 89,166, according to the Ministry of Health there.\nOn Sunday, the Israeli military claimed to have targeted Hamas’ military chief and killed a Hamas brigade commander in an airstrike in Khan Younis.\nThe Israeli military claimed its air force struck the location where “a number of terrorists” were operating.\nFresh pressure on negotiationsThe latest Israeli strikes have put new pressure on the success of ongoing ceasefire and hostage negotiations, which hit yet another roadblock last week.", "url": "https://keyt.com/news/national-world/cnn-world/2024/07/16/gazans-endure-deadly-weekend-of-israeli-strikes-as-un-chief-laments-incomprehensible-and-inexcusable-destruction/", "date": "2024-07-16 09:15", "source": "GDELT"}], "location": "Gaza", "total_score": 0.49539458391445845, "count": 1, "average_score": 0.49539458391445845, "final_score": 0.5267762087401209}, "eac605dd-0389-4edd-b1d4-99e627e07fd4": {"messages": [{"id": "eac605dd-0389-4edd-b1d4-99e627e07fd4", "message": "BEIRUT: Lebanese official media said separate Israeli strikes Tuesday on south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation for one of the raids.\n“Three Syrian children” were killed “in an enemy raid that targeted farmland in the village of Umm Toot”, the National News Agency (NNA) said.\nIt also said an “enemy” drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched “dozens of Katyusha rockets” at northern Israel’s Kiryat Shmona “in response to the Israeli enemy attacks” on south Lebanon, “particularly Kfar Tebnit and “the death of two civilians”.\nOn the Israeli side, 17 soldiers and 13 civilians have been killed, according to the authorities.", "url": "https://www.brecorder.com/news/40313132/lebanon-media-says-3-children-among-5-dead-in-israeli-strikes", "date": "2024-07-16 20:00", "source": "GDELT"}, {"id": "66ab5679-46da-464b-9646-3cb29bcd6eb7", "message": "Smoke bilows following an Israeli strike in the village of Kfar Kila in southern Lebanon on July 16, 2024 (Rabih DAHER)Lebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\nIt also said an \"enemy\" drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of \"Katyusha rockets\" at northern Israel in response to the Israeli strikes.\nThe Israeli military said 40 projectiles fired from Lebanon were initially identified Tuesday, followed by a further 10 later in the day.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a \"terrorist cell\" in the Yarin area, which is close to Umm Toot.", "url": "https://www.yahoo.com/news/lebanon-media-says-3-children-014250642.html", "date": "2024-07-17 02:30", "source": "GDELT"}, {"id": "2f77fa81-a2a2-47f8-904e-dc2543d13783", "message": "Smoke bilows following an Israeli strike in the village of Kfar Kila in southern Lebanon on July 16, 2024 - Copyright AFP Rabih DAHERLebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\nIt also said an “enemy” drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of “Katyusha rockets” at northern Israel in response to the Israeli strikes.\nThe Israeli military said 40 projectiles fired from Lebanon were initially identified Tuesday, followed by a further 10 later in the day.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a “terrorist cell” in the Yarin area, which is close to Umm Toot.", "url": "https://www.digitaljournal.com/world/lebanon-media-says-3-children-among-5-dead-in-israeli-strikes/article", "date": "2024-07-17 02:30", "source": "GDELT"}, {"id": "8aab89ec-2d27-4311-85d0-67d1636f88f4", "message": "July 16, 2024 — Beirut (Lebanon) (AFP)Lebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\n\"Three Syrian children\" were killed \"in an enemy raid that targeted farmland in the village of Umm Toot\", the National News Agency (NNA) said.\nIt also said an \"enemy\" drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of \"Katyusha rockets\" at northern Israel in response to the Israeli strikes.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a \"terrorist cell\" in the Yarin area, which is close to Umm Toot.", "url": "https://www.al-monitor.com/originals/2024/07/lebanon-media-says-3-children-among-5-dead-israeli-strikes", "date": "2024-07-17 03:30", "source": "GDELT"}], "location": "south Lebanon", "total_score": 1.6513061879208457, "count": 3, "average_score": 0.5504353959736152, "final_score": 0.6253047771815307}, "b9f47f9c-e250-4e97-a3fb-502108c46a95": {"messages": [{"id": "b9f47f9c-e250-4e97-a3fb-502108c46a95", "message": "The Israeli military said it targeted two \"masterminds\" of the October 7 attacks by Hamas that triggered the war.\nIt said a top commander, Rafa Salama, was killed in the strike, but uncertainty remains over Hamas military chief Mohammed Deif.\nThe White House has repeatedly voiced frustration over the civilian death toll in Gaza as Israel attempts to eradicate Hamas.\nWhen contacted by AFP regarding the weapons used, the Israeli military declined to comment.\nIt said US-supplied weapons used by Israel included GPS-guided bombs, dumb bombs, bunker busters and JDAMs.", "url": "https://www.yahoo.com/news/know-bomb-israel-used-gaza-070617102.html", "date": "2024-07-16 07:45", "source": "GDELT"}, {"id": "7d085a39-5914-4120-b7c6-1e5558f2d033", "message": "It said a top commander, Rafa Salama, was killed in the strike, but uncertainty remains over Hamas military chief Mohammed Deif.\nThe White House has repeatedly voiced frustration over the civilian death toll in Gaza as Israel attempts to eradicate Hamas.\nWhen contacted by AFP regarding the weapons used, the Israeli military declined to comment.\n“My assessment is that any civilians killed in this strike were in the compound -— not in the surrounding vicinity.\nIt said US-supplied weapons used by Israel included GPS-guided bombs, dumb bombs, bunker busters and JDAMs.", "url": "https://punchng.com/what-we-know-about-bomb-israel-used-on-gaza-safe-zone-weapon-experts/", "date": "2024-07-16 14:00", "source": "GDELT"}], "location": "GAZA", "total_score": 0.35595999344154783, "count": 1, "average_score": 0.35595999344154783, "final_score": 0.42917199540908346}, "d086dfc1-307e-4cd7-8d50-d91790f63517": {"messages": [{"id": "d086dfc1-307e-4cd7-8d50-d91790f63517", "message": "Liberia-flagged tanker Chios Lion turned around after being attacked by Yemen's Houthis on Monday to assess damage and investigate a potential oil spillage, the Red Sea and Gulf of Aden Joint Maritime Information Center said on Tuesday.\nAn unmanned watercraft inflicted minor damage to Chios Lion's port side on Monday as part of a swarm of attacks by the Houthis on the vessel and another ship sailing around 100 nautical miles northwest of Yemen’s port city of Hodeidah.\n\"While originally headed south, following the attack the vessel turned around and back north out of the threat area to further assess damage and investigate potential oil spillage,\" the JMIC said in a statement.\nIt added that the captain and crew were safe.\nYemen's Houthis said they targeted Chios Lion and Bentley I with ballistic missiles, drones and booby-trapped boats in response to the deadly Israeli airstrike on the southern Gaza Strip city of Khan Younis on Saturday.", "url": "https://www.jpost.com/breaking-news/article-810570", "date": "2024-07-16 18:00", "source": "GDELT"}, {"id": "a85d422d-a44b-4d39-89ee-d3fadc61571f", "message": "The Liberia-flagged oil tanker Chios Lion is assessing damage and investigating a potential oil spill after being attacked by Yemen's Houthis in the Red Sea, according to the Red Sea and Gulf of Aden Joint Maritime Information Center (JMIC) on Tuesday.\nInitially heading south, the vessel turned north after the attack to assess damage and investigate potential oil spillage, JMIC said.\nThe captain and crew were reported safe, though the manager of Chios Lion did not comment.\nYemen's Houthis claimed responsibility, targeting Chios Lion and Bentley I with missiles, drones, and booby-trapped boats in response to an Israeli airstrike in the Gaza Strip.\nThese Houthi attacks since November have forced ships to reroute, impacting global trade and posing environmental risks from potential spills.", "url": "https://www.devdiscourse.com/article/headlines/3019468-houthis-attack-oil-tanker-in-red-sea-damage-assessment-and-environmental-risks", "date": "2024-07-17 00:45", "source": "GDELT"}, {"id": "970c6201-b06d-4908-9411-af5c1723001d", "message": "CAIRO: Liberia-flagged oil tanker Chios Lion was assessing damage and investigating a potential oil spill after it was attacked by Yemeni Houthis in the Red Sea, the Red Sea and Gulf of Aden Joint Maritime Information Center (JMIC) said on Tuesday.\n“While originally headed south, following the attack the vessel turned around and back north out of the threat area to further assess the damage and investigate potential oil spillage,” the JMIC said in a statement.\nThe manager of Chios Lion did not immediately respond to requests for comment.\nThe Houthis said they targeted Chios Lion and Bentley I with ballistic missiles, drones and booby-trapped boats in response to the deadly Israeli airstrike on the southern Gaza Strip city of Khan Younis on Saturday.\nThey also pose a risk to the environment in the form of spilt cargo such as oil and fertiliser, as well as fuel used to power vessels.", "url": "https://www.dawn.com/news/1846302/oil-spill-feared-in-red-sea-as-houthis-attack-tanker", "date": "2024-07-17 03:00", "source": "GDELT"}, {"id": "f98e0e8a-5d6c-4ac8-81ff-c187239dbf76", "message": "Liberia-flagged oil tanker Chios Lion was assessing damage and investigating a potential oil spill after it was attacked by Yemen's Houthis in the Red Sea, the Red Sea and Gulf of Aden Joint Maritime Information Center (JMIC) said on Tuesday.\nThe manager of Chios Lion did not immediately respond to requests for comment.\nYemen's Houthis said they targeted Chios Lion and Bentley I with ballistic missiles, drones and booby-trapped boats in response to the deadly Israeli airstrike on the southern Gaza Strip city of Khan Younis on Saturday.\nThey also pose a risk to the environment in the form of spilled cargo such as oil and fertilizer as well as fuel used to power vessels.\n(Reuters - Reporting by Jaidaa Taha in Cairo, Nayera Abdallah in Dubai and Lisa Baertlein in Los Angeles; Editing by Alison Williams)", "url": "https://www.marinelink.com/news/possible-red-sea-oil-spill-houthi-attack-515234", "date": "2024-07-17 06:15", "source": "GDELT"}], "location": "Hodeidah, Yemen", "total_score": 1.8162813333688719, "count": 3, "average_score": 0.6054271111229573, "final_score": 0.6637989777860701}, "56d92347-6352-45ca-9161-efcc81ce52d6": {"messages": [{"id": "56d92347-6352-45ca-9161-efcc81ce52d6", "message": "Israel’s military has said it is pursuing Hamas terrorists who are hiding among civilians after offensives uprooted underground tunnel networks.\n(AP Photo/Tsafrir Abayov)The Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nIsrael has said it is pursuing Hamas terrorists who are hiding among civilians after offensives uprooted underground tunnel networks.\nThe military said Tuesday that it has eliminated half of the leadership of Hamas’ military wing and that some 14,000 terrorists have been killed or detained.\nThe military said air force planes struck some 40 targets in Gaza over the past day, among them observation posts, Hamas military structures and explosives-rigged buildings.", "url": "https://www.reviewjournal.com/news/nation-and-world/israel-says-its-killed-about-half-of-hamas-military-leaders-3095716/", "date": "2024-07-16 20:30", "source": "GDELT"}, {"id": "14c9bfe2-dcae-4d2c-b40f-8e080f2d0a77", "message": "By WAFAA SHURAFA Associated PressDEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nThat blast, in an area also surrounded by tents, killed more than 90 Palestinians, including children, according to Gaza health officials.\nThe military said Tuesday that it has eliminated half of the leadership of Hamas’ military wing and that some 14,000 fighters have been killed or detained.\nThe military said air force planes struck some 40 targets in Gaza over the past day, among them observation posts, Hamas military structures and explosives-rigged buildings.", "url": "https://www.twincities.com/2024/07/16/israeli-strikes-in-southern-central-gaza-kill-more-than-60-palestinians-including-in-safe-zone/", "date": "2024-07-16 19:45", "source": "GDELT"}, {"id": "f2d8e066-9151-4a3c-8d34-466d0d947842", "message": "By Wafaaa Shurafa | Associated PressDEIR AL-BALAH, Gaza Strip — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nIsrael has said it is pursuing Hamas militants who are hiding among civilians after offensives uprooted underground tunnel networks.\nApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nIsrael’s military said Hamas militants were operating from the school to plan attacks.\nThe military said air force planes struck some 40 targets in Gaza over the past day, among them observation posts, Hamas military structures and explosives-rigged buildings.", "url": "https://www.mercurynews.com/2024/07/16/israeli-strikes-kill-more-than-60-in-gaza-including-in-safe-zone/", "date": "2024-07-17 01:00", "source": "GDELT"}], "location": "GAZA CITY", "total_score": 1.0354106868741015, "count": 2, "average_score": 0.5177053434370508, "final_score": 0.5723937404059355}, "6e53ae2b-96dd-47f9-b4d5-35bd924269df": {"messages": [{"id": "6e53ae2b-96dd-47f9-b4d5-35bd924269df", "message": "DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nIsrael has said it is pursuing Hamas militants who are hiding among civilians after offensives uprooted underground tunnel networks.\nApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nThat blast, in an area also surrounded by tents, killed more than 90 Palestinians, including children, according to Gaza health officials.\nOther strikes in Khan Younis and Rafah killed 12 people, according to medical officials and AP journalists.", "url": "https://wwmt.com/news/nation-world/israeli-strikes-in-gaza-kill-more-than-60-palestinians-including-in-safe-zone", "date": "2024-07-16 20:30", "source": "GDELT"}, {"id": "50173fae-fef2-4f20-9994-2ac07cac26d1", "message": "DEIR AL-BALAH, Gaza Strip — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nThere was no immediate comment from the Israeli military on the strike.\nOther strikes hit in the Nuseirat and Zawaida refugee camps of central Gaza.\nStrikes on four houses killed at least 24 people, including 10 women and four children.\nThe military said air force planes struck some 40 targets in Gaza over the past day, among them observation posts, Hamas military structures and explosives-rigged buildings.", "url": "https://www.stltoday.com/news/nation-world/israeli-strikes-in-southern-central-gaza-kill-more-than-60-palestinians-including-in-safe-zone/article_9377ade0-435f-11ef-b975-67c7ab267e0d.html", "date": "2024-07-17 04:30", "source": "GDELT"}], "location": "GAZA CITY.", "total_score": 0.6015737755258713, "count": 1, "average_score": 0.6015737755258713, "final_score": 0.60110164286811}, "58010045-28a1-41d2-900a-d702b5f83f66": {"messages": [{"id": "58010045-28a1-41d2-900a-d702b5f83f66", "message": "Palestinians inspect a house hit in an Israeli strike, amid the Israel-Hamas conflict, in Deir Al-Balah in the central Gaza Strip, July 15, 2024.\nIsrael said its strike there on Saturday targeted Hamas military commander Mohammed Deif, an architect of the Oct 7 assault on Israeli towns and villages that triggered the Gaza war.\nThe military also stepped up aerial and tank shelling in central Gaza in the Al-Bureij and Al-Maghazi historic refugee camps.\nThe Israeli military said the air forces struck dozens of Palestinian military targets across Gaza, killing many gunmen.\nIt said forces killed gunmen in Rafah and central Gaza, sometimes in close combat.", "url": "https://japantoday.com/category/world/israel-launches-new-gaza-strikes-after-weekend-attack-kills-scores-in-safe-zone2", "date": "2024-07-16 00:45", "source": "GDELT"}, {"id": "3b2e7dce-998a-48fa-a895-cb60fa042fe0", "message": "The military also stepped up aerial and tank shelling in central Gaza in the Al-Bureij and Al-Maghazi historic refugee camps.\nHealth officials said five Palestinians were killed in an Israeli air strike on a house in Maghazi camp.\nPalestinian health officials said 11 Palestinians were killed in an Israeli air strike on a house in Al-Nuseirat camp in central Gaza Strip earlier on Monday.\nThe Israeli military said the air forces struck dozens of Palestinian military targets across Gaza, killing many gunmen.\nIt said forces killed gunmen in Rafah and central Gaza, sometimes in close combat.", "url": "https://www.asiaone.com/world/israel-launches-new-gaza-strikes-after-weekend-attack-kills-scores-safe-zone", "date": "2024-07-16 03:30", "source": "GDELT"}], "location": "GAZA", "total_score": 0.49854829197477657, "count": 1, "average_score": 0.49854829197477657, "final_score": 0.5289838043823436}, "19b99e87-674d-4e50-acaa-233b95c5f185": {"messages": [{"id": "19b99e87-674d-4e50-acaa-233b95c5f185", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "url": "https://www.local10.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "date": "2024-07-17 04:30", "source": "GDELT"}, {"id": "b8c46d67-46dd-4d67-80f9-41cd66870c91", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}The dead Palestinian toddler’s limbs were pale and cold despite the sweltering summer heat in Gaza.\nOutside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.", "url": "https://www.independent.co.uk/news/gaza-ap-god-palestinian-israeli-b2581020.html", "date": "2024-07-17 04:15", "source": "GDELT"}, {"id": "9942bfce-f20b-42a4-a87c-e46ae4f34670", "message": "A Gaza father mourns his baby boy, killed in bed by an Israeli airstrikeDEIR AL-BALAH, Gaza Strip (AP) — The dead Palestinian toddler’s limbs were pale and cold despite the sweltering summer heat in Gaza.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.\n© Copyright The Associated Press.\nThe information contained in this news report may not be published, broadcast or otherwise distributed without the prior written authority of The Associated Press.", "url": "https://isp.netscape.com/news/world/story/0001/20240717/81c6480635f860c485b66d5454e948ef", "date": "2024-07-17 06:30", "source": "GDELT"}, {"id": "32bb3531-a315-4b78-8a33-cad3ae97c30c", "message": "DEIR AL-BALAH, Gaza Strip (AP) — The dead Palestinian toddler’s limbs were pale and cold despite the sweltering summer heat in Gaza.\nOutside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nMikdad and two others, one with his head wrapped in bandages, caressed and kissed the boy’s body outside the morgue.\nLater, a dozen or so men held a funeral prayer over Yamam’s body wrapped in a white shroud.", "url": "https://13wham.com/news/nation-world/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike", "date": "2024-07-17 08:15", "source": "GDELT"}], "location": "answer\nGaza", "total_score": 1.8459748556768734, "count": 3, "average_score": 0.6153249518922911, "final_score": 0.6707274663246038}, "621e96d3-8c60-4fac-bd15-d546f1e4da6a": {"messages": [{"id": "621e96d3-8c60-4fac-bd15-d546f1e4da6a", "message": "Israeli tanks also shelled the eastern areas of Al-Bureij and Al-Maghazi camps in the centre of enclave, residents said.\nMeanwhile in Rafah, tanks carried out a raid in the north of the city before retreating, a tactic Israeli forces have used in other areas before mounting deeper incursions.\nMedics said an Israeli strike killed two people in Rafah on Wednesday, while residents said the forces had blown up dozens of homes.\nThe Israeli military said troops were \"continuing precise, intelligence-based operational activity in the Rafah area\".\nMany of the hundreds of Palestinians Israel has released in the past months have accused Israeli forces of ill-treatment and torture.", "url": "https://www.marketscreener.com/news/latest/Israel-pounds-central-Gaza-sends-tanks-into-north-of-Rafah-47398681/", "date": "2024-07-17 09:15", "source": "GDELT"}, {"id": "b0132019-d446-41dc-ad6b-8116cab09aba", "message": "Israeli forces pounded areas in the central Gaza Strip on Wednesday, killing at least nine Palestinians, according to health officials, while Israeli tanks carried out a limited advance further into Rafah in the south.\nIsraeli tanks also shelled the eastern areas of Al-Bureij and Al-Maghazi camps in the center of enclave, residents said.\nMedics said an Israeli strike killed two people in Rafah on Wednesday, while residents said the forces had blown up dozens of homes.\nThe Israeli military said troops were \"continuing precise, intelligence-based operational activity in the Rafah area.\"\nMany of the hundreds of Palestinians Israel has released in the past months have accused Israeli forces of ill-treatment and torture.", "url": "https://www.newsmax.com/world/globaltalk/israel-war-hamas/2024/07/17/id/1172869/", "date": "2024-07-17 16:15", "source": "GDELT"}, {"id": "ba75f862-9527-4e2b-9e19-13fae65f5774", "message": "Israel pounds central Gaza, sends tanks into north of Rafahreuters_tickers4 minutesBy Nidal al-MughrabiCAIRO (Reuters) -Israeli forces hit areas in the central Gaza Strip on Wednesday, killing at least nine Palestinians, according to health officials, while Israeli tanks carried out a limited advance further into Rafah in the south.\nThe Israeli military said troops were “continuing precise, intelligence-based operational activity in the Rafah area”.\nA deal would aim to end the war and release Israeli hostages in Gaza in return for many Palestinians jailed by Israel.\nOn Wednesday, Israel released 13 Palestinians detained during the offensive in Gaza, the Palestinian Red Crescent said in a statement.\nMany of the hundreds of Palestinians Israel has released in the past months have accused Israeli forces of ill-treatment and torture.", "url": "https://www.swissinfo.ch/eng/israel-pounds-central-gaza%2c-sends-tanks-into-north-of-rafah/84059585", "date": "2024-07-17 12:00", "source": "GDELT"}], "location": ")\nGAZA CITY.", "total_score": 0.9469325617398088, "count": 2, "average_score": 0.4734662808699044, "final_score": 0.541426396608933}}