{"2865af31-cfca-4c0f-970f-a5136cb7212f": {"messages": [{"id": "2865af31-cfca-4c0f-970f-a5136cb7212f", "message": "Lebanese official media reported that separate Israeli strikes on Tuesday in southern Lebanon resulted in the deaths of five people, including three Syrian children.\nAccording to the National News Agency (NNA), three Syrian children were killed in an airstrike that targeted farmland in the village of Umm Toot.\nThe United Nations children’s agency, UNICEF, expressed concern over the ongoing violence, highlighting the tragic death of three children in southern Lebanon.\nThe Israeli military reported that 40 projectiles were fired from Lebanon on Tuesday, followed by an additional 10 later in the day.\nThe Israeli air force responded with strikes on Hezbollah sites in southern Lebanon, including a “terrorist cell” near Umm Toot.", "url": "https://dailystar.com.lb/israeli-strikes-kill-5-south-lebanon-3-children/", "date": "2024-07-17 21:15", "source": "GDELT"}, {"id": "64c2e4cc-04a6-4208-b3eb-a59a2a5347e1", "message": "Smoke bilows following an Israeli strike in the village of Kfar Kila in southern Lebanon on July 16, 2024 (Rabih DAHER)Lebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\nIt also said an \"enemy\" drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of \"Katyusha rockets\" at northern Israel in response to the Israeli strikes.\nThe Israeli military said 40 projectiles fired from Lebanon were initially identified Tuesday, followed by a further 10 later in the day.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a \"terrorist cell\" in the Yarin area, which is close to Umm Toot.", "url": "https://www.yahoo.com/news/lebanon-media-says-3-children-014250642.html", "date": "2024-07-17 02:30", "source": "GDELT"}, {"id": "4a6583d5-6316-4e1e-8fd3-b98cb28241ae", "message": "Smoke bilows following an Israeli strike in the village of Kfar Kila in southern Lebanon on July 16, 2024 - Copyright AFP Rabih DAHERLebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\nIt also said an “enemy” drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of “Katyusha rockets” at northern Israel in response to the Israeli strikes.\nThe Israeli military said 40 projectiles fired from Lebanon were initially identified Tuesday, followed by a further 10 later in the day.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a “terrorist cell” in the Yarin area, which is close to Umm Toot.", "url": "https://www.digitaljournal.com/world/lebanon-media-says-3-children-among-5-dead-in-israeli-strikes/article", "date": "2024-07-17 02:30", "source": "GDELT"}, {"id": "f87aa61f-65ed-4dff-ba61-2bb3b1a23702", "message": "Lebanese official media said separate Israeli strikes Tuesday in south Lebanon killed five people including three Syrian children, with Hezbollah announcing rocket fire at Israel in retaliation.\n\"Three Syrian children\" were killed \"in an enemy raid that targeted farmland in the village of Umm Toot\", the National News Agency (NNA) said.\nIt also said an \"enemy\" drone strike had targeted a motorcycle on the Kfar Tebnit road elsewhere in south Lebanon, killing two Syrians.\nHezbollah said it launched rounds of \"Katyusha rockets\" at northern Israel in response to the Israeli strikes.\nThe air force launched strikes against parts of south Lebanon where it said there were Hezbollah sites, including a \"terrorist cell\" in the Yarin area, which is close to Umm Toot.", "url": "https://www.guampdn.com/news/national/lebanon-media-says-3-children-among-5-dead-in-israeli-strikes/article_469d0aaf-c1ff-50e1-b603-cfcbf76a82a8.html", "date": "2024-07-17 03:30", "source": "GDELT"}], "location": "Umm Toot", "total_score": 1.924671850289049, "count": 3, "average_score": 0.641557283429683, "final_score": 0.6890900984007781}, "2644ce6b-c2f6-47dc-8e55-55b0bd1bfa68": {"messages": [{"id": "2644ce6b-c2f6-47dc-8e55-55b0bd1bfa68", "message": "Israeli forces battled Hamas-led fighters in several parts of the Gaza Strip on Tuesday, and Palestinian health officials said at least 57 people were killed in Israeli bombardments of southern and central areas.\nIn Rafah, a southern border city where Israeli forces have been operating since May, five Palestinians were killed in an airstrike on a house, Gaza health officials said.\nLater on Tuesday, an Israeli airstrike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, the officials said.\nAt least 38,713 Palestinians have been killed in Israel's retaliatory offensive since then, Gaza health authorities said in their latest update on Tuesday.\nThat attack killed more than 90 people in the Khan Younis area, according to Gaza health authorities.", "url": "https://www.koreatimes.co.kr:443/www/world/2024/07/501_378809.html", "date": "2024-07-17 05:00", "source": "GDELT"}, {"id": "190c04e7-9c31-4f64-a9d8-8dd268b17171", "message": "(MENAFN- Gulf Times) Palestinian officials said at least 57 people were killed yesterday in Israeli bombardments of southern and central areas of the Gaza Strip.\nIn nearby Khan Younis, a man, his wife, and two children were killed.\nLater yesterday, an Israeli airstrike on a car killed at least 17 Palestinians and wounded 26 others in Khan Younis in southern Gaza, the officials said.\nHours later, an Israeli air strike on a UN-run school that housed displaced families in the Nuseirat camp killed 23 people and wounded many others, health officials said.\nThere are no more safe agency schools, or safe clinics, no more safe houses, no safe streets.", "url": "https://menafn.com/1108447524/57-More-Gazans-Perish-In-Israeli-Genocide-UN-Run-School-Hit-Again", "date": "2024-07-17 03:30", "source": "GDELT"}, {"id": "e159645f-b5c9-4cce-be63-e88eb81df719", "message": "An Israeli air strike killed three people in a car in Deir Al-Balah, a city packed with people displaced from elsewhere in Gaza, health officials said.\nIn Gaza City in the north, medics said two Palestinians were killed in another airstrike.\nIn Rafah, residents said Israeli tanks advanced deeper in the western side of the city and took position on a hilltop there.\nThe armed wing of militant group Hamas and its allies said they fired mortar bombs at Israeli forces in southwest Rafah on Thursday.\nMore than 38,000 Palestinians have been killed in Israel's retaliatory offensive since then, Gaza health authorities say.", "url": "https://www.yahoo.com/news/israel-bombards-central-gaza-tanks-085228477.html", "date": "2024-07-18 09:15", "source": "GDELT"}], "location": ")\nGAZA", "total_score": 1.2803791685701233, "count": 2, "average_score": 0.6401895842850617, "final_score": 0.6581327089995431}, "6ba389ab-cfc5-40c2-8c69-d24eb8054974": {"messages": [{"id": "6ba389ab-cfc5-40c2-8c69-d24eb8054974", "message": "Israeli forces pounded areas in the central Gaza Strip on Wednesday, killing at least nine Palestinians, according to health officials, while Israeli tanks carried out a limited advance further into Rafah in the south.\nIsraeli tanks also shelled the eastern areas of Al-Bureij and Al-Maghazi camps in the center of enclave, residents said.\nMedics said an Israeli strike killed two people in Rafah on Wednesday, while residents said the forces had blown up dozens of homes.\nThe Israeli military said troops were \"continuing precise, intelligence-based operational activity in the Rafah area.\"\nMany of the hundreds of Palestinians Israel has released in the past months have accused Israeli forces of ill-treatment and torture.", "url": "https://www.newsmax.com/world/globaltalk/israel-war-hamas/2024/07/17/id/1172869/", "date": "2024-07-17 16:15", "source": "GDELT"}, {"id": "e673345e-12bb-4888-8193-aea9404680a1", "message": "Israeli tanks also shelled the eastern areas of Al-Bureij and Al-Maghazi camps in the centre of enclave, residents said.\nMeanwhile in Rafah, tanks carried out a raid in the north of the city before retreating, a tactic Israeli forces have used in other areas before mounting deeper incursions.\nMedics said an Israeli strike killed two people in Rafah on Wednesday, while residents said the forces had blown up dozens of homes.\nThe Israeli military said troops were \"continuing precise, intelligence-based operational activity in the Rafah area\".\nMany of the hundreds of Palestinians Israel has released in the past months have accused Israeli forces of ill-treatment and torture.", "url": "https://www.marketscreener.com/news/latest/Israel-pounds-central-Gaza-sends-tanks-into-north-of-Rafah-47398681/", "date": "2024-07-17 09:15", "source": "GDELT"}, {"id": "27a4753f-8ce8-4321-9d99-aa391c0847b5", "message": "Israel pounds central Gaza, sends tanks into north of Rafahreuters_tickers4 minutesBy Nidal al-MughrabiCAIRO (Reuters) -Israeli forces hit areas in the central Gaza Strip on Wednesday, killing at least nine Palestinians, according to health officials, while Israeli tanks carried out a limited advance further into Rafah in the south.\nThe Israeli military said troops were “continuing precise, intelligence-based operational activity in the Rafah area”.\nA deal would aim to end the war and release Israeli hostages in Gaza in return for many Palestinians jailed by Israel.\nOn Wednesday, Israel released 13 Palestinians detained during the offensive in Gaza, the Palestinian Red Crescent said in a statement.\nMany of the hundreds of Palestinians Israel has released in the past months have accused Israeli forces of ill-treatment and torture.", "url": "https://www.swissinfo.ch/eng/israel-pounds-central-gaza%2c-sends-tanks-into-north-of-rafah/84059585", "date": "2024-07-17 12:00", "source": "GDELT"}], "location": "GAZA", "total_score": 0.8320137658443507, "count": 2, "average_score": 0.41600688292217536, "final_score": 0.5012048180455227}, "435aadd4-2841-442f-a36a-f303fe79b24b": {"messages": [{"id": "435aadd4-2841-442f-a36a-f303fe79b24b", "message": "A Gaza father mourns his baby boy, killed in bed by an Israeli airstrikeDEIR AL-BALAH, Gaza Strip (AP) — The dead Palestinian toddler’s limbs were pale and cold despite the sweltering summer heat in Gaza.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.\n© Copyright The Associated Press.\nThe information contained in this news report may not be published, broadcast or otherwise distributed without the prior written authority of The Associated Press.", "url": "https://isp.netscape.com/news/world/story/0001/20240717/81c6480635f860c485b66d5454e948ef", "date": "2024-07-17 06:30", "source": "GDELT"}, {"id": "f8d5b04e-5b37-48af-8956-7c6cd4eec776", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "url": "https://www.ksat.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "date": "2024-07-17 05:15", "source": "GDELT"}], "location": "DEIR AL-BALAH, Gaza Strip.", "total_score": 0.6689243726969644, "count": 1, "average_score": 0.6689243726969644, "final_score": 0.6482470608878751}, "54c79929-ee5d-4e1f-b8a6-0d201f11ba11": {"messages": [{"id": "54c79929-ee5d-4e1f-b8a6-0d201f11ba11", "message": "Outside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nRecommended VideosHis son, Yaman, was killed by an Israeli airstrike.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.\nLater, a dozen or so men held a funeral prayer over Yamam's body wrapped in a white shroud.", "url": "https://www.clickondetroit.com/news/world/2024/07/17/a-gaza-father-mourns-his-baby-boy-killed-in-bed-by-an-israeli-airstrike/", "date": "2024-07-17 06:45", "source": "GDELT"}, {"id": "8ae805d9-53c0-43ab-9278-c2e2bde6dcc5", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}The dead Palestinian toddler’s limbs were pale and cold despite the sweltering summer heat in Gaza.\nOutside the hospital, his father cradled the boy in his arms, unable or unwilling to say goodbye.\nIsraeli strikes killed more than 60 Palestinians in southern and central Gaza from Monday night into Tuesday, according to hospital records and health officials.\nMikdad carried Yamam’s body through central Gaza from Nuseirat camp to Al Aqsa Martyrs hospital in nearby Deir al-Balah.", "url": "https://www.independent.co.uk/news/gaza-ap-god-palestinian-israeli-b2581020.html", "date": "2024-07-17 04:15", "source": "GDELT"}], "location": "Al Aqsa Martyrs hospital", "total_score": 0.5764599317988065, "count": 1, "average_score": 0.5764599317988065, "final_score": 0.5835219522591646}, "c1dcb74b-aeb9-45b6-bc53-8e2f383e7392": {"messages": [{"id": "c1dcb74b-aeb9-45b6-bc53-8e2f383e7392", "message": "CAIRO: Liberia-flagged oil tanker Chios Lion was assessing damage and investigating a potential oil spill after it was attacked by Yemeni Houthis in the Red Sea, the Red Sea and Gulf of Aden Joint Maritime Information Center (JMIC) said on Tuesday.\n“While originally headed south, following the attack the vessel turned around and back north out of the threat area to further assess the damage and investigate potential oil spillage,” the JMIC said in a statement.\nThe manager of Chios Lion did not immediately respond to requests for comment.\nThe Houthis said they targeted Chios Lion and Bentley I with ballistic missiles, drones and booby-trapped boats in response to the deadly Israeli airstrike on the southern Gaza Strip city of Khan Younis on Saturday.\nThey also pose a risk to the environment in the form of spilt cargo such as oil and fertiliser, as well as fuel used to power vessels.", "url": "https://www.dawn.com/news/1846302/oil-spill-feared-in-red-sea-as-houthis-attack-tanker", "date": "2024-07-17 03:00", "source": "GDELT"}, {"id": "c305eb11-1915-43a8-a35c-0560c97d1b0f", "message": "Liberia-flagged oil tanker Chios Lion was assessing damage and investigating a potential oil spill after it was attacked by Yemen's Houthis in the Red Sea, the Red Sea and Gulf of Aden Joint Maritime Information Center (JMIC) said on Tuesday.\nThe manager of Chios Lion did not immediately respond to requests for comment.\nYemen's Houthis said they targeted Chios Lion and Bentley I with ballistic missiles, drones and booby-trapped boats in response to the deadly Israeli airstrike on the southern Gaza Strip city of Khan Younis on Saturday.\nThey also pose a risk to the environment in the form of spilled cargo such as oil and fertilizer as well as fuel used to power vessels.\n(Reuters - Reporting by Jaidaa Taha in Cairo, Nayera Abdallah in Dubai and Lisa Baertlein in Los Angeles; Editing by Alison Williams)", "url": "https://www.marinelink.com/news/possible-red-sea-oil-spill-houthi-attack-515234", "date": "2024-07-17 06:15", "source": "GDELT"}], "location": "JMIC - Joint Maritime Information Center", "total_score": 0.38407798018536277, "count": 1, "average_score": 0.38407798018536277, "final_score": 0.44885458612975393}, "d64f9154-bcd7-4730-8239-6799f8f8abab": {"messages": [{"id": "d64f9154-bcd7-4730-8239-6799f8f8abab", "message": "The rift between Islam's two main sects deepened after Sunnis killed Imam Hussein in battle in the Iraqi city of Karbala, south of Baghdad.\nIn the Shiite community, Ashoura is viewed as a symbol of struggle against injustice and tyranny.\nClerics recount the story of his death as Shiite Muslims cry and beat their chests.\nNasrallah previously said that Hezbollah wouldn't hold Ashoura processions in southern Lebanon because of the ongoing clashes.\n''If your tanks came to Lebanon and southern Lebanon ... you won't have any left.''", "url": "https://www.startribune.com/shiite-muslims-in-lebanon-and-iraq-commemorate-ashour-marking-the-death-of-imam-hussein/600381304/", "date": "2024-07-17 11:45", "source": "GDELT"}, {"id": "484a6951-22dd-41b5-897c-8cab905ac610", "message": "In the Shiite community, Ashoura is viewed as a symbol of struggle against injustice and tyranny.\nClerics recount the story of his death as Shiite Muslims cry and beat their chests.\nNasrallah previously said that Hezbollah wouldn't hold Ashoura processions in southern Lebanon because of the ongoing clashes.\nIn a televised address to commemorate Ashoura Wednesday, Nasrallah warned the Israeli military against targeting civilians in Lebanon, saying the group will target new Israeli towns and villages otherwise.\n\"If your tanks came to Lebanon and southern Lebanon ... you won't have any left.\"", "url": "https://www.naharnet.com/stories/en/306631-shiite-muslims-in-lebanon-commemorate-ashoura-as-border-tensions-rise", "date": "2024-07-18 13:30", "source": "GDELT"}], "location": "Karbala", "total_score": 0.5212335107613978, "count": 1, "average_score": 0.5212335107613978, "final_score": 0.5448634575329785}, "99c1fc75-f2c6-494d-b1c9-5cc47f9cc6d7": {"messages": [{"id": "99c1fc75-f2c6-494d-b1c9-5cc47f9cc6d7", "message": "By Wafaaa Shurafa | Associated PressDEIR AL-BALAH, Gaza Strip — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nIsrael has said it is pursuing Hamas militants who are hiding among civilians after offensives uprooted underground tunnel networks.\nApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nIsrael’s military said Hamas militants were operating from the school to plan attacks.\nThe military said air force planes struck some 40 targets in Gaza over the past day, among them observation posts, Hamas military structures and explosives-rigged buildings.", "url": "https://www.mercurynews.com/2024/07/16/israeli-strikes-kill-more-than-60-in-gaza-including-in-safe-zone/", "date": "2024-07-17 01:00", "source": "GDELT"}, {"id": "296ec03d-4e3b-4bf1-954e-4f3bdab2c85b", "message": "Israeli strikes in southern, central Gaza kill more than 60 Palestinians, including in 'safe zone'DEIR AL-BALAH, Gaza Strip (AP) — Israeli airstrikes killed more than 60 Palestinians in southern and central Gaza overnight and into Tuesday, including one that struck an Israeli-declared “safe zone” crowded with thousands of displaced people.\nIsrael has said it is pursuing Hamas militants who are hiding among civilians after offensives uprooted underground tunnel networks.\nApparently referring to the strike, the Israeli military said in a statement that it targeted a commander in Islamic Jihad’s naval unit west of Khan Younis.\nThat blast, in an area also surrounded by tents, killed more than 90 Palestinians, including children, according to Gaza health officials.\nIsrael's military said Hamas militants were operating from the school to plan attacks.", "url": "https://isp.netscape.com/news/world/story/0001/20240717/0cff821823185af16fb2ec5ee8e5c986", "date": "2024-07-17 06:30", "source": "GDELT"}], "location": "GAZA CITY.", "total_score": 0.3750692823803967, "count": 1, "average_score": 0.3750692823803967, "final_score": 0.4425484976662777}, "b5e1ad01-dcb7-4d89-9bd5-da0f26826756": {"messages": [{"id": "b5e1ad01-dcb7-4d89-9bd5-da0f26826756", "message": "Israeli negotiators were in Cairo on Wednesday to press ahead with cease-fire talks, as Israel and Hamas consider the latest proposal.\nMost of Gaza's 2.3 million people are crammed into squalid tent camps in central and southern Gaza.\nThe Israeli military described Jabara as a Hamas operative in Lebanon who helped coordinate Islamic Group attacks targeting northern Israel.\nThe Israeli military did not immediately comment on the strikes, though it has acknowledged in previous instances that its attacks have targeted Hezbollah militants and allies.\nIsraeli strikes kill at least 11 people in central GazaDEIR AL-BALAH, Gaza Strip — Overnight Israeli strikes Thursday in central Gaza killed at least 11 people, including women and children.", "url": "https://www.startribune.com/the-latest-israeli-delegation-arrives-in-cairo-for-gaza-cease-fire-talks/600381568/", "date": "2024-07-18 10:00", "source": "GDELT"}, {"id": "e504ed24-9060-474b-b1b1-86e0ce047b65", "message": "Israeli negotiators were in Cairo on Wednesday to press ahead with cease-fire talks, as Israel and Hamas consider the latest proposal.\nMost of Gaza’s 2.3 million people are crammed into squalid tent camps in central and southern Gaza.\nDEIR AL-BALAH, Gaza Strip — Overnight Israeli strikes Thursday in central Gaza killed at least 11 people, including women and children.\nThe area struck is close to Deir al-Balah, where many Palestinians displaced from across the war-torn Gaza Strip have fled.\nDestroyed buildings stand in the Gaza Strip during the sunset as seen from southern Israel, Wednesday, July 17, 2024.", "url": "https://www.winnipegfreepress.com/world/2024/07/18/the-latest-israeli-delegation-arrives-in-cairo-for-gaza-cease-fire-talks-2", "date": "2024-07-18 10:00", "source": "GDELT"}, {"id": "b1560dcc-290a-4e63-8164-c7f31717b540", "message": "The Latest | Israeli minister’s visit to Jerusalem holy site puts pressure on cease-fire talks View PhotoA leading far-right figure in the Israeli government visited Jerusalem’s most sensitive holy site on Thursday, a move that threatened cease-fire talks to end the 9-month-old war between Israel and Hamas in Gaza.\nIsraeli negotiators were in Cairo on Wednesday to press ahead with cease-fire talks, as Israel and Hamas consider the latest proposal.\nMost of Gaza’s 2.3 million people are crammed into squalid tent camps in central and southern Gaza.\nThe Israeli military described Jabara as a Hamas operative in Lebanon who helped coordinate Islamic Group attacks targeting northern Israel.\nThe Israeli military did not immediately comment on the strikes, though it has acknowledged in previous instances that its attacks have targeted Hezbollah militants and allies.", "url": "https://www.mymotherlode.com/news/world/3393311/the-latest-israeli-delegation-arrives-in-cairo-for-gaza-cease-fire-talks-2.html", "date": "2024-07-18 10:45", "source": "GDELT"}], "location": ")\nGaza Strip", "total_score": 1.0624973998659453, "count": 2, "average_score": 0.5312486999329726, "final_score": 0.5818740899530808}, "8c7e1aee-3195-4f16-92e5-03370d73fd05": {"messages": [{"id": "8c7e1aee-3195-4f16-92e5-03370d73fd05", "message": "The 20-year-old purchased ammunition shortly before the incident, both online and in-person, according to law enforcement sources.\nFor at least an hour before the shooting, Crooks was seen walking around near the rally area.\nHe was also seen walking around near the magnetometers minutes before the shooting, according to law enforcement sources.\nSome witnesses reported him as a suspicious person, law enforcement sources said.\nA Secret Service sniper shot back at Crooks, fatally shooting him in the head 26 seconds later, according to law enforcement officials.", "url": "https://abc7chicago.com/what-thomas-matthew-crooks-did-in-hours-leading-up-to-attack-on-trump/15067819/", "date": "2024-07-18 13:45", "source": "GDELT"}, {"id": "e269ef7c-c880-449a-a87c-919275d321eb", "message": "What Thomas Matthew Crooks did in hours leading up to assassination attempt on TrumpA timeline reveals the suspected shooter's movements, including that authorities were aware of him on rooftop 20 minutes before shots fired.\nA timeline reveals the suspected shooter's movements, including that authorities were aware of him on rooftop 20 minutes before shots fired.\nHe then drove to the Trump rally in Butler, Pennsylvania, parking about a third of a mile away at a gas station.\nFor at least an hour before the shooting, Crooks was seen walking around near the rally area.\nA Secret Service sniper shot back at Crooks, fatally shooting him in the head 26 seconds later, according to law enforcement officials.", "url": "https://abc7news.com/post/what-thomas-matthew-crooks-did-hours-leading-up-to-attempted-assassination/15067382/", "date": "2024-07-18 12:30", "source": "GDELT"}], "location": "The main location where the event takes place is the United States", "total_score": 0.6293116265239369, "count": 1, "average_score": 0.6293116265239369, "final_score": 0.6205181385667559}, "691051bf-cdeb-4a0b-8f61-7510849ccf17": {"messages": [{"id": "691051bf-cdeb-4a0b-8f61-7510849ccf17", "message": "The Palestinians report three deaths in an attack on a vehicle by an Israeli drone in the al-Barakeh area of ​​Deir al-Balah in the center of the Gaza Strip.", "url": "https://abualiexpress.com/en/en30627/", "date": "2024-07-18 08:58", "source": "Telegram"}, {"id": "8d56dcd6-5459-470f-afb5-26126a96978a", "message": "Lebanese channels report a death in an Israeli drone attack a little over an hour ago on a vehicle in the village of Ghazze in the Beqaa district in Lebanon.\nThis is a village where most of the inhabitants are Sunnis.", "url": "https://abualiexpress.com/en/en30604/", "date": "2024-07-18 06:57", "source": "Telegram"}], "location": "GAZA", "total_score": 0.6506825493435353, "count": 1, "average_score": 0.6506825493435353, "final_score": 0.6354777845404747}, "7247c084-6a0f-4ad2-848e-9bd0897f07c8": {"messages": [{"id": "7247c084-6a0f-4ad2-848e-9bd0897f07c8", "message": "The moment the car of Abu Mahmoud, Muhammad Jabara, the senior member of the Al-Jama'ah al-Islamiya organization, was killed this morning in the village of Gaza in the Beqaa district in Lebanon.", "url": "https://abualiexpress.com/en/en30616/", "date": "2024-07-18 07:03", "source": "Telegram"}, {"id": "638e3abe-608f-44f0-94ce-a24691069512", "message": "Lebanese sources: The person killed in the car attack 👆 in the Sunni village of Ghazze in the Beqaa district is Abu Mahmoud Jabara, a senior member of the Al-Jama'ah al-Islamiya organization (a Sunni organization fighting against Israel in cooperation with Hamas and Hezbollah since the beginning of the war).", "url": "https://abualiexpress.com/en/en30608/", "date": "2024-07-18 07:00", "source": "Telegram"}], "location": "BEIRUT", "total_score": 0.6092918655038122, "count": 1, "average_score": 0.6092918655038122, "final_score": 0.6065043058526686}}