{"69ce3c31-1030-43a7-a51e-6e9a36f14c91": {"messages": [{"id": "69ce3c31-1030-43a7-a51e-6e9a36f14c91", "message": "Unofficial Lebanese media reports that one person was killed in an attack carried out by an Israeli drone early this morning in Beit Leif in southern Lebanon.", "url": "https://abualiexpress.com/en/en31336/", "date": "2024-07-30 05:58", "source": "Telegram"}, {"id": "3689ee57-bdfa-4728-95bc-1e106ef8b04c", "message": "Lebanese channels are reporting casualties in an attack by Israeli fighter jets earlier this afternoon in Jibchit in southern Lebanon.", "url": "https://abualiexpress.com/en/en31369/", "date": "2024-07-30 14:07", "source": "Telegram"}], "location": ".\nBEIRUT", "total_score": 0.6035513361462728, "count": 1, "average_score": 0.6035513361462728, "final_score": 0.6024859353023909}, "a8cc4477-2cb4-4e53-ac71-85b666030f37": {"messages": [{"id": "a8cc4477-2cb4-4e53-ac71-85b666030f37", "message": "The Lebanese Ministry of Health:\nOne dead and 68 injured in the Israeli attack in Beirut.", "url": "https://abualiexpress.com/en/en31412/", "date": "2024-07-30 19:40", "source": "Telegram"}, {"id": "cdbf6703-ee0a-4905-a6bc-7752f4907c1e", "message": "Lebanese Al Mayadeen: more than 60 injured in the Israeli attack in Beirut.", "url": "https://abualiexpress.com/en/en31410/", "date": "2024-07-30 19:06", "source": "Telegram"}, {"id": "84c438ad-f513-450b-be4b-e4afaab22089", "message": "Lebanese al-Mayadeen: Ten wounded in the Israeli attack in Beirut.", "url": "https://abualiexpress.com/en/en31402/", "date": "2024-07-30 17:57", "source": "Telegram"}], "location": "BEIRUT", "total_score": 1.0073357551181323, "count": 2, "average_score": 0.5036678775590662, "final_score": 0.5625675142913463}, "a7fc417c-2f75-49fb-bff3-64af3e162fa3": {"messages": [{"id": "a7fc417c-2f75-49fb-bff3-64af3e162fa3", "message": "Lebanese sources report that an Israeli fighter jet carried out the attack by dropping three bombs on the building in the Harat Harik neighborhood in the Dahieh of Beirut.\n\nIsrael \"did not listen\" to the requests of the Lebanese not to attack in Beirut - this was one of the Lebanese demands.\n\nHezbollah is expected to respond.", "url": "https://abualiexpress.com/en/en31393/", "date": "2024-07-30 17:14", "source": "Telegram"}, {"id": "4865e400-c7a0-48e6-9f88-2a67ee94ee17", "message": "Lebanese reports of an Israeli attack in the Dahieh neighborhood of Beirut - a Hezbollah stronghold.\n\nLebanese sources report that an Israeli fighter jet carried out the attack by dropping three bombs on the building in the Harat Harik neighborhood in Dahieh in Beirut.", "url": "https://abualiexpress.com/en/en31380/", "date": "2024-07-30 17:10", "source": "Telegram"}], "location": "Beirut", "total_score": 0.5686426723123971, "count": 1, "average_score": 0.5686426723123971, "final_score": 0.578049870618678}, "adf4c5c6-01a3-48f1-8dc3-1286bb9ca403": {"messages": [{"id": "adf4c5c6-01a3-48f1-8dc3-1286bb9ca403", "message": "Israel and the Iranian-backed Lebanese Hezbollah have exchanged fire almost daily over the border since the war in Gaza erupted in October.\nBut the exchanges have mounted, and the latest strike threatened reprisals and counter-reprisals that could spiral into full-fledged war.\nNetanyahu spoke as he visited the soccer field in Majdal Shams and met with leaders of the Druze community.\nIsrael and Hezbollah have been trading fire since October 8, a day after Hamas militants stormed into southern Israel.\nThe last time they went to war, in 2006, Israel inflicted massive damage in Lebanon with a bombing campaign in retaliation for a cross-border Hezbollah attack.", "url": "https://www.dailyexcelsior.com/netanyahu-vows-retaliation-against-hezbollah-after-weekend-strike-as-us-warns-against-escalation/", "date": "2024-07-30 02:30", "source": "GDELT"}, {"id": "545a949b-49ab-4137-8c8f-c576d6681186", "message": "MAJDAL SHAMS, Golan Heights — Israeli Prime Minister Benjamin Netanyahu on Monday vowed heavy retaliation against Hezbollah amid furious diplomatic efforts to prevent a spiral into regional war following a weekend rocket strike that killed 12 children in the Israeli-controlled Golan Heights.\nIsrael and the Iranian-backed Lebanese Hezbollah have exchanged fire almost daily over the border since the war in Gaza erupted in October.\nBut the exchanges have mounted, and the latest strike threatened reprisals and counter-reprisals that could spiral into full-fledged war.\nIsrael and Hezbollah have been trading fire since Oct. 8, a day after Hamas militants stormed into southern Israel.\nThe last time they went to war, in 2006, Israel inflicted massive damage in Lebanon with a bombing campaign in retaliation for a cross-border Hezbollah attack.", "url": "https://www.pressherald.com/2024/07/29/netanyahu-vows-retaliation-against-hezbollah-after-weekend-strike/", "date": "2024-07-30 03:30", "source": "GDELT"}, {"id": "ddf38b2c-5c28-44c4-bf60-e3dcd2f3415d", "message": "Israel has blamed Hezbollah for Saturday evening's rocket from Lebanon that slammed into a soccer field where the children were playing in the mainly Druze town of Majdal Shams.\nIsrael and the Iranian-backed Lebanese Hezbollah have exchanged fire almost daily over the border since the war in Gaza erupted in October.\nOur response will come, and it will be severe,” he said, adding that the rocket was fired by Hezbollah.\nIsrael and Hezbollah have been trading fire since Oct. 8, a day after Hamas militants stormed into southern Israel .\nHezbollah has far superior firepower than Hamas, with an arsenal of 150,000 rockets and missiles, including precision-guided missiles, according to Israeli estimates.", "url": "https://menafn.com/1108495953/Israeli-PM-Benjamin-Netanyahu-Vows-Retaliation-Against-Hezbollah-After-Deadly-Rocket-Strike-Kills-12-Children", "date": "2024-07-30 04:00", "source": "GDELT"}, {"id": "841724a6-fda2-41bb-9294-90ce1ca2d831", "message": "Israel and the Iranian-backed Lebanese Hezbollah have exchanged fire almost daily over the border since the war in Gaza erupted in October.\nBut the exchanges have mounted, and the latest strike threatened reprisals and counter-reprisals that could spiral into full-fledged war.\nNetanyahu spoke as he visited the soccer field in Majdal Shams and met with leaders of the Druze community.\nOur response will come, and it will be severe,” he said, adding that the rocket was fired by Hezbollah.\nIsrael and Hezbollah have been trading fire since Oct. 8, a day after Hamas militants stormed into southern Israel.", "url": "https://japantoday.com/category/world/netanyahu-vows-retaliation-against-hezbollah-after-weekend-strike-as-us-warns-against-escalation", "date": "2024-07-30 00:00", "source": "GDELT"}], "location": "Based on the information provided, it appears that the main focus of the event is the border between Israel and Lebanon. The events described", "total_score": 1.4084746893420188, "count": 3, "average_score": 0.46949156311400625, "final_score": 0.5686440941798043}, "75dffaf5-ca1d-433a-a674-dc162e90b154": {"messages": [{"id": "75dffaf5-ca1d-433a-a674-dc162e90b154", "message": "A Tuareg militant group spokesman said some Malian troops and Russian fighters had also been captured during the battle.\nAccording to some unofficial Russian Telegram channels, as many as 80 Russians were killed.\nAlso among the dead, according to several Russian Telegram channels, was one of Russia’s most popular military bloggers, Nikita Fedyanin, whose Grey Zone channel has more than half-a-million subscribers.\nThe commander – call-sign Rusich – said on Telegram he was trying to convey a message to the Russian Defense Ministry.\nAnd in Syria five years ago, a disastrous attack by Russian mercenaries on an oil refinery led to dozens of casualties.", "url": "https://krdo.com/news/2024/07/29/dozens-of-russian-mercenaries-killed-in-rebel-ambush-in-mali-in-their-worst-known-loss-in-africa/", "date": "2024-07-30 00:45", "source": "GDELT"}, {"id": "7ef6ba89-a3a3-4baf-bb74-88173423a328", "message": "A Tuareg militant group spokesman said some Malian troops and Russian fighters had also been captured during the battle.\nAccording to some unofficial Russian Telegram channels, as many as 80 Russians were killed.\nThe commander – call-sign Rusich – said on Telegram he was trying to convey a message to the Russian Defense Ministry.\nAnd in Syria five years ago, a disastrous attack by Russian mercenaries on an oil refinery led to dozens of casualties.\nOne of them was an IED attack on a Russian vehicle in the same region of Mali as the latest devastating assault.", "url": "https://edition.cnn.com/2024/07/29/africa/russian-mercenaries-wagner-killed-mali-intl-latam/", "date": "2024-07-30 01:00", "source": "GDELT"}], "location": "Based on the information provided, the main focus of the event appears to be Mali.", "total_score": 0.4182142410211487, "count": 1, "average_score": 0.4182142410211487, "final_score": 0.4727499687148041}, "e944bc77-b759-46c7-bc04-83f5da09c85c": {"messages": [{"id": "e944bc77-b759-46c7-bc04-83f5da09c85c", "message": "Israeli Prime Minister Benjamin Netanyahu pledged Monday to carry out a strong response to a rocket strike that killed 12 children in the Israel-controlled Golan Heights.\nNetanyahu visited the attack site Monday, where he reiterated Israel’s accusation that the Lebanon-based Hezbollah militant group was responsible.\n“These children are our children, they are the children of all of us,” Netanyahu said.\nIsraeli forces also carried out ground attacks and airstrikes Monday in the southern Gaza Strip.\nThe war in Gaza began with the Oct. 7 Hamas attack on southern Israel in which the militants killed 1,200 people and took about 250 hostage.", "url": "https://www.voanews.com/a/netanyahu-pledges-severe-response-to-golan-heights-attack/7718141.html", "date": "2024-07-30 04:45", "source": "GDELT"}, {"id": "514f001e-08ea-4180-83f2-a00a4e9ea610", "message": "MAJDAL SHAMS, Golan Heights: Israeli Prime Minister Benjamin Netanyahu on Monday vowed heavy retaliation against Hezbollah amid furious diplomatic efforts to prevent a spiral into regional war following a weekend rocket strike that killed 12 children in the Israeli-controlled Golan Heights.\nIsrael and the Iranian-backed Lebanese Hezbollah have exchanged fire almost daily over the border since the war in Gaza erupted in October.\nThe body of 11-year-old Guevara Ibrahim was carried through the streets of Majdal Shams in a procession of black-clad mourners.\nNetanyahu spoke as he visited the soccer field in Majdal Shams and met with leaders of the Druze community.\n“These children are our children, they are the children of all of us,” he said as officials laid a wreath on the field.", "url": "https://www.livemint.com/news/world/israeli-pm-benjamin-netanyahu-vows-retaliation-against-hezbollah-after-deadly-rocket-strike-kills-12-children-11722303258971.html", "date": "2024-07-30 05:45", "source": "GDELT"}], "location": "GAZA", "total_score": 0.6752977157885405, "count": 1, "average_score": 0.6752977157885405, "final_score": 0.6527084010519784}, "23b762ec-c404-4b5e-8022-833771a0ab78": {"messages": [{"id": "23b762ec-c404-4b5e-8022-833771a0ab78", "message": "A third girl has died in the UK after one of the worst attacks on children in decades.\nHere’s what to knowThe United Kingdom was left shaken after three children were stabbed to death and eight others were injured in a knife attack in Southport, in one of the worst assaults against children in the country in decades.\nA day later, the police said another child, a 9-year-old girl, died as a result of her injuries early Tuesday morning.\nWorst mass stabbing attack against kidsThe incident on Monday is the worst mass stabbing attack targeting children in the UK in decades – and possibly ever.\nPolice officers near the scene of a knife attack in Hart Street, Southport on Tuesday, July 30, 2024.", "url": "https://www.yahoo.com/news/uk-shock-one-worst-knife-123610617.html", "date": "2024-07-30 13:30", "source": "GDELT"}, {"id": "ddf032d8-54e4-468d-a922-3474b92ce877", "message": "By Ivana Kottasová, CNN(CNN) — The United Kingdom was left shaken after three children were stabbed to death and eight others were injured in a knife attack in Southport, in one of the worst assaults against children in the country in decades.\nOfficers said the following day that another child, a 9-year-old girl, had died as a result of her injuries.\nPolice named the girls who died in the attack as Alice Dasilva Aguiar, 9, Bebe King, 6, and 7-year-old Elsie Dot Stancombe.\nWorst mass stabbing attack against kidsThe incident on Monday is the worst mass stabbing attack targeting children in the UK in decades – and possibly ever.\nBut children have been targeted in the UK in other types of attacks.", "url": "https://krdo.com/news/2024/07/30/a-third-girl-has-died-in-the-uk-after-one-of-the-worst-attacks-on-children-in-decades-heres-what-to-know/", "date": "2024-07-30 19:15", "source": "GDELT"}], "location": "Southport.", "total_score": 0.4376939408786542, "count": 1, "average_score": 0.4376939408786542, "final_score": 0.48638575861505795}, "bbcf9ad5-3c11-479d-a2d3-acbefd06a3ee": {"messages": [{"id": "bbcf9ad5-3c11-479d-a2d3-acbefd06a3ee", "message": "Fears of wider war in Middle East after Israel strikes Hezbollah in LebanonIsrael carried out a rare strike on Beirut Tuesday, killing at least one person and raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\n\"Hezbollah crossed a red line,\" Israeli Defense Minister Yoav Gallant posted on the platform X shortly after Tuesday's strike.\nHezbollah's Al-Manar TV said 17 wounded were taken to the private Bahman Hospital, while 14 were taken to Hezbollah's Rasoul Aazam hospital.\nA Hezbollah official and the group's TV station said that an Israeli airstrike hit Hezbollah's stronghold south of Beirut on Tuesday evening, causing damage.\nThe territory's Health Ministry says over 39,300 people have been killed since Hamas' Oct. 7 attack on Israel sparked the war.", "url": "https://www.cbsnews.com/news/lebanon-israel-strikes-hezbollah-commander-beirut-suburb/", "date": "2024-07-30 19:15", "source": "GDELT"}, {"id": "16def74b-e3aa-400e-b2e9-b66ec8cb999a", "message": "BEIRUT — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\n\"Hezbollah crossed a red line,'' Israeli Defense Minister Yoav Gallant posted on the platform X shortly after Tuesday's strike.\nA Hezbollah official and the group's TV station said that the Israeli airstrike hit Hezbollah's stronghold south of Beirut on Tuesday evening, causing damage.\nThe strike hit an apartment building near to a hospital, collapsing half of the targeted building and severely damaging one next to it.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "url": "https://www.startribune.com/israel-says-it-has-struck-beirut-targeting-commander-accused-in-deaths-of-12-children-and-teens/600387645/", "date": "2024-07-30 19:15", "source": "GDELT"}], "location": "BEIRUT", "total_score": 0.5258995118377477, "count": 1, "average_score": 0.5258995118377477, "final_score": 0.5481296582864235}, "6810ec06-48f3-43e3-b7f0-a4330d78657c": {"messages": [{"id": "6810ec06-48f3-43e3-b7f0-a4330d78657c", "message": "Israel has blamed the rocket attack on the Hezbollah militant group, which has denied any role in the Saturday attack.\n“The Israeli enemy has committed a great stupid act in size, timing and circumstances by targeting an entirely civilian area,” Hezbollah official Ali Ammar told Al-Manar TV.\nThe airstrike on Beirut’s southern suburb of Haret Hreik - a crowded urban neighborhood full of small shops and apartment buildings - damaged several buildings but it was not immediately clear if any Hezbollah official was hit, the Hezbollah official said.\nThe last time Israel targeted Beirut was in January, when an airstrike killed a top Hamas official, Saleh Arouri.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "url": "https://www.nbcnewyork.com/news/national-international/israel-struck-beirut-targeting-commander-accused-deaths-golan/5649675/", "date": "2024-07-30 19:15", "source": "GDELT"}, {"id": "2c255075-151d-4f98-8835-c43d4ce5653d", "message": "BEIRUT (AP) — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\nBEIRUT (AP) — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\nA Hezbollah official and the group’s TV station said that the Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik - a crowded urban neighborhood full of small shops and apartment buildings - damaged several buildings but it was not immediately clear if any Hezbollah official was hit, the Hezbollah official said.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "url": "https://www.tricitynews.com/world-news/israeli-airstrike-hits-beirut-and-kills-1-person-in-escalating-tensions-with-hezbollah-9288490", "date": "2024-07-30 19:15", "source": "GDELT"}, {"id": "92524c11-6351-41ed-9886-a5fce66a08c5", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "url": "https://www.clydebankpost.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "date": "2024-07-30 19:15", "source": "GDELT"}, {"id": "74c9646d-fb92-48cd-8fe7-4ae26b6de262", "message": "The Israeli military said on Tuesday it carried out a strike on Lebanese capital Beirut targeting the militant commander allegedly behind the deaths of 12 children and teens in a rocket attack on the Israeli-occupied Golan Heights over the weekend.\nIsrael has blamed the rocket attack on the Hezbollah militant group, which has denied any role in the attackA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings but it was not immediately clear if any Hezbollah official was targeted, the Hezbollah official said on condition of anonymity in line with regulations.\nIsraeli Prime Minister Benjamin Netanyahu had vowed heavy retaliation against Hezbollah for Saturday's rocket strike in the Israel-controlled Golan Heights, though Hezbollah has denied any role in the attack.\nIsraeli authorities have generally denied abuses in detention facilities for Palestinians.", "url": "https://www.livemint.com/news/world/israelhamas-war-latest-israel-strikes-beirut-suburb-targeting-hezbollah-official-11722360787161.html", "date": "2024-07-30 19:00", "source": "GDELT"}], "location": "BEIRUT.", "total_score": 1.8750822112924412, "count": 3, "average_score": 0.6250274037641471, "final_score": 0.677519182634903}, "212521b3-f346-406e-9e86-4db78ea07e3f": {"messages": [{"id": "212521b3-f346-406e-9e86-4db78ea07e3f", "message": "BEIRUT (AP) — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\nBEIRUT (AP) — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\nA Hezbollah official and the group’s TV station said that the Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik - a crowded urban neighborhood full of small shops and apartment buildings - damaged several buildings but it was not immediately clear if any Hezbollah official was hit, the Hezbollah official said.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "url": "https://www.prpeak.com/world-news/israeli-airstrike-hits-beirut-and-kills-1-person-in-escalating-tensions-with-hezbollah-9288490", "date": "2024-07-30 19:15", "source": "GDELT"}, {"id": "6912f1f7-3983-45be-ac45-3745934002fd", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "url": "https://www.wiltsglosstandard.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "date": "2024-07-30 19:15", "source": "GDELT"}, {"id": "d0080ae5-b2c6-47e1-998a-e5a451428e0b", "message": "TEL AVIV, ISRAEL -Israel's military said Tuesday it carried out a strike on Beirut targeting the militant commander allegedly behind the deaths of 12 children and teens in a rocket attack on the Israeli-controlled Golan Heights over the weekend.\nA Hezbollah official and the group's TV station said that an Israeli airstrike hit Hezbollah's stronghold south of Beirut on Tuesday evening, causing damage.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nLebanon's state-run National News Agency reported that the airstrike in the southern Beirut suburb was carried out with a drone that launched three rockets.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "url": "https://www.ctvnews.ca/world/israel-says-it-has-struck-beirut-targeting-the-commander-accused-in-deaths-of-12-children-and-teens-1.6983062", "date": "2024-07-30 18:30", "source": "GDELT"}], "location": "BEIRUT.", "total_score": 1.1365591676481819, "count": 2, "average_score": 0.5682795838240909, "final_score": 0.6077957086768636}, "15cf5fa3-c4c6-47dd-b2e6-6b3b6c9eb311": {"messages": [{"id": "15cf5fa3-c4c6-47dd-b2e6-6b3b6c9eb311", "message": "BEIRUT (AP) — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\nBEIRUT (AP) — Israel carried out a rare strike Tuesday on Beirut that killed at least one person and wounded others, raising the stakes in the escalating tensions with the Lebanese militant group Hezbollah.\nA Hezbollah official and the group’s TV station said that the Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik - a crowded urban neighborhood full of small shops and apartment buildings - damaged several buildings but it was not immediately clear if any Hezbollah official was hit, the Hezbollah official said.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "url": "https://www.richmond-news.com/world-news/israeli-airstrike-hits-beirut-and-kills-1-person-in-escalating-tensions-with-hezbollah-9288490", "date": "2024-07-30 19:15", "source": "GDELT"}, {"id": "8114ea25-cb60-42f3-b769-ca0d33eaded1", "message": "“Hezbollah crossed a red line,” Israeli defence minister Yoav Gallant posted on the platform X, formerly Twitter, shortly after Tuesday’s strike.\nA Hezbollah official and the group’s TV station said that an Israeli airstrike hit Hezbollah’s stronghold south of Beirut on Tuesday evening, causing damage.\nThe airstrike on Beirut’s southern suburb of Haret Hreik damaged several buildings, the Hezbollah official said on condition of anonymity in line with regulations.\nThe strike hit an apartment building next to a hospital, collapsing half of the targeted building.\nThat strike was the first time Israel had hit Beirut since the 34-day war between Israel and Hezbollah in the summer of 2006.", "url": "https://www.cravenherald.co.uk/news/national/24487048.israel-targets-hezbollah-commander-strike-beirut-suburb/", "date": "2024-07-30 19:15", "source": "GDELT"}], "location": "BEIRUT.", "total_score": 0.5752244798307247, "count": 1, "average_score": 0.5752244798307247, "final_score": 0.5826571358815072}, "7fe5f145-2659-4dcb-9093-e437a2d6a11f": {"messages": [{"id": "7fe5f145-2659-4dcb-9093-e437a2d6a11f", "message": "Israeli medics on Tuesday said one civilian, a 30-year-old man, was killed following a rocket attack on the northern kibbutz of HaGoshrim.\n– ‘Constant anxiety’ –Hezbollah has been exchanging near-daily fire with Israel in solidarity with its ally Hamas since war erupted in Gaza in October.\nLebanon has been bracing for major retaliatory strikes following the Golan attack, amid international efforts to defuse tensions.\nScores of Majdal Shams residents had come out to protest Netanyahu’s visit after the burial of the last of the victims of the rocket strike.\nA paramedic from Majdal Shams, Nabih Abu Saleh, told AFP his community was “against any Israeli response”, and asked: “Who will we strike?", "url": "https://www.digitaljournal.com/world/israel-hezbollah-exchange-fire-amid-calls-for-restraint-after-golan-attack/article", "date": "2024-07-30 15:30", "source": "GDELT"}, {"id": "02ca6f4a-59de-4252-930c-4f1fd7638652", "message": "JERUSALEM, July 30, 2024 (BSS/AFP) - Israel and Hezbollah exchanged deadlyfire on Tuesday, following a rocket attack from Lebanon on the Golan Heightsthat killed 12 children over the weekend and sent regional tensions soaring.\nDuring a visit Monday to Majdal Shams, Israeli Prime Minister BenjaminNetanyahu vowed a \"severe response\", raising fears yet again that the Gazawar could spill over into a wider regional conflagration, despiteinternational appeals for calm.\n- 'Constant anxiety' -Hezbollah has been exchanging near-daily fire with Israel in solidarity withits ally Hamas since war erupted in Gaza in October.\nScores of Majdal Shams residents had come out to protest Netanyahu's visitafter the burial of the last of the victims of the rocket strike.\nA paramedic from Majdal Shams, Nabih Abu Saleh, told AFP his community was\"against any Israeli response\", and asked: \"Who will we strike?", "url": "https://www.bssnews.net/international/201900", "date": "2024-07-30 17:00", "source": "GDELT"}], "location": "Israel", "total_score": 0.5378309729064039, "count": 1, "average_score": 0.5378309729064039, "final_score": 0.5564816810344827}}