{"0bccfee5-2f62-4e36-90db-73aa129d7907": {"messages": [{"id": "0bccfee5-2f62-4e36-90db-73aa129d7907", "message": "The U.S. military killed a senior ISIS official via airstrike June 16 in Syria, U.S. Central Command (CENTCOM) announced on Twitter.\n“On June 16, U.S. Central Command conducted an airstrike in Syria, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior ISIS official and facilitator,” the statement reveals.\n(RELATED: Biden Admin ‘At Risk’ Of Letting Suspected Terrorists Into The Country, Watchdog Finds)CENTCOM further stated there was “no indication any civilians were harmed in this strike.”U.S. Central Command Airstrike in Syria Kills Senior ISIS Official On June 16, U.S. Central Command conducted an airstrike in Syria, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior ISIS official and facilitator.\nU.S. military officials revealed Somalian ISIS leader Abdulqadir Mumin as the target of the attack but could not say for certain whether he had been killed, according to NBC News.\nThe presence of ISIS militants across Somalia is estimated to be between 100 and 200 fighters, a senior defense official told the outlet.", "url": "https://dailycaller.com/2024/06/19/senior-terrorist-isis-centcom-central-command-airstrike-us-military/", "date": "2024-06-19 22:00", "source": "GDELT"}, {"id": "36b5ab7a-c21e-463f-a715-8177488591e7", "message": "X | ANIWashington, DC: A senior ISIS official was killed in a US airstrike in Syria on Sunday, the US Central Command said in a statement on Wednesday (local time).\nThe senior ISIS official and facilitator have been identified as Usamah Jamal Muhammad Ibrahim al-Janabi.\nThe US Central Command said that his death would disrupt ISIS's ability to conduct terror attacks.\nIn a statement shared on X, US Central Command stated, \"US Central Command Airstrike in Syria Kills Senior ISIS Official On June 16, US Central Command conducted an airstrike in Syria, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior ISIS official and facilitator.\"\nU.S. Central Command Airstrike in Syria Kills Senior ISIS OfficialOn June 16, U.S. Central Command conducted an airstrike in Syria, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior ISIS official and facilitator.", "url": "https://www.freepressjournal.in/world/us-key-isis-official-usamah-al-janabi-killed-in-airstrike-in-syria-central-command-confirms", "date": "2024-06-20 05:30", "source": "GDELT"}], "location": "Syria", "total_score": 0.59457871136284, "count": 1, "average_score": 0.59457871136284, "final_score": 0.596205097953988}, "af0c89a1-cd98-4af9-861c-1fd7fe89e23b": {"messages": [{"id": "af0c89a1-cd98-4af9-861c-1fd7fe89e23b", "message": "The Lebanese Hezbollah resistance forces have conducted a strike against Israeli military positions in the northern side of the 1948 occupied territories in retaliation for a deadly attack on a town in southern Lebanon.\nHezbollah said that the operation was conducted in reprisal for an Israeli drone strike that targeted a car in Lebanon’s southern town of Borgholiya, killing a man.\nEarlier, missiles launched by Hezbollah had hit an Israeli military factory.\nHezbollah has been carrying out almost daily rocket attacks on Israeli positions in retaliation for the regime’s aggression against Lebanon and in solidarity with Palestinians.\nTwo Israeli wars waged against Lebanon in 2000 and 2006 were met with strong resistance from Hezbollah, resulting in the retreat of the regime in both conflicts.", "url": "http://www.presstv.ir/Detail/2024/06/19/727752/Hezbollah-targets-Israeli-outposts-in-reprisal-for-southern-Lebanon-aggression", "date": "2024-06-19 10:15", "source": "GDELT"}, {"id": "2e467785-8f1a-454f-a527-d427164fa5e3", "message": "Hezbollah strikes Israeli military factory, outposts in response to attack on LebanonIran Press TVWednesday, 19 June 2024 9:56 AMThe Lebanese Hezbollah resistance forces have conducted a strike against Israeli military positions in the northern side of the 1948 occupied territories in retaliation for a deadly attack on a town in southern Lebanon.\nThe statement added that the attack hit the designated targets precisely.\nHezbollah said that the operation was conducted in reprisal for an Israeli drone strike that targeted a car in Lebanon's southern town of Borgholiya, killing a man.\nEarlier, missiles launched by Hezbollah had hit an Israeli military factory.\nTwo Israeli wars waged against Lebanon in 2000 and 2006 were met with strong resistance from Hezbollah, resulting in the retreat of the regime in both conflicts.", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240619-presstv06.htm", "date": "2024-06-20 11:45", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.3849919560589564, "count": 1, "average_score": 0.3849919560589564, "final_score": 0.4494943692412695}, "947394e4-f66d-4155-ac1d-3af985b4a02a": {"messages": [{"id": "947394e4-f66d-4155-ac1d-3af985b4a02a", "message": "US military says it killed a senior ISIS official in Syria airstrikeA senior ISIS official was killed in a US airstrike on Sunday in Syria, the US military said Wednesday in a post on X.\n“On June 16, US Central Command conducted an airstrike in Syria, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior ISIS official and facilitator,” the post from US Central Command said.\nNearly three weeks ago, an airstrike in a remote area near Dhaardaar in Somalia was assessed to have killed three ISIS militants, according to US Africa Command.\nBetween January and March 2024, CENTCOM and its partners killed seven ISIS operatives in Syria and detained 27 more.\n“We continue to focus our efforts on specifically targeting those members of ISIS who are seeking to conduct external operations outside of Iraq and Syria and those ISIS members attempting to break out ISIS members in detention in an attempt to reconstitute their forces.”For more CNN news and newsletters create an account at CNN.com", "url": "https://www.yahoo.com/news/us-military-says-killed-senior-200452445.html", "date": "2024-06-19 21:15", "source": "GDELT"}, {"id": "07051c93-f463-4780-a62c-879f3ed66f3e", "message": "A senior ISIS official was killed in a US airstrike on Sunday in Syria, the US military says.\nNearly three weeks ago, an airstrike in a remote area near Dhaardaar in Somalia was assessed to have killed three ISIS militants, according to US Africa Command.\nBetween January and March 2024, CENTCOM and its partners killed seven ISIS operatives in Syria and detained 27 more.\nThe staggering sums countries spend on defending themselves View GalleryIn Iraq during the same time period, 11 operatives were killed and 36 people were detained.\n\"We continue to focus our efforts on specifically targeting those members of ISIS who are seeking to conduct external operations outside of Iraq and Syria and those ISIS members attempting to break out ISIS members in detention in an attempt to reconstitute their forces.\"", "url": "https://www.9news.com.au/world/us-claims-senior-isis-officer-killed-in-syria-airstrike/72e587c2-0342-43f0-8213-c2c2f5e9f896", "date": "2024-06-20 06:15", "source": "GDELT"}], "location": "Syria", "total_score": 0.47132267287938157, "count": 1, "average_score": 0.47132267287938157, "final_score": 0.5099258710155671}, "97b97662-993b-4118-aa75-8b234e62b143": {"messages": [{"id": "97b97662-993b-4118-aa75-8b234e62b143", "message": "The US Central Command said on Wednesday it had conducted an airstrike in Syria that killed a senior Islamic State official and facilitator named Usamah Jamal Muhammad Ibrahim al-Janabi.\n\"His death will disrupt ISIS's ability to resource and conduct terror attacks,\" it said in a statement on X.\nIt said: \"There is no indication any civilians were harmed in this strike.\"", "url": "https://indianexpress.com/article/world/us-army-kills-senior-islamic-state-official-syria-9402868/", "date": "2024-06-19 19:15", "source": "GDELT"}, {"id": "120deaf9-f0bc-481d-b768-c255b7ec0b86", "message": "Shafaq News / The US Central Command (CENTCOM) announced, on Wednesday, the killing of a senior ISIS leader in an airstrike in Syria.\nCENTCOM stated, \"On June 16, US Central Command conducted an airstrike in Syria, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior ISIS official and facilitator.\nHis death will disrupt ISIS’s ability to resource and conduct terror attacks.\"\nAffirming its commitment to allies and partners in the region, CENTCOM stated that it \"will continue to execute operations to degrade ISIS operational capabilities and ensure its enduring defeat.\"\n\"There is no indication any civilians were harmed in this strike.\"", "url": "https://shafaq.com/en/World/CENTCOM-announces-killing-senior-ISIS-leader-in-Syria", "date": "2024-06-19 21:30", "source": "GDELT"}, {"id": "8d31f11c-b126-4015-941f-5ec4be2e4f3c", "message": "(MENAFN- Kuwait News Agency (KUNA)) WASHINGTON, June 19 (KUNA) - The US Central Command said Wednesday that its forces have killed a senior Islamic State group in an in Syria early this week.\nIn a press statement, the CENTCOM announced that it had conducted an airstrike in Syria on June 16, killing Usamah Jamal Muhammad Ibrahim al-Janabi, a senior official and facilitator.\n\"His death will disrupt ISIS's ability to resource and conduct terror attacks,\" reads the statement.\nIt vowed that it, alongside allies and partners in the region, will continue to execute operations to degrade ISIS operational capabilities and ensure its enduring defeat.\nIt affirmed that there is no indication any civilians were harmed in this strike.", "url": "https://menafn.com/1108351166/CENTCOM-US-Airstrike-In-Syria-Kills-Senior-ISIS-Militant", "date": "2024-06-20 01:15", "source": "GDELT"}], "location": "Syria", "total_score": 1.1954916406901621, "count": 2, "average_score": 0.5977458203450811, "final_score": 0.6284220742415567}, "6fabda39-94b7-4863-9b53-0e25f3276973": {"messages": [{"id": "6fabda39-94b7-4863-9b53-0e25f3276973", "message": "DUBAI: A merchant ship is thought to have sunk in the Red Sea after a deadly attack by Yemeni Houthis that forced it to be abandoned last week, a security agency said.\nThe MV Tutor, which was holed during an attack that left one Filipino sailor dead, is “believed to have sunk”, the United Kingdom Maritime Trade Operations said late Tuesday.\nNational Security Council spokesman John Kirby said a Sri Lankan crew member was critically wounded in a separate Houthi attack on the MV Verbena on Thursday.\nHouthis claim attack on merchant ship in Red Sea off YemenThe Tutor appears to be the second ship sunk by the Houthis in recent months after the Rubymar, carrying thousands of tonnes of fertiliser, went down in the Red Sea in March after a missile strike.\nThe Houthis, who seized Yemen’s capital Sanaa in 2014, have been at war with a Saudi-led coalition since 2015.", "url": "https://www.brecorder.com/news/40308921/ship-believed-to-have-sunk-after-red-sea-attack-security-agency", "date": "2024-06-19 11:45", "source": "GDELT"}, {"id": "13d4c825-29f4-4ba5-838d-7de05f1c88fa", "message": "DUBAI (AFP): A merchant ship is thought to have sunk in the Red Sea after a deadly attack by Yemeni rebels that forced it to be abandoned last week, a security agency said.\nThe MV Tutor, which was holed during an attack that left one Filipino sailor dead, is “believed to have sunk”, the United Kingdom Maritime Trade Operations said late Tuesday.\nIt was evacuated in a military operation on Friday and left drifting, its engine room breached and taking on water.\nThe Iran-backed Huthi rebels have launched scores of drone and missile attacks on the vital sea route since November, describing them as retaliation for the Israel-Hamas war.\nThe Tutor appears to be the second ship sunk by the Huthis in recent months after the Rubymar, carrying thousands of tonnes of fertiliser, went down in the Red Sea in March after a missile strike.", "url": "https://thefrontierpost.com/ship-believed-to-have-sunk-after-yemeni-rebels-attack-in-red-sea/", "date": "2024-06-19 13:45", "source": "GDELT"}], "location": "The main focus of the event takes place in the Red Sea.", "total_score": 0.4303886170364388, "count": 1, "average_score": 0.4303886170364388, "final_score": 0.48127203192550716}, "3edadf82-f313-490c-93ba-a58e7f7f2357": {"messages": [{"id": "3edadf82-f313-490c-93ba-a58e7f7f2357", "message": "A cargo ship sank in the Red Sea Wednesday after being attacked by Yemen's Houthi rebels, the U.K. military's Maritime Trade Operations center (UKMTO) said in a notice to other sailors in the region.\nThe ship, a Liberian-flagged bulk carrier called the Tutor, was the second to sink due to a Houthi attack.\nThe United States Navy assisted in evacuating the crew of the ship when it was attacked on June 12.\n5th Fleet/HandoutHouthi attacks on commercial vessels have continued in the vital shipping corridors of the Red Sea and surrounding waters since November.\nThe U.S. accused Iran in December of being \"deeply involved\" in the attacks on Red Sea shipping.", "url": "https://www.yahoo.com/news/second-ship-attacked-yemens-houthi-171736679.html", "date": "2024-06-19 18:00", "source": "GDELT"}, {"id": "61a35fca-beca-44f8-931b-7e733b7333a2", "message": "DUBAI, United Arab Emirates (AP) — A bulk carrier sank days after an attack by Yemen's Houthi rebels believed to have killed one mariner on board, authorities said early Wednesday, the second ship sunk in the rebels' campaign.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military's United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carried a load of fertilizer sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency acknowledged container shipping through Red Sea has declined by 90% since December over the attacks.", "url": "https://www.durangoherald.com/articles/ship-attacked-by-yemens-houthi-rebels-in-fatal-assault-sinks-in-red-sea-in-second-such-sinking/", "date": "2024-06-19 02:45", "source": "GDELT"}, {"id": "0a3a9e94-74ee-424d-9758-534aa2980354", "message": "Ship attacked by Yemen’s Houthi rebels in fatal assault sinks in Red Sea in second-such sinkingDUBAI, United Arab Emirates — A bulk carrier sank days after an attack by Yemen's Houthi rebels believed to have killed one mariner on board, authorities said early Wednesday, the second-such ship to be sunk in the rebel campaign.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military's United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carried a load of fertilizer sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency acknowledged container shipping through Red Sea has declined by 90% since December over the attacks.", "url": "https://lasvegassun.com/news/2024/jun/18/ship-attacked-by-yemens-houthi-rebels-in-fatal-ass/", "date": "2024-06-19 03:15", "source": "GDELT"}, {"id": "8291eae4-eb47-4582-ab81-86251a4e8f57", "message": "It was the second ship sunk in the rebels’ campaign targeting Red Sea shipping.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military's United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nThe Cole is now part of a US Navy operation in the Red Sea led by the aircraft carrier USS Dwight D. Eisenhower to try and halt the Houthi attacks, though the rebels continue their assaults.\nAdvertisementIn March, the Belize-flagged Rubymar carrying fertilizer cargo sank in the Red Sea after taking on water for days following a rebel attack.", "url": "https://www.bostonglobe.com/2024/06/19/world/ship-attacked-by-yemens-houthi-rebels-fatal-assault-sinks-red-sea-their-second-sinking-2/", "date": "2024-06-19 23:30", "source": "GDELT"}, {"id": "e588e486-7315-4d79-9e87-4d08a48d1d30", "message": "It was the second ship sunk in the rebels' campaign targeting Red Sea shipping.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military's United Kingdom Maritime Trade Operations centre said in a warning to sailors in the region.\nAlso read | Houthis believed to have sunk second ship in the Red Sea: UKMTOThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nThe Cole is now part of a US Navy operation in the Red Sea led by the aircraft carrier USS Dwight D. Eisenhower to try and halt the Houthi attacks, though the rebels continue their assaults.\nIn March, the Belize-flagged Rubymar carrying fertiliser cargo sank in the Red Sea after taking on water for days following a rebel attack.", "url": "https://indianexpress.com/article/world/ship-attacked-yemen-houthi-rebels-assault-sinks-red-sea-9402844/", "date": "2024-06-19 16:45", "source": "GDELT"}, {"id": "e9750642-91ae-4c8a-9208-9296124c408b", "message": "A bulk carrier sank days after an attack by Yemen’s Houthi rebels believed to have killed one mariner on board, authorities said early Wednesday, the second ship sunk in the rebels’ campaign.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carried a load of fertilizer sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency acknowledged container shipping through Red Sea has declined by 90% since December over the attacks.", "url": "https://www.newdelhitimes.com/ship-attacked-by-yemens-houthi-rebels-in-fatal-assault-sinks-in-red-sea-in-their-second-sinking/", "date": "2024-06-20 04:45", "source": "GDELT"}], "location": "The Red Sea", "total_score": 3.462377464438778, "count": 5, "average_score": 0.6924754928877557, "final_score": 0.7847328450214289}, "143b6d73-58f3-43c4-b8e9-f9c95e01b3d9": {"messages": [{"id": "143b6d73-58f3-43c4-b8e9-f9c95e01b3d9", "message": "Israel views Hezbollah as its most direct threat, and the two fought a 34-day war in 2006 that ended in a stalemate.\nHezbollah said at least four of its fighters were killed in Israeli strikes on Wednesday as Hochstein returned to Israel for a new round of meetings there.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also over 80 civilians and non-combatants.\nIn northern Israel, 16 soldiers and 11 civilians have been killed by strikes launched from Lebanon.", "url": "https://www.yahoo.com/news/leader-lebanons-militant-hezbollah-group-172142069.html", "date": "2024-06-19 18:15", "source": "GDELT"}, {"id": "1437c674-eb7d-48de-ad8e-366381b946f8", "message": "BEIRUT (AP) — Lebanon’s Hezbollah has new weapons and intelligence capabilities that could help it target more critical positions deeper inside Israel in case of an all-out war, the militant group’s leader warned on Wednesday.\nIsrael views Hezbollah as its most direct threat, and the two fought a 34-day war in 2006 that ended in a stalemate.\nHezbollah said at least four of its fighters were killed in Israeli strikes on Wednesday as Hochstein returned to Israel for a new round of meetings there.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also over 80 civilians and non-combatants.", "url": "https://www.whec.com/national-world/the-leader-of-lebanons-militant-hezbollah-group-warns-archenemy-israel-against-wider-war/", "date": "2024-06-19 19:00", "source": "GDELT"}, {"id": "70115962-e297-4eb0-879c-6f13cf83199f", "message": "The Latest | Hezbollah says Israeli strikes kill 3 fighters as US envoy tries to calm tensionsIsraeli strikes in southern Lebanon killed three Hezbollah fighters on Wednesday, the militant group said, as a U.S. envoy tasked with avoiding a devastating regional war returned to Israel after meeting officials in Lebanon.\nLebanese state media reported multiple Israeli strikes along the border and in an area north of the coastal city of Tyre, about 30 kilometers (20 miles) from the frontier.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nLebanese state media reported multiple Israeli strikes along the border and in an area north of the coastal city of Tyre, about 30 kilometers (20 miles) from the frontier.\nIsraeli strikes already have killed more than 400 people in Lebanon, most of them Hezbollah fighters, but at least 80 of the fatalities were civilians.", "url": "https://isp.netscape.com/news/world/story/0001/20240619/0683f3e1b28dd6afe5451dafc07edb7e", "date": "2024-06-19 12:45", "source": "GDELT"}, {"id": "2e3812dd-d939-4771-bef7-20036827dac1", "message": "The leader of Lebanon’s Hezbollah militant group warns archenemy Israel against wider war View PhotoBEIRUT (AP) — Lebanon’s Hezbollah has new weapons and intelligence capabilities that could help it target more critical positions deeper inside Israel in case of an all-out war, the militant group’s leader warned on Wednesday.\nIsrael views Hezbollah as its most direct threat, and the two fought a 34-day war in 2006 that ended in a stalemate.\nHezbollah said at least four of its fighters were killed in Israeli strikes on Wednesday as Hochstein returned to Israel for a new round of meetings there.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also over 80 civilians and non-combatants.", "url": "https://www.mymotherlode.com/news/middle-east/3378158/the-leader-of-lebanons-militant-hezbollah-group-warns-archenemy-israel-against-wider-war.html", "date": "2024-06-19 18:45", "source": "GDELT"}, {"id": "e4fc0d88-4c06-4f6a-8aec-d1ae23285fa9", "message": "The leader of Lebanon's Hezbollah militant group warns archenemy Israel against wider warBEIRUT (AP) — Lebanon’s Hezbollah has new weapons and intelligence capabilities that could help it target more critical positions deeper inside Israel in case of an all-out war, the militant group's leader warned on Wednesday.\nIsrael views Hezbollah as its most direct threat, and the two fought a 34-day war in 2006 that ended in a stalemate.\nHezbollah said at least four of its fighters were killed in Israeli strikes on Wednesday as Hochstein returned to Israel for a new round of meetings there.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also over 80 civilians and non-combatants.", "url": "https://isp.netscape.com/news/world/story/0001/20240619/d3296bff6264582b7e7b90fe6061b16f", "date": "2024-06-20 03:00", "source": "GDELT"}, {"id": "ddf59ac7-a51a-4662-b3e6-6908e989187b", "message": "(AP) — Lebanon’s Hezbollah has new weapons and intelligence capabilities that could help it target more critical positions deeper inside Israel in case of an all-out war, the militant group’s leader warned on Wednesday.\nIsrael views Hezbollah as its most direct threat, and the two fought a 34-day war in 2006 that ended in a stalemate.\nHezbollah said at least four of its fighters were killed in Israeli strikes on Wednesday as Hochstein returned to Israel for a new round of meetings there.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also over 80 civilians and non-combatants.\nIn northern Israel, 16 soldiers and 11 civilians have been killed by strikes launched from Lebanon.", "url": "https://www.kurv.com/the-leader-of-lebanons-militant-hezbollah-group-warns-archenemy-israel-against-wider-war/", "date": "2024-06-20 00:00", "source": "GDELT"}, {"id": "5b80e1cf-e358-46d1-8656-d9179562c0fd", "message": "The leader of Lebanon’s Hezbollah militant group warns archenemy Israel against wider warBilal Hussein / APBEIRUT — Lebanon’s Hezbollah has new weapons and intelligence capabilities that could help it target more critical positions deeper inside Israel in case of an all-out war, the militant group's leader warned on Wednesday.\nIsrael views Hezbollah as its most direct threat, and the two fought a 34-day war in 2006 that ended in a stalemate.\nHezbollah said at least four of its fighters were killed Wednesday in Israeli strikes as Hochstein returned to Israel for a new round of meetings there.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also over 80 civilians and non-combatants.", "url": "https://lasvegassun.com/news/2024/jun/19/the-leader-of-lebanons-hezbollah-militant-group-wa/", "date": "2024-06-20 08:30", "source": "GDELT"}, {"id": "9a1b859e-b101-4e59-9cff-9c4d74cb5bd4", "message": "Smoke rises above Lebanon, following an Israeli strike, as seen from Israel's border with Lebanon in northern Israel, on May 5.\nHundreds killed near Lebanon border since Oct. 7Israel views Hezbollah as its most direct threat, and the two fought a 34-day war in 2006 that ended in a stalemate.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also over 80 civilians and non-combatants.\nIn northern Israel, 16 soldiers and 11 civilians have been killed by strikes launched from Lebanon.", "url": "https://www.cbc.ca/news/world/israel-hezbollah-lebanon-1.7240784", "date": "2024-06-20 14:30", "source": "GDELT"}, {"id": "bdfa02d8-fdab-436b-8400-07c55b5c9ee5", "message": "Lebanon's Hezbollah has new weapons and intelligence capabilities that could help it target more critical positions deeper inside Israel in case of an all-out war , the militant group's leader has warned.\nHezbollah supporters watch a speech given by Hezbollah leader Sayyed Hassan Nasrallah on a screen during a ceremony to commemorate the death of senior Hezbollah commander Taleb Sami Abdullah.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nIsraeli strikes have killed more than 400 people in Lebanon, most of them Hezbollah and other militants, but also more than 80 civilians and non-combatants.\nIn northern Israel, 16 soldiers and 11 civilians have been killed by strikes launched from Lebanon.", "url": "https://www.9news.com.au/world/israel-gaza-update-leader-of-lebanons-hezbollah-militant-group-warns-archenemy-israel-against-wider-war/cb71a28f-28c4-4129-a986-2aa98349c5b0", "date": "2024-06-20 15:45", "source": "GDELT"}], "location": "Lebanon", "total_score": 3.655422405193333, "count": 8, "average_score": 0.4569278006491666, "final_score": 0.7098494604544167}, "80f5cf2b-2164-4a3a-bf1a-704b779e1c15": {"messages": [{"id": "80f5cf2b-2164-4a3a-bf1a-704b779e1c15", "message": "Ship attacked by Yemen's Houthi rebels in fatal assault sinks in Red Sea in their second sinkingDUBAI, United Arab Emirates (AP) — A bulk carrier sank days after an attack by Yemen's Houthi rebels, who are believed to have killed one mariner on board, authorities said early Wednesday.\nIt was the second ship sunk in the rebels' campaign targeting Red Sea shipping.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military's United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carrying fertilizer cargo sank in the Red Sea after taking on water for days following a rebel attack.", "url": "https://www.yahoo.com/news/ship-attacked-yemens-houthi-rebels-004507440.html", "date": "2024-06-19 01:15", "source": "GDELT"}, {"id": "39fdd793-b01d-411d-870a-5f50d18292d7", "message": "Houthis sink another ship in fatal assault in Red SeaWorld World Houthis sink another ship in fatal assault in Red SeaThe sinking of the Tutor in the Red Sea marks what appears to be a new escalation by HouthisFollow on Published On: Wed, 19 Jun 2024 09:37:44 PKTDUBAI, United Arab Emirates (AP) — A bulk carrier sank days after an attack by Yemen’s Houthi rebels believed to have killed one mariner on board, authorities said early Wednesday, the second-such ship to be sunk in the rebel campaign.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carried a load of fertilizer sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the US Defense Intelligence Agency acknowledged container shipping through Red Sea has declined by 90% since December over the attacks.", "url": "https://dunyanews.tv/en/World/819233-Houthis-sink-another-ship-in-fatal-assault-in-Red-Sea", "date": "2024-06-19 05:00", "source": "GDELT"}, {"id": "81e5bb99-58f5-43bc-a883-e459cbeafb5a", "message": "It was the second ship sunk in the rebels' campaign targeting Red Sea shipping.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military's United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carrying fertilizer cargo sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency said that container shipping through the Red Sea has declined by 90% since December because of the attacks.", "url": "https://www.local10.com/news/world/2024/06/19/ship-attacked-by-yemens-houthi-rebels-in-fatal-assault-sinks-in-red-sea-in-second-such-sinking/", "date": "2024-06-19 02:00", "source": "GDELT"}, {"id": "40274547-c073-4def-854b-8f013742640b", "message": "It was the second ship sunk in the rebels’ campaign targeting Red Sea shipping.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carrying fertilizer cargo sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency said that container shipping through the Red Sea has declined by 90% since December because of the attacks.", "url": "https://www.metro.us/ship-attacked-by-yemens-houthi-rebels-in-fatal-assault-sinks-in-red-sea-in-second-such-sinking/", "date": "2024-06-19 06:00", "source": "GDELT"}, {"id": "ca3c11c7-c139-4bb3-a3f4-3b94b13eed9a", "message": "Dubai, Jun 19 : A bulk carrier sank days after an attack by Yemen’s Houthi rebels believed to have killed one mariner on board, authorities said early Wednesday, the second ship sunk in the rebels’ campaign.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military’s United Kingdom Maritime Trade Operations centre said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nJohn Kirby, a White House national security spokesman, said on Monday that the attack killed “a crew member who hailed from the Philippines”.\nIn March, the Belize-flagged Rubymar carried a load of fertilizer sank in the Red Sea after taking on water for days following a rebel attack.", "url": "https://www.dailyexcelsior.com/ship-attacked-by-yemens-houthi-rebels-in-fatal-assault-sinks-in-red-sea-in-their-second-sinking/", "date": "2024-06-19 09:30", "source": "GDELT"}, {"id": "06e14178-9d3c-4c21-8861-2782b46c3b13", "message": "It was the second ship sunk in the rebels' campaign targeting Red Sea shipping.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military's United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carrying fertilizer cargo sank in the Red Sea after taking on water for days following a rebel attack.\nIt also claimed destroying two Houthi drone boats in the Red Sea as well over the last 24 hours.", "url": "https://www.pressdemocrat.com/article/trending/ship-attacked-by-yemens-houthi-rebels-in-fatal-assault-sinks-in-red-sea-in/", "date": "2024-06-20 04:15", "source": "GDELT"}], "location": "SANA'A", "total_score": 2.299943258390858, "count": 5, "average_score": 0.4599886516781716, "final_score": 0.6219920561747201}, "ca3ecfa1-5a70-406a-bcab-11d12dedcd47": {"messages": [{"id": "ca3ecfa1-5a70-406a-bcab-11d12dedcd47", "message": "Lebanese state media reported multiple Israeli strikes along the border and in an area north of the coastal city of Tyre, about 30 kilometers (20 miles) from the frontier.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nLebanese state media reported multiple Israeli strikes along the border and in an area north of the coastal city of Tyre, about 30 kilometers (20 miles) from the frontier.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nIsraeli strikes already have killed more than 400 people in Lebanon, most of them Hezbollah fighters, but at least 80 of the fatalities were civilians.", "url": "https://www.ksat.com/news/2024/06/19/the-latest-a-second-ship-sinks-in-yemens-houthi-rebels-red-sea-campaign-against-israel-hamas-war/", "date": "2024-06-19 11:00", "source": "GDELT"}, {"id": "edabd16e-31f3-4c68-87fa-adb70aa019ef", "message": "Israeli strikes in southern Lebanon killed three Hezbollah fighters on Wednesday, the militant group said, as a U.S. envoy tasked with avoiding a devastating regional war returned to Israel after meeting officials in Lebanon.\nLebanese state media reported multiple Israeli strikes along the border and in an area north of the coastal city of Tyre, about 30 kilometers (20 miles) from the frontier.\nIsraeli Prime Minister Benjamin Netanyahu claimed Tuesday that the United States was withholding weapons needed for the war in Gaza.\nLebanese state media reported multiple Israeli strikes along the border and in an area north of the coastal city of Tyre, about 30 kilometers (20 miles) from the frontier.\nIsraeli strikes already have killed more than 400 people in Lebanon, most of them Hezbollah fighters, but at least 80 of the fatalities were civilians.", "url": "https://www.kob.com/news/us-and-world-news/the-latest-hezbollah-says-israeli-strikes-kill-3-fighters-as-us-envoy-tries-to-calm-tensions/", "date": "2024-06-19 13:00", "source": "GDELT"}, {"id": "95e3bd1a-8523-4245-9ffb-d3dc57e7b08b", "message": "The Latest | Hezbollah says Israeli strikes kill 3 fighters as US envoy tries to calm tensionsPalestinians displaced by the Israeli air and ground offensive on the Gaza Strip walk through a makeshift tent camp in Khan Younis, Gaza, Tuesday, June 18, 2024.\nLebanese state media reported multiple Israeli strikes along the border and in an area north of the coastal city of Tyre, about 30 kilometers (20 miles) from the frontier.\nThe Israeli military said two Hezbollah launches damaged several vehicles in northern Israel.\nLebanese state media reported multiple Israeli strikes along the border and in an area north of the coastal city of Tyre, about 30 kilometers (20 miles) from the frontier.\nIsraeli strikes already have killed more than 400 people in Lebanon, most of them Hezbollah fighters, but at least 80 of the fatalities were civilians.", "url": "https://infotel.ca/newsitem/ml-mideast-tensions-the-latest/cp360277477", "date": "2024-06-19 12:00", "source": "GDELT"}, {"id": "d9d53b25-51b0-44fb-88de-f7aa47d8c4d0", "message": "×Israeli strikes in southern Lebanon killed three Hezbollah fighters on Wednesday, the militant group said, as a U.S. envoy tasked with avoiding a devastating regional war returned to Israel after meeting officials in Lebanon.\nLebanese state media reported multiple Israeli strikes along the border and in an area north of the coastal city of Tyre, about 30 kilometers (20 miles) from the frontier.\nIsraeli Prime Minister Benjamin Netanyahu claimed Tuesday that the United States was withholding weapons needed for the war in Gaza.\nLebanese state media reported multiple Israeli strikes along the border and in an area north of the coastal city of Tyre, about 30 kilometers (20 miles) from the frontier.\nIsraeli strikes already have killed more than 400 people in Lebanon, most of them Hezbollah fighters, but at least 80 of the fatalities were civilians.", "url": "https://www.durangoherald.com/articles/the-latest-a-second-ship-sinks-in-yemens-houthi-rebels-red-sea-campaign-against-israel-hamas-war/", "date": "2024-06-19 12:45", "source": "GDELT"}], "location": "Lebanon", "total_score": 1.3011053774059527, "count": 3, "average_score": 0.43370179246865087, "final_score": 0.5435912547280556}, "b0cab180-d7c2-4de6-83fc-d89a0d3749de": {"messages": [{"id": "b0cab180-d7c2-4de6-83fc-d89a0d3749de", "message": "They did not identify the fatalities, and the Israeli military said it was looking into the report.\nThe Israeli military remained in control of the border between Rafah and Egypt.\nThe Israeli military said aid into Gaza had not been impeded by the damage.\nLater on Wednesday, Palestinian gunmen fired rockets at the Kerem Shalom crossing in southern Gaza, the Israeli military said.\nIn a report assessing six Israeli attacks that caused a high number of casualties and destruction of civilian infrastructure, the U.N. Human Rights Office said Israeli forces \"may have systematically violated the principles of distinction, proportionality, and precautions in attack\".", "url": "https://japantoday.com/category/world/israeli-tanks-push-deeper-into-rafah-forcing-people-to-flee-again2", "date": "2024-06-19 22:45", "source": "GDELT"}, {"id": "72d65f04-7a78-4f4a-a1ae-e5743613fd8c", "message": "They did not identify the fatalities, and the Israeli military said it was looking into the report.\nThe Israeli military remained in control of the border between Rafah and Egypt.\nAdvertisementThe Israeli military said aid into Gaza had not been impeded by the damage.\nIn another Gaza City suburb, Sheikh Radwan, an Israeli air strike on a house killed four Palestinians, including a child, medics said.\nAdvertisementLater on Wednesday, Palestinian gunmen fired rockets at the Kerem Shalom crossing in southern Gaza, the Israeli military said.", "url": "https://www.firstpost.com/world/israel-goes-deeper-into-rafah-more-people-flee-gaza-city-13784166.html", "date": "2024-06-20 03:15", "source": "GDELT"}], "location": "GAZA", "total_score": 0.4764020428809985, "count": 1, "average_score": 0.4764020428809985, "final_score": 0.513481430016699}, "658f97d6-6134-4b81-829d-de305f179693": {"messages": [{"id": "658f97d6-6134-4b81-829d-de305f179693", "message": "The Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nThe Cole is now part of a U.S. Navy operation led by the aircraft carrier USS Dwight D. Eisenhower in the Red Sea to try and halt the Houthi attacks, though the rebels continue their assaults.\nIn March, the Belize-flagged Rubymar carrying a load of fertilizer sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency acknowledged container shipping through Red Sea has declined by 90% since December over the attacks.", "url": "https://www.yahoo.com/news/ship-attacked-yemen-houthi-rebels-021433370.html", "date": "2024-06-19 02:45", "source": "GDELT"}, {"id": "e579fab5-9a95-4022-a942-f284d48cb548", "message": "It was the second ship sunk in the rebels' campaign targeting Red Sea shipping.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military's United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carrying fertilizer cargo sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency said that container shipping through the Red Sea has declined by 90% since December because of the attacks.", "url": "https://www.news4jax.com/news/world/2024/06/19/ship-attacked-by-yemens-houthi-rebels-in-fatal-assault-sinks-in-red-sea-in-second-such-sinking/", "date": "2024-06-19 04:15", "source": "GDELT"}, {"id": "0c1b1f5e-a3ea-429a-a188-93e56466d020", "message": "The Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military's center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a in the Red Sea.\nJohn Kirby, a White House national security spokesman, said Monday that the attack killed \"a crew member who hailed from the Philippines.\"\nIn March, the carried a load of fertilizer sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency acknowledged container shipping through the Red Sea has declined by 90% since December over the attacks.", "url": "https://wpde.com/news/nation-world/yemens-houthi-rebels-sink-second-ship-tutor-in-red-sea-escalating-maritime-tensions-iranian-backed-houthis-israel-hamas-war-gaza-strip-netanyahu-commercial-vessels-warships-bomb-carrying-drone-boat", "date": "2024-06-19 14:00", "source": "GDELT"}, {"id": "c894e2c6-eb2b-4462-b20b-fbe3de95201a", "message": "“Military authorities report maritime debris and oil sighted in the last reported location,” the UKMTO said.\n“The vessel is believed to have sunk.”The Houthis did not immediately acknowledge the sinking.\nThe U.S. military as well did not immediately acknowledge the sinking and did not respond to requests for comment.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nThe Cole is now part of a U.S. Navy operation led by the aircraft carrier USS Dwight D. Eisenhower in the Red Sea to try and halt the Houthi attacks, though the rebels continue their assaults.", "url": "https://www.columbian.com/news/2024/jun/18/ship-attacked-by-yemens-houthi-rebels-in-fatal-assault-sinks-in-red-sea-in-second-such-sinking/", "date": "2024-06-19 05:15", "source": "GDELT"}, {"id": "a977e13b-528a-4760-b104-00ef6e3a908c", "message": "It was the second ship sunk in the rebels' campaign targeting Red Sea shipping.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carrying fertilizer cargo sank in the Red Sea after taking on water for days following a rebel attack.\nAbout a week earlier, the Houthis said similar strikes killed two people and wounded nine others, without saying if those hurt were fighters or civilians.\nIt also claimed destroying two Houthi drone boats in the Red Sea as well over the last 24 hours.", "url": "https://www.independent.co.uk/news/red-sea-ap-houthi-israel-yemen-b2565676.html", "date": "2024-06-20 03:00", "source": "GDELT"}, {"id": "ccbd0a8e-ab3a-4591-9ab3-b7fd9f33bb10", "message": "A 750ft cargo ship has sunk in the Red Sea days after Yemen's Houthi rebels said they launched a blistering drone attack on the vessel, reportedly killing one mariner on board.\nIt would be the second ship sunk as part of the rebels' campaign targeting Red Sea shipping after the Rubymar, which was carrying more than 41,000 tonnes of fertiliser, went down in March around two weeks after being struck by missiles.\nIn March, the Belize-flagged Rubymar carrying fertilizer cargo sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the US Defense Intelligence Agency said that container shipping through the Red Sea has declined by 90 per cent since December because of the attacks.\nIt also claimed destroying two Houthi drone boats in the Red Sea as well over the last 24 hours.", "url": "https://www.dailymail.co.uk/news/article-13550069/Houthi-drones-750ft-cargo-ship-deadly-explosion-vessel-sank-Red-Sea.html", "date": "2024-06-20 10:15", "source": "GDELT"}], "location": "The main event takes place on the Red Sea.", "total_score": 2.6938122757811493, "count": 5, "average_score": 0.5387624551562299, "final_score": 0.6771337186093609}, "a3c329df-0257-45e5-8bed-49203f0af0e4": {"messages": [{"id": "a3c329df-0257-45e5-8bed-49203f0af0e4", "message": "The Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nThe Cole is now part of a US Navy operation led by the aircraft carrier USS Dwight D. Eisenhower in the Red Sea to try and halt the Houthi attacks, though the rebels continue their assaults.\nIn March, the Belize-flagged Rubymar carried a load of fertilizer sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the US Defense Intelligence Agency acknowledged container shipping through Red Sea has declined by 90% since December over the attacks.", "url": "https://www.firstpost.com/world/new-escalation-in-yemen-as-houthi-rebels-sink-second-ship-in-fatal-assault-in-red-sea-13783756.html", "date": "2024-06-19 03:30", "source": "GDELT"}, {"id": "924719fe-0041-49af-8cd6-d90311412440", "message": "It was the second ship sunk in the rebels' campaign targeting Red Sea shipping.\nThe Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military's United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nIn March, the Belize-flagged Rubymar carrying fertilizer cargo sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency said that container shipping through the Red Sea has declined by 90% since December because of the attacks.", "url": "https://www.clickorlando.com/news/world/2024/06/19/ship-attacked-by-yemens-houthi-rebels-in-fatal-assault-sinks-in-red-sea-in-second-such-sinking/", "date": "2024-06-19 02:00", "source": "GDELT"}, {"id": "8958e015-cdb8-402e-9ff3-607fee1f304c", "message": "The Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military's center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a in the Red Sea.\nJohn Kirby, a White House national security spokesman, said Monday that the attack killed \"a crew member who hailed from the Philippines.\"\nIn March, the carried a load of fertilizer sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency acknowledged container shipping through the Red Sea has declined by 90% since December over the attacks.", "url": "https://wlos.com/news/nation-world/yemens-houthi-rebels-sink-second-ship-tutor-in-red-sea-escalating-maritime-tensions-iranian-backed-houthis-israel-hamas-war-gaza-strip-netanyahu-commercial-vessels-warships-bomb-carrying-drone-boat", "date": "2024-06-19 12:30", "source": "GDELT"}], "location": "RED SEA", "total_score": 0.7612483397433676, "count": 2, "average_score": 0.3806241698716838, "final_score": 0.4764369189101786}, "b4b7dc6d-59b1-4ea6-8d24-6a526bb1684f": {"messages": [{"id": "b4b7dc6d-59b1-4ea6-8d24-6a526bb1684f", "message": "| AFP photoIsrael’s repeated use of heavy bombs in the densely-populated Gaza Strip indicates repeated violations of the laws of war, the UN said Wednesday, highlighting six attacks that killed at least 218 people.\nThey involved the suspected use of up to 2,000-pound bombs on residential buildings, a school, refugee camps and a market.\nGBU-31s, along with 1,000-pound GBU-32s and 250-pound GBU-39s ‘are mostly used to penetrate through several floors of concrete and can completely collapse tall structures,’ UN rights office spokesman Jeremy Laurence told reporters.\nThe missiles fired by Hamas, while ‘absolutely unacceptable’, he said, ‘have not caused significant killing during the war’ by comparison.\nIsrael harshly criticised the report, suggesting it aimed to ‘lambast and single-out Israel, while further shielding Hamas terrorists in Gaza’.", "url": "https://www.newagebd.net/post/middle-east/237982/israeli-use-of-heavy-bombs-raise-serious-concerns-under-laws-of-war-un", "date": "2024-06-19 17:15", "source": "GDELT"}, {"id": "8e6fd353-b4b0-41f9-9327-6e99c486d2bc", "message": "GENEVA, Switzerland — Israel's repeated use of heavy bombs in the densely populated Gaza Strip indicates repeated violations of the laws of war, the United Nations said on Wednesday, highlighting six attacks that killed at least 218 people.\nThey involved the suspected use of up to 2,000-pound bombs on residential buildings, a school, refugee camps and a market.\nThe missiles fired by Hamas, while \"absolutely unacceptable,\" he said, \"have not caused significant killing during the war\" by comparison.\nThe report highlighted that unlawful targeting was not only a violation of the laws of war.\nIsrael harshly criticized the report, suggesting it aimed to \"lambast and single out Israel while further shielding Hamas terrorists in Gaza.\"", "url": "https://www.manilatimes.net/2024/06/20/world/americas-emea/israeli-use-of-heavy-bombs-violates-laws-of-war-un/1952252", "date": "2024-06-19 16:45", "source": "GDELT"}], "location": "GAZA CITY", "total_score": 0.43525528169014094, "count": 1, "average_score": 0.43525528169014094, "final_score": 0.48467869718309864}, "b2126595-5ffa-4c1b-b8f2-ce3b89190227": {"messages": [{"id": "b2126595-5ffa-4c1b-b8f2-ce3b89190227", "message": "The Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military's center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a in the Red Sea.\nJohn Kirby, a White House national security spokesman, said Monday that the attack killed \"a crew member who hailed from the Philippines.\"\nIn March, the carried a load of fertilizer sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency acknowledged container shipping through the Red Sea has declined by 90% since December over the attacks.", "url": "https://katv.com/news/nation-world/yemens-houthi-rebels-sink-second-ship-tutor-in-red-sea-escalating-maritime-tensions-iranian-backed-houthis-israel-hamas-war-gaza-strip-netanyahu-commercial-vessels-warships-bomb-carrying-drone-boat", "date": "2024-06-19 11:45", "source": "GDELT"}, {"id": "71a082c9-9b8e-4500-b3df-4b225d215c6c", "message": "The Liberian-flagged, Greek-owned-and-operated Tutor sank in the Red Sea, the British military’s United Kingdom Maritime Trade Operations center said in a warning to sailors in the region.\nThe Tutor came under attack about a week ago by a bomb-carrying Houthi drone boat in the Red Sea.\nThe Cole is now part of a U.S. Navy operation led by the aircraft carrier USS Dwight D. Eisenhower in the Red Sea to try and halt the Houthi attacks, though the rebels continue their assaults.\nIn March, the Belize-flagged Rubymar carrying a load of fertilizer sank in the Red Sea after taking on water for days following a rebel attack.\nA recent report by the U.S. Defense Intelligence Agency acknowledged container shipping through Red Sea has declined by 90% since December over the attacks.", "url": "https://news.yahoo.com/news/ship-attacked-yemen-houthi-rebels-021433370.html", "date": "2024-06-20 08:00", "source": "GDELT"}], "location": "The main event takes place in the 'Red Sea'.", "total_score": 0.3767206477732794, "count": 1, "average_score": 0.3767206477732794, "final_score": 0.4437044534412956}, "a0329bcc-ca08-46b1-a1cf-ad597ccf2a9e": {"messages": [{"id": "a0329bcc-ca08-46b1-a1cf-ad597ccf2a9e", "message": "Israel may have violated laws of war in Gaza, UN rights office saysBy Gabrielle Tétrault-Farber and Emma FargeGENEVA (Reuters) -Israeli forces may have repeatedly violated the laws of war and failed to distinguish between civilians and fighters in the Gaza conflict, the U.N. human rights office said on Wednesday.\nSeparately, the head of a U.N. inquiry accused the Israeli military of carrying out an \"extermination\" of Palestinians.\nIn a report on six deadly Israeli attacks, the U.N. human rights office (OHCHR) said Israeli forces \"may have systematically violated the principles of distinction, proportionality, and precautions in attack\".\nIn a separate meeting of the U.N. Human Rights Council in Geneva, the head of a U.N. Commission of Inquiry, Navi Pillay, said perpetrators of abuses in the conflict must be brought to account.\nThe U.N. rights office report details six incidents that took place between Oct. 7 and Dec. 2, in which it was able to assess the kinds of weapons, the means and the methods used in these attacks.", "url": "https://www.yahoo.com/news/israel-may-violated-laws-war-063503255.html", "date": "2024-06-19 07:00", "source": "GDELT"}, {"id": "b2be433e-05c5-4783-90cc-b72d71980a8a", "message": "Israeli forces may have repeatedly violated fundamental principles of the laws of war and failed to distinguish between civilians and fighters in their Gaza Strip military campaign, the United Nations human rights office said on June 19.\nIn a report assessing six Israeli attacks that caused a high number of casualties and destruction of civilian infrastructure, the U.N. human rights office said Israeli forces “may have systematically violated the principles of distinction, proportionality, and precautions in attack.”\"The requirement to select means and methods of warfare that avoid or at the very least minimise to every extent civilian harm appears to have been consistently violated in Israel's bombing campaign,\" said U.N. High Commissioner for Human Rights Volker Turk.\nIsrael’s Gaza onslaughtIsrael's air and ground offensive has killed more than 37,400 people in the Hamas-ruled Palestinian territory, according to health authorities there.\nAlso read: Holding Israel accountableIsrael launched its assault after Hamas fighters stormed across the border into southern Israel on Oct. 7, killing around 1,200 people and taking more than 250 people hostage, according to Israeli tallies.\nLast week the U.N. human rights office said the killing of civilians during an Israeli operation to free four hostages could amount to war crimes, but so might Palestinian militants' holding of captives in densely populated areas.", "url": "https://www.thehindu.com/news/international/israel-may-have-violated-laws-of-war-in-gaza-campaign-un-rights-office-says/article68307027.ece", "date": "2024-06-19 08:30", "source": "GDELT"}, {"id": "83c0637c-d8aa-41ae-8c81-813051794f08", "message": "GENEVA - Israeli forces may have repeatedly violated fundamental principles of the laws of war and failed to distinguish between civilians and fighters in their Gaza Strip military campaign, the United Nations human rights office said on June 19.\nIn a report assessing six Israeli attacks that caused a high number of casualties and destruction of civilian infrastructure, the UN human rights office said Israeli forces \"may have systematically violated the principles of distinction, proportionality and precautions in attack\".\nIsrael's air and ground offensive has killed more than 37,400 people in Gaza, according to the health authorities there.\nLast week, the UN human rights office said the killing of civilians during an Israeli operation to free four hostages could amount to war crimes, but so might Palestinian militants' holding of captives in densely populated areas.\nALSO READ: UN human rights chief: Situation in West Bank 'drastically deteriorating'", "url": "https://www.asiaone.com/world/israel-may-have-violated-laws-war-gaza-un-rights-office-says", "date": "2024-06-20 03:00", "source": "GDELT"}], "location": "GAZA", "total_score": 1.3497089271936602, "count": 2, "average_score": 0.6748544635968301, "final_score": 0.682398124517781}, "aeed53be-07b5-41fd-83c6-1daa616d2cea": {"messages": [{"id": "aeed53be-07b5-41fd-83c6-1daa616d2cea", "message": "The head of Lebanon's Hezbollah militant group has said that nowhere in Israel will be safe if an all-out war breaks out between the two enemies.\nHezbollah has been trading fire with Israel for more than eight months in parallel with the Gaza War.\nNasrallah also threatened Cyprus for the first time, accusing it of allowing Israel to use its airports and bases for military exercises.\nWitnesses reported seeing Israeli military vehicles enter the city's Saudi neighbourhood, followed by gun battles.\nMr Hochstein said the plan would ultimately lead to \"the end of the conflict in Gaza\", which would in turn quell fighting between Israel and Hezbollah.", "url": "https://www.rte.ie/news/middle-east/2024/0619/1455466-gaza-israel/", "date": "2024-06-19 08:15", "source": "GDELT"}, {"id": "9c3b1b00-ead1-48ae-87ff-49c597d94bed", "message": "Key Points Israel's foreign minister warned on Tuesday that a decision on an all-out war with Hezbollah was coming soon.\nHezbollah also threatened Cyprus, the EU member state closest to Lebanon, with which it has cordial relations.\nHezbollah has been trading fire with Israel for more than eight months in parallel with the Gaza war.\nNasrallah also threatened Cyprus — the EU member state in closest proximity to Lebanon, with which it has cordial relations — accusing it of allowing Israel to use its airports and bases for military exercises.\nSovereign British military bases on Cyprus have been used by Britain for operations in Syria in the past and more recently, Yemen.", "url": "https://www.sbs.com.au/news/article/hezbollah-warns-it-will-target-eu-member-cyprus-if-it-assists-israel-in-attacks-on-lebanon/681st2u04", "date": "2024-06-20 01:30", "source": "GDELT"}, {"id": "f6fa385e-336a-4d2a-b8b4-8d0e3019b593", "message": "Hezbollah on Wednesday said none of Israel would be spared in a war, after Israel said it had approved plans for a Lebanon offensive, stoking fears of the Gaza conflict spreading.\nMeanwhile, the war between Israel and Hamas raged in Gaza, with Israeli air strikes and clashes between troops and Palestinian militants.\n'Greater capabilities'Fears that Israel might launch a full-blown war in Lebanon have spiked, with the Israeli military on Tuesday announcing that \"operational plans for an offensive in Lebanon were approved and validated\".\nIsrael said the Hezbollah attack caused no casualties and that its own \"artillery struck the sources of fire\".\nHochstein said the plan would ultimately lead to \"the end of the conflict in Gaza\", which would in turn quell fighting between Israel and Hezbollah.", "url": "https://www.hurriyetdailynews.com/hezbollah-threatens-israel-after-military-says-lebanon-offensive-ready-197620", "date": "2024-06-20 06:30", "source": "GDELT"}], "location": "Lebanon", "total_score": 1.3162207882716885, "count": 2, "average_score": 0.6581103941358443, "final_score": 0.670677275895091}, "85e4a275-3bd1-4ca4-87f7-389f0766ee13": {"messages": [{"id": "85e4a275-3bd1-4ca4-87f7-389f0766ee13", "message": "So how, on the eve of Russian President Vladimir Putin’s summit Wednesday with North Korean leader Kim Jong Un, did as many as 30 North Korean soldiers wander over the line separating North from South, causing South Korea to fire warning shots before the North Koreans withdrew?\nOn Tuesday, South Korean troops broadcast warnings and fired warning shots to turn back North Korean soldiers — somewhere between 20 to 30 — who briefly crossed the demarcation line in the DMZ.\nWhen North Korean soldiers briefly crossed a different part of the line on June 11, the same scenario played out: Warning shots from the South; a North Korean withdrawal.\nThe North’s accidental intrusions this month may have been caused by a sudden jump in North Korean troops fortifying their side of the border.\nTwo American Army officers were axed to death in 1976 by North Korean soldiers, for instance.", "url": "https://www.military.com/daily-news/2024/06/19/how-did-north-korean-soldiers-wander-across-worlds-most-heavily-guarded-border.html", "date": "2024-06-19 17:00", "source": "GDELT"}, {"id": "9356a0ed-2ed4-43cb-84e9-885521c41eb5", "message": "In this undated photo provided on Tuesday, June 18, 2024, by South Korea Defense Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nSo how, on the eve of Russian President Vladimir Putin’s summit Wednesday with North Korean leader Kim Jong Un, did as many as 30 North Korean soldiers wander over the line separating North from South, causing South Korea to fire warning shots before the North Koreans withdrew?\nWhen North Korean soldiers briefly crossed a different part of the line on June 11, the same scenario played out: Warning shots from the South; a North Korean withdrawal.\nTwo American Army officers were axed to death in 1976 by North Korean soldiers, for instance.", "url": "https://www.clickorlando.com/news/2024/06/19/how-did-north-korean-soldiers-wander-across-the-worlds-most-heavily-guarded-border/", "date": "2024-06-19 09:30", "source": "GDELT"}, {"id": "bd8a6b67-f514-44af-98c9-b821fc5b300d", "message": "So how, on the eve of Russian President Vladimir Putin’s summit Wednesday with North Korean leader Kim Jong Un, did as many as 30 North Korean soldiers wander over the line separating North from South, causing South Korea to fire warning shots before the North Koreans withdrew?\nIn this undated photo provided on Tuesday, June 18, 2024, by South Korea Defense Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nWhen North Korean soldiers briefly crossed a different part of the line on June 11, the same scenario played out: Warning shots from the South; a North Korean withdrawal.\nTwo American Army officers were axed to death in 1976 by North Korean soldiers, for instance.", "url": "https://www.winnipegfreepress.com/world/2024/06/19/how-did-north-korean-soldiers-wander-across-the-worlds-most-heavily-guarded-border", "date": "2024-06-19 18:15", "source": "GDELT"}], "location": "DMZ.", "total_score": 0.934050821298644, "count": 2, "average_score": 0.467025410649322, "final_score": 0.5369177874545253}, "5c1e78f8-c1c7-43dc-9427-076f6ce45c8e": {"messages": [{"id": "5c1e78f8-c1c7-43dc-9427-076f6ce45c8e", "message": "North Korea and the former Soviet Union signed a treaty in 1961 that experts say necessitated Moscow’s military intervention if the North came under attack.\nHe added that Russia would not rule out developing military-technical cooperation with North Korea.\nThere will likely be talks about expanding cooperation in agriculture, fisheries and mining and further promoting Russian tourism to North Korea, the institute said.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.\nKim reported from Seoul, South Korea.", "url": "https://www.bostonglobe.com/2024/06/19/world/kim-putin-meet-pyongyang-worries-are-raised-about-north-koreas-russias-military-ties/", "date": "2024-06-19 06:45", "source": "GDELT"}, {"id": "b1c0e6d1-c5e7-4759-aef8-82f8d0917efb", "message": "Mr Putin called it a “breakthrough document” reflecting shared desires to move relations to a higher level.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe deal was made as Mr Putin visited North Korea for the first time in 24 years.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping rubbish on the South via balloons and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.belfasttelegraph.co.uk/news/world-news/north-korea-says-deal-with-russia-means-immediate-military-aid-in-event-of-war/a914865603.html", "date": "2024-06-20 05:30", "source": "GDELT"}, {"id": "b3423f31-6811-4395-a4e6-5e707caad972", "message": "SEOUL, South Korea — South Korea's presidential office condemned an agreement reached by Russia and North Korea that vowed mutual defense assistance in the event of war and says it will reconsider its policy of limiting support to Ukraine of non-lethal supplies.\nSouth Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow's military intervention if the North came under attack.\n''We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin's visit to North Korea.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.startribune.com/north-korea-says-deal-between-putin-and-kim-requires-immediate-military-assistance-in-event-of-war/600374727/", "date": "2024-06-20 03:15", "source": "GDELT"}, {"id": "33b29a70-7b0b-445e-92bf-6ccadca9fbe4", "message": "Russian President Vladimir Putin, left, and North Korea's leader Kim Jong Un exchange documents during a signing ceremony of the new partnership in Pyongyang, North Korea, on Wednesday, June 19, 2024.\nSouth Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.local10.com/news/world/2024/06/20/north-korea-says-deal-between-putin-and-kim-requires-immediate-military-assistance-in-event-of-war/", "date": "2024-06-20 02:45", "source": "GDELT"}, {"id": "dba3fd87-809c-4b21-ba87-f15fb5c3ee0e", "message": "South Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nRussian President Vladimir Putin, left, and North Korea's leader Kim Jong Un pose for a photo after the official welcome ceremony in Pyongyang, North Korea, on Wednesday, June 19, 2024.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.kob.com/news/us-and-world-news/north-korea-says-deal-between-putin-and-kim-requires-immediate-military-assistance-in-event-of-war/", "date": "2024-06-20 04:15", "source": "GDELT"}, {"id": "425b6f30-13fa-4231-a6fa-f9a0df8e79fc", "message": "The office said the agreement posed a threat to South Korea’s security and warned that it will negatively affect Seoul’s relations with Moscow.\nSouth Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.metro.us/north-korea-says-deal-between-putin-and-kim-requires-immediate-military-assistance-in-event-of-war/", "date": "2024-06-20 09:00", "source": "GDELT"}, {"id": "0b98e378-73c2-4626-9b82-3354ef2afc13", "message": "SEOUL, South Korea — South Korea’s presidential office on Thursday condemned an agreement reached by Russia and North Korea that vowed mutual defense assistance in the event of war and said it will reconsider its policy of limiting its support to Ukraine to non-lethal supplies.\nSouth Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.military.com/daily-news/2024/06/20/south-korea-blasts-russia-north-korea-deal-says-it-will-consider-possible-arms-supplies-ukraine.html", "date": "2024-06-20 12:45", "source": "GDELT"}, {"id": "c6218d8a-50cb-4adc-be27-09d55d9e7219", "message": "South Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nBut it has not directly provided arms to Ukraine, citing a long-standing policy of not supplying weapons to countries actively engaged in conflict.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.voanews.com/a/south-korea-blasts-russia-north-korea-deal-says-it-will-consider-possible-arms-supplies-to-ukraine-/7663155.html", "date": "2024-06-20 12:45", "source": "GDELT"}, {"id": "9e99cbbf-f2bd-4a91-94d0-999ae6718b3c", "message": "South Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nBut it has not directly provided arms to Ukraine, citing a long-standing policy of not supplying weapons to countries actively engaged in conflict.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow's military intervention if the North came under attack.\nNow with any ambiguity of Russia's partnership with North Korea removed, how will Seoul respond?\"\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.naharnet.com/stories/en/306023-seoul-blasts-russia-n-korea-deal-says-will-consider-supplying-arms-to-kyiv", "date": "2024-06-20 16:00", "source": "GDELT"}], "location": ".\nSeoul, South Korea", "total_score": 4.701587489408802, "count": 8, "average_score": 0.5876984361761003, "final_score": 0.8013889053232702}, "823a6a2a-33ba-454a-94e4-dad3d25f7e15": {"messages": [{"id": "823a6a2a-33ba-454a-94e4-dad3d25f7e15", "message": "Hezbollah has been trading fire with Israel for more than eight months in parallel with the Gaza war.\nOn Tuesday, the Iran-backed group published what it said was drone footage of sensitive military sites deep in Israeli territory.\nIn a televised address on Wednesday, Hezbollah chief Sayyed Hassan Nasrallah said \"there will be no place safe from our missiles and our drones\" in Israel in the event of a broader war.\nSovereign British military bases on Cyprus have been used by Britain for operations in Syria in the past and more recently, Yemen.\nU.N. officials expressed concern at the escalation, and U.S. envoy Amos Hochstein travelled to Israel and Lebanon to urge both sides not to move into a full-scale conflict.", "url": "https://www.devdiscourse.com/article/politics/2988633-hezbollahs-menacing-warning-nowhere-in-israel-is-safe", "date": "2024-06-19 22:45", "source": "GDELT"}, {"id": "553cbbb8-f12c-4e5b-8c1d-d35e224aeddf", "message": "Hezbollah has been trading fire with Israel for more than eight months in parallel with the Gaza war.\nCYPRUS DENIES TAKING SIDESCypriot President Nikos Christodoulides denied any suggestion Cyprus was taking sides in any conflict.\nSovereign British military bases on Cyprus have been used by Britain for operations in Syria in the past and more recently, Yemen.\nHezbollah unleashed its largest volleys of drones and rockets at Israel in retaliation.\nHezbollah first showed it could hit a vessel at sea by striking an Israeli warship in the Mediterranean during their 2006 war.", "url": "https://www.odt.co.nz/news/world/hezbollah-threatens-cyprus-and-israel", "date": "2024-06-20 01:15", "source": "GDELT"}], "location": "LEBANON", "total_score": 0.6108377430497275, "count": 1, "average_score": 0.6108377430497275, "final_score": 0.6075864201348092}, "45e38cd5-2dcd-441c-849d-c2ec1066ab72": {"messages": [{"id": "45e38cd5-2dcd-441c-849d-c2ec1066ab72", "message": "North Korea and the former Soviet Union signed a treaty in 1961 that experts say necessitated Moscow’s military intervention if the North came under attack.\nHe added that Russia would not rule out developing military-technical cooperation with North Korea.\nThere will likely be talks about expanding cooperation in agriculture, fisheries and mining and further promoting Russian tourism to North Korea, the institute said.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.\nKim reported from Seoul, South Korea.", "url": "https://www.ctvnews.ca/world/a-new-multipolar-world-russia-north-korea-partnership-deal-revealed-1.6932373", "date": "2024-06-19 18:45", "source": "GDELT"}, {"id": "8cb3e306-f771-450d-844b-277eb4afea11", "message": "Mr Putin called it a “breakthrough document” reflecting shared desires to move relations to a higher level.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe deal was made as Mr Putin visited North Korea for the first time in 24 years.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping rubbish on the South via balloons and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.theargus.co.uk/news/national/24399175.north-korea-says-deal-russia-means-immediate-military-aid-event-war/", "date": "2024-06-20 05:00", "source": "GDELT"}, {"id": "0fde9bb9-e833-4ac4-a4a4-a88eb4ec0f97", "message": "Russian President Vladimir Putin, left, and North Korea's leader Kim Jong Un exchange documents during a signing ceremony of the new partnership in Pyongyang, North Korea, on Wednesday, June 19, 2024.\nSouth Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.yahoo.com/news/north-korea-says-deal-between-014918001.html", "date": "2024-06-20 03:15", "source": "GDELT"}], "location": "Seoul, South Korea", "total_score": 1.152004693014113, "count": 2, "average_score": 0.5760023465070565, "final_score": 0.6132016425549395}, "64c18511-2189-479b-b914-6e0803657515": {"messages": [{"id": "64c18511-2189-479b-b914-6e0803657515", "message": "Hezbollah head says 'fight without limitations' in case of war with Israel.\nImage Source: IANS NewsBeirut, June 20 : Hezbollah leader Hassan Nasrallah has pledged a fight \"without limitations\" if Israel starts a war with the militant group.\nIsrael has threatened over the past days to expand its war against the Shia militant group, Xinhua news agency reported.\nIn response, the Hezbollah leader said they are \"not afraid of these threats,\" claiming that Hezbollah's missiles and rockets can cause significant damage to the Israeli side.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel on October 7.", "url": "https://www.prokerala.com/news/articles/a1540781.html", "date": "2024-06-20 02:15", "source": "GDELT"}, {"id": "f3ec697d-4985-4e6b-9e4b-3add110a6d71", "message": "JERUSALEM, June 19 (Xinhua) -- Israeli officials on Wednesday escalated threats against Lebanon's Hezbollah amidst escalating cross-border exchanges of fire between the two sides.\nMeanwhile, the Israeli Ynet news site reported that an anonymous \"senior Israeli government official\" told the news outlet that \"if Hezbollah continues to attack Israel, southern Lebanon will look like Gaza.\nOn Tuesday, the Israeli military said it has approved \"operational plans\" for an offensive against the Lebanese armed group Hezbollah.\nIn response, Hezbollah leader Hassan Nasrallah pledged on Wednesday a fight \"without limitations\" if Israel starts a war with the militant group.\nTensions along the Israel-Lebanon border escalated on Oct. 8, 2023, following a barrage of rockets launched by Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.", "url": "https://english.news.cn/20240620/d03bbbb622d541bba1affcfa5241e2bf/c.html", "date": "2024-06-20 00:00", "source": "GDELT"}], "location": "BEIRUT.", "total_score": 0.6388874645883272, "count": 1, "average_score": 0.6388874645883272, "final_score": 0.6272212252118291}, "e0259217-6c0d-4346-8c0c-c087dc9b19dd": {"messages": [{"id": "e0259217-6c0d-4346-8c0c-c087dc9b19dd", "message": "KHARKIV, Ukraine (AP) — The first shock wave shattered aisles stacked almost to the ceiling with home improvement products.\nInvestigators hope it will help them trace the supply chain for the latest generation of retrofitted Russian “glide bombs” that are laying waste to eastern Ukraine.\nStore manager Oleksandr Lutsenko walks inside the Epicenter shopping complex in Kharkiv, Ukraine, Thursday, June 6, 2024.\nThe bombing of the Epicenter with glide bombs by the Russian military in May killed 19 people, including two children.\nPhotos on Russian Telegram channels linked to the military show glide bombs being launched three and four at a time.", "url": "https://www.winnipegfreepress.com/world/2024/06/20/russia-obliterates-front-line-ukraine-towns-by-retrofitting-bombs-and-expanding-its-air-base-network", "date": "2024-06-20 07:00", "source": "GDELT"}, {"id": "1aa8035c-803c-4c3c-b765-a8b80804e22a", "message": "Investigators hope it will help them trace the supply chain for the latest generation of retrofitted Russian “glide bombs” that are laying waste to eastern Ukraine.\nThe next Russian bomb streaked down like a comet seconds later, unleashing flames that left the megastore an ashen shell.\nStore manager Oleksandr Lutsenko inside the Epicenter shopping complex in Kharkiv, Ukraine.\nIn all, glide bombs have hit the city more than 50 times this year, according to Spartak Borysenko of the Kharkiv regional prosecutor’s office.\nPhotos on Russian Telegram channels linked to the military show glide bombs being launched three and four at a time.", "url": "https://www.scmp.com/news/world/europe/article/3267349/russia-obliterates-frontline-ukraine-towns-retrofitted-glide-bombs", "date": "2024-06-20 08:45", "source": "GDELT"}, {"id": "7f7e098e-fa13-44af-adf7-109da9cd20c0", "message": "Russia is intensifying its use of glide bombs to lay waste to cities in eastern Ukraine.\nInvestigators hope it will help them trace the supply chain for the latest generation of retrofitted Russian “glide bombs” that are laying waste to eastern Ukraine.\nThe Soviet-era bombs are adapted on the cheap with imported electronics that allow distant Russian warplanes to launch them at Ukraine.\nIn all, glide bombs have hit the city more than 50 times this year, according to Spartak Borysenko of the Kharkiv regional prosecutor’s office.\nPhotos on Russian Telegram channels linked to the military show glide bombs being launched three and four at a time.", "url": "https://www.firstpost.com/world/russia-obliterates-front-line-ukraine-towns-by-retrofitting-bombs-expanding-air-base-network-13784291.html", "date": "2024-06-20 11:00", "source": "GDELT"}, {"id": "373345e1-11b9-48f1-96f5-e43c889e3784", "message": "Russia obliterates Ukraine’s front-line towns faster with hacked bombs and expanded air base networkKHARKIV, Ukraine (AP) — The first shock wave shattered aisles stacked almost to the ceiling with home improvement products.\nThe next Russian bomb streaked down like a comet seconds later, unleashing flames that left the megastore an ashen shell.\nInvestigators hope it will help them trace the supply chain for the latest generation of retrofitted Russian “glide bombs” that are laying waste to eastern Ukraine.\nIn all, glide bombs have hit the city more than 50 times this year, according to Spartak Borysenko of the Kharkiv regional prosecutor’s office.\nPhotos on Russian Telegram channels linked to the military show glide bombs being launched three and four at a time.", "url": "https://lasvegassun.com/news/2024/jun/20/russia-obliterates-ukraines-front-line-towns-faste/", "date": "2024-06-20 17:45", "source": "GDELT"}, {"id": "a2f1359d-f8d0-4479-bbb9-ecbd22df4c14", "message": "KHARKIV, Ukraine — The first shock wave shattered aisles stacked almost to the ceiling with home improvement products.\nInvestigators hope it will help them trace the supply chain for the latest generation of retrofitted Russian \"glide bombs\" that are laying waste to eastern Ukraine.\nPhotos on Russian Telegram channels linked to the military show glide bombs being launched three and four at a time.\n1 of 2 — Russia Ukraine War Scorched Earth This Planet Labs satellite image shows a field in the Belgorod Oblast, Russia, in August 2023.\nPlanet Labs / AP 2 of 2 — Russia Ukraine War Scorched Earth This Planet Labs satellite image shows a newly constructed airfield in the Belgorod Oblast, Russia in June 2024.", "url": "https://www.kalw.org/npr-news/2024-06-20/russia-wages-a-scorched-earth-war-in-ukraine-with-retrofitted-bombs-and-new-airstrips", "date": "2024-06-20 17:00", "source": "GDELT"}], "location": "Kharkiv, Ukraine", "total_score": 2.0953302233812074, "count": 4, "average_score": 0.5238325558453019, "final_score": 0.6366827890917113}, "9a41f9e2-0e85-4e24-9fce-7e8fd4e2bd73": {"messages": [{"id": "9a41f9e2-0e85-4e24-9fce-7e8fd4e2bd73", "message": "Russian President Vladimir Putin, left, and North Korea's leader Kim Jong Un exchange documents during a signing ceremony of the new partnership in Pyongyang, North Korea, on Wednesday, June 19, 2024.\nBoth North Korea's Kim Jong Un and Russia's Vladimir Putin had described the deal reached Wednesday as a major upgrade of bilateral relations, covering security, trade, investment, cultural and humanitarian ties.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n(Gavriil Grigorov, Sputnik, Kremlin Pool Photo via AP)A motorcade with Russian President Vladimir Putin drives along a street in Pyongyang, North Korea, on Wednesday, June 19, 2024.\n(Gavriil Grigorov, Sputnik, Kremlin Pool Photo via AP)A motorcade with Russian President Vladimir Putin drives along a street in Pyongyang, North Korea, on Wednesday, June 19, 2024.", "url": "https://www.theday.com/nation/20240619/n-korea-says-deal-between-putin-kim-requires-immediate-military-assistance-in-event-of-war/", "date": "2024-06-20 06:15", "source": "GDELT"}, {"id": "50057cc2-0d67-4389-8710-b2d8a924d65d", "message": "Russian President Vladimir Putin, left, and North Korea's leader Kim Jong Un exchange documents during a signing ceremony of the new partnership in Pyongyang, North Korea, on Wednesday, June 19, 2024.\nSouth Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.clickondetroit.com/news/world/2024/06/20/north-korea-says-deal-between-putin-and-kim-requires-immediate-military-assistance-in-event-of-war/", "date": "2024-06-20 05:30", "source": "GDELT"}], "location": "The main event takes place at the Signing Ceremony in Pyongyang, North Korea.", "total_score": 0.57192119968876, "count": 1, "average_score": 0.57192119968876, "final_score": 0.580344839782132}, "fb417936-6cc7-44d7-9804-12876406028d": {"messages": [{"id": "fb417936-6cc7-44d7-9804-12876406028d", "message": "Mr Putin called it a “breakthrough document” reflecting shared desires to move relations to a higher level.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe deal was made as Mr Putin visited North Korea for the first time in 24 years.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping rubbish on the South via balloons and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.eadt.co.uk/news/national/24399175.north-korea-says-deal-russia-means-immediate-military-aid-event-war/", "date": "2024-06-20 05:30", "source": "GDELT"}, {"id": "11794550-f9ac-4ddb-b535-6aa1df448600", "message": "Russian President Vladimir Putin, left, and North Korea's leader Kim Jong Un exchange documents during a signing ceremony of the new partnership in Pyongyang, North Korea, on Wednesday, June 19, 2024.\nSouth Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.news4jax.com/news/world/2024/06/20/north-korea-says-deal-between-putin-and-kim-requires-immediate-military-assistance-in-event-of-war/", "date": "2024-06-20 05:45", "source": "GDELT"}], "location": "PYONGYANG", "total_score": 0.49777228637982673, "count": 1, "average_score": 0.49777228637982673, "final_score": 0.5284406004658787}, "9e37cf0a-af8d-4ad2-bd28-1143d71b9215": {"messages": [{"id": "9e37cf0a-af8d-4ad2-bd28-1143d71b9215", "message": "Mr Putin called it a “breakthrough document” reflecting shared desires to move relations to a higher level.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe deal was made as Mr Putin visited North Korea for the first time in 24 years.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping rubbish on the South via balloons and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.thenorthernecho.co.uk/news/national/24399175.north-korea-says-deal-russia-means-immediate-military-aid-event-war/", "date": "2024-06-20 05:45", "source": "GDELT"}, {"id": "c91e43f3-fcfe-4edf-8d72-d9a305c7c347", "message": "Russian President Vladimir Putin, left, and North Korea's leader Kim Jong Un exchange documents during a signing ceremony of the new partnership in Pyongyang, North Korea, on Wednesday, June 19, 2024.\nSouth Korea, a growing arms exporter with a well-equipped military backed by the United States, has provided humanitarian aid and other support to Ukraine while joining U.S.-led economic sanctions against Moscow.\nNorth Korea and the former Soviet Union signed a treaty in 1961, which experts say necessitated Moscow’s military intervention if the North came under attack.\n“We are currently reviewing the specifics of the treaty signed between Russia and North Korea during President Putin’s visit to North Korea.\nThe Koreas also have engaged in Cold War-style psychological warfare that involved North Korea dropping tons of trash on the South with balloons, and the South broadcasting anti-North Korean propaganda with its loudspeakers.", "url": "https://www.clickorlando.com/news/world/2024/06/20/north-korea-says-deal-between-putin-and-kim-requires-immediate-military-assistance-in-event-of-war/", "date": "2024-06-20 03:30", "source": "GDELT"}], "location": "PYONGYANG, NORTH KOREA", "total_score": 0.49777228637982673, "count": 1, "average_score": 0.49777228637982673, "final_score": 0.5284406004658787}, "f54bc3fe-c4c2-496c-9793-c7e22c86492a": {"messages": [{"id": "f54bc3fe-c4c2-496c-9793-c7e22c86492a", "message": "According to Lebanese sources, the person killed in today's drone strike on a vehicle in Deir Kifa is Abbas Hamadeh, a Hezbollah operative.", "url": "https://abualiexpress.com/en/en29186/", "date": "2024-06-20 10:48", "source": "Telegram"}, {"id": "22e4be8c-3acb-43c7-8108-5209fc36c67f", "message": "Lebanese channels report that at least one person was killed in a targeted drone strike on a vehicle near the village of Deir Kifa in southern Lebanon.", "url": "https://abualiexpress.com/en/en29179/", "date": "2024-06-20 10:13", "source": "Telegram"}], "location": "BEIRUT", "total_score": 0.6068800588668138, "count": 1, "average_score": 0.6068800588668138, "final_score": 0.6048160412067697}}