{"662b87e5-58ba-4703-a887-d71aa23003c8": {"messages": [{"id": "662b87e5-58ba-4703-a887-d71aa23003c8", "message": "The missile that did not explode in the attack on \"a-Sida Khadija\" school in Deir al-Balah in the center of the Gaza Strip.", "url": "https://abualiexpress.com/en/en31133/", "date": "2024-07-27 14:21", "source": "Telegram"}, {"id": "235ceefd-e587-4708-816b-473bbf6f3665", "message": "Additional documentation from the attack area of \"a-Sida Khadija\" school in Deir al-Balah in the center of the Gaza Strip today at noon.\n\nAccording to Palestinian sources, the number of people killed in this attack rose to 36.", "url": "https://abualiexpress.com/en/en31156/", "date": "2024-07-27 18:16", "source": "Telegram"}, {"id": "3da5290d-0c75-4f14-b887-10ab0b67a44c", "message": "Photos from \"a-Sida Khadija\" school in Deir al-Balah in the center of the Gaza Strip which was attacked by the IDF today at noon 👆.", "url": "https://abualiexpress.com/en/en31117/", "date": "2024-07-27 14:14", "source": "Telegram"}], "location": "al-Sida Khadija school, Deir al-Balah, Gaza Strip", "total_score": 1.3006714057877307, "count": 2, "average_score": 0.6503357028938653, "final_score": 0.6652349920257058}, "e58c6772-c3cf-4d44-af40-4d5bce10256b": {"messages": [{"id": "e58c6772-c3cf-4d44-af40-4d5bce10256b", "message": "IDF: The IDF struck terrorists operating a Hamas command and control center embedded inside the Khadija School in central Gaza\n\nIn a strike based on precise IDF and ISA intelligence, terrorists operating in a Hamas command and control center inside the Khadija school compound in central Gaza were struck by the IAF. \n\nHamas terrorists used the compound as a hiding place to direct and plan numerous attacks against IDF troops and the State of Israel. In parallel, the terrorists developed and stored large quantities of weapons inside the compound. \n\nPrior to the strike, numerous steps were taken to mitigate the risk of harming civilians, including the use of appropriate munitions, aerial surveillance and additional intelligence. \n\nThis is a further example of the Hamas terrorist organization’s systematic violation of international law and exploitation of civilian structures and population as human shields for its attacks against the State of Israel.", "url": "https://abualiexpress.com/en/en31115/", "date": "2024-07-27 14:11", "source": "Telegram"}, {"id": "34271e76-df35-474a-8f9f-6b9828008ca4", "message": "Gaza, July 27 : At least 30 Palestinians were killed and more than 100 others injured by Israeli bombing on a field hospital in Deir al-Balah, central Gaza Strip, the Gaza-based health authorities said on Saturday.\nThe hospital was located inside the Khadija School, and the Israeli army bombed the hospital with three missiles from fighter jets, the Hamas-run media office said, noting that Israeli attacks have put enormous pressure on medical teams and caused a shortage of health and medical supplies in Gaza, Xinhua news agency reported.\nThe Israel Defense Forces (IDF) said in a statement that based on precise intelligence, the Israeli Air Force struck \"terrorists\" operating in a Hamas command and control center inside the Khadija School compound in central Gaza.\n\"Hamas terrorists used the compound as a hiding place to direct and plan numerous attacks against IDF troops and the state of Israel,\" the IDF said, noting that before the strike, numerous steps were taken to mitigate the risk of harming civilians.\nThe IDF said in a separate statement on Saturday that IDF troops conducted targeted raids on \"terror infrastructure sites\" above and below the ground in Khan Younis, locating large amounts of weaponry, including shoulder-launched missiles, grenades, AK-47s, and additional military equipment.", "url": "https://www.prokerala.com/news/articles/a1550841.html", "date": "2024-07-27 13:45", "source": "GDELT"}], "location": "GAZA", "total_score": 0.6871036861053542, "count": 1, "average_score": 0.6871036861053542, "final_score": 0.660972580273748}, "9a2fd3fc-9e73-41c9-bb46-2900562f3651": {"messages": [{"id": "9a2fd3fc-9e73-41c9-bb46-2900562f3651", "message": "Wounded in a strike that killed her family, a 2-year-old joins Gaza's ranks of thousands of orphansPalestinian Child Siwar Abdel-Hadi, 2, wounded in the Israeli bombardment of the Gaza Strip, receives medical treatment at a hospital in Deir al-Balah, Wednesday, July 24, 2024.\nSiwar Abdel-Hadi is the sole survivor in her family after an Israeli airstrike on her home in central Gaza killed her parents and three siblings.\nSiwar Abdel-Hadi is now an orphan.\nThe Israeli military rarely comments on individual strikes.\nOn the day of the strike that killed Siwar’s family, the military said it hit dozens of targets across the Gaza Strip, including military structures, observation posts and individual militants.", "url": "https://infotel.ca/newsitem/ml-israel-palestinians-orphaned-girl/cp1855299917", "date": "2024-07-26 08:00", "source": "GDELT"}, {"id": "587d8f2c-30d5-43cc-9165-bd609ce32764", "message": "Amal Abdel-Hadi, left, and Nour Abdel-Hadi, right, react over their 2-year-old wounded niece, Siwar, as she receives treatment at a hospital in Deir al-Balah, Wednesday, July 24, 2024.\nSiwar Abdel-Hadi is the sole survivor in her family after an Israeli airstrike on her home in central Gaza killed her parents and three siblings.\nSiwar Abdel-Hadi is now an orphan.\nOn the day of the strike that killed Siwar’s family, the military said it hit dozens of targets across the Gaza Strip, including military structures, observation posts and individual militants.\nHer grandparents are still alive, but are sick and may not be able to raise her, Nour Abdel-Hadi said.", "url": "https://www.yahoo.com/news/wounded-strike-killed-her-family-062300527.html", "date": "2024-07-26 06:45", "source": "GDELT"}, {"id": "9e45bd91-b7a8-43ae-8730-da33a5bd0ab1", "message": "Wounded in a strike that killed her family, a 2-year-old joins Gaza's ranks of thousands of orphansDEIR AL-BALAH, Gaza Strip (AP) — The 2-year-old toddler lay on a foil blanket, her face covered with salve for her burns and her little body riddled with scars from shrapnel.\nShe’s the lone survivor of an Israeli strike that hit their family home in central Gaza, killing her parents, her two sisters and her brother, along with a brother of her mother.\nShe spoke at nearby Al-Aqsa Martyrs Hospital in Deir al-Balah, where the overwhelmed staff rushed around her dealing with influxes of wounded.\nThe Israeli military rarely comments on individual strikes.\nOn the day of the strike that killed Siwar’s family, the military said it hit dozens of targets across the Gaza Strip, including military structures, observation posts and individual militants.", "url": "https://isp.netscape.com/news/world/story/0001/20240726/d1388a6c30f16f3b487ec7cbcf1398d9", "date": "2024-07-26 07:00", "source": "GDELT"}, {"id": "c0f68cbc-b38e-400e-92a9-7c621871b0a4", "message": "Wounded in a strike that killed her family, a 2-year-old joins Gaza's ranks of thousands of orphansTwo-year-old Siwar Abdel-Hadi is the lone survivor in her family after an Israeli airstrike on her home in central Gaza killed her parents and three siblings", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/wounded-in-a-strike-that-killed-her-family-a-2-year-old-joins-gazas-ranks/article_381cbc6b-21f5-51b6-b08e-1224b6071f86.html", "date": "2024-07-26 08:00", "source": "GDELT"}, {"id": "21a143f5-26c7-4883-9035-934aa8cb5ce0", "message": "An Israeli airstrike hits a school sheltering people in Gaza, killing at least 30Amal Abdel-Hadi, left, and Nour Abdel-Hadi, right, react over their 2-year-old wounded niece, Siwar, as she receives treatment at a hospital in Deir al-Balah, Wednesday, July 24, 2024.\nSiwar Abdel-Hadi is the sole survivor in her family after an Israeli airstrike on her home in central Gaza killed her parents and three siblings.\nThe Palestinian Health Ministry said five wounded people arrived at Rafidia Hospital.\nThe Israeli military said one of its aircraft attacked from the air as part of its activity in Nablus.\nAbout 115 are still in Gaza, about a third of them believed to be dead, according to Israeli authorities.", "url": "https://infotel.ca/newsitem/ml-israel-palestinians/cp577674998", "date": "2024-07-27 11:00", "source": "GDELT"}], "location": "Gaza", "total_score": 2.2320754819435615, "count": 4, "average_score": 0.5580188704858904, "final_score": 0.6606132093401232}, "7671e00a-cc3a-4045-9c42-43829e04acc7": {"messages": [{"id": "7671e00a-cc3a-4045-9c42-43829e04acc7", "message": "Israel is spying on Hezbollah commanders — and killing them one by oneA man holds his child as he looks at the damage that was caused by an Israeli airstrike this month in the southern village of Jmaijmeh, Lebanon.\nThe three hits last week were part of a particularly violent day across southern Lebanon, where Hezbollah, the Shiite paramilitary faction and political party, has tussled with Israel for more than nine months.\nRead more: With temperatures and tensions soaring, forests are burning in Israel and LebanonSince Oct. 7 — when Hamas made its brutal attack on southern Israel and Hezbollah launched what it calls a \"solidarity campaign\" — Israel has picked off some two dozen Hezbollah commanders.\nThe term \"Resistance\" refers to a pro-Iranian network of governments and various factions — including Hezbollah — that are arrayed against Israel and the U.S.\nSince early October, when Hezbollah began launching attacks into northern Israel and Israel retaliated, nearly 400 Hezbollah members and more than 100 Lebanese civilians have died in the fighting.", "url": "https://www.yahoo.com/news/israel-spying-hezbollah-commanders-killing-090016847.html", "date": "2024-07-26 10:15", "source": "GDELT"}, {"id": "dcc8dd11-e791-4a07-a536-ea1b45562d2a", "message": "An Israeli drone fired a missile that hit a Renault van in southern Lebanon.\nThe three hits last week were part of a particularly violent day across southern Lebanon, where Hezbollah, the Shiite paramilitary faction and political party, has tussled with Israel for more than nine months.\nSince Oct. 7 — when Hamas made its brutal attack on southern Israel and Hezbollah launched what it calls a “solidarity campaign “ — Israel has picked off some two dozen Hezbollah commanders.\nHe added that Hezbollah’s security is so tight that Israel would almost have to be getting its information from insiders.\nSince early October, when Hezbollah began launching attacks into northern Israel and Israel retaliated, nearly 400 Hezbollah members and more than 100 Lebanese civilians have died in the fighting.", "url": "https://www.stripes.com/theaters/middle_east/2024-07-26/israel-spying-killing-hezbollah-commanders-14604688.html", "date": "2024-07-26 18:15", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.4221483712069283, "count": 1, "average_score": 0.4221483712069283, "final_score": 0.4755038598448498}, "62210cce-b1fb-485e-955f-e7b7ac7fadb2": {"messages": [{"id": "62210cce-b1fb-485e-955f-e7b7ac7fadb2", "message": "Smoke rises over Gaza, as seen from IsraelJERUSALEM (Reuters) - Israeli troops battled Palestinian fighters in Khan Younis in southern Gaza and destroyed tunnels and other infrastructure, as they sought to suppress small militant units that have continued to hit troops with mortar fire, the military said on Friday.\nThe Israeli Defence Forces (IDF) said troops had killed around 100 Palestinian fighters since Israeli troops began their latest operation in Khan Younis on Monday, which continued as pressure mounted for a deal to halt the fighting.\nThe Islamic Jihad armed wing said it fired rockets toward the southern Israeli city of Ashkelon and other Israeli towns near Gaza.\nMedics said at least six Palestinians were killed in Israeli strikes in eastern Khan Younis.\nEven while the fighting continued around Khan Younis and Rafah in the south, in the northern part of the enclave, Israeli tanks pushed into the Tel Al-Hawa suburb west of Gaza city, residents said.", "url": "https://www.yahoo.com/news/israeli-troops-battle-palestinian-fighters-150438535.html", "date": "2024-07-26 15:30", "source": "GDELT"}, {"id": "70f44b66-2e6d-4d29-941a-09d8d1ed0416", "message": "Israeli troops battle Palestinian fighters in Gaza city of Khan YounisWorld World Israeli troops battle Palestinian fighters in Gaza city of Khan YounisMedics said at least six Palestinians were killed in Israeli strikes in eastern Khan Younis.\nThe Israeli Defence Forces (IDF) said troops had killed around 100 Palestinian fighters since Israeli troops began their latest operation in Khan Younis on Monday, which continued as pressure mounted for a deal to halt the fighting.\nThe Islamic Jihad armed wing said it fired rockets toward the southern Israeli city of Ashkelon and other Israeli towns near Gaza.\nMedics said at least six Palestinians were killed in Israeli strikes in eastern Khan Younis.\nA Hamas Telegram channel said fighters targeted an Israeli tank in Tal Al-Hawa and shot an Israeli soldier.", "url": "https://dunyanews.tv/en/World/826786-israeli-troops-battle-palestinian-fighters-in-gaza-city-of-khan-younis", "date": "2024-07-27 04:30", "source": "GDELT"}], "location": "GAZA", "total_score": 0.44032379417618717, "count": 1, "average_score": 0.44032379417618717, "final_score": 0.48822665592333103}, "7b0d902e-464b-4c7b-9aae-b0540619bf0c": {"messages": [{"id": "7b0d902e-464b-4c7b-9aae-b0540619bf0c", "message": "Several rockets were launched Thursday against a base hosting troops from the US-led coalition in Iraq, security officials said.\n\"Four rockets fell in the vicinity\" of Ain al-Assad base in Anbar province, an Iraqi security source said.\nAnother security official said an attack occurred with \"a drone and three rockets\" that fell close to the base perimeter.\nA US official said initial reports indicated that projectiles landed outside the base without causing injuries or damage to the base.\nThe US military has some 2,500 troops deployed in Iraq and 900 in Syria with the international coalition.", "url": "https://www.newarab.com/news/rockets-launched-iraq-base-hosting-us-troops-sources", "date": "2024-07-26 02:00", "source": "GDELT"}, {"id": "dea04e47-e605-413c-8106-013ccbd13f47", "message": "An airbase housing the US’s occupation forces in western Iraq has come under fresh attack amid continued regional uproar against Washington’s unstinting support for the Israeli regime’s genocidal war on the Gaza Strip.\nSeveral rockets were launched against the Ain al-Assad Airbase, which is located in the Arab country’s Anbar Province, on Thursday, Iraqi security officials said.\n\"Four rockets fell in the vicinity\" of the outpost, one security source said.\nAnother said an attack had occurred with \"a drone and three rockets\" that fell close to the base’s perimeter.\nThe Israeli military onslaught has so far claimed the lives of more than 39,175 Palestinians, mostly women and children, and wounded 90,257 others.", "url": "http://www.presstv.ir/Detail/2024/07/26/730070/United-States-airbase-Iraq-attack-rockets-drone-Israel-Gaza-war", "date": "2024-07-26 03:45", "source": "GDELT"}, {"id": "e88be807-3f6a-4b5c-b84b-7831c3c8d855", "message": "BAGHDAD: Several rockets were launched on Thursday and Friday against bases hosting troops from the US-led coalition in Iraq and Syria, security officials and a war monitor said.\nAnother security official said an attack occurred with “a drone and three rockets” that fell close to the base perimeter.\nThe rocket was fired from “zones under the control of pro-Iranian” groups, said the monitor which relies on sources inside Syria.\nArmed groups in Iraq have largely halted similar attacks on US-backed troops in recent months.\nThe US military has around 2,500 troops in Iraq and 900 in Syria with the international coalition.", "url": "https://www.dawn.com/news/1848296/rockets-fired-at-bases-hosting-us-troops-in-iraq-and-syria", "date": "2024-07-27 08:00", "source": "GDELT"}], "location": "ALASRA", "total_score": 1.2328693479383988, "count": 2, "average_score": 0.6164346739691994, "final_score": 0.6415042717784395}, "0119e2c8-62b4-4b03-9832-0a847dfbab4d": {"messages": [{"id": "0119e2c8-62b4-4b03-9832-0a847dfbab4d", "message": "Security forces kill terrorist in North Waziristan IBOSecurity forces conducted an intelligence based operation in North Waziristan today on reported presence of terrorists during which Khawarji Terrorist Razzaq was killed.\nAccording to ISPR, the killed terrorist was a close associate of Khawarji Gul Bahadur and was actively involved in numerous terrorist activities in the area including target killing of Malik Sher Muhammad, grandson of Faqir of Ippi last year as well as facilitation of suicide bombing attack in North Waziristan in March this year which resulted in shahadat of seven brave soldiers.\nSanitization operation is being conducted to eliminate any other terrorist found in the area as Security Forces of Pakistan remain determined to eliminate the menace of terrorism from the country.", "url": "https://www.radio.gov.pk/26-07-2024/security-forces-kill-terrorist-in-north-waziristan-ibo", "date": "2024-07-26 19:30", "source": "GDELT"}, {"id": "af8cf887-6564-4b11-8e22-bb4338b6464b", "message": "Security forces personnel are seen in this undated photo.\n— AFP/FileRAWALPINDI: Security forces killed terrorist Razzaq, a close associate of Khwarariji Haji Gul Bahadur in an Intelligence Based Operation (IBO) in North Waziristan on Friday.\nSecurity forces conducted an intelligence based operation in North Waziristan District on reported presence of terrorists.\nDuring conduct of the operation, after intense fire exchange, Khawarji Terrorist Razzaq was killed, the Inter-Services Public Relations (ISPR) in a statement said.\nSensitisation operation is being conducted to eliminate any other terrorist found in the area as security forces of Pakistan remain determined to eliminate the menace of terrorism from the country.", "url": "https://www.thenews.com.pk/print/1213822-wanted-terrorist-killed-in-north-waziristan", "date": "2024-07-27 02:00", "source": "GDELT"}], "location": "North Waziristan", "total_score": 0.582694553808312, "count": 1, "average_score": 0.582694553808312, "final_score": 0.5878861876658185}, "da515ed7-d1c9-4308-a24d-28210cb094e2": {"messages": [{"id": "da515ed7-d1c9-4308-a24d-28210cb094e2", "message": "Read previewIn a snowy landscape near Stepove in eastern Ukraine, Russian and Ukrainian armored vehicles went head-to-head in what appeared to be a mismatched fight.\nAdvertisement\"So armored vehicles dash in, fulfill their combat mission, and then withdraw as fast as they can,\" Gressel said.\nOnly weeks later, a Bradley took out two BTR-82 Russian armored troop carriers in the same region.\nIn head-to-head battles with Russian tanks, the Bradley lacks the combat power of the heavily armed, heavily armored tanks, but its chain gun has a rapid rate of fire that can prove effective.\nAdvertisementParakilas, the RAND analyst, said the Pentagon was modifying the Bradley vehicles to better defend them against the drone and air attacks that proved devastating against the western-supplied armored vehicles in the summer of last year.", "url": "https://www.businessinsider.com/ukraine-bradley-fighting-vehicles-unorthodox-ways-russia-war-putin-2024-6", "date": "2024-07-26 10:15", "source": "GDELT"}, {"id": "03b2f794-5865-428c-b20f-30f443566936", "message": "They're being used for bold attacks, armored combat, and casualty evacuation.\nIn a snowy landscape near Stepove in eastern Ukraine, Russian and Ukrainian armored vehicles went head-to-head in what appeared to be a mismatched fight.\nThe Russian tank's turret starts spinning, and then the tank veers off course and crashes into a tree.\n\"So armored vehicles dash in, fulfill their combat mission, and then withdraw as fast as they can,\" Gressel said.\nParakilas, the RAND analyst, said the Pentagon was modifying the Bradley vehicles to better defend them against the drone and air attacks that proved devastating against the western-supplied armored vehicles in the summer of last year.", "url": "https://www.yahoo.com/news/ukraines-us-provided-bradley-armored-091502622.html", "date": "2024-07-26 10:15", "source": "GDELT"}], "location": "ODESSA, UKRAINE", "total_score": 0.47673209411153006, "count": 1, "average_score": 0.47673209411153006, "final_score": 0.5137124658780711}, "31d8fc6b-056b-443e-9df1-9a96b5cee9d7": {"messages": [{"id": "31d8fc6b-056b-443e-9df1-9a96b5cee9d7", "message": "(MENAFN- IANS) Srinagar, July 27 (IANS) Three were on Saturday in a fierce gun battle on the Line of Control (LoC) in Jammu and Kashmir's (J&K) Kupwara District.\nOfficial sources said that three soldiers were injured when firing exchanges took place near Kumkarib post on the LoC in Trehgam sector of Kupwara District on Saturday.\n“Some movement was noticed by the soldiers on the LoC after which firing exchanges started between the terrorists and the armymen.\nOn July 18, two terrorists were killed when the Army foiled an infiltration bid on the LoC in Keran sector of Kupwara District.\nIt is yet to be ascertained whether Saturday's firing exchanges were due to an infiltration bid or some other attempt by terrorists operating from across the LoC.", "url": "https://menafn.com/1108488331/3-Army-Soldiers-Injured-In-Firing-Exchanges-On-Loc-In-JKS-Kupwara-District-Ld", "date": "2024-07-27 06:15", "source": "GDELT"}, {"id": "bb496739-8fba-4e85-a39a-29c2c89d69d7", "message": "Srinagar: Three Army soldiers were injured on Saturday in a fierce gun battle on the Line of Control (LoC) in Jammu and Kashmir’s (J&K) Kupwara District.\nOfficial sources said that three soldiers were injured when firing exchanges took place near Kumkarib post on the LoC in Trehgam sector of Kupwara District on Saturday.\n“Some terrorist movement was noticed by the soldiers on the LoC after which firing exchanges started between the terrorists and the armymen.\nTerrorists aided by Pakistan Army have been making fresh infiltration attempts in J&K in recent days.\nOn July 18, two terrorists were killed when the Army foiled an infiltration bid on the LoC in Keran sector of Kupwara District.", "url": "https://www.en.etemaaddaily.com/world/national/fierce-gun-battle-breaks-out-along-loc-in-kupwara-three-soldiers-injured:157906", "date": "2024-07-27 07:15", "source": "GDELT"}], "location": "Kupwara District", "total_score": 0.34098112795103463, "count": 1, "average_score": 0.34098112795103463, "final_score": 0.41868678956572425}, "a660e78d-bb2d-42c4-b811-e575b5af443b": {"messages": [{"id": "a660e78d-bb2d-42c4-b811-e575b5af443b", "message": "The health ministry in Hamas-run Gaza said an Israeli strike Saturday on a school killed 30 people, after a days-long military operation further south left around 170 dead, according to the civil defence agency.\nThe latest strike in the Deir el-Balah city area targeted Khadija school, the health ministry said.\nThe militants also seized 251 hostages, 116 of whom are still in Gaza, including 44 the Israeli military says are dead.\nIsrael's retaliatory military campaign in Gaza has killed more than 39,000 people, also mostly civilians, according to data from the health ministry in Hamas-run Gaza.\nIsrael's military said it carried out a strike on the school targeting 'terrorists' operating there100 people are believed to be wounded", "url": "https://www.dailymail.co.uk/news/article-13678903/Hamas-says-Israeli-airstrike-Gaza-school-killed-30-wounded-100-IDF-says-terrorists-operating-there.html", "date": "2024-07-27 14:15", "source": "GDELT"}, {"id": "35be990c-cca5-43cf-a1f4-286f1cf593a6", "message": "Smoke rises during an Israeli strike in Deir el-Balah, central Gaza - Copyright AFP/File Mandel NGANThe health ministry in Hamas-run Gaza said an Israeli strike Saturday on a school killed 30 people, after a days-long military operation further south left around 170 dead, according to the civil defence agency.\nThe latest strike in the Deir el-Balah city area targeted Khadija school, the health ministry said.\nOn Wednesday the military said troops carried out an operation in Khan Yunis and retrieved the bodies of five Israelis.\nIsrael’s military said on Friday that its forces had “eliminated approximately 100” militants in Khan Yunis during the week.\nIsrael’s retaliatory military campaign in Gaza has killed at least 39,258 people, according to Gaza’s health ministry, which does not provide details of civilian and militant deaths.", "url": "https://www.digitaljournal.com/world/health-ministry-in-hamas-run-gaza-says-30-killed-in-school-strike/article", "date": "2024-07-27 16:00", "source": "GDELT"}], "location": "GAZA", "total_score": 0.5359187582244208, "count": 1, "average_score": 0.5359187582244208, "final_score": 0.5551431307570945}, "210dc360-b0ea-4af0-b4ed-d37d6cfbfb17": {"messages": [{"id": "210dc360-b0ea-4af0-b4ed-d37d6cfbfb17", "message": "TEL AVIV, Israel (AP) — The Israeli military says all 10 people killed in a rocket attack on town in Israeli-controlled Golan Heights were aged 10 to 20.\nTEL AVIV, Israel (AP) — A rocket attack Saturday on a soccer field in the Israeli-controlled Golan Heights killed at least 10 people and wounded several others, including children, hours after an Israeli airstrike on south Lebanon killed three members of the militant Hezbollah group.\nHezbollah said it struck a military base in the Golan Heights in retaliation for Israeli attacks on a village in Lebanon.\nIsrael and Hezbollah have traded near daily fire since the war in Gaza started after Hamas’ surprise attack on Oct.7 killed some 1,200 people and took 250 others hostage.\nSince early October, Israeli airstrikes in Lebanon have killed more than 450 people, mostly Hezbollah members, but also around 90 civilians and non-combatants.", "url": "https://www.bostonglobe.com/2024/07/27/world/at-least-10-killed-israel-hezbollah/", "date": "2024-07-27 19:00", "source": "GDELT"}, {"id": "c29af8ba-609f-4f33-a53c-ad9fb08b1d52", "message": "Rocket attack on Israeli-controlled Golan Heights kills 10, rescue official saysTEL AVIV, Israel — A rocket attack Saturday on a soccer field in the Israeli-controlled Golan Heights killed at least 10 people and wounded several others, including children, hours after an Israeli airstrike on south Lebanon killed three members of the militant Hezbollah group.\nHezbollah said it struck a military base in the Golan Heights in retaliation for Israeli attacks on a village in Lebanon.\nThe Israeli military said one projectile was identified crossing from Lebanon toward the area, adding it was cooperating with the MDA to evacuate the wounded.\nHezbollah said in a statement that its militants firing Katyusha rockets at an Israeli army post in the Golan Heights was in response to Israeli airstrikes on villages in south Lebanon.\nIsrael captured the Golan Heights from Syria during the 1967 Mideast war and later annexed them in 1981.", "url": "https://www.npr.org/2024/07/27/nx-s1-5054339/rocket-attack-on-israeli-controlled-golan-heights-kills-10-rescue-official-says", "date": "2024-07-27 18:45", "source": "GDELT"}, {"id": "ab3662b4-00b5-4cae-a3e8-4adc7dedc417", "message": "A rocket attack Saturday on a soccer field in the Israeli-controlled Golan Heights killed at least 10 people and wounded several others, including children, hours after an Israeli airstrike on south Lebanon killed three members of the militant Hezbollah group.\nHezbollah said it struck a military base in the Golan Heights in retaliation for Israeli attacks on a village in Lebanon.\nHezbollah chief spokesman Mohammed Afif told The Associated Press that the group \"categorically denies carrying out an attack on Majdal Shams.\"\nThe Israeli military said one projectile was identified crossing from Lebanon toward the area, adding it was cooperating with the MDA to evacuate the wounded.\nIsrael captured the Golan Heights from Syria during the 1967 Mideast war and later annexed them in 1981.", "url": "https://wpde.com/news/nation-world/rocket-attack-on-town-in-israeli-controlled-golan-heights-kills-10-rescue-official-says-middle-east-hezbollah-fighting", "date": "2024-07-27 19:00", "source": "GDELT"}, {"id": "e442cff4-c745-4286-ab06-fa8eec497e66", "message": "Israel says all 10 killed in attack on town in Israeli-controlled Golan Heights were 20 and underBy Tia Goldenberg And Bassem Mroue, The Associated Press on July 27, 2024.\n(AP Photo)TEL AVIV, Israel (AP) – The Israeli military says all 10 people killed in a rocket attack on town in Israeli-controlled Golan Heights were aged 10 to 20.\nTEL AVIV, Israel (AP) – A rocket attack Saturday on a soccer field in the Israeli-controlled Golan Heights killed at least 10 people and wounded several others, including children, hours after an Israeli airstrike on south Lebanon killed three members of the militant Hezbollah group.\nHezbollah said it struck a military base in the Golan Heights in retaliation for Israeli attacks on a village in Lebanon.\nIsrael captured the Golan Heights from Syria during the 1967 Mideast war and later annexed them in 1981.", "url": "https://lethbridgeherald.com/news/world-news/2024/07/27/israel-says-all-10-killed-in-attack-on-town-in-israelicontrolled-golan-heights-were-20-and-under/", "date": "2024-07-27 19:30", "source": "GDELT"}, {"id": "3b0027cd-d933-4a18-ba34-ef86bb452e32", "message": "TEL AVIV, Israel — A rocket attack Saturday on a soccer field in the Israeli-controlled Golan Heights killed at least 10 people and wounded several others, including children, hours after an Israeli airstrike on south Lebanon killed three members of the militant Hezbollah group.\nHezbollah said it struck a military base in the Golan Heights in retaliation for Israeli attacks on a village in Lebanon.\nThe Israeli military said one projectile was identified crossing from Lebanon toward the area, adding it was cooperating with the MDA to evacuate the wounded.\nHezbollah said in a statement that its militants firing Katyusha rockets at an Israeli army post in the Golan Heights was in response to Israeli airstrikes on villages in south Lebanon.\nIsrael captured the Golan Heights from Syria during the 1967 Mideast war and later annexed them in 1981.", "url": "https://www.kasu.org/2024-07-27/rocket-attack-on-israeli-controlled-golan-heights-kills-10-rescue-official-says", "date": "2024-07-27 18:45", "source": "GDELT"}], "location": "NULL", "total_score": 2.1398927292328076, "count": 4, "average_score": 0.5349731823082019, "final_score": 0.6444812276157413}, "4baef444-02a3-4ae3-931f-928bb5d47ebe": {"messages": [{"id": "4baef444-02a3-4ae3-931f-928bb5d47ebe", "message": "A rocket attack on a football ground in the Israeli-occupied Golan Heights has killed 11 people, including children, Israeli authorities said, with Israel accusing Hezbollah of the strike but the Lebanese group denying any role.\n\"The Hezbollah attack today crossed all red lines and the response will be accordingly,\" Israeli Foreign Minister Israel Katz told Axios.\nIsraeli security forces gather near the site of the attackThe group had earlier announced several rocket attacks targeting Israeli military positions in other locations from Lebanon.\nThe attack on the soccer pitch followed an Israeli strike in Lebanon that killed four militants.\nThe Israeli military said its aircraft had targeted a military structure belonging to Hezbollah, after identifying a militant cell entering the building.", "url": "https://www.rte.ie/news/2024/0727/1462176-golan-heights-attack/", "date": "2024-07-27 18:00", "source": "GDELT"}, {"id": "3a0378d3-197b-44cd-b95c-16f5713a953d", "message": "We are approaching the moment of an all-out war against Hezbollah and Lebanon,\" Foreign Minister Israel Katz told Axios.\nThe group had earlier announced several rocket attacks targeting Israeli military positions in other locations from Lebanon.\nHamas has also carried out rocket attacks on Israel from Lebanon, as has the Lebanese Sunni group, the Jama'a Islamiya, since October.\nThe attack on the soccer pitch followed an Israeli strike in Lebanon that killed four militants on Saturday.\nThe Israeli military said its aircraft had targeted a military structure belonging to Hezbollah, after identifying a militant cell entering the building.", "url": "https://www.yahoo.com/news/nine-people-killed-rocket-hits-171916545.html", "date": "2024-07-27 18:00", "source": "GDELT"}], "location": "the Golan Heights", "total_score": 0.5210135135135135, "count": 1, "average_score": 0.5210135135135135, "final_score": 0.5447094594594595}, "6490215e-31cb-47f6-ba8e-38509f94fd38": {"messages": [{"id": "6490215e-31cb-47f6-ba8e-38509f94fd38", "message": "Irish premier Simon Harris has condemned an Israeli airstrike attack on a school building in which dozens were killed and injured as “inhumane and despicable”.\nAt least 30 people sheltering at a girls’ school in Deir Al-Balah were taken to hospital and pronounced dead, after a strike that Israel’s military said targeted Hamas militants’ operations.\nIn a statement, Taoiseach Simon Harris condemned the attack as “a further demonstration of brutal, unconscionable violence”.\nThe war began with an assault by Hamas militants on southern Israel on October 7 that killed 1,200 people, most of them civilians, and took about 250 hostages.\nAbout 115 are still in Gaza, about a third of them believed to be dead, according to Israeli authorities.", "url": "https://www.limerickleader.ie/news/national-news/1565319/irish-premier-condemns-israeli-strike-on-gaza-school-as-inhumane-and-despicable.html", "date": "2024-07-27 18:45", "source": "GDELT"}, {"id": "fc17a8ec-bb76-4488-aab3-7110be9103e9", "message": "Taoiseach Simon Harris described an Israeli attack on a school building as ‘inhuman and despicable’ (Brian Lawless/PA)Irish premier Simon Harris has condemned an Israeli airstrike attack on a school building in which dozens were killed and injured as “inhumane and despicable”.\nIn a statement, Taoiseach Simon Harris condemned the attack as “a further demonstration of brutal, unconscionable violence”.\n“I again call for an immediate ceasefire, the release of all hostages and unimpeded access for aid into Gaza.\n“The bloodshed and suffering need to end.”Israel’s military offensive in Gaza has killed more than 39,100 Palestinians, according to the territory’s health ministry.\nAbout 115 are still in Gaza, about a third of them believed to be dead, according to Israeli authorities.", "url": "https://www.inverness-courier.co.uk/news/national/irish-premier-condemns-israeli-strike-on-gaza-school-as-inhumane-and-despicable-113601/", "date": "2024-07-27 16:15", "source": "GDELT"}], "location": "GAZA", "total_score": 0.561022088476109, "count": 1, "average_score": 0.561022088476109, "final_score": 0.5727154619332763}, "b0051fb4-5f42-4dc5-9f61-5766f3651cb7": {"messages": [{"id": "b0051fb4-5f42-4dc5-9f61-5766f3651cb7", "message": "At least 30 Palestinians were said to have been killed in the Israeli strike on the Khadija school in Deir al-Balah.\nPhotograph: Mohammed Saber/EPAA wave of Israeli airstrikes targeting central and southern Gaza have killed at least 50 people and injured an estimated 200, with one strike hitting a school where thousands were seeking shelter.\nPalestinian health ministry officials said at least 30 people were killed in an airstrike on the Khadija school in Deir al-Balah in the central Gaza Strip.\nWounded people poured into the nearby Aqsa hospital, while images from Deir al-Balah showed families carrying injured children for treatment.\nThe strike in Deir al-Balah was accompanied by further strikes on Khan Younis, after a week of deadly fighting in Gaza’s second city.", "url": "https://www.aol.co.uk/news/wave-israeli-airstrikes-kills-least-142004780.html", "date": "2024-07-27 14:45", "source": "GDELT"}, {"id": "61338214-5fd1-4b82-be1a-f92d152257b0", "message": "Photograph: Eyad Baba/AFP via Getty ImagesA wave of Israeli air strikes targeting central and southern Gaza have killed at least 50 people and injured an estimated 200, with one strike hitting a school where thousands were seeking shelter.\nPalestinian health ministry officials said at least 30 people were killed in an air strike on the Khadija school in Deir al-Balah in the central Gaza Strip.\nIsraeli forces also conducted strikes outside Gaza, including a drone strike on the Balata refugee camp near Nablus in the West Bank, killing one, after an Israeli soldier was wounded at a nearby checkpoint.\nIsraeli air strikes on the southern Lebanese town of Kafr Kila reportedly killed four people, as militants in Lebanon responded with a barrage of rocket fire into Israeli territory.\nIsraeli air strikes have also targeted areas previously designated as safe.", "url": "https://www.irishtimes.com/world/middle-east/2024/07/27/wave-of-israeli-air-strikes-kills-at-least-50-people-in-gaza/", "date": "2024-07-27 18:00", "source": "GDELT"}], "location": "GAZA CITY", "total_score": 0.5725736782346843, "count": 1, "average_score": 0.5725736782346843, "final_score": 0.580801574764279}, "86c3767a-9c59-475b-9f30-0cee29e75023": {"messages": [{"id": "86c3767a-9c59-475b-9f30-0cee29e75023", "message": "CNN —At least 30 people have been killed and over 100 injured in an Israeli airstrike on a school in Deir-al Balah, central Gaza, where thousands were sheltering, Palestinian officials said.\nThe Israeli military said it had launched the strike in order to destroy a Hamas command and control center inside the compound.\nThe United Nations estimated that about 150,000 people fled Khan Younis on Monday alone, intensifying pressure on meager supplies of food and water, and places to seek shelter.\nScenes filmed by CNN in Khan Younis show people fleeing by car, motorbike, and donkey cart with all of their belongings.\nIsrael launched its military offensive in Gaza on October 7 after Hamas attacked southern Israel.", "url": "https://edition.cnn.com/2024/07/27/middleeast/israel-gaza-deir-al-balah-school-intl/", "date": "2024-07-27 15:15", "source": "GDELT"}, {"id": "72a8e548-6c56-46e7-a3dc-c411088b4132", "message": "The Israeli military said it had launched the strike in order to destroy a Hamas command and control center inside the compound.\nThe United Nations estimated that about 150,000 people fled Khan Younis on Monday alone, intensifying pressure on meager supplies of food and water, and places to seek shelter.\nScenes filmed by CNN in Khan Younis show people fleeing by car, motorbike, and donkey cart with all of their belongings.\nIsrael launched its military offensive in Gaza on October 7 after Hamas attacked southern Israel.\nIsraeli military action in Gaza has since killed 39,258 Palestinians and injured another 90,589, according to the Ministry of Health there.", "url": "https://kesq.com/news/national-world/cnn-world/2024/07/27/israel-warns-it-will-forcefully-operate-in-part-of-gazas-khan-younis-issues-evacuation-order/", "date": "2024-07-27 15:15", "source": "GDELT"}], "location": "GAZA", "total_score": 0.3893632683106367, "count": 1, "average_score": 0.3893632683106367, "final_score": 0.45255428781744567}}