{"056dc1de-aac5-431f-9fa1-117bbdf8be56": {"messages": [{"id": "056dc1de-aac5-431f-9fa1-117bbdf8be56", "message": "An AP investigation interviewed survivors, family and investigators and obtained an internal U.N. analysis.\nDespite the conclusion of the internal analysis that found Russia planned and executed the attack, the U.N. stopped short of accusing Russia in public statements.\nIn the days following the Olenivka deaths, U.N. Secretary-General António Guterres launched an independent mission to investigate.\nAs the clock ticked down to a U.N. Security Council meeting later that day, Russia and Ukraine blamed each other.\nDujarric did not respond to questions about the internal analysis.", "url": "https://www.yahoo.com/news/explosion-killed-over-50-ukrainian-072043183.html", "date": "2024-07-25 07:45", "source": "GDELT"}, {"id": "cd1839fd-cc48-483d-8597-bc731ec453fb", "message": "Despite the conclusion of the internal analysis that found Russia planned and executed the attack, the U.N. stopped short of accusing Russia in public statements.\nIn the days following the Olenivka deaths, U.N. Secretary-General António Guterres launched an independent mission to investigate.\nThey were taken to a cinder-block building with a tin-plate roof and 100 bunks, no mattresses and a hastily dug pit toilet, multiple survivors told AP.\nAs the clock ticked down to a U.N. Security Council meeting later that day, Russia and Ukraine blamed each other.\nFading hopes for justiceA Ukrainian investigation is ongoing, according to Taras Semkiv of the Ukrainian prosecutor general’s war crimes unit.", "url": "https://www.mymotherlode.com/news/east-europe/3397022/an-explosion-killed-over-50-ukrainian-pows-in-2022-survivors-and-an-internal-un-report-blame-russia.html", "date": "2024-07-25 09:30", "source": "GDELT"}], "location": "Olenivka.", "total_score": 0.498328734549207, "count": 1, "average_score": 0.498328734549207, "final_score": 0.5288301141844449}, "ee440a97-49dc-430f-b726-af6bab5d274c": {"messages": [{"id": "ee440a97-49dc-430f-b726-af6bab5d274c", "message": "CAIRO (Reuters) - Israeli forces advanced deeper into some towns on the eastern side of Khan Younis in southern Gaza on Thursday, hours after Israeli Prime Minister Benjamin Netanyahu told U.S. lawmakers he was actively engaged in bringing hostages home.\nHamas militants took more than 250 hostages in the early morning raid into southern Israel and killed 1,200 people, according to Israeli tallies.\nIsrael retaliated by vowing to eradicate Hamas in Gaza in a nine-month war that has killed more than 39,000 Palestinians, Gaza health officials say.\nSeveral were wounded in the eastern towns during Israeli tank and aerial shelling, while an airstrike east of Khan Younis killed four people, Palestinian health officials said.\nThe Israeli military said forces operating in Khan Younis killed dozens of militants and dismantled around 50 military infrastructures, while it continued activities in Rafah, killing two militants.", "url": "https://www.marketscreener.com/quote/currency/EURO-ISRAELI-NEW-SHEKEL-E-60037304/news/Israeli-forces-advance-in-southern-Gaza-tanks-active-in-Rafah-47466677/", "date": "2024-07-25 09:30", "source": "GDELT"}, {"id": "ef7239ef-5349-4d4b-8729-9889e480a8d1", "message": "Hamas militants took more than 250 hostages in the early morning raid into southern Israel and killed 1,200 people, according to Israeli tallies.\nIsrael retaliated by vowing to eradicate Hamas in Gaza in a nine-month war that has killed more than 39,000 Palestinians, Gaza health officials say.\nSeveral were wounded in the eastern towns during Israeli tank and aerial shelling, while an airstrike east of Khan Younis killed four people, Palestinian health officials said.\nIsraeli bombardment intensified in several areas in Rafah, near the border with Egypt, as tanks operated north, west and in the town centre, residents and medics said.\nThe Israeli military said forces operating in Khan Younis killed dozens of militants and dismantled around 50 military infrastructures, while it continued activities in Rafah, killing two militants.", "url": "https://www.theglobeandmail.com/world/article-israeli-forces-advance-in-southern-gaza-tanks-active-in-rafah/", "date": "2024-07-25 14:30", "source": "GDELT"}], "location": "GAZA", "total_score": 0.4074365274365275, "count": 1, "average_score": 0.4074365274365275, "final_score": 0.4652055692055692}, "b28dfea4-6266-40fb-847e-27496c1ce2a8": {"messages": [{"id": "b28dfea4-6266-40fb-847e-27496c1ce2a8", "message": "A 24-year-old man has been charged with the attempted murder of an Army officer in uniform near a barracks (Gareth Fuller/PA)A 24-year-old man has been charged with the attempted murder of an Army officer in uniform near a barracks.\nAnthony Esan will appear in court on Thursday over the attack on Lieutenant Colonel Mark Teeton, in Gillingham, Kent, on Tuesday.\nThe serviceman, in his 40s, is in hospital in a serious but stable condition after being repeatedly stabbed.\nEsan, who was arrested near his home in nearby Rochester, has also been charged with possessing an offensive weapon in a public place and will appear at Medway Magistrates’ Court.\nHead of the Army General Sir Roly Walker condemned the stabbing as “horrific and unprovoked”, while Prime Minister Sir Keir Starmer said he was “shocked and appalled”.", "url": "https://www.belfasttelegraph.co.uk/news/uk/man-charged-over-stabbing-of-uniformed-army-officer/a531188845.html", "date": "2024-07-25 09:00", "source": "GDELT"}, {"id": "3f0d343e-f841-4b07-8979-ea873bad439a", "message": "A man has been remanded in custody after appearing in court charged with the attempted murder of an Army officer in uniform near a barracks.\nAnthony Esan, 24, is accused of repeatedly stabbing Lieutenant Colonel Mark Teeton in Gillingham, Kent, on Tuesday.\nHe appeared at Medway Magistrates’ Court on Thursday wearing a grey T-shirt and will next appear at Maidstone Crown Court on August 22.\nTwo knives were dropped at the scene and a further three were found stored on the bike, the prosecutor said.\nHead of the Army General Sir Roly Walker condemned the stabbing as “horrific and unprovoked”, while Prime Minister Sir Keir Starmer said he was “shocked and appalled”.", "url": "https://www.aol.co.uk/man-appears-court-charged-attempted-095634318.html", "date": "2024-07-25 11:15", "source": "GDELT"}], "location": "Gillingham", "total_score": 0.5096934719027741, "count": 1, "average_score": 0.5096934719027741, "final_score": 0.5367854303319419}, "350745db-241f-4aed-9154-473df148818f": {"messages": [{"id": "350745db-241f-4aed-9154-473df148818f", "message": "https://sputnikglobe.com/20240725/russian-iskander-m-hits-foreign-mercenaries-temporary-deployment-site-in-kharkov---mod-1119497113.htmlRussian Iskander-M Hits Foreign Mercenary Temporary Deployment Site in Kharkov - MoDRussian Iskander-M Hits Foreign Mercenary Temporary Deployment Site in Kharkov - MoDSputnik InternationalRussia's Iskander-M missile defense system struck a temporary deployment site for foreign mercenaries in the industrial zone of the city of Kharkov, killing up to 100 military personnel, including 40 foreign instructors, the Russian Ministry of Defense (MoD) said on Thursday.\n2024-07-25T09:07+00002024-07-25T09:07+00002024-07-25T09:38+0000russia's special operation in ukrainekharkovrussian ministry of defenseiskander-mmercenariesmissile systemhttps://cdn1.img.sputnikglobe.com/img/07e8/05/06/1118290030_0:0:3077:1731_1920x0_80_0_0_0fab81368c6aeac5019e3f3578ab0396.jpg\"The crew of the Iskander-M operational-tactical missile system carried out a missile strike on the temporary deployment site of foreign mercenaries in ... the industrial zone of the city of Kharkov.\nAs a result of the strike, up to 100 militants were killed, of which 40 were foreign instructors, as well as about 60 servicemen of the 151st mechanized brigade of the Ukrainian armed forces,\" the ministry said in a statement.The Russian Ministry of Defense has previously reported the elimination of mercenaries from the United States, the United Kingdom, Georgia, and other countries, and regularly reports on the destruction of locations where foreigners fighting for Kiev are concentrated.\nkharkovSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 602024Sputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Newsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Sputnik Internationalrussia’s special military op in ukraine, special military operation, special military operational zone, special op zone, russian troops in special op zone, ukraine casualties in conflict, total ukrainian losses, how many people did ukraine loose, how many people did kiev loose, new russian weapons in ukraine, advanced russian weapons, russian defense ministry statements, latest russian military statements, what did shoigu say about ukraine, donetsk people’s republic, nato in ukraine, is nato in ukraine, russian drones, drone warfare, new military drones, uavs in ukraine, ukraine crisis, ukraine conflict, battlegroup sever, battlegroup yug, battlegroup zapad, battlegroup vostok, battlegroup tsentr, battlegroup dnepr, russia ukraine peace talks, russia ukraine peace settlement, russia ukraine negotiations, russian air defenses", "url": "https://sputnikglobe.com/20240725/russian-iskander-m-hits-foreign-mercenaries-temporary-deployment-site-in-kharkov---mod-1119497113.html", "date": "2024-07-25 11:00", "source": "GDELT"}, {"id": "4076b226-1ddf-45a2-a7cc-696827544225", "message": "Russian Iskander-M Hits Foreign Mercenary Temporary Deployment Site in Kharkov - MoDSputnik News20240725MOSCOW (Sputnik) - Russia's Iskander-M missile defense system struck a temporary deployment site for foreign mercenaries in the industrial zone of the city of Kharkov, killing up to 100 military personnel, including 40 foreign instructors, the Russian Ministry of Defense (MoD) said on Thursday.\n\"The crew of the Iskander-M operational-tactical missile system carried out a missile strike on the temporary deployment site of foreign mercenaries in ... the industrial zone of the city of Kharkov.\nThe Russian Ministry of Defense has previously reported the elimination of mercenaries from the United States, the United Kingdom, Georgia, and other countries, and regularly reports on the destruction of locations where foreigners fighting for Kiev are concentrated.\nAccording to the Ministry, over 13,000 foreign mercenaries have arrived in Ukraine to fight for the Kiev regime since the start of the special operation.\nÂ© SputnikNEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/07/ukraine-240725-sputnik04.htm", "date": "2024-07-26 12:30", "source": "GDELT"}], "location": "Kharkov", "total_score": 0.6496827014073328, "count": 1, "average_score": 0.6496827014073328, "final_score": 0.6347778909851329}, "2ea5c5a1-1b07-43c5-b3a1-e77f93951439": {"messages": [{"id": "2ea5c5a1-1b07-43c5-b3a1-e77f93951439", "message": "WASHINGTON -- Israeli Prime Minister Benjamin Netanyahu gave a fiery defense of his country's military operations in Gaza in a joint address to U.S. lawmakers on Wednesday.\nThe address to Congress comes over nine months into the ongoing conflict in Gaza, which began when Hamas attacked Israel on Oct. 7.\nDuring Netanyahu's address, parts of the U.S. Capitol were occupied by protesters against the war in Gaza who had been there since Tuesday.\nAccording to the Hamas-run Ministry of Health in Gaza, more than 39,000 people have been killed in Israeli operations.\nInternational journalists have not been allowed inside Gaza by Israel with the exception of tightly controlled tours by the IDF.", "url": "https://abc7.com/post/fact-checking-israeli-prime-minister-benjamin-netanyahus-address-congress/15094067/", "date": "2024-07-25 15:15", "source": "GDELT"}, {"id": "bcc3d929-d0ba-4fc4-bde0-7ee4532476c5", "message": "(WASHINGTON) — Israeli Prime Minister Benjamin Netanyahu stood before Congress on Wednesday, delivering a joint address to U.S. lawmakers on the ongoing war with Hamas and renewing his call for bipartisan support in the Middle East.\nThe address to Congress comes over nine months into the ongoing conflict in Gaza, which began when Hamas attacked Israel on Oct. 7.\nAnother major reason aid is scarce in Gaza is that aid workers don’t feel safe distributing the aid.\nAccording to the Hamas-run Ministry of Health in Gaza, more than 39,000 people have been killed in Israeli operations.\nInternational journalists have not been allowed inside Gaza by Israel with the exception of tightly controlled tours by the IDF.", "url": "https://www.gowatertown.net/syndicated-article/?id=1575758", "date": "2024-07-25 16:00", "source": "GDELT"}, {"id": "77a923a4-5de5-40f3-a77c-2466b44008e3", "message": "The address to Congress comes over nine months into the ongoing conflict in Gaza, which began when Hamas attacked Israel on Oct. 7.\nAnother major reason aid is scarce in Gaza is that aid workers don't feel safe distributing the aid.\nAccording to the United Nations, more than 250 aid workers have been killed in Gaza as of this spring.\nU.S. officials have argued that if Israel allows more aid inside Gaza and guarantees security for those drivers, the looting will decrease.\nInternational journalists have not been allowed inside Gaza by Israel with the exception of tightly controlled tours by the IDF.", "url": "https://wadk.com/politics-news/8e812e9b0db01585e147a01e4f23145e", "date": "2024-07-25 16:15", "source": "GDELT"}], "location": "-\nGAZA", "total_score": 1.0032184439009209, "count": 2, "average_score": 0.5016092219504604, "final_score": 0.5611264553653222}, "57e8e2a4-38cd-4ef6-bc85-cab443d8c7a8": {"messages": [{"id": "57e8e2a4-38cd-4ef6-bc85-cab443d8c7a8", "message": "Israeli strikes hit Gaza on Thursday as the military said it had recovered the bodies of five Israelis taken to Gaza by Hamas militants after they were killed on October 7.\nA group supporting Israeli hostages still held in the Palestinian territory welcomed the return of the bodies but alleged \"sabotage\" of diplomatic efforts to secure the release of others still in captivity.\nOut of 251 people taken hostage that day, 111 are still held in Gaza, including 39 the military says are dead.\nThe army said the five bodies recovered from Gaza had been returned to Israel following an operation in Khan Yunis on Wednesday.\n\"It has now become apparent that the information provided to the hostages' families did not accurately reflect the situation's reality,\" the group said in a statement.", "url": "https://www.al-monitor.com/originals/2024/07/israel-strikes-gaza-military-recovers-five-captive-bodies", "date": "2024-07-25 14:15", "source": "GDELT"}, {"id": "f68b7ef2-1e1f-46d4-b69a-82d940ae936f", "message": "Israeli forces retrieved the remains of five Israelis, killed during Hamas’ October 7 attack on southern Israel, whose bodies had been taken to the Gaza Strip, the military said Thursday.\nMilitants also seized 251 hostages, 111 of whom remain in Gaza, including 39 the military says are dead.\nThe Hostages and Missing Families Forum insisted that the Israeli government agree to a ceasefire deal that could help return the remaining captives.\nRelatives and friends of hostages held in the Gaza Strip march during a rally calling for their release in Tel Aviv, Israel.\n“It has now become apparent that the information provided to the hostages’ families did not accurately reflect the situation’s reality,” the forum said in the latest statement.", "url": "https://www.scmp.com/news/world/middle-east/article/3271843/israeli-army-recovers-bodies-5-hostages-gaza", "date": "2024-07-25 08:30", "source": "GDELT"}], "location": "Gaza", "total_score": 0.6256302004344796, "count": 1, "average_score": 0.6256302004344796, "final_score": 0.6179411403041357}, "4490469c-2354-481f-9d69-81c5ddb17cd9": {"messages": [{"id": "4490469c-2354-481f-9d69-81c5ddb17cd9", "message": "Several rockets were launched Thursday against a base hosting troops from the US-led coalition in Iraq, security officials said.\n\"Four rockets fell in the vicinity\" of Ain al-Assad base in Anbar province, an Iraqi security source said.\nAnother security official said an attack occurred with \"a drone and three rockets\" that fell close to the base perimeter.\nA US official said initial reports indicated that projectiles landed outside the base without causing injuries or damage to the base.\nThe US military has some 2,500 troops deployed in Iraq and 900 in Syria with the international coalition.", "url": "https://www.newarab.com/news/rockets-launched-iraq-base-hosting-us-troops-sources", "date": "2024-07-26 02:00", "source": "GDELT"}, {"id": "8c398d78-8ddb-4bc6-880e-56049f07ef61", "message": "An airbase housing the US’s occupation forces in western Iraq has come under fresh attack amid continued regional uproar against Washington’s unstinting support for the Israeli regime’s genocidal war on the Gaza Strip.\nSeveral rockets were launched against the Ain al-Assad Airbase, which is located in the Arab country’s Anbar Province, on Thursday, Iraqi security officials said.\n\"Four rockets fell in the vicinity\" of the outpost, one security source said.\nAnother said an attack had occurred with \"a drone and three rockets\" that fell close to the base’s perimeter.\nThe Israeli military onslaught has so far claimed the lives of more than 39,175 Palestinians, mostly women and children, and wounded 90,257 others.", "url": "http://www.presstv.ir/Detail/2024/07/26/730070/United-States-airbase-Iraq-attack-rockets-drone-Israel-Gaza-war", "date": "2024-07-26 03:45", "source": "GDELT"}], "location": "ANBAR, IRAQ", "total_score": 0.6904471867662376, "count": 1, "average_score": 0.6904471867662376, "final_score": 0.6633130307363663}, "a8949d61-e07b-464c-a650-ef1828671fb7": {"messages": [{"id": "a8949d61-e07b-464c-a650-ef1828671fb7", "message": "Wounded in a strike that killed her family, a 2-year-old joins Gaza's ranks of thousands of orphansPalestinian Child Siwar Abdel-Hadi, 2, wounded in the Israeli bombardment of the Gaza Strip, receives medical treatment at a hospital in Deir al-Balah, Wednesday, July 24, 2024.\nSiwar Abdel-Hadi is the sole survivor in her family after an Israeli airstrike on her home in central Gaza killed her parents and three siblings.\nSiwar Abdel-Hadi is now an orphan.\nThe Israeli military rarely comments on individual strikes.\nOn the day of the strike that killed Siwar’s family, the military said it hit dozens of targets across the Gaza Strip, including military structures, observation posts and individual militants.", "url": "https://infotel.ca/newsitem/ml-israel-palestinians-orphaned-girl/cp1855299917", "date": "2024-07-26 08:00", "source": "GDELT"}, {"id": "c849327c-3d86-4229-bf5a-76aef5c55527", "message": "Amal Abdel-Hadi, left, and Nour Abdel-Hadi, right, react over their 2-year-old wounded niece, Siwar, as she receives treatment at a hospital in Deir al-Balah, Wednesday, July 24, 2024.\nSiwar Abdel-Hadi is the sole survivor in her family after an Israeli airstrike on her home in central Gaza killed her parents and three siblings.\nSiwar Abdel-Hadi is now an orphan.\nOn the day of the strike that killed Siwar’s family, the military said it hit dozens of targets across the Gaza Strip, including military structures, observation posts and individual militants.\nHer grandparents are still alive, but are sick and may not be able to raise her, Nour Abdel-Hadi said.", "url": "https://www.yahoo.com/news/wounded-strike-killed-her-family-062300527.html", "date": "2024-07-26 06:45", "source": "GDELT"}, {"id": "be120356-0297-4290-84f3-d534dacf7b92", "message": "Wounded in a strike that killed her family, a 2-year-old joins Gaza's ranks of thousands of orphansDEIR AL-BALAH, Gaza Strip (AP) — The 2-year-old toddler lay on a foil blanket, her face covered with salve for her burns and her little body riddled with scars from shrapnel.\nShe’s the lone survivor of an Israeli strike that hit their family home in central Gaza, killing her parents, her two sisters and her brother, along with a brother of her mother.\nShe spoke at nearby Al-Aqsa Martyrs Hospital in Deir al-Balah, where the overwhelmed staff rushed around her dealing with influxes of wounded.\nThe Israeli military rarely comments on individual strikes.\nOn the day of the strike that killed Siwar’s family, the military said it hit dozens of targets across the Gaza Strip, including military structures, observation posts and individual militants.", "url": "https://isp.netscape.com/news/world/story/0001/20240726/d1388a6c30f16f3b487ec7cbcf1398d9", "date": "2024-07-26 07:00", "source": "GDELT"}, {"id": "73d943cd-444e-4518-b50d-91ed0cc3a7fa", "message": "Wounded in a strike that killed her family, a 2-year-old joins Gaza's ranks of thousands of orphansTwo-year-old Siwar Abdel-Hadi is the lone survivor in her family after an Israeli airstrike on her home in central Gaza killed her parents and three siblings", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/wounded-in-a-strike-that-killed-her-family-a-2-year-old-joins-gazas-ranks/article_381cbc6b-21f5-51b6-b08e-1224b6071f86.html", "date": "2024-07-26 08:00", "source": "GDELT"}], "location": "Gaza", "total_score": 1.616502466763388, "count": 3, "average_score": 0.538834155587796, "final_score": 0.6171839089114572}, "a9e4c96f-635d-4311-ae5d-da36a94669b8": {"messages": [{"id": "a9e4c96f-635d-4311-ae5d-da36a94669b8", "message": "Amal Abdel-Hadi, left, and Nour Abdel-Hadi, right, react over their 2-year-old wounded niece, Siwar, as she receives treatment at a hospital in Deir al-Balah, Wednesday, July 24, 2024.\nSiwar Abdel-Hadi is the sole survivor in her family after an Israeli airstrike on her home in central Gaza killed her parents and three siblings.\nSiwar Abdel-Hadi is now an orphan.\nOn the day of the strike that killed Siwar’s family, the military said it hit dozens of targets across the Gaza Strip, including military structures, observation posts and individual militants.\nHer grandparents are still alive, but are sick and may not be able to raise her, Nour Abdel-Hadi said.", "url": "https://www.news4jax.com/news/world/2024/07/26/wounded-in-a-strike-that-killed-her-family-a-2-year-old-joins-gazas-ranks-of-thousands-of-orphans/", "date": "2024-07-26 08:15", "source": "GDELT"}, {"id": "42fa680d-1d28-4162-8f03-13ad4dcae97c", "message": "Siwar Abdel-Hadi is now an orphan.\nThe Israeli military rarely comments on individual strikes.\nOn the day of the strike that killed Siwar’s family, the military said it hit dozens of targets across the Gaza Strip, including military structures, observation posts and individual militants.\nHer grandparents are still alive, but are sick and may not be able to raise her, Nour Abdel-Hadi said.\nEven her toys and bed are gone,” Nour Abdel-Hadi said, sobbing.", "url": "https://www.kurv.com/wounded-in-a-strike-that-killed-her-family-a-2-year-old-joins-gazas-ranks-of-thousands-of-orphans/", "date": "2024-07-26 15:30", "source": "GDELT"}], "location": "Gaza", "total_score": 0.5228583555966143, "count": 1, "average_score": 0.5228583555966143, "final_score": 0.54600084891763}, "4eaf4412-cded-4a43-a8d4-0c99dcea4943": {"messages": [{"id": "4eaf4412-cded-4a43-a8d4-0c99dcea4943", "message": "Among the terrorists eliminated were seven terror cells whose members fired mortars toward IDF troops during combat in the area.\nThe terror cells were subsequently struck and eliminated by an IDF aircraft.\nShortly afterward, another terrorist was identified taking the weapon of one of the eliminated terrorists.\nIn addition, IDF troops located tunnel shafts and weapons, including long-range rocket launchers and explosives, in the area of Tel as Sultan.\nThe IAF struck approximately 45 terror targets, including terrorist cells, tunnel shafts, military structures, and two launch pits used to fire toward Beer Sheva during the war.", "url": "https://www.israelnationalnews.com/news/393661", "date": "2024-07-26 08:15", "source": "GDELT"}, {"id": "76b6c282-2fa3-4ac8-bf5c-34fdafedd188", "message": "IDF Spokesperson:\n\nThus far, IDF troops operating against terrorist infrastructure and operatives in the area of Khan Yunis have eliminated approximately 100 terrorists, including seven terrorist cells who fired mortars toward IDF troops during combat in the area. The terror cells were subsequently struck and eliminated by an IDF aircraft. No IDF injuries were reported during the encounters.\n\nIn the area of Rafah, the IAF struck and eliminated two armed terrorists who were identified operating in the area. Shortly afterward, another terrorist was identified taking the weapon of one of the eliminated terrorists. He was then eliminated in an aerial strike, alongside an additional terrorist. In addition, IDF troops located tunnel shafts and weapons, including long-range rocket launchers and explosives, in the area of Tel as Sultan.\n\nThe IAF struck approximately 45 terror targets, including terrorist cells, tunnel shafts, military structures, and two launch pits used to fire toward Beer Sheva during the war.", "url": "", "date": "2024-07-26 06:47", "source": "Telegram"}], "location": "GAZA", "total_score": 0.41101973888523125, "count": 1, "average_score": 0.41101973888523125, "final_score": 0.4677138172196619}, "33b90d84-6063-4fc2-925a-b516ae2cbb23": {"messages": [{"id": "33b90d84-6063-4fc2-925a-b516ae2cbb23", "message": "Israel is spying on Hezbollah commanders — and killing them one by oneA man holds his child as he looks at the damage that was caused by an Israeli airstrike this month in the southern village of Jmaijmeh, Lebanon.\nThe three hits last week were part of a particularly violent day across southern Lebanon, where Hezbollah, the Shiite paramilitary faction and political party, has tussled with Israel for more than nine months.\nRead more: With temperatures and tensions soaring, forests are burning in Israel and LebanonSince Oct. 7 — when Hamas made its brutal attack on southern Israel and Hezbollah launched what it calls a \"solidarity campaign\" — Israel has picked off some two dozen Hezbollah commanders.\nThe term \"Resistance\" refers to a pro-Iranian network of governments and various factions — including Hezbollah — that are arrayed against Israel and the U.S.\nSince early October, when Hezbollah began launching attacks into northern Israel and Israel retaliated, nearly 400 Hezbollah members and more than 100 Lebanese civilians have died in the fighting.", "url": "https://www.yahoo.com/news/israel-spying-hezbollah-commanders-killing-090016847.html", "date": "2024-07-26 10:15", "source": "GDELT"}, {"id": "936dec21-2e59-4505-8930-55c8b298c803", "message": "An Israeli drone fired a missile that hit a Renault van in southern Lebanon.\nThe three hits last week were part of a particularly violent day across southern Lebanon, where Hezbollah, the Shiite paramilitary faction and political party, has tussled with Israel for more than nine months.\nSince Oct. 7 — when Hamas made its brutal attack on southern Israel and Hezbollah launched what it calls a “solidarity campaign “ — Israel has picked off some two dozen Hezbollah commanders.\nHe added that Hezbollah’s security is so tight that Israel would almost have to be getting its information from insiders.\nSince early October, when Hezbollah began launching attacks into northern Israel and Israel retaliated, nearly 400 Hezbollah members and more than 100 Lebanese civilians have died in the fighting.", "url": "https://www.stripes.com/theaters/middle_east/2024-07-26/israel-spying-killing-hezbollah-commanders-14604688.html", "date": "2024-07-26 18:15", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.4221483712069283, "count": 1, "average_score": 0.4221483712069283, "final_score": 0.4755038598448498}, "72a6b1ac-dca8-42c3-815a-d0f8f6409208": {"messages": [{"id": "72a6b1ac-dca8-42c3-815a-d0f8f6409208", "message": "Law enforcement officers are checking the involvement of the suspect in the murder of former MP and linguist Iryna Farion in the neo-Nazi movement, and the investigation does not rule out personal grudge.\nSource: joint briefing of law enforcement officers in LvivDetails: Law enforcement officers are checking the suspect's involvement in the Russian neo-Nazi movement and establishing his ties to Ukraine and the motives for the crime.\nRead more on the topic: Iryna Farion murder: details of the assassination, lines of enquiry, and why the Lviv professor was so controversialBackground:On the evening of 19 July, an attempt was made to murder former MP Iryna Farion in Lviv, on Masaryka Street.\nUkrainska Pravda obtained a photo of the 18-year-old detainee suspected of murdering Iryna Farion.\nSlidstvo.Info journalists identified the man suspected of shooting Iryna Farion in Lviv on 19 July as Viacheslav Zinchenko.", "url": "https://www.yahoo.com/news/murder-former-ukrainian-mp-farion-085406406.html", "date": "2024-07-26 13:15", "source": "GDELT"}, {"id": "158bbbaa-5189-4491-8373-469d98b4c9bb", "message": "She was most vulnerable: Interior Minister explains why former MP Farion was targetedThe list of potential victims of the suspect in the murder of former MP Iryna Farion also included Maksym Buzhanskyi, MP from the Servant of the People party.\nSource: Ihor Klymenko, Minister of Internal Affairs, at a joint law enforcement briefing in LvivDetails: A journalist asked why Iryna Farion was targeted.\nAccording to Ihor Klymenko, Minister of Internal Affairs of Ukraine, the 18-year-old suspect is a resident of Dnipro.\nUkrainska Pravda obtained a photo of the 18-year-old detainee suspected of murdering Iryna Farion.\nSlidstvo.Info journalists identified the man suspected of shooting Iryna Farion in Lviv on 19 July as Viacheslav Zinchenko.", "url": "https://www.yahoo.com/news/she-most-vulnerable-interior-minister-090940739.html", "date": "2024-07-26 13:15", "source": "GDELT"}], "location": ")\nLEVEV, UKRAIN", "total_score": 0.6061367601084685, "count": 1, "average_score": 0.6061367601084685, "final_score": 0.6042957320759279}, "7b504215-9288-43d7-b8f4-4d374489bd82": {"messages": [{"id": "7b504215-9288-43d7-b8f4-4d374489bd82", "message": "Read previewIn a snowy landscape near Stepove in eastern Ukraine, Russian and Ukrainian armored vehicles went head-to-head in what appeared to be a mismatched fight.\nAdvertisement\"So armored vehicles dash in, fulfill their combat mission, and then withdraw as fast as they can,\" Gressel said.\nOnly weeks later, a Bradley took out two BTR-82 Russian armored troop carriers in the same region.\nIn head-to-head battles with Russian tanks, the Bradley lacks the combat power of the heavily armed, heavily armored tanks, but its chain gun has a rapid rate of fire that can prove effective.\nAdvertisementParakilas, the RAND analyst, said the Pentagon was modifying the Bradley vehicles to better defend them against the drone and air attacks that proved devastating against the western-supplied armored vehicles in the summer of last year.", "url": "https://www.businessinsider.com/ukraine-bradley-fighting-vehicles-unorthodox-ways-russia-war-putin-2024-6", "date": "2024-07-26 10:15", "source": "GDELT"}, {"id": "52092e57-edb3-4af3-8dd4-130ce984362f", "message": "They're being used for bold attacks, armored combat, and casualty evacuation.\nIn a snowy landscape near Stepove in eastern Ukraine, Russian and Ukrainian armored vehicles went head-to-head in what appeared to be a mismatched fight.\nThe Russian tank's turret starts spinning, and then the tank veers off course and crashes into a tree.\n\"So armored vehicles dash in, fulfill their combat mission, and then withdraw as fast as they can,\" Gressel said.\nParakilas, the RAND analyst, said the Pentagon was modifying the Bradley vehicles to better defend them against the drone and air attacks that proved devastating against the western-supplied armored vehicles in the summer of last year.", "url": "https://www.yahoo.com/news/ukraines-us-provided-bradley-armored-091502622.html", "date": "2024-07-26 10:15", "source": "GDELT"}], "location": "The main event takes place near Stepove in eastern Ukraine.", "total_score": 0.47673209411153006, "count": 1, "average_score": 0.47673209411153006, "final_score": 0.5137124658780711}, "19bc9cdb-5a7c-4bcd-8639-790e9cce62ff": {"messages": [{"id": "19bc9cdb-5a7c-4bcd-8639-790e9cce62ff", "message": "Gilon also accused Hamas of manipulating casualty figures to generate international pressure on Israel.\nHe questioned the death toll announced by Gaza’s Hamas-run Health Ministry, alleging that Hamas “plays” with the numbers to spread misinformation and propaganda.\nAn estimated 38,000 Palestinians have been killed in the Israeli operation, leading to international criticism and calls for a ceasefire.\nGilon also questioned the death toll figures provided by Hamas, claiming that Hamas counts every casualty as a civilian, not differentiating between terrorists and civilians.\nLast month, the Israel Embassy in India hosted a farewell dinner for departing diplomats, including Ambassador Gilon.", "url": "https://www.newsx.com/world/hamas-manipulates-gaza-death-toll-to-spread-misinformation-and-mount-international-pressure-israeli-ambassador-naor-gilon/", "date": "2024-07-26 19:00", "source": "GDELT"}, {"id": "f6e213e5-e684-45d6-bf69-1500e05112d0", "message": "The Israeli envoy has raised questions on the estimated death toll announced by the Hamas run Health ministry in Gaza and alleged that Hamas \"plays\" with the numbers to mount international pressure on Israel.\nThe second is to bring back the hostages,\" Gilon said in the exclusive interview with ANI.\nThat's what they are aiming at doing,\" the Israeli Ambassador said.\nFrom their point of view, everyone dead is a civilian,\" Gilon added.\nLast month, the Israel Embassy in India hosted a farewell dinner to honour the departing diplomats, including Ambassador Gilon.", "url": "https://news.webindia123.com/news/Articles/World/20240726/4218956.html", "date": "2024-07-26 14:30", "source": "GDELT"}], "location": "Israel", "total_score": 0.6217524799244214, "count": 1, "average_score": 0.6217524799244214, "final_score": 0.615226735947095}, "00b8891a-1a4f-4dc1-9b1b-3391dce0fb18": {"messages": [{"id": "00b8891a-1a4f-4dc1-9b1b-3391dce0fb18", "message": "Lebanese sources report casualties in an attack by IDF warplanes a short time ago on a building in the village of Markhaba in southern Lebanon.", "url": "https://abualiexpress.com/en/en31074/", "date": "2024-07-26 09:35", "source": "Telegram"}, {"id": "cc0102b1-1aac-4672-a1aa-033c85b460df", "message": "Hezbollah announces a death in its ranks:\n\nAbbas Hamoud, a resident of the village of Markhaba.\n\nHe was killed in an attack by IDF warplanes on a building in the village of Markhaba earlier today.\n\nNumber 379.", "url": "https://abualiexpress.com/en/en31083/", "date": "2024-07-26 13:42", "source": "Telegram"}], "location": "Lebanon", "total_score": 0.6299147077179114, "count": 1, "average_score": 0.6299147077179114, "final_score": 0.6209402954025379}}