{"f06d433a-145e-4394-badc-f3573943f7ba": {"messages": [{"id": "f06d433a-145e-4394-badc-f3573943f7ba", "message": "The Jules building in the area of ​​the new camp in Nuseirat (the center of the Strip):\nBefore, during the IDF's evacuation call for the attack, and after.\n\n##\nIDF pressure on the camps in the center of the Gaza Strip continues.", "url": "https://abualiexpress.com/en/en30788/", "date": "2024-07-21 08:15", "source": "Telegram"}, {"id": "b94c3397-e653-4e1b-9264-98b39a8bf98e", "message": "Palestinian channels: The IDF's attacks continue since this morning in the Nuseirat area in the center of the Gaza Strip.\n\n##\nThere has been a concentration of offensive effort on the center of the Gaza Strip in recent days.", "url": "https://abualiexpress.com/en/en30801/", "date": "2024-07-21 11:21", "source": "Telegram"}], "location": "Gaza Strip", "total_score": 0.6671052631578948, "count": 1, "average_score": 0.6671052631578948, "final_score": 0.6469736842105264}, "b3e9ddd7-b69e-4795-85c4-2691bf7463e8": {"messages": [{"id": "b3e9ddd7-b69e-4795-85c4-2691bf7463e8", "message": "The Ministry of Health of Yemen updates the numbers of casualties in the Israeli attack in the port of Hodeidah:\n\n3 dead and 87 injured.", "url": "https://abualiexpress.com/en/en30779/", "date": "2024-07-21 05:57", "source": "Telegram"}, {"id": "ab7c5d91-5c53-41a6-a2d2-ab0630a48960", "message": "The Ministry of Health in Yemen:\nThe number of dead in the Israeli attack in Hodeidah has risen to 6. The number of wounded is 83 and there are 3 missing.", "url": "https://abualiexpress.com/en/en30805/", "date": "2024-07-21 12:24", "source": "Telegram"}], "location": "Hodeidah", "total_score": 0.5930735930735931, "count": 1, "average_score": 0.5930735930735931, "final_score": 0.5951515151515152}, "526971ff-d621-4889-a0fb-3eb46792161a": {"messages": [{"id": "526971ff-d621-4889-a0fb-3eb46792161a", "message": "Shortly after six o'clock this morning, a missile launched by the Houthis was intercepted.\n\nIDF Spokesperson: The IDF intercepted a surface-to-surface missile that approached Israel from the Red Sea \n\nA short while ago, the IDF Aerial Defense Array successfully intercepted a surface-to-surface missile that approached Israeli territory from Yemen using the \"Arrow 3\" Aerial Defense System.\n\nThe projectile did not cross into Israeli territory. Rocket and missile sirens were sounded following the possibility of falling shrapnel. The incident has concluded.", "url": "https://abualiexpress.com/en/en30778/", "date": "2024-07-21 05:57", "source": "Telegram"}, {"id": "62c2235a-eaba-4d5c-a8de-4e45d63ee964", "message": "The IDF intercepted a surface-to-surface missile that approached Israel from Yemen on Sunday morning, Israel's military announced shortly afterward.\n\"The IDF Aerial Defense Array successfully intercepted a surface-to-surface missile that approached Israeli territory from Yemen using the 'Arrow 3' Aerial Defense System,\" the IDF said.\nSirens sounded in Eliat and the surrounding area due to the possibility of falling shrapnel.\nLater on Sunday, the Yemen-based Houthi-run Al Masirah outlet took responsibility for the attack, saying it launched multiple missiles at Israel.\nIsrael's strike in YemenThe interception comes amid Israel's airstrikes on Houthi targets in the Hodeidah Port area in Yemen on Saturday.", "url": "https://www.jpost.com/breaking-news/article-811156", "date": "2024-07-21 09:15", "source": "GDELT"}], "location": "Israel", "total_score": 0.6779494382022472, "count": 1, "average_score": 0.6779494382022472, "final_score": 0.654564606741573}, "d77219ce-9002-47eb-b6e5-4bfd23a6e826": {"messages": [{"id": "d77219ce-9002-47eb-b6e5-4bfd23a6e826", "message": "Lebanon’s Hezbollah terrorist group said it fired rockets to northern Israel Saturday, targeting a kibbutz for the first time in nine months in retaliation for an Israeli drone strike.\nLebanon's Hezbollah terrorist group said it fired a volley of rockets on a northern Israeli village Friday morning in retaliation for Israeli airstrikes the night before on south Lebanon that killed several Hezbollah members and wounded civilians.\nAlso Saturday, the Palestinian terrorist group Hamas said it fired rockets from Lebanon toward an Israeli army post in the northern Israeli village of Shomera.\nThe Israeli military said that about 45 projectiles were detected crossing from Lebanon into northern Israel in three separate barrages.\nOn Friday, Hezbollah said that it fired rockets at three villages in northern Israel in retaliation for a strike that killed several people the night before.", "url": "https://www.reviewjournal.com/news/nation-and-world/hezbollah-fires-dozens-of-rockets-at-israeli-kibbutz-3098995/", "date": "2024-07-21 01:30", "source": "GDELT"}, {"id": "d1c7bce6-2690-4d6e-9862-e2efebb1ab9e", "message": "BEIRUT (AP) — Lebanon’s militant Hezbollah group said that its fighters fired dozens of rockets into northern Israel on Saturday, targeting a kibbutz for the first time in nine months in retaliation for an Israeli drone strike earlier in the day that wounded several people including children.\nAlso Saturday, the militant Palestinian group Hamas said it fired rockets from Lebanon toward an Israeli army post in the northern Israeli village of Shomera in retaliation for the “Zionists massacres” in the Gaza Strip.\nThe Israeli military said that about 45 projectiles were detected crossing from Lebanon into northern Israel in three separate barrages.\nOn Friday, Hezbollah said that it fired rockets at three villages in northern Israel for the first time in retaliation for a strike that killed several people the night before.\nHezbollah began firing rockets shortly after Hamas’ Oct. 7 attack on southern Israel, saying it aimed to ease pressure on Gaza.", "url": "https://www.whec.com/national-world/lebanons-hezbollah-fires-dozens-of-rockets-at-israeli-kibbutz-after-drone-strike-wounds-civilians/", "date": "2024-07-21 00:30", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.45748080371511335, "count": 1, "average_score": 0.45748080371511335, "final_score": 0.5002365626005794}, "e3276f94-da28-49c8-a6e8-1febdd61aa0c": {"messages": [{"id": "e3276f94-da28-49c8-a6e8-1febdd61aa0c", "message": "Hezbollah has traded near-daily cross-border fire with Israeli forces - Copyright AFP Nhac NGUYENLebanese official media said an Israeli strike on a town deep in the country’s south Saturday evening targeted an ammunitions depot, lightly injuring three people and causing rockets to explode.\n“The raid on the town of Adloun targeted an ammunition depot,” Lebanon’s National News Agency said, after earlier reporting “the Israeli enemy launched a raid” on the area, with “rocket still exploding” and the blasts “lightly injuring three citizens”.\nHezbollah leader Hassan Nasrallah had warned that his Iran-backed group would hit new targets in Israel if more civilians were killed in Israeli strikes.\nThe violence since October has killed at least 515 people in Lebanon, according to an AFP tally.\nOn the Israeli side, 18 soldiers and 13 civilians have been killed, according to Israeli authorities.", "url": "https://www.digitaljournal.com/world/lebanon-state-media-says-israeli-strike-targeted-ammunition-depot/article", "date": "2024-07-21 01:30", "source": "GDELT"}, {"id": "09687cd5-e799-4640-857e-303bd57a2210", "message": "Lebanese official media said an Israeli strike on a town deep in the country’s south Saturday evening targeted an ammunitions depot, lightly injuring six people and causing rockets to explode.\nThe army said it struck “the launcher in southern Lebanon from which the projectiles were launched toward the Golan Heights”, also targeting “an additional Hezbollah launcher”.\nHezbollah leader Hassan Nasrallah had warned that his Iran-backed group would hit new targets in Israel if more civilians were killed in Israeli strikes.\nThe violence since October has killed at least 515 people in Lebanon, according to an AFP tally.\nOn the Israeli side, 18 soldiers and 13 civilians have been killed, according to Israeli authorities.", "url": "https://yalibnan.com/2024/07/21/6-injured-in-lebanon-in-israeli-strike-of-hezbollah-arms-depot/", "date": "2024-07-21 12:15", "source": "GDELT"}], "location": "Adloun", "total_score": 0.37718320327015975, "count": 1, "average_score": 0.37718320327015975, "final_score": 0.44402824228911186}, "8a8e7ab3-660a-49ff-be4f-9d23db961862": {"messages": [{"id": "8a8e7ab3-660a-49ff-be4f-9d23db961862", "message": "Israel is poised to defend itself by all means and any attacker will pay dearly, Israeli Prime Minister Benjamin Netanyahu said in a statement after the Israel Defense Forces (IDF) carried out an air raid on Houthi targets in Yemen.\nIn his words, the Houthis \"have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA while ago, planes of the Israeli Air Force attack the Yemen’s port city of Hudaydah, located on the Red Sea coast.\nThe air raid left at least three people dead and around 80 wounded.\nAccording to Al Masirah, the Israeli Air Force targeted oil tanks in the port, as well as the city power plant.", "url": "https://tass.com/world/1819333", "date": "2024-07-21 02:00", "source": "GDELT"}, {"id": "83552be9-9b80-4f0f-9689-aaf3cc38f731", "message": "The Egyptian government believes that Israel’s recent attack on the Yemeni port of Hudaydah has seriously exacerbated tensions in the region, so stakeholders should try to prevent the Middle East from plunging into chaos, the Egyptian foreign ministry said in a statement.\nAccording to the document, the Egyptian Ministry of Foreign Affairs \"is following the situation with great concern.\"\nIt is \"convinced that all parties need to show restraint\" and urges \"to prevent the region from plunging into chaos.\"\nA while ago, planes of the Israeli Air Force attack the Yemen’s port city of Hudaydah, located on the Red Sea coast.\nAccording to Al Masirah, the Israeli Air Force targeted oil tanks in the port, as well as the city power plant.", "url": "https://tass.com/world/1819339", "date": "2024-07-21 03:15", "source": "GDELT"}, {"id": "915e1296-b129-422e-9b7c-ab9bd3b19590", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "url": "https://www.kalw.org/npr-news/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "date": "2024-07-21 13:00", "source": "GDELT"}], "location": "NULL", "total_score": 1.2894907344967206, "count": 2, "average_score": 0.6447453672483603, "final_score": 0.6613217570738522}, "986e4893-5530-4014-be98-dec0d63bc5d5": {"messages": [{"id": "986e4893-5530-4014-be98-dec0d63bc5d5", "message": "(MENAFN- IANS) Beirut, July 21 (IANS) Israeli warplanes have targeted an ammunition warehouse belonging to Hezbollah in Lebanon's southwest town of Adloun, Lebanese military sources told the media.\nThey said that Lebanese military forces worked to cut off the main coastal road linking the cities of Sidon and Tyre and diverted traffic to side roads.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel on October 7.\nThe level of tension between Hezbollah and the Israeli army has escalated recently, as the Israeli military announced \"its approval of operational plans for an attack on Lebanon\".\nMeanwhile, Hezbollah Secretary-General Hassan Nasrallah warned that no place in Israel \"will be safe\" from his party's missiles in the event of an outbreak of war.", "url": "https://menafn.com/1108462937/Israel-Attacks-Hezbollah-Ammunition-Warehouse-In-Lebanon", "date": "2024-07-21 02:30", "source": "GDELT"}, {"id": "3ecfce8e-18aa-4b61-bc33-7b75bfe067cc", "message": "(MENAFN- IANS) Beirut, July 21 (IANS) Seven people, including four displaced Syrian children, were in Israeli on different areas in southern Lebanon, Lebanese military sources told the media.\nMeanwhile, Hezbollah said its fighters targeted a gathering of Israeli soldiers in the vicinity of the Al-Manara site with artillery shells.\nAndrea Tenenti, spokesperson for the United Nations Interim Forces in Lebanon, said on Saturday that a diplomatic solution between Lebanon and Israel is possible, calling for a ceasefire from both sides.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon.\nThe level of tension between Hezbollah and the Israeli army has escalated recently, as the Israeli military announced \"its approval of operational plans for an attack on Lebanon\".", "url": "https://menafn.com/1108462958/7-Injured-In-Israeli-Airstrikes-In-Lebanon", "date": "2024-07-21 03:30", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.6421705443665431, "count": 1, "average_score": 0.6421705443665431, "final_score": 0.6295193810565801}, "019ed7c5-226e-4f27-a2fb-fb099fa7db0d": {"messages": [{"id": "019ed7c5-226e-4f27-a2fb-fb099fa7db0d", "message": "A number of “military targets” were hit in the western port city of Hodeidah, a Houthi stronghold, the Israeli army said, adding that its attack was in response to “hundreds of attacks” against Israel in recent months.\nSANAA, Yemen — The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nHouthi spokesman Mohammed Abdulsalam posted on X that the “blatant Israeli aggression” targeted fuel storage facilities and the province’s power station.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn't elaborate.\nIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late Friday.", "url": "https://www.bostonglobe.com/2024/07/20/world/israeli-military-says-it-has-struck-houthi-targets-yemen-response-attacks/", "date": "2024-07-21 02:00", "source": "GDELT"}, {"id": "efb80f95-4c2d-47e3-9019-fb6286bd48a8", "message": "SANAA, Yemen (AP) — The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nAnd we will do this in any place where it may be required,” Israeli Defense Minister Yoav Gallant said in a statement.\nHouthi spokesman Mohammed Abdulsalam posted on X that the “blatant Israeli aggression” targeted fuel storage facilities and the province’s power station.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn’t elaborate.\nUnrest in the West BankIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late Friday.", "url": "https://wsvn.com/news/us-world/israeli-military-says-it-has-struck-houthi-targets-in-yemen-in-response-to-attacks/", "date": "2024-07-21 04:00", "source": "GDELT"}, {"id": "009b7b83-7f24-4253-bbaf-cc98110e599e", "message": "The Israeli army says it struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\n(AP Photo)Sanaa, Yemen — The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nA number of “military targets” were hit in the western port city of Hodeidah, a Houthi stronghold, the Israeli army said, adding that its attack was in response to “hundreds of attacks” against Israel in recent months.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn't elaborate.\nThe Israeli army says it struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.", "url": "https://www.theday.com/nation/20240720/israeli-military-says-it-has-struck-houthi-targets-in-yemen-in-response-to-attacks/", "date": "2024-07-21 00:30", "source": "GDELT"}, {"id": "ceaa0e36-ba1c-4fd2-8f7c-f512bf54303c", "message": "The Israeli army said it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\n(AP Photo)SANAA, Yemen — The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nA number of “military targets” were hit in the western port city of Hodeidah, a Houthi stronghold, the Israeli army said, adding that its attack was in response to “hundreds of attacks” against Israel in recent months.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn’t elaborate.\nADVERTISEMENTUnrest in the West BankIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late Friday.", "url": "https://www.adn.com/nation-world/2024/07/20/israeli-military-says-it-has-struck-houthi-targets-in-yemen-in-response-to-attacks/", "date": "2024-07-21 08:00", "source": "GDELT"}, {"id": "6627004a-e339-4efb-9947-b76e28b4e45d", "message": "SANAA, Yemen, July 21: The Israeli Army said it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nHealth officials in Yemen said the strikes killed a number of people and injured others, but did not elaborate.\nAbout 120 remain in captivity, with about a third of them believed to be dead, according to Israeli authorities.\nIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late on July 19.\nViolence has surged in the territory since the Gaza war began.", "url": "https://www.dailyexcelsior.com/israeli-military-says-it-has-struck-several-houthi-targets-in-yemen-in-response-to-attacks/", "date": "2024-07-21 06:00", "source": "GDELT"}], "location": "Hodeideh", "total_score": 1.8501056047691493, "count": 4, "average_score": 0.46252640119228733, "final_score": 0.5937684808346011}, "49dc0b10-4f80-433d-a251-70a3e2b5abdc": {"messages": [{"id": "49dc0b10-4f80-433d-a251-70a3e2b5abdc", "message": "The Israeli army said on Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nAn injured Yemeni worker receives medical treatment at Al Thawrah hospital in Hodeidah, in western Yemen, following attacks, Saturday, July 20, 2024.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn't elaborate.\nThe Israeli army said it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nAn injured Yemeni worker receives medical treatment at Al Thawrah hospital in Hodeidah, in western Yemen, following attacks, Saturday, July 20, 2024.", "url": "https://www.9news.com.au/national/israeli-military-says-it-has-struck-houthi-targets-in-yemen-in-response-to-attacks/75592fee-d465-4a46-8a5d-383101749fcb", "date": "2024-07-21 04:15", "source": "GDELT"}, {"id": "54609e4d-eea2-498a-9a91-3da18021152d", "message": "The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nA number of “military targets” were hit in the western port city of Hodeidah, a Houthi stronghold, the Israeli army said, adding that its attack was in response to “hundreds of attacks” against Israel in recent months.\nHouthi spokesman Mohammed Abdulsalam posted on X that the “blatant Israeli aggression” targeted fuel storage facilities and the province’s power station.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn't elaborate.\nIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late Friday.", "url": "https://www.nbcdfw.com/news/national-international/israeli-military-strikes-houthi-targets-in-yemen/3597508/", "date": "2024-07-21 00:30", "source": "GDELT"}, {"id": "3a7f8580-482d-474a-acbb-45bd1c34e9f8", "message": "The Israeli army says it struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\n(AP Photo)SANAA, Yemen--The Israeli army said Saturday it has struck several Houthi targets in western Yemen following a fatal drone attack by the rebel group in Tel Aviv the previous day.\nA number of “military targets” were hit in the western port city of Hodeidah, a Houthi stronghold, the Israeli army said, adding that its attack was in response to “hundreds of attacks” against Israel in recent months.\nHealth officials in Yemen said the strikes killed a number of people and wounded others, but didn't elaborate.\nIn the occupied West Bank, the Palestinian Health Ministry said a 20-year-old man was shot dead by Israeli forces late Friday.", "url": "https://www.asahi.com/ajw/articles/15355563", "date": "2024-07-21 07:30", "source": "GDELT"}], "location": "Yemen", "total_score": 1.213640709830678, "count": 2, "average_score": 0.606820354915339, "final_score": 0.6347742484407373}, "3a633c20-0976-4319-bbd9-a724630ae78d": {"messages": [{"id": "3a633c20-0976-4319-bbd9-a724630ae78d", "message": "You are here:视频播放位置 下载安装Flash播放器SANAA/JERUSALEM/BEIRUT, July 21 (Xinhua) -- Yemen's Houthi group vowed to \"hit vital targets in Israel\" while Lebanon's Hezbollah retaliated with rockets after Israel had launched airstrikes on different areas in Yemen and Lebanon on Saturday.\nHOUTHI VOWS RETALIATIONThe Houthi group on Saturday vowed to retaliate against Israeli air strikes that destroyed oil storage and electric facilities, wounding nearly 80 people, in the Houthi-held Red Sea port city of Hodeidah.\n\"We will not hesitate to hit vital targets in Israel,\" Houthi military spokesman Yahya Sarea said, reiterating that Tel Aviv will not remain a safe area.\nThe statement came after Houthi top negotiator Mohammed Abdulsalam said the Israeli strikes would not stop the military group from targeting \"Israeli cities and ships.\"\nSince March 2015, Saudi Arabia has been leading an Arab military coalition to support the Yemeni government forces in confronting the Houthi group.", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-07/21/content_117322016.htm", "date": "2024-07-21 09:15", "source": "GDELT"}, {"id": "a11de7bc-f476-4140-9a42-4f51db59313e", "message": "(MENAFN- IANS) Beirut, July 21 (IANS) Yemen's Houthi group vowed to \"hit vital targets in Israel\" while Lebanon's Hezbollah retaliated with rockets after Israel had launched on different areas in Yemen and Lebanon.\n\"We will not hesitate to hit vital targets in Israel,\" Houthi military spokesman Yahya Sarea said, reiterating that Tel Aviv will not remain a safe area.\nEarlier in the day, the Israeli military said in a statement that its fighter jets targeted \"military targets\" of the Houthi militia, as a response to \"the hundreds of attacks carried out against the State of Israel in recent months.\"\nThe statement came after Houthi top negotiator Mohammed Abdulsalam said the Israeli strikes would not stop the military group from targeting \"Israeli cities and ships.\"\nSince March 2015, Saudi Arabia has been leading an Arab military coalition to support the Yemeni government forces in confronting the Houthi group.", "url": "https://menafn.com/1108464025/Israel-Faces-Retaliations-After-Strikes-On-Houthi-Hezbollah-Targets", "date": "2024-07-21 12:30", "source": "GDELT"}], "location": "Based on the text, it appears that the main event takes place in Yemen, particularly in the city of Hodeidah.", "total_score": 0.3919586853827942, "count": 1, "average_score": 0.3919586853827942, "final_score": 0.454371079767956}, "e1a39aa5-c4d0-432f-9894-4b743f5bdf2e": {"messages": [{"id": "e1a39aa5-c4d0-432f-9894-4b743f5bdf2e", "message": "Detailing the first strikes claimed by Israel in Yemen, Gallant warned of further operations if the Huthis \"dare to attack us\" after a rebel drone strike killed one in Tel Aviv on Friday.\nThe Gaza war was triggered by Hamas's October 7 attack on southern Israel, which resulted in the deaths of 1,195 people, mostly civilians, according to an AFP tally based on Israeli figures.\nThe militants also seized 251 hostages, 116 of whom are still in Gaza, including 42 the Israeli military says are dead.\nThe war has also unleashed hunger and health crises in Gaza, with Israel and the United Nations trading blame for vital aid supplies failing to reach those in need.\nWHO spokesman Christian Lindmeier said Friday the agency believes many more diseases are \"spreading out of control\" inside Gaza.", "url": "https://www.yahoo.com/news/israel-strikes-gaza-yemen-lebanon-063340753.html", "date": "2024-07-21 07:15", "source": "GDELT"}, {"id": "7695c9c1-57e1-4f6e-ac8f-8d6ed4f7d04c", "message": "GAZA STRIP: The Middle East was reeling Sunday from deadly violence with Israel bombing Gaza, Lebanon and Yemen in quick succession in response to attacks from Iran-backed groups.\nDetailing the first strikes claimed by Israel in Yemen, Gallant warned of further operations if the Huthis “dare to attack us” after a rebel drone strike killed one in Tel Aviv on Friday.\nThe Hamas also seized 251 hostages, 116 of whom are still in Gaza, including 42 the Israeli military says are dead.\nThe war has also unleashed hunger and health crises in Gaza, with Israel and the United Nations trading blame for vital aid supplies failing to reach those in need.\nWHO spokesman Christian Lindmeier said Friday the agency believes many more diseases are “spreading out of control” inside Gaza.", "url": "https://www.brecorder.com/news/40313663/israel-strikes-gaza-yemen-lebanon-foes-after-attacks", "date": "2024-07-21 07:45", "source": "GDELT"}], "location": "Tel Aviv", "total_score": 0.38462849352419903, "count": 1, "average_score": 0.38462849352419903, "final_score": 0.44923994546693935}, "7b21a59d-658e-4650-b82f-d572a3053bf0": {"messages": [{"id": "7b21a59d-658e-4650-b82f-d572a3053bf0", "message": "SEOUL, South Korea — South Korea said Sunday it was bolstering its anti-Pyongyang propaganda broadcasts across the tense border with rival North Korea, after the North launched more balloons likely carrying trash toward South Korea.\nSouth Korea’s Joint Chiefs of Staff said the North Korean balloons were flying Sunday morning north of Seoul, the South Korean capital, after crossing the border.\n5 South Korea bolstered its anti-Pyongyang propaganda broadcasts across the tense border with rival North Korea in the latest psychological battle between the two countries.\n5 This photo provided by the South Korea Defense Ministry shows trash from a balloon in Paju, South Korea, near the border with North Korea, on July 21, 2024.\n5 Visitors watch the North Korea side from the Unification Observation Post in Paju, South Korea, near the border with North Korea on July 21, 2024.", "url": "https://nypost.com/2024/07/21/world-news/south-korea-boosts-propaganda-loudspeaker-broadcasts-at-border-after-north-korea-flies-more-balloons/", "date": "2024-07-21 08:45", "source": "GDELT"}, {"id": "7cde8651-a4db-40f3-b721-141618eb00b4", "message": "South Korea boosts propaganda broadcasts at borderCONSEQUENCES: Seoul said Pyongyang was entirely to blame for the situation after North Korea launched more balloons toward the South, likely carrying trashAP, SEOULSouth Korea yesterday said that it was bolstering its anti-Pyongyang propaganda broadcasts across the tense border with rival North Korea, after the North launched more balloons likely carrying trash toward South Korea.\nA balloon presumably sent by North Korea lies in a paddy field in Incheon, South Korea, on June 10.\nThe broadcasts also referred to the “hellish, slave-like lives” of North Korean soldiers responsible for mine-planting work at the border, South Korean media reported.\nNorth Korea has not made an official response to the South Korean broadcasts.\nNorth Korea has floated more than 2,000 balloons to drop waste paper, scraps of cloth, cigarette butts, waste batteries and even manure on South Korea, although they have so far caused no major damage in South Korea.", "url": "https://www.taipeitimes.com/News/world/archives/2024/07/22/2003821165", "date": "2024-07-21 16:45", "source": "GDELT"}], "location": ".\nBased on the context provided, I was unable to identify a specific location for the main focus of the event.", "total_score": 0.6846945303337243, "count": 1, "average_score": 0.6846945303337243, "final_score": 0.659286171233607}, "41092127-9c0a-4ac4-9968-0e93561dec4a": {"messages": [{"id": "41092127-9c0a-4ac4-9968-0e93561dec4a", "message": "Israel said Sunday it carried out a retaliatory airstrike on a key port in Yemen in an attempt to prevent the ongoing delivery of weapons to the Houthi militia by Iran.\nIsrael's Prime Minister Benjamin Netanyahu said the Hodeidah port was the \"entry point for weapons that are supplied by Iran to its Houthi terrorist proxies.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "url": "https://www.capeandislands.org/2024-07-21/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia", "date": "2024-07-21 14:00", "source": "GDELT"}, {"id": "fa9b3709-e9d0-4830-8fb0-09a422e701bd", "message": "An Israeli airstrike ignited a huge fire at an oil storage facility at Yemen's Red Sea port of Hodeidah on Saturday.\n‏The Houthis have used those weapons to attack Israel, to attack Arab states in the region, to attack many others.\"\nA long-distance operationTo reach the Hodeidah port, Israeli planes traveled more than 1,000 miles.\nIsraeli military spokesman Daniel Hagari called it \"one of the longest ever conducted by the Israeli air force.\"\nIsraeli air defenses and U.S. naval forces in the Red Sea have shot them down, in almost all cases before they reached Israeli air space.", "url": "https://www.houstonpublicmedia.org/npr/2024/07/21/g-s1-12500/israel-says-airstrike-in-yemen-will-block-weapons-to-houthi-militia/", "date": "2024-07-21 15:30", "source": "GDELT"}], "location": ")\nRED SEA", "total_score": 0.5214212258329906, "count": 1, "average_score": 0.5214212258329906, "final_score": 0.5449948580830933}, "a78c0c82-42b0-464a-a73c-f652d50ae0bc": {"messages": [{"id": "a78c0c82-42b0-464a-a73c-f652d50ae0bc", "message": "The Israeli military on Sunday said it struck Hezbollah weapons storage facilities overnight, after Lebanese state media reported an Israeli strike on an ammunition depot deep in the south.\nThe Israeli air force \"struck two Hezbollah weapons storage facilities in southern Lebanon, containing rockets and additional weaponry,\" the military said in a statement.\nEarlier on Saturday, Hezbollah and its Palestinian ally Hamas had fired rocket salvos and explosive-laden drones at Israeli positions.\nHezbollah said it had launched \"dozens of Katyusha rockets\" on northern Israel \"in response\" to a strike blamed on Israel that injured civilians.\nHamas's armed wing, the Ezzedine al-Qassam Brigades, said they also fired a rocket salvo from south Lebanon towards an Israeli military position in the Upper Galilee.", "url": "https://www.voanews.com/a/israel-confirms-striking-hezbollah-weapons-depots-in-south-lebanon-/7706656.html", "date": "2024-07-21 12:30", "source": "GDELT"}, {"id": "e113b0df-e6b5-4b02-9322-517d1e3a1250", "message": "The Israeli military reported that it struck Hezbollah weapons storage facilities overnight, following Lebanese state media’s report of an Israeli attack on an ammunition depot in southern Lebanon.\nEarlier on Saturday, Hezbollah and its Palestinian ally Hamas fired rockets and explosive-laden drones at Israeli positions.\nHezbollah stated it launched “dozens of Katyusha rockets” at northern Israel “in response” to an Israeli strike that injured civilians.\nHamas’ armed wing, the Ezzedine al-Qassam Brigades, also claimed to have fired a rocket salvo from southern Lebanon towards an Israeli military position in the Upper Galilee.\nOn the Israeli side, 18 soldiers and 13 civilians have been killed, according to Israeli authorities.", "url": "https://dailystar.com.lb/israel-confirms-striking-hezbollah-depots-lebanon/", "date": "2024-07-21 17:30", "source": "GDELT"}], "location": "Lebanon", "total_score": 0.48235984312716984, "count": 1, "average_score": 0.48235984312716984, "final_score": 0.5176518901890189}, "800b60c7-537c-43e9-a121-19bb1f2fbe18": {"messages": [{"id": "800b60c7-537c-43e9-a121-19bb1f2fbe18", "message": "BEIRUT: Lebanon’s Hezbollah on Sunday said it fired Katyusha rockets at northern Israel in response to an overnight Israeli strike that, according to state media, hit a weapons depot and wounded six people.\nHezbollah has traded near-daily cross-border fire with Israeli forces in support of Hamas since the Palestinian group’s October 7 attack on southern Israel triggered war in the Gaza Strip.\nThe Iran-backed Hezbollah said it targeted northern Israel’s Dafna area with Katyusha rockets “in response to the Israeli enemy’s attacks that targeted civilians in the town of Adloun, injuring several of them”.\nIsrael strikes Gaza, Yemen, Lebanon foes after attacksThis comes after the Israeli military said its air force “struck two Hezbollah weapons storage facilities in southern Lebanon, containing rockets and additional weaponry”.\nHezbollah said it had launched “dozens of Katyusha rockets” towards northern Israel “in response” to a strike blamed on Israel that injured civilians.", "url": "https://www.brecorder.com/news/40313676/hezbollah-fires-rockets-after-israel-strike-on-lebanon", "date": "2024-07-21 15:15", "source": "GDELT"}, {"id": "4aa523da-a82b-4d7f-93b3-31e8eb17538b", "message": "Lebanon's Hezbollah said it fired Katyusha rockets and drones at Israel on Sunday after strikes which the Israeli army said targeted Hezbollah weapons storage facilities.\nHezbollah has traded near-daily cross-border fire with Israeli forces in support of Hamas since the Palestinian militant group's October 7 attack on southern Israel triggered war in the Gaza Strip.\nIn retaliation, Iran-backed Hezbollah, an ally of Hamas, said in separate statements that on Sunday it targeted two Israeli military positions in northern Israel with Katyusha rockets and drones.\nIsrael's military had said its air force \"struck two Hezbollah weapons storage facilities in southern Lebanon, containing rockets and additional weaponry\" overnight Saturday to Sunday.\nOn the Israeli side, 18 soldiers and 13 civilians have been killed, according to Israeli authorities.", "url": "https://www.enca.com/news/hezbollah-says-fires-rockets-drones-israel", "date": "2024-07-21 19:15", "source": "GDELT"}], "location": "Northern Israel", "total_score": 0.4918369589101297, "count": 1, "average_score": 0.4918369589101297, "final_score": 0.5242858712370908}, "81095f0f-69dc-45b9-aa07-23a158972d13": {"messages": [{"id": "81095f0f-69dc-45b9-aa07-23a158972d13", "message": "CNN —For the first time, Israel has struck inside Yemen, following a deadly drone attack launched by Houthi rebels on Tel Aviv.\nHouthi military academy cadets demonstrate in solidarity with the Palestinian people on June 14 in Sana'a, Yemen.\nThe US and UK have responded to those attacks by carrying out strikes on Houthi targets in Yemen.\nOded Balilty/APThe attack marked the first time Tel Aviv, Israel’s commercial center, has been struck by a drone in an attack claimed by the Houthis.\nHouthi military spokesman Yehya Saree speaks at a rally against Israel and the US on Friday.", "url": "https://edition.cnn.com/2024/07/21/middleeast/israel-strikes-houthi-rebels-explainer-intl/", "date": "2024-07-21 18:00", "source": "GDELT"}, {"id": "7f372d22-64b1-4ce6-9bbe-936125e38e5a", "message": "Israel strikes Yemen for the first time following deadly Houthi drone attack.\nHere’s what we knowFor the first time, Israel has struck inside Yemen, following a deadly drone attack launched by Houthi rebels on Tel Aviv.\nHouthi military academy cadets demonstrate in solidarity with the Palestinian people on June 14 in Sana'a, Yemen.\nThe US and UK have responded to those attacks by carrying out strikes on Houthi targets in Yemen.\nHouthi military spokesman Yehya Saree speaks at a rally against Israel and the US on Friday.", "url": "https://www.yahoo.com/news/israel-strikes-yemen-first-time-140526096.html", "date": "2024-07-21 15:15", "source": "GDELT"}, {"id": "1ad3198b-6d20-4e76-8656-bfde6c3d601d", "message": "By Sophie Tanno, CNN(CNN) — For the first time, Israel has struck inside Yemen, following a deadly drone attack launched by Houthi rebels on Tel Aviv.\nThe US and UK have responded to those attacks by carrying out strikes on Houthi targets in Yemen.\nA tipping point for Israel appears to have come on Friday, when a drone attack was launched on Tel Aviv, killing one Israeli citizen and injuring several others.\nIsrael authorities are investigating the circumstances and potential security failures around the deadly drone blast.\nThe attack, which marked the first time Israel has struck Yemen, killed at least six people and injured scores more, Yemeni officials said.", "url": "https://kesq.com/news/national-world/cnn-world/2024/07/21/israel-strikes-yemen-for-the-first-time-following-deadly-houthi-drone-attack-heres-what-we-know/", "date": "2024-07-21 18:15", "source": "GDELT"}, {"id": "e11c2c92-bdaf-4c48-9a75-00f089b05cf5", "message": "(CNN) — For the first time, Israel has struck inside Yemen, following a deadly drone attack launched by Houthi rebels on Tel Aviv.\nThe US and UK have responded to those attacks by carrying out strikes on Houthi targets in Yemen.\nA tipping point for Israel appears to have come on Friday, when a drone attack was launched on Tel Aviv, killing one Israeli citizen and injuring several others.\nIsrael authorities are investigating the circumstances and potential security failures around the deadly drone blast.\nThe attack, which marked the first time Israel has struck Yemen, killed at least six people and injured scores more, Yemeni officials said.", "url": "https://ktvz.com/news/national-world/cnn-world/2024/07/21/israel-strikes-yemen-for-the-first-time-following-deadly-houthi-drone-attack-heres-what-we-know/", "date": "2024-07-21 16:00", "source": "GDELT"}], "location": "Yemen", "total_score": 1.5817329000026041, "count": 3, "average_score": 0.5272443000008681, "final_score": 0.6090710100006077}}