[{"id": "98a42900-9878-4603-a1ac-ff348812fa73", "title": "Three killed , six injured in Israeli airstrikes on Lebanon", "date": "2024-08-21 06:00", "url": "https://www.prokerala.com/news/articles/a1557639.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Beirut, Aug 21 : Three Hezbollah members were killed and six people, including three paramedics, wounded in Israeli airstrikes on southern Lebanon, military sources said.\nIn addition, two people were injured when a motorcycle was hit by two rockets fired by an Israeli drone in Wadi Hamoul in southwestern Lebanon, and a Syrian was injured as a result of Israeli artillery shelling that targeted the southeastern Lebanese village of Khiam.\nThe Lebanese army monitored the launch of several drones and about 40 surface-to-surface missiles from southern Lebanon into northern Israel, according to the sources.\nMeanwhile, Hezbollah said in a statement that its fighters bombed the Al-Shomira barracks and nearby Israeli troop deployments with volleys of Katyusha rockets.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon."}, {"id": "7f16aba2-51c6-457e-a58f-c049e37ec794", "title": "Three Killed , Six Injured In Israeli Airstrikes On Lebanon", "date": "2024-08-21 05:15", "url": "https://menafn.com/1108582926/Three-Killed-Six-Injured-In-Israeli-Airstrikes-On-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Beirut, Aug 21 (IANS) Three Hezbollah members were killed and six people, including three paramedics, wounded in Israeli on southern Lebanon, military sources said.\nIn addition, two people were injured when a motorcycle was hit by two rockets fired by an Israeli drone in Wadi Hamoul in southwestern Lebanon, and a Syrian was injured as a result of Israeli artillery shelling that targeted the southeastern Lebanese village of Khiam.\nThe Lebanese army monitored the launch of several drones and about 40 surface-to-surface missiles from southern Lebanon into northern Israel, according to the sources.\nMeanwhile, Hezbollah said in a statement that its fighters bombed the Al-Shomira barracks and nearby Israeli troop deployments with volleys of Katyusha rockets.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon."}, {"id": "413cba3c-c02d-4bf7-9220-e81947fa165a", "title": "Israel airstrikes : Hezbollah announces death of four members", "date": "2024-08-21 04:15", "url": "https://www.siasat.com/israel-airstrikes-hezbollah-announces-death-of-four-members-3082380/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "The militant group based out of Lebanon has in a statement that four of its members were killed “On the road to Jerusalem” — its term for its operatives and cadres killed in Israeli strikes.\nMeanwhile, Lebanon’s health ministry in a statement early Wednesday said that Israeli strikes in the country’s east killed one person and wounded 19 others.\nIt may be recalled that Hezbollah chief Hassan Nasrallah had announced heavy attacks on Israel following the assassination of its military head, Fuad Shukr on July 30.\nHezbollah has been attacking Israel from the northern area while Hamas attacked it from the southern area near the Gaza Strip.\nIsrael has been maintaining that both Hezbollah and Hamas were the proxies of the Islamic Republic of Iran."}, {"id": "b7d49399-bf89-4920-a8dd-6abafe88819c", "title": "Israel says it bombed Hezbollah arms depots in Bekaa Valley", "date": "2024-08-21 12:00", "url": "https://www.khaleejtimes.com/world/mena/israel-says-it-bombed-hezbollah-arms-depots-in-bekaa-valley", "domain": "khaleejtimes.com", "domain_classification": "Unknown", "message": "— AFPPublished: Wed 21 Aug 2024, 3:32 PMThe Israeli military said on Wednesday that it bombed Hezbollah weapons storage facilities in Lebanon's Bekaa Valley overnight, its latest strike on arms depots in a major stronghold of the powerful Iranian-backed militia.\nHezbollah said it had retaliated for the strike on the Bekaa region by firing Katyusha rockets at an Israeli military logistics site in the Israeli-occupied Golan Heights.\nOn Saturday, the Israeli military said it targeted a weapons depot used by Hezbollah militants in an airstrike.\nAnother airstrike late on Monday hit a Hezbollah weapons depot in the Bekaa region.\nIn July, Israel bombed another depot storing ammunition belonging to Hezbollah in the town of Adloun in south Lebanon, three security sources said."}, {"id": "ad2386d3-1a79-4e98-af00-0f4ebf59946a", "title": "Massive Destruction Caused by Hezbollah Drone , Rocketry Attack on Golan and Galilee ( Video ) ", "date": "2024-08-21 11:45", "url": "https://english.almanar.com.lb/2179894", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "At 10:15, the Islamic Resistance fighters targeted Branit barracks with appropriate weapons, achieving a direct hit.\nAt 15:15, the Islamic Resistance fighters targeted the espionage equipment at Jal Al-Allam site with appropriate weapons, resulting in its destruction.\nAt 15:35, the Islamic Resistance fighters targeted Al-Marj site with rocket weapons, achieving a direct hit.\nAt 19:40, the Islamic Resistance fighters targeted Ramya site with heavy artillery shells, achieving a direct hit.\nAt 22:20, the Islamic Resistance fighters targeted Birket Risha site with heavy artillery shells, achieving a direct hit."}, {"id": "dffdd9a7-e2ba-4558-9545-b4a5bfbd78bb", "title": "Israel - Hamas war latest : Blinken pushes for cease - fire ... ", "date": "2024-08-21 08:00", "url": "https://accesswdun.com/article/2024/8/1258421", "domain": "accesswdun.com", "domain_classification": "Unknown", "message": "Blinken was on his ninth urgent mission to the Middle East since the war in Gaza began more than 10 months ago.\nHere’s the latest:1 Israeli soldier killed in a Hezbollah drone attackBEIRUT — One Israeli soldier was killed Monday in a Hezbollah drone attack on the Ya’ra Barracks near the Lebanon-Israel border, the Israeli military said.\nThe Israeli military said in a statement that it intercepted some projectiles coming from southern Lebanon, while others “fell in the area of Ya’ra,” without providing additional information.\nThe Israeli military told The Associated Press that there were multiple launches into the area.\nThe Israeli military said that it also targeted Hezbollah militants in the southeastern town of Houla and struck Hezbollah military infrastructure in Hanin and Ain al Shaab."}, {"id": "fe003550-b4c4-4335-8d5a-5b348ab6910e", "title": "Commercial ship  not under command  after repeated attacks target it in Red Sea British say", "date": "2024-08-21 09:15", "url": "https://www.theweek.in/wire-updates/international/2024/08/21/fgn21-yemen-houthi-redsea-ship-attack.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Dubai, Aug 21 (AP) A commercial ship travelling through the Red Sea came under repeated attack Wednesday, leaving the vessel “not under command” in an assault suspected to have been carried out by Yemen's Houthi rebels, the British military said.\nThe attack saw men on small boats first open fire with small arms, the British military's United Kingdom Maritime Trade Operations center said.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nAfter the strikes, the Houthis paused their attacks until Aug. 3, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks, beginning Aug. 8, likely carried out by the rebels."}, {"id": "d0afd554-3672-4edd-a19c-f1f08933f758", "title": "Ship  not under command  after repeated attacks target it in Red Sea , British say", "date": "2024-08-21 11:45", "url": "https://abcnews.go.com/International/wireStory/commercial-ship-command-after-repeated-attacks-target-red-113012838", "domain": "abcnews.go.com", "domain_classification": "International", "message": "“No casualties reported.”Later, the UKMTO warned the ship was drifting while on fire in the Red Sea.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nAfter the strikes, the Houthis paused their attacks until Aug. 3, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8, likely carried out by the rebels.\nAdditional F-22 fighter jets have flown into the region and the USS Wasp, a large amphibious assault ship carrying F-35 fighter jets, is in the Mediterranean Sea."}, {"id": "d681abeb-8b52-4274-8676-9f415e6e3938", "title": "Commercial ship  not under command  after repeated attacks target it in Red Sea , British say", "date": "2024-08-21 10:00", "url": "https://www.local10.com/news/world/2024/08/21/commercial-ship-not-under-command-after-repeated-attacks-target-it-in-red-sea-british-say/", "domain": "local10.com", "domain_classification": "Unknown", "message": "(AP Photo)DUBAI – A Greek-flagged oil tanker traveling through the Red Sea came under repeated attack Wednesday, leaving the vessel “not under command” and drifting ablaze after an assault suspected to have been carried out by Yemen's Houthi rebels, the British military said.\n“No casualties reported.”Later, the UKMTO warned the ship was drifting while on fire in the Red Sea.\nThe Houthis have targeted more than 80 vessels with missiles and drones since the war in Gaza started in October.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8, likely carried out by the rebels."}, {"id": "8213ee3b-b78c-404f-bd8d-ac585e0534d5", "title": "", "date": "2024-08-21 11:45", "url": "http://www.israelnationalnews.com/news/394950", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The Hezbollah terror group on Wednesday morning launched a barrage of rockets towards the Golan Heights in northern Israel, following IDF strikes deep in Lebanon on Tuesday night.\nApproximately 50 rockets were identified as crossing from Lebanon into Israel.\nOn Tuesday night, the IAF struck a Hezbollah terrorist in the area of Beit Lif, southern Lebanon.\nAlso on Tuesday night, IAF fighter jets struck a number of Hezbollah weapons storage facilities in the area of Beqaa in Lebanon.\nIn addition, the IAF struck a Hezbollah terrorist in the area of Wadi Hamoul in southern Lebanon."}, {"id": "4f1de6aa-479f-476f-b9de-0dfd12b1fe68", "title": "", "date": "2024-08-21 08:30", "url": "https://www.israelnationalnews.com/news/394950", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The Hezbollah terror group on Wednesday morning launched a barrage of rockets towards the Golan Heights in northern Israel, following IDF strikes deep in Lebanon on Tuesday night.\nApproximately 50 rockets were identified as crossing from Lebanon into Israel.\nOn Tuesday night, the IAF struck a Hezbollah terrorist in the area of Beit Lif, southern Lebanon.\nAlso on Tuesday night, IAF fighter jets struck a number of Hezbollah weapons storage facilities in the area of Beqaa in Lebanon.\nIn addition, the IAF struck a Hezbollah terrorist in the area of Wadi Hamoul in southern Lebanon."}, {"id": "4704f85b-6662-4e40-91cc-d6fdb9c66c3a", "title": "Ukraine says it struck S - 300 missile system in Russia Rostov region", "date": "2024-08-21 07:00", "url": "https://www.marketscreener.com/quote/currency/US-DOLLAR-RUSSIAN-ROUBLE--2370597/news/Ukraine-says-it-struck-S-300-missile-system-in-Russia-s-Rostov-region-47700849/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "KYIV (Reuters) - Ukraine's military said on Wednesday it struck an S-300 anti-aircraft missile system based in Russia's southern Rostov region overnight.\nKyiv's General Staff said the attack took place near the settlement of Novoshakhtinsk, and that S-300s had been used to attack civilian infrastructure in Ukraine.\n\"Explosions were observed at specified targeting points,\" the General Staff said in a statement.\nRostov governor Vasily Golubev said air defence forces had destroyed a Ukraine-launched missile over his region, but Russia's defence ministry made no mention of the incident in its daily statement on destroyed air weapons.\n(Reporting by Dan Peleschuk in Kyiv and Lidia Kelly in Melbourne; Editing by Andrew Heavens)"}, {"id": "db4b1899-e2c0-4b61-9701-6364faed5992", "title": "9 killed by Israeli airstrike at school in Gaza City", "date": "2024-08-21 08:30", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240821-pdo02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "9 killed by Israeli airstrike at school in Gaza CityPeople's Daily Online(Xinhua) 08:58, August 21, 2024GAZA, Aug. 20 (Xinhua) -- At least nine Palestinians were killed, and others were wounded in an Israeli airstrike on a school sheltering displaced people in Gaza City, Palestinian security and medical sources said Tuesday.\nThe Israeli army targeted the Mustafa Hafez school in the al-Rimal neighborhood, which is sheltering hundreds of displaced families, killing and injuring some of its residents, according to the Gaza-based Palestinian Civil Defense.\n\"So far, we have recovered nine bodies, while others remain trapped under the rubble,\" Mahmoud Basal, spokesperson for the civil defense, told Xinhua.\n\"The Israeli army continues to target civilians in Gaza City, disregarding the lives of children, women, and the elderly,\" Basal added.\nHe noted that civil defense crews are facing significant challenges in reaching the victims due to limited logistical capabilities and fuel shortages."}, {"id": "2dd60722-dbe8-42c5-bfd2-0b7bf520238c", "title": "King Charles visits Southport after dance class stabbing", "date": "2024-08-21 00:30", "url": "https://www.9news.com.au/world/king-charles-meets-southport-stabbing-attack-survivors-london/7b74f6e9-4c81-49a7-ada1-d4698c994a6e", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "After the meeting, Charles signed the book of condolence at Southport Town Hall, adding, \"In deepest sympathy.\"\nBritain's King Charles III looks at the tributes outside Southport Town Hall.\nBut in Southport, the community has focused on the three young girls who lost their lives in the attack: Bebe King, 6, Elsie Dot Stancombe, 7, and Alice Dasilva Aguiar, 9.\nREAD MORE: Ten killed in Gaza school strike after six dead hostages recovered ﻿Alice Dasilva Aguiar, nine; Bebe King, six; and Elsie Dot Stancombe, seven, weren named as the victims of the stabbing attack in Southport.\n(Supplied)Crowds cheered the king outside Southport Town Hall, where mourners have placed bunches of flowers and cuddly toys in tribute to the slain children."}, {"id": "eedfafd8-705b-4ca4-9094-324451d65fcc", "title": "9 Palestinians killed in Israeli strike on market in central Gaza", "date": "2024-08-21 08:30", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240820-presstv01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "9 Palestinians killed in Israeli strike on market in central GazaIran Press TVTuesday, 20 August 2024 6:11 PMAt least nine Palestinians have been killed in an Israeli airstrike on a crowded marketplace in Deir al-Balah.\nSeveral other Palestinians, mostly children, also sustained injuries in the drone attack on the very busy area, which has been classified by the Israeli military as a so-called \"civilian safe zone.\"\nMost of those wounded in Israel's Deir el-Balah market strike are children,\" Al-Jazeera reporter Hind Khoudary said.\n\"Since Israeli forces took over the Philadelphi Corridor, there have been no supplies entering the Strip,\" Khoudary added.\nEarlier in the day, an Israel's attack on Mustafa Hafez School in Gaza killed at least 12 Palestinians."}, {"id": "b0f35a9c-127f-40af-b825-0779f7dd331a", "title": "Ukraine Targets Russian S - 300 Air Defense Missile System in Russia Rostov Region", "date": "2024-08-21 12:15", "url": "https://www.kyivpost.com/post/37727", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Ukrainian forces struck a Russian S-300 anti-aircraft missile complex near Novoshakhtinsk in Russia’s Rostov region early on Wednesday, Aug. 21, according to the General Staff of the Armed Forces of Ukraine (AFU).\nThe attack was carried out by units of the Ukraine’s Naval Forces in coordination with other components of the Defense Forces.\n“The joint combat efforts of all components of Ukraine’s Defense Forces on critical Russian military targets continue.\nAdvertisementWhen deployed in groups, S-300 systems can effectively defend large areas from airborne threats, making them one of Russia's most formidable anti-aircraft systems.\nIn mid-July, the AFU Commander-in-Chief Oleksandr Syrsky announced a successful strike on a Russian S-300 missile system near Mariupol in the occupied Donetsk region."}, {"id": "7b150391-a70c-4dc1-882d-f0afd56ac978", "title": "Xinhua world news summary at 0030 GMT , Aug . 21", "date": "2024-08-21 01:45", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-08/21/content_117378725.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "(Malawi-Plane Crash)- - - -GAZA -- At least nine people were killed in an Israeli airstrike on a market in Deir al-Balah in the central Gaza Strip, Palestinian sources said Tuesday.\nPalestinian security sources told Xinhua that an Israeli aircraft launched at least one missile at the market, which was packed with shoppers.\n(Gaza Strip-Israeli Attack-Casualty)- - - -PRAGUE -- A bus and a lorry collided Tuesday in western Slovakia, leaving seven people injured, local media reported.\nThe accident occurred near the village of Turna in the Kosice region Tuesday afternoon.\nKP.3.1.1, of the Omicron family, is among many currently co-circulating JN.1-derived variants in the United States."}, {"id": "b353100b-beb3-4dd5-901f-e388f9850cef", "title": "Commercial ship  not under command  after repeated attacks target it in Red Sea , British say", "date": "2024-08-21 09:15", "url": "https://www.fitzhugh.ca/world-news/commercial-ship-not-under-command-after-repeated-attacks-target-it-in-red-sea-british-say-9377494", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "“No casualties reported.”Later, the UKMTO warned the ship was drifting while on fire in the Red Sea.\nThe Houthis have targeted more than 80 vessels with missiles and drones since the war in Gaza started in October.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8, likely carried out by the rebels.\nThe last three recent attacks, including Wednesday's, targeted vessels associated with Delta Tankers, a Greek company."}, {"id": "9e5955e8-f72e-44a9-ab77-017f22a93ce6", "title": "Commercial ship  not under command  after repeated attacks target it in Red Sea , British say", "date": "2024-08-21 09:15", "url": "https://www.stalbertgazette.com/world-news/commercial-ship-not-under-command-after-repeated-attacks-target-it-in-red-sea-british-say-9377494", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A Greek-flagged oil tanker traveling through the Red Sea came under repeated attack Wednesday, leaving the vessel “not under command” and drifting ablaze after an assault suspected to have been carried out by Yemen's Houthi rebels, the British military said.\n“No casualties reported.”Later, the UKMTO warned the ship was drifting while on fire in the Red Sea.\nThe Houthis have targeted more than 80 vessels with missiles and drones since the war in Gaza started in October.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8, likely carried out by the rebels."}, {"id": "aaab81d9-3cc7-415c-b8a1-3a263ac6b437", "title": "Moscow repels largest Ukrainian drone attack since invasion", "date": "2024-08-21 09:15", "url": "https://www.dailysabah.com/world/europe/moscow-repels-largest-ukrainian-drone-attack-since-invasion", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "Russian officials claimed to have repelled Wednesday a major Ukrainian drone attack on the capital Moscow, shooting down at least 11 drones.\nThe city in the Moscow region is some 38 kilometers (24 miles) south of the Kremlin.\n\"This is one of the largest attempts to attack Moscow using drones ever,\" Sobyanin said on the Telegram messaging app in the early hours of Wednesday.\nRussia's RIA state news agency reported that two drones were destroyed over the Tula region, which borders the Moscow region to its north.\nThe drone attack on Moscow is on par with the May 2023 attack when at least eight drones were destroyed over the capital in an attack President Vladimir Putin said was Kyiv's attempt to scare and provoke Russia."}, {"id": "b1072df0-228e-45ca-8f9f-de767c9a157e", "title": "Commercial ship  not under command  after repeated attacks target it in Red Sea , British say", "date": "2024-08-21 10:15", "url": "https://www.princegeorgecitizen.com/world-news/commercial-ship-not-under-command-after-repeated-attacks-target-it-in-red-sea-british-say-9377494", "domain": "princegeorgecitizen.com", "domain_classification": "Unknown", "message": "“No casualties reported.”Later, the UKMTO warned the ship was drifting while on fire in the Red Sea.\nThe Houthis have targeted more than 80 vessels with missiles and drones since the war in Gaza started in October.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8, likely carried out by the rebels.\nThe last three recent attacks, including Wednesday's, targeted vessels associated with Delta Tankers, a Greek company."}, {"id": "d28f2d98-d6c8-47b3-8c49-07ed3d37f373", "title": "Commercial ship  not under command  after repeated attacks target it in Red Sea , British say", "date": "2024-08-21 10:45", "url": "https://www.prpeak.com/world-news/commercial-ship-not-under-command-after-repeated-attacks-target-it-in-red-sea-british-say-9377496", "domain": "prpeak.com", "domain_classification": "Unknown", "message": "“No casualties reported.”Later, the UKMTO warned the ship was drifting while on fire in the Red Sea.\nThe Houthis have targeted more than 80 vessels with missiles and drones since the war in Gaza started in October.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8, likely carried out by the rebels.\nThe last three recent attacks, including Wednesday's, targeted vessels associated with Delta Tankers, a Greek company."}, {"id": "96a1d3cd-7b86-458b-a0eb-ea736217cce8", "title": "Commercial ship  not under command  after repeated attacks target it in Red Sea , British say", "date": "2024-08-21 11:30", "url": "https://www.thesunchronicle.com/news/nation_world/commercial-ship-not-under-command-after-repeated-attacks-target-it-in-red-sea-british-say/article_105cc80a-7c77-5af7-a2c3-c6e4ea263d78.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "Greek oil tanker drifting and ablaze after repeated attacks in the Red Sea, British military saysA Greek-flagged oil tanker traveling through the Red Sea has come under repeated attack, leaving the vessel “not under command” and drifting ablaze in an assault suspected to have been carried out by Yemen’s Houthi rebels"}, {"id": "fb5a71d2-6c1d-41a0-bc58-57aa6f2c4919", "title": "Commercial ship  not under command  after repeated attacks target it in Red Sea , British say", "date": "2024-08-21 11:30", "url": "https://www.tricitynews.com/world-news/commercial-ship-not-under-command-after-repeated-attacks-target-it-in-red-sea-british-say-9377496", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "“No casualties reported.”Later, the UKMTO warned the ship was drifting while on fire in the Red Sea.\nThe Houthis have targeted more than 80 vessels with missiles and drones since the war in Gaza started in October.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8, likely carried out by the rebels.\nThe last three recent attacks, including Wednesday's, targeted vessels associated with Delta Tankers, a Greek company."}, {"id": "fda42249-48ce-4ad1-b19d-1e91483865f7", "title": "U . S . Army Counter - UAS Plans Include New Competition | Aviation Week Network", "date": "2024-08-21 10:45", "url": "https://aviationweek.com/defense-space/sensors-electronic-warfare/us-army-counter-uas-plans-include-new-competition", "domain": "aviationweek.com", "domain_classification": "Unknown", "message": "Eventually, the Army also wants to use the system for short-range air defense, though the initial focus is on counter-UAS.\nSecond, the Army wants to start a competition for a next-generation counter-UAS missile.\nThe service is currently buying Raytheon’s Coyote and last month selected Blue Halo’s Freedom Eagle-1 for the Next-Generation Counter-UAS Missile.\nThe Army is also planning a competition for a handheld counter-UAS system next year.\nThe Army wants to move quickly; the competition is expected next year and development will be funded over the next five years."}, {"id": "2997af3f-870c-4b3a-bf1c-4f4862fb49e6", "title": "Israel recovers bodies of 6 hostages from Gaza as Blinken pushes cease - fire deal", "date": "2024-08-21 02:15", "url": "https://www.ksby.com/world/israel-at-war/israel-recovers-bodies-of-6-hostages-from-gaza-as-blinken-tries-to-advance-cease-fire-deal", "domain": "ksby.com", "domain_classification": "Unknown", "message": "The military said its forces recovered the bodies in an overnight operation in southern Gaza, without saying when or how the six died.\nAnother strike killed a mother and her five children in central Gaza.\nThe recovery of the remains is a blow to Hamas, which hopes to exchange hostages for Palestinian prisoners, an Israeli withdrawal and a lasting cease-fire.\nOver 100 hostages were released in exchange for Palestinians imprisoned in Israel during a weeklong cease-fire last year.\nAn Israeli airstrike in central Gaza killed five children and their mother, according to the nearby Al-Aqsa Martyrs Hospital, where an Associated Press reporter counted the bodies."}, {"id": "9edd08a0-3c2b-4465-9b78-9f818eded7a8", "title": "Greek oil tanker drifting and ablaze after repeated attacks in the Red Sea , British military says", "date": "2024-08-21 14:15", "url": "https://www.fitzhugh.ca/world-news/greek-oil-tanker-drifting-and-ablaze-after-repeated-attacks-in-the-red-sea-british-military-says-9377494", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "“No casualties reported.”Later, the UKMTO warned the ship was drifting while on fire in the Red Sea.\nThe Houthis have targeted more than 80 vessels with missiles and drones since the war in Gaza started in October.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nA Liberian-flagged oil tanker came under a particularly intense series of attacks beginning Aug. 8, likely carried out by the rebels.\nThe last three recent attacks, including Wednesday's, targeted vessels associated with Delta Tankers, a Greek company."}, {"id": "99b8efa5-19a5-4d18-9d32-0699efcb80a8", "title": "Hezbollah launches rockets , drones at Israeli bases in response to Bekaa strike", "date": "2024-08-21 11:15", "url": "https://www.naharnet.com:443/stories/en/307391-hezbollah-launches-rockets-drones-at-israeli-bases-in-response-to-bekaa-strike", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hezbollah said it launched suicide drones Wednesday at an Israeli military base in Ami'ad, near Lake Tiberias, and salvos of rockets on \"a logistic military base\" in the Israeli-annexed Golan Heights in response to the latest airstrikes on the Bekaa.\nFirst responders in Golan Heights said they treated a 30-year-old man who was moderately wounded with shrapnel injuries in Wednesday’s attack.\nHezbollah said the attack was in response to an Israeli strike deep into Lebanon on Tuesday night that killed one and injured 19.\nIsrael and Hezbollah have traded near-daily strikes for more than 10 months against the backdrop of Israel’s war on Gaza.\nIsrael captured the Golan Heights from Syria in the 1967 Mideast war and later annexed it, saying it needs the strategic plateau for its security."}, {"id": "00b96eca-9f47-4818-b940-e9349ca78eb1", "title": "Israel - Hamas war : Hezbollah fires more than 50 rockets , hitting Israeli - annexed Golan Heights", "date": "2024-08-21 10:00", "url": "https://economictimes.indiatimes.com/news/defence/israel-hamas-war-hezbollah-fires-more-than-50-rockets-hitting-israeli-annexed-golan-heights/articleshow/112679271.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community"}, {"id": "d00845ef-a2c2-4212-8a72-94259799c48a", "title": "", "date": "2024-08-21 05:15", "url": "http://www.israelnationalnews.com/news/394942", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "“The resistance factions in Iraq ended this truce and therefore all options are available to the resistance forces to target all US bases inside Iraq,” Haider Al Lami, a member of the political council of Al Nujaba Movement in Iraq, told the news website.\nAl Lami added there was “procrastination and stalling” from the American side during talks with the Iraqi government on the withdrawal of troops.\n\"Make no mistake, the United States will not tolerate attacks on our personnel in the region,\" Austin told a news conference in Annapolis.\n“There will be a response in the coming days that could target more than one place, not necessarily in Iraq, Syria and the Zionist entity (Israel),” Lami told The National.\nThe pro-Iranian militias have claimed some rocket attacks that have targeted Israel in recent months."}, {"id": "a121b548-bad8-40d4-91a5-f63248e8785f", "title": "9 killed by Israeli airstrike at school in Gaza City - People Daily Online", "date": "2024-08-21 02:15", "url": "http://en.people.cn/n3/2024/0821/c90000-20208197.html", "domain": "en.people.cn", "domain_classification": "Unknown", "message": "9 killed by Israeli airstrike at school in Gaza CityXinhua) 08:58, August 21, 2024People search for victims among the rubble of a school building destroyed in an Israeli airstrike at the al-Rimal neighborhood in Gaza City, on Aug. 20, 2024.\nAt least nine Palestinians were killed, and others were wounded in an Israeli airstrike on a school sheltering displaced people in Gaza City, Palestinian security and medical sources said Tuesday.\nAt least nine Palestinians were killed, and others were wounded in an Israeli airstrike on a school sheltering displaced people in Gaza City, Palestinian security and medical sources said Tuesday.\nAt least nine Palestinians were killed, and others were wounded in an Israeli airstrike on a school sheltering displaced people in Gaza City, Palestinian security and medical sources said Tuesday.\nAt least nine Palestinians were killed, and others were wounded in an Israeli airstrike on a school sheltering displaced people in Gaza City, Palestinian security and medical sources said Tuesday."}, {"id": "df6a4e81-8051-4741-82cf-ea74104ec985", "title": "It Was a Local Cop Who Stopped Crooks in Butler", "date": "2024-08-21 00:15", "url": "https://hotair.com/david-strom/2024/08/20/it-was-a-local-cop-who-stopped-crooks-in-butler-n3793401", "domain": "hotair.com", "domain_classification": "Unknown", "message": "It was a local cop who stopped the shooting and disabled the weapon of Thomas Matthew Crooks.\n“He stopped Crooks and importantly, I believe the shot damaged the buffer tube on Crooks’ AR,” Higgins added, citing eyewitness testimony.\nIf the cop hadn't shot Crooks' gun, the president might have been killed, or many other bystanders.\nThe complete and utter failure of the Secret Service to do even the minimum necessary to provide more than protection theater is puzzling.\nThe more we hear--and it is remarkably little so far, shockingly--the worse the Secret Service sounds and the better the local law enforcement folks do."}, {"id": "1fd9777e-59db-4fdd-ab99-758962c871e0", "title": "Israel - Hamas war latest : Hezbollah fires more than 50 rockets , hitting Israeli - annexed Golan Heights", "date": "2024-08-21 08:15", "url": "https://www.yahoo.com/news/israel-hamas-war-latest-hezbollah-075010460.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(AP Photo/Ariel Schalit)Key mediator Egypt expressed skepticism Wednesday as more details emerged of the proposal meant to bridge gaps in cease-fire talks between Israel and Hamas, a day before negotiations were expected to resume in Cairo.\nParties during the first phase would negotiate the second and third phases with no “guarantees” to Hamas from Israel or mediators.\nAround 84% of Gaza’s territory has been placed under evacuation orders by the Israeli military, according to the United Nations.\nDetails remained few about the attack, though it comes during the Houthis’ monthslong campaign targeting ships over the ongoing Israel-Hamas war in the Gaza Strip.\nThose fears have grown as Hezbollah has vowed retaliation for an Israeli strike in Beirut last month that killed a top Hezbollah commander."}, {"id": "f146814e-9ec5-44f4-948c-4c1e37e54d72", "title": "Europe 1st commercial rocket by RFA explodes on test stand at Scotland spaceport", "date": "2024-08-21 05:30", "url": "https://www.yahoo.com/news/europes-1st-commercial-rocket-rfa-182948161.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Credit: RFAAn explosion put a dramatic end to a test fire of a new rocket being developed by the German company Rocket Factory Augsburg.\nThe explosion occurred on Monday (Aug. 19) while Rocket Factory Augsbug (RFA) was test firing the first stage of its new RFA ONE rocket.\nRFA posted a statement to X following the incident, noting that, while no personnel were injured, the anomaly \"led to the loss of the stage.\"\nThe company is now working with SaxaVord Spaceport to investigate and analyze the anomaly.\nRocket Factory Augsburg aimed to be one of the first companies to launch from the new spaceport with its RFA One rocket."}, {"id": "6bce0f28-0596-4123-9f91-8516d43353f0", "title": "Israel - Hamas war latest : Hezbollah fires more than 50 rockets , hitting Israeli - annexed Golan Heights", "date": "2024-08-21 08:30", "url": "https://abcnews.go.com/International/wireStory/israel-hamas-war-latest-hezbollah-fires-50-rockets-113012742", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Lebanon’s Hezbollah has launched more than 50 rockets, hitting a number of private homes in the Israeli-annexed Golan HeightsLebanon’s Hezbollah has launched more than 50 rockets, hitting a number of private homes in the Israeli-annexed Golan Heights.\nIsrael and Hezbollah have traded near-daily strikes for more than 10 months against the backdrop of Israel’s war against Hezbollah’s ally, Hamas, in Gaza.\nAround 84% of Gaza’s territory has been placed under evacuation orders by the Israeli military, according to the United Nations.\nTEL AVIV, Israel — Defense Minister Yoav Gallant says Israel’s military is shifting its attention from Gaza to the border with Lebanon.\nThose fears have grown as Hezbollah has vowed retaliation for an Israeli strike in Beirut last month that killed a top Hezbollah commander."}, {"id": "38ff8f43-d5bb-45f2-80e7-4c34508c5bd9", "title": "Blinken ends latest Mideast visit without a cease - fire", "date": "2024-08-21 01:30", "url": "https://www.stltoday.com/news/nation-world/blinken-mideast-cease-fire-israel-hamas/article_d9e35308-538d-5be0-b9a1-6a01e773e527.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "JERUSALEM — U.S. Secretary of State Antony Blinken ended his ninth visit to the Middle East since the war in Gaza began without securing a cease-fire deal, warning Tuesday that “time is of the essence” even as Hamas and Israel suggested challenges remain.\n\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nFew details were released about the so-called bridging proposal put forth by the U.S., Egypt and Qatar.\nIsraeli Prime Minister Benjamin Netanyahu, meanwhile, met with right-wing groups of families of fallen soldiers and hostages in Gaza.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "7529dd02-bc3c-4027-af50-c73ee88e005c", "title": "Like a Liberation Army – Resistance Roundup – Day 319", "date": "2024-08-21 01:00", "url": "https://www.palestinechronicle.com/like-a-liberation-army-resistance-roundup-day-319/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "The new tactics suggest that the Palestinian Resistance now behaves as a unified liberation army, as opposed to various Resistance groups that may coordinate but ultimately operate independently.\nThe Brigades said that the operation was carried out in conjunction with the Al-Qassam Brigades, the military wing of Hamas.\nThe footage showed the targeting of Israeli vehicles from inside demolished buildings, as well as the targeting of an Israeli military vehicle that had opened fire at Resistance fighters, before being hit.\nThe footage also showed a number of fighters from both groups firing mortar shells at Israeli soldiers and military vehicles penetrating into the camp.\nBelow are the latest statements by the two main Resistance forces in Gaza, and the Lebanese Resistance Movement Hezbollah."}, {"id": "da481e7e-5451-4402-a65e-e6ba2c9fdec9", "title": "Hamas decries Israel attack on Gaza school , holds US accountable", "date": "2024-08-21 08:30", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240820-presstv03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hamas decries Israel's attack on Gaza school, holds US accountableIran Press TVTuesday, 20 August 2024 5:36 PMHamas says Israel's strike on another school housing displaced Palestinians in Gaza City demonstrates the regime's criminal approach toward the people of the besieged territory.\nThe Palestinian resistance group denounced Israel's attack on Tuesdays on Mustafa Hafez School that killed at least 12 Palestinians.\nThe resistance group reiterated that it holds \"President [Joe] Biden and his administration fully responsible for the continuation of these massacres against our people.\"\nWithin a 10-day period in August, the regime's military forces struck five schools in Gaza City, killing more than 179 people and injuring scores more.\nThe military forces have so far killed more than 40,170 people in the Palestinian territory, according to the Gaza Health Ministry."}, {"id": "68d2e2ad-ab2d-4d97-a278-ca9a12e9db44", "title": "Israeli strike kills Palestinian President Abbas - led Fatah group official in Lebanon Sidon", "date": "2024-08-21 14:15", "url": "https://gulfnews.com/world/mena/israeli-strike-kills-palestinian-president-abbas-led-fatah-group-official-in-lebanons-sidon-1.103891058", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "SIDON, Lebanon: An Israeli strike in the southern Lebanese city of Sidon killed a Fatah official on Wednesday, a senior member of the Palestinian group and a security source said.\n“The Israeli strike in Sidon killed (Fatah) group official Khalil Makdah,” said Fathi Abu Al Aradat, a senior member of the group that rivals Gaza’s Palestinian Islamist rulers Hamas.\nBut Fatah has not announced any attacks on Israel from Lebanon since clashes began nor had it mourned members killed by Israeli fire in Lebanon.\nHealth workers ‘targeted’The Israeli military in separate statements said a total of around 115 “projectiles” were identified crossing from Lebanon.\nThe military also said air forces struck projectile launchers and several “Hezbollah military” structures in south Lebanon."}, {"id": "65565904-424c-452f-8b07-f422e9b47416", "title": "Israel - Hamas war latest : Hezbollah fires more than 50 rockets , hitting Israeli - annexed Golan Heights", "date": "2024-08-21 10:00", "url": "https://www.local10.com/news/2024/08/21/israel-hamas-war-latest-hezbollah-fires-more-than-50-rockets-hitting-israeli-annexed-golan-heights/", "domain": "local10.com", "domain_classification": "Unknown", "message": "(AP Photo/Ariel Schalit)Key mediator Egypt expressed skepticism Wednesday as more details emerged of the proposal meant to bridge gaps in cease-fire talks between Israel and Hamas, a day before negotiations were expected to resume in Cairo.\nParties during the first phase would negotiate the second and third phases with no “guarantees” to Hamas from Israel or mediators.\nAround 84% of Gaza’s territory has been placed under evacuation orders by the Israeli military, according to the United Nations.\nDetails remained few about the attack, though it comes during the Houthis’ monthslong campaign targeting ships over the ongoing Israel-Hamas war in the Gaza Strip.\nThose fears have grown as Hezbollah has vowed retaliation for an Israeli strike in Beirut last month that killed a top Hezbollah commander."}, {"id": "c12a2cfb-db87-4f42-ac20-a2d627d3e7fb", "title": "Russia and Ukraine Cant Mount Major Offensives Against Each Other , US Says", "date": "2024-08-21 01:00", "url": "https://www.yahoo.com/news/russia-ukraine-t-mount-major-214513871.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia and Ukraine Can’t Mount Major Offensives Against Each Other, US Says(Bloomberg) -- Ukraine and Russia both lack the military assets to mount major offensives against each other, the Pentagon’s intelligence agency said in new assessments that suggests the two sides are headed toward stalemate.\nThe Defense Intelligence Agency’s conclusions are included in the latest quarterly report on US assistance to Ukraine issued by the Pentagon’s inspector general, Robert Storch.\nSince then, Ukraine launched a surprise incursion into Russia’s Kursk region and has started to fly allied-provided F-16 fighters.\nA Ukrainian ATACMS missile strike on Sevastopol on May 18 sank a corvette.\nUkraine also used the system to strike Russian air defenses in Crimea, destroying several of the most advanced S-400 missile systems, the report noted."}, {"id": "d47e3f99-7a85-4d26-bc1e-91823933413a", "title": "King Charles III meets with survivors of stabbing rampage that fueled unrest across Britain", "date": "2024-08-21 02:15", "url": "https://isp.netscape.com/entertainment/story/0001/20240820/a8a71a32d537fa5fcb2299c1837a58d7", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "King Charles III meets with survivors of stabbing rampage that fueled unrest across BritainLONDON (AP) — King Charles III met Tuesday with survivors of the stabbing rampage that killed three young girls in northern England, viewing flowers and teddy bears laid in remembrance of the victims and signing a book of condolence as Britain recovers from widespread unrest fueled by misinformation around the tragedy.\nCrowds cheered the king outside Southport Town Hall, where mourners have placed bunches of flowers and cuddly toys in tribute to the slain children.\nAmong those meeting the monarch were Paige Whitby, Harriet Neal, Naomi Taylor, all 13, and 10-year-old Emie Todd.\n“We wanted to give out ice creams after the riot because the kids had all been terrified,″ Jenna Johnson said.\n“We wanted to give them something to come out of the house for.”The U.K.’s worst unrest in more than a decade led to some 1,100 arrests."}, {"id": "3daa29b2-0294-4569-9c59-68c20da68510", "title": "King Charles III meets with survivors of stabbing rampage that fueled unrest across Britain", "date": "2024-08-21 02:15", "url": "https://isp.netscape.com/news/world/story/0001/20240820/a8a71a32d537fa5fcb2299c1837a58d7", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "King Charles III meets with survivors of stabbing rampage that fueled unrest across BritainLONDON (AP) — King Charles III met Tuesday with survivors of the stabbing rampage that killed three young girls in northern England, viewing flowers and teddy bears laid in remembrance of the victims and signing a book of condolence as Britain recovers from widespread unrest fueled by misinformation around the tragedy.\nCrowds cheered the king outside Southport Town Hall, where mourners have placed bunches of flowers and cuddly toys in tribute to the slain children.\nAmong those meeting the monarch were Paige Whitby, Harriet Neal, Naomi Taylor, all 13, and 10-year-old Emie Todd.\n“We wanted to give out ice creams after the riot because the kids had all been terrified,″ Jenna Johnson said.\n“We wanted to give them something to come out of the house for.”The U.K.’s worst unrest in more than a decade led to some 1,100 arrests."}, {"id": "03ea42a5-4f56-40da-bdb4-3e3c017bb9c5", "title": "Israel - Hamas war latest : Hezbollah fires more than 50 rockets , hitting Israeli - annexed Golan Heights", "date": "2024-08-21 09:00", "url": "https://www.smdailyjournal.com/news/national/israel-hamas-war-latest-hezbollah-fires-more-than-50-rockets-hitting-israeli-annexed-golan-heights/article_8ac047da-42fa-5d37-9c46-d2e731055703.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "548484e4-064d-46dd-a89f-7d09e9ea66e3", "title": "Taylor Swift meets with families affected by England stabbing attack", "date": "2024-08-21 05:15", "url": "https://www.nbcbayarea.com/entertainment/entertainment-news/taylor-swift-meets-with-families-affected-by-england-stabbing-attack/3630323/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "Weeks after a stabbing attack at an event themed around the Grammy winner’s music in Southport, England, left three children dead and 10 others injured, she made sure to do something special for the families.\nIn the wake of the attack, the 34-year-old had shared a message expressing her grief.\n“The horror of yesterday’s attack in Southport is washing over me continuously, and I’m just completely in shock…” Swift wrote on her July 30 Instagram Story.\nRudakubana was charged with three counts of murder, 10 counts of attempted murder and one count of possession of a bladed article in connection to the attack.\nA 17-year-old is facing 3 counts of murder and 10 counts of attempted murder after a deadly stabbing attack at a Taylor Swift themed dance class in the UK."}, {"id": "e64474ed-9859-401a-a1d1-b80c80440cb1", "title": "Mother mourns son allegedly killed by man with three prior murder charges", "date": "2024-08-21 01:45", "url": "https://wjla.com/news/local/man-stabbed-killed-parking-lot-suitland-maryland-chris-woodland-nelson-ford-first-degree-murder-violent-past-pleaded-guilty-second-degree-murder-sondra-woodland-prince-georges-county-crime", "domain": "wjla.com", "domain_classification": "Unknown", "message": "Prince George’s police said her son, 41-year-old Chris Woodland, was murdered by 45-year-old Nelson Ford during a dispute.\nWhat makes the case highly unusual is that 7News has learned this is the fourth time Ford has been charged with murder.\nIn 2015 he was charged with murder for stabbing a man in Suitland.\nTuesday afternoon, a spokesperson for Prince George’s County State’s attorney Aisha Braveboy sent 7News this statement in response to our questions.\nAny other charges against Mr. Ford predated State’s Attorney Braveboy’s administration; therefore, we are unable to comment on any decisions or court actions taken in those cases,\" according to the statement."}, {"id": "7427bc6d-2063-42ca-9834-60e94ee6d79a", "title": "Aug 19 :  Axis of Resistance  operations against Israeli occupation", "date": "2024-08-21 08:30", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240820-presstv09.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Targeted Israeli forces stationed north of Hamad City, east of Khan Younis, southern Gaza Strip, with mortar shells.\nTargeted Israeli military forces storming Al-Mureij Street in the city of Nablus, occupied West Bank, with a high-powered explosive device.\nEngaged in fierce clashes with Israeli forces storming the city of Nablus, occupied West Bank, using machine guns.\nTargeted Israeli military concentrations around the Swedish village, west of Rafah city, southern Gaza Strip, with heavy mortars.\nTargeted Israeli military positions and soldiers around the Rafah border crossing, southern Gaza Strip, with heavy mortars."}, {"id": "d1b77514-86a3-49b6-8081-f8ddc1a0ac7c", "title": "China Hypersonic Cooling Innovation Puts Heat On US", "date": "2024-08-21 05:15", "url": "https://menafn.com/1108582884/Chinas-Hypersonic-Cooling-Innovation-Puts-Heat-On-US", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Asia Times) China's latest hypersonic cooling breakthrough marks a significant leap forward in the race to dominate global high-speed flight and missile systems.\nThe SCMP report says that the device operates for up to 2.5 hours and is a crucial advancement for long-duration, high-speed missions, allowing for journeys from one side of the Earth to the other.\nIn addition, the report points out that China unveiled the DF-17, the world's first hypersonic glide missile, in 2019.\nHowever, as a US congressional investigation noted last year and the SCMP points out in its report, managing the extreme heat generated in hypersonic flight remains a fundamental challenge.\nSCMP reported that Chinese scientists are advancing hypersonic weapon technology with a new HGV capable of exceeding Mach 15 speeds."}, {"id": "6d94d3a2-352d-4c2b-88cc-7a9f843ee49c", "title": "Iran pursuing Haniyeh assassination through legal channels : Judiciary", "date": "2024-08-21 08:30", "url": "https://www.globalsecurity.org/wmd/library/news/iran/2024/iran-240820-irna02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Iran pursuing Haniyeh's assassination through legal channels: JudiciaryIRNA - Islamic Republic News AgencyAug 20, 2024Tehran, IRNA -- Iran's Judiciary spokesman says the Islamic Republic is pursuing the Israeli assassination of Hamas's political leader Ismail Haniyeh in Tehran through international legal channels.\nAsghar Jahangir said on Tuesday that the Judiciary immediately opened a case after Haniyeh was martyred in an Israeli strike in Tehran on July 31.\nThe Islamic Republic has vowed to deliver a \"harsh response\" to the Israeli regime over the brazen act of terror committed on Iranian soil.\nJahangir stressed that Iran's military response does not negate the necessity of pursuing the matter through proper legal channels at the international level.\nHe noted that relevant authorities, particularly in the Foreign Ministry and judiciary, are engaged in international efforts regarding the case."}, {"id": "906ad0a3-f791-4e2d-9b01-44bfb8fbf06b", "title": "Taiwan launches Sky Bow , PAC - IIs in rare public missile drills", "date": "2024-08-21 08:30", "url": "https://www.globalsecurity.org/wmd/library/news/taiwan/2024/taiwan-240820-cna01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Taiwan launches Sky Bow, PAC-IIs in rare public missile drillsROC Central News Agency08/20/2024 01:31 PMTaipei, Aug. 20 (CNA) Taiwan's military demonstrated its precision missile capabilities on Tuesday by firing its indigenous Tien-Kung III (Sky Bow III) land-based surface-to-air missile and U.S.-made Patriot PAC-II surface-to-air missiles in drills opened to the media.\nThe round of exercises was held early on Tuesday in areas around Jiupeng Base in southern Pingtung County's Manzhou Township.\nTwo PAC-II missiles and one Sky Bow III were fired and successfully hit their respective target drones.\nHowever, the military has seldom made public such missile firing drills.\nThe last time precision live-fire missile drills open to the media were held in Jiupeng was in 2012."}, {"id": "510a2acf-6f6f-4032-a522-35a9f6403094", "title": "Salem man dies following July stabbing", "date": "2024-08-21 01:00", "url": "https://www.kptv.com/2024/08/20/salem-man-dies-following-july-stabbing/", "domain": "kptv.com", "domain_classification": "Unknown", "message": "SALEM Ore. (KPTV) - A 19-year-old man has died from injuries sustained nearly a month ago in a stabbing at Wallace Marine Park, according to police.\nThe Salem Police Department says the attack occurred around 2:15 a.m. on the morning of July 27 at the park in west Salem.\nResponding officers found the victim, Salem resident Riley John Adams, with multiple stab wounds.\nPolice are investigating the attack as a homicide, but have not released any details regarding any potential suspects.\nAnyone with information concerning what transpired that Saturday morning and led to Adams’ death is asked to call the Salem Police Tips Line at 503‑588‑8477."}, {"id": "b43730cf-c0f9-4154-be08-b5f53cacddda", "title": "Israel - Hamas war : Hezbollah fires more than 50 rockets , hitting Israeli - annexed Golan Heights", "date": "2024-08-21 11:00", "url": "https://www.moneycontrol.com/news/world/israel-hamas-war-hezbollah-fires-more-than-50-rockets-hitting-israeli-annexed-golan-heights-12802838.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "a54e10bd-5e3b-42b8-bd08-59c0bc0a9a9f", "title": "Blinken ends latest Mideast visit without a cease - fire warning  time is of the essence  ", "date": "2024-08-21 04:30", "url": "https://www.theweek.in/wire-updates/international/2024/08/21/fgn4-us-blinken-mideast.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nIsraeli Prime Minister Benjamin Netanyahu, meanwhile, met with right-wing groups of families of fallen soldiers and hostages in Gaza.\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "c5ab4f83-5d8a-4b50-86b3-c7d508185723", "title": "Hezbollah conducts fresh drone , missile attacks on occupied Galilee , Golan", "date": "2024-08-21 08:30", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240820-irna02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah conducts fresh drone, missile attacks on occupied Galilee, GolanIRNA - Islamic Republic News AgencyAug 20, 2024Tehran, IRNA -- Heavy drone and rocket attacks were launched by the Lebanese Hezbollah on the positions of the Zionist regime's army and Zionist settlements in the north of occupied Palestine, media sources reported.\nAccording to these sources, following Hezbollah's drone and missile attacks, sirens were sounded in Beit Hillel, Kfar Gilead, Metula, Mayan Baruch, Moskav Aam, Kiryat Shmona, Margaliot, Al Manara, Dafneh, Havashrim, Al Hajjar, Dan Vashnir and Shear Yeshov.\nSome sources say that sirens have sounded in the northern occupied Golan.\nMedia sources also reported the Lebanese Hezbollah's drone and missile attack on the mentioned areas.\nSome sources also announced that as a result of Hezbollah armed drones hitting areas in the occupied Golan, fires have occurred in several areas."}, {"id": "5e254b33-4262-4b5b-81f1-d4000c36d53e", "title": "Ukraine war briefing : Russian PoWs from Kursk  abandoned by our command  | Ukraine", "date": "2024-08-21 01:30", "url": "https://www.theguardian.com/world/article/2024/aug/21/ukraine-war-briefing-russian-pows-from-kursk-abandoned-by-our-command", "domain": "theguardian.com", "domain_classification": "International", "message": "Ukraine has said large numbers of Russian servicemen – reportedly in the hundreds – gave themselves up during the Kursk offensive that began on 6 August.\nRussia has formed three new military groupings to bolster security in regions bordering Ukraine, the Russian defence minister, Andrei Belousov, has said.\nRussian air defence destroyed 45 drones that Ukraine launched overnight targeting Moscow and several other regions, Russia’s defence ministry said on Wednesday.\nEleven of the drones were destroyed over the Moscow region, 23 over the border Bryansk region, six over the Belgorod region, three over the Kaluga region and two over the Kursk region, the ministry said.\nThe Russian defence minister, Andrei Belousov, said on national TV that Russia was sending additional troops to the Pokrovsk region."}, {"id": "ef8c8707-168d-49a9-bf7f-833e6206ec72", "title": "Repelled drone attack on Moscow , says Russia", "date": "2024-08-21 12:00", "url": "https://www.khaleejtimes.com/world/europe/repelled-drone-attack-on-moscow-says-russia", "domain": "khaleejtimes.com", "domain_classification": "Unknown", "message": "Ukrainian forces fight during military operations in Kursk region in Malaya Loknya, Kursk Region, Russia, on Tuesday.\n\"This is one of the largest ever attempts to attack Moscow with drones,\" Moscow Mayor Sergei Sobyanin said.\nIn total, 45 drones from Ukraine were destroyed by the Russian air defense systems, according to the Russian defense ministry.\nDrone attacks on Moscow are rare, with Russia saying in May it had downed a drone outside the capital, forcing restrictions to be imposed at two major airports in the city for under an hour.\nIn the night from Tuesday to Wednesday, a total of 72 air targets were detected over Ukraine, according to Ukrainian Air Force Commander Mykola Oleshchuk."}, {"id": "c996f073-d7ed-41dc-93b3-3d12f82162a7", "title": "US and South Korea begin military drills aimed at strengthening their defense against North Korea - New Delhi Times - India Only International Newspaper", "date": "2024-08-21 04:45", "url": "https://www.newdelhitimes.com/us-and-south-korea-begin-military-drills-aimed-at-strengthening-their-defense-against-north-korea/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "U.S. and South Korean troops kicked off a large-scale exercise Monday aimed at strengthening their combined defense capabilities against nuclear-armed North Korea, which again accused the allies of practicing an invasion.\nThe U.S. and South Korean militaries did not immediately react to the North Korean Foreign Ministry statement.\nAbout 19,000 South Korean military personnel will participate in the drills, which will be held concurrently with civil defense and evacuation drills from Monday through Thursday that will include programs based on North Korean nuclear attack scenarios.\nThe drills could trigger a belligerent response from North Korea, which has been flaunting its growing weapons program and issuing verbal threats of nuclear conflicts against Washington and Seoul.\nDuring last year’s Ulchi Freedom Shield exercises, North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets."}, {"id": "fa5d2c14-3aa6-4503-8c96-a8820010b2ae", "title": "Man arrested in Pakistan for spreading united kingdom riot misinformation", "date": "2024-08-21 11:45", "url": "https://www.independent.co.uk/news/uk/crime/uk-riots-pakistan-arrest-southport-misinformation-b2599519.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Pakistani authorities have arrested a man and charged him with cyber terrorism for his alleged role in spreading misinformation that led to rioting in the UK earlier this month, a senior police investigator said Wednesday.\nThe false information claimed that the suspect was a recently arrived asylum-seeker and had a name that suggested the teenager was a Muslim.\nThe misleading information spread quickly online in the UK, with riots breaking out in various locations, including major cities such as Liverpool.\nThey said Asif has claimed that he was not the source of the misinformation but that he reposted it from social media."}, {"id": "4c9a4c65-7915-4826-ba4a-78a3dd8bf5b9", "title": "Moscow under attack : Air defenses shoot down killer drones over Russian capital", "date": "2024-08-21 11:15", "url": "https://www.politico.eu/article/moscow-under-attack-air-defenses-shoot-down-killer-drones-over-russian-capital/", "domain": "politico.eu", "domain_classification": "Unknown", "message": "Ukraine has increasingly taken the fight to Russia in August.\n| Dimitar Dilkoff/AFP via Getty ImagesRussian air defenses shot down 10 drones over Moscow and its outskirts, Mayor Sergei Sobyanin said in a Telegram post early Wednesday morning.\n“The echeloned defense of Moscow against enemy UAVs made it possible to repel all attacks.\nThis was one of the largest attempts to attack Moscow with the help of drones of all time,” Sobyanin added.\nOverall, 45 drones attacked different regions of Russia overnight, with 11 shot down over the Moscow region, 23 destroyed over the Bryansk region, six over Belgorod, three over the Kaluga region and two over Kursk, Russia’s defense ministry said in a statement, blaming Ukraine."}, {"id": "720a6848-9d4a-44cb-879b-1c101140c7ad", "title": "Watch : Hezbollah rocket attack hits Israeli homes in annexed Golan Heights", "date": "2024-08-21 12:15", "url": "https://www.telegraph.co.uk/world-news/2024/08/21/israeli-rockets-peace-deal-hezbollah-golan-heights-hamas/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Hezbollah damaged several Israeli homes after firing a barrage of 50 rockets towards the Israeli-occupied Golan Heights on Wednesday morning.\nIsraeli doctors treated a man in his 30s for shrapnel wounds, while one home was engulfed in flames following a direct hit from a rocket.\nHezbollah said the attack was in response to an Israeli strike deep into Lebanon on Tuesday night, in which one person was killed and 19 injured.\nIsrael attacked Hezbollah targets deep inside Lebanon again overnight, striking a number of military structures and weapons storage facilities in the area of the Beqaa Valley.\nOne member of Hezbollah was killed in southern Lebanon, it said."}, {"id": "2d1bd9a0-582c-4e53-9571-463122c3a35b", "title": "Watch : Hezbollah rocket attack hits Israeli homes in annexed Golan Heights", "date": "2024-08-21 11:00", "url": "https://www.aol.co.uk/news/watch-hezbollah-rocket-attack-hits-101043532.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Hezbollah damaged several Israeli homes after firing a barrage of 50 rockets towards the Israeli-occupied Golan Heights on Wednesday morning.\nIsraeli doctors treated a man in his 30s for shrapnel wounds, while one home was engulfed in flames following a direct hit from a rocket.\nHezbollah said the attack was in response to an Israeli strike deep into Lebanon on Tuesday night, in which one person was killed and 19 injured.\nWhile the talks are set to resume in Cairo on Thursday and Friday, an Israeli official told The Telegraph that might be postponed to next week.\n“Maximalist statements like this are not constructive to getting a ceasefire deal across the finish line,” a US official told Axios."}, {"id": "e0290bb5-c594-4754-b523-57b1500e9781", "title": "Russia claims to down 45 Ukrainian drones in overnight attacks on multiple regions", "date": "2024-08-21 12:15", "url": "https://saudigazette.com.sa/article/644965/World/Russia-claims-to-down-45-Ukrainian-drones-in-overnight-attacks-on-multiple-regions", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "MOSCOW — Russia's Defense Ministry reported on Wednesday that it downed 45 Ukrainian drones in a series of attacks on various regions across the country, including the capital, Moscow.\nAccording to the ministry, 11 drones were shot down over the Moscow region and another three over the neighboring Kaluga region.\nMoscow Mayor Sergey Sobyanin described the incident as \"one of the largest attempts to attack Moscow with drones ever,\" but confirmed there were no casualties or damage.\nHowever, Ukraine's General Staff reported hitting an S-300 missile defense system near Novoshakhtinsk in the Rostov region.\nRostov Governor Vasily Golubev confirmed that a missile was downed in the west of the region, with no reported casualties or damage."}, {"id": "df15cabf-adcb-4d13-abc5-0cd96c2f7285", "title": "Trump to hold first outdoor rally since assassination attempt", "date": "2024-08-21 01:45", "url": "https://www.yahoo.com/news/trump-hold-first-outdoor-rally-011847001.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Trump, who has held roughly a dozen indoor rallies since the shooting, has publicly stated he wants a return to open-air events.\nDays earlier, the 78-year-old Trump posted on social media that he would continue to hold open-air events, \"and the Secret Service has agreed to substantially step up their operation.\nSecurity was also airtight at last month's Republican National Convention, which took place in Milwaukee, Wisconsin just days after the assassination attempt.\nTrump is scheduled to take the stage at the North Carolina Aviation Museum & Hall of Fame, along with his running mate Senate J.D.\nThe southern state of North Carolina is considered one of a handful of swing states that are expected to determine the outcome of the November 5 election."}, {"id": "43abb15d-7898-49f8-b9bc-867160d0d561", "title": "Trump to hold first outdoor rally since assassination attempt", "date": "2024-08-21 04:30", "url": "https://www.thedailystar.net/news/world/usa/news/trump-hold-first-outdoor-rally-assassination-attempt-3682611", "domain": "thedailystar.net", "domain_classification": "Unknown", "message": "Donald Trump will hold a rally outdoors Wednesday in North Carolina, the former US president's first open-air campaign event since he narrowly escaped an assassination attempt at an open-air appearance one month ago.\nDays earlier, the 78-year-old Trump posted on social media that he would continue to hold open-air events, \"and the Secret Service has agreed to substantially step up their operation.\nSecurity was also airtight at last month's Republican National Convention, which took place in Milwaukee, Wisconsin just days after the assassination attempt.\nTrump is scheduled to take the stage at the North Carolina Aviation Museum & Hall of Fame, along with his running mate Senate J.D.\nThe southern state of North Carolina is considered one of a handful of swing states that are expected to determine the outcome of the November 5 election."}, {"id": "9a2a8d51-d35c-495e-8499-3b73c08c58d8", "title": "Russia - Ukraine war : Kyiv launches  one of largest ever  drone attacks on Moscow : mayor", "date": "2024-08-21 04:00", "url": "https://www.smh.com.au/world/europe/kyiv-launches-one-of-largest-ever-drone-attacks-on-moscow-mayor-20240821-p5k44y.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Ukraine has launched one of the largest ever drone attacks on Moscow, the city’s mayor said, with Russian air defence units destroying at least 10 drones flying towards the capital on Wednesday.\nSome of the drones were destroyed over the city of Podolsk, Mayor Sergei Sobyanin said.\nThe city in the Moscow region is about 38 kilometres south of the Kremlin.\n“The air defence systems of the Defence Ministry continue to repel enemy UAV [unmanned aerial vehicles] attacks,” Sobyanin said on the Telegram messaging app at 4.43am on Wednesday (11.43am AEST).\n“This is one of the largest attempts to attack Moscow using drones ever."}, {"id": "3f52dcc2-d78b-4892-bd33-f18f2def51d7", "title": "Why Ukrainian Forces Destroyed Second Bridge In Russia Kursk Region , What Zelenskyy Plan ? ", "date": "2024-08-21 12:00", "url": "https://www.news18.com/explainers/why-ukrainian-forces-destroyed-second-bridge-in-russias-kursk-region-whats-zelenskyys-plan-9022907.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "Ukrainian forces’ daring act by destroying two key bridges in Russia’s Kursk region has further escalated the cross-border tensions between the countries who have been on a war since February 2022.\nUkraine’s air force chief, Lt. Gen. Mykola Oleshchuk, on Friday released a video of an airstrike that cut the bridge in two.\nThe Ukrainian Air Force confirmed the destruction of the second bridge across the Seim River.\nThis includes creating a buffer zone on the aggressor’s territory -– our operation in the Kursk region,” he said in his address.\nAccording to the Ukraine’s army chief, the operation has allowed Ukrainian forces to advance over 1,000 square kilometres into the Kursk region."}, {"id": "516e51b5-9491-4ab7-83a2-a26ad9bb3515", "title": "Russia - Ukraine war : Kyiv launches  one of largest ever  drone attacks on Moscow : mayor", "date": "2024-08-21 03:30", "url": "https://www.brisbanetimes.com.au/world/europe/kyiv-launches-one-of-largest-ever-drone-attacks-on-moscow-mayor-20240821-p5k44y.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Ukraine has launched one of the largest ever drone attacks on Moscow, the city’s mayor said, with Russian air defence units destroying at least 10 drones flying towards the capital on Wednesday.\nSome of the drones were destroyed over the city of Podolsk, Mayor Sergei Sobyanin said.\nThe city in the Moscow region is about 38 kilometres south of the Kremlin.\n“The air defence systems of the Defence Ministry continue to repel enemy UAV [unmanned aerial vehicles] attacks,” Sobyanin said on the Telegram messaging app at 4.43am on Wednesday (11.43am AEST).\n“This is one of the largest attempts to attack Moscow using drones ever."}, {"id": "4e2617ba-7b43-4d98-a361-c44ba1e61881", "title": "School And Market Targeted As Israeli Genocide Escalates - Workers Revolutionary Party", "date": "2024-08-21 02:45", "url": "https://wrp.org.uk/news/school-and-market-targeted-as-israeli-genocide-escalates/", "domain": "wrp.org.uk", "domain_classification": "Unknown", "message": "‘BOMBARDMENT is overwhelming the entire Gaza Strip, with no respite since the early hours of this morning,’ Palestinians reported from Gaza yesterday.\nAt least nine Palestinians were killed in an Israeli airstrike on a market in Deir Al Balah in central Gaza yesterday afternoon, with children among the dead.\nAnother overnight attack on a car in northern Gaza killed at least four.\nIn central Gaza, the Israeli military destroyed a family house in the Bureij refugee camp without any warning, killing six Palestinians.\nEgypt has always rejected a permanent Israeli military presence in the Philadelphi Corridor as well as Israeli control over the Palestinian side of the Rafah crossing,’ Haridy said."}, {"id": "094ddad2-2a47-44fd-a13e-7f6bdcefcecf", "title": "Inciting riots in united kingdom : Court grants one - day physical remand of Farhan Asif", "date": "2024-08-21 14:30", "url": "https://dunyanews.tv/en/Pakistan/832208-inciting-riots-in-uk-court-grants-oneday-physical-remand-of-farhan-a", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Inciting riots in UK: Court grants one-day physical remand of Farhan AsifPakistan Pakistan Inciting riots in UK: Court grants one-day physical remand of Farhan AsifAsif was arrested for allegedly inciting riots in Britain through spreading fake news, says FIRFollow on Updated On: Wed, 21 Aug 2024 17:39:34 PKTLAHORE (Dunya News/Web Desk) - A district court on Tuesday granted one-day physical remand of accused Farhan Asif, who was arrested for allegedly inciting riots in Britain through spreading fake news.\nFarhan Asif is facing charges under sections 9 and 10-A of the PECA Act and also in a cybercrime case registered in the United Kingdom.\nMoreover, the article posted by Farhan Asif falsely attributed the stabbing incident to 17-year-old Ali Al-Shakati and made incorrect claims about the attacker's religion as Muslim.\nDuring the investigation, it was verified that Farhan Asif used the X account that disseminated false information.\nIt has been established that Farhan Asif, a Pakistani citizen, acted alone in spreading fabricated news that fueled unrest in the UK."}, {"id": "6f8e2df0-8f7d-4a3c-a207-4f7037f4be86", "title": "", "date": "2024-08-21 00:30", "url": "http://www.israelnationalnews.com/news/394934", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Palestinian Arabs reported a \"work accident\" on Tuesday evening, after an explosive device went off on terrorists as they tried to plant it in the town of Tammun, located in the northern Jordan Valley.\nSuch “work accidents” occur from time to time , mostly in the Gaza Strip, when terrorists mishandle an explosive device .\nIn August of last year, an explosion ripped through a Hamas site in the central Gaza Strip, killing Ashraf Hussein, a member of Hamas’ military wing, the Qassam Brigades.\nLast week, a car with two terrorists inside exploded near Hebron , injuring the two terrorists as well as two additional people.\nIt appears the car contained explosives that were intended to be used against Israelis in a terror attack."}, {"id": "57ec4a47-87a6-4ff0-9a97-d4533a673f94", "title": "", "date": "2024-08-21 01:30", "url": "https://www.israelnationalnews.com/news/394934", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Palestinian Arabs reported a \"work accident\" on Tuesday evening, after an explosive device went off on terrorists as they tried to plant it in the town of Tammun, located in the northern Jordan Valley.\nSuch “work accidents” occur from time to time , mostly in the Gaza Strip, when terrorists mishandle an explosive device .\nIn August of last year, an explosion ripped through a Hamas site in the central Gaza Strip, killing Ashraf Hussein, a member of Hamas’ military wing, the Qassam Brigades.\nLast week, a car with two terrorists inside exploded near Hebron , injuring the two terrorists as well as two additional people.\nIt appears the car contained explosives that were intended to be used against Israelis in a terror attack."}, {"id": "8c9373f0-16a6-4ae9-883e-034ac2bc042f", "title": "Middle East updates : Blinken wraps visit without truce deal – DW – 08 / 21 / 2024", "date": "2024-08-21 10:30", "url": "https://www.dw.com/en/middle-east-updates-blinken-wraps-visit-without-truce-deal/live-70002826", "domain": "dw.com", "domain_classification": "International", "message": "Skip next section Israeli confirms it targeted Fatah official08/21/2024 August 21, 2024 Israeli confirms it targeted Fatah officialThe Israeli military says it targeted a commander in the armed wing of the Palestinian Fatah movement, describing him as having worked for the Iranian Revolutionary Guards.\nKhalil al-Maqdah was killed in a targeted air strike in Lebanon on Wednesday.\n\"Earlier today... an air force aircraft targeted Khalil al-Maqdah in the Sidon area of southern Lebanon,\" the military said in a statement.\nIt claimed that Maqdah and his brother worked for Iran in \"directing attacks and transferring funds and weapons to terrorist infrastructure\" in the occupied West Bank.\nThe \"assassination of a Fatah official is further proof that Israel wants to ignite a full-scale war in the region,\" Tawfiq Tirawy, a member of Fatah's central committee, told the AFP news agency."}, {"id": "cebe1065-9ae1-415b-8436-44670cacffe2", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 03:30", "url": "https://komonews.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "komonews.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "8e103363-4ed8-410f-8af0-505559b9300d", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:45", "url": "https://www.wcti12.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "bc6453cd-283b-4730-b63f-d930fcf78a2b", "title": "Day 319 Update : Including Children , Israel Kills Dozens In Gaza", "date": "2024-08-21 01:30", "url": "https://imemc.org/article/day-319-update-including-children-israel-kills-dozens-in-gaza/", "domain": "imemc.org", "domain_classification": "Unknown", "message": "On Tuesday, Day 319 of the ongoing genocide, Israeli missiles and shells killed and injured dozens of Palestinians, including children and women, in several parts of the besieged, devastated, destroyed, and starved Gaza Strip.\nIn Deir Al-Balah, in central Gaza, the army fired missiles and shells at a market, killing at least eight Palestinians, mostly children and women, and wounding many more.\nMedical sources said that besides the slain and injured Palestinians, many remain under the rubble while the search continues to locate them despite limited means.\nFurthermore, ten Palestinians, including children and women, were killed, and others were wounded when Israeli warplanes bombed a school sheltering displaced people in the Rimal neighborhood west of Gaza City.\nIn northern Gaza, the army fired missiles at an apartment in Tal Az-Za’tar in the Jabalia refugee camp, killing and wounding many Palestinians, including children and women."}, {"id": "51831a81-3abe-4724-853a-0d2e8d484bce", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 03:30", "url": "https://katu.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "katu.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "d3b85701-2e94-4f05-9c20-3520fe38f538", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:15", "url": "https://wpde.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "wpde.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "2ce205fd-9b0d-4815-b34f-5277dc289cd9", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 00:15", "url": "https://wset.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "wset.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "d85dc7a7-3c7f-4ee2-b39f-f4a8e4328395", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 01:45", "url": "https://wjla.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "wjla.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "d794fd3b-7912-4be5-87c0-067d527c0aa5", "title": "Amsterdam fugitive who survived murder attempt that killed girlfriend arrested in Dubai", "date": "2024-08-21 14:15", "url": "https://nltimes.nl/2024/08/21/amsterdam-fugitive-survived-murder-attempt-killed-girlfriend-arrested-dubai", "domain": "nltimes.nl", "domain_classification": "Unknown", "message": "The 30-year-old Amsterdam man is wanted in the Netherlands for involvement in various violent crimes, including the assassination of Sedar Ay in 2020.\nB. fled the Netherlands after surviving an attempted assassination that killed his girlfriend, Ayla Mintjes, on 16 May 2021.\nB. has been on the run since Mintjes’ murder on Maassluisstraat in Amsterdam.\nThe criminal Ay had been mistaken for later said a “boy with regrets” told him that Anis B. and Mouad K. had gunned Ay down.\nSo far, one man has been convicted for Ay’s murder - Dominique K. was sentenced to 15 years in prison for complicity in 2022."}, {"id": "cf64862b-8412-4f0c-88b7-a41f04463298", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 03:30", "url": "https://wwmt.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "4cb7f80d-3a74-4e4e-a715-79641d2fcb94", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:15", "url": "https://www.theday.com/nation/20240820/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence/", "domain": "theday.com", "domain_classification": "Unknown", "message": "U.S. Secretary of State Antony Blinken gestures as he departs for Egypt, in Tel Aviv, Israel, Aug. 20, 2024.\n(AP Photo/Ariel Schalit)U.S. Secretary of State Antony Blinken gestures as he departs for Egypt, in Tel Aviv, Israel, Aug. 20, 2024.\n(The Hostages Families Forum via AP)U.S. Secretary of State Antony Blinken walks after arriving at El-Alamein, Egypt, Tuesday, Aug.20, 2024.\n(Kevin Mohatt//Pool Photo via AP)U.S. Secretary of State Antony Blinken, left, meets with Egypt's Foreign Minister Badr Abdelatty in El-Alamein, Egypt, Tuesday, Aug. 20, 2024.\n(Kevin Mohatt/Pool Photo via AP)Israeli police officers move a demonstrator blocking a street during a protest, in Jerusalem, Tuesday, Aug. 20, 2024."}, {"id": "6d9368f9-4d9f-48e8-9f4e-cefdf14ef3a4", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 03:30", "url": "https://abc6onyourside.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "abc6onyourside.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "6d10f01c-f0a2-4663-8bb0-011105e19725", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:15", "url": "https://katv.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "katv.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "a5405b2e-aba0-4d5b-b434-8f089876d87e", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 04:15", "url": "https://www.wcyb.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "wcyb.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "da0437f0-eb02-4107-972d-b3290fefea78", "title": "So Long , London : Taylor Swift makes Wembley history at last united kingdom show on tour", "date": "2024-08-21 09:15", "url": "https://www.aol.co.uk/long-london-taylor-swift-makes-072307026.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Taylor Swift has made Wembley Stadium history as she became the first solo artist to perform at the venue eight times in a single tour.\nThe track So Long, London is the fifth song on her latest album – the slot reserved for the most meaningful track on each of her albums.\nThe first solo artist to play Wembley Stadium eight times in a single tour.\n#LondonTSTheErasTour pic.twitter.com/KDUKb6kP4f — Wembley Stadium (@wembleystadium) August 20, 2024Singer Florence Welch, 37, surprised Swift fans by arriving on stage to perform Florida!!!\nTaylor Swift performing on stage (Liam McBurney/PA)It comes days after Ed Sheeran also surprised fans by making an onstage appearance."}, {"id": "6030ebba-71a7-4384-af59-bee1aa389906", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 01:00", "url": "https://turnto10.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "turnto10.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "5c4aa976-3e6d-4f53-aae6-2141a4aac8d5", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 01:30", "url": "https://kfdm.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "kfdm.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "770578b2-d44e-44eb-90a1-cdd22ef6f51f", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:30", "url": "https://ktul.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "ktul.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "e42269aa-ab9f-4fe9-a160-15fb85361780", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 01:00", "url": "https://cbs12.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "cbs12.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "f91e34d4-6bdc-45f2-a2ee-975b5d710fed", "title": "Trial set for man accused of trying to kill Justice Kavanaugh", "date": "2024-08-21 04:15", "url": "https://gazette.com/news/wex/trial-set-for-man-accused-of-trying-to-kill-justice-kavanaugh/article_701afd1c-6e0f-54d1-aa58-bdaa33a11995.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "A federal judge scheduled a trial to start on June 9, 2025, for a California man charged with trying to assassinate Supreme Court Justice Brett Kavanaugh over two years ago.\nFollowing the leaked court opinion on the Dobbs v. Jackson Women's Health Organization case that overturned abortion protections, then-26-year-old Nicholas Roske traveled to Washington, D.C., to kill Kavanaugh and conservative justices, prosecutors allege.\nThe leaked court opinion sparked protesters to gather outside the homes of the conservative justices, whose addresses were also leaked online.\nRoske was arrested and charged with attempting to murder a justice of the United States, and he has pleaded not guilty.\nLast month, prosecutors asked to move the case forward with a trial date."}, {"id": "751481e6-4240-42d5-a8a8-05ff2baab899", "title": "Syrskyi reveals statistics : over 9 , 000 missiles and 14 , 000 drones fired by Russia since invasion began", "date": "2024-08-21 01:45", "url": "https://www.yahoo.com/news/syrskyi-reveals-statistics-over-9-000314659.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Syrskyi reveals statistics: over 9,000 missiles and 14,000 drones fired by Russia since invasion beganOn August 20, Ukrainian Armed Forces Commander-in-Chief Oleksandr Syrskyi reported that since the start of Russia's full-scale invasion, over 9,600 missiles and nearly 14,000 attack drones have been used against Ukraine.\nDuring a meeting of local and regional authorities, Syrskyi revealed that Ukrainian air defense has successfully destroyed more than 2,400 missiles and 9,200 drones.\nSyrskyi published statistics about the missile attacks and numbers, and he pointed out the various missile types used by Russian forces, including Kalibr, Dagger, and S-300/S-400 missiles.\nUkraine was primarily targeted with S-300/S-400 missiles, totaling 3,008 strikes.\nThe second most frequently used weapons were Kh-555/Kh-101 cruise missiles, with 1,846 recorded attacks."}, {"id": "2694b54c-282f-41d2-bf8e-53a68230ec90", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:15", "url": "https://fox11online.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "68850b1f-7b46-4a67-8b76-df0756a26db6", "title": "Chicago police prepare for more protests on day 2 of the DNC", "date": "2024-08-21 00:30", "url": "https://www.yahoo.com/news/chicago-police-prepare-more-protests-222255309.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Protestors clash with police amid rally outside Israeli Consulate on day 2 of DNCCHICAGO — Protestors in the West Loop confronted police on Tuesday night during a demonstration outside the Israeli Consulate.\nDemonstrators clash with police amid pro-Palestinian rally outside Israeli consulate.\nDemonstrators clash with police amid pro-Palestinian rally outside Israeli consulate.\nDemonstrators clash with police amid pro-Palestinian rally outside Israeli consulate.\nDemonstrators clash with police amid pro-Palestinian rally outside Israeli consulate."}, {"id": "a11e6c74-fd93-438b-8d45-24d4d000da85", "title": "Ceasefire elusive as Blinken leaves Middle East , with future Israeli presence in Gaza key sticking point", "date": "2024-08-21 01:30", "url": "https://www.theguardian.com/world/article/2024/aug/21/israel-hamas-ceasefire-deal-negotiations-antony-blinken-middle-east", "domain": "theguardian.com", "domain_classification": "International", "message": "US secretary of state Antony Blinken said that “time is of the essence” to secure a Gaza ceasefire, as he wrapped up a Middle East tour with an agreement between Israel and Hamas still elusive.\n“The United States does not accept any long-term occupation of Gaza by Israel,” Blinken said.\n“More specifically, the agreement is very clear on the schedule and the locations of [Israel Defense Forces] withdrawals from Gaza, and Israel has agreed to that.\nSome relatives told Israeli media that Netanyahu told them Israel will not abandon two strategic corridors in Gaza, the Philadelphi and Netzarim corridors.\nA White House spokesperson rejected as “totally untrue” that Netanyahu had told Blinken that Israel would never leave the Philadelphi and Netzarim corridors."}, {"id": "ff3cea08-c218-483b-a5e9-d48d9428a27b", "title": "Ukraine launches drone attack on Moscow , other regions , Russian officials say", "date": "2024-08-21 02:30", "url": "https://economictimes.indiatimes.com/news/defence/ukraine-launches-drone-attack-on-moscow-other-regions-russian-officials-say/articleshow/112667289.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelUkraine launched a widespread drone attack on Russia on Wednesday, with air defence units destroying three drones some 38 kms (24 miles) south of the Kremlin, and 15 over the border Bryansk region, Russian officials said.The three attack drones heading towards Moscow were downed over the city of Podolsk in the Moscow region, Moscow's Mayor Sergei Sobyanin said on the Telegram messaging app.\n\"According to preliminary data, there is no damage or casualties at the site where the debris fell,\" Sobyanin said.There were also no casualties or damage reported in the aftermath of the drone attack on the border Bryansk region in Russia's southwest, Alexander Bogomaz, the governor of the region wrote on Telegram.Russia's RIA state news agency reported also that two drones were destroyed over the Tula region, which borders the Moscow region to its north.Separately, Vasily Golubev, governor of the Rostov region in Russia's southwest, said that air defence forces destroyed a Ukraine-launched missile over the region, with no injuries reported.It was not clear how many drones and missiles in total Ukraine launched.Reuters could not independently verify the reports.\nThere was no immediate comment from Ukraine.In recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow's war efforts.\nIt also says that its attacks are in response to Russia's continued strikes on Ukrainian territory."}, {"id": "306bbff8-7a78-4d3a-b9f9-3a50b7199af1", "title": "Ukraine launches drone attack on Moscow , other regions , Russian officials say", "date": "2024-08-21 02:30", "url": "https://www.theglobeandmail.com/world/article-ukraine-launches-drone-attack-on-moscow-other-regions-russian/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Ukraine launched one of the largest ever drone attacks on Moscow on Wednesday, the city’s mayor said, with Russian air defence units destroying at least 10 drones flying towards the capital.\nThe city in the Moscow region is some 38 kilometres south of the Kremlin.\n“This is one of the largest attempts to attack Moscow using drones ever.\nRussian officials rarely disclose the full size of the attacks, reporting only drones that its air defence units destroy.\nIn recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow’s war efforts."}, {"id": "770c06c5-04da-4ec9-90dd-ff98ca77c7c0", "title": "Ukraine launches drone attack on Moscow , other regions , Russian officials say", "date": "2024-08-21 02:15", "url": "https://www.thestar.com.my/news/world/2024/08/21/ukraine-launches-drone-attack-on-moscow-other-regions-russian-officials-say", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "MOSCOW (Reuters) -Ukraine attacked Moscow on Wednesday with at least 11 drones that were shot down by air defences in what Russian officials called one of the biggest drone strikes on the capital since the war in Ukraine began in February 2022.\nFor months, Ukraine has also fought an increasingly damaging drone war against the refineries and airfields of Russia, the world's second largest oil exporter, though major drone attacks on the Moscow region - with a population of over 21 million - have been rarer.\nThe city in the Moscow region is some 38 km (24 miles) south of the Kremlin.\n\"This is one of the largest attempts to attack Moscow using drones ever,\" Sobyanin said on the Telegram messaging app in the early hours of Wednesday.\nIn Kursk, Russian war bloggers said intense battles were ongoing along the front in the region where Ukraine has carved out at least 450 square km (175 square miles) of Russian territory."}, {"id": "06c41f16-8982-49e2-b53e-6674a5918b31", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:15", "url": "https://upnorthlive.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "upnorthlive.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "8caaa1c6-4f6d-47fc-a8f0-a91b74aea999", "title": "Pakistan police charge man with cyber terrorism over misinformation that led to riots in united kingdom – Winnipeg Free Press", "date": "2024-08-21 11:30", "url": "https://www.winnipegfreepress.com/world/2024/08/21/pakistan-police-charge-man-with-cyber-terrorism-over-misinformation-that-led-to-riots-in-uk", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "LAHORE, Pakistan (AP) — Authorities in Pakistan on Wednesday arrested and charged a man with cyber terrorism for his alleged role in spreading misinformation that led to widespread rioting in the U.K. earlier this month.\nAuthorities have blamed far-right agitators for stoking the violent unrest by continuing to spread misinformation and promoting the violent demonstrations online.\nHe said Asif has claimed that he was not the source of the misinformation but that he reposted it from social media.\nKishwar said Asif ran the Channel3 Now account, and alleged that he spread fake news to gain more viewers and income.\nPolice have handed over the case to the Federal Investigation Agency or FIA, which handles cases relating to the cyber terrorism."}, {"id": "ad55f775-aa44-4670-93c2-12ba3c2855aa", "title": "Antony Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 07:00", "url": "https://www.thehindu.com/news/international/antony-blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence/article68549094.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "“We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nMr. Netanyahu, meanwhile, met with right-wing groups of families of fallen soldiers and hostages in Gaza.\nA senior U.S. official rejected as “totally untrue” that Mr. Netanyahu had told Mr. Blinken that Israel would never leave the Philadelphi and Netzarim corridors.\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "4c4fe81e-a59c-4280-9436-f169d2974dc7", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 03:30", "url": "https://khqa.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "khqa.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "6c8dd393-727f-42e0-afac-66275825f24d", "title": "Moscow experiences large drone attack overnight : Russia", "date": "2024-08-21 11:15", "url": "https://www.prokerala.com/news/articles/a1557745.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Moscow, Aug 21 : Russia destroyed 45 Ukrainian drones overnight from Tuesday to Wednesday, including 11 over the Moscow region, the Russian Ministry of Defence said on Wednesday.\nMoscow's Mayor Sergei Sobyanin said that there were 11 drones shot down over the territory of the Moscow region, one of the largest drone attacks on Moscow ever, Xinhua news agency reported.\nLast week, the Russian military repelled a similar group missile attack on the Crimean Bridge and drone attacks over the Black Sea overnight.\nThe ministry added that Ukraine had launched drone attacks in the Black Sea on August 15 and that its air defence systems intercepted and destroyed five Ukrainian drones over the Black Sea.\nRussian helicopters destroyed five Ukrainian unmanned boats in the Black Sea heading in the direction of Crimea, it added."}, {"id": "0ee14f22-3c09-4cdf-8d59-4afa93ef87d4", "title": "Ukraine launches drone attack on Moscow , other regions , Russian officials say", "date": "2024-08-21 04:45", "url": "https://www.geo.tv/latest/560230-ukraine-launches-drone-attack-on-moscow-other-regions-russian-officials-say", "domain": "geo.tv", "domain_classification": "Unknown", "message": "— AFP/FileUkraine launched a widespread drone attack on Russia on Wednesday, with air defence units destroying three drones some 38 kms (24 miles) south of the Kremlin, and 15 over the border Bryansk region, Russian officials said.\nThe three attack drones heading towards Moscow were downed over the city of Podolsk in the Moscow region, Moscow's Mayor Sergei Sobyanin said on the Telegram messaging app.\nThere were also no casualties or damage reported in the aftermath of the drone attack on the border Bryansk region in Russia's southwest, Alexander Bogomaz, the governor of the region wrote on Telegram.\nRussia's RIA state news agency reported also that two drones were destroyed over the Tula region, which borders the Moscow region to its north.\nSeparately, Vasily Golubev, governor of the Rostov region in Russia's southwest, said that air defence forces destroyed a Ukraine-launched missile over the region, with no injuries reported."}, {"id": "940061a6-8c83-4df8-b83c-1fcaa9f46799", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 08:30", "url": "https://www.wfmz.com/news/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence/article_ef6e9304-cd93-576b-b612-28a6e652015f.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "Relatives of hostages held by Hamas in the Gaza Strip and their supporters protest near the hotel where U.S. Secretary of State Antony Blinken is staying during his visit with Israeli Prime Minister Benjamin Netanyahu and leadership about a deal to halt the war in Gaza and free the hostages, in Tel Aviv, Monday, Aug. 19, 2024.\n(AP Photo/Ohad Zwigenberg)"}, {"id": "0b52eb4b-56ee-4fc9-8410-a683369f5c01", "title": "Blinken ends Mideast visit without cease - fire , warning  time is of essence  ", "date": "2024-08-21 08:30", "url": "https://www.naharnet.com/stories/en/307387-blinken-ends-mideast-visit-without-cease-fire-warning-time-is-of-essence", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "2de8ccba-c8d9-4670-89b4-99795dba6bbb", "title": "John Barrasso easily wins Wyoming GOP Senate primary", "date": "2024-08-21 04:45", "url": "https://www.yahoo.com/news/john-barrasso-easily-wins-wyoming-021329896.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Wyoming Sen. John Barrasso on Tuesday defeated a Republican primary challenger, setting up a battle for a third term in November.\nBarrasso, currently the chair of the Senate Republican Conference, the third-ranking position among Senate Republicans, and a ranking member of the Senate Energy and Natural Resources Committee, defeated Reid Rasner, a financial adviser.\nTOP REPUBLICAN DEMANDS ANSWERS AFTER WH PROTESTS YIELD 0 ARRESTS; QUESTIONS 'POLITICAL SYMPATHY' WITH VANDALSSen. John Barrasso speaks during a news conference at the U.S. Capitol on Sept. 19, 2023.\nSEN. JOHN BARRASSO CALLS SECRET SERVICE CONFERENCE CALL A '100% COVER-YOUR-A--' BRIEFINGA group of migrants is shown after crossing the U.S.-Mexico border at Jacumba Hot Springs, California, on June 6, 2024.\nOriginal article source: John Barrasso easily wins Wyoming GOP Senate primary"}, {"id": "b3f9a7d6-ad30-45da-8128-31f0fc14e312", "title": "John Barrasso easily wins Wyoming GOP Senate primary", "date": "2024-08-21 02:45", "url": "https://www.foxnews.com/politics/john-barrasso-easily-wins-wyoming-gop-senate-primary", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Wyoming Sen. John Barrasso on Tuesday defeated a Republican primary challenger, setting up a battle for a third term in November.\nBarrasso, currently the chair of the Senate Republican Conference, the third-ranking position among Senate Republicans, and a ranking member of the Senate Energy and Natural Resources Committee, defeated Reid Rasner, a financial adviser.\nBarrasso made headlines recently for criticizing the Secret Service after the assassination attempt of former President Donald Trump.\nSEN. JOHN BARRASSO CALLS SECRET SERVICE CONFERENCE CALL A '100% COVER-YOUR-A--' BRIEFINGCLICK HERE TO GET THE FOX NEWS APPIn January, Barrasso's wife lost her battle with brain cancer.\n\"After a courageous battle with cancer, Bobbi is now at peace and at home with the Lord,\" Barrasso said in a statement."}, {"id": "5e3db612-02f3-4cc6-a808-84aacfba99a3", "title": "Ukraine launches drone attack on Moscow , other regions , Russian officials say", "date": "2024-08-21 03:15", "url": "https://www.swissinfo.ch/eng/ukraine-launches-drone-attack-on-moscow,-other-regions,-russian-officials-say/87315074", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Ukraine attacks Moscow in one of largest ever drone attacks on the Russian capitalreuters_tickers3 minutesBy Guy Faulconbridge and Lidia KellyMOSCOW (Reuters) -Ukraine attacked Moscow on Wednesday with at least 11 drones shot down by air defences in what Russian officials said was one of the biggest drone strikes on the capital since the war in Ukraine began in February 2022.\nFor months, Ukraine has also fought an increasingly damaging drone war against the refineries and airfields of the world’s second largest oil exporter, though major drone attacks on the Moscow region – with a population of over 21 million – are rarer.\nThe city in the Moscow region is some 38 kms (24 miles) south of the Kremlin.\n“This is one of the largest attempts to attack Moscow using drones ever,” Sobyanin said on the Telegram messaging app in the early hours of Wednesday.\nRussia’s RIA state news agency reported that two drones were destroyed over the Tula region, which borders the Moscow region to its north."}, {"id": "6e67f5f3-5aed-4628-8809-b86b17abeb72", "title": "Israeli drone strike kills Fatah official in Sidon", "date": "2024-08-21 11:15", "url": "https://www.naharnet.com:443/stories/en/307397-israeli-strike-kills-fatah-official-in-sidon", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "An Israeli strike in the southern coastal city of Sidon killed a Fatah official on Wednesday, a senior member of the Palestinian group and a security source said.\n\"The Israeli strike in Sidon killed (Fatah) group official Khalil Maqdah,\" said Fathi Abu al-Aradat, a senior member of the group that rivals Gaza's Palestinian Islamist rulers Hamas.\nLebanon's official National News Agency said Maqdah was killed \"in a drone strike on his car\".\nTawfiq Tirawy, a member of Fatah's central committee, told AFP that Israel killed Maqdah in order to start a regional war.\nEarlier this month, another Israeli drone strike hit an SUV on a main road in Sidon, killing a Hamas official identified as Samer al-Haj."}, {"id": "0f76b349-e643-402f-9905-b54759bd2f15", "title": "Israeli drone strike kills Fatah official in Sidon", "date": "2024-08-21 11:15", "url": "https://www.naharnet.com:443/stories/en/307397-israeli-drone-strike-kills-fatah-official-in-sidon", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "An Israeli strike in the southern coastal city of Sidon killed a Fatah official on Wednesday, a senior member of the Palestinian group and a security source said.\n\"The Israeli strike in Sidon killed (Fatah) group official Khalil Maqdah,\" said Fathi Abu al-Aradat, a senior member of the group that rivals Gaza's Palestinian Islamist rulers Hamas.\nLebanon's official National News Agency said Maqdah was killed \"in a drone strike on his car\".\nTawfiq Tirawy, a member of Fatah's central committee, told AFP that Israel killed Maqdah in order to start a regional war.\nEarlier this month, another Israeli drone strike hit an SUV on a main road in Sidon, killing a Hamas official identified as Samer al-Haj."}, {"id": "2bba70b0-7474-4f8e-a816-981e9a29fe3a", "title": "Drone wreckage found in Romanian town near Ukrainian border", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/drone-wreckage-found-romanian-town-231155093.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Drone fragments were discovered in Romania near its border with Ukraine, specifically in the area around the village of Periprava, Tulcea county.\nThe discovery follows a recent Russian drone and missile attack on Ukraine, during which Ukrainian forces shot down several air targets.\nThis is not the first time drone debris has been found in Romania, with NATO previously stating that these incidents are irresponsible and dangerous.\nRussian forces have repeatedly targeted Ukrainian port infrastructure on the Danube River that separates Ukraine and Romania.\nRomania has taken measures to protect its citizens who live close to the Ukrainian border, including the construction of air raid shelters and the deployment of drone defense systems."}, {"id": "51064ecd-88d3-4d8c-9109-ae60e688e0a6", "title": "Perth explosion : Residents claim to have heard earthquake - like tremors across southern suburbs", "date": "2024-08-21 08:30", "url": "https://www.perthnow.com.au/news/wa/perth-explosion-residents-claim-to-have-heard-earthquake-like-tremors-across-perths-southern-suburbs-c-15779800", "domain": "perthnow.com.au", "domain_classification": "Unknown", "message": "Perth’s mysterious loud noise on Wednesday could have been caused by a jet fighter breaking the sound barrier.\nSouthern suburbs residents were left perplexed as to what caused a loud and mysterious “explosion” that rattled windows and spooked pets on Wednesday morning.\nThousands of comments flooded social media with reports of a loud “boom” just after 11am.\n“We saw other neighbours going out onto balcony to look for smoke or something ... People felt it and heard it.\nThe Bureau of Meteorology has also been unable to shed light on the mysterious loud noise."}, {"id": "7d6e65ee-fcb0-4798-8741-378682a43daa", "title": "PD : 60 - year - old man dies days after stabbing in Walnut Hills", "date": "2024-08-21 03:30", "url": "https://www.wcpo.com/news/local-news/hamilton-county/cincinnati/walnut-hills/pd-60-year-old-man-dies-days-after-stabbing-in-walnut-hills", "domain": "wcpo.com", "domain_classification": "Unknown", "message": "CINCINNATI — A 60-year-old man was fatally stabbed Saturday afternoon in Walnut Hills, Cincinnati police said.\nOfficers responded to the 2900 block of Gilbert Avenue around 1:45 p.m. for a reported stabbing.\nPolice have not released any suspect information in the stabbing.\nCPD's Homicide Unit is investigating the stabbing.\nAnyone with information is asked to call the Homicide Unit at 513-352-3542."}, {"id": "76f7c437-4650-40e0-9c07-d93debf43352", "title": "Ukraine launches  one of largest ever  drone attacks on Moscow , mayor says", "date": "2024-08-21 03:15", "url": "https://economictimes.indiatimes.com/news/defence/ukraine-launches-one-of-largest-ever-drone-attacks-on-moscow-mayor-says/articleshow/112667596.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "The city in the Moscow region is some 38 kms (24 miles) south of the Kremlin.\n\"The air defence systems of the defence ministry continue to repel enemy UAV (unmanned aerial vehicles) attacks,\" Sobyanin said on the Telegram messaging app at 4:43 a.m. (0143 GMT).\n\"This is one of the largest attempts to attack Moscow using drones ever.\nThere was no immediate comment from Ukraine.In recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow's war efforts.\nIt also says that its attacks are in response to Russia's continued strikes on Ukrainian territory."}, {"id": "724c4918-6532-4187-8152-2ef84891b3a2", "title": "Ukraine launches drone attack on Moscow , Russian air defence destroys 3 near Kremlin", "date": "2024-08-21 04:15", "url": "https://www.firstpost.com/world/ukraine-launches-drone-attack-on-moscow-russian-air-defence-destroys-3-near-kremlin-13806696.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Moscow faced one of its largest drone strikes yet, with Russian air defenses downing numerous drones targeting the capital.\nThe city in the Moscow region is some 38 kms (24 miles) south of the Kremlin.\nAdvertisement“This is one of the largest attempts to attack Moscow using drones ever.\nRussian officials rarely disclose the full size of the attacks, reporting only drones that its air defence units destroy.\nIn recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow’s war efforts."}, {"id": "3be93fb6-be9a-4b00-ad52-0718d9e2259d", "title": "Lebanon Says 5 Killed In Fresh Israel Strikes", "date": "2024-08-21 07:00", "url": "https://www.ndtv.com/world-news/lebanon-says-5-killed-in-fresh-israel-strikes-6383545", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Lebanon's health ministry said early Wednesday that Israeli strikes in the country's east killed one person and wounded 20 others, hours after it said four people were killed in the south.\n\"Israeli enemy strikes on the Bekaa\" valley killed one person \"and wounded 20 others\", the health ministry said in an updated toll.\nHealth workers 'targeted'The Israeli military in separate statements said a total of around 115 \"projectiles\" were identified crossing from Lebanon.\nThe military also said air forces struck projectile launchers and several \"Hezbollah military\" structures in south Lebanon.\nAn Israeli strike on Beirut's southern suburbs killed a top Hezbollah commander, Fuad Shukr, shortly before an attack in Tehran blamed on Israel killed Hamas political leader Ismail Haniyeh."}, {"id": "025c5ede-d472-4da0-873c-39fc712499a3", "title": "Ukraine launches  large  drone attack on Moscow", "date": "2024-08-21 04:15", "url": "https://www.rte.ie/news/2024/0821/1465950-ukraine/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Ukraine launched one of the largest ever drone attacks on Moscow, the city's mayor said, with Russian air defence units destroying all 11 drones flying towards the capital.\n\"This is one of the largest attempts to attack Moscow using drones ever.\nUkraine has often launched one or two drones targeting Moscow in recent months, causing little damage.\nPokrovsk, a vital transport hub for Ukrainian forces located at the intersection of key supply routes, is being evacuated.\nUkrainian drones attacked an oil storage facility in Russia's southern Rostov region on Sunday, sparking a large fire, the local governor said."}, {"id": "815a7846-1c33-496f-999d-e6e17a743296", "title": "Ukraine updates : Moscow downs drones , loses land in Kursk – DW – 08 / 21 / 2024", "date": "2024-08-21 10:30", "url": "https://www.dw.com/en/ukraine-updates-moscow-downs-drones-loses-land-in-kursk/live-70003033", "domain": "dw.com", "domain_classification": "International", "message": "Russian air defense systems were able to down 11 drones over the Moscow region, the city's mayor said.\nMajor airports around the Russian capital curbed flights, but later resumed normal operations.\nSubstantial drone attacks were also reported over the border regions of Bryansk and Belgorod.\nAt the same time, Ukrainian forces were said to have gained some territory around the parcel of land it controls in Russia's Kursk region.\nHere are the latest developments from Russia's war in Ukraine on Wednesday, August 21:"}, {"id": "dfdfd9dc-b4a9-4d84-86a2-0ec6f40c3cfe", "title": "Lebanon says five killed in fresh Israel strikes", "date": "2024-08-21 02:45", "url": "https://www.rte.ie/news/2024/0821/1465948-middle-east/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Israel has killed a senior militant from Fatah's armed wing in a strike on Lebanon, leading to accusations from the Palestinian movement that Israel is trying to \"ignite a regional war\".\nFatah, the Palestinian movement based in the Israeli-occupied West Bank, said Khalil Maqdah was killed in a strike near the southern Lebanese city of Sidon.\nThe Israeli military said it targeted the brother of Mounir Maqdah, who heads the Lebanese branch of Fatah's armed wing.\nThe military also said air forces struck projectile launchers and several \"Hezbollah military\" structures in south Lebanon.\nAn Israeli strike on Beirut's southern suburbs killed a top Hezbollah commander, Fuad Shukr, shortly before an attack in Tehran blamed on Israel killed Hamas political leader Ismail Haniyeh."}, {"id": "4b082f8d-8378-4063-b053-a6276fcbc397", "title": "Russia War Casualties Up By 1 , 210 In Past Day", "date": "2024-08-21 06:45", "url": "https://menafn.com/1108583040/Russias-War-Casualties-Up-By-1210-In-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The estimated casualty toll of the Russian invasion forces in Ukraine since the start of the full-scale war has amounted to 603,010 killed or wounded.\nThat's according to the General Staf of Ukraine's Armed Forces, Ukrinform reports.\nAlso, Ukraine's Defense Forces have destroyed 8,522 enemy tanks (+4 in the past day), 16,542 (+21) armored fighting vehicles, 17,216 (+60) artillery systems, 1,166 multiple rocket launchers, 928 (+2) anti-aircraft warfare systems, 367 warplanes, 328 helicopters, 13,902 (+38) unmanned aerial vehicles, 2,442 (+4) missiles, 28 warships/cutters, a submarine, 23,221 (+79) vehicles and fuel tankers, and 2,887 (+2) units of specialized equipment.\nUkrainian border guards show attackin combat action near KramatorskThe latest reports on enemy losses are being verified."}, {"id": "5188e808-6dd8-496b-8cdb-184effb0f16c", "title": "Aircraft carrier Bush gets first - ever Stingray drone control room", "date": "2024-08-21 14:15", "url": "https://www.militarytimes.com/news/your-navy/2024/08/21/bush-aircraft-carrier-gets-first-ever-stingray-air-drone-control-room/", "domain": "militarytimes.com", "domain_classification": "Unknown", "message": "The aircraft carrier George H.W.\nBush is now sporting the world’s first air drone warfare center, a control room that will host operators of the MQ-25 Stingray refueling drone in the not-too-distant future, the Navy has confirmed.\nThe ground control station was part of a multiyear effort that took place aboard Bush during multiple ship maintenance stints and between deployments, Naval Air Systems Command, or NAVAIR, said.\nBehold, the world's first unmanned air warfare center, recently installed aboard the aircraft carrier George H.W.\n(U.S. Navy)Standing up the Bush’s drone control room “lays the foundation” for how the Navy will operate and control unmanned aircraft, Unmanned Carrier Aviation (PMA-268) Program Manager Capt."}, {"id": "53e6d859-caf5-4feb-ae7a-0c18a7ab0d9b", "title": "Kingdom Come : Deliverance II - Gameplay Teaser Trailer", "date": "2024-08-21 04:15", "url": "https://n4g.com/news/2617297/kingdom-come-deliverance-ii-gameplay-teaser-trailer", "domain": "n4g.com", "domain_classification": "Unknown", "message": "60°Kingdom Come: Deliverance II - Gameplay Teaser TrailerReady to immerse yourself in war-torn Medieval Europe?\nThis thrilling story-driven action RPG, set amid the chaos of a civil war in 15th Century Bohemia, releases 11 February 2025.\nExperience a true RPG experience - with authentic first person combat and an epic cinematic story - as you live life through the eyes and actions of Henry, a young man on a quest to avenge his murdered parents."}, {"id": "c6ee81d3-a326-48f7-81bc-7510a8210e91", "title": "Delta Force - Gamescom 2024 Trailer", "date": "2024-08-21 04:15", "url": "https://n4g.com/news/2617298/delta-force-gamescom-2024-trailer", "domain": "n4g.com", "domain_classification": "Unknown", "message": "50°Delta Force - Gamescom 2024 TrailerDelta Force is a free-to-play first-person tactical shooter coming soon to Xbox, PC and mobile.\nAs the latest installment of the classic series that has defined the genre for 25 years, Delta Force is back with an upgraded arsenal of weaponry, jaw-dropping environments, and a truly dynamic world.\nDrop into large-scale multiplayer combat and take the fight to the enemy across land, sea and air in Havoc Warfare, experience intense extraction-based action with your squad in Hazard Operations, or transport back to 1993 for our Black Hawk Down campaign mode based on the classic Ridley Scott movie.\nThree great ways to play, one exciting package!"}, {"id": "2ad447de-c875-426a-b087-2fb76f54f01a", "title": "Lost Records : Bloom & Rage - First Look Gameplay Trailer", "date": "2024-08-21 04:15", "url": "https://n4g.com/news/2617301/lost-records-bloom-and-rage-first-look-gameplay-trailer", "domain": "n4g.com", "domain_classification": "Unknown", "message": "40°Lost Records: Bloom & Rage - First Look Gameplay TrailerLost Records: Bloom & Rage is a new narrative adventure game from the creators of the critically acclaimed series, Life is Strange.\nRewind back to the 90s and live the defining summer of four high school girls as they forge bonds through their growing friendship, their punk band, and an unexplained event that will forever change their lives."}, {"id": "a55b1448-57ec-4232-9b07-f2cb7c395cc2", "title": "Towerborne - Gameplay Trailer - Gamescom 2024", "date": "2024-08-21 04:15", "url": "https://n4g.com/news/2617296/towerborne-gameplay-trailer-gamescom-2024", "domain": "n4g.com", "domain_classification": "Unknown", "message": "50°Towerborne - Gameplay Trailer - Gamescom 2024Can you become the Ace humanity needs to survive?\nJoin us inTowerborne, a fast-paced, hope-filled, action RPG.\nIn this vibrantworld with exhilarating combat, you’ll take on malevolent forces solo oralongside your companions and fight as one."}, {"id": "0c721a7e-6bcf-477e-9bbb-4c1329e0bf9d", "title": "Dune : Awakening To Be Released in Early 2025", "date": "2024-08-21 01:00", "url": "https://wccftech.com/dune-awakening-to-be-released-in-early-2025/", "domain": "wccftech.com", "domain_classification": "Unknown", "message": "Dune: Awakening was one of the major games showcased at Gamescom 2024, where they announced the plans to release the game in Early 2025.\nAdditionally, during Gamescom, 30 minutes of Dune: Awakening gameplay will be showcased later in the week.\nThe reveal for Dune: Awakening shows the player's rise from scavenging and survival to mobilizing an entire guild hunting for spice.\nDune: Awakening will launch in early 2025 on PC, with the game arriving on PlayStation 5 and Xbox Series X|S later.\nIn addition to the 30-minute showcase of Dune: Awakening, Funcom has announced that a third Dune: Awakening Direct will air on August 29."}, {"id": "310c2b92-a654-4b9e-833f-18e3c24517d0", "title": "Top 10 Artificial intelligence ( AI ) Applications for Military Use in 2024", "date": "2024-08-21 06:00", "url": "https://finance.yahoo.com/news/top-10-artificial-intelligence-ai-053542329.html", "domain": "finance.yahoo.com", "domain_classification": "Unknown", "message": "In this article, we will be taking a look at the top 10 artificial intelligence (AI) applications for military use in 2024.\nYou can skip our detailed analysis on the AI industry and directly head to the Top 5 Artificial intelligence (AI) Applications for Military Use in 2024.\nTop 10 Artificial intelligence (AI) Applications for Military Use in 2024Pixabay/Public DomainOur MethodologyHere is the list of the top 10 artificial intelligence (AI) applications for military use in 2024 according to our research.\nIntelligence, Surveillance, and ReconIntelligence, Surveillance, and Reconnaissance (ISR) is one of the top applications of artificial intelligence (AI) in military.\nNone: The Top 10 Artificial Intelligence (AI) Applications for Military Use in 2024 is originally published on Insider Monkey."}, {"id": "3a1d7997-0664-4204-834a-1aa32024c152", "title": "Russia refuses to pull troops from Ukraine , sends in teenage cannon - fodder to Kursk", "date": "2024-08-21 12:15", "url": "https://www.telegraph.co.uk/news/2024/08/21/kursk-incursion-ukraine-russia-war-conscript-offensive/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Boris Johnson would be in my Cabinet, says Robert Jenrick"}, {"id": "cf63dfe3-6c3c-4056-b31c-7f8aee560f0b", "title": "Russia seeks to turn humbling incursion into military gains", "date": "2024-08-21 04:45", "url": "https://economictimes.indiatimes.com/news/defence/russia-seeks-to-turn-humbling-incursion-into-military-gains/articleshow/112669762.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "And instead of weakening Kremlin's grip on power, the invasion may eventually cause more Russian citizens to rally around the flag.The Kursk invasion \"is certainly a blow to the Kremlin's reputation,\" Tatiana Stanovaya, a Russian political scientist, wrote Tuesday on X.\nBut \"it is unlikely to spark a significant rise in social or political discontent among the population, nor will it lead to an elite rebellion.\nMost military analysts believe Ukraine no longer threatens any strategic targets, such as Kursk's nuclear plant or the provincial capital.\n\"More likely it will lead to anger, and acceptance that the war was inevitable.\nWith triple the population and a larger industrial base, that side remains Russia.This article originally appeared in The New York Times."}, {"id": "f4fc100a-cd21-4f14-8768-83422bf0c32b", "title": "Delta Force Goes Into Steam Early Access This Q4 2024", "date": "2024-08-21 14:15", "url": "https://gameranx.com/updates/id/506115/article/delta-force-goes-into-steam-early-access-this-q4-2024/", "domain": "gameranx.com", "domain_classification": "Unknown", "message": "Team Jade has revealed Delta Force is entering Early Access.\nAnd yes, Delta Force Hawk Down has now been simplified to just be called Delta Force.\nTrue to his word, Team Jade director Shadow Guo has been seriously considering the feedback from fans.\nAs we now see, Team Jade decided to make things simple for everyone.\nThey shared this caption on their latest trailer:“Delta Force: Hawk Ops is now simply Delta Force, and will launch for PC in Early Access during Q4 2024!"}, {"id": "042f65df-ea71-4564-a236-2592d3e4a7b1", "title": "12 killed in fresh Israeli strike on school shelter - World", "date": "2024-08-21 04:30", "url": "https://www.dawn.com/news/1853664/12-killed-in-fresh-israeli-strike-on-school-shelter", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "GAZA STRIP: Gaza’s civil defence agency said an Israeli strike on a school-turned-shelter killed at least 12 people on Tuesday, while the Israeli military said it struck a Hamas command centre.\n“Our crews retrieved 12 martyrs from the Mustafa Hafiz school, which was bombed by the Israeli occupation west of Gaza City,” agency spokesman Mahmud Bassal told AFP.\nThousands of displaced Palestinians had sought refuge in the school, he said, amid the ongoing war in the Gaza Strip.\nThe Israeli military said the school was targeted because it housed a command-and-control centre.\nThe school was reduced to rubble, with scores of Palestinian men and women, many holding children, fleeing the site after the strike."}, {"id": "bac82f2f-fdf4-4c76-b195-4eed368d3f0c", "title": "Syria and Chemical Weapons : The Horror Continues", "date": "2024-08-21 12:00", "url": "https://www.heritage.org/middle-east/commentary/syria-and-chemical-weapons-the-horror-continues", "domain": "heritage.org", "domain_classification": "Unknown", "message": "Mr. Assad still has the capability — and, apparently, the willingness — to use chemical weapons against his fellow Syrians.\nThough even one chemical weapon attack is one too many, these aren’t the only two incidents of chemical weapons being used by the regime.\nNext, there’s the fact that Syria is a signatory to the Chemical Weapons Convention.\nThat includes the option of striking high-value political targets not related to the regime’s chemical weapons program.\nThe regime’s use of chemical weapons is just one of the unspeakable nightmares it has spawned."}, {"id": "c5b9ed46-db86-4cc6-becb-8cf0b7612729", "title": "From the Archives : Saving the war letters", "date": "2024-08-21 13:00", "url": "https://www.stripes.com/history/2024-08-21/archives-saving-the-war-letters-14922950.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "Andrew Carroll, founder of the Legacy Project, shows a letter written by a U.S. soldier in Anzio, Italy, during World War II.\nFrom thousands of contributors who have read about his letters project or seen him on television, Carroll has amassed what he calls a “small hill” of war letters.\nLin/Stars and Stripes)At home in Washington earlier this year, he showed off a few letters he’s holding onto for just a little while longer.\nBut because of Carroll’s war letters project, “Those things are now back out for all the world to see.”The reporter, Chris Carroll, is no relation.\nYou can find the letters at The Center for American War Letters at Chapman University: https://www.chapman.edu/research/institutes-and-centers/cawl/index.aspxRead the transcript of the letter Staff Sgt."}, {"id": "4fcb3edc-fed1-4482-bfb3-79bc5890ca51", "title": "Russia : Many Ukrainian Drones Tried to Attack Moscow", "date": "2024-08-21 13:45", "url": "https://www.newser.com/story/354901/russia-many-ukrainian-drones-tried-to-attack-moscow.html", "domain": "newser.com", "domain_classification": "Unknown", "message": "Moscow reported a substantial drone attack by Ukraine, one of its largest since the invasion began in 2022.\nRussia's Ministry of Defense confirmed downing 45 drones overnight, with 11 being destroyed around Moscow.\nBryansk's governor, Alexander Bogomaz, noted a significant attack on his region but said all 23 drones had been destroyed.\nThese drone strikes are often aimed at refining and airfield facilities in an attempt to weaken Russia's combat infrastructure.\nThe Institute for the Study of War reported Ukrainian advances in Kursk despite stretched resources."}, {"id": "841d0ef8-6a5a-457f-830e-f12ceb6e423a", "title": "Valiant Exalia : Symphony of the Brave Windows game", "date": "2024-08-21 05:15", "url": "https://www.moddb.com/games/valiant-exalia", "domain": "moddb.com", "domain_classification": "Unknown", "message": "About Valiant Exalia:Iron Valiant is a single-player, mecha combat action game built around tense melee fights, high-skill ranged weapon combat, and full environmental destruction and interaction mechanics.\nIn a world of colossal steel beasts, Iron Valiant has players helm three unique mechas (known as Valiants) with a variety of unique ranged and melee weapons at their disposal.\nValiant Exalia Demo gameplay video:Full Environmental Destruction:Almost all buildings can be destroyed in Iron Valiant.\nMaster Melee and Ranged combat:Iron Valiant has tense combat centered around wise positioning, fast-paced mech battles, an in-depth melee and combo system, and satisfying ranged combat.\nIron Valiant tells a tale as old as time, what does war cost a country?"}, {"id": "39bc3243-2974-4ee4-a185-c702bf21910e", "title": "Shoplifters & Scammers : At War with the Law", "date": "2024-08-21 04:15", "url": "https://www.tvguide.co.uk/schedule/80185786-526d-5c41-9d4b-fdff5e9c7f10/shoplifters-and-scammers-at-war-with-the-law", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Shoplifters & Scammers: At War with the Law5STAR 10:00 AM to 11:00 AM Wednesday 21 August Share Add toCalendar +S SubtitlesDocumentary following shopping centre security teams who are locked in a cat and mouse battle to catch criminalsShoplifters & Scammers: At War with the Law airs on 5STAR at 10:00 AM, Wednesday 21 August .\n(Subtitles.)\nLearn more about Shoplifters & Scammers: At War with the Law and other education/science/factual topics on our factual page"}, {"id": "255d5bef-bd6a-46b8-ac25-2f4c84bd4868", "title": "bg1589es : In Post - War Iraq , Use Military Forces to Secure VitalU . S . Interests , Not for Nation - Building", "date": "2024-08-21 12:00", "url": "https://www.heritage.org/middle-east/report/bg1589es-post-war-iraq-use-military-forces-secure-vitalus-interests-not-nation", "domain": "heritage.org", "domain_classification": "Unknown", "message": "The Administration has yet to present its plans for post-war Iraq.\nHowever, it should not be up to U.S. military forces to construct this new government.\nPost-war military activities in Iraq should not be subject to arbitrary deadlines.\nHowever, the Administration should avoid making the U.S. military presence appear to be indefinite.\nAny U.S. and allied military forces that remain in Iraq should be to bolster the efforts of a new friendly government and to ensure that vital U.S. interests in the region remain secure."}, {"id": "fa45088c-bdb4-4623-8b03-70a6058a63f4", "title": "Valiant Exalia : Symphony of the Brave Windows game", "date": "2024-08-21 08:00", "url": "https://www.indiedb.com/games/valiant-exalia", "domain": "indiedb.com", "domain_classification": "Unknown", "message": "About Valiant Exalia:Iron Valiant is a single-player, mecha combat action game built around tense melee fights, high-skill ranged weapon combat, and full environmental destruction and interaction mechanics.\nIn a world of colossal steel beasts, Iron Valiant has players helm three unique mechas (known as Valiants) with a variety of unique ranged and melee weapons at their disposal.\nValiant Exalia Demo gameplay video:Full Environmental Destruction:Almost all buildings can be destroyed in Iron Valiant.\nMaster Melee and Ranged combat:Iron Valiant has tense combat centered around wise positioning, fast-paced mech battles, an in-depth melee and combo system, and satisfying ranged combat.\nIron Valiant tells a tale as old as time, what does war cost a country?"}, {"id": "ad7ab9a6-4568-4f87-b543-ba4b41797bb4", "title": "The Nightly : August 20th , 2024", "date": "2024-08-21 03:30", "url": "https://www.cagesideseats.com/2024/8/20/24225019/the-nightly-august-20th-2024", "domain": "cagesideseats.com", "domain_classification": "Unknown", "message": "Tonight, it’s tri brand warfare as we take a look at Survivor Series 2019.\nThe first match was the women’s Survivor Series match and the match was a mess.\nAnd in the main event, it was Becky Lynch vs. Bayley vs. Shayna Baszler.\nThis was an unpopular match at the time, and while I do think it’s a bit overhated, I don’t think this is a good main event.\nThis didn’t need to main event, and the styles from all three didn’t mesh together."}, {"id": "0c722caa-7544-40cd-8c09-7b17fd8b0632", "title": "What we know about assault on Joint Base San Antonio entry gate", "date": "2024-08-21 00:15", "url": "http://www.expressnews.com/news/article/shooting-joint-base-san-antonio-questions-mystery-19667096.php", "domain": "expressnews.com", "domain_classification": "Unknown", "message": "Air Force trainees down meal rations during a break from exercises at the Chapman Annex of Joint Base San Antonio-Lackland.\nAn Air Force spokeswoman, Stefanie \"Stevi\" Antosh, said it was more than one, but she didn't provide a number.\nAir Force trainees participate in a combat simulation at the Chapman Training Annex of Joint Base San Antonio-Lackland.\nSAPD is investigating the incident as an “aggravated assault with deadly weapon.”What is the Chapman Training Annex?\nAuthorities closed the Chapman Annex gate for a few hours, but it reopened around 9:40 a.m. Saturday."}, {"id": "0dcca630-1d18-42fa-a767-17a2328577ba", "title": "Worthplaying |  Mecha Break  Playable At Gamescom , Shows Off ACE & Digital Human Technologies On PC , Xbox Closed Beta This Weekend", "date": "2024-08-21 07:00", "url": "https://worthplaying.com/article/2024/8/20/news/143261-mecha-break-playable-at-gamescom-shows-off-ace-digital-human-technologies-on-pc-xbox-closed-beta-this-weekend-trailer/", "domain": "worthplaying.com", "domain_classification": "Unknown", "message": "Mecha Break is a multiplayer mech game that allows players to choose from diverse mechs, customize appearances, and battle colossal war machines on treacherous terrain.\nAmazing Seasun Games is at gamescom all weekend and has a playable demo available at the Mecha Break and Xbox booths on the gamescom show floor.\nAt Gamescom 2024, NVIDIA announced that its first digital human small language model is being demonstrated in Mecha Break to bring its characters to life and provide a more dynamic and immersive gameplay experience on GeForce RTX AI PCs.\nMecha BREAK is showcasing the NVIDIA Nemotron-4 4B Instruct NIM running on device in the first showcase of ACE-powered game interactions.\nMecha Break is coming to Xbox Series X|S and PC (Steam) in 2025."}, {"id": "1c0d21ff-0d3f-45aa-938f-fbd80983a07b", "title": "Putin slow response to the Kursk attack could test the patience of some of his backers in Russia", "date": "2024-08-21 05:15", "url": "https://lasvegassun.com/news/2024/aug/20/putins-slow-response-to-the-kursk-attack-could-tes/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Russia was caught unprepared by the offensive and reportedly is drafting conscripts to repel some of Ukraine's most battle-hardened units.\nPutin has a history of responding slowly to various crises in his tenure, and he has so far played down the attack.\nPutin is dependent on their acquiescence, said Ekaterina Schulmann, a nonresident scholar at the Carnegie Russia Eurasia Center in Berlin.\nDespite promising that conscripts wouldn't be sent to the front, Russia is deploying them to the Kursk region with not enough training, according to a human rights group that helps draftees.\nIt's unclear for now whether the second battle of Kursk, like the first one, will become a turning point in the war that Putin launched."}, {"id": "296872cd-4829-4141-b33f-9a927d7aba7a", "title": "", "date": "2024-08-21 12:00", "url": "https://www.israelnationalnews.com/news/394960", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Israel Hayom reports that reserve soldiers protesting the IDF's plan to ban donated equipment have announced that they intend to leave reserve duty if they cannot continue using donations.\nAccording to the report, the Ground Forces Command has recently issued an instruction that combat units must turn in all donated equipment, and provide an accounting of where all donated equipment was used since the beginning of the war.\nDonations provided all of this within a few days, instead of the many weeks needed for the IDF to do so.\nIf the IDF can't provide for itself, it should tell donors what gear is acceptable, and whatever it is, they will provide.\n\"The IDF is working to ensure that all soldiers receive all the required operational equipment."}, {"id": "517d5305-ad29-4da7-aa68-53ae8b636f59", "title": "Russia seeks to turn humbling incursion into military gains", "date": "2024-08-21 06:00", "url": "https://www.deccanherald.com/world/russia-seeks-to-turn-humbling-incursion-into-military-gains-3158246", "domain": "deccanherald.com", "domain_classification": "Unknown", "message": "Berlin: Two weeks after Ukraine’s surprise incursion into Russia, the Kremlin’s forces have slowed the enemy advance, with the hardening front line in the Kursk region of Russia setting up the next phase of a battle with great political stakes for both sides.\nRussian President Vladimir Putin has pledged a decisive response to the first invasion of Russian territory since World War II.\nBut so far, the response has been focused on containing the incursion rather than reversing it, raising the question of what Russia’s depleted military is willing to risk to expel the invaders — or if it is capable of doing so.\nThe unforeseen invasion of Kursk has exposed the ongoing intelligence failures of the Russian military as well as Russia’s shortage of battle-ready reserves in a war fought along a 750-mile front.\nUkraine’s rapid gains have also upended the global perception of Russia’s slow but unstoppable march toward victory in a war of attrition."}, {"id": "6cf09529-fbd7-4278-bbbe-a968ab67a75c", "title": "The Dune MMO is scheduled to come out in early 2025", "date": "2024-08-21 00:15", "url": "https://www.polygon.com/gamescom/442183/dune-mmo-survival-game-release-date-gamescom-2024", "domain": "polygon.com", "domain_classification": "Unknown", "message": "Developer Funcom released an in-depth look at Dune: Awakening game as part of Gamescom Opening Night Live on Tuesday.\nAs shown in the presentation, you start as a nameless poisoner who must survive the scorching dessert heat and monstrous sand worms.\nJust like with anything Dune, spice is the name of the game.\nIt’s a precious commodity and the key to power in the larger world of the game.\nAs far as warfare goes, it looks like anything from flamethrowers to mischievously summoning sand sand worms is fair game."}, {"id": "d8c7729a-7cf0-455d-9214-df4e8e98f920", "title": "Hypocrisy and the  Tamil Genocide Day  monument - EDITORIAL - Opinion", "date": "2024-08-21 04:30", "url": "https://www.dailymirror.lk/opinion/Hypocrisy-and-the-Tamil-Genocide-Day-monument-EDITORIAL/172-289783", "domain": "dailymirror.lk", "domain_classification": "Unknown", "message": "On Friday 16 August, Foreign Minister Ali Sabry summoned the Canadian Ambassador and protested the laying of the foundation stone for a so-called ‘Tamil Genocide Monument’ at Chinguacousy Park in Brampton Canada.\nSabry reiterated the so-called genocide was based on “malicious disinformation” and lacked validation from any responsible national or international authority.\nOver 200,000 Tamil civilians were held hostage by the LTTE on the tiny strip of land area of approximately 2 - 3 sq miles, as the final battle was being fought.\nDuring the battle, the LTTE too killed several civilians who attempted to break free from its clutches.\nYet Canada has yet to condemn Israeli actions in the Gaza Strip, much less construct a monument against Israeli genocide in Palestine."}, {"id": "fbf0c193-bdd1-4abb-a491-ca2b9f922707", "title": "Putin slow response to the Kursk attack could test the patience of some of his backers in Russia", "date": "2024-08-21 04:45", "url": "https://www.yahoo.com/news/putins-slow-response-kursk-attack-041035733.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Putin's slow response to the Kursk attack could test the patience of some of his backers in RussiaFILE - Russian President Vladimir Putin speaks during an event to mark the 80th anniversary of the Battle of Kursk in World War II at a memorial in the village of Ponyri, near Kursk, Russia, on Aug. 23, 2023.\nRussia was caught unprepared by the offensive and reportedly is drafting conscripts to repel some of Ukraine's most battle-hardened units.\nPutin is dependent on their acquiescence, said Ekaterina Schulmann, a nonresident scholar at the Carnegie Russia Eurasia Center in Berlin.\nDespite promising that conscripts wouldn't be sent to the front, Russia is deploying them to the Kursk region with not enough training, according to a human rights group that helps draftees.\nIt's unclear for now whether the second battle of Kursk, like the first one, will become a turning point in the war that Putin launched."}, {"id": "a067e816-9eed-4a58-9491-6904167f5d0a", "title": "Vladimir Putin slow response to the Kursk attack could test the patience of some of his backers in Russia", "date": "2024-08-21 06:00", "url": "https://economictimes.indiatimes.com/news/defence/vladimir-putins-slow-response-to-the-kursk-attack-could-test-the-patience-of-some-of-his-backers-in-russia/articleshow/112671185.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Addressing a rapt audience that included soldiers fresh from fighting in Ukraine , Putin called the decisive victory in the Battle of Kursk \"one of the great feats of our people.\nThe president and his officials referred to \"the events in the Kursk region\" as a \"situation,\" or \"provocation.\nOn Tuesday he briefly referred to it, promising \"to fight those who commit crimes in the Kursk region.\n\"The longer the Ukrainian offensive goes on, however, the more military and political challenges it presents.Russia appears to be struggling to find suitable forces to repel the Ukrainian assault.\n\"In Sudzha, a Russian town in the Kursk region now controlled by Ukrainian troops, the suffering of residents was clear."}, {"id": "1a5dde39-bf9e-467a-a648-7df5c1bd59ba", "title": "Putin slow response to the Kursk attack could test the patience of some of his backers in Russia", "date": "2024-08-21 08:30", "url": "https://abcnews.go.com/International/wireStory/putins-slow-response-kursk-attack-test-patience-backers-113010869", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Putin's slow response to the Kursk attack could test the patience of some of his backers in RussiaA year ago this week, President Vladmir Putin strode onto a stage in the Kursk region to commemorate the 80th anniversary of one of the Soviet army's proudest moments in World War II.\nRussia was caught unprepared by the offensive and reportedly is drafting conscripts to repel some of Ukraine's most battle-hardened units.\nPutin has a history of responding slowly to various crises in his tenure, and he has so far played down the attack.\nPutin is dependent on their acquiescence, said Ekaterina Schulmann, a nonresident scholar at the Carnegie Russia Eurasia Center in Berlin.\nDespite promising that conscripts wouldn't be sent to the front, Russia is deploying them to the Kursk region with not enough training, according to a human rights group that helps draftees."}, {"id": "034a3aba-6810-4034-bcb0-b81ca95f85b6", "title": "Battle Lines : How does climate change lead to violence ? ", "date": "2024-08-21 09:15", "url": "https://www.aol.co.uk/news/battle-lines-does-climate-change-081244736.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Water from an overflowing Kuskokwim River floods - Bethany Hale/APOn this bonus episode of Battle Lines we talk to Peter Schwartzstein, author of the upcoming book The Heat and the Fury.\nFrom ISIS training grounds in Iraq to the pirate-ridden waters of Bangladesh Peter discovers the unexpected ways in which climate change is feeding global unrest and conflict.\nAcross the world, from Europe to Asia, from the Americas to the Middle East, tensions are rising between nation states as the traditional alliances and alignments evolve in the 21st century.\nThis year sees war in Europe and the Middle East, and elections in major economies, from the US and the UK to Taiwan.\nListen to Battle Lines using the audio player in this article or on Apple Podcasts, Spotify, Amazon Music, or your favourite podcast app."}, {"id": "007a3207-26ce-4594-bee0-4570e43ac7da", "title": "Putin slow response to the Kursk attack could test the patience of some of his backers in Russia", "date": "2024-08-21 06:00", "url": "https://www.news4jax.com/news/world/2024/08/21/putins-slow-response-to-the-kursk-attack-could-test-the-patience-of-some-of-his-backers-in-russia/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Russia was caught unprepared by the offensive and reportedly is drafting conscripts to repel some of Ukraine's most battle-hardened units.\nPutin has a history of responding slowly to various crises in his tenure, and he has so far played down the attack.\nPutin is dependent on their acquiescence, said Ekaterina Schulmann, a nonresident scholar at the Carnegie Russia Eurasia Center in Berlin.\nDespite promising that conscripts wouldn't be sent to the front, Russia is deploying them to the Kursk region with not enough training, according to a human rights group that helps draftees.\nIt's unclear for now whether the second battle of Kursk, like the first one, will become a turning point in the war that Putin launched."}, {"id": "3ea6dce6-0a49-4d80-b063-4465ce2da95d", "title": "WW2 - Frontlines", "date": "2024-08-21 04:15", "url": "https://www.tvguide.co.uk/schedule/2177ecea-bc89-5929-899c-fa9a30975089/ww2-frontlines", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "WW2 - FrontlinesU&Yesterday 10:00 AM to 11:00 AM Wednesday 21 August Share Add toCalendar +Iwo Jima Season 1 Episode 7 of 8 S Subtitles Audio DescriptionA look back at the Battle of Iwo Jima, in which a quarter of all the US Marines who died in the Second World War were killedWW2 - Frontlines airs on U&Yesterday at 10:00 AM, Wednesday 21 August .\n(Subtitles, audio description.)"}, {"id": "7fb7c321-18ca-456b-b444-f5149bf1f65f", "title": "Putin slow response to the Kursk attack could test the patience of some of his backers in Russia", "date": "2024-08-21 05:30", "url": "https://www.clickorlando.com/news/world/2024/08/21/putins-slow-response-to-the-kursk-attack-could-test-the-patience-of-some-of-his-backers-in-russia/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Russia was caught unprepared by the offensive and reportedly is drafting conscripts to repel some of Ukraine's most battle-hardened units.\nPutin has a history of responding slowly to various crises in his tenure, and he has so far played down the attack.\nPutin is dependent on their acquiescence, said Ekaterina Schulmann, a nonresident scholar at the Carnegie Russia Eurasia Center in Berlin.\nDespite promising that conscripts wouldn't be sent to the front, Russia is deploying them to the Kursk region with not enough training, according to a human rights group that helps draftees.\nIt's unclear for now whether the second battle of Kursk, like the first one, will become a turning point in the war that Putin launched."}, {"id": "45fa6482-2a2d-4217-baf3-ccca4a6f8a8f", "title": "PS5 Open World Crimson Desert Unleashes Even More Gameplay , Big Boss Battles Look Crazy", "date": "2024-08-21 12:15", "url": "https://www.pushsquare.com/news/2024/08/ps5-open-world-crimson-desert-unleashes-even-more-gameplay-big-boss-battles-look-crazy", "domain": "pushsquare.com", "domain_classification": "Unknown", "message": "Subscribe to Push Square on YouTube 147kPearl Abyss has really lifted the lid on Crimson Desert at Gamescom 2024, handing us yet more gameplay footage from the upcoming open world action title.\nWe get to gawk at not one, not two, but three boss battles, as protagonist Kliff fights for hits life against a roster of vastly different foes.\nThe second duel involves a humanoid opponent simply named named Staglord.\nSubscribe to Push Square on YouTube 147kAnd then we've got a fight against a slippery customer known as the Reed Devil.\nThe variety on offer here is quite impressive, when you place all three boss encounters side by side."}, {"id": "68042148-f4b5-4230-9c7b-f4f10e1d6883", "title": "Amazon Games and Glowmade Reveal King of Meat at Gamescom 2024", "date": "2024-08-21 01:00", "url": "https://wccftech.com/amazon-games-and-glowmade-reveal-king-of-meat-at-gamescom-2024/", "domain": "wccftech.com", "domain_classification": "Unknown", "message": "This game is being developed by Glowmade and published by Amazon Games, titled King of Meat.\nHigh fantasy meets glitz, glamor, and media infatuation with modern-day celebrity in this wacky game.\nIf it isn't apparent by now, the obsession is the survival game show that you participate in, named King of Meat.\nAt the moment, King of Meat has no planned release date, with the Steam page saying \"coming soon.\"\nIn addition, you can customize your character however you like and choose your outfits, accessories, and emotes to show off your confidence as a contender in King of Meat."}, {"id": "dd0898bb-7902-4be2-ad57-e0d1ea0bd45d", "title": "April Fooled | HISTORY", "date": "2024-08-21 06:00", "url": "https://play.history.com/shows/pawn-stars/season-9/episode-27", "domain": "play.history.com", "domain_classification": "Unknown", "message": "At A+E Networks EMEA you’ll find a team of innovative, creative and collaborative people who embrace change and want to continually try new things.\nWith offices in London, Rome, Madrid, Warsaw, Munich and Johannesburg, we are a truly international company that celebrates difference and diversity.\nWe offer a range of benefits such as a generous pension plan, life assurance and holiday allowance, and there are useful local perks in various offices, and summer Fridays across the whole company.\nBut most of all, we will support you to develop and grow throughout your time with us.\nLearning is part of the journey at A+E Networks EMEA and you’ll be offered personal and professional development opportunities throughout your career with us."}, {"id": "049fabe0-8f96-4c84-b4d1-1a608e6c0b38", "title": "Awakening of the Rebellion 2 . 8 mod for Star Wars : Empire at War : Forces of Corruption", "date": "2024-08-21 02:30", "url": "https://www.moddb.com/mods/awakening-of-the-rebellion-2", "domain": "moddb.com", "domain_classification": "Unknown", "message": "We have redone the speed and turning of all air units, so that they require a lot more room to operate.\nAlong with that aircraft will also miss small ground targets more and their weapons are really only effective at the target they are designed to hit.\nShielded higher-tier air units will require a more dedicated Anti Air counter to take down.\nThanks to a discovery by the Thrawn’s Revenge team, we now know that infantry units in galactic conquest were being tracked individually.\nThe Rebellion also now has its Infiltrator Academy brought back from the base game, and produces units based on the main ground base level."}, {"id": "d4c473d6-0f14-4321-843f-f4937b3381d3", "title": "Last key bridge in Kursk region struck as Ukraine attempts to sever Russia supply lines - 21 - Aug - 2024", "date": "2024-08-21 03:00", "url": "https://home.nzcity.co.nz/news/article.aspx?id=405097", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "As Ukraine's incursion into Russian territory enters its third week, key bridges have been coming under attack.\nAnalysts say these were part of critical supply lines for Russian troops defending the area.\nAccording to the Ukrainian Air Force, Russian military bloggers and officials, they have all come under attack.\nWhat Ukraine is trying to achieveAnalysts say it appears Ukraine is attempting to isolate the stretch of Kursk territory which lies just west of the invasion zone.\nBy targeting the bridges, Ukraine was cutting off logistical supplies to Russian forces deployed in Donetsk Oblast in eastern Ukraine."}, {"id": "76c46a39-1d22-4516-a048-1cdc4cf1adeb", "title": "Sniper Elite : Resistance announced", "date": "2024-08-21 02:00", "url": "https://nichegamer.com/sniper-elite-resistance-announced/", "domain": "nichegamer.com", "domain_classification": "Unknown", "message": "Rebellion Developments has announced Sniper Elite: Resistance, the latest entry in their popular Sniper franchise.\nSniper Elite: Resistance is launching sometime in 2025 for Windows PC (via Steam and the Epic Games Store), Xbox One, Xbox Series X|S, PS4, PS5, and Xbox Game Pass.\nHere’s a rundown on the new game, plus a trailer:Sniper Elite: Resistance tells a gripping new standalone story that runs in parallel with Sniper Elite 5.\nOffering the unparalleled sniping mechanics, stealth and tactical third-person combat you would expect from the franchise, Sniper Elite: Resistance turns the attention towards the hidden war, far from the front lines, deep within the heart of occupied France.\nLocate a unique Propaganda poster in each of the main campaign’s levels to unlock a Propaganda Mission where you become a Resistance Fighter."}, {"id": "db6f2947-9abc-405c-8f4d-4ccf65d642ca", "title": "Russian Defence Ministry report on repelling an invasion attempt of the AFU on the territory of the Russian Federation ( 20 August 2024 ) ", "date": "2024-08-21 08:30", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/08/ukraine-240820-russia-mod02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Russian Defence Ministry report on repelling an invasion attempt of the AFU on the territory of the Russian Federation (20 August 2024)20.08.2024The Armed Forces of the Russian Federation continue to repel the AFU attempt to invade the territory of the Russian Federation.\nThe AFU losses amounted to more than 60 troops killed and wounded, two tanks, eight armoured fighting vehicles, and six motor vehicles.\nThe Armed Forces of the Russian Federation continue reconnaissance and search operations to locate and eliminate the enemy's small sabotage and reconnaissance groups in forest belts attempting to get to the depth of the Russian territory.\nThe operation to neutralise the AFU units is in progress.\nDepartment for Media Affairs and InformationNEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "f42b2cf7-f0d3-4a66-8f56-b1410c4ad92d", "title": "PM Modi Poland trip : Will it help in boosting ties between the two nations ? – Firstpost", "date": "2024-08-21 04:15", "url": "https://www.firstpost.com/explainers/pm-narendra-modi-poland-trip-new-delhi-warsaw-ties-ukraine-war-13806539.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "India and Poland maintained bilateral ties but it missed the strategic depth as before in 1979.\nDespite a dip in ties, Poland is India’s largest trading and investment partner in Central and Eastern Europe.\nAdvertisementModi’s visit to PolandModi is the first Indian PM to visit Poland after Morarji Desai in 1979.\nNew Delhi’s similar move was “reflective of the desire to expand two-way defence ties”, PTI reported citing unnamed sources.\nHowever, it is hoped that PM Modi’s push will give it the required push and take bilateral ties to a higher level,” a source told ThePrint."}, {"id": "7c26b0af-68df-4ace-a164-6e96bef34238", "title": "Putin slow response to Kursk attack could test patience of his Russian backers", "date": "2024-08-21 11:15", "url": "https://www.naharnet.com:443/stories/en/307404-putin-s-slow-response-to-kursk-attack-could-test-patience-of-his-russian-backers", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "The president and his officials referred to \"the events in the Kursk region\" as a \"situation,\" or \"provocation.\"\nThe question they are asking themselves about Putin, Schulmann said, \"is whether the old man is still an asset or already a liability.\"\nOn Tuesday he briefly referred to it, promising \"to fight those who commit crimes in the Kursk region.\"\nThe longer the Ukrainian offensive goes on, however, the more military and political challenges it presents.\nIn Sudzha, a Russian town in the Kursk region now controlled by Ukrainian troops, the suffering of residents was clear."}, {"id": "123ff152-aca1-48b3-883f-871f0a70a714", "title": "Putin slow response to Kursk attack could test patience of his Russian backers", "date": "2024-08-21 12:00", "url": "https://www.naharnet.com/stories/en/307404-putin-s-slow-response-to-kursk-attack-could-test-patience-of-his-russian-backers", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "The president and his officials referred to \"the events in the Kursk region\" as a \"situation,\" or \"provocation.\"\nThe question they are asking themselves about Putin, Schulmann said, \"is whether the old man is still an asset or already a liability.\"\nOn Tuesday he briefly referred to it, promising \"to fight those who commit crimes in the Kursk region.\"\nThe longer the Ukrainian offensive goes on, however, the more military and political challenges it presents.\nIn Sudzha, a Russian town in the Kursk region now controlled by Ukrainian troops, the suffering of residents was clear."}, {"id": "8e1c6636-deee-4f57-92bc-5a7d50e284e8", "title": "Military Load Carriage Systems Strategic Research Report", "date": "2024-08-21 10:00", "url": "https://www.globenewswire.com/news-release/2024/08/21/2933329/0/en/Military-Load-Carriage-Systems-Strategic-Research-Report-2023-2030-Expansion-of-Special-Forces-Operations-Enhanced-Soldier-Mobility-and-Enhanced-Focus-on-Modularity-and-Adaptabilit.html", "domain": "globenewswire.com", "domain_classification": "Unknown", "message": "Dublin, Aug. 21, 2024 (GLOBE NEWSWIRE) -- The \"Military Load Carriage Systems - Global Strategic Business Report\" report has been added to ResearchAndMarkets.com's offering.\nThe growth in the military load carriage systems market is driven by several factors, including technological advancements, changing warfare tactics, and increased defense spending.\nThese factors collectively ensure a robust and expanding market for military load carriage systems, meeting the evolving needs of modern armed forces.\nThe Backpack Load Carriage Systems segment is also set to grow at 1.9% CAGR over the analysis period.\nKey Questions Answered:How is the Global Military Load Carriage Systems Market expected to evolve by 2030?"}, {"id": "66ab6c26-bb8c-4c6e-8e90-c506f0a1fb19", "title": "Defense Budget Talks Reignite Debate Over Military Draft for Women", "date": "2024-08-21 02:00", "url": "https://www.theepochtimes.com/article/defense-budget-talks-reignite-debate-over-military-draft-for-women-5706526", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "The $910 billion bill would require women to be drafted into service, but has limitations on which combat roles they could join.\nScott Olson/Getty ImagesThe $910 billion bill would require women to be drafted into service, but has limitations on which combat roles they could join.\nBut given time-tested differences between the sexes’ physical aptitudes, this is all but certain to require adjusting physical standards, they say.\nJunger said that adding women not subject to the same physical requirements could lead to many more complaints and harm unit morale and cohesion.\n“Military service generally requires strenuous activity and austere living conditions, which men are generally more capable of tolerating than women."}, {"id": "d0999181-6f86-474b-ab20-65bd538e3b04", "title": "IDF reservists neglected after serving since October 7 - opinion", "date": "2024-08-21 12:00", "url": "https://www.jpost.com/israel-hamas-war/article-815680", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Reservist combat soldiers are collapsing in their personal and professional lives after more than two hundred days of Miluim (reserve duty).\nMuch of the aid provided by the government to reservists does not differentiate between reservists who served 30 days and those who served 300 days.\nChanges must be made to assist reservists depending on the number of days served.\nSimilarly, it does not differentiate between reservists who served 60 days and those who have given much more.\nThe incentives put forth months ago must be expanded and consistent with the number of days served."}, {"id": "2019b723-ebab-4306-8c70-4c7d9405fcb7", "title": "Chainsaw Man Chapter 176 Delayed Due To A One - Week Break ; Find Out The Release Date And More Here", "date": "2024-08-21 11:45", "url": "https://www.pinkvilla.com/entertainment/anime/chainsaw-man-chapter-176-delayed-due-to-a-one-week-break-find-out-the-release-date-and-more-here-1341302", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "With much still left unresolved, fans can look forward to Chainsaw Man Chapter 176 to reveal what happens next.\nChainsaw Man Chapter 176: Release date and where to readChainsaw Man Chapter 175 is scheduled to release on Wednesday, September 4, 2024, at 12:00 am JST.\nTo read Chainsaw Man Chapter 172, fans can turn to Shueisha's official platforms, including MANGAPlus, Viz Media, and the Shonen Jump+ mobile application.\nAdvertisementExpected plot in Chainsaw Man Chapter 176With Chapter 175 ending on a panel where the border transitions from white to black, it is highly likely that Chainsaw Man Chapter 176 will feature a flashback.\nChainsaw Man Chapter 175 recapTitled Both Hands, Chainsaw Man Chapter 175 begins with a civilian spotting Pochita in an alley."}, {"id": "0f42c22a-b199-44fb-a3ca-e5b4fbd916b3", "title": "Indian Aviation : MiG - 25 Foxbat in the Indian Air Force", "date": "2024-08-21 08:15", "url": "https://www.team-bhp.com/forum/commercial-vehicles/164969-indian-aviation-mig-25-foxbat-indian-air-force-7.html", "domain": "team-bhp.com", "domain_classification": "Unknown", "message": "Foxbat BHPianJoin Date: May 2009 Location: NYC / Lucknow Posts: 649 Thanked: 3,680 TimesRe: Indian Aviation: MiG-25 Foxbat in the Indian Air Force Quote: V.Narayan Originally Posted by The only comparable is the SR-71 designed for a different singular role of high altitude Mach 3.0 recce.\nIt was found that the plane was in obvious distress and a decision was made that the Swedish Air Force would escort the plane out of the Baltic Sea.\nA MiG-25 had locked a missile on the damaged SR-71, but as the aircraft was under escort, no missiles were fired.\nIt was found that the plane was in obvious distress and a decision was made that the Swedish Air Force would escort the plane out of the Baltic Sea.\nA MiG-25 had locked a missile on the damaged SR-71, but as the aircraft was under escort, no missiles were fired."}, {"id": "6ee31bff-fb36-43fc-8f03-2b6b822974f2", "title": "Hands - on Preview : Sid Meier Civilization VII", "date": "2024-08-21 01:45", "url": "https://www.destructoid.com/hands-on-preview-sid-meiers-civilization-vii/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "And my roughly three hours of hands-on playtime with Civilization 7 only furthered that sentiment.\nHe kicked off our hands-on preview by telling us about the vision for Civilization 7.\nInstead of just making “another Civilization” game, the team instead chose a new element of focus: History Comes in Layers.\nA full campaign in Civilization 7 will expand across these three ages, allowing the player to change their Civilization at the start of each new wave.\nSid Meier’s Civilization VII is set to release on February 11, 2025 on PC, Xbox One, Xbox Series X|S, PlayStation 4, PlayStation 5, and Nintendo Switch."}, {"id": "1b511d59-0fe8-415d-8f3d-b8d8fd1039d5", "title": "Philippine military steps up security , loyalty protocols to prevent data leaks", "date": "2024-08-21 00:30", "url": "https://www.scmp.com/week-asia/politics/article/3275230/philippine-military-steps-security-loyalty-protocols-prevent-data-leak-adversaries", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "The Philippine military is strengthening its security measures and personnel loyalty protocols to prevent the leak of sensitive information to adversaries following the recent guilty plea of a US intelligence officer for selling classified data.\nA video screen grab shows US Army Sergeant Korbein Schultz during an interview at Fort McCoy, Wisconsin, in August 2021.\nOnce approved, the agreement will create new protocols for both countries to safeguard top-secret military information and early detection systems for potential threats in the West Philippine Sea.\n“To prevent this, the [Armed Forces of the Philippines] must strengthen all aspects of personnel management, ranging from education, doctrine, leadership, and training.\nNational Security Council Assistant Director General Jonathan Malaya on Monday confirmed some members of China’s Ministry of State Security were operating in the country."}, {"id": "72c05449-5c1c-46ac-924a-153483f8b141", "title": "IDF Recovers 6 Deceased Hostages In Gaza Rescue Mission", "date": "2024-08-21 03:15", "url": "https://www.oann.com/newsroom/idf-recovers-6-deceased-hostages-in-gaza-rescue-mission/", "domain": "oann.com", "domain_classification": "Unknown", "message": "(Photo by JACK GUEZ/AFP via Getty Images)OAN Staff Blake Wolf4:04 PM – Tuesday, August 20, 2024The Israel Defense Forces (IDF) has recovered six deceased Israeli hostages in a southern Gaza rescue operation on Monday.\nAdvertisement“Overnight our forces returned the bodies of six of our hostages that had been held by the murderous Hamas terrorist organization,” said Israeli Prime Minister Benjamin Netanyahu.\n“I would like to thank the brave IDF and ISA fighters and commanders for their heroism and determined action.\n“This was a complex rescue operation that was conducted both above and below ground.\n“The immediate return of the remaining 109 hostages can only be achieved through a negotiated deal."}, {"id": "2cb43a90-4eb9-410e-8a5b-49c10329ddde", "title": "Military  silent hangar  to help protect against foreign GPS jamming", "date": "2024-08-21 11:15", "url": "https://www.marketscreener.com/quote/stock/QINETIQ-GROUP-PLC-9590216/news/Military-silent-hangar-to-help-protect-against-foreign-GPS-jamming-47701503/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "A new test facility, one of the largest in Europe , will help military kit to be better protected from attempts to jam GPS devices.\nDue to open in 2026, the anechoic hangar creates the perfect environment to test the integrity of the UK's military equipment.\nMinister for Defence Procurement and Industry, Maria Eagle , said:Hostile threats jamming GPS to disorientate military equipment has become increasingly common.\nThis cutting-edge test facility will help us eliminate vulnerabilities from our platforms, protect our national security and keep our Armed Forces better protected on global deployments.\nWill Blamey , Chief Executive, UK Defence, QinetiQ , said:On an increasingly digital battlefield, the debilitating effects of electronic warfare are a persistent threat."}, {"id": "ab7fdd01-dd76-48ba-8cd4-3fb0e01d0359", "title": "Israeli strikes kill dozens in Gaza after Blinken ends visit with truce deal still elusive", "date": "2024-08-21 14:15", "url": "https://www.aol.com/israeli-strikes-kill-dozens-gaza-122428150.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "As last-ditch diplomacy continued to halt the 10-month-old war between Israel and Hamas, the Israeli military said jets hit around 30 targets throughout the Gaza Strip including tunnels, launch sites and an observation post.\nIt said troops killed dozens of armed fighters and seized weapons including explosives, grenades and automatic rifles.\nLater in the day, the Israeli military struck a school and a nearby house in Gaza City, killing at least three people and wounding 15, the territory's Civil Emergency Service said.\nIn the town of Bani Suhaila near Khan Younis in the southern Gaza Strip, an Israeli airstrike killed seven Palestinians at a tent encampment for displaced people, medics said.\nThe conflict churned on as Blinken wound up his ninth troubleshooting visit to the Middle East since the Gaza war erupted last October with still no sign that deep differences between the sides over how to end the war could be reconciled."}, {"id": "9b480359-8dd1-45e3-b81a-a9e117c15e9b", "title": "Aer Lingus launch new flight service from Glasgow to Irish city", "date": "2024-08-21 11:00", "url": "https://www.heraldscotland.com/news/24532421.aer-lingus-launch-new-flight-service-glasgow-irish-city/", "domain": "heraldscotland.com", "domain_classification": "Unknown", "message": "Emerald Airlines, the operator of Aer Lingus Regional, will run the flights which will start in October and offer visitors to Ireland a new area to visit outside the capital.\nCork is home to some of Ireland’s most picturesque countryside and coastal landscapes as well as the famous Blarney Stone.\nThe flights will start on October 27 and fares start at £39.99, running every Monday, Thursday, Friday and Sunday with flights to and from the city.\nRead More:Commenting on the announcement, Ian Lough, Head of Commercial at Emerald Airlines said: “We're delighted to extend our network from Glasgow Airport with the introduction of our new Cork service.\n“With over 30,000 seats available, we are confident this service will be a great success, benefiting both leisure and business travellers."}, {"id": "15ff5bd4-cf54-4fe6-8616-de5a67caa155", "title": "Why Warhammer 40 , 000 : Space Marine 2 Is Shaping Up To Be one of the Biggest Games of the Year", "date": "2024-08-21 14:15", "url": "https://gamingbolt.com/why-warhammer-40000-space-marine-2-is-shaping-up-to-be-one-of-the-biggest-games-of-the-year", "domain": "gamingbolt.com", "domain_classification": "Unknown", "message": "Unlike Space Marine 1’s afterthought of a co-op mode, Space Marine 2 goes all out with its many co-op offerings.\nSpace Marine 2 has six classes to select from, and each has separate leveling progressions.\nIn addition to the Operations co-op mode, all of your class progression is accessible for the game’s 6v6 competitive multiplayer modes as well.\nUnlike Space Marine 1, you can’t get by simply hacking and slashing through these mobs; you must dodge or parry them to survive, making Space Marine 2 a bit more challenging.\nSpace Marine 2 has some of the highest production values that a Warhammer 40K piece of media has received."}, {"id": "da666d66-6e57-4a34-be0e-01c80bc5b911", "title": "Air Force Floats Light Stealth Fighter Concept As Its Heavy Fighter Program May Be In Jeopardy", "date": "2024-08-21 00:30", "url": "https://www.yahoo.com/news/air-force-floats-light-stealth-232150746.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The light fighter concept is shown during a presentation by Chief of Staff of the Air Force, Gen. David W. Allvin, at the Global Air and Space Chiefs Conference, held in London.\nPerhaps the most interesting aspect of the notional light fighter concept, however, is the timing of its appearance.\nOn the other hand, there have also been suggestions that the Air Force should consider procuring an entirely different future fighter.\nBrown Jr., when he was Pacific Air Forces commander, disembarks an F-16 at Kunsan Air Base, South Korea, in October 2019.\nThis further raises the question of whether a program as ambitious as a new light crewed fighter is even viable, regardless of the final unit cost and how that compares with the NGAD crewed fighter."}, {"id": "9c7a5353-7c6f-49e2-9edb-2bc0a1fadc95", "title": "Augustana names new assistant VP of marketing", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/augustana-names-assistant-vp-marketing-211048873.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Augustana College has a new assistant vice president.\nThe college announced that Irene Karedis Borys will be the assistant vice president of marketing and brand communication.\nBorys was vice president of client experience and integrator for The Childress Agency and started at Augustana on August 19.\nIrene Karedis Borys (Augustana College)Borys will lead the college’s Office of Communication and Marketing, a team of 12 staff members who work in enrollment marketing, brand strategy, campus and alumni communications, media engagement and event management.\nBorys will oversee the planning, development and execution of the college’s marketing and brand initiatives as assistant vice president, with primary responsibility to shape the college’s brand and promotion strategy."}, {"id": "16e622ee-89b5-4bf4-ae92-be8545ae6033", "title": "A Marine Silver Star brings closure and hope to this once - dishonored battalion", "date": "2024-08-21 07:00", "url": "https://www.marinecorpstimes.com/news/your-marine-corps/2016/03/19/a-marine-s-silver-star-brings-closure-and-hope-to-this-once-dishonored-battalion/", "domain": "marinecorpstimes.com", "domain_classification": "Unknown", "message": "Retired marine sergeant Matt Parker received the Silver Star at Camp Lejeune, N.C. March 18, 2016.\nParker’s Silver Star brings to a close a dark, frustrating period for many who served in the 1,000-man battalion .\nSome of the Marine Corps' most senior leaders, including the commandant at the time, were investigated for mishandling the cases.\nAs he prepared to speak at Parker's Silver Star ceremony, Dixon said the moment would have even deeper meaning for battalion.\nHis wife, Raechel, said that Parker's Silver Star gives her hope that other deserving Marines from 3/2 will be recognized, too ."}, {"id": "a0d0e9eb-5182-43e6-aedd-0512eabaf41a", "title": "Poking the bear - Newspaper", "date": "2024-08-21 04:30", "url": "https://www.dawn.com/news/1853706/poking-the-bear", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "Fast forward to 2024, and none of the officially tolerated press or TV outlets can be expected to seriously fault the authorities for this month’s swift foray into Russian territory by Ukrainian troops.\nThe region’s name should also resonate with anyone familiar with the key events of World War II.\nBut whatever the follies and fallacies of Moscow and Kyiv, this is not World War II, and it’s crucial to all humanity that it does not turn into World War III.\nHowever, the consequences of the Ukrainian advance into Russian territory remain unclear, and the messaging from Kyiv about its motivation has been somewhat muddled.\nMight that work, or will Putin’s instinct be to exact revenge, for which Ukrainian civilians may pay the biggest price?"}, {"id": "6cbdde73-1903-4594-9888-d906212b05a8", "title": "Russia says major Ukraine drone attack targeting Moscow thwarted by air defenses as Kursk incursion continues", "date": "2024-08-21 10:45", "url": "https://www.cbsnews.com/news/russia-ukraine-war-drone-attack-moscow-kursk-incursion-latest/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "Russia downed 45 Ukrainian drones overnight, the Ministry of Defense said.\nIt said 11 were destroyed over the Moscow region, 23 over the Bryansk region, six over Belgorod, three over Kaluga and two over Kursk, where Ukrainian forces have mounted an unprecedented incursion in recent weeks.\n\"This was one of the biggest attempts of all time to attack Moscow using drones,\" Moscow Mayor Sergey Sobyanin said on his Telegram channel.\nDrone attack on Moscow comes amid Ukraine's Kursk incursionThe drone attacks come as Ukrainian forces are continuing to push into Russia's western Kursk region.\nThe incursion has opened up another front in a war that already has Ukrainian forces badly stretched."}, {"id": "14526f78-dd46-405f-9068-d9174d1eeb22", "title": "Pakistan committed to terror fight : Zardari", "date": "2024-08-21 05:30", "url": "https://tribune.com.pk/story/2489725/pakistan-committed-to-terror-fight-zardari", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "President Asif Ali Zardari paid homage on Tuesday to all those who have fallen victim to terrorism in Pakistan, including civilians, security forces, and law enforcement personnel.\nReflecting on Pakistan's two-decade-long battle against terrorism, President Zardari noted the heavy toll it has taken on the nation.\nDespite these challenges, President Zardari praised the resilience and determination of the Pakistani people.\nHe stated that Pakistan remains the only country in the world to have successfully contained terrorist forces and has been fighting this war for over twenty years.\nThe nation's efforts have gained global recognition, and Pakistan remains committed to contributing to international counter-terrorism initiatives."}, {"id": "a31b3ae2-82a1-4d4c-923b-d0b45769acee", "title": "Launch YC : Ares Industries - Building low - cost cruise missiles ðŸš€", "date": "2024-08-21 04:00", "url": "https://www.ycombinator.com/launches/Ler-ares-industries-building-low-cost-cruise-missiles", "domain": "ycombinator.com", "domain_classification": "Unknown", "message": "Hello, we’re Alex and Devan, and we’re building the low-cost cruise missiles the United States needs!\nWhat we’re buildingAres is building a new class of anti-ship cruise missiles.\nExisting anti-ship cruise missiles are low-volume, multi-million dollar, 3,000 lb behemoths meant to take out large cruisers and destroyers.\nBut Chinese shipbuilding capability is far superior to ours, and we can’t make enough anti-ship missiles to counter.\nWe believe our vision for anti-ship cruise missiles can help fill the munitions gap that the US faces."}, {"id": "78780e98-2d5b-4880-8bba-b801f0c7315d", "title": "Putin makes surprise visit to Chechnya for first time in 13 years", "date": "2024-08-21 05:30", "url": "https://www.yahoo.com/news/putin-makes-surprise-visit-chechnya-043714361.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Putin makes surprise visit to Chechnya for first time in 13 yearsRussian President Vladimir Putin made a surprise visit to the Chechen Republic on Aug. 21 to inspect Chechen troops readying to deploy to Ukraine's front line - marking his first visit to the region in 13 years.\nPutin's visit to the majority Muslim republic comes as Ukraine continues its unprecedented incursion into Kursk Oblast - with Moscow reportedly deploying troops into the region.\n\"As long as we have men like you, we are absolutely, absolutely invincible,\" Putin reportedly told troops in Chechnya, according to Russian state media.\nAt the beginning of Moscow's full-scale invasion of Ukraine, Russian President Vladimir Putin claimed that Russian conscripts will not be involved in the combat.\nMothers of conscripts called on Putin to withdraw them from Kursk Oblast, the Moscow Times wrote on Aug. 12."}, {"id": "a7e2b86a-4730-42b1-b996-2e0da222297d", "title": "Armor : Hungary Updates Its Tank Force", "date": "2024-08-21 10:00", "url": "http://www.strategypage.com/htmw/htarm/articles/2024082134627.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "August 21, 2024: Hungary is replacing its Cold War era force of 164 T-72 tanks with 38 Leopard 2 tanks.\nNATO has no guidelines for how many tanks each member must maintain but the total number of tanks maintained by all member nations is 4.600.\nHungary is the latest NATO member to adopt the Leopard 2 and is receiving a small number of them because other nation members already maintain large tank forces.\nCurrently Russia is bringing 60 year old T-64 tanks out of storage to replace all the modern tanks lost.\nThese systems, many operated by civilian volunteers in early 2022, destroyed or disabled thousands of Russian tanks."}, {"id": "786adc32-3f6b-4c68-805d-98cf6a5ff6a6", "title": "Attrition : Less Population Means More Automation", "date": "2024-08-21 10:00", "url": "http://www.strategypage.com/%5Chtmw%5Chtatrit%5Carticles%5C2024082001754.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "This means industrialized nations will not be able to recruit as many soldiers in an emergency as they were earlier.\nIt is no secret that the Ukraine War is the primary obstacle to reversing the declining birth rate.\nThe birth rate cannot be changed with threats of punishment and penalties for those who do not comply.\nThe departures are substantial and continually reduce the population and percentage of the population that is Russian.\nThis is worse because the ethnic Russians have a much lower birth rate than the new arrivals."}, {"id": "e3864855-766f-4d49-9f29-e4834989c128", "title": "Russia loses 1 , 210 soldiers and 60 artillery systems in one day", "date": "2024-08-21 05:30", "url": "https://www.yahoo.com/news/russia-loses-1-210-soldiers-043811041.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia loses 1,210 soldiers and 60 artillery systems in one dayUkrainian soldiers.\nStock photo: General Staff of the Armed Forces of UKraine on FacebookRussia has lost 1,210 soldiers killed and wounded, 4 tanks, 21 armoured combat vehicles and 60 artillery systems over the past day.\n]:approximately 603,010 (+1,210) military personnel;8,522 (+4) tanks;16,542 (+21) armoured combat vehicles;17,216 (+60) artillery systems;1,166 (+0) multiple-launch rocket systems;928 (+2) air defence systems;367 (+0) fixed-wing aircraft;328 (+0) helicopters;13,902 (+38) strategic and tactical UAVs;2,442 (+4) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;23,221 (+79) vehicles and tankers;2,887 (+2) special vehicles and other equipment.\nThe information is being confirmed.\nSupport UP or become our patron!"}, {"id": "0594045a-0d81-49e6-a428-165a73832dd7", "title": "Russian soldier defects to Ukraine after spying for resistance group for months", "date": "2024-08-21 01:30", "url": "https://krdo.com/news/2024/08/20/russian-soldier-defects-to-ukraine-after-spying-for-resistance-group-for-months/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "By Eve Brennan, Olga Voitovych, Anna Chernova and Kostyantyn Hak, CNN(CNN) — A Russian soldier has defected to Ukraine, according to the Freedom for Russia Legion, the “I Want to Live Project,” and the Defense Intelligence of Ukraine.\n),” the Freedom for Russia Legion said.\nEscaping the Storm unit, Silver “activated explosive devices” in the unit’s headquarters, seriously injuring the commander and several senior officers, according to the legion.\nCNN is unable to verify this claim but has reached out to the Russian Ministry of Defense for comment.\nThe Defense Intelligence said Ukraine was able to obtain valuable intelligence on the location, number, and intentions of Russian forces “in a particular frontline area” because of the interaction with Silver."}, {"id": "1903f9bd-d0cc-4129-870b-467a4edcadf5", "title": "Moscow comes under one of largest Ukrainian drone attacks but destroys them all", "date": "2024-08-21 12:00", "url": "https://www.bournemouthecho.co.uk/news/national/24531810.moscow-comes-one-largest-ukrainian-drone-attacks-destroys/", "domain": "bournemouthecho.co.uk", "domain_classification": "Unknown", "message": "Russia downed 45 Ukrainian drones overnight, the Ministry of Defence said.\nThe drone attacks come as Ukrainian forces are continuing to push into Russia’s western Kursk region.\nIt has also opened up another front in a fight where Ukrainian forces were already badly stretched.\nUkraine’s attacks on three bridges over the Seim River in Kursk, in areas it does not control, could potentially trap Russian forces between the river, the Ukrainian advance and the Ukrainian border.\nUkrainian forces appear to be striking Russian pontoon bridges and pontoon engineering equipment over the Seim in an area west of the Ukrainian advance point, the Washington think tank said."}, {"id": "493aa604-fbcc-4a32-9fd7-3bdb82f52c6e", "title": "Tim Walz Said His Kids Were  Born Through  IVF . That Not True . ", "date": "2024-08-21 00:30", "url": "https://freebeacon.com/elections/tim-walz-said-his-kids-were-born-through-ivf-thats-not-true/", "domain": "freebeacon.com", "domain_classification": "Unknown", "message": "Democratic vice presidential nominee Tim Walz, already under fire for embellishing his military service, misrepresented the fertility treatments his wife received to have children.\nVance], I wouldn’t have a family because of IVF,\" Walz said in a video posted by the Kamala Harris campaign on Aug. 9.\nGwen Walz detailed the fertility treatment in a statement to CNN, and the Harris campaign defended Walz’s inconsistent statements on the issue.\nHe was using commonly understood shorthand for fertility treatments,\" said Harris campaign spokeswoman Mia Ehrenberg.\n\"For Tim Walz, the IVF Political Battles are Personal,\" reads a Time headline, and the website Motherly posted a story headlined \"Tim Walz's Personal IVF Story Made Me Feel Seen.\""}, {"id": "0d6fceb1-6e1e-4d35-9742-9c1d5d74739a", "title": "Chuck Douglas : All we have is weird", "date": "2024-08-21 05:15", "url": "https://www.unionleader.com/opinion/op-eds/chuck-douglas-all-we-have-is-weird/article_70bbfd0a-5f30-11ef-875e-7f6d87756185.html", "domain": "unionleader.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "b7c439bf-2de2-4c71-94a5-320c446357e7", "title": "Moscow comes under one of largest Ukrainian drone attacks but destroys them all", "date": "2024-08-21 11:45", "url": "https://www.echo-news.co.uk/news/national/24531810.moscow-comes-one-largest-ukrainian-drone-attacks-destroys/", "domain": "echo-news.co.uk", "domain_classification": "Unknown", "message": "Russia downed 45 Ukrainian drones overnight, the Ministry of Defence said.\nThe drone attacks come as Ukrainian forces are continuing to push into Russia’s western Kursk region.\nIt has also opened up another front in a fight where Ukrainian forces were already badly stretched.\nUkraine’s attacks on three bridges over the Seim River in Kursk, in areas it does not control, could potentially trap Russian forces between the river, the Ukrainian advance and the Ukrainian border.\nUkrainian forces appear to be striking Russian pontoon bridges and pontoon engineering equipment over the Seim in an area west of the Ukrainian advance point, the Washington think tank said."}, {"id": "069a3556-e0cc-4a8d-8832-5adf80bb0474", "title": "Moscow comes under one of largest Ukrainian drone attacks but destroys them all", "date": "2024-08-21 10:30", "url": "https://www.lancashiretelegraph.co.uk/news/national/24531810.moscow-comes-one-largest-ukrainian-drone-attacks-destroys/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "Russia downed 45 Ukrainian drones overnight, the Ministry of Defence said.\nThe drone attacks come as Ukrainian forces are continuing to push into Russia’s western Kursk region.\nIt has also opened up another front in a fight where Ukrainian forces were already badly stretched.\nUkraine’s attacks on three bridges over the Seim River in Kursk, in areas it does not control, could potentially trap Russian forces between the river, the Ukrainian advance and the Ukrainian border.\nUkrainian forces appear to be striking Russian pontoon bridges and pontoon engineering equipment over the Seim in an area west of the Ukrainian advance point, the Washington think tank said."}, {"id": "a697f888-4409-417a-83fa-eca2c2d0dc3a", "title": "Israel Waits on the Edge of War | The Jewish Press - JewishPress . com | Vic Rosenthal | 17 Av 5784 – Wednesday , August 21 , 2024", "date": "2024-08-21 02:30", "url": "https://www.jewishpress.com/blogs/abu-yehuda/israel-waits-on-the-edge-of-war/2024/08/21/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "At the same time, the Biden-Harris administration is trying to force Israel to accept a cease-fire agreement with Hamas.\nPressure on Israel is multifaceted, including both carrots and sticks.\nThe sticks include slowdowns in delivery of promised munitions and threats to abandon Israel in the event that the war blows up into a major regional conflict.\nAt this point, the US has warned the Iranian regime against carrying out its planned revenge attack against Israel or allowing its various proxies, especially Hezbollah, from doing anything that might cause Israel to abandon the negotiations for a cease-fire deal.\nIt is in their interest to avoid a confrontation with Israel now, before their nuclear umbrella unfolds, and while Israel is at peak readiness."}, {"id": "51f087af-d9f4-4ae1-af0f-d633b5f8b006", "title": "Moscow sees one of Ukraine largest drone attacks as fighting rages in Kursk and eastern Ukraine", "date": "2024-08-21 10:45", "url": "https://www.ksat.com/news/world/2024/08/21/moscow-comes-under-largest-ukrainian-drone-attack-yet-but-destroys-them-all-russian-authorities-say/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "The drone attacks come as Ukrainian forces are continuing to push into Russia’s western Kursk region.\nRussia said it downed 45 Ukrainian drones overnight, including 11 over the Moscow region.\nMaria Zakharova, spokeswoman for the Russian Foreign Ministry, said Ukraine’s attack on Kursk has ended “any possibility” of peace negotiations.\nUkraine’s Interior Minister Ihor Klymenko said Kyiv established an office in the Kursk region to provide humanitarian and medical aid to the local population.\nUkraine’s attacks on three bridges over the Seym River in Kursk could potentially trap Russian forces between the river, the Ukrainian advance and the Ukrainian border."}, {"id": "30fa560d-70cc-4cd1-944b-152629e1eecc", "title": "Biden Secretly Orders Preparations for Nuclear War", "date": "2024-08-21 13:45", "url": "https://hotair.com/jazz-shaw/2024/08/21/biden-secretly-orders-preparations-for-nuclear-war-n3793447", "domain": "hotair.com", "domain_classification": "Unknown", "message": "The NY Post is reporting that Biden secretly ordered a shift in America's nuclear weapons strategy back then.\nThe classified plan ordered a shift in our strategy to focus on China as a nuclear threat.\nThe program is called the \"Nuclear Employment Guidance\" and it was first reported this week by the New York Times.\nThe new strategy is called the “Nuclear Employment Guidance” and also readies the US for a possible coordinated threat between China, Russia and North Korea, the newspaper reported.\nAfter all, our nuclear strategy and preparations are among the most classified bits of intelligence in America's national security realm."}, {"id": "6d68aa59-82d9-40fc-ba80-eef1fa6c15e4", "title": "Moscow comes under one of the largest Ukrainian drone attacks but destroys them all", "date": "2024-08-21 10:00", "url": "https://www.local10.com/news/world/2024/08/21/moscow-comes-under-largest-ukrainian-drone-attack-yet-but-destroys-them-all-russian-authorities-say/", "domain": "local10.com", "domain_classification": "Unknown", "message": "The drone attacks come as Ukrainian forces are continuing to push into Russia’s western Kursk region.\nRussia said it downed 45 Ukrainian drones overnight, including 11 over the Moscow region.\nMaria Zakharova, spokeswoman for the Russian Foreign Ministry, said Ukraine’s attack on Kursk has ended “any possibility” of peace negotiations.\nUkraine’s Interior Minister Ihor Klymenko said Kyiv established an office in the Kursk region to provide humanitarian and medical aid to the local population.\nUkraine’s attacks on three bridges over the Seym River in Kursk could potentially trap Russian forces between the river, the Ukrainian advance and the Ukrainian border."}, {"id": "6d60a950-c259-4934-845b-c0340e35a3d5", "title": "The new Nacon Revolution X Unlimited Xbox controller features a nifty LCD screen - and it coming later this year", "date": "2024-08-21 11:45", "url": "https://www.techradar.com/gaming/the-new-nacon-revolution-x-unlimited-xbox-controller-features-a-nifty-lcd-screen-and-its-coming-later-this-year", "domain": "techradar.com", "domain_classification": "Unknown", "message": "Nacon has announced the Revolution X Unlimited wireless controller, the brand's latest gamepad that's compatible with Xbox consoles as well as PC and scheduled to launch during 'Fall 2024.'\nWhat sets the Revolution X Unlimited apart, though, is the inclusion of an LCD screen in the center of the gamepad.\nREVOLUTION X UNLIMITED | Reveal Trailer - YouTube Watch OnIn terms of battery life, Nacon has stated the controller can manage \"up to 10 hours.\"\nHowever, the PS5 controller didn't have some of the improvements the Revolution X Unlimited is bringing to the table - such as the LCD screen or micro-switch modules.\nWith that in mind, I expect the Revolution X Unlimited to come in at its slightly more expensive price point."}, {"id": "630644a0-22bd-4d99-80a5-71cafafb3ab9", "title": "You are not prepared for this SteelSeries WoW collection", "date": "2024-08-21 02:00", "url": "https://www.androidheadlines.com/2024/08/you-are-not-prepared-for-this-steelseries-wow-collection.html", "domain": "androidheadlines.com", "domain_classification": "Unknown", "message": "SteelSeries and World of Warcraft have a long and storied history that dates back to the age of vanilla WoW.\nBehold, the new SteelSeries World of Warcraft collection that any adventurer traveling the lands of Azeroth would be proud to stumble upon.\nSo the launch of the new SteelSeries collection of peripherals is in part to commemorate that massive achievement.\nThe World of Warcraft SteelSeries collection launches in SeptemberI know you probably want to get your hands on these gaming peripherals and accessories right away.\nSteelSeries is continuing this tradition, only this time every peripheral in the WoW collection comes with some sweet in-game loot."}, {"id": "4d44686b-6d9b-45f3-aebb-7748c2d68d02", "title": "El Paso manufacturer awarded $92+ million Army contract", "date": "2024-08-21 03:00", "url": "https://kvia.com/news/2024/08/20/el-paso-manufacturer-awarded-92-million-army-contract/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "EL PASO, Texas (KVIA) -- The Defense Logistics Agency Troop Support has awarded El Paso garment manufacturer ReadyOne Industries a $92,406,100 contract to make advanced combat pants for the U.S. Army over the next five years.\n“We are honored to receive this five-year contract from the Defense Logistics Agency,” said Craig Wellons, President and COO of ReadyOne Industries.\n“This award not only reaffirms our dedication to delivering advanced, high-quality combat gear for the U.S.\"The contract's ordering period will run until August 14, 2029."}, {"id": "ca7489d6-cf23-44e0-a40b-b50f5a7dd437", "title": "Texas Longhorn fan ranks SEC fight songs", "date": "2024-08-21 02:45", "url": "https://longhornswire.usatoday.com/lists/texas-longhorn-fan-ranks-the-sec-fight-songs/", "domain": "longhornswire.usatoday.com", "domain_classification": "Unknown", "message": "Fight songs unify with a common tune everyone knows and can sing and cheer together.\nFor alumni, fight songs instill a sense of nostalgia.\nTypically a rousing short song played by the school’s band, fans have been singing along to fight songs for decades.\nThe first official fight song dates back to 1885 when T. J. Hurley wrong “For Boston” for Boston College.\nAlso Check out: Texas Longhorn fan ranks the SEC football helmets"}, {"id": "9469dee0-d838-4aba-9374-862f82b39d33", "title": "Ukraine launches one of its largest drone attacks on Moscow - National", "date": "2024-08-21 14:30", "url": "https://globalnews.ca/news/10708462/ukraine-russia-drone-attack-moscow/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "The drone attacks come as Ukrainian forces are continuing to push into Russia’s western Kursk region.\n“This was one of the biggest attempts of all time to attack Moscow using drones,” Moscow Mayor Sergey Sobyanin said on his Telegram channel.\nRussia downed 45 Ukrainian drones overnight, including 11 over the Moscow region.\nIt has also opened up another front in a fight where Ukrainian forces were already badly stretched.\nThe gains in Kursk come as Ukraine continues to lose ground in its eastern industrial region of Donbas."}, {"id": "abf41c3a-bb09-459c-9a0f-16ac2a6f441a", "title": "Forces : NATO Nations Adapt to Shrinking Population", "date": "2024-08-21 10:00", "url": "http://www.strategypage.com/htmw/htworld/articles/2024082134725.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "NATO nations have long supported and supplied Ukraine with weapons, munitions and commercial goods for Ukrainian civilians as well as refuge for Ukrainian refugees.\nWith regular access to Ukrainian tactics and new military technology, NATO nations are developing new weapons and strategies.\nNATO nations are facing a shortage of volunteers, a refusal to reinstate conscription and the continuing need for effective armed forces to deal with a number of potential crises.\nNATO nations noted an opportunity to learn from this and that intense learning process will continue until the war in Ukraine is over.\nAt that point NATO nations will already be implementing solutions to their own military manpower problems using lessons from the Ukraine war."}, {"id": "d6939e02-93b6-4a14-81ab-07527e0c4e36", "title": "28 Killed As Bus Carrying Shiite Pilgrims From Pakistan To Iraq Crashes In Iran", "date": "2024-08-21 07:00", "url": "https://www.outlookindia.com/international/28-killed-as-bus-carrying-shiite-pilgrims-from-pakistan-to-iraq-crashes-in-iran", "domain": "outlookindia.com", "domain_classification": "Unknown", "message": "Arbaeen — Arabic for the number 40 — marks the death of the Prophet Muhammad's grandson, Hussein, at the hands of the Muslim Umayyad forces in the Battle of Karbala, during the tumultuous first century of Islam's history.\nHussein was seen by his followers as the rightful heir of the prophet's legacy.\nWhen he refused to pledge allegiance to the Umayyad caliphate, he was killed in the battle, cementing the schism between Sunni and Shiite Islam."}, {"id": "bce60e97-c1b4-444b-b4ff-38efc27b8343", "title": "Moscow sees one of Ukraine largest drone attacks as fighting rages in Kursk and eastern Ukraine", "date": "2024-08-21 11:15", "url": "https://www.smdailyjournal.com/news/world/moscow-sees-one-of-ukraines-largest-drone-attacks-as-fighting-rages-in-kursk-and-eastern/article_19656b17-9134-56ba-bb52-0d65c74a4274.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "92353d1e-66ed-472d-9d42-5c569d509b0f", "title": "Moscow sees one of Ukraine largest drone attacks as fighting rages in Kursk and eastern Ukraine", "date": "2024-08-21 12:15", "url": "https://isp.netscape.com/news/world/story/0001/20240821/829eac0d80851258f03d8d9cbaf71eea", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Moscow sees one of Ukraine's largest drone attacks as fighting rages in Kursk and eastern UkraineMOSCOW (AP) — Moscow came under one of the largest attacks by Ukrainian drones since the start of fighting in 2022, Russian authorities reported Wednesday, saying they destroyed all of those headed toward the capital.\nThe drone attacks come as Ukrainian forces are continuing to push into Russia’s western Kursk region.\nRussia said it downed 45 Ukrainian drones overnight, including 11 over the Moscow region.\nMaria Zakharova, spokeswoman for the Russian Foreign Ministry, said Ukraine’s attack on Kursk has ended “any possibility” of peace negotiations.\nUkraine’s Interior Minister Ihor Klymenko said Kyiv established an office in the Kursk region to provide humanitarian and medical aid to the local population."}, {"id": "77586bc5-ba98-474e-896a-e5afb11f00ac", "title": "Worthplaying |  Call Of Duty : Black Ops 6  Shows Off 7 Mins Of Footage From Most Wanted Campaign Mission", "date": "2024-08-21 02:45", "url": "https://worthplaying.com/article/2024/8/20/news/143250-call-of-duty-black-ops-6-shows-off-7-mins-of-footage-from-most-wanted-campaign-mission-trailer/", "domain": "worthplaying.com", "domain_classification": "Unknown", "message": "The Call of Duty: Black Ops 6 campaign features dynamic moment-to-moment gameplay, featuring different mission styles with spectacular action-packed set pieces, high-stakes heists and high-secret espionage activities.\nA brand-new Call of Duty: Black Ops 6 Campaign Mission - \"Most Wanted,\" was just revealed at Gamescom during Opening Night Live!\nExpect to complete many of the mission objectives across the Black Ops 6 Campaign with a degree of freedom and choice, and this is no exception.\nPlay the Most Wanted mission as part of the signature Black Ops 6 Campaign, this October 25!\nTwo days after Call of Duty: NEXT, on Friday August 30 at 10AM PT, get your first taste of the next-level action coming to Call of Duty: Black Ops 6 with the Black Ops 6 Multiplayer Beta."}, {"id": "30d68e0d-f0e9-429a-9e5c-b15d94d82db7", "title": " ( LEAD ) Obama ramps up support for Harris , warns against Trump  sequel  ", "date": "2024-08-21 07:45", "url": "https://en.yna.co.kr/view/AEN20240821005251315", "domain": "en.yna.co.kr", "domain_classification": "Unknown", "message": "In an apparent move to project a forward-leaning image of Harris, Obama asserted the need for America to pick a leader who can put a divided nation on a path forward rather than backwards.\nFormer U.S. President Barack Obama speaks during the Democratic National Convention in Chicago, Illinois, on Aug. 20, 2024, in this photo released by Reuters.\nBefore the Chicago convention, Harris already secured the nomination through a virtual roll call vote earlier this month.\nThis week's convention is seen as a ceremonial crowning of Harris as the presidential nominee.\nFormer U.S. first lady Michelle Obama speaks during the Democratic National Convention in Chicago, Illinois, on Aug. 20, 2024, in this photo released by Reuters."}, {"id": "7875ad97-9c0b-4431-a392-e0701b00a077", "title": "Ukrainian Forces Continue Their Offensive In Kursk Region", "date": "2024-08-21 11:15", "url": "https://menafn.com/1108584021/Ukrainian-Forces-Continue-Their-Offensive-In-Kursk-Region-ISW", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Ukrainian forces continued attacking throughout the Ukrainian salient in Russia's Kursk region on August 20 and recently made additional advances.\nRussian milbloggers widely claimed on August 20 that Ukrainian forces continued mechanized assaults on the outskirts of Korenevo and that Russian forces were conducting artillery and airstrikes to contain Ukrainian advances.\nUkraine controls 93 settlements in Kursk region – CinC SyrskyiAnalysts also noted that the Russian military command continues to complicate and bureaucratize its thus-far ineffective command and control structure for the Russian response to the Ukrainian incursion into the Kursk region.\nBelousov also tasked five members of the Coordinating Council with addressing specific issues related to the Ukrainian incursion into the Kursk region.\nIn addition, analysts have drawn attention to reports that the Russian authorities have redeployed Russian units from the Chasiv Yar direction to the Kursk region."}, {"id": "c629a7ba-da31-4d3e-9047-52ad8bc40c83", "title": "Prince William heartbreaking explanation for not liking Meghan Markle", "date": "2024-08-21 07:00", "url": "https://www.mirror.co.uk/news/royals/prince-williams-heartbreaking-explanation-not-33483781", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Robert Lacey's book Battle of the Brothers, claims Prince William, 'said he felt Meghan was 'stealing his beloved brother away from him,' whilst also not having any respect of the Royal traditionsThe ongoing rift between royal brothers Prince William and Prince Harry seems to be showing no signs of thawing and a book about their feud claims Prince William was wary of Meghan Markle from the beginning.\nLacey quotes a Kensington Palace courtier as saying: 'Meghan portrayed herself as the victim, but she was the bully.\nThe author also writes that he believes that William thought that Meghan had an 'agenda' and had voiced his reservations to his brother Harry before their engagement.\nThe couple made a series of bombshell claims about William and Kate.\nHe said Kate allegedly 'grimaced' when Meghan borrowed her lipgloss and how the women had a disagreement after the Duchess of Sussex said William's wife had \"baby brain\" after Prince Louis was born."}, {"id": "def6278b-0592-463c-a1c0-eeafd484c923", "title": "Moscow Mayor Says Ukraine Launched  One Of The Largest  Drone Attacks On Russia Capital", "date": "2024-08-21 06:00", "url": "https://www.rferl.org/a/moscow-sobyanin-drones-ukraine/33086648.html", "domain": "rferl.org", "domain_classification": "Unknown", "message": "The Kremlin believes the fighting to repel Ukraine's incursion into Russia's Kursk region will last for months and is trying to prepare the public for this \"new normal,\" sources close to the Russian presidential administration and the government have told the Meduza and Verstka news websites.\nThe reports came as Russia is battling to repel the two-week-old Ukrainian incursion into its region bordering Ukraine, where Kyiv's forces say they control more than 1,260 square kilometers and 92 settlements.\nRostov regional Governor Vasily Golubev separately said a Ukrainian missile had been shot down in the region, without giving details.\nRussia's Defense Ministry separately said its air-defense systems shot down 45 Ukrainian drones.\n\"Eleven drones were destroyed over the Moscow region, 23 over the Bryansk region, six over the Belgorod region, three over the Kaluga region, and two over the Kursk region,\" it said."}, {"id": "0b968c39-696f-44d7-ac85-7166786ae531", "title": "Ukraine says it hits pontoon bridges in Kursk region with US - made rockets", "date": "2024-08-21 12:45", "url": "https://www.aol.com/ukraine-says-hits-pontoon-bridges-115335991.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "(Reuters) - Ukrainian forces are using U.S.-manufactured HIMARS rocket systems to destroy pontoon bridges and engineering equipment in Russia's Kursk region, Ukraine's military said on Wednesday, targeting logistics in its major cross-border incursion.\n\"Where do Russian pontoon bridges 'disappear' in the Kursk region?\nWashington has made no direct comment regarding the use of U.S.-made weapons in Kursk region, while saying its policies had not changed and that Ukraine was defending itself from Russia's attacks.\nIt was likely set up between Aug. 14 and Aug. 17 between the Russian settlements of Zvannoe and Glushkovo after two bridges were destroyed or damaged earlier.\nUkraine's Foreign Ministry has said the advance in the Kursk region made bigger gains than Russia had captured since the start of the year."}, {"id": "e59a1d2e-0d7f-4fa0-a03e-7b4266468975", "title": "Links 8 / 21 / 2024 | naked capitalism", "date": "2024-08-21 11:45", "url": "https://www.nakedcapitalism.com/2024/08/links-8-21-2024.html", "domain": "nakedcapitalism.com", "domain_classification": "Unknown", "message": "Relentless Russian Assaults Bite Deeper Into Ukraine’s Battered Donbas Defenses Kyiv PostSurrounded… Andrei Martyanov.\nThe Kiev regime is all about PR and stunts, to a significant degree to keep the support of its coalition partners.\nSeems plausible because it’s the sort of thing the KGB ought to be doing, with cutouts/cover for the Russian state being behind it.\nAnd Russia might have decided to get more aggressive about this sort of thing after Kursk.\nLetter: West must test Putin’s claims about the Russian economy Financial Times."}, {"id": "7ff77fdb-0296-4349-81bc-3cf42481c40c", "title": "Ukraine news : Russia under one of largest drone attacks yet", "date": "2024-08-21 11:15", "url": "https://www.ctvnews.ca/world/moscow-sees-one-of-ukraine-s-largest-drone-attacks-as-fighting-rages-in-kursk-and-eastern-ukraine-1.7008418", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "MOSCOW -Moscow came under one of the largest attacks by Ukrainian drones since the start of fighting in 2022, Russian authorities reported Wednesday, saying they destroyed all of those headed toward the capital.\nThe drone attacks come as Ukrainian forces are continuing to push into Russia’s western Kursk region.\n“This was one of the biggest attempts of all time to attack Moscow using drones,” Moscow Mayor Sergei Sobyanin said on his Telegram channel.\nRussia said it downed 45 Ukrainian drones overnight, including 11 over the Moscow region.\nUkraine’s Interior Minister Ihor Klymenko said Kyiv established an office in the Kursk region to provide humanitarian and medical aid to the local population."}, {"id": "a1d2eafc-ee98-4efd-ba80-157b86068668", "title": "Tactical Data Link Industry Research 2024 - 2034 : Lucrative", "date": "2024-08-21 11:30", "url": "https://www.globenewswire.com/news-release/2024/08/21/2933404/0/en/Tactical-Data-Link-Industry-Research-2024-2034-Lucrative-Opportunities-for-Manufacturers-Suppliers-and-Service-Providers-with-Technological-Advancements-and-Innovations.html", "domain": "globenewswire.com", "domain_classification": "Unknown", "message": "The tactical data link market is undergoing significant growth, propelled by various key factors and market drivers.\nThe rising emphasis on sustainability and environmental conservation acts as another significant driver for the global tactical data link market.\nOverall, the tactical data link market presents lucrative opportunities for manufacturers, suppliers, and service providers.\nTactical Data Link Market (by Application)2.1 Application Segmentation2.2 Application Summary2.3 Tactical Data Link Market (by Application)2.3.1 Command and Control2.3.2 Intelligence, Surveillance and Reconnaissance2.3.3 Electronic Warfare2.3.4 Radio Communications2.4 Tactical Data Link Market (by Platform)2.4.1 Ground2.4.2 Airbourne2.4.3 Naval2.4.4 Unmanned Systems2.4.5 Weapons3.\nTactical Data Link Market (by Products)3.1 Product Segmentation3.2 Product Summary3.3 Tactical Data Link Market (by Component)3.3.1 Hardware3.3.1.1 Terminals3.3.1.2 Radio Sets3.3.1.3 Modems3.3.1.4 Routers3.3.1.5 Controllers3.3.1.6 Transceivers3.3.1.7 Monitors3.3.1.8 Others3.3.2 Software Solutions3.4 Tactical Data Link Market (by Frequency)3.4.1 High Frequency3.4.2 Ultra-High Frequency3.5 Tactical Data Link Market (by Data Link Type)3.5.1 Link 113.5.2 Link 163.5.3 Link 223.5.4 Others4."}, {"id": "a19a2994-4aa7-416d-a1a4-bc21c1ee5552", "title": "Doctors can stop severe bleeding  in second with newly approved trauma product", "date": "2024-08-21 02:00", "url": "https://www.yahoo.com/news/doctors-stop-severe-bleeding-seconds-231809762.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The U.S. Food and Drug Administration (FDA) has approved a novel treatment that is designed to stop severe bleeding in a matter of seconds.\nFirst responders, paramedics and combat medics can use the gel to rapidly stop severe blood loss from wounds due to gunshots, stabbings or other traumatic events.\nThere are currently many gauzes, powders and sponges used to stop bleeding, but they have limitations, according to Landolina.\nREAD ON THE FOX NEWS APPThe U.S. Food and Drug Administration has approved TRAUMAGEL, a novel treatment that is designed to stop severe bleeding in a matter of seconds.\nOriginal article source: Doctors can stop severe bleeding ‘in seconds’ with newly approved trauma product"}, {"id": "e910c0aa-cb1e-4f61-b9df-ad62eac6a4f8", "title": "Internet companies fight against corruption", "date": "2024-08-21 01:45", "url": "http://usa.chinadaily.com.cn/a/202408/21/WS66c53c47a31060630b92418d.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "China's leading internet companies, including Douyin, Tencent and Meituan, have ramped up efforts to combat internal corruption this year, underscoring a zero-tolerance policy toward fraudulent and corrupt activities.\nAccording to the report, Douyin investigated 125 cases of fraudulent activities during the first six months of the year.\nIn February, Tencent released its 2023 anti-fraud report, which disclosed that over 70 cases of rule violations were addressed last year.\nCorruption cases often involve employees working in upstream supply chains and downstream sales channels of the internet firms.\nDouyin also emphasized its commitment to continuously improving its systems and intensifying efforts to combat fraudulent activities, including commercial bribery and embezzlement."}, {"id": "58384237-7d43-4d65-8482-4eab4ca18792", "title": "Internet companies fight against corruption", "date": "2024-08-21 03:00", "url": "http://europe.chinadaily.com.cn/a/202408/21/WS66c53c47a31060630b92418d.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "China's leading internet companies, including Douyin, Tencent and Meituan, have ramped up efforts to combat internal corruption this year, underscoring a zero-tolerance policy toward fraudulent and corrupt activities.\nAccording to the report, Douyin investigated 125 cases of fraudulent activities during the first six months of the year.\nIn February, Tencent released its 2023 anti-fraud report, which disclosed that over 70 cases of rule violations were addressed last year.\nCorruption cases often involve employees working in upstream supply chains and downstream sales channels of the internet firms.\nDouyin also emphasized its commitment to continuously improving its systems and intensifying efforts to combat fraudulent activities, including commercial bribery and embezzlement."}, {"id": "be7cb6a5-b318-4566-95c7-b24f7e14e0c4", "title": "", "date": "2024-08-21 00:30", "url": "http://www.israelnationalnews.com/news/394917", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Last night (Monday), the Paratrooper Brigade Combat Team, including the soldiers of the 75th Battalion and the Yahalom Unit, in a joint operation with the ISA, completed the operation to rescue the bodies of hostages in the Khan Yunis area.\nIn the operation, the bodies of hostages Nadav Popplewell, Yagev Buchshtab, Avraham Munder, Yoram Metzger, Haim Perry and Alexander Dancyg, were rescued and returned to the State of Israel.\nPopplewell, Metzger, and Perry were announced murdered in June, and Dancyg and Buchstab were reported murdered last month.\nDuring the operation, the forces located a tunnel shaft about 10 meters deep leading to an underground tunnel route where the bodies of the hostages were found.\nThe soldiers of the Yahalom Unit and the ISA investigated the route and neutralized the obstructions, blast doors, weapons, explosives and hideouts used by the terrorists."}, {"id": "737decdb-365b-414a-bd36-9b9f53590969", "title": "Gamescom : Seven things we learned from Opening Night Live", "date": "2024-08-21 12:00", "url": "https://www.bbc.co.uk/news/articles/cy8xjqg2e9jo", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "If there's one thing the world's gaming studios need at the moment, it's a little bit of hype.\nIt has been a year with no major new console launches and where the industry has seen strikes and cuts with thousands of workers being laid off.\nThe opening night of Gamescom is often an opportunity for a big shiny night to get fans all excited for the year ahead.\nSetting the stage for the next 12 months, here are the biggest things we found out from Europe's biggest gaming show in Germany."}, {"id": "4451c8a9-f2a8-4f35-be4b-a9cf3bc0f208", "title": "Israel says it recovered bodies of 6 hostages in Gaza", "date": "2024-08-21 01:45", "url": "https://www.bostonglobe.com/2024/08/20/world/israel-says-it-recovered-bodies-6-hostages-gaza/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Of the roughly 250 people Israeli authorities say were taken hostage during the Hamas-led Oct. 7 attack, Israeli forces have so far rescued only seven hostages alive.\nJERUSALEM — Israeli forces recovered the bodies of six Israeli hostages from the southern Gaza Strip in an overnight operation, the Israeli military said Tuesday, highlighting the plight of the scores of captives remaining in the Palestinian enclave.\nWeeks later, the Israeli military said it was examining the possibility that the three hostages had been killed while Israeli forces were operating in the Khan Younis area.\nThe military said Israeli forces scanned the route and noticed that part of the tunnel’s concrete lining was loose.\nThe Israeli military has shrunk that zone repeatedly as it presses its assault."}, {"id": "7cb6c75a-e9f3-4577-b147-7527faffd35f", "title": "UK to test jamming protection in  Silent Hangar  - Airforce Technology", "date": "2024-08-21 11:15", "url": "https://www.airforce-technology.com/news/uk-to-test-jamming-protection-in-silent-hangar/", "domain": "airforce-technology.com", "domain_classification": "Unknown", "message": "A new QinetiQ-built Silent Hangar in Wiltshire will serve as a space for the UK Ministry of Defence to begin to test its anti-jamming capabilities to protect its aerial platforms from 2026. Credit: QinetiQ.\nA new ‘Silent Hangar’ facility will provide a space for the UK Ministry of Defence to test anti-jamming capabilities to protect a wide range of aerial platforms at its Boscombe Down site in Wiltshire.\nThis is said to create ideal conditions to test the resilience of systems integrated into Royal Air Force aircraft.\nThis is reflected in the global EW market, which has seen a notable spike in growth since 2023 and is currently valued at $16.1bn in 2024.\nThe value of the EW market is currently forecasted to grow at a compound annual growth rate of 4.6% up to a total market size of $21.8bn by 2033."}, {"id": "ec48d90c-a386-40af-8c55-58cf6fb1ce1b", "title": "EU Rejects Accusation That West Played Role In Recent Anti - Mining Protests In Serbia", "date": "2024-08-21 08:30", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240820-rferl02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "EU Rejects Accusation That West Played Role In Recent Anti-Mining Protests In SerbiaBy RFE/RL August 20, 2024EU officials on August 20 again firmly rejected Serbian President Aleksandar Vucic's claim that Western countries were behind recent protests against his government's lithium mining plans.\n\"The European Union absolutely rejects any allegations that it would be involved in any kind of illegal or illegitimate activities linked to foreign interference.\nThis is not what the European Union is doing,\" Peter Stano, spokesman for EU foreign policy chief Josep Borrell, said at a European Commission news briefing.\nThe protests took place after the European Union and the Serbian government last month signed a memorandum of understanding on a \"strategic partnership\" on sustainable raw materials, battery supply chains, and electric vehicles.\nIt could also play a critical role in Western electric vehicle supply chains as Washington and Brussels seek to reduce dependency on rival China."}, {"id": "13911aaa-dd82-4147-8a7d-379f60e38b46", "title": "Myanmar Rohingya caught in crossfire of civil war – DW – 08 / 20 / 2024", "date": "2024-08-21 12:15", "url": "https://www.dw.com/en/myanmars-rohingya-trapped-in-rising-violence-of-civil-war/a-69992809", "domain": "dw.com", "domain_classification": "International", "message": "As Myanmar’s civil war intensifies, Rohingya communities in Rakhine State are caught in the crossfire, experiencing escalating violence.\nThis has been the case Myanmar's Rakhine State, where fighting has been raging for months, centering on the townships of Maungdaw and Buthidaung.\nMeanwhile, the armed Rohingya groups are now cooperating with Myanmar's ruling junta, the State Administrative Council (SAC) on bringing Rohingya refugees back out of Bangladesh.\nRohingya see anyone who uses the designation \"Bengalis\" as denying that the Rohingya belong to the Rakhine state.\nHe pointed to other parts of Rakhine State under AA control, noting that Rohingya and other Muslim minorities there live alongside the Rakhine."}, {"id": "e9c25e00-29e4-4601-a057-6db4c8337ae4", "title": "Has Africa become a battleground for the new cold war ? It China vs America in Mother Continent – Firstpost", "date": "2024-08-21 02:15", "url": "https://www.firstpost.com/world/has-africa-become-a-battleground-for-the-new-cold-war-its-china-vs-america-in-mother-continent-13806603.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "The US-led West might have missed the trick but China’s Africa story begins in the 1950s, when Western powers rivalled, at times one another, to maintain their superiority in Africa.\nChina — along with India — vouched for freedom and self-reliance of African countries through several channels and platforms including the most-famous Bandung conference hosted by Indonesia.\nReutersSeven decades later, the communist China’s heft and growing presence in Africa have set up a race of one-upmanship in the Mother Continent.\nWhy call it a new cold warThe intensifying rivalry, particularly between China and the US over the African continent, bears striking resemblances to the Cold War of the 20th century.\nChina earlier policy of non-political interference helped it edge out the Western countries in developing cooperation with African countries."}, {"id": "559e8835-e248-4621-b010-2f61ca962246", "title": "Moscow repels massive drone assault as Ukrainian forces advance in Kursk region", "date": "2024-08-21 14:15", "url": "https://wset.com/news/nation-world/moscow-russia-repels-massive-drone-assault-as-ukrainian-forces-advance-in-kursk-region-air-defense-systems-bryansk-kyiv-troops-oil-refineries-airfields-incursion-lose-ground-zelenskyy-putin-kremlin", "domain": "wset.com", "domain_classification": "Unknown", "message": "The drone attacks come as Ukrainian forces are continuing to region.\n\"This was one of the biggest attempts of all time to attack Moscow using drones,\" Moscow Mayor Sergey Sobyanin said on his Telegram channel.\nRussia downed 45 Ukrainian drones overnight, including 11 over the Moscow region.\nIt has also opened up another front in a fight where Ukrainian forces were already badly stretched.\nUkraine's over the Seym River in Kursk, in areas it does not control, could potentially trap Russian forces between the river, the Ukrainian advance and the Ukrainian border."}, {"id": "44dcdda1-f95c-4ada-ba1f-a4b2c488236f", "title": "Opinion : The Kursk Incursion : a Symbol on Which to Build Ukraine Future", "date": "2024-08-21 12:15", "url": "https://www.kyivpost.com/opinion/37627", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "The same symbol can cause one nation to beam with pride and another nation to erase any mention of that symbol.\nAs far as symbolism goes, the city of Kursk and the Kursk region hold a special place in Russian hearts.\nAnd Russian identity and pride is under attack right now in Kursk.\nIt’s a symbol of hope and heroism on which to build Ukraine’s future.\nAdvertisementSome still insist that Vladimir Putin is rational and coldly calculating, and that characterizing him as insane is wrong."}, {"id": "cc2bf2e1-bf65-4311-9cd4-4e7837fcd4a3", "title": "Final VH - 92A presidential helicopter delivered", "date": "2024-08-21 08:30", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240819-navair01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Final VH-92A presidential helicopter deliveredNaval Air Systems Command (NAVAIR)Aug 19, 2024NAVAL AIR SYSTEMS COMMAND, Patuxent River, Md.\n-- Presidential Helicopters Program Office (PMA-274) and the Marine Corps accepted delivery of the final VH-92A helicopter, built by Sikorsky, a Lockheed Martin Company, in August.\nThe total inventory of 23 VH-92A aircraft will consist of 21 operational and two test aircraft.\nIn May 2014, PMA-274, with approval from the Navy, awarded Sikorsky a contract to build the next presidential helicopter, the VH-92A, a derivative of the commercial S-92.\nThe new presidential helicopter was built to increase performance and payload over the VH-3D and VH-60N."}, {"id": "842ef53e-53f6-4c44-8e0f-92ac2a12b903", "title": "Moscow repels massive drone assault as Ukrainian forces advance in Kursk region", "date": "2024-08-21 12:45", "url": "https://wwmt.com/news/nation-world/moscow-russia-repels-massive-drone-assault-as-ukrainian-forces-advance-in-kursk-region-air-defense-systems-bryansk-kyiv-troops-oil-refineries-airfields-incursion-lose-ground-zelenskyy-putin-kremlin", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "The drone attacks come as Ukrainian forces are continuing to region.\n\"This was one of the biggest attempts of all time to attack Moscow using drones,\" Moscow Mayor Sergey Sobyanin said on his Telegram channel.\nRussia downed 45 Ukrainian drones overnight, including 11 over the Moscow region.\nIt has also opened up another front in a fight where Ukrainian forces were already badly stretched.\nUkraine's over the Seym River in Kursk, in areas it does not control, could potentially trap Russian forces between the river, the Ukrainian advance and the Ukrainian border."}, {"id": "72f89f56-8016-4652-bffb-42afd6ce6487", "title": "Moscow sees one of Ukraine largest drone attacks as fighting rages in Kursk and eastern Ukraine", "date": "2024-08-21 14:00", "url": "https://www.mprnews.org/story/2024/08/21/moscow-sees-one-of-ukraines-largest-drone-attacks-as-fighting-rages", "domain": "mprnews.org", "domain_classification": "Unknown", "message": "Moscow came under one of the largest attacks yet by Ukrainian drones since the start of fighting in 2022, Russian authorities reported Wednesday, saying they destroyed all of those headed toward the capital.\nThe drone attacks come as Ukrainian forces are continuing to push into Russia’s western Kursk region.\n“This was one of the biggest attempts of all time to attack Moscow using drones,” Moscow Mayor Sergey Sobyanin said on his Telegram channel.\nRussia downed 45 Ukrainian drones overnight, including 11 over the Moscow region.\nThe gains in Kursk come as Ukraine continues to lose ground in its eastern industrial region of Donbas."}, {"id": "e927a49e-6895-4f72-a667-12d18aa93924", "title": "Moscow comes under one of the largest Ukrainian drone attacks but destroys them all", "date": "2024-08-21 10:30", "url": "https://www.theweek.in/wire-updates/international/2024/08/21/fgn26-russia-ukraine-ld-war.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Russia downed 45 Ukrainian drones overnight, the Ministry of Defense said.\nIt said 11 were destroyed over the Moscow region, 23 over the Bryansk region, six over Belgorod, three over Kaluga and two over Kursk.\n“This was one of the biggest attempts of all time to attack Moscow using drones,” Moscow Mayor Sergey Sobyanin said on his Telegram channel.\nThe drone attacks come as Ukrainian forces are continuing to push into Russia's western Kursk region.\nIt has also opened up another front in a fight where Ukrainian forces were already badly stretched."}, {"id": "45613145-6f7b-40c6-8069-7e209e784be8", "title": "Dino Death Match", "date": "2024-08-21 04:15", "url": "https://www.tvguide.co.uk/schedule/9ae35a9b-7ca3-5e7e-bba4-1952cf423592/dino-death-match", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Dino Death MatchNational Geographic WILD HD 10:00 AM to 11:00 AM Wednesday 21 August Share Add toCalendar +Dino Death MatchDocumentary examining fossilised remains of two dinosaurs locked in combat, which may provide evidence of a previously unknown species of predatorDino Death Match airs on National Geographic WILD HD at 10:00 AM, Wednesday 21 August .\nLearn more about Dino Death Match and other education/science/factual topics on our factual page"}, {"id": "95d63a71-de5e-48fa-95ff-d2c6c93ca35c", "title": "Moscow repels massive drone assault as Ukrainian forces advance in Kursk region", "date": "2024-08-21 11:15", "url": "https://turnto10.com/news/nation-world/moscow-russia-repels-massive-drone-assault-as-ukrainian-forces-advance-in-kursk-region-air-defense-systems-bryansk-kyiv-troops-oil-refineries-airfields-incursion-lose-ground-zelenskyy-putin-kremlin", "domain": "turnto10.com", "domain_classification": "Unknown", "message": "The drone attacks come as Ukrainian forces are continuing to region.\n\"This was one of the biggest attempts of all time to attack Moscow using drones,\" Moscow Mayor Sergey Sobyanin said on his Telegram channel.\nRussia downed 45 Ukrainian drones overnight, including 11 over the Moscow region.\nIt has also opened up another front in a fight where Ukrainian forces were already badly stretched.\nUkraine's over the Seym River in Kursk, in areas it does not control, could potentially trap Russian forces between the river, the Ukrainian advance and the Ukrainian border."}, {"id": "4b86230d-e17c-4fb6-a5b7-8ea2acc429bf", "title": "What the papers say – August 21", "date": "2024-08-21 00:30", "url": "https://www.standard.co.uk/news/uk/mike-lynch-svengoran-eriksson-italian-daily-express-daily-mail-b1177598.html", "domain": "standard.co.uk", "domain_classification": "Unknown", "message": "* FIRST NAME* LAST NAME* EMAIL Your email address* PASSWORD Must be at least 6 characters, include an upper and lower case character and a number Show* YEAR OF BIRTH You must be at least 18 years old to create an account 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 1996 1995 1994 1993 1992 1991 1990 1989 1988 1987 1986 1985 1984 1983 1982 1981 1980 1979 1978 1977 1976 1975 1974 1973 1972 1971 1970 1969 1968 1967 1966 1965 1964 1963 1962 1961 1960 1959 1958 1957 1956 1955 1954 1953 1952 1951 1950 1949 1948 1947 1946 1945 1944 1943 1942 1941 1940 1939 1938 1937 1936 1935 1934 1933 1932 1931 1930 1929 1928 1927 1926 1925 1924 1923 1922 1921 1920 1919 1918 1917 1916 1915 1914 1913 1912 1911 1910 1909 1908 1907 1906* Required fieldsI would like to be emailed about offers, events and updates from Evening Standard.\nRead our privacy noticeCREATE ACCOUNTI'LL TRY LATERAlready have an account?\nSIGN INBy clicking Create Account you confirm that your data has been entered correctly and you have read and agree to our Terms of use , Cookie policy and Privacy policy .\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."}, {"id": "203913f9-7f42-4394-b40d-545bf1e49a84", "title": "US and South Korea begin military drills aimed at stren ... ", "date": "2024-08-21 01:00", "url": "https://accesswdun.com/article/2024/8/1258398", "domain": "accesswdun.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — U.S. and South Korean troops kicked off a large-scale exercise Monday aimed at strengthening their combined defense capabilities against nuclear-armed North Korea, which again accused the allies of practicing an invasion.\nThe U.S. and South Korean militaries did not immediately react to the North Korean Foreign Ministry statement.\nAbout 19,000 South Korean military personnel will participate in the drills, which will be held concurrently with civil defense and evacuation drills from Monday through Thursday that will include programs based on North Korean nuclear attack scenarios.\nThe drills could trigger a belligerent response from North Korea, which has been flaunting its growing weapons program and issuing verbal threats of nuclear conflicts against Washington and Seoul.\nDuring last year’s Ulchi Freedom Shield exercises, North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets."}, {"id": "65820cbe-4767-46d8-a970-21a9ea1cb291", "title": "What Were Captain America Last Words in the Comics ? Find Out", "date": "2024-08-21 10:00", "url": "https://www.pinkvilla.com/entertainment/hollywood/what-were-captain-americas-last-words-in-the-comics-find-out-1341120", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "In this piece, we will explore Captain America's final moments in the comics and how his departure was portrayed in the films.\nCaptain America's death in the comics is a dramatic and emotional moment.\nSharon Carter was not just a fellow agent but also Captain America's former partner, adding a personal layer to his demise.\nAs Captain America's life hangs in the balance, his final words are a plea for peace.\nIn both the comic books and the Marvel Cinematic Universe (MCU), Captain America's final moments highlight his integrity and enduring legacy."}]