[{"id": "fcccff0a-d145-4f67-b93b-08824b6e697d", "title": "ANU vice - chancellor Genevieve Bell faces turmoil from all sides | The Canberra Times", "date": "2024-06-07 03:15", "url": "https://www.canberratimes.com.au/story/8654952/anu-vice-chancellor-genevieve-bell-faces-turmoil-from-all-sides/?cs=14329", "message": "The right-wing senators came armed with images and stories of antisemitic behaviour and offensive slogans on campus.\nJewish students, some of whom were sitting in the back of the room to observe the hearing, were feeling unsafe and unwelcome in the place where they lived and studied, the politicians said."}, {"id": "4ea5499f-83dc-42a9-9995-ac8a7213d354", "title": "ANU vice - chancellor Genevieve Bell faces turmoil from all sides | Braidwood Times", "date": "2024-06-07 05:30", "url": "https://www.braidwoodtimes.com.au/story/8654952/anu-vice-chancellor-genevieve-bell-faces-turmoil-from-all-sides/?cs=14329", "message": "The right-wing senators came armed with images and stories of antisemitic behaviour and offensive slogans on campus.\nJewish students, some of whom were sitting in the back of the room to observe the hearing, were feeling unsafe and unwelcome in the place where they lived and studied, the politicians said."}, {"id": "7b62deb2-ac9e-4e44-8d4f-2823ac7f4c9c", "title": "Genesis Prize Marks Tenth Anniversary by Honoring Barbra Streisand", "date": "2024-06-07 07:30", "url": "https://www.prnewswire.com/news-releases/genesis-prize-marks-tenth-anniversary-by-honoring-barbra-streisand-302166892.html", "message": "10th Anniversary Genesis Prize Laureate Barbra Streisand receives a glass sculpture of a shofar from Genesis Prize Foundation co-founder Stan Polovets.\n(Photo by Kevin Mazur/Getty Images for Genesis Prize Foundation)The Genesis Prize was established in 2014 when New York City Mayor, businessman and philanthropist Michael R. Bloomberg was announced as its inaugural laureate.\nBarbra Streisand stated: \"I am delighted to be honored by the special 10th Anniversary Genesis Prize and to work with The Genesis Prize Foundation to support organizations that acknowledge our shared humanity and seek to better our society.\nShe founded the Barbra Streisand Women's Heart Center at Cedars-Sinai to support research and raise awareness about women's heart disease.\nAbout The Genesis Prize FoundationThe Genesis Prize is a global award that celebrates Jewish achievement and contribution to humanity."}]