[{"id": "69081b7a-9893-4136-b0dc-bc15f5d5e309", "title": "The American Jewish students fleeing from US campuses to Israel", "date": "2024-06-15 02:30", "url": "https://www.jpost.com/diaspora/antisemitism/article-806043", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Many are gap year students who plan to return home and attend an American college next school year.\nThe funds will go toward implementing the project, dubbed Terrapin Tisch, which aims to bring unaffiliated Jewish students to informal events by offering food, singing, and discussions.\nThe idea of empowering Jewish students “came from visiting campuses abroad – Hillel, Chabad, and Jewish fraternities and sororities.\nWherever there are Jewish students, we try to interest them in coming to Israel,” Isaacs told the Magazine.\n“I saw that out of a tremendous number of Jewish students, only a very small percentage gets involved in Jewish life there..."}, {"id": "ed35f31c-84eb-4d17-a9f6-b16923194a0e", "title": "Aliyah Commandos fight to bring North American Jews home", "date": "2024-06-15 02:30", "url": "https://www.jpost.com/aliyah/article-806049", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The goal of these conferences is to bring aliyah advocates together in Jerusalem “to try to brainstorm why we have failed so miserably.\nWith millions of Jews in America, the [aliyah] numbers are a drop in the bucket,” Wander expressed with frustration.\nThey also met with Rabbi Hershel Schachter, an influential American Orthodox rabbi and rosh yeshiva at Rabbi Isaac Elchanan Theological Seminary, the rabbinic program of Yeshiva University.\nIf everything was perfect in Israel, [aliyah] would be a no-brainer,” he remarked.\n“I have a common language with Orthodox Jews,” Wander said."}, {"id": "cafd63d3-ca25-4117-9535-a221b77305cb", "title": "Charlotte Church joins pro - Elite Bet Picks", "date": "2024-06-15 01:15", "url": "http://www.myanmarmuslim.net/news/20240615408b599584.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Welsh singer Charlotte Church said she was spreading a “loving message” as she joined a pro-Palestine rally following the backlash she received for singing a protest chant.\nIn late February, the 38-year-old led a rendition of From The River To The Sea at a Sing For Palestine fundraising event in Wales which the Campaign Against Antisemitism called a “genocidal chant”.\nOn Saturday, the singer from Cardiff marched alongside thousands of protesters in central London calling for an immediate ceasefire in Gaza.\n“But a strong, a peaceful, a loving message, that’s what every single march that I’ve been on for Palestine has been about.\nIt comes as the Government’s counter-extremism tsar warned that London’s streets have become a “no-go zone for Jews” during pro-Palestine protests."}]