[{"id": "680036b5-4fce-4e23-9dbe-b0b87199aadb", "title": "Wildfire danger in Eagle County is pretty low , thanks to a cool , moist spring", "date": "2024-05-16 03:00", "url": "https://www.vaildaily.com/news/eagle-county-fire-danger-low-spring/", "message": "Mitigation efforts over the past several years have helped reduce the risk of wildfire, but nothing helps keep fire danger at bay like a lot of snow and a cool, moist spring.\nBirch Barron, the county’s emergency management director, on Tuesday updated the Eagle County Board of Commissioners on current wildfire conditions in the area.\nBut, he noted, no part of Eagle County was in any form of drought at the end of April, adding that the county was bordering on “abnormally dry” at the end of April in 2023.\nThat snow is coming off fairly slowly, again thanks to a reasonably cool spring so far.\nThe good news from the cooler spring conditions applies to spring runoff."}, {"id": "00d6f4ae-28d9-4217-9da9-090729f2359c", "title": "Oregon officials say 2024 fire season threat slightly less than 2023", "date": "2024-05-16 05:45", "url": "https://www.kptv.com/2024/05/16/oregon-officials-say-2024-fire-season-threat-slightly-less-than-2023/", "message": "PORTLAND Ore. (KPTV) - The threat of wildfires in Oregon for summer 2024 should be less than last year, at least for the early summer months, state forestry experts said on Wednesday.\nThat’s according to experts with the state’s forestry department - who provided a look at what we can expect as wildfire season approaches.\nOregon saw a considerable amount of rain and snow throughout the winter months, building a strong snowpack.\nTina Kotek, said this could mean more complex and challenging wildfire conditions in the later summer months.\nThe Department of Forestry said it’s preparing for the season by making sure resources are in place to fight fires when they do start, including new modernized equipment."}, {"id": "b393497d-9344-4aa5-a8ae-91218367a732", "title": "State wildfire agencies prepared to respond to fire season but will need more staff in future", "date": "2024-05-16 00:15", "url": "https://www.yahoo.com/news/state-wildfire-agencies-prepared-respond-225435339.html", "message": "Oregon wildfire officials said they are increasing the scale of prescribed burns across the state to prevent severe wildfires.\nOregon wildfire officials said they are increasing the scale of prescribed burns across the state to prevent severe wildfires.\nAt a news conference Wednesday, the leaders of the Oregon Department of Forestry, the Oregon State Fire Marshal and the Oregon Department of Emergency Management discussed the upcoming wildfire season, which typically begins in mid-May.\n“This is all trying to get (the land) health back to a more natural state,” Cline said.\nThe post State wildfire agencies prepared to respond to fire season but will need more staff in future appeared first on Oregon Capital Chronicle."}, {"id": "6e1732b9-5781-4e1d-80a0-ba313ea0a945", "title": "Looming fires force thousands of Canadians to evacuate . Some may not return home until next week", "date": "2024-05-16 07:00", "url": "https://www.cnn.com/2024/05/16/weather/canada-wildfires-fort-mcmurray-climate-thursday/", "message": "CNN —Colossal wildfires burning across Canada over the last week have driven thousands of people to evacuate with their kids, pets and precious belongings in tow – many uncertain when they may be able to return home.\nMore than 6,000 people have evacuated from Fort McMurray in Alberta since Tuesday as a 51,000 acre fire burns less than 5 miles from the city’s edge.\nFlames and smoke fill the air as wildfires burn nearby in Fort McMurray, Alberta, Canada on May 2016.\nCourtesy Jocelyn Routhier Flames and smoke fill the air as wildfires burn nearby in Fort McMurray, Alberta, Canada on May 14, 2024.\nCourtesy Jocelyn Routhier Fort McMurray resident Jocelyn Routhier photographed the 2016 and May 2024 fires from the same spot on her porch."}, {"id": "8e11155a-20f7-42b0-b7fd-1c53f109ac9c", "title": "Army Corps prepares Lake Okeechobee ahead of  extremely active  hurricane season", "date": "2024-05-16 03:45", "url": "https://winknews.com/2024/05/15/army-corps-prepares-lake-okeechobee-ahead-of-extremely-active-hurricane-season/", "message": "In February, the Corps implemented releases to the Caloosahatchee and St. Lucie Estuary to bring lake levels down ahead of the 2024 hurricane season, which is already forecasted to be “extremely active.”The plan worked.\nAs of Wednesday, May 15, 2024, Lake Okeechobee stands at 13.73 feet.\nThe 143-mile earthen dam system encircles Lake Okeechobee and is routinely inspected.\nIt reduces impacts from flooding as a result of high lake levels for a large area of south Florida.\nOn the cusp of this hurricane season, the Corps is prepared for it."}, {"id": "7a6250ae-a394-4665-94b3-d5bc8bc77b96", "title": "KATU News special  Wildfire Season : Prepare & Protect  ", "date": "2024-05-16 03:45", "url": "https://katu.com/news/local/katu-news-special-wildfire-season-prepare-protect", "message": "Wildfire season 2024 is here.\nThe first fire started burning last month 25 miles southeast of Chemult in southern Oregon.\nKATU News is 'On Your Side,' helping you prepare before a wildfire threatens your health, life, or home.\nIn KATU’s half-hour special called ‘Wildfire Season: Prepare & Protect,’ we’ll show you how to make the area around your home more fire-safe and how to build ‘defensible space.\"\nWatch ‘Wildfire Season: Prepare & Protect’ Memorial Day May 27th at 6:30 p.m. on KATU."}, {"id": "cf8fe3a5-2d0e-4648-a04f-dae26c786e63", "title": "Canadian wildfires haze U . S . skies , trigger air quality warnings in multiple states", "date": "2024-05-16 00:00", "url": "https://wjla.com/weather/first-alert-weather-blog/canadian-wildfire-smoke-returns-northern-united-states-minneapolis-kansas-city-upper-level-winds-wisconsin-wildfire-season-snowpack-cooler-weather-washington-dc-dmv", "message": "Wildfire smoke has lowered air quality and made for some hazy skies in areas like Minneapolis and Kansas City this week.\nThe upper-level winds have shifted, which resulted in the smoke from these fires filtering into the United States.\nOn Tuesday, Code Orange (3 of 6) air quality was reported in cities like Topeka, Kansas.\nThe 2023 Canadian wildfire season was record-breaking with about 45 million acres burned, which is nearly two and a half times the previous record of 17.5 million acres burned in 1995.\nWhile it is expected to be another busy wildfire season this year, it is also not expected to be anywhere near the activity and widespread as last year."}, {"id": "0522b230-70fa-4507-ab61-552dd7e40496", "title": "Looming fires are forcing thousands of Canadians to evacuate . Some may not return home until next week", "date": "2024-05-16 07:00", "url": "https://www.yahoo.com/news/looming-fires-forcing-thousands-canadians-060956937.html", "message": "Colossal wildfires burning across Canada over the last week have driven thousands of people to evacuate with their kids, pets and precious belongings in tow – many uncertain when they may be able to return home.\nMore than 6,000 people have evacuated from Fort McMurray in Alberta since Tuesday as a 51,000 acre fire burns less than 5 miles from the city’s edge.\nBut that is far from the amount of precipitation needed to offset drought conditions and extinguish the fires, the British Columbia Wildfire Service said.\nSmoke rises as fire singes Fort Nelson on May 14.\n“This region has experienced multiple years of drought, with a below normal snowpack this past winter,” said Ben Boghean, fire behavior specialist for the BC Wildfire Service."}, {"id": "11243e59-31c7-4365-bb18-6fbb7697c8f5", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 03:45", "url": "https://katu.com/news/local/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said."}, {"id": "584765d7-6668-431e-8ae1-5cf71abefda2", "title": "Houston weather : Heavy rain , flooding possible for Thursday through early Friday", "date": "2024-05-16 07:00", "url": "https://www.fox26houston.com/weather/houston-weather-heavy-rain-flooding-possible-for-thursday-through-early-friday", "message": "You might have heavy rain and severe storm fatigue, but buckle up for another round!\nThursday through early Friday are now FOX 26 Storm Alert Days and will likely feature rounds of heavy rain and a few strong to severe storms!\nThat means you need to be on alert and prepared to take action with the threat for hail, damaging winds and heavy rain that could lead to flooding increasing.\nRounds of heavy rain and a few strong to severe storms will be most likely Thursday afternoon through Friday morning.\nAlso some areas north of Houston have picked up 10-20\" of rain recently."}, {"id": "f872a7e0-beff-444c-89d7-0df6dc0074a4", "title": "Houston weather : FOX 26 Storm Alert Day issued for Thursday through early Friday", "date": "2024-05-16 02:30", "url": "https://www.fox26houston.com/weather/houston-weather-fox-26-storm-alert-day-for-thursday-through-early-friday", "message": "You might have heavy rain and severe storm fatigue, but buckle up for another round!\nThursday through early Friday are now FOX 26 Storm Alert Days and will likely feature rounds of heavy rain and a few strong to severe storms!\nThat means you need to be on alert and prepared to take action with the threat for hail, damaging winds and heavy rain that could lead to flooding increasing.\nRounds of heavy rain and a few strong to severe storms will be most likely Thursday afternoon through Friday morning.\nAlso some areas north of Houston have picked up 10-20\" of rain recently."}, {"id": "a130c0f9-22bb-4379-b35e-184a682919f0", "title": "Wet roads , poor visibility for morning commute", "date": "2024-05-16 09:45", "url": "https://www.wfsb.com/2024/05/16/wet-roads-poor-visibility-morning-commute/", "message": "(WFSB) - A storm that brought heavy rain and some wind led to some road closures in parts of the state.\nChannel 3 meteorologists issued a First Alert through Thursday morning because of an isolated chance for minor flooding and gusty winds.\nSimsbury police posted that Old Meadow Plain Road was closed between Lawton Road and Pine Glen because of a downed tree.\nIn Enfield, police said Taylor Road was closed between Scitico Plaza and Heron Road because of a crash that brought down wires in the road.\nClick HERE for the latest FIRST ALERT TRAFFIC information for your MORNING COMMUTEClick HERE for the latest FIRST ALERT WEATHER FORECAST from Channel 3 Meteorologists."}, {"id": "3f2f7509-c93f-4b92-840c-3f52358035fd", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 06:45", "url": "https://kval.com/news/local/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said."}, {"id": "3200faa3-f8ef-4e92-8cdc-0e231e719b38", "title": "Two rainstorms heading for Ghana - GMet warns", "date": "2024-05-16 08:15", "url": "https://www.myjoyonline.com/two-rainstorms-heading-for-ghana-gmet-warns/", "message": "The Ghana Meteorological Agency (GMet) says its weather monitoring station has observed double rainstorms heading for the country on Thursday, May 16.\nAreas within the coastal and northern sectors will be hit by heavy rainfall accompanied by strong winds and thundery conditions.\n\"A rainstorm that is moderately producing thunderstorms with rain over northern Benin into Togo is expected to drift further westwards to affect the northern half of Ghana.\nHowever, a separate rainstorm observed over Nigeria is also expected to propagate westwards to affect the coastal and middle sectors of the country,\" the statement read.\nThe recent severe rainstorm left in its wake destruction in parts of Accra, as trees fell and damaged several cars."}, {"id": "7c8cdfcd-4873-4b5d-afc7-1e02717310b7", "title": "Officials learn from the past in responding to this year Fort McMurray wildfire", "date": "2024-05-16 12:15", "url": "https://www.theglobeandmail.com/canada/article-officials-learn-from-the-past-in-responding-to-this-years-fort/", "message": "“The system was designed after 2016,” said Derek Sommerville, a wildfire specialist with the Alberta company Fire and Flood Emergency Services.\nJody Butz, the fire chief in charge of the Fort McMurray region, said Wednesday that the highway is open and day-to-day life continues in many parts of the region.\nJosee St-Onge, an Alberta Wildfire information officer, said favourable winds should push the fire from the city, but weather can change at any point.\nAnother much smaller wildfire has popped up, about three kilometres north of Fort McMurray, west of Highway 63 and north of Parsons Creek.\nThis is the second time Fort McMurray, a city of 68,000, has been forced to flee the flames."}, {"id": "64002aba-9aad-4543-a785-d7fbb80d50d2", "title": "First song from NTR Jr  Devara  to be out on actor birthday eve", "date": "2024-05-16 07:30", "url": "https://www.siasat.com/first-song-from-ntr-jrs-devara-to-be-out-on-actors-birthday-eve-3027274/", "message": "Mumbai: This birthday will be extremely special for NTR Jr’s fans as the makers of ‘Devara Part 1’ are all set to release the first single from the film.\nAnnouncing the same on social media with a film poster, team ‘Devara’ unveiled that the song is created by musician Anirudh Ravichander and wrote, “ALL SET for the mighty storm.\n#DevaraFirstSingle ~ #FearSong will unleash tsunami of madness that will sweep through every coast on May 19th An @anirudhofficial Musical.”The track will be out on May 19 – NTR Jr’s birthday eve.\nThe magnum opus is produced by Yuvasudha Arts and NTR Arts and presented by Nandamuri Kalyan Ram.\nThe Pan-India film, co-starring Saif Ali Khan and Janhvi Kapoor in key roles, ‘Devara: Part 1’ will hit theatres on October 10."}, {"id": "e61220b1-2cba-4755-b638-128660911c40", "title": "Houston under flood watch Thursday ahead of soaking rains", "date": "2024-05-16 00:15", "url": "http://www.houstonchronicle.com/news/houston-weather/forecast/article/houston-texas-flood-watch-weather-19460286.php", "message": "He brings five years of experience forecasting tropical systems, severe weather outbreaks, and blizzards to the Houston Chronicle.\nJustin looks forward to his work with the Houston Chronicle, where he'll be responsible for posting daily weather forecasts.\nOn top of daily forecasts, he is excited to tackle more in-depth weather and climate stories that impact the residents of Southeast Texas.\nA North Carolina native, Justin joined the Chronicle in July 2023.\nHe graduated with his bachelor's degree in meteorology from the University of North Carolina at Charlotte in December 2017."}, {"id": "f735cffc-3985-4d60-95f5-39cd49849f04", "title": "Cities look for new ways to keep people safe and alive as extreme summer heat looms", "date": "2024-05-16 10:45", "url": "https://www.nbcnews.com/science/science-news/cities-prepare-extreme-heat-summer-rcna151029", "message": "“We prepare for heat year-round in Phoenix,” Mayor Kate Gallego said.\nThe 2023 heat waves revealed how challenging it can be to cope with extreme temperatures for weeks on end, even in places where residents are accustomed to warm weather.\nThat has prompted cities across the South and the Southwest to re-evaluate how best to keep people safe — and alive — this summer.\nGallego said Phoenix has been creating “cool corridors” by planting trees and resurfacing the pavement with more reflective coatings to reduce urban heat.\nA primary focus right now is mitigating high overnight temperatures, which plagued the city last summer."}, {"id": "4d1aa585-ae98-4d56-aa93-2f07a31105c2", "title": "Devara Part 1 : First Single of Jr NTR starrer to be unveiled on his birthday eve : Bollywood News", "date": "2024-05-16 07:45", "url": "https://www.bollywoodhungama.com/news/south-cinema/devara-part-1-first-single-jr-ntr-starrer-unveiled-birthday-may-19/", "message": "Jr NTR is all set to take theatres by storm this year after the stupendous success of RRR, with Devara: Part 1 starring Janhvi Kapoor and Saif Ali Khan.\nWhile fans eagerly are awaiting the release of the magnum opus, adding to all the anticipation, we hear Jr NTR will treating his millions fans with the ultimate return gift on his birthday which falls on May 20.\nFollowing a recent teaser which were unveiled by the film’s makers on social media, it’s now confirmed that the first single titled ‘Fear Song’ from this mass action entertainer will release on Jr NTR’s birthday Eve on May 19.\nThe big announcement will definitely have sparked massive celebration among fans who celebrate his birthday like a festival each year.\nAlso Read: Biz Talk: Prabhas, Allu Arjun, Jr NTR, Ram Charan, Kamal Haasan and Suriya to rescue Bollywood from box office drought this yearBOLLYWOOD NEWS - LIVE UPDATESCatch us for latest Bollywood News, New Bollywood Movies update, Box office collection, New Movies Release , Bollywood News Hindi, Entertainment News, Bollywood Live News Today & Upcoming Movies 2024 and stay updated with latest hindi movies only on Bollywood Hungama."}, {"id": "e0def361-dfb4-4622-9ba0-391e46756731", "title": "U . S . spacecraft snap stunning views of auroras encircling Earth", "date": "2024-05-16 14:00", "url": "https://mashable.com/article/aurora-northern-lights-space-view", "message": "A view from above Earth showing the vibrant auroras on May 11, 2024.\nA view from above Earth showing the vibrant auroras on May 11, 2024. Credit: NOAAA parade of intense solar storms have hit Earth — the strongest since Halloween over 20 years ago.\n\"It's like scooping up a piece of the sun and ejecting it into space,\" Mark Miesch, a scientist with the National Oceanic and Atmospheric Administration's Space Weather Prediction Center, previously told Mashable.\nWhen they collide with Earth, solar particles can become trapped by our planet's magnetic field, traveling to the poles and colliding with the molecules and particles in our atmosphere.\nThe expansive auroras as seen from space on May 11, 2024. Credit: NOAAMore intense solar activity may lead to more vivid auroras in 2024."}, {"id": "3fbbf574-efc4-49c2-ad82-224eb90a6620", "title": "Construction of Kasoa storm drains expected to take 17 months - Ghana Hydrological Authority", "date": "2024-05-16 06:45", "url": "https://www.ghanaweb.com/GhanaHomePage/business/Construction-of-Kasoa-storm-drains-expected-to-take-17-months-Ghana-Hydrological-Authority-1931045", "message": "Business News of Thursday, 16 May 2024Source: rainbowradioonline.comThe Ghana Hydrological Authority has announced that the construction of storm drains to address chronic flooding on the Mallam-Kasoa Highway is expected to take 17 months.\nFrancis Asenso-Boakye, the roads minister, toured the area to assess the situation and later assured the press that the government would construct storm drains to help address the issue.\nRichard Kofi Ameko, Head of Drainage at the Ghana Hydrological Authority, also informed the Minister that the Authority has developed a plan to handle the crisis, scheduled to be completed within the next 17 months.\n\"We've completed phase one; this is phase two, and it's about a 17-month project,\" he explained.\nDr. Daniel Sowah, Works Engineer of the Ga South Municipal Assembly, indicated that the Ghana Highway Authority is working on a solution to manage the situation."}, {"id": "bf14b810-42a7-4095-a341-352f5ba57b6e", "title": "Brazil Flooded South Paralyzed As Waters Remain High", "date": "2024-05-16 04:45", "url": "https://menafn.com/1108219647/Brazils-Flooded-South-Paralyzed-As-Waters-Remain-High", "message": "Regional capital Porto Alegre's international airport remains under water, as do agricultural fields and roads, while more than 360,000 students were not in school.\n“It is not the moment to return to homes in risk zones,” state governor Eduardo Leite told a press conference.\nThe Guaiba, an estuary bordering Porto Alegre which overflows when waters hit three metres, reached a historic high of 5.3 metres last week.\n“We are experiencing the aftermath of an endless drama here in Rio Grande do Sul,” the state's deputy governor Gabriel Souza told the Globo broadcaster.\nConcordia Mayor Francisco Azcue said waters were expected to continue to rise in the coming days."}, {"id": "179b272a-4ae5-41b7-a59c-9dbf1a51e596", "title": "Weather Alert : Flash flood potential continues this morning . ", "date": "2024-05-16 10:45", "url": "https://turnto10.com/weather/weather-blog/weather-alert-flash-flood-potential-continues-this-morning", "message": "6:30 AM UPDATE: An areal flooding has been issued for much of the region until 9:30 AM.\nAs expected, a wide swath of 1-3\" of rainfall is being reported across the region this morning.\nGreen Airport has surpassed the 1\" mark, places along the south coast are nearing 4\".\nThe heaviest rain this morning has been slowly shifting from the south coast northward towards Providence.\nMore off and on showers are expected through the afternoon before the rain comes to an end tonight."}, {"id": "41290d17-ca78-4b3f-8f3c-0a95dccef156", "title": "GMet alert : Two rainstorms set to hit Ghana , residents urged to prepare", "date": "2024-05-16 12:15", "url": "https://www.businessghana.com/site/news/General/306886/GMet-alert:-Two-rainstorms-set-to-hit-Ghana,-residents-urged-to-prepare", "message": "Their morning forecast pinpointed the arrival of dual rainstorms, with the Nigerian storm projected to make landfall around 9:30 am.\nRegions along the coast and in the north are anticipated to bear the brunt of heavy downpours, accompanied by robust winds and thunderous conditions.\nThe statement elaborated, “A rainstorm that is moderately producing thunderstorms with rain over northern Benin into Togo is expected to drift further westwards to affect the northern half of Ghana.\nHowever, a separate rainstorm observed over Nigeria is also expected to propagate westwards to affect the coastal and middle sectors of the country.”GMet emphasised the heightened risk of flooding and wind damage, urging residents in vulnerable areas to remain vigilant and take necessary precautions."}, {"id": "4c955104-59e7-46a7-81ca-28207a32630c", "title": "Storms arrive tonight with multiple rounds into the weekend", "date": "2024-05-16 14:00", "url": "https://www.fox8live.com/2024/05/16/storms-arrive-tonight-with-multiple-rounds-into-weekend/", "message": "NEW ORLEANS (WVUE) - A stormy period is expected to develop over the region starting tonight and continuing into the weekend.\nThere will be a small shower chance this morning but as the day progresses, dry skies will become more likely.\nOur first storm threat develops overnight tonight as a line of strong to severe storms move in around midnight.\nI’m not too concerned about flooding with tonight’s round of storms as it should be moving pretty quickly.\nThe second round of storms develops later Friday in the late afternoon and evening."}, {"id": "45156b75-7e15-4417-a593-e31f1a47b149", "title": "Help available for Pointe Coupee residents ahead of new round of storms", "date": "2024-05-16 04:00", "url": "https://www.wbrz.com/news/help-available-for-pointe-coupee-residents-ahead-of-new-round-of-storms", "message": "Help available for Pointe Coupee residents ahead of new round of stormsPOINTE COUPEE - As a new round of storms is set to roll in this week, some residents in Pointe Coupee Parish are just starting to clean up from the damage caused Monday.\nPointe Coupee fire district 4 firefighters were handing out free tarps before the next round of storms hit.\nTerence Sellers was there picking up some after trees crashed into his family's trailer home.\nSellers said he's still nervous about what's to come, especially since they're still without power, with no estimate on when it'll come back.\n“I usually don't get nervous but this one made me really nervous with all the wind that was blowing."}, {"id": "2a5e1d3c-ee52-45f8-ac25-f09967d38987", "title": "Omaha area flash flood warning expires", "date": "2024-05-16 04:30", "url": "https://omaha.com/news/local/weather/omaha-area-flash-flood-warning-expires/article_05926272-1308-11ef-8cc5-0316b0405c6f.html", "message": "Parts of the Omaha metro area was under a flash flood warning as strong rains moved through the area Wednesday evening.\nA Flash Flood Warning was issued until 8 p.m. for Omaha, Council Bluffs and La Vista, according to the National Weather Service.\nBecky Kern, warning coordination meteorologist with the NWS office in Valley, said they had received unofficial reports of rain falling at a rate of more than 3 inches per hour in parts of the Omaha area.\nThe weather service issued a reminder on social media to not drive through flooded roadways.\nThe Omaha Public Power District said more than 3,600 customers were without power as of 5:15 p.m. due to a circuit outage in northwest Omaha and another in north central Omaha."}, {"id": "8eafadc8-414f-466c-aff2-e16b6426f5e1", "title": "Canada oil sands wildfires expected to die down , but summer fire season approaches", "date": "2024-05-16 12:15", "url": "https://www.foxnews.com/world/fires-expected-die-down-canadas-oil-sands-summer-fire-season-approaches", "message": "But scientists have said it's not clear that wildfire smoke will be the same problem it was last year, when unusual weather patterns drove the haze southward.\n\"We’ve come to accept columns of smoke blocking out the whole sky and yet we’re still drilling for oil.\"\nAlberta, the province that includes Fort McMurray, draws significant revenue from the fossil fuel industry.\nFire officials said evacuation orders would likely be in place in Fort McMurray until Tuesday.\nCLICK HERE TO GET THE FOX NEWS APP\"They just never bothered to tell the people in Fort McMurray who are living with the consequences of peak C02,\" Angus wrote."}, {"id": "930b9b26-677d-4a3c-87e8-c2f87154ef79", "title": "Oilsands capital of Canada now grappling with second wildfire", "date": "2024-05-16 11:30", "url": "https://www.bnnbloomberg.ca/oilsands-capital-of-canada-now-grappling-with-second-wildfire-1.2073586", "message": "The unofficial capital of Canada’s oilsands industry is now facing a second wildfire that’s north of the city and closer to major energy operations.\nThe new blaze near Fort McMurray, Alberta, is about 3 hectares (7 acres) in size, and is about 10 kilometers (6 miles) away from Suncor Energy Inc.’s Millennium and Steepbank mine sites, provincial data show.\nAlready, more than 6,000 people have been evacuated from Fort McMurray communities, and long-term prospects of rain extinguishing the blazes are low.\nSuncor, which operates oil-sands mines to the north of the city, said the latest fire hasn’t affected operations.\nWinds were expected to weaken and push the fire away from Fort McMurray, helping firefighting efforts."}, {"id": "f4303c5d-a5b8-45ee-b01f-a11b0b18bc49", "title": "Insurance Premiums Are Heating Up in States Prones to Wildfires", "date": "2024-05-16 01:30", "url": "https://robbreport.com/shelter/homes-for-sale/wildfires-raising-home-insurance-rates-1235618129/", "message": "“She wanted to renegotiate.”Then, in March, State Farm announced that it was discontinuing fire insurance policies across the state ahead of the 2024 wildfire season.\n“She wanted to renegotiate.”Then, in March, State Farm announced that it was discontinuing fire insurance policies across the state ahead of the 2024 wildfire season.\nMorris told the news site that after the American International Group canceled his policy in 2022, he switched over to a $22,000 per year plan with State Farm.\n“It’s a problem that’s not going away.”Insurance companies including State Farm have pulled out of California due to wildfire risks.\nPaul Bersebach/MediaNews Group/Orange County Register via Getty ImagesIt’s a similar story in Florida, where insurance rates tripled over the last three years."}, {"id": "6309d307-fb9f-40bc-b8e0-7e240770307d", "title": "Texas renewable energy sources : ABC13 tours new Wharton Co . wind farm Prairie Switch Wind Project near Highway 59", "date": "2024-05-16 00:15", "url": "https://abc13.com/post/prairie-switch-wind-project-farm-in-wharton-county-southeast-texas-turbines-renewable-energy-source/14815678/", "message": "ONLY ON ABC13: A closer look at southeast Texas' 1st wind farm ahead of its ribbon cutting ceremonyBehind the scenes with Fengate's Prairie Switch Wind Project at a new wind farm in Wharton County near Highway 59, the first in southeast Texas.\nBehind the scenes with Fengate's Prairie Switch Wind Project at a new wind farm in Wharton County near Highway 59, the first in southeast Texas.\nBehind the scenes with Fengate's Prairie Switch Wind Project at a new wind farm in Wharton County near Highway 59, the first in southeast Texas.\nBehind the scenes with Fengate's Prairie Switch Wind Project at a new wind farm in Wharton County near Highway 59, the first in southeast Texas.\nWHARTON COUNTY, Texas (KTRK) -- Down Highway 59 in central Wharton County, 48 towering turbines are now spinning at the Prairie Switch Wind Project."}, {"id": "141ac141-3f43-4028-b202-41091bc2b833", "title": "Oil - Sands Capital of Canada Now Grappling With Second Wildfire", "date": "2024-05-16 09:45", "url": "https://www.insurancejournal.com/news/international/2024/05/16/774400.htm", "message": "The unofficial capital of Canada’s oil-sands industry is now facing a second wildfire that’s north of the city and closer to major energy operations.\nThe new blaze near Fort McMurray, Alberta, is about 3 hectares (7 acres) in size, and is about 10 kilometers (6 miles) away from Suncor Energy Inc.’s Millennium and Steepbank mine sites, provincial data show.\nAlready, more than 6,000 people have been evacuated from Fort McMurray communities, and long-term prospects of rain extinguishing the blazes are low.\nWinds were expected to weaken and push the fire away from Fort McMurray, helping firefighting efforts.\nTopics Catastrophe Natural Disasters Wildfire Energy Oil Gas Canada"}, {"id": "775f664b-ffad-4b9b-9ab4-010df6dc6861", "title": "Fear , anxiety in Fort McMurray as people watch wildfire approach the city", "date": "2024-05-16 02:15", "url": "https://www.theglobeandmail.com/canada/alberta/article-fear-anxiety-in-fort-mcmurray-as-people-watch-wildfire-approach-the/", "message": "Open this photo in gallery: Trees burned in the 2016 wildfire in Fort McMurray, Alta., stand sentinel over a neighbourhood in the city on May 15.\nAnd when fire started to threaten Fort McMurray this year, she packed more bags.\n“My nerves are just shot,” Mr. Grant said Wednesday afternoon, in the yard where they rebuilt their home in Fort McMurray.\nThe smoke turned the sky grey over Fort McMurray on Wednesday, with the odd helicopter flying overhead.\nPremier Danielle Smith acknowledged the fear and uncertainty blanketing Fort McMurray and offered her sympathy to residents."}, {"id": "3d919369-76aa-4a27-9ff5-1d491540382e", "title": "Fire threat eases near Canada oil sands hub , but a long , hot summer looms", "date": "2024-05-16 04:15", "url": "https://www.columbian.com/news/2024/may/15/fire-threat-eases-near-canadas-oil-sands-hub-but-a-long-hot-summer-looms/", "message": "The threat from a wildfire near Canada’s oil sands hub of Fort McMurray, Alberta, appeared to be easing on Wednesday, a day after it forced thousands of residents to evacuate and stirred memories of a damaging blaze nearly a decade earlier.\nFavorable winds were expected to push the fire away from the city of about 68,000 in northwest Canada, where many residents earn a paycheck from the nearby oil industry.\nBut scientists have said it’s not clear that wildfire smoke will be the same problem it was last year, when unusual weather patterns drove the haze southward.\nIn Fort McMurray, about 6,600 residents fled parts of the city’s southern end while others were on on alert.\nIt was familiar terrain for the Albertan city, which survived a catastrophic blaze in 2016 that destroyed 2,400 homes and forced more than 80,000 people to flee."}, {"id": "84932c85-52e2-41e4-9777-c885e3b16385", "title": "Natural Disasters Are Making It Harder for Wealthy Homeowners to Insure Their Properties", "date": "2024-05-16 00:00", "url": "https://finance.yahoo.com/news/natural-disasters-making-harder-wealthy-220000573.html", "message": "“She wanted to renegotiate.”More from Robb ReportThen, in March, State Farm announced that it was discontinuing fire insurance policies across the state ahead of the 2024 wildfire season.\n“She wanted to renegotiate.”Then, in March, State Farm announced that it was discontinuing fire insurance policies across the state ahead of the 2024 wildfire season.\nMorris told the news site that after the American International Group canceled his policy in 2022, he switched over to a $22,000 per year plan with State Farm.\n“It’s a problem that’s not going away.”Insurance companies including State Farm have pulled out of California due to wildfire risks.\nIt’s a similar story in Florida, where insurance rates tripled over the last three years."}, {"id": "47c582e0-df66-4fb0-97f0-7e315945180c", "title": "Tropics watch : National Hurricane Center tropical outlook . See what weather is out there", "date": "2024-05-16 14:00", "url": "https://www.yahoo.com/news/tropics-watch-national-hurricane-centers-121746633.html", "message": "The National Hurricane Center's second tropical outlook for the 2024 Atlantic hurricane season is out.\nForecasters with the National Hurricane Center didn't highlight any tropical cyclones or tropical waves in Thursday morning's outlook.\nWeather watches and warnings issued in FloridaWhen is the Atlantic hurricane season?\nThe Atlantic hurricane season runs from June 1 through Nov. 30.\nThis article originally appeared on Treasure Coast Newspapers: Hurricane season: NHC forecasts no tropical cyclone activity 7 days"}, {"id": "188c9623-2503-42ce-97c4-5b283b01ec50", "title": "Buckle Up For More Dust Storms Thanks To Land Degradation , Climate Change", "date": "2024-05-16 02:45", "url": "https://www.freepressjournal.in/analysis/buckle-up-for-more-dust-storms-thanks-to-land-degradation-climate-change", "message": "In India dust storm and thunderstorm activity usually peak in the pre-monsoon period, between March and May.\nThe worst sand and dust storms India experienced was on May 2, 2018 when severe dust storms, thunderstorms and lightning hit several parts of India, resulting in the deaths of at least 124 people and injuries to 300 others.\nClimate change — which is bringing droughts and more extreme temperatures — is amplifying these factors.\nIn some areas, desert dust has doubled in the 20th century, increasing the chance of sand and dust storms.\nCombating sand and dust storms requires accelerated action and relevant capacity in multiple- hazard risk reduction for both adaptation and mitigation."}, {"id": "9106fab5-fc42-4fa8-aa33-e6fba386cbb7", "title": "Turn Around Dont Drown : More Flooding Possible in So . Indiana", "date": "2024-05-16 03:00", "url": "https://103gbfrocks.com/turn-around-indiana-flooding/", "message": "Recent rains have caused flooding in some Southern Indiana neighborhoods, and the National Weather Service is predicting more rainfall in the coming days.\nSo here is your reminder of the importance of the phrase Turn Around Don't Drown.\nThe National Weather Service has issued a Hazardous Weather Outlook for a number of counties in Indiana, Kentucky, and Illinois, including Vanderburgh, Warrick, Posey, and Henderson Counties.\nTurn Around Don't DrownWith the possibility of flash flooding in the forecast, it felt like the right time to remind you: Turn Around Don't Drown.\n[Source: National Weather Service]"}, {"id": "3249928e-36d1-4175-80cb-9cb3e2e28789", "title": "Tampa Safety Concerns", "date": "2024-05-16 14:00", "url": "https://www.wduv.com/news/tampa-safety-concerns/OVKPZW4FZ5DJ3JK6ZKB6VDCBDQ/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "262ae2f9-fcbe-4b0b-8e77-ff728f397adc", "title": "Coimbatore Corporation must implement pre - emptive measures ahead of heavy rain , say experts", "date": "2024-05-16 14:15", "url": "https://www.thehindu.com/news/cities/Coimbatore/coimbatore-corporation-must-implement-pre-emptive-measures-ahead-of-heavy-rain-say-experts/article68182774.ece", "message": "As the district is expected to get heavy rain in the coming days, residents have urged Coimbatore Corporation take a three-fold approach to tackle monsoon-related problems: clean stormwater drains, promote rainwater harvesting, and check electric lines.\n“Once the monsoon arrives, we often witness flooded underpasses and unfortunate cases of electrocution, all pointing to the unpreparedness of the civic body,” said J. Jayaprakash, a resident.\nAccording to the Corporation, areas near the seven smart city lakes are susceptible to flooding because of their low-lying terrain, particularly along Selvachintamani tank and Valankulam, which are downstream.\n“We have also begun cleaning storm water drains across the city.\n“Today, no civic body can afford to waste rainwater."}, {"id": "52e99fc6-6720-4bc1-9f36-c300471ebdb8", "title": "Update : Allegheny County under a flash flood warning Wednesday night", "date": "2024-05-16 02:45", "url": "https://www.pennlive.com/weather-alerts/2024/05/allegheny-county-under-a-flash-flood-warning-wednesday-night.html", "message": "On Wednesday at 9:04 p.m. the National Weather Service issued an updated flash flood warning in effect until 10:30 p.m. for Allegheny County.\n\"Flash flooding of small creeks and streams, urban areas, highways, streets and underpasses as well as other poor drainage and low-lying areas.\"\nUnderstanding the differences between advisories, watches, and warningsFlash flood warning: Take action!\nA flash flood warning is issued when a flash flood is imminent or occurring.\nA flash flood is a sudden violent flood that can take from minutes to hours to develop."}, {"id": "a08f6e71-9768-4c78-9d29-0e067a1fc044", "title": "Strictly Johannes Radebe as youve never seen him before ! ", "date": "2024-05-16 12:15", "url": "https://www.dailymail.co.uk/tvshowbiz/johannes-radebe/article-13425407/Strictlys-Johannes-Radebe-youve-never-seen-pro-dancer-dons-dress-foliage-upcoming-Chelsea-Flower-Show.html", "message": "Strictly's Johannes Radebe donned a flower dress on Thursday to promote WaterAid's rain garden the Chelsea Flower Show at the Royal Hospital Chelsea in London.\nThe flowers on Johannes' outfit were drought-resistant to promote WaterAid’s new rain garden which will debut at the Show in May.\n'WaterAid is doing amazing work helping get clean water to people, and their garden at Chelsea Flower Show next week will highlight the crucial importance of clean water for all, whatever the weather.'\nThe RHS Chelsea Flower Show, formally known as the Great Spring Show, begins on May 21 and ends on May 25.\n'Everyone needs clean water so we can all stay safe, healthy and thrive."}, {"id": "e154e507-b901-40c2-bcb9-b4336892f46b", "title": "Mysterious bang at Saltwater Point , NSW | Manning River Times", "date": "2024-05-16 08:15", "url": "https://www.manningrivertimes.com.au/story/8631440/mysterious-bang-at-saltwater-point-nsw/?cs=2681", "message": "The Volcano Discovery website reported: \"A possible earthquake might have occurred near Forster, New South Wales, Australia, in the morning of Thursday, May 16, 2024 at around 10.42am local time (GMT +10).\nDetails of the quake (if it is one) are so far unkown until confirmed by a seismic agency, but the event was reported felt.\nWe will update the status of the event on this page as soon as more information becomes available.\""}, {"id": "be06623d-08e3-484e-937f-6d29891b9b26", "title": "Mysterious bang at Saltwater Point , NSW | Great Lakes Advocate", "date": "2024-05-16 07:45", "url": "https://www.greatlakesadvocate.com.au/story/8631440/mysterious-bang-at-saltwater-point-nsw/?cs=2726", "message": "The Volcano Discovery website reported: \"A possible earthquake might have occurred near Forster, New South Wales, Australia, in the morning of Thursday, May 16, 2024 at around 10.42am local time (GMT +10).\nDetails of the quake (if it is one) are so far unkown until confirmed by a seismic agency, but the event was reported felt.\nWe will update the status of the event on this page as soon as more information becomes available.\""}, {"id": "6ffb658a-ba8c-423a-ba52-dfbb0bd92625", "title": "Mysterious bang at Saltwater Point , NSW | Great Lakes Advocate", "date": "2024-05-16 12:15", "url": "https://www.greatlakesadvocate.com.au/story/8631440/mysterious-bang-at-saltwater-point-nsw/?cs=305", "message": "The Volcano Discovery website reported: \"A possible earthquake might have occurred near Forster, New South Wales, Australia, in the morning of Thursday, May 16, 2024 at around 10.42am local time (GMT +10).\nDetails of the quake (if it is one) are so far unkown until confirmed by a seismic agency, but the event was reported felt.\nWe will update the status of the event on this page as soon as more information becomes available.\""}, {"id": "0f00ef8a-4a33-471e-bfc5-e610498a90de", "title": "Mysterious bang at Saltwater Point , NSW | Great Lakes Advocate", "date": "2024-05-16 10:15", "url": "https://www.greatlakesadvocate.com.au/story/8631440/mysterious-bang-at-saltwater-point-nsw/", "message": "The Volcano Discovery website reported: \"A possible earthquake might have occurred near Forster, New South Wales, Australia, in the morning of Thursday, May 16, 2024 at around 10.42am local time (GMT +10).\nDetails of the quake (if it is one) are so far unkown until confirmed by a seismic agency, but the event was reported felt.\nWe will update the status of the event on this page as soon as more information becomes available.\""}, {"id": "ad213b7c-f6e3-4c98-b5ad-b38686dc7e03", "title": "Mysterious bang at Saltwater Point , NSW | Manning River Times", "date": "2024-05-16 11:15", "url": "https://www.manningrivertimes.com.au/story/8631440/mysterious-bang-at-saltwater-point-nsw/?cs=305", "message": "The Volcano Discovery website reported: \"A possible earthquake might have occurred near Forster, New South Wales, Australia, in the morning of Thursday, May 16, 2024 at around 10.42am local time (GMT +10).\nDetails of the quake (if it is one) are so far unkown until confirmed by a seismic agency, but the event was reported felt.\nWe will update the status of the event on this page as soon as more information becomes available.\""}, {"id": "71af0c98-045f-4828-8d74-f9cc4e445eee", "title": "DeSantis signs bill deleting climate change mentions from Florida state law", "date": "2024-05-16 00:00", "url": "https://us.cnn.com/2024/05/15/politics/desantis-bill-climate-change-florida/", "message": "CNN —As Florida copes with rising seas and record temperatures, lawmakers are going to exceptional lengths to delete many mentions of climate change from state laws in a new bill that Republican Gov.\nThe wide-ranging law makes several changes to the state’s energy policy – in some cases deleting entire sections of state law that talk about the importance of cutting planet-warming pollution.\n“It goes further than any other state has gone in repealing its existing climate laws,” Michael Gerrard, founder of the Sabin Center for Climate Change Law at Columbia University, told CNN.\nDeSantis vetoed over $29 million dollars in federal energy rebates and energy efficiency grants from the Inflation Reduction Act and Bipartisan Infrastructure Law.\nHammond called focusing on adapting to climate change and hardening infrastructure without attribute it to a warming planet “consistent to the conservative approach.”“They don’t want to acknowledge that climate change is happening; they acknowledge they have flooding,” Gerrard said."}, {"id": "9e2e2cb7-8ce1-49e3-9745-17ffc600ab5f", "title": "Climate change brings rising Lake Michigan water levels . Art Museum , Summerfest , others respond", "date": "2024-05-16 11:15", "url": "https://www.yahoo.com/news/climate-change-brings-rising-lake-100425880.html", "message": "Lake levels fluctuate ― with climate change bringing big swingsRunoff and precipitation add water to Lake Michigan, with evaporation and diversions removing water.\nIncreased lake levels bring challengesLong-term increases in Great Lakes water levels will bring some big challenges.\n\"Higher lake levels mean that storms, flooding events and natural variability will have more extreme impacts on the lake shores, and coastal decision makers will have to adapt to higher lake levels in the coming years,\" the article said.\n\"We are actively watching water level trends and considering record water levels with any construction project,\" Dieckelman said.\nThe subjects are Bay View Park, Bender Park, Big Bay Park, Bradford Beach and McKinley Park, Cupertino Park, Doctors Park, Grant Park, Lake Park/Linnwood Revetment, Sheridan Park, South Shore Park, Veterans Park and Warnimont Park."}, {"id": "50125f59-4d79-4db8-8ee2-0b526778a6f3", "title": "Tyson Foods CEO Unsure When Nation Collapsing Beef Herd Will Reverse", "date": "2024-05-16 00:15", "url": "https://www.zerohedge.com/commodities/tyson-foods-ceo-unsure-when-nations-collapsing-beef-herd-will-reverse", "message": "Tyson Foods CEO Donnie King spoke at the BMO Global Farm to Market Conference in Toronto on Wednesday, expressing much uncertainty about when US ranchers will rebuild tight cattle herds meaningfully.\nHe stated ranchers had been pressured in recent years to offload cattle due to high grain costs and drought, which, in return, sent the nation's beef cattle herd plunging to the lowest in more than half a century.\nAll in all, King's comments did not provide confidence that the nation's beef cattle herd would reverse from seven-decade lows as ranches continue offloading cows to slaughterhouses.\nThe latest figures from the US Department of Agriculture show that the nation's cattle herd is 87.2 million head (as of Jan. 1), the lowest level since 1951.\nThis perfect storm has sent beef prices at the supermarket to record highs."}, {"id": "ad981986-33f2-47f2-ac7a-8d71580de9a5", "title": "4 . 0 Magnitude Earthquake Reported In US | NewsRadio 1450 / 1370 WKIP", "date": "2024-05-16 00:00", "url": "https://1450wkip.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "7a56cdb4-ac43-4c14-a38f-c9352c4e30ff", "title": "4 . 0 Magnitude Earthquake Reported In US", "date": "2024-05-16 00:00", "url": "https://kprcradio.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "afab58f9-a880-4f96-90b0-3be40f743649", "title": "4 . 0 Magnitude Earthquake Reported In US | News Talk 99 . 5 WRNO", "date": "2024-05-16 00:00", "url": "https://wrno.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "af3a1218-a6d5-43f4-a893-118d9373e916", "title": "4 . 0 Magnitude Earthquake Reported In US | Newsradio WTAM 1100", "date": "2024-05-16 00:00", "url": "https://wtam.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "fe12462f-ed97-447b-bf1f-cfd6c6d836f4", "title": "4 . 0 Magnitude Earthquake Reported In US", "date": "2024-05-16 00:00", "url": "https://600wrec.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "6d1bc21b-5a6b-42ce-b2cc-2aa0a8b8afe9", "title": "4 . 0 Magnitude Earthquake Reported In US | Talk Radio 105 . 9", "date": "2024-05-16 00:00", "url": "https://knrs.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "01a93ee4-99d0-47e1-8d70-b9a3cd3f8733", "title": "Wildfire updates today : Fort McMurray , Fort Nelson", "date": "2024-05-16 11:15", "url": "https://www.ctvnews.ca/climate-and-environment/latest-updates-on-the-major-wildfires-currently-burning-in-canada-1.6889304", "message": "FORT MCMURRAY, Alta.\n-Bright red hoses thicker than a thigh snake along the highways near Fort McMurray, studded with cannons that can blast enough water into fire-threatened ditches to fill an Olympic-sized swimming pool every 90 minutes.\nThis is the second time Fort McMurray, a city of 68,000, has been forced to flee the flames.\nA view of the Parker Lake wildfire near Fort Nelson, B.C.\nA wildfire burns in northern Manitoba near near Flin Flon, as seen from a helicopter surveying the situation, Tuesday, May 14, 2024."}, {"id": "b89a1fd9-3688-4ccd-8b87-43c4267ed2ef", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 07:15", "url": "https://kpic.com/news/local/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said."}, {"id": "0c4cd662-41fe-45ae-9347-8cd8f0bcc314", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 04:30", "url": "https://kcby.com/news/local/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said."}, {"id": "fec15f7e-7581-4186-87e5-12479238f4ae", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 06:30", "url": "https://nbc16.com/news/wildfires/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said."}, {"id": "d859f9e8-cfd7-46f3-a1e6-fb5e1a702e08", "title": "Flagstaff scientists to use satellites to spot new wildfires", "date": "2024-05-16 04:15", "url": "https://www.azfamily.com/2024/05/16/flagstaff-scientists-aim-use-satellites-spot-wildfires-within-minute-their-start/", "message": "PHOENIX (AZFamily) — The fight to prevent destructive wildfires is a global issue, and scientists right here in Arizona are at the forefront.\nAlexander Shenkin, an assistant research professor at Northern Arizona University, said all the fires are costing money, homes and forests.\nThat’s led NAU scientists, Flagstaff engineers, and fire leaders with the same passion for preventing wildfires to come together.\n“This thing I’m holding is a 3D print one-to-one scale model of the camera that we’re going to put on our satellites,” Trilling said.\n“Say 100 million bucks to stick this constellation of satellites in the air,” Shenkin said."}, {"id": "74c37c28-bcc1-460d-a7d7-1d03eeeb1f17", "title": "Light magnitude earthquake hits Stilfontein in North West", "date": "2024-05-16 08:15", "url": "https://www.citizen.co.za/news/south-africa/earthquake-hits-stilfontein-north-west/", "message": "Light magnitude earthquake hits Stilfontein in North WestThe quake was felt by many near the epicentre.\nAccording to Volcano Discovery, the 3.5 earthquake hit 15.6 km away from Stilfontein just after 10am on Wednesday.\nPicture: iStockThere were no reports of any damages or injuries after a light magnitude earthquake hit the North West province.\nJust two weeks later, on 29 June, Johannesburg residents were shaken awake by a 2.9 magnitude quake originating in Soweto.\nALSO READ: 2.5 magnitude earthquake rattles parts of Joburg and West Rand"}, {"id": "fab0bc3d-9a66-47d3-8c4d-318cbce67db1", "title": "A vital , mostly invisible undersea industry is facing a labor shortage", "date": "2024-05-16 12:45", "url": "https://www.marketplace.org/shows/marketplace-tech/labor-problems-facing-global-communication-infrastructure-repair-under-sea/", "message": "This vital industry is largely invisible and facing some big challenges.\nAnd so I wanted to find out more about it, and [that] happened to coincide with a period of change in the industry.\nAnd so I wanted to write about the challenges facing this extremely important, and I think, largely unknown industry.\nAnd so a lot of the people in this industry are, you know, have decades of experience, and are really knowledgeable.\nThat’s largely a result of the fact that most people don’t know the industry exists at all."}, {"id": "63240f84-dee2-43e5-81be-0574cd94af72", "title": "ESA - Canada wildfire season begins", "date": "2024-05-16 14:00", "url": "https://www.esa.int/Applications/Observing_the_Earth/Copernicus/Canada_s_wildfire_season_begins", "message": "Applications Canada’s wildfire season begins 16/05/2024 130 views 2 likesWildfire season has arrived in full force in Canada, prompting evacuation orders and alerts in several towns in British Columbia and Alberta due to the danger of uncontrolled blazes.\nThe 2023 wildfire season in Canada was one of the worst on record.\nWith the 2024 wildfire season already in full swing, Canadian authorities are bracing for a challenging summer.\nWildfire season in Canada typically runs from April until September or October when cooler temperatures dampen fire activity.\nAs the wildfire season progresses, ESA’s World Fire Atlas continues to be a valuable resource in tracking new fire outbreaks."}, {"id": "0526cdd6-d23d-49a3-a8c0-fba986a61ab6", "title": "Cities look for new ways to keep people safe and alive as extreme summer heat looms", "date": "2024-05-16 10:45", "url": "https://www.yahoo.com/news/cities-look-ways-keep-people-100556373.html", "message": "Ward and her colleagues specialize in “heat governance,” helping local and state governments prepare for extreme heat events.\nThe work includes finding ways to mitigate heat and develop emergency responses for major heat waves.\nWard said that it’s heartening to see cities take extreme heat seriously but emphasized that major challenges lie ahead.\nFor one, preparing early for extreme heat requires funding, which is a major challenge, especially for rural communities.\nEven trickier will be addressing the underlying social issues that get magnified during heat waves, such as homelessness, rising energy costs and economic inequality."}, {"id": "d120cc53-bec8-41f8-8c26-fd88722a2039", "title": "The Joint Recovery Action Plan ( JRAP ) in Nepal receives £13 Million from FCDO to meet the critical needs of Western Nepal Earthquake - affected population - Nepal", "date": "2024-05-16 10:45", "url": "https://reliefweb.int/report/nepal/joint-recovery-action-plan-jrap-nepal-receives-ps13-million-fcdo-meet-critical-needs-western-nepals-earthquake-affected-population", "message": "“The Joint Recovery Action Plan was developed to respond the needs of the disaster-affected communities and to build resilience,\" said Ms. Hanaa Singer Hamdy, the UN Resident and Humanitarian Coordinator in Nepal.\nThe funding will address the water sanitation and hygiene (WASH), nutrition, protection, shelter, and food security needs of approximately 50 thousand earthquake-affected people in western Nepal.\nThe Chief Executive of the NDRRMA Mr. Anil Pokhrel said, “FCDO has been consistently supporting the Government of Nepal’s Humanitarian Response including reconstruction and recovery.\nOut of the total funding need, FCDO is providing GBP 13 million (equivalent to USD 16.2 million).\nFor more information:Simrika SharmaE: simrika.sharma@un.orgNational Information Officer, UN Information CentrePrerana MarasiniE: Prerana.Marasini@fcdo.gov.ukCommunications Manager, British Embassy Kathmandu"}, {"id": "2de79966-9d19-4223-a6f2-326061a6a813", "title": "Canadian oil sands city evacuated as wildfire draws near", "date": "2024-05-16 01:00", "url": "http://www.jordantimes.com/news/world/canadian-oil-sands-city-evacuated-wildfire-draws-near", "message": "Resident Ashley Russell was packed and ready to leave on a moment’s notice, as the rest of the city was put on alert.\n“We’re seeing extreme fire behaviour,” Alberta Wildfire spokeswoman Josee St-Onge told a news conference.\nFears of 2016 repeatIn 2016, the entire city with a population of more than 90,000 was evacuated while production of 1 million barrels of oil per day — almost one third of Canada’s total output at the time — stopped.\nThousands of residents never returned to the city.\nRob Fraser, the mayor of Fort Nelson told AFP: “It’s cool, it’s overcast and the wind is just very slight."}, {"id": "1d570ece-2085-4f77-b09e-782c9b61e353", "title": "Canadian oil sands city evacuated as wildfire draws near", "date": "2024-05-16 00:45", "url": "http://jordantimes.com/news/world/canadian-oil-sands-city-evacuated-wildfire-draws-near", "message": "Resident Ashley Russell was packed and ready to leave on a moment’s notice, as the rest of the city was put on alert.\n“We’re seeing extreme fire behaviour,” Alberta Wildfire spokeswoman Josee St-Onge told a news conference.\nFears of 2016 repeatIn 2016, the entire city with a population of more than 90,000 was evacuated while production of 1 million barrels of oil per day — almost one third of Canada’s total output at the time — stopped.\nThousands of residents never returned to the city.\nRob Fraser, the mayor of Fort Nelson told AFP: “It’s cool, it’s overcast and the wind is just very slight."}, {"id": "a613b1ee-efc8-4ccd-818e-400f1b771824", "title": "Cranberry Portage wildfire evacuees could return home this weekend with rainy conditions expected - Winnipeg", "date": "2024-05-16 04:45", "url": "https://globalnews.ca/news/10499580/cranberry-portage-wildfire-evacuees-could-return-home-this-weekend-with-rainy-conditions-expected/", "message": "Send this page to someone via emailWith plenty of rain in the forecast the next few days in Northwestern Manitoba, provincial officials say evacuees forced from the area could return home by the weekend.\nThat optimistic outlook coming from the Manitoba Wildfire Service’s acting director Earl Simmons, who says while the fire near Flin Flon and Cranberry Portage hasn’t dropped in size, there’s some encouraging signs.\n“Our biggest concern at this time, the Cranberry Portage end of the fire, is probably 80 per cent contained, ” Simmons told 680 CJOB’s The News.\nThe province says the fire, that has caused around 580 people to evacuate, is around 31,600 hectares and impacting Cranberry Portage along with Sourdough Bay, Whitefish Lake, Twin Lakes, and Schist Lake North.\nThe latest provincial wildfire report shows that nine wildfires are burning in Manitoba, with two considered out of control."}, {"id": "567ecded-2fad-429f-975a-9a44a89b6d6e", "title": "Canada in the Year 2060 - Macleans . ca", "date": "2024-05-16 05:30", "url": "https://www.macleans.ca/society/environment/canada-in-the-year-2060/", "message": "Canada in the Year 2060 Summers lost to fire and smoke.\nAn Earth that’s two degrees hotter translates to a Canada at least four degrees hotter, on average.\nExtreme weather will cost Canada $100 billion every yearThere was a time, not that long ago, when some people imagined Canada would ride out climate change with relative ease.\nBy the 2060s, the CCI projects, Canada will have 500,000 fewer jobs than it would in a world without climate change.\n“Canada in the Year 2060” appears in the September issue of Maclean’s."}, {"id": "5a7b64ea-1b41-47b7-bc9c-7888e6647493", "title": "Farming : Farming activities resume in southern Karnataka and Malnad regions after heavy rain , farmers hopeful for good monsoon | Mysuru News", "date": "2024-05-16 00:15", "url": "https://timesofindia.indiatimes.com/city/mysuru/farming-activities-resume-in-southern-karnataka-and-malnad-regions-after-heavy-rain-farmers-hopeful-for-good-monsoon/articleshow/110160497.cms", "message": "Rain showers relief, raises farmers fearsCoastal Saurashtra experienced unseasonal rain, dust storms, and cyclonic circulation, providing relief from summer heat but causing fears of crop damage.\nPre-monsoon mayhem shows Bengaluru is woefully unpreparedHeavy pre-monsoon rain in Bengaluru exposed BBMP's poor preparedness, lack of coordination, and vulnerabilities in storm-water drains.\nMysuru: Agricultural activities in southern Karnataka and Malnad regions have resumed following heavy rain in the region.\nFarmers have started sowing with the expectation of a good monsoon season in the coming days.Meanwhile, the inflow to the major reservoirs of this region is also gradually increasing.\nAccording to the data from the Karnataka State Natural Disaster Monitoring Centre (KSNDMC), all districts in the region recorded excess rain in the last seven days.According to KSNDMC data, in the last seven days, all the districts of the region recorded excess rain."}, {"id": "3835b1fa-06e5-4904-aabc-87c3f2e016ca", "title": "9 , 600 tons of wildfire debris moving from Fritch to Canyon", "date": "2024-05-16 02:45", "url": "https://www.newschannel10.com/2024/05/15/9600-tons-wildfire-debris-moving-fritch-canyon/", "message": "FRITCH, Texas (KFDA) - The Fritch Recycling Center has become the temporary wildfire debris site, with a date set to move the debris to a landfill in Canyon.\n“Currently at the Fritch Recycling Center we have a temporary debris site set up with the TCEQ.\nOver 9,000 tons of wildfire debris from Fritch and Stinnett is currently sitting at the recycling center.\nTxDOT is now assisting in taking the debris to a landfill in Canyon and opening back up the recycling center for other needs.\nOfficials with the Fritch Recycling Center say the last day wildfire debris will be accepted is May 25."}, {"id": "b03b53b5-9469-4610-8075-9b4a49d08a22", "title": "Wow !  Extreme  geomagnetic storm creates beautiful aurora over NJ", "date": "2024-05-16 01:30", "url": "https://sojo1049.com/ixp/385/p/wow-extreme-geomagnetic-storm-creates-beautiful-aurora-over-nj/", "message": "🌠 Extreme geomagnetic storm puts power grids, satellites at risk🌠 The same solar flares make Northern Lights visible in New Jersey🌠 Send us your jaw-dropping photos!\nThe first extreme solar storm in two decades is affecting Earth this weekend, creating paintings in New Jersey's night sky.\nAccording to the National Oceanic and Atmospheric Administration, the extreme conditions first reached the planet around 7 p.m. Friday.\nNorthern Lights visible in New JerseyWhile no major disruptions have been detected as of 10 a.m. Saturday, this extreme geomagnetic storm is making its impact in New Jersey.\nAnd scroll down to see some of the most inspiring photos from last night's Northern Lights."}, {"id": "9dc44488-0cde-4b6f-ad39-943e0fc6e247", "title": "How rain gardens can help prevent stormwater runoff", "date": "2024-05-16 04:15", "url": "https://www.cbsnews.com/detroit/news/science-of-weather-rain-gardens/", "message": "But what is a rain garden?\nBarbara Lucas, who also has a rain garden, said the purpose of collecting rainwater off the roof is to prevent it from leaking into the street and storm drains.\n\"A rain garden is a great way to keep the water on your property and going down into the groundwater to refill our aquifer,\" Lucas said.\nDaley, who has two rain gardens, said she uses a lot of Michigan native plants in her garden, and there's a specific reason for that.\nThese native plants are smart enough to know the ways of Michigan weather, and they can handle it.\""}, {"id": "be36cf13-49e4-4355-bdde-7ce03cabdc5e", "title": "Climate change could force Bangkok to move , official warns", "date": "2024-05-16 02:30", "url": "https://www.thenews.com.pk/print/1189648-climate-change-could-force-bangkok-to-move-official-warns", "message": "Thailand's Deputy DG Department of Climate change and Environment Pavich Kesavawong.\n— AFP/FileBANGKOK: Thailand may have to consider relocating its capital Bangkok because of rising sea levels, a senior official in the country’s climate change office said on Wednesday.\nProjections consistently show that low-lying Bangkok risks being inundated by the ocean before the end of the century.\nPavich Kesavawong, deputy director-general of the government’s department of climate change and environment, warned that the city might not be able to adapt with the world on its current warming pathway.\nThailand is suffering the effects of climate change across a range of sectors, from farmers struggling with heat and drought to tourism businesses affected by coral bleaching and pollution."}, {"id": "55c6a9ce-a4f5-4c48-ad6a-8aafa7f9d7f8", "title": "Study – Almost 75 % of Maui wildfire survey participants have respiratory issues", "date": "2024-05-16 04:30", "url": "https://www.belfasttelegraph.co.uk/news/world-news/study-almost-75-of-maui-wildfire-survey-participants-have-respiratory-issues/a1741305107.html", "message": "The data, gathered from 679 people in January and February, comes from what researchers hope will be a long-term study of wildfire survivors lasting at least a decade.\nMany study participants had not seen a doctor, he said.\nSome study participants said they were not able to because clinics had burned down or because they prioritised getting housing, jobs and food after the disaster.\nJust pay more attention to your health because of this.”Two-thirds of study participants lived in Lahaina at the time of the fires.\nResearchers are talking with Hawaii’s congressional delegation to figure out how to bring these resources to Maui, he said."}, {"id": "59506e7e-712e-4636-8684-c167ae27146b", "title": "Namibia : Govt Intensifies Drought - Counter Offensive", "date": "2024-05-16 12:15", "url": "https://allafrica.com/stories/202405160356.html", "message": "The government has also provided N$100 million for the livestock support programme as part of its drought counterattack.\nThe sale of subsidised fodder to farmers through Agricultural Development Centres from 1 July to 31 December, will also be catered for under this budget.\n\"The Office of the Prime Minister and the Ministry of Agriculture, Water and Land Reform [are directed] to continue with the water provision programme to drought-stricken areas,\" she said.\n\"Cabinet approved that payment modalities to address challenges in payment of the above-mentioned subsidies under the drought relief programme be assessed and submitted to Cabinet for its considerationand endorsement.\nThe Ministry of Agriculture, Water and Land Reform was directed to implement an awareness campaign to encourage farmers to destock while the livestock is still in good condition,\" she said."}, {"id": "39b93e42-f96a-4e02-ba19-e121957bcca2", "title": "Study – Almost 75 % of Maui wildfire survey participants have respiratory issues", "date": "2024-05-16 06:00", "url": "https://www.edp24.co.uk/news/national/24323406.study---almost-75-maui-wildfire-survey-participants-respiratory-issues/", "message": "The data, gathered from 679 people in January and February, comes from what researchers hope will be a long-term study of wildfire survivors lasting at least a decade.\nMany study participants had not seen a doctor, he said.\nSome study participants said they were not able to because clinics had burned down or because they prioritised getting housing, jobs and food after the disaster.\nJust pay more attention to your health because of this.”Two-thirds of study participants lived in Lahaina at the time of the fires.\nAbout half of the participants reported daily or weekly exposure to smoke, ash or debris."}, {"id": "0d5058db-ffa9-43f2-852d-892c4f8583ee", "title": "Searching for the top pooch : 148th Westminster dog show in photos", "date": "2024-05-16 00:15", "url": "https://www.ctvnews.ca/photo-galleries/searching-for-the-top-pooch-148th-westminster-dog-show-in-photos-1.6888798", "message": "Looking for heavy machinery?\nSome fine jewelry?\nPerhaps you're in the market for dozens of children's coats or a collection of ceremonial platforms?\nTake a look at some of the items recently auctioned off by the Canadian government, and how much you'd need to spend to make them your own."}, {"id": "cb1bda7d-8e5a-4fb2-82d2-48717231418f", "title": "Drought shuttered Texa last sugar mill . Now , farmers are asking which crop is next ? ", "date": "2024-05-16 00:15", "url": "https://www.yahoo.com/news/drought-shuttered-texas-last-sugar-214010839.html", "message": "MERCEDES, Texas – The last sugar mill in Texas shut its doors last month, citing a lack of water.\n\"Our main water source is the Rio Grande River, which is also an international boundary with Mexico,\" England said.\nTEXAS DROUGHT, DRY HEAT LOWERING COTTON QUALITYFile: The Rio Grande River dividing Reynosa, Mexico (L) with Hidalgo, Texas in the United States (R).\nOut of his 2,500 acres, England only planted 500 acres of cotton and 120 acres of sorghum grain.\nOriginal article source: Drought shuttered Texas' last sugar mill."}, {"id": "2549b8da-0982-46d0-8b41-b85d622179ce", "title": "Study – Almost 75 % of Maui wildfire survey participants have respiratory issues", "date": "2024-05-16 05:45", "url": "https://www.bournemouthecho.co.uk/news/national/24323406.study---almost-75-maui-wildfire-survey-participants-respiratory-issues/", "message": "The data, gathered from 679 people in January and February, comes from what researchers hope will be a long-term study of wildfire survivors lasting at least a decade.\nMany study participants had not seen a doctor, he said.\nSome study participants said they were not able to because clinics had burned down or because they prioritised getting housing, jobs and food after the disaster.\nJust pay more attention to your health because of this.”Two-thirds of study participants lived in Lahaina at the time of the fires.\nAbout half of the participants reported daily or weekly exposure to smoke, ash or debris."}, {"id": "c60dc7b4-30a6-4798-9be3-df98f817f891", "title": "Texas Governor Greg Abbott requests presidential disaster declaration following recent severe weather", "date": "2024-05-16 02:30", "url": "https://www.fox26houston.com/news/texas-governor-greg-abbott-requests-presidential-disaster-declaration-following-recent-severe-weather", "message": "Texas Governor Greg Abbott has sent a letter to President Joe Biden requesting a Presidential Disaster Declaration for Texas communities that were impacted by recent weather and flooding that began last month.\nThe Governor's letter requests individual assistance programs for seven impacted counties and public assistance programs for 26 impacted counties.\n\"Due to severe weather and flooding that continues to cause devastating damage in several of our communities, I am requesting a Presidential Disaster Declaration,\" Abbott said in a statement.\nThis Presidential Disaster Declaration will give local communities across to critical financial assistance that will help cover costs ranging from temporary housing and home repairs to grant funding for roads and bridges.\nI thank the Texas Division of Emergency Management for working with our local and federal partners to bolster Texas' recovery efforts across the state.\""}, {"id": "0632cb9d-8a7e-4c29-8a93-36ac2d72b99a", "title": "FIRST ALERT : Impactful weather is expected Friday", "date": "2024-05-16 02:45", "url": "https://www.wtok.com/2024/05/15/first-alert-impactful-weather-is-expected-friday/", "message": "(WTOK) -After starting our work week with the threat of severe storms and flooding, it looks like we’ll end our work week the same.\nThen, more rain is expected overnight into Saturday AM... but the severe risk will be minimal.\nHowever, a few storms could develop Saturday afternoon as an upper disturbance slides by...and we’ll have to monitor those for isolated severe weather.\nAs for temps, upper 80s are expected Thursday with low 80s Friday.\nSaturday brings mid 80s with upper 80s for Sunday."}, {"id": "b89eb7ac-9275-4f66-b390-131d3c0f13c3", "title": "Study – Almost 75 % of Maui wildfire survey participants have respiratory issues", "date": "2024-05-16 04:30", "url": "https://www.thetelegraphandargus.co.uk/news/national/24323406.study---almost-75-maui-wildfire-survey-participants-respiratory-issues/", "message": "The data, gathered from 679 people in January and February, comes from what researchers hope will be a long-term study of wildfire survivors lasting at least a decade.\nMany study participants had not seen a doctor, he said.\nSome study participants said they were not able to because clinics had burned down or because they prioritised getting housing, jobs and food after the disaster.\nJust pay more attention to your health because of this.”Two-thirds of study participants lived in Lahaina at the time of the fires.\nAbout half of the participants reported daily or weekly exposure to smoke, ash or debris."}, {"id": "2c856f0b-240a-4da7-abca-e379ac691cd6", "title": "Nepal JRAP receives £13 million boost from FCDO for earthquake recovery", "date": "2024-05-16 12:00", "url": "https://myrepublica.nagariknetwork.com/news/nepal-s-joint-recovery-action-plan-receives-ps13-million-boost-from-fcdo-for-earthquake-recovery/", "message": "KATHMANDU, May 16: The Joint Recovery Action Plan (JRAP) for Western Nepal's earthquake-affected regions has received a significant financial boost from the UK's Foreign, Commonwealth & Development Office (FCDO).\nThe British Embassy in Kathmandu has announced a contribution of £13 million to aid the recovery efforts in the municipalities impacted by the February 2024 earthquake.\nThe new funding aims to support vulnerable communities through life-saving services, rebuilding livelihoods, and fostering long-term resilience.\nThe NDRRMA's Chief Executive, Anil Pokhrel, acknowledged FCDO's ongoing support, noting its importance for the reconstruction and recovery of Karnali Province.\nThe JRAP aims to complement Nepal’s ongoing recovery efforts, targeting a funding need of USD 96 million to assist 250,000 individuals, promoting resilient construction and local employment while reducing the carbon footprint."}, {"id": "1ab14083-7ea3-4081-a243-0f5a00725afd", "title": "Study – Almost 75 % of Maui wildfire survey participants have respiratory issues", "date": "2024-05-16 03:15", "url": "https://www.lbc.co.uk/world-news/83bf907cc5454df38135651573d17330/", "message": "The data, gathered from 679 people in January and February, comes from what researchers hope will be a long-term study of wildfire survivors lasting at least a decade.\nMany study participants had not seen a doctor, he said.\nSome study participants said they were not able to because clinics had burned down or because they prioritised getting housing, jobs and food after the disaster.\nJust pay more attention to your health because of this.”Two-thirds of study participants lived in Lahaina at the time of the fires.\nResearchers are talking with Hawaii’s congressional delegation to figure out how to bring these resources to Maui, he said."}, {"id": "8b828702-99be-48e5-ae31-0488079b5c88", "title": "Study – Almost 75 % of Maui wildfire survey participants have respiratory issues", "date": "2024-05-16 03:15", "url": "https://www.lancashiretelegraph.co.uk/news/national/24323406.study---almost-75-maui-wildfire-survey-participants-respiratory-issues/", "message": "The data, gathered from 679 people in January and February, comes from what researchers hope will be a long-term study of wildfire survivors lasting at least a decade.\nMany study participants had not seen a doctor, he said.\nSome study participants said they were not able to because clinics had burned down or because they prioritised getting housing, jobs and food after the disaster.\nJust pay more attention to your health because of this.”Two-thirds of study participants lived in Lahaina at the time of the fires.\nAbout half of the participants reported daily or weekly exposure to smoke, ash or debris."}, {"id": "aef0e8c3-78cc-4573-9295-c8f518c366b9", "title": "Study – Almost 75 % of Maui wildfire survey participants have respiratory issues", "date": "2024-05-16 05:30", "url": "https://www.eadt.co.uk/news/national/24323406.study---almost-75-maui-wildfire-survey-participants-respiratory-issues/", "message": "The data, gathered from 679 people in January and February, comes from what researchers hope will be a long-term study of wildfire survivors lasting at least a decade.\nMany study participants had not seen a doctor, he said.\nSome study participants said they were not able to because clinics had burned down or because they prioritised getting housing, jobs and food after the disaster.\nJust pay more attention to your health because of this.”Two-thirds of study participants lived in Lahaina at the time of the fires.\nAbout half of the participants reported daily or weekly exposure to smoke, ash or debris."}, {"id": "06d1803b-215c-410f-90f4-18079c8dd28c", "title": "Canadians are hopeful shifting winds may push wildfire away from the oil sands hub of ... ", "date": "2024-05-16 00:00", "url": "https://article.wn.com/view/2024/05/15/Canadians_are_hopeful_shifting_winds_may_push_wildfire_away__m/", "message": "Canadian officials say favorable winds are expected to push an “out of control” wildfire away from Canada’s oil sands hub of Fort McMurray, Alberta, a day after thousands were evacuated ...... read full story"}, {"id": "1835af46-9fc8-4a18-8e4b-c59ce979db17", "title": "Study – Almost 75 % of Maui wildfire survey participants have respiratory issues", "date": "2024-05-16 03:15", "url": "https://www.breakingnews.ie/world/study-almost-75-of-maui-wildfire-survey-participants-have-respiratory-issues-1626080.html", "message": "The data, gathered from 679 people in January and February, comes from what researchers hope will be a long-term study of wildfire survivors lasting at least a decade.\nAdvertisementMany study participants had not seen a doctor, he said.\nSome study participants said they were not able to because clinics had burned down or because they prioritised getting housing, jobs and food after the disaster.\nJust pay more attention to your health because of this.”Two-thirds of study participants lived in Lahaina at the time of the fires.\nAdvertisementResearchers are talking with Hawaii’s congressional delegation to figure out how to bring these resources to Maui, he said."}, {"id": "8198273e-9a49-433e-9327-c219e5c116da", "title": "New report finds staggering number of Americans face  climate penalty  with concerning health implications :  Were essentially adding back additional premature deaths  ", "date": "2024-05-16 04:45", "url": "https://www.yahoo.com/news/report-finds-staggering-number-americans-033000493.html", "message": "A quarter of Americans are now exposed to unhealthy air in what experts are calling a \"climate penalty.\"\nA report from the First Street Foundation found that one in four Americans faces unhealthy air, Grist reported.\nWhat's more, using climate and wildfire models, the group estimated that by mid-century, half of Americans will experience at least one day of risky unhealthy air.\nUltimately, the World Health Organization says that around seven million people die prematurely due to air pollution — this works out to 13 people each minute, and children are most at risk.\n\"We're essentially adding back additional premature deaths, adding back additional heart attacks,\" Porter said, per Grist."}, {"id": "5fb6a73c-a943-47dc-8ca3-6f71742e8c8c", "title": "Drain the Oceans - National Geographic Channel HD", "date": "2024-05-16 10:45", "url": "https://www.tvguide.co.uk/schedule/ea97fdb2-68f2-55fd-9c06-f9d7e3fe9b68/drain-the-oceans", "message": "Drain the OceansNational Geographic Channel HD 4:00 PM to 5:00 PM Thursday 16 May Share Add toCalendar +The Mississippi River S Subtitles Audio DescriptionFrom a steamboat in a cornfield to the true story behind Hurricane Katrina's floods, new discoveries reveal how the Mississippi river shaped AmericaDrain the Oceans airs on National Geographic Channel HD at 4:00 PM, Thursday 16 May .\n(Subtitles, audio description.)"}, {"id": "c893536e-ea3c-4f43-821b-1f68a97bdbd2", "title": "NWS issues flood watch for burn scars in northern New Mexico", "date": "2024-05-16 12:15", "url": "https://www.kob.com/new-mexico/santa-fe-northern-new-mexico/nws-issues-flood-watch-for-burn-scars-wednesday-in-northern-new-mexico/", "message": "As we progress closer to monsoon season, there is one thing we are watching closely in northern New Mexico – burn scar flooding.\nALBUQUERQUE, N.M. – As we progress closer to monsoon season, there is one thing we are watching closely in northern New Mexico – burn scar flooding.\nOn Wednesday, we’ve seen some rain and thunderstorms pretty close to the burn scars.\nIt doesn’t take much for flooding to happen over our burn scars, either.\nThat is why the National Weather Service in Albuquerque has already put out a flood watch for the Calf Canyon/Hermits Peak burn scar and the McBride burn scar for Thursday."}, {"id": "aa14ea48-b9c1-4d4b-8fb7-f19782525eb7", "title": "Study – Almost 75 % of Maui wildfire survey participants have respiratory issues", "date": "2024-05-16 04:30", "url": "https://www.yorkpress.co.uk/news/national/24323406.study---almost-75-maui-wildfire-survey-participants-respiratory-issues/", "message": "The data, gathered from 679 people in January and February, comes from what researchers hope will be a long-term study of wildfire survivors lasting at least a decade.\nMany study participants had not seen a doctor, he said.\nSome study participants said they were not able to because clinics had burned down or because they prioritised getting housing, jobs and food after the disaster.\nJust pay more attention to your health because of this.”Two-thirds of study participants lived in Lahaina at the time of the fires.\nAbout half of the participants reported daily or weekly exposure to smoke, ash or debris."}, {"id": "f38bd81d-4598-43d3-b677-0c4616ebeaa7", "title": "Study – Almost 75 % of Maui wildfire survey participants have respiratory issues", "date": "2024-05-16 07:15", "url": "https://www.theboltonnews.co.uk/news/national/24323406.study---almost-75-maui-wildfire-survey-participants-respiratory-issues/", "message": "The data, gathered from 679 people in January and February, comes from what researchers hope will be a long-term study of wildfire survivors lasting at least a decade.\nMany study participants had not seen a doctor, he said.\nSome study participants said they were not able to because clinics had burned down or because they prioritised getting housing, jobs and food after the disaster.\nJust pay more attention to your health because of this.”Two-thirds of study participants lived in Lahaina at the time of the fires.\nAbout half of the participants reported daily or weekly exposure to smoke, ash or debris."}, {"id": "28cc2d6e-3706-47a4-ba5c-4dc28dac42b5", "title": "Fire threat eases near Canada oil sands hub , but a long , hot summer looms – Butler Eagle", "date": "2024-05-16 00:15", "url": "https://www.butlereagle.com/20240515/fire-threat-eases-near-canadas-oil-sands-hub-but-a-long-hot-summer-looms/", "message": "But scientists have said it's not clear that wildfire smoke will be the same problem it was last year, when unusual weather patterns drove the haze southward.\nIn Fort McMurray, about 6,600 residents fled parts of the city's southern end while others were on on alert.\nAlberta, the province that includes Fort McMurray, draws significant revenue from the fossil fuel industry.\nFire officials said evacuation orders would likely be in place in Fort McMurray until Tuesday.\n“They just never bothered to tell the people in Fort McMurray who are living with the consequences of peak C02,” Angus wrote."}, {"id": "f8ccbfbb-bdbd-495c-b5b4-3d9f9d611126", "title": "Calgary readying for Fort McMurray wildfire evacuees", "date": "2024-05-16 01:30", "url": "https://calgary.ctvnews.ca/calgary-monitoring-northern-alberta-wildfires-preparing-for-evacuees-1.6888646", "message": "The City of Calgary says it’s monitoring the wildfire situation and resulting smoke, as evacuees flee from wildfire zones in northern Alberta.\nMany workers in Fort McMurray also caught Wednesday morning flights destined for Calgary, including Dave Morabito.\n\"I hope they're going to find a way for us to go back up to work again.\nDavid says the organization is in desperate need of supplies, food, pet beds and toys that animal owners have outgrown.\n\"We've got everything from pet beds to toys, to treats, to food, prescription and we also have partnering vets,\" said David."}, {"id": "3d3bfd7c-2840-408e-bf6a-228331a9c557", "title": "Study – Almost 75 % of Maui wildfire survey participants have respiratory issues", "date": "2024-05-16 07:00", "url": "https://www.thenorthernecho.co.uk/news/national/24323406.study---almost-75-maui-wildfire-survey-participants-respiratory-issues/", "message": "The data, gathered from 679 people in January and February, comes from what researchers hope will be a long-term study of wildfire survivors lasting at least a decade.\nMany study participants had not seen a doctor, he said.\nSome study participants said they were not able to because clinics had burned down or because they prioritised getting housing, jobs and food after the disaster.\nJust pay more attention to your health because of this.”Two-thirds of study participants lived in Lahaina at the time of the fires.\nAbout half of the participants reported daily or weekly exposure to smoke, ash or debris."}, {"id": "abe6eabd-6a24-4ea5-8e9f-a66b2331cf0f", "title": "Lallemand Australia silage revolution | The Land", "date": "2024-05-16 02:45", "url": "https://www.theland.com.au/story/8626182/lallemand-australias-silage-revolution/?cs=6112", "message": "Changing silage perceptionsAlex Turney, managing director, Lallemand Australia with some high quality corn silage which can be integrated into a beef production system for more profitability.\nThe site encapsulated the complete silage supply chain, from seed suppliers, machinery, contractors, feedout and mixing, even silage testing.\nWith more than 25 years in animal nutrition, Mr Turney said silage creation has gone ahead leaps and bounds tackling many misconceptions about the process.\nLallemand Australia's bigger picture approach to the silage industry is one of awareness while the technology continues to develop.\n\"I think our role is to facilitate this growth of the silage industry.\""}, {"id": "50e43589-cdd1-4d33-9d8a-cf2dcd084b47", "title": "Hikers seen on closed Mt . Charleston trail risk $5 , 000 fine", "date": "2024-05-16 07:00", "url": "https://www.fox5vegas.com/2024/05/16/hikers-seen-closed-mt-charleston-trail-risk-5000-fine/", "message": "Charleston know how tough it’s been for the public not to hike the very popular Mary Jane Falls trail.\nThe trail is closed, and anyone found on it could face a fine up to $5,000.\nBut during our tour, FOX5 saw nine people who were hiking the closed trail.\nOfficials say hikers on the closed trail can cause some big problems if they have to be rescued.\nForest officials talked to all nine people who were on the closed trail but didn’t cite any of them."}, {"id": "d3862efc-7351-441b-b576-618a23461546", "title": "Study – Almost 75 % of Maui wildfire survey participants have respiratory issues", "date": "2024-05-16 05:15", "url": "https://www.ipswichstar.co.uk/news/national/24323406.study---almost-75-maui-wildfire-survey-participants-respiratory-issues/", "message": "The data, gathered from 679 people in January and February, comes from what researchers hope will be a long-term study of wildfire survivors lasting at least a decade.\nMany study participants had not seen a doctor, he said.\nSome study participants said they were not able to because clinics had burned down or because they prioritised getting housing, jobs and food after the disaster.\nJust pay more attention to your health because of this.”Two-thirds of study participants lived in Lahaina at the time of the fires.\nResearchers are talking with Hawaii’s congressional delegation to figure out how to bring these resources to Maui, he said."}, {"id": "ca4c7fef-6339-4c38-9f95-b786bb97c2e7", "title": "Study – Almost 75 % of Maui wildfire survey participants have respiratory issues", "date": "2024-05-16 06:15", "url": "https://www.swindonadvertiser.co.uk/news/national/24323406.study---almost-75-maui-wildfire-survey-participants-respiratory-issues/", "message": "The data, gathered from 679 people in January and February, comes from what researchers hope will be a long-term study of wildfire survivors lasting at least a decade.\nMany study participants had not seen a doctor, he said.\nSome study participants said they were not able to because clinics had burned down or because they prioritised getting housing, jobs and food after the disaster.\nJust pay more attention to your health because of this.”Two-thirds of study participants lived in Lahaina at the time of the fires.\nAbout half of the participants reported daily or weekly exposure to smoke, ash or debris."}, {"id": "c7613b91-6fbf-4b53-8395-d6cd0b3d0253", "title": "Canada tourism struggling as wildfires rage :  The whole country is not on fire  ", "date": "2024-05-16 00:00", "url": "https://globalnews.ca/news/10499228/canadian-tourism-wildfires-2024/", "message": "But as Rendez-vous Canada is taking place at the Edmonton Convention Centre, one of the biggest challenges Canada’s tourism industry is facing is playing out in technicolour just a few hundred kilometres away: wildfires.\n“Climate change is an essential threat to Canadian tourism, to their reputation and that’s what we’re seeing,” said federal Tourism Minister Soraya Martinez Ferrada.\nHot, dry weather in Western Canada, exacerbated by climate change, sparked a massive fire last week southwest of Fort McMurray.\n2:01 Fort McMurray wildfire: Crews working to protect evacuated neighbourhoodsBeth Potter, president of the Tourism Industry Association of Canada, said the direct impact of wildfires is hard enough.\nPeople are…not understanding how big Canada is and that the whole country is not on fire.”Last summer, tourism operators in southwestern Ontario told her about cancellations due to fires largely more than 3,500 kilometres away in B.C., she said."}, {"id": "6a038c5a-2796-46eb-ad63-5bbf40435223", "title": "Texas Governor Greg Abbott requests presidential disaster declaration following recent severe weather", "date": "2024-05-16 03:30", "url": "https://www.yahoo.com/news/texas-governor-greg-abbott-requests-223516884.html", "message": "HOUSTON - Texas Governor Greg Abbott has sent a letter to President Joe Biden requesting a Presidential Disaster Declaration for Texas communities that were impacted by recent weather and flooding that began last month.\nThe Governor's letter requests individual assistance programs for seven impacted counties and public assistance programs for 26 impacted counties.\n\"Due to severe weather and flooding that continues to cause devastating damage in several of our communities, I am requesting a Presidential Disaster Declaration,\" Abbott said in a statement.\nThis Presidential Disaster Declaration will give local communities across to critical financial assistance that will help cover costs ranging from temporary housing and home repairs to grant funding for roads and bridges.\nI thank the Texas Division of Emergency Management for working with our local and federal partners to bolster Texas' recovery efforts across the state.\""}, {"id": "72648be7-188c-4aee-b27a-1ef7609b7f49", "title": "Gov . Ron DeSantis signs law erasing climate change from Florida policy", "date": "2024-05-16 05:45", "url": "https://www.upi.com/Top_News/US/2024/05/16/florida-governor-Ron-DeSantis-erase-climate-change-legislation/8891715830982/", "message": "Ron DeSantis signed legislation Wednesday that will erase climate change from Florida policy effective July 1, to \"keep windmills off our beaches, gas in our tanks and China out of our state.\"\nRon DeSantis signed legislation Wednesday that will erase climate change from state policy effective July 1.\n1331 -- will keep windmills off our beaches, gas in our tanks and China out of our state,\" DeSantis wrote Wednesday in a post on X.\n\"We can't deny that climate change is happening.\"\n\"Combined with the destruction that we've already had in this state, stripping the words 'climate change' out of statutes isn't going to make it go away."}, {"id": "b6adc93a-b674-4f65-bb23-2f51e9c94450", "title": "WIKE , AMAECHI AND THE TRANSIENCE OF POWER – THISDAYLIVE", "date": "2024-05-16 03:00", "url": "https://www.thisdaylive.com/index.php/2024/05/16/wike-amaechi-and-the-transience-of-power/", "message": "Having come second in the PDP presidential primary election, why didn’t Atiku Abubakar choose him as running mate?\nIfeanyi Okowa, Atiku’s running mate, doesn’t disturb his successor which he literally imposed on Delta State just as Wike did with Fubara in Rivers State.\nHe should learn from his own predecessor, Rotimi Amaechi, who was a very powerful minister in the first term of the Buhari’s regime.\nWhen Amaechi used to storm Rivers State then with troops and battalion of soldiers and was dragging the right of way with governor Wike even right inside Rivers State, this writer was solidly behind then governor Wike.\nToday, the former powerful minister Amaechi is politically stranded."}, {"id": "94f6a33c-59f2-414d-b69a-d1b60c1527eb", "title": "After three devastating years of drought , there no future for our farm", "date": "2024-05-16 05:30", "url": "https://www.macleans.ca/undefined/farm-canada-climate-change/", "message": "Our farm has suffered for three years from the devastating droughts that’s struck farmers across Alberta, and that’s forced our hands.\nThe drought in 2021 was reportedly just as devastating as the Dirty Thirties, when my grandpa nearly lost everything in the dust bowl.\nThat drought reduced our hay crops, which we used to feed to our animals, to nothing.\nThe Canadian Drought Monitor classified the severity as “exceptional drought,” a label reserved for once-in-50-year events.\nWe were running out of options, and there was no carryover hay thanks to the drought in 2022."}, {"id": "a75713dd-d16a-401b-a17e-e833c7b0f8e4", "title": "Houston weather : FOX 26 Storm Alert Day issued for Thursday through early Friday", "date": "2024-05-16 03:30", "url": "https://www.yahoo.com/news/houston-weather-fox-26-storm-224755249.html", "message": "HOUSTON - You might have heavy rain and severe storm fatigue, but buckle up for another round!\nThursday through early Friday are now FOX 26 Storm Alert Days and will likely feature rounds of heavy rain and a few strong to severe storms!\nThat means you need to be on alert and prepared to take action with the threat for hail, damaging winds and heavy rain that could lead to flooding increasing.\nRounds of heavy rain and a few strong to severe storms will be most likely Thursday afternoon through Friday morning.\nWe will cover every angle of this severe and flood threat where you live on our smart TV app, FOX Local, so download it and check it out!"}, {"id": "dd0eb9f9-7a0f-48a2-af5c-e7674b220366", "title": "Rare  high risk  warning for flash flooding issued in Texas , Louisiana", "date": "2024-05-16 14:00", "url": "https://abcnews.go.com/US/rare-high-risk-warning-flash-flooding-issued-texas/story?id=110298719", "message": "A rare \"high risk\" warning for flash flooding has been issued in Texas and Louisiana as the states brace for up to 9 inches of rain in the next 24 hours.\n\"High risk\" days account for just 4% of days, but they are responsible for more than one-third of flooding deaths, according to the Weather Prediction Center.\nBesides the rain, damaging winds, large hail and a few tornadoes are also forecast to hit Texas on Thursday.\nSome of that severe weather will move into Louisiana Thursday evening, with damaging winds possible in Lake Charles and Alexandria.\nDamaging winds, hail and possible tornadoes will threaten New Orleans; Jackson, Mississippi; Mobile, Alabama; and Pensacola, Florida."}, {"id": "e7e1ed41-2927-4b72-a9a8-470fde5c9d6e", "title": "Caribou - Targhee National Forest prepares for wildfire season - LocalNews8 . com", "date": "2024-05-16 02:30", "url": "https://localnews8.com/news/2024/05/15/caribou-targhee-national-forest-prepares-for-wildfire-season/", "message": "POCATELLO, Idaho (KIFI) - The Caribou-Targhee National Forest Fire program held emergency scenario trainings in Pocatello Wednesday to prepare for the wildfire season.\nThere's a lot of homes and people involved,” said U.S. Forest Service District Ranger Kim Obele.\nThe forest fire program did other trainings as well like testing fire hose equipment and practicing retrieving an injured person.\nOne tip the rangers shared is to be careful in areas where some people burn wood palettes.\nYou should avoid driving over black, charred areas because when people burn those palettes, they often leave behind the nails that were in the wood."}]