[{"id": "545a227b-47db-4adb-af69-844f09b42d8c", "title": "I am not OK with my childhood synagogue being used as cover for anti - Palestinian hate", "date": "2024-08-08 01:15", "url": "https://rabble.ca/human-rights/i-am-not-ok-with-my-childhood-synagogue-being-used-as-cover-for-anti-palestinian-hate/", "domain": "rabble.ca", "domain_classification": "Unknown", "message": "Last week I was dragged by police from the steps of my childhood synagogue for trying to attend an anti-hate event while wearing a shirt with the words “Jews Say No to Genocide”.\nAnd yet, discussions about the dangers of hate and violence continue to be quite narrow, including discourse among politicians, in the media, and within my own community.\nShaken, we remained outside, chanting for collective liberation and demanding to know why Jews who oppose genocide weren’t being allowed to attend an event supposedly held in solidarity against hate.\nBewilderingly, leaders of legacy Jewish institutions went to social media to disparage fellow Jews for protesting against not being allowed inside a synagogue for a public event.\nThe only conclusion I can draw from any of this, is that this event was not truly an evening of “solidarity” nor was it “against hate”."}, {"id": "79860a11-aa3c-403a-b227-a1251238f69c", "title": "Not inviting Israel harms the memory of innocent Japanese , Israel", "date": "2024-08-08 03:00", "url": "https://www.jpost.com/opinion/article-813809", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "In his decision not to invite the Israeli ambassador to Japan to the yearly ceremony commemorating the atomic bombing of Nagasaki, Nagasaki Mayor Shiro Suzuki debased the memory of countless innocent victims.\nThis singling out of Israel demonstrates the mayor’s remarkable historical illiteracy and sets back decades of efforts to build positive relations between Japan, Israel, and world Jewry.\nAdding insult to injury, Mayor Suzuki invited a Palestinian representative to attend even as 115 innocent hostages are still held in terror tunnels beneath Gaza by the Palestinian terrorist group Hamas.\nThe atomic bombing of Nagasaki helped finally end World War II, a war which saw Imperial Japan allied with Nazi Germany.\nThe decision by Nagasaki Mayor Suzuki cheapens and demeans the important lessons that his city has rightly been teaching for generations."}, {"id": "36628ef8-5ed9-437f-9486-657aa82ec476", "title": "Donald Trump fears over racing against Kamala Harris", "date": "2024-08-08 03:00", "url": "https://www.jpost.com/opinion/article-813772", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "She started this week by picking Minnesota’s popular Governor Tim Walz as her running mate after a careful vetting.\nDEMOCRATIC PRESIDENTIAL candidate and US Vice President Kamala Harris speaks at an election campaign event in Atlanta, on Tuesday.\nThe man who discovered late in life that Abraham Lincoln was a Republican, recently learned that Harris is Black.\nTRUMP IS running scared and looking for an excuse to avoid debating Harris.\nHARRIS, NEARLY 20 years his junior, like Walz, has taken a tactic right out of Trump’s playbook that has him running scared."}]