[{"id": "fc06d132-31b4-4db4-8177-bacee4750fe5", "title": "Hezbollah introduces new air defense missiles against warplanes", "date": "2024-06-07 09:30", "url": "https://www.naharnet.com/stories/en/305776-hezbollah-introduces-new-air-defense-weapons-intercepting-warplanes", "message": "Hezbollah fired Thursday for the first time air defense missiles at Israeli warplanes that the group said were \"breaking the sound barrier and terrorizing children.\"\nHezbollah said in a statement that its air defense missiles forced the warplanes to \"retreat beyond the border.\"\nLast month, Hezbollah struck a military post in northern Israel using a drone that fired two missiles, the first successful missile airstrike it has launched from within Israeli airspace.\nIsrael and Hezbollah have been exchanging fire daily since a day after Hamas’ Oct. 7 attack, which set off the war in Gaza.\nIn Lebanon, the cross-border violence has killed at least 455 people, mostly fighters but including 88 civilians, according to an AFP tally."}, {"id": "23906c17-816a-4ca6-bc1d-bd8261a88f22", "title": "Israeli soldier , 13 Palestinians killed as fierce clashes persist in Gaza : Sources", "date": "2024-06-07 03:00", "url": "https://www.prokerala.com/news/articles/a1537537.html", "message": "Image Source: IANS NewsGaza/Jerusalem, June 7 : At least 13 Palestinians were killed in the Israeli bombing of a house and a youth gathering in the Gaza Strip, Palestinian sources have said.\nIsraeli warplanes on Thursday bombed a house east of Khan Younis city in southern Gaza with at least one missile, Xinhua news agency reported, citing Palestinian security sources.\nMedical sources said the airstrike killed eight people, including children and women, and injured several others, all of whom had been taken to hospital.\nMeanwhile, the Israeli army claimed that its soldiers encountered Palestinian militants who emerged from a tunnel shaft in southern Gaza, about 200 meters away from the Israeli border.\nEarlier in the day, Hamas armed wing Al-Qassam Brigades said it blew up a tunnel entrance set by Israeli forces near Rafah as a trap, killing five Israeli soldiers inside."}, {"id": "63d6ed31-644a-4016-ba10-af14ad2fe3be", "title": "Israeli soldier , 13 Palestinians killed as fierce clashes persist in Gaza : Sources", "date": "2024-06-07 05:00", "url": "https://www.siasat.com/israeli-soldier-13-palestinians-killed-as-fierce-clashes-persist-in-gaza-sources-3040070/", "message": "Gaza: At least 13 Palestinians were killed in the Israeli bombing of a house and a youth gathering in the Gaza Strip, Palestinian sources have said.\nIsraeli warplanes on Thursday bombed a house east of Khan Younis city in southern Gaza with at least one missile, Xinhua news agency reported, citing Palestinian security sources.\nOn the same day, a drone targeted a gathering of youths in the Al-Shati refugee camp in northern Gaza, according to local sources and eyewitnesses.\nMeanwhile, the Israeli army claimed that its soldiers encountered Palestinian militants who emerged from a tunnel shaft in southern Gaza, about 200 meters away from the Israeli border.\nEarlier in the day, Hamas armed wing Al-Qassam Brigades said it blew up a tunnel entrance set by Israeli forces near Rafah as a trap, killing five Israeli soldiers inside."}, {"id": "60a78dad-8791-4277-9fb2-b8eb7291b2cb", "title": "At least 30 killed after Israeli strikes on UN - run school in Gaza", "date": "2024-06-07 01:00", "url": "https://www.indiatoday.in/world/story/israel-hamas-war-gaza-un-school-attack-several-dead-injuredb-2550097-2024-06-07", "message": "He said 20 to 30 fighters were located in the compound, and many of them had been killed.\nLater Israel's chief military spokesperson Daniel Hagari said the military had so far identified nine of 30 Hamas and Islamic Jihad fighters targeted in the pre-dawn strike.\nThere was no immediate response from the Israeli military on the two latest accounts.\nIn another sensitive development, the Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire.\nUS and Israeli officials have told Reuters about half of Hamas's forces have been killed in the conflict."}, {"id": "e97a2fc5-f014-4ae5-9ea3-c9f3039e49cc", "title": "Israeli strike on UN school kills dozens in Gaza", "date": "2024-06-07 00:15", "url": "https://www.swissinfo.ch/eng/israeli-strike-on-un-school-kills-dozens-in-gaza/79814706", "message": "Later Israel’s chief military spokesperson Daniel Hagari said the military had so far identified nine of 30 Hamas and Islamic Jihad fighters targeted in the pre-dawn strike.\nThere was no immediate response from Israeli military on the two latest accounts.\nIn another sensitive development, the Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire.\nHamas precipitated the war by attacking Israeli territory last Oct. 7, killing around 1,200 people and capturing more than 250 hostages, according to Israeli tallies.\nU.S. and Israeli officials have told Reuters about half of Hamas’s forces have been killed in the conflict."}, {"id": "94ecee91-eb3b-4f86-969e-a9c8c3d31b12", "title": "Gaza School Airstrike : Tragedy Amid Ceasefire Talks", "date": "2024-06-07 00:15", "url": "https://www.devdiscourse.com/article/law-order/2974510-gaza-school-airstrike-tragedy-amid-ceasefire-talks", "message": "Ismail Al-Thawabta, the director of the Hamas-run government media office, rejected Israel's assertion that the U.N. school in Nuseirat, in central Gaza, had hidden a Hamas command post.\nLater Israel's chief military spokesperson Daniel Hagari said the military had so far identified nine of 30 Hamas and Islamic Jihad fighters targeted in the pre-dawn strike.\nIn a separate Israeli airstrike on a house in Deir Al-Balah in central Gaza Strip, three Palestinians were killed and several others were wounded, medics said.\nThere was no immediate response from Israeli military on the two latest accounts.\nThe building was once used as a school, but with no schools now operating in Gaza it was being used as a shelter, he added."}, {"id": "95fd6148-3aad-4bed-876b-d67034c795ab", "title": "Deadly Gaza strike raises US concerns about civilians , despite precision munitions", "date": "2024-06-07 02:15", "url": "https://abcnews.go.com/Politics/deadly-gaza-strike-raises-us-concerns-civilians-despite/story?id=110907616", "message": "An Israeli attack on a UN school complex in central Gaza is raising alarm among U.S. officials after scores of civilians were reportedly killed, despite the apparent use of American-made precision munitions.\nPalestinians look at the aftermath of the Israeli strike on a U.N.-run school that killed dozens of people in the Nusseirat refugee camp in the Gaza Strip, June 6, 2024.\nPalestinians inspect the site of an Israeli strike on a UNRWA school sheltering displaced people, amid the Israel-Hamas conflict, in Nuseirat refugee camp in the central Gaza Strip, June 6, 2024.\nPalestinians inspect the site of an Israeli strike on a UNRWA school sheltering displaced people, amid the Israel-Hamas conflict, in Nuseirat refugee camp in the central Gaza Strip, June 6, 2024.\nThrough the conflict, Israel has not made a consistent practice of sharing intelligence justifying its attacks with its allies or the public."}, {"id": "8f0ddbc8-03b5-45cf-8ed2-8106d8127c60", "title": "Israeli strike on UN school kills dozens in Gaza", "date": "2024-06-07 07:15", "url": "https://www.stabroeknews.com/2024/06/07/news/world/israeli-strike-on-un-school-kills-dozens-in-gaza/", "message": "Later Israel’s chief military spokesperson Daniel Hagari said the military had so far identified nine of 30 Hamas and Islamic Jihad fighters targeted in the pre-dawn strike.\nThere was no immediate response from Israeli military on the two latest accounts.\nIn another sensitive development, the Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire.\nHamas precipitated the war by attacking Israeli territory last Oct. 7, killing around 1,200 people and capturing more than 250 hostages, according to Israeli tallies.\nU.S. and Israeli officials have told Reuters about half of Hamas’s forces have been killed in the conflict."}, {"id": "48cca862-af87-46a5-bb10-6c46b58d07bd", "title": "CNN Reports IDF Strike on Hamas HQ as  Israel Strike on UN School That Left Dozens Dead  ", "date": "2024-06-07 02:00", "url": "https://www.breitbart.com/the-media/2024/06/06/cnn-reports-idf-strike-on-hamas-hq-as-israel-strike-on-un-school-that-left-dozens-dead/", "message": "Eliminated: several Hamas and Islamic Jihad terrorists who embedded themselves inside of an @UNRWA school.\nIAF fighter jets conducted a precise strike on a Hamas compound embedded inside the school in the area of Nuseirat.\n“At least 45 people were killed in the strike, a spokesperson from Gaza’s Ministry of Health told CNN,” the story says.\nIn a statement, the IDF said:A short while ago, IAF fighter jets, directed by IDF intelligence and the ISA, conducted a precise strike on a Hamas compound embedded inside an UNRWA school in the area of Nuseirat.\nThe Times of Israel reported that the IDF believed 20-30 terrorists were in the compound at the time of the strike."}, {"id": "c4978e0b-920b-4dc3-9bc2-739b8cd043ef", "title": "Mayor of Gaza Nuseirat killed in Israeli strike – Ya Libnan", "date": "2024-06-07 00:45", "url": "https://yalibnan.com/2024/06/07/mayor-of-gazas-nuseirat-killed-in-israeli-strike/", "message": "Mayor of Nuseirat, Iyad al-Maghari was assented in the raid that targeted a municipal building in central Gaza.\nThe Palestinian mayor of Nuseirat refugee camp was killed by an Israeli airstrike, Palestinian medical and security sources said Thursday.\nIsraeli fighter jets carried out a raid on the Nuseirat camp, in which five Palestinians including the Mayor of Nuseirat, Iyad al-Maghari, were killed in the raid that targeted a municipal building in central Gaza.\n“The government of Israel has said that they are going to release more information about this strike, including the names of those who died in it.\nWe expect them to be fully transparent in making that information public,” State Department Spokesperson Matthew Miller said in a press briefing."}, {"id": "7ad0f9dd-9302-477e-8099-bb108a267444", "title": "Deadly Gaza strike raises US concerns about civilians , despite precision munitions", "date": "2024-06-07 02:15", "url": "https://www.yahoo.com/news/deadly-gaza-strike-raises-us-012555174.html", "message": "An Israeli attack on a UN school complex in central Gaza is raising alarm among U.S. officials after scores of civilians were reportedly killed, despite the apparent use of American-made precision munitions.\nPHOTO: Palestinians look at the aftermath of the Israeli strike on a U.N.-run school that killed dozens of people in the Nusseirat refugee camp in the Gaza Strip, June 6, 2024.\nThrough the conflict, Israel has not made a consistent practice of sharing intelligence justifying its attacks with its allies or the public.\nBut Palestinians in Gaza say the end result is that they are left with no refuge from the horrors of war.\nDeadly Gaza strike raises US concerns about civilians, despite precision munitions originally appeared on abcnews.go.com"}, {"id": "a5c1de76-cad8-4fae-a8a7-1d9826e80b3b", "title": "Ukraine takes out 48 of 53 Russian drones and all 5 cruise missiles overnight on June 7", "date": "2024-06-07 08:15", "url": "https://www.yahoo.com/news/ukraine-takes-48-53-russian-064900863.html", "message": "Ukraine takes out 48 of 53 Russian drones and all 5 cruise missiles overnight on June 7Ukrainian air defense forces shot down 48 out of 53 Shahed-131/136 drones and all five Kh-101/Kh-555 cruise missiles overnight on June 7, Ukrainian Air Force Commander Mykola Oleshchuk reported.\nRussia launched 53 Shahed drones from Primorsko-Akhtarsk, Yeisk, Kursk, and temporarily occupied Crimea to target Ukraine's critical infrastructure.\nFive Kh-101/Kh-555 cruise missiles were fired from Tu-95MS bombers from Russia's Saratov Oblast.\nThe night-long attack saw cruise missiles heading for western oblasts, with explosions reported in Khmelnytskyi Oblast.\nRead also: Russia destroys another Epicentr hypermarket in Kherson – PhotoA fire broke out at an industrial site in Kyiv Oblast as a result of the Russian attack, Kyiv officials reported."}, {"id": "65c9fe38-8881-4f79-8093-4e7d06ce8ceb", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://knpr.org/npr/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "ac311134-0261-4f67-aa93-b08297580548", "title": "Israeli soldier , 13 Palestinians killed as fierce clashes persist in Gaza : Sources", "date": "2024-06-07 05:30", "url": "https://www.orissapost.com/israeli-soldier-13-palestinians-killed-as-fierce-clashes-persist-in-gaza-sources/", "message": "Gaza/Jerusalem: At least 13 Palestinians were killed in the Israeli bombing of a house and a youth gathering in the Gaza Strip, Palestinian sources have said.\nIsraeli warplanes on Thursday bombed a house east of Khan Younis city in southern Gaza with at least one missile, Xinhua news agency reported, citing Palestinian security sources.\nMedical sources said the airstrike killed eight people, including children and women, and injured several others, all of whom had been taken to hospital.\nMeanwhile, the Israeli army claimed that its soldiers encountered Palestinian militants who emerged from a tunnel shaft in southern Gaza, about 200 meters away from the Israeli border.\nEarlier in the day, Hamas armed wing Al-Qassam Brigades said it blew up a tunnel entrance set by Israeli forces near Rafah as a trap, killing five Israeli soldiers inside."}, {"id": "f4a16f77-f0de-4e6e-addb-140379c694e7", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 01:00", "url": "https://www.kalw.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "4a701161-25e6-4966-8006-0fb663d33c8c", "title": "Israeli strike on U . N . school kills dozens in Gaza", "date": "2024-06-07 05:00", "url": "https://www.japantimes.co.jp/news/2024/06/07/world/israeli-strike-un-school-gaza/", "message": "Israel hit a Gaza school on Thursday with what it described as a targeted airstrike on up to 30 Hamas and Islamic Jihad fighters inside.\nA Hamas official said 40 people were killed, including women and children sheltering at the U.N. site.\nVideo footage showed Palestinians hauling away bodies and scores of injured in a hospital after the attack, which took place at a sensitive moment in mediated talks on a cease-fire that would involve releasing hostages held by Hamas and some of the Palestinians held in Israeli jails."}, {"id": "74e1984a-d4de-4d66-9f53-25292ce14dae", "title": "Dozens killed in Israeli strike on UN school in Gaza", "date": "2024-06-07 02:15", "url": "https://www.thestar.com.my/news/world/2024/06/07/dozens-killed-in-israeli-strike-on-un-school-in-gaza", "message": "Ismail Al-Thawabta, the director of the Hamas-run government media office, rejected Israel's assertion that the UN school in Nuseirat, in central Gaza, had hidden a Hamas command post.\nIn another sensitive development, the Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire.\nHamas precipitated the war by attacking Israeli territory last Oct. 7, killing around 1,200 people and capturing more than 250 hostages, according to Israeli tallies.\nIsrael's military assault on Gaza has killed more than 36,000 people, according to health officials in the territory, who say thousands more dead are feared buried under the rubble.\nUS and Israeli officials have told Reuters about half of Hamas's forces have been killed in the conflict."}, {"id": "69d3b56c-1082-45b3-b209-0bcd0e1d92b0", "title": "Middle East Crisis update : Israel ups war talk against Hezbollah ; Yemen peace deal jeopardised as US moves to counter Houthis", "date": "2024-06-07 02:30", "url": "https://www.dailymaverick.co.za/article/2024-06-07-israel-ups-war-talk-against-hezbollah-yemen-peace-deal-jeopardised-as-us-moves-to-counter-houthis/", "message": "Israel ups war rhetoric as Hezbollah’s attacks raise alarmIsrael is escalating warnings against Hezbollah in Lebanon by threatening it could be forced into a war with the Iran-backed group, following increasingly deadly attacks.\n“Whoever thinks he can hurt us while we respond by sitting on our hands is making a big mistake,” said Netanyahu.\nBoth Hezbollah and Hamas are backed by Iran and designated as terrorist organisations by the US.\nThe US said on Wednesday it was pursuing a peaceful solution between Lebanon and Israel to prevent a full-scale conflict.\nIt described the attack as a precision strike on the school complex in the central Gaza area of Nuseirat."}, {"id": "31d1b0e4-f329-43a8-813f-183f1e11b77f", "title": "Israel attacks UN - run school in Gaza , killing at least 40", "date": "2024-06-07 07:30", "url": "https://www.rediff.com/news/report/pix-israel-attacks-un-run-school-in-gaza-killing-at-least-40/20240607.htm", "message": "IMAGE: Palestinians inspect the site of an Israeli strike on a UNRWA school sheltering displaced people, amid the Israel-Hamas conflict, in Nuseirat refugee camp in the central Gaza Strip, June 6, 2024.\nPhotograph: Abed Khaled/ReutersThe Israeli strike reportedly killed at least 40 people in the early hours of this morning, Al Jazeera reported, citing Gaza's government statement.\nAs per IDF, the terrorists used thr UNRWA school it as a shelter.\nHamas has condemned the \"massacre\" committed by Israeli forces against civilians at an UNRWA school in Nuseirat in the central Gaza Strip, and said that it was a premeditated crime.\nIMAGE: Wounded Palestinians injured in an Israeli strike on a UNRWA school shelter at Al-Aqsa Martyrs Hospital."}, {"id": "caa47207-935c-44f2-8d0c-2c8ea251f6b8", "title": "Israeli Strike Kills Dozens at Former School Where Civilians Were Sheltering | World News", "date": "2024-06-07 01:30", "url": "https://indianexpress.com/article/world/israeli-strike-kills-dozens-at-former-school-where-civilians-were-sheltering-9377149/", "message": "An Israeli airstrike hit a United Nations school complex in the central Gaza Strip that had become a shelter for thousands of displaced Palestinians, killing dozens of people, officials said early Thursday.\nLt. Col. Peter Lerner, an Israeli military spokesperson, said he was “not aware of any civilian casualties” as a result of the strike.\nIsraeli forces had twice postponed the strike so as to reduce civilian casualties, the military said.\nHe said the militants had used the compound to plan attacks on Israeli forces, although he did not provide specific examples.\nThe compound that was hit, in the central Gaza city of Nuseirat, had been operated by UNRWA, the main UN body that aids Palestinians in Gaza."}, {"id": "6e456c10-32aa-4004-9014-7e2e0dbd0a7d", "title": "Israel strikes UN school , US urges  full transparency  ", "date": "2024-06-07 09:00", "url": "https://www.siasat.com/israel-strikes-un-school-us-urges-full-transparency-3040146/", "message": "He said the US had seen reports that 14 children were killed in the strike.\n“If that is accurate that 14 children were killed, those aren’t terrorists,” Miller said.\n“These are all facts that need to be verified, and that’s what we want to see happen.”According to the UNRWA, the school building in the refugee district of Nuseirat was being used as an emergency shelter.\nIt was initially not possible to independently verify the information.\nTwenty to 30 members of Hamas and the Palestinian Islamic Jihad (PIJ) were believed to have been in three classrooms of the school building in the Nuseirat refugee neighbourhood, according to the Israeli army."}, {"id": "9cd94889-092e-48a9-9296-86d6e9f21c27", "title": "Polish aircraft scrambled during Russian attack on Ukraine", "date": "2024-06-07 08:15", "url": "https://www.yahoo.com/news/polish-aircraft-scrambled-during-russian-041910845.html", "message": "Polish and allied fighter aircraft were scrambled due to a Russian missile and drone attack on Ukraine.\nSource: Operational Command of the Polish Armed Forces on ХQuote: \"Be advised that Polish and allied aircraft are flying in Polish airspace, which may lead to increased noise levels, especially in the southeastern part of the country.\nLater, Operational Command reported that the air operation had ended due to a \"reduction in the level of threat of missile strikes by Russian aircraft on areas bordering our territory.\"\n\"This night was very tense for the entire Polish air defence system, as a Russian large-scale missile attack covered the entire territory of Ukraine, including regions bordering Poland,\" the statement said.\nOperational Command emphasised that the Polish military \"is continuously monitoring the situation on Ukrainian territory and is on constant combat alert to ensure the security of Polish airspace.\""}, {"id": "daea636b-93db-4668-ac1b-d3a4448ece22", "title": "US urges Israel to be  fully transparent  after strike on UN school", "date": "2024-06-07 06:15", "url": "https://www.prokerala.com/news/articles/a1537559.html", "message": "US urges Israel to be 'fully transparent' after strike on UN school.\nImage Source: IANS NewsWashington, June 7 : The United States has called for an investigation into the deadly Israeli airstrike on a school building run by the UN agency (UNRWA) for Palestinian refugees in central Gaza and told Israel it must be \"fully transparent.\"\nUS State Department spokesman Matthew Miller said on Thursday that even if Israel's army intended to target Hamas militants, the claims of children killed in the strike \"show that something went wrong.\"\nHe said the US had seen reports that 14 children were killed in the strike.\nAccording to the UNRWA, the school building in the refugee district of Nuseirat was being used as an emergency shelter."}, {"id": "9026f4d2-b45a-4ead-adfc-1a7676f17d18", "title": "EA - 18G Growler Killed A Houthi Mi - 24 Hind With An AGM - 88E Anti - Radiation Missile", "date": "2024-06-07 06:15", "url": "https://news.yahoo.com/news/ea-18g-growler-killed-houthi-195315337.html", "message": "The Navy on Thursday confirmed to The War Zone that one of its EA-18G Growler electronic warfare aircraft used an AGM-88E Advanced Anti-Radiation Guided Missile (AARGM) to destroy a Mi-24/35 Hind attack helicopter .\nThe official could not say if that engagement was the same as the one that earned a Growler its Hind kill mark.\n“The Hind was reportedly struck on the ground, which is strange for a Growler,” The War Zone's Tyler Rogoway tweeted on May 16.\nhttps://www.youtube.com/watch?v=FCBs1IEk9Fc\\u0026t=1sThe Growler kill mark was the latest in a long tradition of such art being stenciled onto aircraft, vessels and other military equipment indicating the destruction of enemy equipment.\nRegardless of the disposition of the fleet, there is now one less Hind in Houthi hands."}, {"id": "345bd3c8-f02a-4fc9-bb16-b210495d46e4", "title": "Whether Hezbollah Hit An Iron Dome Launcher Or Not , Its Almas Missiles Are A Problem For Israel", "date": "2024-06-07 02:30", "url": "https://www.yahoo.com/news/whether-hezbollah-hit-iron-dome-013811777.html", "message": "Several components of an active Iron Dome launcher appear to be missing.\nWhile it was struck, there was no indication of secondary explosions from the Tamir interceptors that fill the canisters in an active Iron Dome launcher.\n“This is the first time I've observed an Iron Dome launcher being hit.\nOn Wednesday, The IDF said it “was unaware of any damage to an Iron Dome launcher,” the Times of Israel reported .\nThe latest configuration of the Iron Dome system also have a demonstrated ability to shoot down drones and low-flying cruise missiles ."}, {"id": "95e3045e-876b-4299-b303-fd3f1eb9d55d", "title": "Press TVs news headlines", "date": "2024-06-07 04:00", "url": "http://www.presstv.ir/Detail/2024/06/07/726979/Heds", "message": "US-Israeli genocide in GazaMore Palestinian civilians are killed as Israel’s indiscriminate airstrikes and artillery fire continue to pound various parts of the besieged Gaza Strip.\nAn Israeli strike on a house in the Nusseirat refugee camp in central Gaza has killed the mayor of the camp and four members of his family.\nThe new attacks came after a deadly Israeli strike on a school in the Nusseirat camp killed at least 40 civilians, including nine women and 14 children.\nGaza school attackCondemnations are pouring in over Israel’s deadly airstrike on a UN-run school in central Gaza, which killed over 40 displaced Palestinian civilians sheltering there.\nUN Secretary General, Antonio Guterres condemned the attack as another horrific example of the price Palestinian civilians are paying to survive."}, {"id": "7ec98b15-396e-434e-8367-79a59d2c82f9", "title": "Israeli military strikes UN school in Gaza Strip", "date": "2024-06-07 07:30", "url": "https://thetimeshub.in/israeli-military-strikes-un-school-in-gaza-strip/", "message": "Photo: Staff member The UN inspects a UN school damaged during Israeli bombing in Nuseirat, in the central part of the Gaza Strip, June 6, 2024The Israeli military on Thursday, June 6, carried out an airstrike on a UN school in the central part Gaza Strip, which, according to Palestinian health authorities, killed at least 27 people, reports Voice of America.\nThe Israel Defense Forces reported that Hamas militants who took part in the attack on Israel 7 October, used the school as a hideout and a “direction of terror.”The Hamas press office rejected Israel's explanation and said Israeli forces had committed a “brutal crime” against displaced persons.\nThe attack targeted a school in Nuseirat run by the UN agency for Palestinian refugees.\nPrepared by: Sergei Daga"}, {"id": "55d95e7e-0184-402f-89eb-f4aacbabe398", "title": "State Dept : Israel Must Identify Hamas  Fighter Killed – One America News Network", "date": "2024-06-07 02:30", "url": "https://www.oann.com/newsroom/state-dept-israel-must-identify-hamas-fighters-killed/", "message": "The Israelis have released footage they say is evidence of those Hamas operations,” according to CNN.\n“Documents were [previously] found on the bodies of Hamas terrorists by Israeli first responders… They include detailed maps and show that Hamas intended to kill or take hostage civilians and schoolchildren,” according to NBC News.\nMeanwhile, U.S. State Department spokesman Matthew Miller asserted that the identities of the “Hamas fighters” should be identified, the BBC reported.\nAlthough Israel typically does so anyway, the U.S. rarely presses Israel to identify terrorists it has killed in airstrikes.\nTwo upper floors of the building’s classrooms were marked on an annotated aerial shot as the “locations of the terrorists,” according to the IDF."}, {"id": "96af8249-099e-4dab-8a29-c6b7afb8f603", "title": "Yemen Houthi rebels unveil solid - fuel  Palestine  missile that resembles Iranian hypersonic", "date": "2024-06-07 05:30", "url": "https://www.theweek.in/wire-updates/international/2024/06/07/fgn12-yemen-palestine-missile.html", "message": "Dubai, Jun 7 (AP) Yemen's Houthi rebels have unveiled a new, solid-fuel missile in their arsenal that resembles aspects of one earlier displayed by Iran that Tehran described as flying at hypersonic speeds.\nThe rebels fired its new “Palestine” missile, complete with a warhead painted like a Palestinian keffiyeh checkered scarf, at the southern Gulf of Aqaba port of Eilat in Israel on Monday.\nFor their part, the Houthis described the Palestine as a “locally made” missile.\nIranian media reported the launch of the Palestine and described it as locally manufactured, citing the Houthis.\nIn March, Russia's state-run RIA Novosti news agency quoted an anonymous source claiming the Houthis had a hypersonic missile."}, {"id": "801f59c6-63a0-47cc-a7b1-eb24b88122c9", "title": "Dubai : Yemen Houthi rebels unveil solid - fuel  Palestine  missile that resembles Iranian hypersonic", "date": "2024-06-07 07:45", "url": "https://timesofindia.indiatimes.com/world/middle-east/yemens-houthi-rebels-unveil-solid-fuel-palestine-missile-that-resembles-iranian-hypersonic/articleshow/110781664.cms", "message": "Yemen's Houthi rebels launched a new solid-fuel missile, the 'Palestine', at Israel's Eilat port.\nResembling Iran's hypersonic missiles, the attack caused no damage.\nSolid-fuel missiles offer rapid deployment, crucial as Houthi launch sites face frequent strikes.\nWhile Houthis claim local production, Iran's support is evident.\nThe missile's speed and maneuverability remain uncertain, posing challenges for missile defense systems."}, {"id": "8fc6b5fd-783a-4d73-9ea6-c970f246658e", "title": "Israeli strike on UN school in Gaza leaves 40 dead - World", "date": "2024-06-07 03:30", "url": "https://www.dawn.com/news/1838296/israeli-strike-on-un-school-in-gaza-leaves-40-dead", "message": "Ismail Al-Thawabta, the director of the Hamas-run government media office, rejected Israel’s assertion that the UN school in Nuseirat, in central Gaza, had hidden a Hamas command post.\n“The occupation uses … false fabricated stories to justify the brutal crime it conducted against dozens of displaced people,” Thawabta told Reuters.\nAs people at the school cleared rubble from bloodstained classrooms, survivor Huda Abu Dhaher described waking up to the sound of rockets.\nCeasefire effortsIsrael announced a new military campaign in central Gaza on Wednesday as it battles fighters relying on hit-and-run tactics.\nIt says there will be no halt to fighting during the ceasefire talks, which have intensified since US President Joe Biden outlined a proposal."}, {"id": "2acaad80-dc16-4660-8820-b900fd2e7c33", "title": "Disaster Drills : St . Joseph County first responders undergo crisis training", "date": "2024-06-07 01:00", "url": "https://wsbt.com/news/local/disaster-drills-first-responders-undergo-crisis-training-active-shooter-scenario-practice-target-hypothetical-police-firefighter-dispatch-emergency-management-south-bend-st-joseph-county-indiana", "message": "These departments all had to work together to manage active shooter and other disaster scenarios.\nWSBT 22 watched as they ran through their protocols to try and neutralize hypothetical targets, eliminate threats, and keep people safe in active shooter situations.\nKnown as ASIM, or active shooter incident management, the class was heralded by the students as informative and in depth.\nThe hypothetical situation continued to change and develop, something that police say can be helpful in potential future similar scenarios.\nKirsits tells WSBT 22 he was very impressed with the attendance from all the departments, and O’Chap says she feels her department is better able to respond to a potential active shooter situation now."}, {"id": "d5038fbd-d010-422a-b0df-aad348745b07", "title": "Houthi rebels unveil solid - fuel  Palestine  missile resembling Iranian hypersonic | Nation and World", "date": "2024-06-07 02:45", "url": "https://www.reviewjournal.com/news/nation-and-world/yemens-houthi-rebels-unveil-solid-fuel-palestine-missile-resembling-iranian-hypersonic-3064034/", "message": "That’s a key concern for the Houthis as their missile launch sites have been repeatedly targeted by U.S. and allied forces.\nThis frame grab from video released by the Ansar Allah Media Office of Yemen's Houthi rebels on Wednesday, June 5, 2024, shows the launch of a Palestine missile from a rebel-controlled area of Yemen.\nYemen's Houthi rebels have unveiled a new, solid-fuel missile in their arsenal that resembles aspects of one earlier displayed by Iran that Tehran described as flying at hypersonic speeds.\nThe logo in the bottom right reads in Arabic: \"Yemen War Media.\"\nFor their part, the Houthis described the Palestine as a “locally made” missile."}, {"id": "2a9cc0ef-7219-472e-b1f6-c04d3c04e9bf", "title": "Houthi rebels unveil new hypersonic missile | The Arkansas Democrat - Gazette", "date": "2024-06-07 09:30", "url": "https://www.arkansasonline.com/news/2024/jun/07/houthi-rebels-unveil-new-hypersonic-missile/", "message": "DUBAI, United Arab Emirates -- Yemen's Houthi rebels have unveiled a new, solid-fuel missile in their arsenal that resembles aspects of one earlier displayed by Iran that Tehran described as flying at hypersonic speeds.\nThe rebels fired its new \"Palestine\" missile, complete with a warhead painted like a Palestinian keffiyeh checkered scarf, at the southern Gulf of Aqaba port of Eilat in Israel on Monday.\nFor their part, the Houthis described the Palestine as a \"locally made\" missile.\nIn March, Russia's state-run RIA Novosti news agency quoted an anonymous source claiming the Houthis had a hypersonic missile.\nHypersonic weapons, which fly at speeds higher than Mach 5, could pose crucial challenges to missile defense systems because of their speed and maneuverability."}, {"id": "39a018bd-9300-4e6d-b94b-3447d9650ec4", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:30", "url": "https://www.wcbe.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "05f839a4-ec72-4403-a976-14d7a86190e9", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:30", "url": "https://www.weaa.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "00deaff3-051b-43e2-80da-6bb2a91dcb19", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://www.kgou.org/politics-and-government/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "decce4d6-913a-4af0-9e5e-e88d9201f4b3", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://www.wcsufm.org/latest-from-npr/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "e629b633-20b4-4fa4-a77b-5061889ebeb1", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://www.kedm.org/npr-national-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "a2820401-d038-4145-ac06-862b280e992d", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:45", "url": "https://www.wbfo.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "f3146759-ea34-4e5c-aad7-99aa4540b846", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.wxpr.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "a2de04f3-1c40-4b23-90ba-125b485f139f", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.kpcw.org/npr-top-stories/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "a27323a6-f0f5-4c7e-96e6-022f1073f9d3", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.interlochenpublicradio.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "1a076d4d-f420-4e14-a240-514dff042dbc", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.ijpr.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "ede8f3cb-f869-487e-b02e-c3cdb14a9109", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.wwno.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "797c4504-6304-4ede-b4c7-7e2bbeec124a", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 00:15", "url": "https://www.kios.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "35042319-8985-49ca-90a4-390a77a84cdb", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 01:00", "url": "https://www.wdiy.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "0106e7a9-2756-4f77-abfd-1c1e49b4be08", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 01:00", "url": "https://www.publicradioeast.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "b64ab4a9-6103-45c9-8913-d35f083b6472", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 02:00", "url": "https://www.wkms.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "36bfe829-f368-443f-854f-d4efb04e74d6", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 02:15", "url": "https://www.wutc.org/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "5e5b7c29-5150-4b36-b34b-401fbe578aff", "title": "Israel used a U . S .- made bomb in a deadly U . N . school strike in Gaza", "date": "2024-06-07 01:30", "url": "https://www.wxxinews.org/npr-news/2024-06-06/israel-used-a-u-s-made-bomb-in-a-deadly-u-n-school-strike-in-gaza", "message": "But the 2 a.m. strike killed at least 32 people, including seven children, according to Dr. Khalil Doqran, director of the Al-Aqsa Martyrs hospital in central Gaza.\nAnas Baba for NPR / Injured men sit outside the scene of destruction caused by an Israeli strike on a U.N. school in Nuseirat in central Gaza.\nThe Pentagon official told NPR that Israel had used the bomb improperly because the bomb is intended to cause low collateral damage but caused a high number of casualties.\nAnas Baba for NPR / The remains of a U.S.-made bomb that was used by Israel in a deadly airstrike Thursday on a United Nations school compound in Gaza.\nAnas Baba for NPR / The aftermath of an Israeli strike on a UN school in Nuseirat in central Gaza."}, {"id": "c6fea60b-c228-4134-b528-2b11bda56b32", "title": "Charges filed in stabbing outside Union Station that left woman critically hurt – NBC Chicago", "date": "2024-06-07 01:30", "url": "https://www.nbcchicago.com/news/local/charges-filed-71-year-old-woman-stabbed-outside-union-station/3457463/", "message": "As a 71-year-old woman recovers at an area hospital following a horrifying stabbing outside of Chicago’s Union Station on Wednesday, the man accused of attacking her is now facing charges.\nAccording to Chicago police, 25-year-old Wilson Barreno was charged with multiple felonies, including attempted murder and aggravated battery in connection with the stabbing.\nRado was listed in critical condition after the attack, but her husband Alan told NBC Chicago that the sharp object missed his wife’s internal organs.\n“She was just walking down the street, coming back home and an arm went around her neck from behind.\nArlene called her husband after the attack, telling him that she “feels very lucky to be alive.”"}, {"id": "827afd68-3755-4d84-9011-5046afbc7b9e", "title": "Many casualties reported in Israeli attack on UN school in Gaza", "date": "2024-06-07 08:15", "url": "https://www.heraldmalaysia.com/news/many-casualties-reported-in-israeli-attack-on-un-school-in-gaza/76417/2", "message": "Many casualties reported in Israeli attack on UN school in GazaIsrael’s military has struck what is said was a Hamas compound inside a UN school in central Gaza.\nJun 07, 2024Internally displaced Palestinians look out from the balcony of a UNRWA school damaged by an Israeli airstrike (ANSA)By Nathan MorleyReports say more than 35 people were killed in the attack.\nDozens of others were injured in the air strike targeting a school housing displaced people in the Nuse-irat camp in the central Gaza Strip.\nMore than 36,000 people have lost their lives in Gaza since the start of the war, according to the Hamas-run health ministry.\nThe conflict began in October when Hamas gunmen launched a brutal attack on Israel, killing about 1,200 people and seizing 252 hostages.--Vatican News"}, {"id": "ff37d730-2332-4eab-a5cb-e7ea621808e0", "title": "Industrial facility ablaze in Kyiv Oblast following Russian attack", "date": "2024-06-07 09:30", "url": "https://www.yahoo.com/news/industrial-facility-ablaze-kyiv-oblast-074900737.html", "message": "Industrial facility ablaze in Kyiv Oblast following Russian attackA fire broke out at an industrial facility in Kyiv Oblast due to a Russian attack on June 7, fortunately, leading to no casualties, Kyiv Governor Ruslan Kravchenko reported on Facebook.\nKyiv Oblast was targeted overnight by Russian drones and missiles.\nRead also: Ukraine braces for winter energy crisis amid Russian attacks — video\"A fire broke out at an industrial facility in Oblast after Russian aerial attack,\" he said.\n\"Emergency services are on site, working to extinguish the fire and deal with the attack aftermath,\" he added.\nRead also: Russia uses thermobaric missiles in Chasiv Yar, Donetsk OblastRussian troops launched cruise missiles against Ukraine overnight of June 7."}, {"id": "ea50457e-18be-4f02-b6a6-569ea37c1632", "title": "False Flag On The Horizon ? The Strange Case Of The Destroyed Russian Nuclear Radar", "date": "2024-06-07 03:00", "url": "https://www.zerohedge.com/geopolitical/false-flag-horizon-strange-case-destroyed-russian-nuclear-radar", "message": "NATO has (until the past couple of days) enforced tight restrictions on how their weapons can be used by Ukraine.\nThat said, it’s not so much the weapons used that concerns me, it’s the specific targets that Ukraine supposedly chose.\nMeaning, the two stations destroyed by Ukrainian weapons are meant to act as an early warning system for nuclear attack.\nLet’s consider the ugly realities…First, the targeting of Russian nuclear defenses might make the Kremlin believe they are being prepped for a nuclear strike.\nThey might launch their own warheads in response to a non-nuclear strike (a fake strike or false flag)."}, {"id": "87eecf99-763b-4ca6-8752-ce004a32b32e", "title": "Houthi Group Claims Joint Aerial Attack With Iraqi Group Against Israeli Ships To Protest Gaza War", "date": "2024-06-07 04:30", "url": "https://www.outlookindia.com/international/yemen-houth-rebel-iraqi-group-attack-ships-haifa-post-israel-denies", "message": "Houthi rebels in Yemen may be running through their supplies of drone swarms and anti-ship ballistic missiles Photo: APHouthi rebels in Yemen may be running through their supplies of drone swarms and anti-ship ballistic missiles Photo: AP"}, {"id": "c639d7ce-6293-4190-8174-e7429e6ed142", "title": "US Urges Israel To Be  fully Transparent  After Strike On UN School", "date": "2024-06-07 09:00", "url": "https://easternmirrornagaland.com/us-urges-israel-to-be-fully-transparent-after-strike-on-un-school/", "message": "He said the US had seen reports that 14 children were killed in the strike.\n“If that is accurate that 14 children were killed, those aren’t terrorists,” Miller said.\n“These are all facts that need to be verified, and that’s what we want to see happen.”According to the UNRWA, the school building in the refugee district of Nuseirat was being used as an emergency shelter.\nIt was initially not possible to independently verify the information.\nTwenty to 30 members of Hamas and the Palestinian Islamic Jihad (PIJ) were believed to have been in three classrooms of the school building in the Nuseirat refugee neighbourhood, according to the Israeli army."}, {"id": "ee4ea5f8-1ab1-4e66-999e-9a46b3bb1c74", "title": "Putin : We Could Supply Long - Range Missiles To Enemies Of West In Retaliation – Infinite Unknown", "date": "2024-06-07 02:15", "url": "https://infiniteunknown.net/2024/06/06/putin-we-could-supply-long-range-missiles-to-enemies-of-west-in-retaliation/", "message": "He suggested that he’s mulling the option of providing adversaries of the West with Russian long-range missiles.\nBecause using such Western weapons involves military personnel of those countries controlling the missiles and selecting targets, Mr Putin claimed Moscow could take “asymmetrical” steps elsewhere in the world.\npic.twitter.com/wZkcKpr9DL — Russian Market (@runews) June 5, 2024* * *Ukraine is already attacking Russian territory with US-supplied long-range weapons, a fresh NY Times investigation has acknowledged.\nIt comes a mere days after the Biden administration greenlighted Ukraine’s request to fire American weapons onto Russian soil.\nOn Russian territory."}, {"id": "04e1e6d9-984c-4b36-9789-523dcc8299ff", "title": "Explosions rock Khmelnytskyi Oblast", "date": "2024-06-07 08:15", "url": "https://www.yahoo.com/news/explosions-rock-khmelnytskyi-oblast-013435146.html", "message": "Explosions were heard in Khmelnytskyi Oblast during a Russian missile attack on the night of 6-7 June.\nSource: Suspilne, Ukraine's public broadcasterDetails: An air-raid warning was still in effect for the region at the time.\nUkraine's Air Force warned of a missile attack.\nBackground:On the late evening of 6 June, the Air Force reported that four Russian strategic bombers had taken off in Russia, and later the military recorded launches of cruise missiles.\nOn the evening of 6 June, Russian troops launched several groups of attack drones from the temporarily occupied territories of Ukraine’s south."}, {"id": "200318ce-0c1f-4902-8e55-302eadf639e9", "title": "As Zelensky visits for D - Day , Macron promises Ukraine Mirage aircraft to fend off Russian attacks", "date": "2024-06-07 00:15", "url": "https://www.bostonglobe.com/2024/06/06/world/zelensky-visits-d-day-macron-promises-ukraine-mirage-aircraft-fend-off-russian-attacks/", "message": "KHARKIV, Ukraine — French President Emmanuel Macron announced Thursday that France will provide Ukraine with its Mirage combat aircraft to help the country’s defense against Russia’s aggression.\nOn Wednesday, Russian President Vladimir Putin warned that Russia could provide long-range weapons to other countries so that they could strike Western targets.\n“We’re not talking about giving [Ukraine] weapons to strike Moscow, to strike the Kremlin,” Biden told ABC News.\n“Let the U.S. and its allies feel the impact of direct use of Russian weapons by others,” Medvedev wrote on his messaging app channel.\nPutin deliberately didn’t identify who would receive Russian weapons, Medvedev said, adding that they could go to anyone who considers the US and its allies their enemies."}, {"id": "be27bb52-dbbc-4434-be05-d79058cec434", "title": "Russia launches missile attacks on Ukraine , targets western oblasts", "date": "2024-06-07 02:30", "url": "https://www.yahoo.com/news/russia-launches-missile-attacks-ukraine-015302020.html", "message": "Russian forces launched a missile attack on Ukraine overnight on June 7, primarily targeting the country's western oblasts.\nThe Air Force cited the threat of Russian cruise missiles, Tu-95MS bombers, and Shahed-type drones.\nPolish and other allied aircraft were scrambled to protect the country's own airspace in response to reports of the Russian missile attacks, the Operational Command of Poland's Armed Forces said on X.\nAccording to the Air Force, mobile fire groups downed 48 of 53 Shahed-type drones and all 5 cruise missiles launched by Russia overnight.\nAs a result of the attacks on energy infrastructure, Ukraine began implementing rolling shutdowns on May 15, but they have dramatically increased in recent days."}, {"id": "061f4fdc-8d4c-4278-885b-b797ebc1c927", "title": "  The Flabbergasting Question  ", "date": "2024-06-07 01:00", "url": "https://larouchepub.com/other/2024/5123-the_flabbergasting_question.html", "message": "International Peace Coalition Meeting‘The Flabbergasting Question’[Print version of this article]May 31—Today’s meeting marked the one-year anniversary of the International Peace Coalition, with 52 consecutive online weekly meetings.\nThe Schiller Institute circulated an emergency warning on these developments, and the story subsequently broke into the mainstream media, but is still not getting the attention it deserves.\nCol. Black asked the participants to consider the contrast in U.S. and Russian doctrines regarding the use of nuclear weapons.\nHelga Zepp-LaRouche called this the “flabbergasting question.” Bosshard said, “Politicians in the West are apparently unaware of the risks they are taking,” and suggested that they think Putin is bluffing.\nIn conclusion, Zepp-LaRouche reminded the participants of the upcoming Schiller Institute conference, saying that the Peace of Westphalia is a good historical reference."}, {"id": "164c9116-0260-4c95-b118-e2763ad17f4c", "title": "Ukraine Adopts Aggressive New Tactic with Western Blessing : Striking Inside Russia", "date": "2024-06-07 04:30", "url": "https://trendydigests.com/2024/06/07/ukraine-adopts-aggressive-new-tactic-with-western-blessing-striking-inside-russia/", "message": "Ukraine, with newfound backing from key Western nations, has initiated a radical shift in its military strategy by targeting Russian territories using Western-supplied arms.\nUkrainian forces now deploying reconnaissance drones to identify military targets within Russia and striking them, possibly with Western-supplied weapons.\nJulian Röpcke, a military observer, described the tactic’s effectiveness, noting that Ukrainian drones now track targets inside Russia, guiding Western weapon strikes.\nNevertheless, the Ukrainian official underscored that Russia continues its assault on Kharkiv using an array of other weaponry.\nThese tactical changes come amidst the backdrop of US President Joe Biden authorizing Ukraine to use US weapons for limited strikes inside Russia to defend Kharkiv."}, {"id": "79bff0d6-35a6-4baf-b0a9-521e1dacc14c", "title": "Mayor of Gaza Nuseirat killed in Israeli attack : Sources", "date": "2024-06-07 03:00", "url": "https://www.prokerala.com/news/articles/a1537539.html", "message": "Gaza, June 7 : The Palestinian Mayor of central Gaza's Nuseirat refugee camp, Iyad al-Mughari, was killed in an Israeli airstrike, Palestinian medical and security sources have said.\nThe mayor was killed, along with a number of his family members, as an Israeli attack targeted a building in the camp on Thursday, Xinhua news agency reported, citing Palestinian security sources.\nMedical sources said al-Mughari's body was transferred to al-Aqsa Hospital in Deir al-Balah city in central Gaza.\nAl-Mughari, one of the cadres of the Hamas movement, was appointed mayor by acclamation, the sources noted.\nThe killing of al-Mughari came hours after the killing of about 35 Palestinians in an Israeli attack on a school affiliated with the United Nations Relief and Works Agency for Palestine Refugees in the Near East, which was housing displaced people in the Nuseirat camp."}, {"id": "2a744882-4e19-4497-81b8-da7ef378b15b", "title": "Mayor of Gaza Nuseirat killed in Israeli attack", "date": "2024-06-07 05:15", "url": "http://www.uniindia.com/mayor-of-gaza-s-nuseirat-killed-in-israeli-attack/world/news/3215446.html", "message": "Gaza, June 7 (UNI) The Palestinian mayor of central Gaza's Nuseirat refugee camp, Iyad al-Mughari, was killed in an Israeli airstrike on Thursday, Palestinian medical and security sources said.\nPalestinian security sources told Xinhua that the mayor was killed, along with a number of his family members, as an Israeli attack targeted a building in the camp.\nAl-Mughari, one of the cadres of the Hamas movement, was appointed mayor by acclamation, the sources noted.\nThe killing of al-Mughari came hours after the killing of about 35 Palestinians in an Israeli attack on a school affiliated with the United Nations Relief and Works Agency for Palestine Refugees in the Near East, which was housing displaced people in the Nuseirat camp.\nThe Palestinian death toll from the ongoing Israeli attacks in the enclave has risen to 36,654, with 83,309 people injured, updated the Gaza health authorities on Thursday."}, {"id": "649e7929-cd82-4854-a35c-419b8c8e73d7", "title": "Bibi warns of  intense op  against Hezbollah", "date": "2024-06-07 03:15", "url": "https://timesofindia.indiatimes.com/world/middle-east/bibi-warns-of-intense-op-against-hezbollah/articleshow/110780256.cms", "message": "PM Netanyahu on Wednesday threatened a “very intense” military action along the border with Lebanon , where Israeli troops have exchanged near-daily fire with Hezbollah fighters .\n“We are prepared for a very intense operation in the north.\nOne way or another, we will restore security to the north,” he said during a visit to the border area.\nHezbollah said later it launched several attacks on Israeli positions, including a “guided missile” strike on an “Iron Dome platform in the Ramot Naftali barracks”."}, {"id": "9f32abca-5481-48c5-85c7-7bb396371e85", "title": "IDF : We Stopped A  Ticking Time Bomb  In UNRWA School Airstrike – The Yeshiva World", "date": "2024-06-07 07:30", "url": "https://www.theyeshivaworld.com/news/israel-news/2289095/idf-we-stopped-a-ticking-time-bomb-in-unrwa-school-airstrike.html", "message": "IDF Spokesman Rear Admiral Daniel Hagari revealed the identities of the Hamas and Islamic Jihad terrorists killed in an IAF airstrike on a UNRWA school in Nuseirat last night.\n“Overnight, the IDF conducted a precise, intelligence-based strike targeting dozens of Hamas and Islamic Jihad terrorists hiding inside a UN school in Gaza,” Hagari said.\nThe terrorists inside this school were planning more attacks against Israelis, some of them imminent.\nThe IDF spokesman presented a graphic showing the faces and names of the eliminated terrorists, including members of the ‘Nukhba’ force with blood on their hands.\n“Hamas and Islamic Jihad terrorists… These are only a few of the terrorists we eliminated."}, {"id": "4a510ea8-f628-4d56-be4b-ecf0cb05b17a", "title": "Dozens reported killed in Israeli strike on UN school in Gaza - World", "date": "2024-06-07 04:45", "url": "https://www.brecorder.com/news/40307328/dozens-reported-killed-in-israeli-strike-on-un-school-in-gaza", "message": "Ismail Al-Thawabta, the director of the Hamas-run government media office, rejected Israel’s assertion that the UN school in Nuseirat, in central Gaza, had hidden a Hamas command post.\nIsrael says jets strike school containing Hamas compound, Gaza media says 27 killed“The occupation uses ... false fabricated stories to justify the brutal crime it conducted against dozens of displaced people,” Thawabta told Reuters.\nCEASEFIRE EFFORTSIsrael announced a new military campaign in central Gaza on Wednesday as it battles fighters relying on hit-and-run insurgency tactics.\nIn another sensitive development, the Israeli military reported a rare attack near the Israel-Gaza border, saying a squad of Palestinian fighters killed a soldier and three of them were killed in return fire.\nOn Wednesday, the Israeli military said it was setting up a quick-response commando unit made up of border residents as a precaution against further armed incursions."}, {"id": "168d6db7-c72c-47f9-82f5-11aa7187d220", "title": "Russia , China wrangle with US over UN resolution on Gaza ceasefire plan", "date": "2024-06-07 09:00", "url": "https://www.euractiv.com/section/global-europe/news/russia-china-wrangle-with-us-over-un-resolution-on-gaza-ceasefire-plan/", "message": "A resolution needs at least nine votes in favor and no vetoes by the US, France, Britain, China or Russia to pass.\nBiden laid out a three-phase ceasefire plan for the Gaza Strip a week ago that he described as an Israeli initiative.\nThe US is seeking international support for the plan that Hamas is still studying.\nHamas says it wants a permanent end to the war in the Gaza Strip and Israeli withdrawal from the enclave of 2.3 million people.\nIsrael launched an air, ground and sea assault on the blockaded Palestinian territory, killing more than 36,000 Palestinians, according to Gaza health authorities."}, {"id": "f6966441-83ab-40a9-9720-f21da20a18c6", "title": "Morning Briefing : June 7 , 2024", "date": "2024-06-07 07:15", "url": "https://en.haberler.com/morning-briefing-june-7-2024-1963822/", "message": "News > Morning Briefing: June 7, 2024 Morning Briefing: June 7, 2024 07.06.2024 08:12 Anadolu’s recap of top stories from around the globe.\nPedro Sanchez's remarks came after Foreign Minister Jose Manuel Albares announced Spain's decision to join South Africa's genocide case against Israel.\nThe UN's relief chief voiced concern over Israel's airstrike on a UN agency for Palestinian refugees (UNRWA) school-turned-shelter in the Gaza Strip that killed dozens of displaced people.\nGreek Foreign Minister Giorgos Gerapetritis vilified an Israeli airstrike on a UN Agency for Palestinian Refugees (UNRWA) school-turned-shelter in the Gaza Strip that killed dozens of people.\nAt least 24 Israeli soldiers were injured in the last 24 hours, including six in the Gaza Strip, the military said."}, {"id": "3e95553a-0f63-4cda-b32e-ea2c446d1df0", "title": "Macron promises Ukraine Mirage aircraft to fend off Russian attacks", "date": "2024-06-07 00:45", "url": "https://japantoday.com/category/world/ukraine-hits-russian-oil-facilities-as-president-zelenskyy-joins-leaders-at-d-day-events-in-france", "message": "Ukrainian President Volodymyr Zelenskyy, left is greeted by French President Emmanuel Macron, at the international ceremony at Omaha Beach, near Saint-Laurent-sur-Mer.\nHe spoke after Ukrainian President Volodymyr Zelenskyy joined world leaders in France to commemorate the D-Day invasion.\n“We’re not talking about giving (Ukraine) weapons to strike Moscow, to strike the Kremlin,” Biden told ABC News.\n“Let the U.S. and its allies feel the impact of direct use of Russian weapons by others,” Medvedev wrote on his messaging app channel.\nPutin deliberately didn’t identify who would receive Russian weapons, Medvedev said, adding that they could go to anyone who considers the U.S. and its allies their enemies."}, {"id": "e6319ad3-cddc-4575-b6cc-11311ae5ce17", "title": "Attacco missilistico russo contro Ucraina occidentale", "date": "2024-06-07 04:15", "url": "https://www.giornaledibrescia.it/italia-e-estero/attacco-missilistico-russo-contro-ucraina-occidentale-j9s39734", "message": "ROMA, 07 GIU - Le forze russe hanno lanciato un attacco missilistico contro l'Ucraina nella notte, prendendo di mira principalmente le regioni occidentali del paese.\nLo riporta il Kyiv Independent, precisando che l'aeronautica militare ucraina ha fatto scattare un'allerta aerea nelle regioni di Ternopil, Khmelnytskyi e Lviv, nonché nella regione della capitale Kiev.\nLa minaccia è costituita dai missili balistici e da crociera russi, dai bombardieri Tu-95MS e dai droni di tipo Shahed.\nA seguito dell'attacco, è scoppiato un incendio in un impianto industriale nell'oblast di Kiev: sul posto sono attualmente presenti le squadre di soccorso per valutare l'entità dei danni e non sono segnalate vittime."}, {"id": "156994a1-1ffc-4f4a-868b-efe3262a36e9", "title": "  Horrific Image : Over 40 Killed At UN Gaza School That IDF Says Was Used By Hamas – Infinite Unknown", "date": "2024-06-07 02:15", "url": "https://infiniteunknown.net/2024/06/06/horrific-images-over-40-killed-at-un-gaza-school-that-idf-says-was-used-by-hamas/", "message": "There are reports of another mass casualty airstrike emerging from the Gaza Strip on Thursday.\nThe Israel Defense Forces (IDF) struck a school near the central Gaza city of Deir al-Balah, leaving at least 40 people dead and 74 injured.\nThe United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) says those sheltering at the Al-Nusseirat Boys Preparatory were given no prior warning that the strike was coming.\nBut the IDF has countered that it was a “precise strike on a Hamas compound” inside the school and that dozens of Hamas militants were using the compound."}, {"id": "a117774a-0475-4578-944a-03cfed8932c2", "title": "Israel pounds Gaza refugee camp as war enters ninth month", "date": "2024-06-07 09:15", "url": "https://www.digitaljournal.com/world/israel-pounds-gaza-refugee-camp-as-war-enters-ninth-month/article", "message": "Israel has expressed openness to discussions while insisting on pursuing its war aim of destroying the Palestinian Islamist group.\nAl-Aqsa Martyrs hospital in Deir al-Balah in central Gaza said at least 37 people were killed in Thursday’s Israeli strike on the UN-run school in Nuseirat camp.\nA day after the school was hit, the Nuseirat refugee camp faced renewed Israeli artillery shelling and air strikes, eyewitnesses said.\nWitnesses also confirmed Israeli strikes in the east of Deir al-Balah, as well as intensive fire from Israeli army vehicles east of the Bureij camp, where a blaze raged at a roundabout.\nSix people were killed and several wounded in an Israeli strike on the Wafati home in Maghazi camp, said a medical source at Al-Aqsa Martyrs hospital."}, {"id": "1d450528-3b79-46c3-9747-e605328858aa", "title": "Bangkok Post - Moscow says US to blame for civilian deaths in Russia", "date": "2024-06-07 08:45", "url": "https://www.bangkokpost.com/world/2806909/moscow-says-us-to-blame-for-civilian-deaths-in-russia-from-rockets-it-supplied-to-ukraine", "message": "Moscow says US to blame for civilian deaths in RussiaUkrainian servicemen fire a Partyzan multiple launch rocket system towards Russian troops near a frontline, amid Russia's attack on Ukraine, in Zaporizhzhia region, Ukraine, on May 12, 2023.\n(Photo: Reuters)ST PETERSBURG - Russia alleged on Friday that Ukraine had used US-supplied rockets to kill women and children in a region of southern Russia, and said that Washington was to blame.\nShe said statements by Washington giving the green light for such attacks amounted to \"a confession...for the murder of children and women in the Belgorod region\".\nReuters could not independently verify the assertion and there was no immediate comment from Ukraine or the United States.\nShe did not say how many people had been killed in the alleged incident."}, {"id": "71b337be-46a3-4217-837c-e37b663d1b69", "title": "Israel pounds Gaza refugee camp as war enters ninth month", "date": "2024-06-07 09:30", "url": "https://www.al-monitor.com/originals/2024/06/israel-pounds-gaza-refugee-camp-war-enters-ninth-month", "message": "June 7, 2024 — Palestinian Territories (AFP)Israeli strikes hammered a Gaza refugee camp on Friday after a deadly strike on a UN-run school, as the war sparked by Hamas's unprecedented attack on Israel entered its ninth month.\nIsrael has expressed openness to discussions while insisting on pursuing its war aim of destroying the Palestinian Islamist group.\nAl-Aqsa Martyrs hospital in Deir al-Balah in central Gaza said at least 37 people were killed in Thursday's Israeli strike on the UN-run school in Nuseirat camp.\nA day after the school was hit, the Nuseirat refugee camp faced renewed Israeli artillery shelling and air strikes, eyewitnesses said.\nWitnesses also confirmed Israeli strikes in the east of Deir al-Balah, as well as intensive fire from Israeli army vehicles east of the Bureij camp, where a blaze raged at a roundabout."}, {"id": "8c813b8e-66d3-42df-9240-a14d4d103d71", "title": "Madison Schemitz walking after being paralyzed when ex stabbed her", "date": "2024-06-07 01:00", "url": "https://nypost.com/2024/06/06/us-news/madison-schemitz-walking-after-being-paralyzed-when-ex-stabbed-her/", "message": "A Florida high school softball star left paralyzed from the chest down after her stalker ex-boyfriend allegedly stabbed her more than a dozen times has revealed she’s now miraculously walking again — a year after the heinous attack.\nI wish I had the right words to describe this last year,” the teen wrote alongside her post.\nPearson is accused of maniacally plunging the knife into his ex 15 times before slicing his own throat in a failed suicide bid.\nHer jilted ex-boyfriend, Spencer Pearson, 18, is charged with attempted murder and aggravated battery over the attack.\nIn the aftermath, Pearson — a former high school football player — spent several weeks in the hospital before being booked into a St. John’s County jail."}, {"id": "cf23b4e9-4c12-47b4-a9b4-c7b4adc031c6", "title": "European Parliament Elections : Far - Right Parties Expect Major EU Gains", "date": "2024-06-07 02:30", "url": "https://foreignpolicy.com/2024/06/06/eu-parliament-elections-far-right-israel-unrwa-school/", "message": "Welcome back to World Brief, where we’re looking at the rise of the far right in the European Parliament elections, Israel’s deadly strike on a U.N.-run school in Gaza, and Russian saber-rattling against the West.\nAlthough the European Parliament cannot draft legislation, its veto and budget-approving powers give it authority to shape the bloc’s agenda for the next five years.\nThis week’s elections are the second-largest democratic exercise in the world after India’s general elections.\nGreen parties secured major gains in 2019 during the last European Parliament elections, as climate change dominated public concern.\nThe far-right Alternative for Germany party capitalized on the assault to condemn Scholz’s Social Democratic Party, accusing it of being weak on immigration."}, {"id": "04589cdf-478f-481e-8206-0b8f08b6ccf8", "title": "Russia Launches Overnight Attack on Ukraine , Poland Scrambles Jets in Response", "date": "2024-06-07 09:15", "url": "https://www.kyivpost.com/post/33908", "message": "Russian forces launched yet another missile attack against Ukraine on Friday morning, June 7, firing Shahed drones and missiles from at least four strategic bombers, targeting different regions across Ukraine.\nIn the early hours of June 7, a nationwide air alert was issued across Ukraine as four Russian Tu-95MS bombers took to the skies.\nThe attack started with the sighting of Shahed-type drones over multiple Ukrainian regions, followed by cruise missile strikes targeting mostly western regions.\nAdvertisementAround 3:30 a.m. the monitoring telegram channels reported missiles passing through the Chernihiv region, indicating potential strikes on western Ukraine.\nIn response to the heightened activity of Russian long-range aviation, Poland, alongside allied nations, scrambled military aircraft."}, {"id": "5a0d1e7e-1757-4a60-ba9b-f1e5a53632ff", "title": "Russia nuclear - powered submarine to visit Cuba amid rising tensions with US", "date": "2024-06-07 00:15", "url": "https://www.theguardian.com/world/article/2024/jun/07/russia-nuclear-powered-submarine-kazan-to-visit-cuba", "message": "A Russian nuclear-powered submarine – which will not be carrying nuclear weapons – will visit Havana next week, Cuba’s communist authorities have announced, amid rising tensions with the US over the war in Ukraine.\n“None of the vessels is carrying nuclear weapons, so their stopover in our country does not represent a threat to the region,” the ministry said.\nThe US officials said that the Russian military presence was notable but not concerning.\nThe Russian vessels’ visit to Cuba will also overlap with Biden’s visit to the G7 leaders summit in Italy.\nThe deployment of Soviet nuclear missile sites on the island triggered the Cuban Missile Crisis of 1962, when Washington and Moscow came close to war."}, {"id": "03061fed-4c56-40e1-97b2-bfceb084c3cf", "title": "Russians target critical infrastructure : Ukraine Air Force downs 48 attack drones and 5 cruise missiles", "date": "2024-06-07 08:15", "url": "https://www.yahoo.com/news/russians-target-critical-infrastructure-ukraine-044031297.html", "message": "The Russians attacked Ukraine's critical infrastructure with five cruise missiles and 53 Shahed-131/136 attack UAVs on the night of 6-7 June; all missiles and 48 drones were destroyed.\nSource: Ukraine's Air Force on TelegramQuote from the Air Force: \"As a result of combat efforts, 48 attack UAVs and five Kh-101/Kh-555 cruise missiles were shot down in Dnipropetrovsk, Zaporizhzhia, Kirovohrad, Mykolaiv, Kherson, Odesa, Kharkiv, Kyiv and Khmelnytskyi oblasts.\"\nDetails: The Russians launched the missiles from strategic long-range Tu-95MS bombers from the airspace of Russia’s Saratov Oblast.\nThe air attack was repelled by mobile fire groups of the Ukrainian defence forces, fighter aircraft, anti-aircraft missile troops and electronic warfare units of the Air Force.\nBackground:Russia launched another combined attack on the territory of Ukraine on the night of 6-7 June."}, {"id": "a76f9349-bed8-4563-b5c5-29da34681a12", "title": "Russians target critical infrastructure : Ukraine Air Force downs 48 attack drones and 5 cruise missiles", "date": "2024-06-07 07:30", "url": "https://www.pravda.com.ua/eng/news/2024/06/7/7459612/", "message": "The Russians attacked Ukraine's critical infrastructure with five cruise missiles and 53 Shahed-131/136 attack UAVs on the night of 6-7 June; all missiles and 48 drones were destroyed.\nSource: Ukraine's Air Force on TelegramQuote from the Air Force: \"As a result of combat efforts, 48 attack UAVs and five Kh-101/Kh-555 cruise missiles were shot down in Dnipropetrovsk, Zaporizhzhia, Kirovohrad, Mykolaiv, Kherson, Odesa, Kharkiv, Kyiv and Khmelnytskyi oblasts.\"\nAdvertisement:Details: The Russians launched the missiles from strategic long-range Tu-95MS bombers from the airspace of Russia’s Saratov Oblast.\nThe air attack was repelled by mobile fire groups of the Ukrainian defence forces, fighter aircraft, anti-aircraft missile troops and electronic warfare units of the Air Force.\nBackground:Russia launched another combined attack on the territory of Ukraine on the night of 6-7 June."}, {"id": "ef1263b3-9fe4-4697-ae39-1300949d9a26", "title": "History of the Tank - Sky History", "date": "2024-06-07 08:45", "url": "https://www.tvguide.co.uk/schedule/91c2fa1b-26d3-5787-ad73-fa9c948aad5d/history-of-the-tank", "message": "History of the TankSky History 2:00 PM to 3:15 PM Friday 7 June Share Add toCalendar +History of the TankThe story of the changing face of tank warfare over the past 100 years from the first tanks produced in late 1914 to break the deadlock of Trench warfare on the Western Front.\nThe programme touches on their first use in the Battle of Somme and their involvement in the Cold War, to the present dayHistory of the Tank airs on Sky History at 2:00 PM, Friday 7 June .\nLearn more about History of the Tank and other education/science/factual topics on our factual page"}, {"id": "75be61ba-7ba2-4852-92c3-29c4bc5e3258", "title": "MW3 and Warzone : Mobile Suit Gundam Legends Event Rewards", "date": "2024-06-07 01:30", "url": "https://gameranx.com/features/id/500543/article/mw3-and-warzone-mobile-suit-gundam-legends-event-rewards/", "message": "Call of Duty: Modern Warfare 3 and Warzone has seen a range of crossovers in its lifetime, with more undoubtedly to come.\nThe Mobile Suit Gundam Legends crossover has brought new outfits to MW3 and Warzone, along with an event which has a stylish Bruen MK9 blueprint as the ultimate reward.\nMore Call of Duty guidesMW3 and Warzone: How to unlock the JAK Requiem | Call of Duty: Warzone – Where to Find Loot Hot Zones | Modern Warfare 3: What is Demolition Mode?\n| Modern Warfare 3: What is Hyper Cranked?\n| MW3 and Warzone: How to get Free Pride Cosmetics | Modern Warfare 3: Every New Killstreak | Season 4 | Modern Warfare 3: What are Playlist Modifiers?"}, {"id": "90913734-1a25-4b63-8dd5-4abba87ff858", "title": "Silac Pathammavong", "date": "2024-06-07 04:30", "url": "https://www.courant.com/obituaries/silac-pathammavong-newington-ct/", "message": "Silac “Richard” Pathammavong, 91, of Newington, beloved husband of the late Praseuth Pathammavong, passed away peacefully on Tuesday, April 30, 2019 at Vernon Manor.\nBorn in Laos to the late La and Khammy Pathammavong, he started his distinguished military career by serving in WWII with the French guerrilla forces during the Japanese occupation of French Indochina.\nIn 1968, he was promoted to brigadier general and assigned to the Commander-in-Chief’s staff of the Royal Lao Army.\nHe loved to watch boxing matches and warfare movies, but his true passion was his family who will miss him dearly.\nA funeral service will be held at 1 PM Saturday, May 11 at the funeral home."}, {"id": "6c621dfe-e0c3-4c82-b993-30f72b686cd7", "title": "Air Weapons : Game of Drones", "date": "2024-06-07 08:15", "url": "http://www.strategypage.com/htmw/htairw/articles/202406070253.aspx", "message": "Female soldiers can excel as UAV operators while mostly avoiding the battlefield risk of death or injury.\nUnlike pilots of combat aircraft, UAV operators are much less likely to be put out of action by death, injury, or capture.\nUAV operators are relatively close to the front lines and exposed to some risk, but not nearly as much as pilots.\nUkrainian USV operations in the Black Sea forced the Russian Black Sea Fleet to withdraw to the eastern shore of the Black Sea.\nBecause of the USVs, Ukraine, which does not have a conventional navy, now controls most of the Black Sea."}, {"id": "ad847e6c-e3dd-4be3-a504-d347143c26ff", "title": "Air Power Projection Celebrates 75th Anniversary", "date": "2024-06-07 03:15", "url": "https://www.miragenews.com/air-power-projection-celebrates-75th-anniversary-1251558/", "message": "Department of DefenceMoments in history: 75th anniversary of the Fleet Air ArmThe Royal Australian Navy (RAN) recently marked the 75th anniversary of rising above the waves and developing a fully integrated aerial combat force.\nThis creation of the now Fleet Air Arm was cemented into history on May 25, 1949, when the first light fleet carrier, HMAS Sydney III, arrived in Jervis Bay carrying the 20th Air Carrier Group comprising of the 816 and 805 Squadrons.\nWhile the current Fleet Air Arm has evolved into a sophisticated rotary-wing force, its original mandate remains the same: supporting military operations at sea.\nAcross its 75-year history, the Fleet Air Arm has been based on the NSW South Coast at HMAS Albatross, which continues to be the home of Navy's advanced, future-focused air assets.\nThe modern fleet of aircraft allows the Fleet Air Arm to deploy the Romeo across Anzac-class frigates, Hobart-class air warfare destroyers and the Canberra-class landing helicopter docks."}, {"id": "3f2da3f7-9234-4450-8daf-22435edcc0b7", "title": "Defence Exercise Concludes with Firepower Explosion", "date": "2024-06-07 01:30", "url": "https://www.miragenews.com/defence-exercise-concludes-with-firepower-1251489/", "message": "Department of DefenceExercise Rhino Run culminated in a 24-hour crescendo of combat power by 7th Battalion, the Royal Australian Regiment (7RAR), 1st Armoured Regiment and 1st Combat Engineer Regiment.\nThe exercise centred on 7RAR Battle Group Boar, but developed the full range of capabilities across the brigade, including the generation of an integrated Battle Group based on 10th/27th Battalion, the Royal South Australia Regiment.\nThe exercise evaluated the ability of combat teams and headquarters to plan and conduct tactical actions against a near-peer adversary, within a contemporary, combined arms setting.\nCommanding Officer 7RAR Lieutenant Colonel Von Lambert said it was a significant exercise for his unit, which will soon be re-linked with 5th Battalion, the Royal Australian Regiment, and relocated to Darwin.\n\"The key theme for us throughout Exercise Rhino Run has been readiness, and as part of that readiness it's an austere and expeditionary mindset,\" he said."}, {"id": "581c3fba-fe84-4c41-b2c4-c1d3bf9d9f19", "title": "D - DAY : 101 - year - old World War II veteran speaks on his time served after invasion in Normandy", "date": "2024-06-07 01:45", "url": "https://www.waff.com/2024/06/07/d-day-101-year-old-world-war-ii-veteran-speaks-his-time-served-after-invasion-normandy/", "message": "ARAB, Ala. (WAFF) - Thursday marked the 80th anniversary of D-Day, a turning point in World World II.\nI know some men who were there that didn’t come back.”His ties to the military extend far beyond just him, he has had brothers who have served in World War II and uncles who served in the first World War.\nOne of his uncles was killed in a poison gas attack in World War I. Carson says he considers himself lucky that similar tactics weren’t used as much in World War II.\nAfter the war, Carson kept the military in his life.\nHe went on to teach others how to work with military radio and served for a while at Redstone Arsenal."}, {"id": "86875da0-a3a6-42b9-a419-71265c8b27b6", "title": "D - Day anniversary haunted by dwindling number of veterans and shadowed by Europe new war", "date": "2024-06-07 05:15", "url": "https://timesofindia.indiatimes.com/world/europe/d-day-anniversary-haunted-by-dwindling-number-of-veterans-and-shadowed-by-europes-new-war/articleshow/110782906.cms", "message": "\"As now-centenarian veterans revisited old memories and fallen comrades buried in Normandy graves, Ukrainian President Volodymyr Zelenskyy's presence at the international D-Day commemoration fused World War II's awful past with the fraught present.\n\"The French president awarded the Legion of Honor to 14 US veterans and a British female veteran.\nHe flew 35 combat missions in all during World War II.Berthold later read aloud a letter he'd written home the next day, showing that even as a young man he was aware of D-Day's importance.\n\"Conscious of the inevitability of age and time for World War II veterans, throngs of aficionados in period uniforms and vehicles, along with tourists soaking up the spectacle, flooded Normandy for the 80th anniversary.\n\"We just have to remember the sacrifices of everybody who gave us our freedom,\" said Becky Kraubetz, a Briton now living in Florida whose grandfather served with the British Army during World War II and was captured in Malta."}, {"id": "a13b2001-d55d-4ca2-89c3-64e6c843b784", "title": "D - Day anniversary haunted by dwindling number of veterans and shadowed by Europe new war", "date": "2024-06-07 01:00", "url": "https://www.kiro7.com/news/world/d-day-anniversary/4FNPVI5HEBQGST57RTJ2NDBB7U/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "14df0bb0-e3c4-47ea-aae3-ded9468d23d2", "title": "D - Day Anniversary Haunted by Dwindling Number of Veterans and Shadowed by Europe New War – The Yeshiva World", "date": "2024-06-07 02:30", "url": "https://www.theyeshivaworld.com/news/general/2289017/d-day-anniversary-haunted-by-dwindling-number-of-veterans-and-shadowed-by-europes-new-war.html", "message": "Now bent with age, the dwindling number of World War II veterans joined a new generation of leaders on Thursday to honor the dead, the living and the fight for democracy on the shores where they landed 80 years ago on D-Day.\nThe war in Ukraine shadowed the ceremonies in Normandy, a grim modern-day example of lives and cities that are again suffering through war in Europe.\nRussia, a crucial World War II ally whose full-scale invasion of its smaller neighbor in 2022 set Europe on a new path of war, was not invited.\nYou’re back here today at home, if I may say.”The French president awarded the Legion of Honor to 14 U.S. veterans and a British female veteran.\nHe flew 35 combat missions in all during World War II."}, {"id": "ae516199-788c-4714-81c4-91f430724da8", "title": "The history of Pointe du Hoc , site of Biden D - Day speech : NPR", "date": "2024-06-07 09:30", "url": "https://www.npr.org/2024/06/07/nx-s1-4993494/pointe-du-hoc-dday-biden-normandy-speech", "message": "The dramatic story of Pointe du Hoc, the backdrop to Biden's D-Day anniversary speechtoggle caption Damien Meyer/AFP via Getty ImagesPresident Biden’s itinerary for commemorating D-Day’s 80th anniversary in France includes giving a speech on Friday at a Normandy site called Pointe du Hoc.\nPointe du Hoc didn’t only overlook the historic landings and battles happening on shore.\nA group of 225 U.S. Army Rangers — led by then-Lt. Col. James Earl Rudder — was tasked with destroying those guns.\nThere’s no exact count of how many U.S. lives the mission at Pointe du Hoc helped save, though Bell said there would have been nearly 5,000 ships in the range of the Germans’ artillery.\n“The Pointe du Hoc Memorial itself with the English Channel in the background and the Normandy cliffs to the east and west provided the setting for Reagan to bring another strong focus to the Allied invasion on D-Day,” he wrote."}, {"id": "1d0e3312-f24d-42c9-98c4-67d6ff43d659", "title": "D - Day anniversary haunted by dwindling number of veterans and shadowed by Europe new war", "date": "2024-06-07 07:30", "url": "https://www.timesfreepress.com/news/2024/jun/06/d-day-anniversary-haunted-by-dwindling-number-of-veterans-and-shadowed-by-europes-new-war/", "message": "Now bent with age, the dwindling number of World War II veterans joined a new generation of leaders on Thursday to honor the dead, the living and the fight for democracy on the shores where they landed 80 years ago on D-Day.\nRussia, a crucial World War II ally whose full-scale invasion of its smaller neighbor in 2022 set Europe on a new path of war, was not invited.\nThe French president awarded the Legion of Honor to 14 U.S. veterans and a British female veteran.\nHe flew 35 combat missions in all during World War II.\nConscious of the inevitability of age and time for World War II veterans, throngs of aficionados in period uniforms and vehicles, along with tourists soaking up the spectacle, flooded Normandy for the 80th anniversary."}, {"id": "1fcb0d18-50de-43ba-b10b-bda408ff3a5e", "title": "D - Day anniversary haunted by dwindling number of veterans , shadowed by Europe new war", "date": "2024-06-07 03:45", "url": "https://www.theday.com/nation/20240606/d-day-anniversary-haunted-by-dwindling-number-of-veterans-shadowed-by-europes-new-war/", "message": "World War II veterans listen during a ceremony to mark the 80th anniversary of D-Day, Thursday, June 6, 2024, in Normandy.\nRussia, a crucial World War II ally whose full-scale invasion of its smaller neighbor in 2022 set Europe on a new path of war, was not invited.\nHe flew 35 combat missions in all during World War II.\n(AP Photo/John Leicester)A World War II veteran arrives for ceremonies to mark the 80th anniversary of D-Day, Thursday, June 6, 2024, in Normandy.\nNormandy is hosting various events to officially commemorate the 80th anniversary of the D-Day landings that took place on June 6, 1944."}, {"id": "f5404f58-8081-489c-8747-d767d01309d2", "title": "D - Day anniversary marked by dwindling number of veterans", "date": "2024-06-07 01:00", "url": "https://www.airforcetimes.com/veterans/2024/06/06/d-day-anniversary-marked-by-dwindling-number-of-veterans/", "message": "Now bent with age, the dwindling number of World War II veterans joined a new generation of leaders on Thursday to honor the dead, the living and the fight for democracy on the shores where they landed 80 years ago on D-Day.\nRussia, a crucial World War II ally whose full-scale invasion of its smaller neighbor in 2022 set Europe on a new path of war, was not invited.\nHe flew 35 combat missions in all during World War II.\nShe was among a crowd of thousands of people that stretched for several miles along Utah Beach, the westernmost of the D-Day beaches.\n“They really were the golden generation, those 17-, 18-year-old guys doing something so brave,” said James Baker, a 56-year-old from the Netherlands, reflecting on Utah Beach."}, {"id": "acafc148-25aa-44cc-83cf-e189443452a7", "title": "D - Day anniversary haunted by dwindling number of veterans and shadowed by Europe new war", "date": "2024-06-07 01:00", "url": "https://www.wsbradio.com/news/world/d-day-anniversary/4FNPVI5HEBQGST57RTJ2NDBB7U/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "99ca7fa4-5ef1-43d1-9286-d9597076288c", "title": "D - Day anniversary haunted by dwindling number of veterans and shadowed by war in Ukraine", "date": "2024-06-07 03:00", "url": "https://www.adn.com/nation-world/2024/06/06/d-day-anniversary-haunted-by-dwindling-number-of-veterans-and-shadowed-by-war-in-ukraine/", "message": "(AP Photo/Virginia Mayo)OMAHA BEACH, France — As young soldiers, they waded through breaking waves and gunfire to battle the Nazis.\nThe war in Ukraine shadowed the ceremonies in Normandy, a grim modern-day example of lives and cities that are again suffering through war in Europe.\nRussia, a crucial World War II ally whose full-scale invasion of its smaller neighbor in 2022 set Europe on a new path of war, was not invited.\nYou’re back here today at home, if I may say.”The French president awarded the Legion of Honor to 14 U.S. veterans and a British female veteran.\nHe flew 35 combat missions in all during World War II."}, {"id": "47e6b779-1f7d-4379-94a5-e15fceb6c568", "title": "Eurofighter programme set for additional Italian order boost", "date": "2024-06-07 00:15", "url": "https://www.flightglobal.com/defence/eurofighter-programme-set-for-additional-italian-order-boost/158681.article", "message": "The four-nation Eurofighter consortium appears to be close to securing another order boost from one of its partner countries, with Italy expected to announce a follow-on commitment in the near future.\nThe Italian air force requirement is to acquire new fighters to replace its oldest Tranche 1-standard examples.\nAlso supporting the programme momentum is a newly agreed programme of upgrades – the P4E package was approved by the partner nations via the NATO Eurofighter and Tornado Management Agency.\nP4E also will deliver an improved cockpit interface, defensive aids sub-system upgrades, and additional electronic warfare capability for German aircraft.\nIt also paves the way for a future Long-Term Evolution activity which will add new capabilities to the type, potentially including some technologies pulled forward from the Italian-Japanese-UK Global Combat Air Programme (GCAP) and the Future Combat Air System activity between France, Germany and Spain."}, {"id": "b31a139e-1e74-4cf1-b0a0-1cdf95217843", "title": "D - Day anniversary haunted by dwindling number of veterans and shadowed by Europe new war", "date": "2024-06-07 00:30", "url": "https://www.gjsentinel.com/news/world/d-day-anniversary-haunted-by-dwindling-number-of-veterans-and-shadowed-by-europes-new-war/article_ab3c3be1-e678-509f-bccc-18e5a1435737.html", "message": "FILE - U.S. soldiers stand on the remains of a house as they inspect damage in Carentan, in the Normandy region of France, June 15, 1944.\nThe 80th anniversary this week of D-Day is a mixed bag of emotions for French survivors of the Battle of Normandy.\nThey remain eternally grateful for their liberation from Nazi occupation in World War II but cannot forget its steep cost in French lives."}, {"id": "993082fc-6e96-4863-8874-9d5f9c991774", "title": "Nebraska dedicates memorial to honor Vietnam veterans", "date": "2024-06-07 01:30", "url": "https://omaha.com/news/local/its-a-healing-nebraska-dedicates-memorial-to-honor-vietnam-veterans-living-and-dead/article_8ddb412a-2452-11ef-a849-ef5e1c2335b0.html", "message": "The chop-chop-chop of an incoming Huey helicopter offered a ray of hope to American soldiers hurt and alone in the jungles of Vietnam.\nNow that iconic sound, coming from a speaker atop a hill in Papillion, will play a role in helping heal the emotional wounds of Nebraska’s Vietnam War veterans and families of the fallen.\nNearly 50 years after the war, Nebraska has finally built its own Nebraska Vietnam Veterans Memorial.\n“But their country asked them, and they did it.”Nebraska is the last state to erect a Vietnam memorial, but the memorial plaza erected on a hill west of Walnut Creek Lake is one of the largest in the country.\nJack McManus, president of Vietnam Veterans of America, said memorials help heal the nation, and their importance cannot be overstated."}, {"id": "46b41c79-b195-4a9d-9843-6aca61906a58", "title": "Nebraska dedicates memorial to honor Vietnam veterans", "date": "2024-06-07 02:30", "url": "https://journalstar.com/news/state-regional/its-a-healing-nebraska-dedicates-memorial-to-honor-vietnam-veterans-living-and-dead/article_16f067b3-0901-5474-90b4-a5904f1c53fb.html", "message": "The chop-chop-chop of an incoming Huey helicopter offered a ray of hope to American soldiers hurt and alone in the jungles of Vietnam.\nNow that iconic sound, coming from a speaker atop a hill in Papillion, will play a role in helping heal the emotional wounds of Nebraska's Vietnam War veterans and families of the fallen.\nNearly 50 years after the war, Nebraska has finally built its own Nebraska Vietnam Veterans Memorial.\nNebraska is the last state to erect a Vietnam memorial, but the memorial plaza erected on a hill west of Walnut Creek Lake is one of the largest in the country.\nJack McManus, president of Vietnam Veterans of America, said memorials help heal the nation, and their importance cannot be overstated."}, {"id": "65eb6694-79ee-4bcd-8fb1-ea7c9c7f1bf3", "title": "New Orleans World War II Museum honors D - Day veterans | News", "date": "2024-06-07 01:00", "url": "https://www.theadvocate.com/baton_rouge/news/new-orleans-world-war-ii-museum-d-day-veterans-80th-anniversary/article_6248ebef-a8ff-5495-b4e3-25009491091a.html", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "c3873fe8-0819-4a50-a2b9-63a6fca165d1", "title": "Diminished Hamas switches to full insurgent mode in Gaza", "date": "2024-06-07 03:00", "url": "https://www.asiaone.com/world/diminished-hamas-switches-full-insurgent-mode-gaza", "message": "“In earlier months, Hamas fighters would intercept, engage and fire at Israeli troops as soon as they pushed into their territory,” Ibrahim told Reuters by phone.\nLerner, the IDF spokesman, agreed Israel faced a protracted battle to overcome Hamas, which has ruled the Gaza Strip since 2006.\nThe labyrinth, dubbed the Gaza metro by the Israeli military, is roughly half the length of the New York subway system.\nThe Israeli military said last week that it had taken control of the entire Gaza-Egypt land border to prevent weapons smuggling.\nGadi Eisenkot, a former Israeli military chief serving in Netanyahu’s war Cabinet, has proposed an Egyptian-led international coalition as an alternative to Hamas rule in Gaza."}, {"id": "73879ea9-957a-47cf-affe-4a3dfe7858a8", "title": "Ukraine update : Biden delivers pointed rebuke to Putin and Trump ; Nato to expand cooperation with Kyiv", "date": "2024-06-07 02:30", "url": "https://www.dailymaverick.co.za/article/2024-06-07-biden-delivers-pointed-rebuke-to-putin-and-trump-nato-to-expand-cooperation-with-kyiv/", "message": "Biden, who has warned of Russian President Putin’s grand designs for the continent, was expected to meet with Ukrainian President Volodymyr Zelensky while in France.\nHe warned that if the allies failed there, “Ukraine will be subjugated and it will not end there.\nOne goal of the programme is to help make Ukraine a large-scale tech provider once the war ends.\nNato also wants to replicate some of the rapid tech adoption and deployment seen in Ukraine since the war started, Van Weel said.\nAt the conference, Nato and US officials frequently pointed to the rapid tech development in Ukraine since the start of the war with envy."}, {"id": "e76a589d-7a0b-4541-9668-ca1752b70f67", "title": "10 Forgotten Allies in World War II", "date": "2024-06-07 09:00", "url": "https://listverse.com/2024/06/07/10-forgotten-allies-in-world-war-ii/", "message": "[1]9 ColombiaColombia during World War IIWatch this video on YouTubeUnlike other Latin American countries, Colombia did not declare war on the Axis after Pearl Harbor but did break off diplomatic relations.\nIt also declared war on Germany and Italy on the 11th.\nMany were descendants of British immigrants, and the three British military services saw 4,000 Argentine volunteers, including hundreds of women, enlist.\nOn June 1, after Germany refused to apologize or pay compensation, President Avila Camacho formally declared war on the Axis.\nAfter a fierce debate in Parliament, Hertzog was voted out of office and replaced by pro-British Jan Smuts, who declared war on Germany on September 6, 1939."}, {"id": "7c0e189e-f65e-4f14-a982-cf06f022ab6a", "title": "The officer who stormed Normandy with nothing but a cane and pistol", "date": "2024-06-07 09:00", "url": "https://www.militarytimes.com/news/your-military/2024/06/06/the-officer-who-stormed-normandy-with-nothing-but-a-cane-and-pistol/", "message": "A veteran of the First World War, Roosevelt was among the first American doughboys to land in France in 1918, seeing action during the Battle of Cantigny.\nWell-liked and respected by his men, Roosevelt had to campaign hard, however, to deploy during the invasion of Normandy.\nAmid withering fire from German coastal installations, machine-gun nests, and densely packed minefields lining Utah Beach, Roosevelt remained a calm figure guiding successive waves of scrambling soldiers to the beachhead.\nU.S. soldiers of the 4th Infantry Division move out over the seawall on Utah Beach.\nClaire Barrett is the Strategic Operations Editor for Sightline Media and a World War II researcher with an unparalleled affinity for Sir Winston Churchill and Michigan football."}, {"id": "f24aa5c8-0f5f-478f-8ef7-7dbfc7fe7147", "title": "  North Korea will react angrily : how a US bomber drill could backfire", "date": "2024-06-07 00:45", "url": "https://www.scmp.com/week-asia/politics/article/3265674/north-korea-will-react-angrily-how-us-bomber-drill-could-backfire", "message": "A B-1B bomber of the US Air Force (left) flies in formation with South Korean F-15K fighter jets (right) over the Korean peninsula on Wednesday.\nNorth Korea has previously called the bomber’s deployment on the Korean peninsula proof of US hostility.\nIt has responded to past flights of B-1Bs and other powerful US aircraft in South Korea by carrying out missile tests.\nA view of Kaesong, North Korea, from an observatory in the demilitarised zone in South Korea.\nOnly by growing stronger can we change North Korea,” he said in a Memorial Day speech at Seoul National Cemetery commemorating the country’s war dead."}, {"id": "ae84c804-4d9a-49c7-8eb0-e6290f92d7a0", "title": "Will North Korea fly trash balloons into South Korea again ? At look at rising tensions between them", "date": "2024-06-07 09:30", "url": "https://www.yahoo.com/news/north-korea-fly-trash-balloons-083738503.html", "message": "Will North Korea fly trash balloons into South Korea again?\nAt look at rising tensions between themFILE - South Korean soldier wearing protective gears checks the trash from a balloon presumably sent by North Korea, in Incheon, South Korea, on June 2, 2024.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire."}, {"id": "8d28a6c9-6808-4d78-aed1-3c93cb48e1c1", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-06-07 03:30", "url": "https://www.tvguide.co.uk/schedule/d92d98a5-2225-5f36-a740-c8779dc05290/combat-dealers", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Friday 7 June Share Add toCalendar +French Resistance Season 4 Episode 1 of 10 S SubtitlesEccentric military equipment collector Bruce Crompton is tasked with creating a display based on the French Resistance - a parachute basket filled with items the RAF would have dropped to the Resistance during the Second World WarCombat Dealers airs on Discovery Channel HD at 9:00 AM, Friday 7 June .\n(Subtitles.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual page"}, {"id": "6d166113-121c-46fb-9737-ee14359feb65", "title": "Will North Korea fly trash balloons into South Korea again ? At look at rising tensions between them", "date": "2024-06-07 09:15", "url": "https://www.startribune.com/will-north-korea-fly-trash-balloons-into-south-korea-again-at-look-at-rising-tensions-between-them/600371736/", "message": "SEOUL, South Korea — South Koreans were alert Friday for possible new launches by North Korea of balloons carrying rubbish into the South, a day after Seoul activists flew their own balloons to scatter political leaflets in the North.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations ''absurd, irrational'' and vowed ''unbearable'' retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nBut the North Korean balloons sent into South Korea in recent days carried only garbage, not political leaflets.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire."}, {"id": "ba1ffda7-b518-4ab2-bcec-712060cebf0f", "title": "Will North Korea fly trash balloons into South Korea again ? At look at rising tensions between them", "date": "2024-06-07 09:15", "url": "https://www.news4jax.com/news/world/2024/06/07/will-north-korea-fly-trash-balloons-into-south-korea-again-at-look-at-rising-tensions-between-them/", "message": "North Korea would probably retaliate with its own measures, further escalating tensions between the rivals.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nBut the North Korean balloons sent into South Korea in recent days carried only garbage, not political leaflets.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire."}, {"id": "390c800a-f8b7-4e19-bd07-849b96055016", "title": "102 - year - old Central Texas World War II veteran reflects on his service during D - Day 80 - year anniversary", "date": "2024-06-07 01:00", "url": "https://www.kwtx.com/2024/06/06/102-year-old-central-texas-world-war-ii-veteran-reflects-his-service-during-d-day-80-year-anniversary/", "message": "WACO, Texas (KWTX) - Thursday marked eighty years since the allied invasion of Normandy in World War II, otherwise known as D-Day.\nAuthor, veteran, and survivor Ralph Graham was awaiting a flight overseas with fellow soldiers on the day that has now gone down in history as the beginning of the end of the war.\nJust a few weeks ago, Graham was featured in Washington, D.C. as a Grand Marshall in the National Memorial Day Parade.\n“We had a lot of fun, really.”Graham said he’s proud to still be able to represent and celebrate those who fought in World War II, just like him.\nHe recalls more war stories and his participation in the Battle of the Bulge, the third deadliest battle in American history, in his 2020 book 12 Minutes."}, {"id": "1f8a20fe-c37b-4cf6-8f78-d7bf89bb3df6", "title": "Russians apply most severe pressure on Pokrovsk front : 28 attacks over past day – Ukraine General Staff", "date": "2024-06-07 08:15", "url": "https://www.yahoo.com/news/russians-apply-most-severe-pressure-233251322.html", "message": "A total of 73 combat clashes took place on the battlefield in Ukraine over the past 24 hours, and 28 of them occurred on the Pokrovsk front.\nOn the Kupiansk front, the Russians attempted to approach Ukrainian positions near Druzheliubivka and Petropavlivka.\n22 of those attacks were repelled, and six combat clashes are ongoing.\nOn the Kurakhove front, the Russians attacked Ukrainian positions in the areas of Paraskoviivka and Krasnohorivka five times.\nOn other fronts, there were no significant changes in the combat situation."}, {"id": "acd48049-ac5d-4f90-858e-ef33dcab4e72", "title": "World War II : Honoring and remembering Michigan veterans who fought , died during D - Day", "date": "2024-06-07 03:15", "url": "https://www.wilx.com/2024/06/06/world-war-ii-honoring-remembering-michigan-veterans-who-fought-died-during-d-day/", "message": "LANSING, Mich. (WILX) - Engaged in a fierce battle with German troops on June 6, 1944, 3,000 American soldiers and sailors died in the first 24 hours of the D-Day invasion.\nThe average age of those who died, just 27, but some as young as 16.\nIn Mid-Michigan, 94 Michigan veterans who lost their lives on D-Day will be honored in a wreath-laying ceremony.\nThe event organizer, Michele Fickes, hosted the wreath-laying ceremony to honor Michigan soldiers who died in France at the Evergreen Cemetery in Lansing.\n“It makes you into a person that is sacrificial, service-oriented, and that’s why veterans are so amazing."}, {"id": "86f087f8-1a44-458b-91f9-fd862ea28945", "title": "Will North Korea fly trash balloons into South Korea again ? At look at rising tensions between them – Winnipeg Free Press", "date": "2024-06-07 09:00", "url": "https://www.winnipegfreepress.com/world/2024/06/07/will-north-korea-fly-trash-balloons-into-south-korea-again-at-look-at-rising-tensions-between-them", "message": "SEOUL, South Korea (AP) — South Koreans were alert Friday for possible new launches by North Korea of balloons carrying rubbish into the South, a day after Seoul activists flew their own balloons to scatter political leaflets in the North.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North’s action was also likely designed to trigger a divide in South Korea over its conservative government’s tough policy on North Korea.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire."}, {"id": "b51d6ae7-da33-4612-8cc8-81f7a13e829b", "title": "UK Court Decides Aircraft Disputes to Be Heard in Ukraine , not London", "date": "2024-06-07 07:15", "url": "https://www.insurancejournal.com/news/international/2024/06/07/778500.htm", "message": "A legal battle between insurers and aircraft leasing companies over jets stuck in Ukraine should be heard in Ukraine rather than London, the High Court in London ruled on Thursday.\nAircraft lessors, including Ireland’s AerCap, are pursuing insurers after Russia’s 2022 invasion of Ukraine left aircraft stranded in Ukraine.\nJudge Andrew Henshaw, in a decision relating to six separate lawsuits, ruled that the cases in London should be put on hold because of “exclusive jurisdiction clauses” requiring disputes to be heard in Ukraine.\nThe claimants had argued that the cases should be heard in London, in part because the ongoing war in Ukraine makes it very difficult to fairly conduct litigation there.\n(Reporting by Sam Tobin, editing by William James)Related:Topics Aviation London Ukraine"}, {"id": "6552f1f4-3616-467b-8ce8-ffb47e239880", "title": "Armor : American M1 Tank Seeks Purpose", "date": "2024-06-07 08:15", "url": "http://www.strategypage.com/%5Chtmw%5Chtarm%5Carticles%5C202406060758.aspx", "message": "The war in Ukraine has made it easier for the U.S. Army to get all the money wanted for upgrades to the American M1 tank force.\nThe army had already developed and scrutinized a new SEP (System Enhancement Package) update called SEP4 (or SEPV4) for its M1 tanks.\nThe M1 is an old design with the first of 3,273 M1 tanks produced in 1978.\nSo far over 10,000 American M1 tanks have been produced and most of them subsequently updated at least once, mainly in the 1990s.\nThe army is planning to maintain and upgrade its M1 tank fleet of 7,000 vehicles into the 2030s."}, {"id": "0c542dc2-a8e9-4ea8-bc13-d9000483ca40", "title": "The World Marks 80th Anniversary Of D - Day Landings | Positive Encouraging K - LOVE", "date": "2024-06-07 04:15", "url": "https://www.klove.com/news/us-and-world/the-world-marks-80th-anniversary-of-d-day-landings-50567", "message": "UTAH BEACH, France (AP) — Twelve U.S. and British World War II veterans were given Legion of Honor awards by French President Emmanuel Macron on Thursday, the 80th anniversary of D-Day.\n“You came here because the free world needed each and every one of you, and you answered the call,?\n“There are things worth fighting for,” said World War II veteran Walter Stitt, who fought in tanks and turns 100 in July, as he visited Omaha Beach this week.\nConscious of the inevitability that major D-Day anniversaries will soon take place without World War II veterans, huge throngs of aficionados in uniforms and riding vehicles of the time, and tourists soaking up the spectacle, flooded Normandy for the 80th anniversary.\nAnd we ended up helping save the world,” said 98-year-old Anna Mae Krier, who worked as a riveter building B-17 and B-29 bombers."}, {"id": "58dd9d88-074c-45ef-87ab-7d667d5c70c8", "title": "US Army Spending Big On Woke Hybrid - Electric Abrams", "date": "2024-06-07 07:15", "url": "https://menafn.com/1108306655/US-Army-Spending-Big-On-Woke-Hybrid-Electric-Abrams", "message": "(MENAFN- Asia Times) The is funding two competitors to build a new, lighter, Abrams tank, dubbedAbrams X.\nThe new tank will feature a hybrid electric drive and will permit a reduced crew size.\nFor the past twenty to twenty-five years the Army has been working on a hybrid electric tank to replace both current Abrams alternatives :the gas turbine engine and the diesel engine alternatives.\nThe argument for hybrid electric is that it would allow tank operations to sometimes be“silent” (running solely on battery power).\nFrom an operational and logistical point of view it would seem that a hybrid electric tank has a significant advantage."}, {"id": "1707c607-cb05-4831-afc0-279cc9a5d16a", "title": "Irish D - Day Catholics  owed great deal of gratitude  ", "date": "2024-06-07 00:15", "url": "https://www.bbc.com/news/articles/cg33j4rm9jlo", "message": "Dr Laura Patrick, a heritage officer for the Royal Irish Regiment, said it was difficult to tell the background of those who took part.\nDublin-based historian Diarmaid Ferriter said nationalist soldiers from across the island may have joined for the spirit of adventure, or for economic reasons.\n\"We know that a private in the Irish Army at the start of the Second World War was being paid 14 shillings a week,\" he explained.\n\"If you went into the British Army you were being paid over nine shillings a day.\nA decade ago, some 6,000 soldiers who deserted the Irish Army to fight for the British during World War Two were granted pardons."}, {"id": "4d62d8a3-786c-4fad-a5b0-71128a54e9ce", "title": "Russia losses 1 , 080 soldiers in one day", "date": "2024-06-07 08:15", "url": "https://www.yahoo.com/news/russia-losses-1-080-soldiers-050419431.html", "message": "Ukrainian soldiers.\nPhoto: General Staff of the Armed Forces of UkraineRussia's losses in its war against Ukraine continue to mount as they have lost 1,080 soldiers and 64 artillery systems over the past day alone.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 7 June 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\nThe information is being confirmed.\nSupport UP or become our patron!"}, {"id": "6dd98783-583a-4d8e-b2a5-e2b25f9cfcd4", "title": "Why Did North Korea Dump Trash Balloons On South Korea ? Does This Mean Escalation ? ", "date": "2024-06-07 09:00", "url": "https://www.news18.com/explainers/why-did-north-korea-dump-trash-balloons-on-south-korea-does-this-mean-escalation-8924440.html", "message": "North Korea has indulged in a psychological warfare by dropping hundreds of trash-laden balloons across South Korea.\nSince last week, North Korea has sent thousands of trash balloons across the Demilitarised Zone separating the two Koreas.\nWhy North Korea Has Dropped Trash Balloons on South Korea?\nIn 1990s, North Korea’s propaganda was losing its relevance and South Korean economy was making strides.\nThe South became a vibrant democracy while North Korea faced food shortages and relied on information blackout to control its people."}, {"id": "c9709f31-43b3-470e-a4bd-3b96c496007a", "title": "D - Day anniversary", "date": "2024-06-07 02:15", "url": "https://www.smdailyjournal.com/news/national/d-day-anniversary/collection_e5551a48-2448-11ef-b7cc-ab26d03715d6.html", "message": "As young soldiers they waded ashore in Normandy through gunfire to fight the Nazis.\nA dwindling number of World War II veterans were joined by a new generation of leaders on Thursday to honor the dead, the living and the fight for democracy in moving commemorations on and around those same beaches where they landed exactly 80 years ago on D-Day.\nRussia's full-scale invasion is a grim modern-day example of lives and cities that are again suffering through war.\nFrench President Emmanuel Macron awarded the Legion of Honor to 14 U.S. veterans and a British female veteran.\nAmong the Americans was Edward Berthold who flew 35 combat missions in all as a pilot during World War II including one on D-Day."}, {"id": "711e04b4-0cb0-4e84-95e6-516319d7d73c", "title": "A walk to remember - The Hindu", "date": "2024-06-07 07:15", "url": "https://www.thehindu.com/society/a-walk-to-remember/article68245368.ece", "message": "Kohima War Cemetery, often revered, mostly forgotten, stands tucked away on the gentle rise of Garrison Hill — a place of both revulsion and courage.\nIt was here, separated only by the few yards’ span of a tennis court, that the British, Indians and Japanese fought in a World War II battle so savage and heroic that it was voted Britain’s greatest ever.\nBrown and his men first left for Kohima in early February 1944, establishing defences at the villages of Jessami and Kharasom.\nThose who fought in the Far East theatre did not receive the attention that those who fought in European campaigns received.\n“Battlefield tourism is now popular among the young in Britain, especially those wanting to know where their grandfathers fought,” says Lyman."}, {"id": "b5c0110d-2126-4826-9200-6b4ccdaa5cb8", "title": "When a U . K . woman replicated the 39 - hour journey of her grandfather who fought in the Battle of Kohima during World War II", "date": "2024-06-07 08:45", "url": "https://www.thehindu.com/society/battle-of-kohima-world-war-2-charlotte-carty-39-hours-jessami-walk-assam-regiment-lt-col-wf-bruno-brown/article68245368.ece", "message": "Kohima War Cemetery, often revered, mostly forgotten, stands tucked away on the gentle rise of Garrison Hill — a place of both revulsion and courage.\nIt was here, separated only by the few yards’ span of a tennis court, that the British, Indians and Japanese fought in a World War II battle so savage and heroic that it was voted Britain’s greatest ever.\nBrown and his men first left for Kohima in early February 1944, establishing defences at the villages of Jessami and Kharasom.\nThose who fought in the Far East theatre did not receive the attention that those who fought in European campaigns received.\n“Battlefield tourism is now popular among the young in Britain, especially those wanting to know where their grandfathers fought,” says Lyman."}, {"id": "93eac4a1-756f-41da-be67-9503b3094ae6", "title": "George Clooney fretted to White House that wife Amal could face sanctions over ICC case against Israel : report", "date": "2024-06-07 04:15", "url": "https://nypost.com/2024/06/06/us-news/george-clooney-fretted-to-white-house-that-wife-amal-could-face-sanctions-over-icc-case-against-israel-report/", "message": "Hollywood superstar George Clooney rang up the White House last month to grumble about President Biden’s criticism of the International Criminal Court’s effort to issue arrest warrants against top Israeli officials, according to a report.\n“The ICC prosecutor’s application for arrest warrants against Israeli leaders is outrageous,” the president said in a May 20 statement.\nAFP via Getty ImagesICC prosecutor Karim Khan announced last month that his office would pursue arrest warrants for Netanyahu, 74, and Gallant, 65, as well as the Hamas leaders.\nThe White House and the Clooney Foundation for Justice did not respond to The Post’s request for comment.\nIn 2020, Clooney donated more than $500,000 in support of Biden’s White House bid."}, {"id": "8e26c927-5364-4225-bc1a-7661f39e2d01", "title": "On 80th anniversary of D - Day , a Colorado WWII veteran reflects", "date": "2024-06-07 00:30", "url": "https://www.fortmorgantimes.com/2024/06/06/colorado-world-war-ii-veteran-john-indergand/", "message": "On 80th anniversary of D-Day, a Colorado WWII veteran reflects: “They knew they had to win at all costs” John Indergand enlisted in the U.S. Army at 19 and landed in Normandy weeks after historic invasion"}, {"id": "3770fdde-6344-4a36-8f13-ccec436d37f2", "title": "Will North Korea fly trash balloons into South Korea again ? At look at rising tensions between them | iNFOnews", "date": "2024-06-07 09:00", "url": "https://infotel.ca/newsitem/as-koreas-tensions-the-trash-dump/cp2064152840", "message": "Will North Korea fly trash balloons into South Korea again?\nAt look at rising tensions between themSEOUL, South Korea (AP) — South Koreans were alert Friday for possible new launches by North Korea of balloons carrying rubbish into the South, a day after Seoul activists flew their own balloons to scatter political leaflets in the North.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire."}, {"id": "013d67e6-7947-4e69-9a2f-92a7cbd01c37", "title": "Russia uses thermobaric missiles in Chasiv Yar , Donetsk Oblast", "date": "2024-06-07 00:45", "url": "https://www.yahoo.com/news/russia-uses-thermobaric-missiles-chasiv-000000633.html", "message": "Russian troops are using multiple launch rocket systems (MLRS) with thermobaric missiles to strike Chasiv Yar in Donetsk Oblast, said Nazar Voloshyn, spokesman for the Khortytsia Operational and Strategic Troop Grouping, on national TV on July 6.\n\"The enemy is using multiple launch rocket systems with thermobaric ammunition in Chasiv Yar,\" a spokesman said.\nRead also: Elite HUR combat unit Kraken shows footage of ongoing Chasiv Yar battle\"They destroy everything left after strikes by their aviation,\" the spokesman said.\nVoloshyn added that the enemy constantly attacks the Chasiv Yar sector and keeps trying to advance there.\nRead also: Chasiv Yar in ruins: AP captures aftermath of intense Russian bombardmentThe spokesman added that the Armed Forces control Chasiv Yar, use all types of weapons against the Russians, and do not allow Russian troops to enter the city."}, {"id": "45db8a0f-4fff-419d-8e4a-af87b7749099", "title": "D - Day 80th anniversary : New memorial unveiled to honor veteran who made major strides during WWII", "date": "2024-06-07 03:00", "url": "https://www.fox29.com/news/d-day-80th-anniversary-new-memorial-unveiled-honor-veteran-who-made-major-strides-during-wwii", "message": "Veterans, their families and the community at large came together in Atlantic City for the long anticipated unveiling of the Bernie Friedenberg World WarII memorial on the 80th anniversary of D-Day.\nsaid Susan Friedenberg, daughter of Bernie Friedenberg.\nsaid Susan Friedenberg.\nThe veteran died in 2018 and now this memorial bears his name for the world to see.\nThey were right beside the men,\" Brill explained."}, {"id": "d213ed4c-10c3-4e4b-8941-7b13c886d1a3", "title": "Book reviews : Queen Macbeth by Val McDermid , The Coast Road , Antiquity , The Changing Room , Because Im Not Myself , You See , New Cold Wars , Liberalism as a Way of Life , My Father Suitcase", "date": "2024-06-07 07:15", "url": "https://www.watoday.com.au/culture/books/this-new-novel-imagines-the-secret-history-of-lady-macbeth-20240531-p5jid2.html", "message": "It’s as if all the writers manqué from Generation X got the chance to flex their creative muscles during pandemic lockdowns.\nWhen she had a baby and postpartum psychosis hit her like an on-coming train, she wasn’t any more.\nThe fall of the USSR was not so much the end of the Cold War as the beginning of a new one: a three-way stand-off between Russia, China and the US.\nBut, he warily emphasises, for all its crises, the Cold War never escalated into a “hot” war.\nWith the decline of Christianity, the values that inform our pursuit of the “good life” are increasingly drawn from liberalism."}, {"id": "0ce80bdf-8fb3-41e3-8385-77fb315bc617", "title": "D - Day invasion 80th anniversary marked under shadow of Russia war on Ukraine", "date": "2024-06-07 07:15", "url": "https://www.watoday.com.au/world/europe/never-forget-d-day-invasion-remembered-under-shadow-of-new-war-in-europe-20240607-p5jjyz.html", "message": "Of the 4414 Allied troops killed on D-Day, 13 were Australians.\nIn the ensuing Battle of Normandy, 73,000 Allied forces were killed and 153,000 wounded.\nOthers refer to it as the “most significant victory of the Western Allies in the Second World War”.\n“We’re living in a time when democracy is more at risk across the world than at any point since the end of World War II,” Biden said.\nIn recent months Macron has not ruled out the possibility of sending French troops to Ukraine − a suggestion that has sparked controversy among his allies and angered Russia."}, {"id": "de2335a2-d23b-4e60-a105-dd55058513d4", "title": "Top NATO General Says Alliance Ready to Fight But Needs More Arms", "date": "2024-06-07 09:15", "url": "https://www.kyivpost.com/post/33903", "message": "NATO member nations are ready to defend themselves but need to build up production of military equipment, the alliance's top general Christopher Cavoli told AFP on Thursday.\nNATO \"is ready to do collective territorial defence\", Cavoli said in Normandy.\nHe pointed to a vast exercise dubbed Steadfast Defender 24, which involved 90,000 NATO troops across multiple European countries from January to May.\nAdvertisementBut \"when it comes to military equipment... we need to build more, we need to expand our industrial base,\" he added.\nNATO troops would also be learning from \"techniques and tactics\" used on Ukrainian battlefields at a new \"lessons learned\" centre to be set up in Poland, Cavoli added."}, {"id": "18872ad9-9df2-4d89-821c-87c6564d9e20", "title": "My father was one of the ordinary young men who did extraordinary things", "date": "2024-06-07 07:00", "url": "https://www.bangordailynews.com/2024/06/07/opinion/opinion-contributor/father-truman-young-ordinary-young-men-did-extraordinary-things/", "message": "Truman Young during a leave from Army training during World War II.\nNot, on D-Day, he always clarified, but later in June 1944, when the 83rd Infantry Division joined the Normandy invasion.\nIt was horrifying, but somehow, the Allied troops prevailed and, slowly, brutal mile by deadly mile, the tide of World War II was turned.\nMy father, like many World War II veterans, spoke little about his experiences in Europe.\nYes, these young men were heroes."}, {"id": "690ee34c-d6e2-4944-a4d6-4117873c6ffd", "title": "Joseph Simes Obituary - Santa Ana , CA ( 1925 - 2017 ) ", "date": "2024-06-07 03:00", "url": "https://www.ocregister.com/obituaries/joseph-fred-simes-santa-ana-ca/", "message": "Simes, Joseph Fred, passed away on February 21, 2017 at the age of 91, surrounded by his loved ones.\nHe was born on April 18, 1925 in Cheyenne, Wyoming, but lived nearly all his life in southern California.\nA World War II Navy vet, he survived multiple battles and island invasions, including the Battle of Okinawa, when his ship, the destroyer USS Colhoun, was sunk by Japanese kamikaze fighters.\nAfter the war, he had a nearly forty-year career in household appliance repair and sales, including running his own business, Allied Appliance, for nearly thirty years.\nHe is survived by his wife, Dora of sixty-two years; his sons, Michael, Kevin, Colin and Alan; six grandchildren and one great-grandchild."}, {"id": "16d44347-e31b-4dca-9d25-e568a487120f", "title": "American Legion Post 27 in Londonderry June events", "date": "2024-06-07 04:45", "url": "https://www.unionleader.com/news/military/american-legion-post-27-in-londonderry-june-events/article_7e725234-21d5-11ef-b6ab-6b0b261a49b6.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "7b80ba46-f8cf-4350-b395-50beee64ebf1", "title": "Trump Marks 80th Anniversary Of D - Day", "date": "2024-06-07 02:30", "url": "https://www.oann.com/newsroom/trump-marks-80th-anniversary-of-d-day/", "message": "U.S. President Donald Trump tips the cap of a U.S. veteran of the Battle of Normandy as other veterans look on during the main ceremony to mark the 75th anniversary of the World War II Allied D-Day invasion of Normandy at Normandy American Cemetery on June 06, 2019 near Colleville-Sur-Mer, France.\nAdvertisementOn Thursday, Trump marked D-Day in a Truth Social Post.\nTruth Social: realDonaldTrumpHe recalled how many shed their blood and thousands gave their lives in defense of American freedom.\nThe 45th president delivered remarks at the Normandy American Cemetery and Memorial in Colleville-sur-Mer on this day five years ago.\nAround 73,000 American troops participated in D-Day, including more than 2,500 who made the ultimate sacrifice."}, {"id": "46b65a40-4d60-4238-ac05-503a2fe964d3", "title": "Waverly Woodson Jr . Posthumously Awarded For D - Day Efforts", "date": "2024-06-07 01:00", "url": "https://blackamericaweb.com/2024/06/06/nearly-30-years-after-his-death-cpl-waverly-woodson-jr-a-black-medic-and-d-day-hero-is-finally-honored/", "message": "D-Day, Jr., a Black army medic who saved nearly 200 lives during D-Day in 1944, is being posthumously honored for his heroic efforts.\nThe Democrat and relatives of the Black medic had to fight for his important work to be recognized.\nLook for local chapters of organizations like the Black Veterans Project, the National Association for Black Veterans, Inc. (NABVETS) or Disabled American Veterans (DAV) that provide resources and assistance to veterans in need.\nWaverly Woodson, Jr., A Black Medic And D-Day Hero, Is Finally Honored appeared first on NewsOne.\nWaverly Woodson, Jr., A Black Medic And D-Day Hero, Is Finally Honored was originally published on newsone.com"}, {"id": "be67f594-5a73-433d-b231-675f0af1c4df", "title": "Macron says France will provide Ukraine with Mirage combat aircraft", "date": "2024-06-07 00:15", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/06/06/macron-says-france-will-provide-ukraine-with-mirage-combat-aircraft/", "message": "French President Emmanuel Macron has said France will provide Ukraine with its Mirage combat aircraft to be able to defend their country against Russian aggression.\nMr Macron spoke after Ukrainian President Volodymyr Zelensky joined world leaders in France to commemorate the D-Day invasion.\nMr Macron did not specify when the French combat aircraft would arrive.\nUkrainian President Volodymyr Zelensky and his wife Olena Zelenska arrive at the international ceremony at Omaha Beach in Normandy (Virginia Mayo/AP)He will meet French officials in Paris on Friday.\nUkraine has framed the conflict as a clash between Western democratic freedom and Russian tyranny."}, {"id": "30353d43-23d2-45b5-8292-dffc5417128c", "title": "Local WWII veterans honored at New Orleans museum on D - Day", "date": "2024-06-07 03:15", "url": "https://13wham.com/news/local/local-wwii-veterans-honored-at-new-orleans-museum-on-d-day", "message": "NEW ORLEANS (WHAM) — Two local World War II veterans attended a special ceremony in New Orleans commemorating the 80th anniversary of D-Day.\nWWII veterans Tom Connors, 97, and George Steitz, 99, have been friends for 40 years.\nThursday, they attended a ceremony at the World War II Museum in New Orleans and were honored alongside other veterans.\n\"Certainly the people down here have not forgotten the veterans of World War II.\"\nThey were accompanied by their sons, Tom Connors III and Tom Steitz."}, {"id": "c4fdbccd-dd3e-4125-8585-713be1093515", "title": "History comes to life as Fort Jackson marks 80th anniversary of D - Day", "date": "2024-06-07 00:45", "url": "https://www.wistv.com/2024/06/07/history-comes-life-fort-jackson-marks-80th-anniversary-d-day/", "message": "COLUMBIA, S.C. (WIS) - Fort Jackson marked the 80th anniversary of D-Day by taking soldiers inside the pivotal World War II battle through artifacts, reenactors, weapons, equipment and iconic images.\nOn post at Fort Jackson Thursday, history came to life with one-of-a-kind commemoration.\nThe U.S. Army training center hoped to honor and remember the heroism of the dead and living who took part in that battle.\nPyle was known to many as “America’s eyewitness to World War II.”Weapons that the soldiers used on the battlefield were also on display for soldiers.\nThe 4th Infantry Division, which fought in the defining battle, was briefly stationed there before they were put on ships to train for D-Day."}, {"id": "8e27222c-3f93-4999-b00f-71e2a9906c80", "title": "N . C . AG nominee says Trump is being treated like a Black person in the  50s", "date": "2024-06-07 01:30", "url": "https://www.yahoo.com/news/n-c-ag-nominee-says-004838959.html", "message": "N.C. AG nominee says Trump is being treated like a Black person in the '50sRepublicans are resorting to ahistorical nonsense in their attempts to shield former President Donald Trump from accountability.\nIn that time, of course, many Black people were essentially prohibited from jury service and others faced lynchings.\nThis is the guy Republicans want to be the top law enforcement official in North Carolina.\nBishop is a reminder that gubernatorial candidate Mark Robinson isn’t the only far-right extremist nominated for statewide office in North Carolina.\nAlong with Bishop and Robinson, there’s also Michele Morrow, the GOP nominee for superintendent of public schools."}]