[{"id": "73d83c43-33c3-46d3-b3c4-f86f2ee2a1ae", "title": "The looming choice for Diaspora Jews", "date": "2024-06-14 08:15", "url": "https://www.jwire.com.au/the-looming-choice-for-diaspora-jews/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Browse > Home Featured Articles / The looming choice for Diaspora Jews – J-WireThe looming choice for Diaspora JewsRead on for articleIs it time for the Jews of Britain, Europe and America to leave?\nOf course, it’s time for Diaspora Jews to leave, they say.\nDiaspora Jews tend to hold their noses at anything on “the right” because they associate “the right” with antisemitism.\nBut most Diaspora Jews refused to see it.\nOf course, Diaspora Jews can reasonably point out that, at present, Israel is hardly a safe haven."}, {"id": "7bef50e4-c520-45aa-8664-5349d556cb63", "title": "Pullman City Council to further discuss proposed Israel - Hamas war ceasefire resolution", "date": "2024-06-14 08:45", "url": "https://dailyevergreen.com/178728/news/pullman-city-council-to-further-discuss-proposed-ceasefire-resolution/", "domain": "dailyevergreen.com", "domain_classification": "Unknown", "message": "Eight Pullman residents, including several WSU students, spoke during the public comment section of Tuesday’s City Council meeting to address a proposed resolution calling for a ceasefire of the Israel-Hamas war.\n“I live here in this community, and when I read the resolution that seemed submitted, it left me out,” Jessica said.\nHowever, Councilwoman Carla de Lira said Pullman would join over 100 other local municipalities that have passed a ceasefire resolution.\nThe council will revisit the resolution and hold further public comment during their next meeting 7 p.m. June 25 at Pullman City Hall, located at 190 SE Crestview St Building A.\nIf passed, Pullman would join other Washington cities such as Seattle and Olympia in adopting a ceasefire resolution within city government."}]