[{"id": "01030e8d-7670-4344-bfbe-b78ad3d9f45f", "title": "Category 2 Hurricane Ernesto updates from the National Hurricane Center for Friday , Aug 16", "date": "2024-08-16 15:30", "url": "https://www.yahoo.com/news/category-2-hurricane-ernesto-updates-150701904.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ETThe National Hurricane Center's 2 pm Friday advisory reported that Category 2 Hurricane Ernesto is 180 miles south-southwest of Bermuda, with maximum sustained wind of 100 mph.\nYESTERDAY (Thursday):Yesterday, Ernesto reached new heights of intensity and was upgraded from a Category 1 hurricane into a Category 2 hurricane, with winds blowing at 100 miles per hour.\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:A Hurricane Warning is in effect for:- BermudaA Hurricane Warning means that hurricane conditions are expected somewhere within the warning area.\nHAZARDS AFFECTING LAND:WIND: Hurricane conditions are expected on Bermuda Saturday, with tropical storm conditions likely beginning later this afternoon.\nSource: National Hurricane CenterThis article was generated by the South Carolina Bot, artificial intelligence software that analyzes information from the National Hurricane Center and applies it to templates created by journalists in the newsroom."}, {"id": "7e79d45a-4739-410f-a650-b04d75f601cf", "title": "Category 2 Hurricane Ernesto updates from the National Hurricane Center for Friday , Aug 16", "date": "2024-08-16 16:15", "url": "https://www.yahoo.com/news/category-2-hurricane-ernesto-updates-150701195.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ETThe National Hurricane Center's 2 pm Friday advisory reported that Category 2 Hurricane Ernesto is 180 miles south-southwest of Bermuda, with maximum sustained wind of 100 mph.\nYESTERDAY (Thursday):Yesterday, Ernesto reached new heights of intensity and was upgraded from a Category 1 hurricane into a Category 2 hurricane, with winds blowing at 100 miles per hour.\nSUMMARY OF WATCHES AND WARNINGS IN EFFECT:A Hurricane Warning is in effect for:- BermudaA Hurricane Warning means that hurricane conditions are expected somewhere within the warning area.\nHAZARDS AFFECTING LAND:WIND: Hurricane conditions are expected on Bermuda Saturday, with tropical storm conditions likely beginning later this afternoon.\nSource: National Hurricane CenterThis article was generated by the South Carolina Bot, artificial intelligence software that analyzes information from the National Hurricane Center and applies it to templates created by journalists in the newsroom."}, {"id": "a2a3a436-71e6-485e-aca2-0b2f04e9102e", "title": "Bermuda braces for direct hit from Hurricane Ernesto", "date": "2024-08-16 14:45", "url": "https://www.yahoo.com/news/bermuda-braces-direct-hit-hurricane-141237080.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "This satellite image obtained from the US National Oceanic and Atmospheric Administration shows Hurricane Ernesto bearing down on Bermuda, prompting hurricane warnings (Handout)Bermuda was on high alert Friday as residents brace for Hurricane Ernesto, with heavy rain and flooding expected to wallop the island at the weekend, meteorologists and officials said.\n\"Ernesto is forecast to be a large hurricane near Bermuda on Saturday and maintain hurricane strength through the weekend,\" the NHC said in its latest advisory.\nThe large storm, currently a Category 2 hurricane on the five-level Saffir-Simpson scale, is set to strengthen overnight.\nAs the territory's emergency officials met Thursday, Minister of National Security Michael Weeks urged residents to complete their hurricane preparation as soon as possible.\nSome key roads were closing Friday ahead of the storm, and bus and ferry services were being suspended, it added."}, {"id": "3fa206ea-6e33-440c-ba7c-e5c008eca8d3", "title": "Beryl is making its way to the Caribbean Sea after brewing in the Atlantic Ocean", "date": "2024-08-16 12:45", "url": "https://www.yahoo.com/news/beryl-making-way-caribbean-sea-122303435.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Beryl is making its way to the Caribbean Sea after brewing in the Atlantic OceanArticle first published: Monday, July 01, 2024, 5 a.m.\nBeryl, developed in the Atlantic Ocean, is now shifting toward the Caribbean Sea.\nCategory 5 Hurricane Beryl is 445 miles east-southeast of Isla Beata Dominican Republic and 775 miles east-southeast of Kingston Jamaica, with maximum sustained wind of 165 mph.\nA Tropical Storm Warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours.\nRAINFALL: Hurricane Beryl is expected to produce rainfall totals of 4 to 8 inches, with localized maxima of 12 inches, in portions of Jamaica on Wednesday."}, {"id": "276cd012-0123-4e89-9206-c11404aa4c07", "title": "Ernesto Approaches Bermuda , Could Become Category 2 Hurricane", "date": "2024-08-16 00:30", "url": "https://www.theepochtimes.com/world/ernesto-approaches-bermuda-could-become-category-2-hurricane-5706583", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Bermuda is expected to begin facing tropical storm conditions on Aug. 16 as Hurricane Ernesto nears the island, according to the National Hurricane Center (NHC).\nErnesto strengthened to a Category 2 hurricane, with increased sustained winds of 100 mph.\nThe Saffir-Simpson Hurricane Wind Scale gives a Category 2 hurricane sustained winds of 96 mph—110 mph.\nA Category 3 hurricane has winds of 111 mph—129 mph.\nThe NHC reported swells causing life-threatening surf and rip currents generated by Ernesto are affecting Turks and Caicos, and the Bahamas."}, {"id": "e86b9feb-823e-465d-8c08-c3f17c941c4a", "title": "Half of Puerto Rico without power as Hurricane Ernesto approaches Bermuda", "date": "2024-08-16 04:00", "url": "https://www.wcpo.com/weather/half-of-puerto-rico-without-power-as-hurricane-ernesto-gains-strength", "domain": "wcpo.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto notched 90mph maximum sustained winds on Thursday night as it moves toward Bermuda in the Atlantic Ocean.\nThe National Hurricane Center announced a hurricane warning for Bermuda.\nAdditional strengthening is forecast, which would put Ernesto close to Category 3 major hurricane status when it reaches the island.\n6 to 12 inches of rain could fall on Bermuda Saturday, with some places seeing as much as 15 inches.\nStorm wrecks Puerto Rico power gridsHalf of Puerto Rico was waking up on Thursday in the dark, where more than 325,000 customers were still without power as cleanup efforts got underway."}, {"id": "eedd73bd-b8b8-4b1b-9f2e-4d08f599fe64", "title": "Hurricane Ernesto nears Bermuda , flooding likely", "date": "2024-08-16 14:45", "url": "https://www.swissinfo.ch/eng/hurricane-ernesto-nears-bermuda,-flooding-likely/86981663", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Bermuda braces for Hurricane Ernesto, billed as the ‘real deal’reuters_tickers4 minutesBy Nicola Muirhead and Jasmine PattersonBERMUDA (Reuters) -Hurricane Ernesto churned towards Bermuda on Friday as a Category 2 storm packing powerful winds and likely to produce life-threatening flooding and storm surges in the British island territory.\nThe center of Ernesto is expected to pass near or over Bermuda on Saturday morning, making conditions ripe for storm surges and flash flooding by the afternoon.\nThis storm is the real deal,” said Michael Weeks, Bermuda’s national security minister, at a press conference on Friday.\nPuerto Rico’s power grid is notoriously fragile.\nErnesto is the fifth named Atlantic storm of what is expected to be an intense hurricane season."}, {"id": "73c41997-27b6-485e-aa98-0326ddb0cd23", "title": "Hurricane Ernesto : Hurricane Ernesto : Bermuda on alert as storm grows stronger , power outages and flooding continue in Puerto Rico", "date": "2024-08-16 03:30", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/hurricane-ernesto-bermuda-on-alert-as-storm-grows-stronger-power-outages-and-flooding-continue-in-puerto-rico/articleshow/112554802.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Impact on Puerto Rico:Forecast:Current position:Preparation alert:Historical context:LUMA energy report:Power grid fragility:US East Coast:Seasonal overview:Hurricane Ernesto , currently a Category 1 storm, is intensifying as it heads towards Bermuda , posing significant threats with powerful winds, dangerous storm surges, and heavy rainfall over the weekend.The storm has already caused substantial damage in Puerto Rico , where it left hundreds of thousands without power.\nAs Ernesto continues its path, the National Hurricane Center (NHC) warns that it could strengthen into a major hurricane by Friday, prompting urgent preparations in affected regions.Here's all you need to know:-Hundreds of thousands are without power due to heavy rainfall from Ernesto.\nSignificant flooding and damage reported.Ernesto expected to strengthen into a major hurricane (Category 3 or higher) by Friday, with further strengthening predicted by the NHC.As of 5 pm ET Thursday, Ernesto was 495 miles southwest of Bermuda, moving north at 85 mph.The NHC advises Bermuda residents to complete preparations for potential impacts, including significant rain, strong winds, and storm surge.Bermuda has experienced direct landfalls from only 11 storms since 1851. Notable past hurricanes include Gonzalo (2014) and Fabian (2003).About 410,000 homes and businesses in Puerto Rico remain without electricity.\nLUMA expects power restoration soon.Puerto Rico’s power grid is historically fragile, with previous hurricanes (Fiona 2022, Irma and Maria 2017) causing prolonged outages.Ernesto is expected to stay well west of the US East Coast but could cause life-threatening surf and rip currents.Ernesto is the fifth named storm of an intense Atlantic hurricane season.\nPrevious storms include Category 1 Hurricane Debby and Category 5 Hurricane Beryl."}, {"id": "e46a64f6-136a-406e-956e-1631241c3b3c", "title": "Massive storm exposes growing threat looming over cities in the U . S . South :  A constant existential fear  ", "date": "2024-08-16 04:00", "url": "https://www.yahoo.com/news/massive-storm-exposes-growing-threat-013000478.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "In Charleston, South Carolina, the storm revealed just how vulnerable the city is to extreme weather events, which are becoming more common and more intense, the Washington Post reported.\nWhy are extreme weather events concerning?\nThe prospect of flooding is \"virtually just a constant existential fear we have throughout the year,\" Charleston resident Damon Black told the Post.\nUnfortunately, many of the places most affected by this extreme weather, such as Florida, are moving away from solutions meant to curb the trend.\nIn order to truly address the threat that extreme weather events pose, we must halt the overheating of our planet caused by dirty energy."}, {"id": "8fa3ef4b-7a9e-4ba9-92fe-fc76bf135bb2", "title": "Hurricane Ernesto To Create Dangerous Beach Conditions Along East Coast", "date": "2024-08-16 01:00", "url": "https://whnz.iheart.com/content/2024-08-15-hurricane-ernesto-to-create-dangerous-beach-conditions-along-east-coast/", "domain": "whnz.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto, the third hurricane of the season, is heading towards Bermuda, bringing with it the threat of life-threatening rip currents along the East Coast.\nThe hurricane, which has already caused damage in Puerto Rico and the Virgin Islands, is currently moving north at 14 mph, just east of the Bahamas.\nWith maximum sustained winds of 85 mph, Ernesto is a Category 1 hurricane, just 9 mph away from a Category 2 designation, according to the National Hurricane Center.\nWhile the storm is not projected to make direct landfall on the U.S., forecasters expect it to bring dangerous swells to the East Coast over the weekend.\nThe National Hurricane Center has warned people on the East Coast to prepare for a significant risk of life-threatening surf and rip currents."}, {"id": "4f2bbcbc-5fa4-4f93-a452-ebeea8401638", "title": "Hurricane Ernesto To Create Dangerous Beach Conditions Along East Coast", "date": "2024-08-16 01:00", "url": "https://knst.iheart.com/content/2024-08-15-hurricane-ernesto-to-create-dangerous-beach-conditions-along-east-coast/", "domain": "knst.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto, the third hurricane of the season, is heading towards Bermuda, bringing with it the threat of life-threatening rip currents along the East Coast.\nThe hurricane, which has already caused damage in Puerto Rico and the Virgin Islands, is currently moving north at 14 mph, just east of the Bahamas.\nWith maximum sustained winds of 85 mph, Ernesto is a Category 1 hurricane, just 9 mph away from a Category 2 designation, according to the National Hurricane Center.\nWhile the storm is not projected to make direct landfall on the U.S., forecasters expect it to bring dangerous swells to the East Coast over the weekend.\nThe National Hurricane Center has warned people on the East Coast to prepare for a significant risk of life-threatening surf and rip currents."}, {"id": "4fa2c302-9ce1-44ad-baf6-0b453d030663", "title": "Hurricane Ernesto strengthens to Category 2 on its way to Bermuda", "date": "2024-08-16 16:00", "url": "https://www.abcactionnews.com/weather/hurricane-ernesto-strengthens-to-category-2-on-its-way-to-bermuda", "domain": "abcactionnews.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto strengthened to a Category 2 storm early on Friday as it made its way toward Bermuda.\nOfficials told Bermuda residents they had just hours to prepare before being slammed with heavy rains and strong winds.\nHurricane Ernesto was forecast to hit Bermuda with 100 mph winds and potentially dump more than a foot of rain on the small Caribbean island.\nAs of Friday afternoon, the hurricane continued to churn between Bermuda and Puerto Rico.\nRELATED STORY | Half of Puerto Rico without power as Hurricane Ernesto approaches Bermuda"}, {"id": "654debb3-dc60-4eb3-af86-5c9d74a6c854", "title": "Hurricane Ernesto strengthens to Category 2 on its way to Bermuda", "date": "2024-08-16 16:15", "url": "https://www.10news.com/weather/hurricane-ernesto-strengthens-to-category-2-on-its-way-to-bermuda", "domain": "10news.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto strengthened to a Category 2 storm early on Friday as it made its way toward Bermuda.\nOfficials told Bermuda residents they had just hours to prepare before being slammed with heavy rains and strong winds.\nHurricane Ernesto was forecast to hit Bermuda with 100 mph winds and potentially dump more than a foot of rain on the small Caribbean island.\nAs of Friday afternoon, the hurricane continued to churn between Bermuda and Puerto Rico.\nRELATED STORY | Half of Puerto Rico without power as Hurricane Ernesto approaches Bermuda"}, {"id": "25f48942-0d9c-4e34-9efb-43654eebf8d4", "title": "Ernesto offers surprising insights into a hurricane wind field", "date": "2024-08-16 22:00", "url": "https://www.bostonglobe.com/2024/08/16/metro/hurricane-ernesto-wind-field-atlantic/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "As Ernesto continued churning through the Atlantic on Friday approaching Bermuda, the British territory was bracing for harsh, hurricane-force winds and flooding rains.\nAlso, as the storms move into the northern latitudes, the wind field can expand as the storm starts to undergo a transition from a tropical one to an extra tropical one.\nAdvertisementBut when hurricanes are at their most intense and over the warm waters of the Atlantic, Pacific or Indian oceans, the wind field is quite tight, perhaps surprisingly so.\nNASANotice the map below with the predicted wind field through Wednesday of next week.\nThe odds of any significant wind reaching our latitude are small, but you can infer how a track of Ernesto further west, highly unlikely, would place part of Cape Cod into the path of tropical storm winds."}, {"id": "f6f35684-8dc8-4862-858e-34bda641148e", "title": "Hurricane Ernesto strengthens to Category 2 on its way to Bermuda", "date": "2024-08-16 14:45", "url": "https://www.kxxv.com/weather/hurricane-ernesto-strengthens-to-category-2-on-its-way-to-bermuda", "domain": "kxxv.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto strengthened to a Category 2 storm early on Friday as it made its way toward Bermuda.\nOfficials told Bermuda residents they had just hours to prepare before being slammed with heavy rains and strong winds.\nHurricane Ernesto was forecast to hit Bermuda with 100 mph winds and potentially dump more than a foot of rain on the small Caribbean island.\nAs of Friday afternoon, the hurricane continued to churn between Bermuda and Puerto Rico.\nRELATED STORY | Half of Puerto Rico without power as Hurricane Ernesto approaches Bermuda"}, {"id": "04b0d74a-23ae-43fc-8c0a-a9f2cecb3701", "title": "Hurricane Ernesto will create big waves , strong rip currents at NC beaches . Here when . ", "date": "2024-08-16 18:00", "url": "https://www.yahoo.com/news/hurricane-ernesto-create-big-waves-165257317.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto likely will create dangerous conditions along the length of the North Carolina coast on Friday, bringing big waves and strong rip currents as the storm moves through the Atlantic hundreds of miles offshore, forecasters say.\nThe risk of strong rip currents is high at all the state’s beaches through the same period as a result of the storm, the National Weather Service said.\nRed flags will be posted all along the N.C. Coast starting Friday as Hurricane Ernesto passes hundreds of miles offshore, causing large swells and strong rip currents.\n!”The biggest waves and strongest rip currents are expected Friday, but conditions will be rough through at least Monday, forecasters said.\n“All is well this AM on NC 12, but Hatteras and Ocracoke are now under a Coastal Flood Advisory due to tidal effects from far-off Hurricane Ernesto, “DOT said."}, {"id": "01c1b034-92fe-4f75-aacf-c86f22b359e4", "title": "Hurricane Ernesto is charging through the Atlantic . Here what it doing . ", "date": "2024-08-16 03:45", "url": "https://www.newschannel5.com/news/as-ernesto-hurricane-ernesto-is-charging-through-the-atlantic-heres-what-its-doing", "domain": "newschannel5.com", "domain_classification": "Unknown", "message": "NASHVILLE, Tenn. (WTVF) — Ernesto has recently been updated to a Category 1 hurricane as the disturbance continues to churn in the Atlantic.\nAfter sweeping through the Virgin Islands and Puerto Rico, the storm is now on track toward Bermuda.\nAs of Thursday afternoon 389,424, clients across Puerto Rico are still without power, according to LUMA Energy.\nA Hurricane Warning is in place as Ernesto will likely strengthen to a major hurricane before approaching Bermuda, meaning a Category 3 or higher.\nConditions in Tennessee and Kentucky will not be influenced by Ernesto."}, {"id": "8c6081e7-eb49-4f37-9f8b-36d8fd854118", "title": "Experts warn Ireland set to face  remnant of Hurricane Ernesto", "date": "2024-08-16 10:30", "url": "https://www.irishcentral.com/news/ireland-hurricane-ernesto", "domain": "irishcentral.com", "domain_classification": "Unknown", "message": "Weather forecasters have warned that Ireland is set to face the ‘remnants’ of Hurricane Ernesto in another blow to Ireland’s summer.\nHurricane Ernesto has already made its presence known in the Caribbean island of Puerto Rico, where more than half of all homes and businesses have been left without power.\nPath is uncertain but what is left could influence our weather later next week but a hurricane is NOT coming to Ireland.\nHurricane #Ernesto is going to head towards Bermuda and could bring flooding and damaging winds to the Islands this weekend.\nElsewhere, Ireland Weather Channel’s Cathal Nolan believes that conditions will be milder than the hurricane’s peak when it comes through Ireland through a jet stream from the US."}, {"id": "670898e8-e5f8-465a-a926-8c7a8ad0c3d7", "title": "Hurricane Ernesto strengthens to Category 2 on its way to Bermuda", "date": "2024-08-16 14:00", "url": "https://www.kjrh.com/weather/hurricane-ernesto-strengthens-to-category-2-on-its-way-to-bermuda", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto strengthened to a Category 2 storm early on Friday as it made its way toward Bermuda.\nOfficials told Bermuda residents they had just hours to prepare before being slammed with heavy rains and strong winds.\nHurricane Ernesto was forecast to hit Bermuda with 100 mph winds and potentially dump more than a foot of rain on the small Caribbean island.\nAs of Friday afternoon, the hurricane continued to churn between Bermuda and Puerto Rico.\nRELATED STORY | Half of Puerto Rico without power as Hurricane Ernesto approaches Bermuda"}, {"id": "eada2b5e-6e19-48c5-a3fe-f8a70e1a1dcb", "title": "Hurricane Ernesto : Residents of eastern Newfoundland warned to prepare for flooding – Winnipeg Free Press", "date": "2024-08-16 16:00", "url": "https://www.winnipegfreepress.com/uncategorized/2024/08/16/hurricane-ernesto-residents-of-eastern-newfoundland-warned-to-prepare-for-flooding", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "HALIFAX – Residents of Nova Scotia and eastern Newfoundland are being told to keep a close watch on the progress of Hurricane Ernesto as it churns its way northward, pushing big waves far from its swirling centre.\nAs of Friday, the storm was expected to stay far to the south and east of Nova Scotia, but the Canadian Hurricane Centre in Dartmouth, N.S., said Ernesto could cause some coastal flooding in parts of eastern Newfoundland by Monday night.\nThis GOES-16 GeoColor satellite image taken at 4 p.m. EDT and provided by National Oceanic and Atmospheric Administration (NOAA) shows Hurricane Ernesto northwest of San Juan, Puerto Rico and moving over open waters, Wednesday, Aug. 14, 2024.\nOn July 11, the remnants of hurricane Beryl flooded parts of western and central Nova Scotia with more than 100 millimetres of rain in just a few hours.\nFor a Category 2 hurricane, Ernesto is a large storm, with winds exceeding 120 km/h extending up to 110 kilometres from its centre."}, {"id": "5f179ed9-e05d-43fb-bcd9-3d3f42d13325", "title": "How many hurricanes have hit Texas ? See list of top 5 US states hit most often", "date": "2024-08-16 11:45", "url": "https://www.yahoo.com/news/many-hurricanes-hit-texas-see-110153329.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "How many hurricanes have hit Texas?\n2 for most hurricanes among US statesBased on data through 2022, Texas has been hit by more hurricanes than 48 other states.\nLIST: Top 5 states with the most hurricanesHere are the top five states most often hit by hurricanes.\nWhy are some states hit by hurricanes more than others?\nThis article originally appeared on Austin American-Statesman: How many hurricanes have hit Texas?"}, {"id": "6654c3e5-b039-4a45-bc33-eeeb83d06f18", "title": "Ernesto expected to become major hurricane . What St . Augustine forecast ? ", "date": "2024-08-16 02:00", "url": "https://www.yahoo.com/news/ernesto-expected-become-major-hurricane-134727572.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Ernesto continued to strengthen overnight and is now expected to become a major hurricane by early Friday morning, according to the latest advisory from the National Hurricane Center.\nAt 8 a.m., the center of Tropical Storm Ernesto was located near latitude 19.8 North, longitude 67.2 West.\nErnesto is expected to become a hurricane later today and could become a major hurricane in a couple of days.\nGraphics explain the deadly weather eventHurricane warning: A hurricane warning means that hurricane conditions are expected somewhere within the warning area.\nTropical storm warning: A tropical storm warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours."}, {"id": "275d093a-609c-4db5-9ba2-65384d1b675e", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 04:30", "url": "https://www.canberratimes.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "c55a3ebc-55e5-431f-be81-55dc53ba9f34", "title": "Hurricane Ernesto nears Bermuda as Puerto Rico outages persist", "date": "2024-08-16 06:45", "url": "https://www.stabroeknews.com/2024/08/16/news/regional/hurricane-ernesto-nears-bermuda-as-puerto-rico-outages-persist/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "Now a Category 1 hurricane, Ernesto is forecast to strengthen into a much more powerful hurricane before it reaches Bermuda late today, a British island territory far out in the Atlantic, the National Hurricane Center (NHC) said.\n“Strengthening is forecast during the next day or so, and Ernesto could be near major hurricane strength by Friday,” the NHC said.\nErnesto became a hurricane on Wednesday after leaving Puerto Rico as a tropical storm, where it battered the island with heavy rainfall.\nFive years earlier, Hurricanes Irma and Maria destroyed the island’s power grid and caused outages in some areas that lasted nearly a year.\nErnesto is the fifth named Atlantic storm of what is expected to be an intense hurricane season."}, {"id": "ce687c30-404f-48d6-be5e-8ec94d10cccd", "title": "Hurricane Ernesto will hit Bermuda with life - threatening flooding and 100 mph winds", "date": "2024-08-16 16:00", "url": "https://www.hantsjournal.ca/hurricane-ernesto-will-hit-bermuda-with-life-threatening-flooding-and-100-mph-winds/", "domain": "hantsjournal.ca", "domain_classification": "Unknown", "message": "Hurricane Ernesto is set to bring life-threatening flooding, storm surges and winds of up to 100 mph to Bermuda, forecasters said, with dangerous conditions beginning Friday before the storm hits the island in the next 24 hours.\nThe Category 2 storm is 255 miles southwest of the North Atlantic island and moving at 13 mph, the National Hurricane Center said in an 8 a.m. update.\nA hurricane warning has been issued for the entire island and up to 15 inches of rain is expected.\nHurricane-force winds of at least 74 mph are expected Extend 70 miles from the storm’s center, while tropical storm force winds of at least 39 mph can be felt 265 miles away.\nSatellite image shows Hurricane Ernesto approaching Bermuda."}, {"id": "8fea5cb3-8c9c-4d3a-bb8c-040690634ec9", "title": "On heels of Debby , exploring how hurricanes form", "date": "2024-08-16 10:30", "url": "https://auburnpub.com/life-entertainment/eco-talk-cornell-cooperative-extension/article_8d717c5c-5ab4-11ef-836a-ef61983216c7.html", "domain": "auburnpub.com", "domain_classification": "Unknown", "message": "We are amid a busy 2024 hurricane season, running from June 1 until Nov. 30.\nThe forecasters predicted 17 to 25 tropical storms (winds of 39 mph or higher) this year, with eight to 13 of those becoming hurricanes (winds greater than 74 mph) and four to seven of those hurricanes developing into major hurricanes.\nBack in August of 2021 the remnants of Tropical Storm Fred dumped 7.64 inches of rain in Auburn, and Debby last week dropped over 5 inches in parts of CNY.\nThe winds that most often contribute to tropical storm formation originate from the easterly winds crossing over Africa.\nThe process that creates La Nina or El Nino is a complicated process worthy of its own Eco Talk."}, {"id": "d8d31d7d-105d-4ee9-9736-39ec2550d6aa", "title": "How Hurricane Ernesto Could Impact Your Travels", "date": "2024-08-16 04:15", "url": "https://www.cntraveler.com/story/hurricane-ernesto-travel-advice", "domain": "cntraveler.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto, then a tropical storm, knocked out power for half of Puerto Rico on Wednesday and is moving toward Bermuda with increased strength.\nIn Puerto Rico, tropical storm conditions have passed, according to a Thursday travel advisory from Discover Puerto Rico, the island’s Destination Marketing Organization.\nHowever, parts of Vieques, Culebra, and the eastern coast of Puerto Rico are still recovering from heavy rains, flash floods, and tropical winds.\nIn Florida, Fort Lauderdale International Airport (FLL) and Miami International Airport (MIA) saw delay rates of 88.35% and 91.11% respectively, while Palm Beach International Airport (PBI), Southwest Florida International Airport (RSW), and Sarasota Bradenton International Airport (SRQ ) saw 100% of flights delayed.\nNorwegian Cruise LineThree Norwegian Cruise Line itineraries have also been modified as result of Hurricane Ernesto."}, {"id": "0ef627a5-8a62-4c8f-87b3-d2a33dd84285", "title": "Hurricane Ernesto Triggers Rip Current Warnings for New Jersey Beaches", "date": "2024-08-16 14:00", "url": "https://1007wzxl.iheart.com/content/2024-08-16-hurricane-ernesto-triggers-rip-current-warnings-for-new-jersey-beaches/", "domain": "1007wzxl.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto, a strengthening Category 1 storm, is set to bring dangerous swimming conditions to many New Jersey beaches this weekend.\nAlthough the hurricane will remain well offshore, it is expected to generate large swells and dangerous rip currents along the New Jersey and Delaware beaches.\nThe hurricane center expects Ernesto to spend the weekend near Bermuda before arcing toward the northeast and off the New England coast.\nThe effects of Ernesto may be evident as early as Friday, with the rip current risk possibly lingering into Monday, and possibly Tuesday.\nAccording to the National Weather Service, \"The rip current risk will be high pretty much from Miami to Maine.”In addition to rip currents, the Jersey shore could experience gusts of wind up to 30 miles per hour."}, {"id": "545c8d1f-bb19-4da3-9a4c-012bc771bef4", "title": "Hurricane Ernesto Triggers Rip Current Warnings for New Jersey Beaches", "date": "2024-08-16 15:15", "url": "https://993thebuzz.iheart.com/content/2024-08-16-hurricane-ernesto-triggers-rip-current-warnings-for-new-jersey-beaches/?pname=www.993thebuzz.com&sc=dnsredirect", "domain": "993thebuzz.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto, a strengthening Category 1 storm, is set to bring dangerous swimming conditions to many New Jersey beaches this weekend.\nAlthough the hurricane will remain well offshore, it is expected to generate large swells and dangerous rip currents along the New Jersey and Delaware beaches.\nThe hurricane center expects Ernesto to spend the weekend near Bermuda before arcing toward the northeast and off the New England coast.\nThe effects of Ernesto may be evident as early as Friday, with the rip current risk possibly lingering into Monday, and possibly Tuesday.\nAccording to the National Weather Service, \"The rip current risk will be high pretty much from Miami to Maine.”In addition to rip currents, the Jersey shore could experience gusts of wind up to 30 miles per hour."}, {"id": "d2c0fad4-9493-4a09-9d83-769116575e9b", "title": "Hurricane Ernesto to hit Bermuda with life - threatening flooding and 100 mph winds", "date": "2024-08-16 12:45", "url": "https://www.yahoo.com/news/hurricane-ernesto-hit-bermuda-life-115724266.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto is due to bring life-threatening floods, storm surges and 100 mph winds to Bermuda, with dangerous conditions likely to start Friday ahead of the storm's likely arrival on the island in the next 24 hours, forecasters said.\nThe whole island is under a hurricane warning and as much as 15 inches of rain is expected.\nHurricane-strength winds, which are least 74 mph, are expected to extend 70 miles from the storm's center, while tropical storm-force winds of at least 39 mph will be felt 265 miles away.\n\"A dangerous storm surge is expected to produce significant coastal flooding on Bermuda in areas of onshore winds.\nA satellite image shows Hurricane Ernesto approaching Bermuda."}, {"id": "4eabc3f1-0488-4679-9107-f257e9fe07ee", "title": "August warmth closes the workweek with dry skies . Changes looming for the weekend", "date": "2024-08-16 14:45", "url": "https://www.yahoo.com/news/august-warmth-closes-workweek-dry-122503847.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Today, we continue with dry conditions and abundant sunshine as daytime highs bump a degree or two above seasonal norms with high pressure in control over Utah today.\nDrier and warmer weather returns for our late week, but a more active and wetter pattern arrives for the weekend.\nRoughly 89 percent of Utah is experiencing abnormally dry conditions, but we do have more moisture in the forecast!\nThis moisture looks to linger into early next week, so keep those eyes to the skies starting this weekend!\nThe current weather pattern suggests we return to a drier and seasonal pattern by mid-late next week."}, {"id": "844b3a07-8923-4241-bce9-d48c975c2e3a", "title": "INSIDE LOOK : Live Oak businesses rebounding 10 days after Hurricane Debby", "date": "2024-08-16 02:00", "url": "https://www.wtxl.com/live-oak/inside-look-live-oak-businesses-rebounding-10-days-after-hurricane-debby", "domain": "wtxl.com", "domain_classification": "Unknown", "message": "Neighbors in Live Oak are still recovering from flooding that filled the streets during Hurricane Debby.\nBROADCAST TRANSCRIPT:Between Hurricane Debby's heavy rainfall and the overflowing of the Suwannee River, Live Oak suffered from catastrophic flooding.\nThis was the scene of downtown Live Oak the day Hurricane Debby left the town in feet of floodwater.\nRosmery Casado, Manager at Latin Flavor Cafe - \"Este negocio tuvo perdidas, perdidas económicas.\"\nCasado - \"Mas las perdidas que se fueron en las inundaciones, las carnes, los alimentos, los materiales, el toldo — definitivamente es muy terrible.\""}, {"id": "530916df-0368-40b4-9d53-8e1e5e47cbdf", "title": "Hurricane Ernesto will bring dangerous swimming conditions , rain to Long Island this weekend", "date": "2024-08-16 16:00", "url": "https://www.newsday.com/news/weather/hurricane-ernesto-weather-forecast-aytl9odi", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto is set to bring dangerous swimming conditions and rainy weather to Long Island this weekend, as the Category 2 hurricane is expected to pass through Bermuda on Saturday.\nRamunni said that while Hurricane Ernesto will be “pretty close” to Bermuda, if not directly hit the island, the storm will remain offshore to the east of Long Island.\nHowever, Ernesto will create dangerous swimming conditions on Long Island and a rip current statement is in effect until Saturday at 9 p.m. for all South Shore beaches.\nLong Island will mostly see showers and possible thunderstorms late Sunday into Monday, Ramunni said.\n“But I would plan to have an umbrella handy.”The silver lining is that the storm will head east and offshore by Tuesday, and Long Island will see dry and less-humid conditions."}, {"id": "309f338e-7808-485d-a85c-63dbefb390c8", "title": "Isolated Downpours and Thunderstorms Through This Evening", "date": "2024-08-16 01:00", "url": "https://www.westernmassnews.com/2024/08/15/scattered-showers-thunderstorms-possible-this-afternoon/", "domain": "westernmassnews.com", "domain_classification": "Unknown", "message": "(WGGB/WSHM) - A cool start out there with temperatures starting off in the 60′s, with some thin patch fog in some areas.\nToday will feature partly to mostly sunny skies, however, it’s a hazy sunshine due to wildfire smoke.\nAn Air Quality Alert is in effect through midnight tonight.\nThe air quality will be at a level 3-dangerous for sensitive groups, especially this afternoon as smoke may work down to surface levels.\nWildfire smoke may still be an issue for the first half of the day, but not as bad as today, and we will see the smoke clearing up slightly throughout the day."}, {"id": "765f3c14-1bca-4d71-b599-231f17813414", "title": "Bermuda braces for Category 2 Hurricane Ernesto", "date": "2024-08-16 11:30", "url": "https://www.cbc.bb/news/international-news/bermuda-braces-for-category-2-hurricane-ernesto/", "domain": "cbc.bb", "domain_classification": "Unknown", "message": "The storm could intensify even further to become the season’s second major hurricane — Category 3 or stronger — as it crosses 600 miles of the Atlantic before reaching Bermuda early Saturday.\nThe center of the hurricane will track near or over Bermuda on Saturday but powerful wind gusts and heavy rain will arrive earlier.\nBeyond Bermuda, Ernesto will pass close to Atlantic Canada early next week and potentially bring some rain, wind and rough seas.\nIn the US Virgin Islands, just over 25,000 customers were without power Thursday evening, about half of the island’s tracked customers, according to PowerOutage.us.\nEven as Ernesto moved a few hundred miles away from Puerto Rico Wednesday night, water issues worsened."}, {"id": "838d2f44-01de-4f0e-bc04-7abe9b832aaa", "title": "Hurricane Ernesto strengthens to Category 2 as it approaches Bermuda", "date": "2024-08-16 14:45", "url": "https://www.ksro.com/2024/08/16/hurricane-ernesto-strengthens-to-category-2-as-it-approaches-bermuda/", "domain": "ksro.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) — A hurricane warning has been issued for Bermuda as Ernesto strengthened to a Category 2 storm overnight.\nThe hurricane is forecast to strengthen on Friday, but will remain a Category 2 storm as it passes Bermuda.\nFlash flooding covers a roadway after Tropical Storm Ernesto moved through the area in Dorado, Puert…The hurricane will approach Bermuda Friday night as the eye wall — with its strongest winds — passes over Bermuda early Saturday morning.\nIn the Northeast, waves could be 6 to 9 feet close to the shore and over 10 feet away from the coast.\nAfter Bermuda, Ernesto will move northeast and brush Newfoundland with winds up to 80 mph early next week."}, {"id": "a4597092-6cd0-4e1b-bf74-cac0a469cc01", "title": "Hurricane Ernesto strengthens to Category 2 as it approaches Bermuda", "date": "2024-08-16 16:15", "url": "https://midutahradio.com/news/national-news/hurricane-ernesto-strengthens-to-category-2-as-it-approaches-bermuda/", "domain": "midutahradio.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) — A hurricane warning has been issued for Bermuda as Ernesto strengthened to a Category 2 storm overnight.\nThe hurricane is forecast to strengthen on Friday, but will remain a Category 2 storm as it passes Bermuda.\nFlash flooding covers a roadway after Tropical Storm Ernesto moved through the area in Dorado, Puert…The hurricane will approach Bermuda Friday night as the eye wall — with its strongest winds — passes over Bermuda early Saturday morning.\nIn the Northeast, waves could be 6 to 9 feet close to the shore and over 10 feet away from the coast.\nAfter Bermuda, Ernesto will move northeast and brush Newfoundland with winds up to 80 mph early next week."}, {"id": "230cbe51-d993-40f8-b617-fce7dedf3473", "title": "ABC National News - Beach 95 . 1 - WBPC Panama City Beach Greatest Hits of the 60s , 70s & 80s", "date": "2024-08-16 18:00", "url": "https://beach951.com/abc-national-news/7330973c2de994f59222f1fe7e6ec6e1", "domain": "beach951.com", "domain_classification": "Unknown", "message": "The hurricane is forecast to strengthen on Friday, but will remain a Category 2 storm as it passes Bermuda.\nFlash flooding covers a roadway after Tropical Storm Ernesto moved through the area in Dorado, Puert...\nThe hurricane will approach Bermuda Friday night as the eye wall -- with its strongest winds -- passes over Bermuda early Saturday morning.\nIn the Northeast, waves could be 6 to 9 feet close to the shore and over 10 feet away from the coast.\nAfter Bermuda, Ernesto will move northeast and brush Newfoundland with winds up to 80 mph early next week."}, {"id": "86414a4e-3889-4abe-a58a-363092085ff7", "title": "Hurricane Ernesto strengthens to Category 2 as it approaches Bermuda", "date": "2024-08-16 19:45", "url": "https://www.brookingsradio.com/syndicated-article/?id=1579611", "domain": "brookingsradio.com", "domain_classification": "Unknown", "message": "(NEW YORK) — A hurricane warning has been issued for Bermuda as Ernesto strengthened to a Category 2 storm overnight.\nThe hurricane is forecast to strengthen on Friday, but will remain a Category 2 storm as it passes Bermuda.\nFlash flooding covers a roadway after Tropical Storm Ernesto moved through the area in Dorado, Puert…The hurricane will approach Bermuda Friday night as the eye wall — with its strongest winds — passes over Bermuda early Saturday morning.\nIn the Northeast, waves could be 6 to 9 feet close to the shore and over 10 feet away from the coast.\nAfter Bermuda, Ernesto will move northeast and brush Newfoundland with winds up to 80 mph early next week."}, {"id": "1d98d792-ce49-441a-a0d1-198c6fb24854", "title": "ABC National - WOND", "date": "2024-08-16 16:00", "url": "https://wondradio.com/abc-national/8ee765322a88e2a03b31810ee2d78170", "domain": "wondradio.com", "domain_classification": "Unknown", "message": "ABC News(NEW YORK) -- A hurricane warning has been issued for Bermuda as Ernesto strengthened to a Category 2 storm overnight.\nThe hurricane is forecast to strengthen on Friday, but will remain a Category 2 storm as it passes Bermuda.\nFlash flooding covers a roadway after Tropical Storm Ernesto moved through the area in Dorado, Puert...\nThe hurricane will approach Bermuda Friday night as the eye wall -- with its strongest winds -- passes over Bermuda early Saturday morning.\nIn the Northeast, waves could be 6 to 9 feet close to the shore and over 10 feet away from the coast."}, {"id": "12ff374e-9193-4835-9675-3ba3c764421c", "title": "National - Carroll Broadcasting Inc . ", "date": "2024-08-16 16:00", "url": "https://wkjc.com/national/92564911da0222d949d8fcafd5d9c79f", "domain": "wkjc.com", "domain_classification": "Unknown", "message": "The hurricane is forecast to strengthen on Friday, but will remain a Category 2 storm as it passes Bermuda.\nFlash flooding covers a roadway after Tropical Storm Ernesto moved through the area in Dorado, Puert...\nThe hurricane will approach Bermuda Friday night as the eye wall -- with its strongest winds -- passes over Bermuda early Saturday morning.\nIn the Northeast, waves could be 6 to 9 feet close to the shore and over 10 feet away from the coast.\nAfter Bermuda, Ernesto will move northeast and brush Newfoundland with winds up to 80 mph early next week."}, {"id": "26b2a3f2-5520-4efd-9b7d-ce1396336e0d", "title": "NJ weekend weather : Unsettled skies , occasional rain , rough surf", "date": "2024-08-16 12:45", "url": "https://nj1015.com/nj-weekend-weather-unsettled-skies-occasional-rain-rough-surf/", "domain": "nj1015.com", "domain_classification": "Unknown", "message": "Something for everyone, ranging from cool mornings to warm afternoons, with mainly dry weather along the way.\nAnother nice, warm summer day with completely dry weather from start to finish.\nAnother nice, warm summer day with completely dry weather from start to finish.\nNew Jersey will see occasional periods of showers on Saturday, along with plentiful breaks of dry weather too.\n(Accuweather) New Jersey will see occasional periods of showers on Saturday, along with plentiful breaks of dry weather too."}, {"id": "9f3fa6d1-4aa5-41eb-b54d-52290443e7ea", "title": "Reduced Air Quality Due to Wildfire Smoke Friday", "date": "2024-08-16 15:15", "url": "https://www.westernmassnews.com/2024/08/16/reduced-air-quality-due-wildfire-smoke-friday/", "domain": "westernmassnews.com", "domain_classification": "Unknown", "message": "(WGGB/WSHM) - A cool start out there with temperatures starting off in the 60′s, with some thin patch fog in some areas.\nToday will feature partly to mostly sunny skies, however, it’s a hazy sunshine due to wildfire smoke.\nAn Air Quality Alert is in effect through midnight tonight.\nThe air quality will be at a level 3-dangerous for sensitive groups, especially this afternoon as smoke may work down to surface levels.\nWildfire smoke may still be an issue for the first half of the day, but not as bad as today, and we will see the smoke clearing up slightly throughout the day."}, {"id": "941600f9-c35d-4bad-b5cf-36e60f28d0ff", "title": "Storm Ernesto , now a hurricane , nears Bermuda", "date": "2024-08-16 01:00", "url": "https://www.maitlandmercury.com.au/story/8731818/storm-ernesto-now-a-hurricane-nears-bermuda/?cs=7607", "domain": "maitlandmercury.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "1ba7709d-8138-414e-8b54-402e49c9c913", "title": "Taiwan hit by a 6 . 1 - magnitude earthquake : CENC", "date": "2024-08-16 14:45", "url": "https://tribune.com.pk/story/2488549/taiwan-hit-by-a-61-magnitude-earthquake-cenc", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "A 6.1-magnitude earthquake jolted the waters off Hualien County in China's Taiwan at 7:35 a.m. Friday (Beijing Time), according to the China Earthquake Networks Center (CENC).\nThe quake struck at a depth of 16 km, said a report issued by the CENC.\nPreviously, warning was issued after southwestern Japan was jolted on Thursday by a strong 7.1 magnitude earthquake, forcing Prime Minister Fumio Kishida to cancel his trip to Central Asia on Friday.\nIt is the “first such advisory for areas around the Nankai Trough” -- stretching from southwestern to central Japan -- issued by Japan Meteorological Agency, Tokyo-based Kyodo News reported.\nSeveral injuries and damage to buildings were reported in Miyazaki and two neighboring provinces after the earthquake hit the region on Thursday."}, {"id": "0730f0c0-5daa-4ed4-880f-d2126a2b4a9f", "title": "Hurricane Ernesto maps : track storm as it aims at Bermuda , causes riptides in US", "date": "2024-08-16 06:30", "url": "https://www.yahoo.com/news/hurricane-ernesto-maps-track-storm-060027406.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto maps: track storm as it aims at Bermuda, causes riptides in USHurricane Ernesto regained strength as it sat over Atlantic waters as Puerto Rico and the Virgin Islands recovered from the storm's broadside Thursday.\nYou can track the storm's path with the latest maps and models below and follow along with USA TODAY's coverage of Tropical Storm Ernesto as the fifth named storm of the 2024 Atlantic hurricane season moves through the Caribbean.\nTropical storm Ernesto path trackerIf the map above is not loading on your screen, click here.\nTropical Storm Ernesto Spaghetti ModelsIllustrations include an array of forecast tools and models, and not all are created equal.\nThis article originally appeared on USA TODAY: Track Hurricane Ernesto as it gathers strength barreling on Bermuda"}, {"id": "462ac812-f68e-462d-a18e-e76e3ee153de", "title": "Nature  needs £3 billion climate support  ", "date": "2024-08-16 09:30", "url": "https://theecologist.org/2024/aug/16/nature-needs-ps3-billion-climate-support", "domain": "theecologist.org", "domain_classification": "Unknown", "message": "Drought is now the biggest threat to important sites for nature across the UK as the climate changes, a report from The Wildlife Trusts has warned.\nThe report examining the dangers posed to nature reserves cared for by the trusts also points to pollution, invasive species and habitat fragmentation as key current risks to wildlife in woods, peatlands, wetlands, coastal areas and grasslands.\nOver the next 30 years, Wildlife Trusts experts believe drought will continue to pose the biggest threat to their reserves, with other climate-driven risks including heatwaves and wildfires also causes for high concern.\nThe Wildlife Trusts warned that flooding, rather than drought, is often at the top of the list of hazards that politicians and governments use to discuss climate impacts.\nDrought planning needs more urgent attention alongside the other key hazards associated with climate change, the report urges."}, {"id": "6214017e-0c9c-4e9e-91b4-22138d679ea4", "title": "Storm Ernesto , now a hurricane , nears Bermuda", "date": "2024-08-16 00:30", "url": "https://www.newcastleherald.com.au/story/8731818/storm-ernesto-now-a-hurricane-nears-bermuda/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "c1a0ba66-6390-49f4-aa77-5fbb82ff0501", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm – Winnipeg Free Press", "date": "2024-08-16 11:30", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-as-wealthy-british-territory-preps-for-storm", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean opened shelters and closed government offices.\nA surfer prepares to enter the water before the passage of Tropical Storm Ernesto at La Pared beach in Luquillo, Puerto Rico, Tuesday, Aug. 13, 2024.\nLa Plata river floods a road after Tropical Storm Ernesto passed through Toa Baja, Puerto Rico, Wednesday, Aug. 14, 2024.\nLa Plata river floods a road after Tropical Storm Ernesto passed through Toa Baja, Puerto Rico, Wednesday, Aug. 14, 2024.\nAn electrical transformer explodes after the passage of Tropical Storm Ernesto in San Juan, Puerto Rico, Thursday, Aug. 15, 2024."}, {"id": "e565890b-68b4-4358-9738-ee555e2bc833", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 15:15", "url": "https://www.wcax.com/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-wealthy-british-territory-preps-storm/", "domain": "wcax.com", "domain_classification": "Unknown", "message": "The Category 2 storm located 125 miles (205 kilometers) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph).\nTropical storm conditions — including strong winds and life-threatening floods — began on Friday and are expected to continue through Saturday night, according to the National Hurricane Center.\nIn preparation for the storm, officials in the wealthy British territory announced they would suspend public transportation and close the airport by Friday night.\nErnesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season.\nThe National Oceanic and Atmospheric Administration has predicted an above-average Atlantic hurricane season this year because of record warm ocean temperatures."}, {"id": "18136943-1f4d-4be0-acc0-aac216d1fe7f", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 14:45", "url": "https://www.clickondetroit.com/news/world/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-as-wealthy-british-territory-preps-for-storm/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "(NOAA via AP)SAN JUAN – Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean opened shelters and closed government offices.\nThe Category 2 storm located 125 miles (205 kilometers) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph).\n“Hurricane Ernesto seriously threatens our community,” he said.\nErnesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season.\nThe National Oceanic and Atmospheric Administration has predicted an above-average Atlantic hurricane season this year because of record warm ocean temperatures."}, {"id": "0a062a34-469b-4859-94dd-799a147ffd31", "title": "Stronger Nankai Trough alert likely to cause more confusion | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-08-16 12:30", "url": "https://www.asahi.com/ajw/articles/15390950", "domain": "asahi.com", "domain_classification": "Unknown", "message": "The lifting of the Nankai Trough megaquake advisory came after a tense week, which raises fears even greater confusion could ensue in the event a higher-level “alert” becomes necessary.\nThe megaquake advisory was lifted on Aug. 15 after no significant changes were observed in crustal movements for seven days.\nThe Cabinet Office does not know how many people would be asked to evacuate in advance if a megaquake alert is issued.\nIn principle, transportation companies will also decide on their own how to respond to a megaquake alert.\nThere are no standards on actions that utilities are expected to take in the event of a megaquake alert."}, {"id": "cbcef2ad-49e8-4ec1-b134-d5e37d8773f5", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 14:45", "url": "https://www.clickorlando.com/news/world/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-as-wealthy-british-territory-preps-for-storm/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "(NOAA via AP)SAN JUAN – Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean opened shelters and closed government offices.\nThe Category 2 storm located 125 miles (205 kilometers) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph).\n“Hurricane Ernesto seriously threatens our community,” he said.\nErnesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season.\nThe National Oceanic and Atmospheric Administration has predicted an above-average Atlantic hurricane season this year because of record warm ocean temperatures."}, {"id": "ad34cc57-204f-4483-9656-6b28055c5b43", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 04:15", "url": "https://www.goulburnpost.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/?cs=14264", "domain": "goulburnpost.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "c07fe3c7-0a68-4564-8553-f4f5b2df6639", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 04:15", "url": "https://www.queanbeyanage.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/?cs=14264", "domain": "queanbeyanage.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "636d258e-8d6c-410b-a431-adaee6bef33d", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 06:45", "url": "https://www.singletonargus.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/", "domain": "singletonargus.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "26424ab4-e7b9-4cd7-bc2a-e0f11d6046a6", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 07:45", "url": "https://www.sconeadvocate.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/", "domain": "sconeadvocate.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "1e759db8-32bd-48ac-b0d7-a39d7c72802c", "title": "Hurricane Ernesto barrels toward Bermuda as British territory preps for storm", "date": "2024-08-16 22:15", "url": "https://jamaica-gleaner.com/article/caribbean/20240816/hurricane-ernesto-barrels-toward-bermuda-british-territory-preps-storm", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean prepared to open shelters and close government offices.\nThe Category 2 storm located 180 miles (285 kilometres) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph).\nTropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\nIn preparation for the storm, officials in the wealthy British territory announced they would suspend public transportation and close the airport by Friday night.\nErnesto is the fifth named storm and the third hurricane of this year's Atlantic hurricane season."}, {"id": "d7852819-f3c9-4c1e-9354-c06c8e70a4cb", "title": "Japan : Thousands ordered to evacuate as Typhoon Ampil approaches coast near Tokyo", "date": "2024-08-16 08:00", "url": "https://news.webindia123.com/news/Articles/World/20240816/4225658.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Residents in parts of Japan are being ordered to evacuate with some homes losing power on Friday as Typhoon Ampil approaches the coast near Tokyo, CNN reported.\nThe storm is expected to continue intensifying in the next 12 hours, potentially reaching its peak as it passes near Japan.\nThe storm is forecasted to hit the area by late Friday, bringing strong winds and heavy rain.\nFurther, a similar notice was issued in the city of Yokohama, south of Tokyo, with authorities warning that all residents should be prepared to evacuate.\nIf it stays offshore and only brushes the coast, it might only have a light impact on Japan, bringing rain and wind to some areas including Tokyo."}, {"id": "357ae474-80c9-42ea-9d07-bf6c25df08de", "title": "CAT Season : Hazards , Resources , and How to Prepare | J . S . Held", "date": "2024-08-16 14:45", "url": "https://www.jdsupra.com/legalnews/cat-season-hazards-resources-and-how-to-4858805/", "domain": "jdsupra.com", "domain_classification": "Unknown", "message": "Primetime for CAT season, which, in the insurance world, means “busy season,” is the period spanning June through September of each year.\nThis article discusses what to expect from a typical CAT season, how to prepare and overcome challenges (limited resources, increased workflow, etc.\nInspection hazards to be aware of during CAT season.\nKnow your resources – CAT season can be a stressful time, and sometimes the work can be overwhelming.\nConclusionNow that we have discussed what CAT season is, what to expect, how to overcome common industry challenges, and how to be prepared, you can be more prepared for any upcoming CAT season."}, {"id": "bc457036-b3cb-434a-8495-3fa5baa9121f", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 04:30", "url": "https://www.newcastleherald.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "1cda0ee4-9390-4fe3-85a0-77bfeafbb19a", "title": "Ernesto Becomes Category 2 Hurricane as It Heads to Bermuda", "date": "2024-08-16 08:30", "url": "https://www.insurancejournal.com/news/international/2024/08/16/788670.htm", "domain": "insurancejournal.com", "domain_classification": "Unknown", "message": "Ernesto strengthened into a Category 2 hurricane as it plowed northward toward Bermuda, threatening to drench the British territory with heavy rain and unleash flash floods.\nThe storm was 410 miles (660 kilometers) south-southwest of Bermuda according to an advisory from the US National Hurricane Center as of 11 p.m. in New York.\nIts top winds reached 100 miles per hour, making it a Category 2 hurricane on the five-step Saffir-Simpson scale.\nErnesto is expected to become a major Category 3 hurricane by about 2 p.m. Friday as it approaches Bermuda, but may weaken again by the time it reaches the island Saturday morning, according to AccuWeather Inc.\nPhotograph: Police block a flooded road as Tropical Storm Ernesto passes through Fajardo, Puerto Rico."}, {"id": "5f07def5-c2b8-4df6-9512-52416ec5deed", "title": "Japan orders evacuations near Tokyo as Typhoon Ampil approaches", "date": "2024-08-16 04:15", "url": "https://www.aol.com/japan-cancels-flights-suspends-bullet-065258652.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Hundreds of thousands of people are being advised to evacuate in parts of Japan, with some homes losing power on Friday, as Typhoon Ampil approaches the east coast near the capital.\nAmpil has rapidly intensified over the past two days, partly because it moved over very warm water – meaning more moisture in the air to fuel the typhoon.\nIt could strengthen further in the next 12 hours, with the storm reaching peak intensity as it passes by Japan.\nThe storm’s center is expected to remain slightly offshore as it turns toward the northeast and moves away from Japan, according to the JTWC and Japan’s Meteorological Agency.\nIf it stays offshore and only brushes the coast, it might only have a light impact on Japan, bringing rain and wind to some areas including Tokyo."}, {"id": "8eaea206-695a-4b51-af36-0192ca1cf04d", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 21:30", "url": "https://www.fox8live.com/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-wealthy-british-territory-preps-storm/", "domain": "fox8live.com", "domain_classification": "Unknown", "message": "The Category 2 storm located 125 miles (205 kilometers) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph).\nTropical storm conditions — including strong winds and life-threatening floods — began on Friday and are expected to continue through Saturday night, according to the National Hurricane Center.\nIn preparation for the storm, officials in the wealthy British territory announced they would suspend public transportation and close the airport by Friday night.\nErnesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season.\nThe National Oceanic and Atmospheric Administration has predicted an above-average Atlantic hurricane season this year because of record warm ocean temperatures."}, {"id": "b3a3cddb-ac5b-42ca-8aa1-00941c3f5733", "title": "Hope for costly Ike Dike funding restored with adoption of $56 billion statewide flood plan – Houston Public Media", "date": "2024-08-16 01:45", "url": "https://www.houstonpublicmedia.org/articles/news/energy-environment/2024/08/15/496817/hope-for-costly-ike-dike-funding-restored-with-adoption-of-56-billion-statewide-flood-plan/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "File photoThe Texas Water Development Board on Thursday adopted Texas’ first $56 billion statewide flood plan— restoring hope for the long-anticipated Ike Dike and other coastal flood mitigation projects.\n“Texas’ statewide flood planning program is the first of its kind,” Reem Zoun, a Water Development Board director said.\nUnder the project, around $49 billion will be diverted to flood mitigation projects.\nApproximately one in six people in Texas live or work in known flood hazard areas, according to flood plan documents.\nOther mitigation projects outlined in the statewide flood plan include Houston-area floodplain analyses, stormwater detention basins and deep tunnel systems for stormwater management."}, {"id": "f27a76cf-bf9c-4c66-8291-a6cf29191ee9", "title": "Hurricane Ernesto strengthens to Category 2 storm as it heads north", "date": "2024-08-16 06:30", "url": "https://www.bristolpost.co.uk/news/uk-world-news/hurricane-ernesto-strengthens-category-2-9487067", "domain": "bristolpost.co.uk", "domain_classification": "Unknown", "message": "Hurricane Ernesto strengthened into a Category 2 storm on Thursday night as it moved toward Bermuda, after leaving hundreds of thousands of people in Puerto Rico without power or water.\nA hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane."}, {"id": "9a8c892c-f648-4049-9899-2b1453d24ca6", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 15:30", "url": "https://www.wbng.com/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-wealthy-british-territory-preps-storm/", "domain": "wbng.com", "domain_classification": "Unknown", "message": "The Category 2 storm located 125 miles (205 kilometers) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph).\nTropical storm conditions — including strong winds and life-threatening floods — began on Friday and are expected to continue through Saturday night, according to the National Hurricane Center.\nIn preparation for the storm, officials in the wealthy British territory announced they would suspend public transportation and close the airport by Friday night.\nErnesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season.\nThe National Oceanic and Atmospheric Administration has predicted an above-average Atlantic hurricane season this year because of record warm ocean temperatures."}, {"id": "555db6db-c18f-4e78-9525-5ba9d91e218a", "title": "The man who has dived more than 600 times trying to find his wife body | World News", "date": "2024-08-16 16:15", "url": "https://metro.co.uk/2024/08/16/man-dived-600-times-trying-find-wifes-body-21437282/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "Yasuo has been searching for Yuko for over a decade (Picture: AFP)‘Are you OK?\nYuko was working at a local bank when the employees climbed to the roof, which was 30 feet high.\nThe tsunami had been expected to be 10 feet – it reached over 60 feet where Yuko was.\nIt’s been 13 years since Yuko disappeared, and her husband has embarked on a mission to find his wife’s body.\nFor more than a decade, the pair go out and brave the icy waters to search, and search, and search."}, {"id": "99fb330b-56e8-49c3-8ef3-2a260b758cd2", "title": "Small Hildale earthquake serves as reminder to be prepared for  a big one  – St George News", "date": "2024-08-16 00:00", "url": "https://www.stgeorgeutah.com/news/archive/2024/08/15/agl-small-hildale-earthquake-serves-as-reminder-to-be-prepared-for-a-big-one/", "domain": "stgeorgeutah.com", "domain_classification": "Unknown", "message": "Stock photo | Photo by vchal/iStock/Getty Images Plus, St. George NewsST. GEORGE — A 3.3. magnitude earthquake hit Hildale on Thursday afternoon.\nThe rumbling was reported by nine people throughout Southern Utah, including those near Cedar City and Hurricane and across the Arizona border in Colorado City.\nThe 3.3 magnitude earthquake likely rattled household items, she said.\nWhile other small quakes have occurred throughout Southern Utah this summer, Morton said it likely isn’t a pattern.\nCopyright St. George News, SaintGeorgeUtah.com LLC, 2024, all rights reserved."}, {"id": "becf9d83-0af6-4153-bcb1-d79152b8df07", "title": "When Hurricane Season Occurs In Galveston , Texas ( And How Serious The Risk Is ) ", "date": "2024-08-16 16:15", "url": "https://www.islands.com/1640467/hurricane-season-galveston-texas-how-serious-risk/", "domain": "islands.com", "domain_classification": "Unknown", "message": "There's a good reason that colorful cottage you booked for a getaway to Galveston Island, home to one of the country's best beaches for a family vacation, sits high up on stilts.\nAs a barrier island, Galveston is positioned to take the brunt of storm surge during a hurricane — up to 16 feet of surge in the event of a Category 4 storm like the one in 1900 that went down in history as the Great Galveston Hurricane, still considered the worst weather disaster in US history.\nAdvertisementPeak hurricane season on the Texas Gulf Coast occurs in August and September — the 1900 storm struck in September, as did 2008's Hurricane Ike — but the official season is much longer, from June 1 through November 30.\nThat's why the local tourist industry was surprised but not unprepared on July 8, 2024, when Category 1 Hurricane Beryl roared into town so early in the season.\nWhile there is good reason to be prudent when planning your trip to the Gulf Coast (trip insurance?"}, {"id": "023d53b3-6af9-4b3b-bc6b-59ed568bd982", "title": "Rare sighting :  Doomsday fish  found near Southern California shore", "date": "2024-08-16 00:00", "url": "https://www.yahoo.com/news/rare-sighting-doomsday-fish-found-220136112.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SAN DIEGO (KSWB/KUSI) – In a rare and perhaps ominous sighting, an oarfish was found floating near California’s La Jolla Shores over the weekend.\nSeveral people then worked together to carry the sea creature from the ocean to the bed of a truck using a paddleboard.\nWhile most oarfish measure anywhere from 10 to 30 feet long, Hook confirmed that this one was right at 12 feet long.\nJust a couple days after the oarfish sighting in La Jolla, an earthquake with a magnitude of 4.4 shook Southern California about 2.5 miles south, southeast of Highland Park near Los Angeles.\n“Experts don’t have any evidence to theorize why these fish are washing ashore in Southern California, but learn more from each specimen that is collected,” said Hook."}, {"id": "20c272f0-08bc-4905-bb7b-a37a6d8484c6", "title": "P . E . I . officials preparing for hurricane season in a post - Fiona world", "date": "2024-08-16 01:15", "url": "https://www.cbc.ca/news/canada/prince-edward-island/pei-fiona-hurricane-season-preparedness-1.7295914", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "As officials in Prince Edward Island prepare for hurricane season, they are urging Islanders to get ready for future Fiona-level storms — whenever they may hit.\nSince storm season began, the utility company has been circulating hurricane preparedness information in bill inserts and on its website.\nOn the municipal level, the Charlottetown Fire Department says it has been working with organizations in the community as it prepares for the height of the Atlantic hurricane season, which officially ends on Nov. 30.\nCharlottetown Fire Chief Tim Mamye said Islanders should prepare a 72-hour emergency kit for hurricane season.\n(Wayne Thibodeau/CBC)To prepare for hurricane season, Mamye recommended Islanders familiarize themselves with the municipal, provincial and federal advice on getting ready for an emergency."}, {"id": "50f898dd-4689-4fb8-8a06-f8553c064ce7", "title": "Light earthquake : M4 . 2 quake has struck near Tual in Indonesia", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-m4-2-quake-has-struck-near-tual-in-indonesia-9/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) has struck on Wednesday, 91 km SSW of Tual, Indonesia (57 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 10 km (6 miles).\nId of earthquake: us6000njzj.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 91 km SSW of Tual, Indonesia."}, {"id": "76265464-7919-4417-9fd0-222bfb0453b7", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 06:45", "url": "https://www.salisburyjournal.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "salisburyjournal.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane."}, {"id": "3a89767d-2d74-4ac3-bbfe-d9b579f93107", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 04:45", "url": "https://www.lancashiretelegraph.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane."}, {"id": "11502c84-04a0-405f-82f3-34c32f2fdace", "title": "Light earthquake , 4 . 3 mag was detected near False Pass in Alaska", "date": "2024-08-16 07:30", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-was-detected-near-false-pass-in-alaska-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) strikes 153 km S of False Pass, Alaska (95 miles) on Tuesday.\nThe earthquake occurred at a depth of 20.187 km (13 miles) below the earth’s surface.\nEvent ids that are associated to the earthquake: us7000n77k.\nIn the past 24 hours, there have been three, in the last 10 days six, in the past 30 days ten and in the last 365 days twenty-three earthquakes of magnitude 3.0 or greater that was reported nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 153 km S of False Pass, Alaska."}, {"id": "100ba1d3-6c1d-49fd-a172-721556968992", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 04:30", "url": "https://www.yorkpress.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "yorkpress.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane."}, {"id": "747af7f2-ff6b-457e-94dd-e1a86171f584", "title": "First Alert Forecast : toasty & dry in the Cape Fear while Ernesto nears Bermuda", "date": "2024-08-16 14:00", "url": "https://www.wect.com/2024/08/16/first-alert-forecast-toasty-dry-cape-fear-while-ernesto-nears-bermuda/", "domain": "wect.com", "domain_classification": "Unknown", "message": "WILMINGTON, N.C. (WECT) - As a high pressure ridge stays in control over the Carolinas, your First Alert Forecast features mostly sunny and mainly dry skies.\nYour First Alert Forecast highlights slowly increasing rain and storm chances this weekend with slim 10% odds Saturday, and 30% Sunday.\nGorgeous weather along southeast NC beaches in combination with distant Hurricane #Ernesto.\nThe storm’s swell will increase surf heights and elevate rip current activity at all Cape Fear beaches this weekend.\nCatch details in your seven-day forecast: http://webpubcontent.gray.tv/wect/MAXSevendayWECT.jpgOr, customize your location and extend your view to ten days on your WECT Weather App."}, {"id": "757c2aa6-1b7b-4233-856e-c51d64ebba6e", "title": "Houston heat comparison ! A look at last year versus this year", "date": "2024-08-16 00:45", "url": "https://www.click2houston.com/weather/2024/08/15/houston-heat-comparison-a-look-at-last-year-versus-this-year/", "domain": "click2houston.com", "domain_classification": "Unknown", "message": "In total, Houston saw 45 100° days in 2023.\nAt least it was 30 days less than our neighbors up north in College Station, where they saw 75 100° days.\nWe hit our first 100° day on July 1, 2024, with our second 100° day just over a week ago on Aug. 7, 2024.\nDuring the month of July, when Hurricane Beryl moved through, Houston saw over 10 inches of rain.\nThe latest 100° day that Houston saw was on Sept. 27, 2005."}, {"id": "74078766-5850-45a0-aae2-542ee52f6d63", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 06:45", "url": "https://www.thenorthernecho.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "thenorthernecho.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane."}, {"id": "2b280ec0-9bcb-40f2-a009-501ba7107990", "title": "Light earthquake : M4 . 5 quake has struck near the Fiji Islands", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-m4-5-quake-has-struck-near-the-fiji-islands-38/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.5 (ml/mb) was reported south of the Fiji Islands (0 miles) on Friday.\nThe epicenter was at a depth of 48.225 km (30 miles).\nEvent ids that are associated to the earthquake: us7000n7c2.\nIn the past 24 hours, there have been two, in the last 10 days two, in the past 30 days two and in the last 365 days ten earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: south of the Fiji Islands."}, {"id": "88b6dc43-2d11-4433-a135-9b96e330c626", "title": "Light earthquake , 4 . 5 mag has occurred near  Ohonua in Tonga", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-5-mag-has-occurred-near-ohonua-in-tonga-4/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) strikes 236 km SSW of ‘Ohonua, Tonga (147 miles) on Tuesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us7000n77h.\nIn the past 24 hours, there have been one, in the last 10 days one, in the past 30 days two and in the last 365 days six earthquakes of magnitude 3.0 or greater that was reported nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 236 km SSW of ‘Ohonua, Tonga."}, {"id": "ebbfac20-d349-4fde-9e7f-87acb0a716a3", "title": "Light earthquake , 4 . 4 mag strikes near Mohr in Iran", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-4-mag-strikes-near-mohr-in-iran-3/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 90 km WNW of Mohr, Iran (56 miles) on Wednesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nDate and time of earthquake in UTC/GMT: 14/08/24 / 2024-08-14 03:48:09 / August 14, 2024 @ 3:48 am.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 90 km WNW of Mohr, Iran."}, {"id": "192d503f-eb1b-4b0a-aa42-ff5f22261077", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 04:45", "url": "https://www.bucksfreepress.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "bucksfreepress.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane."}, {"id": "8f157a22-8301-4781-b714-9e7c41a410ad", "title": "Texas and Florida suffered Hurricanes Beryl and Debby differently", "date": "2024-08-16 11:30", "url": "http://www.houstonchronicle.com/business/columnists/tomlinson/article/beryl-texas-florida-hurricane-suffering-19656946.php", "domain": "houstonchronicle.com", "domain_classification": "Unknown", "message": "He estimates that water rose about 24-30 inches high in his home that morning as a result of Hurricane Debby.\nMichael M. Santiago/Getty Images Hurricane Debby, seen on the right in this weather satellite photo, made landfall in northern Florida.\nHurricane Debby brings rain storms and high winds along Florida’s Big Bend area.\nHurricane Debby struck Florida’s Coastal Bend on Aug. 5, landing near Steinhatchee, a sparsely populated region west of Gainesville.\nAlmost all 250,000 Florida Power & Light customers who lost power had the air conditioning on within 36 hours."}, {"id": "4471f50b-3b07-457a-bc97-6f25af9ab704", "title": "Light earthquake , 4 . 3 mag strikes near Ollagüe in Chile", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-strikes-near-ollague-in-chile/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Friday, 28 km WSW of Ollagüe, Chile (17 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 145.4 km (90 miles) below the earth’s surface.\nIds that are associated to the earthquake: us7000n7bt.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 28 km WSW of Ollagüe, Chile."}, {"id": "e0ba2d9f-f1f2-4926-9430-6740cb9fc0b7", "title": "Light earthquake , 4 . 4 mag was detected near Palu in Indonesia", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-4-mag-was-detected-near-palu-in-indonesia-3/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 209 km NNE of Palu, Indonesia (130 miles) on Friday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent ids that are associated to the earthquake: us7000n7bx.\nId of event: us7000n7bx.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 209 km NNE of Palu, Indonesia."}, {"id": "d1e51225-2a06-4b7a-b032-d769f0648c36", "title": "Light earthquake , 4 . 3 mag was detected near Tokār in Sudan", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-was-detected-near-tokar-in-sudan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Saturday, 170 km ENE of Tokār, Sudan (106 miles).\nThe 4.3-magnitude earthquake was detected at 00:29:29 / 12:29 am (local time epicenter).\nAll ids that are associated to the event: us6000njmc.\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 170 km ENE of Tokār, Sudan."}, {"id": "9f275c78-5d63-42cb-9bc6-9629a5888a90", "title": "Light earthquake , 4 . 9 mag was detected near Kawalu in Indonesia", "date": "2024-08-16 07:30", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-9-mag-was-detected-near-kawalu-in-indonesia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.9 (ml/mb) was reported 223 km SSW of Kawalu, Indonesia (139 miles) on Friday.\nExact location of earthquake, longitude 107.7116 East, latitude -9.3421 South, depth = 10 km.\nThe earthquake was roughly at a depth of 10 km (6 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 223 km SSW of Kawalu, Indonesia."}, {"id": "fe3b875b-b15e-401a-8643-853ba448d5e3", "title": "Bermuda on hurricane alert | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-08-16 09:30", "url": "https://www.arkansasonline.com/news/2024/aug/16/bermuda-on-hurricane-alert/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico -- Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe storm was centered about 410 miles south-southwest of Bermuda late Thursday.\n\"All of the guidance show this system as a large hurricane near Bermuda,\" said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "4c41a696-c994-49fd-8596-59bf97b75ff4", "title": "Light earthquake , 4 . 3 mag has occurred near Levuka in Fiji", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-has-occurred-near-levuka-in-fiji-6/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Thursday, 86 kilometers (53 miles) from Levuka in Fiji.\nThe epicenter of the earthquake was roughly 585.865 km (364 miles) below the earth’s surface.\nIds that are associated to the earthquake: us7000n7aa.\nThe epicenter was 87 km (54 miles) from Levuka (c. 8 400 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 86 km NE of Levuka, Fiji."}, {"id": "ea113927-0aa8-40c8-ae78-710a76385458", "title": "Light earthquake , 4 . 5 mag has occurred near Sarangani in Philippines", "date": "2024-08-16 07:30", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-5-mag-has-occurred-near-sarangani-in-philippines-10/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) has struck on Friday, 55 kilometers (34 miles) from Sarangani in Philippines.\nDate and time of earthquake in UTC/GMT: 16/08/24 / 2024-08-16 05:48:28 / August 16, 2024 @ 5:48 am.\nId of earthquake: us7000n7d0.\nThe epicenter was 55 km (34 miles) from Sarangani (c. 7 500 pop), 94 km (58 miles) from Pangyan (c. 5 300 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 55 km SSE of Sarangani, Philippines."}, {"id": "3153669b-45b9-404a-a573-1a1759420101", "title": "Light earthquake , 4 . 9 mag strikes near Maumere in Indonesia", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-9-mag-strikes-near-maumere-in-indonesia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.9 (ml/mb) was reported 108 km NE of Maumere, Indonesia (67 miles) on Friday.\nThe epicenter of the earthquake was roughly 219.078 km (136 miles) below the earth’s surface.\nEvent ids that are associated to the earthquake: us7000n7bp.\nId of event: us7000n7bp.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 108 km NE of Maumere, Indonesia."}, {"id": "2b858056-22c9-4dae-91b7-c1c25b4180e8", "title": "Light earthquake : M4 . 4 quake has struck near Gunungsitoli in Indonesia", "date": "2024-08-16 07:30", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-m4-4-quake-has-struck-near-gunungsitoli-in-indonesia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Friday, 78 km SW of Gunungsitoli, Indonesia (48 miles).\nExact time and date of earthquake 16/08/24 / 2024-08-16 00:22:43 / August 16, 2024 @ 12:22 am UTC/GMT.\nThe epicenter was at a depth of 10 km (6 miles).\nThe 4.4-magnitude earthquake was detected at 00:22:43 / 12:22 am (local time epicenter).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 78 km SW of Gunungsitoli, Indonesia."}, {"id": "655dd4fb-e237-4261-98f8-42eba069b307", "title": "Light earthquake , 4 . 4 mag strikes near Tingo María in Peru", "date": "2024-08-16 07:30", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-4-mag-strikes-near-tingo-maria-in-peru/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Tuesday, 39 kilometers (24 miles) from Tingo María in Peru.\nIds that are associated to the earthquake: us6000ngzs.\nEpicenter of the earthquake was 40 km (25 miles) from Tingo María (c. 53 200 pop), 94 km (58 miles) from Uchiza (c. 17 700 pop).\nNearest cities/city/villages to epicentrum/hypocenter was Uchiza, Tingo María (min 5000 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 39 km NNE of Tingo María, Peru."}, {"id": "a8ec69b1-067d-4bbc-b97b-8826e715cdb9", "title": "Light earthquake 4 . 3 mag , central Mid - Atlantic Ridge", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-central-mid-atlantic-ridge-4/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Sunday, central Mid-Atlantic Ridge (0 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, longitude -31.4027 West, latitude 3.047 North, depth = 10 km.\nEvery year there are an estimated 13,000 light earthquakes in the world.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: central Mid-Atlantic Ridge."}, {"id": "8fe060c8-c461-409d-956f-76fb056b107f", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 06:30", "url": "https://www.eveningnews24.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "eveningnews24.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane."}, {"id": "1638b824-2e82-42a4-a7cc-72f1e55f0fa6", "title": "First round of storm debris pickup for Hurricane Beryl ends on August 31 – Houston Public Media", "date": "2024-08-16 01:45", "url": "https://www.houstonpublicmedia.org/articles/news/city-of-houston/2024/08/15/496810/first-round-of-storm-debris-pickup-ends-on-august-31/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "Michael Hagerty/Houston Public MediaThe first round of storm debris pickup for the City of Houston should be done by the end of this month.\nThe city has collected more than 2.1 million cubic yards of storm debris from Hurricane Beryl so far.\n“So if you have an abundance of shingles, or wo0den fencing, or tree debris, please keep the tree debris separate from the other miscellaneous items,” he said.\nBut residents can monitor the city’s progress with debris pick-up through a new storm debris collection map created last month.\nHowever, storm debris collection, we have to actually go around to each home individually.”"}, {"id": "edace48e-0435-4ad5-b72a-c016ee8b7c04", "title": "Warmer temperatures , scattered storms return this weekend", "date": "2024-08-16 22:15", "url": "https://wach.com/weather/skywach-weather-blog/warmer-temperatures-scattered-storms-return-this-weekend", "domain": "wach.com", "domain_classification": "Unknown", "message": "The weekend will feature warmer temperatures and higher humidity than we have been accustomed to these past few days.\nThe humid weather will combine with a passing cold front to spark storms throughout the weekend.\nLower humidity and sunny skies will return to the Midlands Monday and should stick around most of next week.\nThe storm is forecast to fall back to a Category 1 as it passes nearby Bermuda early Saturday.\nWhile the system remains well east of the U.S., high surf and a high risk for rip currents will persist up and down the east coast throughout the weekend."}, {"id": "dff7874e-fcf1-444b-a85d-889ef7662a63", "title": "Light earthquake , 4 . 1 mag has occurred near Murghob in Tajikistan", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-1-mag-has-occurred-near-murghob-in-tajikistan-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.1 (ml/mb) was detected on Saturday, 60 kilometers (37 miles) from Murghob in Tajikistan.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 144.372 km (90 miles) below the earth’s surface.\nThe epicenter was 60 km (37 miles) from Murghob (c. 10 800 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 60 km W of Murghob, Tajikistan."}, {"id": "072fa061-fe76-4820-95d0-897e9c3251a6", "title": "Ernesto grows into a Category 2 hurricane as it aims for Bermuda", "date": "2024-08-16 04:15", "url": "https://www.npr.org/2024/08/15/g-s1-17259/ernesto-grows-into-a-category-2-hurricane-as-it-aims-for-bermuda", "domain": "npr.org", "domain_classification": "International", "message": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for stormtoggle caption AP/National Oceanic and Atmospheric AdministrationSAN JUAN, Puerto Rico (AP) — Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean prepared to open shelters and close government offices.\nThe Category 2 storm located 180 miles (285 kilometers) south-southwest of Bermuda was packing maximum sustained winds of 100 mph (155 kph).\nTropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\n“Hurricane Ernesto seriously threatens our community,” he said.\nErnesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season."}, {"id": "d2c59a4e-2542-4107-8e80-21de80514f8b", "title": "Hundreds of thousands without power in Puerto Rico as Hurricane Ernesto aims for Bermuda", "date": "2024-08-16 02:00", "url": "https://www.lemonde.fr/en/international/article/2024/08/16/hundreds-of-thousands-without-power-in-puerto-rico-as-hurricane-ernesto-aims-for-bermuda_6716432_4.html", "domain": "lemonde.fr", "domain_classification": "Local - Europe", "message": "A power line pole leans against a house in the aftermath of Tropical Storm Ernesto in Fajardo, Puerto Rico August 14, 2024.\nRICARDO ARDUENGO / REUTERSHurricane Ernesto barreled toward Bermuda on Thursday, August 15, after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the US territory, raising concerns about people's health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\n\"All of the guidance show this system as a large hurricane near Bermuda,\" said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "b75d7f11-cc2e-4318-97a8-f84883e3c8d5", "title": "What impact will Hurricane Ernesto have on Western Massachusetts", "date": "2024-08-16 16:15", "url": "https://www.yahoo.com/news/impact-hurricane-ernesto-western-massachusetts-140652840.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(WWLP) – Hurricane Ernesto has made its way to Puerto Rico and the Virgin Islands.\nThe 22news Storm Team has a look at where Ernesto will go and if we could see any local impacts.\nHurricane Ernesto continues to move north and is expected to strengthen to a Category 3 hurricane with winds of 115 mph by Friday.\nErnesto will then impact the island of Bermuda this weekend before moving into the north Atlantic and staying offshore.\nBesides that, we look to have no impacts here in western Massachusetts."}, {"id": "fe14441e-18b9-4c2d-8991-bfcb95d4b745", "title": "Puente Hill Fault causes recent SoCal earthquakes", "date": "2024-08-16 01:30", "url": "https://www.10news.com/news/local-news/puente-hill-fault-causes-recent-socal-earthquakes", "domain": "10news.com", "domain_classification": "Unknown", "message": "Instead, it was the Puente Hills Fault, an entirely different area that may pose a larger earthquake risk.\nThe Puente Hills Fault stretches 25 miles, from downtown Los Angeles to Pasadena and northern Orange County.\n\"The site is a bad site geologically,\" said Dr. Abbott.\nIt's what falls on you or is thrown at you,\" said Dr. Abbott.\nDr. Abbott says one of the best places to start preparing your home is your bedroom."}, {"id": "37f7a16f-4371-4c1e-97be-b7126f0993df", "title": "  Very strong  Typhoon Ampil prompts storm warnings as it nears eastern Japan", "date": "2024-08-16 01:30", "url": "https://www.japantimes.co.jp/news/2024/08/16/japan/typhoon-ampil-severe-storm/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "Typhoon Ampil was moving past eastern Japan on Friday as a “very strong” storm, bringing heavy winds and torrential rain to a wide area.\nLevel 4 evacuation orders were issued in the Chiba Prefecture cities of Mobara and Asahi, as well as in the city of Iwaki, Fukushima Prefecture.\nLevel 3 advisories, encouraging the elderly and those with disabilities to evacuate, were issued in various cities in Tokyo, Chiba, Kanagawa, Ibaraki and Fukushima prefectures.\nOn the Sobu Rapid and Keiyo lines, trains running directly from Chiba Prefecture have been canceled.\nThe Shonan-Shinjuku Line is also facing severe disruptions, with services suspended all day between Odawara in Kanagawa Prefecture and Takasaki in Gunma Prefecture."}, {"id": "356771a6-abe2-4f8a-bbf2-2e405b390ffb", "title": "Light earthquake 4 . 2 mag , 25 km NW of Velasco Ibarra , Ecuador", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-2-mag-25-km-nw-of-velasco-ibarra-ecuador/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) strikes 25 kilometers (16 miles) from Velasco Ibarra in Ecuador on Wednesday.\nIds that are associated to the earthquake: us6000nk0c.\nThe earthquake was roughly at a depth of 60.344 km (37 miles).\nEarthquake epicenter was 76 km (47 miles) from Portoviejo (c. 170 300 pop), 41 km (25 miles) from Quevedo (c. 119 400 pop), 26 km (16 miles) from Velasco Ibarra (c. 48 800 pop), 74 km (46 miles) from Ventanas (c. 46 700 pop), 38 km (24 miles) from Chone (c. 44 800 pop), 56 km (35 miles) from Balzar (c. 40 100 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 25 km NW of Velasco Ibarra, Ecuador."}, {"id": "f3010f07-3f23-4afd-b2c0-c1844cbf2f57", "title": "Ernesto grows into category 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 11:00", "url": "https://abc13.com/post/ernesto-grows-category-2-hurricane-aims-bermuda-leaving-many-puerto-rico-power/15192271/", "domain": "abc13.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory prepares for the stormThere will be heavy swells all along the East Coast because of Hurricane Ernesto, which is churning out in the Atlantic.\nThere will be heavy swells all along the East Coast because of Hurricane Ernesto, which is churning out in the Atlantic.\nThere will be heavy swells all along the East Coast because of Hurricane Ernesto, which is churning out in the Atlantic.\nThere will be heavy swells all along the East Coast because of Hurricane Ernesto, which is churning out in the Atlantic.\nErnesto is the fifth named storm and the third hurricane of this year's Atlantic hurricane season."}, {"id": "53f1b6fc-4015-489e-b90c-23efece3797b", "title": "Ernesto grows into category 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 10:30", "url": "https://abc7chicago.com/post/ernesto-grows-category-2-hurricane-aims-bermuda-leaving-many-puerto-rico-power/15192271/", "domain": "abc7chicago.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory prepares for the stormThere will be heavy swells all along the East Coast because of Hurricane Ernesto, which is churning out in the Atlantic.\nThere will be heavy swells all along the East Coast because of Hurricane Ernesto, which is churning out in the Atlantic.\nThere will be heavy swells all along the East Coast because of Hurricane Ernesto, which is churning out in the Atlantic.\nThere will be heavy swells all along the East Coast because of Hurricane Ernesto, which is churning out in the Atlantic.\nErnesto is the fifth named storm and the third hurricane of this year's Atlantic hurricane season."}, {"id": "a10c131f-95ea-4bf4-a024-3c198fef2587", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 04:45", "url": "https://www.oxfordmail.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane."}, {"id": "3f6ce043-ce58-492a-963c-2c08831af5af", "title": "Ernesto grows into category 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 12:45", "url": "https://abc7.com/post/ernesto-grows-category-2-hurricane-aims-bermuda-leaving-many-puerto-rico-power/15192271/", "domain": "abc7.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory prepares for the stormThere will be heavy swells all along the East Coast because of Hurricane Ernesto, which is churning out in the Atlantic.\nThere will be heavy swells all along the East Coast because of Hurricane Ernesto, which is churning out in the Atlantic.\nThere will be heavy swells all along the East Coast because of Hurricane Ernesto, which is churning out in the Atlantic.\nThere will be heavy swells all along the East Coast because of Hurricane Ernesto, which is churning out in the Atlantic.\nErnesto is the fifth named storm and the third hurricane of this year's Atlantic hurricane season."}, {"id": "d36faec3-4a19-4ecc-9108-e9fd6eaffd85", "title": "Why Bermuda is among the most hurricane - resilient areas", "date": "2024-08-16 01:30", "url": "https://www.yahoo.com/news/why-bermuda-among-most-hurricane-224733048.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Since reliable data started to be kept by meteorologists in the 1800s, 90 cyclones have passed within 50 miles or less of Bermuda.\nDuring the early 20th century, Bermuda experienced a string of powerful hurricanes, which resulted in strict building standards.\nWaves hit te rocks in Church Bay, Bermuda, as Hurricane Fiona churned towards the Atlantic island as a powerful Category 4 storm on September 22, 2022.\n- Hurricane Fiona churned toward Bermuda as a powerful Category 4 storm on Wednesday as Puerto Rico struggled to restore power and water after receiving a crushing blow.\nOriginal article source: Why Bermuda is among the most hurricane-resilient areas"}, {"id": "79488e99-90fd-4c47-ada2-a52c4349dcc1", "title": "Ernesto grows into Cat 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 05:30", "url": "https://www.witn.com/2024/08/15/hurricane-ernesto-aims-bermuda-after-leaving-many-puerto-rico-without-power-or-water/", "domain": "witn.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nCrews have flown more than 540 miles (870 kilometers) across Puerto Rico and identified 400 power line failures, with 150 of them already fixed, said Juan Saca, president of Luma Energy, a private company that operates the transmission and distribution of power in Puerto Rico.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "871d1713-8985-4fec-b105-54e71769d03b", "title": "Ernesto grows into Category 2 hurricane as it aims for Bermuda - New Delhi Times - India Only International Newspaper", "date": "2024-08-16 15:15", "url": "https://www.newdelhitimes.com/ernesto-grows-into-category-2-hurricane-as-it-aims-for-bermuda/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nMore than 290,000 of 1.4 million customers remained in the dark Thursday evening, more than a day after Ernesto swiped past Puerto Rico late Tuesday as a tropical storm before strengthening into a hurricane.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "127f62b5-cd30-4fe2-ba98-0dd5dc6a6677", "title": "Light earthquake : M4 quake has struck near Yamada in Japan", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-m4-quake-has-struck-near-yamada-in-japan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4 (ml/mb) has occurred on Sunday, 148 km E of Yamada, Japan (92 miles).\nGlobal time and date of event 28/07/24 / 2024-07-28 21:49:11 / July 28, 2024 @ 9:49 pm UTC/GMT.\nThe epicenter was at a depth of 10 km (6 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 148 km E of Yamada, Japan."}, {"id": "e90734b6-31c5-46a4-963b-2ee318283188", "title": "Jasper residents return home after wildfire", "date": "2024-08-16 14:45", "url": "https://www.ctvnews.ca/photo-galleries/jasper-residents-return-home-after-wildfire-1.6977655", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "Now in its 56th year, Wildlife Photographer of the Year is the Natural History Museum's showcase for the world's best nature photography.\nWildlife Photographer of the Year exhibition is on at the Royal Ontario Museum, Toronto, from Nov. 21 to May."}, {"id": "d6d53265-deec-445b-8100-62d1a5fffc65", "title": "Ernesto grows into Cat 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 04:45", "url": "https://www.thespec.com/life/ernesto-grows-into-cat-2-hurricane-as-it-aims-for-bermuda-leaving-many-in-puerto/article_661ab1ee-cf02-5156-b85d-0104ee1a6236.html", "domain": "thespec.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "10f18110-3652-4b17-893a-c56beeb31701", "title": "Light earthquake , 4 . 5 mag has occurred near Khorugh in Tajikistan", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-5-mag-has-occurred-near-khorugh-in-tajikistan-5/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) has occurred on Friday, 38 kilometers (24 miles) from Khorugh in Tajikistan.\nThe earthquake was roughly at a depth of 108.155 km (67 miles).\nNearby country/countries that might be effected, Afghanistan (c. 29 121 000 pop), Tajikistan (c. 7 487 000 pop).\nIn the past 24 hours, there have been two, in the last 10 days five, in the past 30 days twelve and in the last 365 days fourty-six earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 38 km SSW of Khorugh, Tajikistan."}, {"id": "7c90d3d1-c9e9-4f12-9e9d-790bef82bd33", "title": "Light earthquake 4 . 3 mag , 5 km W of Cepitá , Colombia", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-5-km-w-of-cepita-colombia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Wednesday, 5 kilometers (3 miles) from Cepitá in Colombia.\nEvent ids that are associated to the earthquake: us6000njzx.\nId of event: us6000njzx.\nThe epicenter was 42 km (26 miles) from Bucaramanga (c. 571 800 pop), 34 km (21 miles) from Floridablanca (c. 252 300 pop), 38 km (23 miles) from Girón (c. 108 500 pop), 25 km (16 miles) from Piedecuesta (c. 86 400 pop), 80 km (50 miles) from Pamplona (c. 53 600 pop), 26 km (16 miles) from San Gil (c. 33 600 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 5 km W of Cepitá, Colombia."}, {"id": "e66b670a-4b7d-43d3-ae75-50a71c7f0763", "title": "Light earthquake , 4 . 4 mag strikes near Puerto El Triunfo in El Salvador", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-4-mag-strikes-near-puerto-el-triunfo-in-el-salvador-5/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Thursday, 27 kilometers (17 miles) from Puerto El Triunfo in El Salvador.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter was at a depth of 74.681 km (46 miles).\nClose country/countries, El Salvador (c. 6 052 000 pop) (That might be effected).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 27 km SSW of Puerto El Triunfo, El Salvador."}, {"id": "64b9beec-1319-4a29-a42c-aee28e3b6aee", "title": "Ernesto grows into Cat 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 04:15", "url": "https://www.wfmz.com/news/ernesto-grows-into-cat-2-hurricane-as-it-aims-for-bermuda-leaving-many-in-puerto/article_ed71d9ec-bca4-5a22-bc67-abd6eeed3d6f.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "Ernesto grows into Cat 2 hurricane as it aims for Bermuda, leaving many in Puerto Rico without powerHurricane Ernesto has strengthened into a Category 2 storm as it barrels toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water"}, {"id": "1eaf8503-59ae-4517-8302-91b57332ede5", "title": "Hurricane season : Long Islanders with pets advised to prepare for power outages , evacuations", "date": "2024-08-16 02:30", "url": "https://www.newsday.com/news/weather/hurricane-preparations-pets-dogs-cats-aqiamej1", "domain": "newsday.com", "domain_classification": "Unknown", "message": "As the Atlantic hurricane season nears its peak, officials are warning Long Islanders to be prepared for power outages and possible evacuations — and not to forget their pets.\n\"If we know the history of Long Island and the history of hurricane season, we know it’s coming.\nA Paws of War service dog attends a hurricane emergency preparedness event at the H. Lee Dennison building in Hauppauge on Thursday.\nCredit: Morgan CampbellNassau and Suffolk county officials have warned of needed preparations at the start of the hurricane season in June.\nThe storms so far have avoided Long Island, including Hurricane Ernesto, which has veered north into open waters in the Mid-Atlantic."}, {"id": "604dc88d-f793-46ed-bd30-32bec1de9621", "title": "Hurricane Ernesto impact on Puerto Rico and how those here in western Massachusetts can help", "date": "2024-08-16 04:00", "url": "https://www.yahoo.com/news/hurricane-ernesto-impact-puerto-rico-013711178.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto’s impact on Puerto Rico and how those here in western Massachusetts can helpMass.\n(WWLP) – Hurricane Ernesto is making its way towards Bermuda after its strong winds knocked out power to hundreds of thousands of people and dumped torrential rain on Puerto Rico.\n22News spoke to local officials who have family and loved ones in Puerto Rico about the impact this storm has had on the ground.\nMany here in western Massachusetts trying to get in contact with their loved ones who reside on the island of enchantment.\nLatest Local News HeadlinesWWLP-22News, an NBC affiliate, began broadcasting in March 1953 to provide local news, network, syndicated, and local programming to western Massachusetts."}, {"id": "361acb67-d3e7-4f07-bea7-e9162b181acf", "title": "Hurricane Ernesto Aims for Bermuda After Leaving Many in Puerto Rico Without Power or Water", "date": "2024-08-16 02:15", "url": "https://www.theepochtimes.com/world/hurricane-ernesto-aims-for-bermuda-after-leaving-many-in-puerto-rico-without-power-or-water-5706458", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico—Hurricane Ernesto barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nCrews have flown more than 540 miles (870 kilometers) across Puerto Rico and identified 400 power line failures, with 150 of them already fixed, said Juan Saca, president of Luma Energy, a private company that operates the transmission and distribution of power in Puerto Rico.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "1b3fde1c-7d26-471b-9121-a2dee558fdd3", "title": "Coconino County reports flood measures near Timberline are working", "date": "2024-08-16 21:45", "url": "https://www.knau.org/knau-and-arizona-news/2024-08-16/coconino-county-reports-flood-measures-near-timberline-are-working", "domain": "knau.org", "domain_classification": "Unknown", "message": "Coconino County officials say flood mitigation measures put in place north of Flagstaff after the devastating 2022 wildfire season are working.\nThis week, County crews pumped flooded waters out of a detention basin along Copeland Avenue near Timberline.\nFlood District Administrator Lucinda Andreani says they finished work on new storm drains and channels in the area in July.\nThat system, and work they've done in the forest above Copeland Avenue, has cost more than $20 million.\nAndreani says they hope to complete the work before next year’s monsoon season."}, {"id": "aa83fee6-68fb-4f27-a80d-10d35107675b", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:00", "url": "https://komonews.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "komonews.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "235811b2-dcce-4a14-9960-003c7e96dcbf", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 06:30", "url": "https://www.wcti12.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "4ffd2464-f89e-4aae-9c12-9d543dff39ab", "title": "Ernesto grows into Cat 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 04:30", "url": "https://www.smdailyjournal.com/news/world/ernesto-grows-into-cat-2-hurricane-as-it-aims-for-bermuda-leaving-many-in-puerto/article_aa47e929-975b-51d5-934b-d8180a318c98.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "e94d5f34-acec-4cc4-9215-912c5da3c071", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 08:00", "url": "https://wset.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "wset.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "8552fb0f-1876-4e42-9ab7-0a6d83599197", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 08:00", "url": "https://wjla.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "wjla.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "bae9f368-3dac-4fe5-8610-4085b25cd717", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:15", "url": "https://wlos.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "wlos.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "0fa458a9-5cba-4587-9725-b6d6cea1de75", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 05:00", "url": "https://13wham.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "13wham.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "225211be-98f7-443c-8508-9228d63e2d37", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:45", "url": "https://wwmt.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "72cf7779-941b-465c-bcf1-81e97c2fb919", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 06:45", "url": "https://abc6onyourside.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "abc6onyourside.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "c4f19f1f-1b9b-4b8a-94e7-7b453ea7022c", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 06:15", "url": "https://wsbt.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "wsbt.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "df278f0f-a4dc-42f6-8b3a-8ceb7895e3d6", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 06:30", "url": "https://kfdm.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "kfdm.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "d718458c-6f51-4323-9ec3-7d9b88947ae1", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 08:00", "url": "https://ktul.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "ktul.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "6b1d5e26-9a11-42c1-b1b2-37c2e8f63f98", "title": "Vermont flood recovery effort prompts questions about how to adapt to climate change", "date": "2024-08-16 12:45", "url": "https://www.bostonglobe.com/2024/08/16/science/flood-recovery-vermont-infrastructure-managed-retreat-climate-adaptation/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "It was the start of yet another flood recovery effort in rural Vermont, a state that’s been pummeled by flood after flood in the last two years, including two last month.\nAdvertisementJames Bengston dug up his rakes under dried mud in his garage at his home after a July storm caused flash flooding in St. Johnsbury.\nKayla Bartkowski For The Boston GlobeOmar Johnson (left) and Carl Edwards carried a filing cabinet out of Lynda Brill’s garage in St. Johnsbury.\nSome St. Johnsbury residents colloquially call the Beryl event “Flood One.” Just three weeks later, “Flood Two” arrived.\n“It’s very expensive.”In St. Johnsbury, the town manager knows that as well as anyone."}, {"id": "ad4eade5-371e-48fa-97df-239e19ab6901", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:30", "url": "https://foxbaltimore.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "foxbaltimore.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "f03066a8-b464-4039-a411-d487a59c18e8", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:15", "url": "https://news3lv.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "news3lv.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "ae263786-83a9-475f-bd75-56bf006b997e", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 06:45", "url": "https://fox11online.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "e47ad3fc-0351-4d9b-a923-cfb932df7e73", "title": "FEMA Opens Debby Recovery Center In Manatee County", "date": "2024-08-16 23:15", "url": "https://mykiss951.iheart.com/content/2024-08-16-fema-opens-debby-recovery-center-in-manatee-county/", "domain": "mykiss951.iheart.com", "domain_classification": "Unknown", "message": "LAKEWOOD RANCH --FEMA is opening a disaster recovery center in Manatee County to help survivors of flooding from Hurricane Debby.\nThe center is open Saturday afternoon from 1-7 pm and daily from 9 am to 7 pm starting Sunday.\nIt's at the Lakewood Ranch Library, where FEMA specialists will offer support with filling out applications and updating status, while volunteers will offer other recovery services.\nDebby made landfall in North Florida but it brought record amounts of rainfall to Manatee and Sarasota counties, with damage estimated at around $100 million.\nPhoto: Getty Images"}, {"id": "cd95b0ea-0e4f-4c59-9603-4e97d13f0c81", "title": "MA air quality : Smoky skies over Boston through Saturday – NECN", "date": "2024-08-16 21:00", "url": "https://www.necn.com/weather/stories-weather/wildfire-smoke-forecast-massachusetts/3311559/", "domain": "necn.com", "domain_classification": "Unknown", "message": "Wildfire smoke continues to sit in the sky above New England.\nThey will continue to be muted, with an orange tint to the sun, through at least Saturday.\nWith the smoke getting so thick, our air quality is \"unhealthy\" Friday and Saturday.\nMeteorologist Chase Cain explains how that’s allowing wildfires to burn more land much earlier in wildfire season.\nOther than the hazy sun, we stay mainly dry, with highs in the 80s inland, 70s at the coast due to an east breeze."}, {"id": "8bcb2db8-a884-45b7-90de-f735da698216", "title": "Ernesto grows into a Category 2 hurricane as it aims for Bermuda", "date": "2024-08-16 12:45", "url": "https://www.nhpr.org/2024-08-15/ernesto-grows-into-a-category-2-hurricane-as-it-aims-for-bermuda", "domain": "nhpr.org", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean prepared to open shelters and close government offices.\nTropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\n“Hurricane Ernesto seriously threatens our community,” he said.\nErnesto's destructive pathAlejandro Granadillo / AP / AP The La Plata River floods a road Wednesday after Tropical Storm Ernesto passed through Toa Baja, Puerto Rico.\nErnesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season."}, {"id": "ca3caf2c-7d16-47c6-b70f-da24d469e064", "title": "Hurricane scorecard so far this season", "date": "2024-08-16 21:15", "url": "https://www.news4jax.com/weather/2024/08/16/hurricane-scorecard-so-far-this-season/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Hurricane marks the third and only hurricane not to hit the United States thus far this season.\nJACKSONVILLE, Fla. – The Atlantic hurricane season is expected to heat up just as we move from August to September.\nThe peak season begins around Sept. 10, when hurricane development conditions become even more favorable.\nRunning scorecard through August 16, 2024 for Atlantic hurricane basin.\nSo far, Hurricanes Beryl and Debby have hit the United States, while a third hurricane may impact Bermuda."}, {"id": "524f28e6-f711-41e6-89ef-1b25a206a279", "title": "Ernesto grows into a Category 2 hurricane as it aims for Bermuda", "date": "2024-08-16 06:15", "url": "https://www.capeandislands.org/2024-08-15/ernesto-grows-into-a-category-2-hurricane-as-it-aims-for-bermuda", "domain": "capeandislands.org", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Hurricane Ernesto charged toward Bermuda on Friday as officials in the tiny British territory in the middle of the Atlantic Ocean prepared to open shelters and close government offices.\nTropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\n“Hurricane Ernesto seriously threatens our community,” he said.\nErnesto's destructive pathAlejandro Granadillo / AP / AP The La Plata River floods a road Wednesday after Tropical Storm Ernesto passed through Toa Baja, Puerto Rico.\nErnesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season."}, {"id": "bb840cb9-d936-48a1-97ba-5fdb59834303", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:45", "url": "https://fox17.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "fox17.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "159f4225-b732-4518-b704-19622a22f722", "title": "Pizza owner gives back to neighborhood dealing with flooding after heavy rain from Tropical Storm Debby", "date": "2024-08-16 04:15", "url": "https://www.yahoo.com/news/pizza-owner-gives-back-neighborhood-024241978.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Pizza shop owner gives back to neighborhood dealing with flooding after heavy rain from Tropical Storm DebbyCHARLESTON COUNTY, S.C. (WCBD) — Over a week after Tropical Storm Debby made a second landfall in the Lowcountry many communities are still dealing with the flooding effects.\nOne local restaurant owner was looking for a way to give back after the storm.\nMike Pitera, owner of Pizza a Modo Mio, used his culinary skills to help out those hit hardest by Edisto River flooding.\n“There’s a lot of people who can’t get out their houses are underwater their driveways are underwater,” said Melissa Mitchum.\nIf you’d like to show Mike some support — you can visit Pizza a Modo Mio on Bees Ferry Road."}, {"id": "32e393c6-1856-40d9-8171-b02116520f24", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 06:45", "url": "https://kval.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "kval.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "dbef50fe-2506-4dc0-80ac-455184cb4dc8", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:00", "url": "https://khqa.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "khqa.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "d68de1b8-879a-4f56-b5e8-22e085b2e119", "title": "Rainforest Caribbean , NCB , JSE partner on support for fisheries sector", "date": "2024-08-16 07:45", "url": "https://jamaica-gleaner.com/article/news/20240816/rainforest-caribbean-ncb-jse-partner-support-fisheries-sector", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "The hurricane-ravaged fisheries sector has received well-needed support from a coalition partnership of Rainforest Caribbean, National Commercial Bank (NCB) and the Jamaica Social Stock Exchange.\nRainforest, the region’s leading seafood supplier, donated $5 million, which was matched by NCB’s Building a Better Jamaica Fund in a collective effort to rebuild the sector in the aftermath of Hurricane Beryl.\nA release noted that the companies handed over the $10 million donation to the Ministry of Agriculture, Fisheries and Mining at the annual Denbigh Agricultural Show in Clarendon on August 6.\nRainforest Caribbean is the region’s trailblazing seafood supplier, distributor and manufacturer with its headquarters in Jamaica and locations in St Lucia, Barbados, Belize and St Vincent and the Grenadines.\nNCB’s Building a Better Jamaica Fund was launched by National Commercial Bank Jamaica Limited in response to the devastating impact of Hurricane Beryl and is being managed by the NCB Foundation."}, {"id": "5fdc7587-9bb0-4800-91d2-d6efcb0205e1", "title": "FIRST ALERT TROPICS - Hurricane Ernesto now a Cat 2 storm", "date": "2024-08-16 06:30", "url": "https://www.wistv.com/2024/08/15/first-alert-tropics-hurricane-ernesto-headed-towards-bermuda/", "domain": "wistv.com", "domain_classification": "Unknown", "message": "COLUMBIA, S.C. (WIS) - As of Friday afternoon, Ernesto remains to a Category 2 Hurricane, with maximum sustained winds of 100 MPH.\nwis (wis)As Hurricane Ernesto moves northward today, it will continue to remain around a similar level of strength in the short-term.\nThis weekend, Ernesto will make a close pass by Bermuda, packing a punch of heavy rain and gusty winds to the island.\nwis (wis)For the East Coast, the only impact from Ernesto will be rough seas that will lead to some dangerous rip currents.\nwis (wis)Feel more informed, prepared, and connected with WIS. For more free content like this, subscribe to our email newsletter, and download our apps."}, {"id": "dff9a812-9c00-4568-b784-d81f752c0f91", "title": "Opinion | Check fine print on insurance for quakes", "date": "2024-08-16 00:00", "url": "https://www.scmp.com/opinion/comment/article/3274670/check-fine-print-insurance-quakes", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Photo: Jonathan WongAll this has prompted reflection on consumer protection in these circumstances under travel insurance policies.\nAccording to a memo issued by the federation, most policies bought after the quake will not cover any related incidents.\nInsurance consumers are not renowned for studying policy conditions in fine print that define their insurance cover.\nSo Lau’s advice to check any doubts about coverage with insurers before departing, and to buy any insurance as soon as a trip is confirmed, seems sensible.\nIf insurance is needed for peace of mind, some of that research should focus on the best value cover for money."}, {"id": "6ac30d79-9ece-429b-a328-62a94b231b83", "title": "Ernesto grows into Category 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 04:30", "url": "https://www.bostonglobe.com/2024/08/15/world/ernesto-grows-into-cat-2-hurricane-it-aims-bermuda-leaving-many-puerto-rico-without-power/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island Saturday.\nSAN JUAN, Puerto Rico (AP) — Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nCrews have flown more than 540 miles (870 kilometers) across Puerto Rico and identified 400 power line failures, with 150 of them already fixed, said Juan Saca, president of Luma Energy, a private company that operates the transmission and distribution of power in Puerto Rico.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "3d018342-944e-405d-8a95-17d81f82cf34", "title": "Ernesto grows into Cat 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 03:45", "url": "https://www.ajc.com/news/nation-world/ernesto-grows-into-cat-2-hurricane-as-it-aims-for-bermuda-leaving-many-in-puerto-rico-without-power/ZJEZCFTBE5F7HC3Y477GYLVVG4/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "ada1ffa4-b43d-470c-8de6-ea7284a02c31", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:30", "url": "https://cnycentral.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "cnycentral.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "d50cc3a5-b776-4ce7-9787-2ff3b08df96b", "title": "Earthquake - ravaged Antakya is being rebuilt to withstand any natural disaster", "date": "2024-08-16 11:30", "url": "https://edition.cnn.com/style/antakya-turkey-earthquake-architecture-c2e-spc/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —The earthquake itself could be measured in seconds, but for the people of Antakya, Turkey, the reverberations were scarcely quantifiable.\nWith swathes of buildings along the banks of the Asi, flooding has also long posed a danger to Antakya residents.\nAn artist's rendering of a revitalized Antakya, with the river at its heart.\nimageBROKER/Shutterstock Nairobi, the Kenyan capital, also known as \"the Green City in the Sun,\" is 34% spongy and ranked second out of the seven cities.\nWe use the term sustainability, but sometimes we need to give a meaning to it.”Yet despite its worldwide scope, the plan was primarily written for, and partly by, the people of Antakya, Scaranaro insisted."}, {"id": "1f39bcdc-36ef-4ce7-824e-54c4fdca35ff", "title": "Earthquake - ravaged Antakya is being rebuilt to withstand any natural disaster", "date": "2024-08-16 09:30", "url": "https://www.cnn.com/style/antakya-turkey-earthquake-architecture-c2e-spc/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —The earthquake itself could be measured in seconds, but for the people of Antakya, Turkey, the reverberations were scarcely quantifiable.\nWith swathes of buildings along the banks of the Asi, flooding has also long posed a danger to Antakya residents.\nAn artist's rendering of a revitalized Antakya, with the river at its heart.\nimageBROKER/Shutterstock Nairobi, the Kenyan capital, also known as \"the Green City in the Sun,\" is 34% spongy and ranked second out of the seven cities.\nWe use the term sustainability, but sometimes we need to give a meaning to it.”Yet despite its worldwide scope, the plan was primarily written for, and partly by, the people of Antakya, Scaranaro insisted."}, {"id": "9f862aa7-194f-426c-8bca-36f475e6a2fa", "title": "Forsyth Farmer Market hosts fundraiser for vendors impacted by Debby", "date": "2024-08-16 15:30", "url": "https://www.yahoo.com/news/forsyth-farmers-market-hosts-fundraiser-131737159.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SAVANNAH, Ga. (WSAV) – The Forsyth Farmers’ Market is stepping up to help some of their vendors who were impacted by Tropical Storm Debby.\nTheir “Roots in Recovery” fundraiser aims to help repair damages, replace lost crops and ensure vendors can continue their vital work.\n“These are the same farmers who have tirelessly brought nutritious produce to our community, rain or shine, season after season,” the fundraising page reads.\n“Now, they need our help to recover and rebuild.”WSAV News 3, iHeart Media and Parker’s Kitchen raise money for victims of Tropical Storm DebbyTo contribute to the fundraiser, visit here.\nThe market is held each Saturday from 9 a.m. to 1 p.m. in Savannah’s Forsyth Park."}, {"id": "844d0403-5884-4733-9f0e-440224496733", "title": "Hurricane Debby exposes vulnerabilities for neighbors in Perry", "date": "2024-08-16 16:15", "url": "https://www.wtxl.com/northwest-tallahassee/hurricane-debby-exposes-vulnerabilities-for-neighbors-in-perry-as-they-recover-from-2-hurricanes-in-11-months", "domain": "wtxl.com", "domain_classification": "Unknown", "message": "Hurricane Debby exposes additional vulnerabilities for neighbors in Taylor County who say they cannot afford basic necessities and building repairs.\nBROADCAST TRANSCRIPT:More people struggling to afford groceries and make ends meet since Hurricane Debby.\nDamage from Hurricane Idalia and then Debby has caused major water damage.\nMonique Ellsworth, CEO of Second Harvest of the Big Bend, said over 20% of their post Debby distribution has gone to Taylor County.\nHowever, Ellsworth said there is also an air of relief in Taylor County that damage was minimal."}, {"id": "f3481a97-5d6c-4107-b58b-25012a8d21c2", "title": "Hurricane Debby Forces New York Officials To Close Many Beaches", "date": "2024-08-16 10:30", "url": "https://cnynews.com/ixp/854/p/hurricane-debbys-forces-new-york-officials-to-close-many-beaches/", "domain": "cnynews.com", "domain_classification": "Unknown", "message": "The remnants of Hurricane Debby hit the Hudson Valley very hard heavy rain, wind, flooding and even a tornado.\nBeaches In Westchester County CloseGold Coast Beaches Closed Following Fatal Shark Attack At Greenmount Beach Getty Images loading...\nFor all the news that the Hudson Valley is sharing make sure to follow Hudson Valley Post on Facebook, download the Hudson Valley Post MobileToo Much Bacteria In Mamaroneck, New Rochelle BeachesGoogle Google loading...\nSad News: These 11 Popular Food Items Are Gone From New York State StoresKeep Reading:The Five Most Snake Infested Lakes In New York StateBelow are the five most snake-infested lakes in New York State.\nThe Five Most Snake Infested Lakes In New York State World Atlas helped Hudson Valley Post determine the most snake infested waters in New York State."}, {"id": "9dad21d6-27da-440b-8cae-1cbcc467743d", "title": "White Oak Bayou Project to solve I - 10 flooding , trucks hitting Houston Avenue bridge by elevating freeway , TxDOT says", "date": "2024-08-16 04:45", "url": "https://abc13.com/post/houston-avenue-bridge-truck-hits-txdot-white-oak-bayou-project-flooding/15190696/", "domain": "abc13.com", "domain_classification": "Unknown", "message": "TxDOT has plan that will also solve I-10 floodingTxDOT is starting work on the White Oak Bayou Project, which should solve flooding on the I-10 and keep trucks from hitting the Houston Avenue bridge.\nTxDOT is starting work on the White Oak Bayou Project, which should solve flooding on the I-10 and keep trucks from hitting the Houston Avenue bridge.\nTxDOT is starting work on the White Oak Bayou Project, which should solve flooding on the I-10 and keep trucks from hitting the Houston Avenue bridge.\nTxDOT is starting work on the White Oak Bayou Project, which should solve flooding on the I-10 and keep trucks from hitting the Houston Avenue bridge.\nHOUSTON, Texas (KTRK) -- The Houston Avenue bridge over Interstate 10 near downtown Houston is a hot spot for 18-wheeler wrecks, but changes are coming."}, {"id": "507d217a-594c-4105-b9fa-972ef27925b6", "title": "The Bahamas and climate change", "date": "2024-08-16 12:45", "url": "https://www.thenassauguardian.com/opinion/the-bahamas-and-climate-change/article_1aca107c-5b4c-11ef-a304-ef25ff55c770.html", "domain": "thenassauguardian.com", "domain_classification": "Unknown", "message": "You have permission to edit this article."}, {"id": "bffee990-f60a-487b-9fa8-730214ef542d", "title": "Greece fires : Photos show how close Athens wildfires came to burning whole towns", "date": "2024-08-16 11:30", "url": "https://edition.cnn.com/2024/08/16/climate/greece-wildfires-athens-photos-climate-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "Varnavas, a town near where the wildfires started, is ringed by scorched land.\nPléiades Neo/AirbusVothonas, a village close to Varnavas, is similarly encircled by black, ashy landscape, almost entirely torched by the wildfire.\nVothonas, Greece is completely encircled by landscape blanketed in black ash after fires ripped through the region this week.\nThe Athens suburb of Vrilissia, just a few miles from the center of the city, was badly affected by the wildfires.\nBrutal, rolling heat waves have dried out the land, creating ideal conditions for fires to rip through."}, {"id": "24eb22db-2eea-47ce-93fa-4017d3d7c360", "title": "Greece fires : Photos show how close Athens wildfires came to burning whole towns", "date": "2024-08-16 11:15", "url": "https://www.cnn.com/2024/08/16/climate/greece-wildfires-athens-photos-climate-intl/", "domain": "cnn.com", "domain_classification": "International", "message": "Varnavas, a town near where the wildfires started, is ringed by scorched land.\nPléiades Neo/AirbusVothonas, a village close to Varnavas, is similarly encircled by black, ashy landscape, almost entirely torched by the wildfire.\nVothonas, Greece is completely encircled by landscape blanketed in black ash after fires ripped through the region this week.\nThe Athens suburb of Vrilissia, just a few miles from the center of the city, was badly affected by the wildfires.\nBrutal, rolling heat waves have dried out the land, creating ideal conditions for fires to rip through."}, {"id": "b73fc252-a604-4efd-a5e7-e4c0a15062d1", "title": "Nonprofit launches program aimed to help owners find lost pets after a storm hits", "date": "2024-08-16 22:45", "url": "https://www.local10.com/news/local/2024/08/16/nonprofit-launches-program-aimed-to-help-owners-find-lost-pets-after-a-storm-hits/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Many pet owners choose not to evacuate before a storm because they don’t know what shelters or hotels accept animals.\nThen, tens of thousands of pets go missing during the destruction of tropical storms and hurricanes.\n“We see so many situations where people are separated from their pets,” said Kimberly Bentley with the Global Empowerment Mission.\nFlew the Coop and Fido Alert have joined forces to build a database of pets and their owners well before an emergency is upon us.\nRegistered pet owners will also receive text alerts on their phone about impending storm details and safety tips along with information about which local shelters and hotels across Florida are pet friendly."}, {"id": "ebee299b-fd0b-429b-b091-388d6a59c9fa", "title": "Thursday PM Forecast : tropical moisture keeps scattered storms for another afternoon", "date": "2024-08-16 01:15", "url": "https://www.wbrz.com/news/thursday-pm-forecast-tropical-moisture-keeps-scattered-storms-for-another-afternoon", "domain": "wbrz.com", "domain_classification": "Unknown", "message": "Thursday PM Forecast: tropical moisture keeps scattered storms for another afternoonTropical moisture has pushed into the region causing an uptick in the number of showers and thunderstorms.\nOn Monday, a weak front will push through the Metro Area causing a minor dip in humidity and low temperatures as well.\nWe will also be able to get low temperatures back to average in the low 70s.\nYour weather updates can be found on News 2, wbrz.com, and the WBRZ WX App on your Apple or Android device.\nFollow WBRZ Weather on Facebook and Twitter for even more weather updates while you are on the go."}, {"id": "ac87daa5-414d-4609-a570-947d9948ba29", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 13:00", "url": "https://www.ktsa.com/hurricane-ernesto-barrels-toward-bermuda-as-wealthy-british-territory-preps-for-storm/", "domain": "ktsa.com", "domain_classification": "Unknown", "message": "Tropical storm conditions including strong winds and life-threatening floods were expected to start affecting Bermuda on Friday afternoon, according to the National Hurricane Center.\nIn preparation for the storm, officials in the wealthy British territory announced they would suspend public transportation and close the airport by Friday night.\nErnesto previously battered the northeast Caribbean, where it left hundreds of thousands of people without power and water in Puerto Rico after swiping past the U.S. territory as a tropical storm.\nCabrera said he was relying for relief only “on the wind that comes in from the street.”Ernesto is the fifth named storm and the third hurricane of this year’s Atlantic hurricane season.\nThe National Oceanic and Atmospheric Administration has predicted an above-average Atlantic hurricane season this year because of record warm ocean temperatures."}, {"id": "3956a28f-6643-48be-a80e-ecfab903fb99", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 15:30", "url": "https://dailytimes.com/news_ap/hurricane-ernesto-barrels-toward-bermuda-as-wealthy-british-territory-preps-for-storm/article_dcca20bc-7a26-5edd-beb3-946c6a12571d.html", "domain": "dailytimes.com", "domain_classification": "Unknown", "message": "Thank you for reading!\nTo read this article and more, subscribe now for as little as $1.99."}, {"id": "9070e5ad-580a-44d5-b96a-71bc218dc145", "title": "Vermont flooding : Examining what behind all the heavy rain", "date": "2024-08-16 14:45", "url": "https://www.bostonglobe.com/2024/08/16/metro/vermont-flooding-rain-climate-change/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "But what’s driving such extreme and sudden flooding in Vermont from a meteorological perspective?\nThe rain doesn’t let upThe average annual precipitation across Vermont has been increasing at alarming rates, with the northern regions of New England accelerating faster than the south.\n“Vermont watersheds are particularly small and steep and that makes them more prone to flooding,” Winter said.\nAdvertisementSurface storm systems have a tendency to produce the strongest storms closest to wherever the jet stream is positioned overhead.\nRecently, the jet stream has been positioned by nearby Vermont, making the area more susceptible to frequent and intense storms."}, {"id": "77b80767-95fb-42f2-91e6-f87d48f9a4f7", "title": "Hochul Declares State Of Emergency For All Of NY , Sends Water Rescue Teams", "date": "2024-08-16 04:15", "url": "https://dailyvoice.com/new-york/whiteplains/debbys-remnants-arrive-hochul-declares-state-of-emergency-in-ny-sends-water-rescue-teams/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "The declaration came on Friday, Aug. 9 after Debby's remnants arrived in New York, bringing severe flooding and gusty winds to much of the state as it moves northeast.\nIn addition to flooding, the storm system's arrival has also prompted tornado watches for parts of the Hudson Valley and Capital Region.\nHochul's declaration covers the entire state.\nAgencies are also preparing to support heavily impacted regions with resources as needed, officials said.\nThe remnants are expected to continue through Friday night before precipitation gradually stops on Saturday morning, Aug. 10."}, {"id": "6deed26a-b28c-40f4-8628-6d0fc17bfc40", "title": "Kano , Lagos Lead as States Receive N39 . 6bn Ecological Funds in One Year – THISDAYLIVE", "date": "2024-08-16 06:15", "url": "https://www.thisdaylive.com/index.php/2024/08/16/kano-lagos-lead-as-states-receive-n39-6bn-ecological-funds-in-one-year/", "domain": "thisdaylive.com", "domain_classification": "Unknown", "message": "The fund’s disbursement process is managed by the Ecological Fund Office, under the Office of the Secretary to the Government of the Federation (SGF).\nBorno State, which is dealing with environmental damage linked to the insurgency, received N1.68 billion (averaging N140million per month), the second-highest allocation.\nOther top recipients of the ecological fund include Lagos with N1.81 billion (averaging N150.83million per month), Kaduna with N1.4 billion (averaging N124.17million per month), and Sokoto with N1.49 billion (averaging N124.17million per month).\nEdo received N632.8million (averaging N52.73million per month), and Abia received N633.68million (averaging N52.81million per month).\nEnugu received N1.36 billion (averaging N113.33million per month) for its ecological interventions."}, {"id": "b2702140-dd17-4354-9048-6cf7962739e1", "title": "Hot Friday but will rain impact weekend plans ? ", "date": "2024-08-16 04:15", "url": "https://www.yahoo.com/news/hot-friday-rain-impact-weekend-015154821.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SYRACUSE, NY (WSYR-TV) – We’ve had a nice and much needed stretch of dry weather this week.\nEnjoy the hazy sun before some rain moves in for the weekend.\nThere should be dry weather with sunshine along with the warmth Friday.\nWeather goes downhill for the weekendUnfortunately, the weather will not stay as nice for the weekend.\nMost areas in CNY should see 1-2” or less of rain for the entire weekend."}, {"id": "8be2dc65-2c65-462b-8de0-11518792e81b", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 16:15", "url": "https://www.telegraphherald.com/news/national_world/article_a124c382-5bc5-11ef-9116-cb0cc751763a.html", "domain": "telegraphherald.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "f1220012-49d0-41f7-8557-9dbffe0c4cb8", "title": "Severe typhoon Ampil approaching Japan disrupts flights , trains", "date": "2024-08-16 03:00", "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2024/08/16/severe-typhoon-ampil-approaching-japan-disrupts-flights-trains", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "TOKYO: Typhoon Ampil edged closer to Japan’s main island of Honshu on Friday (Aug 16), forcing major Japanese airlines to cancel flights and the government to issue a warning against possible landslides and flooding.\nJapan Airlines and All Nippon Airways cancelled some 90 international flights, impacting more than 15,000 passengers.\nThe latest typhoon, categorised as a severe tropical storm, will be at its closest around midday on Aug 16, according to weather forecasters.\nKorean Air Lines said 12 of its flights between Japan and South Korea will be suspended on Aug 16 and 17.\nCathay Pacific Airways said that its Japan flights are currently operating normally, adding that it is “closely monitoring the potential impact of severe tropical storm Ampil”."}, {"id": "91904921-9c8b-4db2-ae41-5e56f15bc85a", "title": "Japan braces as powerful Typhoon strengthens", "date": "2024-08-16 11:30", "url": "https://www.cbc.bb/news/international-news/japan-braces-as-powerful-typhoon-strengthens/", "domain": "cbc.bb", "domain_classification": "Unknown", "message": "By Jessie Yeung, Taylor Ward and Robert Shackelford, CNN(CNN) — Hundreds of thousands of people are being advised to evacuate in parts of Japan, with some homes losing power on Friday, as Typhoon Ampil approaches the east coast near the capital.\nAmpil has rapidly intensified over the past two days, partly because it moved over very warm water – meaning more moisture in the air to fuel the typhoon.\nIt could strengthen further in the next 12 hours, with the storm reaching peak intensity as it passes by Japan.\nThe storm’s center is expected to remain slightly offshore as it turns toward the northeast and moves away from Japan, according to the JTWC and Japan’s Meteorological Agency.\nIf it stays offshore and only brushes the coast, it might only have a light impact on Japan, bringing rain and wind to some areas including Tokyo."}, {"id": "0bad7bd8-de0b-4f1a-9a15-a2cf3fb45bf1", "title": "The Shaky Ground Below Istanbul Is Getting People Worried", "date": "2024-08-16 05:00", "url": "https://www.yahoo.com/news/shaky-ground-below-istanbul-getting-040022399.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "QNB Finansbank said it was also backing up its HQ teams in Ankara, while ensuring that all branches and bank buildings are earthquake-resistant.\nRecords show that in the summer of 1509, a strong earthquake struck Istanbul shortly after the Ottomans took the city.\nEarthquake preparedness is the most urgent priority for Istanbul, he said in the city last week, and that includes retrofitting buildings.\nAround 40,000 buildings could suffer “heavy damage” in the next Istanbul earthquake, according to the Kandilli Institute.\n“Let’s face it, today it is very difficult to say that either Turkey or Istanbul is ready for the ‘Great Istanbul Earthquake’ expected by the scientific world,” said Bahcivan, the chamber of industry chief."}, {"id": "5d898acc-e61c-4e62-a6b8-010252138beb", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 08:00", "url": "https://news4sanantonio.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "news4sanantonio.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "3cbc49ce-c1a3-4d7e-8f94-601373fd1c92", "title": "Hurricane Ernesto barrels toward Bermuda as wealthy British territory preps for storm", "date": "2024-08-16 23:30", "url": "https://www.whittierdailynews.com/2024/08/16/hurricane-ernesto-barrels-toward-bermuda-as-wealthy-british-territory-preps-for-storm/", "domain": "whittierdailynews.com", "domain_classification": "Unknown", "message": "Tropical storm conditions — including strong winds and life-threatening floods — began on Friday and are expected to continue through Saturday night, according to the National Hurricane Center.\nLa Plata river overflows onto a road after Tropical Storm Ernesto passed through Toa Baja, Puerto Rico, Wednesday, Aug. 14, 2024.\n(AP Photo/Alejandro Granadillo)La Plata river floods a road after Tropical Storm Ernesto passed through Toa Baja, Puerto Rico, Wednesday, Aug. 14, 2024.\n(AP Photo/Alejandro Granadillo)La Plata river floods a road after Tropical Storm Ernesto passed through Toa Baja, Puerto Rico, Wednesday, Aug. 14, 2024.\n(AP Photo/Alberto Bartolomei)A man fishes after Tropical Storm Ernesto passed through Rio Grande, Puerto Rico, Wednesday, Aug. 14, 2024."}, {"id": "313bb418-9126-41b4-86f8-746f710fc11e", "title": "East Coast beaches to experience high rip current risk from Hurricane Ernesto : reports", "date": "2024-08-16 04:00", "url": "https://www.pennlive.com/weather/2024/08/east-coast-beaches-to-experience-high-rip-current-risk-from-hurricane-ernesto-reports.html", "domain": "pennlive.com", "domain_classification": "Unknown", "message": "“Beachgoers should be aware of a significant risk of life-threatening surf and rip currents, and stay out of the water if advised by lifeguards.”What is a rip current?\nIf you are caught in a rip current, do not fight it.\nNew Jersey, Long Island and New England should see dangerous rip current conditions by Saturday, which will persist into early next week, the Washington Post said.\n“Several beautiful beach days are coming up, but don’t be deceived!” The Weather Service office in Morehead City, North Carolina, told the Washington Post.\nHurricane Ernesto is not expected to make landfall in the United States but might reach parts of Canada, the Washington Post Said."}, {"id": "554e4630-f86d-477c-8595-eee6e60a52ed", "title": "Burlington stormwater projects support ongoing efforts", "date": "2024-08-16 14:00", "url": "https://www.thespec.com/news/burlington-stormwater-projects-support-ongoing-efforts-to-improve-infrastructure-city/article_4bb35153-5cda-5d29-8ca8-cf53cdb2804e.html", "domain": "thespec.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "ba49dbe0-9ce5-4b0c-ac5b-faa8a6e3e2ec", "title": "Typhoon Ampil nears Tokyo , trains suspended", "date": "2024-08-16 04:30", "url": "https://www.marketscreener.com/news/latest/Typhoon-Ampil-nears-Tokyo-trains-suspended-47667752/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "STORY: :: Heavy rain pours on Tokyo and bullet trains halt as Typhoon Ampil approaches:: August 16, 2024:: Tokyo, JapanThe typhoon that is categorised as a very strong storm by the Japan Meteorological Agency (JMA) is moving 110 kilometres (68 miles) northeast of Hachijojima Island in the Pacific Ocean moving north at 20 kilometres per hour.\nCentral Japan Railway cancelled all 'Shinkansen' bullet train services between Tokyo and Japan's industrial heartland of Nagoya on Friday.\nHeavy rain and strong wind is expected throughout the day in Chiba Prefecture and areas in Northeastern Japan.\nJMA officials have advised local residents to stay home and be cautious for high tides, flooding and swollen rivers."}, {"id": "e6598e29-5ec9-49ae-b79e-a51840792306", "title": "Weekend showers and storms likely", "date": "2024-08-16 01:00", "url": "https://www.walb.com/2024/08/16/weekend-showers-storms-likely/", "domain": "walb.com", "domain_classification": "Unknown", "message": "Thursday afternoon a few passing showers slid across areas along the GA/FL line otherwise rain-free.\nEnjoy the nice change before it slides out heading into the weekend.\nFor the weekend hot mid-upper 90s as a weak front drops into the region.\nMoisture increases with showers and storms likely and higher humidity.\nMornings pretty nice with lows upper 60s around 70° while highs top mid-upper 90s with tons of sunshine."}, {"id": "14f11278-620c-47ae-be1c-90ac22f67c04", "title": "Everyday Heroes : Those who rescued residents amid Tropical Storm Debby flooding", "date": "2024-08-16 23:30", "url": "https://www.yahoo.com/news/everyday-heroes-those-rescued-residents-204151151.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "DORCHESTER COUNTY, S.C. (WCBD) – It has been just over a week since Tropical Storm Debby drenched the Lowcountry.\n“It’s a house I waited 35 years for, and now I won’t have it no more,” said Dorothy Beach, whose property in Dorchester County was flooded after the storm moved through.\nBeach, her husband Ralph, and their pets were rescued on Saturday from their home in the Twin Lakes community along the Ashley River.\n“Since 2015 we made sure got certain vehicles, we got a water rescue team.\nSummerville Fire and Rescue works closely with Dorchester County and North Charleston."}, {"id": "f54a5125-a372-43cb-896f-f493a960b7ea", "title": "Severe thunderstorm hits Attleboro area , cutting power to a few hundred homes , businesses", "date": "2024-08-16 01:30", "url": "https://www.thesunchronicle.com/news/local_news/severe-thunderstorm-hits-attleboro-area-cutting-power-to-a-few-hundred-homes-businesses/article_5e0b54cc-5b60-11ef-86a4-9b933736b6e6.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "×remaining ofThank you for reading!\nOn your next view you will be asked to log in to your subscriber account or create an account and subscribepurchase a subscription to continue reading."}, {"id": "fea28d3c-a21c-42b8-922d-176c22ae2ce3", "title": "First Alert : Tracking heat , humidity , rain & storms this weekend", "date": "2024-08-16 14:00", "url": "https://www.wsfa.com/2024/08/16/first-alert-tracking-heat-humidity-rain-storms-this-weekend/", "domain": "wsfa.com", "domain_classification": "Unknown", "message": "A few lucky spots will get a quick splash of afternoon or evening rain… but those will be the exception rather than the rule.\nWe do expect a higher coverage of scattered showers and storms for the weekend, so we want to give you a FIRST ALERT that a few of those Saturday and Sunday storms could produce spotty areas of wind damage.\nWatch the latest live and local weather data below, streaming on WSFA Weather Now!\nPlease note, this stream does not include live severe weather coverage, only data on the latest weather conditions.\nScattered showers and storms this weekend, then a big drop in humidity next workweek!"}, {"id": "be0ca680-97dc-4c5c-89dd-dcb56264f7a0", "title": "Sunny and smoky skies in CT before rain this weekend , NWS says", "date": "2024-08-16 14:00", "url": "http://www.nhregister.com/weather/article/ct-weather-friday-weekend-forecast-air-quality-19660152.php", "domain": "nhregister.com", "domain_classification": "Unknown", "message": "Connecticut weather: A man rides a bicycle though Seaside Park on a sunny summer afternoon in Bridgeport, Conn. Aug. 15, 2024.\nSo far this week, Connecticut air quality has been \"moderate,\" meaning most people should find the air acceptable, with the exception of those who are especially sensitive to air pollution.\nAir quality sensors throughout the state recorded yellow, or moderate, air quality again on Friday, and the state Department of Energy and Environmental Protection also was predicting moderate air quality for the day.\nThe weather system could bring locally heavy rainfall and \"nuisance flooding,\" the weather service said.\nThe weather system could bring \"locally heavy downpours that could lead to nuisance flooding at times,\" the weather service said."}, {"id": "bea85d41-28a2-48ce-b04f-7fea8143fe18", "title": "Bangkok Post - Severe typhoon approaching Japan disrupts flights , trains", "date": "2024-08-16 04:45", "url": "https://www.bangkokpost.com/world/2848288/severe-typhoon-approaching-japan-disrupts-flights-trains", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "Severe typhoon approaching Japan disrupts flights, trainsWaves crash amid Typhoon Ampil, in Hachijo, Tokyo Prefecture, Japan on Friday, in this screen grab obtained from a social media video.\nJapan Airlines Co and All Nippon Airways Co cancelled some 90 international flights, impacting more than 15,000 passengers.\nThe latest typhoon, categorised as a severe tropical storm, will be at its closest around midday Friday, according to weather forecasters.\n“I am stuck.”Lingering effects from the tropical storm are seen lasting through Saturday.\nKorean Air Lines Co said 12 of its flights between Japan and South Korea will be suspended on Friday and Saturday."}, {"id": "78141a08-6b8c-454a-8d0a-2de1970ebfbf", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 06:45", "url": "https://www.timesandstar.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "timesandstar.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane."}, {"id": "9f197c7e-74d5-4d44-8eb1-8a7c13170a45", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 06:30", "url": "https://www.gazetteandherald.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "gazetteandherald.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane."}, {"id": "affea1ce-66df-45f3-8001-6b82776d09ce", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 06:30", "url": "https://www.harwichandmanningtreestandard.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "harwichandmanningtreestandard.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane."}]