[{"id": "adcce0f2-4c63-4345-8f1a-59811271bc12", "title": "Joshua Leifer cancellation provoked pro - Israel glee on Internet – The Forward", "date": "2024-08-27 11:00", "url": "https://forward.com/opinion/648156/joshua-leifer-andy-bachman-pro-israel-internet/", "domain": "forward.com", "domain_classification": "Unknown", "message": "The decision prompted a deluge of serves-you-rights, I-told-you-sos and jokes-on-yous from Leifer’s fellow Jews who object to his criticisms of Israel.\nNumerous people posted screenshots of a tweet Leifer wrote five years ago saying, “Boycotts, divestments and sanctions are peaceful strategies of resistance to oppression.”“Care to revisit your priors?” tweeted one poster.\nBut most of Leifer’s fellow Jews piled on with glee.\nThe three pillars that upheld a vibrant American Jewish life — Americanism, liberalism and Zionism — have cracked, according to Leifer.\nIt’s the message Vice President Kamala Harris delivered during her acceptance speech for the Democratic nomination for President — to thunderous applause — and it’s the message courageous Israelis and Palestinians want us American Jews to share."}, {"id": "2631d845-9d73-4d61-8128-db8498efbca2", "title": "Spike in sales for author whose talk canceled over Israel – The Forward", "date": "2024-08-27 11:00", "url": "https://forward.com/fast-forward/648201/joshua-leifer-book-event-brooklyn-israel-tablets-shattered/", "domain": "forward.com", "domain_classification": "Unknown", "message": "By Beth Harpaz August 27, 2024A Jewish author whose book launch was canceled because of a conflict over a pro-Israel moderator got a sellout crowd at a rescheduled event.\n“Someone asked me what should happen to the person who decided not to do the event,” author Joshua Leifer told the audience Monday.\n1 and 2 in several themed categories on Amazon for days after the cancellation of the original Aug. 20 event.\nIn contrast, only about two dozen had turned out for the original talk at the Powerhouse Arena bookstore, also in Brooklyn.\nRelated opinion What I learned when a Brooklyn bookstore canceled a discussion of Judaism over my ZionismCorrection: The venue for Monday’s talk was Congregation Beth Elohim’s Union Temple House."}, {"id": "f9912b60-c3d7-404f-8532-c2ebd7e85994", "title": "Otzma Yehudit Scores Win in Battle with Enraged UTJ & Leftists over Temple Mount | The Jewish Press - JewishPress . com | David Israel | 23 Av 5784 – Tuesday , August 27 , 2024", "date": "2024-08-27 10:45", "url": "https://www.jewishpress.com/news/israel/temple-mount-har-habayit/otzma-yehudit-scores-win-in-battle-with-enraged-utj-leftists-over-temple-mount/2024/08/27/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Earlier on Monday, National Security Minister and Otzma Yehudit Chairman Itamar Ben Gvir was channeling the late Rabbi Goren when he told Army Radio he was looking into establishing a synagogue on the Temple Mount.\nLet there be a synagogue for Jews and a mosque for Muslims in the spirit of religious freedom.\nThe Haredi establishment, including both Ashkenazi parties in UTJ and the Sephardim in Shas, is panicking – not at Ben Gvir’s supposed desecration of the Temple Mount, and not at his “pyromania” as they put it in Tuesday’s front page ad.\nOn Monday night, Heritage Minister Eliyahu spoke at an event in Mikve Israel, an agricultural school founded in 1870.\nA small group of dedicated anarchists kept screaming the war cry, “Busha, busha, busha” (Shame, shame, shame), unwilling to hear him."}, {"id": "f79cd468-d4ff-4039-b9b9-fcdf62a38de5", "title": "Salena Zito : An Anatomy of a Harris Campaign Stop Shows There Is No  There  There", "date": "2024-08-27 12:00", "url": "https://patriotpost.us/opinion/109712-an-anatomy-of-a-harris-campaign-stop-shows-there-is-no-there-there-2024-08-27", "domain": "patriotpost.us", "domain_classification": "Unknown", "message": "Many Harris supporters expressed disappointment in not being able to find a way to see her when she was in Beaver County.\nPITTSBURGH — Billed as a Pittsburgh kickoff bus tour on the eve of the Democratic National Convention, Democrat presidential candidate Kamala Harris and running mate Minnesota Gov.\nTim Walz instead spent Aug. 18 in Beaver County in tightly controlled stops before heading to Chicago.\nMany Harris supporters expressed disappointment in not being able to find a way to see her when she was in Beaver County.\nWith third-party candidates on the ballot, it’s 47% Trump, 47% Harris."}, {"id": "a3ac4538-b9f3-407e-851b-5887f090cddd", "title": "", "date": "2024-08-27 07:00", "url": "https://www.israelnationalnews.com/news/395227", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Recently, an Iranian official warned that if Israel struck at their nuclear sites, they could reconsider their official stance on the development of nuclear weapons and potentially target Israeli nuclear facilities.\nAn attack by Iran inside Israel’s borders would constitute an existential crisis for Israel that can only be met with maximum force.\nIt’s up to Iran to keep its militias, missiles, and proxies outside Israel proper or suffer the consequences.\nIn April, 350 rockets were fired at Israel by Iran and its allies in Iraq, Syria, Yemen and Lebanon.\nPound Hezbollah to the Litani, create a security zone within Lebanese territory, and remain with a long-term victory."}]