[{"id": "78cecaca-5c2b-4cb7-a55d-c759a91a9c86", "title": "Columbia University alumnus donates $260 million to Israeli university", "date": "2024-06-04 01:45", "url": "https://www.dailymail.co.uk/news/article-13491191/Columbia-University-alumnus-donates-260-million-Israeli-university.html", "message": "A Columbia grad who was 'active in World War II' has donated $260 million to Israel's Bar-Ilan University.\nBoth gifts were made in the face of fierce pro-Palestine processions that have surfaced across the US over the past several months.\nA Columbia grad who was 'active in World War II' has donated $260 million to Israel's Bar-Ilan University.\nIt’s just the beginning,' added political Hank Sheinkopf, offering the insight to the famously pro Israel New York Post.\n'Dear university students in the United States of America, you are standing on the right side of history.'"}, {"id": "741c3a9d-4077-432e-ac21-391ecbaa65e1", "title": "Anti - Palestinian discrimination investigation opens at UNC following complaint", "date": "2024-06-04 03:45", "url": "https://www.dailytarheel.com/article/2024/06/university-title-vi-investigation-anti-palestinian-discrimination", "message": "Khalili wrote that this email failed to acknowledge Israel's violence against Palestinians and address Islamophobia or Palestinians by name, while it did address antisemitism and Israel.\nA counter protester, UNC religious studies professor, began shouting “Nazis” at the protestors supporting Palestine and was escorted away by UNC Police.\nKhalili wrote that while the incident was reported to UNC’s Equal Opportunity and Compliance Office, all complaints were dismissed.\nSUBSCRIBE NOWProposed remediesWithin the complaint, Khalili called for the OCR to review and establish ongoing monitoring of the actions UNC takes in response to complaints of discrimination against Palestinian students.\nAn investigation into the discrimination of Jewish students at the University is also currently being conducted by the OCR."}, {"id": "a2b6c12c-d1e5-448d-ad8b-5a3c60030d41", "title": "Community rallies for A . S . divestment resolution with market and march", "date": "2024-06-04 04:15", "url": "https://dailynexus.com/2024-06-03/community-rallies-for-a-s-divestment-resolution-with-market-and-march/", "message": "The efforts preluded a vote within the Associated Student Senate on a divestment resolution, rallying campus support for the University to cut ties to military contractors.\n“The People’s Market for Gaza” took place from 4-5 p.m. at People’s Park in Isla Vista with roughly 50 attendees.\nFrom People’s Park, organizers lead a procession of roughly 100 people toward the front of Embarcadero Hall.\nProtestors chanted at the guests, “Students, students we won’t rest, until UCSB Divests,” before continuing to Loma Pelona Center for the Senate meeting.\nEvent organizers gave instructions to event participants to sign up for public comment for the Senate meeting that night where senators would vote on a divestment resolution."}]