[{"id": "92e2c772-ec49-4e2f-bc88-123e3c283c90", "title": "Zelensky and Other Top Ukrainian Leaders Narrowly Avoid Russian Assassination Attempt", "date": "2024-05-08 01:15", "url": "https://redstate.com/streiff/2024/05/07/zelensky-and-other-top-ukrainian-leaders-narrowly-avoid-russian-assassination-attempt-n2173898", "message": "Ukrainian Security Service operatives broke up a Russian plot Tuesday to assassinate President Volodymyr Zelensky and other senior political and military figures.\nAccording to the Wall Street Journal, this operation was tied to Russian President Vladimir Putin's inauguration and, I think, Thursday's Victory Day shindig:Malyuk said the plot was supposed to be a “gift” for Russian President Vladimir Putin ahead of his Tuesday inauguration for another six-year term.\nPolish authorities arrested a man this spring, whom they named only as Pawel K, in what they called a Russian plot to attack the Ukrainian president.\nThe F.S.B.’s network of agents in Ukraine was tasked with observing and passing on information about General Budanov’s whereabouts, the Ukrainian security services said.\nIt underscores the problem of senior Ukrainian officers having trained in Soviet military academies and developed friendships there."}, {"id": "6e6f28d3-4e96-46ed-9ae6-6830adee6238", "title": "Turkish drone strikes leave 23 civilians dead in Somalia", "date": "2024-05-08 14:30", "url": "https://www.garoweonline.com/en/news/somalia/turkish-drone-strikes-leave-23-civilians-dead-in-somalia", "message": "Turkish drone strikes leave 23 civilians dead in SomaliaMOGADISHU, Somalia - At least 23 civilians have been killed by suspected Turkish drones in Somalia, the Amnesty International has reported, calling for immediate investigations into what it terms as 'crimes against humanity', which meet the threshold of war crimes.\nAnd now, Amnesty International wants the governments of Somalia and Turkey to immediately investigate the incident, according to Tigere Chagutah, Amnesty International’s Regional Director for East and Southern Africa.\n“In Somalia, civilians have borne the brunt of suffering in war far too often.\nMultiple sources told Amnesty International that Al-Shabaab fighters were present in Bagdad during clashes on 18 March.\nThe government of Somalia has also signed a defence deal with Turkey, which expressly gives Ankara authority to oversee Somalia's waters."}, {"id": "a4c9122f-b0fe-4190-9db8-cb808e1a9013", "title": "Global Terror Threat Has Skyrocketed Due to Oct . 7 Hamas Attack , Gaza War , Experts Warn", "date": "2024-05-08 00:45", "url": "https://www.algemeiner.com/2024/05/07/global-terror-threat-has-skyrocketed-due-oct-7-hamas-attack-gaza-war-experts-warn/", "message": "The threat of terrorist attacks in the West has escalated in the wake of the Hamas terror group’s Oct. 7 massacre across southern Israel and amid the ensuing war in Gaza, according to experts who spoke with The Algemeiner.\nTerrorist groups are using Israel’s war against Hamas to encourage more attacks against the US, Guillot argued.\nExperts also noted the threat posed by Iran, which the US government has consistently deemed the world’s foremost state sponsor of terrorism.\n“The ongoing and primary terrorist threat is from the Iranian regime and its proxies,” said Marshall Wittman, a spokesperson for the American Israel Public Affairs Committee (AIPAC).\nMost of the outrages occurred after Oct. 7, during the ensuing Israel-Hamas war in Gaza."}, {"id": "3bc235d6-a70a-4c4a-b5a7-87ebbfd5b90a", "title": "Ukraine War , Day 805 : Russia Plot to Assassinate Zelenskiy", "date": "2024-05-08 09:30", "url": "https://eaworldview.com/2024/05/ukraine-russia-plot-to-assassinate-zelenskiy/", "message": "On Remembrance and Victory over Nazism in World War II Day, Nazi Putin launched a massive missile attack on Ukraine.\nFirst responders dealing with the aftermath of a Russian attack on the Kyiv region:shows rescuers eliminating the consequences of Russia's night missile attack in Kyiv Oblast.\nLocal officials reported the Russian attack on 8 May injured 2 people in Kyiv Oblast and, an 8-year-old child in Kirovograd Oblast.\nLast month Polish and Ukrainian prosecutors announced the detention of a man suspected of aiding a Russian scheme to kill Zelenskiy.\nIn August 2023, the SBU said a woman had been arrested for trying to uncover details of Zelenskiy’s movements outside Kyiv."}, {"id": "f676f4b0-ef6e-4450-adf6-29af342b3522", "title": "Ukraine war briefing :  Rocket , drone , rocket  – alleged plots to kill Zelenskiy , Budanov | Ukraine", "date": "2024-05-08 01:30", "url": "https://www.theguardian.com/world/article/2024/may/08/ukraine-war-briefing-rocket-drone-rocket-alleged-plots-to-kill-zelenskiy-budanov", "message": "Two Ukrainian security officials have been detained over an alleged Russian assassination plot against Volodymyr Zelenskiy, Ukraine’s president.\nThe SBU named three FSB intelligence officers behind the operation as Maxim Mishustin, Dmytro Perlin and Aleksii Kornev.\nIn intercepted messages, Perlin referred to the missile attack on Budanov as a “big bird” and the drone as a “small bird”.\nUkrainian prosecutors say they have examined debris from 21 of around 50 North Korean ballistic missiles launched by Russia between late December and late February.\nRomania’s president, Klaus Iohannis, has said he is open to discussing sending a Patriot system to Ukraine after German appeals to EU and Nato member states."}, {"id": "f2aeae0f-f76d-47ef-81a5-705c0847b56a", "title": "Al Jazeera : Israel airstrike kills at least 7 in Gaza City", "date": "2024-05-08 10:00", "url": "https://news.am/eng/news/822054.html", "message": "Nikol Pashinyan, Vladimir Putin hold private conversationThe meeting of Nikol Pashinyan and Vladimir Putin is in processMFA: Armenia will not participate in funding CSTO activitiesSupreme Eurasian Economic Council anniversary session underway in MoscowRussia’s Putin congratulates Armenia, Azerbaijan leadersIAEA chief dissatisfied with level of Iran’s cooperationAzerbaijan, Israel MFAs hold consultationsNo border delimitation carried out in Armenia’s Kirants village WednesdayEAFJD calls for action to protect historic Armenian Quarter in JerusalemBig demonstration against law on ‘foreign agents’ planned in Georgia capital Tbilisi SaturdayDollar rises, euro falls in ArmeniaEcuador police seize more than 1.5 tons of cocaineAzerbaijan, Bulgaria to strengthen strategic partnershipVictory over Nazism is marked at France embassy in ArmeniaNATO summit to be held on July 9-11 in Washington\"Amio Era\".\nEducation is a chance to change life!\nDer Spiegel: New attacks on politicians occur in GermanyNumber of elderly suffering from dementia in Japan could reach 5.8 million by 2040MFA: Russia welcomes Armenia, Azerbaijan FMs' upcoming meetingRussia presidential spox comments on possible termination of Armenia membership in EAEUArmenia’s Pashinyan arrives in Russia (PHOTOS)Armenia grants refugee status to Belarus nationalSerbia new FM optimistic about prospects of cooperation with ArmeniaRussia, Armenia leaders’ Moscow meeting today is necessary, expected for both sides, Kremlin saysAl Jazeera: Israel airstrike kills at least 7 in Gaza CityInternational center for money laundering, terrorist funding risk assessment to be established in ArmeniaArmenia Investigative Committee: Serviceman's body found with fatal gunshot wound to chinUcom’s high-speed fixed network is now accessible to Artashat residents.\n163,970 tourists visit Armenia in AprilArmenia premier heads to Russia on working visitResearchers discover ‘neural compass’ in human brainRare Lamborghini Jalpa is up for auctionSpain bullfighting company plans to give free tickets to young childrenNewspaper: Armenia soldier who died yesterday committed suicide, according to initial theoryPM lists what national values of people of Armenia areAncient Roman legionary fortress ruins found near UK cathedralRA MoD: Body of a contract soldier with a gunshot wound was found at a guard postEarthquake registered in the border zone of Armenia and AzerbaijanTurkey reacts to Israel's ground invasion of RafahBild: man on trial in Germany for stealing Pope Benedict XVI's crossAgreement on status of EU monitoring mission in Armenia enters into forcePashinyan: Armenia constitution is country’s internal matterPashinyan: I attended Erdogan's inauguration because I received invitation, but I didn’t get one from PutinDemonstrations in support of \"Tavush for the Homeland\" movement will be held in European cities on 12 MayXi Jinping promised never to forget NATO bombing of Chinese embassy in BelgradeIRGC commander: Iran expands battlefront to defeat enemyReuters: Israeli delegation to travel to Cairo for preliminary talks with HamasArmenia’s Pashinyan: I agree with idea of signing peace treaty by NovemberPashinyan: Russia TV will not be broadcast in Armenia if its demands are ignoredPashinyan: Armenian Apostolic Church’s top leadership has failed its spiritual guidanceArmenia PM: I don't think I need to attend May 9 military parade in Moscow every yearArmenia territory size will not change after 1 year, premier assuresNovember 9, 2020 statement does not imply that Russia FSB forces shall be on the ground, says Armenia's PashinyanNikol Pashinyan: Armenia, its people have overcome the outpost social psychologyArmenia PM: Is someone going to do something illegal that the topic of brute force is being brought up?\nArmenia premier: 3 of 12 border points at Kirants village section are most sensitive“By Your Side”: IDBank's new support program for displaced Artsakh citizensArmenia’s Pashinyan on scheduled meeting with Russia’s Putin: There are many accumulated problemsArmenia PM: War will start if we stop border delimitationArmenia’s Pashinyan: We started border delimitation from Tavush Province to create security guaranteeArmenia premier on 1988 border delimitation: That package has not been legally enforcedArmenia-Azerbaijan border delimitation being carried out according to latest USSR maps, Nikol Pashinyan saysPashinyan: Border posts being installed in Tavush Province are pillars of Armenia's security guaranteesArmenia’s Pashinyan shows slides where Mount Aragats is in backgroundArmenia PM holding news conference in YerevanThe Wall Street Journal: US delays sending precision weapons to IsraelFerrari unveils its new flagship, without electric engineChina specialists create UAV that flies to drowning person, transforms into lifebuoyBusiness Refinancing Special Offer from Byblos Bank ArmeniaIsrael army tanks enter Gaza’s Rafah city, media reportNewspaper: March coming from Kirants village to Yerevan causes"}, {"id": "e913844d-d0fe-45d6-9e42-4b13de159859", "title": "Artificial Intelligence Is Telling Israel Who To Bomb . Here How", "date": "2024-05-08 13:15", "url": "https://digg.com/digg-vids/link/israel-idf-ai-artificial-intelligence-video", "message": "gospel and lavender Artificial Intelligence Is Telling Israel Who To Bomb.\nHere's How Darcy JimenezIsrael has been using AI in warfare for years, but now, something new is happening: the technology is generating bombing targets in Gaza in a war that has so far killed more than 35,000 Palestinians.\n14 hours ago · · ·"}, {"id": "0bd5841c-83f6-4c38-bb96-0bb7f117bd8b", "title": "Rajnath Singh slams Charanjit Singh Channi over remarks on Poonch terror attack", "date": "2024-05-08 16:15", "url": "https://www.thehindu.com/elections/lok-sabha/rajnath-singh-slams-charanjit-singh-channi-over-remarks-on-poonch-terror-attack/article68153296.ece", "message": "Taking strong exceptions to the remarks of former Punjab Chief Minister Charanjit Singh Channi on the recent terrorist attack in Poonch, Defence Minister Rajnath Singh on Wednesday accused the Congress of politicising armed forces.\nAddressing public rally in Bhawanipatna, district headquarter town of in Odisha’s Kalahandi district, Mr. Singh said, “Congress has always resorted to politics of negativity.\nMr. Channi termed it as election stunt.\nDoes it mean we orchestrated terrorist attack on our army?”“What do these people want to do with national security and country’s swabhiman [pride]?\nBut, displaying courage and valour, our jawans neutralised two terrorists immediately,” Mr. Singh said."}, {"id": "2b628c3f-4b0f-43b0-b440-1ae682bfb252", "title": "Six terrorists killed in separate KP operations : ISPR - Pakistan", "date": "2024-05-08 18:45", "url": "https://www.brecorder.com/news/40302451/six-terrorists-killed-in-separate-kp-operations-ispr", "message": "Security forces in Khyber Pakhtunkhwa (KP) killed six terrorists in two separate operations on Wednesday, the military’s media wing reported.\nAccording to Inter-Services Public Relations Pakistan (ISPR), an intelligence-based operation was conducted in Dera Ismail Khan in response to reports of terrorist activity.\nIn another encounter in North Waziristan, troops effectively engaged the terrorists’ location as a result of which one more terrorist was killed.\nThe ISPR statement said that the killed terrorists were actively involved in various other terrorist acts in the region that targeted innocent civilians as well as security forces.\nLast week, security forces killed six terrorists in an intelligence-based operation in North Waziristan District."}, {"id": "86b813af-d6f7-48f8-ae5f-75d097505faf", "title": "Australia : Police shoot dead 16 - year - old accused of extremist stabbing", "date": "2024-05-08 07:00", "url": "https://www.wsws.org/en/articles/2024/05/08/zdli-m08.html", "message": "Police who attended claim that when they arrived the boy refused to put down the knife, instead running towards them.\nBlanch proclaimed that the stabbing “certainly has all the hallmarks” of being a terrorism-related incident.\nThere has been no explanation as to why a purported terror attack would be staged in a quiet suburban carpark.\nDetails about the victim of the stabbing have not been made public, but it appears likely the unfortunate target was chosen at random.\nOn April 22, a 16-year-old boy stabbed an Assyrian bishop at a Church in the southwestern Sydney suburb of Wakeley."}, {"id": "c17b4df5-6b6e-4c5c-bfab-a01cbd1df1e8", "title": "Unpacking the criticism of Israel Iran policy - The Jerusalem Post", "date": "2024-05-08 15:30", "url": "https://www.jpost.com/middle-east/iran-news/going-in-circles-critics-of-israels-policy-on-iran-have-dangerous-logic-analysis-800449", "message": "It is far from clear that this move provided safety for Israel in any direct attacks from Iran in the future.\nThe S-300 missile system is seen during the National Army Day parade ceremony in Tehran, Iran, April 17, 2024.\nThe critics then urged Israel not to attack Iran back to avoid a spiraling conflict.\nMost importantly, to avoid a regional war, they urged Israel not to target Iran’s nuclear weapons program.\nIf Iran were to stop threatening Israel simply, Jerusalem would not order any strikes on Iran because there would be no cause to do so."}, {"id": "477c5328-a0f4-46fd-8b81-ac64cd33707d", "title": "US halts bomb shipments to Israel amid concerns of full - scale Rafah invasion as Biden rift with Netanyahu deepens", "date": "2024-05-08 06:15", "url": "https://www.dailymail.co.uk/news/article-13394521/US-halts-bomb-shipments-Israel-amid-concerns-scale-Rafah-invasion-Bidens-rift-Netanyahu-escalates.html", "message": "The US paused a shipment of bombs to Israel last week over concerns that Israel was approaching a decision on launching a full-scale assault on the southern Gaza city of Rafah.\nThe U.S. has historically provided enormous amounts of military aid for Israel.\nA decision against Israel would further add to pressure on Biden to curb the flow of weapons and money to Israel´s military.\nThe package included more than $14 billion in military aid for Israel, though the stalled transfer was not related to that measure.\nIsrael, by contrast, has used the bomb frequently in the seven-month Gaza war."}, {"id": "00c96d97-e94f-48c3-9705-242601c6cda0", "title": "Rajnath Singh tears into Channi over remarks on Poonch terror attack", "date": "2024-05-08 11:15", "url": "https://www.prokerala.com/news/articles/a1529340.html", "message": "Bhubaneswar, May 8 : Defence Minister Rajnath Singh on Wednesday took a dig at former Punjab chief minister Charanjit Singh Channi over his controversial remarks on the recent terrorist attack on Indian Air Force (IAF) convoy at Poonch in Jammu and Kashmir leading to the death of one IAF soldier.\nAddressing a public gathering at Bhawanipatna in Kalahandi on Wednesday, Singh said, \"Congress has always been involved in negative politics.\nRecently, some terrorists launched an attack on our defence forces convoy in Jammu & Kashmir.\nCongress leader Charanjit Singhji Channi said that it (the terrorist act) was an election stunt.\nNotably, Congress leader Charanjit Singh Channi had earlier remarked that the terrorist attack on the Indian Air Force was a BJP-operated pre-poll stunt."}, {"id": "bf5edd16-eaff-4247-ba19-97a768970438", "title": "Conservative Principles , Political Reality , and the War on Terrorism", "date": "2024-05-08 05:00", "url": "https://www.heritage.org/homeland-security/report/conservative-principles-political-reality-and-the-war-terrorism", "message": "And when the Taliban government there refused, the United States and its allies attacked.\nExplained in military terms, this was one campaign in the global war on terrorism.\nThis is essentially the position in which the United States found itself with Iraq.\nRemember that the head of the United Nations Disarmament Organization would have been Saddam Hussein's Iraq, and the head of the United Nations Commission on Human Rights is Libya.\nI doubt very much that, left to their own devices, our military war planners would have opted for the force configuration and flow that they used."}, {"id": "67c1565b-84c1-430d-954b-a9b5b39ce1d1", "title": "A new plot to assassinate Ukraine president has come to light", "date": "2024-05-08 03:15", "url": "https://www.kasu.org/politics/2024-05-07/a-new-plot-to-assassinate-ukraines-president-has-come-to-light", "message": "But Ukraine's domestic intelligence agency says, this time, the plot was much more sophisticated.\nKAKISSIS: Ukraine's domestic intelligence agency also posted a video of an unnamed suspect - a gray-haired man in a gray parka.\nThe spokesman, Dekhtiarenko, says the Russians also planned to kill the heads of both the military and the domestic intelligence agencies.\nKAKISSIS: The Russian officer says, \"if you complete the task, you will have at least $50,000.\"\nHe called it a terrorist attack that was supposed to be a gift to Russian President Vladimir Putin for his inauguration on Tuesday."}, {"id": "1ec0ca75-d85f-4f56-adb1-687ce2eaf249", "title": "A new plot to assassinate Ukraine president has come to light", "date": "2024-05-08 03:00", "url": "https://www.kwit.org/2024-05-07/a-new-plot-to-assassinate-ukraines-president-has-come-to-light", "message": "But Ukraine's domestic intelligence agency says, this time, the plot was much more sophisticated.\nKAKISSIS: Ukraine's domestic intelligence agency also posted a video of an unnamed suspect - a gray-haired man in a gray parka.\nThe spokesman, Dekhtiarenko, says the Russians also planned to kill the heads of both the military and the domestic intelligence agencies.\nKAKISSIS: The Russian officer says, \"if you complete the task, you will have at least $50,000.\"\nHe called it a terrorist attack that was supposed to be a gift to Russian President Vladimir Putin for his inauguration on Tuesday."}, {"id": "1745094e-9ae2-4348-a2eb-7a69b703bdaf", "title": "A new plot to assassinate Ukraine president has come to light", "date": "2024-05-08 05:15", "url": "https://www.mynspr.org/2024-05-07/a-new-plot-to-assassinate-ukraines-president-has-come-to-light", "message": "But Ukraine's domestic intelligence agency says, this time, the plot was much more sophisticated.\nKAKISSIS: Ukraine's domestic intelligence agency also posted a video of an unnamed suspect - a gray-haired man in a gray parka.\nThe spokesman, Dekhtiarenko, says the Russians also planned to kill the heads of both the military and the domestic intelligence agencies.\nKAKISSIS: The Russian officer says, \"if you complete the task, you will have at least $50,000.\"\nHe called it a terrorist attack that was supposed to be a gift to Russian President Vladimir Putin for his inauguration on Tuesday."}, {"id": "aa381340-5541-46e7-81ac-bdb7497f1728", "title": "Rajnath Singh Tears Into Channi Over Remarks On Poonch Terror Attack", "date": "2024-05-08 11:15", "url": "https://menafn.com/1108187688/Rajnath-Singh-Tears-Into-Channi-Over-Remarks-On-Poonch-Terror-Attack", "message": "(MENAFN- IANS) Bhubaneswar, May 8 (IANS) Defence Minister Rajnath Singh on Wednesday took a dig at former Punjab chief minister Charanjit Singh Channi over his controversial remarks on the recent terrorist attack on Indian Air Force (IAF) convoy at Poonch in Jammu and Kashmir leading to the death of one IAF soldier.\nAddressing a public gathering at Bhawanipatna in Kalahandi on Wednesday, Singh said,“Congress has always been involved in negative politics.\nRecently, some terrorists launched an attack on our defence forces convoy in Jammu & Kashmir.\nCongress leader Charanjit Singhji Channi said that it (the terrorist act) was an election stunt.\nNotably, Congress leader Charanjit Singh Channi had earlier remarked that the terrorist attack on the Indian Air Force was a BJP-operated pre-poll stunt."}, {"id": "02fb1a2e-b2a5-47de-a11b-991ece84cee9", "title": "Pinoys back  dual approach  in West Philippine Sea", "date": "2024-05-08 16:45", "url": "https://www.philstar.com/headlines/2024/05/09/2353734/pinoys-back-dual-approach-west-philippine-sea", "message": "Pinoys back ‘dual approach’ in West Philippine SeaHandout photo shows an ‘enemy ship’ being hit by a missile from Philippine and US military forces during the Balikatan Exercises in Laoag, Ilocos Norte yesterday.\nMANILA, Philippines — Filipinos continue to support a dual approach of diplomacy and military action in asserting the country’s territorial rights in the West Philippine Sea, according to a survey conducted by the OCTA Research group.\nCompared to last year, more Filipinos now support expanding naval patrols and troop presence in the region.\nSupport for diplomacy approach hardly moved from 70 percent in July 2023 to 72 percent in March 2024.\nHe said the former Caliraya was the designated mock enemy target positioned off the west coast of Ilocos Norte."}, {"id": "5616b187-9b9a-472f-9e66-ae8fe00bc46e", "title": "Israel bans Al Jazeera : A look at the history of its feud , the network coverage of Gaza & accusations", "date": "2024-05-08 11:00", "url": "https://www.thehindu.com/news/international/israel-bans-al-jazeera-a-look-at-the-history-of-its-feud-the-networks-coverage-of-gaza-accusations/article68150990.ece", "message": "Israel shuts down Al Jazeera offices.\npic.twitter.com/8gLPtzOu4P — Al Jazeera English (@AJEnglish) May 5, 2024Additionally, the order also withdraws all accreditation granted to Al Jazeera’s crew, bans media service providers from transmitting the broadcast channel and blocks its websites.\nHow did Israel shut down Al Jazeera?\nAl Jazeera is one of the only news networks with broadcast offices in both the West Bank and the Gaza Strip.\nCountering Hamas, Israel launched continuous air attacks on Gaza as Hamas rocket attacks into Israel continued."}, {"id": "78c33678-9c42-4ac1-9352-5b3e483c3c13", "title": "HRW declares Israeli attack on Lebanon rescuers  unlawful  - Newspaper", "date": "2024-05-08 07:45", "url": "https://www.dawn.com/news/1832135/hrw-declares-israeli-attack-on-lebanon-rescuers-unlawful", "message": "BEIRUT: Human Rights Watch said on Tuesday an Israeli strike in Lebanon that killed seven first responders was “an unlawful attack on civilians”, and urged Washington to suspend weapons sales to Israel.\n“An Israeli strike on an emergency and relief centre” in the southern village of Habariyeh on March 27 “killed seven emergency and relief volunteers” and constituted an “unlawful attack on civilians that failed to take all necessary precautions”, HRW said in a statement.\nThe Israeli military did not immediately comment when contacted.\n“Israeli forces used a US weapon to conduct a strike that killed seven civilian relief workers in Lebanon who were merely doing their jobs,” HRW’s Lebanon researcher, Ramzi Kaiss, said.\nThe rights group urged the United States to “immediately suspend arms sales and military assistance to Israel given evidence that the Israeli military is using US weapons unlawfully”."}, {"id": "c9550fe3-9d66-46ed-898e-6d1e6e065a94", "title": "Russian attack on Odesa on 29 April : another man dies in hospital", "date": "2024-05-08 12:45", "url": "https://www.yahoo.com/news/russian-attack-odesa-29-april-105331325.html", "message": "A man who was injured in a Russian missile attack on the city of Odesa on 29 April has died in hospital.\nSource: a statement from Odesa City HallQuote: \"Unfortunately, the death toll from the Russian attack on Odesa on 29 April has risen to 7.\nOne more man, aged about 23, died in hospital today [8 May – ed.\nBackground:On 29 April, Russian forces carried out a missile strike on Odesa.\nOn 1 May, the death toll from the missile attack on Odesa rose to six, as a man died in hospital."}, {"id": "8b2d6644-b6fb-499c-b7a4-2c1c1e688748", "title": "Ukraine war live updates : Latest news on Russia and the war in Ukraine", "date": "2024-05-08 07:45", "url": "https://www.cnbc.com/2024/05/08/ukraine-war-live-updates-latest-news-on-russia-and-the-war-in-ukraine.html", "message": "The Kremlin doubled down on warning that any deployment of NATO troops in Ukraine would represent a significant and dangerous escalation of tensions between Russia and the military alliance.\nWhen asked to comment on a petition posted on the Ukrainian presidential website Tuesday calling for NATO troops from the U.S., U.K. and EU to be sent to Ukraine, Kremlin spokesperson Dmitry Peskov told reporters that such a move posed a \"huge danger.\"\nEarlier Wednesday, Russian Foreign Ministry spokesperson Maria Zakharova told reporters French troops will be targeted by the Russian army if they are deployed on Ukrainian soil.\nIn other news, Russia used more than 50 missiles and 20 drones to attack Ukraine's infrastructure overnight, Ukraine's President Volodymyr Zelenskyy said Wednesday, with the country's energy network suffering a \"massive attack.\""}, {"id": "12d371d2-407f-4490-aaea-6bd56e483314", "title": "Zelensky assassination plot by Russian agents foiled – Ya Libnan", "date": "2024-05-08 03:00", "url": "https://yalibnan.com/2024/05/08/zelensky-assassination-plot-by-russian-agents-foiled/", "message": "Kyiv has foiled an alleged Russian plot to assassinate Ukrainian President Volodymyr Zelensky, the country’s security service (SBU) said on Tuesday.\nThe SBU said it had exposed a network of agents from Russia’s Federal Security Service (FSB) who were “preparing the assassination of the president of Ukraine” and other senior Ukrainian officials.\nThe ContextUkraine said Zelensky has been targeted countless times since Russian President Vladimir Putin launched a full-scale invasion of the country in February 2022.\nTwo colonels of the State Security Service of Ukraine, which oversees Zelensky’s security, were detained.\nThe defendants have been detained on suspicion of committing high treason under martial law, and preparing for a terrorist attack."}, {"id": "bd5340b1-9d1b-433e-9c07-33efc238bb41", "title": "About Western pots and Indian kettles - The Statesman", "date": "2024-05-08 04:00", "url": "https://www.thestatesman.com/opinion/about-western-pots-and-indian-kettles-1503298204.html", "message": "Experienced diplomats and intelligence officials of all countries know that clandestine work is sometimes taken up in hostile countries.\nIn 1964, USA assisted efforts led to a coup to bring down the democratic government of Brazil led by President Joao Goulart.\nMohammad Mossadegh was a popular leader and Prime Minister of Iran, elected democratically in elections, keen to get more resources for helping his people by curbing the profits of oil multinationals.\nOver 15,000 of these armed militants later spread violent conflict in many other countries as well, while also attacking several US and western targets.\nHence it is evident that the most powerful Western countries have time and again intervened in other countries to disrupt democracies and to cause enormous human distress in other ways."}, {"id": "6098ba07-5b61-4378-8835-be82ae8fa242", "title": "Soldier downs two Russian missiles using Igla man - portable air defence system – Ukrainian Air Force", "date": "2024-05-08 18:30", "url": "https://www.yahoo.com/news/soldier-downs-two-russian-missiles-150602750.html", "message": "A soldier from the Kherson Anti-Aircraft Missile Brigade destroyed a Russian cruise missile using an Igla man-portable surface-to-air missile system in the skies over the south of Ukraine on the morning of 8 May.\nAlong with the commander and fire adjuster, we used thermal imagers and a laser pointer, and soon had the Russian missile in our sights.\nDawn was breaking at the time, and it is harder to shoot down an enemy cruise missile at this time as it is less visible.\"\nThe target was destroyed – the Russian cruise missile exploded in mid-air.\nThis is the second cruise missile Oleksii has downed using an Igla since the beginning of the full-scale war."}, {"id": "92607fd5-8257-4205-94af-a123ee91075f", "title": "Ukrainian officials say theyve intercepted a plot to assassinate Volodymyr Zelenskyy . What happens if the country lost the  public face  of the war - 08 - May - 2024", "date": "2024-05-08 08:00", "url": "https://home.nzcity.co.nz/news/article.aspx?id=398051&fm=psp,tst", "message": "Mr Zelenskyy, the comedian-turned-president, has brushed off threats to his life in the past.\n\"The enemy was actively developing plans to eliminate President Volodymyr Zelenskyy,\" security officials said on Telegram.\nThe Security Service of Ukraine (SBU) is the country's main internal security agency, responsible for counter-intelligence and monitoring organised crime and terrorism.\nThe decision to target Mr Budanov along with Mr Zelenskyy was not surprising to Associate Professor Matthew Sussex, an expert on strategic policy at the Australian National University.\nInternational officials, including US Secretary of State Antony Blinken, have previously confirmed there are contingency plans already in place should Mr Zelenskyy be killed."}, {"id": "f761ec67-3ca4-444d-967e-aef89921afc2", "title": "Ukrainian officials say theyve intercepted a plot to assassinate Volodymyr Zelenskyy . What happens if the country lost the  public face  of the war - 08 - May - 2024", "date": "2024-05-08 10:30", "url": "https://home.nzcity.co.nz/news/article.aspx?id=398051", "message": "Mr Zelenskyy, the comedian-turned-president, has brushed off threats to his life in the past.\n\"The enemy was actively developing plans to eliminate President Volodymyr Zelenskyy,\" security officials said on Telegram.\nThe Security Service of Ukraine (SBU) is the country's main internal security agency, responsible for counter-intelligence and monitoring organised crime and terrorism.\nThe decision to target Mr Budanov along with Mr Zelenskyy was not surprising to Associate Professor Matthew Sussex, an expert on strategic policy at the Australian National University.\nInternational officials, including US Secretary of State Antony Blinken, have previously confirmed there are contingency plans already in place should Mr Zelenskyy be killed."}, {"id": "ca48ec3d-a64e-4009-aae4-765278b3e3f5", "title": "US drone warfare faces questions of legitimacy , study of military chaplains shows", "date": "2024-05-08 13:45", "url": "https://www.yahoo.com/news/us-drone-warfare-faces-questions-123454375.html", "message": "The U.S. military, responsible for conducting most drone strikes globally, has also adopted legitimacy as a principle of counterterrorism operations.\nDrone strikes differ from other uses of force in the remoteness of the operators firing the weapons.\nWe found that U.S. citizens perceive over-the-horizon drone strikes, where drones are used strategically without external oversight, as most legitimate.\nWe found that, in contrast to the U.S. public, chaplains perceive over-the-horizon drone strikes as illegitimate.\nEven then, chaplains voice less support for these drone strikes than their perceptions of legitimacy might suggest."}, {"id": "7c41fc52-8a0b-4d5c-8052-32b8762ef7d0", "title": "Iran Announces It Is  Broadening the Battlefront  in War on Israel , U . S . ", "date": "2024-05-08 13:30", "url": "https://www.breitbart.com/middle-east/2024/05/08/iran-announces-it-is-broadening-the-battlefront-in-war-on-israel-u-s/", "message": "The commander of Iran’s Islamic Revolutionary Guard Corps (IRGC), Maj. Gen. Hossein Salami, claimed on Tuesday his rogue regime is “broadening the battlefront” against Israel and America to hasten the collapse of both nations.\nAnother Iranian terrorist proxy, the Houthi jihadist movement of Yemen, also issued an announcement on May 3 that its fighters would turn to the Mediterranean.\nIn his remarks on Tuesday, Salami, the Iranian IRGC commander, said Iran was “protecting [its] own country’s national security and also the security and dignity of other Muslims” by antagonizing and supporting terrorism against Israel.\nNaval Forces Central Command / U.S. 5th FleetThe IRGC is a U.S.-designated terrorist organization and a formal arm of the Iranian military.\nThe terror commander’s comments occurred on the same day that Israel confirmed a military operation in Rafah, the southernmost point of the Hamas-controlled Gaza Strip."}, {"id": "969b4a21-47e1-45be-bdfd-c039a487a144", "title": "Zelensky Assassination Plot : Ukraine Thwarts Alleged Russia - Backed Attempt", "date": "2024-05-08 01:00", "url": "https://foreignpolicy.com/2024/05/07/zelensky-assassination-plot-attempt-putin-russia-gordon-black-soldier/?tpcc=recirc_trending062921", "message": "Failed Hit on ZelenskyKyiv foiled what it said was a Russian-coordinated plot to assassinate senior Ukrainian officials, including President Volodymyr Zelensky, Ukraine’s security service announced on Tuesday.\nFederal authorities arrested two Ukrainian security officials on suspicion of treason, which carries a life sentence, and of preparing a terrorist act.\nRussian President Vladimir Putin provided no immediate response to the allegation.\nUkrainian officials said the suspects planned to kill Budanov before Orthodox Easter, which fell on May 5 this year, by providing information on his whereabouts to target him in a rocket and drone strike.\nKyiv usually remains tight-lipped about assassination attempts against senior officials, of which there have been several since Russia’s war against Ukraine began."}, {"id": "7bac5158-2ec6-49ca-8e25-97884f028033", "title": "Russia Flexed Its Nuclear Muscles in Unprecedented Drills", "date": "2024-05-08 18:45", "url": "https://www.popularmechanics.com/military/weapons/a60704124/russia-snap-tactical-nuclear-drills/", "message": "On Monday, Russia announced its Southern Military District would hold snap tactical nuclear weapons drills involving its ground, navy, and air forces that will help “iron out” how exactly it might conduct a tactical nuclear strike.\nAnadolu // Getty Images MiG-31 ‘Foxhound’ interceptor carrying a 9A-7660 Kinzhal hypersonic missile, essentially an Iskander missile adapted for air-launch, thereby extending effective range to 1,200+ miles.\nKinzhal is capable of carrying a nuclear warhead, but its unclear whether Russia has actually prepared MiG-31 units for a tactical nuclear delivery role.\nWhile some F-16s are wired to deliver nuclear weapons, that is not true of those delivered to Ukraine in particular.\nThe standard missile used is the 9M723 quasi-ballistic missile, landing on average within 7 meters when aided by satellite navigation, or 30 meters when not."}, {"id": "2268f007-3ed1-46b3-b3bb-fee40b6ce22c", "title": "Sette morti e diversi feriti in un raid di Israele su Gaza", "date": "2024-05-08 03:15", "url": "https://www.giornaledibrescia.it/italia-e-estero/sette-morti-e-diversi-feriti-in-un-raid-di-israele-su-gaza-khqfngug", "message": "GAZA, 08 MAG - Almeno sette persone sono rimaste uccise e diverse altre ferite oggi in un attacco aereo israeliano sulla città di Gaza, rende noto l'ospedale al-Ahli.\nL'agenzia di stampa palestinese Wafa afferma che il raid ha colpito un edificio residenziale nel quartiere orientale di Zeitoun.\nLe vittime apparterrebbero tutte alla stessa famiglia e tra loro ci sarebbero anche alcuni bambini, aggiunge la Wafa.\nIl bilancio dal 7 ottobre scorso nella Striscia di Gaza è di almeno 34.789 morti e 78.204 feriti, secondo il ministero della Sanità locale gestito da Hamas."}, {"id": "105e4309-0129-4ad9-bb28-82979b7cc285", "title": "Metal Gear Solid : How To Take Down Rex", "date": "2024-05-08 19:45", "url": "https://kotaku.com/metal-gear-solid-mgs1-rex-boss-fight-missiles-1851463929", "message": "One of Metal Gear Solid’s ultimate bosses is the massive walking battle tank known as Metal Gear Rex.\nTears Of The Kingdom's Newspaper Questline And The State Of Hyrulean Journalism CC Share Subtitles OffEnglish view video Tears Of The Kingdom's Newspaper Questline And The State Of Hyrulean JournalismRead More: How To Unlock Metal Gear Solid’s New Game Plus And Best ItemsBuy Metal Gear Solid: Master Collection Vol.\nAlmost too close for comfortThe Metal Gear Rex fight is all about getting up close…but not too close.\nAdvertisementRead More: Metal Gear Solid Has A Fast Travel Mechanic You Probably Didn’t Know AboutAdvertisementChaff grenades will screw with Rex’s missiles, mostly causing them to miss you if the timing’s right.\nIf you get too close to Rex, you’re in for another world of hurt."}, {"id": "2bd07c9e-fb1e-46ad-94af-351b75ebc525", "title": "Russians damage critical infrastructure in Kirovohrad and Poltava oblasts , injuring child", "date": "2024-05-08 09:15", "url": "https://www.yahoo.com/news/russians-damage-critical-infrastructure-kirovohrad-043859616.html", "message": "Russian forces damaged a critical infrastructure facility, 13 residential buildings and dozens of garages in Kirovohrad Oblast during a missile attack on the night of 7-8 May, injuring a child.\nSource: Andrii Raikovych, Head of Kirovohrad Oblast Military Administration; Filip Pronin, Head of Poltava Oblast Military AdministrationQuote from Raikovych: \"As a result of an enemy missile attack on Kirovohrad Oblast, a critical infrastructure facility was damaged in Oleksandriia district.\nDespite the successful efforts of our defenders, we unfortunately had a strike on a power infrastructure facility in Poltava district.\nNo casualties or damage were reported in Kyiv after the Russian missile strike on the night of 7-8 May.\nPower generation and transmission facilities in six of Ukraine’s oblasts were attacked by the Russians: Poltava, Kirovohrad, Zaporizhzhia, Lviv, Ivano-Frankivsk and Vinnytsia."}, {"id": "9c91c733-fbd0-4287-b00c-1c572b5c7e93", "title": "Russia says it advances in Ukraine , has struck energy and military industry", "date": "2024-05-08 16:15", "url": "https://www.devdiscourse.com/article/law-order/2931966-russia-says-it-advances-in-ukraine-has-struck-energy-and-military-industry", "message": "Russia said on Wednesday that its forces had advanced in eastern Ukraine, taking villages in two regions, and that it had struck Ukraine's energy and military infrastructure in response to attacks on Russian refineries.\nRussia used high-precision long-range naval and air-based weapons, hypersonic Kinzhal missile systems and drones to strike energy facilities and the military-industrial complex, Russia's defence ministry said.\n\"As a result of the strike, Ukraine's capabilities for the output of military products, as well as the transfer of Western weapons and military equipment to the line of contact, have been significantly reduced,\" the ministry said.\nIt said the strike was in response to the \"attempts of the Kyiv regime to damage Russian energy facilities\".\nIt also said that it had struck Ukrainian ammunition depots and drone workshops."}, {"id": "5658ccab-164f-4d34-9b9a-2434c5913ff8", "title": "Gray Zone Warfare Debuts in 1st on the Steam Charts", "date": "2024-05-08 05:30", "url": "https://www.vgchartz.com/article/460905/gray-zone-warfare-debuts-in-1st-on-the-steam-charts/", "message": "Gray Zone Warfare Debuts in 1st on the Steam Charts - Sales/ 862 Viewsby, posted 20 hours agoGray Zone Warfare has debuted in first place on the Steam Weekly Top Sellers chart (excluding revenue generated by free games) for Week 19, 2024, which ended May 7, 2024.\nTotal War: WARHAMMER III shot up the charts to third place, following the release of DLC packs.\nManor Lords in its second week dropped one spot to second place, while Steam Deck and Helldivers 2 dropped two spots to fourth and fifth places, respectively.\nEA Sports FC 24 re-entered the top 10 in sixth place and Fallout 76 dropped five spots to ninth place.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel."}, {"id": "1a9bcbc4-6290-41e9-a8be-db32d866d8b4", "title": "Gray Zone Warfare Debuts in 1st on the Steam Charts", "date": "2024-05-08 08:15", "url": "https://www.vgchartz.com/article/460905/steam-weekly-week-19-2024/", "message": "Gray Zone Warfare Debuts in 1st on the Steam Charts - Sales/ 864 Viewsby, posted 20 hours agoGray Zone Warfare has debuted in first place on the Steam Weekly Top Sellers chart (excluding revenue generated by free games) for Week 19, 2024, which ended May 7, 2024.\nTotal War: WARHAMMER III shot up the charts to third place, following the release of DLC packs.\nManor Lords in its second week dropped one spot to second place, while Steam Deck and Helldivers 2 dropped two spots to fourth and fifth places, respectively.\nEA Sports FC 24 re-entered the top 10 in sixth place and Fallout 76 dropped five spots to ninth place.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel."}, {"id": "f4f7e90b-e1c1-41f4-8c30-7e626479677d", "title": "American Academic Claims Israeli Killings in Gaza Worse Than Darfur", "date": "2024-05-08 07:30", "url": "https://www.frontpagemag.com/american-academic-claims-israeli-killings-in-gaza-worse-than-darfur/", "message": "The total deaths in the seven months of the Gaza War, according to the unverifiable, and likely exaggerated, figure put out by Hamas, are 34,000.\nThe total number of Hamas and PIJ combatants killed in that same period, according to the IDF estimate, are 15,000.\nHe states that the Gaza death toll reached 33,000 in the six months since the war began (an average of 5,500 per month).\nRemember that the world is supplied with statistics on Gaza deaths by the Health Ministry that is supplied with its figures from Hamas.\nWe can’t be sure of how many civilians died in Gaza, but we can be sure that whatever figure Hamas gives out, it is certain to be greatly exaggerated."}, {"id": "a6ee8630-ee05-4406-a9e4-caee9d71e975", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict . ", "date": "2024-05-08 05:00", "url": "https://www.bostonglobe.com/2024/05/08/nation/has-israel-followed-law-its-war-gaza-us-is-due-render-first-of-its-kind-verdict/", "message": "A decision against Israel would add to pressure on President Joe Biden to curb the flow of weapons and money to Israel’s military.\nDoes the U.S. call grave human rights violations by one of its foreign recipients of military support when it sees them?\nAdvertisementHuman rights groups long have accused Israeli security forces of committing abuses against Palestinians, and accused Israeli leaders of failing to hold those responsible to account.\nAdvertisementNow, though, Congress is compelling the administration to render its most public assessment in decades over whether Israel has used U.S. military support lawfully.\nHe is among those urging the U.S. to condition military support to Israel."}, {"id": "215830f8-9561-4a50-bf04-74cb427b4ea5", "title": "US and Philippine forces sink ship during drills in disputed South China Sea", "date": "2024-05-08 09:30", "url": "https://www.lbc.co.uk/world-news/09e4a2895b1b41d0a1043e3da05218b2/", "message": "US and Philippine forces, backed by an Australian air force surveillance aircraft, unleashed a barrage of high-precision rockets, artillery fire and airstrikes on Wednesday – sinking a mock enemy ship as part of largescale war drills in and near the disputed South China Sea that have antagonised Beijing.\nMr Marcos has ordered his military to shift its focus to external defence from decades-long domestic anti-insurgency operations as China’s actions in the South China Sea become a top concern.\nChina has angered the Philippines by repeatedly harassing its navy and coast guard ships with powerful water cannons and a military-grade laser, blocking movements and other dangerous manoeuvres in the high seas near two disputed South China Sea shoals.\nThe Philippines has repeatedly cited a 2016 international arbitration ruling based on the United Nations Convention of the Law of the Sea that invalidated China’s claim over virtually the entire South China Sea on historical grounds.\nChina has opposed military drills involving US forces as well as increasing US military deployments in the region, which it warned would escalate tensions and endanger regional stability."}, {"id": "7831b091-3fd3-4c63-be0c-bf4b417da511", "title": "US Arms Delay to Israel Brings Anxiety and Talk of Self - Reliance", "date": "2024-05-08 17:15", "url": "https://www.bnnbloomberg.ca/us-arms-delay-to-israel-brings-anxiety-and-talk-of-self-reliance-1.2070484", "message": "(Bloomberg) -- As Israel’s war on Hamas in Gaza has grown increasingly controversial, arms suppliers including Italy, Spain and Canada have all halted sales.\nAbout 70% of Israel’s military imports come from the US, which has made more than 200 deliveries since the conflict started in October.\nThis was dubbed “the boutique industries policy” and helped Israel become a world leader in defense innovation.\nAt the end of 2023, pending deliveries of major arms to Israel included 61 combat aircraft from the US and four submarines from Germany.\nLandau named Elbit Systems Ltd. – which acquired the former Israeli Military Industries — as the most appropriate company to produce aerial bombs."}, {"id": "07fd3332-dcb1-4f49-9db6-97617966a523", "title": "Israel - Hamas war enters seventh month : How the destruction in Gaza is unlike anything seen before", "date": "2024-05-08 08:30", "url": "https://www.firstpost.com/explainers/israel-hamas-war-seventh-month-destruction-gaza-unlike-anything-seen-before-13768488.html", "message": "The seven-month war between Israel and Hamas has killed over 34,000 people, caused catastrophic levels of hunger and injury, and destroyed massive amounts of material in Gaza.\nReutersThe Gaza war has reached its seventh month.\nAn Israeli mobile artillery unit fires a shell from southern Israel towards the Gaza Strip, in a position near the Israel-Gaza border, Tuesday, 7 May, 2024.\nAdvertisementThe territory’s largest hospital, Al-Shifa in Gaza City, was targeted in two offensives by the Israeli army, the first in November, the second in March.\nSmoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah, southern Gaza Strip."}, {"id": "500f4790-2164-4b83-92f6-7f205680d2e8", "title": "Barry Romo , Vietnam veteran who then fought against the war , dies at 76", "date": "2024-05-08 03:45", "url": "https://www.stripes.com/veterans/2024-05-07/barry-romo-obit-vietnam-veteran-13787712.html", "message": "Michael Allen, of Yale Divinity School; folk singer Joan Baez; and Barry Romo, of Vietnam Veterans Against the War.\nStanding near Romo was former Navy lieutenant John F. Kerry, also a leader of the Vietnam Veterans Against the War.\nBarry Romo, second from left, and Bill Davis in Chicago marching with Vietnam Veterans Against the War on Veterans Day circa 1970.\n“Our slogan was ‘honor the warrior, not the war,’” said Romo, who began work in the national office of the Vietnam Veterans Against the War in 1972.\nGen. Telford Taylor, a chief prosecutor at the post-World War II Nuremberg trials who became a staunch critic of the Vietnam War."}, {"id": "7d5d6aa0-4358-4c64-87fb-e634354aa849", "title": "Ukraine Says It Thwarted Russian Plan To Kill Zelenskiy , Top Officials", "date": "2024-05-08 14:30", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240507-rferl01.htm", "message": "Ukraine Says It Thwarted Russian Plan To Kill Zelenskiy, Top OfficialsBy RFE/RL's Ukrainian Service May 07, 2024KYIV - Ukraine's SBU security service said it \"thwarted\" an assassination attempt against President Volodymyr Zelenskiy by a network of five Ukrainian agents linked to Russia's Federal Security Service (FSB), the successor agency to the Soviet-era KGB.\n\"Counterintelligence and SBU investigators thwarted the FSB's plans to eliminate the president of Ukraine and other representatives of the top military and political leadership,\" SBU said on Telegram.\nThe Chemical Weapons Convention states that any toxic chemical used with the intention of causing harm is considered a chemical weapon.\nMeanwhile, on the battlefield, Russian shelling killed one civilian and wounded eight in several Ukrainian regions, officials reported early on May 7.\nAnother Russia-installed official claimed without providing evidence that Ukraine had used a U.S.-made Army Tactical Missile System, known as ATACMS, in the attack."}, {"id": "80c4ddf0-65e7-41a5-8be5-2caeaa149699", "title": "Death Toll From Ukrainian Drone Attack on Russia Belgorod Climbs to 8", "date": "2024-05-08 15:15", "url": "https://www.themoscowtimes.com/2024/05/08/death-toll-from-ukrainian-drone-attack-on-russias-belgorod-climbs-to-8-a85070", "message": "The death toll from a Ukrainian drone strike on western Russia’s Belgorod region earlier this week has risen to eight people, Russian authorities said Wednesday.\nIn one of the deadliest recent attacks inside Russia, six people were killed Monday when drones struck two vans and a car near the village of Berezovka, around 7 kilometers from the Ukraine border, Belgorod region Governor Vyacheslav Gladkov said.\nThe agricultural company Agro-Belogorye previously said seven of its workers were killed and 32 others wounded in the strike.\n“Another civilian has died from the drone attack in the Borisovsky district on May 6,” Gladkov said on Telegram, adding that a man died at the hospital after being “seriously injured.” He did not specify whether the man was an employee of Agro-Belogorye."}, {"id": "7b448fa3-35a4-49fc-93e8-eaceeefd0d4d", "title": "U . S . F - 22 Raptors Stationed at Kadena Amid Rising Tensions With China", "date": "2024-05-08 18:00", "url": "https://www.popularmechanics.com/military/aviation/a60672305/us-air-force-f22-raptors-deployed-kadena-china-proximity/", "message": "The U.S. Air Force recently deployed Virginia-based F-22 Raptors to Kadena Air Base.\nThe U.S. Air Force has redeployed F-22 Raptor jets more than 7,000 miles from home to a base literally on China’s doorstep.\nThe F-22s will be within range of their Chinese Air Force counterparts: the J-20 “Mighty Dragon” stealth fighter.\nThe trip from Joint Base Langley-Eustis, Virginia to Kadena Air Base on the island of Okinawa is a distance of 7,766 miles, nearly a third of the way around the world.\nIn 2023, the Air Force began withdrawing the two F-15C/D squadrons on the island."}, {"id": "dd16510f-d02f-4f67-9489-52d1a8d00428", "title": "Israel - Hamas war day 215 : What going on in Gaza ? ", "date": "2024-05-08 03:45", "url": "https://www.jpost.com/israel-hamas-war/2024-05-08/live-updates-800372", "message": "United Nations Secretary General Antonio Guterres addresses the opening of the 74th session of the United Nations General Assembly (photo credit: REUTERS/LUCAS JACKSON)The United Nations General Assembly (UNGA) is expected to upgrade the Palestinian status at the UN, granting it almost all statehood rights within its plenum short of allowing it to vote.\nThe United Arab Emirates is expected to submit a resolution, a draft text of which was seen by The Jerusalem Post, calling on the United Nations Security Council to grant Palestine full membership status in the UN.\nThe US is one of five permanent UNSC members with veto power.\nThe UAE resolution “recommends” that the Security Council “reconsider the matter favorably,” but in essence, its text seeks to circumvent the UNSC's sole power to determine UN membership.\n(credit: Amr Alfiky/Reuters)UNGA resolutions, however, cannot be vetoed, and the PA has automatic majority support in the UNGA, where some 140 of its members already independently recognize Palestine as a state."}, {"id": "7330e98c-c450-4266-a6a2-0cac1d4a3092", "title": "Hamas warns Israel that new ceasefire talks are  the last chance  to free hostages as IDF strikes targets in Gaza after seizing control of Rafah crossing - with  concerned  US pausing bomb shipments", "date": "2024-05-08 07:45", "url": "https://www.dailymail.co.uk/news/article-13394619/Hamas-warns-Israel-new-ceasefire-talks-chance-free-hostages-IDF-strikes-targets-Gaza-seizing-control-Rafah-crossing-concerned-pausing-bomb-shipments.html", "message": "The United States has halted bomb shipments to Israel amid 'concerns' over its ally's invasion of Rafah, the overcrowded city in southern Gaza.\nThe White House condemned Israeli's move to capture the Rafah crossing, which interrupted sorely needed humanitarian deliveries, and paused shipments of bombs after Israel failed to address Washington's concerns over its Rafah plans.\nDespite the Cairo talks, witnesses and a local hospital reported Israeli strikes across the Gaza Strip overnight into Wednesday morning, including around Rafah.\n'The Israeli operation also highlights the tightening of the noose around Hamas' leaders and final bastion in Rafah...\nBut the Rafah operation was roundly condemned by world governments, human rights groups and aid agencies."}, {"id": "86e67674-30ad-458e-a255-54515d94fe5f", "title": "Council of Europe adopts guidelines on emergency responses to terrorist attacks", "date": "2024-05-08 14:30", "url": "https://www.globalsecurity.org/security/library/news/2024/05/sec-240507-coe01.htm", "message": "Council of Europe adopts guidelines on emergency responses to terrorist attacksCouncil of EuropeCommittee of MinistersStrasbourg7 May 2024The Committee of Ministers has adopted a series of guidelines aimed at its 46 member states, in order to help public authorities and the public sector to strengthen their emergency responses in case of a terrorist attack.\nPrepared by the Committee on Counter-Terrorism (CDCT), the guidelines provide practical advice on core aspects of national emergency responses, including co-operation and coordination between services, planning of joint actions and response plans, training of relevant staff, and communication with the public and the media.\nThe text also underlines the importance of victim identification, support to victims and family members, as well as protection of soft targets and critical infrastructure.\nThese guidelines were prepared in the framework of the Council of Europe Counter-Terrorism Strategy (2023-2027), as one of the actions aimed at protecting individuals and their rights from the harms caused by terrorism.\nNEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "b43ab673-24a0-4717-a8a1-80346a4aa9e6", "title": "U . S . Air Force AC - 130J Ghostrider Sinks Fishing Boat in Exercise", "date": "2024-05-08 18:45", "url": "https://www.popularmechanics.com/military/aviation/a60701809/us-air-force-gunship-sinks-fishing-boat-exercise-balikatan/", "message": "A U.S. Air Force gunship sank a simulated fishing boat during Exercise Balikatan 2024.\nA U.S. Air Force gunship shredded a fishing boat as part of joint exercises between the United States and the Philippines.\nEzra Acayan // Getty Images Chinese Maritime Militia ships are generally unarmed, but act aggressively at sea at the behest of their government.\nOne tool used by China in the disputes is the so-called “maritime militia,” or China’s extremely large commercial fishing fleet.\nThe Maritime Militia may have met its match."}, {"id": "b7b3ac7e-4b7b-4c60-a7a9-f2860acfb1cf", "title": "Xi begins Serbia visit on the 25th anniversary of NATO bombing of the Chinese Embassy", "date": "2024-05-08 01:00", "url": "https://thepeninsulaqatar.com/article/07/05/2024/xi-begins-serbia-visit-on-the-25th-anniversary-of-natos-bombing-of-the-chinese-embassy", "message": "Photo taken on May 6, 2024, shows Chinese and Serbian flags along the high way trough Belgrade on the eve of the visit of Chinese President to Serbia.\n(Photo by Andrej ISAKOVIC / AFP)APBelgrade, Serbia: Chinese leader Xi Jinping's visit to European ally Serbia on Tuesday falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during NATO's air war over Kosovo.\nU.S. jets dropped five bombs on the Chinese Embassy compound in the Serbian capital on May 7, 1999, setting it ablaze and killing three Chinese nationals.\n\"The Chinese people value peace but will never allow historical tragedies to happen again,\" Xi added.\nThe U.S. at the time apologized and said the embassy bombing was a mistake that happened due to faulty intelligence."}, {"id": "b6ab91a2-c13d-4719-832a-a310cb33c169", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 04:30", "url": "https://www.yahoo.com/news/israel-followed-law-war-gaza-040200914.html", "message": "The Biden administration is due to deliver a first-of-its-kind formal verdict on whether Israel's conduct of its war in Gaza complies with international and U.S. laws.\nBlinken added that Israel had yet to rectify the unit's wrongdoing, something the Leahy law says must happen for any suspension of military aid to be lifted.\nWhile a finding against Israel under the national security memo wouldn't obligate the administration to start cutting military support for Israel, it would increase pressure on Biden to do so.\nThe report argues the administration must find Israel's conduct in Gaza has violated the law.\nHe is among those urging the U.S. to condition military support to Israel."}, {"id": "5fafb99a-9ecf-47bd-b096-b810929032a0", "title": "Israel : Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 08:30", "url": "https://economictimes.indiatimes.com/news/defence/has-israel-followed-the-law-in-its-war-in-gaza-the-us-is-due-to-render-a-first-of-its-kind-verdict/articleshow/109943449.cms", "message": "Blinken added that Israel had yet to rectify the unit's wrongdoing, something the Leahy laws say must happen for any suspension of military aid to be lifted.\nBlinken said rather than suspend the aid, the U.S. would work with Israel to \"engage on identifying a path to effective remediation for this unit.\nThe report argues the administration must find Israel's conduct in Gaza has violated the law.\nThey point to an Oct. 31 strike on a six-story apartment building in Gaza that killed at least 106 civilians.\nHe is among those urging the U.S. to condition military support to Israel."}, {"id": "f87a5b8b-a8de-478d-aa38-cb428c2a2f52", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 05:00", "url": "https://apnews.com/article/gaza-israel-leahy-biden-nsm-military-aid-812864bc424b93c886226e33f5c3f0e5", "message": "Blinken added that Israel had yet to rectify the unit’s wrongdoing, something the Leahy law says must happen for any suspension of military aid to be lifted.\nWhile a finding against Israel under the national security memo wouldn’t obligate the administration to start cutting military support for Israel, it would increase pressure on Biden to do so.\nThe report argues the administration must find Israel’s conduct in Gaza has violated the law.\nHe is among those urging the U.S. to condition military support to Israel.\nIsrael and the Biden administration say Hamas’ presence in tunnels throughout Gaza, and alleged presence in hospitals and other protected sites, make it harder for Israeli forces to avoid high civilian casualties."}, {"id": "254622fd-ab29-463a-859f-2fd643e2efc7", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 04:30", "url": "https://www.wsoctv.com/news/world/has-israel-followed/FUV2DZ2HVNE6LMKDTP6GWV5K34/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "e45218ca-3eae-4489-a7ea-a4bfc3bd8541", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 07:45", "url": "https://www.local10.com/news/world/2024/05/08/has-israel-followed-the-law-in-its-war-in-gaza-the-us-is-due-to-render-a-first-of-its-kind-verdict/", "message": "The Biden administration is due to deliver a first-of-its-kind formal verdict on whether Israel's conduct of its war in Gaza complies with international and U.S. laws.\nBlinken added that Israel had yet to rectify the unit's wrongdoing, something the Leahy law says must happen for any suspension of military aid to be lifted.\nWhile a finding against Israel under the national security memo wouldn't obligate the administration to start cutting military support for Israel, it would increase pressure on Biden to do so.\nThe report argues the administration must find Israel's conduct in Gaza has violated the law.\nHe is among those urging the U.S. to condition military support to Israel."}, {"id": "aa19f7de-d836-4a03-9ada-1473c5440ef0", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 05:15", "url": "https://www.news4jax.com/news/world/2024/05/08/has-israel-followed-the-law-in-its-war-in-gaza-the-us-is-due-to-render-a-first-of-its-kind-verdict/", "message": "The Biden administration is due to deliver a first-of-its-kind formal verdict on whether Israel's conduct of its war in Gaza complies with international and U.S. laws.\nBlinken added that Israel had yet to rectify the unit's wrongdoing, something the Leahy law says must happen for any suspension of military aid to be lifted.\nWhile a finding against Israel under the national security memo wouldn't obligate the administration to start cutting military support for Israel, it would increase pressure on Biden to do so.\nThe report argues the administration must find Israel's conduct in Gaza has violated the law.\nHe is among those urging the U.S. to condition military support to Israel."}, {"id": "91df2248-3501-40ba-8e11-0761a6c96b8e", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 04:45", "url": "https://www.kob.com/news/us-and-world-news/has-israel-followed-the-law-in-its-war-in-gaza-the-us-is-due-to-render-a-first-of-its-kind-verdict/", "message": "Blinken added that Israel had yet to rectify the unit’s wrongdoing, something the Leahy law says must happen for any suspension of military aid to be lifted.\nWhile a finding against Israel under the national security memo wouldn’t obligate the administration to start cutting military support for Israel, it would increase pressure on Biden to do so.\nThe report argues the administration must find Israel’s conduct in Gaza has violated the law.\nHe is among those urging the U.S. to condition military support to Israel.\nIsrael and the Biden administration say Hamas’ presence in tunnels throughout Gaza, and alleged presence in hospitals and other protected sites, make it harder for Israeli forces to avoid high civilian casualties."}, {"id": "f1762e3b-0462-46a0-bba2-7d65d4dafb61", "title": "Congressmen demand answers after CNN report contradicts Pentagon investigations into deadly Kabul airport attack", "date": "2024-05-08 10:15", "url": "https://us.cnn.com/2024/05/08/asia/congressmen-letter-cnn-report-kabul-attack-intl/", "message": "The reporting included a video obtained by CNN captured by a Marine’s GoPro camera that had not been seen publicly in full before.\nMuch of the controversy about the Pentagon’s two investigations into the attack has focused on gunfire in the aftermath of the blast.\n“Lastly, why do journalists have this video footage and the Department does not?\nThe recent discovery of new video released by CNN directly contradicts and exposes outright lies from our recent briefing last month from CENTCOM officials,” the Gold Star families said in a statement they sent to CNN.\nHaroon Sabawoon/Anadolu Agency/Getty Images/FileThe evidence also suggests the Pentagon may have more video footage than it has acknowledged in public."}, {"id": "26437f55-9146-4dd0-ad41-acc4e4b2d9f7", "title": "Has Israel followed the law in its war in Gaza ?  The US is due to render first - of - its - kind verdict", "date": "2024-05-08 15:15", "url": "https://businessmirror.com.ph/2024/05/08/has-israel-followed-the-law-in-its-war-in-gaza-the-us-is-due-to-render-first-of-its-kind-verdict/", "message": "A decision against Israel would add to pressure on President Joe Biden to curb the flow of weapons and money to Israel’s military.\nDoes the US call grave human rights violations by one of its foreign recipients of military support when it sees them?\nHuman rights groups long have accused Israeli security forces of committing abuses against Palestinians, and accused Israeli leaders of failing to hold those responsible to account.\nNow, though, Congress is compelling the administration to render its most public assessment in decades over whether Israel has used US military support lawfully.\nHe is among those urging the US to condition military support to Israel."}, {"id": "ccb97b45-74db-4099-a43c-fe414fa618d0", "title": "Marc Champion : Dont let Gaza help Iran cloak its own repression – Twin Cities", "date": "2024-05-08 12:45", "url": "https://www.twincities.com/2024/05/08/marc-champion-dont-let-gaza-help-iran-cloak-its-own-repression/", "message": "One of the great ironies of the war in Gaza is that it has given a free pass for repression to one of the world’s ugliest regimes — Khamenei’s.\nRule by fear and repression has only intensified since Hamas invited Israel’s invasion of Gaza, by attacking Kibbutzes with calculated savagery, last October.\n“It’s the government’s aim to do this, to completely kill the movement and get the entire world fixated on Gaza.\n“Even we ourselves went quiet.”It isn’t only Iran that’s benefiting from the horrors of Gaza to bury their own gruesome records of slaughter and repression.\nIt is a rogues gallery of ruthlessly cynical ideologues using Gaza to cloak their own long record of crimes against humanity."}, {"id": "9327c2cd-b761-4b33-a34a-228c8a07e185", "title": "India contributes $5 , 00 , 000 to U . N . Counter - Terrorism Trust Fund", "date": "2024-05-08 11:30", "url": "https://www.thehindu.com/news/international/india-contributes-500000-to-un-counter-terrorism-trust-fund/article68152922.ece", "message": "India has contributed $500,000 to the U.N. Counter-Terrorism Trust Fund, underscoring its unwavering commitment to support multilateral efforts in the global fight against the scourge of terrorism.\nIndia’s Permanent Representative to the United Nations Ambassador Ruchira Kamboj on May 7 handed over to Under Secretary General, United Nations Office of Counter-Terrorism (UNOCT) Vladimir Voronkov the country's voluntary financial contribution of half a million dollars towards the U.N. Counter-Terrorism Trust Fund (CTTF).\nThe statement said India’s contribution would support UNOCT’s global programmes — mainly Countering Financing of Terrorism (CFT) and Countering Terrorist Travel Programme (CTTP).\nAddressing the issue of the growing threat of terrorism in Africa has been one of the counter-terrorism priorities of India for the past few years.\nWith its current contribution, India's cumulative financial support to the trust fund now stands at $2.55 million."}, {"id": "f25880f0-3885-4347-8301-ac34f33886a7", "title": "Israel reopens key crossing for aid to enter Gaza that was closed over weekend rocket attack", "date": "2024-05-08 10:00", "url": "https://www.newsday.com/news/nation/israel-hamas-war-news-05-08-2024-f91924", "message": "The Kerem Shalom crossing between Gaza and Israel was closed over the weekend after a Hamas rocket attack killed four Israeli soldiers nearby, and on Tuesday, an Israeli tank brigade seized the nearby Rafah crossing between Gaza and Egypt, forcing its closure.\nThe Rafah crossing has been a vital conduit for humanitarian aid since the start of the war and is the only place where people can enter and exit.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight, including two large blasts early Wednesday.\nAn Israeli military official said that Hamas had fired unidentified projectiles at Kerem Shalom on Wednesday, confirming an earlier claim from the militant group.\nThe U.S. has historically provided Israel with enormous amounts of military aid, which has only accelerated since the start of the war."}, {"id": "fef6d2c1-24a9-4911-9477-627729829057", "title": "US , PH troops sink China - made vessel in war games", "date": "2024-05-08 19:45", "url": "https://www.manilatimes.net/2024/05/09/news/national/us-ph-troops-sink-china-made-vessel-in-war-games/1945371", "message": "US and Philippine forces sank a decommissioned China-made Philippine Navy ship Wednesday during South China Sea war games simulating an attack on an enemy vessel, officials said.\nThe Philippine military earlier ruled out any symbolism in the choice of a China-made ship as target practice for the allies.\nThe vessel has been used in the Philippines for a long, long time.\nBeijing claims almost the entire South China Sea, despite an international ruling that its assertion has no legal basis.\nAsked about the drills, China's foreign ministry warned Monday that \"any military exercise should not be targeted at or harm the interests of third parties.\""}, {"id": "8451ba4a-5aa1-443e-b01a-2c24bf4b5817", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 04:30", "url": "https://lasvegassun.com/news/2024/may/07/has-israel-followed-the-law-in-its-war-in-gaza-the/", "message": "Has Israel followed the law in its war in Gaza?\nDoes the U.S. call grave human rights violations by one of its foreign recipients of military support when it sees them?\nHuman rights groups long have accused Israeli security forces of committing abuses against Palestinians, and accused Israeli leaders of failing to hold those responsible to account.\nNow, though, Congress is compelling the administration to render its most public assessment in decades over whether Israel has used U.S. military support lawfully.\nHe is among those urging the U.S. to condition military support to Israel."}, {"id": "54a244d1-33d1-4307-990b-14b57a3d07c6", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 05:00", "url": "https://isp.netscape.com/news/world/story/0001/20240508/812864bc424b93c886226e33f5c3f0e5", "message": "Has Israel followed the law in its war in Gaza?\nBlinken added that Israel had yet to rectify the unit's wrongdoing, something the Leahy law says must happen for any suspension of military aid to be lifted.\nWhile a finding against Israel under the national security memo wouldn't obligate the administration to start cutting military support for Israel, it would increase pressure on Biden to do so.\nThe report argues the administration must find Israel's conduct in Gaza has violated the law.\nHe is among those urging the U.S. to condition military support to Israel."}, {"id": "b5bcdded-81b3-4801-9534-0f52cd64efe9", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 16:30", "url": "https://www.kbtx.com/2024/05/08/has-israel-followed-law-its-war-gaza-us-is-due-render-first-of-its-kind-verdict/", "message": "Students continue to protest the war in Gaza as universities host commencement ceremonies.\nBlinken added that Israel had yet to rectify the unit’s wrongdoing, something the Leahy law says must happen for any suspension of military aid to be lifted.\nWhile a finding against Israel under the national security memo wouldn’t obligate the administration to start cutting military support for Israel, it would increase pressure on Biden to do so.\nThe report argues the administration must find Israel’s conduct in Gaza has violated the law.\nHe is among those urging the U.S. to condition military support to Israel."}, {"id": "adb87ae6-153e-4b82-aaa1-40126dac72ec", "title": "Heightened Security at AMIA : Reflecting on Argentina Traumatic Past", "date": "2024-05-08 15:15", "url": "https://latinamericanpost.com/americas/politics/heightened-security-at-amia-reflecting-on-argentinas-traumatic-past/", "message": "A bomb threat at the Argentine Israelite Mutual Association (AMIA) building in Buenos Aires prompted an urgent police response, reminding the nation of its vulnerable past and ongoing commitment to combatting terrorism.\nThis week, an unsettling echo of Argentina’s turbulent history resounded through the streets of Buenos Aires as a bomb threat targeted the headquarters of the Argentine Israelite Mutual Association (AMIA).\nThe bomb scare began with a phone call received at 14:22 local time, claiming a potential threat at the AMIA building.\nFollowing established security protocols, the leadership of AMIA and the Delegation of Israeli-Argentine Associations (DAIA) swiftly involved the Anti-Terrorism Investigation Unit of the Federal Police of Argentina.\nCurrent Political Context and Security MeasuresThe recent bomb threat occurs against a backdrop of renewed international focus on terrorism, driven by Argentina’s current political stance."}, {"id": "1e919eb0-9156-4030-9c53-933e977c531a", "title": "A timeline of events leading up to Israel Rafah offensive", "date": "2024-05-08 20:00", "url": "https://knpr.org/npr/2024-05-08/a-timeline-of-events-leading-up-to-israels-rafah-offensive", "message": "For months, Israel has vowed to launch a Rafah military operation regardless of whether there is a cease-fire with Hamas.\nHere is a timeline of events leading up to its offensive in Rafah, where more than half of Gaza's population had sought shelter.\nOct. 18Egyptian President Abdel Fattah el-Sisi warns against a plan to forcibly displace Palestinians in the Gaza Strip into Egypt.\nThe Israeli military said that it had rescued the two hostages from captivity in the Gaza Strip while conducting the airstrikes.\nMore than three-quarters of the Gaza Strip is now under evacuation orders, the U.N. says."}, {"id": "96435f19-cb68-403f-a1eb-6789271edb00", "title": "Israel : US weapons used in strike that killed aid workers in Lebanon", "date": "2024-05-08 01:30", "url": "https://exbulletin.com/world/international/2689946/", "message": "Human Rights Watch found no evidence of a military target at the site.\nIsraeli forces used a U.S. weapon to carry out a strike that killed seven civilian aid workers in Lebanon who were simply doing their jobs, said Ramzi Kaiss, Lebanon researcher at Human Rights Watch.\nThe United States should immediately suspend arms sales and military aid to Israel given evidence that the Israeli military is illegally using American weapons, Human Rights Watch said.\nView photos The advantages of comparing online car insurance quotes are the following: Online quotes can be obtained from anywhere and at any time.\nFor additional info, money-saving tips, and free car insurance quotes, visit https://compare-autoinsurance.Org/ Compare-autoinsurance.Org is an online provider of life, home, health, and auto insurance quotes."}, {"id": "b2636c8d-98f0-4d1d-a254-8754874961be", "title": "White nationalism motivated terror plot , court told", "date": "2024-05-08 08:30", "url": "https://www.illawarramercury.com.au/story/8622227/white-nationalism-motivated-terror-plot-court-told/", "message": "\"The prosecution are saying he did those five things.\nAnd at the times he did those five things, you have a certain thing on his mind, you have a certain purpose ... namely that he was doing those things in preparation for planning a terrorist act.\""}, {"id": "ebe11b38-7ebc-47e6-ac04-c3f62b4d0604", "title": "Family of IDF lookout Noa Marciano claims she was killed by a doctor at Shifa Hospital", "date": "2024-05-08 19:15", "url": "https://www.thejc.com/news/israel/family-of-idf-lookout-noa-marciano-claims-she-was-killed-by-a-doctor-at-shifa-hospital-f6uxoiug", "message": "Noa Marciano's parents revealed on Wednesday that a doctor at Shifa Hospital in Gaza City murdered their daughter.\nMarciano, 19, was abducted on Oct. 7, the day of the Hamas attack, from the Nahal Oz Base, where she served as a lookout.\nDozens of IDF soldiers were killed in the attack, most of them lookouts.\nThe military said Marciano was injured and had been transferred by her captors to Shifa Hospital for treatment.\n\"Our hearts are with Noa's family, we send our condolences, we did not reach Noa in time."}, {"id": "dd157674-8dcc-4cea-aed6-81180c836f9f", "title": "Ukraine arrests 2 colonels in security services in plot to kill Zelenskyy", "date": "2024-05-08 03:15", "url": "https://www.theday.com/nation/20240507/ukraine-arrests-2-colonels-in-security-services-in-plot-to-kill-zelenskyy/", "message": "The two suspects were colonels in Ukraine’s State Protection Department, roughly the equivalent of the U.S. Secret Service, and were recruited by Russia’s Federal Security Service, the FSB, according to Ukraine’s State Security Service.\nThe State Security Service, known as the SBU, announced the arrests in a post on the Telegram social media platform.\nUkraine’s intelligence services also carry out killings of adversaries, though Russia’s top leadership has not been targeted.\nLast year, the wife of GUR head Budanov, Marianna, was hospitalized after being poisoned with heavy metals, Ukrainian officials said.\nRussian officials denied that they were behind the poisoning, calling such reports “routine accusations.”"}, {"id": "ae9e1131-76d5-433c-b5ee-3b9c129eb9c7", "title": "UK armed forces chief urges US to  stay strong  and resist isolationism | Foreign policy", "date": "2024-05-08 15:15", "url": "https://www.theguardian.com/politics/article/2024/may/08/uk-armed-forces-chief-us-stay-strong-resist-isolationism", "message": "Britain’s most senior military commander has called on the US to “stay strong, stick together, and see through” conflicts in Ukraine and the Middle East as he appealed against future American isolationism on a trip to Washington DC.\n“They were to see through what Gen Eisenhower termed ‘the elimination of Nazi tyranny over the oppressed peoples of Europe, and security for ourselves in a free world’,” Radakin said.\nThis year, having rebuffed Ukraine’s summer counteroffensive, the Russian army “has been able to make modest tactical gains”, Radakin said.\nWe use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply.\n“The task now is to stay strong, stick together, and see it through,” he said."}, {"id": "8e94ae45-8bc7-44fe-9220-e4e576bab566", "title": "Rafah attack : Joe Biden puts arms shipment to Israel on hold amid dispute over Rafah attack", "date": "2024-05-08 07:00", "url": "https://economictimes.indiatimes.com/news/defence/joe-biden-puts-arms-shipment-to-israel-on-hold-amid-dispute-over-rafah-attack/articleshow/109938966.cms", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelPresident Joe Biden paused an arms shipment to Israel last week to prevent the U.S.-made weapons from being used in a long-threatened assault on the city of Rafah administration officials said Tuesday night, a sign of the growing rift between Washington and Jerusalem over the conduct of the war The president withheld 1,800 2,000-pound bombs and 1,700 500-pound bombs that he feared could be dropped on Rafah, where more than 1 million residents in the Gaza Strip have taken refuge, the officials said.\nThe administration is reviewing whether to hold back future transfers, including guidance kits that convert so-called dumb bombs into precision-guided munitions.The decision to delay the delivery of the 3,500 bombs was the first time since the Oct. 7 Hamas-led terrorist attack that Biden has used his power to curtail arms as an instrument to influence Israel's approach to the war that followed.\nA number of Biden's Democratic allies in Congress have for weeks urged him to limit or halt arms shipments to Israel, something he had refused to do until now because of his strong support for the effort to destroy Hamas Israeli officials disclosed the weapons pause to Axios earlier this week, but U.S. officials refused to confirm it either at briefings or privately until Tuesday night.\nIn fact, officials said the administration had just approved the latest tranche of aid amounting to $827 million worth of weapons and equipment.\nThe administration intends to send \"every dollar\" of the money just appropriated by Congress, the officials said.But they said they were especially worried about the damage that could be done by the 2,000-pound bombs in a dense urban area like Rafah with so many displaced civilians."}, {"id": "adff1c87-b85f-4822-b776-28bf8bc6ec8d", "title": "What the World Central Kitchen Strike Tells Us About Israel", "date": "2024-05-08 19:45", "url": "http://www.washingtonjewishweek.com/what-the-world-central-kitchen-strike-tells-us-about-israel/", "message": "The congressional letter comes as the Biden administration is conducting an interagency review of Israel’s conduct in Gaza pursuant to a national security memorandum issued by U.S. President Joe Biden on Feb. 8.\nThis review will undoubtedly assess the tragic incident on April 1 in which the Israel Defense Forces misidentified a World Central Kitchen humanitarian convoy and accidentally killed seven aid workers.\nAs one would expect, top Israeli political and military leaders acknowledged the mistake, issued formal apologies and accepted responsibility.\nIn addition, a colonel serving as the brigade chief of staff and a major working as the brigade fire support commander were dismissed from their positions, according to the Israeli military.\nThe United States and Israel, despite their best efforts, sometimes make mistakes that result in the loss of civilian life."}, {"id": "cce5bc26-f4b3-4f7a-bb90-d99c7501a4b1", "title": "Ukraine orders nationwide electricity rationing after Russian airstrikes", "date": "2024-05-08 18:15", "url": "https://www.stripes.com/theaters/europe/2024-05-08/ukraine-rations-electricity-russia-airstrikes-13793548.html", "message": "Rescuers work at a damaged building after a Russian missile attack in Kyiv region, Ukraine, Wednesday, May 8, 2024.\nThe statement cited a “shortage of electricity in the power system.”The Russian strikes, which lasted more than three hours overnight, targeted energy infrastructure in six Ukrainian regions.\nUkraine’s power plants, electrical grid and other infrastructure have become particularly vulnerable as Western countries have struggled to supply Kyiv with sufficient air defense systems and ammunition.\nSixteen missiles, including two ballistic missiles, and one drone pierced the shield, the Ukrainian air force said on Telegram.\nMissiles damaged three thermal power stations belonging to the country’s largest power supplier, DTEK, the company said in social media posts."}, {"id": "788b65fc-f45e-4534-9cda-22654cc531ca", "title": "A timeline of events leading up to Israel Rafah offensive", "date": "2024-05-08 20:15", "url": "https://www.capeandislands.org/2024-05-08/a-timeline-of-events-leading-up-to-israels-rafah-offensive", "message": "For months, Israel has vowed to launch a Rafah military operation regardless of whether there is a cease-fire with Hamas.\nHere is a timeline of events leading up to its offensive in Rafah, where more than half of Gaza's population had sought shelter.\nOct. 18Egyptian President Abdel Fattah el-Sisi warns against a plan to forcibly displace Palestinians in the Gaza Strip into Egypt.\nThe Israeli military said that it had rescued the two hostages from captivity in the Gaza Strip while conducting the airstrikes.\nMore than three-quarters of the Gaza Strip is now under evacuation orders, the U.N. says."}, {"id": "66a9d287-39fc-46c7-89df-a157ac36492d", "title": "Israel seizes Gaza vital Rafah crossing , but the U . S . says it isnt the full invasion many fear", "date": "2024-05-08 03:00", "url": "https://www.theday.com/nation/20240507/israel-seizes-gazas-vital-rafah-crossing-but-the-u-s-says-it-isnt-the-full-invasion-many-fear/", "message": "Smoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah, southern Gaza Strip, Tuesday, May 7, 2024.\nIsrael's 401st Brigade took “operational control” of the Gaza side of the Rafah crossing early Tuesday, the military said.\nIsraeli authorities denied the U.N. humanitarian affairs office access to the Rafah crossing Tuesday, said its spokesman, Jens Laerke.\nSmoke rises following an Israeli airstrike on buildings near the separating wall between Egypt and Rafah, southern Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Leo Correa)Smoke rises following an Israeli bombardment in the Gaza Strip as seen from southern Israel, Tuesday, May 7, 2024."}, {"id": "be3c1d75-bede-4b2d-894e-844b2e139ee0", "title": "Israel establishes buffer zone in Gaza , US clarifies it not a full - scale invasion", "date": "2024-05-08 04:45", "url": "https://www.devdiscourse.com/article/law-order/2931332-israel-establishes-buffer-zone-in-gaza-us-clarifies-its-not-a-full-scale-invasion", "message": "They have been closed for at least the past two days, though the smaller Erez crossing between Israel and northern Gaza continues to operate.\nBiden warned Netanyahu again Monday against launching an invasion of the city after Israel ordered 100,000 Palestinians to evacuate parts of Rafah.\nIsrael's 401st Brigade took \"operational control\" of the Gaza side of the Rafah crossing early Tuesday, the military said.\nIsraeli authorities denied the U.N. humanitarian affairs office access to the Rafah crossing Tuesday, said its spokesman, Jens Laerke.\nEgypt's Foreign Ministry condemned the seizure of the Rafah crossing, calling it \"a dangerous escalation.\""}, {"id": "e0eb7e54-3078-4fdb-8515-f76c66faa4c0", "title": "Israel reopens key crossing for aid to enter Gaza after rocket attack", "date": "2024-05-08 11:15", "url": "https://www.theargus.co.uk/news/national/24305011.israel-reopens-key-crossing-aid-enter-gaza-rocket-attack/", "message": "The Kerem Shalom crossing between Gaza and Israel was closed over the weekend after a Hamas rocket attack killed four Israeli soldiers nearby, and on Tuesday, an Israeli tank brigade seized the nearby Rafah crossing between Gaza and Egypt, forcing its closure.\nThe Israeli foray did not appear to be the start of the full-scale invasion of the city of Rafah that Israel has repeatedly promised.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight, including two large blasts early on Wednesday.\nSmoke rises following an Israeli bombardment in the Gaza Strip as seen from southern Israel (Leo Correa/AP)The Israeli military reported six launches from Rafah towards the Kerem Shalom crossing on Tuesday.\nCOGAT, the Israeli military body in charge of Palestinian civilian affairs, said the Kerem Shalom crossing reopened early on Wednesday."}, {"id": "9c3605f5-cedb-41f5-9738-788c14c7fc9d", "title": "Israel seizes Gaza vital Rafah crossing , but the US says it isnt the full invasion many fear", "date": "2024-05-08 01:15", "url": "https://www.timesleader.com/news/1653951/israel-seizes-gazas-vital-rafah-crossing-but-the-us-says-it-isnt-the-full-invasion-many-fear", "message": "Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, on Tuesday.\nThey have been closed for at least the past two days, though the smaller Erez crossing between Israel and northern Gaza continues to operate.\nBiden warned Netanyahu again Monday against launching an invasion of the city after Israel ordered 100,000 Palestinians to evacuate parts of Rafah.\nIsrael’s 401st Brigade took “operational control” of the Gaza side of the Rafah crossing early Tuesday, the military said.\nIsraeli authorities denied the U.N. humanitarian affairs office access to the Rafah crossing Tuesday, said its spokesman, Jens Laerke."}, {"id": "a7208435-1421-488b-b720-fba4e0ea06e1", "title": "Prosecutor Office : Ukrainian oligarch Kolomoisky suspected of ordering murder of lawyer in 2003", "date": "2024-05-08 15:15", "url": "https://www.yahoo.com/news/prosecutors-office-ukrainian-oligarch-kolomoisky-135207605.html", "message": "Jailed Ukrainian oligarch Ihor Kolomoisky is suspected of ordering the murder of the head of a law firm more than 20 years ago in Crimea, the Prosecutor General's Office reported on May 8.\nHe is the wealthiest businessman to have landed behind bars in Ukraine's independent history.\nFour men who were part of a \"criminal gang\" attacked the law firm's director, beating him and stabbing him.\nOn May 8, Ukrainian law enforcement officially announced that Kolomoisky was suspected of ordering the assassination.\nSubscribe to the NewsletterUkraine Business RoundupSubscribeThe Shevchenkivskyi district court recently extended Kolomoisky's detention for another two months on Feb. 28 until April 28."}, {"id": "9424ee0d-ae12-4b9b-827b-75688cedbc13", "title": "Grit , humor , grief and gloom mix as Ukrainians face a dangerous new phase in the war", "date": "2024-05-08 07:30", "url": "https://indianexpress.com/article/world/grit-humor-grief-gloom-mix-ukrainians-face-dangerous-phase-war-9315276/", "message": "Taking part in an art class for women bereaved by war, she’s trying to capture her boyfriend’s humor and heroism, and channel her roiling emotions onto canvas.\nAdvertisementMany other Ukrainians also are wrestling with a potent mix of emotions – including grief, anger, humor, defiance and fear – as they face a new phase in the war with growing concern about international support for their cause.\nMost remain firm in their resolve to drive out the Russian invaders and decide their country’s future course.\nMany also worry that international attention is distracted by the Israel-Hamas war and other concerns, and that allies aren’t delivering much-needed weapons and ammunition.\nResidents have adapted to war, and nowadays, few head for the shelter of the subway when air alarms sound."}, {"id": "ead04720-d76c-4867-a67c-5fc02716a8a7", "title": "SECNAV Names Future Nuclear Sub USS Miami , Estefan as Sponsor", "date": "2024-05-08 02:15", "url": "https://www.miragenews.com/secnav-names-future-nuclear-sub-uss-miami-1230257/", "message": "The future USS Miami honors the city of Miami and the crews of three previously Navy vessels to bear the name.\n\"Miami is a shining example of what happens when a city welcomes all who come seeking a better life.\"\nAlong with the ship's name, Secretary Del Toro announced that international pop star Gloria Estefan will be the sponsor for the future USS Miami.\nIn her role, Gloria Estefan will represent a lifelong relationship with the ship and crew.\nThe city of Miami has been honored with three previous vessels: a gunboat (1862-1865), a light cruiser (1942-1947), and a nuclear-powered submarine (1990-2014)."}, {"id": "0adc6012-1c5f-4835-bb24-17405f98668e", "title": "Live updates : Israel - Hamas war , Rafah crossing , bombings , Gaza ceasefire deal", "date": "2024-05-08 04:30", "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-05-08-24/", "message": "The Norwegian Refugee Council said none of its aid trucks managed to cross into the Gaza Strip via the Kerem Shalom crossing on Wednesday.\nEarlier Wednesday, Israel claimed the aid crossing had been reopened.\nHowever, Jan Egeland, the head of the Norwegian Refugee Council, told CNN's Isa Soares that although he heard the Kerem Shalom border crossing would open, \"we have no trucks going over.\nI have heard of no humanitarian trucks over Kerem Shalom.\"\nEgeland said the Norwegian Refugee Council had a few aid trucks enter Gaza through the Rafah crossing late last week, but since then, the NRC has run out of fuel and has no cash to rent a car or trucks to deliver the additional aid."}, {"id": "b4d19112-41b8-4d57-b831-76ac80672b41", "title": "Some on the Right Are Having a Moral Meltdown", "date": "2024-05-08 07:30", "url": "https://www.frontpagemag.com/some-on-the-right-are-having-a-moral-meltdown/", "message": "Some leading figures on the Right are as confused as the Left on some of the most important moral issues.\nHere is what he said:“People on my side … on the Right, you know, have spent 80 years defending dropping nuclear weapons on civilians.\nBut here I will confine myself to a brief moral defense of President Harry Truman’s decision to drop the atom bombs on Japan.\nBecause the average American knows little about history, few Americans know how vile the Japanese were during World War II.\nWhat explains the moral confusion of some on this New Right is worthy of another column."}, {"id": "34e0a832-61b9-4748-b1f9-bb75f9beaa66", "title": "US pauses arms shipment to Israel over Rafah invasion plans", "date": "2024-05-08 19:15", "url": "https://www.ocregister.com/2024/05/08/us-pauses-arms-shipment-to-israel-over-rafah-invasion-plans/", "message": "Washington has not made a final decision on whether to proceed with the shipment, according to the official.\nBefore that, Ronald Reagan halted a shipment of cluster-type artillery shells after Israel’s invasion of Lebanon in 1982.\nAnd Richard Nixon held off providing arms to Israel for the first week of the 1973 Yom Kippur war.\nThe U.S. has urged Israel not to attack Rafah unless it can move out the civilians first.\nCease-fire talks between Israel and Hamas continue but remain stuck over Hamas’s demand that any pause in fighting is effectively permanent."}, {"id": "f23c1952-daf0-4539-aada-ff37609c6158", "title": "SECNAV Del Toro Names Future Nuclear - Powered Attack Submarine USS Miami with Gloria Estefan as Sponsor", "date": "2024-05-08 19:30", "url": "https://seapowermagazine.org/secnav-del-toro-names-future-nuclear-powered-attack-submarine-uss-miami-with-gloria-estefan-as-sponsor/", "message": "Secretary of the Navy Carlos Del Toro announced that future Virginia-class nuclear-powered attack submarine SSN 811 will be named USS Miami.\nAlong with the ship’s name, Secretary Del Toro announced that international pop star Gloria Estefan will be the sponsor for the future USS Miami.\nIn her role, Gloria Estefan will represent a lifelong relationship with the ship and crew.\n(U.S. Navy photo by MC3 William Bennett IV)From SECNAV Public Affairs, May 7, 2024Secretary of the Navy Carlos Del Toro announced that future Virginia-class nuclear-powered attack submarine SSN 811 will be named USS Miami.\nThe future USS Miami honors the city of Miami and the crews of three previously Navy vessels to bear the name."}, {"id": "b8d0ffc1-8fb6-47ca-b707-f5ea7435c779", "title": "Belarus Says It Checking Preparedness Of Its Tactical Nuclear Forces", "date": "2024-05-08 14:30", "url": "https://www.globalsecurity.org/wmd/library/news/belarus/2024/belarus-240507-rferl01.htm", "message": "Belarus Says It's Checking Preparedness Of Its Tactical Nuclear ForcesBy RFE/RL's Belarus Service May 07, 2024The Belarusian Defense Ministry said on May 7 that it had started to check the preparedness of it tactical nuclear forces, a day after Russia announced a similar move.\nFirst Deputy Defense Minister Viktar Hulevich said some Belarusian armed forces and aircraft will be redeployed to a reserve airfield during the exercises.\nBelarusian Defense Minister Viktar Khrenin said the checks for preparedness of the carriers of the tactical nuclear weapons started at the order of authoritarian ruler Alyaksandr Lukashenka.\nLukashenka supported Russia's ongoing unprovoked invasion of Ukraine launched in February 2022 and allowed Russian armed forces to use Belarusian territory, military infrastructure, and airspace during the invasion.\nA day before the announcement from Minsk, Russia's Defense Ministry announced drills involving tactical nuclear weapons for the first time since it launched its aggression against Ukraine more than two years ago."}, {"id": "28e8201e-5e35-42b4-9e0c-5d530a3d38eb", "title": "Palestinian death toll in Gaza climbs to 34 , 789", "date": "2024-05-08 04:15", "url": "http://www.china.org.cn/world/2024-05/08/content_117173140.htm", "message": "视频播放位置 下载安装Flash播放器A man holds the body of a child killed in an Israeli airstrike at a hospital in the southern Gaza Strip city of Rafah, on May 7, 2024.\n[Photo/Xinhua]The Palestinian death toll from ongoing Israeli attacks on the Gaza Strip has risen to 34,789, health authorities in Gaza said in a press statement on Tuesday.\nThe Israeli army killed 54 people and wounded 96 others during the past 24 hours, bringing the total death toll to 34,789 and injuries to 78,204 since the Palestinian-Israeli conflict broke out in October last year, according to the statement.\nAt least one Palestinian was killed and nine others were injured by Israeli troops' gunfire during a nearly 20-hour military operation in the city of Tulkarm in the northern West Bank, Palestinian medical sources said on Tuesday.\nIsrael launched a large-scale offensive against Hamas in the Gaza Strip to retaliate the movement's surprise attack on southern Israel on Oct. 7, 2023, during which about 1,200 people in Israel were killed and more than 200 were taken hostage."}, {"id": "f61461f4-d43d-4f97-9709-fec865a5b31a", "title": "German Army confirms video conference security breach ; recordings of over 6 , 000 meetings leaked online – NaturalNews . com", "date": "2024-05-08 10:00", "url": "https://www.naturalnews.com/2024-05-07-german-army-security-breach-6000-meetings-leaked.html", "message": "German Army confirms video conference security breach; recordings of over 6,000 meetings leaked onlineThe German Army has confirmed that it has discovered a security breach in the video conferencing system it uses , raising significant concerns about the privacy and security of military communications.\nThe leaked 38-minute recording, aired on Russia's state broadcaster RT and later confirmed by the German government, featured discussions among German military officers regarding missile transfers to Ukraine.\nThe leaked audio tape reignited debates over German missile deliveries to Ukraine and raised concerns about the security of government communications online.\nParliamentary Commissioner for the Armed Forces Eva Hogl called for comprehensive measures to enhance military security and counter espionage, stressing the need for increased vigilance.\nThe incident also prompted scrutiny of communication platforms like WebEx, with past security vulnerabilities adding to concerns about confidential communications."}, {"id": "87af4256-4265-4ab5-ade3-2f3db94deea7", "title": "WATCH : IDF storms Rafah , destroys over 100 terror targets", "date": "2024-05-08 19:15", "url": "https://www.jpost.com/breaking-news/article-800458", "message": "The IDF continued its limited Rafah operation on Wednesday while holding back from a larger operation pending the ongoing hostage negotiations with Hamas.\nMeanwhile, early Wednesday, the IDF and COGAT announced in a joint statement that the Kerem Shalom crossing into Gaza had reopened.\nRockets fired at Kerem Shalom crossingLate Wednesday, Hamas fired rockets at the crossing.\nMultiple defense sources had not responded to press time regarding whether Kerem Shalom was still open or had reclosed due to the attack.\nThere was also an incident in which Palestinian workers, presumably aid workers, were on their way to the Kerem Shalom crossing and were shot, with multiple workers wounded."}, {"id": "910f64f7-fdd5-45f5-b9d7-6ef6952298d1", "title": "Xi begins Serbia visit on the 25th anniversary of NATO bombing of the Chinese Embassy | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-05-08 04:45", "url": "https://www.asahi.com/ajw/articles/15258845", "message": "BELGRADE, Serbia--Chinese leader Xi Jinping’s visit to European ally Serbia on Tuesday falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during NATO’s air war over Kosovo.\nU.S. jets dropped five bombs on the Chinese Embassy compound in the Serbian capital on May 7, 1999, setting it ablaze and killing three Chinese nationals.\n“The Chinese people value peace but will never allow historical tragedies to happen again,” Xi added.\nThe U.S. at the time apologized and said the embassy bombing was a mistake that happened due to faulty intelligence.\nHe is expected to visit the site of the former embassy and pay his respects to the bombing victims."}, {"id": "b52fbded-e3ae-46c1-95f3-cd471fb2ba42", "title": "Israel seizes Gaza vital Rafah crossing , but the US says it isnt the full invasion many fear", "date": "2024-05-08 02:00", "url": "https://economictimes.indiatimes.com/news/international/world-news/israel-seizes-gazas-vital-rafah-crossing-but-the-us-says-it-isnt-the-full-invasion-many-fear/articleshow/109931714.cms", "message": "He said CIA chief William Burns will attend further talks in Cairo with representatives from Israel, Egypt and Qatar.\nHamas also sent a delegation to Cairo, which will meet separately with the Arab mediators.\nFamilies fled Rafah's eastern neighborhoods on foot or in vehicles and donkey carts piled with mattresses and supplies.\nHe questioned whether military pressure was an effective bargaining tactic.Israel's 401st Brigade took \"operational control\" of the Gaza side of the Rafah crossing early Tuesday, the military said.\n... We don't have Hamas,\" he said.Egypt's Foreign Ministry condemned the seizure of the crossing, calling it \"a dangerous escalation."}, {"id": "99586191-3626-48b3-ab8e-2b8b50c97ed0", "title": "Israel seizes Gaza vital Rafah crossing , but the US says it isnt the full invasion many fear", "date": "2024-05-08 02:00", "url": "https://www.stltoday.com/news/nation-world/israel-seizes-gaza-s-vital-rafah-crossing-but-the-us-says-it-isn-t-the/article_b510d14a-0c53-11ef-aeab-5feb0d622025.html", "message": "They have been closed for at least the past two days, though the smaller Erez crossing between Israel and northern Gaza continues to operate.\nKirby said Israel described it as “an operation of limited scale and duration” aimed at cutting off Hamas arms smuggling.\nBiden warned Netanyahu again Monday against launching an invasion of the city after Israel ordered 100,000 Palestinians to evacuate parts of Rafah.\nIsrael's 401st Brigade took “operational control” of the Gaza side of the Rafah crossing early Tuesday, the military said.\nIsraeli authorities denied the U.N. humanitarian affairs office access to the Rafah crossing Tuesday, said its spokesman, Jens Laerke."}, {"id": "8982f595-ca8b-4b0f-a495-5e5818803633", "title": "Power Grid Operator Comments On Consequences Of Russian Strikes", "date": "2024-05-08 10:00", "url": "https://menafn.com/1108187418/Power-Grid-Operator-Comments-On-Consequences-Of-Russian-Strikes", "message": "That's according to NEC Ukrenergo , Ukrinform reports.\nThe equipment was damaged at one of the Ukrenergo facilities in the central region,\" the statement says.\nAir defense forces59 Russian missiles, drones overnight Wed\"The enemy is not abandoning plans to deprive Ukrainians of electricity.\nAs reported, overnight Wednesday, May 8, Russian invaders launched a combined strike involving missiles of various types and attack drones.\nIn total, the enemy employed 76 means of air attack: 55 missiles and 21 one-way attack drones."}, {"id": "d0ac28f7-5930-4fb2-acae-8905b5a6f467", "title": "Russia biggest airstrike in weeks piles pressure on Ukraine power grid", "date": "2024-05-08 10:00", "url": "https://tribune.com.pk/story/2465665/russias-biggest-airstrike-in-weeks-piles-pressure-on-ukraine-power-grid", "message": "PHOTO: REUTERSRussian missiles and drones struck nearly a dozen Ukrainian critical infrastructure facilities in a major airstrike early on Wednesday, causing serious damage at three Soviet-era thermal power plants, Kyiv officials said.\nTwo people were injured in the Kyiv region and one was hurt in the Kirovohrad region, Interior Minister Ihor Klymenko said.\nSome 350 rescuers were racing to minimise the damage caused to multiple energy facilities, 30 homes, public transport vehicles, cars and a fire station, he said.\nThe strike was the latest in a wave of attacks on critical energy infrastructure that began in March.\nGovernors of the Vinnytsia and Zaporizhzhia regions said separately that critical civilian infrastructure facilities were damaged, without providing further detail."}, {"id": "4e631cf4-9eec-4e73-b1e0-83eff5f64918", "title": "Israel reopens key Kerem Shalom border crossing for Gaza aid", "date": "2024-05-08 11:45", "url": "https://saudigazette.com.sa/article/642714/World/Mena/Israel-reopens-key-Kerem-Shalom-border-crossing-for-Gaza-aid", "message": "TEL AVIV — Israel says it is reopening the Kerem Shalom crossing with southern Gaza for aid deliveries, four days after it was closed because of Hamas rocket fire.\nIt came after Israeli troops took full control of the Palestinian side of the Rafah crossing with Egypt.\nSeven months into its war with Hamas in Gaza, Israel has said that victory is impossible without taking Rafah.\nAnother six projectiles were fired at Kerem Shalom from the Rafah area on Tuesday, but no casualties were reported.\nOn Wednesday morning, the Israeli military said it had informed international organizations about the reopening of Kerem Shalom for humanitarian aid."}, {"id": "cf10b3cd-1ea0-4d71-b953-4e8917437712", "title": "Issa Haddad : Church rioter unleashes on media and police outside court", "date": "2024-05-08 07:45", "url": "https://www.9news.com.au/national/church-rioter-unleashes-on-media-and-police-outside-court/0ff85c78-3886-4fb9-9045-92da41d7283b", "message": "A man who took part in a violent uprising at a western Sydney church has swung his arms and spat at journalists outside court.\nREAD MORE: Woman stabbed outside Sydney gymIssa Haddad (right) was spoken to by police after an altercation with media as he departed the Fairfield Local Court in Sydney.\nHaddad yelled at reporters to leave him alone, while he told a police officer who tried to help him up to \"f--- off\".\n(9News)He has pleaded guilty to threatening violence to cause fear during a riot outside the Christ the Good Shepherd in Wakeley.\nFollowing the attack, a crowd swelled outside the church as members of the congregation pinned down the attacker inside."}, {"id": "bef501e0-05e1-4a8c-8612-c2f6d374b096", "title": "Pakistan Army alleges plot to kill Chinese engineers was hatched in Afghanistan | Indiablooms - First Portal on Digital News Management", "date": "2024-05-08 07:00", "url": "https://www.indiablooms.com/world-details/SA/42523/pakistan-army-alleges-plot-to-kill-chinese-engineers-was-hatched-in-afghanistan.html", "message": "Photo Courtesy: X page video grabThe Pakistan Army has alleged that the plot to kill Chinese engineers in a suicide attack in Khyber Pakhtunkhwa’s Shangla region Mar 26 was hatched in Afghanistan.\n\" This suicide bombing also connects to across the border [in Afghanistan]; the planning of this terrorism [act] was done in Afghanistan.\nTerrorists and their facilitators were also being controlled from Afghanistan and the suicide bomber was also an Afghan [national],\" he said.\n“There is concrete evidence that TTP terrorists are still using Afghan soil to launch attacks in Pakistan,” Sharif said.\nFive Chinese engineers and their Pakistani driver were killed after a suicide bomber rammed his explosive-laden vehicle into their convoy."}, {"id": "6e09bd24-6967-4dd8-9492-133c7df465ab", "title": "Xi begins Serbia visit on the 25th anniversary of Nato bombing of the Chinese embassy", "date": "2024-05-08 06:45", "url": "https://timesofindia.indiatimes.com/world/europe/xi-begins-serbia-visit-on-the-25th-anniversary-of-natos-bombing-of-the-chinese-embassy/articleshow/109939304.cms", "message": "The intended target, Washington said, was the headquarters of a Serbian state arms exporter located on the same street, a few blocks away.\n\"Imagine that somebody would, even by accident, strike an American Embassy somewhere around the world.\n\"Angry protesters in China stormed US diplomatic installations as the bombing fueled anti-American sentiments and speculation that the attack was intentional rather than accidental.\n\"While straining Beijing's relations with the US, the embassy bombing brought China and Serbia closer together.\nIn Belgrade, a huge Chinese flag was placed on a skyscraper along a roadway leading into the city from the airport."}, {"id": "17d8d679-4c26-48f0-a53d-a912916e3cf6", "title": "Russia warns Britain and plans nuclear drills over the West possible deepening role in Ukraine - New Delhi Times - India Only International Newspaper", "date": "2024-05-08 01:15", "url": "https://www.newdelhitimes.com/russia-warns-britain-and-plans-nuclear-drills-over-the-wests-possible-deepening-role-in-ukraine/", "message": "It was the first time Russia has publicly announced drills involving tactical nuclear weapons, although its strategic nuclear forces regularly hold exercises.\nTactical nuclear weapons include air bombs, warheads for short-range missiles and artillery munitions and are meant for use on a battlefield.\nU.N. spokesman Stephane Dujarric expressed concern that various parties have been talking about issues regarding nuclear weapons more and more recently.\nIn March 2023, after the U.K.’s decision to provide Ukraine with armor-piercing shells containing depleted uranium, Putin said he intends to deploy tactical nuclear weapons on the territory of Ukraine neighbor Belarus.\nThe ministry said the exercise is intended to “increase the readiness of non-strategic nuclear forces to fulfill combat tasks” and will be held on Putin’s orders."}, {"id": "2dbdadf1-a074-42b6-881c-1c917f44017c", "title": "Hezbollah Leader Praises Campus protesters", "date": "2024-05-08 03:00", "url": "https://hotair.com/jazz-shaw/2024/05/07/hamas-leader-praises-campus-protesters-n3787935", "message": "For example, Sheikh Naim Qassem, the Deputy Secretary-General of Hezbollah is a big fan.\nHe wrote a glowing endorsement of them last week which has now been translated and released to American media outlets.\nThe Sheikh believes that the protesters are being very effective in weakening Joe Biden's support for Israel.\nHezbollah is no doubt rooting for Joe Biden to win in November.\nThe Sheikh went on to say that Joe Biden will be influenced by the protesters whether he wants to or not."}, {"id": "78f4f691-d8a4-4392-bd9c-d9c4beff36d1", "title": "Israel seizes Gaza vital Rafah crossing , but the US says it isnt the full invasion many fear", "date": "2024-05-08 00:30", "url": "https://www.krgv.com/news/israel-seizes-gaza-s-vital-rafah-crossing-but-the-us-says-it-isn-t-the-full-invasion-many-fear", "message": "Israel seizes Gaza's vital Rafah crossing, but the US says it isn't the full invasion many fearPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\nHe said Israel had described it as \"an operation of limited scale and duration\" aimed at cutting off Hamas arms smuggling.\nBiden warned Netanyahu again Monday against launching an invasion of the city after Israel ordered 100,000 Palestinians to evacuate from parts of Rafah.\nIsrael's 401st Brigade took \"operational control\" of the Gaza side of the Rafah crossing early Tuesday, the military said.\nThe Rafah crossing with Egypt and the Kerem Shalom crossing with Israel are critical entry points for food, medicine and other supplies for Gaza's 2.3 million people."}, {"id": "b8f2da77-944a-4ef7-aa0a-06d9b4df8f5b", "title": "Ukraine hits oil depot in Russian - held city , local leader says", "date": "2024-05-08 01:00", "url": "https://www.swissinfo.ch/eng/ukraine-hits-oil-depot-in-russian-held-city%2c-local-leader-says/77117804", "message": "Ukraine hits oil depot in Russian-held city, local leader says2 minutes(Reuters) -Ukrainian forces attacked an oil storage depot and sparked a large fire, injuring five people late on Tuesday on the outskirts of the Russian-held city of Luhansk in eastern Ukraine, the region’s Russia-installed leader said.\n“Late at night, the enemy made a strike on the peaceful city of Luhansk, shelling an oil storage depot on the edge of the city,” Leonid Pasechnik, head of the Luhansk People’s Republic, wrote on Telegram.\nVideo posted on the sites of both Russian and Ukrainian war bloggers showed a large fire burning some distance from apartment buildings.\nUkrainian war bloggers reported the strike, one suggesting it was carried out by a missile.\nSeparatist fighters backed and financed by Russia seized control of large chunks of Luhansk and Donetsk regions in eastern Ukraine in 2014 after Moscow annexed Crimea."}, {"id": "1066783d-f716-477d-aeba-b198b7a334d3", "title": "Israel reopens key crossing for aid to enter Gaza after rocket attack", "date": "2024-05-08 11:15", "url": "https://www.oxfordmail.co.uk/news/national/24305011.israel-reopens-key-crossing-aid-enter-gaza-rocket-attack/", "message": "The Kerem Shalom crossing between Gaza and Israel was closed over the weekend after a Hamas rocket attack killed four Israeli soldiers nearby, and on Tuesday, an Israeli tank brigade seized the nearby Rafah crossing between Gaza and Egypt, forcing its closure.\nThe Israeli foray did not appear to be the start of the full-scale invasion of the city of Rafah that Israel has repeatedly promised.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight, including two large blasts early on Wednesday.\nSmoke rises following an Israeli bombardment in the Gaza Strip as seen from southern Israel (Leo Correa/AP)The Israeli military reported six launches from Rafah towards the Kerem Shalom crossing on Tuesday.\nCOGAT, the Israeli military body in charge of Palestinian civilian affairs, said the Kerem Shalom crossing reopened early on Wednesday."}, {"id": "ddac826d-0a78-4ca4-83cb-700b8698397e", "title": "Russia launches wide attack on Ukrainian energy facilties", "date": "2024-05-08 10:00", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/05/08/russia-launches-wide-attack-on-ukrainian-energy-facilties/", "message": "Russian forces unleashed a night-time barrage of more than 50 cruise missiles and explosive drones at Ukraine’s power grid, targeting a wide area in what President Volodymyr Zelensky called a “massive” attack.\nThe mass barrages also drain Ukrainian air defences of ammunition as Kyiv’s depleted forces await delivery of the latest batch of promised Western military support.\nFlames burn in a crater following a Russian missile attack in Zaporizhzhia, Ukraine (Andriy Andriyenko/AP)DTEK, Ukraine’s biggest private energy supplier, said the attack “seriously damaged” equipment at three of its thermal power plants.\nRussia launched 55 missiles and 21 Shahed drones overnight, the Ukrainian air force said.\nAir defences downed 39 of the missiles and 20 of the drones, Ukrainian air force commander Mykola Oleshchuk said."}, {"id": "f40d65e5-4aae-4671-8c9d-5c8135752552", "title": "Russians attack power facilities in six Ukrainian oblasts overnight", "date": "2024-05-08 09:15", "url": "https://www.yahoo.com/news/russians-attack-power-facilities-six-032644865.html", "message": "Stock photo: State Emergency Service of UkrainePower generation and transmission facilities in six of Ukraine’s oblasts were attacked by the Russians on the night of 7-8 May.\nThe oblasts of Poltava, Kirovohrad, Zaporizhzhia, Lviv, Ivano-Frankivsk and Vinnytsia came under Russian fire.\nBackground:On the night of 7-8 May, Russia launched a missile attack on Ukraine.\nAn air-raid warning was issued in all oblasts of the country.\nNo casualties or damage were reported in Kyiv after the Russian missile strike on the night of 7-8 May."}, {"id": "50c2ab01-d2d4-43ad-b7a9-69e9e8aed704", "title": "US pauses arms shipment to Israel over Rafah invasion plans", "date": "2024-05-08 18:45", "url": "https://www.presstelegram.com/2024/05/08/us-pauses-arms-shipment-to-israel-over-rafah-invasion-plans/", "message": "Washington has not made a final decision on whether to proceed with the shipment, according to the official.\nBefore that, Ronald Reagan halted a shipment of cluster-type artillery shells after Israel’s invasion of Lebanon in 1982.\nAnd Richard Nixon held off providing arms to Israel for the first week of the 1973 Yom Kippur war.\nThe U.S. has urged Israel not to attack Rafah unless it can move out the civilians first.\nCease-fire talks between Israel and Hamas continue but remain stuck over Hamas’s demand that any pause in fighting is effectively permanent."}, {"id": "f73dabf5-a9cc-4eb5-819b-870a1d086764", "title": "Xi Jinping to Visit Serbia on Anniversary of NATO Bombing Chinese Embassy", "date": "2024-05-08 01:45", "url": "https://www.breitbart.com/national-security/2024/05/07/xi-jinping-visit-serbia-anniversary-nato-bombing-chinese-embassy/", "message": "Genocidal Chinese dictator Xi Jinping is expected to arrive in Serbia on Tuesday, the 25th anniversary of NATO forces bombing the Chinese embassy in Belgrade.\nXi made clear prior to arriving in Serbia that he did not view NATO countries as allies or the NATO agenda as necessarily compatible with China’s by acknowledging the anniversary.\nThe bombing of the Chinese embassy in Belgrade served no overt military or geopolitical purpose and the administration of leftist then-President Bill Clinton declared it entirely an error.\nIn a letter to Chinese authorities in June 1999, top State Department official Thomas Pickering said plainly, “the attack was a mistake.”“Let me emphasize: no one targeted the Chinese Embassy.\n🇳🇷 pic.twitter.com/bgnckx1GX1 — Hua Chunying 华春莹 (@SpokespersonCHN) May 6, 2024In addition to France and Serbia, Xi will also visit Hungary in the last leg of his Europe tour."}, {"id": "7bd5ecf4-ab28-4d7a-819e-d64d0a1744bd", "title": "Xi begins Serbia visit on the 25th anniversary of NATO bombing of the Chinese Embassy", "date": "2024-05-08 02:15", "url": "https://www.wfmz.com/news/ap/ap-business/xi-begins-serbia-visit-on-the-25th-anniversary-of-natos-bombing-of-the-chinese-embassy/article_6d6312a5-0006-542e-b7d4-34404d8cfadd.html", "message": "BELGRADE, Serbia (AP) — Chinese leader Xi Jinping's visit to European ally Serbia on Tuesday falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during NATO's air war over Kosovo.\nU.S. jets dropped five bombs on the Chinese Embassy compound in the Serbian capital on May 7, 1999, setting it ablaze and killing three Chinese nationals.\n“The Chinese people value peace but will never allow historical tragedies to happen again,\" Xi added.\nThe U.S. at the time apologized and said the embassy bombing was a mistake that happened due to faulty intelligence.\nHe is expected to visit the site of the former embassy and pay his respects to the bombing victims."}, {"id": "0f2c46d3-9b86-463a-93e0-bddbdba95dca", "title": "Xi begins Serbia visit on the 25th anniversary of NATO bombing of the Chinese Embassy", "date": "2024-05-08 03:00", "url": "https://gazette.com/ap/international/xi-begins-serbia-visit-on-the-25th-anniversary-of-natos-bombing-of-the-chinese-embassy/article_cdbb3383-37ba-515f-91ce-a9970b5a7062.html", "message": "Xi begins Serbia visit on the 25th anniversary of NATO's bombing of the Chinese EmbassyChinese leader Xi Jinping’s visit to European ally Serbia falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy during NATO’s air war over Kosovo"}, {"id": "a8e99425-f10f-4deb-8910-4da813b5e08f", "title": "Burnt houses , broken trolleybuses , giant craters Photos & video of Russia mass attack on Ukraine on May 8", "date": "2024-05-08 12:45", "url": "https://www.yahoo.com/news/burnt-houses-broken-trolleybuses-giant-115500911.html", "message": "Initial reports suggest the following:Read also: Russia attacks six Ukrainian oblasts in effort to cripple Ukraine's electricity infrastructureNV collected photos and video of the consequences of Russia's latest mass attack.\nKyiv OblastTwo people were injured in the village of Krasylivka near Brovary and 13 private buildings were destroyed or damaged by enemy missile debris.\nДСНСREUTERS/Thomas PeterREUTERS/Thomas PeterZaporizhzhyaRussia struck critical and civil infrastructure facilities, a garage, a city park, and the city's electric transport.\nREUTERS/Gleb GaranichReuters/ Gleb GaranichWe’re bringing the voice of Ukraine to the world.\nRead the original article on The New Voice of Ukraine"}, {"id": "bdde8fa2-8911-480c-aa03-8faa02266d79", "title": "Partisans Report Arrival of Numerous Killed and Wounded Russian Soldiers in Occupied Crimea", "date": "2024-05-08 17:15", "url": "https://www.kyivpost.com/post/32322", "message": "“At the station, we noticed massive transportation of the wounded and ‘200’ [killed] from the left bank of the occupied Kherson region,” the report read.\nAdvertisement“The occupation regime continues to restore Soviet weapons systems for use in the war against the Ukrainian people,” the partisans reported.\nUkrainian partisans from the Atesh movement confirmed their involvement in the attack.\nThe attack took out three radar stations, an air defense equipment control point, and “Fundament-M” airspace surveillance equipment, with casualties still being clarified, HUR said.\n“The occupiers believed in their newest air defense system so much that they placed warehouses with missiles right next to the launcher,” the partisans added."}, {"id": "3de070d6-c6e4-4df3-a9af-652e27aeeb01", "title": "Xi begins Serbia visit on the 25th anniversary of NATO bombing of the Chinese Embassy", "date": "2024-05-08 02:15", "url": "https://www.smdailyjournal.com/business/xi-begins-serbia-visit-on-the-25th-anniversary-of-natos-bombing-of-the-chinese-embassy/article_224784a2-e365-5007-9d5b-ce421987b7ab.html", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "562be9e1-b598-4fa1-8bf8-6c0d31ab6a0c", "title": "Security forces kill six terrorists in two different operations in KP", "date": "2024-05-08 19:15", "url": "https://thefrontierpost.com/security-forces-kill-six-terrorists-in-two-different-operations-in-kp/", "message": "ReportPESHAWAR: Six terrorists were killed in two different operations in Khyber Pakhtunkhwa today.\nAccording to ISPR, the security forced conducted an intelligence based operation in Dera Ismail Khan District during which five terrorists were neutralized.\nIn another fire exchange in North Waziristan District, own troops effectively engaged terrorists’ location as a result of which another Terrorist Inam Ullah was killed.\nWeapons, ammunition and explosives were also recovered from the killed terrorists, who remained actively involved in numerous terrorist activities against the security forces as well as innocent civilians.\nSanitization operation is being carried out to eliminate any other terrorist found in the area as the security forces are determined to wipe out the menace of terrorism from the country."}, {"id": "6cb7d6b6-4110-47e9-83a3-fa64dddadd45", "title": "Despite setbacks , US sees Israel - Hamas cease - fire within reach", "date": "2024-05-08 01:45", "url": "https://www.voanews.com/a/despite-setbacks-us-sees-israel-hamas-cease-fire-within-reach/7602347.html", "message": "The U.S. expressed optimism that a cease-fire agreement in Gaza is within reach, a day after Prime Minister Benjamin Netanyahu rejected a version of the deal that Hamas said it has accepted.\nCIA Director William Burns is in Cairo, Kirby said, acting as an interlocutor for the United States in negotiations involving Israel, Hamas, Egypt and Qatar.\nThe talks are aimed at achieving a temporary cease-fire accompanied by the release of some Israeli hostages held by Hamas in exchange for Palestinian prisoners held by Israel.\nIsrael said the plan did not meet its demands to eliminate Hamas' role from post-war Gaza.\nIn response, Hamas on Tuesday warned Israel there would be no cease-fire if military action continues in Rafah."}, {"id": "fe39ff17-5357-49b1-bd1e-7c77c8cd638c", "title": "US and Philippine forces sink ship during drills in disputed South China Sea", "date": "2024-05-08 11:15", "url": "https://guernseypress.com/news/world-news/2024/05/08/us-and-philippine-forces-sink-ship-during-drills-in-disputed-south-china-sea/", "message": "US and Philippine forces, backed by an Australian air force surveillance aircraft, unleashed a barrage of high-precision rockets, artillery fire and airstrikes on Wednesday – sinking a mock enemy ship as part of largescale war drills in and near the disputed South China Sea that have antagonised Beijing.\nMr Marcos has ordered his military to shift its focus to external defence from decades-long domestic anti-insurgency operations as China’s actions in the South China Sea become a top concern.\nChina has angered the Philippines by repeatedly harassing its navy and coast guard ships with powerful water cannons and a military-grade laser, blocking movements and other dangerous manoeuvres in the high seas near two disputed South China Sea shoals.\nThe Philippines has repeatedly cited a 2016 international arbitration ruling based on the United Nations Convention of the Law of the Sea that invalidated China’s claim over virtually the entire South China Sea on historical grounds.\nChina has opposed military drills involving US forces as well as increasing US military deployments in the region, which it warned would escalate tensions and endanger regional stability."}, {"id": "77306982-6871-42e8-ac15-f335827a1023", "title": "Xi begins Serbia visit on the 25th anniversary of NATO bombing of the Chinese Embassy", "date": "2024-05-08 03:00", "url": "http://www.koreatimes.co.kr/www/world/2024/05/501_374205.html", "message": "Chinese leader Xi Jinping's visit to European ally Serbia on Tuesday falls on a symbolic date: the 25th anniversary of the bombing of the Chinese Embassy in Belgrade during NATO's air war over Kosovo.\nU.S. jets dropped five bombs on the Chinese Embassy compound in the Serbian capital on May 7, 1999, setting it ablaze and killing three Chinese nationals.\n“The Chinese people value peace but will never allow historical tragedies to happen again,\" Xi added.\nThe U.S. at the time apologized and said the embassy bombing was a mistake that happened due to faulty intelligence.\nHe is expected to visit the site of the former embassy and pay his respects to the bombing victims."}, {"id": "e99336ad-5724-4fdb-94e7-4c62455b957e", "title": "Terrorist Arrested for Attaching IED to Palestinian Flag in Attack", "date": "2024-05-08 15:30", "url": "https://www.algemeiner.com/2024/05/08/terrorist-arrested-attaching-ied-palestinian-flag-attack/", "message": "i24 News — The Israel Defense Forces (IDF) and Shin Bet security agency (ISA) forces have made a breakthrough in the case of a bomb attack last month involving an improvised explosive device (IED) attached to a Palestinian Authority (PA) flag in the Binyamin region of the West Bank.\nMuhammad Atallah Abu Alia, 22, was apprehended earlier this week on suspicion of his involvement in the attack, which left a 25-year-old IDF reservist lightly wounded when the device detonated while he attempted to remove the flag near the town of Kochav Hashachar.\nAccording to reports, during interrogation by the ISA, Alia confessed to his participation in constructing the explosive device and carrying out the attack.\nAdditionally, materials used in the creation of the IED were seized during his arrest.\nI was injured by shrapnel on my hands and that was it."}, {"id": "5ebd77de-eb07-45fe-9e93-e198b119df4a", "title": "Gallant Gauls : A Journey Through Ancient Europe", "date": "2024-05-08 18:00", "url": "https://www.ancient-origins.net/history-famous-people/gauls-0020756", "message": "The story of the Gauls, ancient inhabitants of modern-day France, Belgium, Switzerland, and parts of Italy, offers a fascinating journey into a civilization often overshadowed by their Roman conquerors.\nEmerging as formidable adversaries to Rome, the Gauls, characterized by their distinct Celtic culture, left an undeniable mark on history.\nThe Gauls recovered from their initial losses and this tactic led to them defeating the combined Greek forces.\nRoman WarsBy the time the Punic Wars rolled around the Gauls had made a name for themselves as deadly mercenaries.\nConclusionThe Gauls, with their vibrant culture and resilient spirit, left a definite mark on the tapestry of ancient Europe."}, {"id": "0a434f18-c276-40b3-a16f-eefa68555e2b", "title": "RIGHT SPEAK : UKR Foils RU Plot to Assassinate Zelensky ; UKR Kraken Unit From Chasiv Yar , Says  no occupiers in city ; RU Loses 2 Combat Planes in 72hrs ; UKR Hits Oil Depot in Luhansk ; UKR Kills 100 RU Troops with US - Supplied Missile ; UKR Forc...", "date": "2024-05-08 07:45", "url": "http://www.rightspeak.net/2024/05/ukr-foils-ru-plot-to-assassinate.html", "message": "Blog Archive: May 2024 (39) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)"}, {"id": "bbd59c4d-22bd-4d80-a33c-7508dd4f4567", "title": "Russia stikes railway station in Kherson in latest attack", "date": "2024-05-08 12:45", "url": "https://www.yahoo.com/news/russia-stikes-railway-station-kherson-111600442.html", "message": "Aftermath of the Russian attackRussia targeted civilian rail infrastructure in Kherson on May 8, Ukrzaliznytsia (Ukrainian Railways) reported on Facebook.\n121/122 Kyiv - Kherson - Kyiv has been temporarily rerouted to Mykolaiv.\nRead also: Three DTEK thermal power plants seriously damaged in latest Russian attack on Ukrainian energyAll 99 passengers are currently safe.\nA fire broke out at an energy infrastructure facility in Poltava Oblast as a result of the attack.\nRussia attacked power generation and transmission facilities in six Ukrainian oblasts, including Poltava, Kirovohrad, Zaporizhzhya, Lviv, Ivano-Frankivsk, and Vinnytsia, Ukrainian Energy Minister Herman Halushchenko reported."}, {"id": "bc203814-ea93-4c7a-b07f-9d1e2139fbb8", "title": "Israel seizes Gaza vital Rafah crossing , but the US says it isnt the full invasion many fear", "date": "2024-05-08 15:15", "url": "https://www.wafb.com/2024/05/07/israeli-forces-seize-rafah-border-crossing-gaza-putting-cease-fire-talks-knifes-edge/", "message": "They have been closed for at least two days, though the smaller Erez crossing between Israel and northern Gaza remains open.\nKirby said Israel described it as “an operation of limited scale and duration” aimed at cutting off Hamas arms smuggling.\nBiden warned Netanyahu again Monday against launching an invasion of the city after Israel ordered 100,000 Palestinians to evacuate parts of Rafah.\nIsrael’s 401st Brigade took “operational control” of the Gaza side of the Rafah crossing early Tuesday, the military said.\nIsraeli authorities denied the U.N. humanitarian affairs office access to the Rafah crossing Tuesday, said its spokesman, Jens Laerke."}, {"id": "c10b7a7d-e1e9-4556-a296-d0c617a325bc", "title": "Opinion : Terror attack on IAF vehicle in Poonch demonstrates security threats", "date": "2024-05-08 11:15", "url": "https://www.siasat.com/opinion-terror-attack-on-iaf-vehicle-in-poonch-demonstrates-security-threats-3022548/", "message": "There was yet another terror attack on the security forces, this time on Indian Air Force vehicles in border district of Poonch on Saturday evening, in which one IAF personnel was killed and four others wounded.\nBut it has demonstrated that terrorism is still breathing in crucial border belt where the targets are hard – army and other wings of security forces.\nIt should prompt the government to have a holistic view of the security situation in the border belt in the overall context of security arrangements for the Lok Sabha polls and beyond.\nThere is yet another reason, the gaps that are widening between the locals and security forces, including police which make the locals to help the men from across in setting up their bases.\nThey were petrified by the acts of the security forces, and also angry that how could the villagers be picked up randomly, and then tortured to death."}, {"id": "ac577b26-2cc2-44cd-a476-3b3171f57d04", "title": "Despite setbacks , US sees Israel - Hamas cease - fire within reach", "date": "2024-05-08 14:30", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240507-voa02.htm", "message": "Despite setbacks, US sees Israel-Hamas cease-fire within reachBy Patsy Widakuswara May 07, 2024The U.S. expressed optimism that a cease-fire agreement in Gaza is within reach, a day after Prime Minister Benjamin Netanyahu rejected a version of the deal that Hamas said it has accepted.\nCIA Director William Burns is in Cairo, Kirby said, acting as an interlocutor for the United States in negotiations involving Israel, Hamas, Egypt and Qatar.\nThe talks are aimed at achieving a temporary cease-fire accompanied by the release of some Israeli hostages held by Hamas in exchange for Palestinian prisoners held by Israel.\nIsrael said the plan did not meet its demands to eliminate Hamas' role from post-war Gaza.\nIn response, Hamas on Tuesday warned Israel there would be no cease-fire if military action continues in Rafah."}, {"id": "72e79d82-78eb-4c88-9ab9-1eae0cbfad44", "title": "  Mass destruction : 2 killed when mobile home explodes in Minnesota – Boston 25 News", "date": "2024-05-08 04:15", "url": "https://www.boston25news.com/news/trending/mass-destruction-2-killed-when-mobile-home-explodes-minnesota/OT5FYDIBCJHHTDD6343NFSOAHA/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "a434a187-5749-4975-a963-579444c99b07", "title": "  Mass destruction : 2 killed when mobile home explodes in Minnesota – KIRO 7 News Seattle", "date": "2024-05-08 05:30", "url": "https://www.kiro7.com/news/trending/mass-destruction-2-killed-when-mobile-home-explodes-minnesota/OT5FYDIBCJHHTDD6343NFSOAHA/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "8bb4c491-5959-4bc7-bbad-0738d61e9e81", "title": "Russo - Ukraine War - 07 May 2024", "date": "2024-05-08 05:15", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-07.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nBesides providing personnel, Chechnya's other key contribution to Russia's war against Ukraine is in providing training for Russian personnel.\nRussian forces fired artillery and mortars at more than 10x settlements, including Makiivka, Nevs'ke (Luhansk oblast), Terny, Yampolivka, Tors'ke (Donetsk oblast).\nRussian forces launched air strikes in the vicinities of Chervonyi Mayak, Ivanivka and Dniprovs'ke (Kherson oblast)."}, {"id": "fdb984c7-970a-4911-953b-f02b84b6e6d0", "title": "Families of Oct . 7 Victims Rally at U . S . Embassy to  Let Israel Win  ", "date": "2024-05-08 01:45", "url": "https://www.breitbart.com/politics/2024/05/07/families-of-oct-7-victims-rally-at-u-s-embassy-to-let-israel-win/", "message": "Families of victims of the October 7 terror attack, and fallen Israeli soldiers, rallied Tuesday at the Tel Aviv branch office of the U.S. embassy in Israel to demand the Biden administration allow Israel to win the war against Hamas.\nReports also emerged Tuesday that the Biden administration went behind Israel’s back to encourage Hamas to say it agreed to a ceasefire — on Hamas’s terms — as a way of dissuading Israel from entering Rafah.\nThe U.S. has also been withholding some ammunition from Israel as a form of pressure.\nHe is the author of the recent e-book, “The Zionist Conspiracy (and how to join it),” now available on Audible.\nHe is also the author of the e-book, Neither Free nor Fair: The 2020 U.S. Presidential Election."}, {"id": "7396cc8e-f63c-4505-937d-7b9286671c58", "title": "First High - Resolution Images of China Third Carrier Fujian During Sea Trials Released", "date": "2024-05-08 18:45", "url": "https://theaviationist.com/2024/05/08/hr-images-of-fujian-released/", "message": "Chinese media estimates that the supercarrier’s weapons and flight tests of aircraft too will be conducted over the next year, possibly alongside the sea trialsThe first high-resolution images of China’s fourth aircraft carrier were released, as the flat-top concluded its first eight-day sea-trials.\nBefore the Fujian set out for sea trials, it underwent comprehensive mooring and equipment calibration trials.\nNext Stage – Flight Trials & Weapons TestsThe next stage in the carrier’s test will include flight trials of J-15 and possibly the J-31/J-35, where its Electro-Magnetic Launch System (EMALS)-powered catapult will launch and retrieve the fighters.\nGlobal Times however estimated an ambitious timeline that involved flight trials to also be concurrently wrapped over the next year along with the sea sailing trials.\nCombined with the Shandong and Liaoning, the carrier strengthens China’s additional line of defense beside the long-range anti-access/area-denial weapons led by the DF-21D anti-ship ballistic missile."}, {"id": "5b67cc4d-6de7-4070-845a-b53b273d55b6", "title": "Israel reopens key crossing for aid to enter Gaza that was closed over weekend rocket attack – Winnipeg Free Press", "date": "2024-05-08 07:15", "url": "https://www.winnipegfreepress.com/world/2024/05/08/israel-reopens-key-crossing-for-aid-to-enter-gaza-that-was-closed-over-weekend-rocket-attack", "message": "The Kerem Shalom crossing between Gaza and Israel was closed over the weekend after a Hamas rocket attack killed four Israeli soldiers nearby, and on Tuesday, an Israeli tank brigade seized the nearby Rafah crossing between Gaza and Egypt, forcing its closure.\nThe Rafah crossing has been a vital conduit for humanitarian aid since the start of the war and is the only place where people can enter and exit.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight, including two large blasts early Wednesday.\nAn Israeli military official said that Hamas had fired unidentified projectiles at Kerem Shalom on Wednesday, confirming an earlier claim from the militant group.\nThe U.S. has historically provided Israel with enormous amounts of military aid, which has only accelerated since the start of the war."}, {"id": "5719eb57-7c87-4bd9-bde9-e4bfd0a820ce", "title": "US signals to Israel more arms shipments could be paused over Rafah offensive", "date": "2024-05-08 18:45", "url": "https://www.theguardian.com/world/article/2024/may/08/us-signals-to-israel-more-arms-shipments-could-be-paused-rafah-offensive-gaza", "message": "US officials have signalled to Israel that more arms shipments could be delayed if the Israeli military pushes ahead with an offensive in Rafah, Gaza, in what would mark the start of a major pivot in relations between the two countries.\nIsraeli officials said it was the first step towards a full-scale assault on Rafah city, an offensive Biden has been trying to head off.\nAustin’s comments confirmed earlier briefings by unnamed officials that the weapons shipment had been held up because of Israel’s threat of a full-scale offensive in Rafah.\nA second US official, also speaking anonymously and quoted by the Washington Post, said the decision was a “shot across the bow” intended to convey to Israel the seriousness of US concerns about the Israeli offensive in Rafah.\nThe CIA director, William Burns, is to travel to Israel on Wednesday to meet Netanyahu, a source said."}, {"id": "8a59128a-9f84-4369-9333-4b1fd34cf790", "title": "Missile , drone battles show future of military build - up", "date": "2024-05-08 07:15", "url": "https://www.theleader.com.au/story/8622068/missile-drone-battles-show-future-of-military-build-up/?cs=30776", "message": "While shooting down hundreds of Iranian drones and missiles fired into Israel was the right thing to do, \"it's something that we probably aren't going to be able to continue to do forever if this threat continues\", he said."}, {"id": "e57076d5-4f69-4e48-a1c5-646819e716f7", "title": "  Mass destruction : 2 killed when mobile home explodes in Minnesota – 95 . 5 WSB", "date": "2024-05-08 04:15", "url": "https://www.wsbradio.com/news/trending/mass-destruction-2-killed-when-mobile-home-explodes-minnesota/OT5FYDIBCJHHTDD6343NFSOAHA/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "8abb0d43-afdf-4d65-836b-e34087ed2103", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 04:30", "url": "https://www.denbighshirefreepress.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "6f90bb98-a95a-45db-aac2-576a643791fe", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:00", "url": "https://www.dunmowbroadcast.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "0ace9a45-ee91-4065-9bf8-328279f64754", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:00", "url": "https://www.countytimes.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "09e21e5c-dcb4-45be-9a37-340a64abfa2f", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:00", "url": "https://www.braintreeandwithamtimes.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "ada0afe4-6839-4d19-b9ad-ca321fbd6b2a", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:00", "url": "https://www.basingstokegazette.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "1be1ce8a-da26-4046-a110-d6d73c8f5b40", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 06:15", "url": "https://www.harrowtimes.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "df4584a6-14b9-4502-982f-19ada1afe9af", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 06:45", "url": "https://www.runcornandwidnesworld.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "ee1dfe72-7882-4e02-91de-bcb16d6f5fba", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 04:45", "url": "https://www.kilburntimes.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "84aae7d4-b03b-405f-9b40-3918c5ad5ac6", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 04:45", "url": "https://www.greenocktelegraph.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "5afd18aa-4508-44a9-b762-37e1184adbe6", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 04:30", "url": "https://www.cravenherald.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "d711ff9a-584b-46dd-a87e-75c73adb17a5", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 07:00", "url": "https://www.andoveradvertiser.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "52290f6e-d29f-4169-99e0-a74c3c346d0c", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:15", "url": "https://www.darlingtonandstocktontimes.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "964c50b3-be23-4367-ad63-c7940c00c760", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:15", "url": "https://www.heraldseries.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "fe101226-8169-41b9-8b74-1c940e0a7128", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:15", "url": "https://www.burnhamandhighbridgeweeklynews.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "dd666725-93d3-48da-ad38-e6e04f49a012", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:15", "url": "https://www.stalbansreview.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "fdf12e6b-2119-41f4-a020-af8b5de6fae5", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-08 05:15", "url": "https://www.thecomet.net/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "e042eb1d-c43d-4579-8de9-35b7b7a26201", "title": "Troops foil kidnap attempts , neutralise terrorists in Kaduna , Borno", "date": "2024-05-08 12:00", "url": "https://dailypost.ng/2024/05/08/troops-foil-kidnap-attempts-neutralise-terrorists-in-kaduna-borno/", "message": "The Nigerian Army said its troops, in their commitment, responded to a distress calls following bandits’ attack in Agunu Dutse Village in Kachia Local Government Area of Kaduna StateIt said during a search and rescue operation, the troops rescued six hostages unhurt, including two women and four children.\nIn a statement on its Facebook page, the Nigerian Army noted that the rescued victims, have been reunited with their families.\n“Troops on fighting patrol were alerted to the presence of terrorists lurking in Amale village in Kaduna North Local Government Area.\nThe troops, in collaboration with local vigilantes, engaged the terrorists, compelling them to abandon their firearms.\n“Similarly, troops of the Nigerian Army deployed for Counter-terrorism operations in the North East and North West on Tuesday, May 7, 2024 in a display of valour successfully foiled multiple kidnap attempts, neutralizing the terrorists’ threats and reuniting victims with their families."}, {"id": "75005c0f-b457-42f6-a156-e0b7e6d05c9f", "title": "May 6 :  Axis of Resistance  operations against Israeli occupation", "date": "2024-05-08 14:30", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240507-presstv08.htm", "message": "The major operations carried out by the Palestinian and regional resistance groups on Monday, May 6, are as follows:Al-Qassam Brigades' operations on May 6:Bombed a gathering of Israeli forces positioned in the \"Netzarim\" axis with 107mm short-range rockets.\nTargeted a gathering of Israeli forces positioned on the \"Netzarim\" axis with the Rajoom rocket system.\nTargeted Israeli soldiers positioned on the \"Netzarim\" axis with 107-type rockets in a joint operation with the Al-Quds Brigades.\nBombed a gathering of Israeli soldiers and their military vehicles with several mortar shells on the \"Netzarim\" axis, south of Gaza City.\nMartyr Abu Ali Mustafa Brigades' operations on May 6:Bombed a gathering of Israeli forces in the \"Netzarim\" axis with rocket shells."}, {"id": "dfab39a6-3c5f-47f0-8924-321d585bd1e6", "title": "Grit , humor , grief and gloom mix as Ukrainians face a dangerous new phase in the war", "date": "2024-05-08 05:00", "url": "https://www.startribune.com/grit-humor-grief-and-gloom-mix-as-ukrainians-face-a-dangerous-new-phase-in-the-war/600364408/", "message": "Many other Ukrainians also are wrestling with a potent mix of emotions – including grief, anger, humor, defiance and fear – as they face a new phase in the war with growing concern about international support for their cause.\nMost remain firm in their resolve to drive out the Russian invaders and decide their country's future course.\nMany also worry that international attention is distracted by the Israel-Hamas war and other concerns, and that allies aren't delivering much-needed weapons and ammunition.\n''We really want the world to remember that people are dying right now,'' said Valentyna, who works at a power station that has been repeatedly hit by Russian missiles.\nResidents have adapted to war, and nowadays, few head for the shelter of the subway when air alarms sound."}, {"id": "d936e928-bb8a-484a-9f69-2577fd1ebea0", "title": "Grit , humor , grief and gloom mix as Ukrainians face a dangerous new phase in the war", "date": "2024-05-08 07:00", "url": "https://www.ksat.com/news/world/2024/05/08/grit-humor-grief-and-gloom-mix-as-ukrainians-face-a-dangerous-new-phase-in-the-war/", "message": "Many other Ukrainians also are wrestling with a potent mix of emotions – including grief, anger, humor, defiance and fear – as they face a new phase in the war with growing concern about international support for their cause.\nMany also worry that international attention is distracted by the Israel-Hamas war and other concerns, and that allies aren’t delivering much-needed weapons and ammunition.\nMilitary analysts say Russia is pushing to take as much territory as it ca n before fresh supplies of arms reach Ukraine from a $61 billion U.S. aid package approved in April.\n“We really want the world to remember that people are dying right now,” said Valentyna, who works at a power station that has been repeatedly hit by Russian missiles.\nResidents have adapted to war, and nowadays, few head for the shelter of the subway when air alarms sound."}, {"id": "fc2623a3-133f-468e-a84d-5c76087ee457", "title": "Japan stumps up US$1 billion in arms - race insurance for US - led hypersonic missile - interceptor project", "date": "2024-05-08 04:00", "url": "https://www.scmp.com/week-asia/politics/article/3261742/japan-stumps-us1-billion-arms-race-insurance-us-led-hypersonic-missile-interceptor-project", "message": "The US will fork over an estimated US$2 billion for the Glide Phase Interceptor project, according to 2025 budget estimates released by the US Department of Defence in March.\nWashington and Tokyo aim to achieve full operational capability for the system by the end of 2032.\nThe objective is for missiles launched from US Navy warships to intercept hypersonic projectiles during their vulnerable glide phase.\nRussia was likely assisting North Korea with the development of advanced weapons in return for its support in Ukraine , he added.\nPhoto: AFPUS concerns about the technological advancements made by its rivals in recent years have fuelled a heightened sense of urgency surrounding the Glide Phase Interceptor project."}, {"id": "27ca6769-20de-467d-a7b9-d94c2c27aac2", "title": "Grit , humor , grief and gloom mix as Ukrainians face a dangerous new phase in the war", "date": "2024-05-08 07:45", "url": "https://www.local10.com/news/world/2024/05/08/grit-humor-grief-and-gloom-mix-as-ukrainians-face-a-dangerous-new-phase-in-the-war/", "message": "Many other Ukrainians also are wrestling with a potent mix of emotions – including grief, anger, humor, defiance and fear – as they face a new phase in the war with growing concern about international support for their cause.\nMany also worry that international attention is distracted by the Israel-Hamas war and other concerns, and that allies aren’t delivering much-needed weapons and ammunition.\nMilitary analysts say Russia is pushing to take as much territory as it ca n before fresh supplies of arms reach Ukraine from a $61 billion U.S. aid package approved in April.\n“We really want the world to remember that people are dying right now,” said Valentyna, who works at a power station that has been repeatedly hit by Russian missiles.\nResidents have adapted to war, and nowadays, few head for the shelter of the subway when air alarms sound."}, {"id": "c6a6a244-07ae-4c54-a723-775969486ed7", "title": "Military Book Review Road to Surrender : Three Men and the Countdown to the End of World War II", "date": "2024-05-08 15:15", "url": "http://www.strategypage.com/bookreviews/2567", "message": "To many Japanese, the military in particular, the very idea of surrender was anathema.\nDrawing on personal papers, and particularly diaries, Thomas makes a persuasive case that the Japanese surrender was largely due to the work of three men, two Americans and one Japanese.\nSetting the scene, Thomas describes the evolution of the Manhattan Project to build an atomic bomb in the US.\nThere was even discussion of a third bomb, but that proved unnecessary when Emperor Hirohito took the unprecedented step of announcing a Japanese surrender.\nIn this masterly book, Thomas shows exactly how Stimson, Togo and Spaatz helped to cajole, persuade, and move each of their bosses to a final, surprisingly peaceful conclusion to the war."}, {"id": "a9eed7ff-11b0-4c1f-8990-d838474a1187", "title": "Grit , humor , grief and gloom mix as Ukrainians face a dangerous new phase in the war", "date": "2024-05-08 05:15", "url": "https://www.news4jax.com/news/world/2024/05/08/grit-humor-grief-and-gloom-mix-as-ukrainians-face-a-dangerous-new-phase-in-the-war/", "message": "Many other Ukrainians also are wrestling with a potent mix of emotions – including grief, anger, humor, defiance and fear – as they face a new phase in the war with growing concern about international support for their cause.\nMany also worry that international attention is distracted by the Israel-Hamas war and other concerns, and that allies aren’t delivering much-needed weapons and ammunition.\nMilitary analysts say Russia is pushing to take as much territory as it ca n before fresh supplies of arms reach Ukraine from a $61 billion U.S. aid package approved in April.\n“We really want the world to remember that people are dying right now,” said Valentyna, who works at a power station that has been repeatedly hit by Russian missiles.\nResidents have adapted to war, and nowadays, few head for the shelter of the subway when air alarms sound."}, {"id": "1c5a7ed7-d0b1-4bf3-8edf-c6b7f798327b", "title": "Grit , humor , grief and gloom mix as Ukrainians face a dangerous new phase in the war – Metro US", "date": "2024-05-08 05:15", "url": "https://www.metro.us/grit-humor-grief-and-gloom-mix-as-ukrainians-face-a-dangerous-new-phase-in-the-war/", "message": "Sign up for our Metro US email newsletter to get news, updates, and local insights delivered straight to your inbox!\nTaking part in an art class for women bereaved by war, she’s trying to capture her boyfriend’s humor and heroism, and channel her roiling emotions onto canvas.\nMany other Ukrainians also are wrestling with a potent mix of emotions – including grief, anger, humor, defiance and fear – as they face a new phase in the war with growing concern about international support for their cause.\nMany also worry that international attention is distracted by the Israel-Hamas war and other concerns, and that allies aren’t delivering much-needed weapons and ammunition.\n“We really want the world to remember that people are dying right now,” said Valentyna, who works at a power station that has been repeatedly hit by Russian missiles."}, {"id": "60b03b3f-d00b-4aa2-9672-0b608904c684", "title": "Screaming Eagles Unleash Innovation , Testing New Mobile Brigade Combat Team - Clarksville Online - Clarksville News , Sports , Events and Information", "date": "2024-05-08 17:00", "url": "https://www.clarksvilleonline.com/2024/05/08/screaming-eagles-unleash-innovation-testing-new-mobile-brigade-combat-team/", "message": "Charles O’hagan, commander of MFRC (Chaos), 2nd Brigade Combat Team (Bastogne), 101st Airborne Division (Air Assault).\nPrior to the L2A2JFE, Chaos infiltrated the training area, which was occupied by oppositional forces from 1st Brigade Combat Team (Bastogne), 101st Airborne Division (Air Assault).\nAs the world’s only Air Assault Division, the 101st has been tasked with the continuous evolution of vertical envelopment.\nIn 2025, the two other brigades from the 101st, Bastogne and 3rd Brigade Combat Team (Rakkasans), will begin their transformation process.\n“The 101st Airborne Division is the Army and the world’s only Air Assault Division."}, {"id": "1a574888-2fa2-448e-822c-c8b0dfc056ad", "title": "Grit , humor , grief and gloom mix as Ukrainians face a dangerous new phase in the war", "date": "2024-05-08 06:15", "url": "https://www.clickorlando.com/news/world/2024/05/08/grit-humor-grief-and-gloom-mix-as-ukrainians-face-a-dangerous-new-phase-in-the-war/", "message": "Many other Ukrainians also are wrestling with a potent mix of emotions – including grief, anger, humor, defiance and fear – as they face a new phase in the war with growing concern about international support for their cause.\nMany also worry that international attention is distracted by the Israel-Hamas war and other concerns, and that allies aren’t delivering much-needed weapons and ammunition.\nMilitary analysts say Russia is pushing to take as much territory as it ca n before fresh supplies of arms reach Ukraine from a $61 billion U.S. aid package approved in April.\n“We really want the world to remember that people are dying right now,” said Valentyna, who works at a power station that has been repeatedly hit by Russian missiles.\nResidents have adapted to war, and nowadays, few head for the shelter of the subway when air alarms sound."}, {"id": "81177ac6-7a17-474d-b797-b208ee4c50ae", "title": "The Little Girl of Hanoi", "date": "2024-05-08 02:00", "url": "https://www.bbfc.co.uk/release/the-little-girl-of-hanoi-q29sbgvjdglvbjpwwc0xmdiwnza4", "message": "We use cookies on this site to enhance your user experienceBy clicking the I agree button, you agree to us doing so.\nNo, give me more info"}, {"id": "9a1b550d-e130-4866-8054-1e5ec00a3031", "title": "Woman , 39 , stabbed at Alexandria gym in Sydney south another suspected domestic violence incident", "date": "2024-05-08 07:45", "url": "https://www.skynews.com.au/australia-news/crime/woman-39-stabbed-at-alexandria-gym-in-sydneys-south-amid-nsw-government-proposal-for-new-knife-wanding-laws/news-story/61090ae2c7598b989c60e57b05a7b052?nk=5315ba67abf72aa5f1073929a3106b9a-1715153549", "message": "A crime scene has been established at a gym in Sydney's south where a woman was allegedly stabbed by a man known to her on Wednesday afternoon, with New South Wales Police treating the attack as a suspected domestic violence incident.\nNSW Police were told she had been attacked by a man, likely aged in his 40s.\nThey also revealed the man had been known to authorities for previous domestic violence offences.\nPolice are investigating an alleged stabbing at a southern Sydney gym where a 39-year-old woman was attacked by a man known to her.\nPolice were called to Crunch Fitness in Sydney's inner south after a woman was allegedly stabbed on Wednesday."}, {"id": "2d61fdda-500f-4d49-be26-2b7e359398fc", "title": "HWPL calls for peace amid rising tensions between Israel and Iran", "date": "2024-05-08 14:15", "url": "https://thepoint.gm/africa/gambia/headlines/hwpl-calls-for-peace-amid-rising-tensions-between-israel-and-iran", "message": "The statement says, “The recent violent conflict between Iran and Israel is causing significant concerns in the international community.\nIt has been reported that Iran and its militant partners on April 13 initiated a large-scale attack against Israel through launching several hundred ballistic missiles and drones.\nThe international society expressed concerns over the possibility of war between the two states, since Tehran’s direct attack on Israel was unprecedented.\nOn April 18th, the Permanent Representatives to the United Nations from 48 states including the United States, Australia, Austria, Croatia, France, Germany, Japan, Netherlands, Micronesia, Palau, Papua New Guinea, the Republic of Korea, Romania, and Ukraine issued a joint statement condemning Iran’s attack on Israel.\n“HWPL remains steadfast in its commitment to fostering dialogue and reconciliation, offering hope for a peaceful resolution to the conflict between Israel and Iran,” an HWPL official said."}, {"id": "316d9bf8-8fd3-44da-a219-810e0a0c7bf3", "title": "Ukrainians struggle with grief and resolve amidst escalating war , concerns of international support", "date": "2024-05-08 15:15", "url": "https://businessmirror.com.ph/2024/05/08/ukrainians-struggle-with-grief-and-resolve-amidst-escalating-war-concerns-of-international-support/", "message": "Many other Ukrainians also are wrestling with a potent mix of emotions—including grief, anger, humor, defiance and fear—as they face a new phase in the war with growing concern about international support for their cause.\nMost remain firm in their resolve to drive out the Russian invaders and decide their country’s future course.\nMany also worry that international attention is distracted by the Israel-Hamas war and other concerns, and that allies aren’t delivering much-needed weapons and ammunition.\nMilitary analysts say Russia is pushing to take as much territory as it can before fresh supplies of arms reach Ukraine from a $61 billion US aid package approved in April.\n“We really want the world to remember that people are dying right now,” said Valentyna, who works at a power station that has been repeatedly hit by Russian missiles."}, {"id": "0ac006bf-2509-4db7-b95d-7c111697b7e2", "title": "Why the US is stopping some bomb shipments to Israel ? ", "date": "2024-05-08 18:45", "url": "https://indianexpress.com/article/world/why-the-us-is-stopping-some-bomb-shipments-to-israel-9316597/", "message": "Washington paused one shipment consisting of 1,800 2,000-pound (907-kg) bombs and 1,700 500-pound bombs, according to US officials.\nThey were part of an earlier approved shipment to Israel, not the recent $95 billion supplemental aid package the US Congress passed in April.\nWHAT KIND OF DAMAGE CAN 2,000-POUND BOMBS CAUSE?\nLarge bombs like 2,000-pound bombs have an impact over a wide area.\nIsrael denies targeting Palestinian civilians, saying its sole interest is to annihilate Hamas and that it takes all precautions to avoid unnecessary death."}, {"id": "725cc8a9-a35d-49bc-88de-1b0550eaf8fd", "title": "China Xi in Serbia for talks to boost economic ties", "date": "2024-05-08 03:15", "url": "https://www.digitaljournal.com/business/chinas-xi-in-serbia-for-talks-to-boost-economic-ties/article", "message": "In Belgrade, the Chinese leader will meet President Aleksandar Vucic for talks on Wednesday, before heading to Budapest.\n– NATO bombing –Xi’s visit to Belgrade will also coincide with the 25th anniversary of the 1999 US bombing of the Chinese embassy there, which killed three people.\nHe also hailed the “ironclad friendship” between China and Serbia, which he said was “forged with the blood of our compatriots”.\n– Ukraine fears –Serbs questioned in central Belgrade said they welcomed Xi’s visit.\nAfter meeting with Vucic, Xi will go to Hungary, where China has invested heavily in vast battery and electric vehicle (EV) manufacturing plants."}, {"id": "0e1c4511-812b-4a15-894e-cc66942f6a52", "title": "Israel reopens Kerem Shalom crossing to allow humanitarian aid to Gaza", "date": "2024-05-08 16:15", "url": "https://www.atalayar.com/en/articulo/politics/israel-reopens-kerem-shalom-crossing-to-allow-humanitarian-aid-to-gaza/20240508142830199937.html", "message": "18 projectiles were fired from the Rafah area toward the areas of the Kerem Shalom Crossing and Re’im (southern Israel), following the sirens that sounded earlier today.\nFollowing the closure of Kerem Shalom crossing due to rocket fire by Hamas, the Kerem Shalom Crossing is now open for the entry of humanitarian aid into the Gaza Strip.\nThe Israel Defense Forces seized the Rafah crossing shortly after beginning operations in the southern Gaza city, considered the last bastion of Hamas.\nFull IDF statement:There has been a surge of humanitarian aid going into Gaza.\nThe IDF has expanded the humanitarian area in Al- Mawasi to accommodate the increased levels of aid flowing into Gaza."}, {"id": "27220a71-2d18-427b-8cb6-980bf9f713db", "title": "U . S . optimistic revised Hamas proposal may break Gaza ceasefire impasse", "date": "2024-05-08 02:30", "url": "https://www.thehindu.com/news/international/us-optimistic-revised-hamas-proposal-may-break-gaza-ceasefire-impasse/article68151977.ece", "message": "Israel on Monday declared that a three-phase proposal approved by Hamas was unacceptable because terms had been softened.\nWhite House spokesperson John Kirby said Hamas presented a revised proposal, and the new text suggests the remaining gaps can \"absolutely be closed.\"\nIsraeli army footage on Tuesday showed tanks rolling through the Rafah crossing complex between Gaza and Egypt, and the Israeli flag raised on the Gaza side.\nIsrael's military said it was conducting a limited operation in Rafah to kill fighters and dismantle infrastructure used by Hamas, which runs Gaza.\nIsrael's offensive has killed 34,789 Palestinians, most of them civilians, in the conflict, the Gaza Health Ministry said."}, {"id": "98e8fe21-a2bc-4024-8700-98cac655852e", "title": "House of the Dragon Season 2 Easter Eggs From the Teasers", "date": "2024-05-08 14:45", "url": "https://www.flickeringmyth.com/house-of-the-dragon-season-2-easter-eggs-from-the-teasers/", "message": "Billy Oduory on the Easter eggs in the teasers for HBO’s House of the Dragon season 2…“Madness and greatness are two sides of the same coin.\nWhile it doesn’t give too much away, the first trailer of House of the Dragon Season 2 confirms the explosive continuation of the show that fans expected after the sad end of the first season which saw young Lucerys Velaryon and his dragon killed in the show’s first dragon dance.\nDragon Seeds and new dragonsSeasmoke is the new pale dragon seen in the trailer of House of the Dragon season 2.\nThe house didn’t play a significant role in the first season, though, but Cregan Stark is expected to feature prominently in the second season.\nSEE ALSO: House of the Dragon Season 2: How Long Does Aegon II Targaryen Stay On the Throne in the Books?"}, {"id": "3313ff14-0b56-421b-a16b-a63ceeb615b6", "title": "US optimistic revised Hamas proposal may break Gaza cease - fire impasse", "date": "2024-05-08 03:00", "url": "http://www.koreatimes.co.kr/www/world/2024/05/501_374204.html", "message": "The United States believes the remaining differences between Israel and Hamas can be bridged in negotiations over the Palestinian militant group's latest cease-fire proposal, as talks resume in Cairo on Wednesday.\nIsrael on Monday declared that a three-phase proposal approved by Hamas was unacceptable because terms had been softened.\nWhite House spokesperson John Kirby said Hamas presented a revised proposal, and the new text suggests the remaining gaps can \"absolutely be closed.\"\nIsraeli army footage on Tuesday showed tanks rolling through the Rafah crossing complex between Gaza and Egypt, and the Israeli flag raised on the Gaza side.\nIsrael's offensive has killed 34,789 Palestinians, most of them civilians, in the conflict, the Gaza Health Ministry said."}, {"id": "1f066f88-5480-4814-9d3a-72d1c97095e8", "title": "Death toll from strikes on eastern DRC displaced - people camps rises to 18", "date": "2024-05-08 08:30", "url": "https://www.news24.com/news24/africa/news/death-toll-from-strikes-on-eastern-drc-displaced-people-camps-rises-to-18-20240507", "message": "The official count of people killed in Friday's attack on a camp for displaced people in the eastern DRC has risen to 18.\nThe DRC and the United States have said the attacks were launched from territory held by Rwandan troops and M23.\nOCHA said in a statement that most of those killed in the rockets strikes were women and children.\nOne more woman was killed during a protest at one camp after the attacks, it said.\nThe worst thing is that they place their big guns not far from our camps,\" he told Reuters at one of the camps that was hit."}, {"id": "d90ea44c-538e-4b53-b009-166d9951b803", "title": "As Israel moves into Rafah , are ceasefire talks over ? ", "date": "2024-05-08 01:15", "url": "https://theworld.org/stories/2024/05/07/as-israel-moves-into-rafah-are-ceasefire-talks-over", "message": "The Israeli military seized control of the Rafah border crossing in the southern Gaza Strip late Monday night.\nEarlier that afternoon, Hamas leaders said they were willing to agree to a ceasefire and a hostage-prisoner exchange.\nSmoke rises following an Israeli airstrike east of Rafah, Gaza Strip, Monday, May 6, 2024.\nIsmael Abu Dayyah/APOn Tuesday, Israel’s Prime Minister Benjamin Netanyahu said the offer from Hamas was meant to “disrupt” the Israeli military’s advance into Rafah.\nThe house was turned upside down.”Palestinians flee from the eastern side of the southern Gaza city of Rafah after the Israeli army orders them to evacuate ahead of a military operation, in Rafah, Gaza Strip, Monday, May 6, 2024."}, {"id": "e2e2fa3e-9803-4334-9b21-2fbd4c42862f", "title": "Israel reopens key crossing for aid to enter Gaza after rocket attack", "date": "2024-05-08 07:30", "url": "https://www.lancashiretelegraph.co.uk/news/national/24305011.israel-reopens-key-crossing-aid-enter-gaza-rocket-attack/", "message": "The Kerem Shalom crossing between Gaza and Israel was closed over the weekend after a Hamas rocket attack killed four Israeli soldiers nearby, and on Tuesday, an Israeli tank brigade seized the nearby Rafah crossing between Gaza and Egypt, forcing its closure.\nThe Israeli foray did not appear to be the start of the full-scale invasion of the city of Rafah that Israel has repeatedly promised.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight, including two large blasts early on Wednesday.\nSmoke rises following an Israeli bombardment in the Gaza Strip as seen from southern Israel (Leo Correa/AP)The Israeli military reported six launches from Rafah towards the Kerem Shalom crossing on Tuesday.\nCOGAT, the Israeli military body in charge of Palestinian civilian affairs, said the Kerem Shalom crossing reopened early on Wednesday."}, {"id": "7862afad-b6fa-4719-9251-ad2f31e951b0", "title": "Ukrenergo warns of potential evening power outages in Ukraine after Russian attack", "date": "2024-05-08 12:45", "url": "https://www.yahoo.com/news/ukrenergo-warns-potential-evening-power-113000080.html", "message": "Following the Russian attack early on May 8, power cuts may affect residential and industrial consumers across Ukraine from 6 p.m. to 11 p.m., Ukrenergo reported on Telegram.\nThe outages stem from electricity shortages in the grid, caused by new damage to Ukrainian power plant equipment due to Russian strikes.\nRead also: Ukraine may face summer blackouts, Energy Ministry saysUkrenergo anticipates challenges on May 8, from 6 to 11 p.m.\nRussian strikes have led to fresh blackouts in Dnipropetrovsk, Donetsk, Ivano-Frankivsk, Kyiv, Lviv, Mykolaiv, Poltava, Kharkiv, and Sumy oblasts.\nRussian attacks on electricity facilities in six oblasts: Poltava, Kirovohrad, Zaporizhzhya, Lviv, Ivano-Frankivsk, and Vinnytsia, according to Ukraine's Energy Minister German Halushchenko."}, {"id": "848a9f16-ee68-4b07-8380-26aae25dc19b", "title": "Israel reopens key crossing for aid to enter Gaza after rocket attack", "date": "2024-05-08 07:45", "url": "https://www.eadt.co.uk/news/national/24305011.israel-reopens-key-crossing-aid-enter-gaza-rocket-attack/", "message": "The Kerem Shalom crossing between Gaza and Israel was closed over the weekend after a Hamas rocket attack killed four Israeli soldiers nearby, and on Tuesday, an Israeli tank brigade seized the nearby Rafah crossing between Gaza and Egypt, forcing its closure.\nThe Israeli foray did not appear to be the start of the full-scale invasion of the city of Rafah that Israel has repeatedly promised.\nAssociated Press journalists heard sporadic explosions and gunfire in the area of the Rafah crossing overnight, including two large blasts early on Wednesday.\nSmoke rises following an Israeli bombardment in the Gaza Strip as seen from southern Israel (Leo Correa/AP)The Israeli military reported six launches from Rafah towards the Kerem Shalom crossing on Tuesday.\nCOGAT, the Israeli military body in charge of Palestinian civilian affairs, said the Kerem Shalom crossing reopened early on Wednesday."}, {"id": "c513683c-414d-4559-b6b3-396ae280998f", "title": "China could  overwhelm  US military bases as Biden shows  alarming lack of urgency : House committee chair", "date": "2024-05-08 20:00", "url": "https://www.foxnews.com/politics/china-could-overwhelm-military-bases-biden-shows-alarming-lack-of-urgency-house-committee-chair", "message": "EXCLUSIVE: The new chairman of the House China Committee says there is an \"alarming lack of urgency\" from the Biden administration to adopt defensive measures to protect American military bases in the Indo-Pacific against potential attacks from China.\nTOP REPUBLICAN SOUNDS ALARM ON US TERRITORY BEING 'HIGHLY VULNERABLE' TO CHINESE MISSILES\"American military bases in the Indo-Pacific are under threat.\nMoolenaar said his committee received information that shows \"an alarming lack of urgency by the Department of Defense in adopting defensive measures.\"\n\"U.S. bases in the region have almost no hardened aircraft shelters compared to Chinese military bases,\" he said.\n\"We don’t have enough hardened shelters to protect our aircraft and personnel.\""}, {"id": "c6fb597f-a51c-439d-ab5f-6374b050cf67", "title": "Grit , humor , grief and gloom mix as Ukrainians face a dangerous new phase in the war", "date": "2024-05-08 05:00", "url": "https://www.independent.co.uk/news/ap-ukraine-kyiv-people-vladimir-putin-b2541303.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nTaking part in an art class for women bereaved by war, she’s trying to capture her boyfriend’s humor and heroism, and channel her roiling emotions onto canvas.\nMany other Ukrainians also are wrestling with a potent mix of emotions – including grief, anger, humor, defiance and fear – as they face a new phase in the war with growing concern about international support for their cause.\nMilitary analysts say Russia is pushing to take as much territory as it ca n before fresh supplies of arms reach Ukraine from a $61 billion U.S. aid package approved in April.\nResidents have adapted to war, and nowadays, few head for the shelter of the subway when air alarms sound."}, {"id": "3873cbe3-aee7-486f-931c-6c0c3e068c97", "title": "Iran is gaining credibility in the Muslim world and feeling emboldened", "date": "2024-05-08 13:45", "url": "https://www.econotimes.com/Iran-is-gaining-credibility-in-the-Muslim-world-and-feeling-emboldened-This-doesnt-bode-well-for-the-region-1677125", "message": "Many around the world – and specifically in Muslim countries – do not see the belated US warnings to Israel as genuine.\nAnd Tehran’s message of anti-Americanism is resonating with large segments of the public in the Muslim world.\nThe Iranian missile and drone attack on Israel on April 13 was calibrated to achieve two key objectives.\nThis show of strength has likely helped its rejectionist foreign policy find receptive ears in the Muslim world and beyond.\nThe United States and Israel are gifting Iran and its message of defiance enormous appeal, well beyond the imagination of Iranian authorities."}, {"id": "8169e247-c00f-4309-850e-2c997e782385", "title": "Russia launches a  massive  missile and drone attack on Ukraine energy facilities", "date": "2024-05-08 10:00", "url": "https://www.newsday.com/news/nation/russia-ukraine-war-5-8-2024-o38730", "message": "Russia has repeatedly pounded Ukraine’s energy infrastructure during the war that is stretching into its third year and has claimed thousands of lives.\nRussian attacks have damaged nearly half of Ukraine’s power infrastructure since the start of the Kremlin’s full-scale invasion in February 2022, officials say.\nRussia pummeled Ukraine’s energy infrastructure during the “blackout winter” of 2022-23.\nAir defenses downed 39 of the missiles and 20 of the drones, Ukrainian air force commander Mykola Oleshchuk said.\nRussian forces also damaged the railway station building and train tracks in Kherson, national railway operator Ukrzaliznytsia said."}, {"id": "afae8ae4-ea29-4c7b-b79b-710d52bd55b8", "title": "Negotiators arrive in Cairo as Israel seizes Rafah crossing", "date": "2024-05-08 02:30", "url": "https://www.bostonglobe.com/2024/05/07/world/negotiators-arrive-cairo-israel-seizes-rafah-crossing/", "message": "The move did not appear to be the full ground invasion of Rafah that Israel has long been threatening and its allies working to avert.\nIsrael’s 401st Brigade took “operational control” of the Gaza side of the Rafah crossing early Tuesday, the military said.\nAdvertisementThe Rafah crossing with Egypt and the Kerem Shalom crossing with Israel are critical entry points for food, medicine, and other supplies for Gaza’s 2.3 million people.\nThey have been closed for at least the past two days, though the smaller Erez crossing between Israel and northern Gaza continues to operate.\nBiden warned Netanyahu again Monday against launching an invasion of the city after Israel ordered 100,000 Palestinians to evacuate from parts of Rafah."}, {"id": "5d7c9bda-d8a8-46ef-a9b3-42eaa48ba690", "title": "Hezbollah targets north Israel in response to Israeli attacks on civilians", "date": "2024-05-08 20:00", "url": "https://www.naharnet.com:443/stories/en/305059-hezbollah-targets-north-israel-in-response-to-israeli-attacks-on-civilians", "message": "Hezbollah said in a statement that it had targeted buildings used by Israeli soldiers in Metula, Shlomi, al-Manara, Hanita and Avivim.\nIt said the five attacks are in response to Israeli attacks on villages and civilians in south Lebanon.\nIsraeli warplanes meanwhile raided forests in Aita al-Shaab and Ramia while artillery shelled the outskirts of al-Naqoura, Kfarshouba, Halta and Kfarhamam.\nIsraeli warplanes had raided overnight the southern border towns of Houla, Aita al-Shaab, Maroun al-Ras, Aitaroun, Kfarkela and al-Khiam as Hezbollah attacked Tuesday 9 Israeli posts.\nIsrael says 13 soldiers and nine civilians have been killed on its side of the border."}, {"id": "ae1a5ca1-d839-4adf-92ff-f30f4ff495a7", "title": "Israel Hamas War : 49 Bodies Found At Al - Shifa Hospital , Say Gaza Officials", "date": "2024-05-08 18:00", "url": "https://www.ndtv.com/world-news/israel-hamas-war-49-bodies-found-at-al-shifa-hospital-say-gaza-officials-5619557", "message": "(File)Gaza health workers uncovered Wednesday at least 49 bodies at Al-Shifa hospital, a medical official and Hamas authorities said, the latest such discovery at the facility previously raided by Israeli forces.\nIsrael accuses Palestinian operatives of using hospitals as command centres and to hold hostages abducted on October 7.\nMotassem Salah, head of the emergency department at Al-Shifa, told journalists that \"a third mass grave was found inside this hospital.\"\nAFP footage from Al-Shifa hospital showed at least a dozen bodies wrapped in black plastic body bags.\nIsraeli forces were battling Palestinian operatives at the hospital even as patients had been trapped there."}, {"id": "268ba85f-e56b-4b09-8c78-c5b7f18632e9", "title": "China Hasnt Forgotten the US Bombing of its Embassy", "date": "2024-05-08 07:30", "url": "https://www.frontpagemag.com/china-hasnt-forgotten-the-us-bombing-of-its-embassy/", "message": "President Xi Jinping vowed to “never forget” NATO’s deadly bombing of the Chinese embassy in Belgrade, hours before arriving in Serbia on a swing through Europe aimed at dividing Brussels’ support for the US.\n“Twenty-five years ago today, NATO flagrantly bombed the Chinese embassy in Yugoslavia, killing three Chinese journalist,” Xi said, in a Tuesday article published in Politika, Serbia’s oldest daily newspaper.\nThe Chinese embassy bombing was a strange event that was never really resolved.\nWhat are the odds we’d accidentally bomb the Chinese embassy?\n“NATO was bombing the shit out of the Serbs’ military communications systems."}, {"id": "d3a8181a-c650-4a04-8722-ac28ab453e12", "title": "Grit , humor , grief and gloom mix as Ukrainians face a dangerous new phase in the war", "date": "2024-05-08 10:00", "url": "https://lasvegassun.com/news/2024/may/07/grit-humor-grief-and-gloom-mix-as-ukrainians-face/", "message": "Grit, humor, grief and gloom mix as Ukrainians face a dangerous new phase in the warFrancisco Seco / APKYIV, Ukraine — Paintbrush in hand, Anastasiya Sereda is working on a painting of a chubby-faced panda in the uniform of a Ukrainian soldier.\nMany other Ukrainians also are wrestling with a potent mix of emotions – including grief, anger, humor, defiance and fear – as they face a new phase in the war with growing concern about international support for their cause.\nMany also worry that international attention is distracted by the Israel-Hamas war and other concerns, and that allies aren’t delivering much-needed weapons and ammunition.\n“We really want the world to remember that people are dying right now,” said Valentyna, who works at a power station that has been repeatedly hit by Russian missiles.\nResidents have adapted to war, and nowadays, few head for the shelter of the subway when air alarms sound."}, {"id": "72224cd1-1087-46e9-8057-6801c0353880", "title": "What Is The Oldest Aircraft Carrier Still In Service ? ", "date": "2024-05-08 20:15", "url": "https://www.slashgear.com/1575097/oldest-aircraft-carrier-still-in-service/", "message": "What Is The Oldest Aircraft Carrier Still In Service?\nThe first true aircraft carrier built for ... well, carrying aircraft, came in 1918 with the commissioning of the HMS Argus.\nAs conflict erupted further, designs improved, making aircraft carriers some of the most essential vessels during WWII.\nModern aircraft carriers feature a variety of designs that share several key characteristics.\nThis begs the question, 'What is the oldest aircraft carrier that remains in service?'"}, {"id": "38853cfe-8b83-42ca-a2b9-6089d042d7ac", "title": "MQ - 9 Reaper Drone , At $30 Million A Pop , Top Zelensky Wish List", "date": "2024-05-08 02:15", "url": "https://www.zerohedge.com/geopolitical/mq-9-reaper-drone-30-million-pop-tops-zelenskys-shopping-list", "message": "Because it's never enough... Ukraine is now eyeing the US-made MQ-9 Reaper even while Kiev awaits F-16 deliveries from the West.\nPolitico has reported that the $30 million drone has moved to the top of Kiev's arms shopping 'wish list'.\nAt $30 million a piece, the MQ-9 would be a prime target for the Russians to shoot down.\nIn 2023 the Pentagon lost a Reaper over the Black Sea after an encounter with Russian fighter jets.\nA jet dumbed its fuel on the drone, after which the drone crashed, and later the Russian navy recovered the wreckage."}, {"id": "7137a02f-3810-426a-baf0-0497f12d5dab", "title": "India Now Seen as  Friendly , Fair , But Also  Firm And Fiery : S Jaishankar – Indian Defence Research Wing", "date": "2024-05-08 16:45", "url": "https://idrw.org/india-now-seen-as-friendly-fair-but-also-firm-and-fiery-s-jaishankar/", "message": "India Now Seen as “Friendly, Fair”, But Also “Firm And Fiery”: S Jaishankar| BySOURCE: PTIExternal Affairs Minister S Jaishankar on Tuesday said India today is not only seen across the globe as “friendly and fair” but also as a “firm and fiery” nation that cares for its people and fends for them in crisis situations.\nMr Jaishankar made the remarks while speaking on the topic “Viksit Bharat @2047 – The Voice of the Youth” at an event at Delhi University’s Hansraj College.\nHe was referring to the rescue operations run by India to bring back its citizens from war-torn countries such as Ukraine.\nIt is the journey towards ‘Viksit Bharat’, and it is you who will make this journey possible,” he said.\nMr Jaishankar also spoke about India’s non-tolerance towards cross-border terrorism and gave the example of the Balakot airstrike."}, {"id": "4f0f454a-1cfe-45f2-9091-048f84c7a21f", "title": "Grit , humor , grief and gloom mix as Ukrainians face a dangerous new phase in the war", "date": "2024-05-08 05:00", "url": "https://isp.netscape.com/news/world/story/0001/20240508/f5e7e06215aa2e3f95c57c4de62527b9", "message": "Grit, humor, grief and gloom mix as Ukrainians face a dangerous new phase in the warKYIV, Ukraine (AP) — Paintbrush in hand, Anastasiya Sereda is working on a painting of a chubby-faced panda in the uniform of a Ukrainian soldier.\nMany other Ukrainians also are wrestling with a potent mix of emotions – including grief, anger, humor, defiance and fear – as they face a new phase in the war with growing concern about international support for their cause.\nMost remain firm in their resolve to drive out the Russian invaders and decide their country’s future course.\nMany also worry that international attention is distracted by the Israel-Hamas war and other concerns, and that allies aren’t delivering much-needed weapons and ammunition.\nResidents have adapted to war, and nowadays, few head for the shelter of the subway when air alarms sound."}, {"id": "85097c60-c4de-45f2-8cdb-534ae2e821ec", "title": "Gaza war : US paused Israel arms shipment over Rafah concerns , Pentagon chief Lloyd Austin says", "date": "2024-05-08 18:45", "url": "https://www.scmp.com/news/world/middle-east/article/3261933/gaza-war-us-paused-israel-arms-shipment-over-rafah-concerns-pentagon-chief-lloyd-austin-says", "message": "Protesters against the Israel-Gaza war hold signs as US Secretary of Defence Lloyd Austin arrives for a hearing on Capitol Hill on Wednesday.\nPhoto: APThe US has historically provided enormous amounts of military aid to Israel.\nBiden has said that Israel needs to do far more to protect the lives of civilians in Gaza.\n“We’re going to continue to do what’s necessary to ensure that Israel has the means to defend itself,” Austin said.\nA decision against Israel would further add to pressure on Biden to curb the flow of weapons and money to Israel’s military."}, {"id": "d74c28d2-cb75-4572-a04a-ec4a23e96fc4", "title": "China Xi in Serbia for talks to boost economic ties", "date": "2024-05-08 07:00", "url": "https://www.thestandard.com.hk/breaking-news/section/3/216162/China", "message": "Vucic welcomed Xi and called him a \"friend of Serbia\".\n\"Such respect and love as he will find here in our Serbia, he will not find anywhere else,\" Vucic added.\nHe told the crowd as Xi applauded: \"We have a clear and simple position regarding Chinese territorial integrity.\nHe also hailed the \"ironclad friendship\" between China and Serbia, which he said was \"forged with the blood of our compatriots\".\nAfter meeting with Vucic, Xi will go later Wednesday to Hungary where China has invested heavily in vast battery and electric vehicle (EV) manufacturing plants."}, {"id": "24c8b44b-cdad-4c1e-aa6c-c09a6ded4945", "title": "Israel - Gaza war : 49 bodies found at  third mass grave  at al - Shifa hospital , Palestinian officials say", "date": "2024-05-08 16:15", "url": "https://www.scmp.com/news/world/middle-east/article/3261926/israel-gaza-war-49-bodies-found-third-mass-grave-al-shifa-hospital-palestinian-officials-say", "message": "The Israeli military has repeatedly targeted al-Shifa, the Palestinian territory’s largest hospital, and other medical facilities in its war against Hamas, triggered by the Palestinian group’s unprecedented October 7 attack.\nGaza health workers uncovered on Wednesday at least 49 bodies at al-Shifa hospital, a medical official and Hamas authorities said, the latest such discovery at the facility previously raided by Israeli forces.\nMotassem Salah, head of the emergency department at al-Shifa, told journalists that “a third mass grave was found inside this hospital”.\nA man tapes off the area as rescuers and doctors search for dead bodies inside the damaged al-Shifa Hospital on April 8.\nFootage from al-Shifa hospital showed at least a dozen bodies wrapped in black plastic body bags."}, {"id": "6fd06ffb-d627-4ed2-b27c-922903dd35f6", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 05:00", "url": "https://www.mymotherlode.com/news/national/3354087/has-israel-followed-the-law-in-its-war-in-gaza-the-us-is-due-to-render-a-first-of-its-kind-verdict.html", "message": "Has Israel followed the law in its war in Gaza?\nThe US is due to render a first-of-its-kind verdictHas Israel followed the law in its war in Gaza?\nBlinken added that Israel had yet to rectify the unit’s wrongdoing, something the Leahy law says must happen for any suspension of military aid to be lifted.\nWhile a finding against Israel under the national security memo wouldn’t obligate the administration to start cutting military support for Israel, it would increase pressure on Biden to do so.\nHe is among those urging the U.S. to condition military support to Israel."}, {"id": "1886543b-b8c0-4e90-a800-3aed3961c0c9", "title": "Colorado supermarket shooter was sane at the time of the attack , state experts say – Winnipeg Free Press", "date": "2024-05-08 00:45", "url": "https://www.winnipegfreepress.com/world/2024/05/07/colorado-supermarket-shooter-was-sane-at-the-time-of-the-attack-state-experts-say", "message": "BOULDER, Colo. (AP) — State experts have found the man charged with shooting and killing 10 people at a Colorado supermarket in 2021 had untreated mental illness but was legally sane at the time of the attack, lawyers said Tuesday.\n(AP Photo/David Zalubowski, File)Prosecutors did not provide any details of their own about what the evaluators found during the hearing.\n“I look forward to the trial, and these are issues that are going to be litigated fully at trial,” Dougherty said after the hearing.\nAlissa has pleaded not guilty by reason of insanity in the March 22, 2021, shooting at a King Soopers store in the college town of Boulder.\nWinnipeg Free Press | Newsletter Business Weekly Monday mornings The latest local business news and a lookahead to the coming week."}, {"id": "ac56817c-8c93-426e-bbe4-a6881f3cd499", "title": "Russian missile attack damaged Ukrainian energy facilities", "date": "2024-05-08 09:15", "url": "https://www.voanews.com/a/russian-missile-attack-damaged-ukrainian-energy-facilities/7602470.html", "message": "DTEK, Ukraine's largest private electricity company, said Russian missiles inflicted “serious damage” on three of the company’s six thermal power plants in Ukraine.\nAndriy Rakovych, the regional governor of central Ukraine’s Korovohrad region, reported one person injured and 13 homes destroyed in a Russian missile attack.\nThe attack came a day after Ukrainian counterintelligence investigators said they thwarted a plan by Russian agents to assassinate Ukrainian President Volodymyr Zelenskyy and other high-level officials.\nUkraine’s state security service said two colonels in the State Guard of Ukraine, which protects top officials, were arrested on suspicion of treason for enacting the plan.\nA state security service statement said the plot was drawn up by Russia’s Federal Security Service."}, {"id": "945a6118-0b03-4de4-a9aa-91513359abf7", "title": "How the West is helping Ukraine wont be enough to win – POLITICO", "date": "2024-05-08 03:45", "url": "https://www.politico.eu/article/how-west-help-ukraine-not-enough-win-war-russia/", "message": "Britain has already eased the rules of engagement, but the restrictions others impose, preventing Ukraine from cross-border attacks and from attacking the crown jewels of the Russian deployment, such as the Black Sea fleet, must end.\nConcern over Russian escalation has allowed the West to talk itself into inaction and self-deterrence.\nBut if Israel’s response to last month’s Iranian drone and missile attack has demonstrated anything, it’s that a strong response — not self-deterrence — is the best way to confront totalitarian threats.\nUkrainian President Volodymyr Zelenskyy needs more ammunition, and commanders like LaCamera should see the consequences to their own missions, should Ukraine fall to Russia — even if the cost comes out of their inventories.\nOverall, U.S. Army officials note that the current risk in supporting Ukraine is “manageable,” but it’s time to take a bit more risk and dip further into those stockpiles to stave off potential defeat."}, {"id": "893d6f27-9fdd-484a-b7f7-c0723c0df66e", "title": "Middle East crisis update : Israel gains control of Rafah border crossing ; ceasefire differences can be resolved US", "date": "2024-05-08 00:45", "url": "https://www.dailymaverick.co.za/article/2024-05-08-israel-gains-control-of-rafah-border-crossing-ceasefire-differences-can-be-resolved-us/", "message": "Israeli Prime Minister Benjamin Netanyahu said on Tuesday that “the Hamas [ceasefire] offer yesterday was designed to prevent our forces from entering Rafah.\nThe answer is both, according to Israeli officials close to Prime Minister Benjamin Netanyahu and the military, who spoke about internal deliberations on condition of anonymity.\nOn Monday, Hamas said it had accepted a ceasefire proposal from Qatar and Egypt, but Israel swiftly rejected that offer.\nIsrael’s troops take control of Rafah border crossing in GazaIsraeli forces took control of the Rafah border crossing in Gaza on Tuesday morning ahead of a possible assault on the city.\nThe IDF said it acted “following intelligence that indicated the Rafah crossing was being used for terrorist purposes”."}, {"id": "d0e8c34d-703c-4222-a600-3c8974d44424", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 04:30", "url": "https://www.krmg.com/news/world/has-israel-followed/FUV2DZ2HVNE6LMKDTP6GWV5K34/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "fcc55547-f14d-4873-8bfd-4aa657392065", "title": "Has Israel followed the law in its war in Gaza ? The US is due to render a first - of - its - kind verdict", "date": "2024-05-08 04:30", "url": "https://toronto.citynews.ca/2024/05/08/has-israel-followed-the-law-in-its-war-in-gaza-the-us-is-due-to-render-a-first-of-its-kind-verdict/", "message": "Blinken added that Israel had yet to rectify the unit’s wrongdoing, something the Leahy law says must happen for any suspension of military aid to be lifted.\nWhile a finding against Israel under the national security memo wouldn’t obligate the administration to start cutting military support for Israel, it would increase pressure on Biden to do so.\nThe report argues the administration must find Israel’s conduct in Gaza has violated the law.\nHe is among those urging the U.S. to condition military support to Israel.\nIsrael and the Biden administration say Hamas’ presence in tunnels throughout Gaza, and alleged presence in hospitals and other protected sites, make it harder for Israeli forces to avoid high civilian casualties."}]