[{"id": "4194a534-8188-4317-bd32-80c27324873a", "title": "Russians attack 13 communities of Sumy Oblast , injuring 4 people", "date": "2024-08-24 06:15", "url": "https://www.yahoo.com/news/russians-attack-13-communities-sumy-005050079.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Aftermath of the attacks on Sumy Oblast.\nPhoto: Sumy Oblast Prosecutor's OfficeRussian forces have conducted 87 attacks on 13 hromadas in Sumy Oblast over the past day, injuring four civilians.\nSource: Sumy Oblast Military AdministrationQuote: \"[A total of] 265 explosions were recorded.\nThe Russians attacked Bilopillia hromada with a guided bomb airstrike, FPV drones and mortar fire (11 explosions).\nThe Russians hit Shalyhyne hromada with a guided bomb airstrike, mortars and FPV drones (8 explosions)."}, {"id": "00d3d0e1-5d6b-4f3a-b777-67de581ab049", "title": "Fires break out on abandoned Greek - flagged oil tanker Sounion that Yemen rebels attacked in Red Sea", "date": "2024-08-24 02:00", "url": "https://www.journal-news.com/nation-world/fires-break-out-on-abandoned-greek-flagged-oil-tanker-sounion-that-yemen-rebels-attacked-in-red-sea/FF3OQQOGRRGIJGMPIJW7SDZYUA/", "domain": "journal-news.com", "domain_classification": "Unknown", "message": "logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "4a6cbfeb-957f-4f48-823c-8242042def8e", "title": "Greek - flagged oil tanker on fire and appears to be adrift in Red Sea", "date": "2024-08-24 09:30", "url": "https://www.euronews.com/2024/08/24/greek-flagged-oil-tanker-on-fire-and-appears-to-be-adrift-in-red-sea", "domain": "euronews.com", "domain_classification": "Unknown", "message": "ADVERTISEMENTFires broke out on Friday on a Greek-flagged oil tanker this week, with the vessel now appearing to be adrift in the Red Sea, authorities said on Friday.\nIt wasn't immediately clear what happened to the oil tanker Sounion after it was abandoned by its crew on Thursday and reportedly put at anchor.\nThe Houthis didn't immediately acknowledge the fire, but they have been conducting a months-long campaign against shipping in the Red Sea over the ongoing Israel-Hamas war in the Gaza Strip.\nThe Sounion has 150,000 tons of crude oil aboard and represents a “navigational and environmental hazard,” the mission warned.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets."}, {"id": "f9fade02-6bf4-4779-9dfc-975be005cb51", "title": "Fires break out on abandoned Greek - flagged oil tanker", "date": "2024-08-24 08:30", "url": "https://www.sunstar.com.ph/network/fires-break-out-on-abandoned-greek-flagged-oil-tanker-sounion-that-yemen-rebels-attacked-in-red-sea", "domain": "sunstar.com.ph", "domain_classification": "Unknown", "message": "Fires broke out Friday on a Greek-flagged oil tanker previously attacked by Yemen's Houthi rebels this week, with the vessel now appearing to be adrift in the Red Sea, authorities said.\nIt wasn't immediately clear what had happened to the oil tanker Sounion, which had been abandoned by its crew on Thursday and reportedly anchored in place.\nThe British military's United Kingdom Maritime Trade Operations center reported the fires in a note to mariners on Friday night.\nThe Sounion has 150,000 tons of crude oil aboard and represents a “navigational and environmental hazard,” the mission warned.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets."}, {"id": "a759deee-6ab5-4320-8776-0f82a66dccd8", "title": "Fires break out on abandoned Greek - flagged oil tanker Sounion that Yemen rebels attacked in Red Sea", "date": "2024-08-24 01:45", "url": "https://www.springfieldnewssun.com/nation-world/fires-break-out-on-abandoned-greek-flagged-oil-tanker-sounion-that-yemen-rebels-attacked-in-red-sea/FF3OQQOGRRGIJGMPIJW7SDZYUA/", "domain": "springfieldnewssun.com", "domain_classification": "Unknown", "message": "logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "a616fa54-b39b-4190-81bf-902c61de6f17", "title": "Israeli shelling claims lives of 9 Palestinians in Gaza", "date": "2024-08-24 03:00", "url": "https://tribune.com.pk/story/2490587/israeli-shelling-claims-lives-of-9-palestinians-in-gaza", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Smoke rises following an Israeli strike on a residential building, amid the ongoing conflict between Israel and Hamas, in Khan Younis, in the southern Gaza Strip, on August 16, 2024.\nFile Photo ReutersAt least nine Palestinians, including two children and a woman, were killed early on Saturday by Israeli shelling in Gaza's Khan Younis and the Al-Nuseirat camp area, according to the Palestinian news agency Wafa.\nThe shelling targeted two houses in southern Khan Younis, leading to the reported casualties.\nIn related news, Israeli airstrikes across southern Lebanon on Friday killed at least eight Hezbollah fighters and a child, as Hezbollah responded with artillery and rockets.\nA separate strike in Aita, a village approximately 14 km north of Israel's border, claimed the lives of a Hezbollah fighter and a child."}, {"id": "70684372-84b5-4a10-ad3e-efe73e04e448", "title": "12 Palestinians killed in Israeli shelling in Gaza", "date": "2024-08-24 06:30", "url": "https://tribune.com.pk/story/2490592/12-palestinians-killed-in-israeli-shelling-in-gaza", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Smoke rises following an Israeli strike on a residential building, amid the ongoing conflict between Israel and Hamas, in Khan Younis, in the southern Gaza Strip, August 16, 2024.\nPHOTO: REUTERSAt least 12 Palestinians, including two children and a woman, were killed early on Saturday morning by Israeli attacks east of Gaza's Khan Younis and in the Al-Nuseirat camp area, the official Palestinian news agency Wafa said.\nPreviously, at least nine Palestinians, including two children and a woman, were killed early on by Israeli shelling in Gaza's Khan Younis and the Al-Nuseirat camp area, according to the Palestinian news agency Wafa.\nThe shelling targeted two houses in southern Khan Younis, leading to the reported casualties.\nIn related news, Israeli airstrikes across southern Lebanon on Friday killed at least eight Hezbollah fighters and a child, as Hezbollah responded with artillery and rockets."}, {"id": "38472327-13e2-4e4e-8f5d-33917caaad8c", "title": "On This Day In 1986 : Operation El Dorado Canyon , The F - 111 Shining Moment . ", "date": "2024-08-24 00:15", "url": "https://theaviationist.com/2020/04/15/on-this-day-in-1986-operation-el-dorado-canyon-the-f-111s-shining-moment/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "These were the beginnings of the Tuesday, April 15, 1986 Operation El Dorado Canyon, the U.S. retaliatory strikes on Libya.\nThe rehearsal confirmed the mission template for the actual Operation El Dorado Canyon as viable.\nOperation El Dorado Canyon was the shining moment of the F-111’s legacy.\nFinally, the F-111 ended its career in U.S. service in December 1998 as the EF-111 Raven electronic countermeasures variant used in Operation El Dorado Canyon.\nQaddafi’s despotic, and dramatic, reign was finally over, 25 years after the Operation El Dorado Canyon raids that happened on this day in 1986."}, {"id": "36527ee9-d8c6-4341-9f29-dbcd2752c34a", "title": "US Secret Service puts agents on leave after Trump assassination attempt , media reports say", "date": "2024-08-24 05:00", "url": "https://www.ksl.com:443/article/51108257/us-secret-service-puts-agents-on-leave-after-trump-assassination-attempt-media-reports-say", "domain": "ksl.com", "domain_classification": "Unknown", "message": "Estimated read time: 1-2 minutesWASHINGTON — Multiple Secret Service agents have been placed on leave following an assassination attempt on former President Donald Trump last month, media outlets reported on Friday.\nFox and CBS reported that at least five Secret Service members involved in the incident, including the head of the Secret Service's Pittsburgh office, had been put on leave.\nThe Secret Service has said it was \"ashamed\" of the security lapse, and its chief stepped down in the aftermath of the assassination attempt.\nFollowing the attack, the Secret Service recommended that Trump avoid large outdoor events.\nTrump spoke from behind a shield of bulletproof glass in North Carolina on Wednesday, his first outdoor rally since the attack."}, {"id": "a4d1e2c5-f4f8-48b9-bd06-d4f1f4d3253a", "title": "3 Killed , Several Injured In Stabbing Attack At Festival In Germany Solingen", "date": "2024-08-24 04:30", "url": "https://www.india.com/news/world/3-killed-several-injured-in-stabbing-attack-at-festival-in-germanys-solingen-7189676/", "domain": "india.com", "domain_classification": "Unknown", "message": "HomeNews3 Killed, Several Injured In Stabbing Attack At Festival In Germany’s Solingen3 Killed, Several Injured In Stabbing Attack At Festival In Germany’s SolingenAt least three people were killed during a stabbing attack during a festival in the western German city of Solingen on Friday.\n3 Killed, Several Injured In Stabbing Attack At Festival In Germany’s SolingenSolingen: in a tragic incident, three people were killed and several others sustained injuries in a stabbing attack during a festival in the western German city of Solingen, CNN reported.\nFor breaking news and live news updates, like us on Facebook or follow us on Twitter and Instagram.\nRead more on Latest World News on India.com."}, {"id": "be37cb4c-40d7-4c37-920c-b951d2431c4b", "title": "Brit hostage found dead in Hamas  terror tunnel  died of execution - style gunshot", "date": "2024-08-24 08:30", "url": "https://www.mirror.co.uk/news/world-news/brit-hostage-found-dead-hamas-33530182", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "The body of British hostage Nadav Popplewell, 51, was found along with five others in a tunnel 30 feet below the surface in the Gaza city of Khan Younis by Israeli soldiersA Brit hostage was found dead with execution-style gunshot wounds in a Hamas terror tunnel.\nSoldiers from the IDS entered the tunnel last Tuesday where they also found weapons belonging to Hamas.\nThe Israel-Hamas war was triggered by Hamas’s October 7 attack on southern Israel that killed 1,200 people and saw another 250 taken hostage.\nThe UK was steadfast in its support for Israel’s right to self defence, and would continue to work with partners to uphold regional security, the Prime Minister added.\nThe Prime Minister also urged Prime Minister Netanyahu to ensure greater access to detainees held by Israel, the increased delivery of aid to Gaza and to ensure international law was upheld at all times."}, {"id": "2cd9d009-c983-4aca-b97d-97a1657e608f", "title": "Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 03:45", "url": "https://www.moneycontrol.com/news/world/three-dead-after-stabbing-attack-at-festival-in-western-germany-12805661.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "Follow us on:Three dead after stabbing attack at festival in western Germany"}, {"id": "793d8b79-8d25-40d0-9e53-9e49756f989d", "title": "Maryland police officer convicted of tossing smoke bomb at police during Capitol riot", "date": "2024-08-24 00:15", "url": "https://www.nbcwashington.com/news/local/maryland-police-officer-convicted-of-tossing-smoke-bomb-at-police-during-capitol-riot/3701325/", "domain": "nbcwashington.com", "domain_classification": "Unknown", "message": "A Maryland police officer was convicted on Friday of charges that he joined a mob's Jan. 6, 2021, attack on the U.S. Capitol and hurled a smoke bomb and other objects at police officers guarding a tunnel entrance.\nThe device struck a police officer's riot shield and filled the mouth of the tunnel with a large plume of smoke, prosecutors said.\n“The actions of one individual do not define the entire department,” the department said in a statement last year.\nLee, of Rockville, Maryland, applied to be a Montgomery County police officer in July 2021 — six months after the riot.\nMoving to the Lower West Terrace, Lee tossed the smoke bomb and three other “rock-like objects\" at officers guarding the tunnel, the judge found."}, {"id": "b9f15b45-1f17-4264-af1b-75a7da6f9cc6", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 00:45", "url": "https://www.canberratimes.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The Festival of Diversity began on Friday to mark the 650th anniversary of Solingen and was due to continue through to Sunday.\nAll the events planned for Saturday and Sunday had been cancelled, the city said."}, {"id": "a385f60d-8f9c-4adb-9fd9-428caaa1e172", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 00:45", "url": "https://www.canberratimes.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The Festival of Diversity began on Friday to mark the 650th anniversary of Solingen and was due to continue through to Sunday.\nAll the events planned for Saturday and Sunday had been cancelled, the city said."}, {"id": "f532d1c9-5cc7-426b-b16f-8b13e523c779", "title": "Germany : Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 03:15", "url": "https://economictimes.indiatimes.com/news/international/world-news/three-dead-after-stabbing-attack-at-festival-in-western-germany/articleshow/112753072.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelGerman police said on Saturday that they were still searching for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western city of Solingen Eight were injured, five of them seriously, the police said in a statement early on Saturday.\nThat is up from the four serious injuries the police reported earlier.\n\"Both victims and witnesses are currently being questioned.\nThe police are currently searching for the perpetrator with a large team,\" police said.The incident occurred around 9:40 p.m. (1940 GMT) on Friday, when the man attacked multiple people with a knife, the police said.Fatal stabbings and shootings are relatively uncommon in Germany .\nThe government wants to toughen rules on knives that can be carried in public by reducing the maximum length allowed.In June a 29-year-old policeman died after being stabbed in Mannheim during an attack on a right-wing demonstration."}, {"id": "91d67d10-9985-4a0a-8cf2-884348e40883", "title": "Knifeman kills three , injures three in nighttime assault in western Germany", "date": "2024-08-24 01:15", "url": "https://tribune.com.pk/story/2490583/knifeman-kills-three-injures-three-in-nighttime-assault-in-western-germany", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Photo ReutersThree people were killed and three others seriously injured in a stabbing attack at a festival on Friday night in Solingen, western Germany, according to police.\nThe incident occurred around 10pm (2100 CET) when an unidentified man attacked several people.\nMayor Tim-Oliver Kurzbach expressed his anguish, stating, \"It tears my heart apart that there was an attack on our city.\nA similar stabbing occurred in June, resulting in the death of a 29-year-old policeman in Mannheim during a right-wing demonstration.\nThe German government is currently working to tighten regulations on public knife carrying by reducing the permissible length of blades."}, {"id": "e2d02626-95f2-46fd-aadf-90c6c7509038", "title": "Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 01:15", "url": "https://www.channelnewsasia.com/world/solingen-germany-stabbing-three-dead-after-attack-festival-4564961", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "SOLINGEN, Germany: Police hunted on Saturday (Aug 24) for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western German city of Solingen.\nEight were injured, five of them seriously, the police said in a statement early on Saturday.\n\"Both victims and witnesses are currently being questioned.\nThe police are currently searching for the perpetrator with a large team,\" police said.\n\"The perpetrator must be quickly caught and punished to the fullest extent of the law,\" German Chancellor Olaf Scholz said in a post on X."}, {"id": "4a6d4705-41d7-43c1-9ef4-88e5d6984f80", "title": "3 dead after stabbing attack at festival in western Germany", "date": "2024-08-24 02:00", "url": "https://www.asiaone.com/world/3-dead-after-stabbing-attack-festival-western-germany", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "SOLINGEN, Germany - Three people were killed and four others seriously wounded in a stabbing attack at a festival on Friday (Aug 23) night in the western German city of Solingen, police said.\nThe police said the attack occurred at a festival to honour the town's 650th anniversary.\nThe attack occurred at the Fronhof, the mayor's statement said, a market square where live bands were playing.\nIn June, a 29-year-old policeman died after being stabbed in the German city of Mannheim during an attack on a right-wing demonstration.\nThere was a stabbing attack on a train in 2021, injuring several."}, {"id": "bf8a9f65-2186-429c-8680-d4a7d9c08552", "title": "Deadly Stabbing Attack at Solingen Festival Leaves Multiple Victims", "date": "2024-08-24 00:00", "url": "https://www.devdiscourse.com/article/business/3062305-deadly-stabbing-attack-at-solingen-festival-leaves-multiple-victims", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "A tragic stabbing attack at a festival in Solingen, Germany, on Friday night resulted in multiple fatalities and injuries, according to police.\nThe incident was reported by Bild newspaper, which stated that a man had randomly attacked festival-goers at approximately 9:45 p.m. (1945 GMT).\nSolingen Mayor Tim-Oliver Kurzbach confirmed the casualties and injuries but withheld further details.\nHe expressed his profound grief, saying, “It tears my heart apart that there was an attack on our city.\nGermany has seen sporadic instances of fatal stabbings and shootings, including the stabbing of a policeman in Mannheim in June and an attack on a train in 2021."}, {"id": "ff905cc4-fc3f-4d11-9e09-7d1af69826ea", "title": "Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 02:00", "url": "https://www.swissinfo.ch/eng/three-dead-after-stabbing-attack-at-festival-in-western-germany/87430985", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Three dead after stabbing attack at festival in western Germanyreuters_tickers2 minutesBy Petra WischgollSOLINGEN, Germany (Reuters) -Three people were killed and four others seriously wounded in a stabbing attack at a festival on Friday night in the western German city of Solingen, police said.\n“It tears my heart apart that there was an attack on our city.\nThe police said the attack occurred at a festival to honour the town’s 650th anniversary.\nIn June, a 29-year-old policeman died after being stabbed in the German city of Mannheim during an attack on a right-wing demonstration.\nThere was a stabbing attack on a train in 2021, injuring several."}, {"id": "1ec66578-6d91-4a88-9e81-0a7042c51d6c", "title": "German police search for assailant in festival stabbing that killed 3 - World", "date": "2024-08-24 09:00", "url": "https://www.brecorder.com/news/40319092/german-police-search-for-assailant-in-festival-stabbing-that-killed-3", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "FRANKFURT: German police said on Saturday that they were still searching for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western city of Solingen.\nEight were injured, five of them seriously, the police said in a statement early on Saturday.\nA stabbing attack on a train in 2021 injured several.\nFriday’s attack occurred at a festival marking the 650th anniversary of Solingen in North Rhine-Westphalia, Germany’s most populous state, which borders the Netherlands.\nThe attack occurred at the Fronhof, a market square where live bands were playing."}, {"id": "7510321b-4153-4e9d-b32d-57db8843f909", "title": "German police search for assailant in festival stabbing that killed 3", "date": "2024-08-24 06:15", "url": "https://www.yahoo.com/news/german-police-search-assailant-festival-043318580.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "By Tom Sims and Rene WagnerFRANKFURT (Reuters) -Police hunted on Saturday for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western German city of Solingen.\nThe attack occurred at the Fronhof, a market square in Solingen where live bands were playing.\nIt was during a festival marking the 650th anniversary of the city in the state of North Rhine-Westphalia, which borders the Netherlands.\nThe German musician who goes by the name Topic said he was playing on a nearby stage when the incident occurred.\nA stabbing attack on a train in 2021 injured several."}, {"id": "bebc83f7-4ee5-4bc0-8438-0a1b69c4913c", "title": "German police search for assailant in festival stabbing that killed 3", "date": "2024-08-24 08:15", "url": "https://www.timeslive.co.za/news/world/2024-08-24-german-police-search-for-assailant-in-festival-stabbing-that-killed-3/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device."}, {"id": "289caf10-a21e-4b7b-bc03-b9437379098d", "title": "German police search for assailant in festival stabbing that killed 3", "date": "2024-08-24 06:00", "url": "https://www.swissinfo.ch/eng/german-police-search-for-assailant-in-festival-stabbing-that-killed-3/87431429", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "German police search for assailant in festival stabbing that killed 3reuters_tickers2 minutesBy Tom Sims and Rene WagnerFRANKFURT (Reuters) -Police hunted on Saturday for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western German city of Solingen.\nThe attack occurred at the Fronhof, a market square in Solingen where live bands were playing.\nIt was during a festival marking the 650th anniversary of the city in the state of North Rhine-Westphalia, which borders the Netherlands.\nA stabbing attack on a train in 2021 injured several.\nHe told reporters it was a targeted attack on human life but declined to speculate on the motive."}, {"id": "e4520e2c-cf6d-4a91-a122-63f486d69303", "title": "German police hunt for assailant in festival stabbing that killed 3", "date": "2024-08-24 08:15", "url": "https://www.cnbc.com/2024/08/24/german-police-hunt-for-assailant-in-festival-stabbing-that-killed-3.html", "domain": "cnbc.com", "domain_classification": "Unknown", "message": "Police officers secure access to the crime scene after the Solingen city festival on August 24, 2024 in Solingen, Germany.\nPolice hunted on Saturday for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western German city of Solingen.\nThe attack occurred at the Fronhof, a market square in Solingen where live bands were playing.\nThe German musician who goes by the name Topic said he was playing on a nearby stage when the incident occurred.\nA stabbing attack on a train in 2021 injured several."}, {"id": "4bb3bdbb-d95d-4ab5-a16a-a78d23f46e08", "title": "3 killed in Germany festival knife incident ; attacker reportedly on the run", "date": "2024-08-24 02:30", "url": "https://www.straitstimes.com/world/europe/multiple-dead-others-injured-after-stabbing-attack-at-festival-in-western-germany", "domain": "straitstimes.com", "domain_classification": "Local - Asia", "message": "FRANKFURT/SOLINGEN, Germany – German police said on Aug 24 that they were still searching for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in western city Solingen.\nThey are currently “searching for the perpetrator with a large team”.\nThe attack occurred at around 9.40pm on Aug 23 (3.40am on Aug 24 in Singapore).\nThe man attacked multiple people with a knife, aiming specifically for the throats of his victims, the police said.\nThe attack occurred at a festival to honour the town’s 650th anniversary."}, {"id": "6e584287-f6b2-4dfa-9327-97cc8195637d", "title": "Do Aircraft Carriers Travel Alone ? ", "date": "2024-08-24 00:30", "url": "https://www.slashgear.com/1645746/do-aircraft-carriers-travel-alone/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "The U.S. has 11 aircraft carriers at the moment, and each one is a powerful asset that's a big target for enemy forces.\nBig is the key word here, since despite being faster than you might think, aircraft carriers aren't exactly the most lithe, stealthy ships on the water, and quite vulnerable to attacks.\nThey typically consist of the aircraft carrier, two guided missile cruisers, two anti-aircraft warships, and one to two anti-submarine destroyers or frigates.\nCarrier groups are rarely alike, depending on the nature of the mission.\nSometimes there are also other types of ships, including supply ships, mine sweepers, troop ships, and cargo ships carrying tanks and other equipment."}, {"id": "110f8101-8bbc-4e20-93c7-325f6a638190", "title": "Police Search For Assailant After 3 Killed In Germany Stabbing Incident", "date": "2024-08-24 08:30", "url": "https://article.wn.com/view/2024/08/24/Police_Search_For_Assailant_After_3_Killed_In_Germany_Stabbi/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "German police said on Saturday that they were still searching for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western city of... ...... read full story"}, {"id": "526410ec-4020-46ec-afc2-20ddcadc2bcc", "title": "Secret Service agents reassigned in response to Trump assassination attempt", "date": "2024-08-24 01:15", "url": "https://www.voanews.com/a/secret-service-agents-reassigned-in-response-to-trump-assassination-attempt/7755164.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "At least five Secret Service agents have been placed on modified duty as a response to the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nThe shooting was a devastating failure of one of the agency's core duties and led to Kim Cheatle's resignation as Secret Service director.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle's resignation, has said he \"cannot defend why that roof was not better secured.\""}, {"id": "1e0431d5-441b-46a5-b361-fba339928945", "title": "Trump assassination attempt : At least 5 Secret Service agents placed on leave", "date": "2024-08-24 02:30", "url": "https://www.bostonherald.com/2024/08/23/at-least-5-secret-service-agents-placed-on-leave/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "At least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nThe agents are on administrative leave, meaning they cannot do investigative or protective work.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle’s resignation, has said he “cannot defend why that roof was not better secured.”"}, {"id": "4acc5499-5b60-4a3b-b480-b03e5d51a8ee", "title": "Germany festival : Several dead and wounded in stabbing attack", "date": "2024-08-24 00:15", "url": "https://www.nzherald.co.nz/world/germany-festival-several-dead-and-wounded-in-stabbing-attack/BJSG72YO3FDEBPV2WNNLAZQD2M/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "Several people have been killed and others wounded when a man knifed passers-by at random at a festival in the western German city of Solingen, newspaper Bild reports.\nVideo / BBCSeveral people have been killed and others wounded after a man knifed passers-by at random at a festival in the western German city of Solingen today, newspaper Bild reports.\nBild said the incident occurred at about 9.45pm on Friday (local time) and that at least three people were dead and several were wounded.\nWitnesses said the perpetrator was at large.\nThe local newspaper Solingen Tageblatt reported on its website that the attack occurred at a festival to honour the city’s 650 years."}, {"id": "1ef71e42-12dc-4948-af6f-b5baeffd0655", "title": "At least 5 Secret Service agents have been placed on modified duty after Trump assassination attempt", "date": "2024-08-24 00:15", "url": "https://www.local10.com/news/politics/2024/08/23/at-least-5-secret-service-agents-have-been-placed-on-modified-duty-after-trump-assassination-attempt/", "domain": "local10.com", "domain_classification": "Unknown", "message": "U.S. Secret Service Acting Director Ronald Rowe, testifies during a Senate Committee on Homeland Security and Governmental Affairs Senate Judiciary hearing examining the security failures leading to the assassination attempt on Republican presidential candidate former President Donald Trump, Tuesday, July 30, 2024 in Washington.\n(AP Photo/Rod Lamkey, Jr.)At least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle's resignation, has said he “cannot defend why that roof was not better secured.”__Associated Press writer Rebecca Santana contributed to this report."}, {"id": "96e06112-8bb0-4cf2-9856-3f85a5b07f2d", "title": "At least 5 Secret Service agents have been placed on modified duty after Trump assassination attempt", "date": "2024-08-24 00:30", "url": "https://www.news4jax.com/news/politics/2024/08/23/at-least-5-secret-service-agents-have-been-placed-on-modified-duty-after-trump-assassination-attempt/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "U.S. Secret Service Acting Director Ronald Rowe, testifies during a Senate Committee on Homeland Security and Governmental Affairs Senate Judiciary hearing examining the security failures leading to the assassination attempt on Republican presidential candidate former President Donald Trump, Tuesday, July 30, 2024 in Washington.\n(AP Photo/Rod Lamkey, Jr.)At least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle's resignation, has said he “cannot defend why that roof was not better secured.”__Associated Press writer Rebecca Santana contributed to this report."}, {"id": "2fd5eee0-5293-4a3b-8c12-2fc41eaa16e5", "title": "FBI probing drive - by attack on Sikh separatist in California", "date": "2024-08-24 04:30", "url": "https://economictimes.indiatimes.com/news/international/world-news/fbi-probing-drive-by-attack-on-sikh-separatist-in-california/articleshow/112754353.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "He said he immediately thought of Nijjar, saying \"this is how Hardeep Singh Nijjar had been assassinated and the whole picture of the scene went through my mind.\n\"As they attempted to escape the gunfire, their truck skidded and veered off the road into a ditch, said Raju.\nHe and his two friends fled into a nearby field and hid behind a haystack while they called 911.\n\"They want to stop the Khalistan referendum,\" he said.\n\"But this attack on me and the death threats is not going to deter me from continuing the campaign.\""}, {"id": "5e44c130-ec21-46dd-95f5-fe44a3dbc741", "title": "Sikh separatist attacked in drive - by in California , FBI probing", "date": "2024-08-24 00:30", "url": "https://www.ctvnews.ca/world/fbi-probing-drive-by-attack-on-sikh-separatist-in-california-1.7012634", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "Nijjar was killed in June 2023 outside his gurdwara, a Sikh place of worship, in Surrey, British Columbia.\nThe FBI's Sacramento office confirmed it is collaborating with the California Highway Patrol \"in support of the investigation\" into the shooting.\nIn the same month as Nijjar's killing, the FBI foiled an alleged assassination attempt against Gurpatwant Singh Pannun, another prominent Sikh separatist with dual citizenship in Canada and the United States.\nThe Indian Embassy in Washington did not respond to a request for comment on Friday about the recent shooting in California.\n\"But this attack on me and the death threats is not going to deter me from continuing the campaign.\""}, {"id": "05dbc657-f48b-46a7-9ead-43a36cb14c5a", "title": "At least 5 Secret Service agents have been placed on modified duty after Trump assassination attempt", "date": "2024-08-24 00:00", "url": "https://www.lowellsun.com/2024/08/23/at-least-5-secret-service-agents-have-been-placed-on-modified-duty-after-trump-assassination-attempt-2/", "domain": "lowellsun.com", "domain_classification": "Unknown", "message": "By MICHAEL BALSAMOAt least five Secret Service agents have been placed on modified duty after the assassination attempt on former President Donald Trump in July, a law enforcement official told The Associated Press.\nOne of the five agents was assigned to Trump’s protective detail, the official said.\nMultiple investigations have been launched as officials probe a complicated law enforcement failure that allowed a man with an AR-style rifle to get close enough to shoot and injure Trump at the rally.\nAt a congressional hearing after the assassination attempt, Cheatle acknowledged that the Secret Service was told about a suspicious person two to five times before the shooting.\nActing Secret Service Director Ronald Rowe Jr., who took over after Cheatle’s resignation, has said he “cannot defend why that roof was not better secured.”__Associated Press writer Rebecca Santana contributed to this report."}, {"id": "4db07a47-ec66-4f5b-b4d2-f27da340833f", "title": "German police search for assailant in festival stabbing that kills 3", "date": "2024-08-24 05:00", "url": "https://www.thestar.com.my/news/world/2024/08/24/german-police-search-for-assailant-in-festival-stabbing-that-kills-3", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "FRANKFURT (Reuters) -Police hunted on Saturday for an unknown assailant hours after he killed three people and wounded others in a stabbing attack at a festival in the western German city of Solingen.\nThe attack occurred at the Fronhof, a market square in Solingen where live bands were playing.\nIt was during a festival marking the 650th anniversary of the city in the state of North Rhine-Westphalia, which borders the Netherlands.\nThe German musician who goes by the name Topic said he was playing on a nearby stage when the incident occurred.\nA stabbing attack on a train in 2021 injured several."}, {"id": "c3f59040-d15a-4d39-93ef-190609d44228", "title": "At least 5 Secret Service agents have been placed on modified duty after Trump assassination attempt", "date": "2024-08-24 06:45", "url": "https://www.smdailyjournal.com/news/national/at-least-5-secret-service-agents-have-been-placed-on-modified-duty-after-trump-assassination/article_3332b8a8-6196-11ef-8e79-d7f0c6e2aed9.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "f3fb9c82-1e50-45b4-94cc-c2b8a832ca0a", "title": "Secret Service quietly puts five officers on leave , as campaigns move on from Trump shooting", "date": "2024-08-24 00:15", "url": "https://www.salon.com/2024/08/23/secret-quietly-puts-five-officers-on-leave-as-campaigns-move-on-from/", "domain": "salon.com", "domain_classification": "Unknown", "message": "In addition to the Pittsburgh field office head, at least three officers from that office and one member of the former president’s personal detail were also placed on leave, according to CBS News.\nThe decision, which was not confirmed to be a disciplinary action, comes as the shooting — once thought to be election-defining — moves to the back burner on the campaign trail.\nThe shooting at the Butler, Pennsylvania rally was called a massive security breakdown, with the FBI later taking the reins of the investigation as the Secret Service’s own ​​internal affairs division continues its inquiry.\nThough Secret Service spokesperson Anthony Guglielmi didn’t confirm the suspensions, telling CBS they wouldn’t comment on individuals, he confirmed that agents were being held to “the highest professional standards” and that disciplinary action could occur if a policy violation was found.\nTrump, who returned on Wednesday for his first outdoor rally since the shooting, made no mention of the conspicuous newly added bulletproof glass standing between him and the crowd."}, {"id": "71c239e1-11e8-4da5-bfa8-714c404d9c1b", "title": "Suspect on the run , several dead in mass stabbing in Germany", "date": "2024-08-24 07:15", "url": "https://www.marketscreener.com/news/latest/Suspect-on-the-run-several-dead-in-mass-stabbing-in-Germany-47726705/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "STORY: At least three people were killed and several others were badly wounded in a mass stabbing in Germany on Friday (August 23).\nPolice searched the scene of the attack in Solingen, a city in western Germany.\nThey believe the suspect, a single, unidentified man, carried out the act on his own.\nBut the government wants tougher laws on carrying knives in public and banning longer blades.\nIn June 2024, a 29-year-old policeman died after he was stabbed during an attack on a right-wing demonstration in Mannheim."}, {"id": "563aa893-dee3-48f3-ba96-fee731b5018e", "title": "German police hunting attacker who killed at least 3 in Solingen", "date": "2024-08-24 06:15", "url": "https://www.yahoo.com/news/german-police-hunting-attacker-killed-054122879.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The attacker was still on the run early on Saturday morning, police said, and the search continues.\nSpecial units were searching for the attacker in the city, according to a dpa reporter.\nPolice warned residents who observe anything suspicious not to act on their own initiative but call the police emergency number.\nThe attacker had managed to escape amid the panic that spread after the stabbing, said a spokesman for the North Rhine Westphalia Interior Ministry.\nPolice and ambulances stand near the scene, where people were killed and injured in an attack at the 650th anniversary celebrations of the city of Solingen in western Germany Gianni Gattus/dpaPolice officers stand at a cordon in the city center after, several people were killed and injured in an attack at the city's 650th anniversary celebrations."}, {"id": "245fab7c-d29c-4bea-8de4-c12c54313743", "title": "Hunt for German festival knifeman : Woman and two men are stabbed to death with five more seriously wounded in  brutal and senseles attacks on random passers - by", "date": "2024-08-24 08:00", "url": "https://www.dailymail.co.uk/news/article-13775535/Hunt-German-knifeman-woman-two-men-stabbed-death-diversity-festival.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A woman and two men were killed and eight others injured, five of them seriously, in the 'brutal and senseless' attack in the western German city of Solingen last night, police have said.\n'None of us knows why' the attack took place, said Herbert Reul, who is the interior minister of North Rhine-Westphalia state.\nThe usually quiet Fronhof central square had been packed with people last night for Solingen's three-day Festival of Diversity.\nThere are currently three fatally injured victims, four seriously injured and people in shock.\nRoad crossings were closed and residents were asked to stay in their homes following the attack last night."}, {"id": "a1aae75a-4da8-4840-b04f-2794b329f225", "title": "Five Secret Service agents placed on modified duty after Trump assassination attempt", "date": "2024-08-24 04:45", "url": "https://www.9news.com.au/world/at-least-5-secret-service-agents-have-been-placed-on-modified-duty-after-trump-assassination-attempt/e3801723-d402-45e8-b526-0219d7a3570c", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "At least five Secret Service agents have been placed on modified duty after the assassination attempt on former PresidentDonald Trumpin July, a law enforcement official told The Associated Press."}, {"id": "58fd6799-d617-4376-84ac-775d3c595a4a", "title": "FBI probing attack on Sikh separatist with ties to Nijjar", "date": "2024-08-24 00:30", "url": "https://www.cbc.ca/news/canada/british-columbia/fbi-probe-attack-on-sikh-separatist-1.7303991", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Speaking through an interpreter, Raju told Reuters that a white car pulled up to the left of their truck, then fell back behind them before pulling up alongside them again.\nAs they attempted to escape the gunfire, their truck skidded and veered off the road into a ditch, Raju told Reuters.\n(CBC)In the same month as Nijjar's killing, the FBI foiled an alleged assassination attempt against Gurpatwant Singh Pannun, another prominent Sikh separatist with dual citizenship in Canada and the United States.\nRaju told Reuters he was not among those who received such calls.\nA look at the movement for an independent Sikh state Duration 13:38 Some Sikhs have historically been seeking an independent Sikh homeland in northern India called Khalistan."}, {"id": "f385f8d8-ddf1-4b67-8602-1b92c0479c76", "title": "FBI probes attack on Sikh separatist in California", "date": "2024-08-24 06:30", "url": "https://tribune.com.pk/story/2490591/fbi-probes-attack-on-sikh-separatist-in-california", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Nijjar was killed in June 2023 outside his gurdwara, a Sikh place of worship, in Surrey, British Columbia.\nThat killing, and Trudeau's suggestion of possible Indian government involvement, triggered a diplomatic crisis between the countries.\nIn the same month as Nijjar's killing, the FBI foiled an alleged assassination attempt against Gurpatwant Singh Pannun, another prominent Sikh separatist with dual citizenship in Canada and the United States.\nThe Indian Embassy in Washington did not respond to a request for comment on Friday about the recent shooting in California.\n\"But this attack on me and the death threats is not going to deter me from continuing the campaign.\""}, {"id": "5821dfa1-5263-4cf5-8019-39931bfb7303", "title": "As threats rise , Israelis turn to home bomb shelters", "date": "2024-08-24 03:30", "url": "https://www.al-monitor.com/originals/2024/08/threats-rise-israelis-turn-home-bomb-shelters", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "Israeli couple Aviva Pertzov and Jeff Lederer put off building a bomb shelter for years.\nWhen it is finished, this \"safe room\" will have white-painted walls, a sofa and a tiled floor, and a single window with a heavy metal shutter that closes across it with a clang.\nHe added: \"Those (safe) rooms save lives.\nThe cost of building such a safe room varies approximately between $30,500 and $56,000.\nHowever, about 55 percent of Israeli households do not have safe rooms, according to official estimates, because of either cost, lack of space, fatalism or obstinacy."}, {"id": "c824558a-8756-4015-b938-10ccf374c714", "title": "Ukraine prioritising holding on to Russian territory", "date": "2024-08-24 01:30", "url": "https://www.dailymail.co.uk/news/article-13775063/Ukraine-prioritising-holding-Russian-territory-seized-following-daring-mini-invasion-Zelensky-trade-Kursk-recover-land-captured-illegally-Putins-army.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Ukraine's daring 'mini-invasion' of southern Russia is not expected to push any further into the country, Western officials have said.\nSpeaking for the first time about the surprise incursion, they suggested that the Kyiv regime will chiefly aim to hold on to the territory it has already seized.\nOfficials indicated that the area of the Kursk region involved could be used in a potential trade-off by president Volodymyr Zelensky to recover Ukrainian land captured illegally by Moscow.\nThere are fresh hopes that negotiations could end the war after India's prime minister Narendra Modi visited Kyiv yesterday.\nWestern officials said five brigades of Russian troops were being reassigned to reinforce Kursk."}, {"id": "b6ba3e83-a9b8-46b8-aa52-96b75fcc3b56", "title": "Germany : At Least 3 Dead And Others Injured In Festival Stabbing , Assailant On The Run", "date": "2024-08-24 03:15", "url": "https://www.oann.com/newsroom/germany-at-least-3-dead-and-others-injured-in-festival-stabbing-assailant-on-the-run/", "domain": "oann.com", "domain_classification": "Unknown", "message": "(Photo by INA FASSBENDER/AFP via Getty Images)OAN Staff Abril Elfi5:12 PM – Friday, August 23, 2024At least three people have been killed and several others were injured after a stabbing attack took place at a Festival of Diversity in Germany.\nAdvertisementAccording to the newspaper Bild, an unidentified man began randomly stabbing bystanders on Friday night in Solingen, Germany.\nIt was unclear at first how many people had died, but the newspaper reported that the incident at a city festival at around 9.45 p.m. local time had resulted in at least three fatalities and several injuries.\nOther outlets have reported that at least four individuals were badly injured in addition to the three that died.\nCommemorating the city’s 650th anniversary, the “Festival of Diversity” commenced on Friday and was scheduled to continue through Sunday."}, {"id": "bb9487b1-880c-41dd-b966-3594c438b220", "title": "Three dead after stabbing attack at festival in western Germany", "date": "2024-08-24 04:00", "url": "https://www.geo.tv/latest/560709-three-dead-after-stabbing-attack-at-festival-in-western-germany", "domain": "geo.tv", "domain_classification": "Unknown", "message": "Police officers secure the area of an incident, after several individuals were killed on Friday night when a man randomly stabbed passers-by with a knife, at a city festival in Solingen, Germany, August 23, 2024.\n—ReutersSOLINGEN: Three people were killed and four others seriously wounded in a stabbing attack at a festival on Friday night in the western German city of Solingen, police said.\nThe police said the attack occurred at a festival to honour the town's 650th anniversary.\nThe attack occurred at the Fronhof, the mayor's statement said, a market square where live bands were playing.\nIn June, a 29-year-old policeman died after being stabbed in the German city of Mannheim during an attack on a right-wing demonstration."}, {"id": "6d8de742-4df9-43f5-ba24-7dd354cd92d4", "title": "Trump three - word warning to police association president as he hogged the microphone at explosive Arizona rally", "date": "2024-08-24 03:30", "url": "https://www.dailymail.co.uk/news/article-13775141/Trump-warning-police-association-president-Arizona-rally.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Donald Trump booted the president of the Arizona Police Association off the stage at his rally - telling him 'you gotta go.'\nJustin Harris joined the former president on stage at the Desert Diamond Arena in Glendale on Friday night.\nAfter speaking for nearly 10 minutes, the crowd grew restless and began chanting from Trump to take back the microphone.\nHarris looked at Trump standing behind him and the former president told him to wrap it up, saying 'you gotta go.'\nI will establish a new independent commission on assassination attempts,' Trump - an assassination survivor himself - said."}, {"id": "38795d74-b1bf-4604-95ce-9d7972a41630", "title": "Germany : Knife attack during festival in Solingen leaves three people dead | Indiablooms - First Portal on Digital News Management", "date": "2024-08-24 08:00", "url": "https://www.indiablooms.com/world-details/F/43242/germany-knife-attack-during-festival-in-solingen-leaves-three-people-dead.html", "domain": "indiablooms.com", "domain_classification": "Unknown", "message": "Photo Courtesy: PixabayAt least three people died and four others were injured in a knife attack in the western German city of Solingen on Friday, media reports said.\nThe attack took place during the “Festival of Diversity\", the three-day event to mark the 650th anniversary of the city's founding.\nHerbert Reul, interior minister for the state of North Rhine-Westphalia, was quoted as saying by CNN: \"None of us know why this happened.\nHeavily armed SEK units with about 40 special vehicles from all over North Rhine-Westphalia had been deployed to Solingen, DW reported quoting Bild.\nWith a population of about 160,000, the city in North Rhineland-Westphalia, is popularly known for its steel industry."}, {"id": "154b56f8-eca4-46ac-9883-b0bc163cd65c", "title": "As threats rise , Israelis turn to home bomb shelters", "date": "2024-08-24 06:15", "url": "https://www.ktbs.com/news/national/as-threats-rise-israelis-turn-to-home-bomb-shelters/article_53c88ef1-2c3a-5a73-9526-fd39a47604c2.html", "domain": "ktbs.com", "domain_classification": "Unknown", "message": "An email has been sent to with a link to confirm list signup."}, {"id": "6d13f2e1-7846-4649-b5f6-5e98ab81e069", "title": "Solingen : German stabbing attack leaves three dead", "date": "2024-08-24 00:00", "url": "https://us.cnn.com/2024/08/23/europe/germany-solingen-stabbing-attack-intl-latam/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —A major manhunt is underway in Germany after an attacker stabbed to death three people and seriously wounded several others at a festival on Friday evening in the western city of Solingen.\nA lone male suspect remained on the run on Saturday morning, with special forces deployed to the active manhunt, police said.\n“The attack in Solingen is a terrible event that I find very upsetting,” he wrote on X.\nPolice and ambulances near the scene where people were killed and injured in an attack at a festival in Solingen.\nFriday’s attack comes amid rising rates of knife crime in Germany, recently prompting Interior Minister Faeser to propose tightened laws to tackle the issue."}, {"id": "fb03a6c6-e52b-4750-a022-6a846dbf01f3", "title": "Fires break out on oil tanker abandoned after attack", "date": "2024-08-24 08:30", "url": "https://www.crookwellgazette.com.au/story/8741073/fires-break-out-on-oil-tanker-abandoned-after-attack/?cs=14264", "domain": "crookwellgazette.com.au", "domain_classification": "Unknown", "message": "The Houthis didn't immediately acknowledge the fire.\nThe rebels are suspected to have gone back and attacked at least one other vessel that later sank as part of their months-long campaign against shipping in the Red Sea over the ongoing Israel-Hamas war in the Gaza Strip."}, {"id": "4c25b7c5-8a19-45fb-982e-f1b768f810d6", "title": "Fires break out on oil tanker abandoned after attack", "date": "2024-08-24 08:30", "url": "https://www.sconeadvocate.com.au/story/8741073/fires-break-out-on-oil-tanker-abandoned-after-attack/", "domain": "sconeadvocate.com.au", "domain_classification": "Unknown", "message": "The Houthis didn't immediately acknowledge the fire.\nThe rebels are suspected to have gone back and attacked at least one other vessel that later sank as part of their months-long campaign against shipping in the Red Sea over the ongoing Israel-Hamas war in the Gaza Strip."}, {"id": "11e43ad5-b986-47cf-98e9-21225f09b0a9", "title": "Fires break out on oil tanker abandoned after attack", "date": "2024-08-24 08:30", "url": "https://www.easternriverinachronicle.com.au/story/8741073/fires-break-out-on-oil-tanker-abandoned-after-attack/?cs=6364", "domain": "easternriverinachronicle.com.au", "domain_classification": "Unknown", "message": "The Houthis didn't immediately acknowledge the fire.\nThe rebels are suspected to have gone back and attacked at least one other vessel that later sank as part of their months-long campaign against shipping in the Red Sea over the ongoing Israel-Hamas war in the Gaza Strip."}, {"id": "2f6eda08-e1f7-45b7-98e1-0c84096f4f44", "title": "Police arrest Arizona man for threatening to kill Donald Trump", "date": "2024-08-24 02:15", "url": "https://www.jpost.com/international/article-816097", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "An Arizona man who was wanted after threatening over social media to kill former President Donald Trump was arrested on Thursday, the Cochise County Sheriff's Office said.\nDonald Trump, the Republican nominee for president, was in Cochise County on Thursday when he visited the US border with Mexico as part of his campaign.\nThe man, Ronald Lee Syvrud, 66, had multiple outstanding warrants from Wisconsin, the sheriff's office said.\nSyvrud was subsequently booked into the Cochise County Jail on a felony warrant from Graham County in Arizona for \"failure to register as a sex offender and two counts of threatening for this case,\" the sheriff's office added.\nAssassination attemptIn early August, a Virginia man was charged with threatening Vice President Kamala Harris, Trump's Democratic rival, and a New Hampshire man was arrested in December for threatening to kill Republican presidential candidates."}, {"id": "03705d9c-02c3-46b7-8baf-3d25573c5d30", "title": "German police hunting attacker who killed at least 3 in Solingen", "date": "2024-08-24 07:15", "url": "https://www.yahoo.com/news/german-police-hunting-attacker-killed-055717963.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The attacker had managed to escape amid the panic that spread after the stabbing, said a spokesman for the North Rhine Westphalia Interior Ministry.\nThe Festival of Diversity began on Friday to mark the 650th anniversary of Solingen and was due to continue through to Sunday.\nPolice officers walk through the city center after several people were killed and injured in an attack at the city's 650th anniversary celebrations.\nChristoph Reichwein/dpaA police officer stands at a cordon after several people were killed and injured in an attack at the city's 650th anniversary celebrations.\nChristoph Reichwein/dpaPolice cars stand at a cordon after several people were killed and injured in an attack at the city's 650th anniversary celebrations."}, {"id": "4ef064ae-5ff8-49c6-b5d1-1ed43a5506a9", "title": "  Very unusual  fire caused rocket explosion , delaying first space launch bid", "date": "2024-08-24 08:00", "url": "https://www.aol.co.uk/very-unusual-fire-caused-rocket-070707998.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "The blast on Monday has delayed a German company’s efforts to carry out the first vertical satellite launch from European soil.\nRocket Factory Augsburg (RFA) said launching in the coming weeks or months was “no longer possible”.\nThe spokesman said: “Unfortunately this has happened in that very important stage test and unfortunately this has taken out the entire stage.\nAnother German company, HyImpulse, also has plans to launch from SaxaVord, as well as the US-based ABL Space Systems.\n“We build the capability over a number of years, and launch is just a small part of the overall space sector.”"}, {"id": "7eac798c-bd46-4208-a363-e69961e4afcf", "title": "Okaloosa deputy charged in airman death , high school football returns , Baker High School vandalized", "date": "2024-08-24 00:15", "url": "https://www.yahoo.com/news/okaloosa-deputy-charged-airman-death-222018587.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Simone and Gerhard will bring you highlights tonight at 10 on our weekly high school football show: 5th Quarter.\nBaker High School vandalizedA high school football rivalry goes too far.\nGraffiti was discovered at Baker High School on the day the season kicks off.\nPoll of the DayThe 2024 high school football season has finally arrived!\nWe asked, “Are you attending the high school football games or just watching the recaps?”Here are your responses."}, {"id": "5813a0cb-db1f-4fed-a3ca-37dcb8fd82c0", "title": "Solingen : German stabbing attack leaves three dead", "date": "2024-08-24 01:45", "url": "https://edition.cnn.com/2024/08/23/europe/germany-solingen-stabbing-attack-intl-latam/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —A major manhunt is underway in Germany after an attacker stabbed to death three people and seriously wounded several others at a festival on Friday evening in the western city of Solingen.\nA lone male suspect remained on the run on Saturday morning, with special forces deployed to the active manhunt, police said.\n“The attack in Solingen is a terrible event that I find very upsetting,” he wrote on X.\nPolice and ambulances near the scene where people were killed and injured in an attack at a festival in Solingen.\nFriday’s attack comes amid rising rates of knife crime in Germany, recently prompting Interior Minister Faeser to propose tightened laws to tackle the issue."}, {"id": "8b7dde93-4136-4645-a563-6f8b2b888c9b", "title": "Attacker at large after three killed in German stabbing", "date": "2024-08-24 07:00", "url": "https://www.canberratimes.com.au/story/8740873/attacker-at-large-after-three-killed-in-german-stabbing/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The Festival of Diversity began on Friday to mark the 650th anniversary of Solingen and was due to continue through to Sunday.\nAll the events planned for Saturday and Sunday had been cancelled, the city said."}, {"id": "febaf3e9-22fd-4721-af7c-b803f1c394e2", "title": "Michigan School Bombing Among Largest Mass Murder in U . S . History", "date": "2024-08-24 01:45", "url": "https://wmmq.com/ixp/689/p/bath-school-massacre/", "domain": "wmmq.com", "domain_classification": "Unknown", "message": "The largest U.S. Death Toll in a School tragedy was the Bath School Massacre and it was heartbreaking.\nThe bombing took the lives of 58 people in and around Bath School.\nThis horrific event that took place in 1927 was the largest mass murder in U.S. history up until the Oklahoma City bombing in 1995.\nMany are surprised that the two biggest mass killings in the U.S. are bombings, not mass shootings.\nGet our free mobile appThe people who lost their lives in the tragic bombing in 1927 are remembered at the Bath School Massacre Memorial in Bath Township, Michigan."}, {"id": "d98530b4-35bb-4aea-8939-60ba70a7dc81", "title": "How global media reported PM Modi visit to Ukraine as Russia continues its war", "date": "2024-08-24 04:30", "url": "https://www.livemint.com/news/how-global-media-looked-at-pm-modi-visit-to-ukraine-as-russia-continues-its-invasion-of-kyiv-11724468449873.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "Prime Minister Narendra Modi on Friday, August 23, visited Ukraine and met President Volodymyr Zelensky as the Russian military continues to invade the country.\nArriving for talks in Kyiv, PM Modi embraced Zelensky with a hug and held a minute of silence at a memorial commemorating children killed in Russia's invasion.\nPM Modi's visit to Ukraine, which has not explicitly condemned Russia's invasion of Kyiv, was closely watched by the West.\nNews agency Associated Press (AP) said PM Narendra Modi's visit to war-torn Ukraine could be seen as India casting itself as a peace mediator as New Delhi offered “as a friend” to help bring peace to the country.\nThe Moscow Times listed how India has continued its trade with Russia when the West was imposing sanctions on Moscow for its invasion of Ukraine."}, {"id": "063f57a5-8b80-4ca1-aa36-73c6b7ce79ab", "title": "Manhunt in Germany after deadly stabbing attack at festival - Boston News , Weather , Sports", "date": "2024-08-24 01:30", "url": "https://whdh.com/news/manhunt-in-germany-after-deadly-stabbing-attack-at-festival/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "(CNN) — A manhunt is underway after an attacker armed with a knife killed three people and seriously wounded four others at a festival Friday in the western German city of Solingen, police told CNN.\nThe lone male suspect is on the run and special police forces have been deployed to the active manhunt, police added.\nCrowds had gathered at the square Friday to celebrate the “Festival of Diversity,” a three-day event marking the 650th anniversary of the city’s founding.\nPolice say the attack occurred close to the stage where a musical act was performing.\nAccording to the festival’s website, Friday was the start of the three-day “Festival of Diversity,” which would include music, food, performances, and family-friendly entertainment."}, {"id": "d2436882-bc17-441d-b578-213ffca55d28", "title": "Fires break out on oil tanker abandoned after attack", "date": "2024-08-24 09:30", "url": "https://www.newcastleherald.com.au/story/8741073/fires-break-out-on-oil-tanker-abandoned-after-attack/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "The Houthis didn't immediately acknowledge the fire.\nThe rebels are suspected to have gone back and attacked at least one other vessel that later sank as part of their months-long campaign against shipping in the Red Sea over the ongoing Israel-Hamas war in the Gaza Strip."}, {"id": "c6913ffb-e289-4d57-af2d-e676f4762472", "title": "Putin  feeding troops into a wood chipper  as Russia reels from Kursk  humiliation  | World | News", "date": "2024-08-24 07:00", "url": "https://www.express.co.uk/news/world/1939819/vladimir-putin-russia-ukraine-kursk", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Vladimir Putin's Russia is struggling to respond after the Kursk incursionVladimir Putin is continuing to \"feed soldiers into the wood chipper” with Ukraine’s audacious Kursk operation amounting to a “humiliation” for the Russian President, former US National Security Advisor John Bolton has said.\nMr Bolton was speaking after a surprise incursion by Volodymyr Zelensky’s soldiers on August 6 saw Ukraine seize large chunks of Russian territory, leaving Putin furious.\nAnd Mr Bolton, speaking during a webinar organised by the Foreign Press Association, said the events of the last few days amounted to a “humiliation” for the Kremlin and Putin himself.\nIn answer to a question by Express.co.uk, Mr Bolton, who spent 18 months working alongside then-President Donald Trump between 2018 and 2019, said: “You think Russia can't get worse in its military performance, and it does what.\nRussian citizens in Kursk being evacuated from border settlements to safe areasTrending"}, {"id": "791a75da-100f-4f6b-9c5a-07526cfe5133", "title": "Secret Service faces continued scrutiny after assassination attempt on Trump , agents placed on leave", "date": "2024-08-24 00:30", "url": "https://www.yahoo.com/news/secret-faces-continued-scrutiny-assassination-231137475.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Secret Service faces continued scrutiny after assassination attempt on Trump, agents placed on leaveRepublican presidential candidate former President Donald Trump is surrounded by U.S. Secret Service agents as he leaves the stage at a campaign rally, Saturday, July 13, 2024, in Butler, Pa. At least five members of the Secret Service have been placed on administrative leave following the assassination attempt on Trump.\nIn the aftermath, Secret Service Director Kimberly Cheatle resigned and was replaced by Acting Director Ronald Rowe.\nA breakdown in communication between local police and the Secret Service contributed to the failure to apprehend Crooks before the shooting, per CNN.\n“I can confirm that the Butler County ESU team made radios available to the Secret Service and that they were not utilized by the Secret Service,” Butler County District Attorney Richard Goldinger said in a statement to CNN.\n“This was a Secret Service failure,” Rowe told reporters during a conference earlier this month, per CNN."}, {"id": "2d3b5a89-0419-4764-aa3c-6b121952af05", "title": "Multiple Secret Service agents on leave after assassination attempt on Trump", "date": "2024-08-24 00:00", "url": "https://www.wtvr.com/politics/trump-indictments/secret-service-places-multiple-agents-on-administrative-leave-following-assassination-attempt-on-trump", "domain": "wtvr.com", "domain_classification": "Unknown", "message": "A source familiar with the situation confirmed to Scripps News that several Secret Service agents, including the special agent in charge of the Pittsburgh field office, have been placed on administrative leave in the wake of the July 13 assassination attempt against former President Donald Trump.\nRELATED STORY | Trump campaigns behind bulletproof glass in first outdoor rally since assassination attemptKimberly Cheatle told Congress one day before resigning as Secret Service director that the incident was the Secret Service's \"most significant operational failure\" in decades.\n\"The U.S. Secret Service is committed to investigating the decisions and actions of personnel related to the event in Butler, Pennsylvania and the attempted assassination of former President Donald Trump,\" said Anthony Guglielmi, U.S. Secret Service chief of communications.\nThe U.S. Secret Service holds our personnel to the highest professional standards, and any identified and substantiated violations of policy will be investigated by the Office of Professional Responsibility for potential disciplinary action.\"\nThe Department of Homeland Security said that it would conduct an independent 45-day review of the July 13 incident that left Trump wounded."}, {"id": "b9a1d9ef-b1c3-458c-8936-b2a68730e6ce", "title": "Tensions mount in Lebanon as those in border areas prepare for the worst in Israel - Hezbollah conflict", "date": "2024-08-24 04:00", "url": "https://www.independent.ie/world-news/middle-east/tensions-mount-in-lebanon-as-those-in-border-areas-prepare-for-the-worst-in-israel-hezbollah-conflict/a231096996.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Tensions mount in Lebanon as those in border areas prepare for the worst in Israel-Hezbollah conflictCitizens say they feel trapped between warring parties in the regionA man works next to a destroyed home in the Israeli-annexed Golan Heights.\nPhoto: AP/Ariel SchalitSusannah George © Washington Post Today at 03:30For weeks, the Middle East has been on edge, waiting for a retaliatory Iranian attack on Israel that many fear could trigger all-out war.\nWhile Tehran has signalled it will bide its time, daily violence continues to rage along the Israel-Lebanon border."}, {"id": "29f13c7b-498e-4c59-bc17-31c22389fd45", "title": "La Grand Motte synagogue arson horror as  gas cylinder explosion  injures police officer - World News", "date": "2024-08-24 08:30", "url": "https://www.mirror.co.uk/news/world-news/breaking-la-grand-motte-synagogue-33530442", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "The synagogue has been set on fire and one police officer injured after a the suspected arson attack was followed by an explosion in the seaside town of La Grand Motte, FranceA synagogue has been set ablaze and a police officer left injured after a suspected arson attack at the Beth Yacov synagogue at the resort of La Grand Motte in France.\nFirefighters, the municipal police and the gendarmerie rushed to the scene after the fire was reported around 8.40am local time on Saturday.\nOne police officer was then taken to hospital after being thrown to the ground by a sudden explosion.\nA gas bottle was clearly stored in one of two cars parked directly outside the synagogue, and that’s what caused the explosion.\nEarlier this year, French police shot dead an armed man who set fire to a synagogue in the city of Rouen, Normandy."}, {"id": "6fa12995-03fa-499c-bc56-48878a4354c1", "title": "Donald Trump Fundraises on Return to Site of Assassination Attempt in Pennsylvania , Promoting  Rally of the Century  ", "date": "2024-08-24 03:00", "url": "http://www.econotimes.com/Donald-Trump-Fundraises-on-Return-to-Site-of-Assassination-Attempt-in-Pennsylvania-Promoting-Rally-of-the-Century-1684948", "domain": "econotimes.com", "domain_classification": "Unknown", "message": "Former President Donald Trump is making a dramatic return to Butler County, Pennsylvania, the very location where he survived an assassination attempt earlier this year.\nThis visit, billed as the \"Rally of the Century,\" has been turned into a fundraising opportunity by the Trump campaign, capitalizing on the heightened emotions and symbolism surrounding the event.\nIn a message sent to supporters, Trump announced his upcoming rally with characteristic flair, urging his base to join him at the site of the near-tragic incident.\nThe assassination attempt took place in July when 20-year-old Thomas Matthew Crooks opened fire on a crowd during one of Trump's rallies.\nIn the wake of the assassination attempt, Trump's campaign became more cautious in selecting venues for rallies, prioritizing enclosed spaces with stringent security measures."}, {"id": "631ac2d6-f80a-4258-b017-77915dd52219", "title": "Germany : Several killed in stabbing attack at festival in Solingen", "date": "2024-08-24 00:30", "url": "https://news.webindia123.com/news/Articles/World/20240824/4228151.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "The attack happened on a central square, the Fronhof, according to Euro News.\n\"Festival of Diversity\" being held in the city over the weekend to mark the 650th anniversary of its founding, CNN reported, citing police.\nSolingen has about 160,000 inhabitants and is located near the bigger cities of Cologne and Dusseldorf.\n\"This evening, all of us in Solingen are experiencing shock, horror, and great sadness,\" city mayor, Tim Kurzbach, wrote on Solingen's Facebook page.\nThe three-day \"Festival of Diversity,\" started on Friday, according to the festival's website and it was supposed to include music, food, performances, and family-friendly entertainment."}, {"id": "1d35d588-7703-4a5f-be7e-531e6b24ef9e", "title": "Russell Westbrook Posts Instagram Story Message For Kobe Bryant", "date": "2024-08-24 02:30", "url": "https://www.si.com/fannation/nba/fastbreak/russell-westbrook-posts-instagram-story-message-for-kobe-bryant", "domain": "si.com", "domain_classification": "Unknown", "message": "Kobe said he sees 'a ton' of similarities between he and Westbrook pic.twitter.com/8uJPdLVKkI"}, {"id": "c4c854a7-5d48-4fea-b627-b3c6fb1cdb9c", "title": "Blast in Pishin kills 2 children , injures 14 others", "date": "2024-08-24 08:00", "url": "https://www.thenews.com.pk/latest/1223301-blast-in-pishin-kills-2-children-injures-10-others", "domain": "thenews.com.pk", "domain_classification": "Unknown", "message": "The picture shows site of blast in Quetta's Pishin on August 24, 2024.\n— Provided by the reporterQUETTA: At least two children died while 14 others sustained injuries in an explosion on Saturday near a police line in Balochistan's city of Pishin, Geo News reported citing police officials.\nMedical superintendent of Pishin Hospital, Dr Wakeel Sherani, said 13 wounded were moved to Quetta after receiving first aid while the bodies of the children and one of the injured are in the hospital.\nCondolencesPresident Asif Ali Zardari strongly condemned the blast in Pishin resulting in the killing of innocent children.\nBalochistan Chief Minister Sarfraz Bugti also condemned the blast, saying that the anarchists want to destroy the peace of the province."}, {"id": "7c3c12fe-4501-4e24-bd0b-99405e575549", "title": "Russo - Ukraine War - 23 August 2024", "date": "2024-08-24 00:15", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-23.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nThe General Staff of the Armed Forces of Ukraine reported that Defense Forces of Ukraine continue to repel attacks.\nIn the Kharkiv direction, Russian terrorists are trying to appease Ukrainian units in the areas of Vovchansk and Glybokoye.\nIn the Kramators Краkomu direction, Ukrainian soldiers repelled 20 Russian attempts to advance near the Chasovoye Yar, Kalinivka and Ivanivsky."}, {"id": "b7eab541-b10e-481f-902c-7cb640978a1e", "title": "U . S . Should Encourage a Political Settlement in Yemen to Defeat Al - Qaeda and Contain Iran", "date": "2024-08-24 06:30", "url": "https://www.heritage.org/middle-east/report/us-should-encourage-political-settlement-yemen-defeat-al-qaeda-and-contain-iran", "domain": "heritage.org", "domain_classification": "Unknown", "message": "Hadi fled to Saudi Arabia and returned to Yemen with the support of an Arab military coalition led by Saudi Arabia and the United Arab Emirates (UAE) in 2015.\nYemen, Osama bin Laden’s ancestral homeland, has long been a hotbed of Islamist extremism and support for al-Qaeda.\nAmerican special operations forces trained elite Yemeni counterterrorism forces, but that ended after the collapse of the Yemeni government.\nIran sees the Yemen conflict as a convenient means of outflanking and undermining Saudi Arabia, its principal Arab antagonist.\nA Way out of the Snake PitBoth AQAP and Iran see Yemen as the back door for subverting Saudi Arabia."}, {"id": "d37b4195-8f6e-4e4d-b4f9-17e4e8f5f764", "title": "Trump Complains That Biden Had More Secret Service Than Him", "date": "2024-08-24 00:15", "url": "https://www.mediaite.com/tv/trump-complains-there-are-too-few-secret-service-agents-at-his-rallies-while-biden-was-loaded-up-with-them/", "domain": "mediaite.com", "domain_classification": "Unknown", "message": "Former President Donald Trump complained he has too few Secret Service agents at his rallies while claiming President Joe Biden “was loaded up” with protection.\n“They never gave us the number of people in terms of Secret Service people that were necessary,” Trump told reporters.\n“And yet Biden, who would have ten people are rally was loaded up with with Secret Service.\nSo I’ve complained about that for a long time.”Moreover, at least five Secret Service members have been placed on administrative leave after the July 13 assassination attempt on Trump’s life.\nA bullet struck Trump’s right ear, while firefighter Corey Comperatore was fatally struck by the sniper."}, {"id": "ec72b61b-7ef0-444c-82a3-4531387afda3", "title": "Multiple Secret Service agents on leave after assassination attempt on Trump", "date": "2024-08-24 02:30", "url": "https://www.ksby.com/politics/trump-indictments/secret-service-places-multiple-agents-on-administrative-leave-following-assassination-attempt-on-trump", "domain": "ksby.com", "domain_classification": "Unknown", "message": "A source familiar with the situation confirmed to Scripps News that several Secret Service agents, including the special agent in charge of the Pittsburgh field office, have been placed on administrative leave in the wake of the July 13 assassination attempt against former President Donald Trump.\nRELATED STORY | Trump campaigns behind bulletproof glass in first outdoor rally since assassination attemptKimberly Cheatle told Congress one day before resigning as Secret Service director that the incident was the Secret Service's \"most significant operational failure\" in decades.\n\"The U.S. Secret Service is committed to investigating the decisions and actions of personnel related to the event in Butler, Pennsylvania and the attempted assassination of former President Donald Trump,\" said Anthony Guglielmi, U.S. Secret Service chief of communications.\nThe U.S. Secret Service holds our personnel to the highest professional standards, and any identified and substantiated violations of policy will be investigated by the Office of Professional Responsibility for potential disciplinary action.\"\nThe Department of Homeland Security said that it would conduct an independent 45-day review of the July 13 incident that left Trump wounded."}, {"id": "e53200eb-35a1-4e81-a072-89a8bef07ba3", "title": "Manhunt in Germany after deadly stabbing attack at festival", "date": "2024-08-24 00:15", "url": "https://ktvz.com/news/national-world/cnn-world/2024/08/23/manhunt-in-germany-after-deadly-stabbing-attack-at-festival/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "(CNN) — A manhunt is underway after an attacker armed with a knife killed three people and seriously wounded several others at a festival Friday in the western German city of Solingen, police told CNN.\nCrowds had gathered at the square Friday to celebrate the “Festival of Diversity,” a three-day event marking the 650th anniversary of the city’s founding.\nPolice say the attack occurred close to the stage where a musical act was performing.\nMy thoughts are with the families of those killed and those seriously injured,” she added on X.\nAccording to the festival’s website, Friday was the start of the three-day “Festival of Diversity,” which would include music, food, performances, and family-friendly entertainment."}, {"id": "57085e9c-9b99-462b-adc1-c5e2c8ab71b4", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 00:15", "url": "https://www.crookwellgazette.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14264", "domain": "crookwellgazette.com.au", "domain_classification": "Unknown", "message": "One woman and two men were killed in the stabbing attack on Friday evening that left eight others injured, five of them seriously, during 650th anniversary celebrations in the city of Solingen."}, {"id": "ce98ae8d-ab10-44e3-909b-06a61fec48f1", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 00:00", "url": "https://www.edenmagnet.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14264", "domain": "edenmagnet.com.au", "domain_classification": "Unknown", "message": "One woman and two men were killed in the stabbing attack on Friday evening that left eight others injured, five of them seriously, during 650th anniversary celebrations in the city of Solingen."}, {"id": "f07a085e-9664-404d-a2d3-83d2bcc10dad", "title": "Three dead in German stabbing , attacker on the run", "date": "2024-08-24 00:30", "url": "https://www.queanbeyanage.com.au/story/8740873/three-dead-in-german-stabbing-attacker-on-the-run/?cs=14264", "domain": "queanbeyanage.com.au", "domain_classification": "Unknown", "message": "One woman and two men were killed in the stabbing attack on Friday evening that left eight others injured, five of them seriously, during 650th anniversary celebrations in the city of Solingen."}, {"id": "aa9f4f1e-c920-4281-b75a-f172c41810f6", "title": "3 killed , several injured in knife attack in German city : Report", "date": "2024-08-24 04:45", "url": "https://www.prokerala.com/news/articles/a1558476.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Berlin, Aug 24 : At least three people have been killed and several others injured in a knife attack in Germany's Solingen city, local media reported.\nThe attack took place on Friday night as a festival was underway to mark the 650th anniversary of the city's founding, Xinhua news agency reported, citing German media.\nAt present, rescue workers are working on those injured.\nAt about 10 p.m. local time, a man with a knife attacked people attending the event.\nPolice then issued a major alert and a shooting alert."}, {"id": "b73ee043-17b1-4230-8cf6-7084f8406b90", "title": "10 Times Luck Won Battles - Listverse", "date": "2024-08-24 08:30", "url": "https://listverse.com/2024/08/24/10-times-luck-won-battles/", "domain": "listverse.com", "domain_classification": "Unknown", "message": "This list delves into ten historical battles where luck played a decisive role, tipping the scales in favor of one side and altering the course of history.\nThese instances remind us that in the chaos of war, sometimes the outcome hinges on an unpredictable stroke of luck.\nHis army, outnumbered and outmaneuvered, was trapped on Brooklyn Heights, with the East River behind them and the British forces closing in.\nFirst, American forces, advancing faster than anticipated, reached the bridge before the Germans could demolish it.\nThis extraordinary stroke of luck not only preserved Japan’s independence but also became a defining moment in Japanese history."}, {"id": "8ba90641-ffe0-4704-8724-c3d82fb84e67", "title": "Ukraine Overtakes Russia in Military Technology Stakes", "date": "2024-08-24 07:45", "url": "https://www.kyivpost.com/post/37890", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Ukraine has become a global leader in military drone and electronic warfare technologies, surpassing Russia, which has lost its edge in the 30 months since its full-scale invasion, according to Forbes.\nDuring its 2014 illegal annexation of Crimea, Russia used drones and electronic warfare effectively to disrupt Ukrainian communications and target positions.\nRecent successes in the Kursk region serve to highlight Ukraine’s military prowess.\nWhilst its electronic warfare systems were initially effective, they now face diminishing impact as Ukraine adopts newer technologies and tactics.\nOver 200 Ukrainian companies now produce military drones, and 50 focus on electronic warfare systems thanks to a shift from commercial tech to military applications."}, {"id": "3b8609ff-0819-4f7b-9a45-3aaa5c7747c1", "title": "Great Board Games To Play If you Like Risk", "date": "2024-08-24 02:30", "url": "https://www.destructoid.com/great-board-games-like-risk/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "As this is my favorite genre of board game, I gladly present to you some of the best board games to play if you like Risk.\nRecommended VideosImage: Academy Games878 Vikings is a lesser-known board game set during the Viking invasions of England.\nIf you’ve ever wanted your Risk games to have more of a narrative, then Inis is the perfect board game for you to try.\nHowever, for those who enjoy Risk and also love more complex and dramatic board games, you can’t get much better than Twilight Imperium.\nWith these excellent suggestions of Risk-adjacent board games, you can start your next game night with your new favorite."}, {"id": "f94612d8-f6ba-4bc2-a308-0a2438272f3b", "title": "Russo - Ukraine War", "date": "2024-08-24 00:15", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-kursk.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Ukrainian forces used at least three German Marder fighting vehicles in the Kursk Region, the first German armor advance onto Russian soil since the Great Patriotic War.\nThe first Battle of Kursk, fought between July 5 and August 23, 1943, was one of the largest and most significant battles of World War II.\nv There was fighting 06 August 2024 in the Sudzhansky and Korneevsky districts of Kursk Region.\nThe most important factor in the war right now is Russia's manpower and force availability advantage, in particular with infantry.\n\"Offensive operations also risk taking higher casualties than in defense at a time when Ukrainian forces are stretched thin."}, {"id": "c7b9089d-e269-4742-b561-de9407008848", "title": "Army for  Viksit Bharat  by 2047 - Daily Excelsior", "date": "2024-08-24 00:30", "url": "https://www.dailyexcelsior.com/army-for-viksit-bharat-by-2047/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "The focus of the meeting was squarely on the Government’s vision of ‘Viksit Bharat’ by 2047, which coincides with the centenary of the country’s independence.\nThis strategic alignment of the Army’s transformation is essential for the realisation of ‘Viksit Bharat’.\nBy encouraging the development of indigenous equipment, platforms, and weapons, the Army also supports the growth of Indian defence industries.\nChange is never easy, especially in a large and tradition-bound organisation like the Indian Army.\nA modern, agile, and technology-enabled Indian Army will not only enhance national security but also contribute to India’s standing as a global power."}, {"id": "3f8cbd4a-b234-48a9-8196-d2c31084c933", "title": "Kyiv incursion into Russia sends a defiant message to its Western backers : We can win this war", "date": "2024-08-24 06:30", "url": "https://edition.cnn.com/2024/08/24/europe/ukraine-kursk-west-russia-weapons-analysis-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "Just as importantly, it’s also sent a political message to Kyiv’s allies that has changed the prevailing narrative of the war - that Ukrainian forces are doomed to fight an endless rearguard action against superior Russian firepower.\nA Ukrainian soldier walks past at a city hall in Sudzha, Kursk region, Russia, Friday, Aug. 16, 2024.\nBut Ukrainian forces have shown that the conflict is not a one-way street.\nFor the Ukrainians, sustaining the operation as Russia brings more artillery and aviation to bear will become increasingly difficult.\nBut for every passing day that Ukrainian forces control an area of Russian territory the size of Hong Kong, the Kursk incursion becomes less of a footnote."}, {"id": "1fb42605-f535-403d-b1a4-62c5910ce9d8", "title": "Kyiv incursion into Russia sends a defiant message to its Western backers : We can win this war", "date": "2024-08-24 07:45", "url": "https://us.cnn.com/2024/08/24/europe/ukraine-kursk-west-russia-weapons-analysis-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "Just as importantly, it’s also sent a political message to Kyiv’s allies that has changed the prevailing narrative of the war - that Ukrainian forces are doomed to fight an endless rearguard action against superior Russian firepower.\nA Ukrainian soldier walks past at a city hall in Sudzha, Kursk region, Russia, Friday, Aug. 16, 2024.\nBut Ukrainian forces have shown that the conflict is not a one-way street.\nFor the Ukrainians, sustaining the operation as Russia brings more artillery and aviation to bear will become increasingly difficult.\nBut for every passing day that Ukrainian forces control an area of Russian territory the size of Hong Kong, the Kursk incursion becomes less of a footnote."}, {"id": "5567514c-3a5c-4fa5-972f-4a88882bd36e", "title": "Hezbollah : What weapons does it have ? A visual guide", "date": "2024-08-24 07:45", "url": "https://us.cnn.com/2024/08/24/middleeast/hezbollah-weapons-visuals-intl-dg/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "Though no match for Israel’s military might, Hezbollah’s increasingly sophisticated arsenal has the potential to inflict significant damage on Israel and its allies in the region.\nAs it fought in the trenches of that nearly decade-long war, Hezbollah became seasoned in urban warfare and solidified its alliances with other Iran-backed groups fighting in Syria.\nThroughout its decades-long conflict with Israel, Hezbollah has been engaged in asymmetric warfare.\nIt has sought to grow its political and military might, while seeking to establish deterrence despite Israel’s military superiority.\nBecause of Hezbollah’s growing power, a possible all-out war between Israel and Lebanon would thrust the Middle East into uncharted waters."}, {"id": "c5cd8e22-5aca-4498-bd13-30eeccab08a8", "title": "Hezbollah : What weapons does it have ? A visual guide", "date": "2024-08-24 09:00", "url": "https://krdo.com/news/2024/08/23/hezbollah-what-weapons-does-it-have-a-visual-guide/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "By Lou Robinson and CNN staff(CNN) — Hezbollah is believed to be the most heavily armed non-state group in the world.\nThough no match for Israel’s military might, Hezbollah’s increasingly sophisticated arsenal has the potential to inflict significant damage on Israel and its allies in the region.\nAs it fought in the trenches of that nearly decade-long war, Hezbollah became seasoned in urban warfare and solidified its alliances with other Iran-backed groups fighting in Syria.\nThroughout its decades-long conflict with Israel, Hezbollah has been engaged in asymmetric warfare.\nIt has sought to grow its political and military might, while seeking to establish deterrence despite Israel’s military superiority."}, {"id": "05657403-977c-428f-910e-dff2d6fce93d", "title": "US approves sale of Anti - Submarine Warfare Sonobuoys to India", "date": "2024-08-24 03:15", "url": "https://economictimes.indiatimes.com/news/defence/us-approves-sale-of-anti-submarine-warfare-sonobuoys-to-india/articleshow/112753344.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelWashington DC: The United States Secretary of State, Antony Blinken , has approved a possible foreign military sale of anti-submarine warfare Sonobuoys and related equipment to India at an estimated cost of USD 52.8 million.The Defence Security Cooperation Agency delivered the required certification, notifying Congress of this possible sale today, the US Defence Security Cooperation Agency said in a release.Notably, the Defence Security Cooperation Agency is an agency within the United States Department of Defence.\n\"The Government of India has requested to buy AN/SSQ-53G High Altitude Anti-Submarine Warfare (HAASW) sonobuoys; AN/SSQ-62F HAASW sonobuoys; AN/SSQ-36 sonobuoys; technical and publications and data documentation; US Government and contractor engineering and technical support; and other related elements of logistics and program services and support.\nThe estimated total cost is USD 52.8 million,\" the agency stated.This proposed sale will support US' foreign policy and national security objectives by helping to strengthen the United States-India strategic relationship and improving the security of a major defence partner that continues to be an important force for political stability, peace, and economic progress in the Indo-Pacific and South Asia regions.The proposed sale will also improve India's capability to meet current and future threats by enhancing its capacity to conduct anti-submarine warfare operations from its MH-60R helicopters.\nIndia will have no difficulty absorbing this equipment into its armed forces.The agency further added that the proposed sale of this equipment and support will not alter the basic military balance in the region.The principal contractor(s) will be Sparton Corporation, located in De Leon Springs, FL, or Undersea Sensor Systems Inc. (USSI), located in Columbia City, IN, or a combination of both.\nThere are no known offset agreements proposed in connection with this potential sale, it added."}, {"id": "1d5cfee7-cdb2-4706-901b-80b9ff3b1db3", "title": "The US is sending $125 million in new military aid to Ukraine , officials say", "date": "2024-08-24 06:30", "url": "https://www.deccanchronicle.com/world/the-us-is-sending-125-million-in-new-military-aid-to-ukraine-officials-say-1818433", "domain": "deccanchronicle.com", "domain_classification": "Unknown", "message": "Washington:The Biden administration will send about $125 million in new military aid to Ukraine, U.S. officials said Thursday, even as Washington works to get a better understanding of Kyiv's incursion into Russia and how it advances the broader battlefield goals more than two years into the war .\nThe officials spoke on condition of anonymity because the aid has not been publicly announced.\nThe aid comes as Ukrainian forces continue to broaden their surprise offensive into Russia , where officials say they have taken about 100 square kilometers (62 square miles) of territory around Kursk.\nHe said Kyiv’s military had taken control of another Russian village and captured more prisoners of war.\nThe latest package of aid brings the total amount of U.S. security assistance to Ukraine to more than $55.7 billion since Russia's invasion in February 2022."}, {"id": "8cf984ed-d8d4-4ee6-96be-2cab3d76e94f", "title": "US Approves $52 . 8 Million Anti - Submarine Warfare Sonobuoys Sale To India", "date": "2024-08-24 05:00", "url": "https://www.news18.com/world/us-approves-52-8-million-anti-submarine-warfare-equipment-sale-to-india-9025949.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "The United States has approved a potential $52.8 million Foreign Military Sale (FMS) to India, including Anti-Submarine Warfare (ASW) sonobuoys and related equipment, which will help bolster its deterrence capabilities.\nThe sale includes AN/SSQ-53G High Altitude Anti-Submarine Warfare (HAASW) sonobuoys, AN/SSQ-62F HAASW sonobuoys, AN/SSQ-36 sonobuoys, as well as technical publications, and other logistics.\nDeterrence CapabilitiesThis proposed sale aims to bolster US-India strategic relations and enhance India’s anti-submarine warfare and deterrence capabilities, particularly for its MH-60R helicopters.\n“The proposed sale will improve India’s capability to meet current and future threats by enhancing its capacity to conduct anti-submarine warfare operations from its MH-60R helicopters.\nThe proposed sale of this equipment and support will not alter the basic military balance in the region,” it added."}, {"id": "2f106283-fcae-47a6-ab8a-d35d3838ea48", "title": "Revenge of the Kennedys : RFK Jr . Takes a Flame Thrower to the Entire System", "date": "2024-08-24 03:00", "url": "https://pjmedia.com/kevindowneyjr/2024/08/23/revenge-of-the-kennedys-rfk-jr-takes-a-blowtorch-to-the-entire-system-n4931932", "domain": "pjmedia.com", "domain_classification": "Unknown", "message": "\"It had become the party of war, censorship, corruption, big pharma, big tech, big AG, and big money.\nHe spoke of \"DNC-aligned judges\" whose job was to throw Kennedy and \"other candidates off the ballot and to throw President Trump in jail.\"\nAnd President Trump says that he will reopen negotiations with President Putin and end the war overnight as soon as he becomes president.\"\nRobert F. Kennedy Jr.\nAddress to the Nation https://t.co/Wf4xt12GSX — Robert F. Kennedy Jr (@RobertKennedyJr) August 23, 2024FACT-O-RAMA!"}, {"id": "0b5fdbde-4bc7-472e-9c39-c12c66f9517a", "title": "Winning : Long Term Ukrainian Prospects", "date": "2024-08-24 08:30", "url": "http://www.strategypage.com/%5Chtmw%5Chtwin%5Carticles%5C202408230529.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "August 23, 2024: The NATO alliance supporting Ukraine in its battle against Russian invaders believes that Ukrainian victory is inevitable.\nWhile Russia has nuclear weapons, so do several NATO members as in the Americans, Britain and France.\nWhile doing this Ukraine will continue to replace Soviet era Russian weapons and equipment and replace it with European or American items that NATO members use.\nRussian leader Vladimir Putin started the war and, so far, he refuses to acknowledge the possibility of defeat.\nNow that defeat is a reality, Putin is trying to improvise some reasonably convincing story about how Russia actually won."}, {"id": "2ec4d7db-c800-447c-9c98-258ec6e358c7", "title": "2 Okinawan caves offer glimpse into deadly WWII battle", "date": "2024-08-24 08:30", "url": "https://okinawa.stripes.com/travel/2-okinawan-caves-offer-glimpse-into-deadly-wwii-battle.html", "domain": "okinawa.stripes.com", "domain_classification": "Unknown", "message": "()A short drive from Murasaki Mura are two caves with historical significance: Chibichiri Gama and Shimuku Gama.\nThese caves were used during World War II and now provide a glimpse into what happened in the early days of the Battle of Okinawa.\nAccording to an article by Okinawa Times, about 1,000 villagers took shelter in the cave like those in Chibichiri Gama.\nThings to know- Chibichiri Gama GPS Coordinates: N 26.405367, E 127.724061 - Shimuku Gama GPS Coordinates: N 26.402432, E 127.731280* Chibibichiri Gama has a parking space nearby.\nInside Shimuku Gama, it is advised to wear sports shoes and carry a flash light and gloves."}, {"id": "8bb35de2-41f6-4644-a8dd-ce25c47cec4e", "title": "New wave of cholera in Sudan threatens hundreds of thousands of refugees", "date": "2024-08-24 08:15", "url": "https://www.africanews.com/2024/08/24/new-wave-of-cholera-in-sudan-threatens-hundreds-of-thousands-of-refugees/", "domain": "africanews.com", "domain_classification": "Unknown", "message": "Sudan has been hit by a deadly cholera outbreak that has infected hundreds of people in recent weeks, health authorities said.\nThe UN Refugee Agency (UNHCR) reported that the spread of the disease is of particular concern in states hosting refugees - mainly Kassala, Gedaref, and Jazirah states.\nCholera is a fast-developing, highly contagious infection that causes diarrhea, leading to severe dehydration and possible death within hours when not treated, according to the WHO.\nThe cholera outbreak is the latest calamity for Sudan, which was plunged into chaos in April last year when simmering tensions between the military and a powerful paramilitary group exploded into open warfare across the country.\nMore than 10.7 million people have been forced to flee their homes since fighting began, according to the International Organization for Migration."}, {"id": "2b902628-05f7-4e29-ac5a-9087241c33b7", "title": "Sabotage Confirmed At Norwegian Air Base", "date": "2024-08-24 00:30", "url": "https://www.yahoo.com/news/sabotage-confirmed-norwegian-air-232318518.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Norway has revealed that one of its most strategic air bases has been the target of sabotage.\nSuspected sabotage against Air Force Base in Northern Norway.\nIt is one of two Royal Norwegian Air Force (RNoAF) bases hosting permanent F-35A stealth fighter units and it is also receiving the service’s fleet of P-8A maritime patrol aircraft.\nF-35As from 332 Squadron of the Royal Norwegian Air Force (RNoAF).\nOperations continue as planned.”Roughly, 24 hours later, in another post on X, NATO said: “The security level at NATO air base Geilenkirchen has returned to Bravo."}, {"id": "30eb3c2b-5beb-464c-8f4c-4ae9efae394e", "title": "New book tells story of K - 9 World War II hero from Wisconsin", "date": "2024-08-24 03:30", "url": "https://www.tmj4.com/news/state-capitol/new-book-tells-story-of-k-9-world-war-ii-hero-from-wisconsin", "domain": "tmj4.com", "domain_classification": "Unknown", "message": "MADISON, Wis. — Families and their dogs took to downtown Madison on Thursday to celebrate the story of a K-9 World War II hero from Wisconsin.\n‘Brownie the War Dog,’ a new book from the Wisconsin Historical Society Press, tells the tale of Oren Kendley and his dog Brownie.\nHarm Venhuizen Attendees listen to author Kelly Nelson reading her new book, 'Brownie the War Dog.'\nHer subsequent research led her to the Wisconsin Veterans Museum and Joan Yohr, Kendley’s niece, who had kept close records of the family’s history.\nHarm Venhuizen Author Kelly Nelson signs a copy of 'Brownie the War Dog.'"}, {"id": "c075e708-bbfe-44bd-9efe-0a711b3f0495", "title": "Kyiv incursion into Russia sends a defiant message to its Western backers : We can win this war", "date": "2024-08-24 06:15", "url": "https://www.yahoo.com/news/kyiv-incursion-russia-sends-defiant-040002651.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Just as importantly, it’s also sent a political message to Kyiv’s allies that has changed the prevailing narrative of the war - that Ukrainian forces are doomed to fight an endless rearguard action against superior Russian firepower.\nA Ukrainian soldier walks past at a city hall in Sudzha, Kursk region, Russia, Friday, Aug. 16, 2024.\nBut Ukrainian forces have shown that the conflict is not a one-way street.\nFor the Ukrainians, sustaining the operation as Russia brings more artillery and aviation to bear will become increasingly difficult.\nBut for every passing day that Ukrainian forces control an area of Russian territory the size of Hong Kong, the Kursk incursion becomes less of a footnote."}, {"id": "9ab513ce-98a4-412b-9ff0-70d604fc7b74", "title": "A traveller guide to 24 hours in Nagaland capital , Kohima", "date": "2024-08-24 06:15", "url": "https://yourstory.com:443/ys-life/a-travellers-guide-to-24-hours-in-nagalands-capita", "domain": "yourstory.com", "domain_classification": "Unknown", "message": "The real gem was Kohima, much known for its annual Hornbill festival that showcases the rich culture of diverse ethnicities in the state.\nThe two-hour road trip is a precursor to the beauty you are set to experience in Kohima.\nWhile 24 hours may seem a tad less to explore the city, there’s still a lot you can pack in without trying hard.\nFrom a visit to the War Memorial to the Cathedral of Kohima, and the Kisama Heritage Village—there’s much to see.\nKohima war cemeteryThe Kohima war cemetery has nearly lined gravestones and memorials, serving as a reminder of the valour of soldiers who lost their lives in the Battle of KohimaLocated on Garrison Hill, the Kohima war cemetery is believed to have been built in the tennis court of the then-deputy commissioner’s residence."}, {"id": "54f6f2e7-c1ed-4e4b-a0b9-1762774e4015", "title": "Ammunition storage point on fire and exploding in Russia Voronezh Oblast", "date": "2024-08-24 06:15", "url": "https://www.yahoo.com/news/ammunition-storage-point-fire-exploding-013640983.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ammunition depot on fire and exploding in Russia's Voronezh OblastAlexander Gusev, Governor of Russia's Voronezh Oblast, has claimed that the region has been attacked by drones, resulting in the detonation of explosive objects.\nSource: Gusev on Telegram; АstraQuote from Gusev: \"Air defence and electronic warfare systems destroyed and jammed several UAVs in Voronezh Oblast.\nAs a result of falling wreckage, a fire started, which caused the detonation of explosive objects.\nDetails: Earlier, Gusev had reported about a supposedly downed UAV, a fire and one injured person.\nUpdated: The Astra Telegram channel reported that an ammunition depot in the town of Ostrogozhsk in Voronezh Oblast was on fire and explosions had been heard."}, {"id": "2cc77446-f3b9-48c0-b3ec-0f7c5b1428d7", "title": "US says it killed senior militant group leader in Syria", "date": "2024-08-24 02:00", "url": "https://www.businesstimes.com.sg/international/us-says-it-killed-senior-militant-group-leader-syria", "domain": "businesstimes.com.sg", "domain_classification": "Unknown", "message": "AMERICAN forces killed a senior leader of an Al-Qaeda-affiliated militant group in a strike in Syria on Friday (Aug 23), the US military said.\nThe strike targeted Abu Abdul Rahman al-Makki, who was “a Hurras al-Din Shura Council member and senior leader responsible for overseeing terrorist operations from Syria,” the US Central Command (Centcom) said in a social media post.\n“Hurras al-Din is an Al-Qaeda-associated force based in Syria that shares Al-Qaeda’s global aspirations to conduct attacks against US and Western interests,” Centcom said.\nThe US military has around 900 troops in Syria as part of the international coalition against the Islamic State group.\nThe coalition was established in 2014 to help combat the jihadists, who had taken over vast swathes of Iraq and Syria."}, {"id": "5e2f1244-0d1a-49f1-8f7f-de76b352cac5", "title": "The US is sending $125 million in new military aid to Ukraine | News , Sports , Jobs", "date": "2024-08-24 08:15", "url": "https://www.marshallindependent.com/news/national-news-apwire/2024/08/the-us-is-sending-125-million-in-new-military-aid-to-ukraine/", "domain": "marshallindependent.com", "domain_classification": "Unknown", "message": "WASHINGTON (AP) — The Biden administration is sending about $125 million in new military aid to Ukraine, the Defense Department said Friday, even as Washington works to get a better understanding of Kyiv’s incursion into Russia and how it advances the broader battlefield goals more than two years into the war.\nThe latest package of aid includes air defense missiles, munitions for High Mobility Artillery Rocket Systems (HIMARS), Javelins and an array of other anti-armor missiles, counter-drone and counter-electronic warfare systems and equipment, 155mm and 105mm artillery ammunition, vehicles and other equipment.\nThe formal announcement came on Friday, which is the eve of Ukraine’s Independence Day."}, {"id": "82a13cf9-23fc-4ee9-accf-c2eedc3495c5", "title": "MARKET REPORT : Melrose shares tumble after double downgrade", "date": "2024-08-24 01:45", "url": "https://www.dailymail.co.uk/money/markets/article-13773949/MARKET-REPORT-Melrose-shares-tumble-double-downgrade.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Nearly £500million was wiped off the value of Melrose following a double downgrade.\nMelrose shares fell 7.1 per cent, or 36.3p, to 474.7p, reducing its value by £471million.\nWhile most analysts reckon the stock is worth buying, UBS broke ranks by advising clients to sell shares in the owner of the GKN aerospace business.\nDowngrade: Melrose fell 7.1 per cent, or 36.3p, to 474.7p, reducing its value by £471mThe bank said one of the FTSE 100 group's biggest sources of revenue is overvalued.\nMelrose bought GKN, which made cannonballs used at the Battle of Waterloo and Spitfires for the Battle of Britain, for £8billion in a controversial deal in 2018."}, {"id": "b2db3774-b5af-4ddc-a647-32cba817b904", "title": "Russia second front : How Europe can prepare against hybrid warfare", "date": "2024-08-24 06:15", "url": "https://www.euronews.com/2024/08/24/russias-second-front-how-europe-can-prepare-against-hybrid-warfare", "domain": "euronews.com", "domain_classification": "Unknown", "message": "Experts warn that politicians need to take Russia's so-called \"hybrid war'' more seriously and populations should be better prepared.\nDifficult to define, features of what experts have called Russia's \"hybrid war\" include everything that does not involve direct military confrontation.\nOne example of Russia's hybrid warfare is the uncovered plot to assassinate the CEO of Rheinmetall, a German automotive and arms manufacturer based in Dusseldorf earlier this month.\nRussia's war against Ukraine makes headlines every day: Soldier on the front line in the Zaporizhzhia region, Ukraine, August 2024.\nThe threat of online fake newsExperts say Russia's hybrid war is made up of several strategies: hacking, attacks on individuals or disinformation and fake news."}, {"id": "23874948-1d14-46b0-9b28-5567ac5fd444", "title": "US Military Says It Killed Leader Of Al Qaeda - Aligned Group In Syria", "date": "2024-08-24 02:15", "url": "https://www.ndtv.com/world-news/us-military-says-it-killed-leader-of-al-qaeda-aligned-group-in-syria-6405103", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "The U.S. military said it carried out a strike in Syria on Friday.\nAmerican forces killed a senior leader of an Al-Qaeda-affiliated militant group in a strike in Syria on Friday, the US military said.\nThe strike targeted Abu Abdul Rahman al-Makki, who was \"a Hurras al-Din Shura Council member and senior leader responsible for overseeing terrorist operations from Syria,\" the US Central Command (CENTCOM) said in a social media post.\nThe US military has around 900 troops in Syria as part of the international coalition against the Islamic State group.\nThe coalition was established in 2014 to help combat the jihadists, who had taken over vast swathes of Iraq and Syria."}, {"id": "31becbb1-16c9-496b-a661-5843e9b6073f", "title": "US govt approves sale of anti - submarine warfare sonobuoys to India for  hunter - killer  helicopters | India News", "date": "2024-08-24 06:00", "url": "https://timesofindia.indiatimes.com/india/us-govt-approves-sale-of-anti-submarine-warfare-sonobuoys-to-india-for-hunter-killer-helicopters/articleshow/112756004.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "NEW DELHI: The US government has approved a proposed sale to India of anti-submarine warfare (ASW) sonobuoys and related equipment worth around $52.8 million (Rs 443 crore) for the multi-mission MH-60R Seahawk helicopters being inducted by the Indian Navy .The Biden administration’s notification to the US Congress on Friday said the proposed sale will support Washington’s foreign policy and national security objectives by helping to strengthen the bilateral strategic relationship and improving the security of a major defence partner, India, which “continues to be an important force for political stability, peace, and economic progress in the Indo-Pacific and South Asia regions”.The proposed sale will improve India’s capability “to meet current and future threats” by enhancing its capacity to conduct ASW operations from its MH-60R helicopters, the notification said.The Navy in March this year had commissioned its first squadron of six submarine-hunting MH-60R Seahawk helicopters, armed with Hellfire missiles, MK-54 torpedoes and precision-kill rockets, at INS Garuda in Kochi, as was then reported by TOI.By next year, India is slated to induct 24 heavy-duty Seahawks, which are also equipped with multi-mode radars and night-vision devices, under the Rs 15,157 crore ($2.13 billion) contract inked with the US in February 2020.The notification said the Indian government has requested to buy AN/SSQ-53G high-altitude ASW sonobuoys, AN/SSQ-62F HAASW sonobuoys and AN/SSQ-36 sonobuoys as well as engineering, technical and logistics support.\n“The proposed sale of this equipment and support will not alter the basic military balance in the region,” it said.Navy officers say the induction of Seahawks, which operate from decks of aircraft carriers and other frontline warships, represents a “significant capability jump” in detecting and destroying enemy submarines prowling in the Indian Ocean Region (IOR).The choppers can also be used for anti-ship strikes, over the horizon network-centric operations and electronic warfare missions, search and rescue, medical evacuation and vertical replenishment.“The advanced weapons, sensors and avionics suite make the Seahawks ideal for our maritime security needs, offering enhanced capabilities for both conventional as well as asymmetric threats.\nThey will enhance India’s blue-water capabilities, extend the operational reach and support sustained naval operations across spectrums,” an officer said.The new helicopters are crucial because the 140-warship Navy is currently grappling with just a handful of old ASW helicopters like Kamov-28s and Sea Kings, at a time when the presence of Chinese nuclear and diesel-electric submarines is only going to further increase in the IOR in the coming years.ASW choppers typically fly ahead of warships to “dunk” their sonobuoys into deep waters, “ping” for enemy submarines, and then fire missiles, torpedoes and depth charges to clear the path for the fleet during hostilities.After the first 24 MH-60Rs, the Navy has projected a long-term requirement for another 123 naval multi-role helicopters (NMRHs).\nThe MH-60Rs are a replacement for the older Sea King 42/42A helicopters that were retired in the 1990s.\nThe case for the 24 choppers, incidentally, began way back in 2005."}, {"id": "44ef3047-18a4-4815-934c-72ec37bbf17e", "title": "EU review does not recommend sending military trainers to Ukraine for now , media report says", "date": "2024-08-24 08:30", "url": "https://economictimes.indiatimes.com/news/defence/eu-review-does-not-recommend-sending-military-trainers-to-ukraine-for-now-media-report-says/articleshow/112758860.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelThe EU's diplomatic service has called on member states to better adapt a military training mission for Ukraine to Kyiv 's needs but stopped short of recommending the bloc send military instructors to the war-torn country, German weekly Welt am Sonntag reported on Saturday.The EUMAM mission , launched in November 2022, has trained some 60,000 Ukrainian troops mainly in Poland and Germany and is set to be extended by another two years once the current mandate runs out in mid-November.\n\"It is highly likely that an EU military presence on Ukrainian soil would be perceived by Russia as a provocation,\" the review said.\n\"The fact that Russia can reach every location in Ukraine with their ballistic and UAV (drone) assets contributes to the highest level of threat for deployed EU military personnel.\n\"The review raised the need to be able to evacuate EU troops in an emergency and the logistical effort involved in offering instructors fortified housing and training sites, while saying that some protective measures, such as against long-range air threats, were not achievable.\n\"Should the necessary political and operational conditions be met, the deployment of EU military personnel on Ukrainian soil is feasible,\" the document concluded, adding further analysis would be needed to fully assess the risks and advantages.However, the review did recommend that the EU establish a coordination cell in Kyiv and explore possibilities to conduct training closer to Ukraine's borders while also training more Ukrainian instructors."}, {"id": "d7c9e92b-02e9-4bb0-bd72-13565d21ae97", "title": "  These guys changed the course of history  ", "date": "2024-08-24 05:00", "url": "https://www.news5cleveland.com/news/local-news/these-guys-changed-the-course-of-history-local-tuskegee-airman-receives-statue", "domain": "news5cleveland.com", "domain_classification": "Unknown", "message": "PORT CLINTON, Ohio — It's been nearly 80 years since the first Black military airmen, also known as the Tuskegee Airmen, fought in World War II.\nAnd to keep their legacy alive, the Liberty Aviation Museum in Port Clinton honored local Tuskegee Airman Dr. Harold Brown with a statue.\nDuring World War II, Brown flew 30 missions with the Tuskegee Airmen and served in the Korean War.\nEducation brought him the Port Clinton area, and he kind of adopted this museum as well.\nBrown settled in Port Clinton with Bordner, and they published a book called \"Keep Your Airspeed Up: The Story of a Tuskegee Airman\" in 2017."}, {"id": "63bf65ab-d7c3-411e-9531-707a9f770899", "title": "Gov . Evers Orders Flags to Half - Staff in Honor of Sergeant Jack Hohlfeld Who Lost His Life in World War II", "date": "2024-08-24 00:00", "url": "https://urbanmilwaukee.com/pressrelease/gov-evers-orders-flags-to-half-staff-in-honor-of-sergeant-jack-hohlfeld-who-lost-his-life-in-world-war-ii/", "domain": "urbanmilwaukee.com", "domain_classification": "Unknown", "message": "“Sergeant Jack Hohlfeld was a decorated military hero who selflessly answered the call to serve and gave his life defending the values and freedoms we as a nation hold most dear,” said Gov.\nOn Dec. 8, 1941, Sergeant Hohlfeld and members of the 24th Pursuit Group were engaged in combat and were soon overtaken by Japanese forces and forced to surrender as prisoners of war.\nSergeant Hohlfeld will be buried on Mon., Aug. 26, 2024, in La Crosse.\nNOTE: This press release was submitted to Urban Milwaukee and was not written by an Urban Milwaukee writer.\nWhile it is believed to be reliable, Urban Milwaukee does not guarantee its accuracy or completeness."}, {"id": "65b1d845-3ceb-4e55-b147-7aba93328713", "title": "COD : Modern Warfare 3 Details Leaked !! ", "date": "2024-08-24 03:00", "url": "https://www.thfire.com/entertainment/cod-modern-warfare-3-details-leaked-11793", "domain": "thfire.com", "domain_classification": "Unknown", "message": "Call of Duty: Modern Warfare 3 the most awaited game of the year and is set to be released on Nov 8th 2011 now has some details leaked.\nThese leaked details offers you some sneak-peak of the way the game is going to work and some interesting pictures!\nHere’s what we know: Modern Warfare 3 will span the globe, much like the previous game.\nModern Warfare 3 will also reportedly tie up a number of loose ends from the previous two games that left players hanging, and pick up almost immediately after the cliffhanger ending of Modern Warfare 2.\nMultiplayer also makes a strong comeback in Modern Warfare 3, and even includes new game types and tons of new maps in addition to some of the older, more familiar multiplayer modes."}, {"id": "1c24d3b0-dc3a-43bb-b5aa-6a7b6b2b3ab8", "title": "Bakeru review : Mystical raccoon dog , starring Not - Goemon", "date": "2024-08-24 04:45", "url": "https://www.shacknews.com/article/141089/bakeru-review-score", "domain": "shacknews.com", "domain_classification": "Unknown", "message": "When I was a kid, one of my favorite Nintendo 64 games was Mystical Ninja Starring Goemon.\nWhile Good-Feel made a name for itself developing kid-friendly games for Nintendo (Kirby’s Epic Yarn and Princess Peach: Showtime!\nThe twist here is Bakeru is actually a feisty little tanuki, a mythological creature that’s a cross between a raccoon and a dog.\nI don’t love Bakeru like I love Mystical Ninja Starring Goemon, and that’s okay.\nThat’s what it feels like Bakeru is aiming for, and I think it hits that target cleanly."}, {"id": "c87897b5-7348-4f6a-bb74-f66b71566a0c", "title": "The Bachelor : How a double amputee became Ukraine most desirable man", "date": "2024-08-24 02:15", "url": "https://www.bbc.co.uk/news/articles/clywj08d89no", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "Oleksandr is always on the go, telling me he spent the previous night filming a music video.\nIn the years before Russia's full-scale invasion, he was working as a barista in a Kyiv restaurant while studying graphic design.\nThe city was liberated by Kyiv just a month after Oleksandr was seriously injured while defending the nearby Ukrainian position.\nI felt a terrible pain in my legs and realised that it would mean the amputation of my legs,\" he said.\nAt the time, authorities said they had found more than 400 bodies in graves near the city."}, {"id": "2f0b36c1-8e63-4c1f-89a1-09bfa48a3ce7", "title": "Robert F . Kennedy Jr . Suspends Campaign , Urges Voters to Elect Donald Trump", "date": "2024-08-24 06:00", "url": "https://www.ncregister.com/cna/cna-20240823-rfk-jr-suspends-campaign", "domain": "ncregister.com", "domain_classification": "Unknown", "message": "“If I’m given the chance to fix the chronic disease crisis and reform our food production, I promise that within two years, we will watch chronic disease lift dramatically.”“We will make Americans healthy again,” he added.\n“Ultimately, the future, however it happens, is in God's hands and in the hands of the American voters, and those of President Trump.\nIf President Trump is elected and honors his word, the vast burden of chronic disease that now demoralizes and bankrupts the country will disappear,” Kennedy said.\nHe said he tried to meet with the Democratic presidential nominee, Vice President Kamala Harris, but she refused.\nHe is the son of former Democratic Sen. Robert F. Kennedy and the nephew of former Democratic President John F. Kennedy."}, {"id": "0bcef87a-853e-4d86-83fa-33313bba8dff", "title": "McClain Cellars Unveils the Black Heroes Collection : A Tribute to American Icons", "date": "2024-08-24 03:00", "url": "https://www.pr.com/press-release/918752", "domain": "pr.com", "domain_classification": "Unknown", "message": "Irvine, CA, August 23, 2024 --( PR.com )-- McClain Cellars, Southern California’s only Black-owned winery, is proud to announce the launch of the Black Heroes Collection, a series of five extraordinary wines dedicated to celebrating the legacies of some of America’s most revered Black heroes.\n\"At McClain Cellars, we believe in the power of storytelling through wine,\" said Jason McClain, founder and proprietor.\n\"As one of very few black owned wineries in the US., the Black Heroes Collection is our way of paying tribute to the incredible men and women who have paved the way for future generations.\n\"The Black Heroes Collection is available now for purchase online and in McClain Cellars' tasting rooms located in Irvine, Solvang, and two locations in Laguna Beach, California.\nFor more information about the Black Heroes Collection or to schedule a tasting, please visit www.mcclaincellars.com or call 949-484-4459."}, {"id": "9affc162-5bd5-4fa4-9b15-2e7bfc5f89b4", "title": "Bangkok Post - Kyiv looks to foster bilateral cooperation in Asia", "date": "2024-08-24 00:15", "url": "https://www.bangkokpost.com/opinion/opinion/2852862/kyiv-looks-to-foster-bilateral-cooperation-in-asia", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "Kyiv looks to foster bilateral cooperation in AsiaToday, Ukraine celebrates the 33rd Anniversary of Independence -- a fight for which is still ongoing, as the people of Ukraine are determined to win this battle.\nDespite the ongoing aggression, Ukraine looks forward to continuing the strengthened cooperation with all peaceful countries in the world, including the Kingdom of Thailand.\nRemarkably, the Kingdom of Thailand was the first country in the region of Southeast Asia to recognise Ukraine as an independent state in December 1991.\nMany Thai high-level officials, including members of the parliament, visited Kyiv and held talks with their Ukrainian counterparts.\nUkraine and Thailand possess significant potential in promoting bilateral science and technological cooperation."}, {"id": "2d87f09c-a4a7-402e-be9a-14f8bae258dd", "title": "HOOK , Willow Nightingale , More Set For 8 / 24 AEW Collision", "date": "2024-08-24 06:00", "url": "https://www.wrestlezone.com/news/1498905-hook-willow-nightingale-more-set-for-8-24-aew-collision", "domain": "wrestlezone.com", "domain_classification": "Unknown", "message": "Willow Nightingale, Orange Cassidy, HOOK, and other stars will compete on the August 24th episode of AEW Collision.\nAEW confirmed that HOOK will face Big Bill, and Willow Nightingale will face Harley Cameron.\nAEW also announced that Jeff Jarrett will battle Ariya Daivari, and Jay Lethal will take on Katsuyori Shibata.\nAs previously announced, Lio Rush and Top Flight will face PAC and Blackpool Combat Club in a Wild Card in Cardiff Trios Match.\npic.twitter.com/z8kjvcf1iM — All Elite Wrestling (@AEW) August 24, 2024WrestleZone will have coverage of AEW Collision as it airs on Saturday."}, {"id": "5e109d51-5c80-479c-8c48-19cc230d1f9a", "title": "Pro - Hamas mobs outside the DNC in Chicago must not be legitimized", "date": "2024-08-24 07:15", "url": "https://www.jpost.com/opinion/article-815969", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "US President Joe Biden attends the Democratic National Convention (DNC) in Chicago, Illinois, US August 19, 2024.\nInstead, you insinuated a horrifying moral equivalency between the Palestinian butchers of Gaza and the defenders of Israel.\nI am sure that President Biden didn’t intend to do so.\nThe Democratic Party candidate for president has Palestinian sanitary hygiene and food security, “pads” and “shit” (how vulgar!\nMaybe this is because Harris is just a potential “president of joy,” as former president Bill Clinton hailed her this week."}, {"id": "09101006-5936-419f-8c6b-5ff891005c86", "title": "Kamala Harris Gaza stance : VP says bloodshed is devastating , hostage and cease - fire deals needed as Hamas - Israel war continues", "date": "2024-08-24 00:30", "url": "https://abc7news.com/post/kamala-harris-gaza-stance-vp-says-bloodshed-is-devastating-hostage-cease-fire-deals-needed-hamas-israel-war-continues/15222721/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "Harris says bloodshed in Gaza is devastating, emphasizes support for hostage and cease-fire dealsKamala Harris' DNC speech included comments about the devastating death toll in Gaza and her support for hostage and cease-fire deals.\nKamala Harris' DNC speech included comments about the devastating death toll in Gaza and her support for hostage and cease-fire deals.\nKamala Harris' DNC speech included comments about the devastating death toll in Gaza and her support for hostage and cease-fire deals.\nKamala Harris' DNC speech included comments about the devastating death toll in Gaza and her support for hostage and cease-fire deals.\nThe uncommitted delegates entered the venue for Harris' speech Thursday, effectively ending the sit-in, and her speech appeared to go off without interruption from pro-Palestinian protesters."}, {"id": "15e2a22b-a9d8-4815-8974-78b48a440478", "title": "One year after Prigozhin death , the Kremlin is humiliated once more – POLITICO", "date": "2024-08-24 09:00", "url": "https://www.politico.eu/article/yevgeny-prigozhin-death-anniversary-vladimir-putin-war-in-ukraine-kremlin-kursk-russia/", "domain": "politico.eu", "domain_classification": "Unknown", "message": "A year on, Russians are again confronted with what, before the full-scale invasion of Ukraine, would have been unthinkable.\nIn Kursk, foreign troops have entered Russia for the first time since World War II in a surprise Ukrainian offensive, causing some 133,000 people to flee.\n“There’s a general sense of confusion,” Vladimir, a Kursk resident who asked to remain anonymous for safety reasons, told POLITICO.\nIn both cases, reality exposed the narrative coming out of Moscow that it is in complete control as a lie.\nWe might never know to what extent Russians would have supported Prigozhin had he not cut short his rebellion last June."}, {"id": "e664dd93-d888-44d7-997d-e676fb33a0a9", "title": "Nike Offcourt Slide ( NFL Detroit Lions ) Black / Battle Blue - Apr 2021 - DD0530 - 001", "date": "2024-08-24 06:15", "url": "https://www.kicksonfire.com/nike-offcourt-slide-nfl-detroit-lions-black-battle-blue", "domain": "kicksonfire.com", "domain_classification": "Unknown", "message": "Nike Offcourt Slide (NFL Detroit Lions) Black / Battle Blue100The Nike Offcourt Slide (NFL Detroit Lions) Black / Battle Blue is an ideal blend of comfort and team spirit, designed for fans of the Detroit Lions.\nThis slide features an ultra-soft foam footbed, which provides excellent cushioning and support for all-day wear.\nThe upper strap is adorned with the iconic Detroit Lions logo set against a sharp black and battle blue color scheme, showcasing your allegiance to the team in a sleek and stylish manner.\nDurability and practicality are at the core of the Nike Offcourt Slide's design, as evidenced by its sturdy construction and hard-wearing sole.\nWhether you're heading to a game, running errands, or simply enjoying a lazy day, the Nike Offcourt Slide (NFL Detroit Lions) Black / Battle Blue offers a fashionable, functional way to represent your favorite team."}, {"id": "5f218685-9a20-4e58-a06b-4e66572075ef", "title": "The pros and cons of a condensed campaign for Harris : From the Politics Desk", "date": "2024-08-24 00:15", "url": "https://www.yahoo.com/news/pros-cons-condensed-campaign-harris-232102331.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The pros and cons of a condensed campaign for Harris: From the Politics DeskThe pros and cons of a condensed campaign for Harris: From the Politics DeskWelcome to the online version of From the Politics Desk, an evening newsletter that brings you the NBC News Politics team’s latest reporting and analysis from the campaign trail, the White House and Capitol Hill.\nPlus, we dive into Robert F. Kennedy's decision to suspend his third-party bid and back former President Donald Trump.\nI’m speaking, of course, of Donald Trump,” Kennedy added.\nBut it changed dramatically after Harris took over as the Democratic presidential candidate and the polling landscape shifted.\nFrom there, Trump Jr. and donor Omeed Malik served as go-betweens to help close the deal."}, {"id": "61d41ba3-75ce-4f75-88f8-d9d2a49d8a71", "title": "Robert F . Kennedy Jr . endorsement of Donald Trump is another bizarre twist , but the political consequences may be minimal", "date": "2024-08-24 00:30", "url": "https://www.theglobeandmail.com/world/us-politics/article-robert-f-kennedy-jrs-endorsement-of-donald-trump-is-another-bizarre/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The rump likely lean to Mr. Trump.\nThe groundwork for the alliance between Mr. Kennedy and Mr. Trump was laid months ago.\nAnd though the Kennedy campaign encountered problems getting their candidate’s name on state ballots for the November election, Mr. Kennedy either brushed aside or ignored these entreaties.\nThe Harris team refused to meet with the Kennedy campaign.\nEventually Mr. Kennedy saw that his only path was through an Independent candidacy, a conclusion buttressed by the fact that the preponderance of those who turned out to his events were Republicans who also liked Mr. Trump."}, {"id": "b2e3d41b-912c-471c-bba5-a7ce093e199f", "title": "All Call of Duty : Black Ops 6 Beta and Early Access dates", "date": "2024-08-24 02:30", "url": "https://www.destructoid.com/all-call-of-duty-black-ops-6-beta-and-early-access-dates/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Before Black Ops 6 officially launches in October, you can get a head start with the upcoming Open Beta period.\nIn this guide, we’ll show you all the Open Beta and Early Access dates for Call of Duty: Black Ops 6, including pre-load details.\nThe Open Beta, on the other hand, will be available for all platforms and is a separate event from Early Access.\nPre-loads for Black Ops 6 Beta have already begun with the Modern Warfare 3 and Warzone Season 5 Reloaded update.\nKeep in mind that Open Beta progress might not transfer over to Black Ops 6’s full launch."}, {"id": "17f1c2f9-591e-47fc-8c61-bfe789c5b322", "title": "Is Channing Tatum Character in Blink Twice Based on Jeffrey Epstein ? Zoë Kravitz Addresses Rumors", "date": "2024-08-24 06:30", "url": "https://www.pinkvilla.com/entertainment/hollywood/is-channing-tatums-character-in-blink-twice-based-on-jeffrey-epstein-zoe-kravitz-addresses-rumors-1341992", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "Zoë Kravitz is addressing comparisons between Channing Tatum’s character in her film Blink Twice and Jeffrey Epstein.\nIn a recent interview with IndieWire, Kravitz, who is making her directorial debut with this movie, emphasized that the character and story are not based on Epstein.\nThe film, which Kravitz co-wrote with E.T.\nDespite the film’s focus on complex characters and themes, Kravitz stressed that it is not about any specific individual or situation.\nAdvertisementBlink Twice is set to release in theaters on August 23."}, {"id": "57410b55-98aa-4aa6-b71c-2d55d0d0f85e", "title": "  Everything is a fight and it shouldnt be  – parents tell of struggle to secure school places for children with additional needs", "date": "2024-08-24 03:15", "url": "https://www.independent.ie/irish-news/everything-is-a-fight-and-it-shouldnt-be-parents-tell-of-struggle-to-secure-school-places-for-children-with-additional-needs/a1183044534.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Parents of children with additional needs have spoken about how they are at their wits’ end trying to secure school places for this academic year.\nSpecial needs assistants (SNAs), activists, parents and their children marched to the Department of Education in Dublin yesterday to demand action so that vital school places are available for children with special needs.\n“This will allow for, amongst other things, the opening of up to 400 new special classes in mainstream schools and 300 additional special school places.\n“This includes 290 new special classes at primary level and 118 at post-primary.\n“For the coming school year, there will be over 3,300 special classes operating in primary and post-primary schools across the country."}, {"id": "9a63f264-cc68-4d34-96ed-e5fd0bb2b416", "title": "  He Was An American Hero : Locust Grove Veteran Laid To Rest , Honored For Military Service", "date": "2024-08-24 06:00", "url": "http://www.bigcountry995.com/story/66c93285aaa326291cb024fc/he-was-an-american-hero:-locust-grove-veteran-laid-to-rest-honored-for-military-service", "domain": "bigcountry995.com", "domain_classification": "Unknown", "message": "An American hero was laid to rest on Friday in Locust Grove.\nMayes Key was a prisoner of war in World War II then served in the Korean War before coming back to his home state and raising a family.\nLoved ones say Mayes Key was calm, reserved, and didn’t like to brag, and there was nothing he loved more than God, his family, and his country.\nHe knew that everything was little in life compared to what he had experienced.”Key grew up in Yonkers, Oklahoma, a small town that was flooded in the 1940s to create Fort Gibson Lake.\n“When he came back from World War II, within a few days, he was working a regular job,” said Key."}, {"id": "4661bfdb-1943-4adb-a944-ba8d24aaa931", "title": "  He Was An American Hero : Locust Grove Veteran Laid To Rest , Honored For Military Service", "date": "2024-08-24 07:15", "url": "http://www.thebulltulsa.com/story/66c93285aaa326291cb024fc/he-was-an-american-hero:-locust-grove-veteran-laid-to-rest-honored-for-military-service", "domain": "thebulltulsa.com", "domain_classification": "Unknown", "message": "An American hero was laid to rest on Friday in Locust Grove.\nMayes Key was a prisoner of war in World War II then served in the Korean War before coming back to his home state and raising a family.\nLoved ones say Mayes Key was calm, reserved, and didn’t like to brag, and there was nothing he loved more than God, his family, and his country.\nHe knew that everything was little in life compared to what he had experienced.”Key grew up in Yonkers, Oklahoma, a small town that was flooded in the 1940s to create Fort Gibson Lake.\n“When he came back from World War II, within a few days, he was working a regular job,” said Key."}, {"id": "5d2f5efe-4253-40c3-9aeb-23191c6ee84c", "title": "Opinion : This is Biden chance to end the war in Gaza . Just threaten to cut off weapons for Israel", "date": "2024-08-24 00:15", "url": "https://www.yahoo.com/news/opinion-bidens-chance-end-war-234032922.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Opinion: This is Biden's chance to end the war in Gaza.\nJust threaten to cut off weapons for IsraelPresident Biden has said that Israel's prime minister, Benjamin Netanyahu, may want to keep the Gaza war going to remain in power.\nRead more: Opinion: After the war in Gaza, America's relationship with Israel has to change.\nAnd weapons restrictions in Biden’s own national security memoranda and conventional arms transfer policy provide additional tools of leverage needed to secure a permanent cease-fire.\nAfter many phone calls over Israel’s prior assault on Gaza, Biden simply said: “Hey, man, we’re out of runway here."}, {"id": "bd5ed5b2-5b59-4fb9-9945-953d111a0e52", "title": "Opinion : This is Biden chance to end the war in Gaza . Just threaten to cut off weapons for Israel", "date": "2024-08-24 00:30", "url": "https://www.yahoo.com/news/opinion-bidens-chance-end-war-234032905.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Opinion: This is Biden's chance to end the war in Gaza.\nJust threaten to cut off weapons for IsraelPresident Biden has said that Israel's prime minister, Benjamin Netanyahu, may want to keep the Gaza war going to remain in power.\nRead more: Opinion: After the war in Gaza, America's relationship with Israel has to change.\nAnd weapons restrictions in Biden’s own national security memoranda and conventional arms transfer policy provide additional tools of leverage needed to secure a permanent cease-fire.\nAfter many phone calls over Israel’s prior assault on Gaza, Biden simply said: “Hey, man, we’re out of runway here."}, {"id": "fb5df6b2-c2c7-4a2a-a1c5-3ee22a0864d3", "title": "Czech Leader on Ukraine Peace : Full Restoration of Territory Unlikely , NATO Membership Possible - Novinite . com", "date": "2024-08-24 07:45", "url": "https://www.novinite.com/articles/227932/Czech+Leader+on+Ukraine+Peace:+Full+Restoration+of+Territory+Unlikely,+NATO+Membership+Possible", "domain": "novinite.com", "domain_classification": "Unknown", "message": "Czech President Petr Pavel has warned that a truly fair peace deal between Ukraine and Russia may remain an elusive ideal.\nPavel's comments come amid ongoing discussions about Ukraine’s potential NATO membership and the conflict's broader implications.\nHe noted that the Czech Republic, along with other NATO members, could consider Ukraine’s accession even if not all territories are reclaimed from Russian control.\nPavel drew parallels with West Germany's NATO membership in 1955, despite its division, suggesting a similar approach could apply to Ukraine.\nIn summary, while Czech President Petr Pavel acknowledges the challenges in achieving a completely just peace for Ukraine, he advocates for practical solutions and recognizes the strategic considerations in ongoing conflicts."}, {"id": "fd74f7e0-84ad-47de-b896-8221c99b28c8", "title": "Rewatching  Grave of the Fireflies , the Ghibli anime youll only want to watch once", "date": "2024-08-24 07:00", "url": "https://www.rappler.com/entertainment/movies/grave-of-the-fireflies-anime-feature-story-explanation/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "Grave of the Fireflies, a Studio Ghibli classic, is coming to Netflix on September 16.\nNow that I’m 41, I resolved to dig deeper by rewatching Grave of the Fireflies and learning more about why it hits so godsbedamned hard.\nAn apology, by Nosaka AkiyukiThe movie is based off a short story called “A Grave of Fireflies” by Nosaka Akiyuki.\nThis particular story is semi-autobiographical, in that it was based on the author’s experiences surviving the Kobe air raids of 1945, when he was 15 years old.\nThis is the somber requiem that lies behind the selfsame sadness of The Grave of the Fireflies."}, {"id": "2a19cd42-c8cc-4f72-b763-3233e4692d0f", "title": "RFK Jr . ends long - shot presidential campaign , which included series of bizarre comments about Jews", "date": "2024-08-24 00:00", "url": "https://www.jta.org/2024/08/23/politics/rfk-jr-ends-long-shot-presidential-campaign-which-included-series-of-bizarre-comments-about-jews", "domain": "jta.org", "domain_classification": "Unknown", "message": "Independent presidential candidate Robert F. Kennedy Jr., who injected outlandish comments about Jews into the national dialogue and also vocally supported Israel, suspended his campaign Friday and said he would support Donald Trump.\nI’m speaking, of course, of Donald Trump,” Kennedy said.\nEven amid such statements, Kennedy enjoyed support from some vocally pro-Israel Jews.\nMorton Klein, head of the right-wing Zionist Organization of America, was an Israel advisor to the campaign.\nKennedy, whom Trump has hinted could serve in his cabinet, would not be the first Trump ally to traffic in antisemitic conspiracy theories."}, {"id": "9400c1da-bbf7-469c-b8b5-d23e46e7f93b", "title": "Highlights of Knoxville Webb Shavar Young Jr ., a Clemson commitment , vs . BGA", "date": "2024-08-24 06:15", "url": "https://www.yahoo.com/news/highlights-knoxville-webbs-shavar-young-040852070.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Yahoo SportsIt's officially 'Convictions Week' on the pod as we provide our most definitive takes of draft season.\nMatt Harmon is joined by Yahoo Fantasy's resident hater Dan Titus to identify potential busts in each round of your draft.\nWhile both make it clear they don't think the guys they pick will have awful seasons, they do offer reasons why each of their picks won't meet the expectations of their current ADP.\nThe two also end the show by answering your questions in the fantasy mailbag."}, {"id": "dbd8f3f7-cf35-4232-97df-5be93b064f78", "title": "Jon Voight wishes his daughter Angelina Jolie bitter divorce battle with Brad Pitt would  be over  ", "date": "2024-08-24 02:00", "url": "https://www.femalefirst.co.uk/celebrity/jon-voight-wishes-daughter-angelina-jolies-bitter-divorce-battle-brad-pitt-1405093.html", "domain": "femalefirst.co.uk", "domain_classification": "Unknown", "message": "Jon Voight wishes his daughter Angelina Jolie’s bitter divorce battle with Brad Pitt would “be over”.\nJon Voight wishes his daughter Angelina Jolie’s bitter divorce battle with Brad Pitt would ‘be over’The ‘Midnight Cowboy’ actor, 85, spoke out about the former couple’s long-running disputes over custody of their six children and French vineyard – before issuing a public plea to actor Brad, 60, to put a stop to the disputes with 49-year-old Angelina.\nJon told Fox News Digital Friday: “I wish that would be over.\nA source told Page Six Brad was refusing to let go of the fight over the business as he sees it as an asset for his children.\nThe insider added: “It’s important that people realise that Brad’s motivation is to ensure that his kids can maximise the benefit of this asset."}, {"id": "880c6b01-c5a0-4b8c-9562-32247499cc80", "title": "Battle of the Blue Grass Fire Fighters Full Truck and Tractor Pull held in Grafton", "date": "2024-08-24 06:15", "url": "https://www.yahoo.com/news/battle-blue-grass-fire-fighters-032532327.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "GRAFTON, W.Va. (WBOY) — The Battle of the Blue Grass Fire Fighters Full Pull is hosting a two-day truck and tractor pull at the Taylor County Fairgrounds this weekend.\nOrganizers said the pull is a fundraiser for the fire department and that they are fortunate to have great weather conditions for it.\nHarry Jones Memorial Range kicks off 1,000 Yard National Shoot“So, a little something for everybody, gas trucks, diesel trucks, smoker tractors, outlaw tractors, we, we got an assortment.\nIn past years the Battle of the Blue Grass Fire Fighters Full Pull has hosted trucks and tractors from approximately 13 states.\nOrganizers added that the pull is the biggest truck and tractor pull in the state."}, {"id": "77a0f746-54de-4405-a617-d381196b6505", "title": "Ukrainian forces continue to advance near Sudzha in Russia Kursk Oblast – ISW", "date": "2024-08-24 07:30", "url": "https://www.yahoo.com/news/ukrainian-forces-continue-advance-near-022020674.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian forces continue to advance near Sudzha in Russia's Kursk Oblast – ISWExperts at the Institute for the Study of War (ISW), having analysed the data collected, have confirmed the advance of Ukrainian troops near the town of Sudzha in Russia’s Kursk Oblast.\nSource: ISWQuote: \"Ukrainian forces continued to marginally advance near Sudzha amid continued Ukrainian operations in Kursk Oblast on 23 August.\"\nTo quote the ISW’s Key Takeaways on 23 August:Ukrainian forces continued to marginally advance near Sudzha amid continued Ukrainian operations in Kursk Oblast on 23 August.\nUkrainian officials continue to highlight how Ukrainian forces can leverage tactical and technological advantages to offset Russian materiel advantages.\nUkrainian forces reportedly conducted another drone strike against the oil depot in Proletarsk, Russia’s Rostov Oblast, on 23 August."}]