[{"id": "3af48bf0-fe37-436b-bc21-6ecc4f49eb4f", "title": "Harvard didnt act on campus antisemitism says congressional report", "date": "2024-05-17 12:00", "url": "https://www.thejc.com/news/usa/harvard-didnt-act-on-campus-antisemitism-says-congressional-report-hdr3eqjr", "message": "Kestenbaum testified before the House Judiciary Committee on Wednesday as part of its investigation into campus antisemitism.\nKestenbaum told JNS that the complaint reminds him of his experience participating in Black Lives Matter marches.\nHarvard’s leaders and its Antisemitism Advisory Group “concluded that many of the antisemitic incidents could be addressed simply by enforcing existing non-discrimination and anti-bullying policies,” the report found.\n“The committee’s report proves that former president Gay and Harvard’s leadership propped up the university’s Antisemitism Advisory Group all for show,” she said.\n“That’s what’s happening at Harvard all the time,” Covit told JNS."}, {"id": "d28cc008-81a3-4ef5-ab96-47a719017b68", "title": "Campus Reform the # 1 Source for College News", "date": "2024-05-17 12:45", "url": "https://www.campusreform.org/article/marschall-shameful-northwestern-president-must-cowardly-ineptitude-congressional-hearing-/25474", "message": "The House Committee on Education and the Workforce has justifiably summoned Northwestern University President Michael Schill to testify May 23 on “shocking concessions to the unlawful antisemitic encampments” the institution enabled last semester.\nNorthwestern is one of the worst examples of administrative negligence in protecting Jewish students.\nI recently sat down with Jewish alumni and students from Northwestern University to hear about their latest experiences.\nHis failure to keep Jewish students safe on campus last fall motivated me to submit a Title VI complaint against Northwestern.\nThe House Committee’s hearings reinforce the fact that protecting Jewish students - or any other minority - is not a political issue."}, {"id": "23d761e6-8a31-429b-a68b-0e9facc37aea", "title": "The Graduation Issue 2024 : 2023 - 24 Year in Review", "date": "2024-05-17 04:45", "url": "https://www.thedp.com/article/2024/05/penn-graduation-issue-2024-years-23-24", "message": "Concerns about antisemitism on campus — and the University’s response — intensified after Hamas’ Oct. 7 attack on Israel.\nDozens of major donors pulled their funding in protest of University leadership, including Wharton Board of Advisors Chair Marc Rowan, 1987 College graduate Jon Huntsman Jr., and 1965 Wharton graduate Ronald Lauder.\nShortly after, the U.S. Department of Education announced an investigation into Penn over alleged antisemitism on campus.\nOn Dec. 5, Magill testified before Congress alongside the presidents of Harvard University and the Massachusetts Institute of Technology about antisemitism on college campuses.\nStudent dissent and activismThroughout the year, Penn students organized for various causes and leveraged criticism at University leadership."}, {"id": "4ecf3cfa-059f-4da9-bdf1-f43fdda8f181", "title": "EU conference vows to combat rising antisemitism - The Jerusalem Post", "date": "2024-05-17 04:15", "url": "https://www.jpost.com/diaspora/antisemitism/article-801522", "message": "(credit: Vatican Media/­Handout via REUTERS)After launching the conference on May 6, Bergé repeated her government's commitments to fight \"the scourge of antisemitism everywhere.\"\nI think Britain is trying to fight antisemitism very hard and we are implementing programs from other countries.\n\"Organizations are working together to create an effective reporting system that others can learn from that will create a more effective way to fight antisemitism.\nAs a former EU security chief, I can say that I think antisemitism is a threat to European security.\"\nI think we should also look into combating and providing intelligence on hate crimes such as antisemitism so that countries can fight the phenomenon."}, {"id": "ac38cdf0-1b27-4703-84f7-5bb1e9888958", "title": "Holocaust education in Iowa schools should paint the full picture", "date": "2024-05-17 00:15", "url": "https://www.bleedingheartland.com/2024/05/16/holocaust-education-in-iowa-schools-should-paint-the-full-picture/", "message": "Governor Kim Reynolds came to Beit Shalom, the home of the Quad Cities Jewish community, on May 15 to sign House File 2545, a bill containing controversial new social studies curriculum requirements.\nBecause the bill requires Iowa schools to teach Holocaust education, following the model of Illinois, which has required it for several years.\nThough members of the Quad Cities Jewish community are divided about the policies of the governor and the Republican-controlled legislature, we do stand united on the issue of Holocaust education in our schools.\nFor most of the members of the Jewish community, Holocaust education is not only important as a reminder of the horrors of the past and as a memorial to the martyrs of the Holocaust, but also as a much needed safeguard for the future.\nIt is our deepest hope that when our Iowa schools teach about the Holocaust, they will paint a full picture of that dreadful chapter in world history."}, {"id": "431c47db-ff36-412f-a781-f7c70784325b", "title": "Four pro - Palestine students , one pro - Israel protest in Kalama", "date": "2024-05-17 03:15", "url": "https://tdn.com/news/local/education/four-pro-palestine-students-one-pro-israel-protest-in-kalama/article_ac30e3e6-6882-11ee-aeaa-17623ab536e9.html", "message": "Four students from Kalama High School participated in a walk out protest near the end of the school day Wednesday in support of Palestine.\nThe brief protest was planned to be pro-Palestine, but one student also attended to support Israel and the U.S., and two Kalama residents unaffiliated with the school brought their children to hold American and Israeli flags after seeing the demonstrators.\nThe students gathered a few minutes outside of school property at an intersection on Elm Street, where they displayed signs urging for a ceasefire.\nSenior Diego Luna joined the protest to support Israel and the U.S., and said he wanted to show his pride in America and make sure people were aware of deaths happening on both sides.\nHe displayed American and Israeli flags and held a sign given to him by the other students that read \"this is not antisemitism.\""}, {"id": "04403ca3-e9a1-460b-bea3-71870d56fe67", "title": "The Forever Wars , MAGA and the Loneliness of Anger", "date": "2024-05-17 05:00", "url": "https://www.juancole.com/2024/05/forever-loneliness-anger.html", "message": "Surgeon General Vivek Murthy recently highlighted the problem, claiming that loneliness was as dangerous to our health as smoking 15 cigarettes a day.\nLoneliness and a Lack of Self-ControlI’m a clinical social worker who treats Americans from all walks of life, including serving troops and veterans affected by our post-9/11 wars.\nIts underbelly, however, is alienation, loneliness, and their close cousins, anger and fear.\nAnd many of those who feel lonely and depressed are also angry.\nWhat Donald Trump and other MAGA leaders have done is take emotions like loneliness and channel them into a social movement."}, {"id": "8f060a7a-27a5-4ded-86c6-9339f170f175", "title": "Anger And The MAGA Movement| Countercurrents", "date": "2024-05-17 05:30", "url": "https://countercurrents.org/2024/05/anger-and-the-maga-movement/", "message": "And many of those who feel lonely and depressed are also angry.\nWhat Donald Trump and other MAGA leaders have done is take emotions like loneliness and channel them into a social movement.\nThe anger of the MAGA movement is transcendent.\nAre they a cultural movement responding to demographic shifts involving immigration and low birth rates among White families?\nIn such an ongoing climate of isolation, anger, and underdevelopment, there seem few safe and accessible ways for Americans to gather peacefully anymore."}]