[{"id": "e2979419-644b-46b7-a823-ccf75f53dbe7", "title": "One Killed , 11 Wounded In Israeli Airstrikes On Lebanon", "date": "2024-08-20 02:15", "url": "https://menafn.com/1108577912/One-Killed-11-Wounded-In-Israeli-Airstrikes-On-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) BEIRUT/JERUSALEM, Aug 20 (NNN-NNA) – A member of Lebanese Hezbollah, was killed and 11 other people wounded yesterday, in Israeli in eastern and southern Lebanon, Lebanese military sources said.\nThe Israeli military confirmed in a statement that its aircraft hit Hussein Ali Hussein, identified by the Israeli military as a militant, in Deir Qanoun.\nHussein was a key member of Hezbollah's Rocket and Missile Unit in the area of Yarine in southern Lebanon, according to the Israeli military.\nThe injured were transported by ambulance to Tebnine Government Hospital in southern Lebanon,” said the sources.\nIn the Baalbek area of eastern Lebanon, six people were injured in an initial report, as a result of Israeli raids that targeted three Hezbollah sites, added the sources."}, {"id": "b7f16bec-3518-4227-b5a7-85a908ae404d", "title": "", "date": "2024-08-20 00:00", "url": "http://www.israelnationalnews.com/news/394872", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "IAF fighter jets on Monday evening struck a number of Hezbollah weapons storage facilities in the area of Beqaa in Lebanon.\nIn addition, an IAF aircraft eliminated the terrorist Hussein Ali Hussein in the area of Deir Qanoun in southern Lebanon.\nEarlier on Monday, IDF forces identified a terrorist cell operating from a Hezbollah military structure in the area of Tayibe in southern Lebanon.\nIAF fighter jets struck the structure in which the terrorists were operating.\nOvernight, Air Force fighter jets attacked Hezbollah military structures in the areas of Ayta al-Shaab, Beit Lif, and Houla in southern Lebanon."}, {"id": "d0c77140-870b-4388-bdd3-603193e2f09d", "title": "Blinken says Israel is prepared to compromise with Hamas to secure a deal to end the Gaza conflict boosting hopes of piece", "date": "2024-08-20 01:15", "url": "https://www.dailymail.co.uk/news/article-13759601/Blinken-says-Israel-prepared-compromise-Hamas-secure-deal-end-Gaza-conflict-boosting-hopes-piece.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Israel is prepared to compromise with Hamas to secure a deal to end the Gaza conflict, the US Secretary of State indicated last night.\nMr Blinken said last night: 'In a very constructive meeting, prime minister Netanyahu confirmed to me that Israel supports the bridging proposal.\nFor his part, Mr Netanyahu said the talks with Mr Blinken had been 'positive' and 'conducted in a good spirit'.\nToday, Mr Blinken is expected to travel to Egypt for further talks to end the fighting.\nIsrael is also braced for more suicide bombings by Hamas following a suicide bombing in Tel Aviv on Sunday."}, {"id": "7d9bdadd-32ff-45dd-9cd6-029aa149d4f5", "title": "Militias Signal De - Escalation with the U . S ., Return to Cosmetic Israel Strikes", "date": "2024-08-20 00:00", "url": "https://www.washingtoninstitute.org/policy-analysis/militias-signal-de-escalation-us-return-cosmetic-israel-strikes", "domain": "washingtoninstitute.org", "domain_classification": "Unknown", "message": "The self-styled Iraqi \"resistance\" has hinted at a desire to end the tit-for-tat sequence of strikes with the United States and return to cost-free counter-Israel operations.\nIn that event our response will not be stopped by restrictions\" (Figure 1).This message followed another round of U.S. strikes the day before against militias belonging to the self-styled muqawama (resistance) (Figure 2).\nIran blames Israel for the assassination of Ismail Haniyeh right under its nose and may soon respond with military attacks.\nThe Tansiqiya seems to be warning the United States not to use Iraqi airspace to strike Iran if said retaliation unfolds.\n(See Militia Spotlight's attack tracker for a database covering this and other attacks in Iraq and Syria.)"}, {"id": "30364715-b830-463e-b384-5dff13e46bfe", "title": "Israel - Hamas war latest : Blinken says  complex issues ,  hard decision remain over cease - fire plan", "date": "2024-08-20 09:15", "url": "https://www.wsls.com/news/2024/08/20/israel-hamas-war-latest-blinken-says-complex-issues-hard-decisions-remain-over-cease-fire-plan/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "He said there are still “complex issues” requiring “hard decisions by the leaders,” without offering specifics.\nThe kibbutz did not provide additional information and the Israeli military did not immediately confirm the information.\nPopplewell was declared dead by the Israeli military in June.\nAnother Israeli hostage dies in Hamas captivity, his village saysJERUSALEM — Another male hostage has died in Hamas captivity, his communal farming village announced Tuesday.\nIsrael’s military did not immediately confirm the information."}, {"id": "ea7b7d4c-43f3-45fd-a10d-0616f4912c6a", "title": "Israel strikes deep in east Lebanon", "date": "2024-08-20 00:30", "url": "https://tribune.com.pk/story/2489424/israel-strikes-deep-in-east-lebanon", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Israel struck Hezbollah weapons depots on Monday deep in Lebanon's east, a source close to the group told AFP, in a raid confirmed by the Israeli military.\nIt came after an Israeli soldier was killed in northern Israel, amid 10 months of cross-border clashes between Iran-backed Hezbollah and Israel.\n\"Israeli strikes in the (eastern) Bekaa region targeted Hezbollah weapons depots,\" said the source close to Iran-backed Hezbollah, requesting anonymity due to the sensitivity of the matter.\nEarlier on Monday, the Israeli military said a member of its Bedouin Trackers Unit \"fell during combat in northern Israel\".\nIsrael's military said its air force struck \"Hezbollah terrorists\" in the Hula area and \"Hezbollah military structures\" elsewhere in south Lebanon."}, {"id": "e2144aa2-82b8-455d-bb0b-57b80189c959", "title": "Blinken says Israel has agreed to US proposal to close remaining gaps on ceasefire deal and calls on Hamas to do the same", "date": "2024-08-20 00:45", "url": "https://krdo.com/news/2024/08/19/blinken-says-israel-has-agreed-to-us-proposal-to-close-remaining-gaps-on-ceasefire-deal-and-calls-on-hamas-to-do-the-same/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "Despite the claims of Netanyahu’s agreement to the bridging proposal, there are still significant challenges before a deal can actually be reached.\nNot only has Hamas not agreed to the proposal but negotiators are still working on specific details on how an agreement would be implemented.\n“It is time for everyone to get to yes, and to not look for any excuses to say no,” Blinken said.\nHamas said the latest proposal didn’t include a permanent ceasefire and introduced new conditions on the exchange of prisoners, among other issues.\nIn the evening, an Israeli airstrike in central Gaza killed seven members of the same family, medical officials said."}, {"id": "e49a16e0-31d7-4b67-b06a-f59bc43f3a61", "title": "Taylor Swift meets two young girls injured in Southport knife rampage", "date": "2024-08-20 00:00", "url": "https://www.dailymail.co.uk/news/article-13757901/taylor-swift-wembley-meet-southport-survivors.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Taylor Swift met two young girls at her Wembley gig who were injured in the Southport knife rampage.\nThe Shake It Off singer, 34, invited the two young girls backstage and posed for photos before one of her record breaking shows over the weekend.\nSwift reportedly reached out to the families of the Southport stabbing before she took to the stage at Wembley on Thursday with the gig said to be 'the hardest concert of her career' after the killings.\n'Taylor may not have spoken about Elsie Dot, Alice and Bebe on stage but she has reached out to their families,' an insider said.\nJust days later, Swift was then forced to cancel three gigs in Vienna after police uncovered a foiled ISIS terror plot."}, {"id": "91b83279-13b2-4516-8798-737d5689ddf9", "title": "Harris Denounces IDF Attack on Hamas Command - and - Control Center", "date": "2024-08-20 02:15", "url": "https://www.frontpagemag.com/harris-denounces-idf-attack-on-hamas-command-and-control-center/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "On August 10, the IDF fired three precision missiles at one part of the Al-Tabeen school in Gaza that was being used as a command-and-control center by Hamas.\nIt claimed that several of the 19 Hamas combatants the IDF said it had killed at the school had, in fact, been killed weeks before at other locations.\nThese are the figures, remember, put out by Hamas, which has a long record of lying about civilian casualties.\nIs that, as Kamala Harris insists, “far too many” civilian casualties?\nSo it is wrong to describe the latest attack as causing a “disproportionate” number of civilian casualties."}, {"id": "c426d70b-dc4f-4010-8a48-8c07f1433110", "title": "Shock Attack - Daily Times", "date": "2024-08-20 09:30", "url": "https://dailytimes.com.pk/1218990/shock-attack/", "domain": "dailytimes.com.pk", "domain_classification": "Unknown", "message": "Two-and-a-half years after Russia launched its full-scale invasion of its neighbour, Ukraine turned the war on its head and launched a lightning attack on the Southern Kursk region.\nHowever, it is still unclear if he wants to use this as a bargaining chip to end the prolonged war.\nGoing by a giddy presser that saw him praise the incursion and claim that his country sought to “destroy as much Russian war potential as possible,” it could mean he is trying to find a suitable position to ensure local success as well as taking long-range strikes like Russian forces.\nWe may even hear ofmissile launches against civilian infrastructure and the Russian arsenal in the coming days, but how this bold gamble will impact regional stability cannot be ascertained as of now.\nIt is not every day that one sees a direct hit to a ruthless, strongman image projected by Russian President Vladimir Putin."}, {"id": "b134fa29-954e-4b59-983e-57af5624fc1d", "title": "Taylor Swift Met With Survivors of the Southport Stabbings That Left 3 Girls Dead", "date": "2024-08-20 01:00", "url": "https://www.glamour.com/story/taylor-swift-met-with-survivors-of-the-southport-stabbings-that-killed-3-young-girls", "domain": "glamour.com", "domain_classification": "Unknown", "message": "Taylor Swift just made two fans’ dreams come true after they lived through a nightmare.\nOver the weekend, two young girls who survived the recent deadly stabbing at a Swift-themed yoga and dance class met with the 34-year-old pop star just before a London Eras Tour concert.\nThe rest of the Foster family also joined in for photos with Swift and her mom, Andrea.\nJust last month, three young girls were killed during a mass stabbing at the Swift-themed event in Southport, England, which took place on July 29.\nOne day later, Taylor Swift took to Instagram to address the heartbreaking crime."}, {"id": "c3d5690a-5caa-4d7d-b4a7-b9d0d407b11b", "title": "Taylor Swift meets families of Southport stabbing victims before London concert", "date": "2024-08-20 09:30", "url": "https://tribune.com.pk/story/2489530/taylor-swift-meets-families-of-southport-stabbing-victims-before-london-concert", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "In a recent show at Wembley Stadium, London, Taylor Swift met with families affected by the tragic mass stabbing at a children's dance class in Southport this July.\nThe incident, which occurred on July 29, left three young girls dead and several others, including adults, injured.\nOne mother, who shared photos on TikTok, captured the moment Swift met her daughters backstage.\nThe images show Swift embracing the two young girls, with the older child wearing a bandage on her left forearm.\nThe biggest thankyou to @Taylor Swift and her mum for making the most magical night possible for us all 🫶🏻 thankyou for bringing Hope & Autumn pure happiness last night & always 💗💗💗.”@_samifoster You drew stars around my scars 💫🥹 …."}, {"id": "7c3d49d1-2089-49a3-9af9-6733baf074f4", "title": "Taylor Swift meets in London with survivors of stabbing", "date": "2024-08-20 09:00", "url": "https://www.ynetnews.com/culture/article/r1kq3hbs0", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "During the stabbing spree that took place during a dance workshop, two children were murdered and at least 11 people were injured.\n\"The horror of the attack that took place in Southport is overwhelming me constantly, and I am in absolute shock,\"the singer wrote"}, {"id": "d3236ac0-2834-4af9-ab49-76a9918099f2", "title": "Man , 64 , who is fighting for his life in hospital after triple Manchester stabbing is the husband of mother - of - four who died in same horrific incident", "date": "2024-08-20 02:00", "url": "https://www.dailymail.co.uk/news/article-13759683/Man-64-fighting-life-hospital-triple-Manchester-stabbing-husband-mother-four-died-horrific-incident.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A mother-of-four has been stabbed to death outside her suburban home while her Christian preacher husband and a 17-year-old girl were left critically-injured in the horrific incident.\nPolice arrested a 22-year-old man on suspicion of murder, who detectives said was ‘known’ to the victims.\nThe family worshipped at Blessed Baptist Temple church, based in nearby Levenshulme, where Mr Obinim is church leader and trustee.\nIt is just so shocking and upsetting.’Police including armed officers were deployed to the scene and the suspect was apprehended in the area.\nDetective Superintendent Toby Facey, of Greater Manchester Police, said: ‘Our thoughts remain with those affected and their loved ones."}, {"id": "af1f3a5d-79ff-4fab-8b75-e89ddd90c830", "title": "Israeli Bedouin soldier killed in Hezbollah drone barrage", "date": "2024-08-20 02:15", "url": "https://news.webindia123.com/news/Articles/World/20240820/4226734.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Warrant Officer Mahmood Amaria, 45, from the Bedouin town of Ibtin, was killed in Monday morning's drone attack, the IDF said.\nNearly 80,000 Israelis were forced to evacuate their homes near the Lebanon border when Hezbollah began launching rockets and drones in October.\nHezbollah leaders have said they will continue the attacks to prevent Israelis from returning to their homes.\nThe attacks have killed 26 civilians and 19 soldiers on the Israeli side.\nIsraeli officials have been calling for Hezbollah to be disarmed and removed from southern Lebanon in accordance with UN Security Council resolution 1701, which ended the 2006 Second Lebanon War."}, {"id": "bc8dcb61-99ca-4df4-b4d0-cfa7e56c5c37", "title": "", "date": "2024-08-20 00:00", "url": "http://www.israelnationalnews.com/news/394865", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "It was cleared for publication on Monday evening that Lieutenant Shahar Ben Nun, aged 21, from Petah Tikva, a commander in the Paratroopers Reconnaissance Unit, Paratroopers Brigade, fell during combat in the southern Gaza Strip.\nBen Nun was killed by a bomb dropped by an israeli aircraft as a result of a malfunction in the plane's navigation system.\nDue to the malfunction, the jet missed its intended target by nearly 300 meters and struck an apartment close to where a group of soldiers were stationed.\nBen Nun was killed in the blast, and six other soldiers were lightly to moderately wounded.\nThe first bomb struck its target, but the second bomb missed and caused the explosion in which Ben Nun was killed."}, {"id": "3d3bb0cd-0a98-43ed-9ec6-ea077d43b8a5", "title": "Harbor Commissioners To Revisit Discussion on Fireworks Ban", "date": "2024-08-20 00:45", "url": "https://wildrivers.lostcoastoutpost.com/2024/aug/19/harbor-commissioners-revisit-discussion-fireworks/", "domain": "wildrivers.lostcoastoutpost.com", "domain_classification": "Unknown", "message": "Crescent City Harbor commissioners will discuss how to go about addressing the problem at their meeting Tuesday, though at least one, Board President Harry Adams, says all fireworks should be banned.\nAdams said he drove around Crescent City at about 5 a.m. July 5 and what he found disgusted him.\nThe Harbor District is considering an ordinance banning all fireworks at the port — something Adams is arguing for.\nThey’re both due in court on Friday, according to the Del Norte County Superior Court calendar.\nThe Harbor District Board of Commissioners will meet at 2 p.m. in the Harbor District office at 101 Citizens Dock Road."}, {"id": "56ab1aa0-05a8-4de5-8c16-426b76f08181", "title": "Ukrainian air defence responds to Russian attack near Kyiv", "date": "2024-08-20 08:15", "url": "https://www.yahoo.com/news/ukrainian-air-defence-responds-russian-030654123.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian air defence was responding to a Russian attack on Kyiv Oblast during an air raid on the early morning of 20 August.\nSource: Serhii Popko, Head of Kyiv City Military Administration; Ukraine’s Air ForceQuote: \"The air-raid warning continues!\nAir defence systems are responding in the oblast, on the outskirts of Kyiv.\nDetails: Popko also said that the air-raid warning is linked to a threat of missile attacks.\nIn addition, the air-raid warning was issued in Chernihiv, Poltava, and Zhytomyr oblasts for the same reason."}, {"id": "9caf01ca-3c22-4ba1-b126-08465770caba", "title": "Trump Says He Would Appoint Elon Musk To Cabinet If Elected", "date": "2024-08-20 00:30", "url": "https://www.yahoo.com/news/trump-says-appoint-elon-musk-235951798.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Trump Says He Would Appoint Elon Musk To Cabinet If ElectedFormer President Donald Trump plans to offer a job to his billionaire buddy Elon Musk if elected, Reuters reported on Monday.\nTrump said he would consider terminating it, and also be open to assigning a cabinet or advisory role to Musk, the Tesla Motors co-founder and CEO.\nHe’s a brilliant guy,” Trump said.\n“I think it would be great to just have a government efficiency commission that takes a look at these things and just ensures that taxpayer money...is spent in a good way,” Musk told Trump.\n“You’re the greatest cutter,” Trump told Musk during their conversation last week."}, {"id": "0b908ecb-fa4b-4c85-8cb8-1cbed29d8998", "title": "US authorizes potential sale to S . Korea of Apache attack helicopters", "date": "2024-08-20 02:00", "url": "https://www.koreatimes.co.kr:443/www/nation/2024/08/205_380856.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "The United States has approved a potential sale to Korea of Apache attack helicopters and related logistical and other elements to help improve the Asian ally's defense capabilities, a government agency said Monday.\nThe Defense Security Cooperation Agency (DSCA) under the Department of Defense announced that the State Department has made the decision on the potential government-to-government Foreign Military Sale (FMS) estimated to cost $3.5 billion.\nKorea has made a request to buy up to 36 AH-64E Apache attack helicopters, 76 T700-GE-701D engines, 456 AGM-114R2 hellfire missiles, 152 AGM-179A joint air-to-ground missiles and 40 AAR-57 common missile warning systems among others, according to the agency.\n\"The proposed sale will improve the Republic of Korea's capability to meet current and future threats by providing a credible force capable of deterring adversaries and participating in regional operations,\" it added.\nDSCA delivered the certification notifying Congress of the possible sale earlier in the day as the sale requires congressional endorsement."}, {"id": "ec000429-2628-441f-985e-aba5ad90d648", "title": "Stabbed : Man stabs minor cousin to death | Bhubaneswar News", "date": "2024-08-20 01:00", "url": "https://timesofindia.indiatimes.com/city/bhubaneswar/man-stabs-minor-cousin-to-death/articleshow/112638160.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "The girl was hospitalized but her life is not in danger, while her mother sustained minor injuries.\n22-year-old man stabbed to death after road rage in DelhiA 22-year-old man, Monu, was fatally stabbed by four men in Prasad Nagar, Delhi on August 15.\nUP man gets life for setting afire cousin who spurned himA fast-track court in Mainpuri sentenced a man to life imprisonment for murdering his 15-year-old cousin after she rejected his advances six years ago.\nThe girl identified her attacker before succumbing to her injuries, crucial in convicting Jitendra Kumar.\nBerhampur: A 13-year-old girl was stabbed to death by her cousin during a shradhh ceremony at the latter’s house in Jagannath Bihar under Bada Bazar police station limits here on Monday."}, {"id": "4f1afeed-5f29-4916-bd9d-6f8a6c1262e1", "title": "Russia hits energy infrastructure in airstrikes on Ukraine", "date": "2024-08-20 09:15", "url": "https://www.thestar.com.my/news/world/2024/08/20/russia-hits-energy-infrastructure-in-airstrikes-on-ukraine", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "KYIV (Reuters) -Russia hit energy infrastructure in northern Ukraine in an overnight missile and drone attack and caused a big fire in the west of the country, Ukrainian officials said on Tuesday.\nRegional officials in the northeastern Sumy region bordering Russia said an energy facility was hit, causing blackouts for 72 settlements and more than 18,500 consumers.\nAn industrial facility was attacked in the western region of Ternopil region during the latest bombardments, and a fuel reservoir was hit, officials said.\nViktor Ustenko, a deputy head of the Ternopil regional administration, said over 90 firefighters were involved in efforts to extinguish the fire.\nMoscow has continued airstrikes since Ukrainian forces began an incursion into Russia's Kursk region on Aug. 6, and Russian forces have been gradually advancing in parts of eastern Ukraine."}, {"id": "2f4b2fda-79d6-4fc6-9b97-7424fecf6567", "title": "Ukraine repels fifth Russian missile attack on Kyiv ... ", "date": "2024-08-20 06:00", "url": "https://www.newsincyprus.com/news/534565/ukraine-repels-fifth-russian-missile-attack-on-kyiv-in-august", "domain": "newsincyprus.com", "domain_classification": "Unknown", "message": "5 hours ago Cyprus Mail CyprusMail CoolRussia launched its fifth missile attack on Kyiv this month, Ukraine’s military said on Tuesday, with preliminary data showing air defence systems were again successful in repelling the strikes.\nThe missile attack followed a drone attack on Kyiv late on Monday, with preliminary information showing there was no damage or injuries as a result of either of the attacks, Kyiv’s military administration said on the Telegram messaging..."}, {"id": "6bd2ef58-1a8e-4cc6-9e1e-716df13ae20e", "title": "Deadly stabbing suspect from LaPorte captured after pursuit into St . Joseph County", "date": "2024-08-20 01:15", "url": "https://wsbt.com/news/local/deadly-stabbing-suspect-from-laporte-captured-after-pursuit-st-joseph-county-investigation-chase-man-victim-died-police-south-bend-north-liberty-jail-indiana", "domain": "wsbt.com", "domain_classification": "Unknown", "message": "A suspect in a deadly stabbing Monday morning in LaPorte was captured during a high-speed pursuit into St. Joseph County.\nAccording to LaPorte Police, officers were called to the 200 block of Lawndale Ave about a stabbing.\nPolice said a suspect in the stabbing was soon located in LaPorte County and fled into St. Joseph County with officers from multiple agencies giving chase.\nThe suspect is being held in the La Porte County Jail pending the possible filing of charges in the case, which remains under investigation, police said.\nPolice did not provide further details but will once the investigation moves further along in the process."}, {"id": "6f93d629-744b-4cc8-914c-b0f58b63f70a", "title": "Teen stabbed , motorcycle driver shot dead in Hinigaran", "date": "2024-08-20 01:00", "url": "https://visayandailystar.com/teen-stabbed-motorcycle-driver-shot-dead-in-hinigaran/", "domain": "visayandailystar.com", "domain_classification": "Unknown", "message": "A Grade 12 student, whose identity was withheld by the police, was declared dead on arrival at a clinic at a medical clinic in Hinigaran town, on Sunday.\nThe 17-year-old victim succumbed to multiple wounds after he was stabbed by a still unidentified suspect in Barangay 4, Hinigaran, according to initial investigations of the town’s police.\nThe following day, a motorcycle driver was shot by an unidentified gunman at Purok Taytay Tanulo in Brgy.\nPolice investigations indicated that the 25-year-old victim was driving a motorcycle when a still unidentified suspect shot him at the back, with the bullet exiting his chest.\nThe victim died on the spot, when the responding members of Hinigaran Rescue Team arrived at the crime scene."}, {"id": "5796ea38-6922-41d6-997d-f88f7359c850", "title": "Myanmar massacre :  My family died in front of my eyes  ", "date": "2024-08-20 00:15", "url": "https://www.bbc.com/news/articles/czx6w130q1ko", "domain": "bbc.com", "domain_classification": "International", "message": "'My family died in front of my eyes’: Harrowing tales from a Myanmar massacreBBC/Aamir Peerzada Nisar lost his family in the attack on the banks of this riverWarning: This article contains details some readers may find distressing.\nThey dropped bombs on us using drones.” Nisar was the only one of his family to survive.\nWhile most described the bombs being dropped by drones, a weapon increasingly being used in Myanmar, some said they were hit by mortars and gunfire.\nBut the conflict intensified faster than he expected, and on the morning of 5 August, the family decided to leave Myanmar.\nHandout The faces of four members of the same family who drowned crossing to safety"}, {"id": "97593b86-8aff-4b36-9ead-033e804b794c", "title": "Blinken says Israel backs US proposal in  last  chance for Gaza truce", "date": "2024-08-20 06:45", "url": "https://www.standardmedia.co.ke/asia/article/2001501288/blinken-says-israel-backs-us-proposal-in-last-chance-for-gaza-truce", "domain": "standardmedia.co.ke", "domain_classification": "Local - Africa", "message": "US Secretary of State Antony Blinken (C) walks after his arrival in Tel Aviv on August 18, 2024.\nIt's now incumbent on Hamas to do the same,\" Blinken told reporters in Tel Aviv.\nTel Aviv bombingLate on Sunday, soon after Blinken landed in the city, a rare bombing took place in Tel Aviv.\nIt came as Israel and Hamas traded blame for delays in reaching a truce deal.\nBlinken said Washington was working with Israel and expected they would have a vaccination plan \"in the coming weeks\"."}, {"id": "65f1bfb2-3f7a-4df4-b07d-d243f497c240", "title": "Biden - Harris Admin Waives Sanctions on Iran Terror - Spreading State Broadcaster as Tehran Plots Israel Attack", "date": "2024-08-20 01:00", "url": "https://freebeacon.com/national-security/biden-harris-admin-waives-sanctions-on-irans-terror-spreading-state-broadcaster-as-tehran-plots-israel-attack/", "domain": "freebeacon.com", "domain_classification": "Unknown", "message": "It is the first time the Biden-Harris administration has renewed the waiver since Hamas launched its unprecedented attack on Israel, sparking war with Iranian proxies across the region.\nWhile past administrations have waived sanctions on the IRIB, starting with the Obama administration in 2014, the fresh waiver comes amid a unique period of Iranian aggression.\nIn the wake of the Oct. 7 attack by Iranian terrorist proxy Hamas, Tehran has launched increased attacks on American bases and personnel, as well as the Jewish state.\nThe Biden-Harris administration also waived IRIB sanctions in February 2023.\nSecretary of State Antony Blinken personally signed off on the new sanctions waiver, telling Congress that bypassing sanctions on Tehran \"is vital to the national security of the United States.\""}, {"id": "dddc5912-af2a-4ba9-9918-3032571bfc5c", "title": "Israeli soldier , two Hizbollah fighters killed in clashes", "date": "2024-08-20 00:45", "url": "http://jordantimes.com/news/region/israeli-soldier-two-hizbollah-fighters-killed-clashes", "domain": "jordantimes.com", "domain_classification": "Unknown", "message": "Fire sweep over the Marjayoun plain in southern Lebanon near the border with Israel after being hit by Israeli shelling on August 16, 2024, amid the ongoing cross-border clashes between Israeli troops and Hizbollah fighters (AFP photo)BEIRUT, Lebanon — An Israeli soldier and two Hizbollah fighters were killed Monday in clashes, Israel's military and the Iran-backed Lebanese group said, the latest in a wave of cross-border violence.\nHizbollah and Iran vowed to respond after an Israeli strike last month on Beirut killed senior Hezbollah commander Fuad Shukr, hours before an attack in Tehran, blamed on Israel, killed Hamas political leader Ismail Haniyeh.\nThe Israeli military said Monday a member of its Bedouin Trackers Unit \"fell during combat in northern Israel\".\nIsrael's military said air forces struck \"Hezbollah terrorists\" in the Hula area and \"Hizbollah military structures\" elsewhere in south Lebanon.\n'Impunity'Hizbollah said that it responded to an Israeli \"attack and assassination\" in south Lebanon's Tyre area."}, {"id": "b31dd536-0d27-4c81-a55e-9b309d50fa33", "title": "Man seriously injured in Elkhart stabbing", "date": "2024-08-20 01:15", "url": "https://wsbt.com/news/local/stabbing-investigation-man-seriously-injured-police-hospital-retrat-apartment-homes-toledo-road-elkhart-indiana", "domain": "wsbt.com", "domain_classification": "Unknown", "message": "Police in Elkhart have launched an investigation into a weekend stabbing that left one person hurt.\nIt happened Saturday around 10:30 p.m. at the Retreat Apartment Homes on Toledo Road.\nWhen officers arrived, they found a 61-year-old man inside the common area with stab wounds.\nThe victim was taken to the hospital with serious injuries, but he is expected to survive.\nAnyone with information on the stabbing is asked to contact police at (574)-295-7070 or Michiana Crime Stoppers at (574)-288-STOP."}, {"id": "b9a1ba9a-bdd2-4a54-8e91-33a4315149e0", "title": "Florida woman who claimed she worked for God indicted for ambush murder of deputy", "date": "2024-08-20 01:30", "url": "https://www.foxnews.com/us/florida-woman-who-claimed-worked-god-indicted-ambush-murder-deputy", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "FLORIDA WOMAN ARRESTED FOR AMBUSH MURDER IN KILLING OF DEPUTY, CLAIMED SHE WORKED FOR GODSulpizio was taken into custody on Aug. 5 at a hospital in Tavares, Florida, after being taken there for treatment on Aug. 2, when the crime occurred.\nMaster Deputy Sheriff Bradley Michael Link, 28, was killed in the shooting that Lake County Sheriff Peyton Grinnell described as an \"ambush.\"\nMaster Deputy Sheriff Harold Howell, 41, and Deputy First Class Stefano Gargano, 28, were injured in the attack.\nHe explained that the caller said a woman, later identified as Sulpizio, was attacking people and trespassing on their property.\n\"They identified Julie Sulpizio as their neighbor, but Julie states that she is 'Helen, under God's will.'\""}, {"id": "e533f612-767f-40ab-bbfb-4113618eb70e", "title": "American Airlines halts Israel flights until March 2025 – NBC 5 Dallas - Fort Worth", "date": "2024-08-20 02:15", "url": "https://www.nbcdfw.com/news/local/american-airlines-suspends-israel-flights-until-2025/3624802/", "domain": "nbcdfw.com", "domain_classification": "Unknown", "message": "American Airlines is extending its suspension of flights to and from Tel Aviv due to escalating tensions following 10 months of the Israel-Hamas war in Gaza.\nTravel must be completed within a year of the original ticket date, and the difference in fare may apply.\nFollowing the outbreak of the Middle East war in October 2023, American Airlines halted all flights to and from Tel Aviv.\nDelta Airlines and United Airlines canceled flights at the start of the war but have since resumed operations.\nIn a separate incident, a woman in her 70s and an 80-year-old man were murdered, and two other men were injured in a stabbing attack in a Tel Aviv suburb, according to Israel's Magen David Adom rescue service."}, {"id": "429b3447-772c-46d6-99f7-624b96835e5e", "title": "Myanmar massacre :  My family died in front of my eyes  ", "date": "2024-08-20 06:00", "url": "https://www.bbc.co.uk/news/articles/czx6w130q1ko", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "Fayaz was carrying bags stuffed with whatever they had managed to grab.\nHis wife was carrying their six-year-old daughter, their eldest was running alongside them.\nBut he died while we were waiting for the bombing to stop.”Nisar* had also made it to the riverbank by about 17:00, having decided to escape with his mother, wife, son, daughter and sister.\nThey dropped bombs on us using drones.”Nisar was the only one of his family to survive.\nFayaz, his wife and daughters escaped and would eventually make it across the river."}, {"id": "c6d221ce-3e0d-4cef-8d67-3f6f16dc259b", "title": "Ahead of Modi Ukraine visit , Russian Navy chief meets CDS , Admiral Tripathi in India – Firstpost", "date": "2024-08-20 05:15", "url": "https://www.firstpost.com/world/ahead-of-modis-ukraine-visit-russian-navy-chief-meets-cds-admiral-tripathi-in-india-13806297.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Just ahead of PM Modi’s visit to Ukraine, Russia’s navy chief is on a four-day tour of India to bolster maritime defence cooperation between the two countries.\nread moreThe day the government announced Prime Minister Narendra Modi upcoming Poland and Ukraine visits, Russian Navy chief Admiral Alekseyevich Moiseyev landed in India.\nModi will visit Ukraine on August 23.\nThe visit aims to strengthen bilateral naval relations, as also to explore new avenues for naval cooperation,” the paper said.\n“The Indian Navy has also been interacting with the Russian Federation Navy in various multilateral fora viz."}, {"id": "084fbf30-0cb0-41d9-9287-968a4b8729a0", "title": "Blinken calls on Hamas to accept ceasefire proposal", "date": "2024-08-20 01:00", "url": "https://www.rte.ie/news/middle-east/2024/0819/1465594-middle-east/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Secretary of State Antony Blinken has urged Hamas to accept a US bridging proposal for a Gaza ceasefire and hostage release deal after what he said was a \"very constructive\" meeting with Israeli Prime Minister Benjamin Netanyahu.\nHamas accused Mr Netanyahu of \"thwarting the mediators' efforts\" and Turkey said Hamas envoys had told it that US officials were \"painting an overly optimistic picture\".\nAfter a new proposal was drawn up at those talks, Hamas now accuses Mr Netanyahu of obstruction.\nYesterday Mr Netanyahu reiterated that Hamas must be pressured.\nTherefore, the pressure should be directed at Hamas and (their leader Yahya) Sinwar, not at the Israeli government,\" Mr Netanyahu said at a cabinet meeting."}, {"id": "52d4d68b-0d6c-4c26-9503-9e755045a174", "title": "Jury finds parents of Texas student accused in deadly 2018 school shooting not negligent", "date": "2024-08-20 02:15", "url": "https://www.nbcnews.com/news/us-news/jury-parents-texas-student-deadly-2018-shooting-not-negligent-rcna167294", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "GALVESTON, Texas — The parents of a former student accused of killing 10 people in a 2018 school shooting near Houston cannot be held responsible for what happened, a jury decided Monday.\nJurors did, however, held Dimitrios Pagourtzis responsible and awarded families more than $300 million total in damages, including for pain and mental anguish.\nHe is being held at a state mental health facility.\nPagourtzis’ parents are not accused of any crime.\nDimitrios Pagourtzis used his mother’s .38 caliber handgun and one of his father’s shotguns during the shooting."}, {"id": "eb333e53-e10a-43ff-9419-9d77787c034d", "title": "Jury finds parents of Texas student accused in 2018 deadly school shooting not negligent", "date": "2024-08-20 01:00", "url": "https://www.theglobeandmail.com/world/article-jury-finds-parents-of-texas-student-accused-in-2018-deadly-school/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The victims’ lawsuit sought to hold Dimitrios Pagourtzis and his parents, Antonios Pagourtzis and Rose Marie Kosmetatos, financially liable for the shooting at Santa Fe High School on May 18, 2018.\nJurors did, however, hold Dimitrios Pagourtzis responsible and awarded families more than $300-million total in damages, including for pain and mental anguish.\nIn April, Jennifer and James Crumbley were sentenced to at least 10 years in prison by a Michigan judge after becoming the first parents convicted in a U.S. mass school shooting.\nPagourtzis’ parents are not accused of any crime.\nDimitrios Pagourtzis used his mother’s .38 calibre handgun and one of his father’s shotguns during the shooting."}, {"id": "835e75fd-95a0-4731-8a2f-61cb1b02bac8", "title": "Jury finds parents not negligent in 2018 school shooting", "date": "2024-08-20 01:00", "url": "https://www.stltoday.com/news/nation-world/crime-courts/guns-firearms-courts-children-texas/article_bf55dad2-f189-5554-a0da-ba6dc2c92d13.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "The parents of a former student accused of killing 10 people at a high school near Houston in 2018 do not bear financial responsibility for the shooting, a jury decided Monday.\nA lawsuit brought by victims and their families sought to hold Dimitrios Pagourtzis and his parents, Antonios Pagourtzis and Rose Marie Kosmetatos, accountable for the shooting at Santa Fe High School in 2018.\nDimitrios Pagourtzis, now 23, was charged with capital murder, but the criminal case has been on hold since November 2019, when he was declared incompetent to stand trial.\nIn April, Jennifer and James Crumbley were sentenced to at least 10 years in prison by a Michigan judge after becoming the first parents convicted in a U.S. mass school shooting.\nDimitrios Pagourtzis' parents are not accused of any crime."}, {"id": "61ccc5fc-85c1-48d9-9c15-123af4f55a1d", "title": "Jury finds parents of Texas student accused in 2018 deadly school shooting not negligent", "date": "2024-08-20 00:45", "url": "https://gazette.com/ap/national/jury-finds-parents-of-texas-student-accused-in-2018-deadly-school-shooting-not-negligent/article_07eaa305-d738-5fe4-8aac-5eca891c9d23.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Jury finds parents of Texas student accused in 2018 deadly school shooting not negligentA Texas civil jury says the parents of a former student accused of killing 10 people in a 2018 school shooting can’t be held responsible for what happened"}, {"id": "3a1708e0-c1c0-4796-bc66-01093fcc5750", "title": "Napoleons Eagles 9 _ 5 file", "date": "2024-08-20 01:45", "url": "https://www.moddb.com/mods/napoleons-eagles/downloads/napoleons-eagles-9-5", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Follow the Emperor's Eagles from the first great victory of Castiglione to the last defeat of Waterloo.\nFollow the Emperor's Eagles from the first great victory of Castiglione to the last defeat of Waterloo.\nWe are proud to announce release of version 9.5 of the Napoleon's Eagles mode for NTW, also known as Historical Battles mod for NTW3.\nThis multiplayer mod has been part of NTW3 mod package from the very start and is now available as a stand-alone mod.\nThe mod is compatible with the version 9.5+ of NTW3 mod by the Lordz Modding Collective.The NE mod deals with the historical engagements of the Napoleonic Era."}, {"id": "347abc8e-fdf9-4bbe-97ae-947fe83d880f", "title": "US and South Korea hold joint air drills to counter North Korea threat", "date": "2024-08-20 04:30", "url": "https://www.aol.com/us-south-korea-hold-joint-025623133.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "The drills are part of the annual Ulchi Freedom Shield exercises that are designed to boost the joint readiness of the South Korean and U.S. militaries against threats from North Korea, it said.\nAircraft on defensive patrol flights are being diverted to air combat scenarios under simulated drills involving mock enemy aircraft interdiction and cruise missile defence, it said.\nAircraft from two U.S. fighter wings based in South Korea are taking part, the air force said.\nThe United States stations 28,500 troops in the South for combined defence against nuclear-armed North Korea.\nNorth Korea routinely denounces the annual Ulchi Freedom Shield drills, which began on Monday and will run through to Aug. 29, for stoking tensions on the Korean peninsula, calling them rehearsals for a nuclear war."}, {"id": "f649c6ae-b6e7-4fda-afcb-a891c6bb0511", "title": "Russo - Ukraine War - 19 August 2024", "date": "2024-08-20 01:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-19.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn addition, 629 kamikaze drones were recruited and carried out over 3,400 shelling at the positions of Ukrainian troops and settlements.\nIn the Kharkiv direction, Russian forces five times attacked the defensive borders of Ukrainian warriors near lipcív and vovčans вавka.\nIn the Vremívs вихkomu direction, Russian forces carried out five assault actions, in particular towards Vodânogo."}, {"id": "0ea42d6e-cb2b-4529-98f6-3daa01079799", "title": "Former CIA director makes stop in Peoria , speaks about international wars", "date": "2024-08-20 01:00", "url": "https://www.yahoo.com/news/former-cia-director-makes-stop-221306290.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "PEORIA, Ill. (WMBD) — Leadership is important everywhere.\nThat’s the message of a special guest who spoke at a luncheon in East Peoria on Monday.\nHe mentions in his book why it is so important to be a good leader or have good leadership.\nHe also shared at the luncheon what is important about “strategic leadership.”“Now, strategic leadership is crucial in any endeavor,” he says.\n“CEO of Caterpillar is a strategic leader."}, {"id": "64e0d7d6-5996-4991-b31a-f794ddb9bb41", "title": "Democratic National Convention in 2024 reminiscent of Chicago DNC riots in 1968", "date": "2024-08-20 00:30", "url": "https://www.10news.com/politics/america-votes/democratic-national-convention-in-2024-reminiscent-of-chicago-dnc-riots-in-1968", "domain": "10news.com", "domain_classification": "Unknown", "message": "But when you look back at the Democratic National Convention in 1968, it takes you back to a time of national turmoil, political uncertainty and war.\n\"There was nothing like '68 where right on the floor of the convention you had, like, warring factions.\"\nPresident Johnson increased the number of American troops in Southeast Asia and by 1968, more than half a million troops were serving in Vietnam.\nThe Democratic Party did not look like it was in control of itself or could get control of anything,\" he said.\nThe anti-war movement and the protests at the DNC in 1968 introduced us to the Chicago Eight — they were the first to be indicted for conspiracy and crossing state lines to incite a riot."}, {"id": "1151a429-1738-47b3-9567-400ebfd41885", "title": "Yoon calls for strengthening readiness against N . Korea  gray zone  provocations", "date": "2024-08-20 00:45", "url": "https://en.asiatoday.co.kr/view.php?key=20240820000924525", "domain": "en.asiatoday.co.kr", "domain_classification": "Unknown", "message": "1AsiaToday reporter Chun Hyun-binPresident Yoon Suk-yeol called for strengthening readiness against North Korea’s “gray zone” provocations, as South Korea and the United States kicked off their annual joint exercise on Monday.\n“Anti-state forces threatening the country’s liberal democracy are active everywhere in society,” he said.\nYoon stressed that internal forces threatening liberal democracy as anti-state forces, and ordered the establishment of a firm defense posture against the North.\n“We plan to significantly expand the South Korea-U.S. joint field training exercises,” he said.\n“Only a strong security posture can protect the safety of the people and liberal democracy.”"}, {"id": "f4b9dbac-fca1-4588-ba83-1353fcdbee09", "title": "Sgt . Yuval Ben Yakov legacy : Addressing antisemitism and unity", "date": "2024-08-20 00:15", "url": "https://www.jpost.com/opinion/article-815375", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "On October 7, 2023, the first day of the war triggered by Hamas’s barbaric attack on Israel, my son, Sgt.\nYuval Ben Yakov (z”l), fell heroically defending our country.\nFor decades, I have professionally supported the development of vital connections between Israel and Jewish communities.\nThe dangers of social mediaSocial media, widely and almost unrestrictedly spreading xenophobic and antisemitic content, only accelerates this process.\nIn recent years, notable incidents rooted in antisemitism have been documented in the US, EU, and many other regions."}, {"id": "b971e193-e5e1-402c-b444-ac2d61e1f64c", "title": "Reenactors and researchers recall San Antonio  first tragedy  ", "date": "2024-08-20 00:30", "url": "http://www.expressnews.com/news/texas/article/first-texas-revolution-1813-19659224.php", "domain": "expressnews.com", "domain_classification": "Unknown", "message": "The ceremony commemorated the 211th anniversary of the bloodiest battle in Texas history.\nThe ceremony commemorated the 211th anniversary of the bloodiest battle in Texas history.\nThe annual gathering commemorates the anniversary of the bloodiest battle in Texas history.\nARTHUR H. TRICKETT-WILE/SAN ANTONIO EXPRESS-NEWS Atascosa County Historical Commission Chairman Martin Gonzales bows his head in prayer Saturday at the Battle of Medina Symposium in Leming.\nARTHUR H. TRICKETT-WILE/SAN ANTONIO EXPRESS-NEWS Sons of the American Revolution in period costume fire a black-powder musket salute at Saturday’s annual Battle of Medina Symposium in Leming."}, {"id": "f86e4922-aa80-4d19-9030-9423db783c0f", "title": "Navy Installs New MQ - 25 Ground Control Station Aboard USS George HW Bush Carrier", "date": "2024-08-20 00:00", "url": "https://executivegov.com/2024/08/navy-installs-new-mq-25-ground-control-station-aboard-uss-george-hw-bush-carrier/", "domain": "executivegov.com", "domain_classification": "Unknown", "message": "The U.S. Navy has completed installing a new control room for the MQ-25 Stingray onboard the USS George H.W.\nBush aircraft carrier.\nCalled the Unmanned Air Warfare Center, the ground control station—a.k.a.\nAir vehicle pilots will use the UAWC to control the Stingray’s airborne operations moving forward.\nAccording to Unmanned Carrier Aviation Program Manager Capt."}, {"id": "f843a2d6-8321-4f39-ab25-2c64d2987072", "title": "How Ukraine turned the war on its head with surprise attack on southern Russia", "date": "2024-08-20 00:45", "url": "https://krdo.com/news/national-world/cnn-world/2024/08/18/how-ukraine-turned-the-war-on-its-head-with-surprise-attack-on-southern-russia/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "Ukrainian forces also used detailed knowledge of the geography to launch the attack, using forest belts for cover and roads for speed.\nKey to their success: air defenses and supporting artillery, as well as jamming to prevent the Russian military from communicating.\nMany of its residents were sent scrambling on hair-raising escapes, some cursing the Russian military for abandoning them.\nAt the same time, the Ukrainians trained their attention on Russian reinforcements, wiping out one convoy of 14 Russian military vehicles near Rylsk with a missile attack.\nIf they can set robust defensive positions … they can stay inside Russian territory for a long time,” he said."}, {"id": "c39115de-d223-4d53-ac8f-1ca913f73a3a", "title": "Call of Duty : Modern Warfare 3 Adds The Crow Crossover in Season 5 Reloaded", "date": "2024-08-20 00:00", "url": "https://comicbook.com/gaming/news/call-of-duty-mw3-the-crow-crossover-ps5-xbox-pc/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "With Call of Duty: Modern Warfare 3 and Warzone, players have seen everything from The Boys to Cheech and Chong make an appearance in the hit first-person shooter franchise.\nOn August 21st, the team is dropping Season 5 Reloaded, the mid-season patch that brings a ton of new content to Call of Duty: Modern Warfare 3, including a big, new crossover skin.\nThe Crow is the latest media property to get a crossover in Call of Duty.\nThe Ghost Punk Pro Pack features a punk rock version of the popular Call of Duty character, while the Playmaker Pack features an all-gold Operator to celebrate the Call of Duty League.\nCall of Duty: Modern Warfare 3 and Warzone are available now on PlayStation, Xbox, and PC platforms."}, {"id": "1becf434-7528-4ebd-844c-73233b8b47b1", "title": "101st Airborne Division Conducts Medical Training Simulation during Historic Long - Range Air Assault Exercise - Clarksville Online", "date": "2024-08-20 00:30", "url": "https://www.clarksvilleonline.com/2024/08/19/101st-airborne-division-conducts-medical-training-simulation-during-historic-long-range-air-assault-exercise/", "domain": "clarksvilleonline.com", "domain_classification": "Unknown", "message": "Fort Johnson, LA – Soldiers from the 101st Airborne Division (Air Assault) executed a major training exercise on August 18th, 2024, showcasing their capabilities in a large-scale, long-range air assault (L2A2) operation at the Joint Regional Training Center (JRTC).\nIt marked a historic milestone for the division as it was the first rotation at JRTC for a Mobile Brigade Combat Team.\nThe training exercise was comprehensive, encompassing a medical training simulation where soldiers reacted to contact and treated casualties under realistic combat conditions.\nThe scenarios tested the division’s readiness to conduct large-scale, long-range air assault missions, a core capability for the 101st Airborne Division.\nKnown as the “Screaming Eagles,” the 101st Airborne Division has a storied history of executing airborne and air assault operations with precision and excellence."}, {"id": "2256a113-94b8-4531-b7f3-d909015da198", "title": "Catholic Teen from Brooklyn Identified 71 Years After MIA in Korean War", "date": "2024-08-20 03:00", "url": "https://thetablet.org/catholic-teen-from-brooklyn-identified-71-years-after-mia-in-korean-war/", "domain": "thetablet.org", "domain_classification": "Unknown", "message": "The image shows Raymond — a typical teen in post-World War II Brooklyn — wearing a white t-shirt under a dark cardigan.\nThe RCT moved north along the east side of the Chosin Reservoir, while the Marines set up along the west side.\nThe Battle of Chosin Reservoir had begun.\nUnbeknownst to MacArthur’s intelligence officers, the Chinese already controlled the rugged terrain overlooking the Chosin Reservoir when Raymond’s unit arrived.\nFive years later, he had the grim task of preventing a massacre of his men at the Chosin Reservoir, including an estimated 600 wounded."}, {"id": "dcc889e1-eb10-4842-94a8-f6dfb5d6ec18", "title": "Lithuania starts construction of military base for German troops near Russian border", "date": "2024-08-20 02:00", "url": "https://www.yahoo.com/news/lithuania-starts-construction-military-german-003659249.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Lithuania on Aug. 19 began construction of a military base that will house up to 4,000 combat-ready German troops, with completion expected by the end of 2027.\nThis marks the first permanent foreign deployment for the German military since World War II.\nGermany made the commitment to station troops in Lithuania, a NATO and European Union member bordering Russia, in 2023.\nAdditionally, around 1,000 more German military personnel and civilian contractors will be stationed at other locations in Lithuania.\nTo support ongoing defense needs, including the construction of the base, Prime Minister Ingrida Simonyte's government has raised taxes for the coming years."}, {"id": "fd067d28-7849-4f66-814c-b9ca71098984", "title": "Marvel vs . Capcom Fighting Collection : Arcade Classics Clash of Super Heroes trailer", "date": "2024-08-20 00:45", "url": "https://nintendoeverything.com/marvel-vs-capcom-fighting-collection-arcade-classics-clash-of-super-heroes-trailer/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "It’s time for another Marvel vs. Capcom Fighting Collection: Arcade Classics trailer, this time for Marvel vs. Capcom Clash of Super Heroes.\nLearn more about Marvel vs. Capcom Fighting Collection: Arcade Classics in the following overview:Dive into an action-packed lineup consisting of seven unique titles, including heavy hitters like X-Men Vs. Street Fighter, and Marvel vs. Capcom 2 New Age of Heroes.\nFor Capcom fans, fighting game enthusiasts, comic book and Super Hero aficionados, and everyone in between, Marvel vs. Capcom Fighting Collection: Arcade Classics offers a timeless celebration of a legacy fighting game series, delivering a diverse roster of iconic characters, enhanced features and competitive gameplay.\nSee the the Marvel vs. Capcom Fighting Collection: Arcade Classics trailer for Marvel vs. Capcom Clash of Super Heroes below.\nMarvel vs. Capcom Clash of Super Heroes TrailerMarvel vs. Capcom Fighting Collection: Arcade Classics launches on Switch in 2024."}, {"id": "272c89e8-b964-48eb-8574-5c38c217e24e", "title": "Ukraine - Russia war : Kursk attack shows Kremlin red lines are bluff , says Kyiv", "date": "2024-08-20 08:45", "url": "https://www.irishtimes.com/world/europe/2024/08/20/ukraine-russia-latest/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "He said Ukraine, because of the restrictions imposed by allies, could not use the weapons at its disposal to hit some Russian military targets.\nHe urged allies to be bolder in their decisions about how to help Kyiv in the war.\nUkrainian forces face a tough battle near Pokrovsk, a transport hub for Ukrainian forces.\nHe said up to 600 people were leaving on a daily basis, and that municipal services could be cut off within a week as Russian forces close in.\nGerman defence stocks fell on Monday after a newspaper said the finance ministry would not approve additional applications for Ukraine military aid because of budget constraints."}, {"id": "39e2efed-40df-4ab4-a30b-84cdc1f1d9b1", "title": "Everything new in Delta Force : Hawk Ops Summer Carnival Update", "date": "2024-08-20 02:00", "url": "https://www.destructoid.com/everything-new-in-delta-force-hawk-ops-summer-carnival-update/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Delta Force: Hawk Ops‘ Summer Carnival update has finally dropped, and it brings a lot to the table.\nThanks to the Summer Carnival update, we can play a new mode in Havoc Warfare.\nNew EventsMandelBrick Showdown is the first event of the Summer Carnival update that started on August 16 and ends on August 22 at 23:59 (UTC+0).\nLimited-Time event: Weekend CarnivalFrom August 16 to August 19, Weekend Carnival had a higher MandelBricks drop rate.\nThe ones we’ve mentioned below will help you level up weapons faster and benefit the gameplay experience:250K Tekniq Alloys3x Premium Weapon EXP Coins200x Ahsarah Gold CoinsThat’s all for the Delta Force: Hawk Ops Summer Carnival update."}, {"id": "abf2756c-40f9-4331-b8bd-c549a4b1f542", "title": "US approves $3 . 5 billion sale of Apache helicopters to South Korea", "date": "2024-08-20 01:15", "url": "https://www.defensenews.com/pentagon/2024/08/19/us-approves-35-billion-sale-of-apache-helicopters-to-south-korea/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The U.S. State Department on Monday approved the sale of up to 36 AH-64E Apache helicopters, logistics and support to South Korea in a deal worth $3.5 billion.\nSouth Korea would also buy up to 76 GE T700 engines, two installed in each helicopter, plus four more spares.\nAlong with the helicopters, South Korea also wants to buy hundreds of missiles to arm them — including 456 Hellfire Missiles, 6 Captive Air Training Missiles and 152 Joint Air-to-Ground Missiles.\nThe primary vendors for the proposed sale to South Korea are Boeing and Lockheed Martin.\nSouth Korea previously purchased 36 AH-64E Apaches in 2013, an order that was completed in early 2017."}, {"id": "1b305d8b-f596-456b-a06a-744089b7237e", "title": "Why WWE CM Punk Calling Himself A  Professional Wrestler  Pisses Drew McIntyre Off", "date": "2024-08-20 01:45", "url": "https://www.wrestlinginc.com/1646217/wwe-cm-punk-calling-professional-wrestler-pisses-drew-mcintyre-off/", "domain": "wrestlinginc.com", "domain_classification": "Unknown", "message": "Advertisement\"The thing that drives me most crazy is that he goes around masquerading, calling himself a professional wrestler.\nHe's no longer a professional wrestler.\nThere is nothing wrong with being an attraction, we need attractions, but don't f***ing say you're a professional wrestler if you're not a professional wrestler.\nI'm a professional wrestler.\"\nMcIntyre went off on Punk throughout the interview, saying Punk quit the company while McIntyre and the rest of the roster \"worked their a**** off 52 weeks a year.\""}, {"id": "58b8e6f3-7aab-4e48-8938-53c573ac5ed3", "title": "Putin bluffing on retaliation threats , says Zelenskyy - as Ukraine takes more ground ... ", "date": "2024-08-20 01:00", "url": "https://www.heart.co.uk/news/uk-world/putin-bluffing-on-retaliation-threats-says-ze/", "domain": "heart.co.uk", "domain_classification": "Unknown", "message": "Putin bluffing on retaliation threats, says Zelenskyy - as Ukraine takes more ground in KurskThe Kremlin's threats of retaliation are a bluff, Ukraine's president Volodymyr Zelenskyy has claimed, with his country's forces now said to be in control of 90 settlements in the Russian border region of Kursk.\nRussian troops have steadily advanced towards the city in recent weeks.\nRussian presidential aide Yuri Ushakov said Moscow was not ready to hold peace talks with Ukraine for now, given the attack on Kursk.\nMeanwhile, Ukraine has demanded a full withdrawal of Russian troops from its territory before it sits down for any talks.\n(c) Sky News 2024: Putin bluffing on retaliation threats, says Zelenskyy - as Ukraine takes more ground in Kursk"}, {"id": "8507b685-95d3-49b7-ba22-f7f5102a320b", "title": "All Delta Force : Hawk Ops Operators , including classes and abilities", "date": "2024-08-20 02:00", "url": "https://www.destructoid.com/all-delta-force-hawk-ops-operators-including-classes-and-abilities/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Though Delta Force: Hawk Ops is still in the midst of its Alpha test, the tactical shooter offers a sizeable roster of Operators to choose from.\nRecommended VideosHavoc Warfare — Delta Force: Hawk Ops’ multiplayer game mode — deploys these units with gear, traits, and weapons to fit their respective jobs.\nAs you feel out your favored class and weapons, use our breakdown below of every Delta Force: Hawk Ops operator to learn who excels at what in better detail.\nHive-Tech Smoke Grenade tosses a smoke grenade that when hit by the Hive-Tech Pistol provides healing.\nThat’s all for Delta Force: Hawk Ops operators."}, {"id": "da364ddf-a72e-4849-963f-3a869b4cfd62", "title": "What if China gains control of Taiwan ? ", "date": "2024-08-20 07:30", "url": "https://news.webindia123.com/news/Articles/World/20240820/4226782.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Today, the fear is that China will invade Taiwan, overthrow a vibrant democracy and irreparably snap the so-called First Island Chain.\nTaiwan's annexation would disrupt Western techno-industrial supply chains for years to come, as China could control who it sold chips to.\nChina would likely be perceived as Asia's clear dominant power if it subsumed Taiwan, while managing to deter (or defeat) a US-led military intervention.\"\nChina would gain control of extremely sensitive military technology - after all, the USA is the Taiwan military's main benefactor and supplies advanced equipment - plus the USA would be less able to monitor Chinese military operations.\nAmerican policymakers must act urgently to deter PRC aggression and maximize capabilities to prevent China from coercively annexing Taiwan."}, {"id": "8e34c2a5-868a-4409-865e-9207799ec9d6", "title": "How to get Doctor Doom Arcane Gauntlets Mythic in Fortnite Chapter 5 , Season 4", "date": "2024-08-20 02:00", "url": "https://www.destructoid.com/how-to-get-doctor-dooms-arcane-gauntlets-mythic-in-fortnite-chapter-5-season-4/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Fortnite Chapter 5, Season 4 marks the introduction of multiple powerful weapons like the War Machine set, Doctor Doom’s Monarch Pistol, and his Arcane Gauntlets.\nFortunately, although obtaining Doctor Doom’s Arcane Gauntlets is slightly challenging, they’re not luck-based like other weapons in the game.\nRecommended VideosDoctor Doom’s Arcane Gauntlets Mythic locationDoctor Doom’s Arcane Gauntlets are an exclusive drop from the Doombot boss in Castle Doom.\nOnce you get your hands on Doctor Doom’s Arcane Gauntlets, you can access its arsenal of attacks to get through the rest of the match.\nHow to damage opponents with Doctor Doom’s Arcane Gauntlets Mystical BombDuring the Fortnite x Marvel event, one of the kickstart quests asks you to damage opponents with Doctor Doom’s Arcane Gauntlets Mystical Bomb."}, {"id": "a565c50d-fa8b-4047-a5b3-a25d4d9ed5d1", "title": "Biden takes first ride in new Marine One as Sikorsky wraps delivery", "date": "2024-08-20 00:30", "url": "https://www.defensenews.com/air/2024/08/19/biden-takes-first-ride-in-new-marine-one-as-sikorsky-wraps-delivery/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The U.S. Marine Corps received the final batch of its 23 new VH-92A Patriot presidential transport helicopters last week, an air frame most famously known as Marine One when carrying America’s commander-in-chief.\nSikorsky, a subsidiary of Lockheed Martin, delivered the final VH-92A Patriot helicopter in a ceremony at the company’s Owego, N.Y., facility on Aug. 14, Lockheed and Naval Air Systems Command, or NAVAIR, said Monday.\nPresident Joe Biden on Monday took his first flight aboard the newest Marine One after years of delays to the program to replace the aging aircraft that carry the president and vice president.\nThe new Marine One helicopters, the VH-92A Patriot, are built by Sikorsky and are adaptations of the S-92 commercial helicopter.\nTwo of the 23 VH-92A helicopters will be used for testing, NAVAIR said, and the rest will be used for operations."}, {"id": "974d5c15-27bb-4691-ba55-77a3b2881edb", "title": "Blinken heads to Egypt , Qatar for ceasefire talks", "date": "2024-08-20 09:30", "url": "https://punchng.com/blinken-heads-to-egypt-qatar-for-ceasefire-talks/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "US Secretary of State Antony Blinken headed to Egypt Tuesday for talks on a Gaza ceasefire as he pushes Hamas to accept a deal.\nBlinken, who met Israeli Prime Minister Benjamin Netanyahu in Jerusalem on Monday, will afterwards head to Qatar which along with Egypt is brokering negotiations for a truce in the 10-month Gaza conflict.\nHe will then head to meet Qatar’s emir, Sheikh Tamim bin Hamad Al-Thani, in Doha, the scene of ceasefire talks last week.\n“The United States is deeply committed to getting this job done, to getting it done now.”Blinken said on Monday that the ceasefire proposal could be the “last chance” as he raised pressure for a deal.\nA series of reports, however, say that Israel has raised new conditions in recent talks, including insisting on control of the Gaza border with Egypt that Israel seized from Hamas."}]