[{"id": "eb4e0866-dc89-40e7-a814-f93dc3836f79", "title": "Israel confirms killing of senior Hezbollah commander in S . Lebanon - Xinhua", "date": "2024-06-12 13:00", "url": "https://english.news.cn/20240612/74bc9528f7124163b711b12bb5c49191/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "JERUSALEM, June 12 (Xinhua) -- The Israeli military confirmed on Wednesday that it killed a senior Hezbollah commander, Sami Taleb Abdullah, in southern Lebanon in an airstrike on Tuesday.\n\"As part of the strike, Sami Taleb Abdullah, the commander of the Nasr Unit in Hezbollah, was eliminated,\" the military said in a statement, adding that he was \"one of Hezbollah's most senior commanders in southern Lebanon.\"\nThe center was used to direct attacks from southeastern Lebanon against Israel, and 55-year-old Abdullah, known within Hezbollah as Hajj Abu Taleb, was its commander, according to the Israeli military.\nOn Wednesday morning, Hezbollah announced it had launched retaliatory attacks using rockets, drones, and missiles on military sites in northern Israel.\nAccording to the Israeli military, at least 170 projectiles were fired from Lebanon toward Israel."}, {"id": "b67502ce-794b-4828-84c4-293bddf9b8a7", "title": "Hezbollah rains rockets on Israel after strike kills commander", "date": "2024-06-12 13:15", "url": "https://gulfnews.com/world/mena/hezbollah-rains-rockets-on-israel-after-strike-kills-commander-1.103077052", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "JERUSALEM: The Israeli military said successive rocket barrages were fired from Lebanon into northern Israel Wednesday, after an Israeli strike killed a senior Hezbollah commander in south Lebanon the previous day.\nThe latest barrages from Lebanon came after an Israeli strike killed a senior Hezbollah commander on Tuesday.\nHezbollah identified the slain commander as Taleb Sami Abdullah, also known as Abu Taleb and born in 1969.\nA Lebanese military source said the commander was “the most important in Hezbollah to be killed up to now since the start of the war”.\nThe source said the Israeli strike hit the town of Jouaiyya, 15 kilometres (nine miles) from the border."}, {"id": "54dac039-f09c-4533-99ff-f4de53d5661b", "title": "Hezbollah fires rockets after top commander killed ; Israel and Hamas committed war crimes , U . N . says", "date": "2024-06-12 12:00", "url": "https://www.nbcnews.com/news/world/israel-hamas-war-crimes-cease-fire-hezbollah-rockets-commander-killled-rcna156695", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "Secretary of State Antony Blinken said the Palestinian militant group had requested \"numerous\" changes to the Washington-backed plan to end fighting in the Gaza Strip and release hostages taken from Israel on Oct. 7.\nGiving the briefing hours after Hamas delivered its formal response, he said that Washington would keep working with meditators to try and secure an agreement.\nThe Lebanese militant group Hezbollah, a Hamas ally that is also backed by Iran, launched a \"massive\" volley of some 200 missiles into Israel, the Israeli military said.\nHe was killed in an Israeli airstrike on what the IDF called a \"command and control center\" in the town of Joya late Tuesday.\nThe attack also killed another three operatives, the IDF said in a statement accompanied by video of the strike."}, {"id": "74de6256-a302-4b86-98f8-73aad09c3293", "title": "Hezbollah fires big rocket salvos at Israel after senior commander killed", "date": "2024-06-12 13:15", "url": "https://www.rappler.com/world/middle-east/hezbollah-fires-big-rocket-salvos-israel-after-senior-commander-killed/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "The Israeli strike in south Lebanon village of Jouaiyya on June 11 killed three Hezbollah fighters alongside the senior field commander identified by Hezbollah as Taleb AbdallahLebanon’s Hezbollah fired big barrages of rockets at Israel on Wednesday, June 12, in retaliation for an Israeli strike which killed a senior Hezbollah field commander, escalating the conflict across the Lebanese-Israeli border.\nHe was the most senior Hezbollah commander killed during eight months of hostilities, one of the sources said.\nThe group also said it had attacked Israeli military headquarters in Ein Zeitim and Ami’ad, and an Israeli military air surveillance station in Meron, in each case firing dozens of Katyusha rockets, according to its statements.\nAbdallah, the Hezbollah commander killed on Tuesday, was senior to Wissam Tawil, a high-level Hezbollah commander killed in an Israeli strike in January, said the sources in Lebanon, who spoke on condition of anonymity.\nThe Israeli military says it has killed more than 320 Hezbollah members, including at least 100 targeted after field operatives gathered “precise high-quality intelligence” on them."}, {"id": "88d0b072-6834-4953-9b5b-3cfcb2fba9ba", "title": "Israel Says It Has Killed a Senior Hezbollah Leader in Lebanon", "date": "2024-06-12 14:00", "url": "http://www.hngn.com/articles/261388/20240612/israel-killed-senior-hezbollah-leader-lebanon-sami-taleb-abdullah.htm", "domain": "hngn.com", "domain_classification": "Unknown", "message": "(Photo : IDF/X)The IDF says it has killed a senior Hezbollah military leader.\nThe Israeli military says it has killed a top Hezbollah military leader in an airstrike in Lebanon.\nHezbollah reportedly responded by firing a massive barrage of rockets into northern Israel.\nHe was reportedly killed in a strike on a Hezbollah command and control center in the area of Jouaiyya in southern Lebanon.\nThe IDF said that Hezbollah fired about 160 projectiles at Israel from southern Lebanon on Wednesday, the Associated Press reported."}, {"id": "c9c8bd51-66e3-4a4c-b72a-ab3121a11042", "title": "Ukraine struck Russian air defenses in Crimea with a barrage of US - supplied ATACMS , reports say", "date": "2024-06-12 13:00", "url": "https://www.yahoo.com/news/ukraine-struck-russian-air-defenses-120121732.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine struck Russian air defenses in Crimea with a barrage of US-supplied ATACMS, reports sayUkraine struck Russian air defenses in Crimea with a barrage of US-supplied ATACMS, reports sayUkraine used at least 10 US-supplied ATACMS to hit Russian air defenses in Crimea, per reports.\nThis would be one of the first strikes Ukraine launched against Crimea using the US-supplied weapons.\nUkraine used at least 10 US-supplied Army Tactical Missile Systems, known as ATACMS, to hit Russian air defenses in Crimea on Monday, according to reports.\nTen missiles hit the 31st Air Defense Division of the Russian Defense Ministry in occupied Crimea, Russian independent Telegram channel Astra reported on Monday, citing unnamed sources.\nBusiness Insider couldn't independently verify details of the attack or the type of missile launched in the strike."}, {"id": "26a25e4e-abe8-4c21-aef0-1533f88aaee1", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 04:30", "url": "https://www.yahoo.com/news/dutch-court-delivering-verdicts-trial-040922867.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "FILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\n(AP Photo/Peter Dejong, File)AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the attack were convicted of direct involvement in the killing.\nEarlier this year, the de Vries family lawyer, van Spanje, lamented the fact that no suspect was on trial for ordering the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "80baae50-2a2f-4bd1-b7d7-33739ff4cdde", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 04:45", "url": "https://apnews.com/article/netherlands-de-vries-journalist-slain-d1bcd9dd6cc2d74a359a4a4b40281366", "domain": "apnews.com", "domain_classification": "International", "message": "AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the attack were convicted of direct involvement in the killing.\nDe Vries was gunned down on July 5, 2021, on a busy Amsterdam street and died nine days later of his injuries at age 64.\nEarlier this year, the de Vries family lawyer, van Spanje, lamented the fact that no suspect was on trial for ordering the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "e3003208-4aa7-45b2-91a1-da7b783dd950", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 04:45", "url": "https://www.startribune.com/a-dutch-court-is-delivering-verdicts-in-the-trial-of-9-suspects-in-the-slaying-of-reporter-de-vries/600372859/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "AMSTERDAM — A Dutch court on Wednesday convicted three men of murder for their roles in the 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the attack were convicted of direct involvement in the killing.\nDutch King Willem-Alexander called the shooting of de Vries ''an attack on journalism, the cornerstone of our constitutional state and therefore also an attack on the rule of law.''\nEarlier this year, the de Vries family lawyer, van Spanje, lamented the fact that no suspect was on trial for ordering the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "d9b38200-da6e-4344-a146-ce3184c58e0c", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 04:45", "url": "https://www.local10.com/news/world/2024/06/12/a-dutch-court-is-delivering-verdicts-in-the-trial-of-9-suspects-in-the-slaying-of-reporter-de-vries/", "domain": "local10.com", "domain_classification": "Unknown", "message": "FILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\n(AP Photo/Peter Dejong, File)THE HAGUE – A Dutch court on Wednesday convicted three men of murder for their roles in the 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the attack were convicted of direct involvement in the killing.\nEarlier this year, the de Vries family lawyer, van Spanje, lamented the fact that no suspect was on trial for ordering the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "4436bf66-5cbf-4361-8e23-9c32bbc1a768", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 05:45", "url": "https://www.news4jax.com/news/world/2024/06/12/a-dutch-court-is-delivering-verdicts-in-the-trial-of-9-suspects-in-the-slaying-of-reporter-de-vries/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "FILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\n(AP Photo/Peter Dejong, File)THE HAGUE – A Dutch court on Wednesday convicted three men of murder for their roles in the 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the attack were convicted of direct involvement in the killing.\nEarlier this year, the de Vries family lawyer, van Spanje, lamented the fact that no suspect was on trial for ordering the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "4fa72bcd-1a93-47f3-af83-cf396144d7d8", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries – Winnipeg Free Press", "date": "2024-06-12 04:30", "url": "https://www.winnipegfreepress.com/world/2024/06/11/a-dutch-court-is-delivering-verdicts-in-the-trial-of-9-suspects-in-the-slaying-of-reporter-de-vries", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the attack were convicted of direct involvement in the killing.\nFILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\nEarlier this year, the de Vries family lawyer, van Spanje, lamented the fact that no suspect was on trial for ordering the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "377e0a25-7b93-4066-95d1-498df7ef3e19", "title": "Israeli Strike in Lebanon Kills  Most Senior  Hezbollah Commander Targeted Since War Began - Israel News", "date": "2024-06-12 12:15", "url": "https://www.haaretz.com/israel-news/2024-06-12/ty-article/israeli-strike-in-lebanon-kills-most-senior-hezbollah-commander-targeted-since-war-began/00000190-0b56-db28-a995-4fdf34940000", "domain": "haaretz.com", "domain_classification": "Local - Middle East", "message": "An Israeli strike on the village of Jouya in southern Lebanon late Tuesday killed a senior field commander of Hezbollah and three fighters for the Lebanese armed group, three security sources said.\nIn an apparent response, Hezbollah fired a barrage of some 160 launches from southern Lebanon into the Golan Heights on Wednesday morning, Israel said.\nHezbollah sources told Haaretz that the group launched the most extensive attack on Israel's north since the war began.\nHe was the most senior Hezbollah commander killed in eight months of fire between Israel and Hezbollah, one of the sources said.\nThe sources, who spoke on condition of anonymity, said the commander was senior to Wissam Tawil, a high-level Hezbollah commander killed in an Israeli strike in January."}, {"id": "bc3b2c68-d46d-4c55-a9fa-d6066686f905", "title": "Verdict due in Dutch crime reporter killing", "date": "2024-06-12 06:15", "url": "https://www.yahoo.com/news/verdict-due-dutch-crime-reporters-052609297.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Peter R. de Vries was a household name in the Netherlands (Remko de Waal)A Dutch court will on Wednesday hand down a long-awaited verdict over the 2021 assassination of high-profile crime journalist Peter R. de Vries, a killing that shocked the country.\nPolice arrested two suspects, identified only as Dutchman Delano G. and Kamil E. from Poland, shortly after the shooting.\nThe celebrity journalist then moved into television, where he ran his own crime programme called \"Peter R. de Vries, Crime Reporter\".\nCrown Princess Amalia, the daughter of King Willem-Alexander, was forced to move to Spain for her studies due to fears of an attack from an organised crime group.\nBoth the royal and Prime Minister Mark Rutte were mentioned in messages by organised crime groups, raising fears of plans to kidnap or attack them."}, {"id": "fcb9aefe-129e-429c-a397-9e875f3122bc", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 06:45", "url": "https://www.bostonglobe.com/2024/06/12/world/dutch-court-is-delivering-verdicts-trial-9-suspects-slaying-reporter-de-vries/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "The shooter, getaway driver and organizer of the attack were convicted of direct involvement in the killing.\nAMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nOne man was convicted of drug possession but was cleared of complicity in the murder.\nEarlier this year, the de Vries family lawyer, van Spanje, lamented the fact that no suspect was on trial for ordering the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "bc693ba7-c1c0-4dda-a3c4-e60667829d72", "title": "Ukraine big strike on Crimea shows how its older missiles can take out Russia most advanced air defenses", "date": "2024-06-12 13:00", "url": "https://www.yahoo.com/news/ukraines-big-strike-crimea-shows-115050227.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine's big strike on Crimea shows how its older missiles can take out Russia's most advanced air defensesUkraine's big strike on Crimea shows how its older missiles can take out Russia's most advanced air defensesUkraine appeared to take out a Russian S-400 system in Crimea with Western ATACMS missiles.\nUkraine's latest claimed strike on Crimea is likely another example of how its older, Western-supplied missiles can foil even Russia's most advanced air-defense systems.\nRybar, an influential Russian military blogger, said on Monday that Ukraine had attacked Crimea with at least 12 ATACMS missiles.\nThe S-400 is Russia's most advanced air defense system.\nUkraine said none of its missiles were downed in the attack, while mocking Russia's descriptions of its own air defenses."}, {"id": "9d5928cc-0318-4df8-8f98-fc755bb6362c", "title": "On the 250th day of war , martyrs and injuries reported in central Gaza", "date": "2024-06-12 08:15", "url": "https://english.almayadeen.net/news/politics/on-the-250th-day-of-war--martyrs-and-injuries-reported-in-ce", "domain": "english.almayadeen.net", "domain_classification": "Unknown", "message": "The Israeli occupation intensified its targeting of areas in the central Gaza Strip, in addition to its bombing of other regions, which resulted in many martyrs.\n(AP)On the 250th consecutive day, the Israeli occupation persists in its devastating campaign against the Gaza Strip, conducting bombings and raids across multiple regions, leading to further casualties.\nThe occupation also targeted several areas in the central Gaza Strip, with helicopters firing heavy machine-gun fire around the Wadi Gaza Bridge.\nThe intense Israeli artillery shelling also targeted the east of Khan Younis, south of the Gaza Strip, as reported by Al Mayadeen’s correspondent.\nIn its daily report, the Health Ministry mentioned that the Israeli occupation forces committed three massacres within 24 hours, killing 40 Palestinians and injuring 120 others."}, {"id": "a2207592-5b75-4722-8ac2-1d5af3f6febc", "title": "150 Missiles from Lebanon - Hezbollah Retaliates against Israeli Raids", "date": "2024-06-12 13:15", "url": "https://www.palestinechronicle.com/150-missiles-from-lebanon-hezbollah-retaliates-against-israeli-raids/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "150 MissilesAccording to Israeli Army Radio, 150 missiles were fired from southern Lebanon into northern Israel, with 160 shells detected since the morning.\nThe local Israeli Regional Council in Upper Galilee advised residents to stay close to shelters and safe places.\nIsraeli Channel 12 reported a direct hit on a building in the Saasa settlement in Upper Galilee.\nIsraeli StrikesIsraeli Army Radio reported that, in response, the army began launching raids on sites in southern Lebanon.\nEarlier, Hezbollah mourned four of its members, including military commander Talib Sami Abdullah, killed in an Israeli raid on the town of Joya in southern Lebanon."}, {"id": "00691c1b-a2f5-400f-aa12-d5e131821272", "title": "Hezbollah fires rockets at Israel after Lebanon strike", "date": "2024-06-12 11:15", "url": "https://www.sconeadvocate.com.au/story/8659812/hezbollah-fires-rockets-at-israel-after-lebanon-strike/", "domain": "sconeadvocate.com.au", "domain_classification": "Unknown", "message": "The group also said it had attacked Israeli military headquarters in Ein Zeitim and Ami'ad, and an Israeli military air surveillance station in Meron, in each case firing dozens of Katyusha rockets, according to its statements."}, {"id": "e0d6b22b-86fe-4b07-9860-c3ef1eadeebe", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.lbc.co.uk/world-news/c4bd6557a8d64ef5ab7d569e8c0e153a/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "The 64-year-old reporter Peter R de Vries was gunned down in Amsterdam in a killing that sparked outrage.\nA Dutch court has convicted three men of murder for their roles in the fatal shooting of investigative reporter Peter R de Vries.\nThe brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death."}, {"id": "bba547d6-948e-4b82-aa21-5666a5bf3299", "title": "الوكالة الوطنية للإعلام - Islamic Resistance announces 6 operations against enemy sites", "date": "2024-06-12 10:30", "url": "https://www.nna-leb.gov.lb/en/security-law/701136/islamic-resistance-announces-6-operations-against", "domain": "nna-leb.gov.lb", "domain_classification": "Unknown", "message": "NNA - The Islamic Resistance announced on Wednesday that it targeted the Israeli enemy's air observation unit headquarters in Meron base with tens of Katyusha rockets and artillery shells, in response to the enemy's strike on Jouwaya.\nIn another statement, the Islamic Resistance said that its fighters fired tens of Katyusha rockets at the headquarters and warehouses of the Galilee Division Reservists in Ami'ad.\nIt also announced that it targeted the command center of the Northern Corps in Ein Zeitim base with tens of Katyusha rockets.\nIn other separate statements, the Islamic Resistance said it targeted the posts of Sammaqa, Ramya, and Raheb.\n===============R.A.H."}, {"id": "2b7e1e03-46e4-47d6-ab2c-d30658862667", "title": "Three men found guilty of killing Dutch investigative journalist", "date": "2024-06-12 14:30", "url": "https://www.euronews.com/2024/06/12/three-men-found-guilty-of-killing-dutch-investigative-journalist", "domain": "euronews.com", "domain_classification": "Unknown", "message": "A Dutch court on Wednesday convicted three men of murder for their roles in the 2021 shooting of investigative reporter Peter R. de Vries.\nADVERTISEMENTA Dutch court on Wednesday convicted three men of murder for their roles in the 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the attack were convicted of direct involvement in the killing.\nEarlier this year, the de Vries family lawyer, van Spanje, lamented the fact that no suspect was on trial for ordering the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "ecbf6472-0532-4235-8659-6aff10c97137", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 05:45", "url": "https://toronto.citynews.ca/2024/06/12/a-dutch-court-is-delivering-verdicts-in-the-trial-of-9-suspects-in-the-slaying-of-reporter-de-vries/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the attack were convicted of direct involvement in the killing.\nTheir actions and the recklessness they showed demonstrate that they do not care about human life,” said presiding Judge Gert Oldekamp at Amsterdam District Court.\nEarlier this year, the de Vries family lawyer, van Spanje, lamented the fact that no suspect was on trial for ordering the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "c6e48cda-8786-4adb-9964-b38b0a8c2cdc", "title": "Ukraine Crimea Attack Shows Russia S - 400 Vulnerable to Older Missiles", "date": "2024-06-12 13:30", "url": "https://www.businessinsider.com/ukraine-crimea-attack-shows-russia-s400-vulnerable-older-missiles-atacms-2024-6", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Read previewUkraine's latest claimed strike on Crimea is likely another example of how its older, Western-supplied missiles can foil even Russia's most advanced air-defense systems.\nRybar, an influential Russian military blogger, said on Monday that Ukraine had attacked Crimea with at least 12 ATACMS missiles.\nRelated VideoThe S-400 is Russia's most advanced air defense system.\nUkraine said none of its missiles were downed in the attack, while mocking Russia's descriptions of its own air defenses.\n\"None of our missiles fired were intercepted by the enemy's 'highly effective' air defense,\" Ukraine's General Staff said."}, {"id": "6076b754-a16a-4a7a-baf2-9ac1e63a7b2b", "title": "FACT CHECK : Post Claims To Show Damaged Su - 57", "date": "2024-06-12 13:45", "url": "https://checkyourfact.com/2024/06/12/fact-check-post-damaged-su-57/", "domain": "checkyourfact.com", "domain_classification": "Unknown", "message": "A post shared on X claims to show a damaged Russian Su-57.\nFact Check:Ukraine claimed to have hit a Russian Su-57 for the first time with drones, according to Axios.\nSocial media users have been sharing images of a Su-57, claiming it shows the damaged Su-57.\n“What is interesting about these photos of the Su-57 before and after its Liutyi OWA Drone/Propeller cruise missile hit…” Telenko partially writes.\nNo — PS01 (@PStyle0ne1) June 9, 2024The GUR released satellite imagery of the aftermath of the strike on Telegram."}, {"id": "d99c39e2-5679-4a3e-b36a-0448860a94a9", "title": "Lake Berryessa shooting suspect arrested by Napa County authorities", "date": "2024-06-12 02:15", "url": "https://www.mercurynews.com/2024/06/11/lake-berryessa-shooting-suspect-arrested-by-napa-county-authorities/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "A North Bay man was arrested on suspicion of fatally shooting another person during a brawl at Lake Berryessa on Saturday, according to a news release from the Napa County Sheriff’s Office.\nRelated Articles Crime and Public Safety | Federal appeals court upholds California’s gun show ban on state propertyFederal appeals court upholds California’s gun show ban on state property Crime and Public Safety | Man arrested on suspicion of robbing Redwood City 7-ElevenMan arrested on suspicion of robbing Redwood City 7-Eleven Crime and Public Safety | Initiative to amend Prop.\nOne person was fatally shot and at least five people were stabbed during a large fight June 8 on the shore of Lake Berryessa, the Napa County Sheriff’s Office said.\nAccording to Sheriff’s Office spokesman Henry Wofford, two people with stab wounds were airlifted to local hospitals in serious condition.\nThe cause of the fight and how many people were involved has yet to be determined by investigators."}, {"id": "e4f4fac7-e208-43ff-be5c-88418b68375f", "title": "Counter - Strike 2 Skins Go Deeper Than You Think ; Here What You Should Know", "date": "2024-06-12 11:15", "url": "https://n4g.com/news/2603733/counter-strike-2s-skins-go-deeper-than-you-think-heres-what-you-should-know", "domain": "n4g.com", "domain_classification": "Unknown", "message": "80°Best Shooter of 2023VGChartz's Lee Mehr: \"Ah, yes... the shooter.\nWhile many will besmirch the genre for being just about shooting guns, I say that's an unfair judgement.\nThere's also the potential for stabbing, exploding, incinerating, impaling, and so much more!\nJokes aside, 2023 was an... interesting year for quality, in that it felt like a coin toss whether a big-budget shooter would actually be worth anyone's time.\nBelow are the final contenders for the year, ranging from modern-military shooters to a new IP that didn't seem like it'd ever release."}, {"id": "e6af73da-ee78-45aa-87dc-3d082fd278e4", "title": "Hamas leader suggests civilian deaths are  necessary sacrifice in war with Israel : Report | News", "date": "2024-06-12 03:15", "url": "https://gazette.com/news/wex/hamas-leader-suggests-civilian-deaths-are-necessary-sacrifices-in-war-with-israel-report/article_64934c25-1f5d-5e3a-9e51-8887a95b7bf4.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Yahya Sinwar, the military leader of Hamas, reportedly suggested civilian deaths are \"necessary sacrifices\" amid its war with Israel in a message to the terrorist organization's leaders in Doha, Qatar.\nThe war between Hamas and Israel, much of it taking place within Gaza and the West Bank, has resulted in thousands of civilian deaths.\nBut Sinwar's remarks, reported by the Wall Street Journal, indicate that Hamas is willing to continue its war with Israel despite the heavy civilian cost.\nThe report also suggests that with the growing backlash Israel is facing over civilian deaths, he believes Hamas could deal with a depleted Israeli arsenal as allies hesitate to supply the nation further.\nFeatured Local SavingsHamas began the recent conflict with its Oct. 7 attacks on Israel, which killed hundreds of Israeli military personnel and citizens."}, {"id": "28ca85a2-f3fe-4224-9188-18bc2cd6cf43", "title": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021", "date": "2024-06-12 13:15", "url": "https://lethbridgeherald.com/news/world-news/2024/06/12/dutch-court-convicts-3-men-of-murder-in-fatal-shooting-of-investigative-reporter-in-2021/", "domain": "lethbridgeherald.com", "domain_classification": "Unknown", "message": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021By Mike Corder, The Associated Press on June 12, 2024.\nFILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\n(AP Photo/Peter Dejong, File) FILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\n(AP Photo/Peter Dejong, File)AMSTERDAM (AP) – A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "8816a130-03c5-464b-8345-3a7098f4e5ca", "title": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021 – Brandon Sun", "date": "2024-06-12 12:15", "url": "https://www.brandonsun.com/world/2024/06/12/dutch-court-convicts-3-men-of-murder-in-fatal-shooting-of-investigative-reporter-in-2021", "domain": "brandonsun.com", "domain_classification": "Unknown", "message": "AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nIn January, prosecutors requested sentences ranging from three to 21 years for the six other suspects in the case.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "b0e240c4-7631-4869-a0ad-e338e6a29fb5", "title": "IDF Eliminates Senior Hezbollah Official - Victory Girls Blog", "date": "2024-06-12 13:15", "url": "https://victorygirlsblog.com/idf-eliminates-senior-hezbollah-official/", "domain": "victorygirlsblog.com", "domain_classification": "Unknown", "message": "A Hezbollah commander was killed in a IDF strike late yesterday on the southern Lebanon town of Joya.\nProtestors will honor Taleb Abdullah as a “fallen martyr”.\nMAJOR UPDATE: The IDF had intel about the Hezbollah senior commander's secret meeting; they hit the meeting place and took out two of their most senior commanders pic.twitter.com/WNyCZngqKJ — Raylan Givens (@JewishWarrior13) June 11, 2024What does this mean?\nThe IDF taking out a key leader in a terrorist organization such as Hezbollah is a win.\nCNN reports just this morning that “militant group”, Hezbollah, fired 200 rockets towards Israel in retaliation of Taleb Abdullah’s death."}, {"id": "b88563ab-55f6-4753-a562-e3290a3c3231", "title": "4 US instructors wounded in China stabbing attack", "date": "2024-06-12 03:30", "url": "https://article.wn.com/view/2024/06/12/4_US_instructors_wounded_in_China_stabbing_attack/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "BEIJING: Four American instructors from a small Iowa university were wounded in a stabbing attack in a public park in northeast China’s Jilin province on Monday, prompting an investigation into the attacker’s motive, Chinese officials said.\nThe alleged assaults occurred shortly before noon on Monday at a park in Jilin... read full story\"Cui collided into a foreigner while walking in Beishan Park, and then stabbed the foreigner and three fellow foreigners with a knife, as well as a Chinese tourist who tried to stop him,\""}, {"id": "49ec45f3-c927-4100-84d6-519de37ec695", "title": "4 killed in Israeli airstrike on SE Lebanese town", "date": "2024-06-12 01:15", "url": "https://article.wn.com/view/2024/06/12/4_killed_in_Israeli_airstrike_on_SE_Lebanese_town/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "BEIRUT, June 11 (Xinhua) -- Four people were killed and 10 others injured late Tuesday in an Israeli airstrike on the town of Jouaiya in the southeastern Lebanese city of Tyre, Lebanese media reported.\nThe airstrike hit a house with three missiles in Jouaiya, killing Abu Talib, a senior military leader of the Lebanese... read full story\"the crossing of 12 drones and about 80 surface-to-surface missiles from the Lebanese side to northern Israel,\""}, {"id": "bf2ca236-1857-4c17-9bbf-34288bc6926b", "title": "BREAKING : IDF Eliminates Senior Hezbollah Official ; Highest Ranking Officer Neutralized Since Oct . 7", "date": "2024-06-12 04:15", "url": "https://freerepublic.com/focus/f-bloggers/4243746/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Posted on by SeekAndFindReports are emerging that the IDF hit a significant Hezbollah target in Lebanon on Tuesday afternoon.\nAccording to the reports, an Israeli strike in Jouya, in southern Lebanon, killed at least four Hezbollah officials.\nHezbollah identified the killed commander by his rank in a statement, naming him as Taleb Abdallah.\nThe sources, who spoke on condition of anonymity, said the commander's role in Hezbollah was as significant as that of Wissam Tawil, a senior Hezbollah commander killed in an Israeli strike in January.\nMAJOR UPDATE: The IDF had intel about the Hezbollah senior commander's secret meeting; they hit the meeting place and took out two of their most senior commanders."}, {"id": "b9492913-27bc-40e6-b57d-1781a1144888", "title": "4 US instructors wounded in China stabbing attack - Newspaper", "date": "2024-06-12 05:30", "url": "https://www.dawn.com/news/1839331/4-us-instructors-wounded-in-china-stabbing-attack", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "BEIJING: Four American instructors from a small Iowa university were wounded in a stabbing attack in a public park in northeast China’s Jilin province on Monday, prompting an investigation into the attacker’s motive, Chinese officials said.\nThe alleged assaults occurred shortly before noon on Monday at a park in Jilin City, police said.\nA Chinese foreign ministry spokesperson, Lin Jian, said on Tuesday that police believed it was a random attack but authorities were still investigating.\nUS officials expressed dismay over the attack, and the State Department said it was in touch with local authorities and monitoring the situation.\n“We are deeply concerned by the stabbing of US citizens in Jilin City, China,” White House National Security Advisor Jake Sullivan wrote on X on Tuesday."}, {"id": "97306b1f-732b-482f-9d6e-c72aa7ce881b", "title": "India Nuclear Journey : From Pokhran to Global Power – Indian Defence Research Wing", "date": "2024-06-12 04:15", "url": "https://idrw.org/indias-nuclear-journey-from-pokhran-to-global-power/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "India’s Nuclear Journey: From Pokhran to Global Power| BySOURCE: AFIThe journey began with the vision of physicist Homi Bhabha, who convinced Prime Minister Nehru to invest in nuclear technology despite international disapproval.\nIndia’s first Peaceful Nuclear Explosion (PNE) in Pokhran in 1974 marked a significant achievement, but it also triggered international condemnation.\nThis resulted in exclusion from crucial nuclear groups like the NSG (Nuclear Suppliers Group) and CTBT (Comprehensive Test Ban Treaty).\nIndia’s nuclear doctrine emphasizes “No First Use,” meaning it would only retaliate with nuclear weapons in response to a first strike by another nuclear state or a large-scale chemical/biological attack.\nChina, however, possesses a significantly larger arsenal (estimated at over 300 warheads), primarily aimed at deterring the US and its allies."}, {"id": "1c5809cc-1d82-4435-9afd-e96b7cd757ad", "title": "Ukraine hits Russian S - 300 and S - 400 missile systems in Crimea", "date": "2024-06-12 13:15", "url": "https://www.yahoo.com/news/ukraine-hits-russian-300-400-123200976.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Ukrainian Armed Forces (AFU) successfully struck S-300 and S-400 long-range missile systems in Russian-occupied Crimea overnight, the General Staff of the AFU reported on Telegram on June 12.\nRead also: Coordinated Ukrainian attack sinks Russian ship in Sea of AzovUkrainian military units launched coordinated missile strikes on a Russian S-300 system near the Belbek airfield, as well as two S-400 systems near Belbek and Sevastopol.\nThe General Staff confirmed the destruction of one S-300 and one S-400.\nFurther ammunition detonations were recorded in all three areas where Russian anti-aircraft missile divisions are stationed.\nThe AFU also targeted one S-400 system near Dzhankoi and two S-300 systems near Chornomorske and Yevpatoria, the General Staff reported on June 10."}, {"id": "9a14f28b-c911-44b9-9d2e-83dbe81763f7", "title": "Woman found guilty in 2023 fatal Springfield nightclub stabbing", "date": "2024-06-12 03:45", "url": "https://www.westernmassnews.com/2024/06/12/woman-found-guilty-2023-fatal-springfield-nightclub-stabbing/", "domain": "westernmassnews.com", "domain_classification": "Unknown", "message": "SPRINGFIELD, Mass.\n(WGGB/WSHM) - A woman found guilty of manslaughter on Tuesday in connection to a fatal stabbing in Springfield.\nIn January of last year, Springfield Police responded to the top shelf nightclub for reports of a stabbing victim.\nOfficers said the attack started outside the nightclub on chestnut street, and they found the victim in a parking lot across the street.\nShe pleaded not guilty to murder charges in January of 2023 and on Tuesday she has been found guilty of manslaughter."}, {"id": "6cf2d320-9a32-474a-b03e-05c5dad80102", "title": "Four US college instructors stabbed in public park in China", "date": "2024-06-12 02:00", "url": "https://hotair.com/headlines/2024/06/11/four-us-college-instructors-stabbed-in-public-park-in-china-n3790084", "domain": "hotair.com", "domain_classification": "Unknown", "message": "Police in China have arrested a 55-year-old man after four US university tutors were stabbed at a public park.\nThe Iowa Cornell College instructors were taken to hospital after a \"serious incident\" during the daytime attack in the northern province of Jilin, a college statement said.\nAdvertisementIowa Representative Adam Zabner said his brother, David, was one of the four instructors injured in what he described as a stabbing...On Tuesday, searches for terms such as \"foreigners Jilin\" produced no results despite the search term trending on Weibo."}, {"id": "58687c48-a553-422f-b1c7-446fb49dbbd4", "title": "The Latest | Rockets Fired from Lebanon after Israel Kills Hezbollah Commander", "date": "2024-06-12 08:15", "url": "https://www.newsmax.com/world/globaltalk/israel-hamas-mideast-latest-06-12-2024/2024/06/12/id/1168403/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "Scores of rockets were fired from Lebanon toward northern Israel on Wednesday morning, hours after Israeli airstrikes killed four officials from the militant Hezbollah group including a senior military commander.\nHis death came amid rising escalation along the Lebanon-Israel border that has seen Hezbollah intensify its attacks on northern Israel while Israeli airstrikes have struck deep inside Lebanon.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nHezbollah’s Al-Manar TV reported that rockets were being fired from south Lebanon into northern Israel.\nHezbollah published a photo of Abdullah alongside Wissam al-Tawil, another senior commander killed in an Israeli strike in January."}, {"id": "d3487c46-a2a7-4e17-b49c-26710f0597bd", "title": "1st LD : 160 rockets fired at northern Israel -- Israeli Army", "date": "2024-06-12 13:15", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-06/12/content_117250002.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "You are here:视频播放位置 下载安装Flash播放器JERUSALEM, June 12 (Xinhua) -- About 160 rockets were fired from Lebanon at northern Israel on Wednesday morning, said the Israeli army, after Israeli airstrikes killed four Hezbollah officials, including a senior commander.\nThe barrage marked the largest rocket attack by militants in Lebanon on Israel since the beginning of the new round of Israel-Hamas conflict on Oct. 7, 2023.\nLater in the morning, a barrage of some 70 rockets was fired toward Western Galilee and Mount Meron in Upper Galilee region, where a key aerial defense control unit is located.\nIn response to the latest barrage, Israeli aircraft struck the launcher in the area of Yaroun.\nThe Upper Galilee Regional Council called on residents to reduce outdoor activities to essential ones only, citing fear of additional barrages."}, {"id": "b35e11ad-e72c-4c19-b456-37675dbdaa3c", "title": "HAL LCH to Test Helina Anti - Tank Missile – Indian Defence Research Wing", "date": "2024-06-12 04:15", "url": "https://idrw.org/hals-lch-to-test-helina-anti-tank-missile/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "HAL’s LCH to Test Helina Anti-Tank Missile| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGHindustan Aeronautics Limited’s (HAL) indigenously developed Light Combat Helicopter (LCH), also known as Prachand, is poised for a crucial milestone later this year.\nThe helicopter will undergo integration and testing with the Helina Anti-Tank Guided Missile (ATGM), a key weapon system for the platform.\nHelina, the helicopter-launched version of the Nag missile, has already been successfully test-fired from the ALH-Rudra attack helicopter.\nHelina boasts advanced capabilities, making it a potent weapon for the LCH.\nThe successful integration of Helina will significantly enhance the Prachand’s combat capabilities, making it a more potent weapon system for the Indian Armed Forces."}, {"id": "1345f59f-f5bf-4df0-ac30-b0a5b258eeeb", "title": "Hezbollah attacks are reshaping the conflict in Israel North", "date": "2024-06-12 13:30", "url": "https://www.jpost.com/middle-east/article-805960", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "This escalation can be seen as part of the “equation” of terrorist attacks by the Iranian-backed group.\nHezbollah for example will usually carry out deeper attacks in Israel after it claims Israel carried out deeper attacks in Lebanon.\nTHERE IS A third way of seeing this type of conflict – as an “equation.” Prior to October 7, Hezbollah and Israel had a kind of equation.\nGenerally, this meant that Hezbollah did not attack inside Israel, and Israel did not attack inside Lebanon.\nHowever, it does not carry out attacks too deeply inside Israel because of the new equation – both Israel and Hezbollah avoid too much escalation."}, {"id": "3f7f089c-ee88-449a-a579-761b17e823ca", "title": "Moscow revives gunboat diplomacy with nuclear submarine visit to Cuba", "date": "2024-06-12 14:30", "url": "https://www.euronews.com/2024/06/12/moscow-revives-gunboat-diplomacy-with-nuclear-submarine-visit-to-cuba", "domain": "euronews.com", "domain_classification": "Unknown", "message": "Russia's top-of-the-line nuclear submarine Kazan is about to dock in the port of Havana together with the Korshakov missile launcher frigate.\nThe group is composed of two Russian Navy crown jewels: the nuclear-powered Yasen-class cruise missile submarine Kazan and the Russian missile frigate Admiral Gorshkov.\nThe ships have been conducting exercises “on the use of precision missile weapons in the Atlantic Ocean” on their way to Cuba, Commander-in-Chief of the Russian Navy Admiral Alexander Moiseyev said.\nWhite House spokesman John Kirby said earlier that the US was monitoring the situation surrounding the visit of Russian Navy ships to Cuba but \"did not see it as a threat to its national security\".\nShark hunting near MiamiThe US Navy has been following the wake of the nuclear submarine with the P-8 Poseidon “submarine hunter” plane."}, {"id": "510e4bb1-6b76-4ede-be75-805e2a694218", "title": "Media : Large - Scale Fires Break Out In Crimea Following Storm Shadow Attack", "date": "2024-06-12 13:45", "url": "https://charter97.org/en/news/2024/6/12/598632/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Media: Large-Scale Fires Break Out In Crimea Following Storm Shadow Attack 2 12.06.2024, 10:458,102New details of the morning explosions.\nA missile hazard was declared in the temporarily occupied Crimea at night.\nThis was reported on June 12 in the Russian Telegram channel “ChP / Crimea”.\nThe content authors noted that the hazard is related to possible launches of Storm Shadow missiles towards the Crimea.\nCiting a source, journalists reported that “something happened” to an enemy S-400 air defense missile system in the Sevastopol area."}, {"id": "74045400-3ac6-4abf-9770-967c4ecc0bb0", "title": "  Go to Pakistan  jibe triggered Mangaluru stabbing incident : Police | Bangalore News", "date": "2024-06-12 13:45", "url": "https://indianexpress.com/article/cities/bangalore/go-to-pakistan-jibe-triggered-mangaluru-stabbing-incident-police-9388085/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "Provocative slogans asking Muslims to “go to Pakistan” during a victory procession taken out to celebrate the BJP returning to power at the Centre sparked the stabbing of two BJP supporters near Mangaluru on Sunday, the police said.\nAddressing a news conference on Tuesday, Mangaluru Police Commissioner Anupam Agarwal said that provocative slogans were raised during the procession near Boliyar.\n“Some youth raised provocative slogans at an auto stand, which was too hurtful.\nAfter the procession ended, three people went again and raised slogans which led to the stabbing incident, Agarwal said.\nHowever, three people went back on a bike and raised slogans,” he added."}, {"id": "0433de4f-646a-45f2-8148-4e23afaff311", "title": "Israel military said its strikes killed senior Hezbollah commander on Tuesday", "date": "2024-06-12 13:15", "url": "https://www.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-06-12-24-intl/h_b5770eba5276cb505b345cbfb10c9517", "domain": "cnn.com", "domain_classification": "International", "message": "The United Nations first in-depth investigation into the October 7 attacks and ensuing conflict in Gaza has found both Israel and Hamas committed war crimes and grave violations of international law.\nThe reports, released Wednesday, cover events up to the end of 2023.\nWhat war crimes did the inquiry find?\nThe commission found that Hamas committed war crimes on October 7, the day it and other Palestinian armed groups launched a murder and kidnapping spree in southern Israel which killed more than 1,200 people and saw some 250 people taken hostage.\nThe commission found that Israel also committed war crimes, as well as crimes against humanity in the first 2.5 months of the conflict."}, {"id": "7cf87fd3-63e4-4066-b28d-159a3cb5e7e7", "title": "Russian vessels conduct missile drills in Atlantic on way to Cuba", "date": "2024-06-12 06:45", "url": "https://www.aljazeera.com/news/2024/6/12/russian-warships-conduct-missile-drills-in-atlantic-on-way-to-cuba", "domain": "aljazeera.com", "domain_classification": "International", "message": "A Russian naval frigate and a nuclear-powered submarine have conducted missile drills in the Atlantic Ocean while on their way to Cuba, the Russian Ministry of Defence has said.\nThe Admiral Gorshkov also conducted training in recent days to repel an air attack, the ministry said.\nThey are part of a group of four Russian vessels due to arrive in Cuba on Wednesday.\nCuba, Russia strong bilateral relationsThe Admiral Gorshkov is armed with new Zircon hypersonic missiles.\nThe Cuban Foreign Ministry said the Russian warships will be in Havana between Wednesday and June 17."}, {"id": "f87041d5-54ab-4ae7-9711-002eeacaf8f7", "title": "  Im bleeding , Ive been stabbed : U . S . college instructor recounts attack in China", "date": "2024-06-12 12:15", "url": "https://www.aol.com/m-bleeding-ve-stabbed-u-091344126.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "HONG KONG — An American college instructor has given the first personal account of a stabbing attack in China that injured him and several others.\nI didn’t immediately realize that that was what was happening, I thought that my co-workers had been pushed,” Zabner told Iowa Public Radio from a hospital in Jilin.\n“Then I looked down at my shoulder and realized, ‘I’m bleeding, I’ve been stabbed.’”David Zabner, Cornell College Iowa alum injured in a stabbing incident in Jilin, China.\nZabner, a graduate student at Tufts University who is an alumnus of Cornell College, had previously participated in the program in November 2019, when he taught computer science courses.\nChinese Foreign Ministry spokesperson Lin Jian said Tuesday that the stabbing attack would not affect the normal conduct of U.S.-China cultural exchanges."}, {"id": "2ae4e471-bdd9-4dce-a636-8a2a659fdfd6", "title": "Ukrainian Armed Forces Destroy Command Post Of Army Advancing On Kharkiv With First Strike Of Western Missiles On Russia Territory - Belarusian News", "date": "2024-06-12 13:45", "url": "https://charter97.org/en/news/2024/6/12/598651/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Ukrainian Armed Forces Destroy Command Post Of Army Advancing On Kharkiv With First Strike Of Western Missiles On Russia’s Territory 7 12.06.2024, 12:0523,776It was located in the Belgorod region.\nIn the Belgorod region, the recreation center “Nezhegol”, which the Russian army used as a command post, was destroyed as a result of the strike of the Armed Forces of Ukraine.\nThe Ukrainian Armed Forces struck it on the morning of June 9, presumably using HIMARS multiple launch rocket systems.\nThe channel's sources noted that “Nezhegol” was on the Ukrainian Armed Forces' “target lists”, which intelligence warned the 6th Army command about at least a week before the attack, but no countermeasures were taken.\nA photo of the destroyed recreation center was published by the Belgorod Telegram channel “Pepel”."}, {"id": "101aa1b5-b46f-424b-98e2-8234c1c7b763", "title": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.bowenislandundercurrent.com/world-news/dutch-court-convicts-3-men-of-murder-in-fatal-shooting-of-investigative-reporter-in-2021-9071498", "domain": "bowenislandundercurrent.com", "domain_classification": "Unknown", "message": "AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nAMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "0718fba5-0b96-46c4-82df-3d451e75db1d", "title": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021", "date": "2024-06-12 13:15", "url": "https://www.richmond-news.com/world-news/dutch-court-convicts-3-men-of-murder-in-fatal-shooting-of-investigative-reporter-in-2021-9071498", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nAMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "71adc393-bdef-4b53-b12c-9255d364dd01", "title": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021", "date": "2024-06-12 14:15", "url": "https://www.coastreporter.net/world-news/dutch-court-convicts-3-men-of-murder-in-fatal-shooting-of-investigative-reporter-in-2021-9071498", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nAMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "adb4a6fe-a832-4afe-9a62-bf3bae67828c", "title": "Dutch court convicts 3 men of murder in fatal shooting of investigative reporter in 2021", "date": "2024-06-12 14:30", "url": "https://www.burnabynow.com/world-news/dutch-court-convicts-3-men-of-murder-in-fatal-shooting-of-investigative-reporter-in-2021-9071498", "domain": "burnabynow.com", "domain_classification": "Unknown", "message": "AMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nAMSTERDAM (AP) — A Dutch court on Wednesday convicted three men of murder for their roles in the fatal 2021 shooting of investigative reporter Peter R. de Vries, a brazen attack in downtown Amsterdam that sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organizer of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "c48d1fde-5adf-453d-86fa-20866e24ce4d", "title": "160 rockets fired at northern Israel : Israeli Army", "date": "2024-06-12 12:15", "url": "https://morungexpress.com/160-rockets-fired-at-northern-israel-israeli-army", "domain": "morungexpress.com", "domain_classification": "Unknown", "message": "Jerusalem, June 12 (IANS): About 160 rockets were fired from Lebanon at northern Israel on Wednesday morning, said the Israeli army, after Israeli airstrikes killed four Hezbollah officials, including a senior commander.\nThe National Fire and Rescue Authority said that the rockets caused fires in several areas, reports Xinhua news agency.\nLater in the morning, a barrage of some 70 rockets was fired toward Western Galilee and Mount Meron in Upper Galilee region, where a key aerial defense control unit is located.\nIn response to the latest barrage, Israeli aircraft struck the launcher in the area of Yaroun.\nThe Upper Galilee Regional Council called on residents to reduce outdoor activities to essential ones only, citing fear of additional barrages."}, {"id": "4773b206-4d7e-42af-88e4-74c3bc53de90", "title": "19 - year - old killed in  explosion of gunfire  during Las Vegas marijuana transaction", "date": "2024-06-12 02:45", "url": "https://www.yahoo.com/news/19-old-killed-explosion-gunfire-005157243.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "LAS VEGAS (KLAS) — Four people shot and killed a 19-year-old in “an explosion of gunfire” during a marijuana transaction, prosecutors said.\nA Clark County grand jury later indicted Smith on charges including open murder and conspiracy murder.\nSmith and three others allegedly conspired to rob Foreman during a marijuana transaction.\nAfter meeting outside of the east valley apartment complex, the meeting turned into “an explosion of gunfire,” prosecutors said.\nFour people shot and killed a 19-year-old in “an explosion of gunfire” during a marijuana transaction, prosecutors said."}, {"id": "a2c09127-8b74-47e1-bf27-ed35eab5fd3f", "title": "J & K BJP Leader Stages Solitary Hunger Strike", "date": "2024-06-12 05:45", "url": "https://menafn.com/1108322573/J-K-BJP-Leader-Stages-Solitary-Hunger-Strike", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Senior BJP leader Khalid Jahangir staged a hunger strike on a road near the party's Church Lane office here, accusing Pakistan of causing the violence in J&K.\nJahangir, who ran unsuccessfully in the 2014 Assembly elections, claimed that by launching such heinous assaults, the neighboring country seeks to stifle the UT's economy.\n“I vehemently condemn the terrorist attack on innocent pilgrims in Reasi.\nIn actuality, the neighboring nation, which opposes J&K's economic growth, is the one behind these instances,” the BJP leader told the media.\n“It's not about politics; rather, it's about J&K's future, which is being severely jeopardised by the neighboring country and its proxies."}, {"id": "c89fd058-1144-4062-9936-a5d16a3de934", "title": "Iran seeks de - escalation on Israel - Lebanon border", "date": "2024-06-12 02:45", "url": "http://usa.chinadaily.com.cn/a/202406/11/WS666848e8a31082fc043cbed2.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Smoke rises above Lebanon, following an Israeli strike, as seen from Israel's border with Lebanon in northern Israel, May 5, 2024.\nIsraeli military have said they are ready for cross-border attacks while Lebanon resistance forces said they will counter possible Israeli offensives, according to local media.\nThat's why, for the various reasons, Iran doesn't want to see an expansion of the conflict and war to Lebanon,\" he added.\nLebanese armed group Hezbollah said on June 10 that it shot down an Israeli drone over southern Lebanon.\nAll-out war with Hezbollah would draw Iran into the conflict, then who knows which Arab countries might want to side with them.\""}, {"id": "df86a3cf-235c-4bde-9e05-5e4ce20f4a5b", "title": "Iran seeks de - escalation on Israel - Lebanon border", "date": "2024-06-12 01:30", "url": "http://europe.chinadaily.com.cn/a/202406/11/WS666848e8a31082fc043cbed2.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Smoke rises above Lebanon, following an Israeli strike, as seen from Israel's border with Lebanon in northern Israel, May 5, 2024.\nIsraeli military have said they are ready for cross-border attacks while Lebanon resistance forces said they will counter possible Israeli offensives, according to local media.\nThat's why, for the various reasons, Iran doesn't want to see an expansion of the conflict and war to Lebanon,\" he added.\nLebanese armed group Hezbollah said on June 10 that it shot down an Israeli drone over southern Lebanon.\nAll-out war with Hezbollah would draw Iran into the conflict, then who knows which Arab countries might want to side with them.\""}, {"id": "357de105-0935-447a-bb8c-275c4f63c7ec", "title": "Iran seeks de - escalation on Israel - Lebanon border", "date": "2024-06-12 01:30", "url": "http://africa.chinadaily.com.cn/a/202406/11/WS666848e8a31082fc043cbed2.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Smoke rises above Lebanon, following an Israeli strike, as seen from Israel's border with Lebanon in northern Israel, May 5, 2024.\nIsraeli military have said they are ready for cross-border attacks while Lebanon resistance forces said they will counter possible Israeli offensives, according to local media.\nThat's why, for the various reasons, Iran doesn't want to see an expansion of the conflict and war to Lebanon,\" he added.\nLebanese armed group Hezbollah said on June 10 that it shot down an Israeli drone over southern Lebanon.\nAll-out war with Hezbollah would draw Iran into the conflict, then who knows which Arab countries might want to side with them.\""}, {"id": "8dabcb71-be04-4a33-aceb-c933afc8bd4a", "title": "Iran seeks de - escalation on Israel - Lebanon border", "date": "2024-06-12 00:30", "url": "https://global.chinadaily.com.cn/a/202406/11/WS666848e8a31082fc043cbed2.html", "domain": "global.chinadaily.com.cn", "domain_classification": "Unknown", "message": "[Photo/Agencies]As tensions rise on the Israel-Lebanon border, Iran hopes the situation can be de-escalated and there is no new full-blown war in the region, with Israel urged not to launch any actions that infringe on Lebanon's territorial integrity.\nIsraeli military have said they are ready for cross-border attacks while Lebanon resistance forces said they will counter possible Israeli offensives, according to local media.\nThat's why, for the various reasons, Iran doesn't want to see an expansion of the conflict and war to Lebanon,\" he added.\nLebanese armed group Hezbollah said on June 10 that it shot down an Israeli drone over southern Lebanon.\nAll-out war with Hezbollah would draw Iran into the conflict, then who knows which Arab countries might want to side with them.\""}, {"id": "6c4184a8-b979-4ed9-b1a3-a80dc7edfbd0", "title": "Russia launches missile and drone attack on Kyiv , Ukraine military says", "date": "2024-06-12 05:00", "url": "https://www.channelnewsasia.com/world/russia-launches-missile-and-drone-attack-kyiv-ukraines-military-says-4404231", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "KYIV: Russia launched a missile and drone attack on Kyiv early on Wednesday (Jun 12) with preliminary information showing there were no injuries or damage in the Ukrainian capital, Ukrainian military said.\nUkraine's air defence systems destroyed all air weapons on their approach to the city, Serhiy Popko, head of Kyiv's military administration said on the Telegram messaging app.\nHe added that according to preliminary information, Russia used a combination of cruise and ballistic missiles as well as drones in its attack.\nIt was not immediately known whether there was any damage in the Kyiv region, which surrounds the capital and which is a separate administrative entity.\nThat is often the case when Russia launches an air attack on Ukraine's western regions."}, {"id": "46283672-c19b-4fe2-ad07-464834731e10", "title": "Russia launches missile and drone attack on Kyiv , Ukraine military says", "date": "2024-06-12 03:45", "url": "https://www.theglobeandmail.com/world/article-russia-launches-missile-and-drone-attack-on-kyiv-ukraines-military/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Russia launched a missile and drone attack on Kyiv early on Wednesday with preliminary information showing there were no injuries or damage in the Ukrainian capital, Ukrainian military said.\nUkraine’s air defence systems destroyed all air weapons on their approach to the city, Serhiy Popko, head of Kyiv’s military administration said on the Telegram messaging app.\nHe added that according to preliminary information, Russia used a combination of cruise and ballistic missiles as well as drones in its attack.\nReuters could not independently verify what weapons were used, but Reuters witnesses said that several blasts that sounded like air defence systems at work were heard in and around Kyiv.\nThat is often the case when Russia launches an air attack on Ukraine’s western regions."}, {"id": "2a85b469-8be3-49f5-8e6e-08289e5e46ea", "title": "Russia launches missile and drone attack on Kyiv , Ukraine military says", "date": "2024-06-12 03:30", "url": "https://www.thestar.com.my/news/world/2024/06/12/russia-launches-missile-and-drone-attack-on-kyiv-ukraine039s-military-says", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "KYIV (Reuters) -Russia launched missile and drone attacks on Ukraine early on Wednesday, causing a fire at an industrial facility, damaging residences and injuring several people across six regions, local authorities said.\nUkraine's air defence systems destroyed all air weapons on their approach to the capital, Serhiy Popko, head of Kyiv city military administration said on the Telegram messaging app.\nThe debris damaged an industrial facility in the Kyiv region, causing a fire, Kyiv region governor said.\nDnipropetrovsk governor said the attack injured three people and damaged nine private residences, reporting that Ukrainian military shot down 11 drones over his region.\nThat is often the case when Russia launches an air attack on Ukraine's western regions."}, {"id": "4aee4679-1b9f-49b1-80d3-eb287654379f", "title": "Three FC men injured in IED attack near Kuchlak - Newspaper", "date": "2024-06-12 04:15", "url": "https://www.dawn.com/news/1839332/three-fc-men-injured-in-ied-attack-near-kuchlak", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "QUETTA: Three Frontier Corps personnel have been injured in an IED attack near Kuchlak at the Quetta-Chaman Highway late on Tuesday night.\nAccording to officials, the IED exploded close to the personnel’s vehicle, which was damaged as a result of the powerful blast.\nThe window panes of a nearby building were smashed due to the explosion’s intensity.\nPolice and FC personnel shifted the injured soldiers to Quetta’s Combined Military Hospital.\n“It seems like a remote control IED blast,” a senior police officer posted in Kuchlak told Dawn."}, {"id": "f2301cf3-b6fd-43ff-a528-f41c73eb09e6", "title": "Can China Turn Its Property Glut Into Affordable Housing ? ", "date": "2024-06-12 02:45", "url": "https://foreignpolicy.com/2024/06/11/china-property-crisis-affordable-housing-plan/?tpcc=recirc_trending062921", "domain": "foreignpolicy.com", "domain_classification": "Unknown", "message": "China currently has 3.6 billion square feet—or roughly 5.5 million homes—of unsold housing inventory due to the collapse of its property bubble.\nNationwide, that could raise the percentage of affordable housing from just 5 percent of China’s stock to 30 percent.\nUnfortunately, affordable housing projects in China do not have a good record.\nEven when affordable housing was built, it was often distributed to the well-connected rather than the needy, including officials and their families.\nAnother common dodge was for developers to get the money and permits to build affordable housing and then switch most of it to conventional commercial use upon launch, only retaining a small number of affordable residential units."}, {"id": "3ea221da-560f-4344-858c-96c9ec07d61d", "title": "Military intelligence confirms 2 Russian Su - 57 aircraft hit in recent strike", "date": "2024-06-12 14:30", "url": "https://www.yahoo.com/news/military-intelligence-confirms-2-russian-124915505.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine's military intelligence (HUR) can confirm that two of the Russian Su-57 fighter jets were hit during a strike on the Akhtubinsk airfield in Astrakhan Oblast, but one of them suffered only light damage, the agency's spokesperson, Andrii Yusov, said on air on June 12.\n\"We can now say that one Su-57 suffered significant damage, and the other one suffered lighter damage and may be possible to restore,\" Yusov said.\nThe military intelligence agency reported on the attack on June 9, marking the first hit against this model of aircraft.\nThe Su-57 is Russia's most modern fighter jet, with only a few units in service in the Russian Air Force.\nMilitary intelligence does not usually claim public responsibility for attacks on Russian territory, but sources told the Kyiv Independent that Ukraine has carried out a number of long-range strikes against military and industrial targets deep inside the Russian borders."}, {"id": "70181a23-db82-408b-b799-7df1ba811682", "title": "Campus Reform the # 1 Source for College News", "date": "2024-06-12 12:15", "url": "https://www.campusreform.org/article/no-strike-you-california-judge-tells-grad-student-employees-get-back-work-citing-damage-students/25633", "domain": "campusreform.org", "domain_classification": "Unknown", "message": "Orange County Superior Court Judge Randall J. Sherman made the ruling on Friday in response to a lawsuit from the University of California, which alleges the union violated “no strike” contract clauses.\nMelissa Matella, UC associate vice president for systemwide labor relations, said in a statement that the university is pleased with the decision.\nThe strike would have caused irreversible setbacks to students’ academic achievements and may have stalled critical research projects in the final quarter,” Matella said.\nUnion President Rafael Jaime told the outlet they are “ready for a long fight.”“UC academic workers are facing down an attack on our whole movement,” Jaime said.\n“PERB, the regulatory body with the expertise to rule on labor law, has twice found no grounds to halt our strike."}, {"id": "c288fc7e-b198-4ef1-a492-cc7380bc14a8", "title": "Hezbollah Fires Scores of Rockets at Northern Israel as Gaza Cease - fire Talks Hang in the Balance", "date": "2024-06-12 10:30", "url": "https://www.newsmax.com/world/globaltalk/israel-palestinians-hamas-war-news-06-12-2024/2024/06/12/id/1168405/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "On the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.\nBiden says it is an Israeli proposal, but Prime Minister Benjamin Netanyahu has sent conflicting signals, saying Israel remains committed to destroying Hamas.\nIt's unclear how it would do that if the U.S.-backed proposal, which includes an Israeli withdrawal from Gaza, is fully implemented.\nHamas spokesman Jihad Taha said the response included “amendments that confirm the cease-fire, withdrawal, reconstruction and (prisoner) exchange.” Taha did not elaborate.\nOver 100 hostages were released during a weeklong cease-fire last year in exchange for Palestinians imprisoned by Israel."}, {"id": "8de1c235-30a3-40a9-bcc6-0aeb6d60dd46", "title": "Ludhiana Police Commissionerate : Man Arrested with Illegal Pistol for Self - Defence | Ludhiana News", "date": "2024-06-12 04:45", "url": "https://timesofindia.indiatimes.com/city/ludhiana/man-arrested-with-illegal-pistol-for-self-defence/articleshow/110923675.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "It determines properties like the mass of particles and the strength of forces like the electromagnetic force and gravity.\n70-year-old man stabbed in 'revenge' in Delhi, accused heldA 42-year-old man, Amit, was arrested for stabbing a 70-year-old in Shastri Nagar, north Delhi.\nThe attack was in revenge for mistreatment of his female friend, a maid at the victim's home.\nLudhiana: The anti-narcotics cell of Ludhiana police commissionerate arrested a man with illegal weapons .Jaswinder Singh alias Jassi, a driver from Sangowal village, was arrested with a .32-bore country-made pistol and four bullets in Geetika Valley, after a tip-off.ASI Raj Kumar, investigating officer, said the accused is already facing trial in five cases, including two of attempt to murder.\nThe accused, during interrogation, revealed that he bought the pistol for self-defence because of rivalry."}, {"id": "bb1803cd-55f4-4959-8d35-b48f2b60a5ee", "title": "Media : Explosions reported across occupied Crimea , Krasnodar Krai", "date": "2024-06-12 04:15", "url": "https://www.yahoo.com/news/media-explosions-reported-across-occupied-023803519.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Explosions were heard in missile attacks in multiple cities across occupied Crimea, as well as in a community in Russia's Krasnodar Krai overnight on June 12, the Telegram channel Crimean Wind reported.\nA small number of explosions was also heard in the community of Armyanskii in Russia's Krasnodar Krai around 4 a.m. local time, according to Crimean Wind.\nAccording to Crimean Wind, unconfirmed reports suggest that an S-400 air defense system may have been damaged as a result of the attack.\nUkraine's General Staff confirmed on June 10 that Armed Forces attacked Russian S-400 and S-300 anti-aircraft missile systems in several areas in occupied Crimea overnight.\nRead also: Russia has seized almost $24 million in Ukrainian assets from occupied Crimea since 2022, proxy leader saysWe’ve been working hard to bring you independent, locally-sourced news from Ukraine."}, {"id": "fe3f7887-f442-4401-b311-0c033b4e20ce", "title": "BJP accuses Ktaka govt of Taliban - style administration : LoP", "date": "2024-06-12 09:00", "url": "https://www.udayavani.com/english-news/bjp-accuses-ktaka-govt-of-taliban-style-administrationl-lop", "domain": "udayavani.com", "domain_classification": "Unknown", "message": "BJP accuses K’taka govt of Taliban-style administration: LoPA A ATeam Udayavani, Jun 12, 2024, 2:01 PM ISTMangaluru: The Congress government in Karnataka is running a Taliban-style administration, alleged a Leader of Opposision R Ashoka at a recent press conference.\nHe highlighted a specific incident in Boliyar, where BJP workers chanting “Bharat Mata Ki Jai” were allegedly attacked in a pre-planned act.\nThe BJP plans to hold a meeting tomorrow in Bengaluru under the leadership of the state president to discuss their strategy.\nHe assured BJP workers that the party stands firmly with them and will provide assistance as needed.\nCriticizing the Congress government’s performance over the past year, he stated, “The achievement of the state Congress in the last one year is zero."}, {"id": "48cc676d-f067-4c02-b8e5-1b564dfe0c5e", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.irishexaminer.com/world/arid-41414701.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "A Dutch court has convicted three men of murder for their roles in the fatal shooting of investigative reporter Peter R de Vries.\nThe brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car."}, {"id": "a942fb32-c42f-4516-a507-fff5ec5c62a0", "title": "Hezbollah fires scores of rockets at northern Israel as Gaza cease - fire talks hang in the balance", "date": "2024-06-12 14:00", "url": "https://www.stltoday.com/news/nation-world/hezbollah-fires-scores-of-rockets-at-northern-israel-as-gaza-cease-fire-talks-hang-in/article_f7c2570e-2899-11ef-8bff-23816dc0244d.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "On the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.\nBiden says it is an Israeli proposal, but Prime Minister Benjamin Netanyahu has sent conflicting signals, saying Israel remains committed to destroying Hamas.\nIt’s unclear how it would do that if the U.S.-backed proposal, which includes an Israeli withdrawal from Gaza, is fully implemented.\nHamas spokesman Jihad Taha said the response included “amendments that confirm the cease-fire, withdrawal, reconstruction and (prisoner) exchange.” Taha did not elaborate.\nOver 100 hostages were released during a weeklong cease-fire last year in exchange for Palestinians imprisoned by Israel."}, {"id": "f9f2ab9f-470f-472d-88c9-009e95b857bc", "title": "  The Cranes Call  Review : Tribeca Hunt for Russian War Criminals", "date": "2024-06-12 02:30", "url": "https://www.thewrap.com/the-cranes-call-review-russia-war-criminals-documentary/", "domain": "thewrap.com", "domain_classification": "Unknown", "message": "If you walked into a theater showing Laura Warner’s “The Cranes Call” by accident, two things would happen.\n“The Cranes Call” is the latest documentary about the ongoing, horrifying Russian invasion of Ukraine.\nIt follows Anya Neistat, a human rights activist working for the Clooney Foundation for Justice, run by Amal Clooney and her husband George.\nWhether that day will come, Neistat and Stasiv do not know.\nThe visual approach vaunts Neistat and Stasiv a little, but given their chosen profession and nearly impossible tasks, that’s understandable."}, {"id": "1a77c6c0-d8f9-4704-81e6-be96826a7349", "title": "5 soldiers , police officer hurt in third terror attack in Jammu in 3 days", "date": "2024-06-12 04:45", "url": "https://www.moneycontrol.com/news/india/5-soldiers-police-officer-hurt-in-third-terror-attack-in-jammu-in-3-days-12746393.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "c3425704-19ad-4ed1-9850-97167a8d3e8e", "title": "Doda Terror Attack : 5 soldiers , police officer hurt in third terror attack in Jammu in 3 days", "date": "2024-06-12 06:00", "url": "https://www.moneycontrol.com/news/india/doda-terror-attack-5-soldiers-police-officer-hurt-in-third-terror-attack-in-jammu-in-3-days-12746393.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "ee98deb9-7ca2-4e4d-a39d-9baa4e8b667b", "title": "Hezbollah fires rockets into northern Israel as Blinken pushes for Gaza cease - fire deal", "date": "2024-06-12 14:30", "url": "https://wjla.com/news/nation-world/lebanon-hezbollah-fires-rockets-into-northern-israel-as-secretary-of-state-antony-blinken-pushes-for-gaza-cease-fire-deal-iran-backed-ally-hamas-retaliation-killing-taleb-sami-abdullah-iraq-syria-houthi-rebels-yemen", "domain": "wjla.com", "domain_classification": "Unknown", "message": "On the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.\nBiden says it is an Israeli proposal, but Prime Minister Benjamin Netanyahu has sent conflicting signals, saying Israel remains committed to destroying Hamas.\nIt's unclear how it would do that if the U.S.-backed proposal, which includes an Israeli withdrawal from Gaza, is fully implemented.\nOver 100 hostages were released during a weeklong cease-fire last year in exchange for Palestinians imprisoned by Israel.\nBut Netanyahu is also under mounting pressure to accept a deal to bring the hostages back."}, {"id": "85af3f09-db81-4a4d-a0c1-45b2ddc0fe73", "title": "Hezbollah fires rockets into northern Israel as Blinken pushes for Gaza cease - fire deal", "date": "2024-06-12 14:00", "url": "https://wlos.com/news/nation-world/lebanon-hezbollah-fires-rockets-into-northern-israel-as-secretary-of-state-antony-blinken-pushes-for-gaza-cease-fire-deal-iran-backed-ally-hamas-retaliation-killing-taleb-sami-abdullah-iraq-syria-houthi-rebels-yemen", "domain": "wlos.com", "domain_classification": "Unknown", "message": "On the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.\nBiden says it is an Israeli proposal, but Prime Minister Benjamin Netanyahu has sent conflicting signals, saying Israel remains committed to destroying Hamas.\nIt's unclear how it would do that if the U.S.-backed proposal, which includes an Israeli withdrawal from Gaza, is fully implemented.\nOver 100 hostages were released during a weeklong cease-fire last year in exchange for Palestinians imprisoned by Israel.\nBut Netanyahu is also under mounting pressure to accept a deal to bring the hostages back."}, {"id": "471c98cd-37f6-4fef-812b-21df8b732742", "title": "Convicted killer Paul Flores moved to another prison over safety concerns", "date": "2024-06-12 03:45", "url": "https://www.ksby.com/news/kristin-smart-case/convicted-killer-paul-flores-moved-to-another-prison-for-his-safety", "domain": "ksby.com", "domain_classification": "Unknown", "message": "Kristin Smart's killer, Paul Flores, has been moved to a new prison for safety reasons.\nThe move comes after Flores was attacked twice at Pleasant Valley State Prison in Coalinga.\nIn April of this year, prison staff reportedly witnessed another inmate stabbing Flores in the recreation yard.\nAccording to his attorney, Harold Mesick, Flores was moved to Corcoran State Prison on June 6.\nFlores was initially placed at Pleasant Valley State Prison last August to begin serving his 25 years-to-life sentence for Smart's murder."}, {"id": "29e611b0-ff66-4c48-98c3-68ccf98d6138", "title": "Chicago crime : South Loop man Ivan Weldon charged in 3 CTA Green Line attacks", "date": "2024-06-12 04:30", "url": "https://abc7chicago.com/post/chicago-crime-south-loop-man-ivan-weldon-charged/14937930/", "domain": "abc7chicago.com", "domain_classification": "Unknown", "message": "South Loop man charged in 3 CTA Green Line attacksCHICAGO -- A South Loop man remains jailed on attempted murder and battery charges in connection with several attacks on CTA passengers.\nIvan Weldon, 42, is accused of using a box cutter to slice a 48-year-old man's neck and stabbing him multiple times May 31 on a Green Line train near the Garfield station, 320 E. Garfield Boulevard.\nWeldon faces three felony charges in connection with that attack: attempted murder, aggravated battery in a public place and aggravated battery causing great bodily harm.\nOn the same day, Weldon allegedly attacked two more passengers at the CTA Green Line Bronzeville stop, 16 E. 35th St.\nTwo felony counts each of aggravated battery in a public place and aggravated battery were filed in those attacks."}, {"id": "881a92e1-c1f5-47d8-840f-de9e2584ab2c", "title": "Man who led SLO County police on chase during 2023 crime spree sentenced", "date": "2024-06-12 03:45", "url": "https://www.ksby.com/news/local-news/man-who-led-san-luis-obispo-co-law-enforcement-on-chase-during-2023-crime-spree-sentenced", "domain": "ksby.com", "domain_classification": "Unknown", "message": "San Luis Obispo County District Attorney Dan Dow announced Tuesday the sentencing of a Visalia man who led county law enforcement on a chase during a 2023 crime spree.\nJoshua Lee Arnold was sentenced to serve 26 years plus 28 years to life in prison for attempted murder and assault with a handgun during a crime spree.\nIt happened on August 17, 2023, when at approximately 1:00 pm, Arnold attempted to rob a clerk at a 7-Eleven in Grover Beach.\nMultiple agencies assisted in the investigation, including the Grover Beach Police Department, the San Luis Obispo County Sheriff’s Office, the San Luis Obispo Police Department, and the San Luis Obispo County District Attorney’s Office Bureau of Investigation.\nOn April 9, 2024, Arnold pleaded no contest to three counts of attempted murder with deliberation and premeditation, and two counts of assault with a semiautomatic firearm."}, {"id": "2ee65af0-d01c-4859-ba67-e8fdd5f861da", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.gazetteherald.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "gazetteherald.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car."}, {"id": "a8a668bd-849f-4111-b108-1e155078d12a", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.surreycomet.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "surreycomet.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car."}, {"id": "4a246c77-f711-4c1c-89a0-488173ebc79c", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.bordertelegraph.com/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "bordertelegraph.com", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car."}, {"id": "d9eaecb1-6168-4c2b-93fe-1e1cd40ff9c0", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.somersetcountygazette.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "somersetcountygazette.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car."}, {"id": "c914da55-9a0b-48ee-9ab0-85878063151b", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.gazetteseries.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "gazetteseries.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car."}, {"id": "784f653c-06a0-4428-b5f8-5dd6ed575004", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.tivysideadvertiser.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "tivysideadvertiser.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car."}, {"id": "9b5009bf-d73b-485d-8085-6689a1b49e38", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.newsandstar.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "newsandstar.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car."}, {"id": "f07a921a-3273-415e-a34e-15611db61da3", "title": "Three men convicted of murdering Dutch investigative reporter in 2021", "date": "2024-06-12 12:15", "url": "https://www.ludlowadvertiser.co.uk/news/national/24382549.three-men-convicted-murdering-dutch-investigative-reporter-2021/", "domain": "ludlowadvertiser.co.uk", "domain_classification": "Unknown", "message": "The brazen attack in Amsterdam in 2021 sent a shockwave through the Netherlands.\nThe shooter, getaway driver and organiser of the hit were convicted of direct involvement in the killing.\nA total of nine men were charged for their alleged roles in the murder.\nTaghi has not been charged with involvement in the assassination of Mr de Vries and prosecutors have not charged any suspects with ordering his death.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot Mr de Vries was found in their car."}, {"id": "d992193a-42cd-43b1-b948-650a0cec299f", "title": "Russian military exercises in the Caribbean : Here what to expect", "date": "2024-06-12 02:30", "url": "https://www.cbsnews.com/news/russia-cuba-ships-military-exercises-caribbean-what-to-expect/?intcid=CNR-02-0623", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "What to expect from Russian military exercises in CaribbeanThree Russian ships arrived in Cuban waters Wednesday ahead of military exercises in the Caribbean.\nAccording to the Cuban Foreign Ministry, the three Russian ships are a frigate, a fleet oil tanker and a salvage tug.\nThe Russian frigate Admiral Gorshkov, part of the Russian naval detachment visiting Cuba, arrives at Havana's harbor, June 12, 2024.\nAnother destroyer and a U.S. Coast Guard cutter are shadowing the three Russian ships.\nThe Russian nuclear-powered submarine Kazan and the frigate Admiral Gorshkov, part of the Russian naval detachment visiting Cuba, arrive at Havana's harbor, June 12, 2024."}, {"id": "780f75f8-012c-48e3-b360-2d543002a796", "title": "Hezbollah fires rockets into northern Israel as Blinken pushes for Gaza cease - fire deal", "date": "2024-06-12 13:45", "url": "https://wwmt.com/news/nation-world/lebanon-hezbollah-fires-rockets-into-northern-israel-as-secretary-of-state-antony-blinken-pushes-for-gaza-cease-fire-deal-iran-backed-ally-hamas-retaliation-killing-taleb-sami-abdullah-iraq-syria-houthi-rebels-yemen", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "On the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.\nBiden says it is an Israeli proposal, but Prime Minister Benjamin Netanyahu has sent conflicting signals, saying Israel remains committed to destroying Hamas.\nIt's unclear how it would do that if the U.S.-backed proposal, which includes an Israeli withdrawal from Gaza, is fully implemented.\nOver 100 hostages were released during a weeklong cease-fire last year in exchange for Palestinians imprisoned by Israel.\nBut Netanyahu is also under mounting pressure to accept a deal to bring the hostages back."}, {"id": "55c4638e-b3d8-4472-abfe-922b4b852d32", "title": "Hezbollah fires rockets into northern Israel as Blinken pushes for Gaza cease - fire deal", "date": "2024-06-12 13:00", "url": "https://katv.com/news/nation-world/lebanon-hezbollah-fires-rockets-into-northern-israel-as-secretary-of-state-antony-blinken-pushes-for-gaza-cease-fire-deal-iran-backed-ally-hamas-retaliation-killing-taleb-sami-abdullah-iraq-syria-houthi-rebels-yemen", "domain": "katv.com", "domain_classification": "Unknown", "message": "On the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.\nBiden says it is an Israeli proposal, but Prime Minister Benjamin Netanyahu has sent conflicting signals, saying Israel remains committed to destroying Hamas.\nIt's unclear how it would do that if the U.S.-backed proposal, which includes an Israeli withdrawal from Gaza, is fully implemented.\nOver 100 hostages were released during a weeklong cease-fire last year in exchange for Palestinians imprisoned by Israel.\nBut Netanyahu is also under mounting pressure to accept a deal to bring the hostages back."}, {"id": "4373d795-ce80-40dc-8b3d-675c1ac97d20", "title": "Charges filed in series of CTA Green Line attacks – NBC Chicago", "date": "2024-06-12 04:30", "url": "https://www.nbcchicago.com/news/local/south-loop-man-charged-in-3-cta-green-line-attacks/3461438/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "A South Loop man remains jailed on attempted murder and battery charges in connection with several attacks on CTA passengers.\nWeldon faces three felony charges in connection with that attack: attempted murder, aggravated battery in a public place and aggravated battery causing great bodily harm.\nOn the same day, Weldon allegedly attacked two more passengers at the CTA Green Line Bronzeville stop, 16 E. 35th St.\nWeldon punched another man in the face at the Bronzeville station as the man was trying to get on a train, prosecutors allege.\nTwo felony counts each of aggravated battery in a public place and aggravated battery were filed in those attacks."}, {"id": "fe8bcaa3-ec5f-4509-9f17-c9a03344b607", "title": "Hezbollah fires rockets into northern Israel as Blinken pushes for Gaza cease - fire deal", "date": "2024-06-12 12:00", "url": "https://turnto10.com/news/nation-world/lebanon-hezbollah-fires-rockets-into-northern-israel-as-secretary-of-state-antony-blinken-pushes-for-gaza-cease-fire-deal-iran-backed-ally-hamas-retaliation-killing-taleb-sami-abdullah-iraq-syria-houthi-rebels-yemen", "domain": "turnto10.com", "domain_classification": "Unknown", "message": "On the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.\nBiden says it is an Israeli proposal, but Prime Minister Benjamin Netanyahu has sent conflicting signals, saying Israel remains committed to destroying Hamas.\nIt's unclear how it would do that if the U.S.-backed proposal, which includes an Israeli withdrawal from Gaza, is fully implemented.\nOver 100 hostages were released during a weeklong cease-fire last year in exchange for Palestinians imprisoned by Israel.\nBut Netanyahu is also under mounting pressure to accept a deal to bring the hostages back."}, {"id": "b2cd647b-1528-4099-8796-abda1aac0fda", "title": "Third Terror Attack in Jammu In 48 Hours : Police And Army Joint Naka In Doda Latest Target Of Ultras", "date": "2024-06-12 02:30", "url": "https://www.timesnownews.com/india/terrorists-open-fire-at-police-and-armys-joint-naka-in-doda-3rd-incident-in-jammu-in-48-hours-article-110924101", "domain": "timesnownews.com", "domain_classification": "Unknown", "message": "The terror attack in Chattergala in J&K’s Doda district was reported within hours of a attack by the ultras at a village near the International Border (IB) in Kathua district.\nJammu: Terrorists opened fire at a police and army team in Jammu and Kashmir's Doda district on Wednesday midnight - the third terror incident in the region in a span of 48 hours.\nThe police and army team at the joint naka promptly retaliated to their fire and killed a terrorist, officials said.\nThe terror attack in Chattergala in J&K’s Doda district was reported within hours of an attack by the ultras at a village near the International Border (IB) in Kathua district.\nIt was the first major attack near the Pir Panjal range since 2003, when it witnessed a high peak of terror activities."}, {"id": "e7760b84-52a2-4059-abff-a83adc14ebde", "title": "Hezbollah fires scores of rockets at northern Israel as Gaza cease - fire talks hang in the balance", "date": "2024-06-12 13:15", "url": "https://www.newsday.com/news/nation/israel-palestinians-hamas-war-news-06-12-2024-u82370", "domain": "newsday.com", "domain_classification": "Unknown", "message": "BEIRUT — U.S. Secretary of State Antony Blinken said Wednesday that the war in Gaza would go on after Hamas proposed “numerous” changes to a U.S.-backed cease-fire plan, some that he said were “workable” and some not.\nOver 100 hostages were released during a weeklong cease-fire last year in exchange for Palestinians imprisoned by Israel.\nOn the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.\nBiden says it is an Israeli proposal, but Prime Minister Benjamin Netanyahu has sent conflicting signals, saying Israel remains committed to destroying Hamas.\nIt’s unclear how it would do that if the U.S.-backed proposal, which includes an Israeli withdrawal from Gaza, is fully implemented."}, {"id": "b0e1cf72-a56d-4af7-ac6a-043c8ae69517", "title": "US college instructor describes surviving China stabbing attack , says he didnt  realize what was happening  ", "date": "2024-06-12 14:00", "url": "https://www.yahoo.com/news/us-college-instructor-describes-surviving-113335479.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "US college instructor describes surviving China stabbing attack, says he didn't 'realize what was happening'An American college instructor who was injured in a stabbing attack at a public park in China is now opening up about surviving the assault, saying in the moment, he \"turned around to find a man brandishing a knife at me\" and that he \"didn’t immediately realize what was happening.\"\nI didn’t immediately realize what was happening.\n4 US COLLEGE INSTRUCTORS STABBED IN ATTACK AT CHINESE PUBLIC PARKPeople gather around four American educators from Iowa's Cornell College, who were reportedly stabbed in a public park in Jilin City, Jilin province, China.\n\"We are deeply concerned by the stabbing of U.S. citizens in Jilin City, China.\nOriginal article source: US college instructor describes surviving China stabbing attack, says he didn't 'realize what was happening'"}, {"id": "f4f04e00-a6a9-408b-9532-5c33e149027f", "title": "Iran Ordered to Pay $239 Million to Victims and Families of the 1983 ... ", "date": "2024-06-12 14:00", "url": "https://www.pr-inside.com/iran-ordered-to-pay-239-million-to-victims-and-families-of-the-r5017044.htm", "domain": "pr-inside.com", "domain_classification": "Unknown", "message": "In 2018, the same court ordered Iran to pay $920 million in total damages in the first case that was brought in 2014.\nv. Islamic Republic of Iran, et al., filed in 2014, DiBenedetto, et al.\nv. Islamic Republic of Iran, et al., filed in 2016; and Encinas, et al.\nv. Islamic Republic of Iran, et al., filed in 2018.\nFor more information, visit https://www.cohenmilstein.com About Karsman McKenzie & HartKarsman McKenzie & Hart is a Savannah, Georgia-based personal injury and trial law firm."}, {"id": "c5348a3b-29cd-4ce0-9932-a905951919cf", "title": "Hezbollah fires rockets into northern Israel as Blinken pushes for Gaza cease - fire deal", "date": "2024-06-12 14:00", "url": "https://news3lv.com/news/nation-world/lebanon-hezbollah-fires-rockets-into-northern-israel-as-secretary-of-state-antony-blinken-pushes-for-gaza-cease-fire-deal-iran-backed-ally-hamas-retaliation-killing-taleb-sami-abdullah-iraq-syria-houthi-rebels-yemen", "domain": "news3lv.com", "domain_classification": "Unknown", "message": "On the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.\nBiden says it is an Israeli proposal, but Prime Minister Benjamin Netanyahu has sent conflicting signals, saying Israel remains committed to destroying Hamas.\nIt's unclear how it would do that if the U.S.-backed proposal, which includes an Israeli withdrawal from Gaza, is fully implemented.\nOver 100 hostages were released during a weeklong cease-fire last year in exchange for Palestinians imprisoned by Israel.\nBut Netanyahu is also under mounting pressure to accept a deal to bring the hostages back."}, {"id": "ae29c916-8adf-4192-8d31-6a4d247d1689", "title": "Tops gunman lawyers file to exempt him from the death penalty", "date": "2024-06-12 03:45", "url": "https://www.wbfo.org/2024-06-11/tops-gunmans-lawyers-file-to-exempt-him-from-the-death-penalty", "domain": "wbfo.org", "domain_classification": "Unknown", "message": "Attorneys representing the Tops massacre gunman are trying to exempt their client from the death penalty.\nIn a separate federal case, the Department of Justice filed a notice to seek the death penalty for Gendron back in January.\nBut lawyers representing Gendron argue he should be exempt from that punishment on account of his age at the time of the alleged capital crimes.\nGendron was 18 years old at the time of the attack, and so meets the minimum legal age limit to face the death penalty when tried for capital offences in the U.S..\nTherefore - his lawyers argue - the government should be barred from seeking the death penalty in the case."}, {"id": "86afa12a-9243-4bc1-b212-ca49b5561211", "title": "Tops gunman lawyers file to exempt him from the death penalty", "date": "2024-06-12 02:45", "url": "https://www.wrvo.org/2024-06-11/tops-gunmans-lawyers-file-to-exempt-him-from-the-death-penalty", "domain": "wrvo.org", "domain_classification": "Unknown", "message": "Attorneys representing the Tops massacre gunman are trying to exempt their client from the death penalty.\nIn a separate federal case, the Department of Justice filed a notice to seek the death penalty for Gendron back in January.\nBut lawyers representing Gendron argue he should be exempt from that punishment on account of his age at the time of the alleged capital crimes.\nGendron was 18 years old at the time of the attack, and so meets the minimum legal age limit to face the death penalty when tried for capital offences in the U.S..\nTherefore - his lawyers argue - the government should be barred from seeking the death penalty in the case."}, {"id": "d5dfee52-80e3-4f6f-a58b-749a4b7a4383", "title": "Tops gunman lawyers file to exempt him from the death penalty", "date": "2024-06-12 14:00", "url": "https://www.wxxinews.org/2024-06-11/tops-gunmans-lawyers-file-to-exempt-him-from-the-death-penalty", "domain": "wxxinews.org", "domain_classification": "Unknown", "message": "Attorneys representing the Tops massacre gunman are trying to exempt their client from the death penalty.\nIn a separate federal case, the Department of Justice filed a notice to seek the death penalty for Gendron back in January.\nBut lawyers representing Gendron argue he should be exempt from that punishment on account of his age at the time of the alleged capital crimes.\nGendron was 18 years old at the time of the attack, and so meets the minimum legal age limit to face the death penalty when tried for capital offences in the U.S..\nTherefore - his lawyers argue - the government should be barred from seeking the death penalty in the case."}, {"id": "d9be1b2d-ee13-4d45-abd0-b231f6720119", "title": "Cruise ship horror as passengers spot Russian warships out their window", "date": "2024-06-12 12:15", "url": "https://www.mirror.co.uk/news/world-news/cruise-ship-horror-passengers-spot-33013816", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Holidaymakers on the cruise vessel were stunned to see six Russian ships cruising by in broad daylight off the Florida coast.\nThis alarming encounter occurred as NATO vessels are shadowing a Russian naval group believed to be heading for Cuba.\nBut Dr Stepan Stepanenko, director of Forward Strategy consultancy, has played down the Russian military threat.\n\"The reality behind these deployments, however, reveals a much less formidable picture of Russian naval power.\nThe Cuban Foreign Ministry has confirmed that the Russian warships, docked in Havana from Wednesday until June 17, are not carrying any nuclear weapons and pose no threat to the region."}, {"id": "75a33143-bd8c-45ff-b93f-e17dd541e24b", "title": "Stabbing Case : Stabbing case : One more held | Mangaluru News", "date": "2024-06-12 04:00", "url": "https://timesofindia.indiatimes.com/city/mangaluru/stabbing-case-one-more-held/articleshow/110923550.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "We also published the following articles recently2 BJP workers stabbed in DK; 5 arrestedFive persons were arrested by Mangaluru City police for allegedly stabbing two BJP workers in the Konaje police limits.\n70-year-old man stabbed in 'revenge' in Delhi, accused heldAmit arrested for stabbing 70-year-old over maid's mistreatment.\nAs part of the procession held to celebrate the swearing-in ceremony of Prime Minister Narendra Modi, the BJP workers raised provocative statements near an auto stand in Boliyar, which was also circulated on social media.\nThe police have booked cases against those who stabbed and also against those who raised provocative slogans.\nThe provocative slogans referred to Muslims as Pakistanis and hurt their sentiments,” he said.Notices have also been served to the suspects who are still absconding."}, {"id": "b2527cbe-94eb-4716-b99f-caf331dfe098", "title": "Hezbollah fires rockets into northern Israel as Blinken pushes for Gaza cease - fire deal", "date": "2024-06-12 12:15", "url": "https://fox17.com/news/nation-world/lebanon-hezbollah-fires-rockets-into-northern-israel-as-secretary-of-state-antony-blinken-pushes-for-gaza-cease-fire-deal-iran-backed-ally-hamas-retaliation-killing-taleb-sami-abdullah-iraq-syria-houthi-rebels-yemen", "domain": "fox17.com", "domain_classification": "Unknown", "message": "On the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.\nBiden says it is an Israeli proposal, but Prime Minister Benjamin Netanyahu has sent conflicting signals, saying Israel remains committed to destroying Hamas.\nIt's unclear how it would do that if the U.S.-backed proposal, which includes an Israeli withdrawal from Gaza, is fully implemented.\nOver 100 hostages were released during a weeklong cease-fire last year in exchange for Palestinians imprisoned by Israel.\nBut Netanyahu is also under mounting pressure to accept a deal to bring the hostages back."}, {"id": "f9e616dc-de66-4307-93bc-db0451d2a73a", "title": "Hezbollah fires rockets into northern Israel as Blinken pushes for Gaza cease - fire deal", "date": "2024-06-12 14:00", "url": "https://kval.com/news/nation-world/lebanon-hezbollah-fires-rockets-into-northern-israel-as-secretary-of-state-antony-blinken-pushes-for-gaza-cease-fire-deal-iran-backed-ally-hamas-retaliation-killing-taleb-sami-abdullah-iraq-syria-houthi-rebels-yemen", "domain": "kval.com", "domain_classification": "Unknown", "message": "On the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began.\nBiden says it is an Israeli proposal, but Prime Minister Benjamin Netanyahu has sent conflicting signals, saying Israel remains committed to destroying Hamas.\nIt's unclear how it would do that if the U.S.-backed proposal, which includes an Israeli withdrawal from Gaza, is fully implemented.\nOver 100 hostages were released during a weeklong cease-fire last year in exchange for Palestinians imprisoned by Israel.\nBut Netanyahu is also under mounting pressure to accept a deal to bring the hostages back."}, {"id": "afec6594-234c-46b5-98d3-2b19177ed32e", "title": "Hezbollah fires scores of rockets at northern Israel as Gaza cease - fire talks hang in the balance", "date": "2024-06-12 12:00", "url": "https://www.wsls.com/news/world/2024/06/12/hezbollah-fires-scores-of-rockets-at-northern-israel-as-gaza-cease-fire-talks-hang-in-the-balance/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "BEIRUT – U.S. Secretary of State Antony Blinken said Wednesday that mediators would keep trying to close an elusive cease-fire deal after Hamas proposed numerous changes to a U.S.-backed plan, some of which he said were “workable” and some not.\nRecommended VideosThe cease-fire proposal has global support but has not been fully embraced by Israel or Hamas.\n“Hamas has proposed numerous changes to the proposal that was on the table.\nPhase three would see the launch of a reconstruction plan for Gaza and the return of remains of deceased hostages.\nOn the Israeli side, 15 soldiers and 10 civilians have been killed since the war in Gaza began."}, {"id": "b169e5ed-b5fa-4a8c-93d7-9db24ac6511c", "title": "2024 June 12 « nuclear - news", "date": "2024-06-12 08:15", "url": "https://nuclear-news.net/2024/06/12/", "domain": "nuclear-news.net", "domain_classification": "Unknown", "message": "Five key characteristics examined June 11, 2024 by Ed Lyman, Ed Lyman is Director, Nuclear Power Safety, at the Union of Concerned Scientists Small Modular Reactors (SMRs) are being presented as the next generation of nuclear technology.\nEven casual followers of energy and climate issues have probably heard about the alleged wonders of small modular nuclear reactors (SMRs).\nNuclear power, on the other hand, faces challenges in meeting the growing power demand from data centers, Gluski said.\n……………………Gluski said the “euphoria” over nuclear power is a “little overblown.” There is only so much existing nuclear energy that merchant power providers can re-contract to sites such as data centers, the CEO said.\nCAITLIN JOHNSTONE, JUN 10, 2024 https://www.caitlinjohnst.one/p/saving-gaza-is-about-more-than-saving?utm_source=post-email-title&publication_id=82124&post_id=145499466&utm_campaign=email-post-title&isFreemail=true&r=1ise1&triedRedirect=true&utm_medium=email Saving Gaza is about more than saving Gaza."}, {"id": "25b6154a-ab5d-4dd7-a67d-274c3578ee4b", "title": "WATCH : Alleged Mountain View  don  gunned down on Windward Road", "date": "2024-06-12 00:15", "url": "https://www.jamaicaobserver.com/2024/06/11/alleged-mountain-view-don-gunned-windward-road/", "domain": "jamaicaobserver.com", "domain_classification": "Unknown", "message": "KINGSTON, Jamaica – An alleged ‘don’ was killed in a brazen afternoon shooting on Windward Road on Tuesday.\nObserver Online understands that the deceased, identified thus far by his alias, ‘Dangles, hailed from Mountain View.\nHe was reportedly gunned down in an attack carried out by armed motorcyclists.\nAccording to eyewitness, two men drove up alongside the vehicle the now-deceased was travelling and opened fire.\nThe vehicle then crashed into an embankment in the area."}, {"id": "d634c9b7-13ab-46b0-9a5d-a08ed5cbed81", "title": "Midtown brawl and shooting leads to two arrests ; victim in hospital", "date": "2024-06-12 13:45", "url": "https://www.amny.com/news/midtown-brawl-shooting-june-11-2024/", "domain": "amny.com", "domain_classification": "Unknown", "message": "Two men wound up in handcuffs while another is still sought for a Midtown shooting Tuesday night.\nSign up for our amNewYork email newsletter to get news, updates, and local insights delivered straight to your inbox!\nTwo men are in cuffs, and another individual is in the hospital, after a Midtown Manhattan dispute escalated into a shooting Tuesday night just a block away from the iconic Macy’s Herald Square store.\n“Some guy hit someone with a bike and some guy pulled out a knife — it was crazy,” local Owen Mumma-Brman said.\nDuring the escalating dispute, law enforcement sources reported, one person pulled out a gun and shot the 33-year-old victim in the left leg."}, {"id": "91e98ca6-f077-4a58-aa9c-61bf05bf3093", "title": "China arrests a man in connection to stabbing of 4 U . S . college instructors", "date": "2024-06-12 01:45", "url": "https://news.wjct.org/national-news/2024-06-11/china-arrests-a-man-in-connection-to-stabbing-of-4-u-s-college-instructors", "domain": "news.wjct.org", "domain_classification": "Unknown", "message": "Four U.S. instructors from a college in Iowa were injured in a stabbing in China, Chinese authorities said.\nPolice in the northeastern Chinese province of Jilin said on Tuesday the four victims are receiving medical care for non-life-threatening wounds and that they arrested a man in connection to the stabbing.\nThe four instructors were visiting China from Cornell College, a small private liberal arts college in Mount Vernon, Iowa, which has had an academic partnership with Beihua University in Jilin since 2018.\nOne of the stabbing victims, David Zabner, spoke to NPR member station Iowa Public Radio from a hospital about the incident.\nBut analyst say that anti-Western sentiment in China, bolstered by growing nationalism and COVID-era restrictions, has been growing in recent years."}, {"id": "9a4209a1-6e81-4165-9097-2a1ef2e05eed", "title": "Cuba : Russian ships , including a nuclear - powered submarine , to arrive in Havana", "date": "2024-06-12 13:15", "url": "https://us.cnn.com/2024/06/12/americas/russian-navy-cuba-intl/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —A group of Russian Navy ships, including a nuclear-powered submarine, arrived in Cuba on Wednesday morning in a sign of strengthening ties between the two Cold War allies.\nThe Russian nuclear-powered submarine Kazan (left) and the class frigate Admiral Gorshkov, part of the Russian naval detachment visiting Cuba, arrive at Havana's harbour, June 12, 2024.\nThe US has also deployed air assets, including a P-8 Poseidon reconnaissance plane, to circle overhead the Russian vessels.\nThe rescue and tugboat Nicolay Chiker, part of the Russian naval detachment visiting Cuba, arrives at Havana's harbour, June 12, 2024.\nAccording to a Cuban Armed Forces Ministry statement, none of the Russian ships are armed with nuclear weapons."}, {"id": "a1b64093-2bc9-47c1-9df1-c7a86a49c85e", "title": "Get Ready ! Professional Storm Chasers Are Here In Minnesota Today", "date": "2024-06-12 14:00", "url": "https://wjon.com/get-ready-professional-storm-chasers-are-here-in-minnesota-today/", "domain": "wjon.com", "domain_classification": "Unknown", "message": "With that news professional storm chasers are arriving in Minnesota, preparing to catch Mother Nature's worst.\nI could see a regionally bimodal severe weather and #tornado setup tomorrow (Wednesday) late afternoon and evening across the extreme eastern Dakotas into Minnesota and northern Iowa!\nWhile severe weather is fascinating to witness, it's also very dangerous.\nAlso, if we do get some bad weather send us your weather pics using our free app, they might be featured on our websites!\nGet our free mobile appCome Visit Paynesville, Minnesota in PicturesCome Visit South Haven, Minnesota in Pictures"}, {"id": "a2d9d7a9-d442-46f1-b03e-abc459ec1400", "title": "Vt . woman serving time for attempted murder accused of attacking cellmate", "date": "2024-06-12 01:15", "url": "https://www.wcax.com/2024/06/11/vt-woman-serving-time-attempted-murder-accused-attacking-cellmate/", "domain": "wcax.com", "domain_classification": "Unknown", "message": "SOUTH BURLINGTON, Vt. (WCAX) - A woman behind bars for attempted murder faces new charges after authorities say she attacked her cellmate.\nVermont State Police say it happened just before 5 a.m. at the Chittenden Regional Correctional Facility in South Burlington on May 29.\nThey say Veronica Lewis, 40, used a facility-issued tablet and a lock inside a sock to attack her sleeping cellmate, Yvonne Frederikson, 52.\nPolice say Frederikson was sent to the hospital with serious injuries.\nShe’s already serving time for attempted murder after shooting her firearms instructor in 2015."}, {"id": "18de439c-942a-44ef-8eb5-9ca2b47cc3e6", "title": "Exchanges wont be disrupted by isolated incident", "date": "2024-06-12 02:45", "url": "http://usa.chinadaily.com.cn/a/202406/11/WS6668740ca31082fc043cbef0.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Foreign Ministry spokesman Lin Jian.\nThe four educators are from Cornell College in the US state of Iowa and were on a teaching exchange program with Beihua University.\nLin said the isolated incident will not disrupt normal exchanges of people from China and the US.\nThe partnership between Cornell College and Beihua University began in 2018, The New York Times quoted Jan Visser, a spokeswoman for Cornell College, as saying.\nBeihua University provides funding for the college's professors to travel to and live in China, and teach computer science, mathematics and physics over a two-week period."}, {"id": "44074345-afa7-4602-a037-9c39ee0a5f0a", "title": "Exchanges wont be disrupted by isolated incident", "date": "2024-06-12 01:30", "url": "http://africa.chinadaily.com.cn/a/202406/11/WS6668740ca31082fc043cbef0.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Foreign Ministry spokesman Lin Jian.\nThe four educators are from Cornell College in the US state of Iowa and were on a teaching exchange program with Beihua University.\nLin said the isolated incident will not disrupt normal exchanges of people from China and the US.\nThe partnership between Cornell College and Beihua University began in 2018, The New York Times quoted Jan Visser, a spokeswoman for Cornell College, as saying.\nBeihua University provides funding for the college's professors to travel to and live in China, and teach computer science, mathematics and physics over a two-week period."}, {"id": "9cfc67ef-5cfd-47c6-b9b9-86ea99f369a1", "title": "Exchanges wont be disrupted by isolated incident", "date": "2024-06-12 01:15", "url": "http://europe.chinadaily.com.cn/a/202406/11/WS6668740ca31082fc043cbef0.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Foreign Ministry spokesman Lin Jian.\nThe four educators are from Cornell College in the US state of Iowa and were on a teaching exchange program with Beihua University.\nLin said the isolated incident will not disrupt normal exchanges of people from China and the US.\nThe partnership between Cornell College and Beihua University began in 2018, The New York Times quoted Jan Visser, a spokeswoman for Cornell College, as saying.\nBeihua University provides funding for the college's professors to travel to and live in China, and teach computer science, mathematics and physics over a two-week period."}, {"id": "b16314df-c9fa-40d8-b714-b5ada19641c8", "title": "Sebring bank shooting trial : Gunman tells police  I deserve to die for thi in recording played for jurors", "date": "2024-06-12 14:00", "url": "https://www.yahoo.com/news/sebring-bank-shooting-trial-gunman-090721408.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Xaver told Reinhart that he shot the women until he stopped hearing movement.\nOn the video, Xaver consents to having his mouth swabbed for DNA and his hands swabbed for gunshot residue.\nAfter the video was played, Reinhart discussed Xaver’s gun purchase.\nRELATED: Sebring bank shooting trial: Jurors hear from bank teller who escaped, crisis negotiation recordingOn Tuesday, Benjamin Wysokowski told jurors that he was in the bank’s breakroom eating his lunch and watching YouTube videos on his phone when he heard two gunshots go off around 12:30 p.m. on Jan. 23, 2019.\nThe documents state Xaver told school officials he had dreams of hurting his classmates."}, {"id": "9ed0ae42-e57e-488f-b322-1d781a13fe61", "title": "NBA mock draft : Frenchmen go 1 - 2 , then Sheppard and Castle follow as best of the one - and - dones", "date": "2024-06-12 14:00", "url": "https://www.ajc.com/news/georgia-news/nba-mock-draft-frenchmen-could-go-1-2-in-draft-following-wembanyamas-footsteps/WQ6ONTWJWVGXNLWLBJ2UPVWTHI/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "5b202b67-96f4-4e0e-8d1c-f1e8124057fa", "title": "Hunter Biden found guilty of three felonies ; suspected arsonist torches himself", "date": "2024-06-12 03:30", "url": "https://www.fox10phoenix.com/news/hunter-biden-found-guilty-three-felonies-suspected-arsonist-torches-himself-nightly-roundup", "domain": "fox10phoenix.com", "domain_classification": "Unknown", "message": "articleFrom Hunter Biden being found guilty of three felony charges, to a suspected arsonist torching himself while setting his ex-girlfriend's property on fire, here are tonight's top stories.\nHunter Biden found guilty in gun trialFeatured article2.\nSuspected arsonist torches himself while setting ex-girlfriend's property ablazeFeatured article3.\nChild dead after falling into water near a Mesa apartment complex, PD saysFeatured article5.\nJacob Pennington sentenced following one of his east Valley teen violence arrests"}, {"id": "d90cac00-df3a-4e8d-8582-aaed71ef9306", "title": "NBA mock draft : Frenchmen go 1 - 2 , then Sheppard and Castle follow as best of the one - and - dones", "date": "2024-06-12 14:30", "url": "https://www.daytondailynews.com/nation-world/nba-mock-draft-frenchmen-go-1-2-then-sheppard-and-castle-follow-as-best-of-the-one-and-dones/6SWDAEQ5ANGZ5EBC2EY3B3N34M/", "domain": "daytondailynews.com", "domain_classification": "Unknown", "message": "logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "a42e1b7f-8c16-44d4-b05f-8306891708c0", "title": "Ukrainian forces destroyed two Russian S - 300 and S - 400 radars in Crimea on night of 11 - 12 June", "date": "2024-06-12 13:15", "url": "https://www.yahoo.com/news/ukrainian-forces-destroyed-two-russian-103900770.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian forces destroyed two Russian S-300 and S-400 radars in Crimea on night of 11-12 JuneUkraine’s defence forces once again attacked anti-aircraft missile systems deployed by the Russians in temporarily occupied Ukrainian Crimea on the night of 11-12 June.\nSource: General Staff of the Armed Forces of Ukraine on social mediaDetails: This time, reports indicate that a missile salvo targeted one Russian S-300 anti-aircraft missile battalion near Belbek and two S-400 anti-aircraft missile battalions near Belbek and Sevastopol.\nIn particular, two radars of an S-300 and an S-400 systems were destroyed.\nFurthermore, ammunition detonations were recorded in all three areas where Russian anti-aircraft missile battalions are stationed.\nBackground: Radio Liberty, citing Russian and Crimean Telegram channels, reported that loud sounds of explosions had been heard in temporarily occupied Crimea and Sevastopol and that the Kerch Bridge had been closed to traffic at night and dawn on 11-12 June."}, {"id": "acf29c76-17ec-4c07-8259-1fc3b6b17fa5", "title": "Senior Hezbollah commander Abu Taleb killed by Israeli strike in south Lebanon", "date": "2024-06-12 09:00", "url": "https://www.thenationalnews.com/news/mena/2024/06/12/senior-hezbollah-commander-abu-taleb-killed-by-israeli-strike-in-south-lebanon/", "domain": "thenationalnews.com", "domain_classification": "Local - Middle East", "message": "Hezbollah named its commander killed in the Israeli strike as Sami Abdallah – also known as Abu Taleb.\nMr Abdallah, who Hezbollah said was 55, was killed in the village of Jouaiya, about 15km from the Israeli border.\nIsrael’s military said it struck sites in Hanine and Yater, in southern Lebanon, from where Hezbollah launched parts of its barrage.\nIn southern Lebanon, about 300 Hezbollah fighters have been killed since the conflict broke out, along with about 80 civilians.\nIn northern Israel, Hezbollah attacks have killed 18 Israeli soldiers and 10 civilians, Israel says."}, {"id": "e776689c-47ca-49e1-968b-6e56da7d2bf9", "title": "Be firm and prosecute suspect who stabbed Hawa Koomson son – NPP to IGP", "date": "2024-06-12 04:30", "url": "https://www.ghanaweb.com/GhanaHomePage/politics/Be-firm-and-prosecute-suspect-who-stabbed-Hawa-Koomson-s-son-NPP-to-IGP-1935240", "domain": "ghanaweb.com", "domain_classification": "Unknown", "message": "Politics of Wednesday, 12 June 2024Source: kasapafmonline.comThe Central Regional branch of the Patriotic Party (NPP) has called on the IGP, Dr. George Akuffo Dampare, to ensure that the suspect who stabbed the son of the Minister for Fisheries and Aquaculture, Mavis Hawa Koomson, is prosecuted.\nThe party has condemned the stabbing incident that occurred at the EC Registration Centre during the ongoing limited voter's transfer last week.\nAddressing a press conference at the NPP party office in Kasoa, Central Regional NPP Secretary, Richard Takyi Mensah, condemned the unfortunate incident and called on the IGP to stand firm and prosecute the suspect to serve as a deterrent to others.\nThis behavior is unacceptable, and we roundly condemn the stabbing incident,\" he added.\nShe affirmed that the Awutu Senya East seat is safe under the leadership of Mavis Hawa Koomson."}, {"id": "c9ffc481-7994-48be-91f8-b3203ad2a23d", "title": "From the physics of g - force to weightlessness : How it feels to launch into space", "date": "2024-06-12 04:15", "url": "https://health.wusf.usf.edu/npr-health/2024-06-11/from-the-physics-of-g-force-to-weightlessness-how-it-feels-to-launch-into-space", "domain": "health.wusf.usf.edu", "domain_classification": "Unknown", "message": "This summer, NPR science podcast Short Wave is launching Space Camp, a series about all the weird and wonderful things in our universe.\nG-forces and why floating is fallingWhen those rockets blast off, astronauts experience intense g-forces.\nBut the heaviness of being in a fast elevator is nothing compared to what astronauts experience during a launch.\nPreview of Next Week's Short Wave Space Camp: PlutoNow if we get out of Earth's orbit and to the end of our solar system, we will pass the beloved once-planet Pluto.\nListen to every episode of Short Wave sponsor-free and support our work at NPR by signing up for Short Wave+ at plus.npr.org/shortwave."}, {"id": "5f5f0312-3ab5-4e1c-9198-124c03aa0750", "title": "The World War I  Mephisto  Tank : Where It Is Now", "date": "2024-06-12 14:00", "url": "https://www.slashgear.com/1596763/a7v-mephisto-tank-captured-wwi-where-now/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "The World War I 'Mephisto' Tank: Where It Is NowThe Mephisto tank first arose as a sort of evolution of armored cars that were already starting to find a role in combat, like the British Royal Naval Air Service's Rolls Royce Ghosts of 1914.\nSuch vehicles, of course, would have been rendered useless against the wide, defended, blockaded trenches that the opposing sides would go on to employ in World War I.\nThough this tank arrived late in World War I and in very small quantities (a meager 20 of them were manufactured), there's no doubt that it made quite the impact.\nThis tank has an extraordinary tale to tell and went on quite the odyssey after the war.\nThis is the story of Mephisto, where it is now, and why the A7V model itself is important."}, {"id": "e9aafc38-4d94-4c48-86ca-d830d8748701", "title": "Unyielding onslaught - Newspaper", "date": "2024-06-12 05:45", "url": "https://www.dawn.com/news/1839387/unyielding-onslaught", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "That same night, policemen successfully defended their post in Bajaur from a militant attack with no loss of lives.\nSeveral pivotal developments have led to the resurgence of terrorist activities in Pakistan, notably the Afghan Taliban’s takeover of Kabul in 2021.\nAnd so, an emboldened TTP has been able to regroup and mount sophisticated attacks against targets inside Pakistan.\nTo counter this escalating threat, Pakistan must develop a strategy that integrates both military and civilian efforts.\nAll the while, diplomatic efforts must continue to exert pressure on the Afghan Taliban to take concrete actions against the TTP."}, {"id": "b4d9c226-e184-44f3-95a5-e33c7d6640b7", "title": "Kalki 2898 AD : Amitabh Bachchan as Ashwatthama - All about the Mahabharata legend behind his  mani  ", "date": "2024-06-12 09:45", "url": "https://www.indiatimes.com/entertainment/originals/kalki-2898-ad-amitabh-bachchan-ashwatthama-mahabharata-story-forehead-gem-mani-636101.html", "domain": "indiatimes.com", "domain_classification": "Unknown", "message": "The Kalki trailer is out, and the most talked-about character is that of Amitabh Bachchan, who is playing \"Ashwatthama,\" a key figure from the Mahabharata.\nBasics about Ashwatthama:Real-Life Ashwatthama: Here's Everthing About Amitabh Bachchan's Kalki 2898 AD Character/XAshwatthama is the son of Dronacharya, the esteemed teacher of both the Pandavas and Kauravas.\nAlso Read: Kalki 2898 AD: List Of Top Actors Who Are Making This Movie's Budget So HighHe was known for his bravery and exceptional combat skills.\nWhat's The Mani-Like Object On Ashwathama's Head As Shown In Kalki Trailer?\nAlso read: Kalki AD 2898: Prabhas Stuns Fans With Lean Look After Dramatic Weight Loss For His Upcoming MovieIs Ashwathama Good Or Bad?"}, {"id": "fc3601bb-ad3a-4783-a57d-e891368ec26c", "title": "US lifts ban on sending weapons to Ukraine Azov Brigade | International", "date": "2024-06-12 13:15", "url": "https://english.elpais.com/international/2024-06-12/us-lifts-ban-on-sending-weapons-to-ukraines-azov-brigade.html", "domain": "english.elpais.com", "domain_classification": "Unknown", "message": "Azov is the best-known name of the Ukrainian extreme right that emerged in 2014, following the Maidan Revolution.\nSince the war in Donbas, the United States had prohibited the weapons it sent to Ukraine from ending up in the hands of Azov.\nThis has been the case until Tuesday, when the White House State Department announced that the Azov Brigade will finally be able to receive U.S. war equipment.\nToday, the Azov brigade is an assault force that forms part of the National Guard of Ukraine and the Interior Ministry.\nThe U.S. State Department, as reported by The Washington Post, believes that Azov now complies with the Leahy Law."}, {"id": "77039bd7-4a63-42d4-bea1-844ede3477e8", "title": "US to provide another Patriot system to Ukraine : Report", "date": "2024-06-12 04:30", "url": "https://www.prokerala.com/news/articles/a1538816.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "US to provide another Patriot system to Ukraine: Report.\nImage Source: IANS NewsWashington, June 12 : US President Joe Biden is planning to make another Patriot air defence system available to Ukraine to fend off Russian aerial attacks, the media reported, citing unnamed US government sources.\nBiden took the decision following several high-level meetings last week, the New York Times reported on Tuesday.\nAccording to the New York Times, the system in question is in Poland and could be deployed to the front line in Ukraine within days.\nIf confirmed it would be the second US-made Patriot system provided to Kiev by Washington."}, {"id": "d8cbf84d-ba58-4cfb-a5dd-639c8be40967", "title": "US To Provide Another Patriot System To Ukraine : Report", "date": "2024-06-12 02:45", "url": "https://menafn.com/1108322504/US-To-Provide-Another-Patriot-System-To-Ukraine-Report", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Washington, June 12 (IANS/DPA) US President Joe Biden is planning to make another Patriot air defence system available to Ukraine to fend off Russian aerial attacks, the reported, citing unnamed US sources.\nBiden took the decision following several high-level meetings last week, the New York Times reported on Tuesday.\nAccording to the New York Times, the system in question is in Poland and could be deployed to the front line in Ukraine within days.\nIf confirmed it would be the second US-made Patriot system provided to Kiev by Washington.\nGermany has also provided Ukraine with two such systems and pledged to send another one."}, {"id": "4ce9acdc-33ca-441a-b08d-63f4224f8fac", "title": "AFU Special Forces Mop Up With Armoured Vehicles Russian Positions In Zaporizhzhia", "date": "2024-06-12 13:45", "url": "https://charter97.org/en/news/2024/6/12/598683/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "AFU Special Forces Mop Up With Armoured Vehicles Russian Positions In Zaporizhzhia 2 12.06.2024, 14:504,590The occupants were attacked using forest terrain.\nFighters of the ‘Omega’ Special Forces Centre have effectively carried out an assault on the Russian positions in the Zaporizhzhia direction.\nAn American M113 armoured personnel carrier with a large-calibre machine gun on its roof was chosen for the assault.\nThe armoured personnel carrier was also equipped with an electronic warfare system to suppress the signals of Russian FPV drones.\nHowever, the Omega fighters managed to complete the assault and leave the battle site on an armoured personnel carrier."}, {"id": "86dc550f-f785-420f-8814-f14faa76282f", "title": "China dismisses Taiwan concerns after man arrested on river leading to Taipei", "date": "2024-06-12 05:00", "url": "https://www.channelnewsasia.com/east-asia/taiwan-chinese-man-boat-arrest-espionage-grey-zone-tactic-4404286", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "Taiwan's coast guard arrested the man on Sunday in the coastal neighbourhood of Tamsui after his boat entered a river that leads into Taipei amid ongoing tensions between Taiwan and China.\nTaiwan says the man is a former Chinese navy captain who could have been probing the island's defences.\nSpeaking at a regular news briefing in Beijing, Chen Binhua, spokesperson for China's Taiwan Affairs Office, said what the man had done was \"purely his personal action\".\nThe man will be punished once he returns to China, Chen added, without giving details.\nTaiwan's coast guard said that the man crossed the strait from China's Fujian province, which sits opposite Taiwan, and that it does not believe he came to Taiwan seeking political asylum."}, {"id": "d0cb1f4e-77ce-4225-9273-31121803e908", "title": "US to provide another Patriot system to Ukraine : Report", "date": "2024-06-12 12:15", "url": "https://morungexpress.com/us-to-provide-another-patriot-system-to-ukraine-report", "domain": "morungexpress.com", "domain_classification": "Unknown", "message": "Washington, June 12 (IANS/DPA): US President Joe Biden is planning to make another Patriot air defence system available to Ukraine to fend off Russian aerial attacks, the media reported, citing unnamed US government sources.\nBiden took the decision following several high-level meetings last week, the New York Times reported on Tuesday.\nAccording to the New York Times, the system in question is in Poland and could be deployed to the front line in Ukraine within days.\nIf confirmed it would be the second US-made Patriot system provided to Kiev by Washington.\nGermany has also provided Ukraine with two such systems and pledged to send another one."}, {"id": "18dc9fa2-8419-4cf2-856f-c0e2043dd85a", "title": "World War II : Secrets from Above - National Geographic Channel HD", "date": "2024-06-12 04:15", "url": "https://www.tvguide.co.uk/schedule/ac4a1d71-7c6f-53ef-b863-c7b70d735b0d/world-war-ii-secrets-from-above", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "World War II: Secrets from AboveNational Geographic Channel HD 10:00 AM to 11:00 AM Wednesday 12 June Share Add toCalendar +Battle of Britain Season 2 Episode 1 of 6 S Subtitles Audio DescriptionThe Battle of Britain from a unique aerial perspective, as over 1500 British and German planes engage in a duel to the death above EnglandWorld War II: Secrets from Above airs on National Geographic Channel HD at 10:00 AM, Wednesday 12 June .\n(Subtitles, audio description.)\nLearn more about World War II: Secrets from Above and other education/science/factual topics on our factual page"}, {"id": "fad8dda8-3a7c-4116-9c3d-2dc796a10a33", "title": "Hunter Moonstrike Windows game", "date": "2024-06-12 13:15", "url": "https://www.indiedb.com/games/hunter-moonstrike", "domain": "indiedb.com", "domain_classification": "Unknown", "message": "In a world ravaged by a relentless virus that turns humans into zombies, survival is the only goal.\nOur story follows a determined protagonist from Camp One, led by an ex-military strategist, Hanks, who is hardened by loss and years of combat.\nAs tensions rise and resources dwindle, alliances will be tested, and the fight for survival will intensify.\nNavigate the perilous forest, make strategic decisions, and uncover the dark secrets of this post-apocalyptic world.\nYou can buy the game through the link below"}, {"id": "2c764365-a8cc-489b-8d3d-4c597b45753e", "title": "  Ukraine Launched Preemptive Strike  - Belarusian News", "date": "2024-06-12 13:45", "url": "https://charter97.org/en/news/2024/6/12/598640/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "‘Ukraine Launched Preemptive Strike’ 12.06.2024, 11:1715,484An expert reveals details of destruction of the newest Russian Su-57.\nThis was stated on air by the deputy director of the Ukrainian company for the production of electronic warfare, aviation expert Anatoly Khrapchinsky on the FREEDOM TV channel, emphasizing that Kyiv launched a preemptive strike.\n“The strike on the Su-57 was carried out at the Akhtubinsk airfield.\nTherefore, we can say that there was a strategic preemptive strike.\nThat is, against an aircraft that Russia expected to use in combat operations in the future,” Khrapchinsky emphasized."}, {"id": "f78ce36a-3326-45cb-b024-cb6bfd663ed8", "title": "China appreciates enlightened Japanese  courage to expose historical truth on Japanese bacteriological warfare - Xinhua", "date": "2024-06-12 14:30", "url": "https://english.news.cn/20240612/e1bbd463298d4a2282248ad3ace312a1/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "BEIJING, June 12 (Xinhua) -- Regarding the Japanese scholars' donation of historical materials on Japanese biological warfare in China, a Chinese foreign ministry spokesperson said on Wednesday that the historical documents once again provide solid evidence that Japanese militarism committed bacteriological warfare crimes in China, and China appreciates the courage of enlightened Japanese to expose and confront the historical truth.\nSpokesperson Lin Jian made the remarks at a regular press briefing when asked to comment on Japanese scholars' donations.\nRecently, two Japanese scholars donated a large amount of historical materials on Japanese bacteriological warfare to China and expressed their hope for friendship and peace between Japan and China.\nThe historical materials they donated again demonstrate the undeniable and irrefutable evidence that Japanese militarism launched bacteriological warfare in China, he added.\nLin said Japan should face up to and deeply reflect on its history of aggression by Japanese militarism, learn from history, and avoid repeating past mistakes."}, {"id": "a3a3db80-1820-40fb-a1d4-634d9c099379", "title": "Enemies are attacking Israel from all sides , but there hope | WND", "date": "2024-06-12 01:30", "url": "https://www.wnd.com/2024/06/enemies-attacking-israel-sides-hope/", "domain": "wnd.com", "domain_classification": "Unknown", "message": "One cannot negotiate with those who are solemnly sworn to the destruction of the Jewish State of Israel and the annihilation of Jewish people.\nOn that very first day, Biden – by removing sanctions – allowed the Iranian régime to sell its oil.\nOn his first day, Biden also stopped the Keystone Pipeline so America could no longer export oil, robbing America of its energy independence.\nDo these countries fail to remember that the charter of this proposed Palestinian state will call for the destruction of the Jewish state of Israel?\nWith so many enemies attacking Israel at the same time and Iran very close to achieving its goal of a nuclear weapon, we may be frightened for the survival of the Jewish State of Israel."}, {"id": "864097b2-d4fd-49a9-b0ff-e4034a320ad0", "title": "Hunter Moonstrike - A Survival Game news", "date": "2024-06-12 13:15", "url": "https://www.indiedb.com/games/hunter-moonstrike/news/hunter-moonstrike-a-survival-game", "domain": "indiedb.com", "domain_classification": "Unknown", "message": "In a world ravaged by a relentless virus that turns humans into zombies, survival is the only goal.\nOur story follows a determined protagonist from Camp One, led by an ex-military strategist, Hanks, who is hardened by loss and years of combat.\nPosted by 10nstudio on Jun 12th, 2024In a world ravaged by a relentless virus that turns humans into zombies, survival is the only goal.\nOur story follows a determined protagonist from Camp One, led by an ex-military strategist, Hanks, who is hardened by loss and years of combat.\nAs tensions rise and resources dwindle, alliances will be tested, and the fight for survival will intensify."}, {"id": "52ef7e79-a7ba-4d0a-b84f-fbfb781d311d", "title": "Both Israel And Hamas Committed War Crimes In Gaza : UN", "date": "2024-06-12 13:45", "url": "https://menafn.com/1108324297/Both-Israel-And-Hamas-Committed-War-Crimes-In-Gaza-UN", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Geneva, June 12 (IANS/DPA) Both Israel and Hamas in the Gaza Strip have committed war crimes since the conflict there erupted on October 7 last year, according to a report by the UN Human Rights Council on Wednesday.\n\"It is imperative that all those who have committed crimes be held accountable,\" said the chair of the UN Human Rights Council Commission, Navi Pillay.\nIsrael's war crimes include starving the population as a means of warfare, deliberate on civilians and civilian objects, sexual violence, torture and inhuman or cruel treatment, the UN Rights Council reported.\nThe commission lists attacks on civilians, torture, inhumane and cruel treatment and hostage-taking as war crimes committed by the military arm of the Islamist Hamas movement and six other armed groups.\nThe UN Human Rights Office has repeatedly spoken of war crimes on both sides."}, {"id": "4bcf8d6c-7c69-4944-856b-b0b3467abb87", "title": "Starvation , deliberate killings , gender - based violence : UN finds both Hamas and Israel guilty of war crimes", "date": "2024-06-12 09:45", "url": "https://www.firstpost.com/world/israel-hamas-war-crimes-united-nations-report-13781680.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "While Hamas and other Palestinian terror groups have been grossly violating international laws, Israel has also been accused of committing crimes against humanity in Gaza.\nThe war between Israel and Hamas has led to the deaths and displacement of thousands of Palestinians.\nIt found that Hamas and other Palestinian armed groups “deliberately killed, injured, mistreated, took hostages and committed sexual and gender-based violence”.\nCivilians and members of the Israeli security forces were the victims of the crimes committed by Hamas.\n“These actions constitute war crimes and violations and abuses of international humanitarian law and international human rights law,” the report said."}, {"id": "132f7b59-b2af-40a3-b594-d911fcf3b928", "title": "Can U . S . Aircraft Carriers Survive in the Age of A2 / AD ? ", "date": "2024-06-12 13:00", "url": "https://nationalinterest.org/blog/buzz/can-us-aircraft-carriers-survive-age-a2ad-209949", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "Summary and Key Points: The U.S. Navy faces increasing threats from anti-access/area-denial (A2/AD) systems developed by near-peer rivals like China.\n-These relatively inexpensive defensive systems threaten America's costly and complex offensive platforms, such as aircraft carriers.\nThe longer that US policymakers fail to consider the rise of these A2/AD systems, the more insecure America becomes.\nInterestingly, America’s greatest rivals—notably China—have so thoroughly perfected their A2/AD capabilities that even attempting to deploy expensive systems, such as the aircraft carriers, into areas that are home to these dangerous A2/AD systems would be wasteful.\nYes, given A2/AD capabilities being fielded by rivals, like China, US carriers will be increasingly relegated to operating in ancillary areas of interest."}, {"id": "389eb116-6293-4cab-8c6f-bfb375b49aca", "title": "Assassin Creed Shadows 13 - min . walkthrough shows combat & more", "date": "2024-06-12 01:15", "url": "https://www.androidheadlines.com/2024/06/assassins-creed-shadows-13-min-walkthrough-shows-combat-more.html", "domain": "androidheadlines.com", "domain_classification": "Unknown", "message": "Assassin’s Creed Shadows is due out on November 15, but Ubisoft saw fit to give players a taste of the game early through a 13-minute extended walkthrough.\nFor players eager to step into the role of Naoe and Yasuke, the extended gameplay walkthrough is a must-watch.\nUbisoft discusses more of this world in a developer insight video which it released alongside the extended gameplay walkthrough.\nMost of this video is just Dansereau alongside Game Director Charles Benoit breaking down the extended gameplay walkthrough.\nAssassin’s Creed Shadows launches on November 15 for PC via Ubisoft Connect, and Ubisoft+ Premium members will be able to play the game through that service."}, {"id": "f77db045-6e61-4f41-81cf-f01ba0315836", "title": "Gaza war crimes : UN inquiry accuses Israel and Hamas", "date": "2024-06-12 12:15", "url": "https://www.jpost.com/israel-hamas-war/article-805944", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Both Israel and Hamas committed war crimes in the early stages of the Gaza war, a UN inquiry claimed on Wednesday, saying that Israel's actions also constituted crimes against humanity because of the immense civilian losses.\nThe COI said Israel obstructed its work and prevented investigators from accessing both Israel and the West Bank.\nGaza war crimesA weapon found in a baby's crib in Rafah, Gaza Strip, June 7, 2024.\n(credit: IDF SPOKESPERSON'S UNIT)The report, which covered the conflict through to end-December, found that both sides committed war crimes including torture; murder, or willful killing; outrages upon personal dignity; and inhuman or cruel treatment.\nSometimes, the evidence gathered by such UN-mandated bodies has formed the basis for war crimes prosecutions and could be drawn on by the International Criminal Court."}, {"id": "210b2b2c-1eb5-455d-8ad0-a77026712091", "title": "Ukraine war briefing : Washington clears Azov brigade for US weapons and training", "date": "2024-06-12 03:00", "url": "https://www.theguardian.com/world/article/2024/jun/12/ukraine-war-briefing-washington-clears-azov-brigade-for-us-weapons-and-training", "domain": "theguardian.com", "domain_classification": "International", "message": "The US has lifted a ban on providing weapons and training to Ukraine’s Azov Brigade, which had far-right roots but proved key to the defence of the major port city of Mariupol.\nAzov was absorbed into Ukraine’s national guard as the 12th Special Forces Brigade and current members reject accusations of extremism and ties with far-right movements.\nUS law prohibits providing equipment and training to foreign military units or individuals suspected of committing gross human rights violations.\n“This is a new page in our unit’s history,” the Azov Brigade said in a statement.\nSpeaking in Madrid recently, Ukraine’s president, Volodymyr Zelenskiy, said Ukraine needed another seven Patriot systems to defend against Russian strikes."}, {"id": "28b5ad5f-8327-47d1-8b1f-8a8db2c54210", "title": "Bizarre psychological warfare using K - pop and trash balloons raises tensions between the 2 Koreas | News , Sports , Jobs", "date": "2024-06-12 01:45", "url": "https://www.standard.net/top-headlines/2024/jun/11/bizarre-psychological-warfare-using-k-pop-and-trash-balloons-raises-tensions-between-the-2-koreas/", "domain": "standard.net", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — Mammoth South Korean loudspeakers blaring BTS music.\nSmall South Korean civilian leaflets slamming North Korean leader Kim Jong Un.\nNorth Korean broadcasts in the past revolved mainly around praising its system and harsh censuring of South Korea.\nThey said past North Korean broadcasts from its loudspeakers were not clearly audible in South Korean areas.\nSouth Korean military said it’s ready to launch immediate, strong retaliation if attacked."}, {"id": "16089673-529b-4e43-91fb-3749d40c3518", "title": "UN probe accuses Israel of crimes against humanity , Hamas of war crimes", "date": "2024-06-12 09:45", "url": "https://www.philstar.com/world/2024/06/12/2362339/un-probe-accuses-israel-crimes-against-humanity-hamas-war-crimes", "domain": "philstar.com", "domain_classification": "Unknown", "message": "GENEVA, Switzerland — A UN investigation concluded on Wednesday that Israel has committed crimes against humanity during the war in Gaza, including that of \"extermination\", while saying Israeli and Palestinian armed groups have both committed war crimes.\nIt found that Israel had committed war crimes, crimes against humanity and violations of international humanitarian law (IHL) and international human rights law (IHRL).\nThe commission found that in that attack, members of the military wings of Hamas and other Palestinian armed groups and Palestinian civilians committed war crimes, as well as violations and abuses of IHL and IHRL.\nSince October 7, the three-member commission has focused on the Gaza war between Israel and Hamas.\n\"These actions constitute war crimes and violations and abuses of IHL and IHRL,\" it said."}, {"id": "1feb71a5-41e8-490f-8f04-8f2af6de8175", "title": "Search expedition for L - 19 submarine that sunk in Soviet - Japanese War continues in La Perouse Strait", "date": "2024-06-12 10:45", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/06/russia-240611-russia-mod04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Search expedition for L-19 submarine that sunk in Soviet-Japanese War continues in La Perouse Strait11.06.2024The joint expedition of the Russian Geographical Society and the 'Lyudi Morya' Fund, supported by Fertoing naval engineering company, and the hydrographic service of the Pacific Fleet, went to search for a Soviet L-19 submarine.\nSearching for the submarine will take place in the west part of the La PĂ©rouse Strait, from where the last signal came from.\nIn 2023, search work in the La PĂ©rouse Strait was carried out on board a multi-purpose ship Lamantin equipped with a remote-controlled uninhabited underwater vehicle.\nOn 23 August, the submarine commander reported by wireless message on the beginning of the forcing the La PĂ©rouse Strait.\nIn the search expedition for the L-19 in 2006, a USS Wahoo was found in the La PĂ©rouse Strait."}, {"id": "5fe61cb7-ca4b-4f45-b74a-9a48e48592fa", "title": "Depressing : US Soldiers More Likely to Die by Suicide Than in Combat", "date": "2024-06-12 02:00", "url": "https://hotair.com/jazz-shaw/2024/06/11/depressing-us-soldiers-more-likely-to-die-by-suicide-than-in-combat-n3790070", "domain": "hotair.com", "domain_classification": "Unknown", "message": "One of the most alarming statistics reveals that U.S. soldiers were more likely to die by suicide than from combat industries.\nSoldiers were nine times more likely to die in that manner.\nThe suicide figures from 2019 predate some Army and Pentagon initiatives to combat suicide, including a workforce that addresses harmful behaviors like alcohol abuse that can contribute to deaths by suicide.\nIn one sense, the ratio of suicides to combat deaths is probably not an ideal indicator.\nAfter all, we're no longer actively involved in any hot wars (at least for the moment) so the rate of combat deaths should be lower."}, {"id": "32072a8e-fdca-4e94-9ea4-cefa224e891a", "title": "Empire of the Ants launches in November for PC and consoles", "date": "2024-06-12 13:00", "url": "https://nichegamer.com/empire-of-the-ants-launches-in-november/", "domain": "nichegamer.com", "domain_classification": "Unknown", "message": "Publisher Microids and developer Tower Five announced a release date for their Empire of the Ants game.\nTheir ant-fantasy real-time strategy game is launching on November 7th for Windows PC (via Steam), Xbox Series X|S, and PlayStation 5.\nHere’s a rundown on the previously announced game, plus a new trailer:"}, {"id": "8f09b79f-a5a2-48b1-b8c4-7036b76ebe38", "title": "UN inquiry finds Israel , Hamas both committed war crimes", "date": "2024-06-12 13:15", "url": "https://www.bworldonline.com/world/2024/06/12/601293/un-inquiry-finds-israel-hamas-both-committed-war-crimes/", "domain": "bworldonline.com", "domain_classification": "Unknown", "message": "GENEVA — Both Israel and Hamas committed war crimes in the early stages of the Gaza war, a UN inquiry found on Wednesday, saying that Israel’s actions also constituted crimes against humanity because of the immense civilian losses.\nThe COI says Israel obstructs its work and prevented investigators from accessing both Israel and the occupied Palestinian territories.\nThe reports, which cover the conflict through to end-December, found that both sides committed war crimes including torture; murder or willful killing; outrages upon personal dignity; and inhuman or cruel treatment.\nSome of the war crimes such as murder also constituted crimes against humanity by Israel, the COI statement said, using a term reserved for the most serious international crimes knowingly committed as part of a widespread or systematic attack against civilians.\nSometimes, the evidence gathered by such UN-mandated bodies has formed the basis for war crimes prosecutions and could be drawn on by the International Criminal Court."}, {"id": "45ea49f7-ebe5-4bed-ac03-211e88591213", "title": "HMRC using  psychological warfare  in crackdown on taxpayers", "date": "2024-06-12 14:00", "url": "https://www.birminghammail.co.uk/news/cost-of-living/hmrc-using-psychological-warfare-crackdown-29340699", "domain": "birminghammail.co.uk", "domain_classification": "Unknown", "message": "More infoHMRC is using \"psychological warfare\" to beat taxpayers into submission, it has been warned.\nHe also warned: \"HMRC is fully aware that you may not have the resources to defend yourself and that is all part of the psychological warfare being played out here between David and Goliath. \"\nHMRC taxpayers face the choice of \"selling homes\" or \"fighting it\" but being left with more financial trouble and higher bills if they lose.\nDirect tax includes Income Tax, PAYE Tax, Corporation Tax, Capital Gains Tax, National Insurance contributions and Inheritance Tax.\nIndirect tax includes VAT, Excise Duty, Customs Duty."}, {"id": "dc7ccb23-1b5b-4a38-87a5-a00b978bfbae", "title": "UN says Israel and Hamas committed war crimes ; Gaza truce plan in balance", "date": "2024-06-12 14:00", "url": "https://gulfnews.com/world/mena/un-says-israel-and-hamas-committed-war-crimes-gaza-truce-plan-in-balance-1.103077256", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "GENEVA/JERUSALEM/CAIRO: A UN inquiry found on Wednesday that both Israel and Hamas had committed war crimes early in the Gaza war, and that Israel’s actions also constituted crimes against humanity because of the immense civilian losses.\nThe war began on October 7 when militants led by Hamas, the Islamist group ruling Gaza, killed 1,200 Israelis and took more than 250 hostage, according to Israeli tallies.\nHamas also wants written guarantees from the US on the ceasefire plan, two Egyptian security sources said.\nThe US has said Israel has accepted its proposal, but Israel has not publicly stated this.\nIt said planes had also struck an armed Hamas cell and a weapons store in central Gaza."}, {"id": "28d0032c-e109-4cff-941a-fc4007ba2761", "title": "Historic Mexico City castle is depicted flying the Targaryen flag , and officials arent amused", "date": "2024-06-12 09:45", "url": "https://isp.netscape.com/entertainment/story/0001/20240612/8130c931a8d5fbaa0570f46effe1a8c4", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Historic Mexico City castle is depicted flying the Targaryen flag, and officials aren't amusedMEXICO CITY (AP) — Mexico’s historic Chapultepec Castle has been depicted flying the black Targaryen flag, and officials in Mexico aren’t amused.\nThe producers of the HBO series posted a video Monday of the 19th-century Mexico City hilltop castle showing the black Targaryen flag hanging over the battlements.\nMexico’s National Institute of Anthropology and History said the flags were generated by technology, and had never really hung at the site.\n“Game of Thrones” social media accounts posted similar images of other world landmarks, including New York City bridges.\nIt is unclear whether Mexico can win the legal battle against artificial intelligence and computer-generated images."}, {"id": "79733475-250d-4c95-8ae8-ba1bd0ace8d0", "title": "Chinese armed forces have been upgrading . India must keep up", "date": "2024-06-12 02:45", "url": "https://indianexpress.com/article/opinion/columns/chinese-armed-forces-have-been-upgrading-india-must-keep-up-9386658/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "This was a test of the interplay between Command and Control (C2) and ground-based air defence units.\nAt the same time, the WTC air forces have their long-range surface-to-air missile installations.\nThe WTC is enabling PLA ground and air forces to combine air defence systems.\nIn light of this, India is investing in its own indigenous Very Short-Range Air Defence Systems (VSHORADS) and Man-Portable Air Defence Systems (MANPADS) to expand Army Air Defence (AAD) capabilities.\nOver the years, anti-aircraft artillery units along with ground-to-air missile units, have become the backbone of the WTC’s air defence capabilities."}, {"id": "1f13bc04-daac-4fd1-820e-61df78e6d8c2", "title": "Biden Still Thinks He Can Win a Civil War", "date": "2024-06-12 01:00", "url": "https://redstate.com/brandon_morse/2024/06/11/biden-still-thinks-he-can-win-a-civil-war-n2175345", "domain": "redstate.com", "domain_classification": "Unknown", "message": "AdvertisementThis is why when I see our quickly deteriorating president fantasizing or commenting about matters pertaining to a civil war, I get a sinking feeling.\nLet's say that Biden declared war against a group of people for refusing to comply with his rule.\nFirstly, if Biden thinks he's going to have the manpower to wage war against the American people, he's horrifically mistaken:Let’s start with logistics.\nBiden wouldn't have any F-15s because he'd likely have no one to fly them.\nAdvertisementThere is no scenario where Biden wins a civil war, and he should wipe that smirk off his face when discussing it."}, {"id": "a169763b-90e9-4919-91c7-fab16799f722", "title": "Democracy Under Siege . Ursula Von der Leyen and Dr . Egon Cholakian on Combating Hybrid Warfare and Disinformation", "date": "2024-06-12 03:30", "url": "https://www.reviewjournal.com/bp/business/democracy-under-siege-ursula-von-der-leyen-and-dr-egon-cholakian-on-combating-hybrid-warfare-and-disinformation/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "Today, the need for immediate action to defend democracy is not just a […]The upcoming European Parliament elections are set for June 6-9.\nToday, many experts agree that democracy faces hybrid warfare, which includes elements of information warfare and economic and political manipulations.\nIn his latest analytical video report, Dr. Egon Cholakian presents the results of an extensive 30-year investigation into this issue and discusses the existence of a hidden anti-democratic entity within democratic countries.\nThe report explores disinformation methods using the example of a deliberate 10-year campaign aimed at discrediting the ALLATRA International Public Movement.\nUrsula von der Leyen proposes creating a European Democratic Shield, which will identify and eliminate online disinformation based on the EU’s digital rules and the Digital Services Act."}, {"id": "f971eed4-79dc-4d7a-a9fa-6685bfcb1803", "title": "Call Of Duty Black Ops 6 Beta Period May Have Been Outed Prematurely", "date": "2024-06-12 14:30", "url": "https://gameranx.com/updates/id/501056/article/call-of-duty-black-ops-6-beta-period-may-have-been-outed-prematurely/", "domain": "gameranx.com", "domain_classification": "Unknown", "message": "The beta period for Call of Duty Black Ops 6 may have come out early.\nOf course, like many other online games, Call of Duty Black Ops 6 has their beta in phases, in the buildup to the game’s release.\nAfter the beta period reserved for players who pre-ordered the game, there will be a free beta period.\nAnd most of the time, that free beta comes immediately after the pre-order beta period.\nWhile Call of Duty Modern Warfare III was technically the first Call of Duty game Microsoft published, that game was cobbled together from Call of Duty Modern Warfare II DLC, and this game was held back for another year."}, {"id": "f7fe2e36-a65b-4734-8557-7a42e0d97234", "title": "Africa : G7 Leaders Can and Must Prevent Manmade Famine", "date": "2024-06-12 14:30", "url": "https://allafrica.com/stories/202406120529.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "Only technicalities prevent famines from being declared, as people are already dying of hunger.\nG7 leaders can and must wield their influence to help stop it.\nThough we will continue to do our part to save lives where we can, ultimately, humanitarian aid is not the solution to the conflicts robbing millions of people of the lives they deserve.\nBut more than anything, the world must stop feeding the war machines that are starving the civilians of Gaza and Sudan.\nIt is time instead to prioritize the diplomacy that will give people back their futures - and tomorrow, the G7 is at the helm."}, {"id": "1827976a-e80b-4f80-b7df-fcb9253f1714", "title": "UN - backed experts accuse Israel , Hamas of war crimes in early stages of war", "date": "2024-06-12 14:30", "url": "https://www.cbc.ca/news/world/israel-hamas-war-day-250-1.7232262", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "A United Nations inquiry found on Wednesday that both Israel and Hamas had committed war crimes in the early stages of the war in Gaza, and that Israel's actions also constituted crimes against humanity because of the immense civilian losses.\nWATCH | U.S. ceasefire plan 'a desperate dream,' Gazan tells CBC: Gaza ceasefire talks hit roadblock as Hamas responds to proposal Duration 2:34 Ceasefire negotiations between Israel and Hamas appear to have hit another roadblock.\nHamas has responded to the U.S.-backed ceasefire proposal, saying it accepts the deal but requires several amendments.\n(Mohamed Azakir/Reuters)He was the most senior Hezbollah commander killed during eight months of hostilities, one of the sources said.\n\"Hamas could have answered with a single word: Yes,\" Blinken said at a news conference in Doha, Qatar."}, {"id": "1e9239c5-f608-4b34-a77c-5d6e7b6d80b0", "title": "German MPs boycott Zelensky speech - Newspaper", "date": "2024-06-12 05:30", "url": "https://www.dawn.com/news/1839321/german-mps-boycott-zelenskys-speech", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "BERLIN: Far-right and left-wing nationalist lawmakers in Germany, boycotted a parliamentary address by the Ukrainian President, Volody­myr Zelensky, on Tuesday.\nIn his speech, Zelensky warned that ‘pro-Russian rhetoric’, posed a ‘growing danger’, to nations in the EU.\nZelensky’s speech came at the start of a diplomatic whirlwind tour, to shore up support for Kyiv’s battle against Russia.\nBut radical pro-Russian rhetoric is dangerous for your countries,” Zelensky warned.\nThe co-leaders of the AfD stated that they “refused to listen to a speaker wearing camouflage fatigues”."}, {"id": "5152f92e-d26b-44f4-810f-eedb601502e1", "title": "War in Ukraine : Two Indian nationals recruited by Russia killed", "date": "2024-06-12 02:45", "url": "https://www.bbc.co.uk/news/articles/cv225e8dpdgo", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "\"We regret to state that two Indian nationals who had been recruited by the Russian Army have recently been killed in the ongoing conflict between Russia and Ukraine,\" the foreign ministry statement said, without naming the victims.\nThe ministry also urged Indian nationals to \"exercise caution while seeking employment opportunities in Russia\".\nDespite urging Russia to return Indian nationals serving in the Russian army, India has refused to condemn the Kremlin over its full-scale invasion of Ukraine, urging the two sides to seek peace through dialogue and diplomacy.\nAt least 16 former Sri Lankan soldiers have been killed in the conflict so far, most of them for the Russian army.\nSri Lankan Foreign Minister Ali Sabry raised the issue with his Russian counterpart Sergei Lavrov in Moscow on Monday, the ministry said."}, {"id": "0f99d6e2-74a2-4901-81c8-34f7cf8ef3bd", "title": "US to widen sanctions on sale of semiconductor chips to Russia", "date": "2024-06-12 05:45", "url": "https://www.euractiv.com/section/global-europe/news/us-to-widen-sanctions-on-sale-of-semiconductor-chips-to-russia/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "The US government plans on Wednesday (12 June) to announce wider sanctions on the sale of semiconductor chips and other goods to Russia, with the goal of targeting third-party sellers in China, sources familiar with the plans said late on Tuesday.\nThe administration will announce it is broadening existing export controls to include US-branded goods, not just those made in the United States, the sources said.\nThe White House and Commerce Department had no immediate comment on the changes, which were first reported by Bloomberg.\nWhite House spokesperson John Kirby told reporters earlier Tuesday that Washington would announce new sanctions and export controls against Russia.\nUS officials have expressed growing frustration about China’s burgeoning trade with Russia, which they say is allowing Moscow to keep arming its military."}, {"id": "2f35ec28-53d4-4190-8331-4b2437ff0d4d", "title": "Study Uncovers Significant Carbon Emissions Resulting from Ongoing Israel - Gaza Conflict", "date": "2024-06-12 12:00", "url": "https://indiaeducationdiary.in/study-uncovers-significant-carbon-emissions-resulting-from-ongoing-israel-gaza-conflict/", "domain": "indiaeducationdiary.in", "domain_classification": "Unknown", "message": "The study, titled “A Multitemporal Snapshot of Greenhouse Gas Emissions from the Israel-Gaza Conflict,” estimates that the emissions from the first 120 days of the conflict alone were greater than the annual emissions of 26 individual countries and territories.\nKey Findings:Immediate Emissions: The emissions from the first 120 days of the Israel-Gaza conflict exceeded the annual emissions of 26 individual countries.\nThe emissions from the first 120 days of the Israel-Gaza conflict exceeded the annual emissions of 26 individual countries.\nReconstruction Emissions: The emissions associated with rebuilding Gaza are projected to be higher than the annual emissions of over 135 countries, equating them to those of Sweden and Portugal.\nMilitary operations, according to a previous study, are responsible for about 5.5% of global carbon emissions, yet these emissions are often underreported and understudied."}, {"id": "754f9b0d-dfd2-4d59-b91e-e562bcb50cb6", "title": "Key Sudanese city could fall to rebels imminently - US", "date": "2024-06-12 03:30", "url": "https://www.myjoyonline.com/key-sudanese-city-could-fall-to-rebels-imminently-us/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "(AFP)The United States' envoy to Sudan has warned that El Fasher, a besieged city in western Darfur, could fall to rebel forces imminently.\nEl Fasher is the only city still under army control in the western Darfur region.\nAmerica's warning about the fall of El Fasher follows weeks of bloody fighting in the city.\nEl Fasher had been a sanctuary for many who had fled their homes because of the conflict.\nThe constant shelling in El Fasher has sent tens of thousands fleeing once again."}, {"id": "1d3868bb-61f0-4c77-898c-d3f0cea71ce1", "title": "Baton Rouge judge accused of lying about military service | Courts", "date": "2024-06-12 13:15", "url": "https://www.nola.com/news/courts/baton-rouge-judge-military-army-lying-judiciary-commission/article_2f52a63f-26c9-5d10-ad67-5923f5e3870f.html", "domain": "nola.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "ea7c72c4-7834-4541-b2d7-a05f70e8bb45", "title": "Vietnam veteran fulfills goal of graduating high school at Commonwealth Charter Academy after dropping out", "date": "2024-06-12 04:15", "url": "https://www.cbsnews.com/philadelphia/news/robert-toporek-vietnam-veteran-graduates-high-school/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "77-year-old Vietnam vet graduates high school years after dropping out to go to war77-year-old Vietnam vet graduates high school years after dropping out to go to war77-year-old Vietnam vet graduates high school years after dropping out to go to warPHILADELPHIA (CBS) -- A 77-year-old Vietnam veteran graduated Tuesday with the Commonwealth Charter Academy's class of 2024.\nThe year was 1965, the United States was 10 years into the Vietnam War and 17-year-old Robert Toporek dropped out of high school in Charleston, South Carolina, to join the Army.\nIn the heat of the combat zone, Toporek still managed to pass his GED test.\nDespite earning the Purple Heart and Bronze Star for his bravery in Vietnam, writing two books and being an early childhood education expert, Toporek said he's missed many opportunities because he didn't have a high school diploma.\nAs he delivered a speech to the class of 2024, Toporek used his own journey to graduation as a teachable moment."}, {"id": "432579f0-d97b-44ce-a1d2-d1a69f431aee", "title": "Shin Megami Tensei V : Vengeance Review - Apocalyptic Fantasy Redux", "date": "2024-06-12 14:30", "url": "https://cogconnected.com/review/shin-megami-tensei-v-vengeance-review/", "domain": "cogconnected.com", "domain_classification": "Unknown", "message": "Shin Megami Tensei V: Vengeance ReviewShin Megami Tensei V: Vengeance is the updated and expanded re-release of Shin Megami Tensei V, the fifth instalment in the mainline Shin Megami Tensei franchise.\nA Mythological Coming-Of-AgeShin Megami Tensei V: Vengeance begins where most games in the series do: with the end of the world.\nShin Megami Tensei V: Vengeance is MercilessShin Megami Tensei V: Vengeance takes a lot of inspiration from previous titles, especially Shin Megami Tensei III: Nocturne.\nAll in all, Shin Megami Tensei V: Vengeance is an excellent revision of a game I already liked.\nIf you liked the original Shin Megami Tensei V, or even just thought about playing it, check Shin Megami Tensei V: Vengeance out."}, {"id": "3976f858-75a5-4543-895d-9a06b9d9bbc4", "title": "Lithuania Is A Building Military Town For German Troops On The Border With Belarus", "date": "2024-06-12 13:45", "url": "https://charter97.org/en/news/2024/6/12/598641/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Lithuania Is A Building Military Town For German Troops On The Border With Belarus 12.06.2024, 11:263,0525,000 troops will be accommodated in the military town.\nLithuania is building a town for the German forces on the border with Belarus.\nNow the site is being prepared for construction, it is located near the village of Rudninkai (Šalčininkai district) near the Lithuanian-Belarusian border.\n\"This can be called a military town since its population will be ten times larger than in Rudninkai, where about five hundred people are living,\" said Colonel Rimantas Jarmalavičius, commander of the Ramanauskas Combat Training Centre.\nAt the moment, the forest has already been cut down on the site, it took three months."}, {"id": "72e5fb52-7d4e-4707-b6c2-c34f9c1a7b12", "title": "State Of Decay 3 Trailer Is  All In - Game Assets , All Rendered From The Game  ", "date": "2024-06-12 14:30", "url": "https://gameranx.com/updates/id/501061/article/state-of-decay-3-trailer-is-all-in-game-assets-all-rendered-from-the-game/", "domain": "gameranx.com", "domain_classification": "Unknown", "message": "Undead Labs is sharing some interesting insights into State of Decay 3’s incredible showing in the Xbox Games Showcase 2024.\nState of Decay is commonly regarded as a lesser franchise for Xbox.\nThe first State of Decay was literally an Xbox Live Arcade game on Xbox 360.\nState of Decay 2 was the odd OK game on the Xbox One.\nYes, Undead Labs received help from The Coalition to optimize their use of Unreal Engine 5 in this game."}, {"id": "802ecf81-84bf-4f0d-b53d-1c8640388252", "title": "China overseas bases arent a big threat yet : RAND", "date": "2024-06-12 00:30", "url": "https://www.defenseone.com/threats/2024/06/chinas-overseas-bases-arent-big-threatyet-rand/397310/", "domain": "defenseone.com", "domain_classification": "Unknown", "message": "China’s growing interest in opening more military bases abroad does not pose a big threat to U.S. forces in the next six years, RAND concludes in a new report out Monday.\n“Recent PLA research on overseas bases describes the ability to project power and win potentially protracted wars in distant theaters as a vital but likely still-distant capability.\nOne reason is that China doesn’t have the same sort of sophisticated command and control structures overseas that the United States does.\nPerhaps for that reason, the researchers didn’t find any PLA writing that describes conducting military operations from overseas bases aimed at the United States.\nStill, a network of overseas bases could pose indirect security challenges to the United States by complicating U.S. defense planning in the highly insecure and conflict-prone countries,” they note."}, {"id": "322b5a7f-e6ae-47d9-969c-58b3ef8e7b02", "title": "Whither Europe ? - Newspaper", "date": "2024-06-12 05:45", "url": "https://www.dawn.com/news/1839393/whither-europe", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "There were those in Europe who relished the prospect of a combat between the USSR and Nazi Germany, and the Normandy landings were at least partly motivated by the fear that the Red Army would overrun Europe and take sole credit for Hitler’s defeat.\nStalin’s regime is accurately accused of imposing its will on Eastern Europe.\nSomewhat more subtly, the US did the same in Western Europe.\nMeloni postures on the international stage as the acceptable face of Europe’s far right, while her government’s domestic attitudes reflect a clearer image of its perverse inclinations.\nIn many parts of Europe, for instance, economic distress is related to ageing societies and diminishing populations."}, {"id": "68f390d3-a3db-424d-b082-2bd2a9fd4c7e", "title": "Brad Pitt makes firm decision about kids amid Angelina Jolie legal feud", "date": "2024-06-12 13:15", "url": "https://www.thenews.com.pk/latest/1199668-brad-pitt-makes-firm-decision-about-kids-amid-angelina-jolie-legal-feud", "domain": "thenews.com.pk", "domain_classification": "Unknown", "message": "Brad Pitt makes firm decision about kids amid Angelina Jolie legal feudBrad Pitt is reportedly not ready to 'give up' on his children amid his legal battle with ex-wife Angelina Jolie.\nNot only this, Shiloh’s older sister, Zahara and her youngest sister, Vivienne, have introduced themselves with their mother's surname at public events.\nOn the other side, Brad's estranged kids have \"struggled to forgive and connect with\" him since his messy divorce with Angelina.\nOnce Brad left, it was very hard for them to see him go to war with her,\" stated the source.\nSince then, Brad and Angelina have been settling their legal matters in court."}, {"id": "d2e76b37-5901-49f0-a8d4-a928dd8eec91", "title": "During June , some weigh in on PTSD Awareness Month", "date": "2024-06-12 02:30", "url": "https://www.wbng.com/2024/06/12/during-june-some-weigh-ptsd-awareness-month/", "domain": "wbng.com", "domain_classification": "Unknown", "message": "BINGHAMTON (WBNG) -- June is PTSD awareness month, which raises awareness of the disorder millions of people across the United States battle with every day.\nTierney Daniels, the daughter of United States Veteran Eric Daniels said.\n“You could definitely tell that he doesn’t think like how a normal person thinks,” Tierney Daniels, the daughter of United States Veteran Eric Daniels said.\n“I think people don’t realize how real it is and how many people struggle genuinely with PTSD.\nNot even just vets like people every day have PTSD,” said Daniels."}, {"id": "ac2c27b2-f3ca-43e0-940e-c7c6f1a95f6a", "title": "PlayStation biggest sale of the year ends this week here 17 last chance deals Id buy", "date": "2024-06-12 14:00", "url": "https://www.tomsguide.com/gaming/playstation/playstations-biggest-sale-of-the-year-ends-this-week-heres-17-last-chance-deals-id-buy", "domain": "tomsguide.com", "domain_classification": "Unknown", "message": "These are the strongest PS5 game deals this side of Black Friday, so don’t miss out.\nSackboy A Big Adventure: was $59 now $19 @ Best BuySackboy: A Big Adventure sends Sony's plush mascot on another grand quest.\nWhile the level-creation tools of LittleBigPlanet are gone, A Big Adventure offers a series of well-crafted levels for Sackboy to platform through.\nReturnal: was $69 now $29 @ AmazonReturnal is a heart-pounding PS5 game that combines bullet-hell gameplay with an engaging roguelike structure.\nRatchet & Clank: Rift Apart: was $69 now $29 @ Best BuyRatchet & Clank: Rift Apart sees PlayStation's iconic intergalactic mascots go on their wildest adventure yet."}, {"id": "33a42611-3724-49a8-8169-4a93710606b5", "title": "Why Swedish Gripen fleet is NATO new ACE off base | Analysis", "date": "2024-06-12 13:00", "url": "https://www.flightglobal.com/defence/why-swedish-gripen-fleet-is-natos-new-ace-off-base/158739.article", "domain": "flightglobal.com", "domain_classification": "Unknown", "message": "That is how one former Saab Gripen and Viggen pilot describes the Swedish air force’s decades-old prowess in conducting road-strip operations.\nFlightGlobal visited a recent exercise staged by the Swedish air force’s F7 Wing, near its home at Satenas, during which the service demonstrated its off-base capabilities.\n“It’s in our DNA,” says deputy air force commander Brigadier General Tommy Petersson of the operating technique involved.\n“We started to do these kind of dispersed operations in the 1960s, and we designed our Viggen and Gripen fighters for this.\nThis includes launch Gripen E operator Brazil, which could in the future explore the potential for conducting such tasks with its locally-named F-39E/Fs."}, {"id": "a06bd62f-0358-4f4c-a999-539eef9d459b", "title": "North Korean Soldiers Crossing Border Was A Mistake : Seoul After Illegal Entry Reports", "date": "2024-06-12 03:30", "url": "https://www.timesnownews.com/world/asia/north-korean-soldiers-crossing-border-was-a-mistake-seoul-after-illegal-entry-reports-article-110923979", "domain": "timesnownews.com", "domain_classification": "Unknown", "message": "North Korean soldiers breached the South border Photo : APSouth Korea clarified that North Korean soldiers crossing its border was simply 'a mistake', further adding that the 20-odd troops were 'not all armed' and returned promptly after a warning fire.\nOn Tuesday, South Korean military confirmed that it fired warning shots after 20-30 North Korean troops briefly violated the tense border earlier in the week.\nAccording to the military statement, at 12:30 PM on Sunday, some North Korean soldiers who were engaged in unspecified work on the northern side of the border crossed the military demarcation line that bisects the two countries.\nThe soldiers immediately returned to their territory after South Korea’s military fired warning shots and issued warning broadcasts, the Joint Chiefs of Staff said.\nThe 248-kilometer (155-mile) -long, 4-kilometer (2.5-mile) -wide DMZ is the world’s most heavily armed border."}, {"id": "85431fd8-e71a-43e9-87b6-165186bc00d6", "title": "New Delhi Tibet - Taiwan move : How India - China relations will fare under Modi 3 . 0 – Firstpost", "date": "2024-06-12 09:45", "url": "https://www.firstpost.com/opinion/new-delhis-tibet-taiwan-move-how-india-china-relations-will-fare-under-modi-3-0-13781679.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "This signals continuity in India’s foreign policy under Modi 3.0.\nHowever, while India adheres to China’s One China policy, it has active economic, technological, and civil society partnerships with Taiwan.\nGiven that India has yet again suffered Pakistan-sponsored terrorism, Modi 3.0 will further double down on Pakistan-based terrorism while facing fresh hurdles from China.\nDefence Minister Rajnath Singh, who retains his role in Modi 3.0, reaffirmed India’s commitment to safeguarding its borders and strengthening defence manufacturing and exports.\nHe emphasised the priority of protecting India’s integrity and sovereignty during Modi 3.0."}, {"id": "3115ffa4-634c-4d90-a2c7-0d75ef58b16f", "title": "The Garhwal Regiment glorious military heritage", "date": "2024-06-12 06:15", "url": "https://www.dailypioneer.com/2024/columnists/the-garhwal-regiment---s-glorious-military-heritage.html", "domain": "dailypioneer.com", "domain_classification": "Unknown", "message": "The sprawling Bungalow No 6 amongst a hundred such, constructed in 1906 was home to Colonel Mainwaring commandant of 3/9 Royal Garhwal Rifles and was bought by MES for a princely Rs 10,053!\nScattered but indistinguishable descendants of erstwhile Nepalese can be found in Pathankot village as are remnants of 2/3 Gorkha Rifles also raised here which have an umbilical cord with the Garhwal Regiment.\nIt was a silver replica of this Unknown Soldier that PM Modi presented to the PM of France in 2015 to commemorate the centenary of WWI.\nThe Darwan Singh War Museum is the grand repository of the history and achievements in war and peace of the Regiment.\nThe Garhwal regimental legacy is protected by its three symbols: Lord Badrinath, the regimental deity, the iconic Unknown Soldier and the Royal Rassi."}, {"id": "6df40bba-150c-4676-901d-834ef46982ea", "title": "Ex - Navy employee pleads guilty to taking bribes from defense contractors", "date": "2024-06-12 02:30", "url": "https://www.10news.com/news/local-news/ex-navy-employee-pleads-guilty-to-taking-bribes-from-defense-contractors", "domain": "10news.com", "domain_classification": "Unknown", "message": "SAN DIEGO (CNS) — A former San Diego-based Navy civilian employee pleaded guilty this week to accepting bribes from defense contractors to help them obtain hundreds of millions of dollars in government contracts.\nProsecutors said that one family friend who received a job through the scheme gave Soriano $2,000 a month from her salary.\nIn addition to the bribery conspiracy, Soriano pleaded guilty to filing a false tax return for not disclosing the cash payments he received from his family friend.\nSoriano's plea agreement states he and another former Navy employee took bribes from Philip Flores, the president and CEO of Virginia-based Intellipeak Solutions.\nCambridge International Systems pleaded guilty to federal charges earlier this year."}, {"id": "2b8b73b4-7d90-4f94-96e0-fcae68c59fac", "title": "Ann Wagner joins bipartisan U . S . House caucus planning for post - war Middle East", "date": "2024-06-12 01:15", "url": "https://www.yahoo.com/news/ann-wagner-joins-bipartisan-u-235029098.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A U.S. House caucus formed this month with the goal of planning for the region after the Israel-Hamas war ends.\nBlinken told reporters in Tel Aviv Tuesday that Israeli Prime Minister Benjamin Netanyahu “reaffirmed” his commitment to the proposal.\nThe Israel-Hamas war has been ongoing since Hamas militants infiltrated Israel’s southern border on Oct. 7, killing roughly 1,200, according to Israel’s figures.\nThe death toll from Israel’s continued offensive in the Palestinian territory of Gaza reached 36,379 at the end of May, according to the Health Ministry in the Gaza Strip run by the Hamas-controlled government.\nThe post Ann Wagner joins bipartisan U.S. House caucus planning for post-war Middle East appeared first on Missouri Independent."}, {"id": "ce298b3f-5be4-42d3-8323-4f3fd1596497", "title": "In shadow of war , Lebanese find respite on southern beach", "date": "2024-06-12 04:30", "url": "https://www.yahoo.com/news/shadow-war-lebanese-respite-southern-034540373.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Life goes on but \"the children are frightened\", the 60-year-old told AFP from the beach in Tyre, about 20 kilometres (12.4 miles) from the Israel-Lebanon frontier.\nLebanon's Hezbollah, a Hamas ally, and Israel have been trading near-daily fire since the Gaza war was trigged by the Palestinian militant group's October 7 attack on southern Israel.\n\"Let them (Israel) sit with their fear and we will sit with a beer,\" he added.\nSummer tourism, in large part driven by Lebanese expatriates, is a crucial source of income for Tyre residents and small businesses.\n\"Despite the security situation... people (in the south) have no other outlet but this beach,\" he said."}, {"id": "4abd108a-e5d2-4dc9-849a-0b1981ba1d0b", "title": "US Plans  Hellscape  Drone Swarm In A Taiwan War", "date": "2024-06-12 05:45", "url": "https://menafn.com/1108322565/US-Plans-Hellscape-Drone-Swarm-In-A-Taiwan-War", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Asia Times) The US plans to turn the Taiwan Strait into a“Hellscape” of drone swarms against a possible Chinese invasion of Taiwan, buying time for US and allied intervention to assist the beleaguered self-governing island in a war scenario.\nThis month, The Washington Post reported that the US Indo-Pacific Command, led by Admiral Samuel Paparo, has announced a“Hellscape” strategy to use drone swarms to thwart any potential Chinese invasion of Taiwan.\nFor instance, Asia Times has noted that the US Navy's drone budget would fall to US$101.8 million in 2025, down from $172 million this year.\nThe US has thusly surged the development and deployment of drone swarms in the Pacific through its Replicator Program.\nIn September 2023, Asia Times reported that the US Department of Defense (DOD) had introduced the Replicator Program to accelerate the deployment of autonomous expendable platforms for air, land and sea operations."}, {"id": "d925742f-c3be-485d-b574-fb726b171b88", "title": "In shadow of war , Lebanese find respite on southern beach", "date": "2024-06-12 04:15", "url": "https://www.digitaljournal.com/world/in-shadow-of-war-lebanese-find-respite-on-southern-beach/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Life goes on but “the children are frightened”, the 60-year-old told AFP from the beach in Tyre, about 20 kilometres (12.4 miles) from the Israel-Lebanon frontier.\nLebanon’s Hezbollah, a Hamas ally, and Israel have been trading near-daily fire since the Gaza war was trigged by the Palestinian militant group’s October 7 attack on southern Israel.\n“Let them (Israel) sit with their fear and we will sit with a beer,” he added.\nSummer tourism, in large part driven by Lebanese expatriates, is a crucial source of income for Tyre residents and small businesses.\n“Despite the security situation… people (in the south) have no other outlet but this beach,” he said."}, {"id": "aafd2640-012d-4c75-a1cc-c62ff6c61221", "title": "Ukraine Azov hails US lifting weapons ban", "date": "2024-06-12 02:45", "url": "https://www.citizen.co.za/news/news-world/ukraines-azov-hails-us-lifting-weapons-ban/", "domain": "citizen.co.za", "domain_classification": "Unknown", "message": "Ukraine’s Azov hails US lifting weapons banThe original \"Azov battalion\" was blighted by accusations that some members held openly far-right and extremist views.\n(Photo by Roman PILIPEY / AFP)Ukraine’s Azov brigade on Tuesday welcomed Washington’s decision to allow it access to US military aid, lifting a decade-long ban imposed over the unit’s initial hardline nationalist ideology.\nThe US State Department said it had conducted a “thorough review” of the current Azov brigade and found “no evidence” of human rights violations.\nWashington also said the current Azov brigade is different from the initial militia unit, meaning it can access US-supplied weapons.\n“This is a new page in the history of our brigade,” Azov said on social media."}, {"id": "75a48e87-bd51-4dec-9f66-c97643d9a473", "title": "Afghanistan war vet Sam Brown secures Republican nomination in Nevada Senate primary", "date": "2024-06-12 04:15", "url": "https://nypost.com/2024/06/11/us-news/afghanistan-war-vet-sam-brown-secures-republican-nomination-in-nevada-senate-primary/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Sam Brown defeated his Republican rivals in Nevada’s Senate primary Tuesday and will face incumbent Sen. Jacky Rosen (D-Nevada) in November.\nBrown, a Purple Heart and Bronze Star recipient who served in the war in Afghanistan, received 56.8% of the GOP primary vote.\nX / @CaptainSamBrownOn the Democratic side, Rosen easily defeated her primary opponents, winning with 92.5% of the vote.\nThe Nevada Senate race could determine which party controls the upper chamber next year, and the Silver State appears to be leaning red in 2024.\nSen. Catherine Cortez Masto (D-Nevada) narrowly defeated Trump-backed Republican Adam Laxalt in Nevada’s 2022 Senate race, beating the state’s former attorney general by less than 1 percentage point."}, {"id": "f9fe1472-ed51-4e6f-ab4f-5d700382fdcf", "title": "Multibillion - euro court battle over jets stranded in Russia begins in Dublin", "date": "2024-06-12 05:45", "url": "https://www.euractiv.com/section/global-europe/news/multibillion-euro-court-battle-over-stranded-russian-jets-begins-in-dublin/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "Some of the world’s largest aircraft lessors faced off against their insurers in a Dublin courtroom on Tuesday (11 June) at the start of a months-long battle over around €2.5 billion of insurance claims related to jets stranded in Russia.\nLloyd’s of London, Chubband Fidelis are among the insurers contesting the claims.\nOthers have argued that lessors voluntarily ended leasing agreements or that Western sanctions prevent insurers from providing cover.\nThe world’s biggest aircraft lessor, Irish-based AerCap, is pursuing its insurance claims through London’s High Court, with what its lawyers have described as a “mega trial” due to start in October.\nSince launching their lawsuits, lessors have secured settlements with Russia totalling more than $2.5 billion for more than 100 jets, with ownership transferred to Russian airlines."}, {"id": "bb976abb-b5e1-4efa-92c3-49351334068c", "title": "29th Marine Commandant Al Gray personal items set for auction", "date": "2024-06-12 00:30", "url": "https://www.marinecorpstimes.com/veterans/military-history/2024/06/11/29th-marine-commandant-al-grays-personal-items-set-for-auction/", "domain": "marinecorpstimes.com", "domain_classification": "Unknown", "message": "Quinn’s Auction Galleries will auction items from the estate of the 29th Marine Corps Commandant Gen. Al Gray and his late wife Jan Gray.\nA separate auction scheduled for Thursday contains the general’s personal Marine Corps and military service items.\nA glass hand grenade among the items for auction in the estate sale of the late Gen. Al Gray, 29th Marine Corps Commandant.\nHe continued his connection to the Corps through a variety of nonprofits and charities such as the Marine Corps Association and Foundation.\nThe dog tags of the late Gen. Al Gray, 29th Marine Corps commandant, part of an estate auction in June."}, {"id": "d8d23c70-3c56-4fd1-9b55-a45232eba4b6", "title": "In shadow of war , Lebanese find respite on southern beach", "date": "2024-06-12 04:30", "url": "https://www.al-monitor.com/originals/2024/06/shadow-war-lebanese-find-respite-southern-beach", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "Life goes on but \"the children are frightened\", the 60-year-old told AFP from the beach in Tyre, about 20 kilometres (12.4 miles) from the Israel-Lebanon frontier.\nLebanon's Hezbollah, a Hamas ally, and Israel have been trading near-daily fire since the Gaza war was trigged by the Palestinian militant group's October 7 attack on southern Israel.\n\"Let them (Israel) sit with their fear and we will sit with a beer,\" he added.\nSummer tourism, in large part driven by Lebanese expatriates, is a crucial source of income for Tyre residents and small businesses.\n\"Despite the security situation... people (in the south) have no other outlet but this beach,\" he said."}, {"id": "fccb82b7-97ae-4cdb-9819-48cef463c678", "title": "  The Acolyte  Episode 3 Ending Explained : How Were the Twins Conceived ? ", "date": "2024-06-12 02:45", "url": "https://decider.com/2024/06/11/the-acolyte-episode-3-ending-explained/", "domain": "decider.com", "domain_classification": "Unknown", "message": "However, The Acolyte Episode 3 “Destiny” takes us back sixteen years in the past to show us what really went down on Mae and Osha’s homeworld of Brendok…or does it?\n**Spoilers for The Acolyte Episode 3 “Destiny,” now streaming on Disney+**The Acolyte Episode 3 “Destiny” shows us a pivotal day in the lives of young twins Mae (Leah Brady) and Osha (Lauren Brady).\nHere’s what you need to know about The Acolyte Episode 3…Photo: Disney+The Acolyte Episode 3 Ending Explained: Did The Jedi Kill the Coven?\nSo what really happened in The Acolyte Episode 3 “Destiny?” Well, it’s looking an awful lot like the Jedi did in fact murder Mae and Osha’s family.\nHere’s hoping we get more information on how Mae and Osha were conceived and how it might be connected to Anakin."}, {"id": "57339d69-9e83-46b0-af2b-3c82d4f6ac5e", "title": "Israel , Hamas committed war crimes in Gaza : UN", "date": "2024-06-12 13:45", "url": "https://www.orissapost.com/israel-hamas-committed-war-crimes-in-gaza-un/", "domain": "orissapost.com", "domain_classification": "Unknown", "message": "Geneva: Both Israel and Hamas in the Gaza Strip have committed war crimes since the conflict there erupted October 7 last year, according to a report by the UN Human Rights Council Wednesday.\n“It is imperative that all those who have committed crimes be held accountable,” said the chair of the UN Human Rights Council Commission, Navi Pillay.\nThe commission lists attacks on civilians, torture, inhumane and cruel treatment and hostage-taking as war crimes committed by the military arm of the Islamist Hamas movement and six other armed groups.\nThe report, presented in Geneva, is written by a commission of independent experts appointed by the UN Human Rights Council.\nThe UN Human Rights Office has repeatedly spoken of war crimes on both sides."}, {"id": "658f1e16-0a49-4d11-b7d4-ee0c01405f2a", "title": "F1 news - Max Verstappen explains Russell - pleasing swerve , Canada GP advice", "date": "2024-06-12 00:00", "url": "https://www.planetf1.com/news/max-verstappen-george-russell-pleasing-groundhog-swerve-canada-gp-advice", "domain": "planetf1.com", "domain_classification": "Unknown", "message": "We have another batch of major Formula 1 headlines for you in the Tuesday news round-up, fresh off of a thrilling Canadian Grand Prix.\nMax Verstappen has been talking us through his fast reactions which saved a groundhog, and delighted George Russell, who received some crucial advice from the Championship leader after a chance to win the Canadian Grand Prix agonisingly slipped away.\nBut, seeing Russell was “a bit upset”, Verstappen looked to reassure the Brit, as “these things can happen”.\nBut, with Red Bull exercising an option in Tsunoda’s contract for 2025, the Japanese racer confirmed that the pressure remains on, as he has been given no assurances on his Red Bull status for 2026.\nRead more – Yuki Tsunoda shares crucial contract detail after signing new Red Bull deal"}, {"id": "1297a73a-26a0-4720-85b2-f6a61b7c26be", "title": "Activision Clarifies Call of Duty : Black Ops 6 Wont Require 300 GB Download", "date": "2024-06-12 01:45", "url": "http://www.gamenguide.com/articles/105633/20240610/activision-clarifies-call-duty-black-ops-6-won-t-require.htm", "domain": "gamenguide.com", "domain_classification": "Unknown", "message": "Activision Clarifies Call of Duty: Black Ops 6 Won’t Require 300 GB DownloadActivision has clarified that Call of Duty: Black Ops 6 will not require a 300 GB download, despite what was previously stated.\nThis does not reflect the actual download size or disk footprint for Black Ops 6 that players will experience.\"\nPlayers will have the option to download only Call of Duty: Black Ops 6 without additional language packs.\nCall of Duty: Black Ops 6 is Treyarch's latest addition to the Black Ops series, revealed earlier this year.\nRelated Article: Xbox Reveals Call of Duty: Black Ops 6's Enormous 309.85 GB Install Size"}, {"id": "b4c58cbc-1f65-4b65-8b68-0615ccd6def6", "title": "Santa Clarita Grocery Volunteer Shares First - Hand Account of Battle Of The Bulge", "date": "2024-06-12 02:15", "url": "https://www.hometownstation.com/santa-clarita-news/hometown-heroes-our-veterans/santa-clarita-grocery-volunteer-shares-first-hand-account-of-battle-of-the-bulge-510761", "domain": "hometownstation.com", "domain_classification": "Unknown", "message": "A volunteer with the Santa Clarita Grocery told his first-hand account as a child in Belgium during the Battle of the Bulge.\nGerman soldiers still used horses against modern cars and tanks the American soldiers were equipped with.\nGet breaking KHTS Santa Clarita News Alerts delivered right to your inbox.\nSanta Clarita news and features are delivered throughout the day over our airwaves, on our website and through a variety of social media platforms.\nA vibrant member of the Santa Clarita community, the KHTS broadcast signal reaches all of the Santa Clarita Valley and parts of the high desert communities located in the Antelope Valley."}, {"id": "a9120481-cb32-4e9f-9d32-91a579f155c1", "title": "Russia Calls For Swift Release Of Its Nationals Held By Hamas", "date": "2024-06-12 12:00", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-russia-calls-for-swift-release-of-its-nationals-held-by-hamas", "domain": "i24news.tv", "domain_classification": "Unknown", "message": "Russia's Human Rights Commissioner Tatyana Moskalkova on Tuesday announced that she appealed to senior United Nations (UN) and other officials to take action to secure the release of Russian nationals held by Hamas in the Gaza Strip after eight months after their kidnapping.\nAccording to her post on Telegram messaging app, Moskalkova launched the appeal after meeting in Moscow with relatives of those still being held.\nThere are 116 hostages left in Gaza, including at least 40 whom Israeli authorities have declared dead in absentia.\nNews reports have put at eight the number of hostages holding Russian passports, including three who were released.\nEarlier in May, the Palestinian Islamic Jihad (PIJ), a Gazan terrorist group, released a psychological warfare video of Alexander Troufanov, another Russian-Israeli dual national held hostage in the Strip."}, {"id": "0993ecfd-366b-4557-8676-5eec8716951c", "title": "Increased Effort Targeting Burglaries Announced in La Cañada Flintridge", "date": "2024-06-12 02:45", "url": "https://kfiam640.iheart.com/content/2024-06-11-increased-effort-targeting-burglaries-announced-in-la-caada-flintridge/", "domain": "kfiam640.iheart.com", "domain_classification": "Unknown", "message": "LA CAÑADA FLINTRIDGE (CNS) - La Cañada Flintridge officials Tuesday announced an increased enforcement effort to combat burglaries in the city.\n\"In collaboration with the Crescenta Valley (Sheriff's) Station, the City of La Cañada Flintridge will begin stepping up current burglary suppression efforts to ensure the safety and well-being of its residents,\" the city said in a statement.\nRobert G. Hahnlein of the Crescenta Valley Sheriff's Station.\nAnyone seeing suspicious activity was urged to call the sheriff's station at 818-248-3464.\nMore information on crime prevention in the city is available at https://cityoflcf.org/Home-Burglary-Prevention/ and at https://lasd.org/Crescenta-Valley/ ."}, {"id": "9b6d0f11-bee1-4f6c-b06e-153251cdb8f6", "title": "Go guns blazing in new Call of Duty – Gadget", "date": "2024-06-12 00:30", "url": "https://gadget.co.za/blackops6/", "domain": "gadget.co.za", "domain_classification": "Unknown", "message": "Black Ops 6, the next instalment in the iconic Call of Duty military series, has been unveiled.\nThis movement type is a first for Call of Duty.\nMultiplayer Maps: 16 new maps, with twelve Core 6v6 maps and four small-sized Strike maps designed for 2v2 or Face Off 6v6 matches.\nCall of Duty: Black Ops 6 is published by Activision, with development led by Treyarch and Raven Software, and additional support from multiple studios including Infinity Ward and Sledgehammer Games.\n* Preorder ‘Call of Duty: Black Ops 6’ here."}, {"id": "e06b755f-b6f2-4c91-a9f4-bb7af5a066be", "title": "Lok Sabha Polls 2024 : Air Force Played Vital Role During Lok Sabha Polls , Flew Over 1 , 000 Hours", "date": "2024-06-12 12:15", "url": "https://www.ndtv.com/india-news/lok-sabha-polls-2024-air-force-played-vital-role-during-lok-sabha-polls-flew-over-1-000-hours-5874322", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "(Representational)From extending the reach of the Election Commission into remote corners of the country to airlifting EVMs, the IAF played a vital role in the recently-held general elections, with its aircraft flying more than 1,000 hours in over 1,750 sorties.\nThe Indian Air Force on Wednesday shared details about the helping hand it lent to the electoral machinery in the conduct of the Lok Sabha polls.\n\"The IAF played a vital role in five of the seven phases of the general elections, flying over 1,000 hours in over 1,750 sorties,\" it said.\nThe ECI had declared results for 542 of the 543 Lok Sabha constituencies, with the BJP winning 240 seats and the Congress 99.\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"id": "d707b872-cd4a-4451-9cab-c5fa77f302b9", "title": "House of the Dragon Dragons Vhagar , Vermithor , Caraxes , and More", "date": "2024-06-12 02:45", "url": "https://www.tvguide.com/news/house-of-the-dragon-dragons-guide-vermithor-vhagar/", "domain": "tvguide.com", "domain_classification": "Unknown", "message": "These fiery creatures that ferry the members of House Targaryen through battle and into the history books are as vital a part of this story as the humans.\nALSO READ: House of the Dragon character guideHere's your guide to the dragons of House Targaryen and where they stand at the start of House of the Dragon Season 2.\nBut both dragon and rider were attacked and killed in a stormy altercation by Vhagar, the dragon ridden by Aemond Targaryen, Luke's uncle and adversary.\nStatus After Season 1: DeadCaraxesDragonrider: Daemon TargaryenCaraxes, House of the Dragon HBO/ScreengrabHistory: Known as the Blood Wyrm, Caraxes is the perfect companion to his rider, Daemon.\nStatus After Season 1: AliveVermaxDragonrider: Jacaerys \"Jace\" VelaryonVermax, House of the Dragon HBO/ScreengrabHistory: This young, green scaled dragon is ridden by Rhaenyra's oldest son and heir, Jace."}, {"id": "341530ea-0a25-4c73-8e54-d26e728809a5", "title": "Riding along with the heavily - armed environmentalists trying to save the Amazon | Day 6 | Live Radio", "date": "2024-06-12 01:45", "url": "https://www.cbc.ca/listen/live-radio/1-14-day-6/clip/16071876-riding-along-heavily-armed-environmentalists-trying-save-amazon", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Get caught up on the week without ruining your weekend.\nHost Brent Bambury delivers an energetic mix of must-hear stories carefully chosen to keep you in the loop and keep you guessing.\nReady when you are on Saturday mornings.\nAnd heads up — there will be a quiz."}, {"id": "40fcb35b-b019-4208-9b04-859c34785185", "title": "Biden speaks on gun safety after his son is found guilty on firearms charges", "date": "2024-06-12 02:45", "url": "https://www.asiaone.com/world/biden-speaks-gun-safety-after-his-son-found-guilty-firearms-charges", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "WASHINGTON — President Joe Biden showcased his administration's efforts to cut down on illegal gun trafficking and reduce crime at a gun violence prevention summit on June 11, just hours after his son Hunter was convicted of lying about his drug use to illegally buy a gun.\nBiden praised the survivors of gun violence for their determination not to focus on their anger, but on what they can do to prevent more tragedies.\nThrough their words and actions, Biden said the survivors ensure that \"all the victims of gun violence are not forgotten.\nDemocrats largely favour stricter gun laws as a way to reduce deaths from gun violence at schools and in cities across the country.\nTrump, who in May won the endorsement of the nation's top gun rights group, has pledged to unravel gun regulations put in place by Biden."}, {"id": "a8c02951-c74e-482c-a82e-1dc7d27b0634", "title": "The Nightscarred : Forgotten Gods on Steam", "date": "2024-06-12 00:45", "url": "https://store.steampowered.com/app/2427530/The_Nightscarred_Forgotten_Gods", "domain": "store.steampowered.com", "domain_classification": "Unknown", "message": "Craft your own spells, creatively combine them with Nightscarred's hybrid combat system, and assassinate your foes to restore balance in a physics-driven shamanic world based on Turkic mythology.\nStart as a villain and evolve into a morally grey character as the game unfolds.The Nightscarred: Forgotten Gods features a linear story with unforgettable characters, foes, and environments.The mortal world is in peril.\nScarce resources, isolated heroes, and indifferent gods plunge the mortal world into chaos.\nOur father, Erlik, seeks to invade the mortal world by taking advantage of this situation.\nCombine them as you wish with Nightscarred's hybrid combat system to defeat your foes."}, {"id": "0fa12bd2-e2be-4b95-b57c-c7ae767eadf5", "title": "UN  shocked  at Israeli hostage rescue impact on Gaza civilians", "date": "2024-06-12 06:15", "url": "https://www.the-star.co.ke/news/world/2024-06-12-un-shocked-at-israeli-hostage-rescues-impact-on-gaza-civilians/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "The UN human rights office says it is “profoundly shocked” at the impact on civilians of the Israeli operation in central Gaza that rescued four hostages held by Hamas.\nPalestinian health officials said hundreds of people were killed and injured in the densely-populated Nuseirat refugee camp on Saturday.\nIsrael’s mission to the UN in Geneva accused the UN human rights office of “slander”.\nAccording to the Israel Defense Forces (IDF), the Israeli commandos took Ms Argamani’s Hamas guards by surprise and quickly killed them.\nMore than 37,120 people have been killed in Gaza since then, according to the Hamas-run health ministry."}, {"id": "797a22f6-a3e8-4581-a371-6beff4bed6b2", "title": "Border Security : Canada Front Line - Sky Mix", "date": "2024-06-12 08:45", "url": "https://www.tvguide.co.uk/schedule/ca4c59e3-a5a7-5960-add8-c4167dde16e6/border-security-canadas-front-line", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "© 2024 Digitalbox Publishing Ltd TV Listings.\nAll right reserved & trademarks acknowledged."}, {"id": "6e8957dd-9a53-4e6e-a778-505ae068a6ee", "title": "Dragon Age : The Veilguard Combat Allows for Chaining Abilities , Class Resources Explained", "date": "2024-06-12 12:00", "url": "https://gamingbolt.com/dragon-age-the-veilguard-combat-allows-for-chaining-abilities-class-resources-explained", "domain": "gamingbolt.com", "domain_classification": "Unknown", "message": "Following its extended gameplay reveal of Dragon Age: The Veilguard, BioWare has dropped several details about the upcoming RPG.\nAs noted here, enemies have different resistances and weaknesses, and players will have a large skill tree with plenty of options.\nYou can specialize in damaging specific foes or focus more on healing (with healing magic returning), among other choices.\nWhile Warriors and Mages weren’t detailed, the former can perform a shield toss and build around that with the skill tree.\nDragon Age: The Veilguard launches in Fall for Xbox Series X/S, PS5 and PC."}, {"id": "940b8b29-0c9b-4262-a862-33c4c983ac9c", "title": "How to Play Star Wars : Hunters on PC or Mac | Easy Emulator Setup Guide", "date": "2024-06-12 13:45", "url": "https://n4g.com/news/2603562/how-to-play-star-wars-hunters-on-pc-or-mac-easy-emulator-setup-guide", "domain": "n4g.com", "domain_classification": "Unknown", "message": "50°Star Wars: Hunters Tops App Store Downloads in the US, UK, and CanadaIn a galaxy not so far away, a new game has taken the mobile gaming world by storm.\nStar Wars: Hunters, a multiplayer arena combat game developed by Zynga and Lucasfilm Games, has achieved an impressive milestone.\nOn its launch day, the game clinched the number one spot for downloads…"}, {"id": "883e8e46-17e9-405b-8e6d-83d5958fcd73", "title": "Russian forces stalled in Vovchansk – Ukraine commander - in - chief", "date": "2024-06-12 10:15", "url": "https://www.yahoo.com/news/russian-forces-stalled-vovchansk-ukraines-080140853.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Source: Syrskyi on social mediaQuote: \"The enemy has been stalled in Vovchansk, despite deploying significant personnel and assets, which are continually reinforced by units from other areas.\"\nThe commander-in-chief has reported on the situation in these areas.\nSyrskyi says Russian forces are conducting active offensive actions of varying intensity along the entire combat zone, focusing their main efforts on the Pokrovsk and Kurakhove fronts.\nRussian forces are rushing to the town of Siversk from two directions, but each time they are being driven back, Syrskyi explained.\nThe commander-in-chief reported that fighting for control of the bridgehead and the islands persists near the village of Krynky, with no significant changes for either side."}, {"id": "6e5143de-292a-4123-b722-eb52d9373600", "title": "The Korean trash battle could have chilling consequences", "date": "2024-06-12 13:45", "url": "https://www.niagarafallsreview.ca/opinion/columnists/the-korean-peninsula-trash-battle-could-have-chilling-consequences/article_c4f5e490-1f22-5e88-b678-edbc26e681c2.html", "domain": "niagarafallsreview.ca", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "0bcbd86c-6ed5-4b70-b526-de1196df8658", "title": "The French Connection actor Tony Lo Bianco dead at 87", "date": "2024-06-12 14:30", "url": "https://www.dailymail.co.uk/tvshowbiz/article-13522315/The-French-Connection-actor-Tony-Lo-Bianco-dead-87.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "The French Connection actor Tony Lo Bianco has died at the age of 87.\nLo Bianco passed away after a long battle with cancer, his family shared on Wednesday.\n'Tony Lo Bianco passed away last night at his horse farm in Maryland after a battle with prostate cancer.\nThe French Connection actor Tony Lo Bianco has died at the age of 87.\nLo Bianco passed away after a long battle with cancer, his family shared on Wednesday'Tony Lo Bianco passed away last night at his horse farm in Maryland after a battle with prostate cancer."}, {"id": "4ca0c159-a7f3-4c4d-b4cd-7379f51b29fe", "title": "UN report shows dozens of children forcibly recruited by PKK terrorists", "date": "2024-06-12 14:00", "url": "https://www.dailysabah.com/politics/war-on-terror/un-report-shows-dozens-of-children-forcibly-recruited-by-pkk-terrorists", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "An upcoming United Nations report indicates the practice of forced recruitment of children is still prevalent in the PKK terrorist group.\nAnadolu Agency (AA) on Wednesday published parts of the \"Children and Armed Conflict\" report containing 2023 data on the issue.\nThe report shows PKK’s Syrian wing, the YPG, and other entities affiliated with the terrorist group forcibly recruited 231 children last year.\nThe PKK/YPG and associated groups killed or maimed eight children in 2023, the report says.\nIn September 2019, a group of women started a sit-in strike in the southeastern Turkish province of Diyarbakır over PKK’s recruitment of children, including minors."}, {"id": "b340085d-90d9-420f-b614-f0623b0ac9ec", "title": "Navy Relieved 12 Commanders in 6 Months Including 3 Firings that Were Never Publicly Announced", "date": "2024-06-12 02:30", "url": "https://www.military.com/daily-news/2024/06/11/navy-relieved-12-commanders-6-months-including-3-firings-were-never-publicly-announced.html", "domain": "military.com", "domain_classification": "Unknown", "message": "In addition to the nine publicly announced firings, Capt.\nDavid Wilson, commander of Naval Support Activity South Potomac, were also relieved of their commands in the past six months, a Navy spokesman said.\nHowever, commanders can also be relieved for medical reasons or ask to be relieved themselves, the Navy spokesman noted.\nFinally, also in January, the Navy fired the commander of the USS Georgia's blue crew -- Capt.\nTwo of the 12 fired Navy commanders were chaplains assigned to the Coast Guard."}, {"id": "23601baf-cfb7-40e5-881e-40e77db73dfb", "title": "Opinion : Literary protest against the war in Gaza has gone off the rails", "date": "2024-06-12 13:15", "url": "https://us.cnn.com/2024/06/12/opinions/israel-gaza-silencing-jewish-literary-voices-prusher/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "Ilene Prusher Jordana MillerBut something about this year’s Jerusalem International Writers Festival, which was held late last month, was off.\nThe festival’s artistic director, Julia Fermentto-Tzaisler, thought about whether the beloved book festival should happen this year at all.\nA shadow over the literary worldExamples abound of how fallout from the ongoing war is casting a shadow over the literary world.\nTo be sure, these are not the only cancelations the literary world has experienced related to the war; nor are Jewish writers the only ones who have faced controversy.\nFrom the start of this war, it seems I’m much more therapist than writer,” she read in a lilting Hebrew."}, {"id": "7322ebc5-8f42-43f5-a8fa-0f409f671808", "title": "DAILY MAIL COMMENT : Can this general election manifesto turn the tide for Conservatives ? ", "date": "2024-06-12 00:15", "url": "https://www.dailymail.co.uk/news/article-13519937/DAILY-MAIL-COMMENT-general-election-manifesto-turn-tide-Conservatives.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "With the launch of the Tory manifesto, the election got real.\nWith the launch of the Tory manifesto, the election got real.\nSo it was welcome to hear Mr Sunak invoke Margaret Thatcher by saying that tax-cutting is a moral mission.\nAnd, discouragingly, no plan to cut income tax.\nThe Tories must hope it is not too little, too late, to persuade a weary electorate to let Mr Sunak get on with the vital job of rebuilding Britain."}]