[{"id": "d3e06e2a-345b-4331-a478-d453ceba0767", "title": "Jewish American Heritage Month : 87 - year - old Meyerland woman Edith Jucker shares her Holocaust survival story", "date": "2024-05-30 01:30", "url": "https://abc13.com/post/jewish-american-heritage-month-87-year-meyerland-woman/14888332/", "message": "'My world changed overnight': 87-year-old Edith Jucker shares her Holocaust survival storyHOUSTON, Texas (KTRK) -- Edith Jucker was only 2 years old when the Nazis invaded Poland, triggering the start of World War II on Sept. 1, 1939.\nJucker and her mom stayed there for three years in what she described as deplorable conditions.\nJucker and her mother stayed at a temporary shelter until they could find an apartment.\n\"That's proof that Hitler cannot win and only love can survive the hate,\" Jucker said.\nNot just to Jewish people, but to any human beings in the world.\""}, {"id": "7e039d2b-abd3-4600-97f9-a5946305c72e", "title": "In conversation with Oxford Action for Palestine ( OA4P ) ", "date": "2024-05-30 05:00", "url": "https://www.cherwell.org/2024/05/29/an-interview-with-oxford-action-for-palestine-oa4p/", "message": "A member of the Oxford Action for Palestine (OA4P) press team spoke exclusively to Cherwell at the protest outside the Sheldonian Theatre on Tuesday afternoon.\nThe interview covered topics including OA4P’s response to last week’s arrests, their demands for the University, and their future plans.\nWhen asked about the organisation’s future plans, the spokesperson told Cherwell OA4P demands that: “the Vice-Chancellor meets our demands and meets us for negotiations.\nThat is our number one priority.” They explained that future actions by the group will “all depend on her [the Vice-Chancellor’s] complicity and her silence…if she responds, we’re willing to meet with her.”The spokesperson continued: “OA4P is not just the encampment…we’re not stopping until we meet,” explaining that the organisation has long-term plans in place “because we do want our demands to be met in part of our tenures here.”Regarding the University’s response to their protests, the spokesperson told Cherwell: “It’s very clear that we have not been satisfied with any of the responses from the University, particularly the University calling the police on our protestors last week.” Speaking more directly in relation to the arrests of 16 students last week after a sit-in in University offices, they described the police’s response as “brutalisation”, calling the University “ignorant, complicit, and scapegoating [the protestors].” The spokesperson said that this response has “only fueled the fire in terms of how we [OA4P] act [going] forward.”Focusing on the reasons for the protest this afternoon, the spokesperson described how “there are no universities left in Gaza while congregation meets… our aim today is to support the faculty members who are bravely standing up against the genocide in Gaza.” They continued: “a lot of the questions being asked in the congregation has to do with divestment, not only in the genocide in Gaza, but largely in illgeal arms manufacturing”, describing the event as “a continuation against the genocide in Gaza.”In response to the arrests of OA4P protestors during their occupation of the Oxford University offices last week, they said that “protestors did not go into a peaceful sit-in expecting to be arrested.” However, she acknowledged the risks some protestors face, saying: “we have continuously advocated for people to assess their own risk levels, and whilst doing so acknowledge that we are the privileged ones, and that we are willing to use our time and resources if it means that we can help alleviate the genocide in Gaza.”The spokesperson declined to comment on the allegations that some members of the encampment had used antisemitic language towards some Jewish Oxford Students, in relation to the St Hugh’s JCR Vice-President’s resignation a few days prior.\nHowever, another member of OA4Ps press team pointed out that an open letter was sent by “senior Jewish professors” at the University, describing a “disapproval in the way Irene Tracey has been weaponising antisemitism against the student protests”."}, {"id": "3dc22920-5711-4557-ada2-cff40e593bdc", "title": "Keir Starmer is told to show Diane Abbott some  respect  amid Labour civil war over  shambolic  handling of race - row - as 37 - year veteran MP defies leader and says she will stand and not be  intimidated  ", "date": "2024-05-30 02:15", "url": "https://www.dailymail.co.uk/news/article-13474159/Diane-Abbott-Sir-Keir-Starmer-Labour-civil-war.html", "message": "The Labour Party was embroiled in a civil war last night as Sir Keir Starmer was warned he must show Diane Abbott 'respect' amid the 'shambolic' handling of the row.\nAsked whether he believed Sir Keir was trying to purge the left of the Labour Party, he said: 'It looks like it.'\nMr Starmer is now facing anger from even his allies at Labour's treatment of Ms Abbott.\nMr Starmer later told reporters that 'no decision has been taken to bar Ms Abbott'.\nHis playful trip came as Sir Keir continued his own campaign for No 10 by hosting a Q&A session."}]