[{"id": "e42a798d-fa52-4006-a1d2-b55ae31717c5", "title": "Australia raises terror threat level as radicalisation spreads", "date": "2024-08-05 05:00", "url": "https://www.businesstimes.com.sg/international/australia-raises-terror-threat-level-radicalisation-spreads", "domain": "businesstimes.com.sg", "domain_classification": "Unknown", "message": "AUSTRALIA has raised the nation’s terrorism threat level for the first time since 2014 as fears grow inside the intelligence community about online radicalisation and community unrest over the Israel-Hamas war.\n“More Australians are embracing a more diverse range of extreme ideologies, and it is our responsibility to be vigilant,” Albanese said.\n“Governments around the world are concerned about youth radicalisation, online radicalisation and the rise of new mixed ideologies.”The government lowered the terrorism threat level in November 2022, saying the threat from religious extremism had reduced.\n“ASIO anticipates an increase in politically motivated violence, including terrorism across all ideological spectrums,” Burgess said.\n“Attacks are likely to occur with little or no warning and will be difficult to detect.” BLOOMBERG"}, {"id": "b29e52cf-829e-4b1e-a562-85ba02fdb7d0", "title": "  Squad  member Cori Bush faces Democratic primary putting a spotlight on Israel", "date": "2024-08-05 21:30", "url": "https://www.nbcnews.com/politics/2024-election/squad-member-cori-bush-faces-democratic-primary-putting-spotlight-isra-rcna165120", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "Bell has consistently maintained that Israel has the right to defend itself against Hamas and said he would be supportive of the U.S. ally if elected.\nBush accused Israel of an “ethnic cleansing campaign” as the country retaliated.\nA group of 30 rabbis from the area endorsed Bell in the spring and accused Bush of antisemitism.\nBush confirmed the federal investigation but referred to the complaints as “baseless.”Both Bush and Bell argued that the race is about more than just the Middle East.\nOn Friday, Rep. Katherine Clark, a member of House Democratic leadership, traveled to Missouri to stump for Bush."}]