[{"id": "b01a5b16-141f-40bf-a1f9-dbe04bbe1a32", "title": "Hawaii could be threatened by tropical cyclone in Pacific Ocean", "date": "2024-08-21 00:45", "url": "http://www.sfchronicle.com/weather/article/hawaii-could-be-threatened-by-tropical-storm-19667371.php", "domain": "sfchronicle.com", "domain_classification": "Unknown", "message": "Weather satellite imagery captured a disorganized area of showers and thunderstorms in the Pacific Ocean on Tuesday afternoon, the beginnings of a likely tropical storm that may impact Hawaii this weekend.\nThere is a much lower probability of reaching Category 1 hurricane strength, with sustained winds of at least 74 mph.\nAdvertisement Article continues below this adThe storm’s name will depend on exactly where in the Pacific it reaches tropical storm strength.\nThe National Hurricane Center previously predicted 1-4 named storms in the central Pacific this year, down from the usual 4-5.\nThe most recent tropical storm to make landfall on the Big Island was Tropical Storm Darby in 2016."}, {"id": "34d4f184-de73-4833-a589-e4ef8f0742a4", "title": "One year since Hilary : Here what happened when the storm hit", "date": "2024-08-21 01:45", "url": "https://www.yahoo.com/news/one-since-hilary-happened-storm-232100686.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "One year since Hilary: Here’s what happened when the storm hitOne year since Hilary: Here’s what happened when the storm hitSAN DIEGO (FOX 5/KUSI) — Tuesday marks one year since remnants of Tropical Storm Hilary unleashed historic torrential downpours on Southern California.\nAhead of the storm making landfall, the National Hurricane Center issued a tropical storm watch for the first-time ever in California, and later a tropical storm warning.\nPHOTOS: Tropical Storm Hilary moves through San DiegoNonetheless, it dropped significant rain on Southern California, notably in desert and mountain areas.\nMeanwhile, peak wind gusts in San Diego County reached speeds of around 70 miles per hour to 84 miles per hour, according to NWS.\nFor the latest news, weather, sports, and streaming video, head to FOX 5 San Diego & KUSI News."}, {"id": "5078e86c-b88c-4920-86a3-2be26040aed9", "title": "Disaster declaration approved for Vermont for July flooding from remnants of Beryl - LocalNews8 . com", "date": "2024-08-21 04:00", "url": "https://localnews8.com/news/national-world/ap-national/2024/08/20/disaster-declaration-approved-for-vermont-for-july-flooding-from-remnants-of-beryl/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "MONTPELIER, Vt. (AP) — President Biden has approved a major disaster declaration for Vermont that makes federal funding available to help people and communities affected by flooding from July 9 through July 11 caused by the remnants of Hurricane Beryl.\nThe storm dumped more than 6 inches of rain in just a few hours on parts of Vermont.\nVermont’s governor has made a separate disaster declaration request for flooding from storms on July 30.\nKIFI Local News 8 is committed to providing a forum for civil and constructive conversation.\nYou can review our Community Guidelines by clicking hereIf you would like to share a story idea, please submit it here."}, {"id": "24c7c9fd-74cd-4cb5-be52-45538846cebf", "title": "Looking back at Hurricane Debby : Floods , rain , tornadoes and more", "date": "2024-08-21 18:30", "url": "https://www.wmnf.org/looking-back-at-hurricane-debby-floods-rain-tornadoes/", "domain": "wmnf.org", "domain_classification": "Unknown", "message": "Tropical Storm Debby pushed into southern Georgia on Monday after making landfall on Florida’s Big Bend coast and killing at least one person.\nDebby struck Florida’s Big Bend, just 15 miles away from where Hurricane Idalia made landfall last August.\npic.twitter.com/3FHPT0YLJG — Jonathan Erdman (@wxjerdman) August 5, 2024Debby was the second hurricane of the 2024 Atlantic hurricane season, following the deadly and devastating Hurricane Beryl.\nDebby, which formed Aug. 2, was also quite early: on average, the second Atlantic hurricane usually forms on Aug. 26, according to Colorado State University hurricane researcher Phil Klotzbach.\nTropical Storm #Debby has formed in the southeastern Gulf of Mexico – the 4th named storm of the 2024 Atlantic #hurricane season."}, {"id": "b0db5a1b-af6b-43e0-a5a9-1e5bd1726f9a", "title": "Hurricane Ernesto losses for Puerto Rico insurers contained within reinsurance limits", "date": "2024-08-21 18:30", "url": "https://www.insurancebusinessmag.com/au/news/reinsurance/hurricane-ernesto-losses-for-puerto-rico-insurers-contained-within-reinsurance-limits-502385.aspx", "domain": "insurancebusinessmag.com", "domain_classification": "Unknown", "message": "Since 2017, premium ceded by these companies to reinsurance firms has more than doubled.\nWhile some companies have reduced their exposures due to a reassessment of risk tolerance in response to rising reinsurance costs, renewals for 2023 and 2024 have been less turbulent, and rate increases have moderated in 2024.\nInsurers have indicated that, to date, losses from Hurricane Ernesto are expected to remain within reinsurance limits."}, {"id": "9fea1d34-455f-4cb3-bebe-9d11c1e76915", "title": "Hurricane Ernesto losses for Puerto Rico insurers contained within reinsurance limits", "date": "2024-08-21 18:45", "url": "https://www.insurancebusinessmag.com/us/news/reinsurance/hurricane-ernesto-losses-for-puerto-rico-insurers-contained-within-reinsurance-limits-502381.aspx", "domain": "insurancebusinessmag.com", "domain_classification": "Unknown", "message": "Since 2017, premium ceded by these companies to reinsurance firms has more than doubled.\nWhile some companies have reduced their exposures due to a reassessment of risk tolerance in response to rising reinsurance costs, renewals for 2023 and 2024 have been less turbulent, and rate increases have moderated in 2024.\nInsurers have indicated that, to date, losses from Hurricane Ernesto are expected to remain within reinsurance limits."}, {"id": "02d2921b-647e-4452-af0c-13ce2149982f", "title": "Debby by the Numbers : Floods , Rain , Tornadoes And More", "date": "2024-08-21 03:15", "url": "https://www.wuft.org/weather/2024-08-20/debby-by-the-numbers-floods-rain-tornadoes-and-more", "domain": "wuft.org", "domain_classification": "Unknown", "message": "It's been more than 2 weeks since Debby smashed into Florida's Big Bend and triggered a life threatening storm surge, widespread flash floods, massive power outages and spawned multiple tornadoes.\nTropical Storm Debby pushed into southern Georgia on Monday after making landfall on Florida’s Big Bend coast and killing at least one person.\nDebby is expected to move offshore into the Atlantic Ocean, with winds pushing surf back toward the shoreline.\npic.twitter.com/3FHPT0YLJG — Jonathan Erdman (@wxjerdman) August 5, 2024Debby was the second hurricane of the 2024 Atlantic hurricane season, following the deadly and devastating Hurricane Beryl.\nTropical Storm #Debby has formed in the southeastern Gulf of Mexico - the 4th named storm of the 2024 Atlantic #hurricane season."}, {"id": "c4cfac50-ffec-4320-b505-1f78644b36e8", "title": "Debby by the Numbers : Floods , Rain , Tornadoes And More", "date": "2024-08-21 05:15", "url": "https://www.southcarolinapublicradio.org/sc-news/2024-08-20/debby-by-the-numbers-floods-rain-tornadoes-and-more", "domain": "southcarolinapublicradio.org", "domain_classification": "Unknown", "message": "@WNCN pic.twitter.com/yP9ebW0Ez1 — Deana Harley (@Deanaharleynews) August 8, 2024Hurricane Debby became a tropical depression on August 3rd and then a tropical storm soon after.\nTropical Storm #Debby has formed in the southeastern Gulf of Mexico - the 4th named storm of the 2024 Atlantic #hurricane season.\nAround 2 a.m. on Aug. 8, Debby made a second landfall near Bulls Bay, South Carolina, with sustained winds near 50 mph.\nDuring a five-day period, dozens of cities and towns across South Carolina saw rainfall totals of more than a foot.\nTropical Storm #Debby will go down as number 2 for producing the most amount of rain in a tropical system in the state of South Carolina."}, {"id": "18320f7a-ae3d-4092-9fdd-736296132df1", "title": "Wexford County Council issue high tide warning due to impact of supermoon", "date": "2024-08-21 14:00", "url": "https://www.independent.ie/regionals/wexford/news/wexford-county-council-issue-high-tide-warning-due-to-impact-of-supermoon/a13508563.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Wexford County Council has issued a warning for people to take care in coastal areas due to high tides caused by the supermoon.\nMet Éireann issued a high tide advisory for all coasts which comes into effect at noon today (Wednesday) and remains in place until noon on Friday, August 23.\nIt is advised that during this period of supermoon spring tides, Highest Astronomical Tide (HAT) is expected to be exceeded in certain areas around the coast.\nIreland will also be affected by strong winds and increased storm surge form the remnants of Hurricane Ernesto.\nA combination of these strong onshore winds, high spring tides and significant waves may result in some localised coastal flooding and wave overtopping in the coming days."}, {"id": "208c80a8-3f0d-4770-84d3-a13a73fde6dc", "title": "FORECAST : Storm chances going up ! ", "date": "2024-08-21 18:30", "url": "https://www.abc15.com/weather/most-accurate-forecast-monsoon-storm-chances-are-ramping-up-across-arizona", "domain": "abc15.com", "domain_classification": "Unknown", "message": "PHOENIX — Phoenix is in the middle of the longest stretch of triple-digit days ever!\nThe previous record was 76 consecutive triple-digit days set in August of 1993.\nAs storm chances go up, forecast temperatures will drop closer to normal for this time of year.\nThat will clear out monsoon storm chances across our state and drive up temperatures.\n__________________________________________PHOENIX IS GETTING DRIER - LOWER RAINFALL AVERAGES NOWAverage Monsoon Rainfall in Phoenix (1981-2010): 2.71\" of rainNEW Average Monsoon Rainfall in Phoenix (1991-2020): 2.43\" of rainAverage Yearly Rainfall in Phoenix (1981-2010): 8:03\" of rainNEW Average Yearly Rainfall in Phoenix (1991-2020): 7.22\" of rain__________________________________________Share your weather photos and videos with us anytime."}, {"id": "b8554acc-33a6-4956-b715-00c90f40a10d", "title": "Connecticut flooding : Why it has peaked , breaking previous records", "date": "2024-08-21 15:15", "url": "https://www.bostonglobe.com/2024/08/21/metro/connecticut-flash-flooding-rain-storms-vermont/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Training storms develop when separate thunderstorms repeatedly move over the same area, generating from the outflow of previous storms.\nThey act as a trigger for thunderstorms and in the Connecticut and Vermont flooding events, that zone of convergence barely moved.\nMeteorologists said the Connecticut flooding was unrelated to Hurricane Ernesto, which by Monday was over the open Atlantic Ocean.\nExtreme flooding events in the Northeast have increased by 60 percent between the 1950s and now.\nWarming ocean currents off Connecticut are 10 times more likely due to climate change, according to the Climate Central Climate Shift Index."}, {"id": "6b12a0f2-d717-4ac9-94cc-4c000ae80ab0", "title": "Puerto Rico Insurers to Absorb Hurricane Ernesto Losses : AM Best", "date": "2024-08-21 08:45", "url": "https://www.insurancejournal.com/news/national/2024/08/21/789308.htm", "domain": "insurancejournal.com", "domain_classification": "Unknown", "message": "Losses in Puerto Rico from Hurricane Ernesto are expected to be absorbed by the island’s domiciled insurers, according to industry rating AM Best.\nThe rating agency said premiums in Puerto Rico had been flat for years prior to hurricanes Maria and Irma in 2017.\nAlso, unaffiliated Puerto Rico-domiciled companies have accounted for a growing share of total Puerto Rico NPW.\nAdditionally, premium ceded for the unaffiliated Puerto Rico-domiciled companies to reinsurance companies has more than doubled since 2017.\nPhoto: Broken electricity lines above homes damaged after Tropical Storm Ernesto hit Fajardo, Puerto Rico, on Aug. 14, 2024."}, {"id": "69fdb1e2-4081-42ca-b400-33de12827151", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast – Winnipeg Free Press", "date": "2024-08-21 17:45", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/21/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "“It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,” says the study, published Tuesday in the journal Nature Communications.\nTrees burned by the Bush Creek East Wildfire are seen above Little Shuswap Lake in Squilax, B.C., Monday, Sept. 11, 2023.\n“In 2023, we had the most extreme fire weather conditions on record over much of the country,” said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n“By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,” said Jain."}, {"id": "5d7504c0-b973-48aa-8170-9d5654be457e", "title": "Hurricane Ernesto weather warning issued as storm to bring heavy rain and strong winds", "date": "2024-08-21 07:45", "url": "https://www.manchestereveningnews.co.uk/news/uk-news/hurricane-ernesto-weather-warning-issued-29779477", "domain": "manchestereveningnews.co.uk", "domain_classification": "Unknown", "message": "The Met Office has issued a yellow weather warning from 11am on Wednesday to 8am on Thursday.\nGusts of up to 60mph and persistent rain could bring some “dangerous conditions” to some areas, the Met Office has warned.\nREAD MORE: Mum of city centre rioter, 16, who racially abused police officer tells judge 'he's just gone out with friends'A yellow weather warning for rain has been issued in Scotland, covering western and southern areas.\nRemnants of Hurricane Ernesto, which ripped through the North Atlantic last week, are playing a “background role” in the downpours and windy weather this week, according to the weather agency.\nMet Office meteorologist Dan Rudman said temperatures are likely to be “around or slightly below average for the time of year”."}, {"id": "1e044621-6894-4dfe-a6ce-3249e33434bc", "title": "Storm Warnings in Place Across Europe , From Northern Greece to Poland", "date": "2024-08-21 12:00", "url": "https://www.insurancejournal.com/news/international/2024/08/21/789367.htm", "domain": "insurancejournal.com", "domain_classification": "Unknown", "message": "Thunderstorm alerts are in place for a swath of Europe from Poland and Hungary to Italy and Greece.\nThere are orange warnings for northern Greece, as the summer heat gives way to violent storms and the risk of flooding.\nSerbia and Kosovo face similar alerts, while much of Italy is under a yellow storm warning.\nThere’s also a yellow warning for heavy rain in the west of Scotland, while the Gironde in southwest France is on flood alert.\n⚠️ Yellow weather warning UPDATED 📷Heavy rain across western ScotlandValid 1100 Wednesday to 0800 ThursdayLatest info 👉 https://t.co/QwDLMfRBfsStay #WeatherAware⚠️ pic.twitter.com/pCigWi4vAN— Met Office (@metoffice) August 21, 2024Photograph: Lightning striking over Nice, France, on Aug. 14, 2024."}, {"id": "1779cf6c-5582-4746-afd7-e7cbe22be69e", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast | iNFOnews", "date": "2024-08-21 11:00", "url": "https://infotel.ca/newsitem/cda-wildfires/cp1097929311", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coastTrees burned by the Bush Creek East Wildfire are seen above Little Shuswap Lake in Squilax, B.C., Monday, Sept. 11, 2023.\n\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "88c066ae-8799-4f3c-bff1-3093003a3dc1", "title": "Met Office yellow weather warnings across united kingdom on Thursday as  summer air mixes with Hurricane Ernesto  ", "date": "2024-08-21 14:00", "url": "https://www.walesonline.co.uk/news/uk-news/met-office-yellow-weather-warnings-29783114", "domain": "walesonline.co.uk", "domain_classification": "Unknown", "message": "Yellow weather warnings for rain and wind have been issued across the UK for Thursday as humid summer air mixes with the remains of Hurricane Ernesto.\nUp to 6in (150mm) of rain and strong winds of up to 60mph could affect some areas over a 24-hour period, with flooding, dangerous coastal conditions and power cuts possible, the Met Office said.\nThe forecaster has issued a yellow warning for rain for the western half of Scotland, covering the Highlands, south-west Scotland and Strathclyde, from 11am on Wednesday to 8am on Thursday.\nSeparate yellow warnings for wind covering northern Wales and northern England, including both Cumbria and Northumberland, have been issued from 1am to 9am on Thursday.\nThe Scottish Environment Protection Agency has issued 21 flood alerts, meaning flooding is expected, across the Orkney and the Western Isles, and coastal areas in Moray and Dumfries and Galloway."}, {"id": "79a81657-e970-48ad-ab6d-b898dbf463e0", "title": "When Will Climate Change Turn Life in the U . S . Upside Down ? ", "date": "2024-08-21 16:30", "url": "https://worth.com/when-will-climate-change-turn-life-in-the-u-s-upside-down/", "domain": "worth.com", "domain_classification": "Unknown", "message": "It is inevitable that climate change will stop being a hazy future concern and will someday turn everyday life upside down.\nIn the U.S., climate change has already turned life upside down for numerous communities.\nClimate change was a key contributor to these floods; a 2021 study found that about one-third of the cost of major U.S. flood events since 1988, totaling $79 billion, could be attributed to climate change.\nDevastating impacts from climate change are acceleratingThough climate change itself is not accelerating faster than what climate scientists and climate models predicted, devastating impacts from climate change do seem to be accelerating.\nEven if such an event did prompt strong, transformative change, it’s too late to avoid having life turned upside-down by climate change."}, {"id": "b14b5f79-add8-4e27-8982-b30731461dc5", "title": "What should you do to prepare for the climate change storm ? ", "date": "2024-08-21 08:00", "url": "https://skepticalscience.com/prepare-climate-storm.html", "domain": "skepticalscience.com", "domain_classification": "Unknown", "message": "What should you do to prepare for the climate change storm?\nOn a personal level, you should prepare for the intensifying climate change storm like you would for an approaching major hurricane.\n(Image credit: rebuildbydesign.org)The tools above merge the physical and environmental risks from climate change with the societal risks that exacerbate weather and climate extremes.\nThe 2023 National Climate Assessment has individual chapters detailing how climate change is expected to unfold for 10 U.S. regions.\nMoneyThose with wealth will be much better positioned to weather the coming climate change storm."}, {"id": "17687ba7-0493-4b1e-8c4f-ab2d31366e34", "title": "Gilma could strengthen to Category 3 hurricane in coming days , forecasters say", "date": "2024-08-21 17:15", "url": "https://www.bostonglobe.com/2024/08/21/world/gilma-hurricane-second-of-season/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma became the second hurricane of this year’s eastern Pacific Ocean season on Wednesday and was forecast to strengthen into a major hurricane by the end of the week as it remains away from land.\nThis satellite image provided by NOAA shows Hurricane Gilma located west-southwest of the southern tip of the Baja California peninsula of Mexico, Wednesday, Aug. 21, 2024.\nThe Category 1 storm was located about 965 miles (1,553 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nThe storm could become a Category 3 hurricane over the coming days, forecasters said.\nHurricane-force winds extended outward up to 30 miles (48 km) from the center and tropical-storm-force winds extend outward up to 140 miles (225 km)."}, {"id": "cf840bd3-35e4-45c3-8310-7d7aa8f0e771", "title": "The geography of Oceania - BBC Bitesize", "date": "2024-08-21 18:30", "url": "https://www.bbc.co.uk/bitesize/topics/z8kydnb/articles/zb63r2p", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "Most of Oceania is in the Southern Hemisphere.\nThere are fourteen countries in Oceania, including Papua New Guinea, New Zealand and Australia.\nOceania is mostly surrounded by ocean.\nThe Indian Ocean is to the south and the North Pacific Ocean and the South Pacific Ocean are to the west.\nMost countries in Oceania are south of the Equator."}, {"id": "08f9edb5-f9d8-4f7b-88c2-fd3c3d780d30", "title": "Rain and wind warnings issued as warm air mixes with Hurricane Ernesto", "date": "2024-08-21 16:30", "url": "https://www.thetelegraphandargus.co.uk/news/national/24533078.rain-wind-warnings-issued-warm-air-mixes-hurricane-ernesto/", "domain": "thetelegraphandargus.co.uk", "domain_classification": "Unknown", "message": "The forecaster has issued a yellow warning for rain for the western half of Scotland, covering the Highlands, south-west Scotland and Strathclyde, from 11am on Wednesday to 8am on Thursday.\nSeparate yellow warnings for wind covering northern Wales and northern England, including both Cumbria and Northumberland, have been issued from 1am to 9am on Thursday.\nStrong winds of around 50mph, “associated with” the rain, will blow fairly widely in the areas covered by the warning, while gusts of around 60mph could occur in exposed locations.\nThe Environment Agency has also issued two flood warnings – for Hornsea in the East Riding of Yorkshire and the Wye Estuary in Monmouthshire, near the historic Tintern Abbey.\nFlooding impacts are expected across western and northern Scotland on Wednesday into Thursday due to heavy rain, high spring tides and wave surge."}, {"id": "062cb798-e931-4d54-968a-2a095e947dc1", "title": "Gilma becomes the 2nd hurricane of the eastern Pacific season and is forecast to stay away from land", "date": "2024-08-21 10:30", "url": "https://www.yahoo.com/news/gilma-becomes-2nd-hurricane-eastern-095051822.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Gilma becomes 2nd hurricane of eastern Pacific season and is forecast to strengthen away from landThis satellite image provided by NOAA shows Hurricane Gilma located west-southwest of the southern tip of the Baja California peninsula of Mexico, Wednesday, Aug. 21, 2024.\n(NOAA via AP)MEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season on Wednesday and was forecast to strengthen into a major hurricane by the end of the week as it remains away from land.\nThe Category 1 storm was located about 965 miles (1,553 kilometers) west-southwest of the southern tip of the Baja California peninsula of Mexico, according to the National Hurricane Center in Miami.\nThe storm could become a Category 3 hurricane over the coming days, forecasters said.\nHurricane-force winds extended outward up to 30 miles (48 kilometers) from the center and tropical-storm-force winds extend outward up to 140 miles (225 kilometers)."}, {"id": "d8686c7b-b37e-4625-b414-3000a610ba56", "title": "What Hawaiʻi needs to know about Japan megaquake warnings", "date": "2024-08-21 18:15", "url": "https://www.yahoo.com/news/hawai-needs-know-japan-megaquake-160000801.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "What Hawaiʻi needs to know about Japan’s megaquake warningsHONOLULU (KHON2) — In early August, Japan issued a significant warning about the possibility of a mega quake.\nDr. Blanpied explained that these colossal quakes usually occur at subduction zones, where one tectonic plate is forced beneath another.\n“In these regions, stress accumulates over long periods because the plates are not moving smoothly,” Dr. Blanpied noted.\nThe 2011 Tōhoku EarthquakeThe 2011 Tōhoku earthquake, also known as the Great East Japan Earthquake, is a prime example of a megaquake.\nFor travelers to earthquake-prone regions, Dr. Blanpied recommended staying informed about local hazards and knowing safety protocols."}, {"id": "ca6ed901-54b2-49b6-824e-a7fc274c0906", "title": "Wetlands Institute director pushes plan to save marshes", "date": "2024-08-21 16:00", "url": "https://pressofatlanticcity.com/news/local/government-politics/middle-township-wetlands-institute/article_1afdfe24-5f38-11ef-8603-1b03072d8b6d.html", "domain": "pressofatlanticcity.com", "domain_classification": "Unknown", "message": "MIDDLE TOWNSHIP — There should be some wetlands near the Wetlands Institute, Executive Director Lenore Tedesco told the Township Committee on Monday.\nSimilar efforts have taken place historically, according to the Army Corps, but they have gained attention since Superstorm Sandy in 2012.\nFounded in the 1960s, the Wetlands Institute sought to change those attitudes, through education and a better understanding of the wetland ecosystem.\nStone Harbor kindergarteners assist in terrapin release at Wetlands Institute Kindergarten students from Stone Harbor Elementary School saw a year’s worth of wildlife education and science lessons pay off as they helped release diamondback terrapins raised at Stockton University back into the wild Wednesday at the Wetlands Institute.\nAt one point, the Wetlands Institute tried planting the marsh, but it did nothing to improve the erosion."}, {"id": "adac1437-35ba-4fa1-a262-c06da8a9317c", "title": "Light earthquake : M4 . 4 quake has struck near Atocha in Bolivia", "date": "2024-08-21 18:45", "url": "https://www.earthquakenewstoday.com/2024/08/21/light-earthquake-m4-4-quake-has-struck-near-atocha-in-bolivia-3/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Wednesday, 77 km SW of Atocha, Bolivia (48 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact time and date of earthquake 21/08/24 / 2024-08-21 17:00:32 / August 21, 2024 @ 5:00 pm UTC/GMT.\nThe earthquake occurred at a depth of 208.742 km (130 miles).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 77 km SW of Atocha, Bolivia."}, {"id": "2ed057a9-681d-4807-823c-398a532c9ecc", "title": "Light earthquake : M4 . 3 quake has struck near Lorengau in Papua New Guinea", "date": "2024-08-21 13:45", "url": "https://www.earthquakenewstoday.com/2024/08/21/light-earthquake-m4-3-quake-has-struck-near-lorengau-in-papua-new-guinea-7/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Sunday, 173 km SE of Lorengau, Papua New Guinea (107 miles).\nThe earthquake occurred at a depth of 10 km (6 miles).\nThe 4.3-magnitude earthquake was detected at 07:16:46 / 7:16 am (local time epicenter).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 173 km SE of Lorengau, Papua New Guinea."}, {"id": "33d4abce-8023-4365-8e2a-2f91de524919", "title": "Forecasters say hurricane season about to become active", "date": "2024-08-21 18:15", "url": "https://www.aol.com/forecasters-hurricane-season-become-active-170651439.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "The climatological peak of the Atlantic hurricane season is just a few weeks away and forecasters say conditions are looking favorable for the development of tropical systems.\nAccording to the Climate Prediction Center, forecasters say there is a higher than 60% chance of a storm developing in the open Atlantic Ocean between August 28 and September 3.\nForecasters also believe there is a better than 40% chance of a storm developing in the region from September 4-10.\nHurricane Beryl is the only major hurricane so far this year, becoming the earliest-forming Category 5 in the Atlantic on record.\n“Sea surface temperatures remain abnormally high, and La Nina is still expected to emerge during the hurricane season, so the time to prepare is now.”Hurricane season typically peaks on September 10."}, {"id": "03a47d9a-cc2e-4e74-83e0-1e09fa22a278", "title": "Riding out the storm : post - Ernesto fitness comeback", "date": "2024-08-21 12:00", "url": "https://www.royalgazette.com/wellness/lifestyle/article/20240821/riding-out-the-storm-post-ernesto-fitness-comeback/", "domain": "royalgazette.com", "domain_classification": "Unknown", "message": "Let’s dive into the essentials of hurricane fitness prep, guilt-free snacking, and bouncing back after the storm has passed.\nYour fitness goals didn’t wash away with the storm surge ― they’re still there, waiting for you to pick up where you left off.\n5, Forgive and forget: if you didn’t stick to your fitness goals or overindulged during the storm, let it go.\nAs usual, remain unapologetic about your fitness and wellness journey, stay true to yourself and always be honest with your efforts.\nShe specialises in nutrition, weight and sprint training, operating out of HindsSight Fitness and Wellness at the Berkeley Cultural Centre."}, {"id": "b24b40a8-4bda-4806-af6e-98218083279a", "title": "Light earthquake , 4 . 8 mag was detected near Corinto in Nicaragua", "date": "2024-08-21 18:45", "url": "https://www.earthquakenewstoday.com/2024/08/21/light-earthquake-4-8-mag-was-detected-near-corinto-in-nicaragua/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.8 (ml/mb) was detected on Wednesday, 89 kilometers (55 miles) from Corinto in Nicaragua.\nThe earthquake occurred at a depth of 34.282 km (21 miles) below the earth’s surface.\nId of earthquake: us7000n8h2.\nEvent epicenter was 90 km (56 miles) from Corinto (c. 19 200 pop), 96 km (60 miles) from El Realejo (c. 6 200 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 89 km SSW of Corinto, Nicaragua."}, {"id": "c50ff6b4-583f-40a9-802f-26d614682da6", "title": "NWS : Learn about hurricane paths , impacts , and outlook at community forum", "date": "2024-08-21 16:30", "url": "https://www.wcti12.com/news/local/nws-learn-about-hurricane-paths-impacts-and-outlook-at-community-forum", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "The National Weather Service is holding a free hurricane community forum on Wednesday, August 21, 2024.\nThe forum will be held at Faison Fire & Rescue located at 108 SW Center Street from 6:30 pm to 7:30 pm.\nNWS Meteorologist Erik Heden is overseeing the discussion to cover topics on hurricane path tracks, hurricane categories, and impacts of tropical cyclones.\nIt will also cover the hurricane outlook for the year.\nAttendees will get the option to ask questions following the presentation."}, {"id": "b2a591fa-5df8-4f38-b456-1f8308dbc5de", "title": "Light earthquake : M4 . 4 quake has struck near Lospalos in Timor Leste", "date": "2024-08-21 08:45", "url": "https://www.earthquakenewstoday.com/2024/08/21/light-earthquake-m4-4-quake-has-struck-near-lospalos-in-timor-leste-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Thursday, 194 km NE of Lospalos, Timor Leste (121 miles).\nGlobal date and time of event UTC/GMT: 01/08/24 / 2024-08-01 03:25:42 / August 1, 2024 @ 3:25 am.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nAll ids that are associated to the event: us7000n7xv.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 194 km NE of Lospalos, Timor Leste."}, {"id": "30aee46a-6a63-45de-b78e-673d1d128ecd", "title": "Timeline and rainfall of Hurricane Ernesto released", "date": "2024-08-21 12:00", "url": "https://www.royalgazette.com/weather/news/article/20240821/timeline-and-rainfall-of-hurricane-ernesto-released/", "domain": "royalgazette.com", "domain_classification": "Unknown", "message": "At the same time, wind speeds by the airport were peaking at about 59mph with gust speeds at more than 71mph.\nMarops recorded top wind speeds of nearly 73mph at the same time, which were accompanied by 91mph wind gusts.\nHurricane Ernesto was the fifth named storm of the 2024 hurricane season, following Hurricanes Beryl and Debby and Tropical Storms Alberto and Chris.\nHowever, in a revised forecast released by the CSU, it predicted 25 named storms, including 12 hurricanes, half of which would become major hurricanes.\nThe National Hurricane Centre forecast an 85 per cent chance of a busier-than-average season with between 17 and 25 named storms, while Britain’s Met Office forecast 22 named storms during the season."}, {"id": "7bef8d49-e391-4670-9e0d-df4b36760b5e", "title": "Stay Storm - Ready With SB Tree Service : Your Trusted Neighbor for Hurricane Season Tree Care in Volusia and Flagler", "date": "2024-08-21 16:30", "url": "https://www.finanznachrichten.de/nachrichten-2024-08/63057235-stay-storm-ready-with-sb-tree-service-your-trusted-neighbor-for-hurricane-season-tree-care-in-volusia-and-flagler-200.htm", "domain": "finanznachrichten.de", "domain_classification": "Unknown", "message": "Prepare Your Property for Hurricane Season with Expert Tree Care from SB Tree Service-Safeguarding Homes in Volusia and Flagler Counties from Storm Damage.\nSB Tree ServiceImportance of Proper Pruning and MaintenanceProper tree care is crucial in minimizing storm damage and protecting properties.\nContact SB Tree ServiceFor more information on preparing trees for hurricane season or to schedule a free estimate, contact SB Tree Service today.\nAbout SB Tree ServiceSB Tree Service is a leading provider of tree care services in Volusia and Flagler County, FL.\nWith a team of ISA-certified arborists and tree care professionals, SB Tree Service is dedicated to offering professional, environmentally conscious tree care solutions."}, {"id": "c5ac9e0f-3c01-4e30-b3d4-95340039960e", "title": "Could Hawaii be impacted by developing tropical cyclones in the Pacific ? ", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/could-hawaii-impacted-developing-tropical-214048998.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Could Hawaii be impacted by developing tropical cyclones in the Pacific?\nDirect strikes on the archipelago are rare, but periods of increased waves and wind are more common with passing tropical cyclones.\nIn nearly all cases, these features act as barriers to tropical cyclones approaching the islands, rapidly leading to their weakening or dissipation.\nNOAA’s Central Pacific Hurricane Center, in coordination with the agency’s Climate Prediction Center, expects between one and four tropical cyclones to traverse the ocean, which is below the typical four to five tropical depressions, tropical storms and hurricanes.\nOriginal article source: Could Hawaii be impacted by developing tropical cyclones in the Pacific?"}, {"id": "f1e4c423-5396-49a9-bb78-270f12b128d9", "title": "Light earthquake 4 mag , 33 km E of Hualien City , Taiwan", "date": "2024-08-21 13:45", "url": "https://www.earthquakenewstoday.com/2024/08/21/light-earthquake-4-mag-33-km-e-of-hualien-city-taiwan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4 (ml/mb) was detected on Friday, 33 kilometers (21 miles) from Hualien City in Taiwan.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 31.153 km (19 miles).\nThe epicenter was 34 km (21 miles) from Hualian (c. 350 500 pop), 84 km (52 miles) from Yilan (c. 94 200 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 33 km E of Hualien City, Taiwan."}, {"id": "b5fdc982-f788-4665-bfa9-6e0a06bc2ca9", "title": "Coastal car parks shut as remnants of Hurricane Ernesto set to make landfall", "date": "2024-08-21 14:00", "url": "https://www.irishtimes.com/ireland/2024/08/21/weather-forecast-coastal-car-parks-shut-as-remnants-of-hurricane-ernesto-set-to-make-landfall/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "Photograph: NOAA via APGalway City Council has closed car parks in coastal areas in advance of expected high tides on Wednesday evening.\nA combination of the remnants of Hurricane Ernesto and very high tides could lead to flooding and wave overtopping.\nThe council has closed car parks in Galway city that are susceptible to flooding, including Silverstrand and Toft car parks.\nSalthill car park will be closed to the public from 1pm on Wednesday until further notice.\nAll coasts will be affected by strong winds, high waves, forecasted surges and high astronomical tides."}, {"id": "e0db420b-7fc3-4c95-9c9d-09a2002564fb", "title": "Areas in Cumbria where there are flood warnings and alerts", "date": "2024-08-21 18:30", "url": "https://www.thewestmorlandgazette.co.uk/news/24534084.areas-cumbria-flood-warnings-alerts/", "domain": "thewestmorlandgazette.co.uk", "domain_classification": "Unknown", "message": "Including Cumbria, where flooding is also very likely.\nThere are currently 15 #flood alerts and 4 flood warnings in place across the #NorthWest 💧⚠️.\nStay ahead of potential #flooding from rivers and the sea by signing up to the @EnvAgency #Flood Warning Service📲.\nSign up if you're eligible to get pre-warned, giving you time to… pic.twitter.com/JzqDurABnu — The Flood Hub (@TheFloodHub) August 21, 2024Here are the flood and weather warnings for Cumbria:So far we have received weather warning alerts for the following areas:Follow our live blog for more information and updates.\nSeparate yellow warnings for wind covering northern Wales and northern England, including both Cumbria and Northumberland, have been issued from 1am to 9am on Thursday."}, {"id": "864bdeaa-0ba8-4323-9158-569a6de13a8d", "title": "Western Alaska Yupik village floods as river rises from a series of storms", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/western-alaska-yupik-village-floods-234629059.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ANCHORAGE, Alaska (AP) — Storm-battered residents in the western Alaska village of Napakiak were preparing for the third storm in a week Tuesday, days after a minister had to use a front loader to free people from flooded homes.\nNapakiak, a Yup’ik village of about 350 residents in the Yukon-Kuskokwim Delta, was flooded Sunday after heavy rains swelled the Kuskokwim River.\nIt caught everyone by surprise because it wasn’t the normal spring or fall flooding, which residents prepare for, Hale said.\nIt’s so pervasive in Napakiak that the village school had to be closed this year because it’s close to falling into the river.\nThe weekend storms caused coastal flooding in several other western Alaska communities, but there were no reports of health issues or major property damage, state emergency officials said."}, {"id": "4af2319a-d170-438a-881d-7f5279433663", "title": "30 passengers rescued from bus during flooding in Wilton", "date": "2024-08-21 16:00", "url": "https://www.wfsb.com/2024/08/21/30-passengers-rescued-bus-during-flooding-wilton/", "domain": "wfsb.com", "domain_classification": "Unknown", "message": "WILTON, CT (WFSB) - Dozens of passengers were rescued from a bus that became trapped during flooding in Wilton on Sunday.\nWilton police said a CT Transit bus became stranded across Seeley Road when its driver tried to turn it around.\nApproximately 30 passengers were on the bus and had to get off into the water that was flooding the road.\n“Two officers, along with the help of a mother-son duo who reside on Seeley Road, shuttled all of the passengers and the bus driver to the Cannondale Train Station where they were picked up by a secondary bus,” police said.\nWilton police sought to extend their gratitude to everyone who rose to the occasion and helped them and community members during the historic flooding."}, {"id": "b30baaa1-a4d9-45c7-82d0-02357187c281", "title": "Western Alaska Yupik village floods as river rises from a series of storms", "date": "2024-08-21 00:30", "url": "https://www.kob.com/news/us-and-world-news/western-alaska-yupik-village-floods-as-river-rises-from-a-series-of-storms/", "domain": "kob.com", "domain_classification": "Unknown", "message": "ANCHORAGE, Alaska (AP) — Storm-battered residents in the western Alaska village of Napakiak were preparing for the third storm in a week Tuesday, days after a minister had to use a front loader to free people from flooded homes.\nNapakiak, a Yup’ik village of about 350 residents in the Yukon-Kuskokwim Delta, was flooded Sunday after heavy rains swelled the Kuskokwim River.\nIt caught everyone by surprise because it wasn’t the normal spring or fall flooding, which residents prepare for, Hale said.\nIt’s so pervasive in Napakiak that the village school had to be closed this year because it’s close to falling into the river.\nThe weekend storms caused coastal flooding in several other western Alaska communities, but there were no reports of health issues or major property damage, state emergency officials said."}, {"id": "3c0eaf8b-0c5b-40d9-b667-fb294f6c4617", "title": "Western Alaska Yupik village floods as river rises from a series of storms – Winnipeg Free Press", "date": "2024-08-21 00:15", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/20/western-alaska-yupik-village-floods-as-river-rises-from-a-series-of-storms", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "ANCHORAGE, Alaska (AP) — Storm-battered residents in the western Alaska village of Napakiak were preparing for the third storm in a week Tuesday, days after a minister had to use a front loader to free people from flooded homes.\nNapakiak, a Yup’ik village of about 350 residents in the Yukon-Kuskokwim Delta, was flooded Sunday after heavy rains swelled the Kuskokwim River.\nWater from an overflowing Kuskokwim River floods Napakiak, Alaska, Sunday, Aug. 18, 2024.\n(Job Hale via AP)It caught everyone by surprise because it wasn’t the normal spring or fall flooding, which residents prepare for, Hale said.\nIt’s so pervasive in Napakiak that the village school had to be closed this year because it’s close to falling into the river."}, {"id": "4f7f1682-2333-40f9-a4e6-ee143ee1c7c0", "title": "Experts warn 2024 could be hottest year on record", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/experts-warn-2024-could-hottest-212720636.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Experts warn 2024 could be hottest year on recordWASHINGTON (NEXSTAR) — Climate scientists warn this year is likely to be the hottest on record, according to a briefing by the National Oceanic and Atmospheric Administration.\nLast year, 2023, was the hottest year on record.\nThose include Hurricane Beryl, the earliest Category 5 hurricane on record, hailstorms in Colorado and wildfires in New Mexico.\n“We have instruments on the space station that are measuring what is happening to the Earth,” Nelson said.\nNOAA estimates, because of near record sea temperatures and the La Nina, the Atlantic could see eight to 13 hurricanes this year."}, {"id": "57f2021b-2b78-41f0-be1c-1ef94f55a2d8", "title": "Western Alaska Yupik village floods as river rises from a series of storms", "date": "2024-08-21 11:30", "url": "https://kstp.com/world/western-alaska-yupik-village-floods-as-river-rises-from-a-series-of-storms/", "domain": "kstp.com", "domain_classification": "Unknown", "message": "ANCHORAGE, Alaska (AP) — Storm-battered residents in the western Alaska village of Napakiak were preparing for the third storm in a week Tuesday, days after a minister had to use a front loader to free people from flooded homes.\nNapakiak, a Yup’ik village of about 350 residents in the Yukon-Kuskokwim Delta, was flooded Sunday after heavy rains swelled the Kuskokwim River.\nIt caught everyone by surprise because it wasn’t the normal spring or fall flooding, which residents prepare for, Hale said.\nIt’s so pervasive in Napakiak that the village school had to be closed this year because it’s close to falling into the river.\nThe weekend storms caused coastal flooding in several other western Alaska communities, but there were no reports of health issues or major property damage, state emergency officials said."}, {"id": "28e13b46-bfe6-4ffd-b377-7dd150e3ef00", "title": "Q & A : How advanced geocoding and PUIDS are revolutionizing peril risk assessment in insurance", "date": "2024-08-21 00:45", "url": "https://www.digitaljournal.com/business/qa-how-advanced-geocoding-and-puids-are-revolutionizing-peril-risk-assessment-in-insurance/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Charlton outlines the role that geocoding and PUIDs play in revolutionizing peril risk assessment for insurers.\nDigital Journal: How is rooftop geocoding essential for insurance companies to accurately price risk in areas prone to significant perils like hurricanes and wildfires?\nUnderwriters will be able to quickly and accurately price policies to risk data already linked to a PUID, eliminating operational overhead and increasing accuracy.\nWhat other tools are available to insurance carriers to improve risk assessment?\nFuture innovations in address technology and geocoding could significantly transform risk assessment in the insurance industry."}, {"id": "b5bfd593-d1a2-486f-879a-2e5cbfadf09b", "title": "Oxford schools address potential delays due to flooding", "date": "2024-08-21 02:30", "url": "https://www.wfsb.com/2024/08/20/oxford-schools-address-potential-delays-due-flooding/", "domain": "wfsb.com", "domain_classification": "Unknown", "message": "OXFORD, CT (WFSB) - Oxford Superintendent Dr. Robert Miller has announced a delay in the start of the school year due to extensive damage caused by Sunday’s storm.\nGovernor Ned Lamont has requested federal relief for parts of Western Connecticut impacted by the storm, which resulted in significant flooding.\nOxford’s superintendent Dr. Robert Miller has announced a later date for the start of the school year due to the town’s damage from Sunday’s storm.\nDr. Miller estimates that the school year may begin around September 3 but noted that the exact start date will be reassessed next week.\nThe decision to push back the start of school was made in collaboration with the First Selectman and our Police Department."}, {"id": "68dc18cd-1195-4016-b5df-28f2aaaf18b9", "title": "Valley fever cases rise to record high in California in 2023 : CDPH", "date": "2024-08-21 02:00", "url": "http://www.sfchronicle.com/health/article/valley-fever-cases-rise-record-high-california-19667254.php", "domain": "sfchronicle.com", "domain_classification": "Unknown", "message": "California is on track to surpass last year’s record-high cases of valley fever, a potentially debilitating infection caused by inhaling fungal spores in dirt or dust.\nBrontë Wittpenn/The ChronicleCalifornia in 2023 reported a record-high number of valley fever cases — a potentially debilitating infection caused by inhaling fungal spores in dirt or dust — and 2024 is on track to surpass that, state health officials said Tuesday.\nIn 2023, nearly 9,300 cases of valley fever were reported statewide, about triple the number from a decade ago, according to state data.\n“These were the highest first and second quarter for valley fever that we’ve ever had in the state of California,” Cooksey said.\nBut California health officials have noted surges in valley fever roughly two years after major droughts — followed by a wet winter — since the early 2000s."}, {"id": "07892f56-882b-4f48-9e92-6eddbdc5d162", "title": "NHC tracking 4 tropical waves in the Atlantic as we near peak of hurricane season", "date": "2024-08-21 14:45", "url": "https://www.yahoo.com/news/nhc-tracking-4-tropical-waves-100126739.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "NHC tracking 4 tropical waves in the Atlantic as we near peak of hurricane seasonThe National Hurricane Center is monitoring four tropical waves as we near the peak of the Atlantic hurricane season.\nAccording to forecasters, one system is situated near Senegal and Gambia, two in the Caribbean Sea and the fourth impacting the southwest Gulf of Mexico and southern Mexico.\nFOX 35 Storm Team Meteorologist Brooks Garner said the waves are not expected to develop – at least not right away.\n\"By, say day eight to ten, which is September 1st through September 3rd, there's a very likely chance we'll have a new system forming from one of these tropical waves, and that would be typical,\" Garner added.\nWhen is the peak of hurricane season?"}, {"id": "d8b0e3bf-4eec-4809-a315-836b56a426ec", "title": "Storm system tracking north , could bring heavy rain Saturday", "date": "2024-08-21 04:00", "url": "https://www.yahoo.com/news/storm-system-tracking-north-could-013503726.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "They are expected to merge Tuesday night and when they do a tropical depression or tropical storm will form the next day.\nThe storm is expected to strengthen as it moves into the central Pacific.\nThere is a possibility for strong winds and heavy rain when the storm approaches the islands during the weekend.\nIt is expected to impact Hawaii Island as it passes south Saturday afternoon and potentially impact Maui County Sunday, with impacts to Oahu starting on Monday.\nThe storm has the potential to be named Hector if it develops into a tropical storm and east of 140W, and it would be named Hone if it forms west of 140W."}, {"id": "6d066193-d2e7-4eca-be29-12182eaee960", "title": "Wildfires in Canada : Extreme weather fuelling flames", "date": "2024-08-21 11:15", "url": "https://www.ctvnews.ca/climate-and-environment/extreme-weather-fuelled-flames-coast-to-coast-largest-study-of-2023-wildfires-finds-1.7008427", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\nClimate models suggest that under the most extreme carbon emission scenarios, those conditions could be normal by 2050.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "fa9ed7bb-71b3-4216-971c-d3b390854a4c", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 09:15", "url": "https://www.thespec.com/news/canada/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast/article_2a0828f5-e32e-5518-98b1-49b8b3363396.html", "domain": "thespec.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "62711b6f-bea8-4558-a753-a785c0c118b4", "title": "Western Alaska Yupik village floods as river rises from series of storms", "date": "2024-08-21 11:15", "url": "https://www.naharnet.com:443/stories/en/307399-western-alaska-yup-ik-village-floods-as-river-rises-from-series-of-storms", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Storm-battered residents in the western Alaska village of Napakiak were preparing for the third storm in a week Tuesday, days after a minister had to use a front loader to free people from flooded homes.\nNapakiak, a Yup'ik village of about 350 residents in the Yukon-Kuskokwim Delta, was flooded Sunday after heavy rains swelled the Kuskokwim River.\nIt caught everyone by surprise because it wasn't the normal spring or fall flooding, which residents prepare for, Hale said.\nIt's so pervasive in Napakiak that the village school had to be closed this year because it's close to falling into the river.\nThe weekend storms caused coastal flooding in several other western Alaska communities, but there were no reports of health issues or major property damage, state emergency officials said."}, {"id": "33eb7b39-29af-41f1-98ad-a0d12527deb8", "title": "Zulu headquarters to be lifted , renovated to combat flooding | Business News", "date": "2024-08-21 12:15", "url": "https://www.nola.com/news/business/zulu-building-renovation-mardi-gras/article_515b2de8-5f2e-11ef-9f6c-a7fa4cbf9638.html", "domain": "nola.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "2ca251af-2f6e-428f-b60c-9c11c9b2240e", "title": "Conway residents still dealing with river flooding after Debby", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/conway-residents-still-dealing-river-221926742.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "CONWAY, S.C. (WBTW) — Waccamaw River flooding caused by Tropical Storm Debby forced many Conway residents to move their cars, call out of work, temporarily move or a combination of all three.\nThe entrances to Pitch Landing Road and Lees Landing Circle are currently blocked off by police cars.\nSome families trying to get to Conway’s Riverfront Park had to turn around after realizing how bad the flooding was.\nAlthough the river level is slowly falling, it’s still at major flood stage and will remain that way until about Friday.\nThe Stonebraker family is from Aynor and came to check out the flooding for themselves."}, {"id": "cb8ad0c9-f698-488f-99fd-7966b2c716da", "title": "Extreme weather fuelled fires coast to coast in 2023 , largest study finds", "date": "2024-08-21 13:45", "url": "https://www.nationalobserver.com/2024/08/21/news/extreme-weather-fires-2023-study", "domain": "nationalobserver.com", "domain_classification": "Unknown", "message": "\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nAlthough 2023 saw 834 large fires, only 60 of them were responsible for nearly three-quarters of the area burned.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "0eff50b0-b3da-4b8c-a2e8-a2acc85a9851", "title": "Smart health facilities triumph over Hurricane Beryl", "date": "2024-08-21 08:00", "url": "https://jamaica-gleaner.com/article/health/20240821/smart-health-facilities-triumph-over-hurricane-beryl", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "Hurricane Beryl provided a defining moment for the Mandeville and Santa Cruz health centres, which were two of the four facilities upgraded to ‘gold standard’ under the Strengthening Healthcare Facilities in the Caribbean (Smart Hospitals Programme Phase 2).\nNotably, preliminary assessments conducted after the storm revealed minimal damage to both health centres.\n“Having weathered the storm, these Smart Health Centres underscore the necessity of robust healthcare infrastructure in regions vulnerable to natural disasters.\nThe Smart facilities serve as a model for adaptation, essential in strengthening and safeguarding public health systems amid climate uncertainty,” said Ian Stein, PAHO/WHO Jamaica representative.\nFor her part, Judith Slater, British High Commissioner to Jamaica, said, “I was heartened, but not surprised, to learn that the Mandeville and Santa Cruz ‘Smart’ health centres withstood Hurricane Beryl’s worst to emerge with minimal damage."}, {"id": "9535bab0-14f8-4eb7-81c7-cb60ce363cba", "title": "Met Éireann issues High Tide Advisory for all coasts", "date": "2024-08-21 09:15", "url": "https://www.wlrfm.com/news/met-eireann-issues-high-tide-advisory-for-all-coasts-373228", "domain": "wlrfm.com", "domain_classification": "Unknown", "message": "Met Éireann has issued a High Tide Advisory for all coasts from 12 noon today (Wednesday) until 12 noon Friday.\nIt is advised that during this period of supermoon spring tides, Highest Astronomical Tide (HAT) are expected to be exceeded in areas around the coast.\nAccording to the forecaster, Ireland will be affected by strong winds and increased storm surge from the remnants of Hurricane Ernesto.\nA combination of strong onshore winds, high spring tides and significant waves may result in localised coastal flooding and wave overtopping in the coming days.\nAdvertisementWaterford City and County Council’s severe weather management team is monitoring the situation and Council ground crews will be on stand-by to put in place flood mitigation measures if the need arises."}, {"id": "19f1d93c-d5fe-44e3-a8fd-a6526b0730b5", "title": "Lancashire Fire Service to use drones to prevent devastating wildfires", "date": "2024-08-21 04:45", "url": "https://www.lancashiretelegraph.co.uk/news/24529630.lancashire-fire-service-utilise-fire-prevention-drones/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "They intend to use intelligent firefighting drones to suppress fires as part of an effort to develop cost-effective early mitigation strategies for wildfires.\nTo tackle the fires, they will utilise several robots to work together as a swarm to identify and suppress any risks.\nIn 2018, East Lancashire fire and rescue crews sent 60 firefighters to a blaze on Winter Hill which was roughly a kilometre in size.\nAdditionally, teams spent 41 days battling 18 square kilometres of wildfire on Winter Hill moorland near Bolton.\nThrough using thermal and optical imaging the drones can automatically detect and investigate fires and relay the information to the fire team."}, {"id": "e95151a4-b1d5-44f4-a70a-a8ac35c93b6c", "title": "Rain and wind warnings issued as warm air mixes with Hurricane Ernesto", "date": "2024-08-21 17:15", "url": "https://www.derrynow.com/news/northern-ireland/1584824/rain-and-wind-warnings-issued-as-warm-air-mixes-with-hurricane-ernesto.html", "domain": "derrynow.com", "domain_classification": "Unknown", "message": "Yellow weather warnings for rain and wind have been issued across the UK for Thursday as humid summer air mixes with the remains of Hurricane Ernesto.\nThe forecaster has issued a yellow warning for rain for the western half of Scotland, covering the Highlands, south-west Scotland and Strathclyde, from 11am on Wednesday to 8am on Thursday.\nSeparate yellow warnings for wind covering northern Wales and northern England, including both Cumbria and Northumberland, have been issued from 1am to 9am on Thursday.\nThe Environment Agency has also issued two flood warnings – for Hornsea in the East Riding of Yorkshire and the Wye Estuary in Monmouthshire, near the historic Tintern Abbey.\nFlooding impacts are expected across western and northern Scotland on Wednesday into Thursday due to heavy rain, high spring tides and wave surge."}, {"id": "ead8081a-ab1e-4bb8-ba3d-bab97833b692", "title": "Railroads hunker down as Hurricane Rita nears Texas , Louisiana ( 9 / 23 / 2005 ) - RailPrime | ProgressiveRailroading", "date": "2024-08-21 04:15", "url": "https://www.progressiverailroading.com/railPrime/details/Railroads-hunker-down-as-Hurricane-Rita-nears-Texas-Louisiana-9232005--67572", "domain": "progressiverailroading.com", "domain_classification": "Unknown", "message": "With Hurricane Rita bearing down on parts of Texas and Louisiana, ready to come ashore early tomorrow, freight and passenger railroads have been scrambling the past two days to batten down the hatches and prepare for the storm’s wrath.\nHowever, the railroad relocated all freight cars from Galveston Island, and moved inland other locomotives and cars threatened by potential flooding.\nComprising two TRE locomotives and six passenger cars, the train will be operated by a TRE crew provided by Herzog Transit Services Inc.\nKansas City Southern also is repositioning locomotives and cars away from points in Houston, Beaumont, Corpus Christi and Port Arthur, Texas.\nKCS also has embargoed traffic to Beaumont, Port Arthur, Port Neches and Chaison, Texas."}, {"id": "c1a26708-f2e5-4775-b222-681a128155c5", "title": "Lancashire Fire Service to use drones to prevent devastating wildfires", "date": "2024-08-21 08:45", "url": "https://www.theboltonnews.co.uk/news/24529630.lancashire-fire-service-utilise-fire-prevention-drones/", "domain": "theboltonnews.co.uk", "domain_classification": "Unknown", "message": "They intend to use intelligent firefighting drones to suppress fires as part of an effort to develop cost-effective early mitigation strategies for wildfires.\nTo tackle the fires, they will utilise several robots to work together as a swarm to identify and suppress any risks.\nIn 2018, East Lancashire fire and rescue crews sent 60 firefighters to a blaze on Winter Hill which was roughly a kilometre in size.\nAdditionally, teams spent 41 days battling 18 square kilometres of wildfire on Winter Hill moorland near Bolton.\nThrough using thermal and optical imaging the drones can automatically detect and investigate fires and relay the information to the fire team."}, {"id": "d20cf9be-7dee-477a-808e-6aed0cf1ccbc", "title": "Richmond Hill holds public comment to discuss flooding from Debby", "date": "2024-08-21 17:15", "url": "https://www.wtoc.com/2024/08/21/richmond-hill-holds-public-comment-discuss-flooding-debby/", "domain": "wtoc.com", "domain_classification": "Unknown", "message": "RICHMOND HILL, Ga. (WTOC) - Many communities across our area are still feeling the impact of major flooding in the wake of Tropical Storm Debby.\nCalls for more to help came in the form of public comment Tuesday in Richmond Hill.\nThe City of Richmond Hill held their first council meeting since the aftermath of Debby and the rise and fall of devastating flood waters.\nWe’ve followed cleanup efforts over the last several days with one man sharing the reality of the damage that water did.\n“80% to 90% of the homes in Rushing Street, a whole neighborhood, have lost their homes.”That area, Rushing Street, is where we saw people getting around in boat last week trying to save anything they could out of their homes."}, {"id": "c8c3832d-5aed-4a27-8abe-0cbc592a9135", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast - Medicine Hat NewsMedicine Hat News", "date": "2024-08-21 11:45", "url": "https://medicinehatnews.com/news/national-news/2024/08/21/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast/", "domain": "medicinehatnews.com", "domain_classification": "Unknown", "message": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coastBy Bob Weber, The Canadian Press on August 21, 2024.\n“It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,” says the study, published Tuesday in the journal Nature Communications.\n“In 2023, we had the most extreme fire weather conditions on record over much of the country,” said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n“By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,” said Jain."}, {"id": "b83a3241-c56b-46ef-a8ce-7a487b8dc7c7", "title": "Waves batter north coast as tail end of tropical storm arrives", "date": "2024-08-21 19:30", "url": "https://www.irishnews.com/news/northern-ireland/waves-batter-north-coast-as-tail-end-of-tropical-storm-arrives-VIIPAS7GR5HIBHOKHSMHN6TYR4/", "domain": "irishnews.com", "domain_classification": "Unknown", "message": "An observer watches the waves as the tail end of Hurricane Ernesto arrived in Portrush, Co Antrim.\nPICTURE: MARGARET MCLAUGHLINWaves have battered parts of the north as the tail end of Hurricane Ernesto moved across the Atlantic.\nThe weather front is the result of the remains of Hurricane Ernesto, which ripped through Puerto Rico earlier this week after forming in the Caribbean.\nPICTURE: MARGARET MCLAUGHLIN (MARGARET MCLAUGHLIN PHOTOGRAPHY )However, Northern Ireland is due to miss the worst of the expected conditions.\nThe UK Met Office issued a yellow weather warning for wind and rain for parts of Scotland, north England and north Wales for Wednesday and Thursday."}, {"id": "61a0d2b1-b3c1-4d20-a3d4-327a93735e3e", "title": "Teachers at Springfield Middle School in Wilson County return to the classroom after tornado", "date": "2024-08-21 18:30", "url": "https://www.wwaytv3.com/teachers-at-springfield-middle-school-in-wilson-county-return-to-the-classroom-after-tornado/", "domain": "wwaytv3.com", "domain_classification": "Unknown", "message": "Teachers at Springfield Middle School in Wilson County return to the classroom after tornadoSpringfield Middle School opens after tornado from Tropical Storm Debby (Photo: WTVD)WILSON COUNTY, N.C. (WTVD) — Springfield Middle School teachers are back in the building that was damaged by an EF-3 tornado that spawned from Hurricane Debby.\nCrews have been there working around-the-clock to make repairs ahead of Monday when schools starts.\nA temporary roof is in place and excess water has been removed, however the 6 and 7th grade wings were heavily damaged.\nThe district is expected to bring in mobile classrooms while those are rebuilt.\nClick here to read the full article"}, {"id": "89ea0e5d-eccb-4e18-9423-df7c2ea35291", "title": "Yellow wind and rain warning issued for two counties", "date": "2024-08-21 11:15", "url": "https://www.breakingnews.ie/ireland/yellow-wind-and-rain-warning-issued-for-two-counties-1663526.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "A yellow wind and rain warning has been issued for Mayo and Galway for Wednesday night.\nThe warning comes into effect from 6:30pm on Wednesday night to 2:30am on Thursday morning.\nA high tide advisory warning has been issued for all coasts from 12pm on Wednesday until 12pm on Friday.\nWednesday will see strong and gusty south to southwest winds with spells of heavy rain and coinciding with very high tides.\nA band of heavier rain and strong to gale force south to southwest winds will move in along the west coast later in the evening."}, {"id": "3aeb3aa4-7fcc-4046-9572-a8f0b45b2fab", "title": "NEOC activated @ Level 1 as VI placed on Hurricane Watch | Virgin Islands News Online", "date": "2024-08-21 17:00", "url": "http://www.virginislandsnewsonline.com/en/news/neoc-activated-level-1-as-vi-placed-on-hurricane-watch", "domain": "virginislandsnewsonline.com", "domain_classification": "Unknown", "message": "You are here: Virgin Islands News Online News » NEOC activated @ Level 1 as VI placed on Hurricane WatchNEOC activated @ Level 1 as VI placed on Hurricane WatchThe Virgin Islands (VI) is currently under a Hurricane Watch in association with Tropical Storm Ernesto, which means that hurricane conditions are possible in the area within the next 12 hours.\nPhoto: Internet Source/File Ernesto is expected to pass near the Virgin Islands later tonight.\nPhoto: NHCROAD TOWN, Tortola, VI- The Virgin Islands (VI) is currently under a Hurricane Watch in association with Tropical Storm Ernesto, which means that hurricane conditions are possible in the area within the next 12 hours.\nErnesto packing 60 mph windsAt 11:00 AM the Virgin Islands was placed on a Hurricane Watch.\nAt 2:00 PM, Tropical Storm Ernesto was moving west-northwest at approximately 18 miles per hour."}, {"id": "823a677b-9a3a-4f0f-8d2e-cbf4be6686bd", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area", "date": "2024-08-21 02:00", "url": "https://www.yahoo.com/news/tropical-depression-dumps-heavy-rain-012746455.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "An entrance to the Cheonggye stream is closed in preparation for an approaching Tropical Storm Jongdari in Seoul, South Korea, Wednesday, Aug. 21, 2024.\n(AP Photo/Ahn Young-joon)SEOUL, South Korea (AP) — A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region Wednesday after weakening from a tropical storm.\nSome southern parts of the mainland and the island of Jeju recorded 10 to 17 centimeters (3.9 to 6.6 inches) of rain.\nSome areas in the capital region saw 10 to 12 centimeters (3.9 to 4.7 inches) of rain Wednesday.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday morning, and South Korea’s weather agency said the system was continuing to weaken."}, {"id": "1c1f4da7-0f86-49fb-8892-4f63e9c91160", "title": "  Bad Omen : Rare Sea Serpent Surfaces In San Diego Waters , Linked To Earthquake Legend", "date": "2024-08-21 17:45", "url": "https://www.boredpanda.com/rare-sea-serpent-surfaces-in-california-waters/?cexp_id=103161&cexp_var=0&_f=featured", "domain": "boredpanda.com", "domain_classification": "Unknown", "message": "Highlights Kayak adventurers found an incredibly rare, 4-meter-long oarfish washed ashore in San Diego.\nSightings of oarfish are extremely rare, with only 20 encounters in California since 1901.\n“These fish typically inhabit the deep-sea, open-ocean environment.”Kayak adventurers found an incredibly rare, 4-meter-long “sea serpent” washed ashore in San Diego.\nShare iconImage credits: Michael Wang“The oarfish has always fascinated scientists with its long, striking silver body, large eyes and mane-like crest on its head,” he continued.\n“This can’t be good” Despite efforts by researchers to disprove the legend, readers still believe the fish is an ill omenADVERTISEMENTADVERTISEMENTShare iconShare iconShare iconShare iconShare iconShare iconShare iconShare iconADVERTISEMENTShare icon"}, {"id": "db8d55c0-dcf0-45d7-9957-8835a5093af8", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area", "date": "2024-08-21 02:30", "url": "https://abcnews.go.com/International/wireStory/tropical-depression-dumps-heavy-rain-southern-south-korea-113003758", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A tropical depression is dumping heavy rain in southern South Korea and the populous Seoul region after weakening from a tropical stormSEOUL, South Korea -- A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region Wednesday after weakening from a tropical storm.\nSome southern parts of the mainland and the island of Jeju recorded 10 to 17 centimeters (3.9 to 6.6 inches) of rain.\nSome areas in the capital region saw 10 to 12 centimeters (3.9 to 4.7 inches) of rain Wednesday.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday morning, and South Korea’s weather agency said the system was continuing to weaken.\nGovernment officials had urged public vigilance and monitoring of areas like underground passageways and basement dwellings that are at high risk of flooding."}, {"id": "c2069bc8-6fa3-4415-94eb-9b308dcc0ebc", "title": "Landslide - triggered tsunami in Alaska causes damage at national park", "date": "2024-08-21 18:15", "url": "https://www.yahoo.com/news/landslide-triggered-tsunami-alaska-causes-153031169.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Landslide-triggered tsunami in Alaska causes damage at national parkLandslide-triggered tsunami in Alaska causes damage at national parkSWEARD, Alaska – Visitors to a national park south of Anchorage in Alaska are being warned of potential dangers after a landslide-triggered tsunami caused damage earlier this month.\nThe tsunami was reported about 5 a.m. local time Aug. 7, and the National Park Service (NPS) said it sent water rushing over portions of Pendersen Lagoon near Aialik Bay within Kenai Fjords National Park.\nThat warning was issued because the NPS said it had \"no degree of certainty about the potential for any future tsunami or magnitude.\"\nThe NPS said no injuries or fatalities were reported after the landslide and tsunami.\nOriginal article source: Landslide-triggered tsunami in Alaska causes damage at national park"}, {"id": "6bdf7eec-d7ff-483e-802f-a2eceee1b832", "title": "Scattered afternoon thunderstorms on Wednesday", "date": "2024-08-21 13:45", "url": "https://cbs12.com/news/local/weather-forecast-august-21-2024-west-palm-beach-south-florida-treasure-coast-scattered-afternoon-thunderstorms-on-wednesday", "domain": "cbs12.com", "domain_classification": "Unknown", "message": "Southwest wind flow will persist through the middle of the week, elevating storm chances each afternoon.\nA heat advisory is in effect for Palm Beach County today as feels like temperatures will reach as high as 110 degrees this afternoon.\nShowers and thunderstorms will move towards the east coast this afternoon and early evening.\nOur elevated storm chance will continue through the rest of the week with highs in the upper 80s and lower 90s each day.\nThis paired with an onshore wind flow will mean a higher shower chance during the morning hours at the coast with a few stronger storms moving inland through the afternoon."}, {"id": "a807d87d-a75c-490b-b514-aeea487ad8cd", "title": "Ill winds churn as system to south and east of Big Island continues to strengthen : Big Island Now", "date": "2024-08-21 18:15", "url": "https://bigislandnow.com/2024/08/21/ill-winds-churn-as-system-to-south-and-east-of-big-island-continues-to-strengthen/", "domain": "bigislandnow.com", "domain_classification": "Unknown", "message": "There are some ill winds churning to the south and east of the Big Island and they are only going to strengthen as they move into the Central Pacific and near the state.\n“A weaker disturbance located just to its southwest is expected to merge with this system later today.”There’s a 90% the storm system will develop into a tropical system within the next 2 days.\nHowever, confidence in any potential impact is extremely low,” said the Central Pacific Hurricane Center in an email Tuesday afternoon.\nIf it makes the transition in the Central Pacific, it will be given the name Hone.\nARTICLE CONTINUES BELOW ADThe National Hurricane Center in Miami said the Category 1 storm’s structure continues to improve, with an eyewall developing."}, {"id": "883f7d80-b22b-4620-ae7a-cf20c7dad72b", "title": "Ireland weather : Difficult travel conditions and coastal flooding as Met Éireann issues Status Yellow wind warning for two counties", "date": "2024-08-21 07:45", "url": "https://www.independent.ie/weather/difficult-travel-conditions-and-coastal-flooding-as-met-eireann-issues-status-yellow-wind-warning-for-two-counties/a73249536.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "The public has been warned to be ready for heavy rain and high winds in parts of the west, with a status yellow wind and rain warning in place for parts of the country this evening and overnight.\nMet Éireann is warning of \"unseasonably strong and gusty south to southwest winds with spells of heavy rain and coinciding with very high tides” for Counties Galway and Mayo, mostly felt in coastal areas and on higher ground.\nThe status yellow rain and wind warning is in place until 2.30am on Thursday, with potential for coastal flooding, wave overtopping, localised flooding, damage to temporary structures and difficult travelling conditions.\n“A band of heavier rain and strong to gale force south to southwest winds will move in along the west coast later in the evening,” forecasters said.\n\"Rain will clear eastwards from most parts overnight and winds will veer westerly and decrease moderate to fresh."}, {"id": "c3bbda56-2680-4137-bb9f-a05bc1a90839", "title": "Perth floodgates stay open , but new lightweight barriers on way", "date": "2024-08-21 17:30", "url": "https://www.thecourier.co.uk/fp/news/perth-kinross/5064278/perth-floodgates-lightweight-barriers-expected/", "domain": "thecourier.co.uk", "domain_classification": "Unknown", "message": "Council bosses have rejected a suggestion that all of the Perth floodgates should be kept closed from October to March.\nThe assurances were given during a meeting of Perth and Kinross Council’s climate change and sustainability committee on Wednesday.\nPerth floodgates’ closures come at a costIn addition to the barriers work, councillors were told the systems of warnings and triggers for flooding have been reviewed.\nCouncillors were told climate change is making weather events more frequent and severe.\n“We are not just responding to severe weather events in winter, but also summertime."}, {"id": "856e2d65-21b7-441b-ae0b-f0cf0ca66345", "title": "Chances For Rain Keeps Temps Down Wednesday", "date": "2024-08-21 05:30", "url": "http://www.news9.com/story/64de0dd5b95e10088537cebe/chances-for-rain-keeps-temps-down-wednesday", "domain": "news9.com", "domain_classification": "Unknown", "message": "By: News 9-A few showers and storms are possible in several parts of the state on Wednesday morning, and though the rain will cool us down a bit, it will still feel very hot.\nTracking a few showers and storms this morning and some pockets of heavy rain drifting southeast.\nThursday morning a few showers will once again be possible across northern and central Oklahoma but overall chances will stay low.\nDrink plenty of water or electrolyte replacement drinks several hours before and during long exposure to the summer heat.\nWear light-colored, loose fitting clothing and a wide-brimmed hat if working outdoors, and take plenty of shade breaks."}, {"id": "22549d2a-17d3-4f48-a040-795eb9c039ae", "title": "Intracoastal Waterway emergency no - wake zone to continue through August , South Carolina DNR says", "date": "2024-08-21 18:30", "url": "https://www.yahoo.com/news/intracoastal-waterway-emergency-no-wake-164525152.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Local, state and federal authorities will continue patrols to enforce the order, the DNR said on Wednesday.\nAs of Wednesday morning, the Intracoastal Waterway remained in moderate flood stage at 16.56 feet.\nThe forecast calls for it to continue falling and to be out of the moderate flood stage on Friday.\nThe Waccamaw River at Conway remains in a major flood stage.\nIt will likely remain in major flood stage through Friday before falling into moderate flood stage this weekend."}, {"id": "07aa186d-955a-46a0-a9d9-68c303eff1d0", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area", "date": "2024-08-21 02:30", "url": "https://www.independent.co.uk/news/seoul-ap-south-korea-jeju-b2599284.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Sign up to the Independent Climate email for the latest advice on saving the planet Get our free Climate email Please enter a valid email address Please enter a valid email address SIGN UP I would like to be emailed about offers, events and updates from The Independent.\nRead our privacy policy Thanks for signing up to theIndependent Climate email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region on Wednesday after weakening from a tropical storm.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday and South Korea’s weather agency said the system was expected to dissipate soon.\nThe Korean Peninsula, which includes South Korea, is often impacted by typhoons, especially between July and September when the heat is at its peak."}, {"id": "43208666-cc2b-4b2b-ab8a-47c9a93df586", "title": "Richmond Hill holds first city council meeting since Tropical Storm Debby", "date": "2024-08-21 11:45", "url": "https://www.yahoo.com/news/richmond-hill-holds-first-city-093526123.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "RICHMOND HILL, Ga (WSAV) — Richmond Hill held its first city council meeting since Tropical Storm Debby brought heavy rains and flooding, many packed city halls to voice their concerns on Tuesday.\nThe floodwaters have receded in Richmond Hill and now the true scope of the devastation is clear.\n‘The Hill Gives Back’ fundraiser formed to aid those in need after Tropical Storm DebbyScarred by the storm’s destruction, multiple people were present at Tuesday’s meeting.\nMany were concerned about how the city would handle the next tropical storm.\nour flood planning response will be addressed in the coming months,” Mayor Carpenter said."}, {"id": "139b00c7-bddf-4205-a232-dae870f02787", "title": "Gilma becomes the 2nd hurricane of the eastern Pacific season and is forecast to stay away from land", "date": "2024-08-21 11:15", "url": "https://www.thereminder.ca/world-news/gilma-becomes-the-2nd-hurricane-of-the-eastern-pacific-season-and-is-forecast-to-stay-away-from-land-9377522", "domain": "thereminder.ca", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season early Wednesday and is forecast to remain away from land.\nMEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season early Wednesday and is forecast to remain away from land.\nGilma had strengthened to tropical storm status on Sunday.\nA slightly slower westward to west-northwest motion was expected during the next few days and additional strengthening is forecast during that time.\nHurricane-force winds extended outward up to 25 miles (40 km) from the center and tropical-storm-force winds extend outward up to 140 miles (225 km)."}, {"id": "827cb843-41cc-40cb-96b3-e2a489d79d75", "title": "Gilma becomes the 2nd hurricane of the eastern Pacific season and is forecast to stay away from land", "date": "2024-08-21 11:15", "url": "https://www.kelownadailycourier.ca/news/world_news/article_d2e91d5a-d28f-58e9-8065-3799513aaa95.html", "domain": "kelownadailycourier.ca", "domain_classification": "Unknown", "message": "We're always interested in hearing about news in our community.\nLet us know what's going on!"}, {"id": "e32cccab-fd14-42c1-82c3-452c19d7c7ca", "title": "Gilma becomes the 2nd hurricane of the eastern Pacific season and is forecast to stay away from land", "date": "2024-08-21 12:00", "url": "https://www.newwestrecord.ca/world-news/gilma-becomes-the-2nd-hurricane-of-the-eastern-pacific-season-and-is-forecast-to-stay-away-from-land-9377522", "domain": "newwestrecord.ca", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season early Wednesday and is forecast to remain away from land.\nMEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season early Wednesday and is forecast to remain away from land.\nGilma had strengthened to tropical storm status on Sunday.\nA slightly slower westward to west-northwest motion was expected during the next few days and additional strengthening is forecast during that time.\nHurricane-force winds extended outward up to 25 miles (40 km) from the center and tropical-storm-force winds extend outward up to 140 miles (225 km)."}, {"id": "103a1002-987c-4b2a-825a-d73dd1d87501", "title": "Gilma becomes the 2nd hurricane of the eastern Pacific season and is forecast to stay away from land", "date": "2024-08-21 10:45", "url": "https://www.prpeak.com/world-news/gilma-becomes-the-2nd-hurricane-of-the-eastern-pacific-season-and-is-forecast-to-stay-away-from-land-9377522", "domain": "prpeak.com", "domain_classification": "Unknown", "message": "MEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season early Wednesday and is forecast to remain away from land.\nMEXICO CITY (AP) — Gilma became the second hurricane of this year's eastern Pacific Ocean season early Wednesday and is forecast to remain away from land.\nGilma had strengthened to tropical storm status on Sunday.\nA slightly slower westward to west-northwest motion was expected during the next few days and additional strengthening is forecast during that time.\nHurricane-force winds extended outward up to 25 miles (40 km) from the center and tropical-storm-force winds extend outward up to 140 miles (225 km)."}, {"id": "289baa7b-84e0-4c1c-beaa-83ac002a2007", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area – Winnipeg Free Press", "date": "2024-08-21 02:00", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/20/tropical-depression-dumps-heavy-rain-in-southern-south-korea-and-seoul-area", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region Wednesday after weakening from a tropical storm.\nSome southern parts of the mainland and the island of Jeju recorded 10 to 17 centimeters (3.9 to 6.6 inches) of rain.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday morning, and South Korea’s weather agency said the system was continuing to weaken.\nFishing boats are anchored at a port as Typhoon Jongdari approaches Jeju Island, South Korea, Tuesday, Aug. 20, 2024.\nAbout 20 vehicles were damaged by floods in the southern town of Ulju, the nearby city of Ulsan and the central city of Seosan, according to South Korea’s Ministry of the Interior and Safety."}, {"id": "fe7155c4-a237-4f13-8827-0ba110733018", "title": "12 Home Insurance Exclusions You Need to Know About", "date": "2024-08-21 00:30", "url": "https://www.insidermonkey.com/blog/12-home-insurance-exclusions-you-need-to-know-about-1337467/", "domain": "insidermonkey.com", "domain_classification": "Unknown", "message": "We will also cover the 12 major home insurance exclusions you need to know about.\nSupported by the primary house insurance market in the United States, North America is expected to hold the largest chunk of the global home insurance market over this period.\nWhile the state’s insurance market remains troubled, the firm is seeking home insurance rate rises.\nSimilar to State Farm, Farmers Insurance decided to limit new homeowners insurance policies in California.\nNow that we have looked at the global home insurance industry, let’s take a look at the home insurance exclusions you need to know about."}, {"id": "2117d4ee-126b-4a41-98b1-774c365ccc7b", "title": "HECO prepares for potential stormy weather", "date": "2024-08-21 04:00", "url": "https://www.yahoo.com/news/heco-prepares-potential-stormy-weather-014551335.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "HONOLULU (KHON2) — Hawai’i may face severe weather this weekend, prompting Hawaiian Electric (HECO) to brace for potential impacts on its services.\nDownload the free KHON2 app for iOS or Android to stay informed on the latest newsHECO warns that strong winds and flooding could damage power lines and cause outages.\nHECO advises customers to review their emergency plans, stock up on necessary supplies, and monitor storm’s progress closely.\nIf you plan to use a ladder while preparing your home for the storm, note the location of power lines before you begin.\nFor the latest news, weather, sports, and streaming video, head to KHON2."}, {"id": "6c835940-7ab7-4863-9506-e385609b0f32", "title": "Long Island storm damage : Mill Pond , Blydenburgh Park and more", "date": "2024-08-21 02:45", "url": "https://www.newsday.com/long-island/suffolk/long-island-storm-damage-bxsnqwvs", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Harbor Road, Stony BrookHeavy rainfall took out a dam under Harbor Road in Stony Brook and emptied Mill Pond.\nStony Brook Grist Mill, Stony BrookThe Stony Brook Grist Mill, which is located on Harbor Road near Mill Pond, sustained flooding from the storm.\nStony Brook University, Stony BrookStony Brook University dealt with flooding at the Mendelsohn Center Monday.\nCredit: Newsday/James CarboneStony Brook University evacuated scores of students from dorms and postponed the move-in day for others Monday morning following the storm.\nUniversity officials also were offering students up to $5,000 if they canceled their housing assignment for the academic year."}, {"id": "b6ee14fb-acc2-4169-b9e8-8a5db5a956ce", "title": "Ground News - Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 13:45", "url": "https://ground.news/article/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast", "domain": "ground.news", "domain_classification": "Unknown", "message": "Toronto Sun Right Mixed Factuality Individual: Leon Cooperman Corporation: AllianzLargest study of 2023 wildfires finds extreme weather fuelled flames coast to coastThe largest study of Canada's catastrophic 2023 wildfire season concludes it is \"inescapable\" that the record burn was caused by extreme heat and parching drought, while adding the amount of young forests consumed could make recovery harder."}, {"id": "af9bfbc7-737b-455c-b4d4-18f2589e2556", "title": "Lori Dengler | Japan megaquake alert is over . What was learned ? – Lake County Record - Bee", "date": "2024-08-21 15:15", "url": "https://www.record-bee.com/2024/08/21/lori-dengler-japans-megaquake-alert-is-over-what-was-learned/", "domain": "record-bee.com", "domain_classification": "Unknown", "message": "The Japanese Meteorological Agency (JMA) issued the first-ever alert that the 7.1 could be the foreshock of a much larger tremor.\nThat alert expired on Aug. 15 and the “megaquake” has yet to come.\nThe Great East Japan earthquake in 2011 killed more than 19,000 and cost more than $300 billion (in U.S. dollars), making it the costliest disaster in modern history.\nBut too many alerts without a larger quake following may trigger the “cry wolf” syndrome.\nLori Dengler is an emeritus professor of geology at Cal Poly Humboldt, an expert in tsunami and earthquake hazards."}, {"id": "24622bd3-f380-4eff-9ec0-132555bfdf54", "title": "Is Houston still the  Energy Capital of the World ? Doesnt seem like it", "date": "2024-08-21 00:30", "url": "https://www.click2houston.com/news/local/2024/08/20/is-houston-still-the-energy-capital-of-the-world-doesnt-seem-like-it/", "domain": "click2houston.com", "domain_classification": "Unknown", "message": "How is it that a city known as the “Energy Capital of the World” struggles to keep the lights on?\nTexas launches new investigation into Houston’s power utility following deadly outages after BerylWith all of these issues in mind, one might wonder: what exactly makes Houston the “Energy Capital of the World”?\nAbundance of Energy Companies: Houston is home to more than 600 exploration and production firms, as well as 1,100 oilfield service companies.\nConcentration of Expertise: The city has a high density of energy professionals, including petroleum, automation, and electrical engineers.\nEnergy Diversity: While historically known for oil and gas, Houston has also become a leader in renewable energy, including wind and solar power."}, {"id": "89802a9d-5812-4b7d-8dcc-7400844480b5", "title": "How would Project 2025 plan to cut NOAA impact Louisiana ? | Weather", "date": "2024-08-21 17:00", "url": "https://www.nola.com/news/weather/would-project-2025-plan-to-cut-noaa-impact-louisiana/article_37433c04-4e83-11ef-8d15-934e679b2fde.html", "domain": "nola.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "db7a1d76-4b42-414f-8b04-309efca676ab", "title": "Sunday massive rainfall may have been most in Connecticut history : NWS", "date": "2024-08-21 02:45", "url": "https://www.nbcnewyork.com/news/national-international/sundays-massive-rainfall-may-have-been-most-in-connecticut-history-nws/5722907/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "The National Weather Service is looking at the possibility that Sunday's historic rain event set a record for the most rainfall ever in Connecticut over a 24-hour period.\nA State Climate Extremes Committee, including representatives from the National Weather Service in New York and National Weather Service climate experts will be reviewing two 24-hour rainfall measurements from Sunday.\nThe two totals were reported by private home weather stations in Oxford.\nOne measured 14.83\" of rain and the other measured 13.5\", according to the National Weather Service.\nThe NWS experts will examine the home weather stations at both locations to determine if they are in compliance with National Weather Service measurement guidelines and specifications."}, {"id": "6971575d-b5c1-4959-a220-ea11ff208dcd", "title": "7 Vermont counties receive FEMA major disaster declaration for early July storm", "date": "2024-08-21 00:15", "url": "https://vtdigger.org/2024/08/20/7-vermont-counties-receive-fema-major-disaster-declaration-for-early-july-storm/", "domain": "vtdigger.org", "domain_classification": "Unknown", "message": "Phil Scott’s request for a major disaster declaration from the Federal Emergency Management Agency for seven Vermont counties, according to a Tuesday press release from the governor’s office.\nThe disaster declaration does not apply to damage caused by storms on July 30, according to the press release.\nState officials have requested that Orange County be added to the declaration, according to the press release.\nOrange County was examined alongside the other seven counties when FEMA officials visited Vermont last month.\nThe Scott administration continues to work on a separate FEMA major disaster declaration request for damages related to the July 30 storm, the release said."}, {"id": "9b80449f-408a-4290-9a26-a75b4137d750", "title": "Met Office issues urgent warning as wind and rain set to batter parts of united kingdom ", "date": "2024-08-21 11:45", "url": "https://www.coventrytelegraph.net/news/uk-world-news/met-office-issues-urgent-warning-29780811", "domain": "coventrytelegraph.net", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nOur free email updates are the best way to get headlines direct to your inboxSomething went wrong, please try again later.\nThe Met Office has issued yellow warnings for large parts of Scotland, northern England and areas of Wales.\nThe warning for rain in Scotland begins today at 11am and extends until 8am on Thursday."}, {"id": "bdabf260-a303-41d4-93e4-c039b0694e56", "title": "Here a meteorologist perspective on the intense storms that flooded CT", "date": "2024-08-21 16:45", "url": "https://www.nhpr.org/2024-08-19/ct-storms-flooding-climate-change-weather-meteorology-development-history", "domain": "nhpr.org", "domain_classification": "Unknown", "message": "Sunday’s heavy rain turned deadly in Connecticut — at least two deaths have been reported.\nSouthwestern Connecticut was hit hardest as up to 10 inches of rain fell in some areas.\n“These one in 1,000 year type storms are happening at a greater frequency, not just in Connecticut, but nationwide,” Argianas said.\nThe severity of Sunday’s storm was unexpected, even for meteorologists like Argianas.\nGround saturationAfter a very wet 2023 in Connecticut , and after significant rainfall from several storms this year, there’s thought that the ground statewide may be saturated ."}, {"id": "40988efb-64f4-4040-a0bd-fbd996c08ef4", "title": "On August 20 , This Texas City Was Erased by a Massive Hurricane", "date": "2024-08-21 00:15", "url": "https://mix931fm.com/on-august-20-this-texas-city-was-erased-by-a-massive-hurricane/", "domain": "mix931fm.com", "domain_classification": "Unknown", "message": "In the mid-1800s, Galveston was one of the largest ports in the U.S., and by far the largest port in Texas.\nHowever, there was another Texas city that was considered a rival port.\nBut, between 1845 - 1875, Indianola was a bustling port town on Matagorda Bay that boasted over 5,000 residents by the 1870s.\nGoogle Maps Google Maps loading...Hurricane One-Two PunchOn September 16, 1875, an estimated Category 3 hurricane (winds 111-130 mph, storm surge 9-12 feet) took aim on Indianola.\nHowever, on August 20, 1886, a Category 4 hurricane (winds 131-155 mph, storm surge 13-18 feet) decimated Indianola."}, {"id": "36c419b4-7463-401e-95ee-fbe4f7da2809", "title": "On August 20 , This Texas City Was Erased by a Massive Hurricane", "date": "2024-08-21 03:30", "url": "https://q1077.com/ixp/151/p/hurricane-destroys-indianola-texas/", "domain": "q1077.com", "domain_classification": "Unknown", "message": "In the mid-1800s, Galveston was one of the largest ports in the U.S., and by far the largest port in Texas.\nHowever, there was another Texas city that was considered a rival port.\nBut, between 1845 - 1875, Indianola was a bustling port town on Matagorda Bay that boasted over 5,000 residents by the 1870s.\nGoogle Maps Google Maps loading...Hurricane One-Two PunchOn September 16, 1875, an estimated Category 3 hurricane (winds 111-130 mph, storm surge 9-12 feet) took aim on Indianola.\nHowever, on August 20, 1886, a Category 4 hurricane (winds 131-155 mph, storm surge 13-18 feet) decimated Indianola."}, {"id": "871ca473-691d-4ebc-8c6f-e621c8dcb158", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 01:45", "url": "https://www.clickondetroit.com/news/world/2024/08/20/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Electric workers carry out repairs in the community of Puerta de Tierra after the passage of Tropical Storm Ernesto in San Juan, Puerto Rico, Thursday, Aug. 15, 2024.\n(AP Photo/Alejandro Granadillo)SAN JUAN – Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "824aaafb-ac09-424e-add9-5cb438267758", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 01:45", "url": "https://www.local10.com/news/world/2024/08/20/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Electric workers carry out repairs in the community of Puerta de Tierra after the passage of Tropical Storm Ernesto in San Juan, Puerto Rico, Thursday, Aug. 15, 2024.\n(AP Photo/Alejandro Granadillo)SAN JUAN – Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "c4a7bfc4-312a-48df-aa91-cb6b045a299b", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 02:00", "url": "https://www.news4jax.com/news/world/2024/08/20/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Electric workers carry out repairs in the community of Puerta de Tierra after the passage of Tropical Storm Ernesto in San Juan, Puerto Rico, Thursday, Aug. 15, 2024.\n(AP Photo/Alejandro Granadillo)SAN JUAN – Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "7f46de71-c151-4dc1-b0a2-6bbf016607ca", "title": "B . C . wildfires holding under 370 with 30 per cent classified as  out of control  ", "date": "2024-08-21 02:30", "url": "https://www.theglobeandmail.com/canada/british-columbia/article-bc-wildfires-holding-under-370-with-30-per-cent-classified-as-out-of/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Open this photo in gallery: British Columbia's wildfire service says southern parts of the province are benefitting from rain and cooler weather, a reprieve for the southeast in particular.\nThe BC Wildfire Service says two of those fires are classified as “being held,” meaning they’re expected to stay within their current or predetermined perimeters.\nThat leaves the 1.8-square-kilometre Corya Creek blaze in the Northwest Fire Centre as the only wildfire of note continuing to burn out of control in the province, as the 40-square-kilometre Komonko Creek wildfire in southeastern B.C.\nThey’re among about 110 out-of-control blazes representing 30 per cent of the province’s roughly 370 active wildfires.\nThe territory’s wildfire information website says the Snag Lake fire was “quiet” Monday after displaying “extreme” behaviour the day before."}, {"id": "e9acfb18-546d-4be3-9e55-5074d8576c18", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 01:00", "url": "https://www.clickorlando.com/news/world/2024/08/20/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Electric workers carry out repairs in the community of Puerta de Tierra after the passage of Tropical Storm Ernesto in San Juan, Puerto Rico, Thursday, Aug. 15, 2024.\n(AP Photo/Alejandro Granadillo)SAN JUAN – Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "b6768150-49b4-401c-b3a8-7ec90bac7884", "title": "Flooding closes two residence halls at Stony Brook University , forcing a housing reshuffle", "date": "2024-08-21 02:45", "url": "https://www.newsday.com/long-island/education/flooding-closes-stony-brook-university-dorms-gsep0fyi", "domain": "newsday.com", "domain_classification": "Unknown", "message": "All students from two residence halls at Stony Brook University will be relocated after their dorms were badly damaged in a flash flood early Monday that took Suffolk County by surprise and caused millions of dollars in destruction across the region.\nAmmann and Gray residence halls \"will need extensive repairs and cannot be safely occupied,\" the university said on its website.\nBut the same residence halls flooded in September 2021 during the remnants of Hurricane Ida, displacing nearly 400 students.\nThe university also is offering a $5,000 incentive for any students who will cancel their housing for the 2024-25 academic year.\nStony Brook has 33 residence halls with nearly 9,000 undergraduates living on campus."}, {"id": "d93febe7-11f7-4a46-a292-72f3f75654d6", "title": "Tropical depression dumps heavy rain in southern South Korea and Seoul area | iNFOnews", "date": "2024-08-21 02:15", "url": "https://infotel.ca/newsitem/as-south-korea-weather/cp817316219", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Tropical depression dumps heavy rain in southern South Korea and Seoul areaSeaweed is washed up on Gwangalli Beach in the aftermath of Tropical Storm Jongdari in Busan, South Korea, Wednesday, Aug, 21, 2024.\n(Gang Son-bae/Yonhap via AP)Original Publication Date August 20, 2024 - 6:31 PMSEOUL, South Korea (AP) — A tropical depression dumped heavy rain in southern South Korea and the populous Seoul region Wednesday after weakening from a tropical storm.\nSome southern parts of the mainland and the island of Jeju recorded 10 to 17 centimeters (3.9 to 6.6 inches) of rain.\nSome areas in the capital region saw 10 to 12 centimeters (3.9 to 4.7 inches) of rain Wednesday.\nThe depression that was once Tropical Storm Jongdari made landfall Wednesday morning, and South Korea’s weather agency said the system was continuing to weaken."}, {"id": "3c4b16ac-b445-4a6c-ac2c-3c8c5bec536b", "title": "India to spend $300 mln to build drains and expand water bodies in big cities", "date": "2024-08-21 08:00", "url": "https://economictimes.indiatimes.com/news/economy/policy/india-to-spend-300-mln-to-build-drains-and-expand-water-bodies-in-big-cities/articleshow/112675253.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "\"It could become one of the most significant approaches to flood mitigation in the cities,\" Vatsa said in an interview.\n\"While the importance of storm water drainage in reducing the runoff cannot be overlooked, they also need to be supplemented by some of the nature-based solutions such as increasing the capacity of rivers and lakes to carry rain water.\n\"He said of the 25 billion rupees ($298 million), Mumbai, Chennai and Kolkata would each receive 5 billion rupees, while Ahmedabad, Hyderabad, Bengaluru and Pune will get 2.5 billion rupees each.\n\"Whenever a city receives 100 mm of rainfall, there is bound to be inundation,\" Vatsa said.\n\"You need a certain level of investment continuously which is supported by a whole lot of governance measures so that the problem could be reduced.\""}, {"id": "e1ee89f1-ca1e-40cd-8ac2-6c1fe71191d1", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 01:45", "url": "https://www.independent.co.uk/news/puerto-rico-ap-san-juan-national-weather-service-rio-grande-b2599131.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "2a00eef0-fe36-4a1b-96d3-1d0ad4743dea", "title": "All hell broke loose : Sicily yacht sunk in brutal storm", "date": "2024-08-21 04:45", "url": "https://www.standardmedia.co.ke/europe/article/2001501353/all-hell-broke-loose-sicily-yacht-sunk-in-brutal-storm", "domain": "standardmedia.co.ke", "domain_classification": "Local - Africa", "message": "Divers off Porticello on the site where the British-flagged luxury yacht Bayesian sank with 22 people onboard on Aug 19, 2024.\n\"At around 4:00am, all hell broke loose,\" local fisherman Giovanni Lococco told AFP on Tuesday as he surveyed rescuers searching for six people missing.\nA photograph posted on social media by a local bar showed the yacht all lit up just hours before the storm.\nThe power of the storm knocked out the video feed on Angelo Formica's boat in Porticello, which he monitored from home.\nCharlotte Golunski, 35, a colleague of Lynch's, was on deck when the yacht sank and briefly, terrifyingly lost hold of her one-year-old daughter."}, {"id": "08683cb3-5798-4f82-a462-55218905ec07", "title": "Full Essex bank holiday weekend weather forecast as Hurricane Ernesto brings heavy rain", "date": "2024-08-21 12:00", "url": "https://www.essexlive.news/news/essex-news/full-essex-bank-holiday-weekend-9498009", "domain": "essexlive.news", "domain_classification": "Unknown", "message": "On Saturday morning from 1am to 4am there is an 80 per cent chance of extremely heavy rain.\nColchester weatherVery similar to the forecasts of Chelmsford and Southend with temperatures between 21 and 24C and heavy rain on Saturday morning.\nHeavy rain is once again expected on Saturday morning.\nBasildon weatherAround as warm as Thurrock with regular temperatures above 22C and heavy rain Saturday morning.\nCanvey Island weatherNo days set to be below 21C with slightly higher winds than the rest of the county."}, {"id": "ddd6caeb-7f47-431e-bd1b-c48aeccce804", "title": "Dept Of Labour Closed To Walk - In Customers", "date": "2024-08-21 05:15", "url": "https://bernews.com/2024/08/dept-labour-closed-walk-customers/", "domain": "bernews.com", "domain_classification": "Unknown", "message": "The Department of Labour is currently closed to walk-in customers due to hurricane damage.\nA Government spokesperson said, “The Department of Labour would like to advise the public that its office is closed to walk-in customers due to hurricane damage.\nWhile email messages are being monitored, there is no in-person service available.\n“If your matter is urgent, please email sstephens@gov.bm and you will be directed to the appropriate person.\nWalk-in service is expected to resume on Monday, 26 August 2024."}, {"id": "0cafde43-8bfd-4e0e-ac83-235bf94840c1", "title": "Met Office verdict on how long  autumnal  weather will last as Bank Holiday weekend approaches", "date": "2024-08-21 18:15", "url": "https://www.manchestereveningnews.co.uk/news/uk-news/met-office-verdict-how-long-29782114", "domain": "manchestereveningnews.co.uk", "domain_classification": "Unknown", "message": "Yellow weather warnings for rain and wind have been issued for Thursday, with parts of the north west the worst affected.\nHe said this combination of weather leads to \"a strengthened jet stream\", which is what we will see over the coming days.\nHurricane Ernesto will be adding to the wet weather as it tracks across the Atlantic and weakens.\nBut luckily, the autumnal feeling weather will not last long and more summer-like weather should return before the end of the month.\nLooking towards the end of the month, he said: \"The jet stream is becoming a bit weaker, not quite as autumnal looking."}, {"id": "cb469c86-a994-4068-bfc2-079315f2e4bb", "title": "North Wales on alert for damaging 64mph gales as three flood warnings issued", "date": "2024-08-21 19:30", "url": "https://www.dailypost.co.uk/news/north-wales-news/north-wales-put-alert-damaging-29785521", "domain": "dailypost.co.uk", "domain_classification": "Unknown", "message": "Sign up to our free newsletter for the top North Wales stories sent straight to your e-mailSomething went wrong, please try again later.\nA yellow warning for wind is in force for northwest Wales as the region braces for the tail of a hurricane.\nWith higher tides tomorrow (August 22), flood alerts are in places as rough seas batter the coast (see below).\nA Met Office wind alert covering Anglesey, Gwynedd and Conwy comes into effect at 1am tomorrow (Thursday) and lasts until 9am.\nJoin the North Wales Live WhatsApp community group where you can get the latest stories delivered straight to your phone(Image: NRW)Natural Resources (NRW) has issued three flood alerts for North Wales – these have been prompted by bad weather coinciding with high tides."}, {"id": "44b5cb7b-cfd9-4909-a4d0-524ab36b7165", "title": "B . C . wildfires holding under 370 with 30 per cent classified as  out of control  ", "date": "2024-08-21 01:45", "url": "https://www.timescolonist.com/bc-news/bc-wildfires-holding-under-370-with-30-per-cent-classified-as-out-of-control-9376725", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "The BC Wildfire Service says two of those fires are classified as \"being held,\" meaning they're expected to stay within their current or predetermined perimeters.\nThat leaves the 1.8-square-kilometre Corya Creek blaze in the Northwest Fire Centre as the only wildfire of note continuing to burn out of control in the province, as the 40-square-kilometre Komonko Creek wildfire in southeastern B.C.\nThey're among about 110 out-of-control blazes representing 30 per cent of the province's roughly 370 active wildfires.\nThe territory's wildfire information website says the Snag Lake fire was \"quiet\" Monday after displaying \"extreme\" behaviour the day before.\nThe blaze is not currently threatening the highway or buildings along the route, the territory's website says."}, {"id": "298f0771-be48-440f-855b-03a82984e7f9", "title": "Biden approves Kansas disaster declaration for storm in May", "date": "2024-08-21 15:15", "url": "https://jcpost.com/posts/42df52fd-1a6b-4317-9acd-6572f5e1c8dd", "domain": "jcpost.com", "domain_classification": "Unknown", "message": "Storm damage in Shawnee -photo NWS Kansas CityWASHINGTON —On Wednesday, President Joe Biden.\ndeclared that a major disaster exists in the State of Kansas and ordered Federal assistance to supplement state, tribal, and local recovery efforts in the areas affected by a severe storm, straight-line winds, tornadoes, and flooding on May 19, 2024, according to a statement from the White House.\nStorm damage in May - photo city of RussellFederal funding is also available on a cost-sharing basis for hazard mitigation measures statewide.\nMr. Andrew P. Meyer of the Federal Emergency Management Agency (FEMA) has been appointed to coordinate Federal recovery operations in the affected areas.\nAdditional designations may be made at a later date if requested by the state and warranted by the results of further damage assessments."}, {"id": "4a3a9ec0-a095-4310-9bca-db1a11915612", "title": "Biden approves Kansas disaster declaration for storm in May", "date": "2024-08-21 17:30", "url": "https://greatbendpost.com/posts/5cbafb16-ac1e-4237-a1ef-fb9decf692f6", "domain": "greatbendpost.com", "domain_classification": "Unknown", "message": "-Storm damage in May - photo city of RussellWASHINGTON —On Wednesday, President Joe Biden.\ndeclared that a major disaster exists in the State of Kansas and ordered Federal assistance to supplement state, tribal, and local recovery efforts in the areas affected by a severe storm, straight-line winds, tornadoes, and flooding on May 19, 2024, according to a statement from the White House.\nStorm damage in Shawnee -photo NWS Kansas CityFederal funding is also available on a cost-sharing basis for hazard mitigation measures statewide.\nMr. Andrew P. Meyer of the Federal Emergency Management Agency (FEMA) has been appointed to coordinate Federal recovery operations in the affected areas.\nAdditional designations may be made at a later date if requested by the state and warranted by the results of further damage assessments."}, {"id": "6d55fd3d-57de-4661-8d6a-681b710993b5", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 02:15", "url": "https://isp.netscape.com/news/world/story/0001/20240820/1164e1d652235415b2817ef84173df8e", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Tens of thousands remain without power in Puerto Rico, a week after tropical storm swiped the islandSAN JUAN, Puerto Rico (AP) — Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nLuma has come under fire ever since it took over transmission and distribution in June 2021 as Puerto Rico’s Electric Power Authority struggles to restructure more than $9 billion in debt.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "b39c7eee-4739-47dd-9d3e-339d7686606e", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 02:15", "url": "https://isp.netscape.com/news/story/0001/20240820/1164e1d652235415b2817ef84173df8e", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Tens of thousands remain without power in Puerto Rico, a week after tropical storm swiped the islandSAN JUAN, Puerto Rico (AP) — Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nLuma has come under fire ever since it took over transmission and distribution in June 2021 as Puerto Rico’s Electric Power Authority struggles to restructure more than $9 billion in debt.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "19db2d34-4eee-4b2d-a80d-58ba89a1da73", "title": "SBAC Launches a Storm Recovery Loan for Flood - Affected Small Businesses", "date": "2024-08-21 17:45", "url": "https://www.savannahtribune.com/articles/sbac-launches-a-storm-recovery-loan-for-flood-affected-small-businesses/", "domain": "savannahtribune.com", "domain_classification": "Unknown", "message": "In response to the catastrophic flooding caused by Tropical Storm Debby across Southeast Georgia and South Carolina’s Lowcountry, the Small Business Assistance Corporation (SBAC) is announcing the launch of its Storm Recovery Loan Program.\nThis loan program provides federal funds for financial relief to local small businesses affected by the flooding.\nTropical Storm Debby has brought historic rainfall to the region, leading to widespread flooding, and road closures that have severely affected local businesses.\nSBAC’s new loan program provides immediate financial assistance to help these businesses cover expenses necessary for recovery.\nLocal community organizations, banks, businesses, and media outlets are encouraged to spread the word about this crucial support for our small business community."}, {"id": "2aeece1a-d988-4574-9d86-4507077eb726", "title": "N . Y . weather : Long - range forecast issued for fall", "date": "2024-08-21 17:15", "url": "https://www.silive.com/weather/2024/08/ny-weather-long-range-forecast-issued-for-fall.html", "domain": "silive.com", "domain_classification": "Unknown", "message": "However, the latest three-month outlook issued by the National Weather Service’s Climate Prediction Center reveals that temperatures from September through November may not be as brisk as usual in New York.\nAlthough temperatures are not exactly slated to imitate those experienced during one of the summer’s many heat waves, the long-range forecast by the National Weather Service foresees elevated temperatures over the course of the next three months.\n(Courtesy of the National Weather Service's Climate Prediction Center)(Courtesy of the National WeatheIn examining the three-month outlook issued on Aug. 15, the National Weather Service is forecasting warmer-than-average temperatures across the vast majority of the U.S.\nAn National Weather Service temperature outlook focused solely on September reinforces the notion of warmer-than-average temperatures over the course of the month.\nHistorically, the National Weather Service reports that the average high for Central Park in September is 76 degrees, according to data collected from 1991-2020."}, {"id": "341362e3-9a2c-43aa-8f59-e9cafa26a877", "title": "India to spend $300 million to mitigate floods , conserve water in big cities", "date": "2024-08-21 08:00", "url": "https://www.marketscreener.com/news/latest/India-to-spend-300-million-to-mitigate-floods-conserve-water-in-big-cities-47701204/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "NEW DELHI (Reuters) - India will spend nearly $300 million in two years to expand water bodies like lakes and build drains in seven cities including Mumbai, Chennai and Bengaluru to mitigate floods and conserve water, a government official told Reuters on Wednesday.\nFlooding, often fatal, is common in Indian cities every monsoon as rapid urbanisation devours city lakes and waste clogs drains.\nSuch flooding has been preceded by severe water shortages in recent years, especially in Delhi and Bengaluru, where once-plenty water storage spaces have shrunk.\n\"It could become one of the most significant approaches to flood mitigation in the cities,\" Vatsa said in an interview.\nHe said of the 25 billion rupees ($298 million), Mumbai, Chennai and Kolkata would each receive 5 billion rupees, while Ahmedabad, Hyderabad, Bengaluru and Pune will get 2.5 billion rupees each."}, {"id": "1c82e893-51d7-40c8-a4f3-aded8a1540ba", "title": "TS Ernesto :  Prepare for potential outage - BVIEC | Virgin Islands News Online", "date": "2024-08-21 17:00", "url": "http://www.virginislandsnewsonline.com/en/news/ts-ernesto-prepare-for-potential-outages-bviec", "domain": "virginislandsnewsonline.com", "domain_classification": "Unknown", "message": "POCKWOOD POND, Tortola, VI- The Virgin Islands (VI) has been alerted to prepare for potential loss of electricity due to Tropical Storm Ernesto forecast to impact the Virgin Islands this evening, August 13, 2024.\n“With severe weather approaching [the] Virgin Islands, please prepare for potential outages,” the BVI Electricity Corporation (BVIEC) stated on its Facebook page Monday night, August 12, 2024.\n“The BVIEC intends to maintain the provision of electricity throughout the territory until such time as conditions that may create unsafe conditions (broken lines, fallen trees etc.)\nErnestoOn Tuesday morning, Tropical Storm Ernesto was located about 300 miles (480 kilometres) east-southeast of San Juan, Puerto Rico.\nThe National Oceanic and Atmospheric Administration has predicted an above-average Atlantic hurricane season this year because of record-warm ocean temperatures."}, {"id": "8d195308-5dae-46b3-ac0e-a5f8a6330ecc", "title": "6 still missing in acquitted tech magnate yacht that sank off Sicily", "date": "2024-08-21 15:15", "url": "https://www.abcactionnews.com/world/europe/yacht-that-sank-off-sicily-was-carrying-people-celebrating-tech-magnates-acquittal-6-missing", "domain": "abcactionnews.com", "domain_classification": "Unknown", "message": "The Bayesian, a 184-foot British-flagged yacht, was moored about a half-mile offshore when a storm rolled in before 4 a.m. Monday.\nFifteen of the 22 people aboard survived, including a mother who reported holding her 1-year-old baby over the waves to save her.\nThe rest of the 10-person crew survived, including the captain whom prosecutors reportedly sought to interview.\nBritain sent four investigators to the scene, given the disaster involved a British-flagged ship and British citizens were among the missing.\nThe father, identified by ANSA as James Emslie, also survived, as did Lynch's wife, Angela Bacares."}, {"id": "b8f0cde3-8cd9-4ab9-886d-2aec68497b8d", "title": "New research suggests exposure to wildfire smoke may affect outcome of surgeries :  Responsible for a significant perioperative morbidity burden  ", "date": "2024-08-21 05:30", "url": "https://www.yahoo.com/news/research-suggests-exposure-wildfire-smoke-033000560.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Exposure to wildfire smoke can impact anesthesia function and surgical outcomes, according to a new study.\nThe Hill reported on the research, which asserted that the fine particles and chemicals found in wildfire smoke lead to inflammation and decreased antioxidant levels.\nFurthermore, the study's authors warned the findings could be just the \"tip of the iceberg, with wildfire smoke exposure being responsible for a significant perioperative morbidity burden.\"\nWhat's being done about wildfire smoke?\nYou can shield yourself from wildfire smoke by investing in a HEPA air purifier for your home."}, {"id": "1a1fc57b-efc4-4e9a-a974-d32712d99075", "title": "Tens of thousands remain without power after Puerto Rico tropical storm", "date": "2024-08-21 11:15", "url": "https://www.naharnet.com:443/stories/en/307400-tens-of-thousands-remain-without-power-after-puerto-rico-tropical-storm", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Tens of thousands of customers remained without power across Puerto Rico, a week after Ernesto swiped the U.S. territory as a tropical storm.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico's grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico's Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes.\nPuerto Rico's power grid remains fragile after Hurricane Maria razed it in September 2017 as a powerful Category 4 storm, though the grid already was crumbling before that, due to a lack of maintenance and investment."}, {"id": "0aeb953a-920a-4ab9-b3ad-895eb8118ea7", "title": "Tens of thousands remain without power in Puerto Rico , a week after tropical storm swiped the island", "date": "2024-08-21 03:00", "url": "https://www.wbal.com/tens-of-thousands-remain-without-power-in-puerto-rico-a-week-after-tropical-storm-swiped-the-island/", "domain": "wbal.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico (AP) — Tens of thousands of customers remained without power across Puerto Rico on Tuesday, a week after Ernesto swiped the U.S. territory as a tropical storm .\nThe northeast coastal town of Luquillo, popular with tourists, reported the highest number of outages, with 30% of clients without power.\nUp to 70,000 clients could be temporarily left in the dark late Tuesday, and another 90,000 were already hit Monday by a manual reduction in power to Puerto Rico’s grid.\nDuring the storm, which spun past the island last Tuesday and Wednesday, a peak of 750,000 clients were without power.\nPuerto Rico’s Energy Bureau questioned why the average outage duration per customer increased by 9% from fiscal year 2023 to 2024, for a total of 1,448 minutes."}, {"id": "3d20140d-cfc9-42ba-a0b3-34c6d8dfe83c", "title": "Halifax community concerned about fire risks and  hydrants that cannot protect u - Halifax", "date": "2024-08-21 16:00", "url": "https://globalnews.ca/news/10708461/upper-hammonds-plains-fire-protection-concerns-hydrants/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "Send this page to someone via emailA Halifax-area community meeting about wildfire protection had some people in the Upper Hammonds Plains area leaving with more concerns than answers.\nCommunity members were joined Monday evening by Halifax Water representatives, Halifax Fire members and municipal staff.\nDuring Monday’s meeting, Halifax Water confirmed that the design configuration of the water distribution system, which was installed in the late 1990s, means hydrants can only supply a limited amount of water for firefighting.\nIn a statement to Global News, Halifax Water said it understands the concerns.\nAll this has those who call the community home worried about what will happen if another major wildfire strikes the area."}, {"id": "71acd340-9caa-4ab9-b825-e948b25c14ef", "title": "British billionaire among missing people after storm in Italy sinks superyacht", "date": "2024-08-21 01:45", "url": "https://www.yahoo.com/news/british-billionaire-among-missing-people-005930240.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "| Italian Coast GuardBritish billionaire Mike Lynch is among the six missing passengers of the Bayesian, Lynch’s 184-foot superyacht, which sank off the coast of Sicily, Italy on Monday, according to multiple media reports.\nLynch has been known in UK media as the “British Bill Gates” for his influence in the technology world, as well as for his wealth.\nThe ship sank during a violent storm after a gust of wind that nearby ship captain Karsten Borner described as a “strong hurricane gust,” according to CNBC.\nHe added that he had been careful not to let his boat contact the yacht during the storm, but after the gust of wind concluded, the yacht was gone.\nLynch’s wife, Angela Bacares, is among the survivors, but Lynch’s 18-year-old daughter, Hannah, is among those missing."}, {"id": "9a09b56b-66f3-4476-87b8-7e3792158bde", "title": "B . C . wildfires holding under 370 with 30 per cent classified as  out of control  | iNFOnews", "date": "2024-08-21 02:15", "url": "https://infotel.ca/newsitem/wildfires-bc/cp1969590317", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "wildfires holding under 370 with 30 per cent classified as 'out of control'Smoke from the Calcite Creek wildfire is shown in this July 26 handout photo.\nThe BC Wildfire Service says two of those fires are classified as \"being held,\" meaning they're expected to stay within their current or predetermined perimeters.\nThey're among about 110 out-of-control blazes representing 30 per cent of the province's roughly 370 active wildfires.\nThe territory's wildfire information website says the Snag Lake fire was \"quiet\" Monday after displaying \"extreme\" behaviour the day before.\nThe blaze is not currently threatening the highway or buildings along the route, the territory's website says."}, {"id": "0c06cf60-bd4e-4cf6-afa4-9f2bde4963d6", "title": "B . C . wildfires holding under 370 with 30 per cent classified as  out of control  ", "date": "2024-08-21 17:45", "url": "https://www.niagarafallsreview.ca/news/canada/b-c-wildfires-holding-under-370-with-30-per-cent-classified-as-out-of-control/article_ec85c2d8-8663-5329-af97-e751cd590a25.html", "domain": "niagarafallsreview.ca", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "b4101f44-e776-4d3a-bfd3-e4dcebda38fb", "title": "CRP Enrollment is Up To Near 27 million Acres", "date": "2024-08-21 19:00", "url": "https://www.amazingmadison.com/news/crp-enrollment-is-up-to-near-27-million-acres/", "domain": "amazingmadison.com", "domain_classification": "Unknown", "message": "With these accepted acres, enrollment is very near the 27 million CRP acreage cap.\nProducers will have enrolled more than 10 million acres in the popular grassland CRP.\nEnrolled acres help sequester carbon in vegetation and soil while enhancing resilience to drought and wildfire.\nFSA also has accepted nearly 200,000 acres through the General signup, bringing total acres enrolled in General CRP to 7.9 million acres.\nProducers can still make an offer to participate in CRP through the continuous CRP signup, which is ongoing, by contacting their local USDA Service Center."}, {"id": "ed9dabad-cf13-43b8-9860-39fb7882ee72", "title": "Northern Ireland weather : Met Office forecasts strong winds and rain – but Hurricane Ernesto aftermath to pass by", "date": "2024-08-21 11:00", "url": "https://www.belfasttelegraph.co.uk/news/northern-ireland/met-office-releases-more-details-as-hurricane-ernesto-aftermath-arriving-in-ni/a915622061.html", "domain": "belfasttelegraph.co.uk", "domain_classification": "Unknown", "message": "Areas of heavy rain moving north and east in Northern Ireland on Monday afternoon.\nWednesday will be cloudy with outbreaks of rain spreading east during the morning, and strong southwesterly winds will continue developing.\nThursday is expected to be a largely bright day with sunny intervals and scattered showered, although fresh to strong winds are likely to remain.\nThe Irish weather agency warned of “unseasonably strong” winds, very high tides and heavy rain as the remnants of Hurricane Ernesto pass over the island.\nThe remnants of the storm will lead to wet and windy weather on Wednesday through to Thursday as it passes over Ireland and the UK."}, {"id": "e4d3f5a6-8d7b-4826-aa50-4524240ed591", "title": "India to Invest $300 Million in Water Body Expansion and Flood Mitigation", "date": "2024-08-21 08:30", "url": "https://www.devdiscourse.com/article/law-order/3058719-india-to-invest-300-million-in-water-body-expansion-and-flood-mitigation", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "India is set to invest nearly $300 million over the next two years to expand water bodies and construct drains in seven cities, including Mumbai, Chennai, and Bengaluru, to mitigate floods and conserve water, according to a government official speaking to Reuters on Wednesday.\nRecent years have seen severe water shortages, particularly in cities like Delhi and Bengaluru, where water storage spaces have diminished.\nMoody's has warned that India's growing water stress could hamper its economic growth, projected at 7.2% for this fiscal year.\nOut of the allocated 25 billion rupees ($298 million), Mumbai, Chennai, and Kolkata will each receive 5 billion rupees, and Ahmedabad, Hyderabad, Bengaluru, and Pune will each get 2.5 billion rupees.\nMumbai recently experienced over 300 mm of rain in just six hours."}, {"id": "edb8eb13-8f55-4ad3-8201-d8b92821741f", "title": "BILLING MYSTERY", "date": "2024-08-21 08:00", "url": "https://jamaica-gleaner.com/article/lead-stories/20240821/billing-mystery", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "The Gleaner was also told that JPS reverted to the use of LNG at 9 p.m. on July 6.\n“The increase in the fuel rate from these two factors is further compounded on customers’ bills when GCT is applied.\nUNCLEAR OF BILLING TERMSStill, it remains unclear whether customers were billed accordingly, in terms of the days JPS relied on ADO and when it went back to using LNG.\nThe company is in the hot seat amid growing complaints over bills received for the July-August period.\nThe Ministry of Energy has set up dedicated email addresses to receive complaints from persons regarding their latest electricity bills, following widespread outcry over massive increases."}, {"id": "68822d37-3f90-4f2d-8ebe-9f7c7f2d92b6", "title": "Keeping the flames at bay when there just one way out in a wildfire", "date": "2024-08-21 19:00", "url": "https://www.yahoo.com/news/keeping-flames-bay-just-one-182629516.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Keeping the flames at bay when there’s just one way out in a wildfireSmoke from the Taylor Bridge wildfire rises east of Cle Elum, Washington.\nSeveral other Pacific Northwest counties also won competitive federal grants to systematically “harden” wildfire evacuation routes.\nThe focus on wildfire evacuation routes can be traced back to a 2018 tragedy in northern California where 84 residents died as wind-whipped flames destroyed a mountain town with inadequate egress.\nNorth Cle Elum Ridge and South Cle Elum Ridge are other priority places served by narrow, winding access roads.\nThe Kittitas County Conservation District is managing the contracting of the wildfire defense work under district manager Anna Lael."}, {"id": "743b1c8c-47c9-40eb-81b4-ad0709a94978", "title": "  Katrina Babie screening to mark anniversary ; storm prep and emergency backpack giveaway in Lake Charles", "date": "2024-08-21 00:30", "url": "https://www.wrkf.org/show/louisiana-considered/2024-08-20/katrina-babies-screening-to-mark-anniversary-storm-prep-and-emergency-backpack-giveaway-in-lake-charles", "domain": "wrkf.org", "domain_classification": "Unknown", "message": "To mark the upcoming 19th anniversary of Hurricane Katrina’s, the New Orleans Museum of Art will screen the documentary, Katrina Babies on Aug. 21.\nOn Aug. 24, the Equality Health Foundation will host a weather ready drive-thru emergency backpack giveaway at Zion Tabernacle Church in Lake Charles.\n___Today’s episode of Louisiana Considered was hosted by Diane Mack.\nLouisiana Considered wants to hear from you!\nLouisiana Considered is made possible with support from our listeners."}, {"id": "98c75e63-0abf-48d7-9545-728079d8b0e8", "title": "Forward spread of Amaral Fire in hills near Fairfield stopped ; evacuation orders downgraded", "date": "2024-08-21 19:30", "url": "https://www.cbsnews.com/sanfrancisco/news/amaral-fire-solano-county-fairfield-green-valley-hills/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "Evacuation orders downgraded for fire near Fairfield Evacuation orders downgraded for fire near Fairfield 00:48A wildfire in the hills near the Solano County community of Green Valley prompted evacuation warnings and orders on Wednesday.\nThe fire, named the Amaral Fire by Cal Fire, was burning near Amaral Court and Rockville Road.\nAmaral Fire evacuation ordersAccording to the Solano County Office of Emergency Services, the following zones were under evacuation orders: SOL-3052, SOL-3054, and SOL-3056.\nThose have since been downgraded to evacuation warnings.\nSeveral other zones are under evacuation warnings: SOL-3020, SOL-3060, SOL-3062, and SOL-3064."}, {"id": "2833d99a-fc3f-4d68-b998-57f794933889", "title": "Met Office issues weather warning as last of Hurricane Ernesto hits united kingdom ", "date": "2024-08-21 10:00", "url": "https://www.walesonline.co.uk/news/wales-news/met-office-issues-weather-warning-29780359", "domain": "walesonline.co.uk", "domain_classification": "Unknown", "message": "The Met Office has issued a yellow weather warning for wind across parts of Wales.\nAccording to the forecaster, strong winds leading to some travel disruption will occur during the early hours of Thursday morning, August 22.\nThe weather warning applies to central, Tayside and Fife areas of Scotland, as well as Strathclyde, the south-west and the Lothian borders of the country.\nIt comes after another yellow weather warning was issued for parts of Scotland for Wednesday, August 21.\nParts of the country could see a period of heavy rain and strong winds, which could lead to impacts from flooding."}, {"id": "88df82bc-b278-4742-8499-5ec020242062", "title": "President Biden approves Vermont major disaster declaration request", "date": "2024-08-21 01:00", "url": "https://www.yahoo.com/news/president-biden-approves-vermont-major-220549152.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Montpelier VT. – President Joe Biden approved Governor Phil Scott’s request for a FEMA major disaster declaration, which will assist Vermonters recovering from flooding in July.\nThis FEMA declaration provides funding to individuals in Addison, Orleans, Washington, Caledonia, Chittenden, Lamoille, and Essex counties.\nThe Individual Assistance program can cover eligible expenses like rental assistance, home repair, home replacement, lodging, and more.\nIndividuals and municipalities that suffered damage in all recent storms should continue to clean up and document damage.\nThe State will continue to provide updates, including the availability of Disaster Recovery Centers for more support."}, {"id": "a50b1fab-4a35-4d27-bf4c-f6a92f97bead", "title": "Remnants of Hurricane Ernesto to hit Donegal tonight", "date": "2024-08-21 07:30", "url": "https://donegalnews.com/remnants-of-hurricane-ernesto-to-hit-donegal-tonight/", "domain": "donegalnews.com", "domain_classification": "Unknown", "message": "THE remnants of Hurricane Ernesto are set to hit Donegal tonight.\nHurricane Ernesto is forecasted to track eastwards and combine with low pressure over Iceland today, passing between Ireland and Iceland tonight.\nAs this low pressure system tracks past the north-west, it will bring a spell of rather windy and wet weather across the country.\nThe low pressure system will coincide with very high spring tides tonight and Thursday.\nThe combination of these very high tides with strong winds will result in high waves and forecasted surge may lead to coastal flooding and wave overtopping."}, {"id": "262f198a-0c00-4d33-913f-8f3dfbaf8050", "title": "Natural disasters and insurance : Some homes becoming uninsurable , but all may not be lost - Christopher Whitehead", "date": "2024-08-21 03:30", "url": "https://www.nzherald.co.nz/nz/natural-disasters-and-insurance-some-homes-becoming-uninsurable-but-all-may-not-be-lost-christopher-whitehead/3R7IDJZ3KJDCJAUAQC5AU3SGTQ/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "Cautious insurersThere’s no general requirement in New Zealand that insurers cover anyone’s home, or that anyone’s home actually be insured.\nWhen homeowners do get insurance, the risk of certain losses from natural disasters is automatically covered by the Natural Hazards Commission (previously known as the Earthquake Commission).\nThe insurer may even offer “parametric” insurance, which pays out less than traditional insurance, but faster.\nWhile parametric insurance is relatively new worldwide, it’s an efficient solution for managing the risk of natural disaster damage.\nNatural disaster wouldn’t have to mean financial disaster as much as it does today."}, {"id": "e169c8bc-a7a3-4f83-976f-b4502eecc18a", "title": "Hurricane season could take a breather after Ernesto . It wont last long", "date": "2024-08-21 01:30", "url": "https://www.cnn.com/2024/08/20/weather/hurricane-season-forecast-atlantic-climate/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —Tropical activity in an unusually active hurricane season will take a breather after Ernesto, but forecasters don’t believe it will last long.\nCNN WeatherThis isn’t surprising because the climatological peak of hurricane season is just a few weeks away.\nOnly 2005 and 1980 had a more active start to hurricane season, according to Michael Lowry, a hurricane expert.\nThe busiest part of hurricane season typically starts in mid-August, peaks around September 10 and persists into mid-October.\nThis season has already racked up about half of the activity an entire normal season would produce with plenty of tropical activity to come."}, {"id": "e5eb89c4-9b4a-420d-ae5d-9dfefa7fa6df", "title": "Hurricane season could take a breather after Ernesto . It wont last long", "date": "2024-08-21 03:00", "url": "https://us.cnn.com/2024/08/20/weather/hurricane-season-forecast-atlantic-climate/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —Tropical activity in an unusually active hurricane season will take a breather after Ernesto, but forecasters don’t believe it will last long.\nCNN WeatherThis isn’t surprising because the climatological peak of hurricane season is just a few weeks away.\nOnly 2005 and 1980 had a more active start to hurricane season, according to Michael Lowry, a hurricane expert.\nThe busiest part of hurricane season typically starts in mid-August, peaks around September 10 and persists into mid-October.\nThis season has already racked up about half of the activity an entire normal season would produce with plenty of tropical activity to come."}, {"id": "6f694d31-4edb-4203-b947-8a0e1fd25d58", "title": "Tap water at Spanish tourist hotspot is left  undrinkable  due to severe drought as sweltering holidaymakers are forced to queue for bottles", "date": "2024-08-21 19:30", "url": "https://www.dailymail.co.uk/news/article-13766021/Tap-water-Spanish-tourist-hotspot-left-undrinkable-severe-drought-sweltering-holidaymakers-forced-queue-bottles.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Tap water at Spanish tourist hotspots have reportedly been left undrinkable due to a severe drought.\nSweltering holidaymakers and locals in towns along Spain's Costa Blanca have been forced to queue at distribution points for bottled water to cover their basic needs.\nAs water levels have dropped, salinity has increased, prompting authorities in some areas to deem tap water unsafe for drinking or cooking.\nBottled water is being distributed free of charge.\nIn the Marina Alta area, north of the provincial capital Alicante, water consumption soars to 19.67 billion litres in July from 2.3 billion litres in January."}, {"id": "6679d844-44be-42f3-9950-5b05d4bd9966", "title": "Fukuoka Observatory Urges Review of Nankai Trough Earthquake Info", "date": "2024-08-21 04:45", "url": "https://www.fukuoka-now.com/en/news/fukuoka-observatory-urges-review-of-nankai-trough-earthquake-info/", "domain": "fukuoka-now.com", "domain_classification": "Unknown", "message": "The Fukuoka Meteorological Observatory highlighted the need for a review of the government’s approach to disseminating information related to the Nankai Trough Earthquake.\nThis comes after the release of temporary earthquake information following the magnitude 7.1 earthquake in the Hyuga-nada region on August 8.\nDuring a regular press conference on August 20, the observatory emphasized the importance of ongoing preparedness for large-scale earthquakes, as the Nankai Trough region remains highly susceptible.\nShuichiro Fukumitsu, head of the Earthquake and Volcano Division, noted that public awareness of the temporary earthquake information issued for the first time was insufficient, indicating a need for more widespread educational efforts.\nHe also called for a comprehensive review of the government’s information dissemination strategies, incorporating feedback from local governments and other stakeholders."}, {"id": "1ec2c539-c564-47b4-b13d-2b40e1a58287", "title": "Earthquake Tremors Felt In Jammu And Kashmir Baramulla", "date": "2024-08-21 18:30", "url": "https://www.outlookindia.com/national/earthquake-tremors-felt-in-jammu-and-kashmirs-baramulla", "domain": "outlookindia.com", "domain_classification": "Unknown", "message": "This is the third earthquake to strike the region in the last 36 hours.\nOn Tuesday, Baramulla was struck by a 4.9 magnitude earthquake, followed by a 4.8 magnitude earthquake."}, {"id": "e4dd017a-24ff-4fb9-84a9-98a6e65e5796", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 10:00", "url": "https://www.thompsoncitizen.net/national-news/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast-9377467", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe fires also burned more than 10,000 square kilometres of forest that had already burned within the last three decades.\nThe report says more than 3,000 square kilometres of commercial forest in Quebec is now vulnerable to \"regeneration failures.\"\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "a6268994-5794-4913-aeaf-0d8e27c92055", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 11:30", "url": "https://www.tricitynews.com/national-news/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast-9377467", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe fires also burned more than 10,000 square kilometres of forest that had already burned within the last three decades.\nThe report says more than 3,000 square kilometres of commercial forest in Quebec is now vulnerable to \"regeneration failures.\"\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "eb73a871-e1d0-46b9-93fa-2f925ac8646a", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 09:15", "url": "https://www.fitzhugh.ca/national-news/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast-9377459", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "And it warns that the extreme temperatures seen that year were already equivalent to some climate projections for 2050.\n\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "42b3a158-7cfa-41eb-b653-00b5b3cf996c", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 09:15", "url": "https://www.stalbertgazette.com/national-news/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast-9377459", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "And it warns that the extreme temperatures seen that year were already equivalent to some climate projections for 2050.\n\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "a27cf8e3-01c3-41b5-95a3-6e19a5b363be", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 09:15", "url": "https://www.pentictonherald.ca/news/national_news/article_e45d577e-e3f8-5ece-81eb-7e55d3df8542.html", "domain": "pentictonherald.ca", "domain_classification": "Unknown", "message": "Trees burned by the Bush Creek East Wildfire are seen above Little Shuswap Lake in Squilax, B.C., Monday, Sept. 11, 2023.\nThe largest study of Canada's catastrophic 2023 wildfire season concludes it is \"inescapable\" that the record burn was caused by extreme heat and parching drought, while adding the amount of young forests consumed could make recovery harder.\nTHE CANADIAN PRESS/Darryl Dyck"}, {"id": "9f61e844-e902-4602-ad36-298d91bde6bd", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 16:15", "url": "https://www.coastreporter.net/environment-news/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast-9377450", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "Extreme temperatures seen in 2023 were equivalent to some climate projections for 2050, says the study.\n\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "ab612bcc-2d93-4eaf-8bdf-d95ada4d0972", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 16:15", "url": "https://www.tricitynews.com/environment-news/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast-9377450", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "Extreme temperatures seen in 2023 were equivalent to some climate projections for 2050, says the study.\n\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "89c7234a-ec7d-4ca0-ae0d-158125fd530e", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 17:15", "url": "https://www.bowenislandundercurrent.com/environment-news/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast-9377450", "domain": "bowenislandundercurrent.com", "domain_classification": "Unknown", "message": "Extreme temperatures seen in 2023 were equivalent to some climate projections for 2050, says the study.\n\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "f1a42d71-ebcc-4bb0-8e57-3bfa300a2fa2", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 17:45", "url": "https://www.delta-optimist.com/environment-news/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast-9377450", "domain": "delta-optimist.com", "domain_classification": "Unknown", "message": "Extreme temperatures seen in 2023 were equivalent to some climate projections for 2050, says the study.\n\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "4a447ec3-7ce8-4962-9ae8-9ec6f5b51b64", "title": "Largest study of 2023 wildfires finds extreme weather fuelled flames coast to coast", "date": "2024-08-21 17:45", "url": "https://www.richmond-news.com/environment-news/largest-study-of-2023-wildfires-finds-extreme-weather-fuelled-flames-coast-to-coast-9377450", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "Extreme temperatures seen in 2023 were equivalent to some climate projections for 2050, says the study.\n\"It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,\" says the study, published Tuesday in the journal Nature Communications.\n\"In 2023, we had the most extreme fire weather conditions on record over much of the country,\" said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n\"By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,\" said Jain."}, {"id": "58a4f4f6-618f-4620-a65d-0aed4bc9f56b", "title": "  Inescapable : study confirms extreme weather fuelled record widlfire year", "date": "2024-08-21 19:15", "url": "https://www.sookenewsmirror.com/news/inescapable-study-confirms-extreme-weather-fuelled-record-widlfire-year-7496719", "domain": "sookenewsmirror.com", "domain_classification": "Unknown", "message": "And it warns that the extreme temperatures seen that year were already equivalent to some climate projections for 2050.\n“It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,” says the study, published Tuesday in the journal Nature Communications.\n“In 2023, we had the most extreme fire weather conditions on record over much of the country,” said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n“By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,” said Jain."}, {"id": "3aba8030-4d0a-4a14-b471-fccd6521c992", "title": "  Inescapable : study confirms extreme weather fuelled record widlfire year", "date": "2024-08-21 19:30", "url": "https://www.peacearchnews.com/news/inescapable-study-confirms-extreme-weather-fuelled-record-widlfire-year-7496719", "domain": "peacearchnews.com", "domain_classification": "Unknown", "message": "And it warns that the extreme temperatures seen that year were already equivalent to some climate projections for 2050.\n“It is inescapable that extreme heat and moisture deficits enabled the record-breaking 2023 fire season,” says the study, published Tuesday in the journal Nature Communications.\n“In 2023, we had the most extreme fire weather conditions on record over much of the country,” said Piyush Jain, a scientist with Natural Resources Canada.\nThe 2023 combination of extreme heat and drought could be a precursor of what is to come, Jain said.\n“By the middle of the century, we will frequently be getting the same weather conditions we had in 2023,” said Jain."}, {"id": "38ad9793-a1ea-4dbf-bc95-2ba7850271ef", "title": "In the news today : Canada , defence and the DNC , more aid for heading to Ukraine | iNFOnews", "date": "2024-08-21 11:00", "url": "https://infotel.ca/newsitem/in-the-news/cp1498422732", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "In the news today: Canada, defence and the DNC, more aid heading to UkraineFormer President Barack Obama speaks during the Democratic National Convention Tuesday, Aug. 20, 2024, in Chicago.\nWhat will be essential for any president, Hillman added, is to continue defence partnerships and expand opportunities for production co-operation with Canada.\nCanada pledges $5.7M in aid for Ukrainian childrenInternational Development Minister Ahmed Hussen says Canada will provide $5.7 million for Ukrainians to meet their basic needs.\nThe survey of more than 10,000 students in grades 7 to 12 highlights a \"worrying\" decline in youth mental health, the Centre for Addiction and Mental Health in Toronto said Wednesday.\n\"The picture is that students are struggling,\" Hayley Hamilton, the survey lead and co-director of CAMH’s institute for mental health policy research, said in an interview."}, {"id": "f2d62117-c81f-46ab-9357-b884863db7f1", "title": "Hurricane Season in another lull", "date": "2024-08-21 17:15", "url": "https://www.wtok.com/2024/08/21/atlantic-hurricane-season-another-lull/", "domain": "wtok.com", "domain_classification": "Unknown", "message": "(WTOK) - Post-Tropical Cyclone Ernesto was deemed a non-factor by the National Hurricane Center on Tuesday afternoon.\nWhat remains of it will dissipate over the North Atlantic in the coming days, as a post-tropical low-pressure wave.\nThe “peak” of the Atlantic hurricane season is usually in late August and early September, so we’re just now coming into the prime time for tropical development.\nThere’s still plenty of time for development in the Atlantic, and plenty of warm water to do so.\nWe could still see some more significant tropical activity before the season goes cold."}, {"id": "40232a59-2ad8-462e-8aeb-4f5a3e0fc5c2", "title": "Storms are back and will stick around a while", "date": "2024-08-21 06:00", "url": "https://www.mysuncoast.com/2024/08/21/storms-are-back-will-stick-around-while/", "domain": "mysuncoast.com", "domain_classification": "Unknown", "message": "Then high pressure will build back in and swing the winds around to the SE in the morning which will then allow a more normal pattern of afternoon storms developing along the sea breeze inland and pushing back toward the coast during the late afternoon and evening.\nStorms dumped over 4 inches of rainfall over parts of the Suncoast on Tuesday (WWSB)For Wednesday expect to see a few late morning and early afternoon storms once again due to the SW winds out ahead of the frontal boundary.\nThere will also be quite a bit of dangerous lightning around with some of these storms.\nSome of these storms can produce lightning some 10 miles away from where the storm is.\nGoing to go with a blend right now with a good chance for scattered storms for both Saturday and Sunday."}, {"id": "f84acb18-8e54-40b0-884f-ca724b914e19", "title": "Drought is devastating southern Africa crops : why it happening and what can be learned", "date": "2024-08-21 16:30", "url": "https://theconversation.com/drought-is-devastating-southern-africas-crops-why-its-happening-and-what-can-be-learned-237148", "domain": "theconversation.com", "domain_classification": "Unknown", "message": "Southern Africa’s worst drought in years has destroyed crops of the staple food, maize, across the region.\nCrop failures in South Africa, Zambia and Zimbabwe – the largest maize producers in southern Africa – have destabilised food security in the whole region.\nThe drought is driven by El Niño, an unusual warming of surface waters in the eastern tropical Pacific Ocean that shifts weather patterns.\nGovernments failed to prepare for this year’s El Niño droughtThe World Meteorological Organization warned in May 2023 that the chance of El Niño developing later in the year was increasing.\nThis meant governments in southern Africa knew in advance that a drought was coming which would decimate crops of staple foods."}, {"id": "74450e81-2ee8-43ac-a6bb-570fa807fa34", "title": "Madeira wildfire threatens UNESCO listed forest", "date": "2024-08-21 16:15", "url": "https://www.bssnews.net/international/205082", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "LISBON, Aug 21, 2024 (BSS/AFP) - Portuguese authorities sent reinforcements to the island of Madeira on Wednesday to fight a wildfire raging for a week that has touched the edge of a UNESCO listed forest.\nNunes said 45 extra firefighters and first aid specialists were expected from the Portuguese mainland Wednesday on top of 76 already sent since the wildfire started on Wednesday last week.\nFierce winds that have fuelled the flames have also disrupted operations at the island's main airport at Funchal.\nAuthorities said that no house had been destroyed, nor any injury reported, but some firefighters had symptoms of exhaustion.\nThousands of hectares of vegetation were lost in a wildfire last year and at least three people were killed in a 2016 wildfire near the main city of Funchal."}, {"id": "d0fdf475-7225-4dbb-9256-d8d79566ae54", "title": "Local skatepark advocacy group , family help clean up skatepark after flooding", "date": "2024-08-21 05:30", "url": "https://www.yahoo.com/news/local-skatepark-advocacy-group-family-024407446.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SALT LAKE CITY (ABC4) — Flooding from last week’s severe weather across the Salt Lake and Utah Valleys left tons of debris to clean up.\nThe city of Orem and its skate park was no exception, but the city says that the weather was no match for the passionate people in the local skate community.\nPREVIOUSLY: Wicked weather along the Wasatch Front following monsoon thunderstormsThe effort was led by a local skatepark advocacy group, Go Skate Utah.\nThe group got the skate park all cleaned up and ready for action again.\nThe family mentioned they frequent the Orem Skate Park and wanted to help make the clean-up a special experience for all involved in the effort."}, {"id": "2d2e5ba0-24b2-485e-9ca9-51075c1810a5", "title": "Flooding Fallouts : July flash floods in Toronto and Southern Ontario caused over $940 million in insured damages , reports IBC", "date": "2024-08-21 18:30", "url": "https://www.collisionrepairmag.com/flooding-fallouts-july-flash-floods-in-toronto-and-southern-ontario-caused-over-940-million-in-insured-damages-reports-ibc/", "domain": "collisionrepairmag.com", "domain_classification": "Unknown", "message": "Toronto, Ontario — According to the Insurance Bureau of Canada, the flash flooding that took place in Toronto and other parts of Southern Ontario between July 15 and 16, 2024 is estimated to have caused over $940 million in insured damages.\n“The insurance industry has long warned that severe weather events are becoming more frequent and intense.\nAs reported by the IBC earlier this year, severe weather in 2023 caused over $3.1 billion in insured damages across Canada.\nMoreover, insured losses related to severe weather in Canada now routinely exceed $2 billion annually.\nBy comparison, between 2001 and 2010, Canadian insurers averaged $675 million a year in losses related to severe weather."}, {"id": "65429339-a444-426d-b7c9-7b9206b7b9d5", "title": "Malawi receives an insurance payout of $11 . 2 million for El Nino - linked drought disaster - New Delhi Times - India Only International Newspaper", "date": "2024-08-21 04:45", "url": "https://www.newdelhitimes.com/malawi-receives-an-insurance-payout-of-11-2-million-for-el-nino-linked-drought-disaster/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "The Malawian government has received an insurance payout of $11.2 million for a crippling El Nino-linked drought that led the southern African nation to declare a state of disaster earlier this year.\nThe payout was given to Malawi this month, the African Development Bank said Monday.\nMalawi had a drought insurance policy through the bank and the African Risk Capacity Group, an agency of the African Union.\nThe funds will support food assistance to around 235,000 households in some of Malawi’s hardest-hit regions and also help with direct relief payments to more than 100,000 households, the African Development Bank said.\nZambia and Zimbabwe also declared states of disaster and have asked for international help, and Mozambique, Zambia and Zimbabwe were expected to receive drought insurance payouts by September, the African Development Bank said."}, {"id": "6850bba5-d808-4368-a56f-63e6b3b944ca", "title": "Ernesto leftovers will deliver high winds , heavy rain to parts of Europe – WDBO", "date": "2024-08-21 18:15", "url": "https://www.wdbo.com/news/local/eye-tropics-ernestos-leftovers-will-deliver-high-winds-heavy-rain-parts-europe/ORMN3YNQLNCRVGXTEWQOCVHHUI/", "domain": "wdbo.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "56f11da3-74fd-40fb-b324-195049fec40d", "title": "British investigators likely to contact Mike Lynch superyacht designer Ron Holland", "date": "2024-08-21 17:45", "url": "https://www.telegraph.co.uk/news/2024/08/21/british-investigators-mike-lynch-superyacht-designer/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "The designer of Mike Lynch’s superyacht Bayesian is likely to be contacted by British investigators.\nThe vessel was designed by Ron Holland, a naval architect, who now lives in Vancouver.\nGavin Pritchard, a retired Marine Accident Investigation Branch (MAIB) inspector, told The Telegraph that Mr Holland would, in the normal way, be contacted by the MAIB as its investigation into the sinking gathers pace.\nMr Pritchard, a Royal Navy officer who was a principal marine accident investigator, said the priority of the MAIB would be to secure “perishable evidence”.\nHe said: “They’ll be wanting to interview survivors, get some electronic data, which would be things like radar tracks of the vessel or voice recordings of radio calls.”"}, {"id": "3a3ad948-99fe-436f-bcb2-e498a2ea9509", "title": "  Black swan  phenomenon may have sunk Bayesian yacht , experts say", "date": "2024-08-21 12:15", "url": "https://nypost.com/2024/08/21/world-news/black-swan-phenomenon-may-have-sunk-bayesian-yacht-experts-say/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "A rare and unexpected “black swan” weather event may have led to the Bayesian superyacht’s speedy demise, maritime experts claim.\n7 A rare “black swan” weather event may have led to the Bayesian yacht’s speedy demise.\nFOTOGRAMMA/Shutterstock7 The yacht may have sunk so quickly due to the extreme weather event.\nAFP via Getty ImagesOther experts questioned why the crew wasn’t paying closer attention to various weather warnings ahead of the tragedy.\nEven if they had been paying closer attention, it was unlikely the crew could have been prepared for such a “high impact, low probability” weather event, Schanck added."}, {"id": "42a2363f-4d40-4c25-9aa8-d41c306f6546", "title": "Scots brace for 60mph wind and 24 hours of rain as Met Office updates weather warning", "date": "2024-08-21 09:15", "url": "https://www.dailyrecord.co.uk/lifestyle/scots-brace-60mph-wind-24-33506939", "domain": "dailyrecord.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the latest top news stories sent straight to your inbox with our daily newsletterSomething went wrong, please try again later.\nJoin the Daily Record's WhatsApp community here and get the latest news sent straight to your messages.\nBe prepared for weather warnings to change quickly: when a weather warning is issued, the Met Office recommends staying up to date with the weather forecast in your area."}, {"id": "48ace447-6557-4a05-b4bd-291dc7dfdb23", "title": "Fire service warn County Durham people over Bank Holiday BBQ", "date": "2024-08-21 15:30", "url": "https://www.thenorthernecho.co.uk/news/24531060.fire-service-warn-county-durham-people-bank-holiday-bbq/", "domain": "thenorthernecho.co.uk", "domain_classification": "Unknown", "message": "The warning, which has been released by County Durham and Darlington Fire and Rescue Service (CDDFRS) comes ahead of a bank holiday heatwave, as the fire service releases a warning video.\nThat’s the message from County Durham and Darlington Fire and Rescue Service (CDDFRS) as it releases a hard-hitting video urging people to pack a picnic instead of a BBQ.\nIn the video, starring CDDFRS Fire Cadets, a group of youngsters can be seen arriving at a grassland area and lighting a disposable BBQ on the ground.\nA screenshot from the fire service video (Image: CDDFRS)Thick black smoke can then be seen billowing in the sky followed by the sound of fire engines racing to the area where the abandoned barbecue has caused a wildfire.\nDan added: “If you see a possible wildfire, call 999 immediately and ask for the fire and rescue service."}, {"id": "56080b58-73bf-4bca-8e49-3400e85fdf10", "title": "  Incredibly Rare  Sea Serpent Surfaces in California Waters , Sparking Fear", "date": "2024-08-21 15:30", "url": "https://www.boredpanda.com/rare-sea-serpent-surfaces-in-california-waters/?cexp_id=103149&cexp_var=6&_f=featured", "domain": "boredpanda.com", "domain_classification": "Unknown", "message": "Highlights Kayak adventurers found an incredibly rare, 4-meter-long oarfish washed ashore in San Diego.\nSightings of oarfish are extremely rare, with only 20 encounters in California since 1901.\n“These fish typically inhabit the deep-sea, open-ocean environment.”You May Also Like:Kayak adventurers found an incredibly rare, 4-meter-long “sea serpent” washed ashore in San Diego.\nADVERTISEMENTShare iconImage credits: Michael Wang“The oarfish has always fascinated scientists with its long, striking silver body, large eyes and mane-like crest on its head,” he continued.\n“This can’t be good” Despite efforts by researchers to disprove the legend, readers still believe the fish is an ill omenADVERTISEMENTADVERTISEMENTShare iconShare iconShare iconShare iconShare iconShare iconShare iconShare iconShare iconShare icon"}, {"id": "8c220782-b745-4dbc-8b1a-0867f52b6c7d", "title": "Flooding Possible in Cork Up To Friday", "date": "2024-08-21 10:00", "url": "https://www.redfm.ie/cork/flooding-possible-in-cork-up-to-friday-1757013", "domain": "redfm.ie", "domain_classification": "Unknown", "message": "Winds of up to 120 kilometres per hour are set to hit parts of country, as the remnants of Hurricane Ernesto track towards Ireland.\nA status yellow wind warning has been issued for Mayo and Galway.\nWe do take a little dip as we go into Thursday night and Friday Morning.\nThere's a low pressure system that we are looking at very carefully at the moment because it could be stronger than tonight's system.\nWe could well see wind speeds with that system getting up to 110 or 120 kilometres an hour.\""}, {"id": "87a91baf-fdf2-4a50-ba16-58098931d2c0", "title": "Naugatuck businesses begin cleanup process in wake of historic storm", "date": "2024-08-21 01:00", "url": "https://www.nbcconnecticut.com/news/local/naugatuck-businesses-cleanup-historic-storm/3367386/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "“I had to stand out in the middle of the road and just watch this all get flooded,” Water Street Pub and Barber Shop owner Anthony Mongillo said.\n“The next morning I came in and I was just speechless.”Mongillo, of Naugatuck, had recently celebrated one year since opening Water Street Pub and Water Street Barber Shop right next door.\nHe said momentum was building for both businesses, only to have a storm tear everything apart this past weekend.\nI put my blood, sweat and tears into both these places the past year, nonstop work,” Mongillo said.\nNumerous businesses in Naugatuck and the surrounding area continue to recoil after the damages brought on from Sunday's storm."}, {"id": "f0876447-1133-4a4f-99ec-e1f2359355be", "title": "Bayesian yacht : Video shows storm battering boat before sinking in Sicily", "date": "2024-08-21 11:15", "url": "https://edition.cnn.com/2024/08/21/europe/bayesian-yacht-sicily-sinking-cctv-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "Porticello, Italy CNN —Italian authorities say a fifth body has been found in the search for those missing from the “Bayesian” superyacht, which sank off the coast of Sicily earlier in the week.\nThe British-flagged vessel sank early Monday – killing at least one of 22 people on board – after its mast, one of the world’s tallest, broke in half during a violent storm.\nThe yacht sank after a small waterspout – a type of tornado – spun over the Mediterranean island, likely capsizing the boat, which was anchored about a half a mile from the port of Porticello.\nEmergency crews resumed their search for missing people on Wednesday and have begun to inspect the ship’s lounges, ANSA reported.\nThree days on from the wreck, investigators are still at a loss as to how the ship sank so quickly."}, {"id": "2dc1295f-056f-4f9c-9fbe-6dccea384b92", "title": "Bayesian yacht : Video shows storm battering boat before sinking in Sicily", "date": "2024-08-21 12:15", "url": "https://www.cnn.com/2024/08/21/europe/bayesian-yacht-sicily-sinking-cctv-intl/", "domain": "cnn.com", "domain_classification": "International", "message": "Porticello, Italy CNN —Italian authorities say a fifth body has been found in the search for those missing from the “Bayesian” superyacht, which sank off the coast of Sicily earlier in the week.\nThe British-flagged vessel sank early Monday – killing at least one of 22 people on board – after its mast, one of the world’s tallest, broke in half during a violent storm.\nThe yacht sank after a small waterspout – a type of tornado – spun over the Mediterranean island, likely capsizing the boat, which was anchored about a half a mile from the port of Porticello.\nEmergency crews resumed their search for missing people on Wednesday and have begun to inspect the ship’s lounges, ANSA reported.\nThree days on from the wreck, investigators are still at a loss as to how the ship sank so quickly."}, {"id": "18983584-0d6a-465a-ad9d-fa8a9affefa8", "title": "The deadly cost of America housing crisis", "date": "2024-08-21 11:15", "url": "https://www.yahoo.com/news/deadly-cost-americas-housing-crisis-093301905.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "In some parts of the country, the only affordable homes for middle-class households are in areas prone to disasters.\nBecause of our collective refusal to build more housing where it is most needed, millions of people live with elevated climate risk.\nWhere I live, across the bay from San Francisco, thermometers climbed into the mid-80s — not exactly pleasant for perspiration-prone Ashkenazi men such as myself, but tolerable.\nCompare homebuilding in Houston (average daily July high of 95 degrees) with homebuilding in San Francisco.\nTo be sure, income and climate risk are not perfectly correlated; several wealthy enclaves are at risk of coastal erosion."}, {"id": "773e53c4-6c19-49e6-b20e-1c76d705d678", "title": "The Search for an Affordable Home Is Putting Americans in Danger", "date": "2024-08-21 11:15", "url": "https://www.businessinsider.com/affordable-home-house-prices-americans-danger-death-climate-change-2024-8", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Because of our collective refusal to build more housing where it is most needed, millions of people live with elevated climate risk.\nWhere I live, across the bay from San Francisco, thermometers climbed into the mid-80s — not exactly pleasant for perspiration-prone Ashkenazi men such as myself, but tolerable.\nCompare homebuilding in Houston (average daily July high of 95 degrees) with homebuilding in San Francisco.\nHouston's ability to build more housing than San Francisco comes down to the rules the two cities impose on the construction of new housing.\nTo be sure, income and climate risk are not perfectly correlated; several wealthy enclaves are at risk of coastal erosion."}, {"id": "c4f1eb3f-1029-4788-a93c-1db0ba37577f", "title": "Kaktovik and Wales precincts fail to open for Alaska primary , Division of Elections says", "date": "2024-08-21 04:00", "url": "https://www.adn.com/politics/2024/08/20/kaktovik-and-wales-precincts-fail-to-open-for-alaska-primary-division-of-elections-says/", "domain": "adn.com", "domain_classification": "Unknown", "message": "The Alaska Division of Elections said that two precincts in rural Alaska failed to open for in-person voting on primary election day.\nCarol Beecher, director of the Division of Elections, said polling places in Wales and Kaktovik were unable to open on Tuesday.\nForty-three Kaktovik residents voted in the 2022 Alaska primary, along with 280 residents of Anaktuvuk Pass and 10 people from Wales.\nADVERTISEMENTAccording to Beecher, 399 of 402 Alaska precincts were open and operating by Tuesday afternoon for the primary election.\nIn 2022, precincts in Tununak and Atmautluak did not open on election day for that year’s primary and special congressional election."}, {"id": "9829e9b1-18df-403b-9bf8-1c8c5209ec29", "title": "In Spain drought - hit Costa Blanca , people queue for bottled water", "date": "2024-08-21 18:15", "url": "https://dunyanews.tv/en/World/832263-in-spains-droughthit-costa-blanca-people-queue-for-bottled-water", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "In Spain's drought-hit Costa Blanca, people queue for bottled waterWorld World In Spain's drought-hit Costa Blanca, people queue for bottled waterIn Spain's drought-hit Costa Blanca, people queue for bottled waterFollow on Published On: Wed, 21 Aug 2024 21:13:02 PKTTEULADA-MORAIRA, Spain (Reuters) - A severe drought has rendered tap water undrinkable in several towns along Spain's Costa Blanca, forcing holidaymakers and locals to queue at distribution points for bottled water to cover their basic needs.\nAs water levels have dropped, salinity has increased, prompting authorities in some areas to deem tap water unsafe for drinking or cooking.\nBottled water is being distributed free of charge.\nThe lack of water has forced town councils to ban activities such as filling swimming pools, or watering gardens and washing cars during the daytime.\nTraditionally, Valencians attribute the local paella's distinct flavour to the mineral-rich hard water on tap there."}, {"id": "66e02854-b23c-421c-bb0c-475338453f20", "title": "Watch : Connecticut home collapses amid historic flooding", "date": "2024-08-21 03:15", "url": "https://www.fox10phoenix.com/weather/connecticut-home-house-collapses", "domain": "fox10phoenix.com", "domain_classification": "Unknown", "message": "The Brief A house in Oxford, Connecticut, collapsed due to flash flooding, with dramatic footage capturing the moment as the structure was swept away by rushing water.\nThe flooding claimed the lives of two other residents, marking the event as both tragic and unprecedented for the area.\nA house in Connecticut gave away and collapsed Monday after enduring flash flooding over the weekend, with many people calling the story \"historic\" and \"unprecedented.\"\nA home in Connecticut collapsed after flash flooding.\nTragically, officials said the flooding took the lives of two other residents who were swept away by the flood."}, {"id": "5b629aef-2609-4508-ac12-178d5be82262", "title": "Watch : Connecticut home collapses amid historic flooding", "date": "2024-08-21 01:45", "url": "https://www.fox29.com/weather/connecticut-home-house-collapses", "domain": "fox29.com", "domain_classification": "Unknown", "message": "The Brief A house in Oxford, Connecticut, collapsed due to flash flooding, with dramatic footage capturing the moment as the structure was swept away by rushing water.\nThe flooding claimed the lives of two other residents, marking the event as both tragic and unprecedented for the area.\nA house in Connecticut gave away and collapsed Monday after enduring flash flooding over the weekend, with many people calling the story \"historic\" and \"unprecedented.\"\nA home in Connecticut collapsed after flash flooding.\nTragically, officials said the flooding took the lives of two other residents who were swept away by the flood."}, {"id": "e4fada7e-bd2a-4ec2-ab36-04dcab77721f", "title": "Modular Homes For Fire Survivors | News Radio 1190 KEX", "date": "2024-08-21 01:45", "url": "https://1190kex.iheart.com/content/2024-08-20-modular-homes-for-fire-survivors/", "domain": "1190kex.iheart.com", "domain_classification": "Unknown", "message": "Monday, Governor Tina Kotek toured Blazer Industries’ modular homes factory in Aumsville.\nThe modular homes, which are at various phases of construction, will be headed to a wildfire recovery project in Lane County.\n“We simply need more homes to address Oregon’s housing crisis, and modular housing is a part of the solution,” Governor Kotek said.\nBlazer Industries is also one of four recipients of the Modular Housing Development Fund (MHDF), grant money made available in House Bill 2001 (2023).\nThey will prioritize wildfire disaster recovery units first, followed by ongoing production of units for lower and middle income homeowners."}]