[{"id": "77fa3eee-8f29-47df-86c9-458e8f6e2162", "title": "The problem ( s ) with Trump ugly rhetoric about Harris , antisemitism", "date": "2024-07-31 14:00", "url": "https://www.msnbc.com/rachel-maddow-show/maddowblog/problems-trumps-ugly-rhetoric-harris-antisemitism-jewish-election-2024-rcna164448", "domain": "msnbc.com", "domain_classification": "Unknown", "message": "Donald Trump seems determined to convince voters that Vice President Kamala Harris is antisemitic.\nShe’s not, and the former president’s attacks are as ugly as they are false, but the Republican appears preoccupied with pushing this line anyway.\nDuring his 2016 campaign, for example, Trump spoke to the Republican Jewish Coalition and said, “You’re not gonna support me because I don’t want your money.\nIn his earlier campaigns, Trump has struggled badly with Jewish voters.\nIf he thinks lying about Harris will change that, the Republican probably ought to lower his expectations."}, {"id": "c09bc222-1832-4226-8658-1b0f06216f7a", "title": "NYC Mayor Eric Adams hosts conference to combat unprecedented levels of hate crimes in Big Apple", "date": "2024-07-31 05:30", "url": "https://www.yahoo.com/news/nyc-mayor-eric-adams-hosts-230429675.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "New York City Mayor Eric Adams gives the opening remarks at the Abate Hate and Hate Violence SummitMayor Eric Adams warned against “pervasive” and “normalized” hate infecting the Big Apple at a community summit held Tuesday to combat hate crimes — which soared a disturbing 68% last month.\nHate has become so pervasive and comfortable and we have normalized hate,” Adams added.\nHate crimes surged a whopping 68% in June, compared to the same month last year, according to the latest crime stats released by the NYPD.\nOf the 62 hate crimes for that month, more than half targeted Jews, the police stats show.\nSiegel added that while the Israel-Hamas war has contributed to the increased incidents of hate crimes, antisemitism wasn’t the focus of the summit."}, {"id": "f4e7235e-cad5-49f8-a102-04afa1483f43", "title": "Trump says Harris , who married to a Jewish man ,  doesnt like Jewish people  ", "date": "2024-07-31 00:30", "url": "https://www.9news.com.au/world/donald-trump-says-kamala-harris-whos-married-to-a-jewish-man-doesnt-like-jewish-people/b8129820-6497-4867-b5a2-1d9989fa916f", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "With Harris replacing President Joe Biden as the likely Democratic presidential nominee, Trump has escalated his attacks on her.\n“America is better than the fear, hate, and despicable insults of Donald Trump,\" said James Singer, a spokesperson for the Harris campaign.\n(AP)The interview host, Sid Rosenberg, then mentioned Harris' husband, second gentleman Doug Emhoff and said, “He’s Jewish like Bernie Sanders is Jewish.\nTrump made a similar claim about Harris disliking Jewish people on Friday while speaking to a Christian group at a Turning Point USA gathering in Florida.\nGuests on his show have included Trump-world figures like Rudy Giuliani and Donald Trump Jr.Rosenberg came to prominence as a sidekick and sports anchor on Don Imus’ long-running morning radio show."}, {"id": "8c9b3c30-80be-4b8f-b30d-02c57ec27696", "title": "  The flood is coming : Pro - Hamas graffiti left near Calgary synagogue", "date": "2024-07-31 13:00", "url": "https://www.jpost.com/diaspora/antisemitism/article-812682", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Threatening pro-Hamas messages were graffitied near a Calgary synagogue and Jewish day school on Saturday night, Canadian Jewish organizations announced on Monday, and the Calgary Beth Tzedec Congregation told The Jerusalem Post on Tuesday.\n“The flood is coming,” read black graffiti photographed by the Calgary Jewish Federation near the Beth Tzedec Congregation and Calgary Jewish Academy.\nNext to the phrase was an inverted red triangle, a symbol often used and popularized by Hamas propaganda videos to denote the targeting of enemies.\n(credit: SCREENSHOT/X)The red triangle appeared in two more locations, along a wall near the Jewish sites.\nWe choose freedom over fear.”Beth Tzedec Congregation CEO David Inhaber said Sunday’s march was a success and thanked the police and security for protecting the event."}, {"id": "2c68a43f-23a5-4d8e-9154-2d86b22c2cf3", "title": "Honouring Raoul Wallenberg : A hero legacy", "date": "2024-07-31 12:45", "url": "https://www.jwire.com.au/honouring-raoul-wallenberg-a-heros-legacy/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Browse > Home News / Honouring Raoul Wallenberg: A hero's legacy – J-WireHonouring Raoul Wallenberg: A hero’s legacyRead on for articleNot many in Sydney’s Jewish community would know that on a small traffic island on the corner of Queen St and Edgecliff Road in Woollahra there is a memorial dedicated to Swedish Holocaust hero Raoul Wallenberg, who during 1944 and 1945 saved thousands of Jewish lives in Hungary.\nThe holders of these “Wallenberg passports” were protected from the Nazi bureaucracy and thereby avoided being deported to Auschwitz.\nIn 2013, Wallenberg was made Australia’s first, and until today, only honorary citizen, by Prime Minister Julia Gillard.\nThe event was organised by the Australian Association of Jewish Holocaust Survivors and Descendants in partnership with the Sydney Jewish Museum and the NSW Jewish Board of Deputies.\nRaoul Wallenberg was a beacon of light during the darkest days of the Holocaust, and his heroism warrants remembrance today."}, {"id": "cdfbe174-436a-484b-9a21-3d892c66975a", "title": "Bella Hadid Responds To Adidas Ad Munich Olympics Controversy", "date": "2024-07-31 00:00", "url": "https://radaronline.com/p/bella-hadid-responds-adidas-munich-olympics-controversy/", "domain": "radaronline.com", "domain_classification": "Unknown", "message": "Model Bella Hadid has finally spoken out following the controversy surrounding the ad campaign she was involved in for Adidas’ retro-inspired 1972 Munich Olympic Games’ SL tennis shoe.\nRadarOnline.com can reveal that Hadid, 27, whose father is Palestinian-American real-estate tycoon Mohamed Hadid, took to her Instagram stories this week to apologize for being embroiled in the campaign.\nShe stated she had no idea that 11 Israeli athletes and coaches were murdered by eight Palestinian terrorists at the 1972 Olympic Games.\nThe model wrote: “I would never knowingly engage with any art or work that is linked to a horrific tragedy of any kind.\nIn advance of the campaign’s release, I had no knowledge of the historical connection to the atrocious events in 1972.”"}, {"id": "219d89e3-409a-458f-b703-2592f344cb5e", "title": "Josh Shapiro VP tryout", "date": "2024-07-31 04:30", "url": "https://www.yahoo.com/news/josh-shapiro-vp-tryout-032220682.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Josh Shapiro stands on the field before a baseball game between the Pittsburgh Pirates and the Philadelphia Phillies Saturday, July 20, 2024, in Pittsburgh.\nShapiro’s VP tryoutJosh Shapiro, the popular swing-state governor, is trying his best to play the role of a good soldier.\nOver the past four days, he’s held three different events in Pennsylvania on behalf of the Harris campaign, including a Monday event alongside Michigan Gov.\nTwo top union leaders, the Philadelphia Democratic Party Chair and the Philadelphia mayor all publicly endorsed Shapiro for VP.\n“Yet only one, Josh Shapiro, has been singled out by a far-left smear campaign calling him ‘Genocide Josh.’ The reason he is treated differently from the rest?"}, {"id": "43ae47d5-f374-4e23-b4e1-4400eab5d115", "title": "IDF celebration in Times Square with Jonathan Conricus and Dana White", "date": "2024-07-31 01:45", "url": "https://www.jpost.com/opinion/article-812553", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "It had to be at the very epicenter of antisemitism in America, Times Square.\nThe Times Square that is the singular crossroads of world popular culture.\nSwarms of protesters at Times SquareSince then I’ve had endless confrontations in Times Square.\nAnd he got his office directly involved in making sure the event goes ahead in Times Square.\nTo book tickets to the Celebration of the IDF in Times Square on July 31, go to: https://www.eventbrite.com."}, {"id": "1a439cd3-66be-4675-bf0b-35e7406b4e8e", "title": "Josh Shapiro rise to potential presidential running mate is no accident", "date": "2024-07-31 14:00", "url": "https://www.inquirer.com/politics/election/josh-shapiro-rise-possible-vice-president-20240731.html", "domain": "inquirer.com", "domain_classification": "Unknown", "message": "Josh Shapiro turns to supporters during a rally for Vice President Kamala Harris at Wissahickon High School in Montgomery County on Monday.\n“I tease him all the time: ‘Josh has been trying to figure out how to be governor since about fifth grade.’”Occasionally, though, Shapiro’s political maneuvering has rankled people in both parties.\nLeslie Anne Miller, a Democratic fundraiser and longtime ally, credits Shapiro’s record for insulating him against attacks from naysayers.\nAs a freshman state lawmaker, Shapiro often turned to him for guidance on how to maneuver in the statehouse, DeWeese said.\nA staunch supporter of Israel and Pennsylvania’s third Jewish governor, Shapiro had already been outspoken against antisemitism — and Islamophobia — on college campuses, when pro-Palestinian encampments went up at Penn this year."}]