[{"id": "7d7d3b01-2f84-4ae1-9220-edbbde932836", "title": "Car Bombing in Syria Targets Iran - Backed Fighters", "date": "2024-06-08 18:15", "url": "https://muslimnews.co.uk/news/syria/car-bombing-in-syria-targets-iran-backed-fighters/", "message": "A car bombing struck the eastern Syrian city of Deir Ezzor on Saturday, resulting in the deaths of two fighters aligned with Iran.\nsmc smc smc smc smc smcThe Syrian Observatory for Human RightsA UK-based watchdog with extensive networks inside Syria, confirmed that the vehicle, packed with explosives, was identified as belonging to militias supported by Iran, and the blast not only killed two individuals but also injured several others.\nFollowing the explosion, Syrian government forces and Iran-backed groups quickly established a security cordon around the impacted site, signaling the importance of the area and Iran’s deep-rooted presence there.\nThe responsibility for the bombing remains unclaimed, and it adds to the ongoing turmoil in a region marred by frequent attacks.\nEarlier this week Car BombingAn attack attributed to Israel in northern Syria near Aleppo resulted in the deaths of 12 people in an area where forces allied with the Iranian government were present."}, {"id": "43a54b15-5668-4d00-9ddc-a4e60a7e7523", "title": "Letter : Israel started it", "date": "2024-06-08 08:15", "url": "https://www.unionleader.com/opinion/letters_to_editor/letter-israel-started-it/article_75d4ce76-fcd3-11ee-938f-ab6955982ae9.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "1d8107ac-7abd-4da1-be70-5d8ba6ee49b6", "title": "IDF Kills Hamas Terrorists in Container at UN School in Gaza", "date": "2024-06-08 16:30", "url": "https://www.breitbart.com/politics/2024/06/07/idf-kills-hamas-terrorists-in-container-at-un-school-in-gaza/", "message": "The Israel Defense Forces (IDF) announced Friday that it had eliminated Hamas terrorists in an airstrike on a shipping container located on the grounds of a United Nations Relief and Works Agency (UNRWA) school in Gaza.\nWe eliminated Hamas terrorists in a precise IAF strike while they were operating in a container inside the premises of an @UNRWA school in Shati earlier today.\nHamas terrorists carried out terror attacks from the U.N. school premises while using it as a shield for their terror activities.\nThe strike was carried out using precise munitions, leading to a precise strike on the terrorists.\nIdentities confirmed of 8 additional Hamas and Islamic Jihad terrorists, who were eliminated in a precise strike in the @UNRWA school in Nuseirat."}, {"id": "83016934-8a11-475e-9951-00b36f0e98ff", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 13:45", "url": "https://us.cnn.com/2024/06/08/europe/shelling-russia-occupied-ukraine-intl/", "message": "CNN —Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24."}, {"id": "72955c44-b425-40c7-b5ee-8d2745f6c493", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 13:00", "url": "https://edition.cnn.com/2024/06/08/europe/shelling-russia-occupied-ukraine-intl/", "message": "CNN —Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24."}, {"id": "9b8e4c7c-7633-474b-8bde-b62fb4a3156f", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 13:00", "url": "https://www.cnn.com/2024/06/08/europe/shelling-russia-occupied-ukraine-intl/", "message": "CNN —Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24."}, {"id": "a344cf43-9935-48bd-9481-4f68b61787d7", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 17:00", "url": "https://krdo.com/news/2024/06/08/russia-accuses-ukraine-of-shelling-that-leaves-at-least-25-dead-in-occupied-east/", "message": "By Mariya Knight and Niamh Kennedy, CNN(CNN) — Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24."}, {"id": "b1203370-3b4a-44ed-8191-9db0b67086ba", "title": "The US Military Confidence in Smart Bombs May Have a Fatal Flaw", "date": "2024-06-08 11:00", "url": "https://www.businessinsider.com/us-military-confidence-smart-bombs-may-have-a-fatal-flaw-2024-6", "message": "Or, \"the incongruence between precision strike theory and the fervent enthusiasm of precision ideologues,\" he wrote in an essay for the Royal United Services Institute, a British think tank.\nRelated storiesBut most significantly, Fox questions the essence of US precision warfare: the belief that smart bombs spare a need for boots on the ground.\n\"If precision strikes are often accurate, but ineffective, and additional strikes or land operations are required to create the effect intended with the initial precision strikes, then precision strategies do not decrease civilian casualties and collateral damage in conflict zones.\"\n\"The inconvenient truth about war is that it still requires a land force to defeat a land force.\nPrecision warfare, which isn't really a thing, augments a land force in defeating another land force."}, {"id": "93930bd2-3bb6-4f9b-8adb-3e04379e2b56", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 15:45", "url": "https://kesq.com/news/national-world/cnn-world/2024/06/08/russia-accuses-ukraine-of-shelling-that-leaves-at-least-25-dead-in-occupied-east/", "message": "By Mariya Knight and Niamh Kennedy, CNN(CNN) — Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24."}, {"id": "122cfbd7-2518-4873-91a3-fa593238facb", "title": "What we know about Israel deadly strike on UN school complex in Gaza strip | World News", "date": "2024-06-08 14:45", "url": "https://indianexpress.com/article/world/israel-strike-on-un-school-gaza-strip-9380268/", "message": "A day after Israeli forces bombed a United Nations school complex in central Gaza Strip that had become a shelter for displaced Palestinians, some of the facts remain unclear or under contention.\nThe multistory building was one of several that made up the UNRWA Nuseirat Boys’ Preparatory School.\nIt was one of the many schools in Gaza run by UNRWA, the main UN agency for Palestinian refugees and their descendants.\nIn taking aim at Hamas, Israel regularly kills civilians and is accused — even by its allies — of using excessive, indiscriminate force.\nThe Israeli military maintains the airstrike was planned and carried out with care and precision, targeting only the three rooms in the school used by militants."}, {"id": "21beb376-5768-41e5-ab5d-1d0b801e4d15", "title": "Russia blames US for deaths on its soil - Newspaper", "date": "2024-06-08 03:30", "url": "https://www.dawn.com/news/1838528/russia-blames-us-for-deaths-on-its-soil", "message": "ST PETERSBURG: Russia accused Ukraine on Friday of ‘using US-supplied rockets’ to kill women and children, in a region of southern Russia and added that “Washington is to blame”.\nThis is the first time Russia has stated that it holds the United States responsible for civilian deaths on its own soil.\nThis accusation follows warnings by President Vladimir Putin that the West is playing with fire and risking a global conflict by letting Ukraine fire Western-supplied weaponry into Russia.\nShe alleged this was ‘shortly’ after the United States ‘agreed for the first time’ to let Ukraine fire US-supplied weapons into Russia.\nThe eastern Lugansk border region is almost entirely under the control of Moscow, which has claimed its full annexation."}, {"id": "4cef5785-397d-4ce8-8e86-01997ee6b6f1", "title": "Media : Explosions reported across occupied Crimea", "date": "2024-06-08 02:45", "url": "https://www.yahoo.com/news/media-explosions-reported-across-occupied-012654335.html", "message": "Explosions were heard across Sevastopol in occupied Crimea overnight on June 8, the Telegram channel Crimean Wind reported.\nAt around 1:39 a.m. local time, residents of Balaklava, a settlement in the city of Sevastopol, reportedly heard explosions.\nThe Russian proxy leader in Sevastopol in occupied Crimea, Mikhail Razvozhayev, later claimed that the \"loud sounds\" residents heard in the Striletska Bay were the Russian forces destroying an \"unmanned boat.\"\nThe Crimean Wind alleged that residents of Sevastopol had their windows blown out by the explosion in the coastal area.\nEarlier this week, Ukraine's military carried out a naval strike in occupied Crimea overnight on June 6, destroying a Project 498 \"Saturn\" raiding tugboat."}, {"id": "4f64503a-8fd3-4717-8da6-5a1e29edb750", "title": "22 civilians killed by Ukrainian shelling : Russia", "date": "2024-06-08 06:00", "url": "https://www.prokerala.com/news/articles/a1537810.html", "message": "Moscow, June 8 : At least 22 civilians were killed as Ukrainian forces bombed a store in the village of Sadovoye in Russia's Kherson, region's Governor Vladimir Saldo said.\nSaldo said that on Friday, at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\nAccording to the Governor, the strike occurred twice, reports Xinhua news agency.\n\"The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,\" Saldo was quoted as saying in the report.\n\"After the first arrival, people from neighbouring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived."}, {"id": "5b2491c1-0b40-40a1-84f0-d61854ebee39", "title": "Kremlin Claims Kyiv Strikes on Russian - Occupied Ukraine Kill 26", "date": "2024-06-08 09:15", "url": "https://www.kyivpost.com/post/33964", "message": "Ukrainian strikes on parts of the Russian-held Luhansk and Kherson regions killed 26 people and injured dozens more on Friday, occupation authorities said.\nBoth Ukrainian regions were among four Russia claimed to have annexed in September 2022 despite not fully controlling any of them following the full-scale invasion launched that February.\nAdvertisementSaldo condemned the “vile murder of civilians” made possible by Western arms deliveries to Ukraine.\nOther Topics of Interest ISW Russian Offensive Campaign Assessment, June 7, 2024 Latest from the Institute for the Study of War.\nAdvertisementIn the central city of Nikopol in the Dnipropetrovsk region, Russian shelling killed a 71-year-old woman, the regional authorities said."}, {"id": "d444ddce-8ca2-4326-84ef-88a62b436962", "title": "Two months after the strike on World Central Kitchen workers , U . S . still reviewing Israel investigation", "date": "2024-06-08 00:45", "url": "https://www.yahoo.com/news/two-months-strike-world-central-000024719.html", "message": "A man displays blood-stained British, Polish, and Australian passports after an Israeli airstrike in Deir al-Balah, Gaza, on April 1, 2024, killed seven World Central Kitchen workers.\nIn the aftermath of the strike on WCK aid workers, the group called for an independent inquiry into the deadly attack.\nAdministration officials have been quick to point out that Israel made some adjustments to its rules of operation based on the findings from its investigation into the WCK strike.\nThe pier was reattached to the beach in Gaza on Friday, according to U.S. Central Command, and the Biden administration expects aid deliveries to resume in the coming days.\nThe goal will be to move 500,000 pounds over the beach daily initially and then grow that over time, administration officials have said."}, {"id": "8fc909ea-c1f9-4112-a0b8-f87404e1523c", "title": "Ukraine stabilizes the north after surprise Russian push – but faces fresh pressure in the east", "date": "2024-06-08 17:30", "url": "https://www.cnn.com/2024/06/08/europe/ukraine-stabilizes-north-pressure-east-russia-intl/", "message": "For much of the war, Ukraine has been constrained when it comes to using powerful Western weapons against Russia.\nKostiantyn Liberov/Libkos/Getty ImagesNortheast of Kharkiv, Russian forces continue to maintain a foothold in the town of Vovchansk.\nBut “most of the city is under the control of the Ukrainian Defense Forces” Voloshyn told CNN.\nFurther south along the eastern front line, Russians have made advances to the west of the city of Avdiivka which fell to Russian forces in February.\nWestern weapons and a new push to draft more soldiers in to the Ukrainian military could give Ukraine the boost it needs."}, {"id": "0165d25f-f17c-46c6-8939-d99a62fa6d4b", "title": "Death toll from Israeli attack on central Gaza jumps to 210", "date": "2024-06-08 19:30", "url": "https://saudigazette.com.sa/article/643427/World/Death-toll-from-Israeli-attack-on-central-Gaza-jumps-to-210", "message": "GAZA — The death toll from the Israeli bombing on Saturday of the Nuseirat refugee camp in central Gaza has risen to 210, the Government Media Office in the besieged Palestinian enclave said.\n“Some 210 martyrs and more than 400 injured were brought to Al-Aqsa Hospital due to the brutal Israeli massacre in the Nuseirat camp,” the office said in a statement.\n“Al-Aqsa Martyrs Hospital is unable to accommodate the number of martyrs and injured due to the Israeli bombardment,” warned the Gaza media office.\nWitnesses also reported that Israeli vehicles advanced near the Gaza Valley on Salah al-Din Road in the central Gaza Strip.\nMeanwhile, the Israeli army confirmed on Saturday launching a “large-scale and unprecedented attack” on the Nuseirat camp and other areas in the central Gaza Strip."}, {"id": "1642e7d3-bbcb-49e2-80b7-6b18a81ee6cf", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 13:45", "url": "https://abc17news.com/news/national-world/cnn-world/2024/06/08/russia-accuses-ukraine-of-shelling-that-leaves-at-least-25-dead-in-occupied-east/", "message": "By Mariya Knight and Niamh Kennedy, CNN(CNN) — Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24."}, {"id": "5039bce8-0b01-413f-b394-67276f771b5a", "title": "Russia accuses Ukraine of shelling that leaves at least 25 dead in occupied east", "date": "2024-06-08 12:00", "url": "https://keyt.com/news/national-world/cnn-world/2024/06/08/russia-accuses-ukraine-of-shelling-that-leaves-at-least-25-dead-in-occupied-east/", "message": "By Mariya Knight and Niamh Kennedy, CNN(CNN) — Russia accused Ukraine of shelling the Russian-occupied eastern territories of Kherson and Luhansk on Friday, leaving at least 25 dead.\nKherson and Luhansk were among four Ukrainian territories Russia claimed to have annexed in September 2022 following its full-scale invasion.\nVladimir Saldo, the Russia-appointed governor of the southern Kherson region, accused Ukrainian forces of killing 22 people, including a 9-year-old child, in the shelling of the small town of Sadove on Friday.\nSaldo claimed that Ukrainian forces did “a double-tap” missile strike on a grocery store and the civilian area in Sadove.\nThe first attack was carried out using a French-supplied aerial bomb and the successive one with an American-supplied HIMARS missile, he told Russia 24."}, {"id": "5f596ced-3a2b-44da-9383-d15e830ea9ab", "title": "Israel bombs another UN - run school in Gaza , a day after strike on school killed 33", "date": "2024-06-08 09:15", "url": "https://www.independent.ie/world-news/middle-east/israel-bombs-another-un-run-school-in-gaza-a-day-after-strike-on-school-killed-33/a1631676334.html", "message": "Palestinians look at the aftermath of the Israeli strike on a U.N.-run school that killed dozens of people in the Nusseirat refugee camp in the Gaza StripAn Israeli airstrike hit a U.N.-run school compound in northern Gaza on Friday, killing three people according to Palestinian emergency officials, a day after a similar strike on a school in Gaza's center killed at least 33 people.\nIn both airstrikes, the Israeli army said Hamas militants were operating from within the schools.\nThe Associated Press could not verify the claims."}, {"id": "5858cfd7-f637-49b1-8f5c-7376e92c5a27", "title": "Intensifying Conflict : Israeli Airstrike Kills Two in Lebanese Town", "date": "2024-06-08 17:30", "url": "https://www.devdiscourse.com/article/law-order/2976290-intensifying-conflict-israeli-airstrike-kills-two-in-lebanese-town", "message": "Two people were killed on Saturday in an Israeli airstrike on the outskirts of the southern Lebanese town of Aitaroun, Lebanon's state-owned National News Agency (NNA) reported on Saturday.\nThe Israeli military said in a statement that its soldiers had identified a Hezbollah militant in the Aitaroun area, and that soon afterwards an Israeli aircraft had carried out an airstrike that hit the individual.\nThe NNA report said the Israeli forces had launched two missiles targeting a cafe at a petrol station, causing significant damage to the premises and to the surrounding area.\nHezbollah said on Saturday its fighters had retaliated by firing rockets on Malkia in northern Israel.\nHezbollah, a Hamas ally, says its attacks aim to support Palestinians under Israeli bombardment in Gaza."}, {"id": "4fdd1513-2f0d-4576-8877-922bc7a03f64", "title": "Attacks in Russian - occupied Ukrainian regions leave 27 dead , Moscow - backed officials say", "date": "2024-06-08 10:15", "url": "https://economictimes.indiatimes.com/news/defence/attacks-in-russian-occupied-ukrainian-regions-leave-27-dead-moscow-backed-officials-say/articleshow/110818261.cms", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelUkraine - Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk say Ukrainian attacks left at least 27 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.A Ukrainian attack Friday on the small town of Sadove in Ukraine's partially occupied Kherson region killed 22 and wounded 15 people, Moscow-backed governor Vladimir Saldo said.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\nPasechnik also said 60 people were wounded in the attack.Ukraine did not comment on either assault.Meanwhile, drone attacks between Russia and Ukraine persisted.Ukraine launched a barrage of drones across Russian territory overnight Friday, Russia's Defense Ministry said Saturday.\nSergei Menyailo reported three downed drones over the region.\nSerhiy Lysak said the overnight drone attack damaged commercial and residential buildings."}, {"id": "14c0d494-6f53-4331-9c34-f4e773cec0e4", "title": "Russia says 22 civilians killed by Ukrainian shelling", "date": "2024-06-08 10:15", "url": "http://global.chinadaily.com.cn/a/202406/08/WS6663f47aa31082fc043cb991.html", "message": "Xinhua | Updated: 2024-06-08 14:04Photo taken on July 24, 2022 shows the view of a harbor in the Kherson region.\n[Photo/Xinhua]MOSCOW -- Ukrainian forces bombed a store in the village of Sadovoye in Russia's Kherson region twice on Friday, killing 22 civilians, the region's Governor Vladimir Saldo said.\nSaldo said that at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\n\"The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,\" Saldo was quoted as saying in the report.\n\"After the first arrival, people from neighboring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived."}, {"id": "3faf2c4f-04f1-49de-b849-e7cc4294919a", "title": "Israeli Forces Batter Central , South Gaza as Tanks Advance in Rafah", "date": "2024-06-08 11:15", "url": "https://en.tempo.co/read/1877483/israeli-forces-batter-central-south-gaza-as-tanks-advance-in-rafah", "message": "Gaza health officials said two Palestinians had been killed and several wounded in western Rafah from tank shelling there.\nIn central Gaza, Palestinian medics said at least 15 people died overnight in Israeli bombardments.\n\"I think the occupation forces are trying to reach the beach area of Rafah.\nIn the larger city of Khan Younis just to the north of Rafah, an Israeli airstrike on the house killed eight people and wounded several, including children, medics said.\nIn north Gaza, three Palestinians were killed in an Israeli airstrike on a Gaza City school building that was sheltering displaced families, rescue workers said."}, {"id": "ba09fe13-a4ec-42de-9651-9b7f9ff5c867", "title": "Blinken to head back to Middle East on Sunday", "date": "2024-06-08 10:15", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240607-voa02.htm", "message": "Blinken to head back to Middle East on SundayBy VOA News June 07, 2024U.S. Secretary of State Antony Blinken is heading back to the Middle East on Sunday in hopes of persuading Israel and Hamas militants to accept a cease-fire agreement designed to halt the fighting, release hostages and get more humanitarian aid into the war-torn Gaza Strip.\nIn northern Gaza, Palestinian emergency workers said three people were killed when an Israeli airstrike hit a U.N.-run school.\nThe Israeli military said it was targeting Hamas gunmen operating from inside the school.\nIsrael used the same explanation Thursday after an airstrike on a school operated by the U.N. relief agency UNRWA in the central Gaza Nuseirat refugee camp.\nHamas is holding about 120 of the hostages in Gaza, although the Israeli military says at least 37 of them are dead."}, {"id": "d5eaddad-7159-452a-9c6c-f71a22dcaa45", "title": "Israel defends targeting UNRWA school after dozens killed", "date": "2024-06-08 00:00", "url": "https://www.thejc.com/news/israel/israel-defends-targeting-unrwa-school-after-dozens-killed-mxsxcryr", "message": "Dozens of civilians have reportedly been killed after Israel launched an air strike against a school that it claimed terrorists were hiding in.\nThe strike hit al-Sardi school, which is run by the Unrwa Palestinian refugee agency, in the early hours of Thursday morning.\nUS State Department spokesperson Matthew Miller said he had seen reports that 14 children had been killed in the blast.\nIn a statement, the IDF said they had carried out a \"precise strike on a Hamas compound embedded inside\" the school.\nThe ones there are children, playing.”Sam Rose, the director of planning for Unrwa, told The Guardian he was not surprised to see an IDF strike cause civilian causalities."}, {"id": "5f0966fc-8d7e-4be6-b6d8-e36da19fcfcd", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead Moscow - backed officials say", "date": "2024-06-08 12:45", "url": "https://www.theweek.in/wire-updates/international/2024/06/08/fgn29-russia-ukraine-ld-war.html", "message": "Kyiv, Jun 8 (AP) Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in Ukraine's partially occupied Kherson region killed 22 and wounded 15 people, Moscow-backed governor Vladimir Saldo said.\nUkraine launched a barrage of drones across Russian territory overnight Friday, Russia's Defence Ministry said Saturday.\nTwenty-five drones were reportedly destroyed over Russia's southern Kuban and Astrakhan regions, the western Tula region, and the Moscow-annexed Crimean peninsula.\nSerhiy Lysak said the overnight drone attack damaged commercial and residential buildings."}, {"id": "601d3f91-635a-4423-b1b6-d90cb5fce2b4", "title": "Russia - Installed Governor Claims 22 Killed In  Double Tap  Attack In Kherson Region", "date": "2024-06-08 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240607-rferl06.htm", "message": "Russia-Installed Governor Claims 22 Killed In 'Double Tap' Attack In Kherson RegionBy RFE/RL's Russian Service and RFE/RL's Ukrainian Service June 07, 2024The Russia-installed governor of the Kherson region in southern Ukraine said 22 people were killed and 15 were injured in the town of Sadove in shelling by Ukrainian forces.\nSaldo said a shop packed with customers and employees was hit in Sadove, a town south of the city of Kherson.\nHe said Ukrainian forces had \"deliberately made a repeat strike to create greater numbers of casualties.\"\nThe same so-called \"double tap\" tactic has been used by Russian forces against Ukraine, including in April in Kharkiv, killing three rescue workers who responded to the first attack.\nIts military said earlier that its forces shot down all five missiles and 48 out of 53 drones over nine regions during Russia's overnight attack."}, {"id": "ab28f371-7ebb-4817-a8cc-0b87d37e848e", "title": "Israeli forces batter Gaza as tanks advance in Rafah - Newspaper", "date": "2024-06-08 03:30", "url": "https://www.dawn.com/news/1838536/israeli-forces-batter-gaza-as-tanks-advance-in-rafah", "message": "CAIRO: With a renewed ceasefire push stalled, Israel bombarded central and southern areas of Gaza Strip again on Friday, killing 28 Palestinians, and tank forces advanced to the western edges of Rafah.\nGaza health officials said two Palestinians had been killed and several wounded in western Rafah from tank shelling there.\nIn central Gaza, Palestinian medics said 15 people died overnight in Israeli bombardment.\nIn northern Gaza, three Palestinians were killed in an Israeli air strike on a Gaza City school building that was sheltering displaced families, rescue workers said.\nHamas said on Friday its fighters shelled militants in the central city of Deir al-Balah shelled a house where Israeli troops were barricaded, killing some and wounding others."}, {"id": "a7fe88a5-a10c-45ab-8d4e-e569c2b1202d", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - backed officials say", "date": "2024-06-08 12:15", "url": "https://www.kob.com/news/us-and-world-news/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-backed-officials-say/", "message": "KYIV, Ukraine (AP) — Russia-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in the Kherson region killed 22 and wounded 15 people, Moscow-appointed governor Vladimir Saldo said.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\n“Most of the city is under the control of the defense forces,” Nazar Voloshin, spokesman for the Khortytsia ground forces formation, said on Ukrainian state TV.\nAlso on Saturday, Ukrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday."}, {"id": "3e9e6eee-6bc9-49c2-ab34-9f4a4d458e90", "title": "Abbas calls for emergency UNSC session on  bloody massacre  as Israeli strikes kill 210 Palestinians", "date": "2024-06-08 18:15", "url": "https://www.pakistantoday.com.pk/2024/06/08/abbas-calls-for-emergency-unsc-session-on-bloody-massacre-as-israeli-strikes-kill-210-palestinians/", "message": "GAZA: Palestinian President Mahmoud Abbas late Saturday night called for an emergency UN Security Council session on what he called “the bloody massacre that was carried out by the Israeli forces” at the al-Nuseirat refugee camp in central Gaza, Reuters reports quoting the WAFA news agency.\nAccording to medical sources, 15 civilians, including children and women, were killed and others wounded in an Israeli occupation’s bombing of the central Governorate, especially the Nuseirat camp.\nIn Bureij refugee camp, six civilians were killed and others were wounded in an Israeli airstrike targeting a house.\nFor about an hour, intense artillery shelling has continued on the Al-Zaytoun and Tal Al-Hawa neighbourhoods in Gaza City, and the Nuseirat, Al-Maghazi, and Al-Bureij camps in the central Gaza Strip.\nHamas military spokesman says Israeli army killed captives in Nuseirat operation"}, {"id": "364e85d0-3a99-4d6a-a0c4-a6c57e21345d", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - backed officials say", "date": "2024-06-08 13:45", "url": "https://isp.netscape.com/news/world/story/0001/20240608/aa5de3171da1126d0ae2a0dd59d419dc", "message": "Attacks in Russian-occupied Ukrainian regions leave 28 dead, Moscow-appointed officials sayKYIV, Ukraine (AP) — Russia-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\nHe said Ukrainian forces had “deliberately made a repeat strike to create greater numbers of casualties” when “residents of nearby houses ran out to help the injured.\"\n“Most of the city is under the control of the defense forces,” Nazar Voloshin, spokesman for the Khortytsia ground forces formation, said on Ukrainian state TV.\nAlso on Saturday, Ukrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday."}, {"id": "6d23d6ba-4dc9-418a-bf02-83b7271f5f8e", "title": "Strategic Calculations Behind Russia Kazan Nuclear Submarine Upcoming Visit to Cuba", "date": "2024-06-08 12:00", "url": "https://theaviationist.com/2024/06/08/strategic-calculations-behind-russias-kazan-nuclear-submarines-upcoming-visit-to-cuba/", "message": "Heralding days of the tense Cold War, particularly the Cuban Missile Crisis, a Russian nuclear-powered submarine of the Yasen-M class, the Kazan, will visit Havana, Cuba has announced.\nWhile the submarine itself would not be armed with nuclear weapons, the strategic message Moscow appears to be sending is loaded.\n“None of the vessels is carrying nuclear weapons, so their stopover in our country does not represent a threat to the region,” it added.\nWhile the Akula is optimized for a ‘hunter-killer’ role, the Yasen-class concept is more of a ‘nuclear guided missile submarine (or SSGN).\nIntelligence gathering missionA Russian nuclear submarine approaching the region will probably attract the attention of several ISR (Intelligence Surveillance Reconnaissance) assets."}, {"id": "f564201c-a9f7-47b2-8c8e-6d31caed779d", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead Moscow - appointed officials say", "date": "2024-06-08 18:45", "url": "https://www.theweek.in/wire-updates/international/2024/06/08/fgn45-russia-ukraine-2ndld-war.html", "message": "Kyiv (Ukraine), Jun 8 (AP) Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a US-supplied HIMARS missile.\nHe said Ukrainian forces had “deliberately made a repeat strike to create greater numbers of casualties” when “residents of nearby houses ran out to help the injured.\"\nTwenty-five drones were reportedly destroyed over Russia's southern Kuban and Astrakhan regions, the western Tula region, and the Moscow-annexed Crimean peninsula.\nDnipropetrovsk regional Gov Serhiy Lysak said the overnight drone attack damaged commercial and residential buildings."}, {"id": "702da288-d19c-4ed4-a4f7-14aaaaa1c69e", "title": "Danish prime minister attacked in Copenhagen", "date": "2024-06-08 00:15", "url": "https://www.voanews.com/a/danish-prime-minister-attacked-in-copenhagen-/7647539.html", "message": "Danish Prime Minister Mette Frederiksen was struck on Friday by a man in a Copenhagen square, her office said, with EU chiefs quickly condemning the attack.\nThe Danish prime minister's office said in a statement to AFP that Frederiksen was \"shocked by the incident,\" but it did not provide further details.\n\"Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet in Copenhagen.\nOn May 15, Slovak Prime Minister Robert Fico was shot four times at close range as he greeted supporters after a government meeting in the central town of Handlova.\n\"I must say that it shakes all of us who are close to her,\" Danish Environment Minister Magnus Heunicke said in a post to social media."}, {"id": "e8224cb3-89ae-4942-b1bf-a7d570205a10", "title": "UN set to add Israel , Hamas to  blacklist  over violations against children", "date": "2024-06-08 03:00", "url": "https://www.yahoo.com/news/un-set-add-israel-hamas-001446039.html", "message": "The United Nations secretary-general is set to describe Israel and Hamas as waging a war that violates children’s rights, moving the country to the body’s “blacklist” in an upcoming report to the Security Council.\nHamas and Palestinian Islamic Jihad will also be listed, according to a report by the Associated Press.\nIsrael has faced strong international criticism over the number of civilian deaths in the eight-month war with Hamas.\nMeanwhile, Israel claimed the attack was a “precise strike on a Hamas compound” inside the school.\nThe UN’s decision to include Israel in this report comes before Netanyahu is set to address a joint session of Congress on July 24th."}, {"id": "f48e56f2-eae3-49cd-b859-2d68b962aa8d", "title": "Dnipropetrovsk oblast rocked by Russian artillery and drone strikes", "date": "2024-06-08 10:00", "url": "https://www.yahoo.com/news/dnipropetrovsk-oblast-rocked-russian-artillery-080500586.html", "message": "The Russian army targeted the Nikopol district of Dnipropetrovsk Oblast with drones and artillery during an overnight attack, killing one man in the shelling, regional governor Serhiy Lysak reported on Telegram on June 8.\nNot only did the shelling claim a life, but it also left a swath of destruction.\nSerhiy Lysak/TelegramSerhiy Lysak/TelegramSerhiy Lysak/TelegramLysak further reported that the shelling disrupted power lines, and authorities are still assessing the full extent of the damage.\nRead also: Four passengers injured after Russians target bus of Ukrainian civilians in NikopolWe’re bringing the voice of Ukraine to the world.\nRead the original article on The New Voice of Ukraine"}, {"id": "62a3cccc-da09-4c4f-b6ed-e44ce4489b52", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - backed officials say", "date": "2024-06-08 16:30", "url": "https://www.mprnews.org/story/2024/06/08/attacks-in-russianoccupied-ukrainian-regions-leave-28-dead-moscowbacked-officials-say", "message": "Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in Ukraine’s partially occupied Kherson region killed 22 and wounded 15 people, Moscow-backed governor Vladimir Saldo said.\nFurther east, Leonid Pasechnik, the Russia-installed governor in Ukraine’s partially occupied Luhansk region, said Saturday that two more bodies had been pulled from the rubble following Friday's Ukrainian missile attack on the regional capital, also called Luhansk.\nTwenty-five drones were reportedly destroyed over Russia’s southern Kuban and Astrakhan regions, the western Tula region, and the Moscow-annexed Crimean peninsula.\nOn Saturday morning, officials said air defenses for the first time shot down Ukrainian drones over the North Ossetia region in the North Caucasus, some 560 miles east of the front line in Ukraine’s partially occupied Zaporizhzhia region."}, {"id": "2c752767-167f-43b1-9545-13efe2b6b6bc", "title": "  Despicable act : European leaders condemn assault of Danish PM", "date": "2024-06-08 13:00", "url": "https://www.prokerala.com/news/articles/a1537945.html", "message": "Copenhagen, June 8 : European Commission President Ursula von der Leyen on Saturday called the assault on Danish Prime Minister Mette Frederiksen a \"despicable act which goes against everything we believe and fight for in Europe\".\nThe Danish Prime Minister Mette Frederiksen was assaulted in a central Copenhagen square following which she has been hospitalised.\nWitnesses told Danish media that the prime minister was able to walk away from the scene.\nThe incident comes as the EU's 27 countries elect hundreds of members of the European Parliament during four days of voting that began on Thursday.\nLast month the EU was stunned by the shooting of Slovakia's prime minister, Robert Fico, in an assassination attempt."}, {"id": "82346264-8b54-43f2-bbd2-098c464ea7f5", "title": "Israel pounds Gaza refugee camp as war enters 9th month", "date": "2024-06-08 00:30", "url": "https://www.omanobserver.om/article/1154798/world/region/israel-pounds-gaza-refugee-camp-as-war-enters-9th-month", "message": "Israeli forces bombarded a Gaza refugee camp on Friday after a deadly strike on a UN-run school there, as the war sparked by Hamas's unprecedented attack on Israel entered its ninth month.\nAl Aqsa Martyrs hospital in Deir al Balah, central Gaza, said at least 37 people were killed in Thursday's Israeli strike on the UN-run school in Nuseirat camp.\nThe Israeli military said its fighter jets killed nine \"fighters\" in three classrooms where about 30 militants from Hamas and IJ were hiding.\nWitnesses also reported Israeli strikes east of Deir al Balah and intensive fire from army vehicles near the Bureij camp, where a blaze was raging.\nThe Israeli military said it \"eliminated dozens of fighters\" in eastern Bureij and Deir al Balah."}, {"id": "65d274cd-9bf5-4030-9cb3-0905390a3758", "title": "Puntland Security Force captures two ISIS fighters surviving US airstrike", "date": "2024-06-08 10:15", "url": "https://www.hiiraanweyn.net/2024/06/08/puntland-security-force-captures-two-isis-fighters-surviving-us-airstrike/", "message": "Sabti 8 June 2024 {HMC} The Puntland Security Force {PSF} has apprehended two ISIS foreign nationals who they said survived last week’s US airstrike in northeastern Somalia.\nAccording to a statement from the PSF on Saturday, the men identified as Imraan Mohamed Alawi and Mabruuk Nassor Saidi are from Tanzania.\nThe security forces arrested the men 30 km away from the area where the bombing took place, following a tip-off and subsequent pursuit by the PSF.\nadvertisementsA joint airstrike carried out by Somali and U.S. forces killed three Islamic State {IS}-Somalia fighters in a remote area near Dhaardaar, about 81 km southeast of Bosaso, last week.\nThe so-called IS wing in Somalia has its main base in the Puntland region, northeastern Somalia, and has occasionally clashed with Puntland forces and al-Shabab militants."}, {"id": "53c24894-e833-4cd0-924a-6473be8c3ada", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - backed officials say", "date": "2024-06-08 17:00", "url": "https://www.pressherald.com/2024/06/08/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-backed-officials-say/", "message": "KYIV, Ukraine — Russia-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\nUkraine launched a barrage of drones across Russian territory overnight Friday, Russia’s Defense Ministry said Saturday.\n“Most of the city is under the control of the defense forces,” Nazar Voloshin, spokesman for the Khortytsia ground forces formation, said on Ukrainian state TV.\nAlso on Saturday, Ukrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday."}, {"id": "246b2ebe-ee0f-4920-a9ee-1a57f5f6fe87", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - backed officials say", "date": "2024-06-08 18:15", "url": "https://www.centralmaine.com/2024/06/08/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-backed-officials-say/", "message": "KYIV, Ukraine — Russia-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\nUkraine launched a barrage of drones across Russian territory overnight Friday, Russia’s Defense Ministry said Saturday.\n“Most of the city is under the control of the defense forces,” Nazar Voloshin, spokesman for the Khortytsia ground forces formation, said on Ukrainian state TV.\nAlso on Saturday, Ukrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday."}, {"id": "f38d3f07-f943-4ee8-8e24-b1aa612eac5e", "title": "European leaders condemn assault on Danish PM in Copenhagen square", "date": "2024-06-08 10:30", "url": "https://www.prokerala.com/news/articles/a1537877.html", "message": "Copenhagen, June 8 : Leaders have strongly condemned an assault on Danish Prime Minister Mette Frederiksen in a central Copenhagen square, adding to the alarming rash of political violence rattling Europe.\nThe incident comes as the EU's 27 countries elect hundreds of members of the European Parliament during four days of voting that began on Thursday.\nLast month, the EU was stunned by the shooting of Slovakia's Prime Minister, Robert Fico, in an assassination attempt.\nRoberta Metsola, the President of the European Parliament, wrote: \"Tonight's assault on the Danish prime minister is appalling.\nCanadian Prime Minister Justin Trudeau posted: \"Disturbing to hear that Prime Minister Frederiksen was attacked in a public square in Copenhagen."}, {"id": "3fb2bc08-806b-4db7-a8b4-1e0f7c135872", "title": "LIVE UPDATES : UNRWA Facilities Face Unprecedented Attacks Amid Gaza War", "date": "2024-06-08 07:45", "url": "https://menafn.com/1108308988/LIVE-UPDATES-UNRWA-Facilities-Face-Unprecedented-Attacks-Amid-Gaza-War", "message": "(MENAFN- The Peninsula) The PeninsulaDoha, Qatar: facilities have faced unprecedented attacks, with a recent strike on a school killing 35 to 45 people.\nThe International Rescue Committee warns that famine is likely underway in northern Gaza, stressing the need for unimpeded humanitarian access.\nMeanwhile, New Zealand commits $1 million to UNRWA after UN assurances of neutrality.\nGaza's reports a rising death toll of 36,731 since October 7, with 77 killed in the past 24 hours.\n(Photo by Bashar TALEB / AFP)At least 36,731 people have been killed and 83,530 wounded in Israeli military attacks on Gaza since October 7, the enclave's Health Ministry says."}, {"id": "1d215244-24db-45ff-a2f6-2e17dd6c1336", "title": "Under a drone - filled sky , Ukraine tries to retake a town , one house at a time", "date": "2024-06-08 12:30", "url": "https://www.theguardian.com/world/article/2024/jun/08/under-a-drone-filled-sky-ukraine-tries-to-retake-a-town-one-house-at-a-time", "message": "(57th Separate Motorised Infantry Brigade/Ukraine army) Drone footage shows Russian troops in the town of Vovchansk.\n(57th Separate Motorised Infantry Brigade/Ukraine army)A brutal battle has raged ever since.\n(57th Separate Motorised Infantry Brigade/Ukraine army) The town of Vovchansk has been reduced to rubble after a month of heavy fighting.\n(57th Separate Motorised Infantry Brigade/Ukraine army)As well as Vovchansk, Russia has advanced towards the village of Lyptsi.\n(57th Separate Motorised Infantry Brigade/Ukraine army)Villagers living in the nearby countryside have also escaped."}, {"id": "b027b178-7441-4a76-83fc-eb301abdbd71", "title": "European leaders condemn assault of Danish PM in Copenhagen square", "date": "2024-06-08 10:00", "url": "https://www.yahoo.com/news/european-leaders-condemn-assault-danish-075256759.html", "message": "Danish Prime Minister Mette Frederiksen speaks at a press conference with Chancellor Scholz after their meeting.\nMichele Tantussi/Getty Images Europe/Pool/dpaLeaders have strongly condemned an assault on Danish Prime Minister Mette Frederiksen in a central Copenhagen square, adding to the alarming rash of political violence rattling Europe.\nLast month the EU was stunned by the shooting of Slovakia's prime minister, Robert Fico, in an assassination attempt.\nRoberta Metsola, the president of the European Parliament, wrote: \"Tonight's assault on the Danish prime minister is appalling.\nCanadian Prime Minister Justin Trudeau posted: \"Disturbing to hear that Prime Minister Frederiksen was attacked in a public square in Copenhagen."}, {"id": "c764596c-dd22-47b7-9f6e-6dafe0afa133", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - appointed officials say", "date": "2024-06-08 17:00", "url": "https://www.local10.com/news/2024/06/08/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-backed-officials-say/", "message": "The city center is covered with debris after the Russian missile attack in Kharkiv, Ukraine, Saturday, May, 25, 2024.\n(AP Photo/Andrii Marienko)KYIV – Russia-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nRecommended VideosRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\nHe said Ukrainian forces had “deliberately made a repeat strike to create greater numbers of casualties” when “residents of nearby houses ran out to help the injured.\"\n“Most of the city is under the control of the defense forces,” Nazar Voloshin, spokesman for the Khortytsia ground forces formation, said on Ukrainian state TV."}, {"id": "c765daaf-1a77-4306-894d-af6c7d6d1d74", "title": "Danish Prime Minister left  shaken  and with whiplash after street attack", "date": "2024-06-08 12:15", "url": "https://www.thejournal.ie/prime-minister-of-denmark-attack-6402050-Jun2024/", "message": "We need your help nowSupport from readers like you keeps The Journal open.\nYou are visiting us because we have something you value.\nIndependent, unbiased news that tells the truth.\nAdvertising revenue goes some way to support our mission, but this year it has not been enough.\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism."}, {"id": "c12d44f6-7399-485f-99a2-1f6a4d73adc8", "title": "Under a drone - filled sky , Ukraine tries to retake a town , one house at a time", "date": "2024-06-08 12:45", "url": "https://www.aol.co.uk/news/under-drone-filled-sky-ukraine-120815524.html", "message": "Photograph: Jędrzej Nowicki/The ObserverThe two Russian soldiers jogged across an apocalyptic landscape.\nThey retreated six months later, going back up the road to the Russian city of Belgorod.\nStreet battles in Vovchansk were so intense that only experienced Ukrainian soldiers were deployed there, rotating among themselves in shifts.\nHe said Russian soldiers kidnapped an unknown number of civilians, using them as a human shields and taking them across the border.\nSoon afterwards, Russian soldiers stormed the building and set up on observation point in a medical department with a tower across the road."}, {"id": "71767570-a529-4f64-8308-e76d53caf611", "title": "European leaders condemn assault of Danish PM in Copenhagen square", "date": "2024-06-08 13:00", "url": "https://www.prokerala.com/news/articles/a1537941.html", "message": "Copenhagen, June 8 : Leaders have strongly condemned an assault on Danish Prime Minister Mette Frederiksen in a central Copenhagen square, adding to the alarming rash of political violence rattling Europe.\nWitnesses told Danish media that the prime minister was able to walk away from the scene.\nLast month the EU was stunned by the shooting of Slovakia's prime minister, Robert Fico, in an assassination attempt.\nRoberta Metsola, the president of the European Parliament, wrote: \"Tonight's assault on the Danish prime minister is appalling.\nCanadian Prime Minister Justin Trudeau posted: \"Disturbing to hear that Prime Minister Frederiksen was attacked in a public square in Copenhagen."}, {"id": "eebda172-dbea-47ea-bd16-3e35b76d87f7", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - appointed officials say", "date": "2024-06-08 17:30", "url": "https://www.wfmz.com/news/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-appointed-officials-say/article_a9a16205-11b7-5585-bb4c-698617c3ddd6.html", "message": "Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk say Ukrainian attacks left 28 dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday"}, {"id": "93c014a3-f02f-45f4-9652-712538ca880b", "title": "Israel  disgusted  after being placed on UN list of countries failing to protect children", "date": "2024-06-08 05:00", "url": "https://www.sbs.com.au/news/article/israel-disgusted-after-being-placed-on-un-list-of-countries-failing-to-protect-children/msudim6nz", "message": "Key Points Israel will be included on the UN's annual list of countries it deems to be failing to protect children in war.\nThe upcoming inclusion of Israel on a UN list of countries and armed forces determined to be failing to protect children in war prompted a furious Israeli response Friday.\nIn central Gaza, Palestinian medics said at least 15 people died overnight in Israeli bombardments.\nAn Israeli strike on a Gaza school killed as many as 40 people, medics said.\nMore than 36,700 people have been killed in Gaza since 7 October, according to the health ministry in Gaza."}, {"id": "f8eb741d-e47a-409f-ac8b-e866e2b92ce1", "title": "European Leaders Condemn Assault Of Danish PM In Copenhagen Square", "date": "2024-06-08 16:00", "url": "https://menafn.com/1108310487/European-Leaders-Condemn-Assault-Of-Danish-PM-In-Copenhagen-Square", "message": "(MENAFN- IANS) Copenhagen, June 8 (IANS/DPA) Leaders have strongly condemned an assault on Danish Prime Mette Frederiksen in a central Copenhagen square, adding to the alarming rash of violence rattling Europe.\nWitnesses told Danish media that the prime minister was able to walk away from the scene.\nLast month the EU was stunned by the shooting of Slovakia's prime minister, Robert Fico, in an assassination attempt.\nRoberta Metsola, the president of the European Parliament, wrote: \"Tonight's assault on the Danish prime minister is appalling.\nCanadian Prime Minister Justin Trudeau posted: \"Disturbing to hear that Prime Minister Frederiksen was attacked in a public square in Copenhagen."}, {"id": "a2e3f646-b7d5-4b1a-bd1b-cc51fcb84e25", "title": "Who are the four Israeli hostages freed from Gaza ? ", "date": "2024-06-08 15:45", "url": "https://www.yahoo.com/news/four-israeli-hostages-freed-gaza-133314156.html", "message": "Who are the four Israeli hostages freed from Gaza?\nYakov Argamani, father of Israeli hostage Noa Argamani, 26, speaks to journalists in Tel Aviv on December 16, 2023 (Alberto PIZZOLI)The Israeli military said its troops rescued on Saturday four Israeli hostages alive from Gaza.\nA student at Ben-Gurion University in the southern Israeli city of Beersheba, Argamani \"loves life\", a group of her friends said on social media.\nOrit Meir told reporters in Athens in November that her life had become \"a nightmare.\"\n- Shlomi Ziv, 41 -Shlomi Ziv was part of the security team at the Supernova music festival, according to Israeli media."}, {"id": "29f3a233-d9d9-4960-8fe2-fbe08ef3b189", "title": "The four hostages freed after 246 days", "date": "2024-06-08 17:15", "url": "https://www.yahoo.com/news/four-hostages-freed-246-days-162500970.html", "message": "The four hostages freed after 246 daysFamilies of Israeli hostages have hailed the rescue of four captives as a “miraculous triumph”.\nAll four were kidnapped by Hamas terrorists at the Supernova music festival on Oct 7 last year.\nNoa ArgamaniNoa Argamani, 26Noa became one of the most high-profile hostages in the immediate aftermath of Oct 7, as the moment of her capture appeared on countless newspaper front pages.\nIn a video that showed her being kidnapped, she screamed “don’t kill me!” as Hamas fighters dragged her away.\nThe last glimpse she had of her son was a Hamas video released shortly after the attack."}, {"id": "e4acee48-8709-4465-9913-5154410f958d", "title": "The four hostages freed from Hamas captivity after 246 days", "date": "2024-06-08 17:30", "url": "https://www.telegraph.co.uk/world-news/2024/06/08/four-hostages-freed-from-captivity-after-246-days/", "message": "Families of Israeli hostages have hailed the rescue of four captives as a “miraculous triumph”.\nThey were rescued in a complex special daytime operation in the heart of Nuseirat in central Gaza on Saturday.\nAll four were kidnapped by Hamas terrorists at the Supernova music festival on Oct 7 last year.\nWho are they?"}, {"id": "a21bf7fe-9578-41fb-9ccc-e3abc072dd4b", "title": "Slovakia and Italy to vote today as bumper EU elections continue across the continent", "date": "2024-06-08 09:00", "url": "https://www.thejournal.ie/slovakia-elections-6401933-Jun2024/", "message": "We need your help nowSupport from readers like you keeps The Journal open.\nYou are visiting us because we have something you value.\nIndependent, unbiased news that tells the truth.\nAdvertising revenue goes some way to support our mission, but this year it has not been enough.\nIf you've seen value in our reporting, please contribute what you can, so we can continue to produce accurate and meaningful journalism."}, {"id": "83e40abb-a4c9-472c-af72-70f20dfc7db2", "title": "Who are the four Israeli hostages freed from Gaza ? ", "date": "2024-06-08 16:30", "url": "https://www.al-monitor.com/originals/2024/06/who-are-four-israeli-hostages-freed-gaza", "message": "June 8, 2024 — Jerusalem (AFP)The Israeli military said its troops rescued on Saturday four Israeli hostages alive from Gaza.\nThey had been held there since Hamas Palestinian militants captured them on October 7 during their attack on the Supernova music festival in southern Israel, the army said.\nOrit Meir told reporters in Athens in November that her life had become \"a nightmare.\"\n- Andrey Kozlov, 27 -Russian-Israeli Andrey Kozlov was a security guard at the music festival.\n- Shlomi Ziv, 41 -Shlomi Ziv was part of the security team at the Supernova music festival, according to Israeli media."}, {"id": "b851c8d8-c689-420b-b669-27337bf1106c", "title": "Day 246 : 36 , 801 killed , 83 , 680 injured in Gaza", "date": "2024-06-08 14:45", "url": "https://english.almayadeen.net/news/politics/day-246--36-801-killed--83-680-injured-in-gaza", "message": "A new Israeli massacre increases the number of casualties in the Strip, with 70 Palestinians killed and 150 injured in the past 24 hours.\nPalestinians wounded in the Israeli bombardment of the Gaza Strip arrive at al-Aqsa Hospital in Deir al Balah on June 8, 2024.\n(AP)The number of Palestinians killed in Gaza due to the Israeli genocidal war ongoing since October 7 has now reached 36,801, in addition to 83,680 injured, the Ministry of Health in Gaza announced Saturday in its daily report.\nAdditionally, it confirmed that the Israeli occupation forces committed five massacres across different families in the Gaza Strip, killing 70 Palestinians and injuring 150 in the past 24 hours.\nAccording to our correspondent, dozens of Israeli rockets targeted civilian homes in Nuseirat camp."}, {"id": "63f25cea-100f-4cac-86c2-b5334700bd92", "title": "Disinformation Campaign Exposed : Alleged Houthi Strike on USS Eisenhower Found Baseless", "date": "2024-06-08 05:00", "url": "https://trendydigests.com/2024/06/08/disinformation-campaign-exposed-alleged-houthi-strike-on-uss-eisenhower-found-baseless/", "message": "A cursory glance at social media over the past week might have you thinking the USS Eisenhower was damaged by a missile fired by the Houthis.\nThese false claims involved a video, uploaded to the social media platform X, which gained traction among users.\nThe footage, allegedly showing the Eisenhower on fire, has been identified as taken from a popular video game.\nMisinformation of this nature is not simply a matter of erroneous reporting; it might also forms a part of a disinformation campaign carefully orchestrated disinformation campaign to confuse those on social media.\nIt’s essential to note the Houthi military spokesperson Yahya Saree’s repeated allegations of successful strikes against the Eisenhower and accompanying warships."}, {"id": "7878b497-132d-4dbb-945d-930ce2cdb641", "title": "Russia Advanced Yasen - M Class Nuclear Submarine Is Headed For Cuba", "date": "2024-06-08 01:45", "url": "https://www.yahoo.com/news/russias-advanced-yasen-m-class-001237490.html", "message": "The Russian Navy frigate Admiral Gorshkov arrives in the port of Havana during a previous visit to Cuba on June 24, 2019.\nThe first-in-class Russian Navy Project 22350 frigate Admiral Gorshkov was sailing in the Caribbean in June 2019.\nLast July, for example, the Russian Navy sent the training class ship Perekop into Havana for a four-day visit.\nMinistry of Defense of RussiaSignificant, too, is the fact that the Kazan and the Admiral Gorshkov are notably modern and capable assets.\nEarlier this week, a senior U.S. official suggested that the current Russian Navy deployment might also include a port call in Venezuela."}, {"id": "58da9dd6-3320-443e-b132-2eac8744b755", "title": "22 civilians killed by Ukrainian shelling : Russia", "date": "2024-06-08 07:45", "url": "https://www.mangalorean.com/22-civilians-killed-by-ukrainian-shelling-russia/", "message": "22 civilians killed by Ukrainian shelling: RussiaMoscow: At least 22 civilians were killed as Ukrainian forces bombed a store in the village of Sadovoye in Russia’s Kherson, region’s Governor Vladimir Saldo said.\nSaldo said that on Friday, at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\nAccording to the Governor, the strike occurred twice, reports Xinhua news agency.\n“The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,” Saldo was quoted as saying in the report.\n“After the first arrival, people from neighbouring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived."}, {"id": "2b1af5a6-47b0-4e46-9b00-1059055c2a45", "title": "Reports Surface Of New Version Of Russian Kh - 101 Cruise Missile With Cluster Warhead", "date": "2024-06-08 14:00", "url": "https://theaviationist.com/2024/06/08/kh-101-cluster-warhead/", "message": "Pictures and media reports from Ukraine claim the Kh-101 is now carrying a cluster warhead, in its dual-warhead variant.\nRussia has reportedly introduced another modification to the Kh-101 ALCM (X-101 Air-Launched Cruise Missile), after variants releasing decoys to divert SAM (Surface-to-Air Missiles) and dual/tandem warheads.\nPictures and media reports claim the Kh-101 is now carrying a cluster warhead, in its dual-warhead variant.\nMainstay Russian Air-Launched Cruise MissileKh-101 is a strategic cruise missile that is designed with LO (Low Observable features).\nAssuming it is the Kh-101 missile and the claim about the cluster warhead is true, it is likely the Russians might have to compromise on range to accommodate it."}, {"id": "0e8c164b-1587-430f-9534-7560259afa2f", "title": "Palestinians report 50 killed in Israeli assault as Israel rescues four hostages in Gaza", "date": "2024-06-08 15:00", "url": "https://tribune.com.pk/story/2470461/palestinians-report-50-killed-in-israeli-assault-as-israel-rescues-four-hostages-in-gaza", "message": "Almog Meir Jan, a released hostage reacts, after the military said that Israeli forces have rescued four hostages, in Ramat Gan, Israel June 8, 2024.\nThe Israeli military named the rescued hostages as Noa Argamani, 25, Almog Meir Jan, 21, Andrey Kozlov, 27, and Shlomi Ziv, 40.\nThere are 116 now left in Gaza, according to Israeli tallies, including at least 40 whom Israeli authorities have declared dead.\nThe Israeli military had said earlier on Saturday it was targeting resistance infrastructure in al-Nuseirat, an unusual announcement because it does not normally report on its operations while they are still underway.\nGaza's health ministry meanwhile reported on Saturday that Israeli military assaults in al-Nuseirat had killed and wounded dozens of people including women and children."}, {"id": "53f5bd0f-27a4-4ab5-8111-77bccb38c07b", "title": "Funeral , procession honors 3 - year - old North Olmsted boy murdered at Giant Eagle", "date": "2024-06-08 13:00", "url": "https://www.cleveland19.com/2024/06/08/funeral-procession-honors-3-year-old-north-olmsted-boy-murdered-giant-eagle/", "message": "NORTH OLMSTED, Ohio (WOIO) - The funeral for the slain three-year-old North Olmsted boy is set for Saturday at St. Charles Borromeo Church in Parma.\nSunset Memorial Park ; 6625 Columbia Road North Olmsted 4407019 News will be streaming outside of the church and the procession.\nMemorial for Julian Wood at the North Olmsted Giant Eagle (Bingel, Julia | (Source: WOIO))Margot was stabbed while trying to pull Julian from the grocery cart, said O’Malley.\nPREVIOUS COVERAGE: New details about woman charged in fatal stabbing outside North Olmsted Giant EagleEllis was indicted on multiple charges including aggravated murder.\nPREVIOUS COVERAGE: North Olmsted tragedy: Share message of support with the Wood familyNorth Olmsted police previously said the attack appears to be random."}, {"id": "7965609f-fc6e-4487-b75d-17e31c13ede9", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 00:30", "url": "https://www.koka.am/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "72557dd4-7532-4bc4-a4de-e4dbb95e81d8", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 00:30", "url": "https://www.k101fm.net/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "9a77b85f-4606-4781-9075-84d96842715e", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 00:00", "url": "https://www.centralmoinfo.com/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "eafbc9bb-2a20-4cfd-a74d-de738a27cae9", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 01:00", "url": "https://www.amazingmadison.com/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "acac7760-cb51-48f8-9f02-19246b3cc046", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 01:45", "url": "https://www.exploreseiowa.com/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "9b6a71d5-41c5-467b-9b4a-15431dc9b508", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 01:15", "url": "https://www.kdks.fm/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "c232f021-a31a-48ab-a87e-4842d01d3aea", "title": "ABC World - WOND", "date": "2024-06-08 18:15", "url": "https://wondradio.com/abc-world/6b91b1b6c59eee2a00f312e4dcc3c858", "message": "-ABC News' Samy Zyara and Nasser AttaJun 08, 7:12 AMIsrael says it rescued 4 hostagesIsrael rescued four hostages alive from two locations in the heart of Nuseirat, Gaza, Israel said Saturday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,\" he said, describing the aftermath of the deadly Rafah strike.\n-ABC News' Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.\n-ABC News' William GretskyCopyright © 2024, ABC Audio."}, {"id": "828bd6e2-363b-404b-aa9f-80e7008906a7", "title": "Live updates : Israel - Hamas war , Israeli hostages rescued", "date": "2024-06-08 13:00", "url": "https://edition.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-06-08-24/", "message": "The Israeli military rescued four hostages held in Gaza on Saturday in a major daytime operation in central Gaza.\nThe strip's government media office said at least 210 Palestinians were killed and more than 400 injured by the Israeli bombardment as it carried out the hostage rescue operation.\nOver 200 Palestinians dead:At least 210 people have been killed and more than 400 injured as a result of the Israeli operation, the enclave's government media office said.\nHamas accused Israel of committing a \"horrific massacre,\" saying the rescue operation would not change Israel's \"strategic failure in the Gaza Strip.\"\nHow the operation happened: Israeli forces prepared for weeks for Saturday’s special military raid."}, {"id": "b77d943b-dbbe-4593-9fd9-391dd27b2b67", "title": "Israel - Gaza live updates : Israel says it rescued 4 hostages", "date": "2024-06-08 19:30", "url": "https://www.amazingmadison.com/syndicated-article/?id=1568393", "message": "Biden welcomed the safe return of four hostages from Gaza, pledging that the United States will not stop working until all hostages are home.\n-ABC News’ Samy Zyara and Nasser AttaJun 08, 7:12 AMIsrael says it rescued 4 hostagesIsrael rescued four hostages alive from two locations in the heart of Nuseirat, Gaza, Israel said Saturday.\nThe rescued hostages have been transferred to the ‘Sheba’ Tel-HaShomer Medical Center and are in good condition, the IDF said.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike."}, {"id": "e216d42b-54d2-4bef-a101-98782952b4ab", "title": "Israel - Gaza live updates : Israel says it rescued 4 hostages", "date": "2024-06-08 19:30", "url": "https://www.madrock1025.com/syndicated-article/?id=1568393", "message": "Biden welcomed the safe return of four hostages from Gaza, pledging that the United States will not stop working until all hostages are home.\n-ABC News’ Samy Zyara and Nasser AttaJun 08, 7:12 AMIsrael says it rescued 4 hostagesIsrael rescued four hostages alive from two locations in the heart of Nuseirat, Gaza, Israel said Saturday.\nThe rescued hostages have been transferred to the ‘Sheba’ Tel-HaShomer Medical Center and are in good condition, the IDF said.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike."}, {"id": "96588aca-efa6-406a-a724-92ed0090e512", "title": "Israel Bombs Another UN - Run School In Gaza , A Day After Strike On School Killed 33 – 710am KURV", "date": "2024-06-08 01:00", "url": "https://www.kurv.com/israel-bombs-another-un-run-school-in-gaza-a-day-after-strike-on-school-killed-33/", "message": "(AP)–An Israeli airstrike hit a U.N.-run school compound in northern Gaza on Friday, killing three people according to Palestinian emergency officials, a day after a similar strike on a school in Gaza’s center killed at least 33 people.\nIn both airstrikes, the Israeli army said Hamas militants were operating from within the schools.\nIsrael on Friday released the names of 17 militants it said were killed in Thursday’s strike.\nInternational pressure is mounting on Israel to limit civilian bloodshed in its war in Gaza, which completed its eighth month on Friday.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "7eb83343-9f8a-40f8-9c42-cd90e8e79011", "title": "Russia says 22 civilians killed by Ukrainian shelling - Xinhua", "date": "2024-06-08 04:45", "url": "https://english.news.cn/20240608/da664d6e03b44da7a62b6e0681672c8a/c.html", "message": "MOSCOW, June 8 (Xinhua) -- Ukrainian forces bombed a store in the village of Sadovoye in Russia's Kherson region twice on Friday, killing 22 civilians, the region's Governor Vladimir Saldo said.\nSaldo said that at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\n\"The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,\" Saldo was quoted as saying in the report.\n\"After the first arrival, people from neighboring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived.\nAmong the dead were two children,\" Saldo added."}, {"id": "932ae55b-b66e-43e2-bbfa-d5174244762b", "title": "Russia says 22 civilians killed by Ukrainian shelling | Central India Premier English Daily", "date": "2024-06-08 06:30", "url": "https://www.centralchronicle.com/russia-says-22-civilians-killed-by-ukrainian-shelling/", "message": "Moscow, June 8 (UNI) Ukrainian forces bombed a store in the village of Sadovoye in Russia’s Kherson region twice on Friday, killing 22 civilians, the region’s Governor Vladimir Saldo said.\nSaldo said that at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\n“The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,” Saldo was quoted as saying in the report.\n“After the first arrival, people from neighboring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived.\nAmong the dead were two children,” Saldo added."}, {"id": "23a8c357-4fb0-467e-8a7b-bed1d1e281d2", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza strikes", "date": "2024-06-08 16:30", "url": "https://www.breitbart.com/news/israel-rescues-4-hostages-kidnapped-in-a-hamas-led-attack-on-oct-7/", "message": "Israel says it has rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7Israel rescues 4 hostages kidnapped in a Hamas attack on Oct. 7.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "e0ee4330-fa33-43ca-bd2a-461797b0f9fb", "title": "Danish Prime Minister Frederiksen assaulted in Copenhagen", "date": "2024-06-08 00:00", "url": "https://www.euronews.com/my-europe/2024/06/07/danish-prime-minister-frederiksen-assaulted-in-copenhagen", "message": "ADVERTISEMENTDanish Prime Minister Mette Frederiksen has been assaulted by an unknown man in Kultorvet, a central square in Copenhagen, Danish media has reported.\nAccording to her office Frederiksen suffered a light whiplash injury in the assault.\nFrench Prime Minister Emmanuel Macron posted that \"the attack on the Danish Prime Minister is unacceptable.\"\nLast month, Slovakia's Prime Minister survived an assassination attempt in the central Slovakian town of Handlová.\nSweden's Foreign Minister, Tobias Billström reacted to Friday's attack against Frederiksen on X saying that such an “absolutely terrible” attack should be strongly condemned."}, {"id": "92ea9558-0bbe-4363-a752-f147ac596311", "title": "EU voting passes halfway mark with Slovakia , Italy joining in", "date": "2024-06-08 13:15", "url": "https://www.guampdn.com/news/national/eu-voting-passes-halfway-mark-with-slovakia-italy-joining-in/article_3b8a409e-2b47-55e4-aa6a-159aa9174a79.html", "message": "Four days of voting to choose a new European Parliament passed the halfway mark Saturday with Slovakia -- shaken by an assassination attempt last month on its premier -- and influential Italy joining in.\nFico's party opposes EU arms deliveries to Ukraine and rails against alleged \"warmongers\" in Brussels.\nThose are also positions shared with many, but not all, far-right parties in Europe, which are predicted to make gains in the European Parliament.\nLate Friday, a man hit Danish Prime Minister Mette Frederiksen in a Copenhagen square.\n- 'Scary' far-right -In Italy, Meloni has put her name on the EU ballot papers as the lead candidate for the Brothers of Italy, though she does not intend to take up a seat in the European Parliament if chosen."}, {"id": "c0b5ffe5-d021-41a7-8367-ee18db69f1c8", "title": "Danish PM attacked by man in Copenhagen", "date": "2024-06-08 14:45", "url": "https://www.deccanchronicle.com/world/danish-pm-mette-frederiksen-hit-by-man-in-copenhagen-897958", "message": "Copenhagen: Danish Prime Minister Mette Frederiksen was \"hit\" on Friday by a man in a Copenhagen square, her office said, with EU chiefs quickly condemning the attack.\nThe Danish prime minister's office said in a statement to AFP that Frederiksen was \"shocked by the incident\", but did not provide further details.\n\"Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet in Copenhagen.\nCopenhagen police confirmed that an incident involving the prime minister had occurred but did not provide further details.\nIn 2019, Frederiksen became the country's youngest prime minister, and kept the post after emerging victorious in the 2022 general election."}, {"id": "949fb1fc-222c-459c-8214-adcfe36a26b0", "title": "Republican governor nominee Mark Robinson entertained conspiracy theories that the U . S . government was behind the attack on Pearl Harbor and death of General Patton", "date": "2024-06-08 16:45", "url": "https://www.dailymail.co.uk/news/article-13499505/mark-robinson-governor-nominee-pearl-harbor-general-patton.html", "message": "Robinson went on to argue that President Franklin Roosevelt’s decision to enter the war was part of a communist conspiracy to help Stalin.\nRobinson called the circumstances around General George Patton's death in 1945 'just too fishy to me.'\n'North Carolina voters know better and they’ll see right through it when they elect Mark Robinson governor in November,' Lonergan said.\nGovernor Robinson speaking at a Trump rally on March 2 , 2024.\nRobinson called the civil rights leader a ‘communist’ in a 2018 podcast."}, {"id": "859f8008-88b9-4a42-831a-4cea2dd42b14", "title": "Essex man arrested for stabbing stranger in front of schoolchildren | News", "date": "2024-06-08 10:15", "url": "https://www.independent.co.uk/tv/news/essex-stabbing-crime-school-tiptree-b2559098.html", "message": "Watch the dramatic moment a violent offender was arrested after stabbing a stranger in front of terrified schoolchildren in Essex.\nJohn Garrett, 55, attacked a man at a bus stop in Tiptree in broad daylight after stealing two bottles of alcohol from a Shell garage on 11 July 2023.\nHe stabbed his victim in the neck three times and left him in a life-threatening condition as paramedics rushed to the scene.\nSix people - including children leaving school - witnessed the violent attack.\nGarrett fled the scene and returned home, where he was arrested shortly after."}, {"id": "13424713-d5ca-45cb-a8d8-41137f35f7e8", "title": "Four hostages rescued from Gaza in largest recovery since Oct . 7", "date": "2024-06-08 13:45", "url": "https://www.theglobeandmail.com/world/article-israeli-forces-rescue-four-live-hostages-from-gaza-military-says/", "message": "Argamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nThe operation was “daring in nature, planned brilliantly, and executed in an extraordinary fashion,” Defense Minister Yoav Gallant said.\nIsraeli aircraft hummed overhead as the bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where spokesperson Khalil Degran told the Associated Press more than 100 wounded also arrived.\nIsrael is intensifying operations across central Gaza, where the hostages were rescued.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed."}, {"id": "a6ce7b8d-c090-44a6-931e-6624fbedd927", "title": "Gaza news : 55 dead in strikes , Israel rescues 4 Oct . 7 hostages", "date": "2024-06-08 13:00", "url": "https://www.ctvnews.ca/world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza-strikes-1.6918991", "message": "At least 94 dead Palestinians, including children, were brought to local hospitals, a health official said.\nThe operation was “daring in nature, planned brilliantly, and executed in an extraordinary fashion,\" Israeli Defence Minister Yoav Gallant said.\nIsraeli aircraft hummed overhead as the bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where spokesperson Khalil Degran told The Associated Press more than 100 wounded also arrived.\nPalestinians wounded in the Israeli bombardment of the Gaza Strip arrive at al-Aqsa Hospital in Deir al-Balah on June 8, 2024.\nPalestinians also face widespread hunger because fighting and Israeli restrictions have largely cut off the flow of aid."}, {"id": "d2e9dfd9-e8fd-4889-9c24-e0e8a004764a", "title": "Attacks in Russian - occupied Ukrainian regions leave 27 dead , Moscow - backed officials say", "date": "2024-06-08 11:00", "url": "https://www.mymotherlode.com/news/east-europe/3371849/attacks-in-russian-occupied-ukrainian-regions-leave-27-dead-moscow-backed-officials-say.html", "message": "KYIV, Ukraine (AP) — Russia-installed officials in the partially-occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in the Kherson region killed 22 and wounded 15 people, Moscow-appointed governor Vladimir Saldo said.\nRussian state news agency Tass cited Saldo as saying that Ukrainian forces first struck the town with a French-made guided bomb, then attacked again with a U.S.-supplied HIMARS missile.\n“Most of the city is under the control of the defense forces,” Nazar Voloshin, spokesman for the Khortytsia ground forces formation, said on Ukrainian state TV.\nAlso on Saturday, Ukrainian officials said there was an attempt on the life of the ex-mayor of Kupiansk, a city in Ukraine’s northeastern Kharkiv region, on Friday."}, {"id": "bbf04f9d-7605-4057-92b0-3da441989921", "title": "Attacks in Russian - occupied Ukrainian regions leave 27 dead , Moscow - backed officials say", "date": "2024-06-08 11:30", "url": "https://www.aspendailynews.com/associated_press/attacks-in-russian-occupied-ukrainian-regions-leave-27-dead-moscow-backed-officials-say/article_7084cbc8-06a1-5a2a-a7b3-81f526415041.html", "message": "Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk say Ukrainian attacks left 27 dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday"}, {"id": "b57f90f4-4b1e-4d1e-8766-52aaaa1c24c3", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza strikes", "date": "2024-06-08 12:45", "url": "https://www.ksat.com/news/world/2024/06/08/israel-rescues-4-hostages-kidnapped-in-a-hamas-led-attack-on-oct-7/", "message": "Israel says it has rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7.\nRecommended VideosArgamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages."}, {"id": "32ac97fc-0e89-48e6-a00b-9ccde99811e6", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza strikes - Boston News , Weather , Sports", "date": "2024-06-08 15:15", "url": "https://whdh.com/news/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza-strikes/", "message": "JERUSALEM (AP) — Israel said Saturday it rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7, in the largest such hostage recovery operation since the war with Hamas began in Gaza.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "1e8a1cd3-1997-4157-8cc3-5f57527aa08b", "title": "Israel bombs Gaza as minister poised to quit government", "date": "2024-06-08 10:15", "url": "https://www.channelnewsasia.com/world/israel-bombs-gaza-minister-poised-quit-government-4396501", "message": "\"DEFENCELESS\"The war, now in its ninth month, has brought widespread devastation to Gaza, with one in 20 people dead or wounded, according to the Hamas-run territory's health ministry.\nMilitants from Hamas and other Palestinian armed groups also took 251 hostages, 120 of whom remain in Gaza, including 41 the army says are dead.\nIsrael's retaliatory military offensive has killed at least 36,731 people in Gaza, also mostly civilians, according to the Hamas-run territory's health ministry.\nIsrael's Prime Minister Benjamin Netanyahu, who is due to address the US Congress next month, also faces pressure from within his right-wing government.\nThe office of war cabinet member Benny Gantz has announced a news conference for Saturday, the deadline he gave Netanyahu last month to approve a post-war plan for Gaza."}, {"id": "da662e13-8ec5-4ed5-aabe-6c31a760dee7", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 14:00", "url": "https://komonews.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Israel said Saturday it rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7, in the largest such hostage recovery operation since the war with Hamas began in Gaza.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "4b8d78b6-8719-4dd4-8d14-9b53b6554ccb", "title": "EU voting passes halfway mark with Slovakia , Italy joining in", "date": "2024-06-08 10:00", "url": "https://www.ktbs.com/news/national/eu-voting-passes-halfway-mark-with-slovakia-italy-joining-in/article_f3050da3-f01d-575a-9363-cce6a08c3c36.html", "message": "An email has been sent to with a link to confirm list signup."}, {"id": "e1d3cb18-0953-4d6a-be4b-75f424bc4fdd", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 17:15", "url": "https://www.wcti12.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "At least 94 dead Palestinians, including children, were brought to local hospitals, a health official said.\nIsraeli aircraft hummed overhead as the bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where spokesperson Khalil Degran told The Associated Press more than 100 wounded also arrived.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nIsrael is intensifying operations across central Gaza, where the hostages were rescued.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed."}, {"id": "2736eed8-0a78-48dd-af7e-5eeda8fd4ae3", "title": "Israel rescues 4 hostages kidnapped in a Hamas - led attack on Oct . 7 . ", "date": "2024-06-08 12:30", "url": "https://www.local10.com/news/world/2024/06/08/israel-rescues-4-hostages-kidnapped-in-a-hamas-led-attack-on-oct-7/", "message": "Argamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nNetanyahu in a statement vowed to continue the fighting until all hostages are freed.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages."}, {"id": "ac072f3b-6861-4053-accb-95732a12102f", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 16:45", "url": "https://katu.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "At least 94 dead Palestinians, including children, were brought to local hospitals, a health official said.\nIsraeli aircraft hummed overhead as the bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where spokesperson Khalil Degran told The Associated Press more than 100 wounded also arrived.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nIsrael is intensifying operations across central Gaza, where the hostages were rescued.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed."}, {"id": "ad4569a6-a265-4131-bf74-31b52c65e065", "title": "Haiti - FLASH : 6 men sentenced to pay $6 . 2M in damages to Martine Moïse and her son Joverlein", "date": "2024-06-08 14:15", "url": "https://www.haitilibre.com/en/news-42504-haiti-flash-6-men-sentenced-to-pay-$62m-in-damages-to-martine-moise-and-her-son-joverlein.html", "message": "Haiti - FLASH : 6 men sentenced to pay $6.2M in damages to Martine Moïse and her son Joverlein6 men found guilty in the case of the assassination of Haitian President Jovenel Moïse https://www.haitilibre.com/en/news-34162-haiti-flash-president-jovenel-moise-assassinated-by-mercenaries-official-updated-7am-+-video.html were ordered in the United States to pay damages for the death of President Moïse, to his widow and to his eldest son Joverlein Moïse for a total of $6.2 millions, according to the restitution order issued by Federal Judge José E. Martínez of Miami.\nIn the restitution agreement filed last week in Miami federal court, Judge Martinez did not identify the widow and eldest son by name in his final ruling.\nHowever, Paul Turner, Martine Moïse's lawyer claims that Victim 1 is his client; Others familiar with the matter say President Joverlein's eldest son, Moïse, is victim 2.\nOf this sum, Martine Moïse (who currently lives in South Florida) is to receive $5,305,387 while Joverlein Moïse will receive $865,396.\nThe judge's order does not specify why the defendants were ordered to compensate Joverlein Moïse who was not present in the house at the time of the assassination."}, {"id": "b5bfc130-718e-4596-bd09-6c4c9de2f633", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 16:30", "url": "https://wpde.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "At least 94 dead Palestinians, including children, were brought to local hospitals, a health official said.\nIsraeli aircraft hummed overhead as the bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where spokesperson Khalil Degran told The Associated Press more than 100 wounded also arrived.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nIsrael is intensifying operations across central Gaza, where the hostages were rescued.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed."}, {"id": "f12572f4-bebb-44a6-97f3-39328c4705cd", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 15:00", "url": "https://wset.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Israel said Saturday it rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7, in the largest such hostage recovery operation since the war with Hamas began in Gaza.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "e22036b1-741a-4205-9ee3-99bee021ee49", "title": "Israel - Gaza live updates : Dozens killed in IDF strike on UN school , agency says", "date": "2024-06-08 00:30", "url": "https://www.koka.am/syndicated-article/?id=1568164", "message": "ABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.\nIDF officials said the strike had targeted “significant Hamas terrorists” who were operating in a Hamas compound.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "3169b3eb-14c8-49ee-87fe-36d0ca673668", "title": "Danish PM  hit  by man in Copenhagen", "date": "2024-06-08 00:00", "url": "https://www.gjsentinel.com/news/national/danish-pm-hit-by-man-in-copenhagen/article_5a6b3885-2de4-5081-9543-4e8fead8f1dd.html", "message": "Friday NightSome clouds.\nA stray shower or thunderstorm is possible.\nSE winds at 10 to 20 mph, decreasing to 5 to 10 mph."}, {"id": "86041ba8-5cd9-4757-86d0-3f6ded338cc1", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 14:00", "url": "https://wlos.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Argamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed."}, {"id": "3cf1d196-3629-4fb4-b453-3e83b8d234b9", "title": "Wildfires in south Lebanon after Israeli bombardment", "date": "2024-06-08 16:30", "url": "https://gulfnews.com/world/mena/wildfires-in-south-lebanon-after-israeli-bombardment-1.1717860185232", "message": "Beirut: Israeli strikes Saturday on southern Lebanon sparked massive wildfires, state media and a first responder said, the latest fallout from escalating cross-border violence involving Iran-backed armed group Hezbollah.\nHezbollah, a Hamas ally, has traded near-daily fire with Israeli forces in the eight months since the Gaza war began, triggered by the Palestinian militant group's October 7 attack.\nThe deadly clashes have intensified in recent weeks, causing multiple brush fires on both sides of the Israel-Lebanon border.\nIt is located near the UN-demarcated Blue Line between Lebanon and Israel.\nThe border violence, which began on October 8, has killed 456 people in Lebanon, mostly fighters but including about 90 civilians, according to an AFP tally."}, {"id": "8291055e-9429-425e-a667-be96ba36e368", "title": "Danish Prime Minister cancels campaign events after being assaulted by man in Copenhagen", "date": "2024-06-08 19:00", "url": "https://www.euronews.com/my-europe/2024/06/08/danish-prime-minister-cancels-campaign-events-after-being-assaulted-by-man-in-copenhagen", "message": "By Euronews with AP & EBUDanish Prime Minister Frederiksen cancelled campaign events on the eve of European elections.\nADVERTISEMENTThe Danish Prime Minister cancelled campaign events on the eve of voting in her country after she was assaulted by a man in downtown CopenhagenFollowing the attack, Prime Minister Mette Frederiksen was rushed to a hospital but was unharmed.\nLocal media report that a 39-year-old man walked up to her and pushed her hard.\nThe recent violence arose in the runup to elections taking place this weekend for the European Parliament.\nThe most serious attack so far was the attempted assassination of Slovakian Prime Minister Robert Fico – who struggled for his life after shots were fired at him while he met with supporters."}, {"id": "bae857ea-94f2-410c-9ac7-fd928cb1a9af", "title": "Israel rescues 4 hostages – NBC10 Philadelphia", "date": "2024-06-08 13:00", "url": "https://www.nbcphiladelphia.com/news/national-international/israel-rescues-4-hostages-kidnapped-in-october-hamas-attack/3880479/", "message": "At least 94 dead Palestinians, including children, were brought to local hospitals, a health official said.\nArgamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nIsraeli aircraft hummed overhead as the bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where spokesperson Khalil Degran told The Associated Press more than 100 wounded also arrived.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed."}, {"id": "4338f2bc-2dac-4364-bc49-84686f05f16a", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 17:15", "url": "https://13wham.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Argamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nThe latest rescue lifted some spirits in Israel as divisions deepen over the best way to bring hostages home.\nNetanyahu, whose support has fallen, rushed to the hospital to greet the freed hostages.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed."}, {"id": "c3b1e81a-386f-47da-8211-bb1b7013b12f", "title": "Israel rescues 4 hostages – NBC 6 South Florida", "date": "2024-06-08 12:30", "url": "https://www.nbcmiami.com/news/national-international/israel-rescues-4-hostages-kidnapped-in-october-hamas-attack/3332097/", "message": "At least 94 dead Palestinians, including children, were brought to local hospitals, a health official said.\nArgamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nIsraeli aircraft hummed overhead as the bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where spokesperson Khalil Degran told The Associated Press more than 100 wounded also arrived.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed."}, {"id": "2f00a72f-3ee4-4a36-a590-bf547d8779d9", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza strikes", "date": "2024-06-08 13:15", "url": "https://www.newsday.com/news/nation/israel-palestinians-hamas-war-news-8-6-2024-d23625", "message": "Argamani had been one of the most widely recognized hostages after being taken, like the three others, from a music festival.\nIsrael says it has rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7.\nIsrael says it has rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed."}, {"id": "e7d18999-fe3c-45ed-b6f0-2eef1ec1d510", "title": "Store explosion injures 15 in Romania | Northwest Arkansas Democrat - Gazette", "date": "2024-06-08 10:00", "url": "https://www.nwaonline.com/news/2024/jun/08/store-explosion-injures-15-in-romania/", "message": "Store explosion injures 15 in RomaniaBUCHAREST, Romania -- An explosion at a chain home improvement store in northeastern Romania on Friday injured at least 15 people, four of them seriously, authorities said.\n(Romanian Emergency Services - ISU Botosani via AP)In this photo released by Romanian Emergency Services (ISU Botosani), firefighters work at the scene of an explosion at a chain DIY store in Botosani, Romania, Friday, June 7, 2024.\nAn explosion at a chain DIY store in northwest Romania on Friday injured at least 13 people, one seriously, but caused no fatalities, authorities said.\n( Romanian Emergency Services - ISU Botosani via AP)In this photo released by Romanian Emergency Services (ISU Botosani), firefighters work at the scene of an explosion at a chain DIY store in Botosani, Romania, Friday, June 7, 2024.\nAn explosion at a chain DIY store in northwest Romania on Friday injured at least 13 people, one seriously, but caused no fatalities, authorities said."}, {"id": "b27abc0f-db59-4e70-a310-7724478ed6db", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 17:00", "url": "https://wwmt.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "At least 94 dead Palestinians, including children, were brought to local hospitals, a health official said.\nIsraeli aircraft hummed overhead as the bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where spokesperson Khalil Degran told The Associated Press more than 100 wounded also arrived.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nIsrael is intensifying operations across central Gaza, where the hostages were rescued.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed."}, {"id": "dc6ea68e-c126-4267-bf72-6b793d36c53c", "title": "Bomb Near KP CM Farmhouse And Attack On PTI Leader", "date": "2024-06-08 16:00", "url": "https://menafn.com/1108310460/Bomb-Near-KP-CMs-Farmhouse-And-Attack-On-PTI-Leader", "message": "The blast occurred close to the of DSP Kalachi and SHO Hathala.\nThe explosion targeted the elite force team led by DSP Kalachi, who were on their way for a search operation.\nIn a separate incident, Tehreek-e-Insaf leader Ali Zaman Advocate was assaulted by unknown assailants near Eidgah Colony in Peshawar last night.\nAccording to the hospital administration, Ali Zaman was attacked with a sharp instrument, but his condition is now stable.\nIt should be noted that Ali Zaman Advocate had contested the election from PK-73 on a PTI ticket."}, {"id": "6ebda8b9-d193-4a04-a7f1-75cd1ff2ab1f", "title": "Day After UN School Attack , IDF Brags About Striking Another Refugee Camp School", "date": "2024-06-08 00:00", "url": "https://truthout.org/articles/day-after-un-school-attack-idf-brags-about-striking-another-refugee-camp-school/", "message": "Israeli forces carried out the strike on the Al-Shati UN school just after killing at least 40 in an attack on Nuseirat.\nIsrael Defense Forces (IDF) bombed a UN school-turned-evacuation center in Al-Shati refugee camp, near Gaza City, as they carried out an intense series of bombardments on Friday.\nThis is the second time that Israel has struck a UN Relief and Works Agency for Palestine Refugees (UNRWA) school over the course of 48 hours.\nOn Thursday, Israeli forces deployed U.S.-made bombs in an attack that killed at least 40 Palestinians, including 14 children, in Nuseirat refugee camp.\nThe Nuseirat attack sparked widespread outrage, with humanitarian groups quickly denouncing it as a potential war crime."}, {"id": "afe7dc9c-52a4-4dab-b665-43f6306a1f3a", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 14:45", "url": "https://www.wcyb.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Israel said Saturday it rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7, in the largest such hostage recovery operation since the war with Hamas began in Gaza.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "2ed173e3-124d-428c-a2ea-d3cd46d90aae", "title": "Danish PM  hit  by man in Copenhagen", "date": "2024-06-08 12:30", "url": "http://thepeninsulaqatar.com/article/08/06/2024/danish-pm-hit-by-man-in-copenhagen", "message": "(Files) Denmark's Prime Minister Mette Frederiksen addresses the 7th annual Copenhagen Democracy Summit in Copenhagen on May 14, 2024.\n(Photo by Ida Marie Odgaard / Ritzau Scanpix / AFP)AFPCopenhagen: Danish Prime Minister Mette Frederiksen was \"hit\" on Friday by a man in a Copenhagen square, her office said, with EU chiefs quickly condemning the attack.\nThe Danish prime minister's office said in a statement to AFP that Frederiksen was \"shocked by the incident\", but did not provide further details.\n\"Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet in Copenhagen.\nCopenhagen police confirmed that an incident involving the prime minister had occurred but did not provide further details."}, {"id": "4ef87caf-1d2d-4c55-821a-2f4638795378", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 16:15", "url": "https://turnto10.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Israel said Saturday it rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7, in the largest such hostage recovery operation since the war with Hamas began in Gaza.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "8a1ed290-96e2-4d6d-b292-d713a9fe7fd1", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 15:00", "url": "https://wsbt.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Israel said Saturday it rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7, in the largest such hostage recovery operation since the war with Hamas began in Gaza.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "fae09440-d5cc-4075-a759-a4013c47f04b", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 16:30", "url": "https://ktul.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "At least 94 dead Palestinians, including children, were brought to local hospitals, a health official said.\nIsraeli aircraft hummed overhead as the bodies of nearly 100 Palestinians killed were taken to Al-Aqsa Hospital, where spokesperson Khalil Degran told The Associated Press more than 100 wounded also arrived.\nHamas took some 250 hostages during the Oct. 7 attack that killed about 1,200 people.\nIsrael is intensifying operations across central Gaza, where the hostages were rescued.\nIsrael said some 30 militants were inside and on Friday released the names of 17 it said were killed."}, {"id": "2c3e072d-d094-402e-901e-de256efe60fb", "title": "Ukraine air defense downs 9 Russian drones", "date": "2024-06-08 10:30", "url": "https://www.voanews.com/a/ukraine-air-defense-downs-9-russian-drones/7647955.html", "message": "Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk said Ukrainian attacks left at least 28 people dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday.\nA Ukrainian attack Friday on the small town of Sadove in Ukraine’s partially occupied Kherson region killed 22 and wounded 15 people, Moscow-backed governor Vladimir Saldo said.\nTwenty-five drones were reportedly destroyed over Russia’s southern Kuban and Astrakhan regions, the western Tula region, and the Moscow-annexed Crimean Peninsula.\nRussia’s Ministry of Defense said that one drone had been destroyed, whereas regional Governor Sergei Menyailo reported three downed drones over the region.\nDnipropetrovsk regional Governor Serhiy Lysak said the overnight drone attack damaged commercial and residential buildings."}, {"id": "a6626e9e-0c83-4f6b-9b48-0b061b9db73b", "title": "While out on bail in BB gun shooting case , man charged with stabbing sex worker in Oakland over $60 dispute", "date": "2024-06-08 00:30", "url": "https://www.eastbaytimes.com/2024/06/07/while-out-on-bail-in-bb-gun-shooting-case-man-charged-with-stabbing-sex-worker-in-oakland-over-60-dispute/", "message": "OAKLAND — A man has been charged with stabbing a woman after allegedly offering her $60 for sex and trying to take it back, court records show.\nThe woman was stabbed in the abdomen on International Boulevard in Oakland on April 9, and required surgery, police say.\nRoughly two weeks earlier, the man had posted $30,000 bail to secure his release from Santa Rita Jail on charges of assault with a BB gun.\nThe BB gun shooting occurred at Monarch Bay Golf Course in San Leandro, according to court records.\nAs a result, his bail was revoked and a no-bail arrest warrant was issued, records show."}, {"id": "24050d25-d364-4b8e-a7cd-4431f6fc74e5", "title": "Danish PM  hit  by man in Copenhagen", "date": "2024-06-08 07:45", "url": "https://www.bssnews.net/news-flash/193929", "message": "COPENHAGEN, June 8, 2024 (BSS/AFP) - Danish Prime Minister Mette Frederiksen was \"hit\" on Friday by a man in a Copenhagen square, her office said, with EU chiefs quickly condemning the attack.\nThe Danish prime minister's office said in a statement to AFP that Frederiksen was \"shocked by the incident\", but did not provide further details.\n\"Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet in Copenhagen.\nCopenhagen police confirmed that an incident involving the prime minister had occurred but did not provide further details.\nIn 2019, Frederiksen became the country's youngest prime minister, and kept the post after emerging victorious in the 2022 general election."}, {"id": "be385d9f-cebb-45af-a441-dc3b6d3b8dff", "title": "Attacks in Russian - occupied Ukrainian regions leave 28 dead , Moscow - backed officials say", "date": "2024-06-08 12:00", "url": "https://santamariatimes.com/news/world/attacks-in-russian-occupied-ukrainian-regions-leave-28-dead-moscow-backed-officials-say/article_9c0ee6bf-b7b1-5f95-b453-d41c80c232e1.html", "message": "Russia-installed officials in the partially occupied Ukrainian regions of Kherson and Luhansk say Ukrainian attacks left 28 dead as Russia and Ukraine continued to exchange drone attacks overnight into Saturday"}, {"id": "f246d87d-5ef1-4473-81a7-3d844e250546", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 15:15", "url": "https://news3lv.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Israel said Saturday it rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7, in the largest such hostage recovery operation since the war with Hamas began in Gaza.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "a2fde08d-36c6-4868-a97c-e0faaadcfc24", "title": "How I Met Your Mother actor caught fleeing country after stabbing girlfriend 20 times", "date": "2024-06-08 16:15", "url": "https://www.dailystar.co.uk/showbiz/how-met-your-mother-actor-32989376", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the best celeb gossip with the Daily Star Showbiz newsletterSomething went wrong, please try again later.\nGet the best celeb gossip with the Daily Star Showbiz newsletterHow I Met Your Mother actor Nick Pasqual, 34, is reportedly in a remote Texas jail after allegedly stabbing his ex-girlfriend Allie Shehorn, 35, more than 20 times and attempting to flee to Mexico.\nSign up for our free Daily Star Showbiz newsletter."}, {"id": "bea4db78-2dc6-4e0a-a7b0-50882dd3284d", "title": "Israel - Hamas War Day 246 : What happening in Gaza , Middle East ? ", "date": "2024-06-08 03:30", "url": "https://www.jpost.com/israel-hamas-war/2024-06-08/live-updates-805413", "message": "breaking news (photo credit: JPOST STAFF)IDF soldiers identified a Hezbollah operative in the area of Aitaroun in southern Lebanon, the IDF reported on Saturday afternoon.\nShortly thereafter, an IAF aircraft struck the terrorist.\nAdditionally, IDF fighter jets targeted terrorist infrastructure in the area of Khiam.\nAdditionally, earlier on Saturday, IDF tanks fired toward a Hezbollah military structure in the area of Kfarkela.\nOver the past day, IDF artillery and mortars struck to remove threats in the areas of Kfarchouba, Kfarkela, Houla and Kfarhamam, the military added."}, {"id": "b6c4b431-7542-4355-aeb8-ff19ecc529ea", "title": "Israel rescues 4 hostages kidnapped in a Hamas attack on Oct . 7 . At least 55 dead in Gaza", "date": "2024-06-08 13:15", "url": "https://fox11online.com/news/nation-world/israel-rescues-4-hostages-kidnapped-in-a-hamas-attack-on-oct-7-at-least-55-dead-in-gaza", "message": "Israel said Saturday it rescued four hostages who were kidnapped in a Hamas-led attack on Oct. 7, in the largest such hostage recovery operation since the war with Hamas began in Gaza.\nArgamani, has been one of the most widely recognized hostages since she was abducted from a music festival in southern Israel.\nHamas killed about 1,200 people and kidnapped some 250 hostages during the Oct. 7 attack, which triggered the Israel-Hamas war.\nIsraeli troops have so far recovered at least 16 bodies of hostages from Gaza, according to the government.\nThe rescue comes as Israel is intensifying operations across central Gaza, where the hostages were rescued."}, {"id": "43f6220a-d2d9-4729-bbcf-7b814688fb8c", "title": "Slovakia set for EU vote after PM shooting , Meloni Italy next", "date": "2024-06-08 07:45", "url": "https://www.bssnews.net/news/193941", "message": "Far-right Prime Minister Giorgia Meloni is hoping astrong showing from her party will strengthen her hand as a key EUpowerbroker.\nThe party opposes EU arms deliveries to Ukraine, calling itself a \"party ofpeace\" and railing against alleged \"warmongers\" in Brussels.\nPolls suggest Meloni's Fratelli d'Italia party looks set to claim 27 percentof the vote, equalling 22 seats, amid a broader surge of far-right groupsacross the EU.\nThe outsized influence of Meloni's party is all the more striking given thatduring the last EU polls in 2019 it won just 6.4 percent of the vote and sixseats.\nOverall, polls ahead of the vote suggested that far-right parties could claimaround a quarter of the 720 seats in the incoming EU parliament."}, {"id": "ef14467e-5e39-42b6-a129-f71fe439c00e", "title": "Israeli forces rescue four live hostages who were kidnapped from music festival and taken to Gaza", "date": "2024-06-08 14:00", "url": "https://www.irishtimes.com/world/middle-east/2024/06/08/israel-hamas-latest/", "message": "The Israeli military named the rescued hostages as Noa Argamani (25), Almog Meir Jan (21), Andrey Kozlov (27), and Shlomi Ziv (40).\nAlmog Meir Jan (21), Andrey Kozlov (27), Noa Argamani (25) and Shlomi Ziv (40) were rescued by Israeli forces.\nGaza’s health ministry meanwhile reported on Saturday that Israeli military assaults in al-Nuseirat had killed and wounded dozens of people including women and children.\nA billboard depicting from left: Noa Argamani, Shlomi Ziv, Almog Meir Jan and Andrey Kozlov, the four Israeli hostages rescued by the Israeli army.\nThe Israeli military has published the identity of what it said were 17 fighters concealed in the compound who it killed in Thursday's strike."}, {"id": "dda07a1e-2782-483c-af82-5ab67ccc4603", "title": "OIC condemns Israeli targeting of UNRWA school in Gaza", "date": "2024-06-08 12:30", "url": "https://www.gulf-times.com/article/684379/region/oic-condemns-israeli-targeting-of-unrwa-school-in-gaza", "message": "The Organization of Islamic Cooperation (OIC) has condemned in the strongest terms the Israeli bombing of a United Nations Relief and Works Agency for Palestine Refugees (UNRWA) school in Gaza, which was sheltering displaced persons.\nThe attack resulted in the martyrdom of over 40 Palestinians and injured numerous civilians, most of whom were women and children.In a statement issued Saturday, the OIC considered the Israeli bombing of the school as an extension of the ongoing genocide in Gaza and a blatant violation of international humanitarian law, the Geneva Conventions, relevant United Nations resolutions, and orders from the International Court of Justice.The OIC viewed the United Nations' decision to include Israel, the occupying power, on the list of violators of children's rights in armed conflicts, known as the \"list of shame,\" as an important step towards supporting the rule of international law and ending the culture of impunity concerning Israeli war crimes, thereby ensuring justice for Palestinian victims.The organization called on the international community, particularly the United Nations Security Council, to fulfill its responsibilities by working to end the continuous Israeli aggression against the Palestinian people and taking serious measures to ensure the accountability of those who commit war crimes and genocide against Palestinians, ultimately achieving international justice."}, {"id": "db08eb2c-435f-44ce-aae0-74500d3044a0", "title": "Putin Invokes  Cuban Missile Crisi With Ships to Caribbean", "date": "2024-06-08 18:00", "url": "https://www.newsmax.com/globaltalk/putin-russia-cuba/2024/06/08/id/1167962/", "message": "Russian President Vladimir Putin is aiming to \"invoke the historical memory of the Cuban Missile Crisis\" by moving nuclear capable war ships into the waters of the Caribbean, according to an assessment published Thursday by a U.S. think tank.\nEarlier in the week it was revealed that Moscow would be sending several Russian ships and support vessels into the Caribbean for a military exercise.\nHaving Russian ships so close to the United States during a time of heightened global tension has observers drawing parallels to the Cuban missile crisis.\nThe U.S. responded by establishing a naval \"quarantine\" to isolate Cuba and prevent Soviet ships from entering the waters around Cuba.\nPutin's actions to move ships from his Northern Fleet have raised eyebrows as to his long-term international strategy."}, {"id": "0c13cfd6-9473-481d-94af-1675b9129491", "title": "Danish PM  hit  by man in Copenhagen", "date": "2024-06-08 00:45", "url": "https://www.channelnewsasia.com/world/danish-prime-minister-mette-frederiksen-attacked-man-copenhagen-4395761", "message": "They added that while it was a \"strong push\", Frederiksen did not hit the ground.\n\"CONFUSED\"According to the witnesses, the prime minister then sat down at a nearby cafe.\n\"They had pacified him, and as he lay there, he looked confused and a little dazed,\" Jorgensen told the newspaper.\nMetsola urged the Danish head of government to \"keep strong\", while adding in a post on X that \"violence has no place in politics\".\n\"I strongly condemn this cowardly act of aggression,\" the European Council president said in a separate post on X."}, {"id": "34a829a5-702c-424f-971b-55346d51a6c1", "title": "Woman rescued from rubble near Poltava dies in hospital", "date": "2024-06-08 13:45", "url": "https://www.yahoo.com/news/woman-rescued-rubble-near-poltava-092512084.html", "message": "Woman rescued from rubble near Poltava dies in hospitalAttack on Poltava Oblast on 7 June.\nPhoto: Oblast Military AdministrationA woman rescued from the rubble in Poltava district on 7 June has died in hospital.\nSource: Filip Pronin, Head of Poltava Oblast Military Administration, on TelegramQuote from Pronin: \"Unfortunately, the woman who was rescued from the rubble yesterday has died.\nDoctors fought to save her life until the last minute.\"\nBackground: On 7 June, the Russian army launched a missile attack on a residential building in Poltava Oblast, and a woman was rescued from the rubble."}, {"id": "9a11ea0f-9987-431d-ba04-d08619315095", "title": "Permission to win : Ukraine needs more from Biden than weapons to defeat Russia , according to experts", "date": "2024-06-08 11:00", "url": "https://abcnews.go.com/Politics/permission-win-ukraine-biden-weapons-defeat-russia-experts/story?id=110924679", "message": "Permission to win: Ukraine needs more from Biden than weapons to defeat Russia, according to expertsSoon after President Joe Biden announced a new $225 million package of desperately-needed weapons and ammunition for Ukraine during an in-person meeting with President Volodymyr Zelenskyy in Paris Friday, he told Biden that to thwart the Russian invasion, Ukraine must be allowed to use the weapons to strike at its source: Inside Russia itself.\nAs opposed to ethics, law or sound military strategy, the restrictive American policy for Ukraine is based on fear, according to Hodges and other experts on the region.\nThe M57A1 Army Tactical Missile System missile is fired over the cab of an M142 High Mobility Artillery Rocket System launcher.\n\"We haven't even tried to actually help Ukraine win yet,\" Hodges said.\n\"If you want to keep NATO out of a fight with Russia, then then we need to help Ukraine defeat Russia,\" Hodges said."}, {"id": "aab869c7-3398-427f-8933-9246b90a027e", "title": "Permission to win : Ukraine needs more from Biden than weapons to defeat Russia", "date": "2024-06-08 16:30", "url": "https://abc11.com/permission-to-win-ukraine-needs-more-from-biden-than-weapons-to-de/14925124/", "message": "Permission to win: Ukraine needs more from Biden than weapons to defeat RussiaSoon after President Joe Biden announced a new $225 million package of desperately-needed weapons and ammunition for Ukraine during an in-person meeting with President Volodymyr Zelenskyy in Paris Friday, he told Biden that to thwart the Russian invasion, Ukraine must be allowed to use the weapons to strike at its source: Inside Russia itself.\nZelenskyy has been vocal about the importance of using long-range Western weapons, like the U.S.-provided Army Tactical Missile System (ATACMS), against military targets in Russia.\nBiden and his cabinet members at the Pentagon and State Department have repeatedly vowed to assist Ukraine for \"as long as it takes.\"\n\"We haven't even tried to actually help Ukraine win yet,\" Hodges said.\n\"If you want to keep NATO out of a fight with Russia, then then we need to help Ukraine defeat Russia,\" Hodges said."}, {"id": "2db7c87d-c228-4eda-880f-d2695dae4474", "title": "The Country with the Strongest Army in the World", "date": "2024-06-08 16:30", "url": "https://www.insidermonkey.com/blog/the-country-with-the-strongest-army-in-the-world-1311481/", "message": "In this article, we look at the country with the strongest army in the world.\nThis was the ninth successive year during which global military spending had risen, and the steepest rise in expenditure since 2009.\nEurope spent $588 billion on defense, which was equivalent to one-fourths, or 24%, or the world’s defense spending.\nThe country with the strongest army in the world is the United States!\nIt is the third most technologically advanced country in the world, which reflects in its massive defense industry at home."}, {"id": "d62228a0-79ff-4c4c-88a8-ddd6e9559984", "title": "Permission to win : Ukraine needs more from Biden than weapons to defeat Russia", "date": "2024-06-08 17:15", "url": "https://abc13.com/permission-to-win-ukraine-needs-more-from-biden-than-weapons-to-de/14925124/", "message": "Permission to win: Ukraine needs more from Biden than weapons to defeat RussiaSoon after President Joe Biden announced a new $225 million package of desperately-needed weapons and ammunition for Ukraine during an in-person meeting with President Volodymyr Zelenskyy in Paris Friday, he told Biden that to thwart the Russian invasion, Ukraine must be allowed to use the weapons to strike at its source: Inside Russia itself.\nZelenskyy has been vocal about the importance of using long-range Western weapons, like the U.S.-provided Army Tactical Missile System (ATACMS), against military targets in Russia.\nBiden and his cabinet members at the Pentagon and State Department have repeatedly vowed to assist Ukraine for \"as long as it takes.\"\n\"We haven't even tried to actually help Ukraine win yet,\" Hodges said.\n\"If you want to keep NATO out of a fight with Russia, then then we need to help Ukraine defeat Russia,\" Hodges said."}, {"id": "3d86cde6-5a6d-4bbb-b9b3-462d5d062705", "title": "Permission to win : Ukraine needs more from Biden than weapons to defeat Russia", "date": "2024-06-08 15:00", "url": "https://abc7chicago.com/permission-to-win-ukraine-needs-more-from-biden-than-weapons-to-de/14925124/", "message": "Permission to win: Ukraine needs more from Biden than weapons to defeat RussiaSoon after President Joe Biden announced a new $225 million package of desperately-needed weapons and ammunition for Ukraine during an in-person meeting with President Volodymyr Zelenskyy in Paris Friday, he told Biden that to thwart the Russian invasion, Ukraine must be allowed to use the weapons to strike at its source: Inside Russia itself.\nZelenskyy has been vocal about the importance of using long-range Western weapons, like the U.S.-provided Army Tactical Missile System (ATACMS), against military targets in Russia.\nBiden and his cabinet members at the Pentagon and State Department have repeatedly vowed to assist Ukraine for \"as long as it takes.\"\n\"We haven't even tried to actually help Ukraine win yet,\" Hodges said.\n\"If you want to keep NATO out of a fight with Russia, then then we need to help Ukraine defeat Russia,\" Hodges said."}, {"id": "f217d400-95b5-431e-818a-54b3f66e98fb", "title": "How one party is winning perception warfare", "date": "2024-06-08 01:45", "url": "https://www.thenews.com.pk/print/1198161-how-one-party-is-winning-perception-warfare", "message": "Alas, perception warfare, aimed at influencing how people view an issue or event, is not what it used to be.\nNew school perception warfare tools: YouTube, launched in 2005, has 72 million users in Pakistan.\nTikTok, launched in 2016, has 18 million users, while Instagram, launched in 2010, has 16 million users.\nThere is only one political party in Pakistan that has successfully weaponized social media to spread manipulated information and narratives as part of its perception warfare strategy.\nThere is only one political party whose disinformation campaigns are successfully exploiting people’s emotions, such as fear, anger, or outrage."}, {"id": "c514b818-4647-41e2-9626-021d41b9a462", "title": "  We need both communities , and we need them now more than ever . ", "date": "2024-06-08 03:30", "url": "https://www.jpost.com/diaspora/antisemitism/article-805237", "message": "We need both communities, and we need them now more than ever.”Elbaum detailed the rise in aliyah, noting that 85,000 Jews from Russia and Ukraine made aliyah to Israel through The Jewish Agency since the start of the Russia-Ukraine war.\nBrummer described the numerous ways in which the Ministry of Diaspora Affairs assists the Jewish community outside Israel.\nHe noted that the fight against antisemitism is about the resilience and strength of Jewish communities and education, and mentioned the importance of the online struggle against antisemitism.\nIn order to win, we need much more coordination and cooperation between all entities and organizations that deal with this sacred mission of combating antisemitism.\nHe praised the work of the Agency’s shlichim – young Israeli emissaries spending time educating and teaching young Jews in the Diaspora."}, {"id": "210cb36e-9ed6-4f18-82a5-5c23979eaa78", "title": "IMA POP : Be prepared to meet challenges of modern warfare : Lt Gen Kumar asks IMA cadets", "date": "2024-06-08 10:15", "url": "https://economictimes.indiatimes.com/news/defence/be-prepared-to-meet-challenges-of-modern-warfare-lt-gen-kumar-asks-ima-cadets/articleshow/110818312.cms", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelGeneral Officer Commanding-in-Chief Northern Command, Lt Gen MV Suchindra Kumar, on Saturday said the nature and dynamics of modern warfare is changing constantly and asked the gentlemen cadets passing out of the prestigious Indian Military Academy here to be prepared to meet these challenges .\nAddressing the Passing out Parade of the IMA at the historic drill square as the reviewing officer, Lt Gen Kumar said technological advancement is constantly impacting the character of modern wars.\n\"The dynamics of combat is changing continuously with the increasing use of space cyber and information warfare .\nToday's wars are wars of ideas, intellect and innovation.\nYou have to be prepared to be in the forefront to meet these challenges,\" he said.Lt Gen Kumar said the use of space, cyber and cognitive domains in warfare are contemporary realities.Information warfare, drones, autonomous systems, cyber, exploitation of EM spectrum and man-machine teaming, comprise the new normal, he added."}, {"id": "b1979f58-d475-402e-b6c4-9d620b85b9d6", "title": "Xbox Game Pass adds The Callisto Protocol , Octopath Traveler 2 , more", "date": "2024-06-08 18:00", "url": "https://nichegamer.com/xbox-game-pass-adds-the-callisto-protocol/", "message": "Microsoft has announced the next batch of games heading to Xbox Game Pass, their paid subscription service on multiple platforms.\nHere’s a rundown on the games coming to and leaving Xbox Game Pass:Available Today on Xbox Game PassOctopath Traveler (Cloud, Console, and PC)Making a return to the Game Pass library today!\nComing Soon to Xbox Game PassDepersonalization (PC) – June 12A tabletop role-playing game inspired by Call of Cthulhu with rich branching narratives.\nGet Minecraft, Minecraft Dungeons, Minecraft Legends, and more for up to 50% off through June 22.\nLeaving Xbox Game Pass on June 15The following games are leaving the Game Pass library soon."}, {"id": "c9dcc388-5e58-4884-a39c-af736d1effc0", "title": "5 Military Tanks That Are Way Bigger Than You Thought", "date": "2024-06-08 16:30", "url": "https://www.slashgear.com/1592112/military-tanks-that-are-bigger-than-you-thought/", "message": "5 Military Tanks That Are Way Bigger Than You ThoughtWhen conjuring military tanks, images of powerful, armored vehicles come to mind — machines designed to withstand the harshest combat conditions and deliver formidable firepower.\nThat said, you still might not realize just how enormous some of these tanks truly are.\nModern tanks need thick, layered armor to protect against a variety of threats, from anti-tank missiles to improvised explosive devices — which, of course, means significant weight and bulk.\nAll that technology and firepower, but are tanks useless in the modern age?\nIn the meantime, let's take a look at how big some popular tanks really are."}, {"id": "cb736399-26c6-4952-8c4d-18724e92be03", "title": "Air Weapons : Game of Drones", "date": "2024-06-08 07:30", "url": "http://www.strategypage.com/%5Chtmw%5Chtairw%5Carticles%5C202406070253.aspx", "message": "Female soldiers can excel as UAV operators while mostly avoiding the battlefield risk of death or injury.\nUnlike pilots of combat aircraft, UAV operators are much less likely to be put out of action by death, injury, or capture.\nUAV operators are relatively close to the front lines and exposed to some risk, but not nearly as much as pilots.\nUkrainian USV operations in the Black Sea forced the Russian Black Sea Fleet to withdraw to the eastern shore of the Black Sea.\nBecause of the USVs, Ukraine, which does not have a conventional navy, now controls most of the Black Sea."}, {"id": "189da535-a034-4624-b6d0-48d145287303", "title": "Joe Plenzler Archives", "date": "2024-06-08 10:15", "url": "https://taskandpurpose.com/author/joe-plenzler/", "message": "Joe Plenzler is a communication consultant, leadership coach, and backcountry expert.\nWhen heâ€™s not running his company, he is often found climbing mountains or hiking the Appalachian Trail.\nDuring that time he attended the Marine Corpsâ€™ Mountain Warfare and Jungle Warfare Schools and the NATO Allied Officer Winter Warfare Course in Norway.\nIn 2016, he began section hiking the Appalachian Trail with his partner-in-crime, Kate and has completed more than 700 miles.\nHeâ€™s also completed a winter ascent of Longâ€™s Peak (14,259â€™), and summited Mount Rainier (14,410â€™), the Grand Teton (13,775â€™), and Mt."}, {"id": "8c08a880-e59e-4006-bae3-59ed2eec9a72", "title": "REVIEW : Pete Hegseth  War On Warrior , The Cultural Rot Infecting Our Military", "date": "2024-06-08 16:00", "url": "https://redstate.com/jimthompson/2024/06/08/book-review-pete-hegseths-war-on-warriors-the-cultural-rot-infecting-our-military-n2175158", "message": "Author Pete Hegseth has released his fourth book, titled The War on Warriors: Behind the Betrayal of the Men Who Keep Us Free.\nHegseth pulls no punches in his examination of the cultural rot infesting the military.\nWest Point no longer employs mostly uniformed officers to teach at West Point, and it shows.\npic.twitter.com/U06xtd1iLi — Joshua Walker (@RedsRepair95) May 21, 2024The graduating speaker for my son’s BUDs (SEAL) class was a hard-nosed battle-tested SEAL.\nHis son was in my son’s class."}, {"id": "a4839c31-27bb-4141-ad8a-b9b42fbc77cd", "title": "Russian attack drones account for 90 % of Ukrainian casualties around a key town in the last 6 months , medic says", "date": "2024-06-08 17:15", "url": "https://www.yahoo.com/news/russian-attack-drones-account-90-154536195.html", "message": "Russian attack drones account for 90% of Ukrainian casualties around a key town in the last 6 months, medic saysRussian attack drones account for 90% of Ukrainian casualties around a key town in the last 6 months, medic saysRussian FPV drones injured 90% of wounded soldiers near Chasiv Yar, said a Ukrainian medic.\nRussian attack drones have inflicted about 90% of war injuries suffered by Ukrainian soldiers around a key town in the past six months, according to a medic stationed on the eastern front.\nThe strategic city of Chasiv Yar has been the target of a Russian offensive since December.\nShe said that in other parts of the eastern front, Ukrainian soldiers were being overwhelmed with glide bombs.\nRussia stepped up its use of glide bombs in October when it launched its offensive against Avdiivka."}, {"id": "4550a516-afc4-4ae8-8868-d9bebd528cab", "title": "Russian attack drones account for 90 % of Ukrainian casualties around a key town in the last 6 months , medic says", "date": "2024-06-08 17:15", "url": "https://www.yahoo.com/news/russian-attack-drones-account-90-154536199.html", "message": "Russian attack drones account for 90% of Ukrainian casualties around a key town in the last 6 months, medic saysRussian attack drones account for 90% of Ukrainian casualties around a key town in the last 6 months, medic saysRussian FPV drones injured 90% of wounded soldiers near Chasiv Yar, said a Ukrainian medic.\nRussian attack drones have inflicted about 90% of war injuries suffered by Ukrainian soldiers around a key town in the past six months, according to a medic stationed on the eastern front.\nThe strategic city of Chasiv Yar has been the target of a Russian offensive since December.\nShe said that in other parts of the eastern front, Ukrainian soldiers were being overwhelmed with glide bombs.\nRussia stepped up its use of glide bombs in October when it launched its offensive against Avdiivka."}, {"id": "4b42e914-8f95-4bad-872a-bcc7ce484bef", "title": "Like the F - 16 , French Mirage 2000 - 5 fighters are good planes , but they arent the best Western jets for Ukraine", "date": "2024-06-08 13:45", "url": "https://www.yahoo.com/news/f-16-french-mirage-2000-121701910.html", "message": "Like the F-16, French Mirage 2000-5 fighters are good planes, but they aren't the best Western jets for UkraineFrance announced this week it would send Ukraine Mirage 2000-5 fighter jets.\nMacron's announcement comes as Ukraine eagerly awaits the seemingly imminent arrival of American-made F-16s, which will be Kyiv's first Western fighter jet.\nThe Mirage 2000-5, like its F-16 counterpart, is a good fourth-generation fighter jet that will bring some additional capabilities to Ukraine's fleet of aging Soviet-era warplanes.\nInvesting resources to get Ukraine another Western fighter that has an even shorter air-to-air reach won't necessarily improve this dilemma.\nA F-16 aircraft is pictured after the first delivery of Norway's old F-16 fighter aircraft to Romania at Rygge Air Force Base in Norway on Nov. 28, 2023."}, {"id": "bb826495-a7a5-4b1f-8383-15162ab450fa", "title": "Like the F - 16 , French Mirage 2000 - 5 fighters are good planes , but they arent the best Western jets for Ukraine", "date": "2024-06-08 13:15", "url": "https://www.yahoo.com/news/f-16-french-mirage-2000-121701163.html", "message": "Like the F-16, French Mirage 2000-5 fighters are good planes, but they aren't the best Western jets for UkraineFrance announced this week it would send Ukraine Mirage 2000-5 fighter jets.\nMacron's announcement comes as Ukraine eagerly awaits the seemingly imminent arrival of American-made F-16s, which will be Kyiv's first Western fighter jet.\nThe Mirage 2000-5, like its F-16 counterpart, is a good fourth-generation fighter jet that will bring some additional capabilities to Ukraine's fleet of aging Soviet-era warplanes.\nInvesting resources to get Ukraine another Western fighter that has an even shorter air-to-air reach won't necessarily improve this dilemma.\nA F-16 aircraft is pictured after the first delivery of Norway's old F-16 fighter aircraft to Romania at Rygge Air Force Base in Norway on Nov. 28, 2023."}, {"id": "2e79d721-3740-4063-b98a-c6ee6a5772d5", "title": "Tejas Mk1 / A : A Capable Contender in the Subcontinent Skies – Indian Defence Research Wing", "date": "2024-06-08 03:45", "url": "https://idrw.org/tejas-mk1-a-a-capable-contender-in-the-subcontinents-skies/", "message": "This article aims to shed light on the Tejas’ capabilities and their role in the Indian Air Force (IAF).\nThe narrative that the Tejas isn’t designed for specific opponents undermines its potential.\nThe Tejas Mk1/A, armed with advanced avionics, the Astra Mk1 missile, and a capable radar present a formidable challenge.\nWhile details remain undisclosed, it’s likely a combination of aircraft, including Mirage-2000s, and supporting assets like AWACS/AEW&C played a crucial role.\nThe Tejas Mk1/A is a capable platform that continues to evolve."}, {"id": "c3dbb5ef-74c7-448b-a995-07786b20170b", "title": "  US shadow : Taiwan new defence chief Wellington Koo sets out policy direction", "date": "2024-06-08 13:00", "url": "https://www.scmp.com/news/china/politics/article/3265814/us-shadow-taiwans-new-defence-chief-wellington-koo-sets-out-policy-direction", "message": "Taiwan’s new defence chief Wellington Koo has set out key aspects of his policy direction, including developing asymmetric warfare and seeking military financing and advice on force restructuring from the United States.\nHe would “not rule out using US military force” but made a distinction between deploying ground forces versus using air and naval power.\nOn Thursday, Koo said that instead of relying on others, the island must focus on strengthening its own defences.\nThe report emphasised the importance of better combat resilience, civilian defence mobilisation, strengthening reserve forces, promoting defence autonomy, and prioritising the well-being of soldiers.\nMax Lo, executive director of the Taiwan International Strategic Study Society, said the US appears to have had a significant influence on Koo’s policy direction."}, {"id": "745abf6f-70cf-42a3-b97c-5daec448f8ad", "title": "Biden Apologizes to Zelenskyy for Ukraine Aid Delay , While Russia Advanced", "date": "2024-06-08 17:00", "url": "https://www.businessinsider.com/biden-apologizes-to-zelenskyy-for-congressional-aid-delay-2024", "message": "President Joe Biden apologized to Ukrainian President Zelenskyy for Congress's delay in military aid.\nConservative Republicans' resistance caused the delay in the $61 billion aid package.\nRussian forces made battlefield gains while the military aid was held up.\nAdvertisementUS President Joe Biden publicly apologized to Ukrainian President Volodymyr Zelenskyy for the prolonged congressional delay in military aid while Russian forces made significant advances on the battlefield, the Associated Press reported.\n\"I apologize for those weeks of not knowing what's going to happen in terms of funding,\" Biden told Zelenskyy."}, {"id": "e2c2dd06-250d-4ab4-811f-635edceb0903", "title": "One Ukrainian brigade holds back three Russian brigades on Pokrovsk front", "date": "2024-06-08 10:00", "url": "https://www.yahoo.com/news/one-ukrainian-brigade-holds-back-063000261.html", "message": "The Ukrainian Ground Forces have reported that soldiers from the 47th Mechanised Brigade are holding back at least three Russian combat brigades on the Pokrovsk front.\nSource: Ukrainian Ground ForcesDetails: The Ukrainian Ground Forces noted that the Russians are not reducing the pace of their assault actions and the Pokrovsk front is the epicentre of the fighting.\nQuote: \"Here, the enemy is trying to advance into the depths of our territory.\nSoldiers of the 47th Mechanised Brigade are holding back at least three Russian combat brigades.\nWith huge reserves of manpower, the Russians quickly replenish their huge losses and throw [new soldiers] into battle again and again."}, {"id": "b12688ac-cc5d-4b19-b19a-1156e4b70c04", "title": "Five settings we would love to see Total War explore", "date": "2024-06-08 09:15", "url": "https://www.gamewatcher.com/news/five-settings-we-would-love-to-see-total-war-explore", "message": "About Fran J. RuizFran J. Ruiz is an English Studies survivor and a freelance writer for The Loadout, VG247, Space, The Escapist, and more.\nSpyro and Warcraft 3 are his all-timers.\nHe plays a bit of everything, from little-known indies to the biggest AAA releases, resulting in a backlog that never goes down."}, {"id": "16babc25-d640-4dcd-b087-a74c021dbc7b", "title": "Metaphor : ReFantazio has over 40 persona - like archetypes to evolve and combine , still looks a lot like Persona ( complimentary ) ", "date": "2024-06-08 00:15", "url": "https://www.rockpapershotgun.com/metaphor-refantazio-has-over-40-persona-like-archetypes-to-evolve-and-combine-still-looks-a-lot-like-persona-complimentary", "message": "It’s easy to draw comparisons between Metaphor: ReFantazio and Persona, given that the upcoming RPG is in the works over at Persona makers Atlus and is built around a similar ‘transform into an awesome-looking robot/creature and do battle’ concept, but so far all those comparisons only serve to highlight just how damn good Metaphor: ReFantazio looks.\nThe RPG’s latest trailer out of tonight’s Summer Game Fest stream adds to that feeling, focusing on the archetypes used by party members in battle.\nThere’ll be over 40 archetypes in total to bring along in your party, the game’s devs confirmed, with different archetypes able to earn experience and possible evolve into stronger forms.\nI’ll be happy to oblige when Metaphor: ReFantazio arrives on Steam on October 11th.\nHit up our Summer Game Fest 2024 hub and our Day Of The Devs roundup for all the news worth caring about from the shows so far."}, {"id": "053d08f4-1ff9-4dcb-9c2d-403b2c329061", "title": "Russo - Ukraine War - 07 June 2024", "date": "2024-06-08 00:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-07.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\nThroughout the day in the Sivers віkomu direction, Russian forces carried out two unsuccessful assault actions in the area of Bílogorivka.\nRussia does not give up trying to find the weak points in Ukrainian defense, with continuous assault attempts to infiltrate Ukrainian troops' combat.\nThe Defense Forces are taking measures to stabilize the situation and prevent Russian forces from advancing.\nIn the Vremívs завkomu direction, Russian forces tried to tie battles near Urožaynogo and Staromayors міkogo."}, {"id": "5f0c09ba-de9d-4091-943f-5384f27d8619", "title": "Ukraine Situation Report : Claims Fly Over Deadly ATACMS Missile Strike In Luhansk", "date": "2024-06-08 01:45", "url": "https://www.yahoo.com/news/ukraine-situation-report-claims-fly-003714888.html", "message": "Russia’s Defense Ministry on Friday accused Ukraine of using five ATACMS on residential buildings and other civilian structures in Luhansk, Reuters reported .\nVideo emerged on social media of what appears to be a First Person-View (FPV) drone attack on an electric substation in Russia's Kursk region.\nOf note is that in addition to the strike drone, another drone was hovering over the substation to capture the impact.\nThe German Donaustahl company introduced its Maus FPV drone earlier this week at the ILA 2024 Air Show in Berlin.\nUkraine's 46th Airmobile Brigade posted a compilation of FPV drone hits on Russian armor, including the so-called Turtle Tanks ."}, {"id": "4fd5fa80-9e6e-4f9a-b17f-61abb0b3049d", "title": "Rafale in Alaska : How  Red Flag 24  is good international exposure to Indian Air Force – Firstpost", "date": "2024-06-08 09:45", "url": "https://www.firstpost.com/opinion/rafale-in-alaska-how-red-flag-24-is-good-international-exposure-to-indian-air-force-13780203.html", "message": "Since the first time in November 1975, each year, three to six ‘Red Flag’ exercises are held at Nellis Air Force Base, Nevada, while up to four more, dubbed ‘Red Flag Alaska’, are held at Eielson Air Force Base, Alaska.\nCope Thunder was moved to Eielson Air Force Base, Alaska, in 1992.\nBlue Flag is a military aviation exercise held by the Israeli Air Force at Ovda Air Force Base in Israel.\nIn July 2022, the IAF carried out a one-month-long engagement with the Egyptian Air Force (EAF) at the Egyptian Fighter Weapon School, located in Cairo West Air Force Base.\nExercise Exposure AdvantageUnlike PLAAF, which exercises primarily with PAF and very few other major air forces, IAF benefits from exposure to air exercises with all the major air forces in the world."}, {"id": "6fe26710-95b1-40f0-9f53-bb58e10d6342", "title": "Charles Burlingham", "date": "2024-06-08 18:15", "url": "https://www.courant.com/obituaries/charles-burlingham-cambridge-ma/", "message": "Charles Burlingham, Jr., known to all as Charlie, died Wednesday, April 6, 2022, in Cambridge, Massachusetts.\nBorn January 6, 1930, in New York City to Charles and Cora Weir Burlingham, he attended The Buckley School and The Diller-Quaile School of Music in NYC, Brooks School in North Andover, MA, and Harvard University (’51).\nOn August 31, 1951, he joined the Navy, ultimately to graduate from Officer Candidate School, and Anti-Submarine Warfare School.\nTogether, Charlie and Adair would raise seven children: Robin and Nicholas Burlingham, and Adair’s daughters Barbara, Mary (Mimi), Susan, Eliza, and Alice Storey.\nIn his later years, he transcribed ancestral Weir family letters, researched genealogy, and published an endearing memoir."}, {"id": "140929fd-bddf-4707-8b4b-7af9f170d5db", "title": "Belong helps olim find their place within Israeli society . Here how", "date": "2024-06-08 17:00", "url": "https://www.jpost.com/aliyah/article-805307", "message": "Israeli society is a vibrant, interwoven tapestry of Jewish cultures from around the world.\nYet for many international Jews, the daunting reality of immigration to Israel can often feel foreign and lonely, many questioning their place within the modern-day Jewish homeland.\n“Belong was established to reinforce the connections between the Diaspora and Israel,” Gilad explains “We are making sure that Israeli society and Israeli businesses are ready to get those olim in Israel.” Founded a year prior to the events of October 7, Belong saw the rise of antisemitism in the world and understood the need for support from the private sector for meaningful and tailored integration into Israeli society.\nUnderstandably, many would consider the precarious security situation in Israel amidst the ongoing war, but Gilad reaffirms Israel is a haven for the Jewish people.\nThe idealism and collective hope that drove the early pioneering Zionist movement, faced with centuries of adversity, has far from dissipated."}, {"id": "58df46a1-8a59-4d52-ae93-2ff93b54c360", "title": "Ukraine Defense Needs and Increase in Production : President Met with Representatives of the French Defense and Industrial Complex in Paris", "date": "2024-06-08 10:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/06/ukraine-240607-ukraine-president05.htm", "message": "Ukraine's Defense Needs and Increase in Production: President Met with Representatives of the French Defense and Industrial Complex in ParisPresident of Ukraine7 June 2024 - 17:31In Paris, President of Ukraine Volodymyr Zelenskyy visited the Ministry of Armed Forces of France.\nThe Minister of the Armed Forces of France, SĂ©bastien Lecornu, presented to the Head of State the products of the companies of the French defense and industrial complex, which are planned to be supplied to Ukraine.\nThe President also spoke with representatives of the French defense and industrial complex.\nThey discussed Ukraine's defense needs and the increase in the production of SPH Caesar, artillery shells, including long-range ones, electronic warfare and armored vehicles.\nI would like to thank you for one of the highest quality systems we have ever had â€” the Caesar,\" Volodymyr Zelenskyy said."}, {"id": "37dd454f-2236-4db6-96b4-9803e9c27a15", "title": "Nova Hearts coming to Nintendo Switch", "date": "2024-06-08 17:15", "url": "https://nintendoeverything.com/nova-hearts-turn-based-magical-combat-dating-adventure-coming-to-switch/", "message": "Lightbulb Crew intends to release Nova Hearts on Switch, the studio announced today.\nNova Hearts is turn-based magical combat dating adventure.\nHere’s some additional information:Become a superhero in your hometown, TEXT, DATE and FIGHT in this turn-based combat dating adventure.\nWork together using combos to really maximize your strategy and unlock new powers as you grow to take down supervillains and their goons.\nSee how your relationships are growing, develop your magical skills and get the latest gossip in town."}, {"id": "260da825-8840-4429-82b3-f0d469ae851c", "title": "Prince William wife Princess Catherine is  better  and  would have loved  to have joined him at this year D - Day commemorations - 08 - Jun - 2024", "date": "2024-06-08 07:00", "url": "https://home.nzcity.co.nz/news/article.aspx?id=399858&fm=psp,tst", "message": "When one war survivor asked after William's wife amid her health fight, footage posted on X showed him replying: \"She is better, thanks.\nHe also told one woman at the event: \"My wife's grandmother did the same sort of thing as you.\nSpeaking to other veterans, William said: \"I found it very moving, all the stories and letters, even now 80 years later.\"\nWhen one veteran told William \"thank you\", the prince replied: \"No, we are here to thank you.\nBritish Prime Minister Rishi Sunak took to the stage and read veterans' letters at the event, which was also attended by Labour leader Sir Keir Starmer and UK Foreign Secretary Lord David Cameron."}, {"id": "3e8df9e6-97ca-49e9-95bf-8e3aa137d886", "title": "Amazing Seasun Games Reveals New Trailer for Mecha Break Game", "date": "2024-06-08 02:15", "url": "https://www.animenewsnetwork.com/news/2024-06-07/amazing-seasun-games-reveals-new-trailer-for-mecha-break-game/.211675", "message": "From Aqua to Yunyun, we tried all the KONOSUBA drinks at The Hub to find the most delicious!\n― If there's one thing many adults worldwide enjoy doing, it's getting an alcoholic beverage with some friends.\nBe they beers, ales, spirits, wines, cocktails, among other beverages, adults have their drinks of choice.\nAnd one of the best places to enjoy your drink is your local pub or bar.\nIn Japan, though, ..."}, {"id": "54248163-9755-4083-aa31-184495e0115f", "title": "SADC forces engage M23 rebels in eastern DRC as violence intensifies", "date": "2024-06-08 12:15", "url": "https://www.theeastafrican.co.ke/tea/news/east-africa/sadc-forces-engage-rebels-in-eastern-dr-congo-4651312", "message": "On May 31, the South African army, a member of this mission known as SAMIDRC announced that it had lost a soldier.\nLike the first four who lost their lives, hit by mortars, the fifth is also South African.\nIt was between December 2023 and January 2024 that SADC troops were in the DRC, alongside the Congolese.\nIt is in this locality that South African and Congolese troops have set up to block the rebel assaults.\nAs for the attacks on South African troops.”Mr Bel points out that rebels are putting pressure on President Ramaphosa to take responsibility over the death of South African soldiers."}, {"id": "dd51286e-0ffa-4d33-ac7d-a130f180d0e6", "title": "Battle of the Alphas - Sky Mix", "date": "2024-06-08 12:30", "url": "https://www.tvguide.co.uk/schedule/7b627e01-eaf1-51b3-b63e-7d2118493360/battle-of-the-alphas", "message": "Battle of the AlphasSky Mix 6:30 PM to 7:00 PM Saturday 8 June Share Add toCalendar +Season 1 Episode 12 of 12 New S Subtitles Audio DescriptionAnimal battles south of the Sahara, where male giraffes swing their heads like wrecking balls, zebras boast the most powerful kick in the animal kingdom and chimpanzees wage warBattle of the Alphas airs on Sky Mix at 6:30 PM, Saturday 8 June .\n(Subtitles, audio description, new.)\nLearn more about Battle of the Alphas and other education/science/factual topics on our factual page"}, {"id": "b8b4dbf4-f6ab-462b-b6b4-e95b95da49b3", "title": "Battle Vision Network is Capy spiritual successor to Might & Magic : Clash of Heroes", "date": "2024-06-08 00:00", "url": "https://www.engadget.com/battle-vision-network-is-capys-spiritual-successor-to-might--magic-clash-of-heroes-230547594.html", "message": "It’s called Battle Vision Network, and it’s heading to PC and mobile devices in 2025.\nBattle Vision Network feels like an encapsulation of Capy’s sensibilities over 20 years as an independent game studio.\nAnd finally, it’s a one-on-one puzzle fight, similar to Might & Magic: Clash of Heroes.\nIn the announcement video for BVN, director Dan Vader described the new game as a spiritual successor to Clash of Heroes with an emphasis on multiplayer combat.\nNetflix will distribute the iOS and Android versions of the game, meaning it should be available to all Netflix subscribers at no extra charge."}, {"id": "cc9b7cde-f0c5-49ac-8a14-fe0c16ed8100", "title": "Metaphor : ReFantazio Synthesis Allows for Combining Archetypes in Battle", "date": "2024-06-08 03:30", "url": "https://gamingbolt.com/metaphor-refantazios-synthesis-feature-allows-for-combining-archetypes-in-battle", "message": "Metaphor: ReFantazio, the next big RPG from Persona 5 director Katsura Hashino, is already a massive experience.\nHowever, its battle system has its intricacies, especially when factoring in the Archetypes.\nHowever, the highlight is perhaps Synthesis, which allows for combining two party members’ Archetypes.\nOf course, there’s Special Synthesis, where three characters can team up for massive damage, though the condition for activation changes based on the party composition.\nLaunching on October 11th, Metaphor: ReFantazio will be available for Xbox Series X/S, PS5, PS4 and PC."}, {"id": "6e297f68-8f15-46ea-a6ac-ce1dc6a96d81", "title": "6 / 8 / 24 National Security and Korean News and Commentary", "date": "2024-06-08 19:30", "url": "https://smallwarsjournal.com/blog/6824-national-security-and-korean-news-and-commentary", "message": "Voice of America: [Washington Talk] “Military agreement suspended, Korean military ‘shackles’ lifted… “Information warfare must be expanded across the board.”2.\nNorth Korea recalls documentary about Kim Jong Un’s mother4.\nAn American Company Enabled a North Korean Scam That Raised Money for WMDs7.\nDissecting Propaganda: Using AI to Cut Through North Korean TV Spin8.\nDeterring North Korean aggression remains primary goal, new fighter wing commander says12."}, {"id": "deb5c180-b650-439e-9553-6875b0693a89", "title": "Beyond blockbusters : Break from the mainstream with these indie games", "date": "2024-06-08 02:15", "url": "https://www.thestar.com.my/tech/tech-news/2024/06/08/beyond-blockbusters-break-from-the-mainstream-with-these-indie-games", "message": "In the game, players are in the shoes (or shell) of Kril, the hermit crab, as they battle through enemies and explore the briny depths while collecting ocean-borne microplastics as the primary in-universe currency.\nThis could be a broken glass bottle, a plastic cup, or an empty can, with 69 to discover.\n— Out of The Blue GamesAmerican ArcadiaPlatform: SteamPuzzle game fans can check out American Arcadia, a game set in a world stuck perpetually in 1970s Americana with a strong resemblance to The Truman Show.\nRather than rehashing the classic hospital management formula, Galacticraft developer Brightrock Games opted to spice things up by having players operate a hospital in space.\nRather than rehashing the classic hospital management formula, developer Brightrock Games opted to spice things up by having players operate a hospital in space."}, {"id": "7399aa39-19f6-4b60-89a1-0a44f9821a8f", "title": "Discover Imber : The eerie  ghost village  near London abandoned in WWII , open just 20 days a year | Birmingham Live", "date": "2024-06-08 06:00", "url": "https://www.birminghammail.co.uk/travel/dangerous-ghost-village-abandoned-overnight-29282942", "message": "A tiny village just two hours away from Birmingham was once a bustling community of several hundred villagers.\nBut those living in Imber abandoned their homes after orders from the Ministry of Defence.\nOnly a small church, a handful of cottages, and a vicarage remain at the Wiltshire-based village, often dubbed 'the lost village'.\nA significant portion of the village and surrounding farmland had been strategically acquired by the Ministry of Defence before the war.\nToday, while the charm and mystery of its history are preserved in the church, the rest of the area is now dominated by rather 'unattractive' MOD training buildings."}, {"id": "e915e3f4-a931-4ab5-9964-82233aca1231", "title": "Religion column : Racism – A spiritual disease", "date": "2024-06-08 15:15", "url": "https://helenair.com/news/local/column/religion-column-clifford-stevens-racism-spiritual-disease/article_a9ef79e0-22da-11ef-bb8d-477e1724c57e.html", "message": "America had to wait for the Civil War to end slavery, not so the British Empire.\nIn 1833 the British Parliament passed the Slavery Abolition Act, which gave all slaves in the British Empire their freedom.\nThe process of freeing the 768,000 slaves in the British Empire lasted for four years until Aug. 1, 1838, soon after Queen Victoria’s coronation.\nAmerica chose the Civil War, which left up to 750,000 soldiers dead, along with an undetermined number of civilian casualties.\nThe Civil War was the deadliest military conflict in American history, but you’ll have to read about that elsewhere."}, {"id": "e55a4909-fc30-4712-b562-10e63e0c0ac0", "title": "India MiG - 25 to MiG - 31 Upgrade : A Missed Opportunity or Wise Choice ? – Indian Defence Research Wing", "date": "2024-06-08 03:45", "url": "https://idrw.org/indias-mig-25-to-mig-31-upgrade-a-missed-opportunity-or-wise-choice/", "message": "India’s MiG-25 to MiG-31 Upgrade: A Missed Opportunity or Wise Choice?\nHowever, this prompts an interesting comparison with the Indian Air Force’s historical use of the MiG-25 and its subsequent decision regarding the MiG-31.\nThe MiG-25, known for its exceptional speed and high-altitude capabilities, was unrivaled in South Asia.\nHowever, with advancements in remote sensing satellites and synthetic aperture radar technology, the need for manned high-altitude reconnaissance decreased.\nIndia’s decision to prioritize the Su-30MKI over the MiG-31 reflects a strategic assessment of current and future operational requirements."}, {"id": "06ab901d-402d-4460-a8ad-3f359d0ff5f9", "title": "Delta Force Hawk Ops features extraction mode and Black Hawk Down for alpha test in July", "date": "2024-06-08 10:30", "url": "https://venturebeat.com/latest-games-reviews/delta-force-shows-off-extraction-mode-and-black-hawk-down-for-alpha-test-in-july/", "message": "The devs of Delta Force: Hawk Ops showed off the Extraction Mode for the multiplayer modern combat game.\nIt has a global alpha test in July and you can wishlist it from Steam and the Epic Games Store.\nDelta Force Hawk Ops extraction mode.\nIt has a Delta Force Black Hawk Down mode as well where you can re-fight the ill-fated battle in Mogadishu, Somalia, as depicted in the book/film Black Hawk Down.\nI’m looking forward to a new entry in the military shooter space with the Delta Force brand, as I played the voxel-based games way back when."}, {"id": "b391a6ad-3f7d-4741-8666-1e598fbab249", "title": "Biden Publicly Apologises To Zelenskyy For Monthslong Congressional Holdup To Weapons That Let Russia Advance", "date": "2024-06-08 06:00", "url": "https://www.news18.com/world/biden-publicly-apologises-to-zelenskyy-for-monthslong-congressional-holdup-to-weapons-that-let-russia-advance-8925338.html", "message": "President Joe Biden on Friday for the first time publicly apologised to Ukraine for a monthslong congressional holdup in American military assistance that let Russia make gains on the battlefield.\n“It’s very important that in this unity, United States of America, all American people stay with Ukraine like it was during World War II,” Zelenskyy said.\nThe slow pace of delivery of pledged Western weaponry has long frustrated Zelenskyy, as has Biden’s hesitation over supplying more hardware for fear of provoking Russian President Vladimir Putin.\nThe U.S. will send about $225 million in military aid to Ukraine, Biden announced Friday.\nBiden and Zelenskyy attended the anniversary events of D-Day in Normandy, northern France, on Thursday, along with European leaders who have supported Kyiv’s efforts in the war."}, {"id": "30e8ca9c-7e26-44d8-8b1f-e4585c2949ed", "title": "Everything We Saw At Summer Game Fest 2024", "date": "2024-06-08 03:00", "url": "https://kotaku.com/everything-we-saw-at-summer-game-fest-2024-1851527046", "message": "AdvertisementCuffbustCuffbust World Premiere Trailer | Summer Game Fest 2024If you’re looking for some cooperative prison break action as, um, koalas?\nAdvertisementBatman: Arkham ShadowBatman: Arkham Shadow World Premiere Trailer | Summer Game Fest 2024Batman arrives in the world of VR with Arkham Shadow.\nAdvertisementBlumhouse Games ShowcaseBlumhouse Games Interview and Trailer with Jason Blum and Louise Blain | Summer Game Fest 2024Blumhouse Games offered up a sizzle reel at Summer Game Fest showcasing a variety of different spooky titles, each with delightfully hellacious horror themes and set in different genres.\nAdvertisementPhantom Blade 0Phantom Blade Zero World Premiere Trailer | Summer Game Fest 2024Phantom Blade 0 got a new trailer as the last game on stage at this year’s Summer Game Fest.\nAdvertisementAnd that wraps everything we saw at Summer Game Fest 2024."}, {"id": "0c5d8157-7867-4d5f-a6c0-11692e4596e6", "title": "WWII weekend kicks off", "date": "2024-06-08 12:30", "url": "https://www.wfmz.com/news/area/berks/wwii-weekend-kicks-off/article_dfce6cc6-257b-11ef-bd40-332a0d940f60.html", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "f1ceeafa-f7f2-484a-8548-d7a9776b334b", "title": "Vets travel to National WWII Museum , as this week marks 80 years since D - Day", "date": "2024-06-08 17:00", "url": "https://www.whec.com/local/vets-travel-to-national-wwii-museum-as-this-week-marks-80-years-since-d-day/", "message": "ROCHESTER, N.Y. — On June 6, 1944, troops from the Allies stormed the beaches of Normandy — marking a historic battle of World War II.\nJune 6, 2024 marks 80 years since our troops stormed Omaha Beach in an effort to rid the rule of Nazi Germany in France.\nOne veteran from Fairport, 102-year-old “Al” Persichitti, died while traveling to attend the D-Day memorial event in Normandy this year.\nOther veterans went to the National World War II Museum in New Orleans to remember D-Day, and returned home from the trip on Saturday.\nOur Jennifer Lewke met nine World War II vets in Batavia, a few of which were apart of the historic storming of Omaha Beach."}, {"id": "6475e1d8-b016-4ff8-8962-a76d696df1cc", "title": "Biden Push To End The Gaza", "date": "2024-06-08 09:30", "url": "https://www.outlookindia.com/international/bidens-push-to-end-the-gaza-war", "message": "Palestinian civilians would return to their home in all areas of Gaza.\nHumanitarian assistance would be up to 600 trucks carrying aid to Gaza every day.\nThe second phase was for Israel and Hamas would negotiate the necessary arrangements to get to a permanent end to hostilities.\n\"There are a number of details to negotiate to move from phase one to phase two.\nThe last phase of this ambitious plan was reconstruction of Gaza."}, {"id": "37dd39fe-6173-441f-a994-2d247506b2a8", "title": "Biden apologizes to Zelenskyy for holdup on providing weapons", "date": "2024-06-08 00:00", "url": "https://www.theday.com/nation/20240607/biden-apologizes-to-zelenskyy-for-holdup-on-providing-weapons/", "message": "U.S. President Joe Biden shakes hands with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024.\n(AP Photo/Evan Vucci)U.S. President Joe Biden meets with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024.\n(AP Photo/Evan Vucci)U.S. President Joe Biden meets with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024.\n(AP Photo/Evan Vucci)U.S. President Joe Biden meets with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024.\n(AP Photo/Evan Vucci)U.S. President Joe Biden shakes hands with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024."}, {"id": "e455c491-1ad6-4b30-8a91-34e392d68d63", "title": "Hostage Rescue to be Named  Operation Arnon  for IDF Special Forces Commander Killed in Action | The Jewish Press - JewishPress . com | Hana Levi Julian | 3 Sivan 5784 – Saturday , June 8 , 2024", "date": "2024-06-08 18:45", "url": "https://www.jewishpress.com/news/israel/idf/hostage-rescue-to-be-named-operation-arnon-for-idf-special-forces-commander-killed-in-action/2024/06/08/", "message": "Photo Credit: courtesyIDF Chief of Staff LTG Herzi Halevi has announced that Special Forces Yamam squad commander Chief Inspector Arnon Zamora was killed on Saturday while rescuing Israeli hostages from a civilian apartment where they were being held in central Gaza.\nThe Chief of Staff and the Yamam Unit commander together decided to name the rescue operation “Operation Arnon” in recognition of Zamora’s sacrifice and the performance of his unit throughout the war.\n“The IDF mourns the fallen Israel Police ‘Yamam’ (National Counter-Terrorism Unit) Squad Commander, Chief Inspector Arnon Zamora,”the IDF said in a separate statement.\n“I salute Chief Inspector Arnon Zamora, Commander in the elite Yamam Unit, who fell while leading a daring operation to rescue four hostages held by Hamas in Gaza.\nThis morning not only did we have a successful operation but also an opportunity to fulfill the goals of this war.”"}, {"id": "aed73eda-2f65-4145-b555-977da6b4eaed", "title": "It Finally Here ! news - Empires of the Undergrowth", "date": "2024-06-08 00:00", "url": "https://www.indiedb.com/games/empires-of-the-undergrowth/news/its-finally-here6", "message": "Empires of the Undergrowth’s version 1.0 is now released, featuring the Matabele ants as the final focal species of the game, as well as the termites in a co-starring role.\nThe whole campaign is now playable start to finish, along with all of its challenge modes and a greatly expanded custom game offering.\nAfter the changes, read on to see our updated roadmap, showing where we intend to take the game now it has reached version 1.0.\nTake your enhanced colony into custom games, or repeat your colony’s journey with tougher challenges in New Game Plus - but this time you can take your formicarium upgrades into the mission with you!\nAnd if this is your first time playing Empires of the Undergrowth, welcome."}, {"id": "ab852355-f393-4142-be3a-42c45c9e746e", "title": "SaGa Emerald Beyond Switch physical release with English", "date": "2024-06-08 13:00", "url": "https://nintendoeverything.com/saga-emerald-beyond-getting-physical-release-in-asia-with-english-support-pre-orders-open/", "message": "If you’ve been holding out for a physical version of SaGa Emerald Beyond, we’re happy to report that you’ll soon be happy to add a copy to a collection.\nSaGa Emerald Beyond first came to Switch this past April.\nA Story of Your Very Own Making: SaGa Emerald Beyond has the greatest number of branching plots of any game in the SaGa series.\nBattles where a Single Choice Can Change Everything: SaGa Emerald Beyond further refines the highly strategic Timeline Battles the SaGa franchise has been long renowned for.\nPre-orders for the new SaGa Emerald Beyond Switch physical release are open here with a ship date of July 12, 2024."}, {"id": "637315ca-5097-4301-be70-0d5a11543692", "title": "Congressman Jason Crow reenacts World War II parachute jump on D - Day", "date": "2024-06-08 04:15", "url": "https://www.cbsnews.com/colorado/news/congressman-jason-crow-reenacts-world-war-ii-parachute-jump-d-day/", "message": "Colorado Congressman Jason Crow leads jump over Normandy from C-47 that led invasion fleet on D-DayColorado Congressman Jason Crow leads jump over Normandy from C-47 that led invasion fleet on D-DayColorado Congressman Jason Crow leads jump over Normandy from C-47 that led invasion fleet on D-DayAs Americans continue to recognize the fallen members of D-Day from World War II, Congressman Jason Crow, an Army combat veteran who served in the 82nd Airborne Division and 75th Ranger Regiment, reenacted the parachute jump of D-Day in Normandy, France 80 years later.\nCBSCrow is currently in Normandy and was alongside 41 WWII veterans, honoring the sacrifice of the service members on D-Day.\nOn Friday with a bipartisan delegation of Congressional veterans, Crow jumped out of a WWII-era plane to honor those who made that same jump behind enemy lines 80 years ago.\nCrow issued a statement on the reenacted jump saying:\"Today, we remember thousands of America's best who were willing to give everything to defend freedom and democracy at home and abroad.\nNow, it's on us to honor their service and recommit to the values they fought to defend — freedom, equality, and democracy.\""}, {"id": "8d9a10b6-8917-43ab-830a-61e86bf2fa4d", "title": "Delta Force : Hawk Ops hands - on preview – the original military shooter", "date": "2024-06-08 02:45", "url": "https://metro.co.uk/2024/06/07/delta-force-hawk-ops-hands-on-preview-original-military-shooter-20992107/", "message": "Delta Force: Hawk Ops – a blast from the past (Tencent)A modern multiplayer shooter with a late 90s heritage, the new Delta Force aims to make Chinese publisher Tencent a major force in the West.\nDelta Force: Hawk Ops is an attempt to recreate the vibe of NovaLogic’s games using modern technology.\nHawk Ops is Tencent’s first weapon in a (some would say overdue) bid to launch itself into the consciousness of gamers beyond China.\n‘But in the triple-A PC and console titles, we hope that Delta Force: Hawk Ops will be the first big success for us.\nMORE : Best new mobile games on iOS and Android – May 2024 round-upMORE : Best new mobile games on iOS and Android – April 2024 round-upMORE : Best new mobile games on iOS and Android – March 2024 round-up"}, {"id": "dde5d8dc-8f73-4a94-ac6f-63f1de54333b", "title": "Flags of our fathers resonate today", "date": "2024-06-08 04:00", "url": "https://www.unionleader.com/news/social_issues/flags-of-our-fathers-resonate-today/article_1ba462be-2414-11ef-9216-0b726ef1ec82.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "f44ab7f2-67da-458b-87c9-65fd69d47341", "title": "The Nostradamus Effect - Sky History", "date": "2024-06-08 14:45", "url": "https://www.tvguide.co.uk/schedule/20e06b98-c0fa-540f-bced-cf18beafbb4f/the-nostradamus-effect", "message": "The Nostradamus EffectSky History 8:00 PM to 9:00 PM Saturday 8 June Share Add toCalendar +Armageddon Battle Plan Season 1 Episode 2In 1947, ancient scrolls were discovered in desert caves near the Dead Sea.\nOne of them spells out - in chilling detail - a future apocalyptic war.\nThis documentary considers the plausibility of such propheciesThe Nostradamus Effect airs on Sky History at 8:00 PM, Saturday 8 June .\nLearn more about The Nostradamus Effect and other education/science/factual topics on our factual page"}, {"id": "0ce8a63f-0819-4fc3-b996-b19a6edeac90", "title": "Why Biden Gaza ceasefire proposal failed", "date": "2024-06-08 15:00", "url": "https://www.spectator.co.uk/article/why-bidens-ceasefire-proposal-failed/", "message": "Ceasefire deals to end the war in Gaza have come and gone.\nPresident Biden’s unexpected announcement of the latest formula for a settlement, supposedly proposed by Israel, has already fallen by the wayside.\nNetanyahu has made it absolutely clear that he intends to complete his military objectives before a ceasefire can be contemplatedBiden’s move was unusual.\nFirst, he claimed the latest ceasefire proposals were from Tel Aviv, not Washington.\nSo, all in all, Washington’s hopes of pressurising Tel Aviv into agreeing a ceasefire and a permanent end to the war in Gaza would seem to be premature, if not hopelessly unrealistic."}, {"id": "9c32d3e7-03b0-4d0f-b3e8-62f4a7ef7981", "title": "Israeli forces batter central and south Gaza as tanks advance in Rafah", "date": "2024-06-08 03:30", "url": "https://www.japantimes.co.jp/news/2024/06/08/world/politics/israeli-forces-batter-gaza/", "message": "With a renewed cease-fire push in the eight-month-old Gaza war stalled, Israel bombarded central and southern areas again on Friday, killing at least 28 Palestinians, and tank forces advanced to the western edges of Rafah.\nU.S.-backed Qatari and Egyptian mediators have tried again this week to reconcile clashing demands preventing a halt to the hostilities, a release of Israeli hostages and Palestinians jailed in Israel, and an unrestricted flow of aid into Gaza to alleviate a humanitarian disaster.\nBut sources close to the talks said there were still no signs of a breakthrough.\nA month after rumbling into Rafah in what Israel said was an assault to wipe out Hamas' last intact combat units, tank-led forces have advanced to the southwest fringes of the city that skirts the Gaza Strip's border with Egypt, residents said."}, {"id": "df1fdcbc-1e9d-453f-817a-c16799940cd9", "title": "Kingdom Come : Deliverance II Gets Saints and Sinners Trailer", "date": "2024-06-08 01:45", "url": "https://www.vgchartz.com/article/461336/kingdom-come-deliverance-ii-gets-saints-and-sinners-trailer/", "message": "Kingdom Come: Deliverance II Gets Saints and Sinners Trailer - News/ 373 Viewsby, posted 21 hours agoPublisher Deep Silver and developer Warhorse Studios have released a new trailer for the action RPG, Kingdom Come: Deliverance II, called Saints and Sinners.\nView the trailer below:Read details on the game below:Kingdom Come: Deliverance II is a thrilling action RPG, set amid the chaos of a civil war in 15th Century Bohemia.\nFrom bustling city streets to lush forests, discover this open-world Medieval Europe through an unforgettable adventure filled with action, thrill and wonder.\nA True RPG ExperienceYour actions shape Henry’s destiny and how the world will react to him.\nOn foot, horse or by stealth, you can specialize in elegant sword mastery, brutal blunt weapons or deadly ranged attacks."}, {"id": "db8850f7-ada8-4668-a397-c67c03df4e01", "title": "Future of Play Direct 2024 - Announcements , Trailers , and More", "date": "2024-06-08 17:15", "url": "https://www.vgchartz.com/article/461343/future-of-play-direct-2024-announcements-trailers-and-more/", "message": "Future of Play Direct 2024 - Announcements, Trailers, and More - News/ 734 Viewsby, posted 3 hours agoFuture of Play Direct 2024 presented by GLITCH returned today for Season 5 and the showcase featured announcements, trailers and more from over 20 games.\nCheck out the list of games, trailers, details, announcements, and more below:ALZARA: Radiant EchoesAn exclusive pre-show spotlight featuring renowned composer Motoi Sakuraba (Golden Sun, Tales series, Dark Souls), who will produce the soundtrack for ALZARA Radiant Echoes - currently available to support on Kickstarter!\nCopycatCopycat is a narrative-driven indie game that’s perfect to cuddle up with on a rainy afternoon.\nPsychromaFrom the developers of Raptor Boyfriend, this psychological thriller first revealed in Future of Play Direct Season 3 is officially releasing on Steam and Xbox... this Tuesday June 11th!\nFuture of Play Direct 2024: HYpe ReelCheck out cosmic bangers like Echo Generation, ALZARA Radiant Echoes, Timberborn, Retro Gadgets, and more in this sizzle reel of games from Future Of Play Direct during Summer Game Fest 2024."}, {"id": "9d5fc048-dd5b-43d1-a5fc-23a38498a04c", "title": "Web of control", "date": "2024-06-08 03:30", "url": "https://www.thenews.com.pk/print/1197975-web-of-control", "message": "Icons of the popular social media platforms seen in this undated photo.\nPrevious actions – blocking of specific websites and social media platforms as well as restrictive and regressive legislation – had already raised alarms about government overreach.\nAnd instead of physical and tangible operations we now have info-warfare – all on social media.\nIn fact, starting with PECA, it has been one bad legislation after another when it comes to social media or anything linked to social media.\nWhether the PML-N or the PTI, both governments have been enthusiastic about curbing social media influence."}, {"id": "e0fb2a4a-9a32-4459-ae6f-77cf1bc40986", "title": "China Soaring Ambitions Clipped : Why Dragon Fighter Jets Struggle for Takeoff – Indian Defence Research Wing", "date": "2024-06-08 13:00", "url": "https://idrw.org/chinas-soaring-ambitions-clipped-why-dragons-fighter-jets-struggle-for-takeoff/", "message": "China’s Soaring Ambitions Clipped: Why Dragon’s Fighter Jets Struggle for Takeoff| BySOURCE: AFIChina’s rise as a military power includes a growing presence in the arms trade.\nHowever, despite significant economic and military advancements, China’s ambitions in the high-end fighter jet market haven’t quite hit the mark.\nChina’s J-10 and J-20 fighter jets appear impressive on paper, with the J-20 often compared to the top-of-the-line US F-22 Raptor and F-35.\nChina faces an uphill battle in the fighter jet market due to:Quality Concerns: Unproven capabilities compared to established players.\nOnly by addressing these challenges can China hope to truly take flight in the global fighter jet market."}, {"id": "fcb516b4-69d2-4b6b-b405-bed9f7181279", "title": "Ukraine drone attack reported deep into Russian territory", "date": "2024-06-08 10:30", "url": "https://www.prokerala.com/news/articles/a1537887.html", "message": "Moscow, June 8 : - Ukraine attacked Russian targets with a total of 25 combat drones overnight, according to the Defence Ministry in Moscow, with one drone said to have reached deep into the Russian Caucasus.\nThe Russian ministry said the drones were intercepted in the border regions of Rostov, Bryansk and Belgorod, as well in Russian-occupied Crimea.\nA Ukrainian drone also apparently penetrated the republic of North Ossetia in Russia's Caucasus.\nWhether all Ukrainian drones were actually shot down by Russian air defences could not be independently verified.\nAs a practice, the Russian Defence Ministry does not provide any information about drones that hit their target."}, {"id": "187cd02d-8e24-4aa8-8f77-68ef647e21a1", "title": "Biden Says Putin  Not Going to Stop at Ukraine  ", "date": "2024-06-08 17:30", "url": "https://www.themoscowtimes.com/2024/06/08/biden-says-putin-not-going-to-stop-at-ukraine-a85353", "message": "U.S. President Joe Biden on Saturday pledged Washington's support for Kyiv in its battle against the Russian invasion, warning that Vladimir Putin would \"not stop\" at Ukraine.\n\"Putin is not going to stop at Ukraine,\" Biden said alongside French President Emmanuel Macron after talks in Paris.\n\"All of Europe will be threatened, we are not going to let that happen,\" Biden told journalists during his state visit to France.\nBoth Biden and Macron on Friday met Ukrainian President Volodymyr Zelensky in Paris, pledging support for the Ukrainian cause.\nOn Friday, Biden warned of the need to preserve American democracy and drew parallels between World War II and Russia's invasion of Ukraine."}, {"id": "ec24dde2-05e3-43e9-8f64-fcf899edef45", "title": "Navigating the Tensions : US Policy on Ukraine - Russia Conflict Amidst Escalation Fears", "date": "2024-06-08 06:30", "url": "https://trendydigests.com/2024/06/08/navigating-the-tensions-us-policy-on-ukraine-russia-conflict-amidst-escalation-fears/", "message": "However, amidst Ukraine’s pressing needs and the backdrop of Russian President Vladimir Putin’s veiled nuclear threats, the Biden administration’s policy has been subject to intense scrutiny and gradual shifts.\nThe recent decision by the US administration to allow Ukraine to use American-supplied weapons to strike targets within Russia marks a significant, albeit careful, policy escalation.\nDespite the risks, Ukraine’s attacks on Russian territory have raised concerns over the potential of nuclear escalation.\nThis nuanced approach underscores the administration’s attempt to balance between aiding Ukraine and restraining the conflict from spiraling into a broader war.\nAs the war progresses and Ukraine’s needs evolve, the policy has adapted, often incrementally, to the demands of the battlefield."}, {"id": "ada134bd-7d83-4b80-9c98-d2a38cbe7412", "title": "Europe defenceless and unprepared for nuclear war , warns Putin", "date": "2024-06-08 17:30", "url": "https://www.aol.co.uk/news/putin-warns-europe-defenceless-against-114037679.html", "message": "Vladimir Putin at the St Petersburg International Economic Forum - Artem Priakhin/SOPA Images/ShutterstockVladimir Putin has warned that Europe is “defenceless” and unprepared for a nuclear conflict with Russia.\nThe Russian president has unnerved commentators in the West by testing missiles that can be armed with a nuclear warhead.\nThe key developments were:Vladimir Putin has said Europe is “defenceless” against nukes and that his country has “many more” than the continent.\nHer comments to state news agency RIA followed a statement from Russian president Vladimir Putin on Friday that the country could make adjustments to its nuclear doctrine.\nMr Poroshenko served as Ukrainian president between 2014 and 2019, and has remained a prominent figure in the country since leaving office."}, {"id": "64bd2554-a52d-4ae7-8e97-d73c35a53a02", "title": "Black D - Day combat medic long - denied medal tenderly laid on Omaha Beach where he bled , saved lives", "date": "2024-06-08 04:00", "url": "https://isp.netscape.com/news/story/0001/20240608/10644ab8a4790794e810ace300cef418", "message": "Black D-Day combat medic's long-denied medal tenderly laid on Omaha Beach where he bled, saved livesOMAHA BEACH, France (AP) — A medal richly deserved but long denied to an African American combat medic wounded on Omaha Beach in the D-Day landings was tenderly laid Friday on the hallowed sands where he saved lives and shed blood.\nThe medal was awarded posthumously to Woodson this month — just ahead of the 80th anniversary of D-Day — following years of lobbying for more recognition of his achievement on that fateful day.\nKevin Braafladt explained to the soldiers that the next step would be the medal’s presentation to Woodson’s widow, 95-year-old Joann.\n“We want to be able to say that this medal came from Omaha Beach and was at the site of Woodson’s actions,” Braafladt said.\nUltimately, seven Black World War II troops were awarded the Medal of Honor in 1997."}, {"id": "3199ba27-a482-46df-b953-b0287869879a", "title": "Will North Korea fly trash balloons into South Korea again ? A look at rising tensions between them | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-06-08 01:45", "url": "https://www.asahi.com/ajw/articles/15297954", "message": "FILE - South Korean soldier wearing protective gears checks the trash from a balloon presumably sent by North Korea, in Incheon, South Korea, on June 2, 2024.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nBut the North Korean balloons sent into South Korea in recent days carried only garbage, not political leaflets.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire."}, {"id": "9affb461-ad71-48d5-9719-cf70320db3b0", "title": "Putin warns Europe is  defenceles against his nuclear weapons", "date": "2024-06-08 13:45", "url": "https://www.yahoo.com/news/putin-warns-europe-defenceless-against-114037883.html", "message": "Vladimir Putin has warned that Europe is “defenceless” and unprepared for a nuclear conflict with Russia.\nPutin has previously boasted of Russia’s nuclear arsenal but he intensified his rhetoric this week at the forum, held as Nato allies marked the 80th anniversary of the D-Day landings at Normandy.\nThe Russian president has unnerved commentators in the West by testing missiles that can be armed with a nuclear warhead.\nThe key developments were:Vladimir Putin has said Europe is “defenceless” against nukes and that his country has “many more” than the continent.\nHer comments to state news agency RIA followed a statement from Russian president Vladimir Putin on Friday that the country could make adjustments to its nuclear doctrine."}, {"id": "30763ecc-7f6a-4740-8f2c-5e2e8987a837", "title": "Putin warns Europe is  defenceles against his nuclear weapons", "date": "2024-06-08 13:00", "url": "https://www.aol.com/putin-warns-europe-defenceless-against-114037902.html", "message": "Vladimir Putin at the St Petersburg International Economic Forum - Artem Priakhin/SOPA Images/ShutterstockVladimir Putin has warned that Europe is “defenceless” and unprepared for a nuclear conflict with Russia.\nThe Russian president has unnerved commentators in the West by testing missiles that can be armed with a nuclear warhead.\nThe key developments were:Vladimir Putin has said Europe is “defenceless” against nukes and that his country has “many more” than the continent.\nHer comments to state news agency RIA followed a statement from Russian president Vladimir Putin on Friday that the country could make adjustments to its nuclear doctrine.\nMr Poroshenko served as Ukrainian president between 2014 and 2019, and has remained a prominent figure in the country since leaving office."}, {"id": "d1e09b0e-0789-4e10-9378-ebcdb139dd29", "title": "Biden says Putin  not going to stop at Ukraine  ", "date": "2024-06-08 17:15", "url": "https://www.yahoo.com/news/biden-says-putin-not-going-151556329.html", "message": "Biden says Putin 'not going to stop at Ukraine'Biden vowed he would not walk away from Ukraine (SAUL LOEB)US President Joe Biden on Saturday pledged Washington's support for Kyiv in its battle against the Russian invasion, warning that Vladimir Putin would \"not stop\" at Ukraine.\n\"Putin is not going to stop at Ukraine,\" Biden said alongside French President Emmanuel Macron after talks in Paris.\n\"All of Europe will be threatened, we are not going to let that happen,\" Biden told journalists during his state visit to France.\nBoth Biden and Macron on Friday met Ukrainian President Volodymyr Zelensky in Paris, pledging support for the Ukrainian cause.\nOn Friday, Biden warned of the need to preserve American democracy and drew parallels between World War II and Russia's invasion of Ukraine."}, {"id": "4af560b3-0382-4a9f-bd8b-b3f788f23ef7", "title": "The hype backfires : India surprise vote result | India Election 2024", "date": "2024-06-08 12:45", "url": "https://www.aljazeera.com/program/the-listening-post/2024/6/8/the-hype-backfires-indias-surprise-vote-result", "message": "The surprise election result in India leaves the BJP and Prime Minister Narendra Modi missing a chunk of voter support and at the helm of a tricky coalition.\nContributors:Nishtha Gautam – Columnist, NDTVSreenivasan Jain – Host, The India ReportMukul Kesavan – Historian and novelistFatima Khan – Journalist, The QuintOn our radar:Amid the European parliamentary election, a battle against misinformation continues between the European Union and Russia.\nMeenakshi Ravi reports on how Moscow could be behind a campaign to misinform and discourage European voters.\nIsrael’s cultural annihilation in GazaThe Listening Post has covered Israel’s war on Gaza through the prism of the media, including the unprecedented killing of Palestinian journalists.\nBut there is another level to what is unfolding in Gaza: the genocidal assault on Palestinian history, existence and culture."}, {"id": "7aa5e11d-32fe-422a-b056-35e26a6d8ec4", "title": "Chaos Agent Kari Lake No Good , Awful , Very Bad Week", "date": "2024-06-08 19:30", "url": "https://crooksandliars.com/2024/06/chaos-agent-kari-lakes-no-good-awful-very", "message": "And it would be for anyone else, but not for the plucky election-denying radical extremist that is Kari Lake.\nReached for comment about the video, a spokesperson for Kari Lake told the Guardian: “The Kari Lake campaign does not respond to British propaganda outlets.\nWe stopped doing that in 1776.”Kari Lake's spokesperson sounds just as deeply unserious as Kari Lake herself.\nResponding to this, the Lake campaign told The Arizona Republic, “Kari Lake went to a store.\n\"Kari Lake's recent comment calling Sheriff Mark Lamb a 'coward' is both unfounded and disrespectful,\" the group's letter said."}, {"id": "0aa374be-4a78-478d-8b64-b6de5f9b868c", "title": "The J - 15 Flying Shark Fighter Is Just What China Aircraft Carriers Need", "date": "2024-06-08 15:15", "url": "https://nationalinterest.org/blog/buzz/j-15-flying-shark-fighter-just-what-chinas-aircraft-carriers-need-211360", "message": "Summary: The J-15 \"Flying Shark\" is a carrier-based multirole fighter developed by China's Shenyang Aircraft Corporation, based on the Russian Su-33 \"Flanker-D\" design.\nChina's J-15 'Flying Shark': A Force to Reckon With in Naval AviationThe J-15 fighter jet, known as the “Flying Shark,” is a carrier-based multirole fighter developed by China’s Shenyang Aircraft Corporation for the People’s Liberation Army Naval Air Force (PLANAF).\nThe J-15 SpecificationsThe J-15 has a length of 21.9 meters, a height of 5.9 meters, and a wingspan of 14.7 meters.\nWhat the Flying Shark is Meant ForA “Flying Shark” is primarily designed for air superiority and fleet defense missions.\nThe J-15 Flying Shark vs. F/A-18 Super HornetDespite these advantages, though, the J-15 “Flying Shark” has some unique features that make it a formidable opponent."}, {"id": "14ab3c14-61d2-44ca-9d19-ab34d9125dd7", "title": "Warhammer vet  grimdark femme miniatures Kickstarter shatters goal", "date": "2024-06-08 00:15", "url": "https://www.polygon.com/24173689/john-blanche-morderin-grimdark-femmes-kickstarter-release-date-price", "message": "John Blanche left an indelible mark on science fiction, high fantasy, and the world of gaming as a whole with his iconic art depicting the Warhammer and Warhammer 40,000 universes.\nNow, after 46 years at Games Workshop, he’s stepping out on his own with a new line of miniatures.\nLaunched quietly on Tuesday, the Kickstarter campaign for his inaugural Mörderin line launched with four exquisite “grimdark femmes miniatures.” Unsurprisingly, the project has crushed its funding goal.\nGrid View Image: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheThe Mörderin line began as a series of Blanche artworks, rendered in his unique style with its graceful lines and deep shadows.\nFor this project, Blanche’s figures are being produced by Zealot Miniatures in Siocast thermoplastic."}, {"id": "56f4a1da-7d8f-4e88-bfd4-d9c3d1ec7813", "title": "Biden says Putin  not going to stop at Ukraine  - World", "date": "2024-06-08 17:30", "url": "https://www.brecorder.com/news/40307513/biden-says-putin-not-going-to-stop-at-ukraine", "message": "PARIS: US President Joe Biden on Saturday pledged Washington’s support for Kyiv in its battle against the Russian invasion, warning that Vladimir Putin would “not stop” at Ukraine.\n“Putin is not going to stop at Ukraine,” Biden said alongside French President Emmanuel Macron after talks in Paris.\n“All of Europe will be threatened, we are not going to let that happen,” Biden told journalists during his state visit to France.\nOn Friday, Biden warned of the need to preserve American democracy and drew parallels between World War II and Russia’s invasion of Ukraine.\n“We have shown the world again the power of allies and what we can achieve when we stand together,” said Biden."}, {"id": "572db9a2-aca4-44bb-b6ab-dbaf55a93d2e", "title": "Biden , Macron and Zelensky escalate war threats against Russia at D - Day commemoration", "date": "2024-06-08 04:45", "url": "https://www.wsws.org/en/articles/2024/06/08/aizj-j08.html", "message": "U.S. President Joe Biden shakes hands with Ukrainian President Volodymyr Zelensky in Paris, Friday, June 7, 2024.\n[AP Photo/Evan Vucci]The day after the official commemoration of the 80th anniversary of the Allies’ D-Day landings in Normandy during World War II, Ukrainian President Volodymyr Zelensky met US President Joe Biden and French President Emmanuel Macron for continuing ceremonies in France.\nThese meetings come at a dangerous point in the two-year-old war between NATO and Russia in Ukraine.\nThe invocations of the Normandy landings to justify the NATO war with Russia are political lies based on historical falsifications.\nNevertheless, over the course of yesterday, Biden and Macron announced vast new grants of weapons to the Ukrainian army to escalate the war with Russia."}, {"id": "0d9f420d-d15e-4da8-b44f-fd79f6872bba", "title": "Israeli , Palestinian envoys praise Pope prayer for peace", "date": "2024-06-08 11:15", "url": "https://cruxnow.com/vatican/2024/06/israeli-palestinian-envoys-praise-popes-prayer-for-peace", "message": "ListenROME – Israeli and Palestinian envoys to the Holy See have applauded Pope Francis’s prayer for peace in the Vatican gardens Friday, commemorating a similar event held 10 years ago, with both calling the initiative symbolic and illustrative of the pope’s commitment to ending the Gaza war.\nOn that occasion, Peres and Abbas jointly planted an olive tree in a symbolic gesture of peace.\nIn November, 105 of the hostages were released during a week-long truce, however, around 120 remain unaccounted for, with Israeli officials stating that many are presumed dead.\nHe called for a ceasefire, for the release of Israeli hostages “as soon as possible,” and asked that access to humanitarian aid be guaranteed in Gaza.\nIn this way may peace triumph at last, and may the words ‘division,’ ‘hatred’ and ‘war’ be banished from the heart of every man and woman,” he said."}, {"id": "c9f962c7-a410-4fc7-baef-cd39c6d3d3da", "title": "D - Day veterans seize chance to keep memories alive for others", "date": "2024-06-08 17:00", "url": "https://www.mercurynews.com/2024/06/04/d-day-veterans-seize-chance-to-keep-memories-alive-for-others/", "message": "U.S. President Joe Biden, British Prime Minister Rishi Sunak and Canadian Prime Minister Justin Trudeau, whose countries supplied most of the D-Day forces, will travel to Normandy for the ceremonies, hosted by French President Emmanuel Macron.\nKing Charles III, whose mother and father served during World War II, will attend an event at the British Normandy Memorial.\nIn the U.K., the passing of the World War II generation was highlighted by the death in 2022 of Queen Elizabeth II, who trained as a military mechanic and truck driver during the final months of the war.\nThis is something that, when they think of the Second World War, this is what they picture, I think.”The success of D-Day wasn’t guaranteed.\nBut he was ready when Joey Howlett, 11, asked how to end war."}, {"id": "f030c63f-92ae-4fbc-8984-fe7e0964b0c2", "title": "Kyrylo Budanov highlights foreign volunteer role in Kyiv Oblast liberation", "date": "2024-06-08 17:15", "url": "https://www.yahoo.com/news/kyrylo-budanov-highlights-foreign-volunteers-161500545.html", "message": "Military of the International Legion of the HURInternational Legion fighters played their biggest role during the liberation of Kyiv Oblast, Ukraine’s spy chief Kyrylo Budanov said in the Defense Intelligence (HUR) documentary \"Legions of Light\" released on YouTube on June 8.\nRead also: Ukraine opens National Guard service to foreigners under new decree\"Their greatest role was during the battles for Kyiv Oblast when every soldier counted.\nThe additional forces of foreigners that we formed just in time began their combat journey immediately in Irpin,\" Budanov said.\nRead also: Russians may be preparing provocations in Kherson – Local governorVolunteers from more than 50 countries serve in the International Legion.\nThe International Legion has taken part in battles in all major conflict areas: the defense of Kyiv, and in Kharkiv, Mykolaiv, Kherson, Zaporizhzhia, and Donetsk oblasts, HUR said."}, {"id": "fd90dc75-1879-4469-97af-4419fab70fc7", "title": "Ukraine Joining NATO Would Weaken Biden Reelection Chances", "date": "2024-06-08 14:00", "url": "https://www.businessinsider.com/ukraine-joining-nato-would-weaken-bidens-reelection-chances-2024-6", "message": "Read previewUS President Joe Biden appears to have drawn a line beneath Ukraine's bid for NATO membership.\nHowever, refusing to move forward with an accelerated membership plan leaves Ukraine's hopes for NATO membership in the lurch.\nRelated storiesFor now, Ukraine has to settle for a range of \"security guarantees.\"\nMeister said these packages will provide Ukraine with \"more reliable long-term military and security support by NATO member states.\"\n\"Without NATO membership for Ukraine, security guarantees for Ukraine are blatant lies,\" Canadian analyst Michael MacKay wrote on X."}, {"id": "30326363-bbc3-4078-a82b-ec302e5b849e", "title": "The Crusader - Era Knights Who Volunteered to Fight World War I", "date": "2024-06-08 14:15", "url": "https://www.military.com/history/crusader-era-knights-who-volunteered-fight-world-war-i.html", "message": "Less than a year after the Russian Empire entered World War I, a band of Georgian men came down from the Caucasus Mountains.\nAt the onset of World War I, the Russian Empire was massive.\nAn estimated 200,000 Georgians were mobilized to fight in World War I in the Russian Army.\nArmor was a common sight on the battlefields of World War I. Broadswords weren't so much.\n(Metropolitan Museum of Art) Armor was a common sight on the battlefields of World War I. Broadswords weren't so much."}, {"id": "2808e755-0aaa-4acf-9ba2-c84ddc2fdef2", "title": "Putin Calls  Bulls ** t  On  Plan To Attack NATO , Says He Not Brandishing Nuclear Arms", "date": "2024-06-08 14:00", "url": "https://www.zerohedge.com/geopolitical/putin-calls-bullst-plans-attack-nato-says-hes-not-brandishing-nuclear-arms", "message": "Officials in the UK, Germany, and France have of late signaled to their populations that Europe must be 'war ready' and on a war footing.\nSome have even claimed that Russia is readying to attack NATO countries and that it seeks to expand the conflict beyond Ukraine.\nThere’s nothing to these scary stories, intended for the townsfolk in Germany and France and elsewhere in Europe,\" Putin explained.\nHe explained that nothing has changed in Russia's nuclear doctrine, saying that nuclear weapons usage is only possible in \"exceptional cases\".\nThe only country on Earth to ever use nuclear weapons is the United States."}, {"id": "1135baa6-8f41-484d-89e7-747bec35ed43", "title": "Media : Tension on Polish - Belarusian border grows as new migrants arrive", "date": "2024-06-08 16:45", "url": "https://news.am/eng/news/827993.html", "message": "Memorandum was signed with Russian-Armenian UniversityZakharova: Anti-Russian, anti-Azerbaijani, anti-Iranian goals of EU mission in Armenia are becoming obviousArmenia PM receives Shanghai Cooperation Organization Secretary GeneralWas there change in Tavush Province military positions?\nArmenia deputy defense minister does not give clear answerArmenia parliament committee approves technico-military collaboration agreement with GreeceMFA: We consider Azerbaijan’s attempts as gross intervention into Armenia’s internal affairsVolvo to issue world's first electric vehicle battery passportLeakage from 3 liquefied gas, 1 diesel, 1 gasoline tanks causes explosion, fire at Yerevan-Sevan motorway gas stationCriminal case opened into explosion at Yerevan-Sevan motorway gas stationYerevan-Sevan motorway reopenedYerevan-Sevan motorway gas station where explosion occurred is operated without expertiseArmenia Rescue Service: Leakage from all reservoirs at Yerevan-Sevan motorway explosion site stoppedArmenia interior ministry: No open fire at Yerevan-Sevan motorway explosion area as of 8:20amNewspaper: How much compensation will Armenia government provide to Kirants village residents?\nIdentities of 7 injured in Yerevan-Sevan motorway explosion are determined7 injured in explosion at Yerevan-Sevan motorway gas station, 2 in critical condition.\nRare 1957 Mercedes-Benz 300 SL Roadster offered for €1,595,000PM staff: Border delimitation was not imposed on Armenia but Azerbaijan insisted on returning of 4 villagesNational Dialogue on Tax Justice, Improved Compliance, and a Renewed Social Contract for the SDGsDollar, euro rise in ArmeniaTourist visits to Armenia up by 40% in 2023 compared to 2022Armenia diplomat: Russia withdrawal from South Caucasus will create significant threats for itArchbishop Bagrat Galstanyan holding rally in Armenia’s Sotk villageSwitzerland MFA comments on Armenia flood relief efforts in ArmeniaAmio Era.\nMemorandum was signed with the Armenian State Pedagogical University after K. AbovyanLithuania to earmark €100,000 for restoration of Armenia flood-affected areasEU European External Action Service official visits Armenia’s Yeraskh village, Yeghegnadzor cityThere is epidemic risk in Armenia flood disaster zone, territorial administration minister saysArmenia defense minister has short talk with Bulgaria president (PHOTOS)EU aid to Armenia is possible on condition of aid to Azerbaijan as well, Hungary FM says"}, {"id": "8c77e413-a526-4763-ad33-8c6ba1f65666", "title": "Black D - Day Combat Medic Long - Denied Medal Tenderly Laid on Omaha Beach Where He Bled , Saved Lives", "date": "2024-06-08 17:15", "url": "https://www.military.com/daily-news/2024/06/08/black-d-day-combat-medics-long-denied-medal-tenderly-laid-omaha-beach-where-he-bled-saved-lives.html", "message": "OMAHA BEACH, France (AP) — A medal richly deserved but long denied to an African American combat medic wounded on Omaha Beach in the D-Day landings was tenderly laid Friday on the hallowed sands where he saved lives and shed blood.\nU.S. First Army soldiers held a ceremony in honor of Cpl.\n“We want to be able to say that this medal came from Omaha Beach and was at the site of Woodson’s actions,” Braafladt said.\nAlthough 1.2 million Black Americans served in the military during World War II, none was among the original recipients of the Medal of Honor awarded in the conflict.\nUltimately, seven Black World War II troops were awarded the Medal of Honor in 1997."}, {"id": "39c20c66-6e4e-4d78-be60-5a0efacdaee3", "title": "Black D - Day combat medic long - denied medal tenderly laid on Omaha Beach where he bled , saved lives", "date": "2024-06-08 04:15", "url": "https://www.clickondetroit.com/news/national/2024/06/07/black-d-day-combat-medics-long-denied-medal-tenderly-laid-on-omaha-beach-where-he-bled-saved-lives/", "message": "The medal was awarded posthumously to Woodson this month — just ahead of the 80th anniversary of D-Day — following years of lobbying for more recognition of his achievement on that fateful day.\nThe soldiers all saluted, still and quiet under blue skies, when U.S. First Army Command Sgt.\nKevin Braafladt explained to the soldiers that the next step would be the medal’s presentation to Woodson’s widow, 95-year-old Joann.\n“We want to be able to say that this medal came from Omaha Beach and was at the site of Woodson’s actions,” Braafladt said.\nUltimately, seven Black World War II troops were awarded the Medal of Honor in 1997."}, {"id": "20fcb3ee-4a13-4cdf-bef3-7649ab25f958", "title": "101st Birthday Party | News , Sports , Jobs - The Intermountain", "date": "2024-06-08 12:15", "url": "https://www.theintermountain.com/news/local-news/2024/06/101st-birthday-party/", "message": "DAILEY — Randolph County resident Juanita Morgan, a former Rosie the Riveter, recently celebrated her 101st birthday at a family member’s home in Dailey.\nThe three members from Our Town dressed in full Rosie attire to help celebrate the special occasion.\n“We had a wonderful time visiting Juanita and her family in Dailey,” Trimboli told The Inter-Mountain.\nMorgan worked alongside her sister and future sister-in-law at the facility, where she was a riveter on B-29 airplanes.\nBoth sons attended the 101st birthday party with their wives and Morgan’s five grandchildren and three great grandchildren."}, {"id": "36eaa2ab-138f-4cd9-905d-081fac4ec196", "title": "Zelenskyy welcomes French promises of warplanes to help fight Russia", "date": "2024-06-08 00:30", "url": "https://www.foxnews.com/world/zelenskyy-welcomes-french-promises-warplanes-help-fight-russia", "message": "Ukrainian President Volodomyr Zelenskiy said on Friday he hoped to see French-supplied warplanes in Ukrainian skies soon after President Emmanuel Macron said France planned to provide it Mirage 2000-5 fighter jets.\nFRENCH WARPLANES AND TRAININGThe Mirage 2000-5 is a multi-role, single-engine jet fighter.\nNo, because we have no right to lose,\" Zelenskiy told the lawmakers.\nCLICK HERE TO GET THE FOX NEWS APPUkraine's military leaders admit that the battlefield situation on the eastern front has deteriorated.\nTwo years of war have sapped Ukraine's ammunition and manpower and a failed counter-offensive last year sank morale."}, {"id": "5bb9ba8f-b7d3-423c-855c-2613bd2f5b2e", "title": "Villagers dress up for 17th century market", "date": "2024-06-08 16:45", "url": "https://www.oxfordmail.co.uk/news/24372851.villagers-dress-17th-century-market-1980s/", "message": "Paul and Nicola Ellis are pictured with their daughter Chloe, three, in their 16th century outfits at Blewbury, near Didcot, in 1985.\nThe market had plenty of stalls with a range of goods and other attractions, including an ox roast and Morris dancing.\nREAD MORE:The following day, Roundheads and Cavaliers gathered for a skirmish organised by the English Civil War Society.\nAlthough the village did not take part in the Civil War, the opposing groups are reputed to have stopped in Blewbury on their way to Newbury, where they fought the Battle of Donnington.\nHis Trade and Tourism newsletter is released every Saturday morning."}, {"id": "b35d44ac-251e-4e3c-a42b-4042d3bf429c", "title": "A bottle of blood serum from the 1940s gives researchers hope to save lives on battlefields of the 2020s", "date": "2024-06-08 12:00", "url": "https://www.theglobeandmail.com/canada/article-a-bottle-of-blood-serum-from-the-1940s-gives-researchers-hope-to-save/", "message": "What remains is blood serum, a yellowish fluid containing additional proteins, such as albumin and other beneficial constituents.\nIn addition, freeze-dried blood plasma, now regarded as preferable to blood serum, can be purchased from international suppliers should the need arise.\nBeyond the military, a made-in-Canada freeze-dried blood product could also be useful for emergency responders serving remote areas across the country, he added.\nWithin the display, he could see what appeared to be a bottle of the original 1940s-era blood product.\nThey also prepared fresh blood serum from the pooled, donated blood of 10 people to act as a control."}, {"id": "d682842a-710d-4c27-80f9-573a1e0f0539", "title": "From crusaders to bankers", "date": "2024-06-08 08:15", "url": "https://tribune.com.pk/story/2470336/from-crusaders-to-bankers", "message": "The Middle Ages have provided the history enthusiasts with a story that can hardly be rivaled — the story of the Knights Templar.\nThe history of the Knights Templar can be traced back to the early half of the twelfth century, following the sack of Jerusalem in 1099.\nThey also provided banking to fellow crusaders and travellers to protect their money and wealth and facilitate the transfer of capital.\nThe Order of the Knights Templar became extremely wealthy and powerful, as they were granted the responsibility of protecting the holy land.\nHowever, the growth of the Knights Templar was going to be sure to bring out the resistance of other religious orders and kings."}, {"id": "2b6c7655-3283-4fab-90dc-1b0c1aa5a79d", "title": "Deadly landmines pose hidden threat in Libyan capital", "date": "2024-06-08 01:00", "url": "https://www.citizen.co.za/news/news-world/deadly-landmines-hidden-threat-libya/", "message": "Deadly landmines pose hidden threat in Libyan capitalThe southern suburbs, where three children were injured, have been the 'scene of all wars since 2011 until today'.\nHundreds of deadly landmines and unexploded ordanance still litter parts of Libya after years of fighting, posing a constant danger to civilians, especially children, long after the conflict.\n(Photo by Mahmud TURKIA / AFP)Hundreds of deadly landmines and unexploded ordnance still litter parts of Libya after years of fighting, posing a constant danger to civilians, especially children, long after the conflict.\nThe southern suburbs, where the three children were injured, have been the “scene of all wars since 2011 until today”, said Farhat.\nBut it will come too late for Farhat’s son Mohamed, who was wounded in the head by shrapnel from the blast."}, {"id": "8ab88cbb-df0c-472f-9456-d23e21767e2e", "title": "Top 11 trailers you need to see from Summer Game Fest 2024", "date": "2024-06-08 16:45", "url": "https://www.tomsguide.com/gaming/top-11-trailers-you-need-to-see-from-summer-game-fest-2024", "message": "Geoff Keighley's E3-replacement Summer Game Fest kicked off its latest iteration today.\nThe video game trailer showcase featured over 50 games or gaming adjacent trailers over two hours of advertising.\n11 Best Games at Summer Game Fest 2024LEGO Horizon AdventuresThere was an inkling that a LEGO version of Guerilla Game's Aloy was coming, but it was still a delightful surprise to see the game open the Summer Game Fest show.\nAt Summer Game Fest they showed off six games.\nEverything Featured at Summer Game Fest 2024More from Tom's Guide"}, {"id": "a186e2ed-d719-4ac8-9b15-7823f1554085", "title": "The door is staying shut on Ukraine joining NATO because it would weaken Biden chances of getting reelected", "date": "2024-06-08 14:15", "url": "https://www.yahoo.com/news/door-staying-shut-ukraine-joining-130419079.html", "message": "The door is staying shut on Ukraine joining NATO because it would weaken Biden's chances of getting reelectedThe door is staying shut on Ukraine joining NATO because it would weaken Biden's chances of getting reelectedBiden has rejected Ukraine's NATO membership bid as part of a peace agreement.\nUS President Joe Biden appears to have drawn a line beneath Ukraine's bid for NATO membership.\nEarlier this week, a report by the Financial Times revealed that Ukraine's lack of progress toward NATO membership was a key issue creating tension in US-Ukrainian relations.\nHowever, refusing to move forward with an accelerated membership plan leaves Ukraine's hopes for NATO membership in the lurch.\n\"Without NATO membership for Ukraine, security guarantees for Ukraine are blatant lies,\" Canadian analyst Michael MacKay wrote on X."}, {"id": "c57898fb-90b9-4048-b674-72311d30b580", "title": "Taiwan needs weapons and training now , not 2027 or 2030 | The Highland County Press", "date": "2024-06-08 14:45", "url": "https://highlandcountypress.com/opinions/taiwan-needs-weapons-and-training-now-not-2027-or-2030", "message": "By Matt QuanReal Clear WireTaiwan needs weapons and training now, not in 2027, 2030, or a disingenuous timeline.\nThe Navy and Air Force needs to fund combat drones to just meet attrition.\nAdditionally, Taiwan needs to join the State Partnership Program, where countries are partnered with states and the National Guard for regular exchanges and relationships.\nThis needs to happen before 2027, not after, as demonstrated by the late training in Ukraine just to meet attrition.\nMatt Quan is a U.S. Air Force veteran and was previously assigned to the Secretary of the Air Force, International Affairs at the Pentagon."}, {"id": "ea0e5a42-5190-4931-9d17-60d3e859f874", "title": "Weeks of planning and quality intelligence : inside the IDF daring Gaza hostage resc", "date": "2024-06-08 15:15", "url": "https://www.ynetnews.com/article/ryqrh6zba", "message": "A Yamam fighter was severely injured in the fighting and was transported to the hospital for life-saving care.\nThe safe return of the four hostages to Israel was announced on Saturday amid reports of heavy fighting in the Nuseirat refugee camp in central Gaza.\nThe IDF issued an unusual announcement late in the morning, stating that its forces were engaged in intense combat there.\nIn the weeks leading up to the extraction, the Yamam anti-terror unit had examined several models for the operation.\nDuring the battle, they were supported by IDF forces on the ground, in the air and at sea."}, {"id": "60798ad6-2f94-40b4-bd2f-e1958fa2dab3", "title": "Israeli operation rescues 4 hostages from Gaza , including Noa Argamani", "date": "2024-06-08 16:15", "url": "https://forward.com/fast-forward/620836/israeli-operation-rescues-4-hostages-from-gaza-including-noa-argamani/", "message": "By Ron Kampeas June 8, 2024Israeli forces rescued four hostages held since Oct. 7 in the central Gaza Strip, including Noa Argamani, the festival goer who was filmed as she was carried away by terrorists on a motorcycle.\nAll four were attending the Nova music festival on Oct. 7, when Hamas terrorists killed 1,200 people and abducted more than 250, launching the war.\nChief Inspector Arnon Zamora, a commander of the operation, was killed in the battle.\nArgamani appeared in video posted on various sites after the attack screaming as terrorists spirited her away on a motorcycle.\nShe became a symbol of the carnage, especially the 364 people the terrorists killed as they fled the music festival."}, {"id": "021e95d4-9481-4b3b-95ae-57c7d7e19c8d", "title": "Donald Trump says media scrutiny affecting son Barron", "date": "2024-06-08 08:00", "url": "https://www.thenews.com.pk/latest/1198197-donald-trump-says-media-scrutiny-affecting-son-barron", "message": "— Reuters/FileFormer United States president Donald Trump said his hush-money trial and the media scrutiny are affecting his 18-year-old son, Yahoo reported.\nEarlier in an interview with Fox, talking about his family, Trump said: \"I think in many ways it's tougher on my family than it is on me.\"\nTrump, who is the Republican presidential nominee, stated before the election that he feels his family wants him to take on the challenge.\nThe ex-president said that he believes his family wants him to fight the battle.\nMy family loves this country, and I think they feel I do a good job,\" said Trump."}, {"id": "ecc20bea-8d18-46e9-adea-44c0a32e1fcd", "title": "This Tank Weighs Just Over 8 Tons : The Lightest Tanks in Today Militaries", "date": "2024-06-08 06:15", "url": "https://biztoc.com/x/fc3508b21538e190", "message": "Modern tanks are frightening machines, capable of dominating a battlefield.\nSince their invention, these armored combat vehicles have been used in various ways, from breaking up enemy lines to making it easier to drop allies into the middle of battle.\nWhile heavy tanks are intimidating and full of fighting power, there are lighter versions that serve a slightly different…This story appeared on 247wallst.com , ."}, {"id": "aaee6ac4-576d-41f7-94e2-68f2a983c8ab", "title": "Biden to meet Macron after D - Day democracy warnings", "date": "2024-06-08 02:15", "url": "https://www.yahoo.com/news/biden-meet-macron-d-day-014913186.html", "message": "French President Emmanuel Macron welcomed Joe Biden at Paris' Arc de Triomphe at the start of the US leader's state visit to France on Saturday as the two nations seek to tighten ties.\nBiden has been in France since Wednesday and took part in this week's commemorations marking the 80th anniversary of the D-Day landings that changed the course of World War II.\nDuring a welcome ceremony in Paris, Macron and Biden laid a wreath and rekindled the flame on the tomb of the Unknown Soldier.\nMeeting Zelensky in Paris, Biden pledged his support for Ukraine and announced another $225 million in aid to Kyiv.\nZelensky thanked him for the \"tremendous support\", comparing it to the United States coming to Europe's aid during World War II."}, {"id": "b2950622-465d-42b5-99a5-81f55c96f481", "title": "Myths and Political Realities of the  Migration Wars  ", "date": "2024-06-08 15:00", "url": "https://www.realclearworld.com/articles/2024/06/08/myths_and_political_realities_of_the_migration_wars_1036860.html", "message": "A deeper assessment of international migratory flows reveals a complex dual reality that entails not just some utilitarian benefits, but also potentially dangerous implications which transcend the orbit of crimes like human trafficking.\nJust like with other linchpins of complex interdependence —including energy, trade, finance, money, currencies, infrastructure, information, cyberspace and digital platforms— the control of migratory flows can be manipulated, contested, co-opted or even weaponized.\nThe contemporary understanding of migratory flows needs to be recalibrated through the lens of statecraft, security, intelligence, foreign policy, and strategic foresight.\nAlthough the attempted breach masterminded by Belarus ultimately failed, its impact highlighted meaningful diplomatic, political, strategic, tactical, and operational challenges.\nConclusionsFor statecraft and national security, the pivotal phenomenon of mass migratory flows requires a pragmatic approach based on the prism of high politics."}, {"id": "56a91883-e77c-4e88-99cf-33021336ce1f", "title": "A World War II veteran just married his bride near Normandy D - Day beaches . He 100 , she 96", "date": "2024-06-08 13:15", "url": "https://www.newsday.com/news/nation/dday-anniversary-war-wedding-normandy-terens-swerlin-a08414", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he’s 100, she’s a youngster of just 96 — made their nuptials an almost double-century celebration.\nWorld War II veteran Harold Terens, 100, right, and Jeanne Swerlin, 96, pose for a photo, Thursday, Feb. 29, 2024, in Boca Raton, Fla.\nWorld War II veteran Harold Terens, 100, right, and Jeanne Swerlin, 96, pose for a photo, Thursday, Feb. 29, 2024, in Boca Raton, Fla.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle."}, {"id": "d06e1747-fdce-4965-a7b1-1ed2b1f86762", "title": "Felixstowe author : the 6 stars you never knew served in WWII", "date": "2024-06-08 11:15", "url": "https://www.eadt.co.uk/news/24371051.felixstowe-author-6-stars-never-knew-served-wwii/", "message": "Mr Tancred tasted success in successive Commonwealth Games, winning a bronze medal at the 1970 tournament and then silver medal in 1974.\nA young Bill Tancred pictured centre, with Sebastian Coe, now Lord Coe, to his right.\n(Image: Bill Tancred) Bill Tancred being made an MBE by the later Elizabeth II in 1992.\nAfter nine months of research, Mr Tancred is now ready to share the stories of almost 100 stars who served their country in some way.\nTo buy a copy of Mr Tancred’s book, visit Stillwater Books in Hamilton Road, Felixstowe, or email Mr Tancred at: billtancred@gmail.com"}, {"id": "6fe70190-6d04-49b4-987c-d55261d6c3dc", "title": "Switch eShop charts - June 8 , 2024", "date": "2024-06-08 09:00", "url": "https://nintendoeverything.com/switch-eshop-charts-june-8-2024/", "message": "This week’s Switch eShop charts are as follows:All Games1.\nLittle Kitty, Big City5.\nSuper Mario Bros. Wonder10.\nMario Party Superstars13.\nLittle Kitty, Big City3."}, {"id": "8be6077a-9387-4e2e-9a75-f473352b3331", "title": "Third of Britain soldiers not fit enough to fight Putin army on the battlefield | Politics | News", "date": "2024-06-08 19:30", "url": "https://www.express.co.uk/news/politics/1908904/british-army-fitness-levels", "message": "British soldiers are graded on a traffic light system for fitnessBritain's traffic light system which grades the fitness of soldiers is flashing red.\nFewer than seven out of 10 soldiers were given green or amber grades last year.\nJust 68 per cent of regular and reserve soldiers achieved green or amber grades.\nThese come amid high concern about Britain’s ability to fight a major war.\nPersonnel are marked as amber on the system if the individual needs to take another assessment in the next two months.”"}, {"id": "a2776944-7be4-42d3-9783-204eb4f4d130", "title": "Putin Was  Sent By God  To Save Humanity , Says Russian Professor", "date": "2024-06-08 19:30", "url": "https://radaronline.com/p/vladimir-putin-sent-by-god-save-humanity-world-war-professor-doomsday/", "message": "Professor Sergei Karaganov, the new right-hand man to Vladimir Putin, has made alarming statements, claiming the Russian dictator is \"God's child\" sent to save humanity.\nKaraganov went as far as to compare Putin to Russia's most famous emperor, Peter the Great.\nThese declarations come amidst escalating tensions in the Ukraine conflict, where a record number of Russian soldiers are facing casualties daily."}, {"id": "c8e2111b-00ad-4635-b873-565141df47e2", "title": "  You cant fight your way to peace : from a 20 - year - old Israeli to a 99 - year - old Briton , eight conscientious objectors on why they refused to serve in the army | Ethics", "date": "2024-06-08 07:45", "url": "https://www.theguardian.com/world/article/2024/jun/08/you-cant-fight-your-way-to-peace-from-a-20-year-old-israeli-to-a-99-year-old-briton-eight-conscientious-objectors-on-why-they-refused-to-serve-in-the-army", "message": "I went to university to defer military service, then decided to refuse it.\nI had been raised to believe that military service wasn’t only an obligation, but my duty.\nThis man was placed in military prison – I went to visit him every week and we became close friends.\nOn 5 April, I went to the military conscription centre in Samut Prakan province.\nI spent a week in military prison: my cell had no bed, so I slept on my jacket."}, {"id": "afc6f1b0-0c44-4db8-8483-535f52430a48", "title": "  You cant fight your way to peace : from a 20 - year - old Israeli to a 99 - year - old Briton , eight conscientious objectors on why they refused to serve in the army", "date": "2024-06-08 08:00", "url": "https://www.aol.co.uk/news/t-fight-way-peace-20-070040266.html", "message": "I went to university to defer military service, then decided to refuse it.\nI had been raised to believe that military service wasn’t only an obligation, but my duty.\nThis man was placed in military prison – I went to visit him every week and we became close friends.\nOn 5 April, I went to the military conscription centre in Samut Prakan province.\nI spent a week in military prison: my cell had no bed, so I slept on my jacket."}, {"id": "0e91d4e6-e570-45f2-9564-71430036b34d", "title": "Putin  sent by God to save humans from WW3 , dictator crony claims in chilling rant", "date": "2024-06-08 13:45", "url": "https://www.dailystar.co.uk/news/world-news/putin-sent-god-save-humans-32987684", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\nNot only to win but also to save the world which is sliding and being pushed into a World War.\"\nIn attempts to get the Russian people to stay loyal to Putin, minion Patriarch Kirill went on TV and preached: \"Let God save the Russian soil."}, {"id": "d1584f48-2bca-4431-b4d0-9512d9a8bdcf", "title": "The End Of BLHeli _ 32 : Long Live AM32 ? ", "date": "2024-06-08 09:00", "url": "https://hackaday.com/2024/06/07/the-end-of-blheli_32-long-live-am32/", "message": "As the ESC determines a lot of the performance characteristics of a drone, it has its own firmware, which for (FPV) drones is overwhelmingly BLHeli, specifically the 32-bit version (BLHeli_32).\nNow the Norwegian company (BLHeli AS) behind this closed source firmware has thrown in the towel, citing illegal use of its firmware by sanctioned countries like Russia for purposes like warfare.\nSo far the GitHub repository is still online, featuring binary images for BLHeli_32, as well as the open source BLHeli (8-bit Atmel/Silabs) firmware and BLHeli_S (multirotor 8-bit Silabs) firmware.\nDue to the open source nature of these earlier projects forks already exist, such as BlueJay for BLHeli_S, and with the AM32 project there is an open source 32-bit ESC alternative.\nFor 8-bit platforms it would thus seem that even with BLHeli_32 vanishing there is no impact at all, while for 32-bit platforms AM32 seems to be largely a drop-in solution."}, {"id": "a67945c0-1649-45ca-9fbc-435bab4be8dd", "title": "RUTO calls for urgent crisis meeting to save his government from total collapse after his fallout with GACHAGUA and the Kenya Kwanza turmoil", "date": "2024-06-08 17:00", "url": "https://www.kenyan-post.com/2024/06/ruto-calls-for-urgent-crisis-meeting-to.html", "message": "Saturday, June 8, 2024 - President William Ruto has summoned an urgent crisis meeting of all members of his Kenya Kwanza coalition on Monday to address the escalating political turbulence within the ruling party.\nThe move comes amid increasing internal strife and a brewing power struggle with his Deputy, Rigathi Gachagua.\nThe crisis talks follow another crisis meeting he convened today with the UDA’s National Executive Council (NEC).\nThis urgent NEC meeting aims to tackle the escalating rift between the President and his deputy, Gachagua, amid contentious grassroots election issues and a deeply polarising Finance Bill 2024.\nAdding to the turmoil is the simmering Cold War between President Ruto and Deputy President Gachagua."}, {"id": "0ce75faa-d1c7-42f0-8bb2-c57e87ad24b5", "title": "India to Rename Tibetan Locations in Retaliation for Arunachal Pradesh Dispute – Indian Defence Research Wing", "date": "2024-06-08 13:00", "url": "https://idrw.org/india-renames-tibetan-locations-in-retaliation-for-arunachal-pradesh-dispute/", "message": "India to Rename Tibetan Locations in Retaliation for Arunachal Pradesh Dispute| BySOURCE: AFIIn a tit-for-tat move, India is set to rename over two dozen locations within China’s Tibet Autonomous Region.\nThis action comes in response to China’s recent renaming of places in India’s Arunachal Pradesh state.\nIndia suspects China’s renaming of locations in Arunachal Pradesh is a deliberate attempt to solidify its territorial claim on the region, which China refers to as Zangnan or “southern Tibet.”The Indian Army’s information warfare division is spearheading this effort.\nThe renaming strategy highlights the escalating tensions between India and China over disputed border territories.\nWhile the effectiveness of this approach remains to be seen, it signifies a rising assertiveness from India in its response to China’s actions."}, {"id": "5573ced6-c16f-4616-a3c7-7b21f4bc29a5", "title": "The Verdict", "date": "2024-06-08 01:45", "url": "https://www.independent.com/2024/06/07/the-verdict/", "message": "For a few on January 6, 2021, it was trauma and death, Donald Trump’s first open assault on the Republic.\nHe will debase and tear apart any cornerstone or guidepost of this nation to regain his access to power.\nDid the Republicans, in 2020, follow the Constitution and the law, excepting without malice the election results?\nOr did they attack the law, incited by the criminal deceit of Donald Trump, as he’s doing today?\nAny person, public voice, entity, or institution opposing or speaking out against Donald Trump will be hounded and persecuted and punished."}, {"id": "1e5ede20-7d63-4a2e-ad1b-ab6d318e4b6e", "title": "Macron welcomes Biden at Arc de Triomphe at start of state visit", "date": "2024-06-08 16:30", "url": "https://www.breitbart.com/news/biden-to-meet-macron-after-d-day-democracy-warnings/", "message": "President Joe Biden on Saturday vowed Washington was “standing strong” with Ukraine as French counterpart Emmanuel Macron hosted him on a state visit overshadowed by Kyiv’s fight against Russia’s invasion and the looming US election.\n“Putin is not going to stop at Ukraine,” Biden said alongside Macron after talks at the Elysee Palace.\n“The United States is standing strong with Ukraine.\n‘We got it done’Macron, 46, emphasised unity with the United States under Biden and expressed gratitude for his counterpart’s approach to Europe.\n“It gives me hope to know France and the United States stand together.”"}, {"id": "4a926f04-d6a6-4e92-bef7-1745d7dbbe46", "title": "Glen Ridge pays tribute to the fallen", "date": "2024-06-08 13:15", "url": "https://essexnewsdaily.com/arts/glen-ridge-pays-tribute-to-the-fallen", "message": "Glen Ridge held its annual Memorial Day parade Monday, May 27.\nThe flag on the Ridgewood Avenue School grounds was raised to half-staff and the steadfast Sharon DeRosa Smolen sang an evocative national anthem.\nHe was followed by a selection played by the Glen Ridge High School Band, bronze medalists in the 2023 national championships.\nA reading of the names of borough residents who died in combat were read and wreaths were placed.\nOh, Lord,” he said, “the names we heard were of people who tried to fix a broken world."}, {"id": "6558b2a0-0e6b-48cf-97f1-07a9db201ec0", "title": "Why Did the Taliban Sirajuddin Haqqani Visit the UAE ? – The Diplomat", "date": "2024-06-08 18:00", "url": "https://thediplomat.com/2024/06/why-did-the-talibans-sirajuddin-haqqani-visit-the-uae/", "message": "As Afghanistan navigates a delicate transition period following the Taliban’s takeover, Haqqani’s diplomatic foray into the UAE underscores the complex interplay of actors and interests shaping the nation’s future.\nThe unexpected interaction between a high-ranking Taliban official and the UAE leader fueled discussions regarding the evolving dynamics in the region.\nHe inherited the mantle of leadership from his father, Jalaluddin Haqqani, a prominent figure in the anti-Soviet resistance who established the formidable Haqqani Network.\nIn the article, titled “What We, the Taliban, Want,” Haqqani expressed his fatigue with the ongoing conflict in Afghanistan.\nGiven the regional contest for influence between Qatar and the UAE, particularly in their quest for greater political sway, Haqqani’s visit to the UAE is intriguing on multiple levels."}, {"id": "765153f1-193c-4d58-a71b-fc8007735da1", "title": "Hyper Light Breaker Releases in Early Access in Late Summer for PC", "date": "2024-06-08 01:45", "url": "https://www.vgchartz.com/article/461331/ublisher-arc-games-and-developer-heart-machin/", "message": "Hyper Light Breaker Releases in Early Access in Late Summer for PC - News/ 583 Viewsby, posted 20 hours agoPublisher Arc Games and developer Heart Machine announced the roguelite action game, Hyper Light Breaker, will launch in Early Access for PC via Steam in late Summer 2024.\n\"We’re thrilled to be a part of Summer Game Fest and reveal to millions of people around the world that Hyper Light Breaker will be releasing in Early Access later this summer,\" said Heart Machine founder and creative director Alx Preston.\nView the Summer Game Fest trailer below:Read details on the game below:From Heart Machine, the award-winning team behind critically-acclaimed titles Hyper Light Drifter and Solar Ash, comes Hyper Light Breaker, a new cooperative roguelite adventure set in the beloved Hyper Light Drifter universe.\nHyper Light Breaker is a brand-new entry in the Hyper Light franchise, with a unique story fully realized in 3D for the first time.\nSet decades prior to Drifter, Hyper Light Breaker has you take on the role of a Breaker, a mercenary tasked with entering the Overgrowth."}, {"id": "8d8d19b1-dde1-40e0-9a66-abd451e7f4e9", "title": "Hyper Light Breaker Releases in Early Access in Late Summer for PC", "date": "2024-06-08 04:45", "url": "https://www.vgchartz.com/article/461331/hyper-light-breaker-releases-in-early-access-in-late-summer-for-pc/", "message": "Hyper Light Breaker Releases in Early Access in Late Summer for PC - News/ 585 Viewsby, posted 20 hours agoPublisher Arc Games and developer Heart Machine announced the roguelite action game, Hyper Light Breaker, will launch in Early Access for PC via Steam in late Summer 2024.\n\"We’re thrilled to be a part of Summer Game Fest and reveal to millions of people around the world that Hyper Light Breaker will be releasing in Early Access later this summer,\" said Heart Machine founder and creative director Alx Preston.\nView the Summer Game Fest trailer below:Read details on the game below:From Heart Machine, the award-winning team behind critically-acclaimed titles Hyper Light Drifter and Solar Ash, comes Hyper Light Breaker, a new cooperative roguelite adventure set in the beloved Hyper Light Drifter universe.\nHyper Light Breaker is a brand-new entry in the Hyper Light franchise, with a unique story fully realized in 3D for the first time.\nSet decades prior to Drifter, Hyper Light Breaker has you take on the role of a Breaker, a mercenary tasked with entering the Overgrowth."}, {"id": "041b8e8e-7b5d-4883-a406-35988b4988a3", "title": "Syrian rebels sent to Africa to guard mines and businesses", "date": "2024-06-08 09:45", "url": "https://www.middleeasteye.net/news/syrian-rebels-deployed-africa-guard-mines-and-businesses-islamic-state", "message": "Syrian rebels have been hired to fight and provide security at gold mines and factories in African countries, several rebel sources told Middle East Eye this week.\nTurkey to send Syrian rebel fighters to battle Haftar in Libya Read More »The rebels gave conflicting accounts of how many SNA factions were involved and how many fighters were deployed.\nHowever, they confirmed that at least five SNA groups have directed their fighters and some commanders to the three African countries.\n“Commanders who gain power and money from missions abroad have moved away from the revolution and established their small empires,” he told MEE.\n“The missions outside Syria weaken the political representation of the Syrian opposition as well as its legitimacy in the public eye.”"}, {"id": "9117b0da-2739-4908-b255-edb38c3b17fa", "title": "WWII Vet , 100 , Marries Near D - Day Beaches", "date": "2024-06-08 18:00", "url": "https://www.newsmax.com/world/globaltalk/d-day-anniversary-war/2024/06/08/id/1167955/", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he's 100, she's a youngster of just 96 — made their nuptials an almost double-century celebration.\nOn her way into the nuptials, the bubbly bride-to-be said: \"It's not just for young people, love, you know?\nThe WWII veteran first visited France as a 20-year-old U.S. Army Air Forces corporal shortly after D-Day.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle."}, {"id": "e9367a64-6ea1-4c46-b498-29915f05e1a0", "title": "Pro - Hamas Supporters Sulk Over Rescue - Israel Shows It Knows What It Is Doing", "date": "2024-06-08 17:15", "url": "https://redstate.com/margaret-clark/2024/06/08/pro-hamas-supporters-sulking-over-rescue-israel-knows-what-it-is-doing-n2175205", "message": "AdvertisementRead More: HUGE: Israel Rescues Hostages Despite Biden Insistence They Leave Gaza (VIDEO INCLUDED)Not all are celebrating, though.\nAdvertisementThe 4 hostages rescued today were held in civilian homes, in a residential neighborhood, within a crowded market.\nThis rescue operation shows that Israel knows what it is doing and we should support them.\nIf President Biden had his way, Israel would have cowered back and continued on with the back-and-forth conflict that has spread over decades.\nEither it's a lack of foresight, cowardice, or apathy but the foreign policy Biden has shown is weak and foolish."}, {"id": "84c9a487-093c-4f4f-bfeb-90211d6d7709", "title": "GRSE Ventures into Autonomous Platforms Across Surface , Subsurface , and Aerial Domains – Indian Defence Research Wing", "date": "2024-06-08 03:45", "url": "https://idrw.org/grse-ventures-into-autonomous-platforms-across-surface-subsurface-and-aerial-domains/", "message": "GRSE Ventures into Autonomous Platforms Across Surface, Subsurface, and Aerial Domains| BySOURCE: AFIGarden Reach Shipbuilders & Engineers Limited (GRSE), a leading Indian shipbuilding company, has announced significant advancements in the development of autonomous platforms across all three domains of operation: surface, subsurface, and aerial.\nGRSE’s foray into autonomous technology has already yielded promising results in the surface and subsurface domains.\nOne of the standout achievements in the surface domain is the successful prototype of an autonomous surface vessel.\nThese aerial platforms will further augment the operational capabilities of the Indian Armed Forces, providing crucial support in maritime surveillance and reconnaissance missions.\nGRSE recognizes the transformative potential of autonomous platforms in modern warfare."}, {"id": "0518cf37-c71a-47d6-ab3a-0ec6ce49ab2b", "title": "A World War II veteran just married his bride near Normandy D - Day beaches – NBC New York", "date": "2024-06-08 18:15", "url": "https://www.nbcnewyork.com/news/national-international/world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches/5489404/", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he’s 100, she’s a youngster of just 96 — made their nuptials an almost double-century celebration.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nTerens himself went to France 12 days later, helping transport freshly captured Germans and just-freed American POWs to England.\nFollowing the Nazi surrender in May 1945, Terens again helped transport freed Allied prisoners to England before he shipped back to the U.S. a month later."}, {"id": "6686c015-5e8a-4fb6-be3f-90689dac2218", "title": "A World War II veteran just married his bride near Normandy D - Day beaches – NBC 5 Dallas - Fort Worth", "date": "2024-06-08 19:30", "url": "https://www.nbcdfw.com/news/national-international/world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches/3562953/", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he’s 100, she’s a youngster of just 96 — made their nuptials an almost double-century celebration.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nTerens himself went to France 12 days later, helping transport freshly captured Germans and just-freed American POWs to England.\nFollowing the Nazi surrender in May 1945, Terens again helped transport freed Allied prisoners to England before he shipped back to the U.S. a month later."}, {"id": "f9dd0a1a-2dbc-4e21-a07b-634298b16d79", "title": "A World War II veteran just married his bride near Normandy D - Day beaches – NBC4 Washington", "date": "2024-06-08 19:30", "url": "https://www.nbcwashington.com/news/national-international/world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches/3636547/", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he’s 100, she’s a youngster of just 96 — made their nuptials an almost double-century celebration.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nTerens himself went to France 12 days later, helping transport freshly captured Germans and just-freed American POWs to England.\nFollowing the Nazi surrender in May 1945, Terens again helped transport freed Allied prisoners to England before he shipped back to the U.S. a month later."}, {"id": "de7ef22b-76de-4e03-a45f-f1de676175b5", "title": "U . S . Confronts Failures as Terrorism Spreads in West Africa", "date": "2024-06-08 09:45", "url": "https://news.yahoo.com/news/u-confronts-failures-terrorism-spreads-123238984.html", "message": "This kind of holistic approach has been tried before with limited success, and U.S. officials and independent West Africa specialists say it faces steep hurdles now.\nThe West has long been seen as projecting its own problems onto the Sahel, said Ornella Moderan, a Geneva-based researcher and policy adviser focused on politics and security in West Africa.\nU.S. diplomats and military officials protested this spring and criticized the military government for failing to map out a path to return to democracy.\nOur narrative is still, ‘Hey, we’re here to help.’”The military takeover in Niger upended years of Western counterterrorism efforts in West Africa.\nThat Africa Command conducted three overlapping military exercises, including Flintlock, in Ghana in the past few weeks underscores how much Washington is pinning its security hopes on coastal West Africa."}, {"id": "dbe200d0-becb-4502-bc0e-7e09b607dc9a", "title": "Biden to meet Macron after D - Day democracy warnings", "date": "2024-06-08 07:45", "url": "https://www.bssnews.net/news/193925", "message": "PARIS, June 8, 2024 (BSS/AFP) - US President Joe Biden was to meet his French counterpart Emmanuel Macron Saturday on a state visit to France, after warning of the need to preserve American democracy and live up to the example of World War II heroes.\nBiden is due to meet Macron for talks at the Elysee Palace in Paris followed by a state banquet given in his honour, with Ukraine's battle against the Russian invasion the dominant topic.\n\"The rangers who scaled this cliff did not know they would change the world but they did,\" said Biden.\nMeeting Zelensky in Paris after the speech, Biden pledged his support for Ukraine and announced another $225 million in aid to Kyiv.\nZelensky thanked him for the \"tremendous support\", comparing it to the United States coming to Europe's aid during World War II."}, {"id": "3622789a-2c51-4b85-88ae-d93cd8d85c77", "title": "A World War II veteran just married his bride near Normandy D - Day beaches – NBC Connecticut", "date": "2024-06-08 19:00", "url": "https://www.nbcconnecticut.com/news/national-international/world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches/3309038/", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he’s 100, she’s a youngster of just 96 — made their nuptials an almost double-century celebration.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nTerens himself went to France 12 days later, helping transport freshly captured Germans and just-freed American POWs to England.\nFollowing the Nazi surrender in May 1945, Terens again helped transport freed Allied prisoners to England before he shipped back to the U.S. a month later."}, {"id": "21472dc8-4813-4139-b99f-b5e197e9cf3f", "title": "Turkiye First Foray Into Tank - Building : What We Know About the Altay MBT", "date": "2024-06-08 17:30", "url": "https://sputnikglobe.com/20240608/turkiyes-first-foray-into-tank-building-what-we-know-about-the-altay-mbt-1118875388.html", "message": "https://sputnikglobe.com/20240608/turkiyes-first-foray-into-tank-building-what-we-know-about-the-altay-mbt-1118875388.htmlTurkiye’s First Foray Into Tank-Building: What We Know About the Altay MBTTurkiye’s First Foray Into Tank-Building: What We Know About the Altay MBTSputnik InternationalSpending most of its modern history relying on Western main battle tank designs, Turkiye began to explore the production of a domestic heavy armored platform in the late 2000s, as part of a broader push to increase the self-sufficiency of its military-industrial complex.\n2024-06-08T16:16+00002024-06-08T16:16+00002024-06-08T16:16+0000militaryturkiyesouth koreamilitary & intelligencehyundaileopard 2https://cdn1.img.sputnikglobe.com/img/103143/94/1031439480_0:191:4001:2441_1920x0_80_0_0_80a018728c963ddb1a581b1f4093dd7d.jpgTurkiye’s Defense Industry Agency recently announced the start of mass production of the new Altay main battle tank.\nHere's what we know about the tank and its stated capabilities.Before building the Altay, Turkiye spent decades relying on American M48 and M60 tanks, and West German Leopard 1 and Leopard 2 MBTs.\nThe latter proved highly vulnerable to portable anti-tank missiles used by militants in southern Turkiye.\nhttps://sputnikglobe.com/20240530/abcs-of-abrams-weak-spots-detailed-list-of-problems-with-us-top-tank-revealed-in-ukraine-1118703632.htmlhttps://sputnikglobe.com/20230726/turkiyes-first-main-battle-tank-to-be-put-into-serial-production-in-2025-1112148570.htmlturkiyesouth koreaSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 602024Ilya TsukanovIlya TsukanovNewsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Ilya Tsukanovis altay tank good, what is turkey's altay tank, does turkey have its own tank"}, {"id": "d3050f5a-6ae6-4497-a4ee-867f3c6787ff", "title": "Biden Apologizes to Zelensky for Congress Ukraine Aid Delay", "date": "2024-06-08 02:45", "url": "https://foreignpolicy.com/2024/06/07/biden-zelensky-ukraine-military-aid-war-russia-putin-d-day/", "message": "Welcome back to World Brief, where we’re looking at U.S. military aid diplomacy with Ukraine , Houthi detentions of United Nations employees, and India ’s new governing coalition.\nWelcome back to World Brief, where we’re looking at U.S. military aid diplomacy with Ukraine, Houthi detentions of United Nations employees, and India’s new governing coalition.\n‘We’re Still In’U.S. President Joe Biden apologized to Ukrainian President Volodymyr Zelensky in Paris on Friday for the monthslong congressional delay in approving the latest U.S. aid package.\nThe meeting, on the sidelines of D-Day commemoration events, was their first face-to-face encounter since Zelensky visited Washington last December to request greater military support.\n“I apologize for those weeks of not knowing what’s going to happen in terms of funding,” Biden told Zelensky, adding that “we’re still in."}, {"id": "8bf5a2c3-c5b4-4845-92c4-cecf37436823", "title": "Biden Apologizes to Zelensky for Congress Ukraine Aid Delay", "date": "2024-06-08 09:15", "url": "https://foreignpolicy.com/2024/06/07/biden-zelensky-ukraine-military-aid-war-russia-putin-d-day/?tpcc=recirc_trending062921", "message": "Welcome back to World Brief, where we’re looking at U.S. military aid diplomacy with Ukraine , Houthi detentions of United Nations employees, and India ’s new governing coalition.\nWelcome back to World Brief, where we’re looking at U.S. military aid diplomacy with Ukraine, Houthi detentions of United Nations employees, and India’s new governing coalition.\n‘We’re Still In’U.S. President Joe Biden apologized to Ukrainian President Volodymyr Zelensky in Paris on Friday for the monthslong congressional delay in approving the latest U.S. aid package.\nThe meeting, on the sidelines of D-Day commemoration events, was their first face-to-face encounter since Zelensky visited Washington last December to request greater military support.\n“I apologize for those weeks of not knowing what’s going to happen in terms of funding,” Biden told Zelensky, adding that “we’re still in."}, {"id": "37e0c54f-8a47-4320-a9fa-ed04d1f78db5", "title": "The hippies of the  60s were not all were led to believe", "date": "2024-06-08 16:30", "url": "https://nypost.com/2024/06/08/opinion/the-hippies-of-the-60s-were-not-all-were-led-to-believe/", "message": "The modern-day romanticization of the hippies represents yet another example of scholars unable to admit the failure and unpopularity of left-leaning revolutions.\nSimply put, people disliked hippies because they struck the average taxpayer as slovenly, money-bumming drug addicts.\nAll the [hippie] stuff about higher consciousness was just sort of dropped.”6 The San Francisco hippy scene proved particularly worrisome for vulnerable young women.\nThe negative effect that it had on public attitudes toward the Vietnam War was a real, if minor, factor that contributed directly to the defeat of the domino theory strategy.\n6 So much of the hippy scene was tied up with protest, most notably against the war in Vietnman."}, {"id": "5a58c1d4-0091-47c7-9d40-875f2ae8bb6a", "title": "A World War II veteran just married his bride near Normandy D - Day beaches . He 100 , she 96", "date": "2024-06-08 17:15", "url": "https://www.boston25news.com/news/world/world-war-ii-veteran/2EJHBLZN7RQTITOVCR2TVFAZ5A/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "832f27ff-4548-45d3-9d5d-b7573e4d00db", "title": "Battle of the Alphas - Sky Mix", "date": "2024-06-08 12:30", "url": "https://www.tvguide.co.uk/schedule/c0be821c-a842-53cb-9308-2508a3edcb03/battle-of-the-alphas", "message": "Battle of the AlphasSky Mix 6:00 PM to 6:30 PM Saturday 8 June Share Add toCalendar +Season 1 Episode 11 of 12 New S Subtitles Audio DescriptionThe creature conflicts in the landscape of South Africa, where wildebeest battle for herd hierarchy, floppy fish fight it out on land and locusts give into a frenzy of cannibalismBattle of the Alphas airs on Sky Mix at 6:00 PM, Saturday 8 June .\n(Subtitles, audio description, new.)\nLearn more about Battle of the Alphas and other education/science/factual topics on our factual page"}, {"id": "878e1c8d-d3d5-443e-95a1-f98195cb951d", "title": "A World War II veteran just married his bride near Normandy D - Day beaches . He 100 , she 96 – Winnipeg Free Press", "date": "2024-06-08 12:15", "url": "https://www.winnipegfreepress.com/world/2024/06/08/a-world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches-hes-100-shes-96", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTerens called it ″the best day of my life.″FILE - World War II veteran Harold Terens, 100, right, and Jeanne Swerlin, 96, snuggle during an interview, Thursday, Feb. 29, 2024, in Boca Raton, Fla.\nShe giggled and gasped, “Really?”FILE - World War II veteran Harold Terens, 100, right, and Jeanne Swerlin, 96, pose for a photo, Thursday, Feb. 29, 2024, in Boca Raton, Fla.\n(AP Photo/Jeremias Gonzalez)On D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France."}, {"id": "5bacbafc-862b-4735-b8db-de73d1a44594", "title": "A powerful ally for veterans | News , Sports , Jobs - Adirondack Daily Enterprise", "date": "2024-06-08 06:15", "url": "https://www.adirondackdailyenterprise.com/opinion/guest-commentary/2024/06/a-powerful-ally-for-veterans/", "message": "Some of these organizations united and were known as the Veterans of Foreign Wars of the United States, later the Veterans of Foreign Wars or VFW.\nThe VFW is dedicated to veterans’ service, legislative advocacy, military and community service programs.\n(While most VFW members do not list their gender on the application form, according to one report approximately 8% of members are female).\nThe VFW has made it a priority to “enhance programs and services for women and underserved veterans.” A recent VFW report states the Veterans Administration needs to:¯ Improve outreach to women veterans.\n¯ Train VA’s workforce to treat women veterans with respect and dignity."}, {"id": "384ce44c-38ce-4a28-82aa-f827a3f9be71", "title": "No injuries in Battle Creek nursing home fire , firefighters say", "date": "2024-06-08 07:00", "url": "https://wwmt.com/news/local/pinnacle-care-battle-creek-fire-temperature-machine-overheat-office-smoke-firefighters-department-safety-calhoun-county-west-michigan", "message": "No one was injured after a fire at a Battle Creek nursing home Wednesday, according to the Battle Creek Fire Department.\nFirefighters were called to Pinnacle Care at 675 Wagner Dr. around 11:23 p.m. for a fire in an office.\nMore Battle Creek:When they arrived, firefighters did not see any fire on the outside or an evacuation in progress, firefighters said.\nHowever, inside the building, firefighters found light smoke and a small fire caused by an overheated, portable patient and visitor temperature reading machine in the front office, according to the department.\nTrending on WWMT:Both the fire and its smoke were contained, but were estimated to have caused $7,000 in damages, firefighters said."}, {"id": "4c02e85b-e5e7-48f9-b662-e71dbd8fa980", "title": "A war on the Nile pushes Sudan toward the abyss | World News", "date": "2024-06-08 12:45", "url": "https://indianexpress.com/article/world/a-war-on-the-nile-pushes-sudan-toward-the-abyss-9380102/", "message": "As he recovered in a military hospital overlooking the Nile, he said, shells slammed into its walls, fired by the Rapid Support Forces across the river.\nFor more than half a century, Sudan’s military waged ugly wars in the nation’s distant peripheries, quelling rebellions by deploying ruthless militias.\nBleeding RSF fighters lie in the dust, and are kicked or taunted by the soldiers.\nHuda Adil, 30, was paralyzed from the waist down after RSF fighters shot up the bus she was traveling in.\nThe foreign powers fueling Sudan’s war seemed to be covering their tracks."}, {"id": "417f77b1-1c98-48ad-b894-be132ebc00aa", "title": "US says Russia advance on Kharkiv is  all but over  ", "date": "2024-06-08 00:45", "url": "https://www.yahoo.com/news/us-says-russia-advance-kharkiv-213236954.html", "message": "The White House said Friday that Russia’s offensive in Ukraine’s northeastern Kharkiv region has stalled and is unlikely to advance any further.\nJohn Kirby, the White House national security spokesperson, said the arrival of U.S. weapons has helped change the trajectory of the battle around Kharkiv, which Russian forces mounted a major attack on around the middle of May.\n“They have been able to thwart Russian advances, particularly around Kharkiv,” Kirby said.\nThe renewed push sparked fears that Ukraine would be stretched thin as it also defends against Russian forces pushing forward in the eastern Donetsk and Luhansk regions.\nRussia made some gains in Kharkiv when the offensive was launched, capturing towns and progressing toward the city of Kharkiv, but forces are still locked into fighting north of the city, including major battles around the town of Vovchansk."}, {"id": "a227d9ce-f4d5-40cc-babe-375091662911", "title": "Rishi Kapoor Posed For Photographer In Place of Ranbir , Paparazzo Reveals  He Had A Glass In His Hands  ", "date": "2024-06-08 10:15", "url": "https://www.news18.com/movies/rishi-kapoor-posed-for-photographer-in-place-of-ranbir-paparazzo-reveals-he-had-a-glass-in-his-hands-8925739.html", "message": "Veteran paparazzo Varinder Chawla recently reminisced about the complex yet endearing relationship between the late actor Rishi Kapoor and his son, Ranbir Kapoor, with Mumbai’s ever-eager paparazzi.\nVarinder recounted an incident where one of his photographers, determined to snap Ranbir Kapoor, decided to stake out outside Ranbir’s house.\nAfter waiting for over six hours, Rishi Kapoor emerged with a glass in his hand and engaged the photographer in a surprisingly gentle conversation, “It was late in the night.\nBut my photographer was adamant, he said he wants his photo, so Rishi said, ‘He won’t come out, you click my picture and leave’.\nFondly referred to as Chintu Ji, Rishi Kapoor left an indelible mark on the Hindi film industry."}, {"id": "2b77995f-5542-40a8-93df-5288fcd3dc24", "title": "The B - 52 Bomber Question the U . S . Air Force Doesnt Want to Ask", "date": "2024-06-08 15:15", "url": "https://nationalinterest.org/blog/buzz/b-52-bomber-question-us-air-force-doesnt-want-ask-211362", "message": "Achieving air superiority and neutralizing Chinese defenses would be crucial for the B-52 to operate effectively, posing significant challenges for the U.S. military.\n-However, in a conflict against China, the B-52's survivability is questionable due to advanced Chinese air defenses and fourth- and fifth-generation fighters.\n-Achieving air superiority and neutralizing Chinese defenses would be crucial for the B-52 to operate effectively, posing significant challenges for the U.S. military.\nAfter a generation of stability for the American bomber fleet, the U.S. Air Force is making changes.\nOnce the U.S. achieved air superiority, the B-52 was free to lumber toward her target."}, {"id": "28211d70-f3d5-4912-8f99-5e2ed76c1e2e", "title": "Russian Sever Group of Forces Advances Into Depths of Ukrainian Defense in Kharkov Region", "date": "2024-06-08 14:45", "url": "https://sputnikglobe.com/20240608/russian-sever-group-of-forces-advances-into-depths-of-ukrainian-defense-in-kharkov-region-1118871734.html", "message": "https://sputnikglobe.com/20240608/russian-sever-group-of-forces-advances-into-depths-of-ukrainian-defense-in-kharkov-region-1118871734.htmlRussian Sever Group of Forces Advances Into Depths of Ukrainian Defense in Kharkov RegionRussian Sever Group of Forces Advances Into Depths of Ukrainian Defense in Kharkov RegionSputnik InternationalUnits of the Sever Group of Forces continue their advance into the depths of enemy defenses in the Kharkov region, the Ministry of Defense stated.\n\"Units of the Zapad group of forces occupied more advantageous positions, defeating formations of the 14th, 63rd, 116th mechanized brigades of the Ukrainian armed forces and the 117th air defense brigade near the settlements of Sinkovka and Petropavlovka in the Kharkov Region, Stelmakhovka and Dibrova in the Lugansk People's Republic,\" the ministry said.\nIn addition, the Russian troops repelled three counterattacks by an enemy assault groups.\nOver the past day, the Russian air defense systems shot down a Ukrainian Mi-8 military helicopter, four ATACMS missiles, 71 drones and other targets, the statement added.\nMeanwhile, Russia's Black Sea Fleet destroyed five Ukrainian unmanned boats during the same period."}, {"id": "700d21de-59f1-48ae-9527-29c4fa6249b8", "title": "Army celebrates memory of WWII elephant Lin Wang", "date": "2024-06-08 17:30", "url": "https://www.taipeitimes.com/News/taiwan/archives/2024/06/09/2003819097", "message": "Army celebrates memory of WWII elephant Lin WangBy Wu Che-yu and Jonathan Chin / Staff reporter, with staff writer and CNAThe army yesterday celebrated the life of Lin Wang (林旺) the elephant, saying that the animal’s service made it a witness to the Whampoa Military Academy’s establishment in Taiwan.\nGeneral Sun Li-jen pets Lin Wang after the elephant was captured from the Japanese army during World War II.\nLin Wang became part of army history as part of the Imperial Japanese Army, it said.\nThe base later became the nucleus of the new Whampoa Military Academy, which was founded in Guangzhou, China, in 1924, it said.\nA year after that, the Whampoa Military Academy was created from the Officer Cadet Cohort 4, it said."}, {"id": "5a7186bb-b567-43f4-b3e8-5f9389e50d25", "title": "Pakistan : FIR on Baloch rights activist Mahrang sparks outcry", "date": "2024-06-08 13:45", "url": "https://news.webindia123.com/news/Articles/World/20240608/4204482.html", "message": "The Quetta police have filed a First Information Report (FIR) against Baloch rights activist Mahrang Baloch and several others, alleging their involvement in a protest against enforced disappearances and extrajudicial killings on May 18 that disrupted traffic on Court Road.\nAccording to the FIR, the protesters forcibly entered the Quetta Press Club by breaking the lock, where they purportedly delivered speeches and shouted slogans against Pakistan.\nThe FIR against Baloch has ignited a legal battle and sparked widespread condemnation from journalists and activists.\nhttps://x.com/Alijanmaqsood12/status/1799107296028701046 Exiled human rights activist Gulalai Ismail said, \"Strongly condemn the registration of FIR against Mahrang Baloch.\nAs tensions continue to simmer, Balochistan stands at a critical juncture, grappling with questions of democracy and freedom of expression."}, {"id": "ad37b301-dc56-43b8-a36a-a158a8cc0c8a", "title": "Sudan is experiencing unprecedented levels of starvation : World Food Programme", "date": "2024-06-08 17:15", "url": "https://www.jurist.org/news/2024/06/sudan-is-experiencing-unprecedented-levels-of-starvation-world-food-programme/", "message": "The World Food Programme (WFP) reported Thursday that Sudan is experiencing unprecedented levels of hunger and violence, with the nation’s conflict on the verge of becoming the world’s largest hunger crisis due to increased violent attacks by paramilitary groups.\nAccording to WFP, 18 million people are currently facing acute food insecurity in Sudan.\nWFP continues to expand its food and nutrition assistance to reach millions more people who are living through the daily horrors of war.\n‘Starvation as a weapon of war’ refers to the intentional use of hunger and deprivation of food resources to weaken, punish, or force a population into submission.\nUnder Article 8, the Rome Statute classifies the intentional use of starvation as a war crime in both international and non-international armed conflicts."}, {"id": "2e34bcf7-5ecc-4ef3-8ff2-38c570872852", "title": "World War II veteran weds near Normandy D - Day beaches . He 100 and his bride is 96", "date": "2024-06-08 14:45", "url": "https://www.cbsnews.com/news/world-war-ii-veteran-weds-near-normandys-d-day-beaches-hes-100-bride-is-96/", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nTheir respective ages — he's 100, she's a youngster of just 96 — made their nuptials an almost double-century celebration.\nOn her way into the nuptials, the bubbly bride-to-be said: \"It's not just for young people, love, you know?\nBut Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle."}, {"id": "73331762-c287-47da-af3e-b9c438c3d1a9", "title": "Everything announced during Summer Game Fest 2024", "date": "2024-06-08 04:00", "url": "https://www.eurogamer.net/everything-announced-during-summer-game-fest-2024", "message": "No fear if you missed the showcase though as below you'll find everything announced during Summer Game Fest 2024.\nIn this eight-player co-op game, you'll have to survive the horrors of the night but zombies aren't the only danger - this game has permadeath.\nBlumhouse Games' slateHorror then invaded Summer Game Fest 2024 again with the first look at the slate from Blumhouse Games.\nIt will be arriving in 2nd July 2024 on PC, PlayStation 4, PS5, Xbox One and Xbox Series X/S.\nPhantom Blade 0Summer Game Fest 2024 ended with a new trailer for Phantom Blade 0 - and it was all gameplay."}, {"id": "77320733-af3e-4310-b176-8f1bc1af864e", "title": "Can the SNP hold these streets where Nicola Sturgeon once ruled ? ", "date": "2024-06-08 09:45", "url": "https://www.heraldscotland.com/politics/viewpoint/24374459.can-snp-hold-streets-nicola-sturgeon-ruled/", "message": "The so-called Battle of Kenmure Street (Image: free)The Battle of Kenmure Street features prominently in Mr Stephens’ election literature along with the war in Gaza.\nHe’s keen to stress that this is more than electioneering in a constituency where the Muslim community is prominent.\nOf the 14 doors opened to Mr Stephens and me, 12 are firm, no-messing-about SNP supporters.\nREAD MOREClimate activists and Palestinian campaigners killing book festivalsAs Labour and Tories unite in silence over EU, can SNP break through?\nMr Stephens, though, has had to graft for every political reward that has come his way."}, {"id": "2b38ccfa-0865-4f17-85b8-2af41b2f2c9b", "title": "Colorado Rep . Jason Crow joins other Congress Members to commemorate D - Day with their own parachute jump over Normandy", "date": "2024-06-08 13:15", "url": "https://www.cpr.org/2024/06/08/colorado-jason-crow-members-of-congress-commemorate-d-day-with-parachute-jump-over-normandy/", "message": "Waltz said in this era of political acrimony and infighting he believes it’s important for Americans to see their representatives in Congress “coming together” to honor the veterans.\nCrow, who served in the Army's 82nd Airborne Division and 75th Ranger Regiment, and Waltz made a similar jump for the 75th anniversary.\n— Rep. Jason CrowAfterward, they shared photos and videos of their jumps and landings on a picturesque day near Mont-Saint-Michel.\nAhead of the jump, many of the lawmakers participated in a practice run in April in Florida to recertify for the launch.\n“So don’t worry ... we’ll be fine.”A spokesman for Waltz said the lawmakers all landed safely."}, {"id": "64a3966f-347f-4fab-a2a2-c6d382ce281f", "title": "100 - year - old WWII vet marries fiancee days after being honoured at D - Day ceremony", "date": "2024-06-08 16:30", "url": "https://www.aol.com/100-old-wwii-vet-marries-145846550.html", "message": "The happy couple... Harold Terens and his sweetheart Jeanne Swerlin - LOIC VENANCE/AFPTogether, the collective age of the bride and groom was nearly 200.\nMr Terens called it ″the best day of my life.″On her way into the nuptials, Jeanne Swerlin said: “It’s not just for young people, love, you know?\nParade of veteransAfter the ceremony, “depending on his possible fatigue”, Mr Terens said he may join in a parade of veterans in the centre of Carentan during the afternoon.\nMr Terens looked dapper in a light blue suit and matching pink kerchief in his breast pocket.\nTry The Telegraph free for 3 months with unlimited access to our award-winning website, exclusive app, money-saving offers and more."}, {"id": "30d2e31e-ec1f-4ab1-8624-23c5199faf77", "title": "100 - year - old WWII vet marries fiancee days after being honoured at D - Day ceremony", "date": "2024-06-08 17:30", "url": "https://www.telegraph.co.uk/world-news/2024/06/08/d-day-veteran-harold-terens-married-normandy-france/", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot on Saturday inland of the D-Day beaches in Normandy, France.\nMr Terens called it ″the best day of my life.″On her way into the nuptials, Jeanne Swerlin said: “It’s not just for young people, love, you know?\nParade of veteransAfter the ceremony, “depending on his possible fatigue”, Mr Terens said he may join in a parade of veterans in the centre of Carentan during the afternoon.\nThe couple were also invited to the state dinner at the Elysee Palace on Saturday night with President Emmanuel Macron and US President Joe Biden, the Carentan mayor, Jean-Pierre Lhonneur said.\nMr Terens looked dapper in a light blue suit and matching pink kerchief in his breast pocket."}, {"id": "600873cf-9515-4eac-9055-df02180aeb16", "title": "A World War II veteran just married his bride near Normandy D - Day beaches", "date": "2024-06-08 16:00", "url": "https://www.kwtx.com/2024/06/08/world-war-ii-veteran-just-married-his-bride-near-normandys-d-day-beaches/", "message": "But World War II veteran Harold Terens and his sweetheart Jeanne Swerlin proved that love is eternal as they tied the knot Saturday inland of the D-Day beaches in Normandy, France.\nOn D-Day, Terens helped repair planes returning from France so they could rejoin the battle.\nTerens himself went to France 12 days later, helping transport freshly captured Germans and just-freed American POWs to England.\nTo which she quickly quipped: “You mean there’s more later?”___AP journalist Terry Spencer in Fort Lauderdale contributed to this report.\n___See more AP coverage of the 80th anniversary of D-Day at https://apnews.com/live/d-day-80th-anniversary-updatesCopyright 2024 The Associated Press."}]