[{"id": "d2c39471-6f6f-4715-a471-2759a6d0452c", "title": "Hurricanes can kill from 1 , 000 miles away and other terrifying dangers", "date": "2024-05-20 09:45", "url": "https://www.yahoo.com/news/hurricanes-kill-1-000-miles-090554218.html", "message": "(The National Hurricane Center has started issuing daily tropical outlooks and the Atlantic hurricane season will officially begin June 1.)\nStorm surge has accounted for about half of all the deaths in hurricanes since 1970, according to the hurricane center.\nIn fact, flooding is the major threat from hurricanes and tropical storms for people living inland.\nAlthough not really a surprise danger, hurricane‐force winds – 74 mph or more – can destroy buildings and mobile homes, the hurricane center warned.\n\"Debris, such as signs, roofing material, siding and small items left outside become flying missiles during hurricanes,\" the hurricane center said."}, {"id": "483544c2-56a8-47cf-b387-f6cbe523f66b", "title": "Q1 Global Insured Natural Disaster Losses Driven by Severe Convective Storms : Aon", "date": "2024-05-20 07:45", "url": "https://www.insurancejournal.com/magazines/mag-features/2024/05/20/774565.htm", "message": "Global natural catastrophes cost insurers $17 billion during the first quarter of 2024 with economic losses rising above $45 billion, according to Aon’s Q1 Global Catastrophe Recap – April 2024.\nQ1 natural disaster losses were driven by severe convective and winter storms in the United States, as well as windstorms and flooding in Europe, and the earthquake in Japan, the Aon report said.\nThe global Q1 insured losses of $17 billion were close to the average since 2000 ($16 billion) and higher than the median of $12 billion for that period.\nEconomic losses of $45 billion, were lower than the 21st century Q1 average of $59 billion and significantly lower than losses of $149 billion reported during Q1 2023.\nThe insurance protection gap (or the difference between total economic losses and the amount covered by insurers) was estimated at 64%; only 36% of global economic losses were insured."}, {"id": "29107153-a2dd-4dce-b2a0-f1d58d3a8026", "title": "Changing climate influences London Chelsea Flower Show", "date": "2024-05-20 21:30", "url": "https://www.thesouthafrican.com/lifestyle/changing-climate-influences-london-chelsea-flower-show-koos-bekker-the-newt-in-somerset/", "message": "Britain’s King Charles III visits the 2024 RHS Chelsea Flower Show in London on May 20, 2024.\nThe Chelsea flower show is held annually in the grounds of the Royal Hospital Chelsea.\nImage: Arthur EDWARDS / POOL / AFPEarly springs, droughts and floods are influencing this year’s Chelsea Flower Show, which is keener than ever to reflect the changing climate and cut its own carbon footprint.\nAs reported by The South African website, South African billionaire Koos Bekker’s The Newt in Somerset will sponsor this year’s Chelsea Flower Show.\nThe Chelsea Flower Show, organised by the Royal Horticultural Society (RHS), has in recent years become increasingly focused on sustainable development and biodiversity."}, {"id": "9a37e98f-f252-4767-afae-36c5fdc7f14d", "title": "C40 Co - Chair Mayor Aki - Sawyerr and climate expert Aromar Revi react to extreme weather events in C40 cities", "date": "2024-05-20 15:00", "url": "https://www.c40.org/news/extreme-weather-in-cities/", "message": "A statement by Co-Chair Mayor of Freetown Yvonne Aki-Sawyerr and IiHS Director, IPCC AR6 Coordinating Lead Aromar ReviThe impacts of extreme weather events are devastating communities worldwide.\nExtreme flooding, once deemed rare in parts of regions such as Central East Asia, is now becoming more frequent.\nAcross Asia, cities are battling extreme weather events, from heatwaves to flooding.\nAcross South Asia, cities are battling extreme weather events, from heatwaves to flooding.\nC40 Cities are already taking action to address extreme weather events, showing that political leadership can save lives and make communities more resilient to flooding and drought."}, {"id": "c46251da-8eb6-44d6-8572-019806f77c4e", "title": "Subduction zone splay faults compound hazards", "date": "2024-05-20 22:00", "url": "https://www.eurekalert.org:443/news-releases/1045046", "message": "Published in the Journal of Geophysical Research: Solid Earth, the study should affect hazard awareness at subduction zones around the world.\nSplay faults exist at subduction zones bordering Ecuador, Cascadia, Chile, and Japan, suggesting they may contribute to tsunami hazards at those locations as well.\nTypically, the resultant lifting of land from the tectonic plate shifting beneath it, called uplift, from subduction zone earthquakes can be as much as 1 to 3 meters.\n“The island is kind of stuck in the middle of these splay faults, so anytime these splay faults rupture, it’s actually recording the uplift,” DePaolis said.\nThis evidence correlated with four of the last eight documented subduction zone earthquakes in the region."}, {"id": "89445d4d-253a-4877-a1da-649b78f77dde", "title": "Stay Safe and Healthy During and After Emergencies", "date": "2024-05-20 12:30", "url": "https://gazette.com/online_features/health_and_wellness/stay-safe-and-healthy-during-and-after-emergencies/article_b3eeaf8f-476a-5259-bb49-f271a2cdcbbe.html", "message": "You have permission to edit this article."}, {"id": "c8c9200f-57e2-4cb0-879b-8966f6c418ac", "title": "Stay Safe and Healthy During and After Emergencies", "date": "2024-05-20 12:00", "url": "https://www.dailycal.org/online_features/health_and_wellness/stay-safe-and-healthy-during-and-after-emergencies/article_59525308-df42-512d-b67f-c59c4fb74673.html", "message": "We're an independent student-run newspaper, and need your support to maintain our coverage."}, {"id": "2b7fcecd-a846-4f02-8839-a9cb2fc61bcd", "title": "U . S . wildfire season is now everywhere , all at once", "date": "2024-05-20 21:15", "url": "https://www.newsday.com/opinion/commentary/canada-wildfire-season-smoke-air-quality-alert-sepaa6wd", "message": "Mark Gongloff is a Bloomberg Opinion editor and columnist covering climate change.\nThe toxic smoke choking swathes of the Midwestern U.S. this week is a helpful reminder to Americans that Canada exists, and its wildfire season has come early.\nBut Americans shouldn’t forget their own season starts much earlier these days, too.\nIn fact, it’s getting to the point that wildfire season is all year long.\nIn some parts of the Southwestern U.S., wildfire season is now two months longer than in 1973, with about half of that increase coming in the spring."}, {"id": "4915fbdb-67f3-4805-87c8-f333a532a813", "title": "Northern Rockies Regional Municipality says four homes lost in B . C . wildfire | iNFOnews", "date": "2024-05-20 06:30", "url": "https://infotel.ca/newsitem/northern-rockies-regional-municipality-says-four-homes-lost-in-bc-wildfire/it104830", "message": "Vernon News Northern Rockies Regional Municipality says four homes lost in B.C.\nWildfire Service, are seen in a staging area along Highway 97 looking south with a water bladder and fire hose set up among charred grassland in a May 15, 2024, handout photo.\nImage Credit: THE CANADIAN PRESS/HO-BC Wildfire Service, *MANDATORY CREDIT*FORT NELSON, B.C.\n- The Mayor of British Columbia's Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nThe mayor says there's been no official word on when it will be safe for residents to return as the BC Wildfire Service waits until it's certain that the Parker Lake wildfire is \"burning away from the community.\""}, {"id": "3d4a3319-a50a-4596-88f7-fa9fe5ebd524", "title": "Active hurricane season could have  detrimental impact  on home insurance", "date": "2024-05-20 21:15", "url": "https://www.10news.com/weather/active-hurricane-season-in-florida-could-have-detrimental-impact-on-home-insurance", "message": "The predictions for Florida's upcoming hurricane season are serious, with numerous storms predicted.\n\"Large losses would have a detrimental impact on Florida's recovering market,\" said Mark Friedlander of the Insurance Information Institute.\nWeather Forecasters predict a well-above-average Atlantic hurricane season Evan ThomasColorado State University's predictions, which are typically factored into insurance modeling, show Florida with a 75% chance of being impacted by a hurricane.\n\"Large loss events always impact insurance markets, no matter how strong those insurance markets are,\" Friedlander said.\n\"If you have a heavy volume of loss activity during hurricane season, it's going to change the dynamics.\""}, {"id": "c11dcc81-f6d0-4c10-814b-1c0a438155e2", "title": "Light earthquake , 4 . 4 mag was detected near Pagar Alam in Indonesia", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-4-mag-was-detected-near-pagar-alam-in-indonesia/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Monday, 231 km S of Pagar Alam, Indonesia (144 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 4.4-magnitude earthquake has occurred at 18:36:37 / 6:36 pm (local time epicenter).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 231 km S of Pagar Alam, Indonesia."}, {"id": "f53399dd-660d-44af-8808-afe0f7d845e0", "title": "Light earthquake , 4 . 4 mag was detected near Ust - Kamchatsk Staryy in Russia", "date": "2024-05-20 03:15", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-4-mag-was-detected-near-ust-kamchatsk-staryy-in-russia-5/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 102 km E of Ust’-Kamchatsk Staryy, Russia (63 miles) on Sunday.\nThe 4.4-magnitude earthquake was detected at 20:11:15 / 8:11 pm (local time epicenter).\nExact time and date of earthquake 12/05/24 / 2024-05-12 20:11:15 / May 12, 2024 @ 8:11 pm UTC/GMT.\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 102 km E of Ust’-Kamchatsk Staryy, Russia."}, {"id": "197630f9-1dd7-4ee4-aa5e-7e64de045097", "title": "Light earthquake 4 . 4 mag , 172 km ESE of Pondaguitan , Philippines", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-4-mag-172-km-ese-of-pondaguitan-philippines/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Monday, 172 km ESE of Pondaguitan, Philippines (107 miles).\nExact location of earthquake, 127.6058° East, 5.7336° North, depth 8.324 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nId of earthquake: us6000myb1.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 172 km ESE of Pondaguitan, Philippines."}, {"id": "c10ed5ab-f9c2-48db-9675-e3ef2b7f455c", "title": "Light earthquake , 4 . 3 mag strikes near Corinto in Nicaragua", "date": "2024-05-20 12:00", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-strikes-near-corinto-in-nicaragua-4/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was detected on Saturday, 155 km SSW of Corinto, Nicaragua (96 miles).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nId of earthquake: us7000mdg0.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 155 km SSW of Corinto, Nicaragua."}, {"id": "b05d5b6a-5c4f-429d-9008-3a401c717d7c", "title": "Light earthquake 4 . 3 mag , south of the Fiji Islands", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-south-of-the-fiji-islands-48/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was detected on Tuesday, south of the Fiji Islands (0 miles).\nExact location of earthquake, longitude -179.9016 West, latitude -24.8928 South, depth = 503.866 km.\nThe earthquake occurred at a depth of 503.866 km (313 miles) below the earth’s surface.\nId of earthquake: us6000myj8.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: south of the Fiji Islands."}, {"id": "68924910-a406-4194-9de8-288856f41571", "title": "Fort McMurray wildfire remains out of control as authorities lift evacuation orders", "date": "2024-05-20 14:15", "url": "https://www.stalbertgazette.com/beyond-local/fort-mcmurray-wildfire-remains-out-of-control-as-authorities-lift-evacuation-orders-8769702", "message": "He stopped short of saying authorities were caught off guard, but said it was “a little bit surprising how volatile it burned.”The fire in northern Alberta is now being held, Alberta Wildfire said late Sunday.\nAuthorities on Saturday lifted the evacuation orders and alerts for Fort McMurray and nearby communities.\nEvacuation orders remain for Fort Nelson and Fort Nelson First Nation owing to the Parker Lake fire in the province’s northeast.\nDrought conditions ranged from severe to extreme in B.C.’s northeast, where Fort Nelson and Doig River are located.\nAlberta Wildfire on Sunday said there are 233 firefighters, 24 helicopters and 40 pieces of heavy equipment assigned to the wildfire near Fort McMurray."}, {"id": "4b2a7797-88ee-435a-b513-6ed326492614", "title": "Light earthquake , 4 . 3 mag was detected near La Tirana in Chile", "date": "2024-05-20 12:00", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-was-detected-near-la-tirana-in-chile/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 74 km SE of La Tirana, Chile (46 miles) on Monday.\nId of earthquake: us7000mdrl.\nExact location of earthquake, longitude -69.0749 West, latitude -20.7254 South, depth = 114.829 km.\nThe earthquake was roughly at a depth of 114.829 km (71 miles).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 74 km SE of La Tirana, Chile."}, {"id": "a0dfee00-01da-4e88-b44d-12f3d5d36c21", "title": "Light earthquake 4 . 4 mag , 59 km SE of Sucúa , Ecuador", "date": "2024-05-20 05:00", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-4-mag-59-km-se-of-sucua-ecuador/", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Tuesday, 59 kilometers (37 miles) from Sucúa in Ecuador.\nExact location of earthquake, longitude -77.8252 West, latitude -2.8719 South, depth = 17.169 km.\nThe epicenter of the earthquake was roughly 17.169 km (11 miles) below the earth’s surface.\nEpicenter of the earthquake was 70 km (44 miles) from Macas (c. 23 700 pop), 60 km (37 miles) from Sucúa (c. 7 400 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 59 km SE of Sucúa, Ecuador."}, {"id": "35bcf4e4-a252-40d3-be5c-6fc56e7b1a96", "title": "Light earthquake , 4 . 4 mag was detected near South Sandwich Islands region", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-was-detected-near-south-sandwich-islands-region-5/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Saturday, South Sandwich Islands region (0 miles).\nExact location of earthquake, longitude -26.5842 West, latitude -55.3995 South, depth = 10 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: South Sandwich Islands region."}, {"id": "0cb3c17e-ad37-445d-bc82-1b0502267ecb", "title": "Light earthquake , 4 . 4 mag has occurred near the Fiji Islands", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-4-mag-has-occurred-near-the-fiji-islands-47/", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Monday, south of the Fiji Islands (0 miles).\nEvent ids that are associated to the earthquake: us6000myav.\nId of event: us6000myav.\nThe earthquake occurred at a depth of 519.831 km (323 miles).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: south of the Fiji Islands."}, {"id": "b4919eeb-d3ab-4ac2-b85c-381defdaedf2", "title": "Light earthquake , 4 . 3 mag has occurred near Nabire in Indonesia", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-has-occurred-near-nabire-in-indonesia-2/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was detected on Tuesday, 132 km SSW of Nabire, Indonesia (82 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 30.58 km (19 miles) below the earth’s surface.\nExact time and date of earthquake 16/04/24 / 2024-04-16 16:10:01 / April 16, 2024 @ 4:10 pm UTC/GMT.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 132 km SSW of Nabire, Indonesia."}, {"id": "d2e3553d-adf3-4a49-81e1-141fac1b9c14", "title": "Light earthquake , 4 . 3 mag strikes near Tual in Indonesia", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-strikes-near-tual-in-indonesia-4/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 144 km E of Tual, Indonesia (89 miles) on Monday.\nExact time and date of earthquake 06/05/24 / 2024-05-06 12:12:33 / May 6, 2024 @ 12:12 pm UTC/GMT.\nId of earthquake: us6000mwnv.\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 144 km E of Tual, Indonesia."}, {"id": "c4ff323b-7a32-4644-b660-4eed2e161d55", "title": "Light earthquake : M4 . 3 quake has struck near Neiafu in Tonga", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-m4-3-quake-has-struck-near-neiafu-in-tonga-13/", "message": "A light earthquake magnitude 4.3 (ml/mb) strikes 151 km NNW of Neiafu, Tonga (94 miles) on Sunday.\nExact time and date of earthquake 28/04/24 / 2024-04-28 00:09:01 / April 28, 2024 @ 12:09 am UTC/GMT.\nThe 4.3-magnitude earthquake has occurred at 00:09:01 / 12:09 am (local time epicenter).\nThe earthquake occurred at a depth of 106.188 km (66 miles) below the earth’s surface.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 151 km NNW of Neiafu, Tonga."}, {"id": "57dc31e2-87ee-4637-ac4f-d3d854578a5c", "title": "Light earthquake : M4 . 3 quake has struck near Mid - Indian Ridge", "date": "2024-05-20 15:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-m4-3-quake-has-struck-near-mid-indian-ridge-3/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported Mid-Indian Ridge (0 miles) on Thursday.\nId of earthquake: us6000mw0e.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: Mid-Indian Ridge."}, {"id": "9e74683f-736b-4fce-91b6-c3ff29ae7853", "title": "Light earthquake , 4 . 3 mag strikes near Nabire in Indonesia", "date": "2024-05-20 13:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-strikes-near-nabire-in-indonesia-2/", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Wednesday, 187 km ESE of Nabire, Indonesia (116 miles).\nThe earthquake occurred at a depth of 10 km (6 miles).\nExact location of earthquake, 136.9357° East, -4.2558° South, depth 10 km.\nId of earthquake: us6000mvth.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 187 km ESE of Nabire, Indonesia."}, {"id": "f6e3f5dd-5b94-488f-a9c7-ae8d4c36c817", "title": "Light earthquake : M4 . 4 quake has struck near Ust - Kamchatsk Staryy in Russia", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-m4-4-quake-has-struck-near-ust-kamchatsk-staryy-in-russia-6/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Monday, 201 km SE of Ust’-Kamchatsk Staryy, Russia (125 miles).\nThe earthquake was roughly at a depth of 10 km (6 miles).\nEvent ids that are associated to the earthquake: us6000myax.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 201 km SE of Ust’-Kamchatsk Staryy, Russia."}, {"id": "8f53613a-c79d-4874-93fa-8e18aa879f0e", "title": "Light earthquake , 4 . 3 mag strikes near Tofino in Canada", "date": "2024-05-20 22:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-strikes-near-tofino-in-canada/", "message": "A light earthquake magnitude 4.3 (ml/mb) strikes 214 km WSW of Tofino, Canada (133 miles) on Friday.\nDate and time of earthquake in UTC/GMT: 10/05/24 / 2024-05-10 11:44:38 / May 10, 2024 @ 11:44 am.\nEvent ids that are associated to the earthquake: us6000mxpx.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 214 km WSW of Tofino, Canada."}, {"id": "89d7e0fe-50ba-4f00-acbf-128a10dfbcd0", "title": "Moderate earthquake : M5 . 6 quake has struck near Kashgar in China", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/moderate-earthquake-m5-6-quake-has-struck-near-kashgar-in-china/", "message": "A moderate earthquake with magnitude 5.6 (ml/mb) was reported 116 km NE of Kashgar, China (72 miles) on Monday.\nEvent ids that are associated to the earthquake: us6000mzrr.\nId of event: us6000mzrr.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 116 km NE of Kashgar, China."}, {"id": "87af3ff1-2339-4602-bbe8-ad345f167e1d", "title": "Light earthquake , 4 . 3 mag was detected near San Antonio de los Cobres in Argentina", "date": "2024-05-20 20:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-was-detected-near-san-antonio-de-los-cobres-in-argentina-12/", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Sunday, 65 km NW of San Antonio de los Cobres, Argentina (40 miles).\nThe 4.3-magnitude earthquake was detected at 12:03:32 / 12:03 pm (local time epicenter).\nThe earthquake occurred at a depth of 198.942 km (124 miles) below the earth’s surface.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 65 km NW of San Antonio de los Cobres, Argentina."}, {"id": "2c631c8b-3122-4141-b835-34a9dfc850ee", "title": "Light earthquake 4 . 4 mag , south of the Fiji Islands", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-south-of-the-fiji-islands-43/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes south of the Fiji Islands (0 miles) on Saturday.\nEvent id: us6000mw9z.\nIds that are associated to the earthquake: us6000mw9z.\nExact location of event, depth 507.151 km, 179.9726° East, -24.8237° South.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: south of the Fiji Islands."}, {"id": "f7c7796f-c2c6-481b-969c-fe377eeae85b", "title": "Light earthquake , 4 . 3 mag has occurred near Severo - Kurilsk in Russia", "date": "2024-05-20 08:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-has-occurred-near-severo-kurilsk-in-russia-15/", "message": "A light earthquake magnitude 4.3 (ml/mb) strikes 290 km S of Severo-Kuril’sk, Russia (180 miles) on Tuesday.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nId of earthquake: us6000mtim.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 290 km S of Severo-Kuril’sk, Russia."}, {"id": "83708843-4251-47be-a6f8-905367002e56", "title": "Light earthquake 4 . 4 mag , 108 km SE of Copiapó , Chile", "date": "2024-05-20 05:00", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-4-mag-108-km-se-of-copiapo-chile/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 108 km SE of Copiapó, Chile (67 miles) on Thursday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, longitude -69.5303 West, latitude -28.0319 South, depth = 98.221 km.\nExact time and date of earthquake 16/05/24 / 2024-05-16 04:18:07 / May 16, 2024 @ 4:18 am UTC/GMT.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 108 km SE of Copiapó, Chile."}, {"id": "284c45ab-aec6-4a6a-81fb-e23c045a20ab", "title": "Light earthquake , 4 . 4 mag strikes near Fakfak in Indonesia", "date": "2024-05-20 03:15", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-4-mag-strikes-near-fakfak-in-indonesia/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Thursday, 143 km SW of Fakfak, Indonesia (89 miles).\nId of earthquake: us6000mxff.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIn the past 24 hours, there have been one, in the last 10 days seven, in the past 30 days seven and in the last 365 days seven earthquakes of magnitude 3.0 or greater that have been detected in the same area.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 143 km SW of Fakfak, Indonesia."}, {"id": "ffa7b906-b9ed-40bf-a4ca-a7aac8f5c920", "title": "Light earthquake : M4 . 4 quake has struck near Port - Olry in Vanuatu", "date": "2024-05-20 03:15", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-m4-4-quake-has-struck-near-port-olry-in-vanuatu-14/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was reported 121 km E of Port-Olry, Vanuatu (75 miles) on Wednesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us6000mysd.\nIn the past 24 hours, there have been eighteen, in the last 10 days eighteen, in the past 30 days eighteen and in the last 365 days eighteen earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 121 km E of Port-Olry, Vanuatu."}, {"id": "a49cc09e-c54c-43a8-aef0-83efb959e381", "title": "Light earthquake , 4 . 3 mag strikes near Izu Islands , Japan region", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-strikes-near-izu-islands-japan-region-6/", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Thursday, Izu Islands, Japan region (0 miles).\nExact location of event, longitude 142.4103 East, latitude 30.868 North, depth = 10 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: Izu Islands, Japan region."}, {"id": "c608a0fa-89d8-4d1f-921d-42f7a86df089", "title": "Light earthquake 4 . 3 mag , 40 km WNW of False Pass , Alaska", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-40-km-wnw-of-false-pass-alaska/", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Friday, 40 km WNW of False Pass, Alaska (25 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter was at a depth of 144.727 km (90 miles).\nIds that are associated to the earthquake: us6000mz7b, ak0246ch441v.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 40 km WNW of False Pass, Alaska."}, {"id": "3ebc7215-49a3-4dcb-89a9-978ac822b440", "title": "Light earthquake , 4 . 3 mag strikes near Acajutla in El Salvador", "date": "2024-05-20 20:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-strikes-near-acajutla-in-el-salvador-5/", "message": "A light earthquake magnitude 4.3 (ml/mb) strikes 135 km SSW of Acajutla, El Salvador (84 miles) on Sunday.\nEvent ids that are associated to the earthquake: us6000mwig.\nId of event: us6000mwig.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 135 km SSW of Acajutla, El Salvador."}, {"id": "b28af206-566e-41c3-9254-c64679d63f16", "title": "Light earthquake 4 . 3 mag , 174 km N of Bamboo Flat , India", "date": "2024-05-20 20:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-174-km-n-of-bamboo-flat-india/", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Tuesday, 174 km N of Bamboo Flat, India (108 miles).\nThe earthquake occurred at a depth of 21.301 km (13 miles) below the earth’s surface.\nExact location of event, longitude 92.7568 East, latitude 13.2783 North, depth = 21.301 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 174 km N of Bamboo Flat, India."}, {"id": "179b1e52-d661-4e79-87d6-4bd8d9fb55a2", "title": "Light earthquake 4 . 3 mag , 62 km ESE of Loreto , Mexico", "date": "2024-05-20 08:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-62-km-ese-of-loreto-mexico/", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Thursday, 62 kilometers (39 miles) from Loreto in Mexico.\nIds that are associated to the earthquake: us7000mct8.\nEpicenter of the event was 62 km (39 miles) from Loreto (c. 11 200 pop).\nIn the past 24 hours, there have been seventeen, in the last 10 days nineteen, in the past 30 days nineteen and in the last 365 days nineteen earthquakes of magnitude 3.0 or greater that was reported nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 62 km ESE of Loreto, Mexico."}, {"id": "c7b672a1-54be-4180-aff4-a1bbc1026ab1", "title": "Light earthquake , 4 . 3 mag strikes near Jamestown in Australia", "date": "2024-05-20 08:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-strikes-near-jamestown-in-australia/", "message": "A light earthquake magnitude 4.3 (ml/mb) strikes 8 kilometers (5 miles) from Jamestown in Australia on Wednesday.\nAll ids that are associated to the event: us7000mcln.\nThe epicenter of the earthquake was roughly 10.141 km (6 miles) below the earth’s surface.\nEvent epicenter was 62 km (39 miles) from Port Pirie (c. 13 200 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 8 km ENE of Jamestown, Australia."}, {"id": "19fff1e2-c0d8-41a9-9273-e4bb0e9a8ace", "title": "Light earthquake , 4 . 3 mag has occurred near San Alejandro in Peru", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-has-occurred-near-san-alejandro-in-peru/", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Friday, 24 kilometers (15 miles) from San Alejandro in Peru.\nThe earthquake occurred at a depth of 10.086 km (6 miles).\nEvent epicenter was 82 km (51 miles) from Tingo María (c. 53 200 pop), 82 km (51 miles) from Campoverde (c. 8 900 pop).\nClose country/countries, Peru (c. 29 907 000 pop) (That might be effected).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 24 km SSW of San Alejandro, Peru."}, {"id": "423052fe-dbf2-4a68-ad02-24d1cbe2ed4e", "title": "Light earthquake , 4 . 3 mag strikes near Loreto in Mexico", "date": "2024-05-20 10:15", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-strikes-near-loreto-in-mexico-2/", "message": "A light earthquake magnitude 4.3 (ml/mb) strikes 61 kilometers (38 miles) from Loreto in Mexico on Thursday.\nEvent ids that are associated to the earthquake: us7000mcv2.\nId of event: us7000mcv2.\nIn the past 24 hours, there have been fourteen, in the last 10 days nineteen, in the past 30 days nineteen and in the last 365 days nineteen earthquakes of magnitude 3.0 or greater that has occurred nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 61 km E of Loreto, Mexico."}, {"id": "f975895e-8121-43e4-939c-9e84c33c6a31", "title": "Light earthquake , 4 . 3 mag has occurred near Kirakira in Solomon Islands", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-has-occurred-near-kirakira-in-solomon-islands-9/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 63 kilometers (39 miles) from Kirakira in Solomon Islands on Sunday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 92.388 km (57 miles) below the earth’s surface.\nThe epicenter was 63 km (39 miles) from Kirakira (c. 1 100 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 63 km WNW of Kirakira, Solomon Islands."}, {"id": "68c7410e-324c-4a92-8fb7-87f40a067b8d", "title": "Carbon Offset Programs Underestimate the Threat of Hurricanes", "date": "2024-05-20 13:30", "url": "https://eos.org/articles/carbon-offset-programs-underestimate-the-threat-of-hurricanes", "message": "Many carbon offset programs reforest in the region.\n“We’re not really adequately accounting for risks when we’re relying on forest carbon as a nature-based climate solution.”Carbon CreditsWhen a company buys a carbon credit, it buys a slight surplus of offset, allowing offset programs to plant slightly more trees to take in more carbon than is being emitted.\nThis is the first study to analyze the potential effect hurricanes could have on carbon offset forests.\nWhen asked whether there are any carbon offset programs with a large enough buffer pool, Anderegg said, “Honestly, the short answer is no.”Carbon offset programs are still important, Tumber-Dávila noted, but they lose their effectiveness if we underestimate the threats they face.\nCitation: Bouchér, S. (2024), Carbon offset programs underestimate the threat of hurricanes, Eos, 105, https://doi.org/10.1029/2024EO240226."}, {"id": "401f1dee-a91c-434b-9583-87f8024f1719", "title": "Light earthquake , 4 . 4 mag has occurred near El Aguilar in Argentina", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-has-occurred-near-el-aguilar-in-argentina-5/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Saturday, 106 km W of El Aguilar, Argentina (66 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, longitude -66.7247 West, latitude -23.205 South, depth = 210.119 km.\nThe epicenter of the earthquake was roughly 210.119 km (131 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 106 km W of El Aguilar, Argentina."}, {"id": "8de355d9-1ad1-4539-86cf-17bc2b487f26", "title": "Light earthquake , 4 . 4 mag strikes near Atocha in Bolivia", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-strikes-near-atocha-in-bolivia-3/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Saturday, 87 km SW of Atocha, Bolivia (54 miles).\nThe earthquake occurred at a depth of 243.584 km (151 miles) below the earth’s surface.\nExact location of earthquake, longitude -66.6971 West, latitude -21.585 South, depth = 243.584 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 87 km SW of Atocha, Bolivia."}, {"id": "07a3500e-d9d3-4081-b9ca-18aa1900edb7", "title": "Light earthquake , 4 . 3 mag was detected near Adak in Alaska", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-was-detected-near-adak-in-alaska-8/", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Friday, 266 km W of Adak, Alaska (165 miles).\nExact location of event, longitude 179.528 East, latitude 51.652 North, depth = 74.6 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 4.3-magnitude earthquake was detected at 18:54:35 / 6:54 pm (local time epicenter).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 266 km W of Adak, Alaska."}, {"id": "50b16528-1ae0-4290-bf53-02464e3d79e3", "title": "Changes to NWS Web Pages as of June 4", "date": "2024-05-20 14:15", "url": "https://www.weather.gov/idp/wxgovmigration", "message": "Sorry, the location you searched for was not found.\nPlease try another search.\nMultiple locations were found.\nPlease select one of the following:"}, {"id": "07087ed6-22ea-4b3c-b18d-a94d302bd8a0", "title": "Light earthquake : M4 . 3 quake has struck near Kainantu in Papua New Guinea", "date": "2024-05-20 19:00", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-m4-3-quake-has-struck-near-kainantu-in-papua-new-guinea/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was detected on Wednesday, 50 kilometers (31 miles) from Kainantu in Papua New Guinea.\nExact location of earthquake, 146.2209° East, -6.002° South, depth 72.374 km.\nEpicenter of the earthquake was 93 km (58 miles) from Goroka (c. 18 500 pop), 51 km (31 miles) from Kainantu (c. 8 500 pop).\nClose country/countries that might be effected, Papua New Guinea (c. 6 065 000 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 50 km NE of Kainantu, Papua New Guinea."}, {"id": "7c8c664a-d065-4ebb-815c-310a89dfe35f", "title": "Light earthquake : M4 . 3 quake has struck near Port McNeill in Canada", "date": "2024-05-20 08:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-m4-3-quake-has-struck-near-port-mcneill-in-canada-2/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was detected on Thursday, 203 km WSW of Port McNeill, Canada (126 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 10 km (6 miles).\nAll ids that are associated to the event: us7000mctx.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 203 km WSW of Port McNeill, Canada."}, {"id": "983956fd-a1e0-48f0-8379-b5cd28f57855", "title": "Light earthquake , 4 . 3 mag was detected near Labasa in Fiji", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-was-detected-near-labasa-in-fiji/", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Sunday, 207 km ESE of Labasa, Fiji (129 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nDate and time of earthquake in UTC/GMT: 05/05/24 / 2024-05-05 07:00:37 / May 5, 2024 @ 7:00 am.\nThe epicenter was at a depth of 547.077 km (340 miles).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 207 km ESE of Labasa, Fiji."}, {"id": "fd7d9d6b-7222-464c-b597-287c42c405ed", "title": "Light earthquake , 4 . 7 mag strikes near western Xizang", "date": "2024-05-20 22:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-7-mag-strikes-near-western-xizang-2/", "message": "A light earthquake with magnitude 4.7 (ml/mb) was reported western Xizang (0 miles) on Monday.\nId of earthquake: us6000mzwy.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThere are an estimated 13,000 light earthquakes in the world each year.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: western Xizang."}, {"id": "34d1cfc9-2b93-44d8-9cd9-cb3600a6eae6", "title": "Light earthquake , 4 . 3 mag has occurred near Lospalos in Timor Leste", "date": "2024-05-20 22:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-has-occurred-near-lospalos-in-timor-leste-4/", "message": "A light earthquake magnitude 4.3 (ml/mb) strikes 147 km NE of Lospalos, Timor Leste (91 miles) on Saturday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us6000mxyy.\nIn the past 24 hours, there have been two, in the last 10 days four, in the past 30 days seven and in the last 365 days seven earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 147 km NE of Lospalos, Timor Leste."}, {"id": "f3a66d8b-c6a2-40db-a963-3d8473d297b6", "title": "Thousands Remain Without Power After Deadly Storms Hit Houston", "date": "2024-05-20 07:45", "url": "https://www.insurancejournal.com/news/southcentral/2024/05/20/774839.htm", "message": "HOUSTON (AP) — As the Houston area works to clean up and restore power to hundreds of thousands after deadly storms left at least seven people dead, it will do so amid a smog warning and scorching temperatures that could pose health risks.\n“Don’t overdo yourself during the cleanup process,” the weather service’s Houston office said in a post on the social platform X.\nIn addition to the heat, the Houston area could face poor air quality during the weekend.\nHUNDREDS OF THOUSANDS REMAIN WITHOUT POWERThe widespread destruction of Thursday’s storms brought much of Houston to a standstill.\nSchool districts in the Houston area canceled classes Friday for more than 400,000 students and government offices were closed."}, {"id": "ce413666-15a2-488f-9601-c9b0da26ae3b", "title": "Hillsborough County pushes landscaping prep for hurricane season", "date": "2024-05-20 16:30", "url": "https://www.fox13news.com/news/hillsborough-county-pushes-landscaping-prep-for-hurricane-season", "message": "With hurricane season just days away, now is the time to start working on your plan for preparation.\nHillsborough County continued their \"Make a Plan Monday\" series this week by focusing on something many Floridians may overlook : landscaping.\n\"Start with the biggest things that you have in your landscaping that you know you need to move,\" advises Lynn Barber, extension agent with Hillsborough County.\nLarge debris also has the chance to block streets and clog storm drains, creating more work for storm relief crews.\nFor more information on Hurricane Preparedness in Hillsborough County, click here."}, {"id": "7d8f95f2-cd07-4a6c-bbd4-1e07cfdd3d11", "title": "Very active hurricane season on the horizon – Munich Re", "date": "2024-05-20 15:45", "url": "https://www.insurancebusinessmag.com/us/news/reinsurance/very-active-hurricane-season-on-the-horizon--munich-re-489850.aspx", "message": "“However, this year we have two important factors that will probably favor cyclones – the development of a La Niña phase in conjunction with very high water temperatures in the tropical North Atlantic, the formation area for the hurricanes.\nFor that reason, the forecasts seem to be more reliable this time,” Rädler said."}, {"id": "4a15538b-e681-4c90-bc09-9a39b444f97b", "title": "Light earthquake , 4 . 4 mag was detected near Tual in Indonesia", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-4-mag-was-detected-near-tual-in-indonesia-6/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Monday, 276 km WSW of Tual, Indonesia (171 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us6000myab.\nIn the past 24 hours, there have been two, in the last 10 days four, in the past 30 days seven and in the last 365 days seven earthquakes of magnitude 3.0 or greater that have been detected in the same area.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 276 km WSW of Tual, Indonesia."}, {"id": "0f55000c-5d76-4639-af61-edf37e5c9182", "title": "Light earthquake 4 . 3 mag , 78 km S of Ōyama , Japan", "date": "2024-05-20 05:00", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-78-km-s-of-oyama-japan/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was detected on Sunday, 78 kilometers (48 miles) from Ōyama in Japan.\nExact location of earthquake, 138.0959° East, 33.9001° North, depth 266.512 km.\nThe earthquake was roughly at a depth of 266.512 km (166 miles).\nEpicenter of the earthquake was 92 km (57 miles) from Iwata (c. 88 500 pop), 88 km (55 miles) from Sagara (c. 25 900 pop), 79 km (49 miles) from Ōyama (c. 21 700 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 78 km S of Ōyama, Japan."}, {"id": "ee5974da-a3ed-486d-9a85-6e0b94041b7c", "title": "Light earthquake , 4 . 3 mag has occurred near Hiroo in Japan", "date": "2024-05-20 22:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-has-occurred-near-hiroo-in-japan/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 15 kilometers (9 miles) from Hiroo in Japan on Friday.\nThe earthquake occurred at a depth of 66.912 km (42 miles) below the earth’s surface.\nNearby country/countries that might be effected, Japan (c. 127 288 000 pop).\nEarthquake epicenter was 56 km (35 miles) from Obihiro (c. 173 900 pop), 64 km (40 miles) from Otofuke (c. 40 900 pop), 80 km (50 miles) from Shizunai-furukawachō (c. 22 400 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 15 km N of Hiroo, Japan."}, {"id": "f98a7d54-9b4b-48b8-96fe-d93914317d20", "title": "Light earthquake , 4 . 3 mag strikes near Ternate in Indonesia", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-strikes-near-ternate-in-indonesia-4/", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Tuesday, 148 km NW of Ternate, Indonesia (92 miles).\nThe epicenter was at a depth of 35.375 km (22 miles).\nExact time and date of event in UTC/GMT: 07/05/24 / 2024-05-07 23:38:00 / May 7, 2024 @ 11:38 pm.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 148 km NW of Ternate, Indonesia."}, {"id": "26e2e8bd-c2ea-4325-b55f-936206a9b116", "title": "Light earthquake : M4 . 4 quake has struck near Sola in Vanuatu", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-m4-4-quake-has-struck-near-sola-in-vanuatu-15/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Saturday, 66 kilometers (41 miles) from Sola in Vanuatu.\nExact location of event, longitude 167.2495 East, latitude -14.4029 South, depth = 143.297 km.\nThe epicenter was at a depth of 143.297 km (89 miles).\nEvent epicenter was 66 km (41 miles) from Sola (c. 1 200 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 66 km SSW of Sola, Vanuatu."}, {"id": "a861a3a3-246d-4637-bcc8-851031cc36a7", "title": "Light earthquake , 4 . 3 mag has occurred near Calama in Chile", "date": "2024-05-20 22:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-has-occurred-near-calama-in-chile-12/", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Tuesday, 20 kilometers (12 miles) from Calama in Chile.\nEvent ids that are associated to the earthquake: us6000myi7.\nId of event: us6000myi7.\nEvent epicenter was 21 km (13 miles) from Calama (c. 143 100 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 20 km ESE of Calama, Chile."}, {"id": "f443db70-0a9e-4bcd-b37c-cdb514ac4b4f", "title": "Light earthquake , 4 . 4 mag strikes near Anse - Bertrand in Guadeloupe", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-4-mag-strikes-near-anse-bertrand-in-guadeloupe/", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Monday, 47 kilometers (29 miles) from Anse-Bertrand in Guadeloupe.\nExact location of earthquake, longitude -61.1896 West, latitude 16.778 North, depth = 39.509 km.\nThe epicenter of the earthquake was roughly 39.509 km (25 miles) below the earth’s surface.\nClose country/countries, Antigua and Barbuda (c. 87 000 pop), Guadeloupe (c. 443 000 pop) (That might be effected).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 47 km NE of Anse-Bertrand, Guadeloupe."}, {"id": "9b12774e-7889-411d-a97b-5c2d03083131", "title": "Light earthquake , 4 . 3 mag has occurred near Agat Village in Guam", "date": "2024-05-20 12:00", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-has-occurred-near-agat-village-in-guam/", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Monday, 28 kilometers (17 miles) from Agat Village in Guam.\nThe earthquake occurred at a depth of 141.411 km (88 miles) below the earth’s surface.\nClosest city/cities/towns to epicentrum/hypocenter was Yigo Village, Dededo Village, Barrigada Village (min 5000 pop).\nEpicenter of the earthquake was 50 km (31 miles) from Dededo Village (c. 44 900 pop), 55 km (34 miles) from Yigo Village (c. 20 500 pop), 43 km (26 miles) from Tamuning-Tumon-Harmon Village (c. 19 700 pop), 44 km (27 miles) from Mangilao Village (c. 15 200 pop), 44 km (27 miles) from Barrigada Village (c. 8 900 pop), 29 km (18 miles) from Santa Rita Village (c. 7 500 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 28 km W of Agat Village, Guam."}, {"id": "eed4691b-2f8c-4ef2-b1b1-91ae4c2c1bbc", "title": "Light earthquake , 4 . 3 mag was detected near Yawatahama in Japan", "date": "2024-05-20 08:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-was-detected-near-yawatahama-in-japan/", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Wednesday, 15 kilometers (9 miles) from Yawatahama in Japan.\nThe epicenter was at a depth of 53.956 km (34 miles).\nThe 4.3-magnitude earthquake was detected at 15:37:55 / 3:37 pm (local time epicenter).\nCountry/countries that might be effected, Japan (c. 127 288 000 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 15 km S of Yawatahama, Japan."}, {"id": "d79028be-a5d0-4023-a320-51adbd943e4f", "title": "Light earthquake : M4 . 9 quake has struck near Santa Gertrudis Miramar in Mexico", "date": "2024-05-20 08:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-m4-9-quake-has-struck-near-santa-gertrudis-miramar-in-mexico/", "message": "A light earthquake with magnitude 4.9 (ml/mb) was detected on Monday, 34 kilometers (21 miles) from Santa Gertrudis Miramar in Mexico.\nIds that are associated to the earthquake: us6000mzrz.\nThe epicenter of the earthquake was roughly 35 km (22 miles) below the earth’s surface.\nNearby country/countries, Mexico (c. 112 469 000 pop) (That might be effected).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 34 km S of Santa Gertrudis Miramar, Mexico."}, {"id": "5097530e-2fab-4a72-8b5f-a27a7d0e25b4", "title": "Light earthquake 4 . 3 mag , 12 km SSW of San Rafael , Philippines", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-12-km-ssw-of-san-rafael-philippines/", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Thursday, 12 kilometers (7 miles) from San Rafael in Philippines.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nExact location of earthquake, 123.6404° East, 12.7842° North, depth 10 km.\nEpicenter of the earthquake was 41 km (25 miles) from Legaspi (c. 179 500 pop), 76 km (47 miles) from Iriga City (c. 94 800 pop), 44 km (27 miles) from Sorsogon (c. 82 700 pop), 59 km (37 miles) from Polangui (c. 77 100 pop), 61 km (38 miles) from Libon (c. 68 800 pop), 65 km (40 miles) from Tabaco (c. 57 900 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 12 km SSW of San Rafael, Philippines."}, {"id": "fb1400d0-3393-4204-8458-83a683f8736a", "title": "Light earthquake , 4 . 3 mag strikes near Ocotillo Wells in CA", "date": "2024-05-20 13:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-strikes-near-ocotillo-wells-in-ca/", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Monday, 17 kilometers (11 miles) from Ocotillo Wells in CA.\nThe earthquake occurred at a depth of 11.98 km (7 miles) below the earth’s surface.\nNearby country/countries that might be effected, Mexico (c. 112 469 000 pop), United States (c. 310 233 000 pop).\nIn the past 24 hours, there have been two, in the last 10 days fourty-one, in the past 30 days fourty-two and in the last 365 days fourty-two earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 17 km SE of Ocotillo Wells, CA."}, {"id": "3cd536e7-852c-4e41-a274-99e05ac983d4", "title": "Governor seeking Presidential Disaster Declaration for additional SETX counties", "date": "2024-05-20 15:00", "url": "https://kfdm.com/news/local/governor-seeking-presidential-disaster-declaration-for-additional-setx-counties", "message": "\"The severe storms that swept across the state caused damage of such severity and magnitude that I am requesting eight additional counties be added to the Presidential Disaster Declaration,” said Governor Abbott.\nAdditional counties may be added to the Governor’s request as additional damage assessments are completed in affected communities.\nThe Governor first amended his disaster declaration on May 2, updated it further on May 7, and amended the state declaration again on May 15.\n-Requesting a Presidential Disaster Declaration on May 15 for Texas communities impacted by severe storms.\n-Securing partial approval of a Presidential Disaster Declaration on May 17 for areas of the state affected by severe weather."}, {"id": "dabe94ff-4bc1-4a00-9130-963de71322f8", "title": "Light earthquake , 4 . 4 mag has occurred near Yacuiba in Bolivia", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-4-mag-has-occurred-near-yacuiba-in-bolivia/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 20 kilometers (12 miles) from Yacuiba in Bolivia on Sunday.\nThe epicenter of the earthquake was roughly 527.437 km (328 miles) below the earth’s surface.\nEarthquake epicenter was 21 km (13 miles) from Yacuiba (c. 82 800 pop), 37 km (23 miles) from Tartagal (c. 60 800 pop), 46 km (29 miles) from General Enrique Mosconi (c. 19 800 pop).\nClose country/countries that might be effected, Argentina (c. 41 343 000 pop), Bolivia (c. 9 947 000 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 20 km SSW of Yacuiba, Bolivia."}, {"id": "86bab9b4-87ec-4dec-a6d8-89a9fc02e694", "title": "Light earthquake , 4 . 3 mag was detected near Arica in Chile", "date": "2024-05-20 05:00", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-was-detected-near-arica-in-chile/", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Saturday, 55 kilometers (34 miles) from Arica in Chile.\nThe earthquake occurred at a depth of 120.894 km (75 miles).\nThe epicenter was 88 km (54 miles) from Tacna (c. 280 100 pop), 55 km (34 miles) from Arica (c. 186 000 pop).\nNearby country/countries, Chile (c. 16 746 000 pop), Peru (c. 29 907 000 pop) (That might be effected).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 55 km ESE of Arica, Chile."}, {"id": "6a4ebe00-f967-43c6-b30f-63fdbf1ea4da", "title": "Light earthquake , 4 . 5 mag has occurred near Farkhār in Afghanistan", "date": "2024-05-20 22:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-5-mag-has-occurred-near-farkhar-in-afghanistan/", "message": "A light earthquake with magnitude 4.5 (ml/mb) was detected on Monday, 46 kilometers (29 miles) from Farkhār in Afghanistan.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 4.5-magnitude earthquake was detected at 20:34:41 / 8:34 pm (local time epicenter).\nNearby country/countries, Afghanistan (c. 29 121 000 pop) (That might be effected).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 46 km E of Farkhār, Afghanistan."}, {"id": "0bb4f5cf-19ba-49b5-abd6-a1f6e067f9c3", "title": "Light earthquake , 4 . 3 mag was detected near Kegen in Kazakhstan", "date": "2024-05-20 20:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-was-detected-near-kegen-in-kazakhstan/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 23 kilometers (14 miles) from Kegen in Kazakhstan on Monday.\nThe earthquake occurred at a depth of 16.058 km (10 miles).\nThe epicenter was 69 km (43 miles) from Karakol (c. 70 200 pop), 61 km (38 miles) from Tyup (c. 13 400 pop), 23 km (14 miles) from Kegen (c. 10 000 pop).\nNearby country/countries, Kyrgyzstan (c. 5 509 000 pop), Kazakhstan (c. 15 340 000 pop) (That might be effected).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 23 km SSW of Kegen, Kazakhstan."}, {"id": "281ee97c-6496-41c7-9afd-f8a1fefdda94", "title": "Stay Safe and Healthy During and After Emergencies", "date": "2024-05-20 09:30", "url": "https://www.benningtonbanner.com/online_features/health_and_wellness/stay-safe-and-healthy-during-and-after-emergencies/article_82a05e24-5c93-5200-84ea-57f73f448c78.html", "message": "If you'd like to leave a comment (or a tip or a question) about this story with the editors, please email usWe also welcome letters to the editor for publication; you can do that by filling out our letters form and submitting it to the newsroom."}, {"id": "c50624f4-1c7a-44b1-8e1f-2afea751745e", "title": "Stay Safe and Healthy During and After Emergencies", "date": "2024-05-20 10:45", "url": "https://www.yumasun.com/online_features/health_and_wellness/stay-safe-and-healthy-during-and-after-emergencies/article_b3862f7b-3372-5739-ba19-a7bdd28dbe76.html", "message": "Our directory features more than 18 million business listings from across the entire US.\nHowever, if we're missing your business, add your business by clicking on Add Your Business."}, {"id": "23178741-9f2b-484d-bd5d-be077ea2d7da", "title": "Stay Safe and Healthy During and After Emergencies", "date": "2024-05-20 12:30", "url": "https://www.chanute.com/online_features/health_and_wellness/article_9986e6a0-b888-5d75-a991-218c9a61d649.html", "message": "VideosSorry, there are no recent results for popular videos."}, {"id": "8ff4dfe9-a006-40ec-b83c-ae994f875086", "title": "Stay Safe and Healthy During and After Emergencies", "date": "2024-05-20 12:00", "url": "https://www.reformer.com/online_features/health_and_wellness/stay-safe-and-healthy-during-and-after-emergencies/article_c2a21327-e605-55d4-90e7-ec5ddb40e4e1.html", "message": "MONTPELIER — Pointing at several pieces of data, lawmakers applauded what they called the \"strong and positive impact of tourism on Vermont’s …"}, {"id": "37bc5d51-b2a0-4117-bc21-71eaad78da96", "title": "Light earthquake , 4 . 4 mag has occurred near Wāngjing in India", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-4-mag-has-occurred-near-wangjing-in-india-2/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 77 kilometers (48 miles) from Wāngjing in India on Tuesday.\nThe earthquake occurred at a depth of 115.989 km (72 miles) below the earth’s surface.\nClose country/countries that might be effected, India (c. 1 173 108 000 pop), Myanmar (c. 53 414 000 pop).\nEpicenter of the earthquake was 89 km (55 miles) from Mawlaik (c. 44 500 pop), 86 km (53 miles) from Thoubāl (c. 44 500 pop), 83 km (52 miles) from Kakching (c. 30 400 pop), 83 km (52 miles) from Yairipok (c. 8 800 pop), 78 km (48 miles) from Wāngjing (c. 7 500 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 77 km ESE of Wāngjing, India."}, {"id": "8fba368a-d4fa-4bb0-bc26-c42fa9efddce", "title": "Light earthquake , 4 . 3 mag was detected near Shima in Japan", "date": "2024-05-20 12:00", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-was-detected-near-shima-in-japan/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 14 kilometers (9 miles) from Shima in Japan on Sunday.\nThe earthquake occurred at a depth of 328.88 km (204 miles).\nIds that are associated to the event: us7000mdna.\nNearby country/countries that might be effected, Japan (c. 127 288 000 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 14 km ENE of Shima, Japan."}, {"id": "b0a5ff2a-0854-454e-a5be-b54f19b74d6d", "title": "Light earthquake : M4 . 3 quake has struck near Bandipura in India", "date": "2024-05-20 05:00", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-m4-3-quake-has-struck-near-bandipura-in-india/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 41 kilometers (25 miles) from Bandipura in India on Monday.\nExact time and date of earthquake 20/05/24 / 2024-05-20 00:19:09 / May 20, 2024 @ 12:19 am UTC/GMT.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nCountry/countries that might be effected, India (c. 1 173 108 000 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 41 km N of Bandipura, India."}, {"id": "944df913-45ba-4615-b1f3-7fff81e44bd8", "title": "Light earthquake : M4 . 3 quake has struck near Yamada in Japan", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-m4-3-quake-has-struck-near-yamada-in-japan-3/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was detected on Tuesday, 6 kilometers (4 miles) from Yamada in Japan.\nThe earthquake occurred at a depth of 48.257 km (30 miles).\nCountry/countries that might be effected, Japan (c. 127 288 000 pop).\nIn the past 24 hours, there have been two, in the last 10 days two, in the past 30 days two and in the last 365 days two earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 6 km SSE of Yamada, Japan."}, {"id": "40ceeb37-27eb-402c-94b0-3e5a0f2e4058", "title": "Light earthquake , 4 . 3 mag has occurred near Islay ( Matarani ) in Peru", "date": "2024-05-20 06:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-has-occurred-near-islay-matarani-in-peru/", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Tuesday, 16 kilometers (10 miles) from Islay (Matarani) in Peru.\nExact location of earthquake, longitude -72.1011 West, latitude -16.8447 South, depth = 78.841 km.\nThe earthquake occurred at a depth of 78.841 km (49 miles) below the earth’s surface.\nCountry/countries that might be effected, Peru (c. 29 907 000 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 16 km N of Islay (Matarani), Peru."}, {"id": "d42fba07-9336-4cfb-aacb-aec2b4a49fd8", "title": "Light earthquake , 4 . 3 mag was detected near Chiba in Japan", "date": "2024-05-20 13:45", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-was-detected-near-chiba-in-japan/", "message": "A light earthquake magnitude 4.3 (ml/mb) strikes 4 kilometers (2 miles) from Chiba in Japan on Tuesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 71.115 km (44 miles) below the earth’s surface.\nThe 4.3-magnitude earthquake has occurred at 17:01:58 / 5:01 pm (local time epicenter).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 4 km SW of Chiba, Japan."}, {"id": "4eb877b2-f44c-4cab-9d34-a00cfbcfd1c9", "title": "Light earthquake 4 . 4 mag , 12 km ENE of Abuyog , Philippines", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/19/light-earthquake-4-4-mag-12-km-ene-of-abuyog-philippines/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 12 kilometers (7 miles) from Abuyog in Philippines on Friday.\nExact location of earthquake, 125.1224° East, 10.7819° North, depth 10.125 km.\nThe epicenter of the earthquake was roughly 10.125 km (6 miles) below the earth’s surface.\nThe epicenter was 62 km (38 miles) from Ormoc (c. 191 200 pop), 54 km (33 miles) from Panalanoy (c. 189 100 pop), 78 km (49 miles) from Maasin (c. 18 300 pop), 37 km (23 miles) from Baybay (c. 17 700 pop), 44 km (27 miles) from Palo (c. 17 500 pop), 75 km (47 miles) from Carigara (c. 17 500 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 12 km ENE of Abuyog, Philippines."}, {"id": "75f339b0-25c1-467b-a8d5-9e21d4759038", "title": "Light earthquake , 4 . 4 mag strikes near Pahiatua in New Zealand", "date": "2024-05-20 01:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-4-mag-strikes-near-pahiatua-in-new-zealand/", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Saturday, 6 kilometers (4 miles) from Pahiatua in New Zealand.\nExact location of earthquake, 175.7775° East, -40.4856° South, depth 30.014 km.\nThe epicenter was at a depth of 30.014 km (19 miles).\nCountry/countries that might be effected, New Zealand (c. 4 252 000 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 6 km WSW of Pahiatua, New Zealand."}, {"id": "39df76c3-f304-47a1-a908-afea1460966c", "title": "Light earthquake : M4 . 4 quake has struck near Borūjen in Iran", "date": "2024-05-20 03:15", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-m4-4-quake-has-struck-near-borujen-in-iran/", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 41 kilometers (25 miles) from Borūjen in Iran on Saturday.\nExact location of event, depth 10 km, 51.1531° East, 31.6045° North.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nClose country/countries, Iran (c. 76 923 000 pop) (That might be effected).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 41 km SSW of Borūjen, Iran."}, {"id": "20a8d91e-347f-4583-a458-52eaaf1606fe", "title": "U . S . hasnt seen an EF5 tornado in 11 years , longest gap in history", "date": "2024-05-20 16:15", "url": "https://www.upi.com/Science_News/2024/05/20/EF5-tornado-11-year-gap/4221716215687/", "message": "File Photo by J.P. Wilson/UPI | License PhotoAn EF5 tornado is one of the most catastrophic weather events on Earth.\nAdvertisementBefore the Moore tornado, the blockbuster tornado season in 2011 led to the confirmation of five EF5 twisters, including the Joplin, Missouri, EF5 that killed 161 people.\nBecause most weather instruments can't survive tornadoes, the EF scale estimates tornado strength based on NWS staff investigating damage indicators.\nThis precedent was reaffirmed by the El Reno tornado on May 31, 2013, which tracked just south of El Reno, Oklahoma.\nBecause of the damage found, the El Reno tornado, despite being the largest twister ever recorded at 2.6 miles wide, was confirmed as an EF3."}, {"id": "0ff95285-1046-4a1c-ac37-177c881e1025", "title": "Light earthquake , 4 . 3 mag strikes near El Crucero in Nicaragua", "date": "2024-05-20 12:00", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-strikes-near-el-crucero-in-nicaragua/", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Sunday, 10 kilometers (6 miles) from El Crucero in Nicaragua.\nThe earthquake was roughly at a depth of 114.063 km (71 miles).\nIds that are associated to the event: us7000mdkh.\nCountry/countries that might be effected, Nicaragua (c. 5 996 000 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 10 km WSW of El Crucero, Nicaragua."}, {"id": "67eac009-1d79-4e55-a078-fe2b20de5781", "title": "Light earthquake 4 . 3 mag , 23 km E of Challabamba , Peru", "date": "2024-05-20 08:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-23-km-e-of-challabamba-peru/", "message": "A light earthquake with magnitude 4.3 (ml/mb) was detected on Wednesday, 23 kilometers (14 miles) from Challabamba in Peru.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nClose country/countries, Peru (c. 29 907 000 pop) (That might be effected).\nEpicenter of the event was 65 km (40 miles) from Cusco (c. 312 100 pop), 56 km (35 miles) from Calca (c. 9 200 pop), 73 km (46 miles) from Urubamba (c. 7 500 pop), 81 km (50 miles) from Anta (c. 5 900 pop), 53 km (33 miles) from Urcos (c. 5 500 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 23 km E of Challabamba, Peru."}, {"id": "907edf0f-d4d1-490e-a912-4a77dc5e4df0", "title": "An off - the - grid island beach cottage is now for sale in the Florida Keys", "date": "2024-05-20 21:00", "url": "https://www.orlandoweekly.com/orlando/an-off-the-grid-island-beach-cottage-is-now-for-sale-in-the-florida-keys/Slideshow/36910554", "message": "There are only about a dozen homes on Florida's isolated Cook Island, and now one of them is for sale.Located at 3 W. Cook Burg Pne., the beach cottage was built in 1985 and is truly \"off-the-grid\" in just about every way.There are no utilities on Cook Island, so the home uses solar power and gets its water from a rain cistern.Accessible only by boat or seaplane, Cook Island sits near Big Pine Island in the Florida Keys, and was first settled by Captain Percy Cook in the 1920s.\nFor years was it used as a fish camp for wintering vacationers from the north.Though sparsely populated, Cook Island bore the brunt of Hurricane Irma, which damaged many of the homes, including this one, when the storm made landfall as a Category 4 hurricane in 2017.Today, the cottage has been raised from the sand.\nIts 704 square feet of living space include three bedrooms and two bathrooms.\nIt also comes with a dock permit, since the old one appears to have been blown away.Asking price for the beach cottage is currently $799,000 and the listing agents are Dave Wiley and Banks G. Prevatt of Coldwell Banker Schmitt RE Co. Lower Keys Office."}, {"id": "2da03b83-f7e6-4b5f-b5b7-f16c319f995a", "title": "Light earthquake 4 . 5 mag , 37 km NE of Yigo Village , Guam", "date": "2024-05-20 15:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-5-mag-37-km-ne-of-yigo-village-guam/", "message": "A light earthquake magnitude 4.5 (ml/mb) strikes 37 kilometers (23 miles) from Yigo Village in Guam on Monday.\nClose country/countries that might be effected, Guam (c. 159 000 pop).\nEpicenter of the event was 42 km (26 miles) from Dededo Village (c. 44 900 pop), 37 km (23 miles) from Yigo Village (c. 20 500 pop), 49 km (31 miles) from Tamuning-Tumon-Harmon Village (c. 19 700 pop), 51 km (32 miles) from Mangilao Village (c. 15 200 pop), 49 km (31 miles) from Barrigada Village (c. 8 900 pop), 65 km (41 miles) from Santa Rita Village (c. 7 500 pop), 51 km (31 miles) from Mongmong-Toto-Maite Village (c. 6 800 pop).\nClosest city/cities/towns to epicentrum/hypocenter was Merizo Village, Umatac Village, Inarajan Village (min 5000 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 37 km NE of Yigo Village, Guam."}, {"id": "00008367-7ea0-40e3-8602-c70d0324c74a", "title": "Light earthquake , 4 . 3 mag strikes near Puerto San José in Guatemala", "date": "2024-05-20 22:30", "url": "https://www.earthquakenewstoday.com/2024/05/20/light-earthquake-4-3-mag-strikes-near-puerto-san-jose-in-guatemala-5/", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Thursday, 16 kilometers (10 miles) from Puerto San José in Guatemala.\nThe epicenter was at a depth of 85.264 km (53 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nNearest city/cities or towns, with min 5000 pop, to epicentrum/hypocenter was Zaragoza, San Lucas Sacatepéquez, Santa Rosa de Lima.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 16 km SW of Puerto San José, Guatemala."}, {"id": "0bf5dc17-210e-450a-844f-d234bd39b2bf", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-20 00:00", "url": "https://www.saobserver.net/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "05002e44-2be3-440d-a359-484d79a27914", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-20 00:30", "url": "https://www.peacearchnews.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "1d070ac6-34d3-4c71-a38a-38331b2fc86e", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-20 00:30", "url": "https://www.northislandgazette.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "f8e2bbcd-a1d5-4d27-9cd8-6f048627bf6a", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-20 00:30", "url": "https://www.kelownacapnews.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "2cb22b83-5e32-4c9d-b9b8-c8af84be9c4e", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-20 00:30", "url": "https://www.aldergrovestar.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "477083c3-1d61-44c6-8039-9544b417f2fb", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-20 01:45", "url": "https://www.campbellrivermirror.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "f1d31c05-4fe4-406f-805b-521ff2f3fbf7", "title": "4 homes lost to wildfire near Fort Nelson , mayor says", "date": "2024-05-20 01:45", "url": "https://www.comoxvalleyrecord.com/news/4-homes-lost-to-wildfire-near-fort-nelson-mayor-says-7362036", "message": "Evacuation orders remain in place around northern community, despite recent rain aiding effortsThe Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nFire crews have also placed “structural protection measures” on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said.\nmayor warns against videos of properties destroyed by fire near Fort NelsonThe Canadian Press"}, {"id": "ad78c12b-5cb3-4ba5-bad9-d8d64dd7acdc", "title": "Northern Rockies Regional Municipality says four homes lost in wildfire", "date": "2024-05-20 21:00", "url": "https://www.kamloopsbcnow.com/watercooler/news/news/Provincial/Northern_Rockies_Regional_Municipality_says_four_homes_lost_in_wildfire/", "message": "The Mayor of British Columbia’s Northern Rockies Regional Municipality says four homes have been lost and six other properties have been damaged by a wildfire that forced the evacuation of Fort Nelson more than a week ago.\nRob Fraser says three of the four homes were occupied and one was vacant, but he’s been able to speak with most of the owners whose properties have been damaged.\nFraser says the affected properties were on the outskirts of Fort Nelson, and the six others saw damage to sheds, shops and vehicles.\nIn an update posted late Saturday, the municipality said forecasted rain has provided \"a window for progress,\" but problematic drought conditions remain.\nFire crews have also placed \"structural protection measures\" on 200 homes in Fort Nelson, and crews are being aided by both helicopters and heavy equipment, the update said."}, {"id": "0ab281e6-44ea-4a88-bf14-256fd4375da9", "title": "Houston Heights storm recovery : 175 - foot crane needed to remove giant tree from roof of home", "date": "2024-05-20 05:45", "url": "https://abc13.com/post/heights-houston-deadly-storm-recovery-cleanup-tree-fell-on-house/14844608/", "message": "Houston Heights storm recovery: 175-foot crane needed to remove giant tree from roof of homeCommunities across southeast Texas are still cleaning up after being battered by Thursday's deadly storm.\nCommunities across southeast Texas are still cleaning up after being battered by Thursday's deadly storm.\nCommunities across southeast Texas are still cleaning up after being battered by Thursday's deadly storm.\nCommunities across southeast Texas are still cleaning up after being battered by Thursday's deadly storm.\nHOUSTON, Texas (KTRK) -- Communities across southeast Texas are still working on cleanup after being battered by Thursday's deadly storm."}, {"id": "b46710c8-50f3-4237-bfbb-712e176d0e8c", "title": "A  drifting  postbox for letters to people who died in the 2011 Japan Earthquake kept running", "date": "2024-05-20 01:30", "url": "https://asianews.network/a-drifting-postbox-for-letters-to-people-who-died-in-the-2011-japan-earthquake-kept-running/", "message": "May 20, 2024MORIOKA – A unique postbox that receives letters with messages for people who died in the 2011 Great East Japan Earthquake stands on the Hirota Peninsula in Rikuzen-Takata, Iwate Prefecture.\nHowever, when he saw people who had lost their family members due to the Noto Peninsula Earthquake, he changed his mind.\nAkagawa named the postbox “Drifting 3.11 Postbox” as it is the place where letters with nowhere to go would end up drifting.\nAmid such circumstances, the situation in the areas hit by the Jan. 1 Noto Peninsula Earthquake reminded Akagawa of the situation immediately after the 2011 disaster.\n“I am relieved that I could find a new custodian of the postbox,” Akagawa said."}, {"id": "f20239e8-28b8-48e6-b3b9-32bed534f048", "title": "Reviving Sri Lanka Mangroves : Fusion of Science , Community", "date": "2024-05-20 12:30", "url": "https://www.miragenews.com/reviving-sri-lankas-mangroves-fusion-of-science-1238581/", "message": "The United Nations recently named Sri Lankas mangrove regeneration programme among its 2024 World Restoration Flagships, an award that recognizes outstanding efforts to rekindle nature.\nThe ecosystems protective function was dramatically highlighted by the Indian Ocean tsunami in 2004, which killed more than 30,000 people in Sri Lanka.\nNurturing natureFollowing the tsunami, Sri Lanka undertook a mass drive to restore mangroves.\nIn some places, researchers are assessing the makeup of potential mangrove restoration sites, including their soil and water quality.\nWe hope this will make Sri Lanka more beautiful."}, {"id": "b1ac45b4-7c63-4ac0-8a7c-6d76e62bec76", "title": "2024 Houston windstorm disaster : Where to get help with food , shelter and other services", "date": "2024-05-20 23:00", "url": "https://abc13.com/post/2024-houston-windstorm-disaster-food-shelter-services/14832624/", "message": "We know how important it is for storm victims to find fresh food, clean water, shelter, and even mental health services after severe weather moves out.\nGiving back: How to help Houston windstorm victimsFood AssistanceHouston Food Bank offers food assistance with the help of more than 1,600 community partners in 18 counties across SE Texas.\nIf you need food assistance, please call 832-369-9390.\nYou can also click here to find free food assistance in your area.\nCypressCypress Assistance Ministries provides rent and utility assistance for residents living in the following zip codes: 77065, 77095, 77429, 77433."}, {"id": "fb8be5ab-5a36-41c7-8be6-5e160c4d1364", "title": "Fort McMurray wildfire classified as  being held  ", "date": "2024-05-20 16:15", "url": "https://globalnews.ca/news/10512638/fort-mcmurray-wildfire-being-held/", "message": "Send this page to someone via emailA wildfire burning near Fort McMurray in northeastern Alberta is now classified as “being held.”In an update at 7 p.m. Sunday, Alberta Wildfire downgraded the status of the wildfire, which was previously classified as out of control.\n“Given current weather conditions and resources, the wildfire is not anticipated to grow past expected boundaries,” Alberta Wildfire said in its Sunday evening update.\nStory continues below advertisementThe wildfire danger is low in the Fort McMurray Forest Area.\n“Firefighters and heavy equipment operators have been able to take advantage of the recent rain to make excellent progress on containing the wildfire,” Alberta Wildfire said.\nFor the latest information on the wildfire status and danger across the province, visit the Alberta Wildfire website."}, {"id": "7f839b6e-d33d-4373-9c13-aadeb37016a8", "title": "Essential Items You Need in Your Louisiana Hurricane Kit", "date": "2024-05-20 19:45", "url": "https://gator995.com/ixp/159/p/essential-items-you-absolutely-need-in-your-louisiana-hurricane-kit-2/", "message": "The first day of Hurricane Season is two weeks away, so that means t's time to get your hurricane preparedness kit stocked up and ready to be used if you need it.\nHurricane Ida Makes Landfall In Louisiana Leaving Devastation In Its Wake Getty Images loading...\nThe American Red Cross has published a guide of key items you should have in your hurricane kit.\nI recommend getting plastic totes to store the items in so they can be stored easily and moved to a vehicle if you need to evacuate.\nEssential Items for Your Hurricane KitHere are some other items The American Red Cross recommends you have in your hurricane kit:Multi-purpose toolCell P hone s, Tablets and Laptop Computers with C hargersFamily and E mergency C ontact I nformationEmergency B lanketMap s of the A reaBaby suppliesPet suppliesExtra KeysExtra C lothingInsect R epellent and S unscreen"}, {"id": "11fff2b0-2550-4a13-9144-2a4ba0223aac", "title": "Essential Items You Need in Your Louisiana Hurricane Kit", "date": "2024-05-20 20:15", "url": "https://929thelake.com/essential-items-you-absolutely-need-in-your-louisiana-hurricane-kit-2/", "message": "The first day of Hurricane Season is two weeks away, so that means t's time to get your hurricane preparedness kit stocked up and ready to be used if you need it.\nHurricane Ida Makes Landfall In Louisiana Leaving Devastation In Its Wake Getty Images loading...\nThe American Red Cross has published a guide of key items you should have in your hurricane kit.\nI recommend getting plastic totes to store the items in so they can be stored easily and moved to a vehicle if you need to evacuate.\nEssential Items for Your Hurricane KitHere are some other items The American Red Cross recommends you have in your hurricane kit:Multi-purpose toolCell P hone s, Tablets and Laptop Computers with C hargersFamily and E mergency C ontact I nformationEmergency B lanketMap s of the A reaBaby suppliesPet suppliesExtra KeysExtra C lothingInsect R epellent and S unscreen"}, {"id": "3998c0ce-8c68-4c6d-a072-d5113c8590fe", "title": "Essential Items You Need in Your Louisiana Hurricane Kit", "date": "2024-05-20 23:30", "url": "https://cajunradio.com/ixp/159/p/essential-items-you-absolutely-need-in-your-louisiana-hurricane-kit-2/", "message": "The first day of Hurricane Season is two weeks away, so that means t's time to get your hurricane preparedness kit stocked up and ready to be used if you need it.\nHurricane Ida Makes Landfall In Louisiana Leaving Devastation In Its Wake Getty Images loading...\nThe American Red Cross has published a guide of key items you should have in your hurricane kit.\nI recommend getting plastic totes to store the items in so they can be stored easily and moved to a vehicle if you need to evacuate.\nEssential Items for Your Hurricane KitHere are some other items The American Red Cross recommends you have in your hurricane kit:Multi-purpose toolCell P hone s, Tablets and Laptop Computers with C hargersFamily and E mergency C ontact I nformationEmergency B lanketMap s of the A reaBaby suppliesPet suppliesExtra KeysExtra C lothingInsect R epellent and S unscreen"}, {"id": "f1b414b1-398a-4025-a90f-3c1b36ee9b05", "title": "Afghanistan floods highlight risks of extreme weather events to children - Afghanistan", "date": "2024-05-20 14:15", "url": "https://reliefweb.int/report/afghanistan/afghanistan-floods-highlight-risks-extreme-weather-events-children", "message": "KABUL, 20 May 2024 – Afghanistan has been hit by flash floods twice in the span of one week, highlighting the country’s susceptibility to extreme weather events and the impact on children.\nFloods at the weekend in the western province of Ghor and Faryab province in the north brought further devastation and killed at least 110* people, including children.\nArshad Malik, Country Director of Save the Children Afghanistan, said:“Extreme weather events pose a serious risk to all children in Afghanistan whose families or communities rely on farming to survive.\nThis equates to nearly 13.2 million children or 70% of children in Afghanistan.\nNotes*At least 50 people were killed as of Saturday 18 May in Ghor province, according to figures given by the de facto authorities."}, {"id": "322e3a23-9ac8-4623-a64a-4297ad03ff37", "title": "FEMA disaster assistance : Federal funding available for some Texas counties after deadly , destructive storm across Houston area", "date": "2024-05-20 23:00", "url": "https://abc13.com/post/fema-disaster-assistance-federal-funding-texas-counties-after/14848005/", "message": "How to get help from FEMA if you were impacted by last week's destructive stormsFEMA inspectors are in southeast Texas responding to neighbors who applied for disaster assistance.\nFEMA inspectors are in southeast Texas responding to neighbors who applied for disaster assistance.\nFEMA inspectors are in southeast Texas responding to neighbors who applied for disaster assistance.\nFEMA inspectors are in southeast Texas responding to neighbors who applied for disaster assistance.\nFEMA is offering disaster assistance to Texans recovering from last week's destructive storm and last month's flooding."}, {"id": "3a37804c-e51e-424f-afb6-7ce5bea60650", "title": "127 MPH Winds Reported in Houston on Thursday", "date": "2024-05-20 03:30", "url": "https://us105fm.com/ixp/154/p/hurricane-force-winds-houston/", "message": "One report from the Texas Storm Chasers recorded 127.5 MPH winds just west of Downtown Houston.\nAt one point, more than 1 million power outages were reported in Texas, most in the Houston area.\nLarge electricity towers have been destroyed and schools have been canceled for Friday throughout Houston.\nAccording to weather.com, residents were warned to brace for extended power outages due to damage to 10 major power transmission lines.\nOn this year's prediction map, Houston and Galveston have red circles for direct landfalls."}, {"id": "43cfcd72-d463-4cc9-a563-89452c0dc4a6", "title": "Governor Abbott requests disaster assistance for additional counties impacted by weather", "date": "2024-05-20 06:45", "url": "https://www.kbtx.com/2024/05/20/governor-abbott-requests-disaster-assistance-additional-counties-impacted-by-weather/", "message": "AUSTIN, Texas (KBTX) - KBTX spoke with Walker County Emergency Management Sunday afternoon who told us FEMA is on the ground accessing flooding and storm damage.\nOn Friday, Walker County was among the Texas counties approved by President Biden in the state’s request for a Major Disaster Declaration.\nIt was a partial approval, and on Sunday, Governor Abbott announced he was requesting FEMA disaster assistance for additional counties.\nGovernor Abbott’s request for FEMA’s Public Assistance program, which would ensure eligibility for 26 designated counties to utilize grant funding, remains under review.\nIn our area that includes Grimes, Leon, Madison, Milam, Montgomery and Walker counties."}, {"id": "06a9d42b-920f-41d5-b5d9-32951c2d3623", "title": "Power expected to be restored to most affected by deadly Houston storm", "date": "2024-05-20 02:00", "url": "https://www.columbian.com/news/2024/may/19/power-expected-to-be-restored-to-most-affected-by-deadly-houston-storm/", "message": "HOUSTON — Houston area residents affected by deadly storms last week that left at least seven dead were finally getting some good news as officials said they expected power to be restored by Sunday evening to a majority of the hundreds of thousands still in the dark and without air conditioning amid hot and humid weather.\nThe widespread destruction of Thursday’s storms brought much of Houston to a standstill.\nA tornado also touched down near the northwest Houston suburb of Cypress.\nMore than 352,000 homes and businesses in Texas remained without electricity Sunday morning, with most of those in the Houston area.\nNo hot water."}, {"id": "7f7461bd-a047-4c2e-9a22-0e21bbc8035a", "title": "Waynesville Rural Fire Protection District receives federal funding to improve wildfire defense", "date": "2024-05-20 21:15", "url": "https://www.ky3.com/2024/05/20/waynesville-rural-fire-protection-district-receives-federal-funding-improve-wildfire-defense/", "message": "(KY3/Editied Release) - The Waynesville Rural Fire Protection District is one of two agencies that received funding from the USDA Forest Service.\nAccording to a news release, the fire department received $250,000 for community wildfire defense.\nThe grant will help the department develop a community wildfire protection plan (CWPP) for Pulaski County.\n“Funding for this CWPP development grant comes from the Community Wildfire Defense Grant Program, which is designed to assist communities (including Tribal communities), nonprofit organizations, and state forestry agencies with planning for and mitigating wildfire risks.\nThe second agency that received funding was Specialty Lumber Solutions for their Missouri Community Biochar Production Project."}, {"id": "fa13f696-4ef4-4854-b0fe-61c85c1c96b9", "title": "Forecast First Alert : Strong storms possible Tuesday afternoon for Minnesota , Wisconsin", "date": "2024-05-20 14:45", "url": "https://kstp.com/kstp-news/top-news/forecast-first-alert-strong-storms-possible-tuesday-afternoon-for-minnesota-wisconsin/", "message": "Thunderstorms rumbled through the Twin Cities early Monday morning, with a 5 EYEWITNESS NEWS photographer capturing video of distant lightning.\nAlthough rain and storms are possible during the early morning hours, another round of stronger storms is possible later in the day, just in time for the drive home from work.\nSevere and strong storms are most likely to hit southeastern Minnesota and southern Wisconsin on Tuesday, as well as a large part of Iowa – however, the storm system is still forming, and the exact target area has yet to be determined.\nExpect heavy rain, potentially enough for flash flooding and lingering river flooding.\nCurrently, rain totals from Sunday night through Tuesday night may total 1-2″, but areas with stronger storms could push some totals as high as 4″."}, {"id": "09d91328-6b24-473c-90cb-f739b5efe273", "title": "Status of wildfire that threatened Fort McMurray changed to  being held  – Winnipeg Free Press", "date": "2024-05-20 19:00", "url": "https://www.winnipegfreepress.com/canada/2024/05/20/status-of-wildfire-that-threatened-fort-mcmurray-changed-to-being-held", "message": "FORT MCMURRAY, Alta.\n– A wildfire that forced thousands of people to evacuate several Fort McMurray neighbourhoods last week is no longer classified as out-of-control.\nA wildfire that forced thousands of people to evacuate several Fort McMurray neighbourhoods last week is no longer classified as out-of-control.\nAn evacuation alert for the entire city of Fort McMurray, which told residents they should be ready to leave at short notice, was lifted at the same time.\nAlberta Wildfire says over 40 millimetres of rain has fallen on the fire since May 16."}, {"id": "a20f5b98-2c8f-43e8-b183-eadd79d8a4eb", "title": "Climate change impacts millions in India . But as the country votes , some politicians skirt the issue", "date": "2024-05-20 03:00", "url": "https://www.independent.co.uk/news/india-ap-congress-heat-cyclones-b2547775.html", "message": "But there has been little talk about climate change on the campaign trail.\n“Climate change is still not among the headlines during these elections despite its obvious impact on millions of Indian lives,” said Anjal Prakash, author of multiple United Nations climate reports.\nHere's a look at how the effects of climate change are influencing voters.\nBut floods are now more devastating and unpredictable because of climate change, locals say, making it harder to stay on the islands.\nConsidered one of the world’s most vulnerable regions to climate change according to a 2021 report, Ali said the lack of political will is only making life harder."}, {"id": "cc841aa3-fdae-4c6b-88b7-44a9c150a6e1", "title": "UK warned to expect  dramatic weather shift  after glorious mini heatwave", "date": "2024-05-20 07:15", "url": "https://www.birminghammail.co.uk/news/uk-news/uk-warned-expect-dramatic-weather-29202623", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nNever miss breaking news by signing up to our free email updatesSomething went wrong, please try again later.\nThey also forewarned there was a small risk that continued heavy showers could result in some areas experiencing 40-50mm of rainfall.\n(Image: Met Office)The Met Office then provided a weather outlook:Monday:A favourable day with ample warm sunshine expected."}, {"id": "20e52f81-3f44-4e7d-9c1f-cfcc4515418d", "title": "Climate change impacts millions in India . But as the country votes , some politicians skirt the issue", "date": "2024-05-20 05:30", "url": "https://www.theglobeandmail.com/world/article-climate-change-impacts-millions-in-india-but-as-the-country-votes-some/", "message": "But there has been little talk about climate change on the campaign trail.\n“Climate change is still not among the headlines during these elections despite its obvious impact on millions of Indian lives,” said Anjal Prakash, author of multiple United Nations climate reports.\nHere’s a look at how the effects of climate change are influencing voters.\nBut floods are now more devastating and unpredictable because of climate change, locals say, making it harder to stay on the islands.\nConsidered one of the world’s most vulnerable regions to climate change according to a 2021 report, Ali said the lack of political will is only making life harder."}, {"id": "e9cd581a-68e3-41f7-ab45-7fdd02dafbc5", "title": "Climate change impacts millions in India . But as the country votes , some politicians skirt the issue", "date": "2024-05-20 03:45", "url": "https://www.startribune.com/climate-change-impacts-millions-in-india-but-as-the-country-votes-some-politicians-skirt-the-issue/600367194/", "message": "But there has been little talk about climate change on the campaign trail.\n''Climate change is still not among the headlines during these elections despite its obvious impact on millions of Indian lives,'' said Anjal Prakash, author of multiple United Nations climate reports.\nHere's a look at how the effects of climate change are influencing voters.\nBut floods are now more devastating and unpredictable because of climate change, locals say, making it harder to stay on the islands.\nConsidered one of the world's most vulnerable regions to climate change according to a 2021 report, Ali said the lack of political will is only making life harder."}, {"id": "e896b926-ad1c-4987-b2a2-14410ef934a5", "title": "SD ranks third in U . S . for wildfire risk , repair costs nearly doubled since 2019", "date": "2024-05-20 22:00", "url": "https://www.yahoo.com/news/sd-ranks-third-u-wildfire-203647777.html", "message": "SD ranks third in U.S. for wildfire risk, repair costs nearly doubled since 2019SAN DIEGO (FOX 5/KUSI) — Wildfire season in California has just begun and Cal Fire has already reported nearly 800 wildfires since the start of the year.\nHowever, although the rankings have remained the same as 2019, the number of homes at high-extreme wildfire risk and cost value for reconstruction have nearly doubled, according to CoreLogic.\nLocally, in the San Diego region, there were over 75,000 homes deemed at high-extreme risk in 2019.\nIn fact, 10 of the 15 areas with the highest wildfire risk in the country are in the Golden State.\nFor the latest news, weather, sports, and streaming video, head to FOX 5 San Diego & KUSI News."}, {"id": "eb9f0e41-909b-4762-8ca6-f22ed26219ab", "title": "Climate change impacts millions in India . But as the country votes , some politicians skirt the issue", "date": "2024-05-20 07:15", "url": "https://www.news-gazette.com/news/nation-world/climate-change-impacts-millions-in-india-but-as-the-country-votes-some-politicians-skirt-the/article_94aa5a8d-6fdb-5f1e-887a-0a555d034bc7.html", "message": "Champaign, IL (61820)TodayA mix of clouds and sun during the morning will give way to cloudy skies this afternoon.\nA stray shower or thunderstorm is possible.\nWinds SSW at 10 to 20 mph..TonightMainly cloudy.\nA stray shower or thunderstorm is possible.\nWinds SSW at 10 to 15 mph."}, {"id": "378fd75b-a934-4025-9fe9-5c753a9ed475", "title": "What does the summer weather outlook look like for Indiana ? ", "date": "2024-05-20 22:45", "url": "https://wishtv.com/weather/weather-stories/what-does-the-summer-weather-outlook-look-like-for-indiana/", "message": "What does the summer weather outlook look like for Indiana?\nThe official start to summer is June 20, but meteorological summer gets going on June 1.\nThe Climate Prediction Center (CPC) has published its outlook for this summer, from June-August.\nTemperature outlook for summerMost of the lower 48, including Indiana, is favored to have above-normal temperatures.\nTreat the outlook like a guide for the entire summer."}, {"id": "97297197-333e-42b9-927a-6e31d0c5db33", "title": "Heaviest Pa . storms drop 60 % more rain than they used to , report says", "date": "2024-05-20 11:00", "url": "https://www.wesa.fm/environment-energy/2024-05-20/pennsylvania-more-rain-climate-change", "message": "A report from the nonprofit science communication group Climate Central says climate change is causing the heaviest storms in Pennsylvania and other northeastern states to drop 60% more rain than they did six decades ago.\nThat’s because a warmer atmosphere can hold more moisture, which can fuel heavy rain events and flash floods.\nClimate CentralGreg Carbin, chief of forecast operations at the National Weather Service Weather Prediction Center, was not involved in the report.\nCarbin said it can be difficult to get people to recognize how dangerous a rain event is, but flooding can destroy homes, sweep away cars, and claim lives.\nOne solution, she said, could be infrastructure that can absorb and hold water during storms, rather than transporting all of it somewhere else."}, {"id": "82de3526-52db-41f1-9219-69766e945512", "title": "Louisiana , Hurricane Season Is Coming Soon - 2024 Hurricane Names", "date": "2024-05-20 14:45", "url": "https://107jamz.com/ixp/149/p/louisiana-hurricane-season-is-coming-soon-2024-hurricane-names/", "message": "Here's a topic no one in Louisiana ever wants to talk about, hurricane season.\nThe 2024 Atlantic Hurricane season begins on June 1, 2024, and from the looks of the storms we have had lately in Louisiana, we may need to stay vigilant.\nAccording to Penntoday.com,A record-breaking 33 named storms are forecasted for the 2024 North Atlantic hurricane season.\nHere is a list of the 2024 Atlantic hurricane names.\ncdn.star.nesdis.noaa.gov cdn.star.nesdis.noaa.gov loading...2024 Atlantic Hurricane Season Storm NamesAlbertoBerylChrisDebbyErnestoFrancineGordonHeleneIsaacJoyceKirkLeslieMiltonNadineOscarPattyRafaelSaraTonyValerieWilliam"}, {"id": "8f85a30b-84a0-4149-9e0d-a27d32fd9760", "title": "Louisiana , Hurricane Season Is Coming Soon - 2024 Hurricane Names", "date": "2024-05-20 14:45", "url": "https://gator995.com/louisiana-hurricane-season-is-coming-soon-2024-hurricane-names/", "message": "Here's a topic no one in Louisiana ever wants to talk about, hurricane season.\nThe 2024 Atlantic Hurricane season begins on June 1, 2024, and from the looks of the storms we have had lately in Louisiana, we may need to stay vigilant.\nAccording to Penntoday.com,A record-breaking 33 named storms are forecasted for the 2024 North Atlantic hurricane season.\nHere is a list of the 2024 Atlantic hurricane names.\ncdn.star.nesdis.noaa.gov cdn.star.nesdis.noaa.gov loading...2024 Atlantic Hurricane Season Storm NamesAlbertoBerylChrisDebbyErnestoFrancineGordonHeleneIsaacJoyceKirkLeslieMiltonNadineOscarPattyRafaelSaraTonyValerieWilliam"}, {"id": "069211d6-dd62-4476-bee1-551a3afbf655", "title": "Severe weather threat looms over SE Michigan -- Here what to expect", "date": "2024-05-20 23:30", "url": "https://www.clickondetroit.com/weather/2024/05/20/severe-weather-threat-looms-over-se-michigan-heres-what-to-expect/", "message": "It is hot and humid across Southeast Michigan, and an active weather pattern is giving Metro Detroit back-to-back chances of severe weather.\n4Warn Weather – It is hot and humid across Southeast Michigan, and an active weather pattern gives Metro Detroit back-to-back chances of severe weather.\nAs temperatures rise into the mid-upper 80s, showers and thunderstorms will develop in the afternoon and evening.\nA few showers and thunderstorms could once again become strong to severe during the day.\nFind the latest forecast from the 4Warn Weather team hereRemember to download the free 4Warn weather app -- it’s easily one of the best in the nation."}, {"id": "6d425ab6-fec6-4d43-ae2d-2dbc191b7c84", "title": "Houston power outages persist amid sweltering heat", "date": "2024-05-20 23:00", "url": "https://www.theguardian.com/us-news/article/2024/may/20/houston-power-outages-storm", "message": "Houston in Texas is still grappling with the effects of a massive storm that swept through the US south last week, including widespread power outages that have persisted for days in increasingly hotter weather.\nThe National Weather Service said “heat index values will be approaching/exceeding 100F throughout the week” in south-east Texas.\nStudents suffered in sweltering heat in classrooms without working air conditioning, sparking outcry from teachers, parents, and lawmakers.\nTexas is no stranger to widespread power outages.\nThe National Weather Service told residents in the city to stay hydrated and to call 911 if experiencing symptoms of heatstroke, which include confusion and dizziness."}, {"id": "e6393727-e5ae-4fb9-a57c-56a1c2bcfa66", "title": "Update 2 : Alberta wildfire information update : May 19 , 3 p . m . ", "date": "2024-05-20 01:45", "url": "https://www.alberta.ca/release.cfm?xID=90385BABF72FB-CC28-1B98-5DFCC0E5101995C7", "message": "Some parts of this page will not display.\nJavaScript is not available in this browser or may be turned off."}, {"id": "bca3c275-1738-41d3-9d04-84099dec2487", "title": "Status of wildfire that threatened Fort McMurray changed to  being held  ", "date": "2024-05-20 22:00", "url": "https://www.timescolonist.com/national-news/status-of-wildfire-that-threatened-fort-mcmurray-changed-to-being-held-8771041", "message": "FORT MCMURRAY, Alta.\n— A wildfire that forced thousands of people to evacuate several Fort McMurray neighbourhoods last week is no longer classified as out-of-control.\nFORT MCMURRAY, Alta.\n— A wildfire that forced thousands of people to evacuate several Fort McMurray neighbourhoods last week is no longer classified as out-of-control.\nAn evacuation alert for the entire city of Fort McMurray, which told residents they should be ready to leave at short notice, was lifted at the same time."}, {"id": "5c7eb04d-6265-4aaf-9626-8b98375cf8c0", "title": "Climate change impacts millions in India . But as the country votes , some politicians skirt the issue", "date": "2024-05-20 04:15", "url": "https://www.whec.com/national-world/climate-change-impacts-millions-in-india-but-as-the-country-votes-some-politicians-skirt-the-issue/", "message": "But there has been little talk about climate change on the campaign trail.\n“Climate change is still not among the headlines during these elections despite its obvious impact on millions of Indian lives,” said Anjal Prakash, author of multiple United Nations climate reports.\nHere’s a look at how the effects of climate change are influencing voters.\nBut floods are now more devastating and unpredictable because of climate change, locals say, making it harder to stay on the islands.\nConsidered one of the world’s most vulnerable regions to climate change according to a 2021 report, Ali said the lack of political will is only making life harder."}, {"id": "ea8aa2c6-6eef-43a5-ba54-465c0e83f813", "title": "Governor seeking Presidential Disaster Declaration for additional SETX counties", "date": "2024-05-20 16:30", "url": "https://fox4beaumont.com/news/governor-seeking-presidential-disaster-declaration-for-additional-setx-counties", "message": "\"The severe storms that swept across the state caused damage of such severity and magnitude that I am requesting eight additional counties be added to the Presidential Disaster Declaration,” said Governor Abbott.\nAdditional counties may be added to the Governor’s request as additional damage assessments are completed in affected communities.\nThe Governor first amended his disaster declaration on May 2, updated it further on May 7, and amended the state declaration again on May 15.\n-Requesting a Presidential Disaster Declaration on May 15 for Texas communities impacted by severe storms.\n-Securing partial approval of a Presidential Disaster Declaration on May 17 for areas of the state affected by severe weather."}, {"id": "65762419-64d9-40c9-837c-4033cfbc136e", "title": "Climate change impacts millions in India . But as the country votes , some politicians skirt the issue – Winnipeg Free Press", "date": "2024-05-20 03:15", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/05/19/climate-change-impacts-millions-in-india-but-as-the-country-votes-some-politicians-skirt-the-issue", "message": "But there has been little talk about climate change on the campaign trail.\nBut experts and voters say there has been little talk about climate change on the campaign trail.\nHere’s a look at how the effects of climate change are influencing voters.\nBut floods are now more devastating and unpredictable because of climate change, locals say, making it harder to stay on the islands.\nConsidered one of the world’s most vulnerable regions to climate change according to a 2021 report, Ali said the lack of political will is only making life harder."}, {"id": "796ec892-ebbb-4810-b648-736a07b04901", "title": "Climate change impacts millions in India , but some politicians skirt the issue", "date": "2024-05-20 15:00", "url": "https://www.naharnet.com:443/stories/en/305330-climate-change-impacts-millions-in-india-but-some-politicians-skirt-the-issue", "message": "But there has been little talk about climate change on the campaign trail.\n\"Climate change is still not among the headlines during these elections despite its obvious impact on millions of Indian lives,\" said Anjal Prakash, author of multiple United Nations climate reports.\nHere's a look at how the effects of climate change are influencing voters.\nBut floods are now more devastating and unpredictable because of climate change, locals say, making it harder to stay on the islands.\nConsidered one of the world's most vulnerable regions to climate change according to a 2021 report, Ali said the lack of political will is only making life harder."}, {"id": "944571e4-6fbb-42d6-90ea-e50d76e19db0", "title": "Wildfires and air quality : How to check the reading in your area - National", "date": "2024-05-20 13:30", "url": "https://globalnews.ca/news/10512606/wildfires-air-quality-health-index/", "message": "HOW CAN I CHECK THE AIR QUALITY READING IN MY AREA?\nThe Air Quality Health Index is at: https://weather.gc.ca/airquality/pages/index_e.htmlYou can take a look at the ratings in communities across your province or territory.\nStory continues below advertisementA rating of 1-3 is low risk, 4-6 is moderate risk, 7-10 is high risk and over 10 is very high risk.\nEnvironment Canada also encourages people to download the WeatherCAN app and set personal notifications for the AQHI in their region.\nEnvironment Canada, in consultation with Health Canada, has different recommendations for people especially at risk of suffering health problems when exposed to poor air quality versus the general population."}, {"id": "198fafc6-a60d-42a9-b557-9dcfc5a8ffbe", "title": "Inside DTE storm school : What it takes to become a DTE power line worker", "date": "2024-05-20 14:15", "url": "https://www.wxyz.com/news/inside-dtes-storm-school-what-it-takes-to-become-a-dte-power-line-worker", "message": "Have you ever wondered what it takes for DTE to train workers who conduct the most dangerous jobs, often in the eye of a storm, to bring you power.\nDTE is tasked with restoring power when it comes out, but while some are happy with how quickly they restore it, others say they're not doing enough.\nI couldn’t tell you that this takes an hour to do because it all varies the accessibility of it,\" the worker told us.\nOnce the apprentices complete storm school, they'll be ready to take on some of the most challenge restoration issues.\nFor those who say DTE needs to invest more into growing energy demands, DTE said they hear you and they are working day and night to improve infrastructure, including toward a cleaner energy and response times."}, {"id": "c3b94d1f-ba91-4d19-9eb0-6a80bd786423", "title": "Power restored to most hit by deadly Houston storm with full service expected by Wednesday", "date": "2024-05-20 07:15", "url": "https://isp.netscape.com/news/story/0001/20240520/4d98b8c59a10227e8891d6530f583cf1", "message": "Power restored to most hit by deadly Houston storm with full service expected by WednesdayHOUSTON (AP) — Houston area residents affected by deadly storms last week received some good news as officials said power was restored Sunday to a majority of the hundreds of thousands who had been left in the dark and without air conditioning during hot and humid weather.\nBy Sunday evening, 88% of customers in the Houston area had their power restored, said Paul Lock, a spokesperson for CenterPoint Energy.\nCenterPoint Energy said 2,000 employees and more than 5,000 contractors were working in the Houston area to restore power.\nAt least 15 community centers were set to serve as cooling centers in the Houston area on Monday.\nTwo other large school districts in the the Houston area, Cypress-Fairbanks and Spring Branch, planned to be closed."}, {"id": "05e3b772-3abb-411a-a276-60086025999a", "title": "This wildfire season , changes are coming to better inform people about smoke hazards – Winnipeg Free Press", "date": "2024-05-20 11:00", "url": "https://www.winnipegfreepress.com/arts-and-life/life/health/2024/05/20/this-wildfire-season-changes-are-coming-to-better-inform-people-about-smoke-hazards", "message": "Last year’s record-breaking wildfire season forced Canadians to become familiar with the scale of air pollution as hazardous smoke drifted across the country.\nLast year’s record-breaking wildfire season forced Canadians to become familiar with the scale of air pollution as hazardous smoke drifted across the country.\nUsers can now toggle between different layers of active alerts and display only those related to air quality if that’s their main concern.\nWhen the AQHI exceeds 10 due to wildfire smoke — indicating a “very high” health risk — affected areas appear red on the map.\nIf air quality is not ideal, children can still participate in non-strenuous outdoor activities as long as they’re being monitored, she added."}, {"id": "839bf3be-6a44-45e4-b33d-5ed084a79607", "title": "Facing rising claims , insurer Intact is trying to protect homes before they burn", "date": "2024-05-20 00:00", "url": "https://www.theglobeandmail.com/business/article-facing-rising-claims-insurer-intact-is-trying-to-protect-homes-before/", "message": "Hours later, they were in the suburbs of Fort McMurray, Alta., to help fireproof hundreds of residential homes from a blaze that was closing in on the city.\nLast year, Intact paid out more than $1-billion in natural-disaster claims, with a significant portion related to wildfires.\nIn Fort McMurray, the number of task forces may change depending on the condition of the fire.\n“But we also needed to get to [Fort McMurray] before the fire would make a jump and start moving, and those jumps are in the afternoon.”When the team arrived in Fort McMurray early in the morning, the fire was about 19 kilometres away from town.\nIn Alberta, it is available to all residents who live south of the 57th parallel line, which begins at Fort McMurray."}, {"id": "66e5ef25-8f1f-459c-9d0d-03633f40c9b1", "title": "This Wildfire Season , Changes Are Coming to Better Inform People About Smoke Hazards", "date": "2024-05-20 15:00", "url": "https://www.theepochtimes.com/world/this-wildfire-season-changes-are-coming-to-better-inform-people-about-smoke-hazards-5653387", "message": "Environment Canada’s colour-coded Air Quality Health Index, designed to help people understand health risks associated with contaminated air, was closely watched under hazy, orange skies that stretched beyond the Canada-U.S. border.\nUsers can now toggle between different layers of active alerts and display only those related to air quality if that’s their main concern.\nDetailed air quality warnings are also listed under a separate tab.\nThat level “exceeds any kind of air quality objective across the world,” Ms. Audette said.\nIf air quality is not ideal, children can still participate in non-strenuous outdoor activities as long as they’re being monitored, she added."}, {"id": "c6659834-cdf6-4a49-a38a-bd895f149f31", "title": "Drought - resistant plants , green innovation and flood storage feature at Chelsea", "date": "2024-05-20 15:00", "url": "https://www.edp24.co.uk/news/national/24332754.drought-resistant-plants-green-innovation-flood-storage-feature-chelsea/", "message": "With the Royal Horticultural Society (RHS), which runs the show, introducing a “green audit” for larger gardens and handing out an environmental innovation award for the first time, this year’s show has a focus on sustainability.\nMr Giorgi told the PA news agency: “We really need to work our technologies and also garden strategies to cope with climate change, to cope with more humble resources.\nHe said the award had been introduced because the judging process at Chelsea did not pick up sustainability.\nThis means it can help reduce the risk of homes flooding, while flood-resilient plants have been planted in the lowest parts of the garden and less water-loving blooms are higher up.\nFlood Re’s Harriet Boughton said: “It’s beautiful, but also purposeful.”"}, {"id": "a165165e-f539-4828-8a3d-a10528d21ae8", "title": "This wildfire season , changes are coming to better inform people about smoke hazards", "date": "2024-05-20 21:30", "url": "https://www.cp24.com/news/this-wildfire-season-changes-are-coming-to-better-inform-people-about-smoke-hazards-1.6893975", "message": "Sonja PuzicLast year’s record-breaking wildfire season forced Canadians to become familiar with the scale of air pollution as hazardous smoke drifted across the country.\nEnvironment Canada’s colour-coded Air Quality Health Index, designed to help people understand health risks associated with contaminated air, was closely watched under hazy, orange skies that stretched beyond the Canada-U.S. border.\nUsers can now toggle between different layers of active alerts and display only those related to air quality if that’s their main concern.\nWhen the AQHI exceeds 10 due to wildfire smoke — indicating a “very high” health risk — affected areas appear red on the map.\nIf air quality is not ideal, children can still participate in non-strenuous outdoor activities as long as they’re being monitored, she added."}, {"id": "c98576cb-3192-41cc-9207-01a57658f97f", "title": "Hot Tuesday with increasing rain and storm chance through midweek", "date": "2024-05-20 22:45", "url": "https://wishtv.com/weather/weather-blog/hot-tuesday-with-increasing-rain-and-storm-chance-through-midweek/", "message": "Hot Tuesday with increasing rain and storm chances through midweekINDIANAPOLIS (WISH) — Monday was as hot as advertised with temperatures getting into the mid to upper 80s.\nMore hot weather is on the way with rain and storm chances increasing over the next couple of days.\nThere is even a low threat for strong and severe storms in northern Indiana for wind and hail.\nLate Tuesday night into early Wednesday may also feature strong to severe storms as there is a low risk along and north of a Sullivan-Indianapolis-Muncie line.\nAdditional rain and storms will then develop in the latter half of the afternoon hours and into Wednesday night."}, {"id": "5b9c9d92-cc13-4315-8507-4056abb69f68", "title": "Drought - resistant plants , green innovation and flood storage feature at Chelsea", "date": "2024-05-20 15:00", "url": "https://www.lancashiretelegraph.co.uk/news/national/24332754.drought-resistant-plants-green-innovation-flood-storage-feature-chelsea/", "message": "With the Royal Horticultural Society (RHS), which runs the show, introducing a “green audit” for larger gardens and handing out an environmental innovation award for the first time, this year’s show has a focus on sustainability.\nMr Giorgi told the PA news agency: “We really need to work our technologies and also garden strategies to cope with climate change, to cope with more humble resources.\nHe said the award had been introduced because the judging process at Chelsea did not pick up sustainability.\nThis means it can help reduce the risk of homes flooding, while flood-resilient plants have been planted in the lowest parts of the garden and less water-loving blooms are higher up.\nFlood Re’s Harriet Boughton said: “It’s beautiful, but also purposeful.”"}, {"id": "c7ea865a-5b22-4597-8897-9d46fcf24c4a", "title": "Indonesia and Vietnam Joint Research on Agrarian Technology", "date": "2024-05-20 08:00", "url": "https://www.viva.co.id/english/1715632-indonesia-and-vietnam-joint-research-on-agrarian-technology", "message": "Jakarta – Minister of Agriculture, Andi Amran Sulaiman, and the Vietnamese Minister of Rural Development, Le Minh Hoan agreed to collaborate on agricultural productivity in Indonesia through the utilization of technology in the cultivation of swamp land.\nThe Indonesian government has taken concrete actions in the short term to increase the planting index and national rice production by expanding planting areas through programs optimizing swamp lands for rice planting once a year.\nMeanwhile, Minister Le Minh Hoan also requested supplies of fruit from Indonesia, especially Salak Bali, which is very popular in Vietnam and has a very high market prospect.\nCurrently, Salak Bali from Indonesia is sold in Vietnam for 250,000 Vietnamese Dong per kg or equivalent to IDR157,000 per kilogram.\nAs known, in 2023, the total value of agricultural commodity trade between Indonesia and Vietnam reached US$1.93 billion."}, {"id": "952c48a0-7711-4518-a969-171389eb5a9b", "title": "Drought - resistant plants , green innovation and flood storage feature at Chelsea", "date": "2024-05-20 16:30", "url": "https://www.eadt.co.uk/news/national/24332754.drought-resistant-plants-green-innovation-flood-storage-feature-chelsea/", "message": "With the Royal Horticultural Society (RHS), which runs the show, introducing a “green audit” for larger gardens and handing out an environmental innovation award for the first time, this year’s show has a focus on sustainability.\nMr Giorgi told the PA news agency: “We really need to work our technologies and also garden strategies to cope with climate change, to cope with more humble resources.\nHe said the award had been introduced because the judging process at Chelsea did not pick up sustainability.\nThis means it can help reduce the risk of homes flooding, while flood-resilient plants have been planted in the lowest parts of the garden and less water-loving blooms are higher up.\nFlood Re’s Harriet Boughton said: “It’s beautiful, but also purposeful.”"}, {"id": "a5462155-846d-46c2-a1ba-43297bc1aa67", "title": "Houston power outages enter 4th day amid heatwave fears", "date": "2024-05-20 12:30", "url": "https://biztoc.com/x/5eb98a1547c7262d", "message": "Hundreds of thousands of Texans are without power for a fourth day after a devastating thunderstorm tore through Houston.\nMore than 225,000 people were still without power as of Monday morning, according to poweroutages.us, after the storm brought torrential rain, flooding and winds of up to 100 mph.\nSeven people have been killed by the storm so far, including four people in…This story appeared on newsweek.com , ."}, {"id": "e1d7d442-7d21-407a-ab59-090142683b98", "title": "South Florida leaders hold roundtable to discuss upcoming hurricane season", "date": "2024-05-20 18:15", "url": "https://www.local10.com/news/local/2024/05/20/south-florida-leaders-hold-roundtable-to-discuss-upcoming-hurricane-season/", "message": "MIAMI-DADE COUNTY, Fla. – As hurricane season quickly approaches, emergency officials are working to get South Florida residents and visitors prepared.\nKevin Guthrie, the Executive Director of the Florida Division of Emergency Management, held a roundtable discussion with local emergency management officials at the Miami-Dade Fire Rescue Training Facility on Monday to address the upcoming hurricane season.\nEmergency management leaders from Miami-Dade and Broward counties attended the meeting to discuss the importance of organized evacuations, fuel shelters and resident preparation in what officials describe as a “supercharged season.”“It’s supposed to be a supercharged season, maybe the highest on record that we’ve ever had,” said Guthrie.\nClick here to view Local 10′s Hurricane Survival Guide.\nTo receive updated hurricane news and analysis from Local 10′s weather team, click here."}, {"id": "3f2ca190-7339-498e-b756-451a24f66514", "title": "SunLive - Flood damage : Growing risk for NZ kelp forests", "date": "2024-05-20 07:00", "url": "https://www.sunlive.co.nz/news/343481-flood-damage--growing-risk-for-nz---s-kelp-forests.html", "message": "Timber slash and debris from flooding events is decimating Aotearoa New Zealand’s vital underwater kelp forests, a nationwide study shows.\n“Sunlight, on which thriving kelp forests depend, is obstructed by this run-off in shallow coastal water.\n“Our research shows there’s a rapidly accelerating degradation of our iconic kelp forests and this is a major concern for marine biodiversity,.” .\nKelp forests support many species of invertebrates, sponges and other plants that coastal fish species feed on.\nWe now need to find ways to improve coastal management and prevent run-off from land damaging kelp forests."}, {"id": "d3129d6c-e055-44bf-91d5-ef10fe2dc7ad", "title": "What can you do to protect yourself from wildfire smoke ? ", "date": "2024-05-20 23:30", "url": "https://www.yahoo.com/lifestyle/protect-yourself-wildfire-smoke-220552365.html", "message": "Beyond that, keeping safe from smoke largely means avoiding smoky air.\nTo do so, DOH recommends you:Use the 5-3-1 Visibility Tool, which helps you estimate air quality based on how far you can see outside during a wildfire.\nListen to media channels and watch for air quality reports and health warnings about smoke.\nDo not use a swamp cooler on smoky days as the coolers bring smoky air indoors.\nIf you need to go outdoors on smoky days, DSOH says only “particulate respirators” offer some protection from smoke."}, {"id": "8c924afc-bd8f-4047-94b1-c29e6511f709", "title": "Drought - resistant plants , green innovation and flood storage feature at Chelsea", "date": "2024-05-20 15:45", "url": "https://www.swindonadvertiser.co.uk/news/national/24332754.drought-resistant-plants-green-innovation-flood-storage-feature-chelsea/", "message": "With the Royal Horticultural Society (RHS), which runs the show, introducing a “green audit” for larger gardens and handing out an environmental innovation award for the first time, this year’s show has a focus on sustainability.\nMr Giorgi told the PA news agency: “We really need to work our technologies and also garden strategies to cope with climate change, to cope with more humble resources.\nHe said the award had been introduced because the judging process at Chelsea did not pick up sustainability.\nThis means it can help reduce the risk of homes flooding, while flood-resilient plants have been planted in the lowest parts of the garden and less water-loving blooms are higher up.\nFlood Re’s Harriet Boughton said: “It’s beautiful, but also purposeful.”"}, {"id": "978c567d-12e3-44ba-86dd-868ff8102368", "title": "Power restored to most affected by deadly Houston storm , with the rest by Wednesday", "date": "2024-05-20 03:30", "url": "https://www.theglobeandmail.com/world/article-power-restored-to-most-affected-by-deadly-houston-storm-with-the-rest/", "message": "By Sunday evening, 88% of customers in the Houston area had their power restored, said Paul Lock, a spokesperson for CenterPoint Energy.\nMore than 289,000 homes and businesses in Texas remained without electricity Sunday evening, mostly in the Houston area.\nCenterPoint Energy said 2,000 employees and more than 5,000 contractors were working in the Houston area to restore power.\nCarolina Sierra and her 6-year-old son, Derek, enjoyed the air conditioning for a couple of hours Sunday.\nTwo other large school districts in the Houston area – Cypress-Fairbanks and Spring Branch – planned to be closed."}, {"id": "853bab89-b825-4b38-abae-aeadc9caf80b", "title": "Power expected to be restored for most affected by deadly Houston storm - New Delhi Times - India Only International Newspaper", "date": "2024-05-20 11:45", "url": "https://www.newdelhitimes.com/power-expected-to-be-restored-for-most-affected-by-deadly-houston-storm/", "message": "By Sunday evening, 88% of customers in the Houston area had their power restored, said Paul Lock, a spokesperson for CenterPoint Energy.\nMore than 289,000 homes and businesses in Texas remained without electricity Sunday evening, mostly in the Houston area.\nCenterPoint Energy said 2,000 employees and more than 5,000 contractors were working in the Houston area to restore power.\nCarolina Sierra and her 6-year-old son, Derek, enjoyed the air conditioning for a couple of hours Sunday.\nTwo other large school districts in the Houston area — Cypress-Fairbanks and Spring Branch — planned to be closed."}, {"id": "7b834e3b-c112-429c-9371-304a1a4aee3f", "title": "How to check the Air Quality Health Index and assess your health risks – Winnipeg Free Press", "date": "2024-05-20 11:00", "url": "https://www.winnipegfreepress.com/canada/2024/05/20/how-to-check-the-air-quality-health-index-and-assess-your-health-risks", "message": "As we enter another wildfire season, Environment and Climate Change Canada is advising people to pay attention to air pollution levels and check the Air Quality Health Index – especially on smoky days.\nHOW CAN I CHECK THE AIR QUALITY READING IN MY AREA?\nThe Air Quality Health Index is at: https://weather.gc.ca/airquality/pages/index_e.htmlAs we enter another wildfire season, Environment and Climate Change Canada is advising people to pay attention to air pollution levels and check the Air Quality Health Index – especially on smoky days.\nEnvironment Canada, in consultation with Health Canada, has different recommendations for people especially at risk of suffering health problems when exposed to poor air quality versus the general population.\nThey may feel symptoms from air pollution even at “moderate risk” levels."}, {"id": "ef21a654-929b-44a2-a98b-a60dc91b3f9f", "title": "This wildfire season , changes are coming to better inform people about smoke hazards | iNFOnews", "date": "2024-05-20 16:30", "url": "https://infotel.ca/newsitem/this-wildfire-season-changes-are-coming-to-better-inform-people-about-smoke-hazards/it104831", "message": "Vernon News This wildfire season, changes are coming to better inform people about smoke hazardsLast year’s record-breaking wildfire season forced Canadians to become familiar with the scale of air pollution as hazardous smoke drifted across the country.\nImage Credit: THE CANADIAN PRESS/Jason FransonLast year’s record-breaking wildfire season forced Canadians to become familiar with the scale of air pollution as hazardous smoke drifted across the country.\nUsers can now toggle between different layers of active alerts and display only those related to air quality if that’s their main concern.\nWhen the AQHI exceeds 10 due to wildfire smoke — indicating a “very high” health risk — affected areas appear red on the map.\nThis change was prompted by a “record number” of AQHI 10+ scores during last year’s wildfire season, she said in a phone interview."}, {"id": "aeaf44d8-dec7-4738-a9ab-bda6bb39c19e", "title": "Florida leaders offered $3 billion to property insurers . $2 . 2 billion wasnt claimed . – Orlando Sentinel", "date": "2024-05-20 14:45", "url": "https://www.orlandosentinel.com/2024/05/20/florida-leaders-offered-3-billion-to-property-insurers-2-2-billion-wasnt-claimed/", "message": "Who is the Central Floridian of the Year?"}, {"id": "ab389f2f-1b75-4669-be33-e085ccd7e351", "title": "Most Houstonians have had power restored after Thursday night storm", "date": "2024-05-20 21:00", "url": "https://houston.culturemap.com/news/city-life/storm-recovery-power-restored-centerpoint/", "message": "We will not share or sell your email address."}, {"id": "0cc5460b-3cd8-4058-9920-bfe87968bd04", "title": "Galleria owner plans first multi - million dollar upgrades in 7 years", "date": "2024-05-20 21:00", "url": "https://houston.culturemap.com/news/city-life/galleria-mall-renovations-upgrades-simon/", "message": "The Galleria is getting an upgrade."}, {"id": "dbf88fa9-62b7-44f8-852d-f4dce5db3546", "title": "Power restored to most affected by deadly Houston storm , with the rest by Wednesday", "date": "2024-05-20 00:30", "url": "https://www.news-gazette.com/news/nation-world/power-restored-to-most-affected-by-deadly-houston-storm-with-the-rest-by-wednesday/article_f95c23a5-49a5-5c79-8ec5-4a0a2f333570.html", "message": "Partly cloudy skies after midnight.\nWinds SSE at 5 to 10 mph.\nChance of rain 50%..TonightScattered thunderstorms during the evening.\nPartly cloudy skies after midnight.\nWinds SSE at 5 to 10 mph."}, {"id": "2a55987d-8ba8-4117-a80f-4687d89921e6", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 17:45", "url": "https://wiba.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "b4a35ccf-dc36-4133-b882-02d6406a121c", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 17:45", "url": "https://whp580.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "964fe507-ceb4-49d2-9d34-0aa5f834318a", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 17:45", "url": "https://newsradio1470.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "5dd791e1-dc8c-4f2d-8b9f-ab67ef57fa5b", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 18:15", "url": "https://960weli.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "1f3d8b2c-bb48-4d29-a5a0-c7bf0e2acc92", "title": "4 . 1 Magnitude Earthquake Reported In US | NewsRadio 1110 KFAB", "date": "2024-05-20 20:00", "url": "https://kfab.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "d41be865-392b-45dd-abaa-15e6f45cfe7e", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 20:00", "url": "https://710wor.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "1c47c4fc-a861-44ee-8462-a88d470e88ef", "title": "4 . 1 Magnitude Earthquake Reported In US | The Patriot KEIB AM 1150", "date": "2024-05-20 20:00", "url": "https://patriotla.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "4c782a7a-99be-4e37-984d-d69b34b14c7b", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 17:00", "url": "https://wspd.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "88542532-5e41-4dc0-94f7-aa807d920baf", "title": "4 . 1 Magnitude Earthquake Reported In US | News Talk 99 . 5 WRNO", "date": "2024-05-20 17:00", "url": "https://wrno.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "57ace135-7735-495c-b841-ea943148e178", "title": "4 . 1 Magnitude Earthquake Reported In US | Talk Radio 105 . 9", "date": "2024-05-20 18:45", "url": "https://knrs.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "9f0d3fa9-cb36-4c70-bd49-00e33e7c1a39", "title": "4 . 1 Magnitude Earthquake Reported In US | NewsTalk WMEQ", "date": "2024-05-20 18:45", "url": "https://wmeq.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "e30a1e8a-8611-4169-b301-5a2178faab73", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 19:45", "url": "https://wvoc.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "3e88e058-e56d-4f59-876c-bd77113036bc", "title": "4 . 1 Magnitude Earthquake Reported In US | News Radio 920 AM & 104 . 7 FM", "date": "2024-05-20 19:00", "url": "https://newsradiori.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "3efb1e7f-a0d2-4068-a4dd-8969947cdc32", "title": "4 . 1 Magnitude Earthquake Reported In US | Twin Cities News Talk", "date": "2024-05-20 19:00", "url": "https://twincitiesnewstalk.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "a0b9a4f1-35ec-4cba-9c64-80a1ee8d58d8", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 19:15", "url": "https://kprcradio.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "7f2838db-9ffb-4da3-b42d-123adb013b66", "title": "4 . 1 Magnitude Earthquake Reported In US | NEWSRADIO 1040 WHO", "date": "2024-05-20 19:15", "url": "https://whoradio.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "fa58f426-b8c3-4511-ad25-af1b30a041d6", "title": "4 . 1 Magnitude Earthquake Reported In US | 96 . 3 | 102 . 5 NewsRadio WFLA", "date": "2024-05-20 21:00", "url": "https://wflapanamacity.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "a2cbcab8-5713-4b1d-b132-984cbdfbb356", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 21:00", "url": "https://wrko.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "572ecb4f-9660-4531-b0f9-c10e2fcc2808", "title": "4 . 1 Magnitude Earthquake Reported In US | News Radio 690 KTSM", "date": "2024-05-20 23:00", "url": "https://ktsmradio.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "af8afe25-6a2b-46a7-a954-dd88a7486778", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 20:15", "url": "https://wjdx.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "cd6811e9-a36d-4234-8ead-c4b4aa3675c6", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 20:15", "url": "https://600kcol.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "f60edb03-1327-497d-a75d-a33aa5a83073", "title": "4 . 1 Magnitude Earthquake Reported In US | NewsRadio 1170 WWVA", "date": "2024-05-20 20:15", "url": "https://newsradio1170.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "dc9b4465-d5f5-470f-8021-2fc3a03ad5a1", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 20:15", "url": "https://1190talkradio.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "f5e7ab80-a6ee-4cf0-9b58-038658f30af2", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 20:15", "url": "https://wbex.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "62c34dc6-b8f1-4121-82dd-4d23c0348351", "title": "4 . 1 Magnitude Earthquake Reported In US | Talk Radio 98 . 3 WLAC", "date": "2024-05-20 20:15", "url": "https://wlac.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "25e80b76-8a85-44bd-b59d-80cdd7629f4b", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 16:15", "url": "https://1440wgig.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "a7543332-8860-4758-86a7-f51da0f1b210", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 16:15", "url": "https://khow.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "28035464-a6f9-4f8f-9b94-732e6c26b632", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 16:15", "url": "https://kste.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "00df4e91-a97d-4dc4-9b40-314e1eb693a9", "title": "4 . 1 Magnitude Earthquake Reported In US | News Radio 1410 WDOV", "date": "2024-05-20 16:15", "url": "https://wdov.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "2f34baf8-eca1-4419-aff0-f6fdca90239a", "title": "4 . 1 Magnitude Earthquake Reported In US | News Radio 830 KHVH", "date": "2024-05-20 16:30", "url": "https://khvhradio.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "1196df17-6083-4f8a-8ca8-7fc60b97daba", "title": "4 . 1 Magnitude Earthquake Reported In US | News Talk 1090 WKBZ - AM", "date": "2024-05-20 16:30", "url": "https://newstalk1090.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "205923b2-1aee-4bef-a7fd-68797a9c7537", "title": "4 . 1 Magnitude Earthquake Reported In US | NewsRadio 570 WKBN", "date": "2024-05-20 16:30", "url": "https://570wkbn.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "c1a87fb2-2976-429c-ab98-e8340205bc74", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 16:30", "url": "https://knst.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "a5b85593-f230-428e-8721-5a3a22298fb0", "title": "4 . 1 Magnitude Earthquake Reported In US", "date": "2024-05-20 16:30", "url": "https://720thevoice.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "4094d1c1-ac00-4700-ad2e-bebbff7fee98", "title": "4 . 1 Magnitude Earthquake Reported In US | News Radio 1450 WILM", "date": "2024-05-20 16:30", "url": "https://wilm.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "4e447192-40c1-4736-9257-a082dd18b01d", "title": "4 . 1 Magnitude Earthquake Reported In US | News Radio 94 . 3 WSC", "date": "2024-05-20 20:45", "url": "https://943wsc.iheart.com/content/2024-05-20-41-magnitude-earthquake-reported/", "message": "A 4.1-magnitude earthquake struck California on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Ocotillo Wells with a 11.2 kilometer (about 7.0 miles) depth.\nThe California earthquake struck hours after a 5.1-magnitude earthquake struck China on Monday, according to the United States Geological Survey.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth."}, {"id": "a0ae219d-0d9a-4476-871b-ab3300b7f038", "title": "Power expected to be restored to most affected by deadly Houston storm", "date": "2024-05-20 01:15", "url": "https://www.bangordailynews.com/2024/05/19/nation/power-expected-to-be-restored-to-most-affected-by-deadly-houston-storm/", "message": "More than 352,000 homes and businesses in Texas remained without electricity Sunday morning, with most of those in the Houston area.\nCarolina Sierra and her 6-year-old son, Derek, enjoyed the air conditioning for a couple of hours Sunday.\nCenterPoint Energy said it anticipated that about 80% of affected customers in the Houston area would have service restored by Sunday evening.\nCenterPoint Energy said 2,000 employees and more than 5,000 contractors were working in the Houston area to restore power.\nThe Houston Independent School District, the state’s largest, said power had been restored to nearly 200 campuses and those schools would be open Monday."}, {"id": "78ff46b4-394c-4e27-a94b-ad61ec344fa1", "title": "U . S . DOJ Antitrust Division Uses Wiretaps to Detect and Prosecute Procurement Collusion | Manatt , Phelps & Phillips , LLP", "date": "2024-05-20 20:15", "url": "https://www.jdsupra.com/legalnews/u-s-doj-antitrust-division-uses-7949180/", "message": "Since the launch of the PCSF, a steady stream of Antitrust Division prosecutions of companies and executives have involved conspiracies to secure contracts for projects supported by federal taxpayers.\nThe wildfire fuel truck plea is the latest reminder that the Antitrust Division will continue to remain vigilant in policing procurement markets funded by federal contracts and taxpayer dollars.\nThe same is true for state antitrust enforcers who are ramping up criminal antitrust investigations.\n6 U.S. Dep’t of Justice, Federal Antitrust Crime: A Primer for Law Enforcement Personnel, at 9 (Oct. 2023) https://www.justice.gov/atr/page/file/1091651/dl.\n11 U.S. Dep’t of Justice, Protocol for Increased State Prosecution of Criminal Antitrust Offenses (Mar."}, {"id": "aa8a3804-d6d3-4d6d-935c-06608cd08e4a", "title": "5 Texas Towns People Are Fleeing As Soon As Possible", "date": "2024-05-20 02:15", "url": "https://www.poncapost.com/5-texas-towns-people-are-fleeing-as-soon-as-possible/", "message": "Let’s delve deeper into five Texas towns currently experiencing population decline and explore the unique factors driving this trend.\nWithout essential services and economic opportunities, small towns like Valentine risk becoming ghost towns, losing their vibrant history and cultural heritage.\nA Crossroads for Texas Towns: The Road AheadThe exodus from these five Texas towns paints a complex picture.\nThe Future of Small-Town AmericaThe exodus from small towns in Texas serves as a cautionary tale.\nThis blog post merely scratches the surface of the complex issues surrounding the exodus from small towns in Texas."}, {"id": "daacac47-bdc4-4930-a52a-58ce73c59f9d", "title": "5 . 1 Magnitude Earthquake Reported", "date": "2024-05-20 15:00", "url": "https://wmanfm.iheart.com/content/2024-05-20-51-magnitude-earthquake-reported/", "message": "A 5.1-magnitude earthquake struck China on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Kashgar with a 10 kilometer (about 6.21 miles) depth.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth.\nThe Japan earthquake struck days after a 3.8-magnitude earthquake struck Tennessee on Thursday (May 16), according to the United States Geological Survey."}, {"id": "cefccd44-4096-46f5-aa33-5b1433932555", "title": "5 . 1 Magnitude Earthquake Reported | Newsradio WTAM 1100", "date": "2024-05-20 15:00", "url": "https://wtam.iheart.com/content/2024-05-20-51-magnitude-earthquake-reported/", "message": "A 5.1-magnitude earthquake struck China on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Kashgar with a 10 kilometer (about 6.21 miles) depth.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth.\nThe Japan earthquake struck days after a 3.8-magnitude earthquake struck Tennessee on Thursday (May 16), according to the United States Geological Survey."}, {"id": "fa4b9452-6be6-49ab-bad7-c1160d1ddb3a", "title": "5 . 1 Magnitude Earthquake Reported | News Radio 1200 WOAI", "date": "2024-05-20 15:00", "url": "https://woai.iheart.com/content/2024-05-20-51-magnitude-earthquake-reported/", "message": "A 5.1-magnitude earthquake struck China on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Kashgar with a 10 kilometer (about 6.21 miles) depth.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth.\nThe Japan earthquake struck days after a 3.8-magnitude earthquake struck Tennessee on Thursday (May 16), according to the United States Geological Survey."}, {"id": "bc48cb07-bfa0-44b2-8454-de9f00b3cacd", "title": "5 . 1 Magnitude Earthquake Reported | NewsRadio 1110 KFAB", "date": "2024-05-20 15:00", "url": "https://kfab.iheart.com/content/2024-05-20-51-magnitude-earthquake-reported/", "message": "A 5.1-magnitude earthquake struck China on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Kashgar with a 10 kilometer (about 6.21 miles) depth.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth.\nThe Japan earthquake struck days after a 3.8-magnitude earthquake struck Tennessee on Thursday (May 16), according to the United States Geological Survey."}, {"id": "3c083396-a0a8-406e-98ba-69f819b4ed7a", "title": "5 . 1 Magnitude Earthquake Reported", "date": "2024-05-20 15:00", "url": "https://wvoc.iheart.com/content/2024-05-20-51-magnitude-earthquake-reported/", "message": "A 5.1-magnitude earthquake struck China on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Kashgar with a 10 kilometer (about 6.21 miles) depth.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth.\nThe Japan earthquake struck days after a 3.8-magnitude earthquake struck Tennessee on Thursday (May 16), according to the United States Geological Survey."}, {"id": "dda549fb-ec3f-4f9b-b3d0-802d389af108", "title": "5 . 1 Magnitude Earthquake Reported | News Radio 540", "date": "2024-05-20 15:00", "url": "https://newsradio540.iheart.com/content/2024-05-20-51-magnitude-earthquake-reported/", "message": "A 5.1-magnitude earthquake struck China on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Kashgar with a 10 kilometer (about 6.21 miles) depth.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth.\nThe Japan earthquake struck days after a 3.8-magnitude earthquake struck Tennessee on Thursday (May 16), according to the United States Geological Survey."}, {"id": "26e7c75c-f358-4f4a-85b2-b06ca6cf8940", "title": "5 . 1 Magnitude Earthquake Reported | NewsRadio 1360 KKTX", "date": "2024-05-20 14:45", "url": "https://1360kktx.iheart.com/content/2024-05-20-51-magnitude-earthquake-reported/", "message": "A 5.1-magnitude earthquake struck China on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Kashgar with a 10 kilometer (about 6.21 miles) depth.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth.\nThe Japan earthquake struck days after a 3.8-magnitude earthquake struck Tennessee on Thursday (May 16), according to the United States Geological Survey."}, {"id": "d07e2676-b64a-46f9-a87b-5eb6b582aa2b", "title": "5 . 1 Magnitude Earthquake Reported", "date": "2024-05-20 14:45", "url": "https://wtkg.iheart.com/content/2024-05-20-51-magnitude-earthquake-reported/", "message": "A 5.1-magnitude earthquake struck China on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Kashgar with a 10 kilometer (about 6.21 miles) depth.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth.\nThe Japan earthquake struck days after a 3.8-magnitude earthquake struck Tennessee on Thursday (May 16), according to the United States Geological Survey."}, {"id": "e53b93b0-142c-4cb0-a82e-50e66c40934b", "title": "5 . 1 Magnitude Earthquake Reported | Talk Radio 105 . 9", "date": "2024-05-20 14:45", "url": "https://talkradio1059.iheart.com/content/2024-05-20-51-magnitude-earthquake-reported/", "message": "A 5.1-magnitude earthquake struck China on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Kashgar with a 10 kilometer (about 6.21 miles) depth.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth.\nThe Japan earthquake struck days after a 3.8-magnitude earthquake struck Tennessee on Thursday (May 16), according to the United States Geological Survey."}, {"id": "76cc4cc6-2e8b-48ee-92fc-3e0a8b00dae3", "title": "5 . 1 Magnitude Earthquake Reported", "date": "2024-05-20 14:15", "url": "https://talk1200boston.iheart.com/content/2024-05-20-51-magnitude-earthquake-reported/", "message": "A 5.1-magnitude earthquake struck China on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Kashgar with a 10 kilometer (about 6.21 miles) depth.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth.\nThe Japan earthquake struck days after a 3.8-magnitude earthquake struck Tennessee on Thursday (May 16), according to the United States Geological Survey."}, {"id": "605d067c-2a23-40a3-8af7-79734527a7cf", "title": "5 . 1 Magnitude Earthquake Reported | News Radio 920 AM & 104 . 7 FM", "date": "2024-05-20 14:15", "url": "https://newsradiori.iheart.com/content/2024-05-20-51-magnitude-earthquake-reported/", "message": "A 5.1-magnitude earthquake struck China on Monday (May 20), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Kashgar with a 10 kilometer (about 6.21 miles) depth.\nThe China earthquake struck two days after a 4.7-magnitude earthquake was reported in Japan on Saturday (May 18), according to the United States Geological Survey.\nThe natural disaster was reported to be centered in Tomioka with a 35.4 kilometer (about 30 miles) depth.\nThe Japan earthquake struck days after a 3.8-magnitude earthquake struck Tennessee on Thursday (May 16), according to the United States Geological Survey."}]