[{"id": "6856e02a-b0ec-4d17-985e-2bb6fe923641", "title": "Five dead in Florida , one in Georgia , as Hurricane Debby floods US southeast", "date": "2024-08-07 06:15", "url": "https://www.wsws.org/en/articles/2024/08/07/gcjd-a07.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "At least six deaths have so far been attributed to Hurricane Debby, the latest storm of this year’s Atlantic hurricane season.\nMore deaths are likely as the tropical storm heads north from Florida, Georgia, South Carolina and North Carolina to Virginia, Maryland, Delaware, New Jersey, western Pennsylvania, New York, New England and Quebec.\nWhen Debby made landfall on Monday morning, nearly 250,000 Florida residents and 26,000 Georgia residents were out of power.\nAt least 81,000 remain without power as of this writing in Florida, 9,000 in Georgia, and 10,000 in South Carolina.\nLike all natural disasters, the death and destruction caused by Hurricane Debby reveals the sharp class issues that dominate society."}, {"id": "f04542a4-92bb-453c-a084-1cf8c61d17d4", "title": "Storm Debby : 3 US states declare emergency , warn residents about catastrophic flooding – Firstpost", "date": "2024-08-07 05:45", "url": "https://www.firstpost.com/world/storm-debby-4-us-states-declare-emergency-warn-residents-about-catastrophic-flooding-13801897.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "APFour states in the US– Georgia, North Carolina, South Carolina, and Virginia– have announced a state of emergency in light of tropical Storm Debby.\nThe storm had already inundated coastal Georgia and South Carolina with relentless rain on Tuesday (August 6), prompting warnings of “catastrophic flooding” in Charleston, Savannah, and other cities.\nAdvertisementFour states brace for impactVirginia Governor Glenn Youngkin mentioned that Storm Debby might bring significant rainfall and flooding throughout the entire Commonwealth, potentially leading to transportation difficulties and power outages, according to DC News Now.\nIn Colleton County, South Carolina, concerns over the McGrady Dam prompted evacuation orders.\nA suspected twister had already caused damage in Moncks Corner, South Carolina, flipping cars and damaging businesses."}, {"id": "61b5123b-1b4e-4d1a-a73b-298eb6d054d0", "title": "Governor Glenn Youngkin Declares State of Emergency in Advance of Tropical Storm Debby ( Press Release ) ", "date": "2024-08-07 14:30", "url": "https://www.arlnow.com/press-releases/governor-glenn-youngkin-declares-state-of-emergency-in-advance-of-tropical-storm-debby/", "domain": "arlnow.com", "domain_classification": "Unknown", "message": "“As we prepare for Tropical Storm Debby, I urge all Virginians and visitors to stay informed, follow local emergency guidelines, and take necessary precautions to ensure the safety of their families and communities.\nThe Virginia Emergency Support Team is actively monitoring the situation and coordinating resources and information to prepare.\nThe National Weather Service and National Hurricane Center forecasts are predicting the potential for tropical storm force winds, heavy rain, and severe flooding across the entirety of the state.\nThe VEOC will coordinate preparedness efforts with local, state and federal officials.\nDownload the FEMA app on your smartphone to receive mobile alerts from the National Weather Service."}, {"id": "71d22891-4a3e-4eab-b777-87f69029a82a", "title": "Already soaked Midlands prepares for more rain from Debby . Here when it coming", "date": "2024-08-07 13:45", "url": "https://www.yahoo.com/news/already-soaked-midlands-prepares-more-131314824.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Already soaked Midlands prepares for more rain from Debby.\nHere’s when it’s comingAfter dousing the Midlands with rain Tuesday, Tropical Storm Debby has moved off the South Carolina coast.\nTropical Storm Debby soaked parts of the Midlands with more than 6 inches of rain Tuesday, National Weather Service Hydrologist Leonard Vaughan told The State on Wednesday.\nWednesday morning was less active as Tropical Storm Debby shifted over the Atlantic Ocean.\nThe possibility of tornadoes cannot be ruled out, as a limited threat remains, the National Weather Service said in the briefing."}, {"id": "125f5d62-3784-436b-8ab1-2620fae3595f", "title": "Already soaked Midlands prepares for more rain from Debby . Here when it coming", "date": "2024-08-07 13:45", "url": "https://www.yahoo.com/news/already-soaked-midlands-prepares-more-131314878.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Already soaked Midlands prepares for more rain from Debby.\nHere’s when it’s comingAfter dousing the Midlands with rain Tuesday, Tropical Storm Debby has moved off the South Carolina coast.\nTropical Storm Debby soaked parts of the Midlands with more than 6 inches of rain Tuesday, National Weather Service Hydrologist Leonard Vaughan told The State on Wednesday.\nWednesday morning was less active as Tropical Storm Debby shifted over the Atlantic Ocean.\nThe possibility of tornadoes cannot be ruled out, as a limited threat remains, the National Weather Service said in the briefing."}, {"id": "567c6e52-06e5-48c6-a3a5-bc5abc139d3c", "title": "Already soaked Midlands prepares for more rain from Debby . Here when it coming", "date": "2024-08-07 14:15", "url": "https://www.yahoo.com/news/already-soaked-midlands-prepares-more-131314710.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Already soaked Midlands prepares for more rain from Debby.\nHere’s when it’s comingAfter dousing the Midlands with rain Tuesday, Tropical Storm Debby has moved off the South Carolina coast.\nTropical Storm Debby soaked parts of the Midlands with more than 6 inches of rain Tuesday, National Weather Service Hydrologist Leonard Vaughan told The State on Wednesday.\nWednesday morning was less active as Tropical Storm Debby shifted over the Atlantic Ocean.\nThe possibility of tornadoes cannot be ruled out, as a limited threat remains, the National Weather Service said in the briefing."}, {"id": "9a1b15df-8651-4869-a6ee-f4cc05015e85", "title": "Already soaked Midlands prepares for more rain from Debby . Here when it coming", "date": "2024-08-07 14:15", "url": "https://www.yahoo.com/news/already-soaked-midlands-prepares-more-131314955.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Already soaked Midlands prepares for more rain from Debby.\nHere’s when it’s comingAfter dousing the Midlands with rain Tuesday, Tropical Storm Debby has moved off the South Carolina coast.\nTropical Storm Debby soaked parts of the Midlands with more than 6 inches of rain Tuesday, National Weather Service Hydrologist Leonard Vaughan told The State on Wednesday.\nWednesday morning was less active as Tropical Storm Debby shifted over the Atlantic Ocean.\nThe possibility of tornadoes cannot be ruled out, as a limited threat remains, the National Weather Service said in the briefing."}, {"id": "8745df4f-f522-470c-bdb9-64b2f94dee4a", "title": "Catfish spotted swimming on flooded streets in Florida during Hurricane Debby", "date": "2024-08-07 01:30", "url": "https://nypost.com/2024/08/06/us-news/catfish-spotted-swimming-on-flooded-streets-in-florida-during-hurricane-debby/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "ST. PETERSBURG, Fla. – Catfish were spotted swimming along residential Florida driveways and yards ahead of Debby’s landfall as a Category 1 hurricane.\nJoanna Mack and her husband were amazed to see two catfish swimming in the road outside their Pinellas Park home on Sunday.\n4 Catfish were spotted in flooded streets in Florida during Hurricane Debby.\nStoryfulThe National Hurricane Center upgraded Debby to a Category 1 hurricane on Sunday evening.\n4 The forecast cone for Tropical Storm Debby."}, {"id": "e0c87806-d440-4e35-bbfe-7640f461224e", "title": "Berkeley County Sheriff Office prepared for impacts ahead of storm", "date": "2024-08-07 13:15", "url": "https://www.postandcourier.com/berkeley-independent/berkeley-independent/community-news/berkeley-county-sheriffs-office-prepared-for-impacts-ahead-of-storm/article_2675445c-546a-11ef-9e85-2be9f2cc9a6e.html", "domain": "postandcourier.com", "domain_classification": "Unknown", "message": "Chance of rain 100%.\n3 to 5 inches of rain expected.\nSignificant flooding is expected..TonightRain likely.\nChance of rain 100%.\n2 to 3 inches of rain expected."}, {"id": "9becda4f-aa32-4dbd-b81c-48352e1149d5", "title": "First Alert Forecast : distressingly slow Debby to continue to impact Cape Fear Region", "date": "2024-08-07 11:00", "url": "https://www.wect.com/2024/08/07/first-alert-forecast-distressingly-slow-debby-continue-impact-cape-fear-region/", "domain": "wect.com", "domain_classification": "Unknown", "message": "WILMINGTON, N.C. (WECT) - As Tropical Storm Debby sluggishly picks its way into the central Carolinas through Thursday, its eastern bands will continue to heavily influence your First Alert Forecast for the Cape Fear Region.\nHeavy Rain: Monday and Tuesday saw between one and four inches of rain across most of the Cape Fear Region.\nRiver Flooding: Minor to locally moderate river flooding remains likely across the area by this weekend.\nThanks for staying with your First Alert Weather Team on TV, online, on your WECT Weather App, and with your comprehensive Hurricane Season guide at wect.com/hurricane.\nView your seven-day forecast: http://webpubcontent.gray.tv/wect/MAXSevendayWECT.jpgOr, extend your outlook with a ten-day forecast on your WECT Weather App."}, {"id": "53e91916-9b66-4ba2-98f7-29bcfcb0a7fe", "title": "The Latest : Tropical Storm Debby hovers off the coast of the Carolinas", "date": "2024-08-07 13:45", "url": "https://www.news4jax.com/news/national/2024/08/07/the-latest-tropical-storm-debby-hovers-off-the-coast-of-the-carolinas/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Forecasters said the storms were enhanced by moisture drifting up from Tropical Storm Debby.\nOfficials said its goal of keeping unnecessary people out during the worst of the rains from Tropical Storm Debby worked.\nHenry McMaster said Tuesday that Tropical Storm Debby hasn’t been as bad as feared.\nDebby brings flooding, tornadoes to South CarolinaSouth Carolina is bracing for days of rain through Thursday from Tropical Storm Debby.\n“We are facing an unprecedented weather event with Hurricane Debby,” said Jodie Fiske, Manatee County's public safety director."}, {"id": "7482f66c-cf93-4791-a418-8afc4ff30c31", "title": "Hurricanes dont stop at the coast – these mountain towns know how severe inland flood damage can be , and theyre preparing", "date": "2024-08-07 00:00", "url": "https://www.yahoo.com/news/hurricanes-don-t-stop-coast-233145468.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A U.S. map of hurricane storm tracks since 1851 shows that the storms and their remnants often travel far inland.\nGreen is tropical storm strength, and blue and gray are weaker but can still be damaging.\nNOAA Climate.govIn 1955, Connie, followed closely by Diane, produced some of the worst inland river flooding in Pennsylvania, New Jersey, New York and Massachusetts.\nVermont was caught off guard by Tropical Storm Irene in 2011, which swept away hundreds of homes.\nIn 1998, Tropical Storm Charley traveled nearly 200 miles up the Rio Grande Valley, quickly flooding the dry Texas landscape, with devastating consequences."}, {"id": "26a4150c-033c-4fe3-a2b1-a32db6bfd3d8", "title": "Debby continues its assault on the Southeast", "date": "2024-08-07 00:45", "url": "https://www.wsmv.com/2024/08/06/debby-continues-its-assault-southeast/", "domain": "wsmv.com", "domain_classification": "Unknown", "message": "NASHVILLE, Tenn. (WSMV) - Debby made landfall as a hurricane, but even now as a tropical storm, it continues wreaking havoc on the Southeast.\nRainfall amounts are off the charts already in the coastal Southeast with even more rain to come from Tropical Storm Debby.\nNearly an inch of rain is estimated to have fallen in much of the southeast, especially in coastal areas of FL, GA, SC, and NC.\nSome of the hardest hit areas have been coast Georgia and coastal South Carolina.\nIn the Charleston, South Carolina area, there were three suspected tornadoes overnight Monday and into early Tuesday."}, {"id": "7b0c51a6-01fc-4cde-95db-d0f3cf54361a", "title": "The Latest : Tropical Storm Debby hovers off the coast of the Carolinas", "date": "2024-08-07 13:45", "url": "https://isp.netscape.com/news/story/0001/20240807/4f39dfd348eb6e544a359ceab4f07f53", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "The Latest: Tropical Storm Debby hovers off the coast of the CarolinasTropical Storm Debby is over the western Atlantic Ocean but is expected to shower the coastal Carolinas with rains again before it moves north.\nForecasters said the storms were enhanced by moisture drifting up from Tropical Storm Debby.\nOfficials said its goal of keeping unnecessary people out during the worst of the rains from Tropical Storm Debby worked.\nHenry McMaster said Tuesday that Tropical Storm Debby hasn’t been as bad as feared.\nDebby brings flooding, tornadoes to South CarolinaSouth Carolina is bracing for days of rain through Thursday from Tropical Storm Debby."}, {"id": "1f9e75ef-8c68-498f-8210-8b5a6b5d8a60", "title": "ENC residents stock up on essentials ahead of Tropical Storm Debby", "date": "2024-08-07 03:30", "url": "https://www.witn.com/2024/08/06/enc-residents-stock-up-essentials-ahead-tropical-storm-debby/", "domain": "witn.com", "domain_classification": "Unknown", "message": "GREENVILLE, N.C. (WITN) - Eastern Carolina is starting to feel the effects of Tropical Storm Debby tonight.\nGreenville residents said they’re stocking up on milk, eggs and bottled water ahead of Debby’s impacts in the east this week.\nElisa Johnson lived in Florida before moving to Eastern Carolina, so she is no stranger to tropical storms.\nShe’s seen the good, bad and ugly of hurricane season, but she’s hoping Debby won’t cause a ton of damage.\nOther residents said they bought bread and canned goods in case their power or water goes out from the storm."}, {"id": "f7d78e79-0453-4662-bb86-e076892fe65d", "title": "Debby inundates coastal Georgia , South Carolina", "date": "2024-08-07 01:45", "url": "https://www.unionleader.com/news/weather/debby-inundates-coastal-georgia-south-carolina/article_048ef927-0981-5448-82d8-eb904a4c1b68.html", "domain": "unionleader.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "66baaa47-b664-4555-8f74-211bc07c0104", "title": "Slow - moving Tropical Storm Debby bringing torrential rains and flooding to southeastern US", "date": "2024-08-07 00:15", "url": "https://www.smdailyjournal.com/news/national/slow-moving-tropical-storm-debby-bringing-torrential-rains-and-flooding-to-southeastern-us/article_47edbd3a-5433-11ef-adcc-778e858b102e.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "e70036d9-e41f-4297-8653-5ff6031170fe", "title": "Slow - moving Tropical Storm Debby bringing torrential rains and flooding to southeastern US", "date": "2024-08-07 00:30", "url": "https://www.krgv.com/news/slow-moving-tropical-storm-debby-bringing-torrential-rains-and-flooding-to-southeastern-us", "domain": "krgv.com", "domain_classification": "Unknown", "message": "Slow-moving Tropical Storm Debby bringing torrential rains and flooding to southeastern USA man walks through storm surge on the flooded road into Horseshoe Beach, Fla., Monday morning, Aug. 5, 2024.\nThe storm was forecast to move relatively slowly across some of America's most historic Southern cities, including Savannah, Georgia, and Charleston, South Carolina.\nThe National Hurricane Center has forecast up to 25 inches (64 centimeters) of rain in some areas.\nThe storm's center was 10 miles (15 kilometers) southeast of Savannah, the hurricane center said in its 2 p.m. advisory Tuesday.\nNorth Carolina and South Carolina have dealt with three catastrophic floods from tropical systems in the past nine years, all causing more than $1 billion in damage."}, {"id": "7d6da90d-29ca-4751-8fe1-099e6d0008dd", "title": "Rainfall totals nearing five inches over last 48 hours in parts of Grand Strand Pee Dee , National Weather Service says", "date": "2024-08-07 03:15", "url": "https://www.yahoo.com/news/rainfall-totals-nearing-five-inches-004242553.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Rainfall totals nearing five inches over last 48 hours in parts of Grand Strand Pee Dee, National Weather Service saysHORRY COUNTY, S.C. (WBTW) — Tropical Storm Debby has already dropped nearly five inches of rain in parts of the Grand Strand since Sunday as the system is expected to hover for most of the week bringing even more precipitation.\nAs of 7 p.m. Tuesday, Spring Gully in Georgetown picked up 4.62 inches of rain, while North Myrtle beach and sections of Conway eclipsed three inches, according to National Weather Service figures.\nOther notable amounts included:3.5 inches north of Bucksport2.73 inches in Briarcliffe Acres2.7 inches in Longs2.56 inches in DeBordieu2.37 inches in central Horry County1.8 inches in Aynor1.73 inches in Socastee1.54 inches in Loris1.48 inches at the Waccamaw RiverDebby’s strongest impacts are expected over the coming days, with forecasters projecting up to 30 inches of rain possible in some areas.\nHenry McMaster said officials are preparing for heavy flooding not only in areas known for it, but parts of the state that typically stay dry.\n“We’re preparing for that kind of heavy rainfall, and the kind of danger that comes with that kind of flooding,” he said."}, {"id": "0cd212d3-24fb-46fa-91bc-fa6377619445", "title": "Debby douses Southeast with rain as it moves along Atlantic coast", "date": "2024-08-07 01:00", "url": "https://www.fox13news.com/news/debby-tornadoes-rainfall-flooding-southeastern-us", "domain": "fox13news.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby doused coastal cities in Georgia and South Carolina, stirred up tornadoes and flooded streets with waist-high floodwaters Tuesday.\nHeavy rain is expected to move north into parts of South Carolina and North Carolina.\nDebby was projected to travel through cities, including Savannah, Georgia, and Charleston, South Carolina, as the National Hurricane Center is predicting roughly 25 inches of rain in some areas.\nTornadoes knocked down trees and damaged a few homes on Kiawah Island and Edisto Island between Savannah and Charleston, South Carolina.\nFILE-In this aerial view, a street is flooded by Tropical Storm Debby on August 6, 2024 in Savannah, Georgia."}, {"id": "725022d3-2045-418f-a90b-a28379b36d49", "title": "Debby storm tracker : Storm shifts west changing rainfall predictions in MA . What to know", "date": "2024-08-07 13:45", "url": "https://www.yahoo.com/news/debby-storm-tracker-storm-shifts-130327121.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Debby storm tracker: Storm shifts west changing rainfall predictions in MA.\nWhat to knowTropical storm Debby is projected to create a wet weekend in Massachusetts, though less so than previously forecasted.\nWhat to expect from tropical storm Debby in Massachusetts this weekTropical Storm Debby is expected to bring rainfall to Massachusetts and Southern New England later this week.\nTropical Storm Debby trackerThis forecast track shows the most likely path of the center of the storm.\nTropical Storm Debby spaghetti modelsIllustrations include an array of forecast tools and models, and not all are created equal."}, {"id": "86edc4ac-4853-4dd9-8285-c36e026e6970", "title": "Tropical Storm Debby swirls over Atlantic , expected to again douse the Carolinas before moving north – Winnipeg Free Press", "date": "2024-08-07 04:45", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/06/tropical-storm-debby-swirls-over-atlantic-expected-to-again-douse-the-carolinas-before-moving-north", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "CHARLESTON, S.C. (AP) — Tropical Storm Debby was swirling over coastal Georgia and Carolinas on Wednesday, its wide bands of rain swelling inland waterways before it slowly marches north.\nBut its core was surrounded by drier air and the worst rainfall was falling hundreds of miles to the north, into eastern North Carolina before spreading into southeast Virginia.\nA car sits in flood waters near Spruill Ave in North Charleston, S.C., as Tropical Storm Debby approaches, Tuesday, Aug. 6, 2024.\nForecasters said the storms were enhanced by moisture drifting up from Tropical Storm Debby.\nResidents repair their roof as high winds from an outer band from Tropical Storm Debby passed over the Isle of Palms, S.C., Tuesday, Aug. 6, 2024."}, {"id": "c7c1302f-d3ba-4599-afc6-57531d1e03d0", "title": "Tropical Storm Debby soaks US Southeast", "date": "2024-08-07 08:00", "url": "https://www.channelnewsasia.com/world/tropical-storm-debby-soaks-us-southeast-4531886", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "ATLANTA: Tropical Storm Debby inundated coastal Georgia and South Carolina with a deluge of rain on Tuesday (Aug 6) that could bring \"catastrophic flooding\" to Charleston, Savannah and other cities in the southeastern United States, the National Hurricane Center said.\nAt least six people have died in Florida and Georgia in the wake of the storm, which is expected to linger over the southeastern and mid-Atlantic coasts for days.\nThe storm featured 64kmh winds as it chugged along slowly at 8kmh to the northeast, with its centre located about 80km east of Savannah, Georgia, on Tuesday night.\nMore than 20cm of rain have already fallen on Savannah and Valdosta, Georgia, the National Weather Service said.\nCharleston and Hilton Head, South Carolina, have received between 25cm and 30cm of rain so far, the weather service said, with more on the way."}, {"id": "2302b5d5-ee50-4a1f-a856-d194c223ffb1", "title": "Tropical Storm Debby path : Storm heading north", "date": "2024-08-07 13:45", "url": "https://www.ctvnews.ca/climate-and-environment/tropical-storm-debby-swirls-over-atlantic-expected-to-move-north-1.6991347", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "CHARLESTON, S.C. -Tropical Storm Debby was swirling over coastal Georgia and Carolinas on Wednesday, its wide bands of rain swelling inland waterways before it slowly marches north.\nDebby was expected to restrengthen a little and turn north toward the South Carolina coastline before its center makes a second landfall late Wednesday or early Thursday, weather officials said.\nBut its core was surrounded by drier air and the worst rainfall was falling hundreds of miles to the north, into eastern North Carolina before spreading into southeast Virginia.\nThe area of most concern Wednesday was in southeastern North Carolina, where Hurricane Matthew caused a historic billion-dollar flood in 2016.\nDebby is finally forecast to pick up speed Thursday before weakening inland as the weather moves north over North Carolina and Virginia into the Washington area by Saturday."}, {"id": "96652934-6375-47a7-b2b5-84c25ff10c9f", "title": "Debby expected to turn north toward South Carolina Wednesday – NBC New York", "date": "2024-08-07 09:30", "url": "https://www.nbcnewyork.com/news/national-international/tropical-storm-debby-swirls-over-atlantic-expected-to-again-douse-the-carolina/5679166/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is taking a breather over the western Atlantic ocean but it isn’t done dousing the coastal Carolinas before it slowly marches north.\nDebby was expected to turn north late Wednesday toward the South Carolina coastline for a second landfall, weather officials said Tuesday night.\nThe slow moving storm drenched coastal cities in Georgia and South Carolina late Monday into Tuesday, stirring up tornadoes and submerging streets with waist-high floodwaters.\nAs Debby swirls just offshore, the heavy rain is expected to move into parts of South and North Carolina that have already seen two billion-dollar floods in eight years.\nDebby is finally forecast to pick up speed Thursday, and it could move up the middle of North Carolina, through Virginia and into the Washington area by Saturday."}, {"id": "673fd86a-cc25-4829-8bc9-31b55e47fd78", "title": "Jim Cantore is in Charleston SC for Debby flooding , rain | Hurricane Center", "date": "2024-08-07 00:30", "url": "https://www.nola.com/news/hurricane/jim-cantore-debby-sc/article_590d3666-540d-11ef-a48e-d7606932e77c.html", "domain": "nola.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "20edd8fe-949f-496c-a6a3-ab44625b7f26", "title": "Debby expected to turn north toward South Carolina Wednesday – NBC 5 Dallas - Fort Worth", "date": "2024-08-07 09:15", "url": "https://www.nbcdfw.com/news/national-international/tropical-storm-debby-swirls-over-atlantic-expected-to-again-douse-the-carolina/3614473/", "domain": "nbcdfw.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is taking a breather over the western Atlantic ocean but it isn’t done dousing the coastal Carolinas before it slowly marches north.\nDebby was expected to turn north late Wednesday toward the South Carolina coastline for a second landfall, weather officials said Tuesday night.\nThe slow moving storm drenched coastal cities in Georgia and South Carolina late Monday into Tuesday, stirring up tornadoes and submerging streets with waist-high floodwaters.\nAs Debby swirls just offshore, the heavy rain is expected to move into parts of South and North Carolina that have already seen two billion-dollar floods in eight years.\nDebby is finally forecast to pick up speed Thursday, and it could move up the middle of North Carolina, through Virginia and into the Washington area by Saturday."}, {"id": "2a991c0a-1788-49ec-b45f-e73c9f2ad4a6", "title": "Debby expected to turn north toward South Carolina Wednesday – NBC4 Washington", "date": "2024-08-07 07:45", "url": "https://www.nbcwashington.com/news/national-international/tropical-storm-debby-swirls-over-atlantic-expected-to-again-douse-the-carolina/3687518/", "domain": "nbcwashington.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is taking a breather over the western Atlantic ocean but it isn’t done dousing the coastal Carolinas before it slowly marches north.\nDebby was expected to turn north late Wednesday toward the South Carolina coastline for a second landfall, weather officials said Tuesday night.\nThe slow moving storm drenched coastal cities in Georgia and South Carolina late Monday into Tuesday, stirring up tornadoes and submerging streets with waist-high floodwaters.\nAs Debby swirls just offshore, the heavy rain is expected to move into parts of South and North Carolina that have already seen two billion-dollar floods in eight years.\nDebby is finally forecast to pick up speed Thursday, and it could move up the middle of North Carolina, through Virginia and into the Washington area by Saturday."}, {"id": "803cbed5-8a59-43b9-80ce-b6c40de0c75c", "title": "Tropical Storm Debby soaks US southeast", "date": "2024-08-07 08:30", "url": "https://www.rte.ie/news/world/2024/0807/1463761-storm-debby/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Tropical Storm Debby inundated coastal Georgia and South Carolina with a deluge of rain yesterday that could bring \"catastrophic flooding\" to Charleston, Savannah and other cities in the south eastern United States, the National Hurricane Center has said.\n\"Debby is expected to produce potentially historic rainfall totals of 25cm and 51cm, with maximum amounts of 63.5cm, bringing areas of catastrophic flooding across portions of the eastern half of South Carolina, and southeast North Carolina through Friday,\" the NHC said.\nVehicles drive through a flooded street in Savannah, GeorgiaThe storm featured 64km/h winds as it chugged along slowly at 8km/h to the northeast, with its centre located about 80km east of Savannah, Georgia, last night.\nCharleston and Hilton Head, South Carolina, have received between 25 and 30cm of rain so far, the weather service said, with more on the way.\nIn Savannah, rain was coming down hard outside the landmark Bellwether House, a 16-room bed-and-breakfast in the city's historic district, but general manager Victoria Hill was not too concerned."}, {"id": "e13317c0-0c3f-4fde-8600-d973f9fc40fc", "title": "Island Green residents know Tropical Storm Debby will flood area . How theyre preparing", "date": "2024-08-07 10:00", "url": "https://www.yahoo.com/news/island-green-residents-know-tropical-090000098.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "He expects water from Tropical Storm Debby to flow down Prestwick Road in the neighborhood and past their house.\nMcKinney pays almost $4,000 annually for homeowners insurance and didn’t have flood insurance when he first got his home.\nMcKinney pays around $900 a year for flood insurance, as the Myrtle Beach area generally pays some of the highest homeowners insurance premiums in the Palmetto State.\n“So if you got work or anything, hopefully, they’re understanding about it.”Residents of Island Green are familiar with the flooding.\nThe community is accessible by only one road, Sunnehanna Road, and due to development projects undertaken in the area, flooding has become an issue for residents."}, {"id": "04df551a-26be-4aea-920d-dd47c6b8f4ec", "title": "FIRST ALERT WEATHER DAY : More heavy rain , flash flooding expected on Wednesday", "date": "2024-08-07 04:15", "url": "https://www.wmbfnews.com/2024/08/06/first-alert-weather-day-tornado-watch-issued-debby-re-emerging-back-into-atlantic/", "domain": "wmbfnews.com", "domain_classification": "Unknown", "message": "MYRTLE BEACH, S.C. (WMBF) - Debby continues to drift around to our south, ushering in more rounds of flooding rain on Tuesday.\n(WMBF)LATEST ON DEBBYAt 8 am, the center of Tropical Storm Debby was located by an Air Force Hurricane Hunter aircraft near latitude 32.2 North, longitude 79.4 West.\nTropical storm conditions are expected to continue along the coast of South Carolina within the tropical storm warning area through Thursday.\nTropical storm conditions are expected within the tropical storm warning area and possible within the tropical storm watch area in North Carolina today and continuing through Thursday.\nWhile not continuous, rain bands will usher in rounds of flooding rain through Thursday."}, {"id": "3dd49ca9-bc9d-4f7e-badc-5259c8dcd55a", "title": "Debby expected to turn north toward South Carolina Wednesday – NBC 7 San Diego", "date": "2024-08-07 08:30", "url": "https://www.nbcsandiego.com/news/national-international/tropical-storm-debby-swirls-over-atlantic-expected-to-again-douse-the-carolina/3590540/", "domain": "nbcsandiego.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is taking a breather over the western Atlantic ocean but it isn’t done dousing the coastal Carolinas before it slowly marches north.\nDebby was expected to turn north late Wednesday toward the South Carolina coastline for a second landfall, weather officials said Tuesday night.\nThe slow moving storm drenched coastal cities in Georgia and South Carolina late Monday into Tuesday, stirring up tornadoes and submerging streets with waist-high floodwaters.\nAs Debby swirls just offshore, the heavy rain is expected to move into parts of South and North Carolina that have already seen two billion-dollar floods in eight years.\nDebby is finally forecast to pick up speed Thursday, and it could move up the middle of North Carolina, through Virginia and into the Washington area by Saturday."}, {"id": "93e6face-e648-4bea-b405-307692806d7a", "title": "Debby expected to turn north toward South Carolina Wednesday – NBC Bay Area", "date": "2024-08-07 10:00", "url": "https://www.nbcbayarea.com/news/national-international/tropical-storm-debby-swirls-over-atlantic-expected-to-again-douse-the-carolina/3617721/", "domain": "nbcbayarea.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is taking a breather over the western Atlantic ocean but it isn’t done dousing the coastal Carolinas before it slowly marches north.\nDebby was expected to turn north late Wednesday toward the South Carolina coastline for a second landfall, weather officials said Tuesday night.\nThe slow moving storm drenched coastal cities in Georgia and South Carolina late Monday into Tuesday, stirring up tornadoes and submerging streets with waist-high floodwaters.\nAs Debby swirls just offshore, the heavy rain is expected to move into parts of South and North Carolina that have already seen two billion-dollar floods in eight years.\nDebby is finally forecast to pick up speed Thursday, and it could move up the middle of North Carolina, through Virginia and into the Washington area by Saturday."}, {"id": "78ab85ef-4263-4a74-95bd-9cac60ef796f", "title": "Debby expected to turn north toward South Carolina Wednesday – NBC Chicago", "date": "2024-08-07 11:30", "url": "https://www.nbcchicago.com/news/national-international/tropical-storm-debby-swirls-over-atlantic-expected-to-again-douse-the-carolina/3515006/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is taking a breather over the western Atlantic ocean but it isn’t done dousing the coastal Carolinas before it slowly marches north.\nDebby was expected to turn north late Wednesday toward the South Carolina coastline for a second landfall, weather officials said Tuesday night.\nThe slow moving storm drenched coastal cities in Georgia and South Carolina late Monday into Tuesday, stirring up tornadoes and submerging streets with waist-high floodwaters.\nAs Debby swirls just offshore, the heavy rain is expected to move into parts of South and North Carolina that have already seen two billion-dollar floods in eight years.\nDebby is finally forecast to pick up speed Thursday, and it could move up the middle of North Carolina, through Virginia and into the Washington area by Saturday."}, {"id": "8cc7cf58-cd8a-40d0-9456-f5d7b40ad045", "title": "New Update - Debby Most Intense Rainfall Still Ahead : Here When Storm Will Affect Northeast", "date": "2024-08-07 01:30", "url": "https://dailyvoice.com/connecticut/westport/hurricane-debby-makes-landfall-along-florida-coast-latest-projected-track-timing/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "Landfall was around 7 a.m. Monday, Aug. 5 about 70 miles southeast of Tallahassee, the National Hurricane Center said.\nIt was downgraded to a tropical storm shortly thereafter as it hit Florida's Gulf Coast with flooding rain, damaging winds, and storm surge.\nThe slow-moving system is expected to affect the Northeast later this week, especially southern New England and potentially parts of Long Island.\nIn the first image above, areas that will experience some impacts are marked in yellow.\nDebby was upgraded from a tropical storm to a hurricane at about 11 p.m. Sunday, Aug. 4."}, {"id": "cdd4dded-4e5d-4e5a-8d22-fddd5301f7c2", "title": "New Update - Debby Most Intense Rainfall Still Ahead : Here When Storm Will Affect Northeast", "date": "2024-08-07 05:45", "url": "https://dailyvoice.com/connecticut/ridgefield/hurricane-debby-makes-landfall-along-florida-coast-latest-projected-track-timing/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "Landfall was around 7 a.m. Monday, Aug. 5 about 70 miles southeast of Tallahassee, the National Hurricane Center said.\nIt was downgraded to a tropical storm shortly thereafter as it hit Florida's Gulf Coast with flooding rain, damaging winds, and storm surge.\nThe slow-moving system is expected to affect the Northeast later this week, especially southern New England and potentially parts of Long Island.\nIn the first image above, areas that will experience some impacts are marked in yellow.\nDebby was upgraded from a tropical storm to a hurricane at about 11 p.m. Sunday, Aug. 4."}, {"id": "4a6ba25e-dced-4513-b188-beae51d9b5ae", "title": "Tropical storm hits Georgia , S . Carolina | The Arkansas Democrat - Gazette", "date": "2024-08-07 10:00", "url": "https://www.arkansasonline.com/news/2024/aug/07/tropical-storm-hits-georgia-s-carolina/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "CHARLESTON, S.C. -- Tropical Storm Debby drenched coastal cities in Georgia and South Carolina, stirred up tornadoes and submerged streets with waist-high floodwaters Tuesday, just the beginning of a prolonged storm that could dump staggering rain totals of up to 25 inches.\nIt will be a nervous few days for northern South Carolina and southern North Carolina, where forecasters warned of up to 15 inches of rain.\nNorth Carolina and Virginia have both declared a state of emergency.\nThe storm was forecast to slowly move out to sea, then creep back onshore over South Carolina on Thursday morning.\n(Andrew Whitaker/The Post And Courier via AP)Residents repair their roof as high winds from an outer band from Tropical Storm Debby passed over the Isle of Palms, S.C., Tuesday, Aug. 6, 2024."}, {"id": "c15356d6-c11b-4c5f-b91d-dcdc65f8800a", "title": "Tropical Storm Debby swirls over Atlantic , expected to again douse the Carolinas before moving north", "date": "2024-08-07 14:15", "url": "https://www.wfsb.com/2024/08/07/tropical-storm-debby-swirls-over-atlantic-expected-again-douse-carolinas-before-moving-north/", "domain": "wfsb.com", "domain_classification": "Unknown", "message": "Debby was expected to restrengthen and turn north toward the South Carolina coastline for a second landfall late Wednesday or early Thursday, weather officials.\nThe slow-moving storm drenched coastal cities in Georgia and South Carolina late Monday into Tuesday, stirring up tornadoes and submerging streets with waist-high floodwaters.\nAs Debby swirls just offshore, the heavy rain is expected to move into parts of South and North Carolina that have already seen two billion-dollar floods in eight years.\nStorm Debby is slowly swirling over South Carolina, spawning damaging tornadoes and dumping catastrophic rainfall across low-lying coastal regions.\nDebby is finally forecast to pick up speed Thursday, and it could move up the middle of North Carolina, through Virginia and into the Washington area by Saturday."}, {"id": "950ce127-9837-41a3-a0f7-896a1b7cf1f3", "title": "Tropical Storm Debby drenches Southeast with rain , high water as it drifts along the Atlantic coast - Boston News , Weather , Sports", "date": "2024-08-07 03:15", "url": "https://whdh.com/news/tropical-storm-debby-drenches-southeast-with-rain-high-water-as-it-drifts-along-the-atlantic-coast/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "South Carolina Gov.\nThe storm was forecast to slowly move out to sea, then creep back onshore over South Carolina on Thursday morning.\nGreen Pond in rural Colleton County, South Carolina, reported the most rain so far, just over 14 inches (36 centimeters).\nPresident Joe Biden approved emergency declarations making federal disaster assistance available to Florida, Georgia and South Carolina.\nDebby is finally forecast to pick up speed Thursday, and it could move up the middle of North Carolina, through Virginia and into the Washington area by Saturday."}, {"id": "8519fb39-e32c-46a7-b13d-4a2880c74531", "title": "Tropical Storm Debby swirls over Atlantic , expected to again douse the Carolinas before moving north", "date": "2024-08-07 13:45", "url": "https://www.kbtx.com/2024/08/07/tropical-storm-debby-swirls-over-atlantic-expected-again-douse-carolinas-before-moving-north/", "domain": "kbtx.com", "domain_classification": "Unknown", "message": "Debby was expected to restrengthen and turn north toward the South Carolina coastline for a second landfall late Wednesday or early Thursday, weather officials.\nThe slow-moving storm drenched coastal cities in Georgia and South Carolina late Monday into Tuesday, stirring up tornadoes and submerging streets with waist-high floodwaters.\nAs Debby swirls just offshore, the heavy rain is expected to move into parts of South and North Carolina that have already seen two billion-dollar floods in eight years.\nStorm Debby is slowly swirling over South Carolina, spawning damaging tornadoes and dumping catastrophic rainfall across low-lying coastal regions.\nDebby is finally forecast to pick up speed Thursday, and it could move up the middle of North Carolina, through Virginia and into the Washington area by Saturday."}, {"id": "0a5d8356-f39f-45e1-bc1a-7ccc88572cc8", "title": "Tropical Storm Debby swirls over Atlantic , expected to again douse the Carolinas before moving north", "date": "2024-08-07 05:45", "url": "https://www.news4jax.com/news/2024/08/07/tropical-storm-debby-swirls-over-atlantic-expected-to-again-douse-the-carolinas-before-moving-north/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Recommended VideosBut its core was surrounded by drier air and the worst rainfall was falling hundreds of miles to the north, into eastern North Carolina before spreading into southeast Virginia.\nForecasters warned 5 inches (13 centimeters) of rain could fall from South Carolina to Vermont through this weekend.\nThe area of most concern Wednesday was in southeastern North Carolina, where Hurricane Matthew caused a historic billion-dollar flood in 2016.\nCrooked Hammock Brewery in North Myrtle Beach, South Carolina, closed early on Tuesday.\nDebby is finally forecast to pick up speed Thursday before weakening inland as the weather moves north over North Carolina and Virginia into the Washington area by Saturday."}, {"id": "61e7838b-cc56-43b6-9c04-ecc4eb4840f4", "title": "Tropical Storm Debby drenches Southeast with rain , high water as it drifts along the Atlantic coast", "date": "2024-08-07 00:45", "url": "https://www.wfmz.com/news/tropical-storm-debby-drenches-southeast-with-rain-high-water-as-it-drifts-along-the-atlantic/article_676df317-8d1d-5b5b-916c-98905d5cf974.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "* At 529 PM EDT, Doppler radar and automated rain gauges indicated thunderstorms producing heavy rain across the warned area.\nBetween 1 and 2 inches of rain have fallen.\nIMPACT...Flooding of small creeks and streams, urban areas, highways, streets, and underpasses as well as other drainage and low lying areas.\nThis includes the following streams and drainages... Back Brook RARITAN, Primrose Brook HACKENSACK-PASSAIC, Black Brook HACKENSACK-PASSAIC, Ireland Brook RARITAN, Simonson Brook RARITAN, RARITAN, Wickecheoke Creek MIDDLE DELAWARE-MUSCONETCONG, Green Brook RARITAN, Beden Brook RARITAN, Harrisons Brook HACKENSACK-PASSAIC, West Branch Middle Brook RARITAN, Millstone River RARITAN, Lamington River RARITAN, Bound Brook RARITAN, Penns Brook HACKENSACK-PASSAIC, Indian Grove Brook HACKENSACK-PASSAIC, Ambrose Brook RARITAN, Passaic River HACKENSACK-PASSAIC, Mill Brook RARITAN, Oakeys Brook RARITAN, Plum Brook MIDDLE DELAWARE-MUSCONETCONG, Royce Brook RARITAN, Third Neshanic River RARITAN, Bonygutt Brook RARITAN, Holland Brook RARITAN, Cold Brook RARITAN, North Branch Raritan River RARITAN, Pike Run RARITAN, Roaring Brook RARITAN, HACKENSACK-PASSAIC, Middle Brook RARITAN, Hoopstick Brook RARITAN, Dukes Brook RARITAN, Chambers Brook RARITAN, East Branch Middle Brook RARITAN, First Neshanic River RARITAN, Assiscong Creek RARITAN, Raritan River RARITAN, South Branch Raritan River RARITAN and Sixmile Run RARITAN.\n&& FLASH FLOOD...RADAR AND GAUGE INDICATED; EXPECTED RAINFALL RATE...1-2 INCHES IN 1 HOURInfo:Type: Flash Flood Warningstart_time_local: 2024-08-06T17:29:00-04:00end_time_local: 2024-08-06T21:30:00-04:00county_name: Hunterdon Countystate: NJheadline: Flash Flood Warning from TUE 5:29 PM EDT until TUE 9:30 PM EDTcounty_fips:category: Meturl:urgency: Immediateseverity: Severecertainty: Likelygeographicname: Hunterdon Countystate_name: New Jersey"}, {"id": "4f5d0c2a-e4a6-421a-b078-e9d34d94d052", "title": "Tropical Storm Debby drenches Southeast with rain , high water as it drifts along the Atlantic coast", "date": "2024-08-07 00:45", "url": "https://wacotrib.com/ap/national/tropical-storm-debby-drenches-southeast-with-rain-high-water-as-it-drifts-along-the-atlantic/article_cda74900-ada2-5c37-b360-a288eb08a89c.html", "domain": "wacotrib.com", "domain_classification": "Unknown", "message": "As Debby swirls just offshore, the heavy rain is expected to move north into parts of South Carolina and North Carolina that have already seen two billion-dollar floods in eight years.\nSouth Carolina Gov.\nIt will be a nervous few days for northern South Carolina and southern North Carolina where forecasters warned up to 15 inches (38 centimeters) of rain could fall.\nNorth Carolina Gov.\nPresident Joe Biden approved emergency declarations making federal disaster assistance available to Florida, Georgia and South Carolina."}, {"id": "2d8ad170-3ccb-4c39-930e-23fed03aa927", "title": "Tropical Storm Debby drenches Southeast with rain , high water as it drifts along the Atlantic coast", "date": "2024-08-07 00:45", "url": "https://www.bostonglobe.com/2024/08/06/nation/tropical-storm-debby-drenches-southeast-with-rain-high-water-it-drifts-along-atlantic-coast/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "As Debby swirls just offshore, the heavy rain is expected to move north into parts of South Carolina and North Carolina that have already seen two billion-dollar floods in eight years.\nSouth Carolina Governor Henry McMaster said Debby hasn’t yet been as bad as feared, but he warned residents the slow-moving storm was far from over.\nIt will be a nervous few days for northern South Carolina and southern North Carolina where forecasters warned up to 15 inches of rain could fall.\nPresident Biden approved emergency declarations making federal disaster assistance available to Florida, Georgia, and South Carolina.\nThe hurricane center predicts the system could move up the middle of North Carolina, through Virginia and into the Washington, D.C., area by Saturday."}, {"id": "71115211-6da7-4fc1-b48e-7b70f59e160e", "title": "19 - year - old killed after tree falls through home in high winds , rain from Tropical Storm Debby", "date": "2024-08-07 03:30", "url": "https://www.witn.com/2024/08/07/19-year-old-killed-after-tree-falls-through-home-high-winds-rain-tropical-storm-debby/", "domain": "witn.com", "domain_classification": "Unknown", "message": "MOULTRIE, Ga. (WALB/Gray News) - Tropical Storm Debby continues to cause massive flooding and damage across the Eastern Seaboard after slamming into Florida on Monday.\nThe storm has brought with it torrential rain and high winds that have contributed to several deaths.\nColquitt County Coroner C. Verlyn Brock in Georgia reported the county’s first death due to the storm on Monday.\nAccording to Castleberry, Tropical Storm Debby also damaged other roofs and powerlines in the Moultrie area.\ntheThe National Hurricane Center said record-setting rain is expected in certain parts of the country as the storm continues to move up the East Coast."}, {"id": "6da2fbc3-14a0-4303-bbd5-e754f857b78f", "title": "Tropical Storm Debby drenches Southeast with rain , high water as it drifts along the Atlantic coast", "date": "2024-08-07 00:45", "url": "https://www.ajc.com/news/nation-world/tropical-storm-debby-drenches-southeast-with-rain-high-water-as-it-drifts-along-the-atlantic-coast/3PYZHTIMQRBGFNBY7QS4ONDJ5U/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "e147ce79-c25f-4f4f-afee-dc28c4ff2c04", "title": "19 - year - old killed after tree falls through home in high winds , rain from Tropical Storm Debby", "date": "2024-08-07 05:45", "url": "https://www.wistv.com/2024/08/07/19-year-old-killed-after-tree-falls-through-home-high-winds-rain-tropical-storm-debby/", "domain": "wistv.com", "domain_classification": "Unknown", "message": "MOULTRIE, Ga. (WALB/Gray News) - Tropical Storm Debby continues to cause massive flooding and damage across the Eastern Seaboard after slamming into Florida on Monday.\nThe storm has brought with it torrential rain and high winds that have contributed to several deaths.\nColquitt County Coroner C. Verlyn Brock in Georgia reported the county’s first death due to the storm on Monday.\nAccording to Castleberry, Tropical Storm Debby also damaged other roofs and powerlines in the Moultrie area.\ntheThe National Hurricane Center said record-setting rain is expected in certain parts of the country as the storm continues to move up the East Coast."}, {"id": "1afd744f-1f78-4f44-aa3a-206790ede12d", "title": "Storm Debby inundates coastal Georgia , South Carolina", "date": "2024-08-07 08:00", "url": "https://www.stabroeknews.com/2024/08/07/news/world/storm-debby-inundates-coastal-georgia-south-carolina/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "ATLANTA, (Reuters) – Tropical Storm Debby inundated coastal Georgia and South Carolina with a deluge of rain that could bring “catastrophic flooding” to Charleston, Savannah and other cities on Tuesday, a day after it slammed into Florida’s Gulf Coast as a hurricane.\nThe storm featured 40-mile-per-hour (64 kph) winds as it moved slowly just south of Savannah, Georgia, on Tuesday afternoon.\nMore than 8 inches (20 cm) of rain have already fallen on Savannah and Valdosta, Georgia, the National Weather Service said.\nA suspected twister flipped over cars and damaged restaurants in Moncks Corner, South Carolina, about 30 miles (48 km) north of Charleston, early on Tuesday morning.\nThe NHC said Debby would slow down and move east and off Georgia’s shore on Tuesday before turning north and drifting inland over South Carolina near Charleston on Thursday."}, {"id": "8114a2f9-8e70-43ee-92ca-28cc8390fcc2", "title": "Tropical Storm Debby drenches Southeast with rain , high water as it drifts along the Atlantic coast", "date": "2024-08-07 00:30", "url": "https://www.ktbs.com/news/national/tropical-storm-debby-drenches-southeast-with-rain-high-water-as-it-drifts-along-the-atlantic/article_98e8b01a-c77b-58d9-b941-0f728a26020b.html", "domain": "ktbs.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby drenches Southeast with rain, high water as it drifts along the Atlantic coastTropical Storm Debby has drenched coastal cities in Georgia and South Carolina and is not finished bringing heavy rain to the eastern U.S. Debby was centered just east of Savannah on Tuesday afternoon"}, {"id": "bfc5a51a-a39e-4e38-9948-b06c7c65704c", "title": "Here how much rain to expect in Charlotte this week from Tropical Storm Debby", "date": "2024-08-07 13:30", "url": "https://www.wbtv.com/2024/08/07/heres-how-much-rain-expect-charlotte-this-week-tropical-storm-debby/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - Tropical Storm Debby will bring rain and the likelihood of flash flooding to a large part of North Carolina, with Charlotte impacts peaking on Thursday.\nOur First Alert Weather team predicts three to six inches of rain along the Interstate 77 corridor, with the greatest impacts unfolding south and east of Charlotte.\nDebby will likely bring several inches of rain to the Charlotte region.\nA First Alert Weather Day is in place for Thursday when Debby’s forecast is expected to move over our viewing area.\n>> Related: Tropical Storm Debby producing gusty winds, tornado chances across the CarolinasA State of Emergency was activated in North Carolina Monday afternoon in anticipation of severe weather brought on by Debby."}, {"id": "9d8807b3-95e4-4525-9cfa-5165ba2efd84", "title": "Gov . Moore signs  State of Preparednes declaration ahead of Tropical Storm Debby", "date": "2024-08-07 13:30", "url": "https://www.yahoo.com/news/gov-moore-signs-state-preparedness-113415034.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "MARYLAND (DC News Now) — Maryland Governor Wes Moore signed a “State of Preparedness” declaration on Tuesday.\nThis comes as heavy rainfall and winds associated with Tropical Storm Debby are expected to hit the DMV on Thursday afternoon.\nBy declaring a State of Preparedness, I am directing the Department of Emergency Management to coordinate the comprehensive preparation of State government ahead of potential impacts from the remnants of Tropical Storm Debby,” said Gov.\nVirginia governor declares state of emergency ahead of Tropical Storm DebbyAccording to the National Hurricane Center forecast for Tropical Storm Debby, potential remnants of the storm will push into the Mid-Atlantic late this week and into Saturday morning.\nTo learn if you live, work or vacation in an Evacuation Zone in Maryland, please visit our Know Your Zone page."}, {"id": "3992e42e-bd39-41dc-9227-338c27797187", "title": "Tropical Storm Debby slow movement brings over a foot of rain to some locations", "date": "2024-08-07 01:30", "url": "https://www.wishtv.com/weather/tropical-storm-debbys-slow-movement-brings-over-a-foot-of-rain-to-some-locations/", "domain": "wishtv.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby’s slow movement brings over a foot of rain to some locationsINDIANAPOLIS (WISH) — Debby made landfall as a hurricane Monday morning as a Category 1 storm with maximum winds of 80 mph.\nThe rainfall from the system is the major impact of the storm’s slow movement up the coast.\nFlooding will continue in eastern Georgia, South Carolina, and North Carolina as Debby is still dropping rain in these locations.\nIt is not out of the question that spots in the Carolinas make a run at 30 inches of rain once this storm system is over.\nRainfall estimates of what has fallen as of 4:30 p.m. EDT, Aug. 6, 2024Additional rainfall possibleFuture Track of Tropical Storm DebbyAs of 5 p.m. EDT, Debby is a tropical storm with maximum winds of 40 mph."}, {"id": "9207d508-f4c0-42fa-8d5f-58619f03a979", "title": "Tropical Storm Debby swirls over Atlantic , expected to again douse the Carolinas before moving north", "date": "2024-08-07 11:00", "url": "https://www.westernmassnews.com/2024/08/07/tropical-storm-debby-swirls-over-atlantic-expected-again-douse-carolinas-before-moving-north/", "domain": "westernmassnews.com", "domain_classification": "Unknown", "message": "Debby was expected to restrengthen and turn north toward the South Carolina coastline for a second landfall late Wednesday or early Thursday, weather officials.\nThe slow-moving storm drenched coastal cities in Georgia and South Carolina late Monday into Tuesday, stirring up tornadoes and submerging streets with waist-high floodwaters.\nAs Debby swirls just offshore, the heavy rain is expected to move into parts of South and North Carolina that have already seen two billion-dollar floods in eight years.\nStorm Debby is slowly swirling over South Carolina, spawning damaging tornadoes and dumping catastrophic rainfall across low-lying coastal regions.\nDebby is finally forecast to pick up speed Thursday, and it could move up the middle of North Carolina, through Virginia and into the Washington area by Saturday."}, {"id": "6e38afc7-6516-4467-9432-c1394f93a20a", "title": "JD Vance postpones Thursday NC visit due to Debby severe weather forecast", "date": "2024-08-07 04:45", "url": "https://www.wbtv.com/2024/08/06/jd-vance-postpones-thursdays-nc-visit-due-debbys-severe-weather-forecast/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "RALEIGH, N.C. (WBTV) - Senator JD Vance has postponed his North Carolina visit due to Tropical Storm Debby’s severe weather forecast.\nThe two events were scheduled to take place in Raleigh and Oakboro.\nThe Trump-Vance campaign will reschedule the events “as soon as possible.”>> Related: Kamala Harris postpones Thursday’s NC visit, cites Tropical Storm DebbyA State of Emergency was activated in North Carolina Monday afternoon in anticipation of severe weather brought on by Debby.\nThe emergency declaration was made the day before potentially historic rainfall, and subsequent flooding was expected to reach the Carolinas.\nCopyright 2024 WBTV."}, {"id": "266c407a-5748-4808-bd4b-fc102107c76d", "title": "Tropical Storm Debby swirls over Atlantic , expected to again douse the Carolinas before moving north", "date": "2024-08-07 08:00", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/tropical-storm-debby-swirls-over-atlantic-expected-to-again-douse-the-carolinas-before-moving-north/article_c75d5ee5-2d71-50f1-badf-d2e88a36b1c4.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby swirls over Atlantic, expected to again douse the Carolinas before moving northTropical Storm Debby is taking a breather over the western Atlantic ocean but it will douse the coastal Carolinas again before it slowly marches north"}, {"id": "4b4834c0-5bac-4156-8fe9-c4696cc8dc5b", "title": "Tropical Storm Debby soaks US southeast", "date": "2024-08-07 04:30", "url": "https://www.canberratimes.com.au/story/8722225/tropical-storm-debby-soaks-us-southeast/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "More than 20cm of rain have already fallen on Savannah and Valdosta, Georgia, the National Weather Service said.\nCharleston and Hilton Head, South Carolina, have received between 25 to 30cm of rain so far, the weather service said, with more on the way."}, {"id": "3d5c3d58-8baf-41b3-a226-292cf8824c25", "title": "Tropical Storm Debby drenches Southeast as it drifts along Atlantic coast", "date": "2024-08-07 01:30", "url": "https://www.voanews.com/a/tropical-storm-debby-drenches-southeast-as-it-drifts-along-atlantic-coast-/7732539.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "As Debby swirls just offshore, the heavy rain is expected to move north into parts of South Carolina and North Carolina that have already seen two billion-dollar floods in eight years.\nSouth Carolina Governor Henry McMaster said Debby hasn't yet been as bad as feared, but he warned residents that the slow-moving storm was far from over.\nNorth Carolina Governor Roy Cooper declared a state of emergency Monday, and Virginia Governor Glenn Youngkin declared the same for his state on Tuesday.\nGreen Pond in rural Colleton County, South Carolina, reported the most rain so far from Debby with just over 36 centimeters (14 inches).\nPresident Joe Biden approved emergency declarations making federal disaster assistance available to Florida, Georgia and South Carolina."}, {"id": "ccad74f8-3905-4c31-bbaf-272a85fe7337", "title": "Shop owners in Swansboro prep amid flooding fears , reflect on past storm struggles", "date": "2024-08-07 00:00", "url": "https://www.wcti12.com/newsletter-daily/shop-owners-in-swansboro-prep-amid-flooding-fears-reflect-on-past-storm-struggles-debby-florence-severe-weather-hurricane-tropical-storm", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "Swansboro natives are remembering Hurricane Florence and are thankful that things are not expected to be as bad as they were then.\nIn Swansboro, the rain was coming down pretty hard Tuesday afternoon.\nPeople in Swansboro are nervous about the upcoming storm and doing the best they can to prepare for Debby.\nI lost my very first building to Hurricane Florence and it's been a job to recover from that.\nThough some locals are worried about the upcoming rain, many are not as concerned due to the damage that came with Hurricane Florence a few years ago."}, {"id": "a7ee8995-95a2-4ba5-bc5c-fa3923414d70", "title": "The Latest : Tropical Storm Debby churns off the US Southeast", "date": "2024-08-07 00:00", "url": "https://www.local3news.com/local-news/georgia/the-latest-tropical-storm-debby-churns-off-the-us-southeast/article_a29f3cd9-c6f0-58ad-b284-ad4919f6afb0.html", "domain": "local3news.com", "domain_classification": "Unknown", "message": "The Latest: Tropical Storm Debby churns off the US SoutheastThe mayor of Charleston, South Carolina, says the peninsula that makes up much of the city's historic downtown will remain closed Tuesday as Tropical Storm Debby spins nearby"}, {"id": "76059c80-6cf5-4280-855d-858db4fd15e2", "title": "From strangers to buddies , these wildfire survivors are back together on 1 - year anniversary", "date": "2024-08-07 03:30", "url": "https://www.hawaiinewsnow.com/2024/08/06/strangers-buddies-these-wildfire-survivors-are-back-together-1-year-anniversary/", "domain": "hawaiinewsnow.com", "domain_classification": "Unknown", "message": "Approaching the year anniversary of the Maui wildfire, they were reunited in Kapalua.\nStrangers turned buddies, brought together during the Lahaina fire storm.\nFernandez turned around and drove back down.\nThat’s when he saw Brunel clinging to a tree.\n“I love him and consider him a friend — friend with a capital F — for the rest of my life,” Brunel said."}, {"id": "48ded786-82aa-4740-81e1-b831a7eec0dc", "title": "In the wake of T . S . Debby , here what you need to know about flood insurance", "date": "2024-08-07 00:45", "url": "https://www.walb.com/2024/08/06/wake-ts-debby-heres-what-you-need-know-about-flood-insurance/", "domain": "walb.com", "domain_classification": "Unknown", "message": "As many have learned, flood water can be extremely costly for homeowners.\nIf you live in an area that has a low to moderate flood risk, you’re chances of flood damage are greater.\n“Unfortunately, when it comes to floods, if you don’t have flood-specific insurance, this flood damage is just not going to be covered,” she said.\nFEMA also estimates the average cost of a flood insurance policy is around $700.\nWith this just being the start of hurricane season, experts say if you plan to get flood insurance, now is the time to make sure you’re covered."}, {"id": "3a5fd4ad-01fa-44de-ab16-f41a9ffcd2cf", "title": "  Hope everything is going to be okay : Nearly 500 people could be impacted from Black Creek flooding in Clay County – Action News Jax", "date": "2024-08-07 03:30", "url": "https://www.actionnewsjax.com/news/local/hope-everything-is-going-be-okay-nearly-500-people-could-be-impacted-black-creek-flooding-clay-county/3MJKCFJ2PNHW5KSI26Q5SPB4SM/", "domain": "actionnewsjax.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "44f0b3eb-abd1-4e64-ae26-a6b115cf2a46", "title": "Flash flooding traps drivers on NYC roads after storms dump 4 inches of rain on Big Apple", "date": "2024-08-07 09:30", "url": "https://www.yahoo.com/news/flash-flooding-traps-drivers-nyc-031755098.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Flights canceled, drivers trapped on NYC roads after massive storm dumps 4 inches of rain on cityFlash flooding left several drivers stranded in their cars in New York City on Tuesday.\nTuesday’s rains dumped as much as four inches in parts of New York City.\nThe deluge was partially a result of Tropical Storm Debby, which made landfall as a Category 1 hurricane in Florida on Monday, killing at least five people, before it was downgraded to a tropical storm.\nAt Newark Liberty International Airport in New Jersey, 134 flights were canceled and 149 flights delayed.\nThe tri-state area will likely see more showers beginning Wednesday afternoon before the leftovers of Tropical Storm Debby whack the region from Thursday into the weekend, Tate said."}, {"id": "a717a537-c4bf-4f75-b805-efe8af799622", "title": "Moderate earthquake , 5 . 6 mag was detected near the Fiji Islands", "date": "2024-08-07 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/06/moderate-earthquake-5-6-mag-was-detected-near-the-fiji-islands-3/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A moderate earthquake with magnitude 5.6 (ml/mb) was reported south of the Fiji Islands (0 miles) on Tuesday.\nExact location of earthquake, longitude -177.6308 West, latitude -24.4277 South, depth = 208.894 km.\nIds that are associated to the earthquake: us6000nifm.\nThe earthquake occurred at a depth of 208.894 km (130 miles).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: south of the Fiji Islands."}, {"id": "07e3ef54-4e16-4110-87f0-928de140876d", "title": "Victoria struck by 4 . 1 magnitude earthquake", "date": "2024-08-07 00:30", "url": "https://www.bendigoadvertiser.com.au/story/8721564/victoria-struck-by-41-magnitude-earthquake/", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "While Australia didn't have an active tectonic plate boundary like in New Guinea or New Zealand, stress from other boundaries slowly built up to the interior of the plate, eventually causing faults to fail, Prof Cummins said."}, {"id": "1abfa67c-0ebf-4b95-b0c3-ef9401b1eee1", "title": "Light earthquake 4 . 8 mag , Kermadec Islands region", "date": "2024-08-07 09:15", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-4-8-mag-kermadec-islands-region-5/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.8 (ml/mb) has occurred on Wednesday, Kermadec Islands region (0 miles).\nEvent ids that are associated to the earthquake: us6000nik5.\nId of event: us6000nik5.\nThe 4.8-magnitude earthquake has occurred at 07:10:32 / 7:10 am (local time epicenter).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: Kermadec Islands region."}, {"id": "f5704e90-7dfe-421b-9017-00067a79b87c", "title": "Light earthquake , 4 . 2 mag was detected near Kokopo in Papua New Guinea", "date": "2024-08-07 04:45", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-4-2-mag-was-detected-near-kokopo-in-papua-new-guinea-6/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) has struck on Tuesday, 182 km S of Kokopo, Papua New Guinea (113 miles).\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nIds that are associated to the earthquake: us6000nidx.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 182 km S of Kokopo, Papua New Guinea."}, {"id": "1152b7a0-e57a-47ad-a453-e9f5a4691f8a", "title": "Light earthquake , 4 . 1 mag strikes near Onagawa Chō in Japan", "date": "2024-08-07 04:45", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-4-1-mag-strikes-near-onagawa-cho-in-japan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.1 (ml/mb) strikes 126 km SE of Onagawa Chō, Japan (78 miles) on Tuesday.\nIds that are associated to the earthquake: us6000nid6.\nThe earthquake occurred at a depth of 35 km (22 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 126 km SE of Onagawa Chō, Japan."}, {"id": "9cb7cb28-c302-459f-97c8-a4a679009078", "title": "Light earthquake 4 . 4 mag , northern Mid - Atlantic Ridge", "date": "2024-08-07 04:45", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-4-4-mag-northern-mid-atlantic-ridge-12/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Tuesday, northern Mid-Atlantic Ridge (0 miles).\nExact location of event, depth 10 km, -43.7178° West, 28.3618° North.\nGlobal date and time of event UTC/GMT: 23/07/24 / 2024-07-23 02:56:36 / July 23, 2024 @ 2:56 am.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: northern Mid-Atlantic Ridge."}, {"id": "0e415c02-de97-4f2e-883a-1311a2920d64", "title": "Tropical Storm Debby : Torrential Rain , Flooding Possible in CNY", "date": "2024-08-07 11:45", "url": "https://bigfrog104.com/ixp/41/p/tropical-storm-debby-in-cny/", "domain": "bigfrog104.com", "domain_classification": "Unknown", "message": "Parts of New York State were drenched overnight, August 6, with some areas receiving over 4 inches of rain.\nThis storm produced prolific rainfall, with parts of Florida being flooded by 19 inches of rainfall.\nAccording to ABC News, Debby is expected to make a second landfall around Thursday morning and slam Wilmington, NC, with 60 mph winds and heavy rainfall.\nThe storm will first strike lower New York and the Hudson Valley area, bringing heavy rainfall and 35 mph winds.\nTropical Storm Debby Brings Soaking Rains To The Southeast Miguel J. Rodriguez Carrillo/Getty Images loading..."}, {"id": "7e590482-11fa-4e0b-acf1-36a437d96952", "title": "Tropical Storm Debby : Torrential Rain , Flooding Possible in CNY", "date": "2024-08-07 11:30", "url": "https://lite987.com/ixp/41/p/tropical-storm-debby-in-cny/", "domain": "lite987.com", "domain_classification": "Unknown", "message": "Parts of New York State were drenched overnight, August 6, with some areas receiving over 4 inches of rain.\nThis storm produced prolific rainfall, with parts of Florida being flooded by 19 inches of rainfall.\nAccording to ABC News, Debby is expected to make a second landfall around Thursday morning and slam Wilmington, NC, with 60 mph winds and heavy rainfall.\nThe storm will first strike lower New York and the Hudson Valley area, bringing heavy rainfall and 35 mph winds.\nTropical Storm Debby Brings Soaking Rains To The Southeast Miguel J. Rodriguez Carrillo/Getty Images loading..."}, {"id": "c20ce406-c6fc-4c97-9f13-f69c115d8d58", "title": "Light earthquake 4 . 9 mag , 86 km ENE of Levuka , Fiji", "date": "2024-08-07 04:45", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-4-9-mag-86-km-ene-of-levuka-fiji/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.9 (ml/mb) was reported 86 km ENE of Levuka, Fiji (53 miles) on Wednesday.\nExact time and date of earthquake 07/08/24 / 2024-08-07 03:20:58 / August 7, 2024 @ 3:20 am UTC/GMT.\nThe earthquake was roughly at a depth of 606.155 km (377 miles).\nExact location of earthquake, longitude -179.954 West, latitude -17.7187 South, depth = 606.155 km.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 86 km ENE of Levuka, Fiji."}, {"id": "a88969f0-69b0-4d11-a7ff-c7276f6e3944", "title": "Suwannee County Animal Shelter pleads for foster parents , adoptions in wake of Hurricane Debby", "date": "2024-08-07 06:15", "url": "https://www.wctv.tv/2024/08/07/suwannee-county-animal-shelter-pleads-foster-parents-adoptions-wake-hurricane-debby/", "domain": "wctv.tv", "domain_classification": "Unknown", "message": "SUWANNEE COUNTY, Fla. (WCTV) - Hurricane Debby dumped inches of rain onto the Big Bend, leaving many in Suwannee County dealing with serious flooding and even prompting a water rescue.\nBut the people of Suwannee County aren’t the only ones in need of assistance after Debby.\nThe Suwannee County Animal Shelter is calling on people across the Big Bend and South Georgia to consider stepping up to help foster or adopt from their shelter in the wake of Debby.\nThere are 50 dogs at the animal shelter needing their forever home.\n“We are blessed that we came through this with no injuries.”Preparations at Suwannee County Animal Shelter began days before Debby passed through."}, {"id": "25cf4236-7f59-4854-89e3-0a4d25267b32", "title": "Light earthquake : M4 . 4 quake has struck near Fiji region", "date": "2024-08-07 04:45", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-m4-4-quake-has-struck-near-fiji-region-25/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.4 (ml/mb) was detected on Tuesday, Fiji region (0 miles).\nThe 4.4-magnitude earthquake has occurred at 02:27:59 / 2:27 am (local time epicenter).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the event: us6000nidd.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: Fiji region."}, {"id": "41636b78-ee64-48d3-88f4-deae44ab6389", "title": "Debby is expected to continue drenching eastern South Carolina", "date": "2024-08-07 04:15", "url": "https://www.kacu.org/2024-08-06/debby-is-expected-to-continue-drenching-eastern-south-carolina", "domain": "kacu.org", "domain_classification": "Unknown", "message": "AILSA CHANG, HOST:South Carolina is bracing for a lot of rain and flooding over the next several days as Tropical Storm Debby meanders through the state.\nIt's now a wet and slow tropical storm which may dump what the National Hurricane Center is calling potentially historic heavy rains over Eastern South Carolina through Friday.\nALLEN: Well, you know, Debby moved pretty quickly through Florida after making landfall yesterday morning.\nAnd you have significant power outages in Florida and Georgia, and the numbers are going up in South Carolina.\nThat will also be the case in South Carolina, where the flash flooding threat will continue at least through Friday after Debby's left the state."}, {"id": "dc574b82-22d4-4bcf-ba53-c5751d528453", "title": "Light earthquake , 4 . 4 mag has occurred near Saipan in Northern Mariana Islands", "date": "2024-08-07 04:45", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-4-4-mag-has-occurred-near-saipan-in-northern-mariana-islands/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 94 kilometers (58 miles) from Saipan in Northern Mariana Islands on Tuesday.\nThe epicenter of the earthquake was roughly 35 km (22 miles) below the earth’s surface.\nClose country/countries, Northern Mariana Islands (c. 54 000 pop) (That might be effected).\nEpicenter of the event was 95 km (59 miles) from Saipan (c. 48 200 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 94 km NE of Saipan, Northern Mariana Islands."}, {"id": "c21a4964-7ea0-437a-8fa6-8b065ed6823f", "title": "Light earthquake , 4 . 3 mag has occurred near Kangding in China", "date": "2024-08-07 04:45", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-4-3-mag-has-occurred-near-kangding-in-china/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.3 (ml/mb) was detected on Wednesday, 65 kilometers (40 miles) from Kangding in China.\nId of earthquake: us6000nign.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent epicenter was 71 km (44 miles) from Kangding (c. 100 000 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 65 km S of Kangding, China."}, {"id": "99630397-55e9-418f-8246-647de1dffe4c", "title": "Breaking National News - 92 . 7 - FM TheDRIVE - Bob & Tom Mornings , Central New York Best Rock All Day", "date": "2024-08-07 14:15", "url": "https://927thedrive.net/news/breaking-national-news/c9383e540aef9422065b8f4909f40a15", "domain": "927thedrive.net", "domain_classification": "Unknown", "message": "A flood watch is in effect for Georgia, South Carolina, North Carolina and Virginia through Friday.\nTornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov.\nTropical Storm Debby slowing down as it moves across USTropical Storm Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line as of 5 p.m.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "c9829fe4-56fe-446c-b81a-97ec2be7e190", "title": "National News - Media One Radio Group ( WWSE | WJTN | WHUG | WKSN | WQFX", "date": "2024-08-07 14:30", "url": "https://wksn.com/news-and-closings/national-headlines/2bca990655ae121e3fa104534a84e1f4", "domain": "wksn.com", "domain_classification": "Unknown", "message": "A flood watch is in effect for Georgia, South Carolina, North Carolina and Virginia through Friday.\nTornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov.\nTropical Storm Debby slowing down as it moves across USTropical Storm Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line as of 5 p.m.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "2e4b1fb7-5c78-43ec-8360-bcf9cc54e34c", "title": "Light earthquake , 4 . 5 mag was detected near the Fiji Islands", "date": "2024-08-07 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/06/light-earthquake-4-5-mag-was-detected-near-the-fiji-islands-36/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.5 (ml/mb) was detected on Tuesday, south of the Fiji Islands (0 miles).\nExact location of event, longitude -179.8578 West, latitude -23.8088 South, depth = 509.427 km.\nThe temblor was detected at 20:04:09 / 8:04 pm (local time epicenter).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: south of the Fiji Islands."}, {"id": "8ef65b38-3e83-4cdc-8699-c79d2a8c7878", "title": "National - Carroll Broadcasting Inc . ", "date": "2024-08-07 11:30", "url": "https://wkjc.com/national/e7de7ab9ff2e172f8fd04ffb505d2adc", "domain": "wkjc.com", "domain_classification": "Unknown", "message": "A flood watch is in effect for Georgia, South Carolina, North Carolina and Virginia through Friday.\nTornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov.\nTropical Storm Debby slowing down as it moves across USTropical Storm Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line as of 5 p.m.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "5a0194a2-4b10-4247-9206-2e158c4d40ac", "title": "National News - Media One Radio Group ( WWSE | WJTN | WHUG | WKSN | WQFX", "date": "2024-08-07 11:30", "url": "https://wjtn.com/news-and-closings/national-headlines/2bca990655ae121e3fa104534a84e1f4", "domain": "wjtn.com", "domain_classification": "Unknown", "message": "A flood watch is in effect for Georgia, South Carolina, North Carolina and Virginia through Friday.\nTornado Watch remains in effect across eastern South Carolina and North Carolina, from Myrtle Beach to Morehead City until 1 a.m.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby \"creeping across our state,\" South Carolina Gov.\nTropical Storm Debby slowing down as it moves across USTropical Storm Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line as of 5 p.m.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "e13e5b04-de37-4a75-86ac-2cbd95ea4b25", "title": "Tropical Storm Debby live updates : South Carolina forecast for storm second landfall", "date": "2024-08-07 13:45", "url": "https://www.k101fm.net/syndicated-article/?id=1577899", "domain": "k101fm.net", "domain_classification": "Unknown", "message": "Debby is expected to remain a tropical storm into Thursday, when it’s forecast to make a second landfall in South Carolina.\nMyrtle Beach, South Carolina; Wilmington, North Carolina; and Lumberton, North Carolina, are forecast to get hit the hardest over the next 24 to 36 hours.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\nTropical Storm Debby slowing down as it moves across USTropical Storm Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line as of 5 p.m.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "7d1c8e44-140d-426a-8dd0-d3168050cad3", "title": "Tropical Storm Debby live updates : Storm churns in Atlantic ahead of second landfall", "date": "2024-08-07 14:30", "url": "https://www.wlip.com/syndicated-article/?id=1577868", "domain": "wlip.com", "domain_classification": "Unknown", "message": "Debby is expected to remain a tropical storm into Thursday, when it’s forecast to make a second landfall in South Carolina.\nDebby is slowly moving eastward offshoreTropical Storm Debby is slowly moving eastward offshore the coasts of Georgia and South Carolina.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\nTropical Storm Debby slowing down as it moves across USTropical Storm Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line as of 5 p.m.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "3bf89c1c-dc5d-4970-bda1-04bf806c1f55", "title": "State of preparedness in effect in Maryland as Tropical Storm Debby nears", "date": "2024-08-07 01:30", "url": "https://wtop.com/weather-news/2024/08/state-of-preparedness-in-effect-in-maryland-as-tropical-storm-debby-nears/", "domain": "wtop.com", "domain_classification": "Unknown", "message": "As a heat emergency ends in D.C., Virginia and Maryland have declared states of emergencies as Tropical Storm Debby creeps into the area.\nWes Moore has declared a state of preparedness ahead of the “significant risk” Tropical Storm Debby poses to the area.\n“As we prepare for Tropical Storm Debby, I urge all Virginians and visitors to stay informed, follow local emergency guidelines, and take necessary precautions to ensure the safety of their families and communities.\nWednesday will be cooler and cloudy, before remnants from Tropical Storm Debby deliver rain and rumbles of thunder to the area.\nTHURSDAY: Scattered showers and storms likelyHighs: 75-80Winds: East 5-10 mphWidespread rain is likely due to the remnants of Debby moving through the region."}, {"id": "3d0be7e3-4914-42c1-b1e2-0bb03ec7bb22", "title": "Tropical Storm Debby live updates : Dangerous flooding ongoing for Southeast - WEIS | Local & Area News , Sports , & Weather", "date": "2024-08-07 10:45", "url": "https://weisradio.com/2024/08/07/tropical-storm-debby-live-updates-dangerous-flooding-ongoing-for-southeast/", "domain": "weisradio.com", "domain_classification": "Unknown", "message": "South Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\n“Restoration is taking longer in areas with flooding and heavy vegetation, as crews must wait for the water to recede and clear through debris before they can restore power,” Florida Power & Light said Tuesday morning.\nTropical Storm Debby slowing down as it moves across USTropical Storm Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line as of 5 p.m.\nDebby strengthens into a hurricaneThe National Hurricane Center has upgraded Tropical Storm Debby to a Category 1 hurricane with winds of 75 mph.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "7a011b3f-758a-46cd-9ca8-31b0e9d7a6e2", "title": "Tropical Storm Debby live updates : Dangerous flooding ongoing for Southeast", "date": "2024-08-07 10:15", "url": "https://midutahradio.com/news/national-news/tropical-storm-debby-live-updates-dangerous-flooding-ongoing-for-southeast/", "domain": "midutahradio.com", "domain_classification": "Unknown", "message": "South Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\n“Restoration is taking longer in areas with flooding and heavy vegetation, as crews must wait for the water to recede and clear through debris before they can restore power,” Florida Power & Light said Tuesday morning.\nTropical Storm Debby slowing down as it moves across USTropical Storm Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line as of 5 p.m.\nDebby strengthens into a hurricaneThe National Hurricane Center has upgraded Tropical Storm Debby to a Category 1 hurricane with winds of 75 mph.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "992e6d0a-bb47-46d6-8693-7b831e1865a9", "title": "Tropical Storm Debby live updates : Dangerous flooding ongoing for Southeast", "date": "2024-08-07 12:00", "url": "https://www.brookingsradio.com/syndicated-article/?id=1577860", "domain": "brookingsradio.com", "domain_classification": "Unknown", "message": "South Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\n“Restoration is taking longer in areas with flooding and heavy vegetation, as crews must wait for the water to recede and clear through debris before they can restore power,” Florida Power & Light said Tuesday morning.\nTropical Storm Debby slowing down as it moves across USTropical Storm Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line as of 5 p.m.\nDebby strengthens into a hurricaneThe National Hurricane Center has upgraded Tropical Storm Debby to a Category 1 hurricane with winds of 75 mph.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}, {"id": "27be49d3-d1ec-49fb-b45f-98040a16ce85", "title": "Flash flooding traps drivers on NYC roads after storms dump 4  of rain on Big Apple", "date": "2024-08-07 03:45", "url": "https://nypost.com/2024/08/06/us-news/flash-flooding-traps-drivers-on-nyc-roads-after-storms-dump-4-of-rain-on-big-apple/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "7 Tuesday’s rains dumped as much as four inches in parts of New York City.\nThe deluge was partially a result of Tropical Storm Debby, which made landfall as a Category 1 hurricane in Florida on Monday, killing at least five people, before it was downgraded to a tropical storm.\nGetty Images7 Parts of the Bronx and Long Island saw more than 4 inches of rain.\nAt Newark Liberty International Airport in New Jersey, 134 flights were canceled and 149 flights delayed.\nThe tri-state area will likely see more showers beginning Wednesday afternoon before the leftovers of Tropical Storm Debby whack the region from Thursday into the weekend, Tate said."}]