[{"id": "110a8449-e5db-4600-a422-d9f0090c85e7", "title": "IDF Finds Loaded Rocket Launchers in Rafah", "date": "2024-05-17 04:00", "url": "https://www.breitbart.com/middle-east/2024/05/16/idf-finds-loaded-rocket-launchers-in-rafah/", "message": "The Israel Defense Forces (IDF) has found loaded rocket launchers during its operation in Rafah in the southern Gaza Strip, now in its second week.\nThese launchers were used by the terrorist organizations in the Gaza Strip to launch rockets toward Israel in recent months.\nThe rocket launchers were destroyed by the IDF.\nIn another targeted raid, the soldiers located significant rocket launch infrastructure in the Rafah area and rockets ready to be launched.\nThe fact that the IDF is discovering and destroying rocket launchers provides further justification for the ongoing Rafah operation, to which the Biden administration and much of the international community has objected."}, {"id": "9762603a-88c7-47b6-be02-e72c2c3d8862", "title": "The Latest | Israel says it will send more troops to Rafah , as fighting also rages in Gaza north", "date": "2024-05-17 00:15", "url": "https://www.newsday.com/news/nation/israel-iran-hamas-latest-05-16-2024-x30540", "message": "Israel's defense minister said the military would send more troops into Rafah, a city along Gaza's southern border with Egypt, as fighting also rages in northern Gaza, where Hamas has regrouped.\nAs a result of the explosion, an Israeli military said a soldier was severely wounded and two additional soldiers were lightly injured.\nThe fighting began shortly after Israel launched its war against Hamas following the militant group’s attack on southern Israel.\nIn other violence, the Israeli military said Thursday a noncommissioned officer was moderately wounded in a stabbing attack in the West Bank.\nAlong with the fighting in northern Gaza, Israeli troops have also pushed into parts of the southernmost Gaza city of Rafah."}, {"id": "eee8689f-9cb8-4dd7-a510-89be74f58ae4", "title": "Israel Suffering Military Casualties And Attacks From Hezbollah", "date": "2024-05-17 03:00", "url": "https://www.worthynews.com/95458-israel-suffering-military-casualties-and-attacks-from-hezbollah", "message": "The friendly fire incident happened Wednesday in the Jabalya area in northern Gaza but was only revealed Thursday for security reasons.\nThe Israel Defense Forces (IDF) said two tanks were mistakenly firing on “a forward IDF battalion headquarters,” apparently believing they were Hamas fighters, resulting in casualties.\nOutside Gaza, Iran-backed Hezbollah claimed responsibility for what it said was its “deepest strike to date” inside Israel.\nThe Lebanon-based militia referred to a drone striking an IDF air force base in northern Israel.\nThe war began after Hamas fighters entered Israel on October 7, killing some 1,200 people and injuring hundreds more."}, {"id": "71a11267-5459-49ab-a19a-285645f85d19", "title": "A look at high - profile political assassinations and attempts this century", "date": "2024-05-17 04:30", "url": "https://abcnews.go.com/Politics/wireStory/high-profile-political-assassinations-attempts-century-110313487", "message": "Here’s a global look at other notable political assassinations and attempts during the 21st century:— Sept. 1, 2022: Argentina's then-Vice President Cristina Fernández is targeted by a man who reportedly aimed a handgun at point-blank range toward the politician in what government ministers characterize as an assassination attempt.\n— Nov. 6, 2021: Iraqi Prime Minister Mustafa al-Kadhimi survives an assassination attempt when two armed drones target his residence in Baghdad's Green Zone area.\nThe gunman was later killed in a shootout with police.\n— Feb. 14, 2005: Lebanese Prime Minister Rafik Hariri is killed by a suicide truck bomb on a seaside boulevard in Beirut.\n— March 12, 2003: Serbian Prime Minister Zoran Djindjic is shot dead in front of the Serbian government headquarters in Belgrade."}, {"id": "3cd26729-dc42-45e0-9a7b-06637aa8a075", "title": "The ADVANCE Democracy Act : A Dose of Realism Needed", "date": "2024-05-17 02:00", "url": "https://www.heritage.org/defense/report/the-advance-democracy-act-dose-realism-needed", "message": "The promotion of democracy remains an important goal of U.S. foreign policy.\nEqually important, the U.S. should promote democracy without limiting the executive branch's ability to conduct foreign policy.\nThe ADVANCE Democracy Act serves the American public by emphasizing the role of democracy in U.S. foreign policy in general and at the State Department in particular.\nThe bill sets out to spread \"universal democracy\" worldwide, but its expansive legislative language sacrifices foreign policy flexibility and agility.\nIn particular, the ADVANCE Democracy Act dilutes the executive branch's constitutional role in conducting foreign policy by over-prescribing analytical frameworks and tools."}, {"id": "3701a0e0-fba7-49ed-8169-b4446fd00090", "title": "Reuters World News Summary", "date": "2024-05-17 02:15", "url": "https://www.devdiscourse.com/article/law-order/2941417-reuters-world-news-summary", "message": "Following is a summary of current world news briefs.\nThe Israel Security Assistance Support Act was approved 224 to 187, largely along party lines.\nSixteen Democrats joined most Republicans in voting yes, and three Republicans joined most Democrats in opposing the measure.\nPolitical analysts and lawmakers say it has exposed an increasingly febrile and polarised political climate both in Slovakia and across Europe.\nGeneral Christopher Cavoli, NATO's supreme allied commander Europe, said he was confident Ukrainian forces would hold their lines in the region."}, {"id": "0d167d4b-7d80-4986-8251-4c202875e029", "title": "Slovak prime minister Robert Fico shot in assassination attempt", "date": "2024-05-17 02:15", "url": "https://www.wsws.org/en/articles/2024/05/16/zpjr-m16.html", "message": "Yesterday afternoon, populist Slovak Prime Minister Robert Fico was shot while visiting the town of Handlova after a meeting of his government.\nDeputy Prime Minister and Defence Minister of Slovakia Robert Kalinak, speaks during a media briefing outside the F. D. Roosevelt University Hospital, where Slovak Prime Minister Robert Fico, who was shot and injured, is treated in Banska Bystrica, central Slovakia, Thursday, May 16, 2024.\nHe had an erratic but essentially far-right political trajectory, having criticized violence before recently sympathizing with the liberal, pro-NATO opposition party Progressive Slovakia (PS).\nSlovakia is “on the edge of civil war,” Slovak Interior Minister Matus Sutaj-Estok said last night, at a joint press conference on the shooting with Defense Minister Robert Kalinak.\nPelligrini won the presidential elections as a Fico ally, pledging not to let Slovakia be dragged into the Ukraine war."}, {"id": "a3a4dd1f-af4d-4b6d-b1c4-0506ae40d6f2", "title": "Treasury Department Ramp Up Fight Against Illicit Finance", "date": "2024-05-17 03:45", "url": "https://www.pymnts.com/aml/2024/treasury-department-to-use-automation-and-innovation-to-fight-illicit-finance/", "message": "The Department of the Treasury has outlined the priorities it will pursue this year to step up the fight against illicit finance.\nA second priority is promoting a more effective and risk-focused AML/CFT regulatory and supervisory framework for financial institutions, the release said.\nThe Department will work to do so by providing clear compliance guidance, sharing information and providing resources for supervision and enforcement.\nThe Department also aims to enhance the operational effectiveness of law enforcement, other U.S. government agencies and international partnerships to combat illicit finance, per the release.\nThe fourth priority announced in the press release is realizing “the benefits of responsible technological innovation” by developing new payments technology, supporting the use of new mechanisms for compliance, and using automation and innovation to find new ways to fight illicit finance, the release said."}, {"id": "eebca960-ce98-4d7f-961b-2476e49524ca", "title": "The CIA and the strategy of tension in Europe", "date": "2024-05-17 03:30", "url": "https://www.pressenza.com/2024/05/the-cia-and-the-strategy-of-tension-in-europe/", "message": "This network was remotely controlled by the CIA and despite the disappearance of the danger of Soviet invasion, continued to act in Western countries to prevent communist parties from coming to power through democratic elections and were dedicated to sowing chaos through the doctrine known as “strategy of tension”.\nOperation Gladio affected virtually all of Europe, with particular virulence in Italy where it was investigated by Judge Guido Salvini, who concluded that far-right terrorist organizations such as Ordine Nuovo or the National Vanguard “were closely linked with the Italian state and the US CIA” and that” the CIA pointed out the objectives and encouraged them to act”.\nIs Operation Gladio 2.0 underway?\nTrump’s possible victory in November 2024 would represent the decline of the Atlantist strategy of Biden and Soros committed to defend Putin from power after the signing of a peace agreement in Ukraine and the return to the Doctrine of Peaceful Coexistence with Russia.\nAre new attacks being prepared?"}, {"id": "9c7b6095-9028-48d7-9994-0945dfa67330", "title": "Rosa María Payá Condemns Biden Administration for Removing Cuba from Terrorism List :  Whitewashing the Regime  ", "date": "2024-05-17 03:15", "url": "https://www.cubaheadlines.com/articles/282077", "message": "Rosa María Payá, a prominent Cuban democracy activist, has sharply criticized the Joe Biden administration for its decision to remove Cuba from the list of countries that do not fully cooperate with U.S. counterterrorism efforts.\nThis action has been interpreted as the first step by Washington to potentially remove the Caribbean nation from the list of State Sponsors of Terrorism.\nHowever, the State Department clarified that the designation on the State Sponsors of Terrorism list, which includes Iran, Syria, North Korea, and Cuba, is managed independently.\nThe Cuban Ministry of Foreign Affairs recently requested that the U.S. government definitively exclude the country from the State Sponsors of Terrorism list, calling its inclusion arbitrary and unfounded.\nThe Cuban regime's statement was published on Wednesday following the Biden administration’s decision to remove Cuba from the list of countries not fully cooperating with counterterrorism efforts."}, {"id": "b6ea142f-eb82-44ac-84a2-9db73e578e5d", "title": "UN body says aid delivery to Gaza  almost impossible  amid intensified fighting", "date": "2024-05-17 03:00", "url": "https://www.siasat.com/un-body-says-aid-delivery-to-gaza-almost-impossible-amid-intensified-fighting-3027632/", "message": "Gaza: The United Nations (UN) Office for the Coordination of Humanitarian Affairs (OCHA) has said that distributing humanitarian aid “is almost impossible” in Gaza, due to the irregular fuel supply and interrupted communications amid the ongoing intense war between Israel and Hamas.\n#Gaza:⚠️ Access to critical health services continues to shrink and displacement is on the rise as new evacuation orders are issued and military operations intensify.\nOCHA and other humanitarian organizations warned of the devastating impact of the crossings’ closure on over 2 million Palestinians in war-stricken Gaza, Xinhua news agency reported.\nOn Thursday, the Jordan Armed Forces said it conducted three airdrops of humanitarian aid over various locations in southern Gaza.\nThis is the first eyewitness report of an aid drop operation in Rafah since the Israeli army’s renewed attacks on the southernmost Gazan city last week."}, {"id": "7586182b-0a0f-4871-8c8d-5d8573b11317", "title": "LANPAC 2024 Speech > U . S . Pacific Fleet > Speeches U . S . Pacific Fleet", "date": "2024-05-17 01:30", "url": "https://www.cpf.navy.mil/Newsroom/Speeches/Article/3778496/lanpac-2024-speech/", "message": "Here's how you knowAn official website of the United States government"}, {"id": "ee364f15-2fe5-4610-b9c8-652a4e172696", "title": "Biden Removes Hamas Ally Cuba from Blacklist of Countries That Dont Cooperate to Fight Terrorism", "date": "2024-05-17 03:00", "url": "https://www.breitbart.com/politics/2024/05/16/biden-removes-hamas-ally-cuba-from-blacklist-countries-that-dont-cooperate-fight-terrorism/", "message": "U.S. Secretary of State Antony Blinken on Wednesday removed Cuba’s communist regime from the State Department’s list of countries “not cooperating fully” against terrorism.\nThe communist Castro regime also maintains a relationship with the Sunni jihadist terrorist group Hamas.\nSimilar to other far-left Latin American regimes and governments, the Castro regime has accused Israel of commiting “genocide” in its self-defense operations against Hamas, but not condemned the explicitly genocidal Hamas goal of destroying the Israeli nation and its people.\n¡Basta de brutalidad, basta de abuso, basta de impunidad!#FreePalestine#ShutItDown4Palestine pic.twitter.com/UEiVhoxUah — Miguel Díaz-Canel Bermúdez (@DiazCanelB) March 1, 2024The Castro regime has held several pro-Hamas events in the past few months.\nAgradecemos esfuerzos de congresistas de EEUU que han instado al presidente Biden retirar a #Cuba de lista de Estados patrocinadores del terrorismo."}, {"id": "800e1889-9c09-440e-acf0-64602a867a7e", "title": "EU conference vows to combat rising antisemitism - The Jerusalem Post", "date": "2024-05-17 04:15", "url": "https://www.jpost.com/diaspora/antisemitism/article-801522", "message": "(credit: Vatican Media/­Handout via REUTERS)After launching the conference on May 6, Bergé repeated her government's commitments to fight \"the scourge of antisemitism everywhere.\"\nI think Britain is trying to fight antisemitism very hard and we are implementing programs from other countries.\n\"Organizations are working together to create an effective reporting system that others can learn from that will create a more effective way to fight antisemitism.\nAs a former EU security chief, I can say that I think antisemitism is a threat to European security.\"\nI think we should also look into combating and providing intelligence on hate crimes such as antisemitism so that countries can fight the phenomenon."}, {"id": "3e1ac589-225e-4aab-856d-3518bb6283f4", "title": "  Heightened threat  of terrorism during Pride Month 2024 , FBI and DHS warn", "date": "2024-05-17 00:00", "url": "https://wfin.com/fox-national-news/heightened-threat-of-terrorism-during-pride-month-2024-fbi-and-dhs-warn/", "message": "​Join Fox News for access to this content You have reached your maximum number of articles.\nFederal intelligence agencies are warning that this year’s Pride Month may be targets for terrorist organizations.\nIt also noted that June 2024 will be the eighth anniversary of the Pulse Nightclub shooting in Orlando, Florida.\nIt was celebrated by Islamic terrorist organizations around the world.\nPride month begins on June 1 and runs until the end of the month."}, {"id": "ff23ae92-9e7a-437f-8f63-d4c90ec1573a", "title": "Piers Morgan grills anti - Israel activists on Eurovision boycott ethics", "date": "2024-05-17 04:15", "url": "https://www.jpost.com/bds-threat/article-801529", "message": "During the debate, Morgan asked the participants to justify why Israel should be banned from Eurovision.\nTurning to Mazzig, Morgan asked the same question.\n\"Both are absolutely terrible,\" Walker quickly answered.\nMorgan asked whether Walker was outraged about October 7 and what did he tweet about it?\nMorgan asked."}, {"id": "b204eb3c-4faf-484d-8a00-abac0acc1586", "title": "Israeli aggression has killed 70 percent of Zionist captives : Hamas", "date": "2024-05-17 03:15", "url": "https://www.presstv.ir/Detail/2024/05/17/725717/Palestine-Israel-Hamas-Israeli-captives-war-Gaza", "message": "Hamas says the Israeli regime’s bombing of the Gaza Strip, which is enduring a genocidal Israeli war, has killed 70 percent of the Zionist captives, who have been held by the Palestinian resistance movement since an October operation.\n“The Zionist enemy wants to recover the remaining captives by force, killing them by bombing,” he said.\nAt least 35,272 Palestinians have died in an Israeli war of genocide that began following the operation.\nHamas recently agreed to another truce proposal enabling cessation of the Israeli aggression and release of the rest of the captives.\n‘Victory is our ally’The Hamas’ official pointed to the Israeli regime’s failure to realize its war goals, including defeating the resistance."}]