[{"id": "930be798-e2a7-4543-8819-f51d2a771918", "title": "Atlantic hurricane season to bring 6 to 10 named storms during  supercharged September  ", "date": "2024-08-23 03:00", "url": "https://www.silive.com/weather/2024/08/atlantic-hurricane-season-to-bring-6-to-10-named-storms-during-supercharged-september.html", "domain": "silive.com", "domain_classification": "Unknown", "message": "STATEN ISLAND, N.Y. — With August drawing to a close, so too does the brief reprieve from tropical storms this Atlantic hurricane season.\nAn AccuWeather graphic shows the Atlantic hurricane season forecast as of Wednesday, Aug. 14, 2024.\n“We often see one tropical wave move off the coast of Africa every few days during the peak of the Atlantic hurricane season,” said DaSilva.\nThe potential of breaking recordsSince March, AccuWeather has been warning of an “explosive” Atlantic hurricane season.\nThese anticipated figures fall just short of the record-breaking season of 2020, which produced 30 named storms."}, {"id": "3236960c-1662-4bd7-9790-77b5dbf55427", "title": "What is a tsunami ? Can they happen along the East & Gulf Coasts ? ", "date": "2024-08-23 01:15", "url": "https://www.wuft.org/weather/2024-08-22/what-is-a-tsunami-can-they-happen-along-the-east-gulf-coasts", "domain": "wuft.org", "domain_classification": "Unknown", "message": "The tsunami energy was propagated by a submarine landslide and although the maximum tsunami was recorded near the earthquake epicenter in Newfoundland, there were some tsunami waves recorded as far south as in South Carolina.\nEast and Gulf Coast tsunamis are low frequency.\nThere is a subduction zone in the Caribbean Sea and the tsunamis recorded in areas along the Gulf Coast states have been less than one meter or 3.28 feet.\nMeteotsunamis are progressive waves limited to the tsunami frequency band of wave periods (between two minutes and two hours).\nStorm surge is the abnormal rise in sea level caused by a storm, often a tropical system, apart from the predicted astronomical tide."}, {"id": "b0f5a607-a922-4e29-a7e1-9c56c38a546e", "title": "What is a tsunami ? Can they happen along the East Coast ? ", "date": "2024-08-23 01:30", "url": "https://www.southcarolinapublicradio.org/sc-news/2024-08-22/what-is-a-tsunami-can-they-happen-along-the-east-coast", "domain": "southcarolinapublicradio.org", "domain_classification": "Unknown", "message": "For us on the East Coast, a tsunami will be more likely caused by a submarine landslide like the one that occurred in 1929 after a Magnitude 7.2 quake stroke near Newfoundland, Canada.\nThe tsunami energy was propagated by a submarine landslide and although the maximum tsunami was recorded near the earthquake epicenter in Newfoundland, there were some tsunami waves recorded as far south as in South Carolina.\nEast and Gulf Coast tsunamis are low frequency.\nThey don’t just occur along the coast, but they can happen in lakes, bays, or inlets.\nMeteotsunamis are progressive waves limited to the tsunami frequency band of wave periods (between two minutes and two hours)."}, {"id": "71518c5f-614a-418f-80d1-09dbfdd7db22", "title": "Denman earthquake , NSW : Earthquake rocks NSW town", "date": "2024-08-23 02:45", "url": "https://www.dailymail.co.uk/news/article-13771333/Denman-earthquake-nsw.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A magnitude 5.0 earthquake hit a town in rural NSW so hard a local mayor 'thought the roof was about to cave in', as Australians living hours away in Sydney reported feeling tremors.\nThe earthquake was reported to have occurred at a depth of 10km and 14km to the east of Denman, according to the GA website.\nRegional NSW residents closer to the epicentre, in Mudgee and Gulgong - two hours drives west of Denman - reported walls and floors shaking.\nOthers further west at Dunedoo and someone at Anna Bay, north of Newcastle on the coast also reported feeling tremors.\nLavis Mitre 10 in Muswellbrook posted a photo of items strewn through its aisles after the quake."}, {"id": "ebe6d733-d500-4ec2-b004-ca9bb3e95e22", "title": "Manatee County residents claiming stormwater bacteria is killing their animals", "date": "2024-08-23 00:30", "url": "https://www.mysuncoast.com/2024/08/22/manatee-county-residents-claiming-stormwater-bacteria-is-killing-their-animals/", "domain": "mysuncoast.com", "domain_classification": "Unknown", "message": "MANATEE COUNTY, Fla. (WWSB) - Following Hurricane Debby, high storm water levels have forced the relocation of horses, cattle, pets, and more.\nSeveral Manatee County residents have said their cows have died, pets have become sick, and other livestock have either fallen ill or died as well.\n“I feel terrible,” said Wes Matejka, a Myakka man who saw no flooding at all.\n“We got extremely lucky, we happened to purchase the highest elevation property in the county,” he added.\nCarol Felts, a longtime livestock owner in Manatee County and recent winner of a Manatee County election, said the infection of cuts as well as ingestion of chemicals can be horribly detrimental to these animals."}, {"id": "6b286a21-4bc6-48a4-a7c1-db4871b11fc9", "title": "Residents asked to suspend irrigation as storms continue to pummel Utah", "date": "2024-08-23 00:45", "url": "https://www.ksl.com:443/article/51107430/residents-asked-to-suspend-irrigation-as-storms-continue-to-pummel-utah", "domain": "ksl.com", "domain_classification": "Unknown", "message": "Estimated read time: 2-3 minutesST. GEORGE — Washington County Water Conservancy District officials are asking property owners in southwest Utah to suspend all landscape irrigation for at least 48 hours to conserve water after the region was pummeled with more storms Thursday morning.\nAnother round of deep monsoon moisture entered Utah Thursday, generating some morning storms that dumped heavy rainfall throughout southwest Utah.\nWashington County Water Conservancy District officials aren't alone in calling on residents to reduce or stop irrigation because of this week's storm activity.\nThe heaviest totals are forecast for southwest Utah, where flash flooding is probable in slot canyons.\nAbout 37% of Washington County remains in moderate drought, as do parts of Garfield, Iron and Kane counties in southwest Utah."}, {"id": "51078b8a-4b2c-4762-ac31-8cadf4909b34", "title": "Tropical Storm Hone forms in Pacific , could impact Hawaii this weekend", "date": "2024-08-23 01:30", "url": "https://www.cbsnews.com/news/tropical-storm-hone-pacific-ocean-hawaii/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "Tropical Storm Hone formed in the central Pacific Ocean on Thursday on a forecast path that may cross near Hawaii's Big Island, while major Hurricane Gilma remained a Category 3 storm at sea.\nThe projected path of Tropical Storm Hone.\nThe central Pacific hurricane season runs from June 1 to Nov. 30.\nA tropical cyclone includes tropical depressions, tropical storms and hurricanes.\nThe system strengthened to tropical storm status on Sunday and has grown more powerful since then."}, {"id": "aa9602b1-ecdc-4304-9b89-73711521bf12", "title": "  Whole house rattled : earthquake felt by thousands", "date": "2024-08-23 03:45", "url": "https://www.canberratimes.com.au/story/8740260/whole-house-rattled-earthquake-felt-by-thousands/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited news content and The Canberra Times app.\nPremium subscribers also enjoy interactive puzzles and access to the digital version of our print edition - Today's Paper."}, {"id": "148b30df-c4b2-404d-81ca-9d63367bddb2", "title": "Tropical Storm Hone forms in the central Pacific Ocean , Gilma still a Category 3 hurricane", "date": "2024-08-23 01:30", "url": "https://isp.netscape.com/news/story/0001/20240822/6b4707ad7414e75ed430bef6ec46b156", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Tropical Storm Hone forms in the central Pacific Ocean, Gilma still a Category 3 hurricaneHONOLULU (AP) — Tropical Storm Hone formed in the central Pacific Ocean on Thursday on a forecast path that may cross near Hawaii's Big Island, while major Hurricane Gilma remained a Category 3 storm at sea.\nHone had maximum sustained winds of 40 mph (65 kph) and was centered about 1,090 miles (1,760 kilometers) east-southeast of Honolulu, the Central Pacific Hurricane Center said in an 11 a.m. advisory.\nMeanwhile, Hurricane Gilma remained a major hurricane with maximum sustained winds at 125 mph (205 kph).\nGilma was trailing behind Hone, located about 1,980 miles (3,185 kilometers) east of Hilo and moving west-northwest at 7 mph (11 kph).\nThe system strengthened to tropical storm status on Sunday and has grown more powerful since then."}, {"id": "ecb6d91a-fb0e-4e00-a200-fdb6a87cf547", "title": "Mississippi sees increase of wildfires due to dry conditions", "date": "2024-08-23 02:30", "url": "https://www.yahoo.com/news/mississippi-sees-increase-wildfires-due-235616803.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(WJTV) – Officials with the Mississippi Forestry Commission (MFC) said parts of Mississippi are experiencing an abnormally dry period.\nState Forester Russell Bozeman said this is the time of year the state begins to see a fall drought pattern.\nSo, we’ve seen a lot of forest health issues since the drought last year.\nSo all this year, we’ve dealt with with beetle problems, caterpillar problems, fungus problems, all kinds of forest health issues that we’ve been seeing out in the forest.\nSo if we end up into an extended drought period, then we could continue to see tree and tree health issues,” he explained."}, {"id": "4b858281-4631-4aa3-bbd5-4389384a6d50", "title": "  Whole house rattled : earthquake felt by thousands", "date": "2024-08-23 04:15", "url": "https://www.bendigoadvertiser.com.au/story/8740260/whole-house-rattled-earthquake-felt-by-thousands/", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited content and the digital versions of our print editions - Today's Paper."}, {"id": "90d7d6ad-f705-45f6-bb7e-72294eadb190", "title": "Triple hurricane threat meandering toward Hawaii", "date": "2024-08-23 02:30", "url": "https://www.yahoo.com/news/triple-hurricane-threat-meandering-toward-000739662.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "One of the main features that can impact tropical storm strength is the abundance of warm sea surface temperatures in the Gulf of Mexico.\n*Hurricane Gilma IR satellite imagery*Currently there are three tropical systems lined up in the Pacific Ocean slowly moving towards our 50th state.\nAs of Thursday, Aug. 22, the National Hurricane Center (NHC) has upgraded the furthest-west system to Tropical Storm Hone.\nTropical systems, storms, and hurricanes are no stranger to the Pacific Ocean but they don’t often directly impact Hawaii.\nHurricane Gilma, about a week away from any Hawaiian impacts, continues to spin and strengthen in the Pacific Ocean."}, {"id": "92aacca2-7b08-45fe-a4e2-8f8cc3192e10", "title": "Light earthquake , 4 . 4 mag was detected near Sola in Vanuatu", "date": "2024-08-23 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/23/light-earthquake-4-4-mag-was-detected-near-sola-in-vanuatu-15/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.4 (ml/mb) was reported 113 km NW of Sola, Vanuatu (70 miles) on Saturday.\nExact location of earthquake, longitude 166.8249 East, latitude -13.1346 South, depth = 188.424 km.\nEvent ids that are associated to the earthquake: us7000n8nd.\nId of event: us7000n8nd.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 113 km NW of Sola, Vanuatu."}, {"id": "31e4a9ed-25b6-4896-8588-6a0a9199b372", "title": "Light earthquake , 4 . 4 mag has occurred near Yamada in Japan", "date": "2024-08-23 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/22/light-earthquake-4-4-mag-has-occurred-near-yamada-in-japan-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 142 km E of Yamada, Japan (88 miles) on Friday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us7000n8l7.\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 142 km E of Yamada, Japan."}, {"id": "d7626e2f-7e7c-48c8-9c77-295ebddad999", "title": "Officials raise serious concerns with new report on this year devastating wildfire season in Oregon :  It really important  ", "date": "2024-08-23 02:45", "url": "https://www.yahoo.com/news/officials-raise-serious-concerns-report-003000877.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Officials raise serious concerns with new report on this year's devastating wildfire season in Oregon: 'It's really important'The 2024 wildfire season has already been the most destructive one on record for the state of Oregon, OregonLive reported.\nSeventy-one large fires have burned more than 1.4 million acres since the 2024 wildfire season began (which, according to the Western Fire Chiefs Association, happens in mid-May).\nHistorically, the state has seen the most wildfires in September, which means that the final numbers could eclipse previous state records.\nOregon state officials stressed that people should be extra careful about fire safety this time of year and avoid accidentally starting fires.\nAlthough the conditions that have led the fires to spread are due to climate change, more than 70% of fires are started by people, according to the Oregon Wildfire Response & Recovery website."}, {"id": "5a5f9adb-2aed-4ed2-9ba1-764b73de2398", "title": "Light earthquake : M4 . 4 quake has struck near Boston in Philippines", "date": "2024-08-23 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/23/light-earthquake-m4-4-quake-has-struck-near-boston-in-philippines/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has struck on Saturday, 6 kilometers (4 miles) from Boston in Philippines.\nDate and time of earthquake in UTC/GMT: 03/08/24 / 2024-08-03 02:19:18 / August 3, 2024 @ 2:19 am.\nThe earthquake was roughly at a depth of 88.165 km (55 miles).\nNearby country/countries, Philippines (c. 99 900 000 pop) (That might be effected).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 6 km NE of Boston, Philippines."}, {"id": "f69f11c8-83ca-48c6-a952-423ea4c1b95e", "title": "Reports Highlight Compounding Impacts , Costs of Extreme Weather Events", "date": "2024-08-23 01:15", "url": "https://www.enr.com/articles/59168-reports-highlight-compounding-impacts-costs-of-extreme-weather-events", "domain": "enr.com", "domain_classification": "Unknown", "message": "Earlier this month, the National Oceanic and Atmospheric Administration predicted that the 2024 Atlantic hurricane season could rank “among the busiest on record,” as climate change continues to cause more extreme weather events.\nWith the number of extreme weather events caused by warming ocean temperatures and other manifestations of climate change continuing to increase, so are costs—in some cases exponentially.\nMost existing building codes currently are focused on preventing loss of life, not functionality, says Maria Lehman, past president of ASCE and vice chair of the National Infrastructure Advisory Council.\nAs of August 8, 19 climate- or weather-related disasters with damages exceeding $1 billion have occurred in the U.S. this year.\nEfforts are underway to quantify true costs in a more holistic way, at NIST, the World Bank and elsewhere."}, {"id": "b7e7e915-1020-4379-b4d0-726c9d5b01bb", "title": "  Whole house rattled : earthquake felt by thousands", "date": "2024-08-23 04:30", "url": "https://www.hawkesburygazette.com.au/story/8740260/whole-house-rattled-earthquake-felt-by-thousands/?cs=30776", "domain": "hawkesburygazette.com.au", "domain_classification": "Unknown", "message": "More than 2000 people had reported feeling tremors in the following hour, including many residents more than 200km away in Sydney."}, {"id": "efe9e93d-20e0-4c56-a06b-e22a8ddbf831", "title": "  Whole house rattled : earthquake felt by thousands", "date": "2024-08-23 04:15", "url": "https://www.yasstribune.com.au/story/8740260/whole-house-rattled-earthquake-felt-by-thousands/?cs=14264", "domain": "yasstribune.com.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited content and the digital versions of our print editions - Today's Paper."}, {"id": "de6271d2-5ebc-490b-8def-9dd776e26332", "title": "Flooding brings boom in mosquitoes for Bamberg County", "date": "2024-08-23 01:30", "url": "https://www.wrdw.com/2024/08/22/flooding-brings-boom-mosquitoes-bamberg-county/", "domain": "wrdw.com", "domain_classification": "Unknown", "message": "BAMBERG, S.C. (WRDW/WAGT) - Bamberg County officials say there has been an increase in mosquitoes because of flooding from Tropical Storm Debby.\nThen Debby dumped more rain than many people can remember, bringing standing water in places like Screven and Bamberg counties.\n“Using dirt or cement to fill in low places such as tire ruts or puddles is important to prevent those areas from accumulating storm water.\nThere are at least 61 different species of mosquitoes in South Carolina, but fortunately not all of them bite people, Evans said.\nOnce this water finally recedes, it’s advised to tip and toss any remaining standing water in buckets or any outdoor containers."}, {"id": "72a111dc-72a1-4535-b6a9-15fa608d6c71", "title": "Tropical Storm Hone forms in the central Pacific Ocean , Gilma still a Category 3 hurricane", "date": "2024-08-23 00:00", "url": "https://lethbridgeherald.com/news/world-news/2024/08/22/tropical-storm-hone-forms-in-the-central-pacific-ocean-gilma-still-a-category-3-hurricane/", "domain": "lethbridgeherald.com", "domain_classification": "Unknown", "message": "Tropical Storm Hone forms in the central Pacific Ocean, Gilma still a Category 3 hurricaneBy The Associated Press on August 22, 2024.\nThis satellite image provided by NOAA shows Hurricane Gilma located west-southwest of the southern tip of the Baja California peninsula of Mexico, Wednesday, Aug. 21, 2024.\n(NOAA via AP) This satellite image provided by NOAA shows Hurricane Gilma located west-southwest of the southern tip of the Baja California peninsula of Mexico, Wednesday, Aug. 21, 2024.\n(NOAA via AP)MEXICO CITY (AP) – Tropical Storm Hone has formed in the central Pacific Ocean, forecasters said, on a path that may cross near Hawaii’s Big Island.\nMeanwhile, Hurricane Gilma remained a major hurricane with maximum sustained winds at 125 mph (205 kph)."}, {"id": "e8496749-f653-41eb-bfec-6afe636bc108", "title": "Tropical Storm Hone forms in the central Pacific Ocean , Gilma still a Category 3 hurricane", "date": "2024-08-23 01:15", "url": "https://www.hawaiipublicradio.org/local-news/2024-08-22/tropical-storm-hone-central-pacific-ocean-gilma-hurricane", "domain": "hawaiipublicradio.org", "domain_classification": "Unknown", "message": "Tropical Storm Hone formed in the central Pacific Ocean on Thursday on a forecast path that may cross near Hawaiʻi Island, while major Hurricane Gilma remained a Category 3 storm at sea.\nHone had maximum sustained winds of 40 mph and was centered about 1,090 miles east-southeast of Honolulu, the Central Pacific Hurricane Center said in an 11 a.m. advisory.\nMeanwhile, Hurricane Gilma remained a major hurricane with maximum sustained winds at 125 mph.\nGilma was trailing behind Hone, located about 1,980 miles east of Hilo and moving west-northwest at 7 mph.\nHurricane-force winds extended outward up to 35 miles from the center of Gilma and tropical-storm-force winds extended outward up to 115 miles, the National Hurricane Center in Miami said."}, {"id": "87f45e42-c532-4972-9b0a-5757c10f25be", "title": "  Whole house rattled : earthquake felt by thousands", "date": "2024-08-23 04:15", "url": "https://www.newcastleherald.com.au/story/8740260/whole-house-rattled-earthquake-felt-by-thousands/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited content and the digital versions of our print editions - Today's Paper."}, {"id": "b75405f9-a6f0-478a-891f-0ab81581ec51", "title": "Tropical Storm Hone forms in the central Pacific Ocean , Gilma still a Category 3 hurricane", "date": "2024-08-23 01:00", "url": "https://krcgtv.com/news/nation-world/tropical-storm-hone-forms-in-the-central-pacific-ocean-gilma-still-a-category-3-hurricane", "domain": "krcgtv.com", "domain_classification": "Unknown", "message": "Tropical Storm Hone formed in the central Pacific Ocean on Thursday on a forecast path that may cross near Hawaii's Big Island, while major Hurricane Gilma remained a Category 3 storm at sea.\nHone had maximum sustained winds of 40 mph (65 kph) and was centered about 1,090 miles (1,760 kilometers) east-southeast of Honolulu, the Central Pacific Hurricane Center said in an 11 a.m. advisory.\nMeanwhile, Hurricane Gilma remained a major hurricane with maximum sustained winds at 125 mph (205 kph).\nGilma was trailing behind Hone, located about 1,980 miles (3,185 kilometers) east of Hilo and moving west-northwest at 7 mph (11 kph).\nHurricane-force winds extended outward up to 35 miles (56 kilometers) from the center of Gilma and tropical-storm-force winds extended outward up to 115 miles (185 kilometers), the National Hurricane Center in Miami said."}, {"id": "494582cd-b7e4-4d7e-80dd-929a0bf714c8", "title": "County officials identify what behind chronic flooding in Security - Widefield", "date": "2024-08-23 00:15", "url": "https://krdo.com/news/2024/08/22/county-officials-identify-whats-behind-chronic-flooding-in-security-widefield/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "EL PASO COUNTY, Colo. (KRDO) - After years of flooding in Security-Widefield, El Paso County Officials say they're working on a study to determine the root of the issue in infrastructure to prevent further flooding.\nJack Ladley, the Director of Public Works for El Paso County, says that the issue stems from 50 to 100-year-old infrastructure in the southeast part of El Paso County.\nHowever, completing the study isn't the only problem facing county officials.\n\"Once we have an idea of how we want to address this, then of course it becomes a funding issue,\" Ladley said.\n\"When you identify a problem or you see a problem, call us, and let us know [at] 719-520-6460."}, {"id": "5a688782-24c4-45bf-a5b0-ee3bff5732ba", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | Bendigo Advertiser", "date": "2024-08-23 04:15", "url": "https://www.bendigoadvertiser.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "AS IT HAPPENSBreaking news alertBe the first to know when news breaks."}, {"id": "87abe1f0-d4af-4d36-bf82-e5ac1644ff37", "title": "Magnitude 5 earthquake rocks regional NSW felt across Hunter | The Advocate", "date": "2024-08-23 04:15", "url": "https://www.theadvocate.com.au/story/8740174/magnitude-5-earthquake-rocks-regional-nsw-felt-across-hunter/?cs=9676", "domain": "theadvocate.com.au", "domain_classification": "Unknown", "message": "AS IT HAPPENSBreaking news alertBe the first to know when news breaks."}, {"id": "46ec30e4-9500-43a9-bbe1-d8c9112cbc9b", "title": "Long Island business owners ask for federal relief after devastating flooding", "date": "2024-08-23 00:30", "url": "https://www.fox5ny.com/news/long-island-business-owners-ask-federal-relief-after-devastating-flooding", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "Business owners on Long Island are still reeling from the aftermath of the historic flooding that ravaged their community on Sunday.\nThe flooding has left many business owners facing a financial nightmare, with damages running into the hundreds of thousands of dollars.\n\"We need state funding, we need federal funding, like, we don't need help for the future.\nHowever, Suffolk County is yet to hear back from state and federal officials, something residents say is frustrating.\nFOX 5 NY reached out to Senator Chuck Schumer to find out if the federal government will step in to help the affected business owners and residents."}, {"id": "751329c8-d458-4095-bd51-bbfb649da877", "title": "Former Mississippi Gov . Haley Barbour reflects on Coast resiliency after Hurricane Katrina", "date": "2024-08-23 01:45", "url": "https://www.wlox.com/2024/08/22/former-mississippi-gov-haley-barbour-reflects-coast-resiliency-after-hurricane-katrina/", "domain": "wlox.com", "domain_classification": "Unknown", "message": "GULFPORT, Miss.\n(WLOX) - Haley Barbour says while he and other state leaders were boots on the ground in the days, weeks, and months after Hurricane Katrina, he also credits South Mississippi residents for “hitching up their britches” and getting to work in the storm’s aftermath.\nIt’s a standing room only crowd listening to former Ms.\nGovernor Haley Barbour at the GCBC meeting in Gulfport.\npic.twitter.com/d4RDQYGpWs — Bill Snyder (@BillSnyderWLOX) August 22, 2024The former Mississippi Governor spoke about Katrina’s looming 19th anniversary to members of the Gulf Coast Business Council Thursday."}, {"id": "7ad5d500-49b1-4630-be0b-5fd338c56381", "title": "Lake Manatee dam cannot hold anymore water as rain causes flooding to continue", "date": "2024-08-23 00:00", "url": "https://www.abcactionnews.com/news/region-sarasota-manatee/lake-manatee-dam-cannot-hold-anymore-water-as-rain-causes-flooding-to-continue", "domain": "abcactionnews.com", "domain_classification": "Unknown", "message": "MANATEE COUNTY, Fla. — Manatee County has continuously seen heavy bands of rain since Tuesday.\nOn Wednesday evening, residents downstream from Lake Manatee Dam heard the sirens and flooding quickly followed.\nManatee County officials responded with their own Facebook post letting residents know they were trying to manage water levels at the dam and were aware of the flooding.\n“The dam and Lake Manatee continue to function as designed.\nIt is just a situation where we have no ability to store any additional water in Lake Manatee.”"}, {"id": "069abb25-3a0f-4e16-9e62-a58513e2f5b0", "title": "Monsoon moisture surges northward at end of workweek", "date": "2024-08-23 02:30", "url": "https://www.yahoo.com/news/monsoon-moisture-surges-northward-end-233648694.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Flash flooding and the risk for a few strong to severe storms for portions of Utah as we head into the weekend.\nAs we round out the work week we’ll see another surge of monsoonal moisture stream into the state.\nWe’ve already seen heavy rain and thunderstorms this morning in portions of southern Utah, leading to a Flash Flood Warning in Washington County.\nThe main focus for storm development will remain in central and southern Utah, but isolated storms will be possible for the Wasatch Front and Cache Valley later Thursday evening.\nThe cold front will likely stall over the state, bringing cooler temperatures and strong winds on Saturday, though not as intense as on Friday."}, {"id": "6b08cdfe-5b37-4520-8f0d-209e062b89c5", "title": "Kyodo News Digest : Aug . 23 , 2024", "date": "2024-08-23 01:30", "url": "https://english.kyodonews.net:443/news/2024/08/b00e02bbaf99-kyodo-news-digest-aug-23-2024--1-.html", "domain": "english.kyodonews.net", "domain_classification": "Unknown", "message": "KYODO NEWS - 4 hours ago - 09:12 | All, World, JapanThe following is the latest list of selected news summaries by Kyodo News.\nThe increase in the nationwide core consumer price index, excluding volatile fresh food, followed a 2.6 percent rise in June.\nThe inflation rate has remained at or above the Bank of Japan's 2 percent target since April 2022.\nThe Cavour arrived at a Japanese Maritime Self-Defense Force base in Yokosuka, south of Tokyo, on Thursday.\nVideo: TEPCO halts attempt to extract melted fuel at Fukushima nuclear plant"}, {"id": "f9809310-ea00-4b6e-8c71-06d1880fd839", "title": "Manatee County addresses dam speculation", "date": "2024-08-23 00:30", "url": "https://www.mysuncoast.com/2024/08/22/manatee-county-addresses-dam-speculation/", "domain": "mysuncoast.com", "domain_classification": "Unknown", "message": "MANATEE COUNTY, Fla. (WWSB) - Sirens were blaring in Manatee County after another night of road closures and flooded yards around the Manatee Dam.\nBut Deputy County Administrator Evan Pilachowski tried to quiet any speculation surrounding the dam’s role in the flooding, denying they did an intentional release.\n“I do want to state unequivocally, that the dam in Mantee County continued to function as designed.\nThere is no risk of any sort of breach of the dam.\nNow the water that would typically be caught in the ponds flows into the dam and goes right through to the surrounding area because of the high water level of Lake Manatee."}, {"id": "67c5e104-f5ca-46a5-b238-bf4178393add", "title": "Meteorologists Watching Tropical Moisture Pool in Gulf", "date": "2024-08-23 01:15", "url": "https://999ktdy.com/louisiana-tropical-moisture-gulf-of-mexico/", "domain": "999ktdy.com", "domain_classification": "Unknown", "message": "As we approach the peak of the 2024 Hurricane Season, meteorologists are on high alert and monitoring any potential disturbances in the Gulf or Atlantic.\nThis can allow for spontaneous development, and that is why some will be watching a \"Tropical Moisture Pool\" in the Gulf of Mexico.\nAnd remember, to always have a plan for this hurricane season.\nDownload the station's app in your app store and be sure to turn on notifications.\nFor those counting, hurricane season officially ends on November 30th."}]