[{"id": "27993bd0-abd2-4065-80d3-7e48f0ed95f9", "title": "Gaza : 71 Palestinians killed , 197 injured by Israelis bombings last48hours - The Muslim News", "date": "2024-06-17 00:00", "url": "https://muslimnews.co.uk/news/palestine/gaza-71-palestinians-killed-197-injured-by-israelis-bombings-last48hours/", "domain": "muslimnews.co.uk", "domain_classification": "Unknown", "message": "By Abdul Adil(The Muslim News): 71 Palestinians were killed, 197 others injured by indiscriminate bombings by Israeli Defence Forces in Gaza Strip in the last 48 hours, reports the Health Ministry.\nThis has increased the number of Palestinians killed by Israeli forces to 37,337 and 85,299 injured since last October, according to the Ministry of Health in the besieged enclave.\nAdditionally, the warplanes targeted a house near the Emirates field hospital in central Rafah, according to eyewitnesses.\nThey said that Israeli warplanes targeted a house of al-Khatib family in the refugee camp, killing four people, including an infant, and injuring others.\nAnother airstrike targeted a house of an-Najjar family in the refugee camp, resulting in the killing of two people and injuring others."}, {"id": "1784eef8-5617-4b72-9bd5-5b6078aa4d0f", "title": "Top ISIS leader in Somalia was target of US airstrike", "date": "2024-06-17 00:00", "url": "http://www.k101fm.net/syndicated-article/?id=1569647", "domain": "k101fm.net", "domain_classification": "Unknown", "message": "(SOMALIA) — A United States military airstrike in Somalia targeted the top Islamic State leader in late May, but it remains unclear if the leader was killed in the airstrike, according to U.S. officials.\nAbdulqadir Mumin has been identified by the U.S. as the head of the Islamic State in Somalia, an African affiliate of the terror group once known as ISIS.\nA fourth U.S. official would only confirm that a senior Islamic State leader was the target of the strike but would not comment on the individual’s name.\nNBC News was first to report that Mumin was the target of the May 31 airstrike and that he had become the global leader of Islamic State.\nThe NCTC describes Mumin as the founder and leader of the Islamic State in Somalia that operates primarily in the semi-autonomous area of northeastern Somalia known as Puntland."}, {"id": "bb6fa83c-0745-4889-8aa7-30f0d0698412", "title": "Hezbollah and Hamas in Lebanon exchange fire with Israel", "date": "2024-06-17 00:00", "url": "http://www.myanmarmuslim.net/news/202406177e599938.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "The military wing of the Palestinian group Hamas said it had fired rockets from Lebanon into northern Israel on Monday, triggering Israeli airstrikes on the Lebanese side of the border.\nThe exchange lasted about half an hour and Israel’s Iron Dome could be clearly seen intercepting rockets from Lebanon.\nAbout three hours later, Israel’s air force carried out airstrikes on “Hezbollah targets” inside Lebanon, Israeli military spokesman Avichay Adraee posted on X, formerly known as Twitter, adding that details would follow later.\nBy Israeli military estimates, Hamas has already fired 7,000 rockets into Israel during the current war.\n(AP Photo/Ariel Schalit, File)The exchange of fire came as Lebanon’s militant group Hezbollah said its fighters attacked at least three Israeli military posts along the border around sunset on Monday."}, {"id": "109bdc9e-1233-4b41-93fb-f2f1461cc000", "title": "U . S . Navy Rescues Crew of Stricken Cargo Ship Attacked by Houthis", "date": "2024-06-17 09:15", "url": "https://theaviationist.com/2024/06/17/u-s-navy-rescues-crew-of-cargo-ship-attacked-by-houthis/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "Twenty four civilian crew members from a cargo vessel struck by a Houthi uncrewed surface vessel in the Red Sea have been rescued by the United States Navy.\nM/V Tutor, a 229-meter Liberian flagged bulk cargo vessel, came under attack by a Houthi uncrewed surface vessel (USV) while sailing in the southern Red Sea on June 12, 2024.\nFootage showing the Moments right before as well as right after the Liberian-Flagged, Greek-Owned Bulk Cargo Ship, M/V Tutor was Struck on June 10th by a Houthi One-Way Surface Attack Drone while Transiting the Southern Red Sea.\nUKMTO WARNING INCIDENT 083 ATTACK UPDATE 004 The crew of the vessel has been evacuated by military authorities.\nLightweight guided missiles tailored for use against small surface and air targets have been trialled and deployed by various nations."}, {"id": "07ceb1c2-2dec-4996-9adf-48aef972698c", "title": "Report : Attack that killed 8 IDF soldiers caused by anti - tank missile", "date": "2024-06-17 09:15", "url": "https://www.yahoo.com/news/report-attack-killed-8-idf-084229168.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israeli soldiers stand around the flag-draped casket of Israeli soldier Wassem Mahmoud, who was killed when an armoured personnel carrier exploded near the southern Gaza city of Rafah, during his funeral in Beit Jann.\nEight Israeli soldiers have been killed in fighting in Rafah in the southern Gaza Strip, the armed forces said on Saturday.\nIlia Yefimovich/dpaThe Israeli army assumes that an anti-tank missile was used in Saturday's attack on an Israeli armoured vehicle in Rafah in the southern Gaza Strip, which killed eight soldiers, according to Israeli media.\nIt was initially reported that it was unclear whether the explosion was caused by an anti-tank missile or a booby trap.\nDue to the many deaths and the catastrophic humanitarian situation, Israel's actions in the Gaza war are internationally controversial."}, {"id": "f6ebf4a6-7168-414e-8da4-fe669daa3ea0", "title": "Bangkok Post - Guatemala drama September features in CentralWorld Contemporary World Film Series", "date": "2024-06-17 03:45", "url": "https://www.bangkokpost.com/life/arts-and-entertainment/2812234/guatemala-drama-september-features-in-centralworld-contemporary-world-film-series", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "The popular Contemporary World Film Series returns with September (Septiembre, Un Llanto En Silencio) as the opening film of the year, at TK Park, 8th floor of CentralWorld, Ratchadamri Road, on June 29 at 4pm.\nThis is a drama from the lush and beautiful country of Guatemala and also the first film from the country to be screened in Thailand.\nIn the film, the baby daughter Theresa is brought up by her father and the two face many challenges.\nThe screening is supported by the Embassy of Guatemala and Guatemalan ambassador Shirley Dennise Aguilar Barrera will be there to introduce the film.\nThere is admission fee but entry to TK Park is 20 baht."}, {"id": "48cd341d-b2fc-4ac7-bbdf-182621578064", "title": "Bangkok Post - Guatemala drama September features in CentralWorld Contemporary World Film Series", "date": "2024-06-17 01:15", "url": "https://www.bangkokpost.com/life/social-and-lifestyle/2812234/guatemala-drama-september-features-in-centralworld-contemporary-world-film-series", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "The popular Contemporary World Film Series returns with September (Septiembre, Un Llanto En Silencio) as the opening film of the year, at TK Park, 8th floor of CentralWorld, Ratchadamri Road, on June 29 at 4pm.\nThis is a drama from the lush and beautiful country of Guatemala and also the first film from the country to be screened in Thailand.\nIn the film, the baby daughter Theresa is brought up by her father and the two face many challenges.\nThe screening is supported by the Embassy of Guatemala and Guatemalan ambassador Shirley Dennise Aguilar Barrera will be there to introduce the film.\nThere is admission fee but entry to TK Park is 20 baht."}, {"id": "e05300b6-9a04-444a-819e-0c1810b508e5", "title": "Iran fires air defence batteries at two sites after drones spotted", "date": "2024-06-17 14:00", "url": "http://www.myanmarmuslim.net/news/20240617244f599747.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Air defence batteries fired in several provinces over reports of drones being in the air, state television reported.\nOthers suggested the drones may be so-called quadcopters – small, four-rotor drones that are commercially available.\nIranian state television says nuclear facilities near Isfahan are “fully safe” after air defence batteries fired in the area.\nIranian state television began a scrolling, on-screen alert acknowledging a “loud noise” near Isfahan, without immediately elaborating.\nThe latest British measures target several Iranian military organizations, individuals and entities involved in Iran’s drone and ballistic missile industries."}, {"id": "83027952-c511-4d37-a63a-28e65e5349cb", "title": "US Navy rescues crew from ship struck by Houthis", "date": "2024-06-17 01:00", "url": "https://www.brecorder.com/news/40308779/us-navy-rescues-crew-from-ship-struck-by-houthis", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "CAIRO: The US Naval Forces Central Command (NAVCENT) said on Sunday that it had rescued the crew from the Liberian-flagged, Greek-owned bulk carrier M/V Tutor that was attacked by Yemen’s Iran-aligned Houthis on 12 June in the Red Sea.\nSailors assigned to the Dwight D. Eisenhower Carrier Strike Group airlifted the crew out on Saturday, NAVCENT said, adding that one civilian sailor remained missing.\nThe attack, which occurred near the Yemeni port of Hodeidah, caused severe flooding and damage to the engine room and left the Tutor unable to manoeuvre.\nCrew evacuated from vessel hit by Houthis, search for sailor continuesOn Saturday, the United Kingdom Maritime Trade Operations (UKMTO) said the ship’s crew was evacuated and that the abandoned vessel was drifting in the Red Sea.\nThe Houthis claimed responsibility for the small sea craft and missile attacks it used to target the ship as part of their ongoing campaign which they say is in support of the Palestinians and is focused on ships bound for Israel."}, {"id": "0fd4e317-9408-4857-8bdd-53720dc03ba3", "title": "Woman , 24 , arrested in fatal gang shooting in Anaheim , police say", "date": "2024-06-17 00:00", "url": "https://www.ocregister.com/2024/06/16/woman-24-arrested-in-fatal-gang-shooting-in-anaheim-police-say/", "domain": "ocregister.com", "domain_classification": "Unknown", "message": "A 24-year-old woman suspected of fatally shooting a man and injuring another in gang-related crimes in a residential Anaheim neighborhood was arrested on Saturday, June 15, authorities said.\nAt around 2:30 a.m. on Saturday, Jose Andres Abrego was shot and another victim was stabbed at a home along the 800 block of West Cottonwood Circle, according to the Anaheim Police Department.\nThe victims were taken to a hospital by a witness before authorities arrived.\nJannett Cureno, 24, fled the scene and was later arrested in Santa Ana on suspicion of the shooting and the stabbing, police said.\nAnaheim Police have asked anyone with information about the shooting to contact the Anaheim Police Department Homicide Detail at 714-321-3669 or Orange County Crime Stoppers at 855-TIP-OCCS."}, {"id": "a47e96e4-08f0-49b4-9da0-adf7998372c7", "title": "New  Nostradamu predicts when World War III will begin and it just days away", "date": "2024-06-17 00:00", "url": "https://www.kenyan-post.com/2024/06/new-nostradamus-predicts-when-world-war.html", "domain": "kenyan-post.com", "domain_classification": "Unknown", "message": "Sunday, June 16, 2024 - An astrologer dubbed “New Nostradamus” is predicting the start of World War III is mere days away.\nKushal Kumar said back in May that World War III would begin on June 18.\n“Watch the developing war scenario in hotspots across the globe as days pass by,” Kumar wrote.\nEven if WWIII doesn’t come to pass in a matter of days, state officials warn it is a serious concern.\nThe Doomsday Clock, a representation of how close the planet is to nuclear war, was also set its closest to midnight — 90 seconds away — for a second year in a row"}, {"id": "bed700f7-7c94-47c1-80aa-25dc429dab18", "title": "Israel Announces  Tactical Pause  In Gaza , Is It Due To Hezbollah ? ", "date": "2024-06-17 12:45", "url": "https://victorygirlsblog.com/israel-announces-tactical-pause-in-gaza-is-it-due-to-hezbollah/", "domain": "victorygirlsblog.com", "domain_classification": "Unknown", "message": "They have announced a “tactical pause” on all fighting during daylight hours in order to move humanitarian aid into Gaza.\nEarlier this month, rockets launched by Hezbollah set off wildfires in northern Israel, which did burn hundreds of acres and some evacuated homes.\nAfter rocket attacks caused massive fires in the north, Israel last week killed commander Taleb Abdullah, the most senior official killed in the fighting.\nThe problem is, Hochstein isn’t going to get very far with begging Israel to ignore Hezbollah, and Hezbollah won’t be talking to Hochstein.\nIf Israel is engaging in a “tactical pause” in Gaza in order to shift gears – and manpower – to deal with Hezbollah in the north, it’s understandable."}, {"id": "a7a56127-5304-4e8a-b068-43966554ca31", "title": "3 killed , UN peacekeepers wounded in eastern DR Congo - New Delhi Times - India Only International Newspaper - Empowering Global Vision , Empathizing with India", "date": "2024-06-17 10:00", "url": "https://www.newdelhitimes.com/3-killed-un-peacekeepers-wounded-in-eastern-dr-congo/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "A Romanian “mercenary” and two Congolese soldiers were killed, and a U.N. peacekeeper was wounded in three separate incidents in eastern Democratic Republic of Congo, several sources said Sunday.\nThe capital of North Kivu has been surrounded to the north and west by the Rwandan army and M23 rebels for several months.\nFighting regularly takes place against the Congolese army on the outskirts of the city, while the rebels, backed by Kigali, continue to extend their hold in the east of the country.\nSeveral Romanian television channels — including the state-owned TVR Info — described the dead fighter as a “Romanian mercenary” under contract to the Congolese army.\nAround 200 kilometers north of Goma, in Butembo, at least two soldiers were killed in an ambush, local administrator Colonel Alain Kiwewa told AFP."}, {"id": "e5312ecd-a9c8-4b05-a6ef-d94319a268b9", "title": "Russian missiles hit apartment block in Ukrainian city", "date": "2024-06-17 14:00", "url": "http://www.myanmarmuslim.net/news/20240617352c599647.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Russian ballistic missiles have slammed into an apartment block in Kharkiv, killing at least four people, Ukrainian officials said.\nThe night-time attack came a day after President Joe Biden gave Kyiv the green light to strike back with American weapons at Russian military assets targeting Kharkiv, which is Ukraine’s second-largest city.\nRussia launched five S-300/S-400 ballistic missiles at Kharkiv overnight, Ukraine’s air force said.\nThat restriction has frustrated Ukrainian officials as the military is unable to order hits on Russian troops massing across the border.\nKharkiv city is only 12 miles from Russia and Russian bases used to launch missile attacks."}, {"id": "80c6de57-0b8b-4eda-86f3-d5162e2206f5", "title": "Putin Invasion of Ukraine : Are Airbus Satellite Images Helping Russia Wage War ? ", "date": "2024-06-17 09:15", "url": "https://www.spiegel.de/international/world/putins-invasion-of-ukraine-are-airbus-satellite-images-helping-russia-wage-war-a-3ab1e690-91a7-4b46-8915-d7e0c0b5054d", "domain": "spiegel.de", "domain_classification": "Local - Europe", "message": "The high-definition images that Airbus delivers from an altitude of 630 kilometers and more are particularly valuable for nations at war.\nThat is why satellite photos can be so valuable when planning precise airstrikes.\nAs such, Ukraine – which has access to such images through its allies – has an advantage over the Russian invaders.\nBut the Ukrainian military suspects that Russian President Vladimir Putin’s military is helping itself to images from Western satellite operators immediately before launching airstrikes – with some of those photos potentially coming from Airbus-controlled satellites.\nMight the Russian military be tasking Western satellites to spy on Ukraine?"}, {"id": "d3677afa-2203-45d9-b886-1b0705513acb", "title": "Russian attack on Ukraine Poltava region injures nine , causes power cuts", "date": "2024-06-17 14:00", "url": "https://www.theglobeandmail.com/world/article-russian-attack-on-ukraines-poltava-region-injures-nine-causes-power/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "A Russian missile attack on Ukraine’s east-central Poltava region on Monday injured nine people and damaged power lines, knocking out electricity for over 55,000 consumers, a regional governor said.\nAccording to preliminary information, there were no fatalities, Filip Pronin said in a video address from the site posted on the Telegram app.\nSmoke rising from damaged garages could be seen in the background, while rescuers attempted to extinguish fires.\nPronin said later that due to damage to power lines, some 53,000 private and 2,400 industrial consumers faced power cuts.\nEarlier, Ukraine’s air force announced a missile alert for the region."}, {"id": "b60eb7dc-1da7-4418-bd3c-a00c258631dd", "title": "Three killed in Houthi attack on ship in Gulf of Aden", "date": "2024-06-17 11:45", "url": "http://www.myanmarmuslim.net/news/20240617335a599657.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "A missile attack by Yemen’s Houthi rebels on a commercial ship in the Gulf of Aden killed three crew members and forced survivors to abandon the vessel, US officials said.\nDespite more than a month and a half of US-led airstrikes, Houthi rebels have remained capable of launching significant attacks.\nIt was unclear why the Houthis targeted the True Confidence.\nThe Houthi attack on the Carney involved bomb-carrying drones and one anti-ship ballistic missile, the US military’s Central Command said.\n(PA Graphics)Smoke poured out of one container aboard the vessel, which also showed scorch marks from the impact of a Houthi missile."}, {"id": "d2037b8a-ef5e-4d79-88f7-b82cae7056af", "title": "17 killed as Russian missiles slam into Ukrainian city", "date": "2024-06-17 13:00", "url": "http://www.myanmarmuslim.net/news/20240617332c599666.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Three Russian missiles slammed into a central area of the northern Ukrainian city of Chernihiv on Wednesday, hitting an eight-storey apartment building and killing at least 17 people, local officials said.\nUkrainian President Volodymyr Zelensky has pleaded with Western countries to provide his country with more air defence systems.\nAlso, unconfirmed reports said a Ukrainian missile struck an airfield in occupied Crimea.\nNeither Russian nor Ukrainian officials confirmed the strike, but local authorities temporarily closed a road where the airfield is located.\nUkrainian drone developers have been extending the weapons’ range and earlier this month struck a target some 745 miles (1,200km) east of Ukraine."}, {"id": "c1d58563-df97-4e3a-8ec4-258dbf4fb9cc", "title": "Israel Netanyahu says Gaza offensive has  only started  ", "date": "2024-06-17 00:15", "url": "http://www.myanmarmuslim.net/news/20240617064c599881.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu said Israel has “only started” a fierce offensive in the Gaza Strip in response to Hamas’ unprecedented attack on his country.\nMr Netanyahu delivered the pronouncement in a nationally televised address as Israel pressed ahead with a third day of heavy airstrikes in Gaza.\nIn the war’s third day, Israel was still finding bodies from Hamas’ weekend attack into southern Israeli towns.\nThe UN said more than 123,000 people have fled their homes in Gaza – many after Israeli warnings of imminent bombardment.\nEgypt’s state-run Al-Ahram newspaper said on Monday that Egyptian officials are trying to mediate a release of Palestinian women in Israel’s prisons in exchange for Israeli women captured by militants."}, {"id": "6b166521-2aca-4700-9088-741fd6447fd5", "title": "How to keep cool during a heat wave - Charleston City Paper", "date": "2024-06-17 14:00", "url": "https://charlestoncitypaper.com/2024/06/17/how-to-stay-cool-during-heat-wave/", "domain": "charlestoncitypaper.com", "domain_classification": "Unknown", "message": "MORNING NEWSBREAK | Forecasters predict deadly heat along the East Coast this week and urge residents to be prepared.\nHeat indices of 100 degrees are expected to stretch from the Gulf states to Canada.\nConsider these tips:If you’re inside: Keep comfortable without air-conditioning by spritzing your skin periodically with a mist of cool water.\nIf you experience symptoms, lie down, sip water, loosen clothes and even take a cool bath.\nIn other recent headlines:CP OPINION, Brack: Turnout, scattered strategies created odd S.C. primary."}, {"id": "40343d10-daf7-480c-b209-3f8a5629cbad", "title": "Vineyard Man Returns To Court After Alleged Theater Stabbing", "date": "2024-06-17 14:00", "url": "https://cool102.iheart.com/content/2024-06-15-vineyard-man-returns-to-court-after-alleged-theater-stabbing/", "domain": "cool102.iheart.com", "domain_classification": "Unknown", "message": "The next court hearing for a Vineyard man accused of going on a stabbing spree last month is slated for later today.\nJared Ravizza is accused of stabbing four young girls at a movie theater in Braintree before driving down to Plymouth and stabbing two McDonald's employees at a at a Route 3 rest stop.\nThe 26-year-old later crashed his Porsche in Sandwich during a high-speed chase with police.\nRavizza was ordered to undergo a mental health evaluation at Bridgewater State Hospital following his arraignment in late May."}, {"id": "565bb5da-d661-469a-81e2-2766c21450fe", "title": "Vineyard Man Returns To Court After Alleged Theater Stabbing", "date": "2024-06-17 14:00", "url": "https://106wcod.iheart.com/content/2024-06-15-vineyard-man-returns-to-court-after-alleged-theater-stabbing/", "domain": "106wcod.iheart.com", "domain_classification": "Unknown", "message": "The next court hearing for a Vineyard man accused of going on a stabbing spree last month is slated for later today.\nJared Ravizza is accused of stabbing four young girls at a movie theater in Braintree before driving down to Plymouth and stabbing two McDonald's employees at a at a Route 3 rest stop.\nThe 26-year-old later crashed his Porsche in Sandwich during a high-speed chase with police.\nRavizza was ordered to undergo a mental health evaluation at Bridgewater State Hospital following his arraignment in late May."}, {"id": "9c5bb02c-1f1e-40e8-a31c-b0c2bea79a26", "title": "Massive expansion of Pine Gap spy base integrates Australia into US nuclear war planning", "date": "2024-06-17 08:15", "url": "https://www.wsws.org/en/articles/2024/06/17/kziv-j17.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Over the past four years, the joint US-Australian Pine Gap spy base in the Northern Territory has undergone the largest expansion in its history.\nSatellite photo of Pine Gap in 2020 [Photo: Google Earth]It has previously been documented that Pine Gap receives and processes information from two Orion geosynchronous signals intelligence satellites over the Indian Ocean.\nThat makes Pine Gap more a central military planning headquarters than simply a spy base.\nAs with the stationing of the B-52s in the north, there has been no discussion or announcement, let alone a popular mandate sought for the Pine Gap expansion.\nThe Pine Gap expansion began under the former Liberal-National Coalition government and has proceeded seamlessly since Labor was installed in the May 2022 federal election."}, {"id": "de6be1e6-c37e-4caf-9abe-2f25e12b5103", "title": "Gotcha ! Authorities Nab Accused Assailant After Police Rescue Stabbing Victim At CNBC HQ Lot", "date": "2024-06-17 00:00", "url": "https://dailyvoice.com/new-jersey/bergenfield/gotcha-authorities-nab-accused-assailant-after-police-rescue-stabbing-victim-near-cnbc-hq/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "Patel, who sources said had previously been seen in the area, tapped on her car window.\nThe victim, who didn't know Patel, opened the window, and he reached in with a knife, one of them told Daily Voice.\nShe rushed by ambulance to the trauma unit at Hackensack University Medical Center and was later released after being treated, the prosecutor said.\n\"[Patel] was a stranger to the victim, and the attack was unprovoked,\" Musella noted.\nPatel was booked into the Bergen County Jail a short time later to await a first appearance in Central Judicial Processing Court in Hackensack."}, {"id": "f05f4a49-95f2-4cbc-ba5b-5e90d54b93f0", "title": "U . S . Moves to Head Off War Between Israel and Hezbollah", "date": "2024-06-17 10:45", "url": "https://biztoc.com/x/aad37e9aa4b387cb", "domain": "biztoc.com", "domain_classification": "Unknown", "message": "U.S. special envoy Amos Hochstein’s visit comes after a tense week when an Israeli strike killed one of the most senior members of Hezbollah and the militant group responded by firing hundreds of rockets and drones.\nThis story appeared on wsj.com , 2024-06-17."}, {"id": "91128bdf-3e4a-4bda-81e4-bfbbea607d11", "title": "Nine killed in Russian aerial attacks on Zelensky hometown ahead of G7 summit", "date": "2024-06-17 13:15", "url": "http://www.myanmarmuslim.net/news/20240617456c599534.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Ukrainian authorities said that along with the nine killed, 29 others, including five children, were wounded when Russian missiles hit an apartment block in Kryvyi Rih, which is President Volodymyr Zelensky’s hometown.\nKyiv’s outgunned and outnumbered forces are battling to hold back the bigger Russian army, which is trying to exploit Ukrainian vulnerabilities.\nSeparately, Mr Sullivan noted that Russian authorities have deported hundreds of thousands of Ukrainian civilians to Russia, including children who have been forcibly separated from their families.\n“These Ukrainian children belong with their families inside Ukraine,” Mr Sullivan said.\nLast month, Russian forces also launched an offensive in Ukraine’s north-eastern region of Kharkiv, which borders Russia."}, {"id": "15914a2a-5819-4822-97f0-39fa489c716d", "title": "Virgin Australia flight makes emergency landing after  possible  bird strike", "date": "2024-06-17 13:45", "url": "https://abc7ny.com/virgin-australia-flight-makes-emergency-landing-after-possible-bi/14963829/", "domain": "abc7ny.com", "domain_classification": "Unknown", "message": "Virgin Australia flight makes emergency landing after 'possible' bird strikeA Virgin Australia flight made an emergency landing in New Zealand after a \"possible bird strike,\" the airline said in a statement.\nFlight VA 148 from Queenstown to Melbourne was diverted shortly after takeoff, the airline said on Monday.\nThe Boeing 737 landed at Invercargill Airport, where it was met by emergency services, the airline said.\nDarren Robinson, of Shotover Country in Queenstown, shot a short video of the plane from the ground.\n\"Heard a loud band and went outside to see a plane engine on fire,\" he said on social media."}, {"id": "399ebf4f-737c-4d57-9e8d-a3bae0f57257", "title": "Russian warships near Florida aim to intimidate . US Navy views them like targets", "date": "2024-06-17 09:30", "url": "https://www.foxnews.com/opinion/russian-warships-near-florida-aim-intimidate-navy-views-them-more-like-target-practice", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "This being the Russian navy, they wisely brought along an oiler for refueling and a salvage tug, just in case.\nNo way will Russia risk her in the Black Sea, where Ukraine’s shore defense batteries and drones have already sunk Russian navy ships like the Moskva.\nA posse of U.S. Coast Guard and Navy ships and planes, with an assist from Canada, is picking up every move of Putin’s tiny task force.\nThe U.S. Coast Guard National Security Cutter Stone is sleek, fast and new, having been delivered in 2020.\nCLICK HERE TO GET THE FOX NEWS APPSo, just consider the Russian warships drilling off the Atlantic coast as \"target practice.\""}, {"id": "d0f32964-d810-4437-a797-e492565149d6", "title": "Israel announces daily Gaza  pause  for aid deliveries", "date": "2024-06-17 11:45", "url": "https://www.naharnet.com/stories/en/305953-israel-announces-daily-gaza-pause-for-aid-deliveries", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Israel's military said Sunday it would \"pause\" fighting around a south Gaza route daily to facilitate aid deliveries, following months of warnings of famine in the besieged Palestinian territory.\nThe military said the pause was already in effect and part of efforts to \"increase the volumes of humanitarian aid\" following discussions with the U.N. and other organizations.\nIsrael's retaliatory offensive has killed at least 37,296 people in Gaza, mostly civilians, according to the health ministry in Gaza.\nHamas has insisted on the complete withdrawal of Israeli forces from Gaza and a permanent ceasefire -- demands Israel has repeatedly rejected.\nIsrael's hardline National Security Minister Itamar Ben Gvir said Sunday the humanitarian pause announced by the military was part of a \"crazy and delusional approach\"."}, {"id": "80d016ec-1d56-4b28-ac8b-f4768a401cb0", "title": "All passengers on board a flight which made an emergency landing in Invercargill have disembarked - 17 - Jun - 2024", "date": "2024-06-17 11:15", "url": "https://home.nzcity.co.nz/news/article.aspx?id=400610", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "All passengers on board a flight which made an emergency landing in Invercargill have disembarkedAll passengers on board a flight which made an emergency landing in Invercargill have disembarked17 June 2024Virgin Australia says its flight landed safely after a possible airstrike when taking off from Queenstown Airport.\nThe plane had taken off at 6pm bound for Melbourne before being diverted to Invercargill Airport.\nIts Chief Operations Officer Stuart Aggs says they are not aware of any injuries to the guests and crew.\nHe says it is organising accommodation, transport, and flights to Australia for all 73 on board.\n© 2024Newstalk ZB, NZCity"}, {"id": "4c279864-5a73-4e83-bd14-e68bb1436161", "title": "Germany to resume Afghan deportations via Uzbekistan - Newspaper", "date": "2024-06-17 03:45", "url": "https://www.dawn.com/news/1840410/germany-to-resume-afghan-deportations-via-uzbekistan", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "FRANKFURT: Ger­many’s government is holding talks with Uzbekistan to enable deportations from Germany to Afghanistan without direct consultations with the Taliban, according to a report in German magazine Der Spiegel on Sunday.\nIt stopped deportations to Afghanistan after the Tali­ban took power in 2021.\nThe Uzbek government wants to sign a formal migration agreement with Germany before a deal on deportations, the Spiegel report said.\nOfficials had been carrying out an “intensive review for several mon­ths… to allow the deportation of serious criminals and dangerous individuals to Afghanistan”, Interior Minister Nancy Faeser told journalists.\nDeportations to Afgha­nis­tan from Germany have been completely stopped since the Taliban retook power in 2021."}, {"id": "7b5b4b93-bfff-4159-94a7-deb33ad57213", "title": "Haiti declares curfew as it tries to restore order after weekend jailbreak", "date": "2024-06-17 01:00", "url": "http://www.myanmarmuslim.net/news/20240617331c599666.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "“The police were ordered to use all legal means at their disposal to enforce the curfew and apprehend all offenders,” said a statement from finance minister Patrick Boivert, the acting prime minister.\nHaiti’s National Police has roughly 9,000 officers to provide security for more than 11 million people, according to the UN.\nA second Port-au-Prince prison containing around 1,400 inmates was also overrun.\nMr Henry took over as prime minister following Mr Moise’s assassination and has postponed plans to hold parliamentary and presidential elections, which have not happened in almost a decade.\nThe prime minister, a neurosurgeon, has shrugged off calls for him to resign and did not comment when asked if he felt it was safe to come home."}, {"id": "d3e9abcc-dc2c-4796-939f-36393852ad95", "title": "Ukraine hits Russian oil facilities as Zelensky joins D", "date": "2024-06-17 01:15", "url": "http://www.myanmarmuslim.net/news/20240617303e599687.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "In Belgorod, a drone hit an oil depot overnight, governor Vyacheslav Gladkov said, causing an explosion and a fire in one of the oil reservoirs.\nThat threat came after Nato allies said they would allow Ukraine to use weapons they deliver to Kyiv to attack Russian territory.\n“Let the US and its allies feel the impact of direct use of Russian weapons by others,” he said.\nMr Putin deliberately did not name potential recipient countries of Russian weapons, Mr Medvedev said.\nKremlin spokesman Dmitry Peskov said the use of western weapons against Russia “can’t be left without consequences, and those consequences will certainly follow”."}, {"id": "e3fdb56b-6857-491f-9bc5-d76e3a3c7686", "title": "Police investigate two overnight stabbings in Rochester", "date": "2024-06-17 10:45", "url": "https://13wham.com/news/local/2-overnight-stabbings-in-rochester", "domain": "13wham.com", "domain_classification": "Unknown", "message": "— Two people are being treated for injuries after separate stabbings in the city Sunday night.\nAround 10:15 p.m., police spoke to the already hospitalized victim of a stabbing.\nThe victim said that an individual stabbed him during an argument at North Clinton Avenue near Hoeltzer Street.\nThen around 10:45 p.m., officers responded to reports of a stabbing on Orchard Street near Lime Street.\nAnyone with information is asked to call 911 or Crime Stoppers at 423-9300."}, {"id": "07373700-41fc-4d55-b0f5-3942b62548a4", "title": "Netanyahu dissolves Israeli war cabinet after resignations", "date": "2024-06-17 11:45", "url": "https://www.yahoo.com/news/netanyahu-dissolves-israeli-war-cabinet-102356823.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu dissolved his war cabinet on Monday, a spokeswoman for the prime minister confirmed.\nIsraeli media had earlier leaked the news about the break-up of the cabinet, which was formed after the Hamas terrorist attacks of October 7.\nNetanyahu leads a government composed of far-right and religious parties, but the war cabinet contained Gantz, a key opposition figure.\nLast week, Gantz - a former general and defence minister - announced his withdrawal due to differences of opinion with regard to the Gaza war and what would happen to Gaza after the war is over.\nAn observer member of the cabinet, Gadi Eisenkot, also withdrew, leading to even greater expectations that the cabinet would be dissolved."}, {"id": "851cb260-0b38-4a3d-8736-a4e25020ceba", "title": "US military shoots down missiles and drones as it faces threats in Middle East", "date": "2024-06-17 00:15", "url": "http://www.myanmarmuslim.net/news/20240617319a599626.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "US forces in the Middle East are facing increasing threats after a Navy warship shot down missiles appearing to head toward Israel on Thursday.\nThe official said one projectile was shot down and another struck, but according to early reports no one was injured.\nA US official said they do not believe the missiles — which were shot down over the water — were aimed at the warship.\nAn array of other drone attacks over the past three days did target US bases, including one in southern Syria on Thursday that caused minor injuries.\nThe most recent drone attack was Thursday at al-Asad Air Base in western Iraq."}, {"id": "4af4be2b-0039-4ce8-99ec-e3a0d9c0b3f6", "title": "Houston shooting : 13 - year - old killed , 16 - year - old brother injured during parking lot shooting", "date": "2024-06-17 14:00", "url": "https://www.fox26houston.com/news/houston-shooting-13-year-old-killed-16-year-old-brother-injured-during-parking-lot-shooting", "domain": "fox26houston.com", "domain_classification": "Unknown", "message": "A shooting in Southwest Houston has resulted in the death of a 13-year-old boy and left his 16-year-old brother wounded.\nFOX 26 Houston is now on the FOX LOCAL app available through Apple TV, Amazon FireTV, Roku and Google Android TV!\nSUGGESTED: Officer-involved shooting under investigation in Southeast HoustonAccording to HPD, the incident occurred as the brothers were walking across a parking lot at 9111 Lakes At 610 Drive.\nDOWNLOAD THE FOX 26 HOUSTON APP BY CLICKING HEREHomicide detectives are on the scene investigating what they believe to be a targeted attack.\nThe suspect's vehicle left the location in an unknown direction, and the investigation is ongoing."}, {"id": "8ea8a94c-3a8e-4431-940e-d20e38d2ba90", "title": "Israel army to pause daytime fighting along route in Gaza to help with aid", "date": "2024-06-17 02:30", "url": "https://www.newschannel5.com/world/israel-at-war/israels-army-says-it-will-pause-daytime-fighting-along-a-route-in-southern-gaza-to-help-flow-of-aid", "domain": "newschannel5.com", "domain_classification": "Unknown", "message": "Israel's military announced on Sunday that it would pause fighting during daytime hours along a route in southern Gaza to free up a backlog of humanitarian aid deliveries for desperate Palestinians enduring a humanitarian crisis sparked by the war, now in its ninth month.\nIt could help address the overwhelming needs of Palestinians that have surged in recent weeks with Israel's incursion into Rafah.\nThe army said that the daily pause would begin at 8 a.m. and last until 7 p.m. and continue until further notice.\nHard-hit northern Gaza, an early target in the war, is served by goods entering from the north.\nWhile the army insisted “there is no cessation of fighting” in southern Gaza, it also said the new route would be open during daytime hours “exclusively for the transportation of humanitarian aid.”The fighting continued."}, {"id": "caed3343-1055-4050-99e1-e15168339b6e", "title": "At least 95 killed in twin blasts at ceremony honouring Iranian general", "date": "2024-06-17 10:00", "url": "http://www.myanmarmuslim.net/news/20240617977a598966.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Two explosions minutes apart at a commemoration in Iran for a prominent general who died in a US drone strike in 2020 killed at least 95 people and injured more than 211 others on Wednesday.\nThe blasts came as the Middle East remains on edge over Israel’s war on Hamas in the Gaza Strip.\nWhile Israel has carried out attacks in Iran over its nuclear programme, it has conducted targeted assassinations, not mass-casualty bombings.\nThe blasts struck an event marking the the fourth anniversary of the killing of General Qassem Soleimani, the head of the Revolutionary Guard’s elite Quds Force, in a US drone strike in Iraq in January 2020.\nUltimately, a drone strike launched by the Trump administration killed the general, part of escalating incidents that followed America’s 2018 unilateral withdrawal from Tehran’s nuclear deal with world powers."}, {"id": "eb2631b7-ff37-4f1f-b025-9cdca0077bcc", "title": "Pakistan : At least five policemen killed , 3 injured as vehicle overturns in Hub", "date": "2024-06-17 13:00", "url": "https://news.webindia123.com/news/Articles/World/20240617/4206539.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Following the tragic incident, the injured people were taken to District Headquarters Hospital, and were given immediate medical attention, the police officials said.\nWhereas, in a separate incident, at least three police personnel were injured in a grenade attack.\nThe hand grenades were thrown on a police vehicle in the Sachal area of Karachi, ARY News.\nPrior to this incident, unidentified men hurled a hand grenade at the Senior Superintendent of Police (SSP's) squad in Dera Murad Jamali, Naseerabad.\nSSP Naseerabad Hussain Lehri and his team were returning from a regular patrol when the hand grenade burst, according to police officials, although no one was hurt, according to ARY News."}, {"id": "c24e35eb-5f18-490d-a4fe-db97833d2d69", "title": "Ukraine hits Russian oil facilities as Zelensky joins D", "date": "2024-06-17 14:00", "url": "http://www.myanmarmuslim.net/news/20240617500d599499.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "In Belgorod, a drone hit an oil depot overnight, governor Vyacheslav Gladkov said, causing an explosion and a fire in one of the oil reservoirs.\nThat threat came after Nato allies said they would allow Ukraine to use weapons they deliver to Kyiv to attack Russian territory.\n“Let the US and its allies feel the impact of direct use of Russian weapons by others,” he said.\nMr Putin deliberately did not name potential recipient countries of Russian weapons, Mr Medvedev said.\nKremlin spokesman Dmitry Peskov said the use of western weapons against Russia “can’t be left without consequences, and those consequences will certainly follow”."}, {"id": "0c7a5f60-c35c-433b-a4c9-5733ad6cfca1", "title": "Netanyahu dissolves Israeli war cabinet after resignations", "date": "2024-06-17 12:00", "url": "https://www.prokerala.com/news/articles/a1540113.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Tel Aviv, June 17 : Israeli Prime Minister Benjamin Netanyahu dissolved his war cabinet on Monday, a spokeswoman for the Prime Minister confirmed.\nIsraeli media had earlier leaked the news about the disbanding of the cabinet, which was formed after the Hamas terrorist attacks of October 7.\nNetanyahu leads a government composed of far-right and religious parties, but the war cabinet contained Gantz, a key opposition figure.\nLast week, Gantz -- a former general and Defence Minister -- announced his withdrawal due to differences of opinion concerning the Gaza war and what would happen to Gaza after the war is over.\nAn observer member of the cabinet, Gadi Eisenkot, also withdrew, leading to even greater expectations that the cabinet would be dissolved."}, {"id": "a1e1183c-0b77-4e60-ba25-23d19ba53142", "title": "Teenagers plotted to attack Jewish people after Sydney stabbing , police say", "date": "2024-06-17 12:00", "url": "http://www.myanmarmuslim.net/news/2024061709e599989.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosFour teenagers plotted to buy guns and attack Jewish people days after a bishop was stabbed in a Sydney church, according to police documents cited on Monday.\nAustralian police say the knife attack in Sydney that wounded a bishop and a priest during a church service was an act of terrorism.\nThe 16-year-old allegedly responded, “We’re gonna be planning for a while … we prefer to escape, but whatever happens, it’s the qadr (predetermination) of Allah,” the newspapers reported.\nThe 16-year-old allegedly said of the church attacker, “I know the bloke who done it” and “he’s my mate”.\nBishop Emmanuel on Sunday gave his first sermon since the stabbing at the Christ the Good Shepherd Church."}, {"id": "46b9b6e7-dbe5-484f-a29e-8579fc7d6634", "title": "6 people wounded when two gunmen open fire in Englewood -- second mass shooting in an hour early Monday", "date": "2024-06-17 12:45", "url": "https://chicago.suntimes.com/crime/2024/06/17/6-people-wounded-englewood", "domain": "chicago.suntimes.com", "domain_classification": "Unknown", "message": "Seven people were wounded when two gunmen opened fire in Englewood early Monday morning.\nA 20-year-old man was taken to University of Chicago Medical Center in critical condition with a gunshot wound to the neck.\nA man, 31, was taken to University of Chicago Medical Center with a gunshot wound to the ankle and another man, 32, was taken to St. Bernard Hospital.\nThe attack was the second mass shooting in about an hour early Monday.\nIn all, more than 20 people were shot in Chicago in little more than four hours early Monday."}, {"id": "1740540a-5ebd-44eb-b2b9-f130b87bf91a", "title": "Netanyahu Dissolves Israeli War Cabinet After Resignations", "date": "2024-06-17 12:00", "url": "https://menafn.com/1108340889/Netanyahu-Dissolves-Israeli-War-Cabinet-After-Resignations", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Tel Aviv, June 17 (IANS/DPA) Israeli Prime Benjamin Netanyahu dissolved his war cabinet on Monday, a spokeswoman for the Prime Minister confirmed.\nIsraeli had earlier leaked the news about the disbanding of the cabinet, which was formed after the Hamas of October 7.\nNetanyahu leads a government composed of far-right and religious parties, but the war cabinet contained Gantz, a key opposition figure.\nLast week, Gantz -- a former general and Defence Minister -- announced his withdrawal due to differences of opinion concerning the Gaza war and what would happen to Gaza after the war is over.\nAn observer member of the cabinet, Gadi Eisenkot, also withdrew, leading to even greater expectations that the cabinet would be dissolved."}, {"id": "6cd6e68d-edff-4535-b068-a68c7b0b6b6c", "title": "Enugu On Edge : Four Injured In Overnight Clash , Fears Of Escalating Communal Violence Grow", "date": "2024-06-17 12:00", "url": "https://saharareporters.com/2024/06/17/enugu-edge-four-injured-overnight-clash-fears-escalating-communal-violence-grow", "domain": "saharareporters.com", "domain_classification": "Unknown", "message": "\"Then at night, at about 11 pm they came in and started shooting everybody.\nThey shot me and I held them and they started shooting everybody, using cutlasses on some people.\nOne of them, Samuel, is an Abakaliki man who lived in Umualor.\nThey started shooting at us.\n\"The man who shot me is an Abakaliki man; I know all of them."}, {"id": "40d0e37e-5b8c-40ee-b63b-81329c6efcaa", "title": "Man fatally stabbed at homeless encampment in Long Beach", "date": "2024-06-17 00:00", "url": "https://www.presstelegram.com/2024/06/16/man-fatally-stabbed-at-homeless-encampment-in-long-beach/", "domain": "presstelegram.com", "domain_classification": "Unknown", "message": "A man was stabbed to death at an encampment near the Los Angeles River in Long Beach on Saturday, June 15, authorities said.\nJust before 9 a.m., the victim was involved in an argument at the encampment along Long Beach Boulevard when someone stabbed him, according to the Long Beach Police Department.\nIt was not clear whether the suspect and victim knew each other, and a motive for the stabbing was under investigation.\nLong Beach Police are asking anyone with information regarding the stabbing to contact Homicide Detectives Ethan Shear or Chasen Contreras at 562-570-7244.\nAnonymous tips may be submitted through “LA Crime Stoppers” by calling 800-222-TIPS (8477)."}, {"id": "23e4d33d-9285-47e0-bf08-02320801900d", "title": "Rare day of relative calm as Gaza sees  tactical pause  for aid", "date": "2024-06-17 11:45", "url": "https://www.naharnet.com/stories/en/305960-rare-day-of-relative-calm-as-gaza-sees-tactical-pause-for-aid", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "\"Compared with the previous days, today, the first day of Eid al-Adha, is considered near calm and the calm has prevailed across all of Gaza,\" Mahmud Basal, spokesman for the civil defense agency in Hamas-ruled Gaza, told AFP.\nHe said the exceptions included \"some targeting\" in Gaza City's Shujaiya and Zeitun areas, as well as Israeli artillery fire in Rafah, southern Gaza.\nOverall calm continued in most of Gaza at the end of Sunday's pause, an AFP correspondent said.\nThe eight soldiers killed Saturday were hit by an explosion as they travelled in an armored vehicle near Rafah, the military said.\nIsrael's hardline National Security Minister Itamar Ben Gvir said the humanitarian pause announced by the military was part of a \"crazy and delusional approach\"."}, {"id": "9013c065-651e-46a2-b0e9-3e3b7c0fec8f", "title": "Israel resists US pressure to pause the war to allow more aid into Gaza Strip", "date": "2024-06-17 00:15", "url": "http://www.myanmarmuslim.net/news/2024061714b599931.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "In the Gaza Strip, Israeli troops tightened their encirclement of the largest city amid continued battles with Hamas militants.\nAl Jazeera TV reported that a strike late on Friday hit a school in Gaza City where many were taking refuge, causing casualties.\nTwenty-four Israeli soldiers have been killed in the Gaza Strip since the start of the ground operation.\nIsraeli military officials said their forces have encircled densely built-up Gaza City and began on Friday to launch targeted attacks on militant cells.\nIsrael says Hamas has extensive military infrastructure in the city, including a network of underground tunnels, bunkers and command centres."}, {"id": "183d96ac-92ef-48d8-9ed2-91a0f48ba144", "title": "Accused in Pannun murder for hire plot extradited to united states ", "date": "2024-06-17 03:45", "url": "https://www.geo.tv/latest/549801-accused-in-pannun-murder-for-hire-plot-extradited-to-usa", "domain": "geo.tv", "domain_classification": "Unknown", "message": "Pro-Khalistan Sikh leader and Sikhs For Justice (SFJ) General Counsel Gurpatwant Singh Pannun (centre).\n— Photo by authorLONDON: Indian citizen and Indian spy agency RAW’s agent accused of attempting to kill Sikh leader Gurpatwant Singh Pannun in New York has been extradited to the US ahead of an expected federal court appearance.\nNikhil Gupta has been charged with murder for hire linked to a foiled plot to assassinate Gurpatwant Singh Pannun, a dual US and Canadian citizen who advocates for an independent Sikh state called Khalistan.\nThe Justice Department alleges that Gupta, 52, is an associate of an Indian government “senior field officer” and that together they and others helped plot the assassination of Pannun.\nAround that time in Canada, on June 18, gunmen shot and killed another Sikh separatist leader, Hardeep Singh Nijjar, outside a Sikh temple in British Columbia."}, {"id": "36482cbd-dd13-4beb-9759-68c8dd242b97", "title": "The beautiful musical legacy of teen who died at Manchester Arena", "date": "2024-06-17 10:15", "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/the-beautiful-musical-legacy-of-29366752", "domain": "manchestereveningnews.co.uk", "domain_classification": "Unknown", "message": "Eilidh’s Trust was established to support music education for young people across Scotland.\n(Image: UGC)A spokesperson said: \"Eilidh's Trust funding will be used in a variety of ways, including instrument purchases and travel and accommodation to attend competitions and festivals.\nAt the public inquiry, Eilidh's family described her as 'the warmest girl that you could ever meet'.\nThe video showed beautiful, scenic images from the Isle of Barra, all set to Scottish pipe music.\nSuicide bomber Salman Abedi detonated a rucksack bomb in the City Room area of Manchester Arena after the concert."}, {"id": "610f78ab-7d79-4bc9-8d87-0d190b330c50", "title": "Russo - Ukraine War - 16 June 2024", "date": "2024-06-17 03:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-16.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nAccording to preliminary information, since the beginning of the day Russian forces loss totaled 122 occupants dead and wounded, 31 Russian personnel shelters and ammunition depots were affected.\nNine assault actions in the area of Verkhnyokamiansky and Rozdolivka were repelled by the Defense Forces units.\nRussian troops have repelled seven counterattacks by assault detachments from the 36th Marine Brigade and the 13th National Guard Brigade."}, {"id": "6b84966e-c079-4315-a828-ef789994bde0", "title": "Emhoff will speak at groundbreaking of the memorial for the Pittsburgh synagogue shooting victims – Winnipeg Free Press", "date": "2024-06-17 11:00", "url": "https://www.winnipegfreepress.com/world/2024/06/17/emhoff-will-speak-at-groundbreaking-of-the-memorial-for-the-pittsburgh-synagogue-shooting-victims", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "WASHINGTON (AP) — Doug Emhoff, the husband of Vice President Kamala Harris and the first Jewish person to serve as the spouse of a nationally elected U.S. leader, will deliver remarks on Sunday at the groundbreaking of the memorial to victims of the 2018 Pittsburgh synagogue shooting.\nWinnipeg Free Press | Newsletter Business Weekly Monday mornings The latest local business news and a lookahead to the coming week.\nThe space will include a new place of worship, a museum devoted to studying the hatred of Jews in the U.S. and a memorial to the victims.\nFILE - Second gentleman Doug Emhoff speaks during a Jewish American Heritage Month event, May 20, 2024, in the Rose Garden of the White House in Washington.\nEmhoff will speak on June 22 at the groundbreaking of the memorial to victims of the 2018 Pittsburgh synagogue shooting."}, {"id": "883b8542-8559-47bc-bee3-0df17da44960", "title": "Hezbollah aggression pushing region toward broader conflict , IDF spokesperson says", "date": "2024-06-17 00:00", "url": "https://www.ynetnews.com/article/hkty2thh0", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Hezbollah's escalating aggression is pushing the region toward a broader conflict, IDF Spokesperson Rear Admiral Daniel Hagari warned on Sunday.\nIDF Spokesperson Rear Admiral Daniel Hagari in message to Hezbollah ( Video: IDF Spokesperson's Unit )\"Hezbollah is jeopardizing the future of Lebanon - so that it can be a shield for Hamas.\nHe emphasized Israel's commitment to protecting its citizens, saying, \"Israel has a duty to defend the people of Israel.\nA rare and quiet day unfolded along Israel's northern border, a region that has been the epicenter of conflict for months.\nIDF airstrikes in southern Lebanon ( Video: IDF Spokesperson's Unit )Despite the lull, Israel continued its strikes throughout the day, and Hezbollah's inactivity does not indicate a shift in its strategy."}, {"id": "317c517c-6ffd-423c-a002-47e2231a6ef4", "title": "Nikhil Gupta , suspect in plot to kill Gurpatwant Singh Pannun , extradited to US | India News", "date": "2024-06-17 01:00", "url": "https://timesofindia.indiatimes.com/india/nikhil-gupta-suspect-in-plot-to-kill-gurpatwant-singh-pannun-extradited-to-us/articleshow/111046905.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Typically, extradited defendants must appear in court within a day of their arrival in the country.\n\"US federal prosecutors have alleged that Gupta was working for an Indian official to facilitate the murder-for-hire plot against Pannun, and that he hired a hitman and paid $15,000 in advance.\nGupta, through his attorney Rohini Musa, has also denied the charges, claiming that he has been \"unfairly charged.\n\"In a petition to the Indian Supreme Court, Musa stated that there is \"nothing on record to link the Petitioner to the massive alleged plot to assassinate the alleged victim.\nIt is expected that Sullivan will raise the issue with his Indian counterpart, Ajit Doval, during their meeting."}, {"id": "306720e9-e005-4547-8444-8f901389833d", "title": "Man goes on trial for murder of ex - girlfriend in Fukuoka", "date": "2024-06-17 09:15", "url": "https://japantoday.com/category/crime/man-goes-on-trial-for-murder-of-ex-girlfriend-in-fukuoka", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "A 32-year-old man went on trial Monday for killing his 38-year-old ex-girlfriend in Fukuoka City last year.\nDuring the opening session of his lay judge trial at the Fukuoka District Court, Susumu Terauchi said: \"I stabbed her, but I didn't lie in wait to ambush her,” Kyodo News reported.\nHe said Terauchi was on his way to a shop near Hakata Station to pay his mobile phone bill and unexpectedly met the victim.\nWhen he asked if he could talk to her, she ignored him and he \"exploded with emotion,” the defense said.\nStreet surveillance camera footage near where Kawano’s body was found showed Terauchi quarreling with Kawano as they walked along a street."}, {"id": "10e7ee7f-301d-46c9-b8c7-80d09b8d3fe8", "title": "Netanyahu tells Israel  we are at war  as Hamas launches unprecedented attack", "date": "2024-06-17 00:00", "url": "http://www.myanmarmuslim.net/news/20240617005d599940.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosPrime minister Benjamin Netanyahu has told Israel that it is “at war” with Hamas militants that rule the Gaza Strip, after they launched a major, multi-front attack on the country.\nAt least 40 people in Israel have been killed and hundreds wounded, making the unprecedented surprise early morning attack by Hamas the deadliest in Israel in years.\nPolitical commentators lambasted the government over its failure to anticipate what appeared to be a Hamas attack unseen in its level of planning and co-ordination.\nIt said its forces were engaged in gunfights with Hamas militants who had infiltrated Israel in at least seven locations.\nThe shadowy leader of Hamas’ military wing, Mohammed Deif, announced the start of what he called “Operation Al-Aqsa Storm”."}, {"id": "2600588d-3442-45e6-86a9-7973cce70561", "title": "Perth news ; WA news LIVE : Teens to face court over Karrinyup stabbing", "date": "2024-06-17 00:15", "url": "https://www.smh.com.au/national/western-australia/wa-news-live-teens-to-face-court-over-karrinyup-stabbing-20240617-p5jma6.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Back to politics now, and Radio 6PR’s Oliver Peterson has revealed WA MP Mia Davies is being wooed by senior figures within the federal National Party to run in the newly proposed seat of Bullwinkel.\nNationals MP Mia Davies.\nDavies declined to comment, but Peterson said the former opposition leader was “weighing it up”.\nThe Member for Central Wheatbelt stood down as opposition leader in 2023, declaring she had “no fuel in the tank” and would not contest her seat at the next state election.\nThe 45-year-old became the first Nationals opposition leader in almost 80 years in 2021 after former premier Mark McGowan took WA Labor to the biggest political victory in Australian history."}, {"id": "f70fdfa7-30f7-489e-a872-d30ba9fba320", "title": "Perth news ; WA news LIVE : Teens to face court over Karrinyup stabbing", "date": "2024-06-17 00:15", "url": "https://www.theage.com.au/national/western-australia/wa-news-live-teens-to-face-court-over-karrinyup-stabbing-20240617-p5jma6.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "Back to politics now, and Radio 6PR’s Oliver Peterson has revealed WA MP Mia Davies is being wooed by senior figures within the federal National Party to run in the newly proposed seat of Bullwinkel.\nNationals MP Mia Davies.\nDavies declined to comment, but Peterson said the former opposition leader was “weighing it up”.\nThe Member for Central Wheatbelt stood down as opposition leader in 2023, declaring she had “no fuel in the tank” and would not contest her seat at the next state election.\nThe 45-year-old became the first Nationals opposition leader in almost 80 years in 2021 after former premier Mark McGowan took WA Labor to the biggest political victory in Australian history."}, {"id": "55cd8859-3eea-470c-8f81-f74eeae767ed", "title": "Emhoff will speak at groundbreaking of the memorial for the Pittsburgh synagogue shooting victims", "date": "2024-06-17 11:00", "url": "https://www.yahoo.com/news/emhoff-speak-groundbreaking-memorial-pittsburgh-103132255.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Emhoff will speak at groundbreaking of the memorial for the Pittsburgh synagogue shooting victimsFILE - Second gentleman Doug Emhoff speaks during a Jewish American Heritage Month event, May 20, 2024, in the Rose Garden of the White House in Washington.\nEmhoff will speak on June 22 at the groundbreaking of the memorial to victims of the 2018 Pittsburgh synagogue shooting.\n(AP Photo/Jacquelyn Martin, File)WASHINGTON (AP) — Doug Emhoff, the husband of Vice President Kamala Harris and the first Jewish person to serve as the spouse of a nationally elected U.S. leader, will deliver remarks on Sunday at the groundbreaking of the memorial to victims of the 2018 Pittsburgh synagogue shooting.\nThe space will include a new place of worship, a museum devoted to studying the hatred of Jews in the U.S. and a memorial to the victims.\nJosh Shapiro and CNN's Wolf Blitzer, who will serve as the ceremony's host."}, {"id": "78d7c22d-3a24-48b6-b408-ea95900b9b57", "title": "Indian national charged with plotting the murder for hire of a Sikh activist is extradited to the US", "date": "2024-06-17 13:45", "url": "https://www.clickorlando.com/news/world/2024/06/17/indian-national-charged-with-plotting-the-murder-for-hire-of-a-sikh-activist-is-extradited-to-the-us/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Under the indictment, Nikhil Gupta, 52, an Indian national, faces charges including murder for hire.\nGupta, was extradited from the Czech Republic to the United States to face charges of murder for hire and conspiracy to commit murder for hire, Czech Justice Minister Pavel Blaek said on Monday, June 17, 2024.\n(U.S. Attorney's Office via AP, file)PRAGUE – An Indian national was extradited from the Czech Republic to the United States to face charges of murder for hire and conspiracy to commit murder for hire, Czech Justice Minister Pavel Blažek said on Monday.\nGupta was arrested in Prague last June under a bilateral extradition treaty between the U.S. and the Czech Republic.\nPannun advocates for the creation of a sovereign Sikh state and is considered a terrorist by the Indian government."}, {"id": "94ca5d94-3c60-4bf1-a938-ab805da98a0f", "title": "Indian national charged with plotting the murder for hire of a Sikh activist is extradited to the US", "date": "2024-06-17 11:45", "url": "https://www.wfmz.com/news/indian-national-charged-with-plotting-the-murder-for-hire-of-a-sikh-activist-is-extradited/article_20d8ecd7-7483-5a1c-b03b-1f5b1399f2ec.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "In this June 2023 photo taken by an undercover agent and provided by the U.S. Attorney's office, an undercover agent posing as a hitman, left, holds money received as a partial advance payment for murder during a transaction in New York.\nU.S. officials became aware in the spring of a plot to kill Gurpatwant Singh Pannun, an American citizen who advocates for the creation of a sovereign Sikh state.\nUnder the indictment, Nikhil Gupta, 52, an Indian national, faces charges including murder for hire.\nGupta, was extradited from the Czech Republic to the United States to face charges of murder for hire and conspiracy to commit murder for hire, Czech Justice Minister Pavel Blažek said on Monday, June 17, 2024."}, {"id": "deafac7a-103e-4df2-9353-48109775df1c", "title": "Perth news ; WA news LIVE : Teens to face court over Karrinyup stabbing", "date": "2024-06-17 00:00", "url": "https://www.watoday.com.au/national/western-australia/wa-news-live-teens-to-face-court-over-karrinyup-stabbing-20240617-p5jma6.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "Back to politics now, and Radio 6PR’s Oliver Peterson has revealed WA MP Mia Davies is being wooed by senior figures within the federal National Party to run in the newly proposed seat of Bullwinkel.\nNationals MP Mia Davies.\nDavies declined to comment, but Peterson said the former opposition leader was “weighing it up”.\nThe Member for Central Wheatbelt stood down as opposition leader in 2023, declaring she had “no fuel in the tank” and would not contest her seat at the next state election.\nThe 45-year-old became the first Nationals opposition leader in almost 80 years in 2021 after former premier Mark McGowan took WA Labor to the biggest political victory in Australian history."}, {"id": "567697eb-2be2-41cd-94ec-4aedc1a6a7c6", "title": "Perth news ; WA news LIVE : Teens to face court over Karrinyup stabbing", "date": "2024-06-17 00:15", "url": "https://www.brisbanetimes.com.au/national/western-australia/wa-news-live-teens-to-face-court-over-karrinyup-stabbing-20240617-p5jma6.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Back to politics now, and Radio 6PR’s Oliver Peterson has revealed WA MP Mia Davies is being wooed by senior figures within the federal National Party to run in the newly proposed seat of Bullwinkel.\nNationals MP Mia Davies.\nDavies declined to comment, but Peterson said the former opposition leader was “weighing it up”.\nThe Member for Central Wheatbelt stood down as opposition leader in 2023, declaring she had “no fuel in the tank” and would not contest her seat at the next state election.\nThe 45-year-old became the first Nationals opposition leader in almost 80 years in 2021 after former premier Mark McGowan took WA Labor to the biggest political victory in Australian history."}, {"id": "f266cb1f-01c0-4d89-85dd-30bcbd9869fd", "title": "Man Stabbed To Death at Homeless Encampment in Long Beach", "date": "2024-06-17 03:45", "url": "https://mynewsla.com/crime/2024/06/16/man-stabbed-to-death-at-homeless-encampment-in-long-beach/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "A man was stabbed to death at a homeless encampment along the Los Angeles River in Long Beach, authorities said Sunday.\nThe suspect fled the scene before officers arrived, the Long Beach Police Department reported.\nOfficers dispatched to the area of the Los Angeles River and Long Beach Boulevard at about 8:50 a.m. Saturday found the victim suffering from a stab wound to the upper body.\n“Through their preliminary investigation, detectives determined the victim and a male adult suspect engaged in a verbal altercation, which escalated when the suspect stabbed the victim,” police said.\nLong Beach police urged anyone with information regarding the stabbing to call them at 562-570-7244."}, {"id": "12c85110-862a-47bf-9f97-a3ff84bf6237", "title": "IG Koome reassures judiciary staff of safety after magistrate shooting incident", "date": "2024-06-17 14:00", "url": "https://www.the-star.co.ke/news/realtime/2024-06-17-ig-koome-reassures-judiciary-staff-of-safety-after-magistrate-shooting-incident/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "Inspector General Japhet Koome has reassured judiciary staff of their safety and security, following the shooting and subsequent death of Makadara Principal Magistrate Monicah Kivuti.\nIn a statement on Monday, Koome said providing their security remains a matter of priority for the National Police Service.\n“Following the tragic loss of the Makadara Law Courts’ Principal Magistrate, Hon.\nHe condoled with the family of the late Principal Magistrate and Judiciary, as he wished speedy recovery to two National Police Service officers who were injured during the incident.\nMonica Kivuti, Principal Magistrate, Makadara Law Courts has lost the fight against the extensive injuries sustained during an open gun attack in Court,\" CJ Koome said."}, {"id": "8ba090b1-f908-46e7-994a-e81150798016", "title": "Indian national charged with plotting the murder for hire of a Sikh activist is extradited to the US", "date": "2024-06-17 14:00", "url": "https://www.wsls.com/news/world/2024/06/17/indian-national-charged-with-plotting-the-murder-for-hire-of-a-sikh-activist-is-extradited-to-the-us/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "Under the indictment, Nikhil Gupta, 52, an Indian national, faces charges including murder for hire.\nGupta, was extradited from the Czech Republic to the United States to face charges of murder for hire and conspiracy to commit murder for hire, Czech Justice Minister Pavel Blaek said on Monday, June 17, 2024.\n(U.S. Attorney's Office via AP, file)PRAGUE – An Indian national was extradited from the Czech Republic to the United States to face charges of murder for hire and conspiracy to commit murder for hire, Czech Justice Minister Pavel Blažek said on Monday.\nGupta was arrested in Prague last June under a bilateral extradition treaty between the U.S. and the Czech Republic.\nPannun advocates for the creation of a sovereign Sikh state and is considered a terrorist by the Indian government."}, {"id": "65278743-ed62-4cf0-93b6-0c7f4da79e5e", "title": "Members of public help cops track down teens after stabbing near Perth shopping centre", "date": "2024-06-17 04:00", "url": "https://www.smh.com.au/national/western-australia/members-of-public-help-cops-track-down-teens-after-alleged-stabbing-near-perth-shopping-centre-20240617-p5jmdm.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Two teenagers will face court on Monday charged over a stabbing in Karrinyup on Sunday that left two men with critical injuries.\nThe 16-year-olds, who cannot be named for legal reasons, were arrested after members of the public helped guide police to their locations.\nCredit: Nine News PerthPolice allege the boys were armed with knives when they arrived at a pre-arranged meeting with two 18-year-old men on Northgate Street.\nThey claim the boys then threatened the two men and that during an altercation, one of the 18-year-old was stabbed in the stomach.\nThe other, they allege, sustained slash wounds to his wrists and thigh."}, {"id": "06e5810c-729c-45b8-9328-52877a363d29", "title": "Shooting in Detroit suburb injures 9 , leaving an 8 - year - old in critical condition", "date": "2024-06-17 10:30", "url": "https://www.wafb.com/2024/06/15/multiple-people-injured-shooting-splash-pad-michigan/", "domain": "wafb.com", "domain_classification": "Unknown", "message": "An 8-year-old boy was shot in the head and in critical condition Saturday night, Oakland County Sheriff Mike Bouchard said during a news conference.\nPolice in Michigan said nine people were injured in a shooting in a Detroit suburb.\nAuthorities found a handgun, three empty magazines and at least 28 spent shell casings at the splash pad.\n“In terms of the ‘why,’ I don’t know,” Bouchard said of the gunman’s motive.\n“When I got on scene I started to cry because I know what a splash pad is supposed to be."}, {"id": "ed1ad9d4-fa7c-4ad5-91e7-b9afedbd7a3f", "title": "Teenager on terror charges after stabbings at Sydney church denied bail", "date": "2024-06-17 14:00", "url": "http://www.myanmarmuslim.net/news/20240617792e599207.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosA judge has denied bail to a 15-year-old boy accused of being part of a network planning terrorist acts and who claimed to be a friend of another teenager charged with stabbing a Sydney bishop.\n“The messages clearly set up the young person wanting to do something catastrophic,” Mr Viney added.\nLater, the boy’s lawyer, Mr Dib, told reporters he would apply for bail to the New South Wales state Supreme Court.\nMr Viney said he had “no doubt” the parents were both loving and supportive of their son, and had confiscated his phone after becoming concerned by his behaviour.\n“They are genuinely shocked as to the charges he’s facing,” Mr Viney said."}, {"id": "50d09c7a-6f26-48aa-9656-ac1ab794b217", "title": "Houthis Say Attacked US Destroyer , 2 Ships in Red , Arabian Seas", "date": "2024-06-17 03:45", "url": "https://sputnikglobe.com/20240617/houthis-say-attacked-us-destroyer-2-ships-in-red-arabian-seas-1118991137.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240617/houthis-say-attacked-us-destroyer-2-ships-in-red-arabian-seas-1118991137.htmlHouthis Say Attacked US Destroyer, 2 Ships in Red, Arabian SeasHouthis Say Attacked US Destroyer, 2 Ships in Red, Arabian SeasSputnik InternationalYemen's Ansar Allah rebel movement, also known as the Houthis, said that it had attacked a US destroyer and two commercial vessels in the Red and Arabian Seas.\n2024-06-17T01:18+00002024-06-17T01:18+00002024-06-17T01:18+0000worldushouthisyemenred seaarabian seared sea crisishttps://cdn1.img.sputnikglobe.com/img/07e8/02/05/1116591744_0:0:2856:1608_1920x0_80_0_0_3eddb25ae6f1b155c41dedbac28b17c6.jpg\"The missile unit and naval forces of our Yemeni armed forces carried out two military operations in the Red Sea,\" Houthi military spokesman Yahya Saree said on Sunday.\nThe spokesman said that the Houthis fired missiles at a US destroyer and the Captain Paris vessel in the Red Sea.\nThe attacks prompted the United States to form a multinational coalition to protect shipping in the area, as well as to strike Houthi targets on the ground.\nhttps://sputnikglobe.com/20240607/houthis-vow-to-continue-targeting-us-carrier-group-after-unveiling-new-hypersonic-missile-1118852457.htmlyemenred seaarabian seaSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 602024Sputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Newsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Sputnik Internationalyemeni ansar allah, houthis, new houthis attack pn the us destroyer, us destroyer attack by houthi, houthi attacks"}, {"id": "b76371d0-adb3-4c8b-bbfc-2cf7f0aa18bb", "title": "Global defence groups hiring at fastest rate in decades amid record orders", "date": "2024-06-17 01:15", "url": "https://www.nzherald.co.nz/business/global-defence-groups-hiring-at-fastest-rate-in-decades-amid-record-orders/KJTQ2A446NGJPHYUNKDVDLK3JE/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "Photo / Sebastian Christoph Gollnow, dpa via APGlobal defence companies are recruiting workers at the fastest rate since the end of the Cold War as the industry seeks to deliver on order books that are near record highs.\n“Since the end of the cold war, this is the most intense period for the defence sector with the highest increase in order volume in a rather short period of time,” said Jan Pie, secretary-general of ASD, the European aerospace and defence trade association.\nGovernments around the world have ramped up military spending since Russia’s full-scale invasion of Ukraine and amid widespread geopolitical tensions.\nA man cleans his car in the city centre after a Russian missile attack in Kharkiv, Ukraine, on May, 25.\nThe hiring and training effort is “unprecedented in recent times”, said Beccy Pleasant at the Nuclear Skills Delivery Group, which forecasts that more than 30,000 additional roles will be needed in the nuclear defence sector between now and 2030."}, {"id": "0a3fd660-af52-45f7-ac6a-82fb1535ea46", "title": "Emhoff will speak at groundbreaking of the memorial for the Pittsburgh synagogue shooting victims", "date": "2024-06-17 14:00", "url": "https://www.wsls.com/news/politics/2024/06/17/emhoff-will-speak-at-groundbreaking-of-the-memorial-for-the-pittsburgh-synagogue-shooting-victims/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "FILE - Second gentleman Doug Emhoff speaks during a Jewish American Heritage Month event, May 20, 2024, in the Rose Garden of the White House in Washington.\nEmhoff will speak on June 22 at the groundbreaking of the memorial to victims of the 2018 Pittsburgh synagogue shooting.\n(AP Photo/Jacquelyn Martin, File)WASHINGTON – Doug Emhoff, the husband of Vice President Kamala Harris and the first Jewish person to serve as the spouse of a nationally elected U.S. leader, will deliver remarks on Sunday at the groundbreaking of the memorial to victims of the 2018 Pittsburgh synagogue shooting.\nThe space will include a new place of worship, a museum devoted to studying the hatred of Jews in the U.S. and a memorial to the victims.\nJosh Shapiro and CNN's Wolf Blitzer, who will serve as the ceremony's host."}, {"id": "07f21847-3b49-48ff-adee-e0f6af2b6bee", "title": "IDF announces pause to daytime fighting along southern Gaza humanitarian corridor", "date": "2024-06-17 06:45", "url": "https://www.yahoo.com/news/idf-announces-pause-daytime-fighting-050623159.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Israeli military on Sunday announced that there will be a daily daytime pause of fighting along a humanitarian corridor in southern Gaza.\nFile Photo by Hatem Al-Rawag/UPIJune 17 (UPI) -- The Israeli military will pause fighting during the day along an important humanitarian corridor in southern Gaza to facilitate aid efforts, the Israel Defense Forces said Sunday as it also warned Hezbollah against further attacking the Middle Eastern Country.\n\"We hope this leads to further concrete measures by Israel to address longstanding issues preventing a meaningful humanitarian response in Gaza,\" Laerke said.\nThe IDF was quick to add in a Hebrew-language statement published to its X account that the pause was not a cessation in southern Gaza fighting.\nIsrael has been waging war against Iran-backed Hamas in Gaza since the militia attack Israel on Oct. 7."}, {"id": "598b5717-20b2-42b1-8cbc-a1364a17086e", "title": "Hamas surprise attack out of Gaza stuns Israel and leaves hundreds dead", "date": "2024-06-17 00:15", "url": "http://www.myanmarmuslim.net/news/20240617027f599918.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "At least 198 people in the Gaza Strip have been killed and at least 1,610 wounded in Israeli strikes, the Palestinian health ministry said.\nHamas fighters took an unknown number of civilians and soldiers captive into Gaza, a deeply sensitive issue for Israel.\npic.twitter.com/USndH8HXNA — Prime Minister of Israel (@IsraeliPM) October 7, 2023Throughout the day, Hamas fired more than 3,500 rockets, the Israeli military said.\nPolitical commentators lambasted the government over its failure to anticipate what appeared to be a Hamas attack unseen in its level of planning and coordination.\nHamas’ military wing claimed it was holding dozens of Israeli soldiers captive in “safe places” and tunnels in the Gaza Strip."}, {"id": "6e3483a6-018f-4676-a8fa-e64cd035a6c5", "title": "Taiwan is not seeking war with China , defence minister says", "date": "2024-06-17 03:45", "url": "https://www.yahoo.com/news/taiwan-not-seeking-war-china-031055911.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Incoming Defence Minister Wellington Koo stands next to Taiwan President-elect Lai Ching-te while he speaks during a press conference, in TaipeiIncoming Defence Minister Wellington Koo stands next to Taiwan President-elect Lai Ching-te while he speaks during a press conference, in TaipeiTAIPEI (Reuters) - Taiwan is not seeking war with Beijing, and its policy is to build up a defensive, multi-level deterrence capability to make it harder for China to capture the island, Taiwan Defence Minister Wellington Koo said on Monday.\nDemocratically governed Taiwan, which China views as its own territory, has faced a stepped-up military and political pressure campaign from Beijing to accept sovereignty claims that the government in Taipei rejects.\nChina says Lai is a \"dangerous separatist\" who risks conflict by pushing for Taiwan's formal independence.\nKoo said it was China who is the \"trouble maker\" and provoker of tensions across the Taiwan Strait.\nKoo said the whole point of U.S. strategic ambiguity was to complicate China's plans for any invasion of Taiwan."}, {"id": "413f607e-0489-40e3-8c5a-430c527b6667", "title": "Taiwan is not seeking war with China , defence minister says", "date": "2024-06-17 03:45", "url": "https://gazette.com/news/us-world/taiwan-is-not-seeking-war-with-china-defence-minister-says/article_362df78a-b32b-5b8f-94c0-a418a30a68a5.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "TAIPEI (Reuters) - Taiwan is not seeking war with Beijing, and its policy is to build up a defensive, multi-level deterrence capability to make it harder for China to capture the island, Taiwan Defence Minister Wellington Koo said on Monday.\nDemocratically governed Taiwan, which China views as its own territory, has faced a stepped-up military and political pressure campaign from Beijing to accept sovereignty claims that the government in Taipei rejects.\nChina says Lai is a \"dangerous separatist\" who risks conflict by pushing for Taiwan's formal independence.\nKoo said it was China who is the \"trouble maker\" and provoker of tensions across the Taiwan Strait.\nKoo said the whole point of U.S. strategic ambiguity was to complicate China's plans for any invasion of Taiwan."}, {"id": "bc8ee6f4-793f-4337-b176-9bc4353c948c", "title": "US aircraft carrier counters false Houthi claims with  Taco Tuesday as deployment stretches on - Boston News , Weather , Sports", "date": "2024-06-17 12:00", "url": "https://whdh.com/news/us-aircraft-carrier-counters-false-houthi-claims-with-taco-tuesdays-as-deployment-stretches-on/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "ABOARD THE USS DWIGHT D. EISENHOWER IN THE RED SEA (AP) — The USS Dwight D. Eisenhower may be one of the oldest aircraft carriers in the U.S. Navy, but it’s still fighting — despite repeated false claims by Yemen’s Houthi rebels.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Hill said.\nAnd as far as the Houthi forces watching his postings, Hill takes special pleasure in writing about “Taco Tuesday” on the ship.\nThe carrier also has been the most-deployed carrier among the U.S.’s entire fleet over the last five years, according to an analysis by the U.S.\nBut Hill said his sailors remained ready to fight and he remained ready to continue to captain in his style."}, {"id": "064f6624-4441-4c69-9c50-8b3c92f28bcd", "title": "US aircraft carrier counters false Houthi claims with  Taco Tuesday  as deployment stretches on", "date": "2024-06-17 09:15", "url": "https://www.moneycontrol.com/news/world/us-aircraft-carrier-counters-false-houthi-claims-with-taco-tuesdays-as-deployment-stretches-on-12750256.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "185bbc26-8974-4ebd-aee8-8a53b3355f65", "title": "On board The USS Dwight D . Eisenhower : The aircraft carrier Houthi rebels claim to have sunk three times", "date": "2024-06-17 10:00", "url": "https://www.independent.co.uk/news/world/middle-east/uss-dwight-eisenhower-houthi-rebels-b2563788.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}The USS Dwight D. Eisenhower may be one of the oldest aircraft carriers in the US Navy, but it's still fighting, on the sea and online.\nThe carrier has been sunk three times according to false claims by Yemen's Houthi rebels.\nA fighter jet pilot maneuvers on the flight deck of the USS Dwight D. Eisenhower in the Red Sea on Tuesday, June 1 ( Copyright 2024 The Associated Press.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Hill said."}, {"id": "f989ec21-1b70-4847-bb0d-ca5d73c3d621", "title": "Monolith Wonder Woman Receives First Details Alongside Concept Art", "date": "2024-06-17 14:00", "url": "https://wccftech.com/monoliths-wonder-woman-details-art/", "domain": "wccftech.com", "domain_classification": "Unknown", "message": "Details about Monolith Productions' Wonder Woman game have surfaced alongside concept art.\nThe art and first details of the game 'leaked' through an online marketing survey, which was picked up by various outlets (including DSOGaming).\nAside from iconic DC characters, Wonder Woman will also introduce unique procedurally generated enemies and allies.\nAs this original Wonder Woman story unfolds, you must also repair your relationship with your mother, Queen Hippolyta, and your fellow Amazons who feel betrayed by your decision to leave Themyscira many years ago.\nLate last year, Warner Bros. did say that the game would be a single-player title, not designed for live service."}, {"id": "ccd65257-2b7d-49da-98f0-5c33d5e7e6a4", "title": "Henry Cavill is looking for tips on fatherhood", "date": "2024-06-17 10:45", "url": "https://www.cnn.com/2024/06/17/entertainment/henry-cavill-fathers-day-scli-intl/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —“Superman” star Henry Cavill has asked dads the world over for their advice as he and partner Natalie Viscuso prepare for the birth of their first child.\nCavill confirmed he and Viscuso (right) were expecting their first child back in April.\nCavill and Viscuso, a television executive, have been dating for several years.\nThe actor also recently admitted that he is not a fan of sex scenes, suggesting that graphic love scenes can sometimes feel gratuitous.\nAppearing on the podcast “Happy Sad Confused” in February, Cavill said he felt that intimate scenes are sometimes “overused.”"}, {"id": "f1edf452-6cd6-4708-a1f2-9a2ef4fc248d", "title": "House of the Dragon : All dragons and dragonriders", "date": "2024-06-17 03:15", "url": "https://www.polygon.com/23381183/house-dragon-all-dragons-riders-vhagar", "domain": "polygon.com", "domain_classification": "Unknown", "message": "House of the Dragon season 1 saw a lot of politicking.\nBut by the final episode, the dragons — and their use in the coming Dance of the Dragons — take center stage.\nAs we see in episode 10, even with the proper rider, dragon warfare can lead to calamitous consequences.\nSunfyreRider: Aegon TargaryenA bright-gold dragon with pink-membraned wings, Sunfyre is the dragon of Aegon Targaryen and a swift flier, though far from the biggest of the Targaryens’ remaining dragons.\nBecause of this, the dragon remains fairly small by the time House of the Dragon picks up with Jace."}, {"id": "e8098d25-e370-455d-850b-d329ea0e8d03", "title": "The Daily Heller : Vintage Japanese Infographics", "date": "2024-06-17 12:45", "url": "https://www.printmag.com/daily-heller/the-daily-heller-japanese-vintage-infographics/", "domain": "printmag.com", "domain_classification": "Unknown", "message": "Somehow, humanity purports to believe that war has rules of conduct, when the only rule (conventions to the contrary) is that there are no rules.\nOne such is this rare set of cautionary graphics, “National Air Defense Maps,” created by the Great Japan Air Defense Association during World War II to instruct civilians on how to safely behave during perilous times.\nThese graphics are not designed to make warfare more palatable, but to attract they eye and trigger sensitivity to lifesaving procedures.\nUnfortunately, the Japanese contribution to this ‘alternative’ history of graphic design has not been sufficiently appreciated to date.\nThis large-format (755 x 515 mm) publication, complete with all pages, from the Dainihon Bōkū Hōkokukai (Great Japan Air Defense Association) provides an important building block for this aspect of graphic design history."}, {"id": "09d28b4a-636c-4330-9239-ca094f4965bf", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-06-17 03:30", "url": "https://www.tvguide.co.uk/schedule/91b9e802-7ae2-5081-828f-31486e9a0725/combat-dealers", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Monday 17 June Share Add toCalendar +SAS Season 4 Episode 7 of 10 S SubtitlesA Hollywood blockbuster needs an authentic Second World War SAS jeep within two weeks.\nIt's a tight deadline but military equipment collector Bruce Crompton is determined to meet it, as the wartime SAS is a passion of hisCombat Dealers airs on Discovery Channel HD at 9:00 AM, Monday 17 June .\n(Subtitles.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual page"}, {"id": "8f9eb13b-f827-4ecc-ae94-50189493a1bd", "title": "US aircraft carrier counters false Houthi claims with  Taco Tuesday as deployment stretches on", "date": "2024-06-17 07:00", "url": "https://toronto.citynews.ca/2024/06/17/us-aircraft-carrier-counters-false-houthi-claims-with-taco-tuesdays-as-deployment-stretches-on/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "The Houthis and social media accounts supporting them repeatedly have claimed they hit or even sank the carrier in the Red Sea.\nOther than rust on its side from the hot, humid Red Sea air and water apparently leaking from a pipe in a dining room, the ship appeared no worse for wear.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Hill said.\n“My sailors, my ships are priceless — that’s not a calculus I want a captain to have,” said Capt.\nBut Hill said his sailors remained ready to fight and he remained ready to continue to captain in his style."}, {"id": "4c014dbd-3777-4c62-8da2-64c6d19ea0d7", "title": "US aircraft carrier counters false Houthi claims with  Taco Tuesday as deployment stretches on", "date": "2024-06-17 08:15", "url": "https://www.ivpressonline.com/news/world/us-aircraft-carrier-counters-false-houthi-claims-with-taco-tuesdays-as-deployment-stretches-on/article_6993c935-9dfd-5e32-b086-205138833530.html", "domain": "ivpressonline.com", "domain_classification": "Unknown", "message": "1371138342::cfb49c8e-2422-11e5-99a3-d7f5c6e8b241A weekly review of the best and most popular stories published in the Imperial Valley Press.\nAlso, featured upcoming events, new movies at local theaters, the week in photos and much more."}, {"id": "afb8e579-6fa0-4308-ad90-c4b7c14ef5f5", "title": "US aircraft carrier counters false Houthi claims with  Taco Tuesday as deployment stretches on", "date": "2024-06-17 06:30", "url": "https://www.mymotherlode.com/news/national/general-election/3376603/us-aircraft-carrier-counters-false-houthi-claims-with-taco-tuesdays-as-deployment-stretches-on.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "US aircraft carrier counters false Houthi claims with ‘Taco Tuesdays’ as deployment stretches on View PhotoABOARD THE USS DWIGHT D. EISENHOWER IN THE RED SEA (AP) — The USS Dwight D. Eisenhower may be one of the oldest aircraft carriers in the U.S. Navy, but it’s still fighting — despite repeated false claims by Yemen’s Houthi rebels.\nAfter one false Houthi claim, Hill responded by posting images of cinnamon rolls and muffins in the bakery on board the Eisenhower — a subtle jab at the claims.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Hill said.\nAnd as far as the Houthi forces watching his postings, Hill takes special pleasure in writing about “Taco Tuesday” on the ship.\nBut Hill said his sailors remained ready to fight and he remained ready to continue to captain in his style."}, {"id": "d9529244-11eb-4658-a3ad-2e884057317a", "title": "Ukrainian soldier captures four Russian troops in Donetsk Oblast", "date": "2024-06-17 11:45", "url": "https://www.yahoo.com/news/ukrainian-soldier-captures-four-russian-100708915.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A Ukrainian soldier belonging to one of the combat brigades of Ukraine's Armed Forces has recently single-handedly captured four Russian troops in Donetsk Oblast.\nIn particular, a Ukrainian soldier belonging to one of the combat brigades of the AFU has recently single-handedly captured four Russian occupiers in Donetsk Oblast.\nI thank him and all Ukrainian defenders, who take their duties responsibly, for their dedicated service!\"\nDetails: The General Staff of the AFU told Ukrainska Pravda that the soldier in question served with the Ground Forces.\nThe event took place in the area of responsibility of the Donetsk Operational Group of Ukrainian forces."}, {"id": "c4f2f09d-b236-4dd8-a99a-a9591e5466c1", "title": "  Bring It On !: House Of The Dragon Showrunner Talks That Bloody Second Season Premiere , And How Hell Handle Any Online Backlash", "date": "2024-06-17 14:00", "url": "https://www.cinemablend.com/interviews/bring-it-on-house-of-the-dragons-showrunner-talks-that-bloody-second-season-premiere-and-how-hell-handle-any-online-backlash", "domain": "cinemablend.com", "domain_classification": "Unknown", "message": "SPOILERS for the first episode of House of the Dragon Season 2 are ahead.\nWhen it comes to House of the Dragon, you know there is going to be a crazy amount of deaths.\nThe finale of House of the Dragon was released in 2022, signaling the start of the Targaryen Civil War, otherwise known as the Dance of Dragons.\nAnd yeah, it's really the catalyst for all the events that are going to follow in this season.\nHowever, it's nice to know that Condal is ready and waiting for any backlash he gets, so sharpen your pitchforks."}, {"id": "12917517-d180-490d-8fda-d6c294b2073c", "title": "North Korea hates the South propaganda loudspeakers . But how effective are they , really ? ", "date": "2024-06-17 04:00", "url": "https://www.scmp.com/news/asia/east-asia/article/3266853/north-korea-hates-souths-propaganda-loudspeakers-how-effective-are-they-really", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "South Korea resumed loudspeaker broadcasts directed at North Korea on June 9 for the first time since a now-defunct inter-Korean agreement banned them in 2018.\nThe loudspeakers deployed by South Korea to wage psychological warfare against North Korea have faced audits and legal battles claiming they are too quiet, raising questions over how far into the reclusive North their propaganda messages can blast.\n02:43 North Korean poop balloons and loudspeaker campaigns: how did the propaganda war start?\nNorth Korean poop balloons and loudspeaker campaigns: how did the propaganda war start?\nWhat appear to be North Korean loudspeakers are pictured from across the border in South Korea on June 11."}, {"id": "60951433-06ee-4046-8be8-ed3ec0d686d8", "title": "8 superhero games we wish were made ( and who could develop them ) ", "date": "2024-06-17 03:30", "url": "https://bamsmackpow.com/posts/superhero-games-we-wish-were-made-who-could-develop-them-01hzge7wrdhr", "domain": "bamsmackpow.com", "domain_classification": "Unknown", "message": "8 ways Marvel's Spider-Man 3 for PS5 can improve over the sequel.\n8 ways Marvel's Spider-Man 3 for PS5 can improve over the sequel"}, {"id": "4ce75b85-d026-44ba-811f-b8e28bae96c1", "title": "Henry Cavill seeks parenting tips on Father Day , shares picture of crib", "date": "2024-06-17 11:00", "url": "https://www.indiatoday.in/movies/hollywood/story/henry-cavill-seeks-parenting-tips-on-fathers-day-shares-picture-of-crib-2554151-2024-06-17", "domain": "indiatoday.in", "domain_classification": "Unknown", "message": "'Superman' actor Henry Cavill asked his fans for parenting tips in a heartwarming Father's Day post.\nThe British star, who is set to welcome his first child with his girlfriend, Natalie Viscuso, also shared a picture of himself with a crib on Sunday, June 16.\nIn the picture, Henry Cavill, 41, sought parenting tips from fans.\nIn April this year, Henry Cavil announced that he is expecting his first child with girlfriend Natalie Viscuso.\nMeanwhile, work-wise, Henry Cavill will be next seen in 'The Ministry of Ungentlemanly Warfare '."}, {"id": "e70f4c82-c3b3-42ff-8339-861278ffb143", "title": "Ukraine summit strives for consensus , way forward uncertain", "date": "2024-06-17 03:45", "url": "https://www.asiaone.com/world/ukraine-summit-strives-consensus-way-forward-uncertain", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "Over 90 countries attended the two-day talks at a Swiss Alpine resort at the behest of Ukrainian President Volodymyr Zelenskiy, billed as a \"peace summit\" even though Moscow was not invited.\n\"We are responding to Russia's full-scale invasion of Ukraine not only with a full-scale defence of human life, but also with full-scale diplomacy,\" Zelenskiy said.\nNo peace talks have been held for more than two years.\n[[nid:678352]]No country came forward to host another such meeting, with notable silence from Saudi Arabia, mooted as a possible future venue.\n\"Of course we...understand perfectly that a time will come when it will be necessary to talk to Russia,\" Ukrainian Foreign Minister Dmytro Kuleba said."}, {"id": "e76c29b3-2df6-400b-a915-2ed7839fecb0", "title": "defence firms : Israel defence exports hit record $13 . 1 billion in 2023", "date": "2024-06-17 12:15", "url": "https://economictimes.indiatimes.com/news/defence/israel-defence-exports-hit-record-13-1-billion-in-2023/articleshow/111061156.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "RECOMMENDED STORIES FOR YOU(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelIsraeli defence exports rose to a record $13.1 billion in 2023, a government report said on Monday, citing hundreds of contracts signed at various defence firms Some 36% of exports came from missile rocket and air defence systems , followed by radar and electronic warfare, weapon stations and launchers at 11% each, with crewed aircraft and avionics at 9%, the Defence Ministry said.Defence exports, which totalled $12.5 billion in 2022, have doubled over the past five years.The ministry said defence exports had become a central priority as part of an effort to strengthen security-strategic relations worldwide, enter new markets, remove bureaucratic barriers and reduce regulation.\n\"While our industries are primarily focused on providing the defence establishment with the capabilities to support our troops and defend our citizens .\nThey are also continuing to pursue areas of cooperation and exports to international partners,\" said Defence Minister Yoav Gallant"}, {"id": "d7bd2938-acb0-4318-9e0b-18605c08d5e7", "title": "Sean Parnell :  Vindicated  By  Family Court System  After Custody Battle", "date": "2024-06-17 05:00", "url": "https://www.breitbart.com/politics/2024/06/16/sean-parnell-fathers-day-vindicated-family-court-system-custody-battle/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Sean Parnell, a former senatorial and congressional candidate in Pennsylvania, revealed in a Father’s Day update that he has been “vindicated” by the “family court system” after a custody battle with his ex-wife.\n“On this Father’s Day, I wanted to share a significant personal update,” Parnell began.\n“After enduring two challenging years of navigating the hellscape that is our family court system I have been vindicated.\nAfter enduring two challenging years of navigating the hellscape that is our family court system I have been vindicated.\nAs a father in family court the deck will always be stacked against you."}, {"id": "d05229e6-2c39-4d32-a40d-9226405a8b4a", "title": "Denmark developing measures to curb oil transport by Russia shadow fleet", "date": "2024-06-17 11:45", "url": "https://www.yahoo.com/news/denmark-developing-measures-curb-oil-084859676.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Source: European Pravda, citing the minister's interview with Danish news outlet Information and DanwatchQuote: \"Denmark has gathered a group of countries to consider further measures against the shadow fleet.\nDetails: Rasmussen did not elaborate on what the new measures would entail but added that he \"takes the problem of the shadow fleet very seriously\".\nOutdated oil tankers make up Russia's so-called shadow fleet, which it uses to circumvent sanctions on oil exports.\nRasmussen did not disclose what countries would try to curb the shadow fleet.\nPrior to that, media reports indicated that there were still disagreements among EU countries over measures targeting Russia's so-called \"shadow fleet\", which consists of semi-legal oil tankers."}, {"id": "12b6c2e9-03eb-4dc4-aae6-b54ebb662a61", "title": "Jabalia showdown : IDF paratroopers clash with Hamas in unconquered stronghold", "date": "2024-06-17 00:00", "url": "https://www.ynetnews.com/magazine/article/byan3ynbc", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "At 18:45 comes the pinnacle of the day’s battle as a huge blast shakes the Jabaliya refugee camp.\nAs in any neighborhood IDF ground operates, the water and electricity systems were cut off as soon as the Jabaliya refugee camp was occupied.\nThe IDF announced in December that Southern Command’s 162nd Division had completed its ground operations by defeating Hamas’ Jabaliya battalion and that the forces left had taken operational control of the city.\nHamas terrorists also eat the displaced people’s food.\nThe last of the soldiers pulled out last Thursday, completing three weeks of the IDF’s first operation in the Jabaliya refugee camp."}, {"id": "c36d02bf-78bb-419a-a279-4760f1a1e0c2", "title": "Ukraine to get German - made  Frankenstein  tank", "date": "2024-06-17 11:45", "url": "https://www.yahoo.com/news/ukraine-german-made-frankenstein-tank-105144931.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A mocked-up image showing how the new 'Frankenstein' tank will probably look - RheinmetallA new “Frankenstein” air defence tank designed to shoot down Russian drones and missiles is to be supplied to Ukraine by a top German arms firm.\nRheinmetall has announced it will mount its state-of-the-art Skyranger anti-aircraft system on Cold War-era Leopard 1 tank hulls, creating a new vehicle to bolster Ukraine’s defences.\nBack into actionBy repairing the vehicles in Ukraine, the company hopes to cut the time it takes to get tanks back into action.\nAt first, only Marder armoured vehicles and the older version of the Leopard tank will be repaired at the factory.\nBut the company has said that it wants to repair more modern Leopard 2 tanks inside Ukraine as well."}, {"id": "31fbb245-0d08-442a-846c-34e1089ad782", "title": "Sanctifying the profane : the Russian Orthodox Church at the front", "date": "2024-06-17 09:15", "url": "https://globalvoices.org/2024/06/17/sanctifying-the-profane-the-russian-orthodox-church-at-the-front/", "domain": "globalvoices.org", "domain_classification": "Unknown", "message": "Kirill Shamiev and Ksenia Luchenko, both Visiting Fellows at the European Council on Foreign Relations, wrote for the Russia Post about the role of the Russian Orthodox Church in Putin’s regime and the full-scale Invasion of Ukraine.\nThe Russian Orthodox Church has actively participated in Russia’s full-scale war against Ukraine since the very beginning.\nChurch TV channels — the Moscow Patriarchate’s widely watched Spas and the Orthodox “patriotic” channel Tsargrad — stress the sanctity of the war.\nVasiliev had served in the town’s church for over 20 years and was close to the military leadership stationed there.\nHe also claimed that about 100 Orthodox priests were on the front line every day, many of them not for the first time."}, {"id": "9d9be662-571d-4b60-86c3-754265bcef02", "title": "Between hollow rhetoric and war : how sanctions work – and why they often dont | US foreign policy", "date": "2024-06-17 00:15", "url": "https://www.theguardian.com/us-news/article/2024/jun/17/between-hollow-rhetoric-and-war-how-sanctions-work-and-why-they-often-dont", "domain": "theguardian.com", "domain_classification": "International", "message": "It was known as the Megarian decree, and it was arguably the first recorded case of economic sanctions.\nThe Peloponnesian war, pitting Athens against Sparta, erupted a year later, and some ancient historians believe it was triggered by the Megarian sanctions.\nThe current thicket of western sanctions on Russia are a clear failure in those terms.\nUS-led sanctions were also instrumental in persuading Tehran to the negotiating table to accept significant limitations on its nuclear programme in return for sanctions relief.\n“Biden came in saying there is going to be a review of the use of sanctions and we are going to be far more judicious about using them, and Biden winds up using sanctions more than any other president.”"}, {"id": "4cf53756-0eb0-4b2a-8e70-f00fd135d204", "title": "Ukraine summit strives for consensus , way forward uncertain", "date": "2024-06-17 12:15", "url": "https://www.stabroeknews.com/2024/06/17/news/world/ukraine-summit-strives-for-consensus-way-forward-uncertain/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "Over 90 countries attended the two-day talks at a Swiss Alpine resort at the behest of Ukrainian President Volodymyr Zelenskiy, billed as a “peace summit” even though Moscow was not invited.\n“We are responding to Russia’s full-scale invasion of Ukraine not only with a full-scale defense of human life, but also with full-scale diplomacy,” Zelenskiy said.\nNo peace talks have been held for more than two years.\nNo country came forward to host another such meeting, with notable silence from Saudi Arabia, mooted as a possible future venue.\n“Of course we…understand perfectly that a time will come when it will be necessary to talk to Russia,” Ukrainian Foreign Minister Dmytro Kuleba said."}, {"id": "12490871-e37f-440d-8798-58306bcf9133", "title": "US military seizes Iranian missile parts bound for Houthi rebels", "date": "2024-06-17 12:00", "url": "http://www.myanmarmuslim.net/news/20240617152b599791.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosUS Navy Seals seized Iranian-made missile parts and other weaponry from a ship bound for Yemen’s Houthi rebels in a raid last week in which two commandos went missing, the US military said on Tuesday.\nThe seized missile components included types likely to have been used in those attacks.\nThe Seals found cruise and ballistic missile components, including propulsion and guidance devices, as well as warheads, Central Command said.\nA United Nations resolution bans arms transfers to Yemen’s Iranian-backed Houthi rebels.\nTehran has long denied arming the rebels, despite physical evidence, numerous seizures and experts tying the weapons back to Iran."}, {"id": "3f633662-5756-4795-93d7-998bd5fabeec", "title": "South Korea loudspeakers face questions over reach into North", "date": "2024-06-17 03:00", "url": "https://www.moneycontrol.com/news/world/south-koreas-loudspeakers-face-questions-over-reach-into-north-12750048.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "d767e434-b6f1-458f-897f-7ff5bcab6a47", "title": "South Korea loudspeakers face questions over reach into North", "date": "2024-06-17 03:45", "url": "https://www.asiaone.com/asia/south-koreas-loudspeakers-face-questions-over-reach-north", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "SEOUL - The loudspeakers deployed by South Korea to wage psychological warfare against North Korea faced audits and legal battles claiming they are too quiet, raising questions over how far into the reclusive North their propaganda messages can blast.\nSouth Korea resumed loudspeaker broadcasts directed at North Korea on June 9 for the first time since a now-defunct inter-Korean agreement banned them in 2018.\nMr Kim Sung-min, who defected from the North in 1999 and runs a Seoul radio station that broadcasts news into North Korea, said the mountainous border terrain and North Korea's own loudspeakers in the area further diminish the reach of South Korea's psychological warfare.\nNorth Korea's broadcasts are less aimed at winning over people in the South and more at \"suppressing\" the South's broadcasts by overpowering or muddling the message, he said.\n[[nid:689268]]At least two North Korean soldiers from the frontlines defected to the South in 2017 after listening to loudspeaker broadcasts, local media reported, citing South Korean officials."}, {"id": "968b7eb5-9078-4beb-8576-b47e0d8cde9c", "title": "Jacobite pistol  taken as Culloden spoil of war  to be auctioned", "date": "2024-06-17 10:15", "url": "https://www.heraldscotland.com/news/24391657.jacobite-pistol-taken-culloden-spoil-war-auctioned/", "domain": "heraldscotland.com", "domain_classification": "Unknown", "message": "It bears two engraved panels – one stating 'Taken at the Battle of Colloden [sic]', and the other Rich-Vyse-C--nt / R.D.T'.\nRe-enactors re-fight the Battle of Culloden (Image: NQ)Vyse had a long and successful career in the British army, beginning as a cornet in the 5th Dragoons on 13 February 1762.\nREAD MORE: The 'biggest myth about the Jacobites' and the propaganda warThe pistol has been in the same family since the early 1960s.\nIt may be a coincidence, but the pistol was acquired by our family in the same year.\n\"This is of particular significance as one of the most recounted stories of the Jacobite charge at Culloden is the wounding of Donald Cameron of Lochiel, known as ‘The Gentle Lochiel’."}, {"id": "eac0f3cb-3469-46f3-9ddc-0b583cfb39e9", "title": "South Korea loudspeakers face questions over reach into North", "date": "2024-06-17 03:30", "url": "https://www.stripes.com/theaters/asia_pacific/2024-06-16/south-korea-loudspeakers-north-14204857.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "South Korean soldiers work next to a military facility (Green box) where loudspeakers dismantled in 2018 used to be, near the demilitarized zone separating the two Koreas in Paju, South Korea, June 10, 2024.\nSouth Korea resumed loudspeaker broadcasts directed at North Korea on June 9 for the first time since a now-defunct inter-Korean agreement banned them in 2018.\nKim Sung-min, who defected from the North in 1999 and runs a Seoul radio station that broadcasts news into North Korea, said the mountainous border terrain and North Korea’s own loudspeakers in the area further diminish the reach of South Korea’s psychological warfare.\nNorth Korea’s broadcasts are less aimed at winning over people in the South and more at “suppressing” the South’s broadcasts by overpowering or muddling the message, he said.\nAt least two North Korean soldiers from the frontlines defected to the South in 2017 after listening to loudspeaker broadcasts, local media reported, citing South Korean officials."}, {"id": "32a248d9-5d7f-41c6-968d-50f664c49c23", "title": "Re : Western media language , narrative erase Israel responsibility , – Palestinian - American journalist – Middle East Monitor |", "date": "2024-06-17 03:15", "url": "http://www.huewire.com/re-western-medias-language-narrative-erase-israel-responsibility-palestinian-american-journalist-middle-east-monitor-2/", "domain": "huewire.com", "domain_classification": "Unknown", "message": "It’s the bias these outlets it like in Germany, the non-commercial TV-Stations had ruled as theirprinciples of news reporting had circulated as an policy paper, of how to report and naming and framing, of the ongoing warfare waged in the occupied palestinian territories, between Israeli military forces and regional militia groups of armed palestinian fighters (Named as terrorist groups) is done, in these TV Stations, so right from the beginning of this war, it was a the: Good and Evil, attacks and killings which got applied by this agreement for the editing and creating of reports, to differentiate military actions by allies in the region, or of those who they feel more alienated, to their situation, the suffering and their armed fightings against the Israeli military forces.\nSource link"}, {"id": "28177ae1-1506-4663-91a8-f619c6fd2c95", "title": "HAL receives RFP from Defence Ministry for procurement of 156 Light Combat Helicopters", "date": "2024-06-17 12:15", "url": "https://economictimes.indiatimes.com/news/defence/defence-ministry-issues-request-for-proposal-for-procurement-of-156-light-combat-helicopters/articleshow/111060293.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelIn a bid to push aatmanirbharta in the defence sector, Hindustan Aeronautics on Monday announced that the Defence Ministry has issued a Request for Proposal (RFP) for 156 Light Combat Helicopters.\n\"We would like to inform that, Request for Proposal (RFP) has been issued by the Ministry of Defence for procurement of 156 Light Combat Helicopter ,\" the official statement of the company said.Of the 156 LCH requested by the Defence Ministry, 90 are being procured for the Indian Army (IA) while the remaining 66 are for the Indian Air Force (IAF), said HAL 's official statement.\nThe tender is expected to be worth over Rs 45,000 crore with helicopters to be acquired by the Indian Air Force and Indian Army.Earlier, Defence Ministry Rajnath Singh after assuming charge again for the second straight time announced that the aim will be to further strengthen the security apparatus of the country, with focus on achieving self-reliance in defence manufacturing.\n\"Armed Forces modernisation and the welfare of the soldiers, both serving and retired, will continue to be our main focus,” he said.The LCH, also known as Prachand, has similarities with the Advanced Light Helicopter Dhruv.\nAdditionally, the helicopter can also be used against slow-moving aircraft and remotely piloted aircraft (RPAs) of adversaries.Several key aviation technologies like a glass cockpit and composite airframe structure have been indigenised."}, {"id": "d95f1726-36a0-408e-be97-abcebebd735b", "title": "Chael Sonnen Ready To Fight  Overrated  Jorge Masvidal In A Boxing Match", "date": "2024-06-17 00:00", "url": "https://www.lowkickmma.com/chael-sonnen-fight-overrated-jorge-masvidal/", "domain": "lowkickmma.com", "domain_classification": "Unknown", "message": "Blasting Jorge Masvidal for his foolish business practices and claiming he couldn’t remember the last time Masvidal won a fight.\nChael Sonnen Speaks on Looming Jorge Masvidal Fight“This whole thing was just part of the process,” Chael Sonnen began, speaking on the Anderson Silva fight (H/T MMA Fighting).\n“I’m boxing Jorge Masvidal.\n“Masvidal’s a little bit overrated, in all fairness, within his own mind,” Chael Sonnen said.\n“It just keeps getting worse for Jorge Masvidal."}, {"id": "e6447c3f-1762-4d6d-9fb2-43659b0fc36e", "title": "Monolith Wonder Woman Game Details Have Leaked", "date": "2024-06-17 14:00", "url": "https://gameranx.com/updates/id/501374/article/monoliths-wonder-woman-game-details-have-leaked/", "domain": "gameranx.com", "domain_classification": "Unknown", "message": "It looks like a Nemesis game will be playable to younger gamers for the first time.\nSome details for Monolith’s Wonder Woman game seem to have leaked.\nHere’s the text of the description:“You are Wonder Woman in this single-player action-adventure game developed by Monolith Productions.\nGiven the DMCAs from WB Games, the publisher inadvertently confirmed that this leak is real.\nWe hope that WB Games also has a trailer reveal scheduled very soon."}, {"id": "09bc932a-bf06-4f22-b12e-a72a5aea28c2", "title": "The war between Russia and Ukraine is set to grind on as a diplomatic conference packs little punch – Winnipeg Free Press", "date": "2024-06-17 12:45", "url": "https://www.winnipegfreepress.com/world/2024/06/17/the-war-between-russia-and-ukraine-is-set-to-grind-on-as-a-peace-conference-packs-little-punch", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Ukrainian President Volodymyr Zelenskyy walks during the Summit on peace in Ukraine, in Obbürgen, Switzerland, Sunday, June 16, 2024.\nZelenskyy has previously presented a 10-point peace formula that, among other things, demands the expulsion of all Russian forces from Ukraine and accountability for war crimes.\nUkrainian President Volodymyr Zelenskyy, centre, and Fiji's President Wiliame Maivalili Katonivere walk during the Summit on peace in Ukraine, in Obbürgen, Switzerland, Sunday, June 16, 2024.\nThat means the Kremlin’s forces have difficulty generating momentum at scale, allowing Ukraine to hold them to incremental gains for now.\n___Follow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine"}, {"id": "e83f649f-592b-45a0-941f-92ddcf10648b", "title": "Russia Sets Closed Espionage Trial for US Reporter Gershkovich", "date": "2024-06-17 14:00", "url": "https://www.theepochtimes.com/world/russia-sets-closed-espionage-trial-for-us-reporter-gershkovich-5669897", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "MOSCOW—Russia’s espionage trial of detained Wall Street Journal reporter Evan Gershkovich, who denies charges of collecting secrets for the Central Intelligence Agency (CIA), will be held behind closed doors, the trial court said on Monday.\nThe first American journalist to be detained on spy charges in Russia since the Cold War more than three decades ago, Mr. Gershkovich has repeatedly denied the charges.\nThe Journal says that Mr. Gershkovich was doing his job and denied he was a spy.\nRussia said Mr. Gershkovich was caught “red-handed.” President Vladimir Putin has said there has been contact with Washington about potentially swapping Mr. Gershkovich but that such negotiations should be held away from the media.\nMr. Putin suggested in February that Mr. Gershkovich could be swapped."}, {"id": "f3401e91-d968-42e6-96c7-cddb409783d3", "title": "Online rumours of civil war in Philippines tied to China covert agenda", "date": "2024-06-17 11:45", "url": "https://www.scmp.com/week-asia/politics/article/3266870/online-rumours-civil-war-philippines-tied-chinas-covert-agenda", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "A recent surge of online rumours about civil war in the Philippines may be linked to China’s attempts to manipulate public opinion amid the South China Sea conflict, reflecting Beijing’s broader disinformation tactics and strategic goals.\nPhoto: APWithin days, more than 60 social media accounts posted about Mindanao’s “independence campaign”, fuelling speculation of conflict and blaming President Ferdinand Marcos Jnr ’s “pro-United States” policy for the rift, the Philippine Star reported.\n“Its excessive claims in the South China Sea, its Belt and Road Initiative, among others, are part of this goal.\nNormally, Beijing resorts to blame-shifting, such as blaming the [Philippines’ coastguard] for the water cannon and collision incidents ,” he said.\nMore importantly, Beijing’s media mouthpieces, like the Global Times and the China Daily, conveniently parrot such narratives."}, {"id": "25d43fb5-b376-41a1-86aa-6d35edd7d6bb", "title": "  Undercover Agents Walked Down The Gazan Street As If It Was Tel Aviv  – The Yeshiva World", "date": "2024-06-17 12:15", "url": "https://www.theyeshivaworld.com/news/israel-news/2290533/undercover-agents-walked-down-the-gazan-street-as-if-it-was-tel-aviv.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Within three hours, the locals helped them find a large house to rent on the street where Argamani was being held.\nOne team consisted of two commandos disguised as a typical Gazan couple – the woman dressed in a long black dress and hijab.\nThe couple walked down the street “with complete confidence as if they were walking down a street in Tel Aviv.\nBehind them walked four more undercover men armed to give them backup.”Five additional undercover officers remained at the rental house as backup.\nOn June 5th, the undercover team still in Nuseirat was instructed to leave the area without arousing suspicion."}, {"id": "485ec972-ecf9-4757-a203-a974df282023", "title": "Lesotho : MP Backs Call for State of Emergency to End Famo Killings", "date": "2024-06-17 13:00", "url": "https://allafrica.com/stories/202406170272.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "Mr Makhalanyane told the Lesotho Times this week that a state of emergency could be the required solution to empower law enforcement agencies to sweep out the famo gangs.\nMr Makhalanyane encouraged the government to declare a state of emergency for a designated period to enable law enforcement agencies to focus on rooting out the famo gangs.\n\"A week after the legal notice criminalising famo gangs was released, people were killed at different places.\nHe said criminalising famo gangs might have made it more difficult for members of the famo gangs to freely come to the table for fear of being arrested.\nMr Sekonyela said the task team had failed to submit any report regarding the task it had been given."}, {"id": "6fe3fe4c-6267-4735-b657-86017df8fa70", "title": "More than 80 nations back talks to ease path to peace in Ukraine", "date": "2024-06-17 03:30", "url": "https://www.bostonglobe.com/2024/06/16/world/more-than-80-nations-back-talks-ease-path-peace-ukraine/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "But Zelensky has long argued that a lasting peace in Ukraine can be achieved only with Russia’s full withdrawal.\nUkraine’s Western allies have said little about possible peace talks with Russia.\nAdvertisementSuch talks, he said, would build on the gathered nations’ endorsement of “the notion of sovereignty and territorial integrity” outlined in the United Nations Charter.\nTo end the war, diplomatic backing could strengthen Ukraine’s hand in eventual peace talks.\nHe said Ukraine was already in talks with countries that had indicated an interest in hosting such a meeting."}, {"id": "d49022e0-8695-4270-bfb2-76660093c841", "title": "Netanyahu criticizes military plans for 11 - hour daily pauses in fighting", "date": "2024-06-17 00:15", "url": "https://www.foxnews.com/us/israeli-prime-minister-netanyahu-criticizes-militarys-plans-daily-pauses-fighting", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu was critical of plans announced Sunday by his military to hold 11-hour pauses in fighting along a main road into Gaza to facilitate getting aid into the bomb-stricken area.\nReuters reported that the Israeli military announced daily pauses in battle from 5 a.m. to 4 p.m. local time between Kerem Shalom Crossing and Salah al-Din Road, then northwards.\nISRAELI WAR CABINET MINISTER BENNY GANTZ QUITS NETANYAHU'S EMERGENCY GOVERNMENTNetanyahu’s reaction highlights heightened political tensions over aid being delivered into Gaza, where international groups have warned of a growing humanitarian crisis.\nBBC ANCHOR ASKS IF ISRAELI FORCES WARNED PALESTINIANS AHEAD OF HOSTAGE RESCUE MISSION: DEFEATS ‘THE PURPOSE’Last Sunday, Israeli war cabinet minister Benny Gantz quit Netanyahu’s emergency government, saying the prime minister was making \"total victory impossible.\"\n\"Months after the October disaster, the situation in the country and in the decision-making cabinet has changed,\" Gantz added."}, {"id": "7e830fd2-8351-41bd-8b5d-1cd4d9b74aaf", "title": "Israeli High Court suspends State Comptroller probe Into October 7 failures", "date": "2024-06-17 10:30", "url": "https://news.webindia123.com/news/Articles/World/20240617/4206501.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "The comptroller, also known as the state ombudsman, periodically releases reports auditing Israeli preparedness and the effectiveness of government policies.\nIn May, High Court Justice Gila Canfy-Steinitz ruled against stopping the State Comptroller's probe.\nEnglman's probe was also opposed by Israel Defense Forces Chief of Staff Lt. Gen. Herzi Halevi as well as the State Attorney's office.\nA separate independent commission of inquiry with a broader mandate including political failures is expected to take place after the war.\nSuch commissions have broader authority to summon witnesses and collect evidence, and are headed by a senior Supreme Court justice."}, {"id": "203eeeb0-cdb9-4707-9d8f-0de4339507c0", "title": "Lull in Gaza fighting as Biden urges truce in Eid message - World", "date": "2024-06-17 11:45", "url": "https://www.brecorder.com/news/40308803/lull-in-gaza-fighting-as-biden-urges-truce-in-eid-message", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "GAZA STRIP: Israel struck Gaza on Monday and witnesses reported blasts in the besieged territory’s south, but fighting has largely subsided after a day of relative calm and as Muslims marked Eid al-Adha.\nBlinken urges Middle East leaders to press Hamas for Gaza ceasefireOn Sunday, the first day of Eid al-Adha, or the feast of the sacrifice, the spokesman said “calm has prevailed across all of Gaza”.\nEgyptian, Qatari and US mediators have been pushing for a new Gaza truce, so far without success.\nWashington has been pressing Israel and Hamas to formally accept Biden’s truce plan, which would allow an initial six-week pause to fighting.\nHamas has insisted on the complete withdrawal of Israeli forces from Gaza and a permanent ceasefire – demands Israel has repeatedly rejected."}, {"id": "5ef0b866-0283-431c-8544-efd3677a2781", "title": "US military : Is there a draft in 2024 ? ", "date": "2024-06-17 03:30", "url": "https://www.fox4news.com/news/military-defense-bill-draft-2024", "domain": "fox4news.com", "domain_classification": "Unknown", "message": "While there isn't currently a draft in place, Congress and the president can reinstate the draft and force male citizens to serve in the military in the event of a national emergency or war that all-volunteer military can't adequately support.\nRELATED: US military draft: What you need to knowHere's what you need to know about the military draft.\nThe military draft - officially known as the Selective Service System - requires nearly all male U.S. citizens and male immigrants ages 18 to 25 to register with the government, in accordance with federal law.\nAccording to the Selective Service, the draft, if implemented, would have similarities to that of the Vietnam War.\nIn the event a national emergency required a draft, the Selective Service has protocol in place for when that happens."}, {"id": "0e14cf2a-ddb9-40bf-a9dc-49c4a63bc812", "title": "Lull in Gaza fighting as Biden urges truce in Eid message", "date": "2024-06-17 10:15", "url": "https://www.al-monitor.com/originals/2024/06/lull-gaza-fighting-biden-urges-truce-eid-message", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "He reported military movements and gunfire in parts of Rafah as well as Bureij camp in central Gaza.\nOn Sunday, the first day of Eid al-Adha, or the feast of the sacrifice, the spokesman said \"calm has prevailed across all of Gaza\".\nEgyptian, Qatari and US mediators have been pushing for a new Gaza truce, so far without success.\nWashington has been pressing Israel and Hamas to formally accept Biden's truce plan, which would allow an initial six-week pause to fighting.\nHamas has insisted on the complete withdrawal of Israeli forces from Gaza and a permanent ceasefire -- demands Israel has repeatedly rejected."}, {"id": "36c86b56-d9f8-46d2-8e51-e39d743eeac0", "title": "  House of the Dragon  Character Scorecard : Season 2 Premiere", "date": "2024-06-17 03:30", "url": "https://www.vulture.com/article/house-of-the-dragon-season-2-premiere-characters-ranking-scorecard.html", "domain": "vulture.com", "domain_classification": "Unknown", "message": "Rhaenyra and Alicent grieve and contemplate and try to prevent the men in their lives from setting the world on fire.\nSo let’s assess our most and least valuable players as the Dance of the Dragons kicks off in earnest.\n— Tries to have his chaotic counterpart killed but hires two idiots who mess it up and kill someone else.\nThink about it all for a second: His son married Rhaenyra and then “died” — a faked death, but still — under mysterious circumstances.\nBut I’m going to go with “the instant he kicked the dog.”Did I think it was going to escalate from there straight to beheading a child in front of his mother?"}, {"id": "8d06ca2c-a93b-4552-b272-ecb788af0a93", "title": "S . Korea , China to hold  2+2  diplomatic security talks on Tuesday", "date": "2024-06-17 12:00", "url": "https://www.prokerala.com/news/articles/a1540107.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "The South Korea-China diplomatic and security dialogue will take place in Seoul on Tuesday, led by First Vice Foreign Minister Kim Hong-kyun and Chinese Vice Foreign Minister Sun Weidong, Seoul's Foreign Ministry said.\nThe talks draw attention as they will likely coincide with Putin's visit to North Korea widely expected to take place from Tuesday through Wednesday.\nSouth Korea responded by resuming the propaganda loudspeaker broadcasts toward North Korea.\nThe current security landscape and developments on and around the Korean Peninsula will likely be high on the agenda at Tuesday's talks.\nThe previous talks took place among the director generals in 2013 and 2015."}, {"id": "8dd690a8-536d-4460-be26-2a1e4484187a", "title": "The Challenge spoilers : All Stars 5 teams revealed for unique spinoff theme", "date": "2024-06-17 03:00", "url": "https://www.monstersandcritics.com/tv/reality-tv/the-challenge-spoilers-all-stars-5-teams-revealed-for-unique-spinoff-theme/", "domain": "monstersandcritics.com", "domain_classification": "Unknown", "message": "As The Challenge: All Stars 4 final is airing on Paramount+, the fifth season of the spinoff show is filming in Vietnam.\nAs spoilers revealed, it features a departure from the traditional MTV OG cast the first four seasons had.\nThis report will contain spoilers for The Challenge: All Stars 5, set to air on Paramount+ later.\nAll Stars 5 has 26 cast members and a theme similar to the previous Rivals installments of MTV’s The Challenge.\nAs of this writing, The Challenge: All Stars 5 is only known to be filming through online spoilers from insiders."}, {"id": "367f902d-4eed-42c5-8c64-aa0903425d06", "title": "The war between Russia and Ukraine is set to grind on as a diplomatic conference packs little punch | iNFOnews", "date": "2024-06-17 12:45", "url": "https://infotel.ca/newsitem/eu-russia-ukraine-war/cp957260031", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "The war between Russia and Ukraine is set to grind on as a diplomatic conference packs little punchUkrainian President Volodymyr Zelenskyy, centre, and Fiji's President Wiliame Maivalili Katonivere walk during the Summit on peace in Ukraine, in Obbürgen, Switzerland, Sunday, June 16, 2024.\nIt did not resolve the bedrock — and seemingly intractable, for now — issue: Ukrainian land occupied by invading Russian forces.\nZelenskyy has previously presented a 10-point peace formula that, among other things, demands the expulsion of all Russian forces from Ukraine and accountability for war crimes.\nThat means the Kremlin’s forces have difficulty generating momentum at scale, allowing Ukraine to hold them to incremental gains for now.\n___Follow AP’s coverage of the war in Ukraine at https://apnews.com/hub/russia-ukraine"}, {"id": "f727ee30-d89c-46d2-8de3-01bd0aa20dec", "title": "IAF contingent participates in Exercise Red Flag 2024 at Alaska", "date": "2024-06-17 00:15", "url": "https://news.webindia123.com/news/Articles/India/20240617/4206385.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "An Indian Air Force (IAF) contingent participated in Exercise Red Flag 2024, conducted at Eielson Air Force Base, Alaska, of the United States Air Force, from June 4 to June 14, the Ministry of Defence said in a release on Sunday.\nThis was the second edition of Exercise Red Flag 2024, which is an advanced aerial combat training exercise held four times a year by the US Air Force.\nAccording to the release, the exercise witnessed the participation of the Indian Air Force along with the Republic of Singapore Air Force (RSAF), Royal Air Force (RAF) of the United Kingdom, Royal Netherlands Air Force (RNLAF), German Luftwaffe, and the US Air Force (USAF).\nRed Flag is an air combat exercise conducted with multiple scenarios designed to provide realistic combat settings.\nEnriched with the Red Flag exercise experience, the IAF keenly looks forward to hosting the participating contingents from other countries during Ex-Tarang Shakti-2024, which is the first-ever Indian multinational air exercise to be held later this year, the release added."}, {"id": "38278bf9-8fce-428b-a9aa-84d433fc496a", "title": "Russia sets closed espionage trial for US reporter Gershkovich", "date": "2024-06-17 09:30", "url": "https://www.swissinfo.ch/eng/russia-sets-closed-espionage-trial-for-us-reporter-gershkovich/80921797", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Russian espionage trial of US reporter Gershkovich to be closed to publicreuters_tickers3 minutesBy Guy FaulconbridgeMOSCOW (Reuters) – Russia will hold the espionage trial of detained U.S. reporter Evan Gershkovich, who denies charges of collecting secrets for the Central Intelligence Agency (CIA), behind closed doors later this month, a court in the city of Yekaterinburg said on Monday.\nGershkovich, the first American journalist to be detained on spy charges in Russia since the Cold War over three decades ago, denies the charges.\nThe FSB, the main successor to the Soviet-era KGB, said that Gershkovich was trying to collect secrets about Uralvagonzavod, a powerful Russian defence enterprise which is one of the world’s biggest battle tank producers.\nThe Wall Street Journal and Dow Jones say that Gershkovich was simply doing his job in Russia and deny the espionage charges.\nGershkovich has appealed against his detention several times, appearing in the glass cages used for suspects in Russian courts."}, {"id": "1c4c5a6b-1dbc-49db-a44a-eb8d5fbf1833", "title": "PD : Motorcyclist dies after crashing into curb in Battle Creek", "date": "2024-06-17 03:45", "url": "https://www.yahoo.com/news/pd-motorcyclist-dies-crashing-curb-013310630.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "PD: Motorcyclist dies after crashing into curb in Battle CreekBATTLE CREEK, Mich. (WOOD) — The driver of a motorcycle died Sunday afternoon after crashing, according to police.\nAround 3 p.m., Battle Creek Police were called to the intersection of Beckley Road and Helmer Road S for a crash.\nOfficers found that the driver, a 36-year-old woman, was headed south on Helmer Road, turning left onto eastbound Beckley Road when she hit the southside curb of Beckley.\nShe was taken to the hospital but died in the ambulance while enroute, according to police.\nFor the latest news, weather, sports, and streaming video, head to WOODTV.com."}, {"id": "39155a80-8497-41b5-82de-024f71f9e944", "title": "S . Korea , China To Hold  2+2  Diplomatic Security Talks On Tuesday", "date": "2024-06-17 12:00", "url": "https://menafn.com/1108340778/SKorea-China-To-Hold-22-Diplomatic-Security-Talks-On-Tuesday", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The South Korea-China and security dialogue will take place in Seoul on Tuesday, led by First Vice Foreign Kim Hong-kyun and Chinese Vice Foreign Minister Sun Weidong, Seoul's Foreign Ministry said.\nThe talks draw attention as they will likely coincide with Putin's visit to North Korea widely expected to take place from Tuesday through Wednesday.\nSouth Korea responded by resuming the propaganda loudspeaker broadcasts toward North Korea.\nThe current security landscape and developments on and around the Korean Peninsula will likely be high on the agenda at Tuesday's talks.\nThe previous talks took place among the director generals in 2013 and 2015."}, {"id": "879acbd4-5266-49d5-bce2-b0013a93822d", "title": "Spending on nuclear weapons hit $91 . 4 billion in 2023 , watchdog finds", "date": "2024-06-17 10:15", "url": "https://www.voanews.com/a/spending-on-nuclear-weapons-hit-91-4-billion-in-2023-watchdog-finds/7658631.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "ICAN reports the United States spent $51.5 billion, “more than all the other nuclear-armed countries put together.” It says the next biggest spender was China at $11.8 billion with Russia spending the third largest amount at $8.3 billion.\nThe combined total of the five other nuclear powers, France, India, Israel, Pakistan, and North Korea, amounted to $11.6 billion last year.\nThe authors of the report say companies involved in the production of nuclear weapons received new contracts worth just less than $7.9 billion in 2023.\nAnalysis of data gathered over the past five years shows that the nuclear-armed states collectively spent $387 billion on their nuclear arsenals.\nIn fact, it is threatening people wherever they live.”Arms control experts share these concerns and warn of the dangers of a new arms race as the nuclear powers build up their arsenals in defiance of the spirit of the Treaty on the Non-Proliferation of Nuclear Weapons, which aims to prevent the spread of nuclear weapons and weapons technology."}, {"id": "891c9cd3-bcbd-4d7a-9f84-e7e12a6c38dd", "title": "  House of the Dragon  Season 2 Episode 1 Recap :  A Son For A Son  ", "date": "2024-06-17 03:00", "url": "https://decider.com/2024/06/16/house-of-the-dragon-season-2-episode-1-recap/", "domain": "decider.com", "domain_classification": "Unknown", "message": "Remember the stirring tracking shot that closed out season 1 of House of the Dragon?\nRhaenyra’s husband-uncle Prince Daemon Targaryen (Matt Smith) is raring to incinerate enormo-dragon Vhagar and Prince Aemond Targaryen (Ewan Mitchell), her one-eyed rider.\n“A son for a son.” Go off, Daemon, you ruthless weirdo.\nBefore anything else, she is compelled to see where Lucerys “Luke” Velaryon and his dragon Arrax bought it.\nstream 'house of the dragon' for free Max is currently offering a one-week free trial to new subscribers."}, {"id": "c0b34fb2-7294-4913-ad62-ca7beb8a2e83", "title": "Heated financial mismatch for Claudia Tenney , Mario Fratto", "date": "2024-06-17 14:00", "url": "https://buffalonews.com/news/local/government-politics/claudia-tenney-mario-fratto-new-york-24th-congressional-district/article_51517dd4-2a5e-11ef-8b9d-bfb01ce199d6.html", "domain": "buffalonews.com", "domain_classification": "Unknown", "message": "For both Tenney and Fratto, it's a question of character in 24th Congressional GOP primary The Tenney-Fratto battle in New York's 24th Congressional District is not exactly a battle of ideas.\nSo why are Republican establishment forces spending money on Tenney’s behalf while she is spending so much on her own?\n“I think they’re in trouble,” Fratto said of the Tenney campaign.\nFor example, they can consider the fact that as of June 5, the Tenney campaign had spent $1.56 million so far in this election cycle.\nEven amid her primary spending spree, she had $552,189 in her campaign war chest."}, {"id": "f2bb6d19-62f8-4c10-82f0-656ac5d9f1d9", "title": "IAF Rafales Roar in Alaska , Execute Complex Missions With F - 16s , F - 15s At Red Flag War Drills", "date": "2024-06-17 11:00", "url": "https://www.news18.com/world/iafs-rafales-roar-in-alaska-execute-complex-missions-with-f-16s-f-15s-at-red-flag-war-drills-8934960.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "The key takeaways from participating in the Red Flag exercise for the IAF included insight on interoperability with international partners and a collaborative understanding of missions in a multinational environment, the defence ministry said on Sunday.\nIndian Air Force has successfully completed its participation in Exercise Red Flag 2024 conducted by @usairforce at Eielson Air Force Base, #Alaska.\nIAF’s #Rafale aircraft took part in this multi-nation advanced aerial combat exercise for the first time.\nBesides the Indian Air Force (IAF), the exercise witnessed the participation of the Republic of Singapore Air Force (RSAF), the UK’s Royal Air Force (RAF), the Royal Netherlands Air Force (RNLAF), the German Luftwaffe, and the US Air Force (USAF).\nThis was the first time the IAF Rafale aircraft participated in this exercise."}, {"id": "20d2d9d4-7740-4a26-aceb-e2f644d2d3d2", "title": "Watch The Killers play  Battle Born  for the first time in 11 years", "date": "2024-06-17 13:00", "url": "https://www.nme.com/news/music/watch-the-killers-play-battle-born-for-the-first-time-in-11-years-3766079", "domain": "nme.com", "domain_classification": "Unknown", "message": "The Killers played their song ‘Battle Born’ for the first time in 11 years at their show in Dublin over the weekend – watch the footage below.\nAdvertisementTo round off the evening, the group played an extended version of the ‘Battle Born’ title track – marking its first appearance in the setlist since 2013.\nSee the performance of ‘Battle Born’ below, along with more fan-shot videos from the show.\nThe Killers are scheduled to play four gigs at the Co-Op Live arena in Manchester this week ahead of three dates at Glasgow’s OVO Hydro.\nJUNE18 – Co-Op Live, Manchester19 – Co-Op Live, Manchester21 – Co-Op Live, Manchester22 – Co-Op Live, Manchester25 – OVO Hydro, Glasgow26 – OVO Hydro, Glasgow27 – OVO Hydro, GlasgowJULY04 – The O2, London05 – The O2, London07 – The O2, London08 – The O2, London10 – The O2, London11 – The O2, London"}, {"id": "f2eb17c6-f0bd-47bd-9746-55574c04ff0a", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://995thefox.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "995thefox.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "4d06e36b-0103-4425-ba6c-2b5e5a255fb9", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://rock1067.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "rock1067.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "7d06e24c-f3ce-41b0-997f-ac4ba90c8123", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://wqmf.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "wqmf.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "40248246-818e-45c2-add7-909340f420b9", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://1015.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "1015.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "798123fa-d95c-4e38-8ef3-cccb331659f4", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://newstalk1049.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "newstalk1049.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "8ad71b5e-10f6-4edd-b82c-04e8d0e2262f", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://kiss1027fm.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "kiss1027fm.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "97ea3638-cdc7-47f8-a5d1-30f36fff55a6", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://ktok.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "ktok.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "39346235-29b3-4a0b-82ed-2bb24b003865", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://941zbq.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "941zbq.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "4db29a08-960a-4197-84fb-bb170af79b85", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://z107fm.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "z107fm.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "fa62a8ec-3dab-4154-8de3-02b1058f04fd", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://1061fmtalk.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "1061fmtalk.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "b54f9d27-0f4b-460c-b9a4-bbc7ee2b193e", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://kgbx.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "kgbx.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "be0e322f-e162-4d3f-9c28-592884bef58f", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://wrno.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "wrno.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "dfbc9145-07be-4854-94c0-db09392d2e1d", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71 | PowerTalk 1460 AM & 101 . 1 FM", "date": "2024-06-17 00:00", "url": "https://powertalk1460.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "powertalk1460.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "28ca5410-695f-471a-a6d0-c3112bdc2bc1", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://kee100.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "kee100.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "ff427931-b807-4f8f-849d-868f82b07f5f", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://102jkx.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "102jkx.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "dfd43ac2-933d-4e4f-9915-164700a9b4d8", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://wcvu.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "wcvu.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "dbd08baf-cc02-4029-9b60-72347a7f4d81", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://1013kissfm.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "1013kissfm.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "8521a725-907e-43c6-8b6d-ba3ff6f8037b", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://island985.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "island985.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}, {"id": "d202c552-0f59-4ea6-80ba-249e8b8edca4", "title": "  Seinfeld  Actor And Comedian Hiram Kasten Dead At 71", "date": "2024-06-17 00:00", "url": "https://991kcad.iheart.com/content/2024-06-16-seinfeld-actor-and-comedian-hiram-kasten-dead-at-71/", "domain": "991kcad.iheart.com", "domain_classification": "Unknown", "message": "Comedian and actor Hiram Kasten, who played the recurring role of Michael on Seinfeld, has died at the age of 71, according to an obituary shared on his Facebook page.\nKasten died at his home in Batavia, New York, on Sunday (June 16), hours after his 38th wedding anniversary with his wife, Diana Kisiel Kastenbaum, according to the post.\nThe comedian reportedly faced a seven-year battle with a multitude of illnesses, including prostate cancer.\n\"Never mentioning it to his friends, he carried on as usual over the phone and with trips to NY and LA.\nDiana said it prolonged his life for at least another two months to be able to laugh with his peers.\""}]