[{"id": "32f3bd52-3718-4051-85e2-832612d09908", "title": "Ernesto Approaches Bermuda , Could Become Category 2 Hurricane", "date": "2024-08-16 00:30", "url": "https://www.theepochtimes.com/world/ernesto-approaches-bermuda-could-become-category-2-hurricane-5706583", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "Bermuda is expected to begin facing tropical storm conditions on Aug. 16 as Hurricane Ernesto nears the island, according to the National Hurricane Center (NHC).\nErnesto strengthened to a Category 2 hurricane, with increased sustained winds of 100 mph.\nThe Saffir-Simpson Hurricane Wind Scale gives a Category 2 hurricane sustained winds of 96 mph—110 mph.\nA Category 3 hurricane has winds of 111 mph—129 mph.\nThe NHC reported swells causing life-threatening surf and rip currents generated by Ernesto are affecting Turks and Caicos, and the Bahamas."}, {"id": "f6bc716f-02d5-4d66-b27d-20a90c6f9710", "title": "Half of Puerto Rico without power as Hurricane Ernesto approaches Bermuda", "date": "2024-08-16 04:00", "url": "https://www.wcpo.com/weather/half-of-puerto-rico-without-power-as-hurricane-ernesto-gains-strength", "domain": "wcpo.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto notched 90mph maximum sustained winds on Thursday night as it moves toward Bermuda in the Atlantic Ocean.\nThe National Hurricane Center announced a hurricane warning for Bermuda.\nAdditional strengthening is forecast, which would put Ernesto close to Category 3 major hurricane status when it reaches the island.\n6 to 12 inches of rain could fall on Bermuda Saturday, with some places seeing as much as 15 inches.\nStorm wrecks Puerto Rico power gridsHalf of Puerto Rico was waking up on Thursday in the dark, where more than 325,000 customers were still without power as cleanup efforts got underway."}, {"id": "7b7ca5be-934e-41d6-8b84-eb1c4119a905", "title": "Hurricane Ernesto : Hurricane Ernesto : Bermuda on alert as storm grows stronger , power outages and flooding continue in Puerto Rico", "date": "2024-08-16 03:30", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/hurricane-ernesto-bermuda-on-alert-as-storm-grows-stronger-power-outages-and-flooding-continue-in-puerto-rico/articleshow/112554802.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Impact on Puerto Rico:Forecast:Current position:Preparation alert:Historical context:LUMA energy report:Power grid fragility:US East Coast:Seasonal overview:Hurricane Ernesto , currently a Category 1 storm, is intensifying as it heads towards Bermuda , posing significant threats with powerful winds, dangerous storm surges, and heavy rainfall over the weekend.The storm has already caused substantial damage in Puerto Rico , where it left hundreds of thousands without power.\nAs Ernesto continues its path, the National Hurricane Center (NHC) warns that it could strengthen into a major hurricane by Friday, prompting urgent preparations in affected regions.Here's all you need to know:-Hundreds of thousands are without power due to heavy rainfall from Ernesto.\nSignificant flooding and damage reported.Ernesto expected to strengthen into a major hurricane (Category 3 or higher) by Friday, with further strengthening predicted by the NHC.As of 5 pm ET Thursday, Ernesto was 495 miles southwest of Bermuda, moving north at 85 mph.The NHC advises Bermuda residents to complete preparations for potential impacts, including significant rain, strong winds, and storm surge.Bermuda has experienced direct landfalls from only 11 storms since 1851. Notable past hurricanes include Gonzalo (2014) and Fabian (2003).About 410,000 homes and businesses in Puerto Rico remain without electricity.\nLUMA expects power restoration soon.Puerto Rico’s power grid is historically fragile, with previous hurricanes (Fiona 2022, Irma and Maria 2017) causing prolonged outages.Ernesto is expected to stay well west of the US East Coast but could cause life-threatening surf and rip currents.Ernesto is the fifth named storm of an intense Atlantic hurricane season.\nPrevious storms include Category 1 Hurricane Debby and Category 5 Hurricane Beryl."}, {"id": "6e2b12e7-1a16-4016-82ce-4494edf9502f", "title": "Massive storm exposes growing threat looming over cities in the U . S . South :  A constant existential fear  ", "date": "2024-08-16 04:00", "url": "https://www.yahoo.com/news/massive-storm-exposes-growing-threat-013000478.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "In Charleston, South Carolina, the storm revealed just how vulnerable the city is to extreme weather events, which are becoming more common and more intense, the Washington Post reported.\nWhy are extreme weather events concerning?\nThe prospect of flooding is \"virtually just a constant existential fear we have throughout the year,\" Charleston resident Damon Black told the Post.\nUnfortunately, many of the places most affected by this extreme weather, such as Florida, are moving away from solutions meant to curb the trend.\nIn order to truly address the threat that extreme weather events pose, we must halt the overheating of our planet caused by dirty energy."}, {"id": "43d4a495-93b9-431f-9859-d2fcac57e552", "title": "Hurricane Ernesto To Create Dangerous Beach Conditions Along East Coast", "date": "2024-08-16 01:00", "url": "https://whnz.iheart.com/content/2024-08-15-hurricane-ernesto-to-create-dangerous-beach-conditions-along-east-coast/", "domain": "whnz.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto, the third hurricane of the season, is heading towards Bermuda, bringing with it the threat of life-threatening rip currents along the East Coast.\nThe hurricane, which has already caused damage in Puerto Rico and the Virgin Islands, is currently moving north at 14 mph, just east of the Bahamas.\nWith maximum sustained winds of 85 mph, Ernesto is a Category 1 hurricane, just 9 mph away from a Category 2 designation, according to the National Hurricane Center.\nWhile the storm is not projected to make direct landfall on the U.S., forecasters expect it to bring dangerous swells to the East Coast over the weekend.\nThe National Hurricane Center has warned people on the East Coast to prepare for a significant risk of life-threatening surf and rip currents."}, {"id": "7a518d43-b79f-441e-8022-3ae52d010c3c", "title": "Hurricane Ernesto To Create Dangerous Beach Conditions Along East Coast", "date": "2024-08-16 01:00", "url": "https://knst.iheart.com/content/2024-08-15-hurricane-ernesto-to-create-dangerous-beach-conditions-along-east-coast/", "domain": "knst.iheart.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto, the third hurricane of the season, is heading towards Bermuda, bringing with it the threat of life-threatening rip currents along the East Coast.\nThe hurricane, which has already caused damage in Puerto Rico and the Virgin Islands, is currently moving north at 14 mph, just east of the Bahamas.\nWith maximum sustained winds of 85 mph, Ernesto is a Category 1 hurricane, just 9 mph away from a Category 2 designation, according to the National Hurricane Center.\nWhile the storm is not projected to make direct landfall on the U.S., forecasters expect it to bring dangerous swells to the East Coast over the weekend.\nThe National Hurricane Center has warned people on the East Coast to prepare for a significant risk of life-threatening surf and rip currents."}, {"id": "1867cc65-61ff-45b3-8b16-ddf56c9dd94d", "title": "Hurricane Ernesto leaves a quarter of Puerto Rico without power , on its way to Bermuda", "date": "2024-08-16 01:15", "url": "https://www.unionleader.com/news/weather/hurricane-ernesto-leaves-a-quarter-of-puerto-rico-without-power-on-its-way-to-bermuda/article_c66cf290-1d3c-5338-8e4a-74689bbfa2f7.html", "domain": "unionleader.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "b00adc84-fccd-4bc9-afd8-d43709a41c20", "title": "Hurricane Ernesto is charging through the Atlantic . Here what it doing . ", "date": "2024-08-16 03:45", "url": "https://www.newschannel5.com/news/as-ernesto-hurricane-ernesto-is-charging-through-the-atlantic-heres-what-its-doing", "domain": "newschannel5.com", "domain_classification": "Unknown", "message": "NASHVILLE, Tenn. (WTVF) — Ernesto has recently been updated to a Category 1 hurricane as the disturbance continues to churn in the Atlantic.\nAfter sweeping through the Virgin Islands and Puerto Rico, the storm is now on track toward Bermuda.\nAs of Thursday afternoon 389,424, clients across Puerto Rico are still without power, according to LUMA Energy.\nA Hurricane Warning is in place as Ernesto will likely strengthen to a major hurricane before approaching Bermuda, meaning a Category 3 or higher.\nConditions in Tennessee and Kentucky will not be influenced by Ernesto."}, {"id": "58568631-8972-4703-bf58-3b2c5c20eda3", "title": "Ernesto expected to become major hurricane . What St . Augustine forecast ? ", "date": "2024-08-16 02:00", "url": "https://www.yahoo.com/news/ernesto-expected-become-major-hurricane-134727572.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tropical Storm Ernesto continued to strengthen overnight and is now expected to become a major hurricane by early Friday morning, according to the latest advisory from the National Hurricane Center.\nAt 8 a.m., the center of Tropical Storm Ernesto was located near latitude 19.8 North, longitude 67.2 West.\nErnesto is expected to become a hurricane later today and could become a major hurricane in a couple of days.\nGraphics explain the deadly weather eventHurricane warning: A hurricane warning means that hurricane conditions are expected somewhere within the warning area.\nTropical storm warning: A tropical storm warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours."}, {"id": "f5a6a222-553f-4ba3-8b42-3339c6982e26", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 04:30", "url": "https://www.canberratimes.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "178585ae-784f-435f-8e56-f2802035484d", "title": "How Hurricane Ernesto Could Impact Your Travels", "date": "2024-08-16 04:15", "url": "https://www.cntraveler.com/story/hurricane-ernesto-travel-advice", "domain": "cntraveler.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto, then a tropical storm, knocked out power for half of Puerto Rico on Wednesday and is moving toward Bermuda with increased strength.\nIn Puerto Rico, tropical storm conditions have passed, according to a Thursday travel advisory from Discover Puerto Rico, the island’s Destination Marketing Organization.\nHowever, parts of Vieques, Culebra, and the eastern coast of Puerto Rico are still recovering from heavy rains, flash floods, and tropical winds.\nIn Florida, Fort Lauderdale International Airport (FLL) and Miami International Airport (MIA) saw delay rates of 88.35% and 91.11% respectively, while Palm Beach International Airport (PBI), Southwest Florida International Airport (RSW), and Sarasota Bradenton International Airport (SRQ ) saw 100% of flights delayed.\nNorwegian Cruise LineThree Norwegian Cruise Line itineraries have also been modified as result of Hurricane Ernesto."}, {"id": "58c03245-1988-45d3-ab65-d09fe3d26edf", "title": "INSIDE LOOK : Live Oak businesses rebounding 10 days after Hurricane Debby", "date": "2024-08-16 02:00", "url": "https://www.wtxl.com/live-oak/inside-look-live-oak-businesses-rebounding-10-days-after-hurricane-debby", "domain": "wtxl.com", "domain_classification": "Unknown", "message": "Neighbors in Live Oak are still recovering from flooding that filled the streets during Hurricane Debby.\nBROADCAST TRANSCRIPT:Between Hurricane Debby's heavy rainfall and the overflowing of the Suwannee River, Live Oak suffered from catastrophic flooding.\nThis was the scene of downtown Live Oak the day Hurricane Debby left the town in feet of floodwater.\nRosmery Casado, Manager at Latin Flavor Cafe - \"Este negocio tuvo perdidas, perdidas económicas.\"\nCasado - \"Mas las perdidas que se fueron en las inundaciones, las carnes, los alimentos, los materiales, el toldo — definitivamente es muy terrible.\""}, {"id": "06faee81-b56a-4e37-9345-d9523dc88cb6", "title": "Isolated Downpours and Thunderstorms Through This Evening", "date": "2024-08-16 01:00", "url": "https://www.westernmassnews.com/2024/08/15/scattered-showers-thunderstorms-possible-this-afternoon/", "domain": "westernmassnews.com", "domain_classification": "Unknown", "message": "(WGGB/WSHM) - We saw hazy sunshine across western Mass this morning due to high atmospheric wildfire smoke from Canada.\nAn Air Quality Alert is in effect from midnight tonight through midnight Friday night.\nWildfire smoke will likely be back for much of the day, so hazy sunshine or even a cloudy look is expected.\nThe air quality will be at a level 3-dangerous for sensitive groups, especially Friday afternoon as smoke may work down to surface levels.\nDrier air begins working in Tuesday and a nice stretch of weather is looking likely mid to late week."}, {"id": "87c2cca0-0142-47dd-8916-47a31c9681ce", "title": "Storm Ernesto , now a hurricane , nears Bermuda", "date": "2024-08-16 01:00", "url": "https://www.maitlandmercury.com.au/story/8731818/storm-ernesto-now-a-hurricane-nears-bermuda/?cs=7607", "domain": "maitlandmercury.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "576a86ec-714e-428e-99bc-38b65962ca5e", "title": "Storm Ernesto , now a hurricane , nears Bermuda", "date": "2024-08-16 00:30", "url": "https://www.newcastleherald.com.au/story/8731818/storm-ernesto-now-a-hurricane-nears-bermuda/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "f772f502-36a5-468b-a509-6f96dac26092", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 04:15", "url": "https://www.goulburnpost.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/?cs=14264", "domain": "goulburnpost.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "995ada1a-66f3-493c-97cb-adcfeb3f7858", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 04:15", "url": "https://www.queanbeyanage.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/?cs=14264", "domain": "queanbeyanage.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "88c07704-63c2-4f11-a3ed-71297b1ff3a8", "title": "Hurricane Ernesto strengthens as it barrels to Bermuda", "date": "2024-08-16 04:30", "url": "https://www.newcastleherald.com.au/story/8731818/hurricane-ernesto-strengthens-as-it-barrels-to-bermuda/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "Hurricanes Gonzalo in 2014 and Fabian in 2003 were the most destructive storms to hit Bermuda in recent memory, causing hundreds of millions of dollars in damage and leaving most of the islands without electricity.\nFabian killed four people, the first storm to cause deaths on the islands since 1926."}, {"id": "c1183678-bf69-4707-b495-ae9ef0446273", "title": "Japan orders evacuations near Tokyo as Typhoon Ampil approaches", "date": "2024-08-16 04:15", "url": "https://www.aol.com/japan-cancels-flights-suspends-bullet-065258652.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "People in parts of Japan are being told to evacuate, with some homes losing power on Friday as Typhoon Ampil approaches the coast near Tokyo.\nAs of early Friday local time, the storm was recording winds of 185 kilometers per hour (115 miles per hour), according to the latest advisory from the Joint Typhoon Warning Center (JTWC).\nIt could strengthen further in the next 12 hours, with the storm reaching peak intensity as it passes by Japan.\nThe storm’s center is expected to remain slightly offshore as it turns toward the northeast and moves away from Japan, according to the JTWC and Japan’s Meteorological Agency.\nIf it stays offshore and only brushes the coast, it might only have a light impact on Japan, bringing rain and wind to some areas including Tokyo."}, {"id": "93578a7a-49de-41f6-93ba-9b63cce206b9", "title": "Hope for costly Ike Dike funding restored with adoption of $56 billion statewide flood plan – Houston Public Media", "date": "2024-08-16 01:45", "url": "https://www.houstonpublicmedia.org/articles/news/energy-environment/2024/08/15/496817/hope-for-costly-ike-dike-funding-restored-with-adoption-of-56-billion-statewide-flood-plan/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "File photoThe Texas Water Development Board on Thursday adopted Texas’ first $56 billion statewide flood plan— restoring hope for the long-anticipated Ike Dike and other coastal flood mitigation projects.\n“Texas’ statewide flood planning program is the first of its kind,” Reem Zoun, a Water Development Board director said.\nUnder the project, around $49 billion will be diverted to flood mitigation projects.\nApproximately one in six people in Texas live or work in known flood hazard areas, according to flood plan documents.\nOther mitigation projects outlined in the statewide flood plan include Houston-area floodplain analyses, stormwater detention basins and deep tunnel systems for stormwater management."}, {"id": "bceffbdf-bedd-403f-9477-c262be890dd4", "title": "Small Hildale earthquake serves as reminder to be prepared for  a big one  – St George News", "date": "2024-08-16 00:00", "url": "https://www.stgeorgeutah.com/news/archive/2024/08/15/agl-small-hildale-earthquake-serves-as-reminder-to-be-prepared-for-a-big-one/", "domain": "stgeorgeutah.com", "domain_classification": "Unknown", "message": "Stock photo | Photo by vchal/iStock/Getty Images Plus, St. George NewsST. GEORGE — A 3.3. magnitude earthquake hit Hildale on Thursday afternoon.\nThe rumbling was reported by nine people throughout Southern Utah, including those near Cedar City and Hurricane and across the Arizona border in Colorado City.\nThe 3.3 magnitude earthquake likely rattled household items, she said.\nWhile other small quakes have occurred throughout Southern Utah this summer, Morton said it likely isn’t a pattern.\nCopyright St. George News, SaintGeorgeUtah.com LLC, 2024, all rights reserved."}, {"id": "87571876-e030-49e0-883e-a3b7cfcb5ebd", "title": "Rare sighting :  Doomsday fish  found near Southern California shore", "date": "2024-08-16 00:00", "url": "https://www.yahoo.com/news/rare-sighting-doomsday-fish-found-220136112.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SAN DIEGO (KSWB/KUSI) – In a rare and perhaps ominous sighting, an oarfish was found floating near California’s La Jolla Shores over the weekend.\nSeveral people then worked together to carry the sea creature from the ocean to the bed of a truck using a paddleboard.\nWhile most oarfish measure anywhere from 10 to 30 feet long, Hook confirmed that this one was right at 12 feet long.\nJust a couple days after the oarfish sighting in La Jolla, an earthquake with a magnitude of 4.4 shook Southern California about 2.5 miles south, southeast of Highland Park near Los Angeles.\n“Experts don’t have any evidence to theorize why these fish are washing ashore in Southern California, but learn more from each specimen that is collected,” said Hook."}, {"id": "041553d3-d1e2-4fdb-9b3d-6595b043f024", "title": "Light earthquake : M4 . 2 quake has struck near Tual in Indonesia", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-m4-2-quake-has-struck-near-tual-in-indonesia-9/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) has struck on Wednesday, 91 km SSW of Tual, Indonesia (57 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 10 km (6 miles).\nId of earthquake: us6000njzj.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 91 km SSW of Tual, Indonesia."}, {"id": "64010297-3461-4dbd-be47-701e9582d827", "title": "P . E . I . officials preparing for hurricane season in a post - Fiona world", "date": "2024-08-16 01:15", "url": "https://www.cbc.ca/news/canada/prince-edward-island/pei-fiona-hurricane-season-preparedness-1.7295914", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "As officials in Prince Edward Island prepare for hurricane season, they are urging Islanders to get ready for future Fiona-level storms — whenever they may hit.\nSince storm season began, the utility company has been circulating hurricane preparedness information in bill inserts and on its website.\nOn the municipal level, the Charlottetown Fire Department says it has been working with organizations in the community as it prepares for the height of the Atlantic hurricane season, which officially ends on Nov. 30.\nCharlottetown Fire Chief Tim Mamye said Islanders should prepare a 72-hour emergency kit for hurricane season.\n(Wayne Thibodeau/CBC)To prepare for hurricane season, Mamye recommended Islanders familiarize themselves with the municipal, provincial and federal advice on getting ready for an emergency."}, {"id": "8a7e67ba-993d-45b2-9003-1574709aee8f", "title": "Ernesto strengthens into hurricane as it approaches Bermuda", "date": "2024-08-16 04:30", "url": "https://www.yorkpress.co.uk/news/national/24522060.ernesto-strengthens-hurricane-approaches-bermuda/", "domain": "yorkpress.co.uk", "domain_classification": "Unknown", "message": "A hurricane warning was in effect for Bermuda with Ernesto expected to pass near or over the island Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Centre in Miami.\nErnesto is expected to pass near or east of Atlantic Canada on Monday.\nOn Thursday, the storm was generating southern winds in Puerto Rico, which have a heating effect as opposed to the typical cooling trade winds that blow from the east.\nMore than 290,000 people remained in the dark on Thursday evening after Ernesto swiped past Puerto Rico late on Tuesday as a tropical storm before strengthening into a hurricane."}, {"id": "83f6e850-1ecc-4b1b-8925-945d86b7f262", "title": "Light earthquake : M4 . 5 quake has struck near the Fiji Islands", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-m4-5-quake-has-struck-near-the-fiji-islands-38/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.5 (ml/mb) was reported south of the Fiji Islands (0 miles) on Friday.\nThe epicenter was at a depth of 48.225 km (30 miles).\nEvent ids that are associated to the earthquake: us7000n7c2.\nIn the past 24 hours, there have been two, in the last 10 days two, in the past 30 days two and in the last 365 days ten earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: south of the Fiji Islands."}, {"id": "2fdd286f-5f3a-4151-b608-5bf5a8c79512", "title": "Light earthquake , 4 . 5 mag has occurred near  Ohonua in Tonga", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-5-mag-has-occurred-near-ohonua-in-tonga-4/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) strikes 236 km SSW of ‘Ohonua, Tonga (147 miles) on Tuesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us7000n77h.\nIn the past 24 hours, there have been one, in the last 10 days one, in the past 30 days two and in the last 365 days six earthquakes of magnitude 3.0 or greater that was reported nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 236 km SSW of ‘Ohonua, Tonga."}, {"id": "935fb6c3-8b4b-4475-b778-596ee718a4cf", "title": "Light earthquake , 4 . 4 mag strikes near Mohr in Iran", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-4-mag-strikes-near-mohr-in-iran-3/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 90 km WNW of Mohr, Iran (56 miles) on Wednesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nDate and time of earthquake in UTC/GMT: 14/08/24 / 2024-08-14 03:48:09 / August 14, 2024 @ 3:48 am.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 90 km WNW of Mohr, Iran."}, {"id": "5d9c5e8a-100c-4502-a10d-a9d6bbb4a242", "title": "Houston heat comparison ! A look at last year versus this year", "date": "2024-08-16 00:45", "url": "https://www.click2houston.com/weather/2024/08/15/houston-heat-comparison-a-look-at-last-year-versus-this-year/", "domain": "click2houston.com", "domain_classification": "Unknown", "message": "In total, Houston saw 45 100° days in 2023.\nAt least it was 30 days less than our neighbors up north in College Station, where they saw 75 100° days.\nWe hit our first 100° day on July 1, 2024, with our second 100° day just over a week ago on Aug. 7, 2024.\nDuring the month of July, when Hurricane Beryl moved through, Houston saw over 10 inches of rain.\nThe latest 100° day that Houston saw was on Sept. 27, 2005."}, {"id": "da438c73-d381-4210-bf0a-77be844d7e33", "title": "Light earthquake , 4 . 3 mag strikes near Ollagüe in Chile", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-strikes-near-ollague-in-chile/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Friday, 28 km WSW of Ollagüe, Chile (17 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 145.4 km (90 miles) below the earth’s surface.\nIds that are associated to the earthquake: us7000n7bt.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 28 km WSW of Ollagüe, Chile."}, {"id": "caf1a021-1bb5-4cdd-beae-45812a39d5cb", "title": "Light earthquake , 4 . 4 mag was detected near Palu in Indonesia", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-4-mag-was-detected-near-palu-in-indonesia-3/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes 209 km NNE of Palu, Indonesia (130 miles) on Friday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent ids that are associated to the earthquake: us7000n7bx.\nId of event: us7000n7bx.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 209 km NNE of Palu, Indonesia."}, {"id": "325c21c8-ce20-4cb5-9758-831bcf9d260f", "title": "Light earthquake , 4 . 3 mag was detected near Tokār in Sudan", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-was-detected-near-tokar-in-sudan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Saturday, 170 km ENE of Tokār, Sudan (106 miles).\nThe 4.3-magnitude earthquake was detected at 00:29:29 / 12:29 am (local time epicenter).\nAll ids that are associated to the event: us6000njmc.\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 170 km ENE of Tokār, Sudan."}, {"id": "dc89ca9e-ebfc-45f5-b044-d43113f3cf6d", "title": "Light earthquake , 4 . 3 mag has occurred near Levuka in Fiji", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-has-occurred-near-levuka-in-fiji-6/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Thursday, 86 kilometers (53 miles) from Levuka in Fiji.\nThe epicenter of the earthquake was roughly 585.865 km (364 miles) below the earth’s surface.\nIds that are associated to the earthquake: us7000n7aa.\nThe epicenter was 87 km (54 miles) from Levuka (c. 8 400 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 86 km NE of Levuka, Fiji."}, {"id": "f7660b24-f379-4f55-a85d-988b9147981c", "title": "Light earthquake , 4 . 9 mag strikes near Maumere in Indonesia", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-9-mag-strikes-near-maumere-in-indonesia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.9 (ml/mb) was reported 108 km NE of Maumere, Indonesia (67 miles) on Friday.\nThe epicenter of the earthquake was roughly 219.078 km (136 miles) below the earth’s surface.\nEvent ids that are associated to the earthquake: us7000n7bp.\nId of event: us7000n7bp.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 108 km NE of Maumere, Indonesia."}, {"id": "864e4cd2-f811-4a5e-9533-a00b513387eb", "title": "Light earthquake 4 . 3 mag , central Mid - Atlantic Ridge", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-central-mid-atlantic-ridge-4/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Sunday, central Mid-Atlantic Ridge (0 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, longitude -31.4027 West, latitude 3.047 North, depth = 10 km.\nEvery year there are an estimated 13,000 light earthquakes in the world.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: central Mid-Atlantic Ridge."}, {"id": "cc230f52-eb6c-47f0-a483-239769bdae7a", "title": "First round of storm debris pickup for Hurricane Beryl ends on August 31 – Houston Public Media", "date": "2024-08-16 01:45", "url": "https://www.houstonpublicmedia.org/articles/news/city-of-houston/2024/08/15/496810/first-round-of-storm-debris-pickup-ends-on-august-31/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "Michael Hagerty/Houston Public MediaThe first round of storm debris pickup for the City of Houston should be done by the end of this month.\nThe city has collected more than 2.1 million cubic yards of storm debris from Hurricane Beryl so far.\n“So if you have an abundance of shingles, or wo0den fencing, or tree debris, please keep the tree debris separate from the other miscellaneous items,” he said.\nBut residents can monitor the city’s progress with debris pick-up through a new storm debris collection map created last month.\nHowever, storm debris collection, we have to actually go around to each home individually.”"}, {"id": "59520baf-8350-45cb-b622-1b58c7640a6e", "title": "Light earthquake , 4 . 1 mag has occurred near Murghob in Tajikistan", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-1-mag-has-occurred-near-murghob-in-tajikistan-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.1 (ml/mb) was detected on Saturday, 60 kilometers (37 miles) from Murghob in Tajikistan.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 144.372 km (90 miles) below the earth’s surface.\nThe epicenter was 60 km (37 miles) from Murghob (c. 10 800 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 60 km W of Murghob, Tajikistan."}, {"id": "4858c4e6-654e-49f4-8635-79644be0c509", "title": "Ernesto grows into a Category 2 hurricane as it aims for Bermuda", "date": "2024-08-16 04:15", "url": "https://www.npr.org/2024/08/15/g-s1-17259/ernesto-grows-into-a-category-2-hurricane-as-it-aims-for-bermuda", "domain": "npr.org", "domain_classification": "International", "message": "Ernesto grows into a Category 2 hurricane as it aims for Bermudatoggle caption Alejandro Granadillo/APSAN JUAN, Puerto Rico — Hurricane Ernesto strengthened into a Category 2 storm Thursday night as it barreled toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island Saturday.\nThe storm was centered about 410 miles (660 kilometers) south-southwest of Bermuda late Thursday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "ac4899bd-6940-4030-b860-0e0ee385dde9", "title": "Puente Hill Fault causes recent SoCal earthquakes", "date": "2024-08-16 01:30", "url": "https://www.10news.com/news/local-news/puente-hill-fault-causes-recent-socal-earthquakes", "domain": "10news.com", "domain_classification": "Unknown", "message": "Instead, it was the Puente Hills Fault, an entirely different area that may pose a larger earthquake risk.\nThe Puente Hills Fault stretches 25 miles, from downtown Los Angeles to Pasadena and northern Orange County.\n\"The site is a bad site geologically,\" said Dr. Abbott.\nIt's what falls on you or is thrown at you,\" said Dr. Abbott.\nDr. Abbott says one of the best places to start preparing your home is your bedroom."}, {"id": "6be20346-bd87-40db-a400-d3ff5a15289c", "title": "Hundreds of thousands without power in Puerto Rico as Hurricane Ernesto aims for Bermuda", "date": "2024-08-16 02:00", "url": "https://www.lemonde.fr/en/international/article/2024/08/16/hundreds-of-thousands-without-power-in-puerto-rico-as-hurricane-ernesto-aims-for-bermuda_6716432_4.html", "domain": "lemonde.fr", "domain_classification": "Local - Europe", "message": "A power line pole leans against a house in the aftermath of Tropical Storm Ernesto in Fajardo, Puerto Rico August 14, 2024.\nRICARDO ARDUENGO / REUTERSHurricane Ernesto barreled toward Bermuda on Thursday, August 15, after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the US territory, raising concerns about people's health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\n\"All of the guidance show this system as a large hurricane near Bermuda,\" said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "c29234c7-8f12-4b10-805b-9807725946ff", "title": "Light earthquake 4 . 2 mag , 25 km NW of Velasco Ibarra , Ecuador", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-2-mag-25-km-nw-of-velasco-ibarra-ecuador/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) strikes 25 kilometers (16 miles) from Velasco Ibarra in Ecuador on Wednesday.\nIds that are associated to the earthquake: us6000nk0c.\nThe earthquake was roughly at a depth of 60.344 km (37 miles).\nEarthquake epicenter was 76 km (47 miles) from Portoviejo (c. 170 300 pop), 41 km (25 miles) from Quevedo (c. 119 400 pop), 26 km (16 miles) from Velasco Ibarra (c. 48 800 pop), 74 km (46 miles) from Ventanas (c. 46 700 pop), 38 km (24 miles) from Chone (c. 44 800 pop), 56 km (35 miles) from Balzar (c. 40 100 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 25 km NW of Velasco Ibarra, Ecuador."}, {"id": "3196ab87-e9f4-4b42-abc8-d63cb4413f36", "title": "  Very strong  Typhoon Ampil prompts storm warnings as it nears eastern Japan", "date": "2024-08-16 01:30", "url": "https://www.japantimes.co.jp/news/2024/08/16/japan/typhoon-ampil-severe-storm/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "A Level 4 evacuation order was issued in the city of Mobara, Chiba Prefecture, urging residents in areas with a high risk of landslides and inundation to evacuate.\nLevel 3 advisories, encouraging the elderly and those with disabilities to evacuate, were issued in various cities in Tokyo, Chiba, Kanagawa, Ibaraki and Fukushima prefectures.\nDepartment stores in Chiba Prefecture, such as Sogo and Ito-Yokado, have announced that they will close temporarily due to the typhoon.\nThe storm is forecast to strengthen further on Friday as it moves closer to the coast of Chiba Prefecture on Friday.\nOn the Sobu Rapid and Keiyo lines, trains running directly from Chiba Prefecture have been canceled."}, {"id": "5a878952-da33-4024-896c-693effab484e", "title": "Light earthquake : M4 quake has struck near Yamada in Japan", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-m4-quake-has-struck-near-yamada-in-japan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4 (ml/mb) has occurred on Sunday, 148 km E of Yamada, Japan (92 miles).\nGlobal time and date of event 28/07/24 / 2024-07-28 21:49:11 / July 28, 2024 @ 9:49 pm UTC/GMT.\nThe epicenter was at a depth of 10 km (6 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 148 km E of Yamada, Japan."}, {"id": "7175554b-f693-423e-952e-27e0f30769d2", "title": "Why Bermuda is among the most hurricane - resilient areas", "date": "2024-08-16 01:30", "url": "https://www.yahoo.com/news/why-bermuda-among-most-hurricane-224733048.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Since reliable data started to be kept by meteorologists in the 1800s, 90 cyclones have passed within 50 miles or less of Bermuda.\nDuring the early 20th century, Bermuda experienced a string of powerful hurricanes, which resulted in strict building standards.\nWaves hit te rocks in Church Bay, Bermuda, as Hurricane Fiona churned towards the Atlantic island as a powerful Category 4 storm on September 22, 2022.\n- Hurricane Fiona churned toward Bermuda as a powerful Category 4 storm on Wednesday as Puerto Rico struggled to restore power and water after receiving a crushing blow.\nOriginal article source: Why Bermuda is among the most hurricane-resilient areas"}, {"id": "48cd76a5-c6a3-49b4-b621-c22767954677", "title": "Light earthquake , 4 . 5 mag has occurred near Khorugh in Tajikistan", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-5-mag-has-occurred-near-khorugh-in-tajikistan-5/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) has occurred on Friday, 38 kilometers (24 miles) from Khorugh in Tajikistan.\nThe earthquake was roughly at a depth of 108.155 km (67 miles).\nNearby country/countries that might be effected, Afghanistan (c. 29 121 000 pop), Tajikistan (c. 7 487 000 pop).\nIn the past 24 hours, there have been two, in the last 10 days five, in the past 30 days twelve and in the last 365 days fourty-six earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 38 km SSW of Khorugh, Tajikistan."}, {"id": "d4ee20f4-f775-4b01-b944-7b2a255bc980", "title": "Light earthquake 4 . 3 mag , 5 km W of Cepitá , Colombia", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-3-mag-5-km-w-of-cepita-colombia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has struck on Wednesday, 5 kilometers (3 miles) from Cepitá in Colombia.\nEvent ids that are associated to the earthquake: us6000njzx.\nId of event: us6000njzx.\nThe epicenter was 42 km (26 miles) from Bucaramanga (c. 571 800 pop), 34 km (21 miles) from Floridablanca (c. 252 300 pop), 38 km (23 miles) from Girón (c. 108 500 pop), 25 km (16 miles) from Piedecuesta (c. 86 400 pop), 80 km (50 miles) from Pamplona (c. 53 600 pop), 26 km (16 miles) from San Gil (c. 33 600 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 5 km W of Cepitá, Colombia."}, {"id": "a50617b8-0c76-4cc6-93b2-2e90191cf384", "title": "Light earthquake , 4 . 4 mag strikes near Puerto El Triunfo in El Salvador", "date": "2024-08-16 03:45", "url": "https://www.earthquakenewstoday.com/2024/08/16/light-earthquake-4-4-mag-strikes-near-puerto-el-triunfo-in-el-salvador-5/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) has occurred on Thursday, 27 kilometers (17 miles) from Puerto El Triunfo in El Salvador.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter was at a depth of 74.681 km (46 miles).\nClose country/countries, El Salvador (c. 6 052 000 pop) (That might be effected).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 27 km SSW of Puerto El Triunfo, El Salvador."}, {"id": "13278779-dcaf-4b66-9ac0-8bb563e5c65d", "title": "Ernesto grows into Cat 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 04:15", "url": "https://www.wfmz.com/news/ernesto-grows-into-cat-2-hurricane-as-it-aims-for-bermuda-leaving-many-in-puerto/article_ed71d9ec-bca4-5a22-bc67-abd6eeed3d6f.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "Ernesto grows into Cat 2 hurricane as it aims for Bermuda, leaving many in Puerto Rico without powerHurricane Ernesto has strengthened into a Category 2 storm as it barrels toward Bermuda after leaving hundreds of thousands of people in Puerto Rico without power or water"}, {"id": "5cdc9a57-f365-4b73-ae52-6e3d7c83728d", "title": "Hurricane season : Long Islanders with pets advised to prepare for power outages , evacuations", "date": "2024-08-16 02:30", "url": "https://www.newsday.com/news/weather/hurricane-preparations-pets-dogs-cats-aqiamej1", "domain": "newsday.com", "domain_classification": "Unknown", "message": "As the Atlantic hurricane season nears its peak, officials are warning Long Islanders to be prepared for power outages and possible evacuations — and not to forget their pets.\n\"If we know the history of Long Island and the history of hurricane season, we know it’s coming.\nA Paws of War service dog attends a hurricane emergency preparedness event at the H. Lee Dennison building in Hauppauge on Thursday.\nCredit: Morgan CampbellNassau and Suffolk county officials have warned of needed preparations at the start of the hurricane season in June.\nThe storms so far have avoided Long Island, including Hurricane Ernesto, which has veered north into open waters in the Mid-Atlantic."}, {"id": "d1513dc1-cfd8-41ff-bf23-c734f80d80f3", "title": "Hurricane Ernesto impact on Puerto Rico and how those here in western Massachusetts can help", "date": "2024-08-16 04:00", "url": "https://www.yahoo.com/news/hurricane-ernesto-impact-puerto-rico-013711178.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Hurricane Ernesto’s impact on Puerto Rico and how those here in western Massachusetts can helpMass.\n(WWLP) – Hurricane Ernesto is making its way towards Bermuda after its strong winds knocked out power to hundreds of thousands of people and dumped torrential rain on Puerto Rico.\n22News spoke to local officials who have family and loved ones in Puerto Rico about the impact this storm has had on the ground.\nMany here in western Massachusetts trying to get in contact with their loved ones who reside on the island of enchantment.\nLatest Local News HeadlinesWWLP-22News, an NBC affiliate, began broadcasting in March 1953 to provide local news, network, syndicated, and local programming to western Massachusetts."}, {"id": "a712791a-cc7f-4e32-b5d9-9de145b5349c", "title": "Hurricane Ernesto Aims for Bermuda After Leaving Many in Puerto Rico Without Power or Water", "date": "2024-08-16 02:15", "url": "https://www.theepochtimes.com/world/hurricane-ernesto-aims-for-bermuda-after-leaving-many-in-puerto-rico-without-power-or-water-5706458", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "SAN JUAN, Puerto Rico—Hurricane Ernesto barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nCrews have flown more than 540 miles (870 kilometers) across Puerto Rico and identified 400 power line failures, with 150 of them already fixed, said Juan Saca, president of Luma Energy, a private company that operates the transmission and distribution of power in Puerto Rico.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "c3e2e401-f90c-4dbb-bbd3-fd2943912927", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:00", "url": "https://komonews.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "komonews.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "6eb9a929-2a1b-4718-8fec-4c1eb86953cf", "title": "Ernesto grows into Cat 2 hurricane as it aims for Bermuda , leaving many in Puerto Rico without power", "date": "2024-08-16 04:30", "url": "https://www.smdailyjournal.com/news/world/ernesto-grows-into-cat-2-hurricane-as-it-aims-for-bermuda-leaving-many-in-puerto/article_aa47e929-975b-51d5-934b-d8180a318c98.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "e0c70688-4786-4faf-8000-53f47a48d25f", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:15", "url": "https://wlos.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "wlos.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "a1c111a0-89ec-4562-bebf-7f5957f0dfe1", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:30", "url": "https://foxbaltimore.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "foxbaltimore.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "74a95e2b-1761-4799-8158-24746a6b5dd2", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:15", "url": "https://news3lv.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "news3lv.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}, {"id": "a66a9992-a5e9-4444-a4bd-9ade5884d653", "title": "Pizza owner gives back to neighborhood dealing with flooding after heavy rain from Tropical Storm Debby", "date": "2024-08-16 04:15", "url": "https://www.yahoo.com/news/pizza-owner-gives-back-neighborhood-024241978.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Pizza place owner gives back to neighborhood dealing with flooding after heavy rain from Tropical Storm DebbyCHARLESTON COUNTY, S.C. (WCBD) — Over a week after Tropical Storm Debby made a second landfall in the Lowcountry many communities are still dealing with the flooding effects.\nOne local restaurant owner was looking for a way to give back after the storm.\nMike Pitera, owner of Pizza Modo Mio, used his culinary skills to help out those hit hardest by Edisto River flooding.\nPitera said he put out a Facebook notice to see who needed help and was flooded with responses.\n“There’s a lot of people who can’t get out their houses are underwater their driveways are underwater,” said Melissa Mitchum."}, {"id": "d25ce6fc-88a6-4d1c-9bc6-c7bac8a482fc", "title": "Ernesto strengthens into Category 2 hurricane as it approaches Bermuda , forecasters say", "date": "2024-08-16 04:00", "url": "https://khqa.com/news/nation-world/ernesto-strengthens-into-category-2-hurricane-as-it-approaches-bermuda-forecasters-say-extreme-weather-rain-rainwater-flooding-flooded-streets-heat-puerto-rico-power-outages-electricity", "domain": "khqa.com", "domain_classification": "Unknown", "message": "barreled toward Bermuda on Thursday after leaving hundreds of thousands of people in Puerto Rico without power or water as sweltering heat enveloped the U.S. territory, raising concerns about people’s health.\nA hurricane warning was in effect for Bermuda, with Ernesto expected to pass near or over the island on Saturday.\nThe Category 1 storm was located about 450 miles south-southwest of Bermuda on Thursday afternoon.\n“All of the guidance show this system as a large hurricane near Bermuda,” said the National Hurricane Center in Miami.\nAt least 250,000 customers across Puerto Rico also were without water given the power outages, down from a maximum of 350,000."}]