[{"id": "f70b0e99-c767-4642-afde-74c366ea3662", "title": "Hezbollah long - awaited retaliation struck little more than a chicken coop", "date": "2024-08-26 01:30", "url": "https://www.nzherald.co.nz/world/hezbollahs-long-awaited-retaliation-struck-little-more-than-a-chicken-coop/HMC2ZHWTOZG53ECCDTZSJW2DME/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "The IDF meanwhile said 100 fighter jets hit thousands of rocket launchers aimed at central and northern Israel.\nDaniel Hagari, an IDF spokesman, said 90% of the targets were short-range rocket launchers aimed at northern Israel.\nThe IDF also issued an illustrative graphic of the pre-emptive attack, showing fighter jets attacking several areas with rocket launchers in southern Lebanon.\nRockets did however cause damage to two homes in the northern Israeli cities of Acre and Maalot.\nIDF released footage showing its fighter jets striking Hezbollah launchers and a “terrorist cell” operating in the area of Khiam in southern Lebanon."}, {"id": "16b1ee1b-3cbc-41ef-ab14-a956577c7df8", "title": "What is Hezbollah in Lebanon : Catalyst for Middle East war or path to peace ? ", "date": "2024-08-26 01:30", "url": "https://timesofindia.indiatimes.com/world/middle-east/what-is-hezbollah-in-lebanon-catalyst-for-middle-east-war-or-path-to-peace/articleshow/112790988.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Hezbollah’s leadership and military powerRecent escalations and Israeli responseThe potential for regional impactThe escalating conflict between Hezbollah and Israel has captured global attention as the risk of a wider Middle East war looms.\nBoth Israel and Hezbollah quickly claimed victories of sorts.\nEstablished in the early 1980s with support from Iran, Hezbollah was formed to counter Israel's occupation of southern Lebanon during the Lebanese civil war.\nThe group claims credit for Israel's withdrawal from Lebanon in 2000, portraying itself as a formidable resistance force.\nHezbollah launched a barrage of rockets in retaliation for the assassination of senior Hezbollah figure Fuad Shukr, who was killed on July 30."}, {"id": "b34c3f1a-38f7-42fd-8eb2-3d175d37d780", "title": "Israel and Hezbollah in major missile exchange as escalation fears grow", "date": "2024-08-26 02:15", "url": "https://www.asiaone.com/world/israel-and-hezbollah-major-missile-exchange-escalation-fears-grow", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "Israel’s military said a naval soldier was killed and two wounded.\nBut if Hezbollah continues, Israel should strike very hard to remove the threat from Hezbollah once and for all,” said Yuval Peleg, 73, from Haifa.\nThe United States was not involved in Israel’s strikes on Aug 25, but provided some intelligence about incoming Hezbollah attacks, a US official said.\nHezbollah fired missiles at Israel immediately after the Oct 7 attacks by Hamas gunmen on Israel.\nHezbollah and Israel have been exchanging fire constantly ever since, while avoiding a major escalation as war rages in Gaza to the south."}, {"id": "5339996b-c8a3-4747-9968-d701329b111e", "title": "Major Israel - Hezbollah missile exchange as region fears escalation - World", "date": "2024-08-26 02:45", "url": "https://www.brecorder.com/news/40319284/major-israel-hezbollah-missile-exchange-as-region-fears-escalation", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "Netanyahu said these “pre-emptive” strikes had foiled a much larger Hezbollah barrage but Nasrallah said they had had little impact.\nHezbollah said the strikes killed two of its fighters in al-Tiri.\nIsrael’s military said a naval soldier was killed and two wounded.\nThe United States was not involved in Israel’s strikes on Sunday, but provided some intelligence about incoming Hezbollah attacks, a US official said.\nHezbollah and Israel have been exchanging fire constantly ever since, while avoiding a major escalation as war rages in Gaza to the south."}, {"id": "21e3cace-ab06-4c89-8073-3ac5d29e879c", "title": "Israel and Hezbollah in major missile exchange as escalation fears grow", "date": "2024-08-26 02:00", "url": "https://economictimes.indiatimes.com/news/international/world-news/israel-and-hezbollah-in-major-missile-exchange-as-escalation-fears-grow/articleshow/112791294.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "It seems like you're already an ETPrime member withLogin using your ET Prime credentials to enjoy all member benefitsLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."}, {"id": "271f5e23-833b-4cd2-8aaa-967ed41e0159", "title": "After attacks , Israel and Hezbollah swiftly move to talk of containment", "date": "2024-08-26 02:30", "url": "https://www.straitstimes.com/world/middle-east/after-attacks-israel-and-hezbollah-swiftly-move-to-talk-of-containment", "domain": "straitstimes.com", "domain_classification": "Local - Asia", "message": "But much of Israel woke up on Aug 25 to find that, at least for the immediate term, the long-dreaded attack appeared to be over almost before it started.\nIsrael and Hezbollah quickly claimed victories of sorts: Israel for its predawn pre-emptive strikes against what the military said were thousands of Hezbollah’s rocket launcher barrels in southern Lebanon; and Hezbollah for its subsequent firing of barrages of rockets and drones at northern Israel, which the Israeli military said killed a naval officer.\n“You can have escalation that is gradual.”Later on the morning of Aug 25, the Israeli military said it was continuing to strike Hezbollah launchers in southern Lebanon.\nHezbollah is estimated to possess tens of thousands of rockets and a smaller number of more sophisticated, precise missiles.\nBased on intelligence, Israel took the decision to pre-empt Hezbollah’s attack on Aug 25 “but not to go beyond”, Mr Yaari said."}, {"id": "e58be12a-3e03-43d8-b92c-635e66bc809e", "title": "Donald Trump Calls Out  Comrade Kamala ,  Her Really Bad VP Pick , Over Middle East :  Let Not Have World War 3  ", "date": "2024-08-26 04:15", "url": "https://menafn.com/1108599195/Donald-Trump-Calls-Out-Comrade-Kamala-Her-Really-Bad-VP-Pick-Over-Middle-East-Lets-Not-Have-World-War-3", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Live Mint) Donald Trump, the presidential nominee and former US President, called out incumbent US President Joe Biden and Vice-President Kamala Harris over the Middle-East crisis.\nIn a post on X on late Sunday August 25, asked, \"Who is negotiating for us in the Middle East?\"\nSleepy Joe is sleeping on a Beach in California, viciously Exiled by the Democrats, and Comrade Kamala is doing a campaign bus tour with Tampon Tim, her really bad V.P.\nHe warned about World War 3 again and said,“Let's not have World War III, because that's where we're heading!”Kamala Harris accepted the Democratic presidential nomination on Friday, August 23.\nMiddle East crisisTrump's comments came after Iran-backed Hezbollah launched hundreds of rockets and drones at Israel early on Sunday."}, {"id": "f4a5bf97-8855-4458-a653-be16fc9450ec", "title": "Israel prevents Hezbollah strike in major pre - dawn raid", "date": "2024-08-26 03:30", "url": "https://www.jpost.com/opinion/article-816315", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "An explosion takes place as Israeli strikes hit southern Lebanon, amid cross-border hostilities between Hezbollah and Israeli forces, as seen from Zibqin, Lebanon, August 25, 2024, in this still image obtained from a video.\nSunday morning’s attack was a sign – the first significant one – that Israel has what it takes to regain its full sovereignty.\nA massive attack like this one – hitting so many targets across southern Lebanon simultaneously – is not cobbled together overnight.\nBut this country is neither powerless nor helpless, nor dependent on the grace of our enemies not to strike us.\nThe situation in southern Lebanon needs to change fundamentally to make it possible for northern border residents to return home."}, {"id": "45a5fb57-a0a9-489d-86fe-e20a8fe1f3fc", "title": "North Korean leader Kim Jong Un oversees suicide drone tests", "date": "2024-08-26 04:00", "url": "https://www.aljazeera.com/news/2024/8/26/north-korean-leader-kim-jong-un-oversees-suicide-drone-tests", "domain": "aljazeera.com", "domain_classification": "International", "message": "State media shows Kim looking ecstatic after a test in which drones crashed into what appeared to be a tank.\nNorth Korean leader Kim Jong Un has supervised a test of domestically-developed attack drones, state media KCNA reported.\nPhotos published by North Korean media on Monday showed a white drone with X-shaped tails and wings crashing into and destroying a target resembling South Korea’s K-2 main battle tank.\nThe North Korean leader supervised the test on a visit to the Drone Institute of North Korea’s Academy of Defense Science, KCNA said.\nThe drone test comes as the United States and South Korean militaries conduct a large-scale exercise aimed at enhancing their combined capabilities to defend against the North Korean threat."}, {"id": "fd650dae-3918-4007-89ee-9ad674bc9d2d", "title": "N . Korean leader calls for developing , producing more suicide drones", "date": "2024-08-26 01:15", "url": "http://www.koreaherald.com/view.php?ud=20240826050144", "domain": "koreaherald.com", "domain_classification": "Unknown", "message": "This photo shows the North holding a performance test of drones on Saturday under the guidance of leader Kim Jong-un.\n(KCNA)North Korean leader Kim Jong-un has overseen a performance test of various drones, calling for the development and production of more suicide drones to enhance war preparedness, state media reported Monday.\nIn addition to constantly developing underwater strategic weapon systems and underwater suicide attack drones, he also emphasized the need for proactively introducing artificial intelligence technology into the development of drones.\nPhotos carried by the state media showed two white suicide attack drones hitting and destroying a mock target that looked like a South Korean K-2 tank.\nIn July 2023, North Korea unveiled two types of new reconnaissance and multipurpose attack drones at an arms exhibition and a military parade."}, {"id": "827c7445-33ce-4e07-a093-12f7799fab54", "title": "N . Korean Leader Calls For Developing , Producing Suicide Drones", "date": "2024-08-26 04:00", "url": "https://menafn.com/1108599238/N-Korean-Leader-Calls-For-Developing-Producing-Suicide-Drones", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Seoul, Aug 26 (IANS) North Korean leader Kim Jong-un has overseen a performance test of various drones, calling for the development and production of more drones to enhance war preparedness, state reported Monday.\nIn addition to constantly developing underwater strategic weapon systems and underwater suicide attack drones, he also raised the need for proactively introducing artificial intelligence technology into the development of drones.\nPhotos carried by the KCNA showed two white suicide attack drones hitting and destroying a mock target that looked like a South Korean K-2 tank.\nNorth Korea has unveiled photos of such weapons for the first time.\nIn July 2023, North Korea unveiled two types of new reconnaissance and multipurpose attack drones at an arms exhibition and a military parade."}, {"id": "5d0120b8-d773-4c7f-b5e5-ad7a7870c51f", "title": "North Korea Kim Jong Un oversees drone test", "date": "2024-08-26 01:30", "url": "https://www.voanews.com/a/north-korea-s-kim-jong-un-oversees-drone-test/7756863.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "North Korean leader Kim Jong Un oversaw a performance test of drones developed in the country, state media KCNA said Monday.\nOn Saturday, Kim visited the Drone Institute of North Korea's Academy of Defense Sciences — and viewed a successful test of drones correctly identifying and destroying designated targets after flying along different preset routes, KCNA said.\nKim called for the production of more suicide drones to be used in tactical infantry and special operation units, such as underwater suicide attack drones, as well as strategic reconnaissance and multi-purpose attack drones, KCNA said.\nKim also called for more tests of the drones' combat application, to equip North Korean military with them as early as possible, KCNA said.\nKim also inspected the construction sites of various North Korean industrial factories Saturday and Sunday, KCNA added."}, {"id": "28014be2-decf-456e-91b8-3b6f909dc54f", "title": "North Korea Kim Jong Un oversees drone test", "date": "2024-08-26 01:30", "url": "https://www.thestar.com.my/news/world/2024/08/26/north-korea039s-kim-jong-un-oversees-drone-test", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "SEOUL (Reuters) -North Korean leader Kim Jong Un watched as new \"suicide drones\" took off and destroyed test targets including a mock tank, and urged researchers to develop artificial intelligence for the unmanned vehicles, state media reported on Monday.\nKim called for the production of more suicide drones to be used in tactical infantry and special operation units, such as underwater suicide attack drones, as well as strategic reconnaissance and multi-purpose attack drones, KCNA said.\nSeoul's Unification Ministry said it was the first time Pyongyang had unveiled suicide drones.\nSeveral North Korean drones crossed the border into the South in 2022 and even briefly entered a no-fly zone surrounding Seoul's presidential office, before turning back.\nSouth Korea and the U.S. kicked off annual summertime military exercises last week, including practising responses to North Korean drones."}, {"id": "646b8283-dc3b-4a4e-8420-6d4218ae6114", "title": "North Korea Kim Jong - un oversees drone test", "date": "2024-08-26 02:45", "url": "https://www.asiaone.com/asia/north-koreas-kim-jong-un-oversees-drone-test", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "SEOUL — North Korean leader Kim Jong-un oversaw a performance test of drones developed in the country, state media outlet KCNA said on Aug 26.\nOn Aug 24, Kim visited the Drone Institute of North Korea's Academy of Defence Sciences and viewed a successful test of drones correctly identifying and destroying designated targets after flying along different preset routes, KCNA reported.\nKim called for the production of more suicide drones to be used in tactical infantry and special operation units, such as underwater suicide attack drones, as well as strategic reconnaissance and multi-purpose attack drones, according to KCNA.\nKim also called for more tests of the drones' combat application, to equip the North Korean military with them as early as possible, the media outlet added.\nKim also inspected the construction sites of various North Korean industrial factories on Aug 24 and 25, KCNA said."}, {"id": "6542b720-33b0-47d4-bb3f-add10144b6a1", "title": "North Korean leader supervises test of exploding drones , calls them crucial for war readiness - LocalNews8 . com", "date": "2024-08-26 03:30", "url": "https://localnews8.com/news/2024/08/25/north-korean-leader-supervises-test-of-exploding-drones-calls-them-crucial-for-war-readiness/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — North Korean state media say leader Kim Jong Un has supervised a demonstration of new exploding drones designed to crash into targets and is pledging to spur development of such weapons to boost his military’s war readiness.\nMost combat drones stand off from targets and attack with missiles.\nThe North’s state media say the drone test took place Saturday as the U.S. and South Korean militaries continue a large-scale exercise aimed at enhancing their combined capabilities to cope with North Korean threats.\nKIFI Local News 8 is committed to providing a forum for civil and constructive conversation.\nYou can review our Community Guidelines by clicking hereIf you would like to share a story idea, please submit it here."}, {"id": "4e13fc6d-6d49-42cd-bf66-f96f65dc8fcb", "title": " ( LEAD ) N . Korean leader calls for developing , producing more suicide drones", "date": "2024-08-26 00:45", "url": "https://en.yna.co.kr/view/AEN20240826000351315", "domain": "en.yna.co.kr", "domain_classification": "Unknown", "message": "\"It is necessary to develop and produce more suicide drones of various types to be used in tactical infantry and special operation units, as well as strategic reconnaissance and multi-purpose attack drones,\" Kim was quoted as saying by the KCNA.\nIn addition to constantly developing underwater strategic weapon systems and underwater suicide attack drones, he also raised the need for proactively introducing artificial intelligence technology into the development of drones.\nPhotos carried by the KCNA showed two white suicide attack drones hitting and destroying mock targets of what look like K-2 tanks.\nNorth Korea has unveiled photos of such weapons for the first time.\nIn July 2023, North Korea unveiled two types of new reconnaissance and multi-purpose attack drones at an arms exhibition and a military parade."}, {"id": "d5310b3e-76fc-4c2d-a95e-91dfdcb4c9db", "title": "North Korean leader supervises test of  suicide drones , calls them crucial for war readiness", "date": "2024-08-26 00:30", "url": "https://www.yahoo.com/news/north-korean-leader-supervises-test-001215313.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Independent journalists were not given access to cover the event depicted in this image distributed by the North Korean government.\nNorth Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s main K-2 battle tank.\nSouth Korea’s military said the Ssangyong Exercise, which will continue through Sept. 7, is aimed at sharpening combat interoperability.\nLee Chang Hyun, spokesperson of South Korea’s Joint Chiefs of Staff, said during a briefing that South Korea’s military was closely examining North Korea’s drone capabilities but did not provide a detailed assessment.\n“We are aware that during the past exchanges between North Korea and Russia that some (drones) were given (to North Korea) as gifts,” Lee said."}, {"id": "bf89bfeb-0eb0-4153-90b0-00d8ef823913", "title": "North Korean leader supervises test of exploding drones", "date": "2024-08-26 04:15", "url": "https://www.yahoo.com/news/north-korean-leader-supervises-test-034400152.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea — North Korean leader Kim Jong Un supervised a demonstration of new exploding drones designed to crash into targets and pledged to spur development of such weapons to boost his military’s war readiness, state media said Monday.\nNorth Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s K-2 main battle tank.\nThe test, which state media said took place Saturday, came as the U.S. and South Korean militaries are conducting a large-scale exercise aimed at enhancing their combined capabilities to defend against growing North Korean nuclear threats.\nThe allies said the drills, which continue through Thursday, are focused on enhancing their readiness against various North Korean threats and would also reflect lessons learned from recent armed conflicts.\nNorth Korea’s official Korean Central News Agency said Saturday’s test involved various types of drones built to fly different ranges to attack enemy targets on land and sea."}, {"id": "bd31231a-21ef-47b0-ba2b-0538c6c07058", "title": "North Korea conducts  suicide drone test , Kim Jong un calls for war preparedness", "date": "2024-08-26 03:45", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/north-korea-conducts-suicide-drones-test-kim-jong-un-calls-for-war-preparedness/articleshow/112792008.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "\"Kim said that global trends in military technologies and modern combat show the importance of drones in war and that the North's military should be equipped with advanced drones 'as early as possible.\nThese drills are intended to improve the allies' readiness against various threats from North Korea and incorporate lessons from recent armed conflicts.Animosity between North and South Korea is escalating as Kim Jong Un continues to fortify his nuclear-armed military and issue threats aimed at Washington and Seoul.\nDuring this event, he reiterated the need for an ongoing expansion of North Korea's nuclear program.The event has heightened concerns about North Korea's intentions on the Korean Peninsula.\nKim has indicated an aggressive stance with the potential deployment of battlefield nuclear weapons near the South Korean border.\nHe has suggested that North Korea might execute preemptive nuclear strikes if its leadership feels threatened.Analysts believe that Kim may be leveraging the current US election year to increase pressure, aiming to force Washington into accepting North Korea as a nuclear power."}, {"id": "62121b07-09f5-4804-b857-48e76abb3fd5", "title": "North Korean leader supervises test of exploding drones , calls them crucial for war readiness", "date": "2024-08-26 01:45", "url": "https://abcnews.go.com/International/wireStory/north-korean-leader-supervises-test-suicide-drones-calls-113141509", "domain": "abcnews.go.com", "domain_classification": "International", "message": "North Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s main K-2 battle tank.\nSouth Korea’s military said the Ssangyong Exercise, which will continue through Sept. 7, is aimed at sharpening combat interoperability.\nLee Chang Hyun, spokesperson of South Korea’s Joint Chiefs of Staff, said during a briefing that South Korea’s military was closely examining North Korea’s drone capabilities but did not provide a detailed assessment.\nSome analysts suggest the North Korean drones shown in state media photos resemble Russia’s Zala Lancet-3 drones, and Lee said the South was looking into the possibility Russia had helped North Korea acquire its drone capability.\n“We are aware that during the past exchanges between North Korea and Russia that some (drones) were given (to North Korea) as gifts,” Lee said."}, {"id": "22bf2b62-897d-4e99-8f38-114adfe6ad95", "title": "North Korean leader supervises test of exploding drones , calls them crucial for war readiness | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-08-26 04:30", "url": "https://www.asahi.com/ajw/articles/15401419", "domain": "asahi.com", "domain_classification": "Unknown", "message": "(AP Photo)SEOUL--North Korean leader Kim Jong Un supervised a demonstration of new exploding drones designed to crash into targets and pledged to spur development of such weapons to boost his military’s war readiness, state media said Monday.\nNorth Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s K-2 main battle tank.\nThe test, which state media said took place Saturday, came as the U.S. and South Korean militaries are conducting a large-scale exercise aimed at enhancing their combined capabilities to defend against growing North Korean nuclear threats.\nThe allies said the drills, which continue through Thursday, are focused on enhancing their readiness against various North Korean threats and would also reflect lessons learned from recent armed conflicts.\nNorth Korea’s official Korean Central News Agency said Saturday’s test involved various types of drones built to fly different ranges to attack enemy targets on land and sea."}, {"id": "30e0159c-4e2b-4414-821e-fe2201ad3b86", "title": "North Korean leader supervises test of exploding drones , calls them crucial for war readiness", "date": "2024-08-26 02:30", "url": "https://www.thestar.com/news/world/asia/north-korean-leader-supervises-test-of-exploding-drones-calls-them-crucial-for-war-readiness/article_31e46f30-dc17-5f92-a456-8a6fd18d6107.html", "domain": "thestar.com", "domain_classification": "Unknown", "message": "CountryUnited States of America US Virgin Islands United States Minor Outlying Islands Canada Mexico, United Mexican States Bahamas, Commonwealth of the Cuba, Republic of Dominican Republic Haiti, Republic of Jamaica Afghanistan Albania, People's Socialist Republic of Algeria, People's Democratic Republic of American Samoa Andorra, Principality of Angola, Republic of Anguilla Antarctica (the territory South of 60 deg S) Antigua and Barbuda Argentina, Argentine Republic Armenia Aruba Australia, Commonwealth of Austria, Republic of Azerbaijan, Republic of Bahrain, Kingdom of Bangladesh, People's Republic of Barbados Belarus Belgium, Kingdom of Belize Benin, People's Republic of Bermuda Bhutan, Kingdom of Bolivia, Republic of Bosnia and Herzegovina Botswana, Republic of Bouvet Island (Bouvetoya) Brazil, Federative Republic of British Indian Ocean Territory (Chagos Archipelago) British Virgin Islands Brunei Darussalam Bulgaria, People's Republic of Burkina Faso Burundi, Republic of Cambodia, Kingdom of Cameroon, United Republic of Cape Verde, Republic of Cayman Islands Central African Republic Chad, Republic of Chile, Republic of China, People's Republic of Christmas Island Cocos (Keeling) Islands Colombia, Republic of Comoros, Union of the Congo, Democratic Republic of Congo, People's Republic of Cook Islands Costa Rica, Republic of Cote D'Ivoire, Ivory Coast, Republic of the Cyprus, Republic of Czech Republic Denmark, Kingdom of Djibouti, Republic of Dominica, Commonwealth of Ecuador, Republic of Egypt, Arab Republic of El Salvador, Republic of Equatorial Guinea, Republic of Eritrea Estonia Ethiopia Faeroe Islands Falkland Islands (Malvinas) Fiji, Republic of the Fiji Islands Finland, Republic of France, French Republic French Guiana French Polynesia French Southern Territories Gabon, Gabonese Republic Gambia, Republic of the Georgia Germany Ghana, Republic of Gibraltar Greece, Hellenic Republic Greenland Grenada Guadaloupe Guam Guatemala, Republic of Guinea, Revolutionary People's Rep'c of Guinea-Bissau, Republic of Guyana, Republic of Heard and McDonald Islands Holy See (Vatican City State) Honduras, Republic of Hong Kong, Special Administrative Region of China Hrvatska (Croatia) Hungary, Hungarian People's Republic Iceland, Republic of India, Republic of Indonesia, Republic of Iran, Islamic Republic of Iraq, Republic of Ireland Israel, State of Italy, Italian Republic Japan Jordan, Hashemite Kingdom of Kazakhstan, Republic of Kenya, Republic of Kiribati, Republic of Korea, Democratic People's Republic of Korea, Republic of Kuwait, State of Kyrgyz Republic Lao People's Democratic Republic Latvia Lebanon, Lebanese Republic Lesotho, Kingdom of Liberia, Republic of Libyan Arab Jamahiriya Liechtenstein, Principality of Lithuania Luxembourg, Grand Duchy of Macao, Special Administrative Region of China Macedonia, the former Yugoslav Republic of Madagascar, Republic of Malawi, Republic of Malaysia Maldives, Republic of Mali, Republic of Malta, Republic of Marshall Islands Martinique Mauritania, Islamic Republic of Mauritius Mayotte Micronesia, Federated States of Moldova, Republic of Monaco, Principality of Mongolia, Mongolian People's Republic Montserrat Morocco, Kingdom of Mozambique, People's Republic of Myanmar Namibia Nauru, Republic of Nepal, Kingdom of Netherlands Antilles Netherlands, Kingdom of the New Caledonia New Zealand Nicaragua, Republic of Niger, Republic of the Nigeria, Federal Republic of Niue, Republic of Norfolk Island Northern Mariana Islands Norway, Kingdom of Oman, Sultanate of Pakistan, Islamic Republic of Palau Palestinian Territory, Occupied Panama, Republic of Papua New Guinea Paraguay, Republic of Peru, Republic of Philippines, Republic of the Pitcairn Island Poland, Polish People's Republic Portugal, Portuguese Republic Puerto Rico Qatar, State of Reunion Romania, Socialist Republic of Russian Federation Rwanda, Rwandese Republic Samoa, Independent State of San Marino, Republic of Sao Tome and Principe, Democratic Republic of Saudi Arabia, Kingdom of Senegal, Republic of Serbia and Montenegro Seychelles, Republic of Sierra Leone, Republic of Singapore, Republic of Slovakia (Slovak Republic) Slovenia Solomon Islands Somalia, Somali Republic South Africa, Republic of South Georgia and the South Sandwich Islands Spain, Spanish State Sri Lanka, Democratic Socialist Republic of St. Helena St. Kitts and Nevis St. Lucia St. Pierre and Miquelon St. Vincent and the Grenadines Sudan, Democratic Republic of the Suriname, Republic of Svalbard & Jan Mayen Islands Swaziland, Kingdom of Sweden, Kingdom of Switzerland, Swiss Confederation Syrian Arab Republic Taiwan, Province of China Tajikistan Tanzania, United Republic of Thailand, Kingdom of Timor-Leste, Democratic Republic of Togo, Togolese Republic Tokelau (Tokelau Islands) Tonga, Kingdom of Trinidad and Tobago, Republic of Tunisia, Republic of Turkey, Republic of Turkmenistan Turks and Caicos Islands Tuvalu Uganda, Republic of Ukraine United Ara"}, {"id": "3c63c7a8-f941-4b7f-a6c5-41ef91ca35b5", "title": "North Korean leader supervises test of exploding drones , calls them crucial for war readiness", "date": "2024-08-26 01:45", "url": "https://apnews.com/article/korea-kim-jong-un-suicide-drones-922a06354df8d10cb778e503632fe9f2", "domain": "apnews.com", "domain_classification": "International", "message": "North Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s main K-2 battle tank.\nSouth Korea’s military said the Ssangyong Exercise, which will continue through Sept. 7, is aimed at sharpening combat interoperability.\nLee Chang Hyun, spokesperson of South Korea’s Joint Chiefs of Staff, said during a briefing that South Korea’s military was closely examining North Korea’s drone capabilities but did not provide a detailed assessment.\nSome analysts suggest the North Korean drones shown in state media photos resemble Russia’s Zala Lancet-3 drones, and Lee said the South was looking into the possibility Russia had helped North Korea acquire its drone capability.\n“We are aware that during the past exchanges between North Korea and Russia that some (drones) were given (to North Korea) as gifts,” Lee said."}, {"id": "d9ea7dfb-e479-4591-ad83-b58bb111f5c0", "title": "North Korea news : Kim Jong Un supervises  suicide drone  tests , calls them crucial", "date": "2024-08-26 01:30", "url": "https://www.ctvnews.ca/world/north-korean-leader-supervises-test-of-suicide-drones-calls-them-crucial-for-war-readiness-1.7013957", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea -North Korean leader Kim Jong Un supervised a demonstration of new “suicide drones” and pledged to spur the development of such weapons to boost his military’s war readiness, state media said Monday.\nNorth Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s K-2 main battle tank.\nThe test, which state media said took place Saturday, came as the U.S. and South Korean militaries are conducting a large-scale exercise aimed at enhancing their combined capabilities to defend against growing North Korean nuclear threats.\nThe allies said the drills, which continue through Thursday, are focused on enhancing their readiness against various North Korean threats and would also reflect lessons learned from recent armed conflicts.\nNorth Korea’s official Korean Central News Agency said Saturday's test involved various types of drones built to fly different ranges to attack enemy targets on land and sea."}, {"id": "1811ddb9-d431-4b7a-9847-fb9e5b0597fd", "title": "North Korean leader supervises test of  suicide drones , calls them crucial for war readiness", "date": "2024-08-26 02:30", "url": "https://www.independent.co.uk/news/kim-jong-un-ap-south-korea-seoul-korean-central-news-agency-b2601739.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}North Korean leader Kim Jong Un supervised a demonstration of new “suicide drones” and pledged to spur the development of such weapons to boost his military’s war readiness, state media said Monday.\nNorth Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s K-2 main battle tank.\nThe test, which state media said took place Saturday, came as the U.S. and South Korean militaries are conducting a large-scale exercise aimed at enhancing their combined capabilities to defend against growing North Korean nuclear threats.\nThe allies said the drills, which continue through Thursday, are focused on enhancing their readiness against various North Korean threats and would also reflect lessons learned from recent armed conflicts."}, {"id": "c031cfac-9518-44f5-bbe5-52fb5312b58c", "title": "North Korean leader supervises test of exploding drones , calls them crucial for war readiness", "date": "2024-08-26 01:45", "url": "https://lasvegassun.com/news/2024/aug/25/north-korean-leader-supervises-test-of-exploding-d/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un supervised a demonstration of new exploding drones designed to crash into targets and pledged to spur development of such weapons to boost his military’s war readiness, state media said Monday.\nNorth Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s K-2 main battle tank.\nThe test, which state media said took place Saturday, came as the U.S. and South Korean militaries are conducting a large-scale exercise aimed at enhancing their combined capabilities to defend against growing North Korean nuclear threats.\nThe allies said the drills, which continue through Thursday, are focused on enhancing their readiness against various North Korean threats and would also reflect lessons learned from recent armed conflicts.\nNorth Korea’s official Korean Central News Agency said Saturday's test involved various types of drones built to fly different ranges to attack enemy targets on land and sea."}, {"id": "c1da86f5-90e5-4158-9e21-4fefd2565ac0", "title": "12 family - friendly Battle of Okinawa sites to visit", "date": "2024-08-26 02:30", "url": "https://okinawa.stripes.com/travel/battle-of-okinawa-sites.html", "domain": "okinawa.stripes.com", "domain_classification": "Unknown", "message": "TeamLab Future Park Okinawa, a popular interactive digital art experience for children, is across the street.\nOkinawa Army Hospital (Photo by Steph Pawelski) Okinawa Army Hospital (Photo by Steph Pawelski) The museum features a child-friendly room with age-appropriate activities.\nHimeyuri Peace Museum (Photo by Steph Pawelski) Himeyuri Peace Museum (Photo by Steph Pawelski) I had the honor of meeting seven Himeyuri student nurses that survived during the Battle of Okinawa.\nOkinawa Peace Memorial ParkFinish your adventures two-and-a-half miles to the southern tip of Okinawa.\nGPS: 26.0927862, 127.7207107 (coordinates are for at the bottom of the stairs, follow the signs to the entrance of the tunnel)For more on the battle sites in Okinawa, follow Okinawa Battle Sites on Facebook."}, {"id": "95f396b2-1d23-4d3c-a8ff-1ccec62fbc42", "title": "North Korean leader supervises test of  suicide drones , calls them crucial for war readiness – Winnipeg Free Press", "date": "2024-08-26 00:45", "url": "https://www.winnipegfreepress.com/world/2024/08/25/north-korean-leader-supervises-test-of-suicide-drones-calls-them-crucial-for-war-readiness", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "South Korea’s military said the Ssangyong Exercise, which will continue through Sept. 7, is aimed at sharpening combat interoperability.\nLee Chang Hyun, spokesperson of South Korea’s Joint Chiefs of Staff, said during a briefing that South Korea’s military was closely examining North Korea’s drone capabilities but did not provide a detailed assessment.\nSouth Korean army's K-9 self-propelled howitzers take positions in Paju, South Korea, near the border with North Korea, Monday, Aug. 19, 2024.\n(AP Photo/Ahn Young-joon)“We are aware that during the past exchanges between North Korea and Russia that some (drones) were given (to North Korea) as gifts,” Lee said.\nIndependent journalists were not given access to cover the event depicted in this image distributed by the North Korean government."}, {"id": "d875ac0a-cf89-4072-9331-9590869d0183", "title": "North Korea shows new drone attacking a target as Seoul and US hold large military exercises", "date": "2024-08-26 04:30", "url": "https://www.ksat.com/news/world/2024/08/26/north-korea-shows-new-drone-attacking-a-target-as-seoul-and-us-hold-large-military-exercises/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "South Korean army soldiers aim their machine guns as they control traffic during a civil defense drill as a part of the Ulchi Freedom Shield military exercise between the U.S. and South Korea in Seoul, South Korea, Thursday, Aug. 22, 2024.\nNorth Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s main K-2 battle tank.\nSouth Korea’s military said the Ssangyong Exercise, which will continue through Sept. 7, is aimed at sharpening combat interoperability.\nLee Chang Hyun, spokesperson of South Korea’s Joint Chiefs of Staff, said during a briefing that South Korea’s military was closely examining North Korea’s drone capabilities but did not provide a detailed assessment.\n“We are aware that during the past exchanges between North Korea and Russia that some (drones) were given (to North Korea) as gifts,” Lee said."}, {"id": "91be8f0d-0c8d-4dff-a3d0-67047d902f36", "title": "North Korea shows new drone attacking a target as Seoul and US hold large military exercises", "date": "2024-08-26 04:15", "url": "https://www.clickondetroit.com/news/world/2024/08/26/north-korea-shows-new-drone-attacking-a-target-as-seoul-and-us-hold-large-military-exercises/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "South Korean army soldiers aim their machine guns as they control traffic during a civil defense drill as a part of the Ulchi Freedom Shield military exercise between the U.S. and South Korea in Seoul, South Korea, Thursday, Aug. 22, 2024.\nNorth Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s main K-2 battle tank.\nSouth Korea’s military said the Ssangyong Exercise, which will continue through Sept. 7, is aimed at sharpening combat interoperability.\nLee Chang Hyun, spokesperson of South Korea’s Joint Chiefs of Staff, said during a briefing that South Korea’s military was closely examining North Korea’s drone capabilities but did not provide a detailed assessment.\n“We are aware that during the past exchanges between North Korea and Russia that some (drones) were given (to North Korea) as gifts,” Lee said."}, {"id": "247f7851-80e7-4bff-8565-0c9b3ca2b59f", "title": "North Korea shows new drone attacking a target as Seoul and US hold large military exercises", "date": "2024-08-26 03:45", "url": "https://www.local10.com/news/world/2024/08/26/north-korea-shows-new-drone-attacking-a-target-as-seoul-and-us-hold-large-military-exercises/", "domain": "local10.com", "domain_classification": "Unknown", "message": "South Korean army soldiers aim their machine guns as they control traffic during a civil defense drill as a part of the Ulchi Freedom Shield military exercise between the U.S. and South Korea in Seoul, South Korea, Thursday, Aug. 22, 2024.\nNorth Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s main K-2 battle tank.\nSouth Korea’s military said the Ssangyong Exercise, which will continue through Sept. 7, is aimed at sharpening combat interoperability.\nLee Chang Hyun, spokesperson of South Korea’s Joint Chiefs of Staff, said during a briefing that South Korea’s military was closely examining North Korea’s drone capabilities but did not provide a detailed assessment.\n“We are aware that during the past exchanges between North Korea and Russia that some (drones) were given (to North Korea) as gifts,” Lee said."}, {"id": "1707eef5-9bc7-4cd6-afd2-d6000b1fb931", "title": "North Korea shows new drone attacking a target as Seoul and US hold large military exercises", "date": "2024-08-26 04:15", "url": "https://www.clickorlando.com/news/world/2024/08/26/north-korea-shows-new-drone-attacking-a-target-as-seoul-and-us-hold-large-military-exercises/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "South Korean army soldiers aim their machine guns as they control traffic during a civil defense drill as a part of the Ulchi Freedom Shield military exercise between the U.S. and South Korea in Seoul, South Korea, Thursday, Aug. 22, 2024.\nNorth Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s main K-2 battle tank.\nSouth Korea’s military said the Ssangyong Exercise, which will continue through Sept. 7, is aimed at sharpening combat interoperability.\nLee Chang Hyun, spokesperson of South Korea’s Joint Chiefs of Staff, said during a briefing that South Korea’s military was closely examining North Korea’s drone capabilities but did not provide a detailed assessment.\n“We are aware that during the past exchanges between North Korea and Russia that some (drones) were given (to North Korea) as gifts,” Lee said."}, {"id": "cbc95c0e-94ac-4fd7-a0d2-9de5a674f544", "title": "North Korean leader supervises test of exploding drones , calls them crucial for war readiness | iNFOnews", "date": "2024-08-26 01:30", "url": "https://infotel.ca/newsitem/as-koreas-tensions/cp681962232", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "North Korea shows new drone attacking a target as Seoul and US hold large military exercisesSouth Korean army's K-9 self-propelled howitzers take positions in Paju, South Korea, near the border with North Korea, Monday, Aug. 19, 2024.\nNorth Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s main K-2 battle tank.\nSouth Korea’s military said the Ssangyong Exercise, which will continue through Sept. 7, is aimed at sharpening combat interoperability.\nLee Chang Hyun, spokesperson of South Korea’s Joint Chiefs of Staff, said during a briefing that South Korea’s military was closely examining North Korea’s drone capabilities but did not provide a detailed assessment.\n“We are aware that during the past exchanges between North Korea and Russia that some (drones) were given (to North Korea) as gifts,” Lee said."}, {"id": "b70c522e-0323-4e96-bfc6-59af0102cadb", "title": "What Is Happening In The Ukraine War Should Scare The Hell Out Of Us", "date": "2024-08-26 04:30", "url": "https://townhall.com/columnists/kurtschlichter/2024/08/26/what-is-happening-in-the-ukraine-war-should-scare-the-hell-out-of-us-n2643880", "domain": "townhall.com", "domain_classification": "Unknown", "message": "We are trying to refight the conventional Cold War model that won the Gulf War while also fighting the counterinsurgencies of the Global War on Terror.\nWhat we are not preparing to fight is the kind of war we are seeing in Ukraine.\nThe Russo-Ukraine War is a test bed for new technologies overlaid over old styles of warfare, particularly the static, dug-in trench warfare of World War I.\nImagine America going into a fight with its limited or completely defeated precision strike capabilities.\nWe are giving away much of it to Ukraine and Israel, as well as blowing it off slap-fighting the Houthis."}, {"id": "5e2f8c23-2809-4e49-9bdb-768cb810ec05", "title": "Rajnath Singh visits top naval facilities & holds discussions to bolster US - India defence ties", "date": "2024-08-26 01:15", "url": "https://www.dailyexcelsior.com/rajnath-singh-visits-top-naval-facilities-holds-discussions-to-bolster-us-india-defence-ties/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "The LCC is one of the world’s largest and most technically advanced water tunnel facilities for testing submarines, torpedoes, naval surface ships and propellers.\nThe LCC is part of the Naval Surface Warfare Center Carderock Division, one of the Navy’s preeminent research and development facilities that specialises in critical ship and submarine design.\nEarlier, Singh visited the Naval Surface Warfare Centre at Carderock, Maryland.\nSo, we are committed to deepening naval cooperation, to doing more together with unmanned technology, and to strengthening undersea domain awareness,” he said.\nThe proposed sale of this equipment and support will not alter the basic military balance in the region."}, {"id": "b17a9b66-43ad-4e26-b00e-50ba5beaf6b5", "title": "Shoplifters & Scammers : At War with the Law", "date": "2024-08-26 04:15", "url": "https://www.tvguide.co.uk/schedule/ce1e1552-a89d-5dfe-b2c5-a53e020adc50/shoplifters-and-scammers-at-war-with-the-law", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Shoplifters & Scammers: At War with the Law5STAR 10:00 AM to 11:00 AM Monday 26 August Share Add toCalendar +Episode 21 S SubtitlesDocumentary following shopping centre security teams who are locked in a cat and mouse battle to catch criminalsShoplifters & Scammers: At War with the Law airs on 5STAR at 10:00 AM, Monday 26 August .\n(Subtitles.)\nLearn more about Shoplifters & Scammers: At War with the Law and other education/science/factual topics on our factual page"}, {"id": "de4ca819-39c1-4f78-b804-e490bcff1c57", "title": "Rajnath Singh visits US Naval Warfare Centre , explores collaboration on Indigenous defence technologies – Indian Defence Research Wing", "date": "2024-08-26 03:15", "url": "https://idrw.org/rajnath-singh-visits-us-naval-warfare-centre-explores-collaboration-on-indigenous-defence-technologies/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "During his visit, Rajnath Singh was briefed about the centre’s operations and the usage of the tunnel, which is used to test submarines, torpedoes, naval surface ships, and propellers.\nThe Indian Ambassador to the US, the Director General of the Indian Navy, naval operations personnel, and defence technology advisors from the Defence Research and Development Organisation (DRDO) accompanied the Defence Minister.\nThe visit was facilitated by the US Navy’s Deputy Under Secretary, who welcomed Rajnath Singh.\nThe Commander and Technical Director of the Naval Surface Warfare Center provided detailed insights during the visit, the Defence Ministry said in a statement.\nIn a post on social media platform X, the Defence Minister posted, “Visited Naval Surface Warfare Centre at Carderock and witnessed the pathbreaking experiments at the facility."}, {"id": "c270ce16-f403-4dcb-b990-de3c6bff477b", "title": "Philippines  will be a target  in event of nuclear war between China and US , analysts warn", "date": "2024-08-26 00:30", "url": "https://www.scmp.com/week-asia/politics/article/3275703/philippines-will-be-target-event-nuclear-war-between-china-and-us-analysts-warn", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Manila allowing the US access to its military camps and to deploy a new missile system in the country were aggravating factors, Beleno said.\nEspeña urged the Philippine armed forces to bolster their own dedicated air defence systems with robust munition stockpiles and advanced electronic warfare capabilities.\n“The Philippine military must also have its air defence system that has a significant amount of munition stockpile.\nBut Espeña warns that in the event of nuclear war, China could potentially disable these forward operating US units, leaving the Philippines “isolated to fight on its own”.\nPhoto: US ArmyThe US Typhon missile launcher system was deployed to the Philippines in April for the countries’ annual Balikatan joint military exercises."}, {"id": "7666020e-32a2-4118-b6b8-cef212f41b97", "title": "North Korean leader supervises test of exploding drones , calls them crucial for war readiness", "date": "2024-08-26 01:30", "url": "https://keyt.com/news/2024/08/25/north-korean-leader-supervises-test-of-suicide-drones-calls-them-crucial-for-war-readiness/", "domain": "keyt.com", "domain_classification": "Unknown", "message": "All live broadcasts stream live.\nThe most recent newscast repeats when we are not live.\nLIVE NEWSCAST SCHEDULE*All times Pacific*Schedule subject to change based on special events, simulcasts and breaking news.\nWeekdays:5:00 a.m. – 8:00 a.m.11:00 a.m. – 11:30 a.m.4:00 p.m. – 5:30 p.m.6:00 p.m. – 7:00 p.m.10:00 p.m. – 11:35 p.m.Saturdays:6:00 p.m. – 6:30 p.m.10:00 p.m. – 10:30 p.m.11:00 p.m. – 11:30 p.m.Sundays:6:00 p.m. – 7:00 p.m.10:00 p.m. – 10:30 p.m.11:00 p.m. – 11:30 p.m."}, {"id": "5609c422-bcd4-416a-8c30-96586d6dee21", "title": "North Korean leader supervises test of exploding drones , calls them crucial for war readiness", "date": "2024-08-26 02:30", "url": "https://abc17news.com/news/2024/08/25/north-korean-leader-supervises-test-of-exploding-drones-calls-them-crucial-for-war-readiness/", "domain": "abc17news.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — North Korea says leader Kim Jong Un has supervised a demonstration of new exploding drones designed to crash into targets and is pledging to spur development of such weapons to boost his military’s war readiness.\nKim has been flaunting his growing military capabilities amid tensions with Washington and Seoul.\nNorth Korean photos of the test showed a white drone supposedly crashing into and destroying a target resembling a South Korean battle tank.\nNorth Korea’s drone display comes as the U.S. and South Korean militaries continue a large-scale exercise aimed at enhancing their combined capabilities to cope with North Korean threats.\nYou can review our Community Guidelines by clicking hereIf you would like to share a story idea, please submit it here."}, {"id": "d5e7c9dc-7f93-4390-990e-f63515106bb8", "title": "Ukraine new gamble : Taking the war to the Russians - Opinion", "date": "2024-08-26 01:45", "url": "https://www.dailymirror.lk/opinion/Ukraines-new-gamble-Taking-the-war-to-the-Russians/231-290282", "domain": "dailymirror.lk", "domain_classification": "Unknown", "message": "But Ukraine shocked everyone by taking the war to Russia.\nEven as Ukrainian forces attacked Kursk, the Russians were only 10 km from the city of Pokrovsk, and Ukrainian authorities began evacuating civilians.\nThis Ukrainian military adventure is reminiscent of Germany’s bold but futile winter offensive of 1944, when Allied armies were poised to invade Germany.\nIncidentally, the biggest tank battle of World War II took place in the Kursk salient in World War II.\nThe Ukrainian incursion into Kursk is the first time German tanks were used in Russian soil."}, {"id": "79b3e5d9-7d95-475f-805b-e8ca39ad0c60", "title": "The Hindu Morning Digest : August 26 , 2024", "date": "2024-08-26 02:00", "url": "https://www.thehindu.com/news/morning-digest-august-25-2024/article68566703.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "At 11:30 pm on August 25, the deep depression lay centred near 70 km south-southeast of Chittorgarh, Rajasthan.\nIsrael’s Netanyahu warns strikes in Lebanon ‘not the final word’Israeli Prime Minister Benjamin Netanyahu warned that Sunday's (August 25, 2024) strikes in Lebanon were \"not the final word\" in his country's military campaign against Lebanese armed group Hezbollah.\nOn Saturday (August 24, 2024), Leader of the Opposition in Lok Sabha Rahul Gandhi, positioned caste census as an essential step of a policy framework that ensures justice.\nCoaches of Dhanbad-bound train uncouple in U.P., none hurtAt least 10 bogies of the Dhanbad-bound Ganga Sutlej Express train got uncoupled near the Chakraj Mal area here early Sunday (August 25, 2024), officials said.\nParis Paralympics: Jackie Chan to carry torch ahead of opening ceremonyHong Kong-born martial arts actor Jackie Chan was named on Sunday (August 25, 2024) as one of the torchbearers in the lead-up to the opening ceremony of the Paralympics in Paris."}, {"id": "2a0fd08e-75e7-47a4-a8fd-292eaf425601", "title": "North Korea Kim supervises test of exploding drones", "date": "2024-08-26 04:00", "url": "https://www.sconeadvocate.com.au/story/8742392/north-koreas-kim-supervises-test-of-exploding-drones/", "domain": "sconeadvocate.com.au", "domain_classification": "Unknown", "message": "North Korea's official Korean Central News Agency said Saturday's test involved various types of drones built to fly different ranges to attack enemy targets on land and sea.\nIt said the drones flew along various routes before accurately hitting test targets."}, {"id": "8df905aa-a230-4e7f-9526-8a1a9b1d40f9", "title": "North Korea Kim supervises test of exploding drones", "date": "2024-08-26 03:15", "url": "https://www.edenmagnet.com.au/story/8742392/north-koreas-kim-supervises-test-of-exploding-drones/?cs=14264", "domain": "edenmagnet.com.au", "domain_classification": "Unknown", "message": "North Korea's official Korean Central News Agency said Saturday's test involved various types of drones built to fly different ranges to attack enemy targets on land and sea.\nIt said the drones flew along various routes before accurately hitting test targets."}, {"id": "22ab04f4-2372-4b81-9e12-6d0a192cc153", "title": "North Korea Kim supervises test of exploding drones", "date": "2024-08-26 03:15", "url": "https://www.maitlandmercury.com.au/story/8742392/north-koreas-kim-supervises-test-of-exploding-drones/?cs=7607", "domain": "maitlandmercury.com.au", "domain_classification": "Unknown", "message": "North Korea's official Korean Central News Agency said Saturday's test involved various types of drones built to fly different ranges to attack enemy targets on land and sea.\nIt said the drones flew along various routes before accurately hitting test targets."}, {"id": "0acfa45c-5a6d-40d5-a837-85cda5f15ebb", "title": "China strengthens Myanmar border with  armed and air - to - ground  joint PLA patrols", "date": "2024-08-26 02:00", "url": "https://www.scmp.com/news/china/military/article/3275860/china-strengthens-myanmar-border-armed-and-air-ground-joint-pla-patrols", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "China’s People’s Liberation Army will conduct a three-day live fire drill from Tuesday on the Chinese side of the China- Myanmar border, according to the provincial government of Yunnan in the country’s southwest.\nThe destabilising situation is posing a challenge to China’s border security.\nThere are also concerns about the security of Chinese assets and personnel in the border region.\n09:33 Myanmar’s military government lost direct control over 86% of its territory after months of fighting Myanmar’s military government lost direct control over 86% of its territory after months of fightingBeijing held two live fire drills in April on its border with Myanmar as concerns over the country’s security state grow.\nYunnan province shares around 2,000km (1,240 miles) of border with Myanmar, and China has invested heavily in its neighbour over the years, even after Myanmar’s 2021 military coup."}, {"id": "2deb69d7-6266-49d2-9f38-05f34f093cdb", "title": "Rise of the Nazis : Dictators at War", "date": "2024-08-26 04:15", "url": "https://www.tvguide.co.uk/schedule/10d4a185-663c-5151-bb24-e0bb4098d95f/rise-of-the-nazis-dictators-at-war", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Rise of the Nazis: Dictators at WarU&Yesterday 10:00 AM to 11:00 AM Monday 26 August Share Add toCalendar +Stalingrad Season 2 Episode 2 of 3 S SubtitlesIn January 1942 the German army loses the battle for Moscow and a furious Hitler sacks or side-lines his top generals and appoints himself commander-in-Chief of the army.\nHe decides on a bold new plan, focusing his forces on seizing the Soviets oil fields and stealing the fuel from the Red Army to supply his own.\nStalin unveils his own plan to drive the Germans out of the Soviet Union by launching a huge offensive from Leningrad to the Black Sea.\nZhukov warns him that the Red Army is in no shape to attack, but Stalin banishes the former chief of the general staff to the front and takes controlRise of the Nazis: Dictators at War airs on U&Yesterday at 10:00 AM, Monday 26 August .\nLearn more about Rise of the Nazis: Dictators at War and other education/science/factual topics on our factual pageTopics Education ➝ Science ➝ Factual Topics History News ➝ Current Affairs Documentary"}, {"id": "17f2076d-d478-48de-83c4-2f2d87d983f8", "title": "What Hezbollah leader Nasrallah said on possibility of  future attack and other takeaways", "date": "2024-08-26 00:15", "url": "https://timesofindia.indiatimes.com/world/middle-east/israel-hamas-war-what-hezbollah-leader-nasrallah-said-on-possibility-of-future-attacks-and-other-takeaways-from-address-middle-east-tensions/articleshow/112788124.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "According to Nasrallah, Hezbollah executed their operation \"as planned,\" and the group had deliberately avoided targeting civilians or critical infrastructure, including Ben Gurion Airport in Tel Aviv.\nAdditionally, attack drones were deployed, including those launched from the eastern Bekaa Valley—a first for the group.\nNasrallah said that none of Hezbollah's launch platforms were damaged by Israeli preemptive strikes.Nasrallah also addressed Israeli assertions that Hezbollah had intended to fire thousands of projectiles, clarifying that the group had not planned a more extensive attack.\nNetanyahu claimed that the Israel Defense Forces (IDF) had successfully intercepted all drones aimed at strategic locations near Tel Aviv, including the Mossad headquarters.The early Sunday exchange saw Hezbollah launching a significant barrage of rockets and drones, prompting a substantial Israeli military response involving around 100 jets.\nThe armed wing of Hamas claimed responsibility for this incident."}, {"id": "43fc0dc2-ee91-43ea-abdd-b07ead9017e2", "title": "Israel strikes Lebanon , Hezbollah hits back", "date": "2024-08-26 00:15", "url": "https://timesofindia.indiatimes.com/world/middle-east/israel-strikes-lebanon-hezbollah-hits-back/articleshow/112787721.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "JERUSALEM: Israel struck Lebanon with around 100 jets early Sunday in what it called a preemptive strike to avert a large Hezbollah rocket and missile attack.\nIt was one of the biggest clashes in more than 10 months of border warfare .Israel's military said one soldier with the navy was killed and two others wounded.\nHezbollah said its attack involved more than 320 Katyusha rockets aimed at multiple sites in Israel and a “large number” of drones.\nAir raid sirens were reported throughout northern Israel, and Israel’s international airport closed and diverted flights for about an hour.\nIsrael’s Home Front Command later lifted restrictions in most areas.An Israeli military spokesman said Hezbollah intended to hit targets in northern and central Israel."}, {"id": "1c068b43-e1c6-49c1-9a1a-75eec22d359a", "title": "Israel and Hezbollah continue missile exchange amid escalation fears", "date": "2024-08-26 02:00", "url": "https://www.japantimes.co.jp/news/2024/08/26/world/israel-hezbollah-missile-escalation/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "After 100 Israeli warplanes swooped over southern Lebanon, taking out thousands of Hezbollah missile launchers in what was called a preemptive strike, the Middle East is braced for an expanded conflagration that could involve Iran and its allied militias.\nThe assault started at 5 a.m. local time Sunday and was based, Israeli officials said, on precise intelligence that Hezbollah was about to fire thousands of missiles at northern Israel as well as aiming drones at a key intelligence center just north of Tel Aviv in retaliation for the killing of its commander in July.\nIsrael declared a 48-hour state of emergency and shut its main airport for several hours, with numerous foreign airlines canceling flights.\nHezbollah responded by firing more than 200 projectiles, according to Israel, although officials said very limited damage was caused.\nOne Israeli soldier was killed by falling debris, while three deaths were reported in Lebanon."}, {"id": "66fd24a3-e4d5-414b-823f-a5c7932705f7", "title": "North Korean leader supervises test of  suicide drones , calls them crucial for war readiness", "date": "2024-08-26 01:15", "url": "https://toronto.citynews.ca/2024/08/25/north-korea-leader-supervises-test-of-suicide-drones-calls-them-crucial-for-war-readiness/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "North Korean photos of the test showed a white drone with X-shaped tails and wings supposedly crashing into and destroying a target resembling South Korea’s main K-2 battle tank.\nSouth Korea’s military said the Ssangyong Exercise, which will continue through Sept. 7, is aimed at sharpening combat interoperability.\nLee Chang Hyun, spokesperson of South Korea’s Joint Chiefs of Staff, said during a briefing that South Korea’s military was closely examining North Korea’s drone capabilities but did not provide a detailed assessment.\nSome analysts suggest the North Korean drones shown in state media photos resemble Russia’s Zala Lancet-3 drones, and Lee said the South was looking into the possibility Russia had helped North Korea acquire its drone capability.\n“We are aware that during the past exchanges between North Korea and Russia that some (drones) were given (to North Korea) as gifts,” Lee said."}, {"id": "51153b59-4210-4c57-9957-02a9f47a1fab", "title": "Upcoming Japanese eShop releases for the week of August 29 , 2024", "date": "2024-08-26 01:45", "url": "https://nintendoeverything.com/upcoming-japanese-eshop-releases-for-the-week-of-august-29-2024/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "Posted on August 25, 2024 by Brian @NE_Brian ) in NewsNintendo has updated the Japanese release schedule on Switch for the week of August 29, 2024.\nHere’s a look at the upcoming digital download schedule:Switch RetailEmio – The Smiling Man: Famicom Detective ClubEverlasting FlowersgoHELLgo: TsukiotoshitekoGundam Breaker 4Kamibako: Mythology of CubeKyokkou no Marriage episode LIA (available August 30)My9Swallows Topstars LeagueShadow of the Ninja RebornUmamusume: Pretty Derby – Party Dash (available August 30)Witch Spring RSwitch DownloadAcquire Knowledge Through Quizzes: Sun Tzu’s Art of WarBadminton TimeBrain Training Letter Search: Find Letters and Train Your BrainCan of WormholesDepths of SanityDice Puzzle 10Eggconsole Xanadu Scenario II PC-8801mkIISRForests, Field and Fortresses (available August 30)Fruit AttackKamuchun City ConcertoKoi-Koi JapanLearn Through Games: Sengoku Period Quiz BattleMemento Memoria: The Abandoned NeverlandMonster Jam ShowdownPurrfect RescueRuthless Carnage HotlineSokoPenguinSpirited Away Mystery: Missing Detective – Unsolved Case Mystery Solving Suspense GameSuper Rewind or DieSurvivor HeroesThe Knight’s PathVoltaire: The Vegan VampireSourceShare this:Related"}, {"id": "5078df34-de0f-4705-b5a2-545845924725", "title": "Ukraine Kursk incursion is part of broader effort for  fair peace  ", "date": "2024-08-26 00:45", "url": "https://fortune.com/2024/08/25/ukraine-kursk-incursion-russia-fair-peace-vladimir-putin-volodymyr-zelenskiy/", "domain": "fortune.com", "domain_classification": "Unknown", "message": "Ukraine’s operation in Russia’s Kursk region is part of a broader military, political and diplomatic effort aimed at making Russia accept a “fair peace,” said President Volodymyr Zelenskiy.\n“Everything we do is for the purpose of forcing Russia be ready for fair peace,” Zelenskiy told Indian journalists in Kyiv on Sunday, according to his Telegram.\nUkraine took under its control two more settlements in Kursk region, he said in a daily video statement.\nUkraine’s leader also discussed with the visiting media Ukraine’s planned second peace summit, his meeting with Indian Prime Minister Narendra Modi on Friday, and Kyiv’s hoped-for integration into the European Union.\nUkrainian forces launched a surprise incursion into Russia’s Kursk region this month."}, {"id": "dbffa643-e9f8-45e6-983e-b33b6b37d2a4", "title": "China – Firstpost", "date": "2024-08-26 04:15", "url": "https://www.firstpost.com/world/china-conducts-military-patrols-near-myanmar-border-amid-growing-security-concerns-13808172.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "In the statement, the country’s military stated that the troops were organised to “carry out border armed patrols and air-to-ground joint patrols”.\nThey went to Ruili and Zhenkang on Monday for the operation, South Morning China Post (SCMP) reported.\nAdvertisementThe patrols by the Chinese army and airforce follow the rise in violence and the prolonged civil war that has rocked neighbouring Myanmar.\nHence, the PLA noted that the destabilising situation is posing a major challenge to China’s border security, SCMP reported.\nThere are also major concerns about the security of the Chinese assets and personnel in the border region."}, {"id": "a4a32bb2-4aec-44ee-b97e-b0c53a677853", "title": "Millions of Shiite Muslim pilgrims rally in Iraq", "date": "2024-08-26 02:00", "url": "https://www.voanews.com/a/millions-of-shiite-muslim-pilgrims-rally-in-iraq/7756538.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "More than 21 million Shiite Muslims took part in the Arbaeen pilgrimage in Iraq this year, which reached its peak Sunday with attendees displaying their support for Gaza.\nThis year, the events have included prominent displays of Palestinian flags by pilgrims, AFP photographers reported, amid the war in Gaza.\n\"The total number of Arbaeen pilgrims... reached 21,480,525,\" the institution that manages the Abbas mausoleum and is responsible for the count, said.\nAmong them were about 3.5 million Iranian pilgrims, according to official figures reported in Tehran.\nThe Arbaeen celebrations, which always take place amid tight security, drew around 22 million pilgrims last year, according to official figures."}, {"id": "fff054bb-c47d-481a-bb35-8d950297a993", "title": "Putin Meets With Commanders as Zelenskiy Speaks of  Fair Peace  ", "date": "2024-08-26 01:30", "url": "https://www.yahoo.com/news/putin-meets-commanders-zelenskiy-speaks-201753892.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(Bloomberg) -- Ukraine’s operation in Russia’s Kursk region is part of a broader military, political and diplomatic effort aimed at making Russia accept a “fair peace,” said President Volodymyr Zelenskiy.\nMost Read from Bloomberg“Everything we do is for the purpose of forcing Russia be ready for fair peace,” Zelenskiy told Indian journalists in Kyiv on Sunday, according to his Telegram.\nUkraine took under its control two more settlements in Kursk region, he said in a daily video statement.\nUkrainian forces launched a surprise incursion into Russia’s Kursk region this month.\nThe Kremlin on Saturday released video of Putin meeting with Valery Gerasimov, chief of the Russian Armed Forces General Staff."}, {"id": "47a9ba62-fcae-476c-9716-d835c4369d8a", "title": "Gold edges higher as Fed backs September easing", "date": "2024-08-26 03:15", "url": "https://economictimes.indiatimes.com/markets/commodities/news/gold-edges-higher-as-fed-backs-september-easing/articleshow/112792127.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "It seems like you're already an ETPrime member withLogin using your ET Prime credentials to enjoy all member benefitsLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."}, {"id": "0287f2fd-d643-4d63-8353-b46fd5207696", "title": "Paris commemorates 80th anniversary of liberation in WWII", "date": "2024-08-26 00:45", "url": "https://www.yahoo.com/news/paris-commemorates-80th-anniversary-liberation-001201320.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Paris on Sunday celebrated the 80th anniversary of its liberation from German troops in World War II with tributes, military marches and the hoisting of a flag at the Eiffel Tower.\nOn August 25, 1944, the 2nd French Armoured Division entered the capital under the command of General Philippe Leclerc de Hautecloque, ending 1,500 days of German occupation.\nOn Sunday a parade followed one of the itineraries of the French division from the south of the capital to its centre.\nThe parade featured vintage military vehicles, as surviving veterans of the 2nd Armoured Division looked on.\nOn Saturday night, Paris city hall was the venue for a brass band performance, a concert and a dance."}, {"id": "7e85fbd4-38eb-4fa2-927b-554ca4d8a20a", "title": "Paris commemorates 80th anniversary of liberation in WWII", "date": "2024-08-26 03:45", "url": "https://www.digitaljournal.com/world/paris-commemorates-80th-anniversary-of-liberation-in-wwii/article", "domain": "digitaljournal.com", "domain_classification": "Unknown", "message": "Reenactors dressed in wartime uniforms parade on vintage military vehicles during a reenactment marking the 80th anniversary of the liberation of Paris from the Germans during World War II - Copyright AFP/File JEAN-SEBASTIEN EVRARDParis on Sunday celebrated the 80th anniversary of its liberation from German troops in World War II with tributes, military marches and the hoisting of a flag at the Eiffel Tower.\nOn August 25, 1944, the 2nd French Armoured Division entered the capital under the command of General Philippe Leclerc de Hautecloque, ending 1,500 days of German occupation.\nOn Sunday a parade followed one of the itineraries of the French division from the south of the capital to its centre.\nThe parade featured vintage military vehicles, as surviving veterans of the 2nd Armoured Division looked on.\nOn Saturday night, Paris city hall was the venue for a brass band performance, a concert and a dance."}, {"id": "2163822b-91b3-4e29-8e41-5411ccbc3748", "title": "DOJ sues RealPage , alleging software contributed to meteoric rents", "date": "2024-08-26 03:15", "url": "https://www.wtvr.com/us-news/housing/doj-sues-realpage-alleging-software-contributed-to-meteoric-rents", "domain": "wtvr.com", "domain_classification": "Unknown", "message": "The lawsuit is being filed alongside attorneys general from eight states, including California and North Carolina.\nThe DOJ believes that this algorithm helped get landlords on the same page, undercutting competition that would usually help keep prices lower.\n\"Competing landlords agree to submit to RealPage on a daily basis their most sensitive nonpublic information, including rental rates, lease terms and projected vacancies.\nAs both sides move to the next phase, Jaafar says RealPage has a battle ahead.\nWhat RealPage is going to have to do is just fight this and fight this in the public spectrum,\" said Jaafar."}, {"id": "6816f42f-235a-4238-965e-f1352b3203ea", "title": "Oil climbs on Mideast escalation fears , US rate cut expectations", "date": "2024-08-26 00:15", "url": "https://finance.yahoo.com/news/oil-climbs-mideast-escalation-fears-232921825.html", "domain": "finance.yahoo.com", "domain_classification": "Unknown", "message": "\"Geopolitical risk factors will likely influence the oil market significantly,\" said Kelvin Wong, a senior market analyst at OANDA in Singapore.\nBoth oil benchmarks gained more than 2% on Friday after U.S. Federal Reserve Chair Jerome Powell endorsed an imminent start to interest rate cuts.\nStill, oil prices were down last week as a poor outlook for major economies weighed on fuel demand, the bank added.\n\"The cartel had recently trimmed its outlook for global oil demand, citing concerns over weak demand in top oil importer China,\" she said.\nThe number of operating U.S. oil rigs were unchanged at 483 last week, Baker Hughes said in its weekly report."}, {"id": "ae657c60-e6de-4f19-b6a1-be5283af7405", "title": "Paris commemorates 80th anniversary of liberation in WWII", "date": "2024-08-26 03:00", "url": "https://www.guampdn.com/news/national/paris-commemorates-80th-anniversary-of-liberation-in-wwii/article_5f15d766-2712-5d48-b628-3412d56de329.html", "domain": "guampdn.com", "domain_classification": "Unknown", "message": "Paris on Sunday celebrated the 80th anniversary of its liberation from German troops in World War II with tributes, military marches and the hoisting of a flag at the Eiffel Tower.\nOn August 25, 1944, the 2nd French Armoured Division entered the capital under the command of General Philippe Leclerc de Hautecloque, ending 1,500 days of German occupation.\nOn Sunday a parade followed one of the itineraries of the French division from the south of the capital to its centre.\nThe parade featured vintage military vehicles, as surviving veterans of the 2nd Armoured Division looked on.\nOn Saturday night, Paris city hall was the venue for a brass band performance, a concert and a dance."}, {"id": "23279c52-f43a-4af2-bc4d-afda59e7fffa", "title": "Oil climbs on Mideast escalation fears , US rate cut expectations", "date": "2024-08-26 01:45", "url": "https://www.marketscreener.com/quote/index/S-P-GSCI-PETROLEUM-INDEX-46869201/news/Oil-climbs-on-Mideast-escalation-fears-US-rate-cut-expectations-47728435/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "SINGAPORE (Reuters) - Oil prices extended gains on Monday on fears a major spillover in fighting from the Gaza conflict into the Middle East could disrupt regional oil supplies, while imminent U.S. interest rate cuts lifted the global economic and fuel demand outlook.\nBoth oil benchmarks gained more than 2% on Friday after U.S. Federal Reserve Chair Jerome Powell endorsed an imminent start to interest rate cuts.\nStill, oil prices were down last week as a poor outlook for major economies weighed on fuel demand, the bank added.\nThe U.S. Energy Department said on Friday it bought nearly 2.5 million barrels of oil to help replenish the Strategic Petroleum Reserve.\nThe number of operating U.S. oil rigs were unchanged at 483 last week, Baker Hughes said in its weekly report."}]