[{"id": "5c7092af-7be6-46a7-b273-0316ae06696a", "title": "At least 11 killed in Russian strike on shopping centre in eastern Ukraine", "date": "2024-08-09 17:45", "url": "https://www.lbc.co.uk/news/russia-strike-shopping-centre-eastern-ukraine-kostiantinyvka/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "At least 11 killed in Russian strike on shopping centre in eastern UkraineAt least 11 people have died in the missile strike.\nPicture: AlamyBy Kit HerenAt least 11 people have been killed in a Russian airstrike on a shopping centre in eastern Ukraine.\nSome 45 people were injured in the missile strike on the large Ecomarket shop in the town of Kostiantynivka in the Donetsk region.\nA large fire that stretched for 1,000 square metres broke out after the Russian strike, Ukrainian authorities said.\nFirefighters extinguish the fire after a Russian missile hit a supermarket in Kostiantynivka, Donetsk region, Ukraine, Friday, Aug. 9, 2024."}, {"id": "a14cb861-943d-4aed-86b2-e5171bad2e20", "title": "US warns Iran of  serious risk  of escalation if it attacks Israel : report", "date": "2024-08-09 01:15", "url": "https://www.foxnews.com/world/us-warns-iran-serious-risk-escalation-attacks-israel-report", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "The U.S. has reportedly warned Iran a retaliatory attack on Israel for the recent killing of a senior Hamas leader in Tehran would pose a \"serious risk\" for Iran’s economy and government and likely escalate the months-long conflict between Israel and Hamas.\nA U.S. official told The Wall Street Journal the U.S. has communicated to Iran that the risk of a major escalation is \"extremely high\" if it carries out a retaliatory attack.\nIran has signaled its intention to strike back at Israel, though the exact scope and timing of a potential attack are not clear.\nThat’s in contrast to Iran’s highly anticipated missile and drone attack on Israel in April in retaliation for Israel killing a senior Iranian paramilitary commander in Syria.\nThese developments come as Qatari, Egyptian and U.S. leaders have urged Israel to resume talks with Hamas Aug. 15."}, {"id": "f8f35b7d-12e3-458c-9c0f-074301026efd", "title": "Powerful Explosions In Crimea : Neptunes Hit Belbek Airbase", "date": "2024-08-09 11:00", "url": "https://charter97.org/en/news/2024/8/9/606043/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Powerful Explosions In Crimea: Neptunes Hit Belbek Airbase 1 9.08.2024, 7:5023,392The occupants reported a massive attack.\nAt the same time, the Crimean Wind Telegram channel reported that gunfire was heard in Chernomorske, and one \"strong explosion.\"\nThe media outlet later reported that there was another explosion in Chernomorske, and locals said that they \"hit something when there was the first explosion.\"\nAnd then \"Crimean Wind\" informed that explosions from the direction of Chernomorske were heard in the village of Krasnoselske.\nAt 02.53 a subscriber of \"Crimean Wind\" reported a strong explosion near Pionerske outside Simferopol."}, {"id": "a5373db1-0269-4c54-a224-0682c6dfe77a", "title": "Iran advanced drones and missiles pose serious threat to Israel Iron Dome air defense system , U . S . report warns – NaturalNews . com", "date": "2024-08-09 07:30", "url": "https://www.naturalnews.com/2024-08-08-iran-advanced-drones-missiles-israel-iron-dome.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "A massive assault could test the country's air defense capabilities beyond the limits of the Iron Dome.\nThe system is not designed to intercept many of Iran’s advanced drones and ballistic missiles.\nThe Iron Dome, Israel's advanced air defense system, is tasked with intercepting these threats.\nHezbollah, backed by Iran, has been intensifying attacks with explosive drones and low-flying missiles that the Iron Dome struggles to intercept.\nTom Karako, director of the Missile Defense Project at the Center for Strategic and International Studies, warns that Hezbollah's arsenal could overwhelm the Iron Dome."}, {"id": "cf23f556-eef2-4af2-8fb7-1d92c89aefb9", "title": "Explosions rock occupied Crimea , Russians report downed UAVs , Neptune missile and surface drones", "date": "2024-08-09 06:15", "url": "https://www.yahoo.com/news/explosions-rock-occupied-crimea-russians-013830380.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A column of smoke over the sea near Sevastopol.\nPhoto: Krymskiy VeterMikhail Razvozhayev, Russian-appointed governor of Sevastopol, has claimed that the Ukrainian Armed Forces supposedly carried out an attack on Sevastopol and that Russian forces supposedly shot down a Neptune anti-ship missile over the city's waters, as well as UAVs and surface drones.\nDetails: Later, Krymskiy Veter reported shooting and a large explosion in the village of Chornomorske (in Yevpatoriia district – ed.\nRazvozhayev also claimed an attack by surface drones, and, according to him, two uncrewed vessels had supposedly been destroyed.\nDetails: Razvozhayev later reported that \"several air targets\" had supposedly been shot down over the sea."}, {"id": "92efe421-188e-45aa-a848-ddec7125f68a", "title": "As Israel braces for attack , Pakistan denies supplying missiles to Iran", "date": "2024-08-09 13:15", "url": "https://www.firstpost.com/world/israel-iran-attack-pakistan-missiles-middle-east-crisis-hamas-chief-ismail-haniyeh-assassination-13802892.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Iran is widely expected to attack Israel anytime in retaliation to the assassination of Hamas chief Ismail Haniyeh in Tehran last week read moreAs Israel braces for an attack on multiple fronts, Pakistan has said that it will not supply missiles to Iran.\nThe Pakistani statement came after a report said that if a war were to break out between Israel and Iran, Pakistan would provide missiles to Iran.\nNow, Reuters has reported Pakistan Foreign Ministry Spokesperson Mumtaz Zahra Baloch as saying that there are no plans to provide Iran with missiles as had been reported.\nEarlier this week, Israeli outlet Maariv reported that Pakistan could provide missiles to Iran in case of a war with Israel.\nIran rethinking scope of attack on Israel: ReportAs Iran did not receive an overt support from fellow Islamic nations for an attack on Israel, I ran is rethinking the scope of its attack, according to The Guardian."}, {"id": "2bc76240-be8a-4cba-92ca-c1529971aab2", "title": "Israel - Hamas war latest : Palestinians flee parts of south Gaza as Israel launches a new assault", "date": "2024-08-09 14:15", "url": "https://www.ivpressonline.com/news/nation/israel-hamas-war-latest-palestinians-flee-parts-of-south-gaza-as-israel-launches-a-new/article_dbc6c570-10fb-586a-90e4-d40805bb0000.html", "domain": "ivpressonline.com", "domain_classification": "Unknown", "message": "1371138342::cfb49c8e-2422-11e5-99a3-d7f5c6e8b241A weekly review of the best and most popular stories published in the Imperial Valley Press.\nAlso, featured upcoming events, new movies at local theaters, the week in photos and much more."}, {"id": "2db9d349-4d71-4feb-997b-cc7a86818f17", "title": "Israel - Hamas war latest : Palestinians flee parts of south Gaza as Israel launches a new assault", "date": "2024-08-09 16:30", "url": "https://isp.netscape.com/news/world/story/0001/20240809/c9ad51b1b9139a3d46d81437ac9f8bb8", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Israel-Hamas war latest: Palestinians flee parts of south Gaza as Israel launches a new assaultPalestinians are fleeing large areas around Khan Younis in southern Gaza where the Israeli military began a new assault after ordering another mass evacuation.\nHamas official killed in Lebanon by an Israeli drone strikeBEIRUT — An Israeli drone strike hit a car in a southern Lebanese city on Friday, killing a Hamas official.\nHezbollah has said that it will only stop firing toward Israel once the war in Gaza comes to and end.\n“The war in Gaza must stop,” Macron said in a post in English and French on X.\nMan wounded in Hezbollah drone attack on Israel earlier this week has diedJERUSALEM — A man who was seriously wounded by a Hezbollah drone attack on Israel earlier this week succumbed to his wounds Friday, hospital officials said."}, {"id": "2f8cc0af-7127-4cfc-83bf-b5d13e58ca26", "title": "The threat Israel didnt foresee : Hezbollah growing drone power", "date": "2024-08-09 16:45", "url": "https://www.ksat.com/news/world/2024/08/09/the-threat-israel-didnt-foresee-hezbollahs-growing-drone-power/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "While Israel has built air defense systems, including the Iron Dome and David’s Sling to guard against Hezbollah's rocket and missile arsenal, there has been less focus on the drone threat.\nOn Tuesday, a Hezbollah drone attack on an Israeli army base near the northern city of Nahariya wounded six people.\nHezbollah’s increasing capabilities have come despite Israel killing some of its most important drone experts.\nMore recent strikes in Syria attributed to Israel killed Iranian and Hezbollah drone experts, including an official with the Iranian paramilitary Revolutionary Guard’s aerospace division.\nAfter the 34-day Israel-Hezbollah war in 2006, Lakkis, the Hezbollah drone mastermind, took charge of the drone program."}, {"id": "6de05bf5-985d-41c2-8cca-eaee971a7de4", "title": "The threat Israel didnt foresee : Hezbollah growing drone power", "date": "2024-08-09 17:45", "url": "https://www.clickondetroit.com/news/world/2024/08/09/the-threat-israel-didnt-foresee-hezbollahs-growing-drone-power/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "While Israel has built air defense systems, including the Iron Dome and David’s Sling to guard against Hezbollah's rocket and missile arsenal, there has been less focus on the drone threat.\nOn Tuesday, a Hezbollah drone attack on an Israeli army base near the northern city of Nahariya wounded six people.\nHezbollah’s increasing capabilities have come despite Israel killing some of its most important drone experts.\nMore recent strikes in Syria attributed to Israel killed Iranian and Hezbollah drone experts, including an official with the Iranian paramilitary Revolutionary Guard’s aerospace division.\nAfter the 34-day Israel-Hezbollah war in 2006, Lakkis, the Hezbollah drone mastermind, took charge of the drone program."}, {"id": "cc7e054f-a29b-4c17-a073-e645a0b2b61d", "title": "Israel - Hamas war latest : Palestinians flee parts of south Gaza as Israel launches a new assault", "date": "2024-08-09 18:15", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/israel-hamas-war-latest-palestinians-flee-parts-of-south-gaza-as-israel-launches-a-new/article_4c258a60-b884-5efa-ae0c-e0ff4b7365b0.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Israel-Hamas war latest: Palestinians flee parts of south Gaza as Israel launches a new assaultPalestinians are fleeing large areas around Khan Younis in southern Gaza where the Israeli military has begun a new assault after ordering another mass evacuation"}, {"id": "06a9c8ca-af15-4492-85e6-317eb3d974e9", "title": "Two killed in Israeli airstrike on Lebanese town", "date": "2024-08-09 11:45", "url": "https://www.prokerala.com/news/articles/a1554576.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Beirut, Aug 9 : Two people were killed on Friday morning in an Israeli airstrike on Lebanon's southern town of Naqoura, the state-run National News Agency reported.\nMoreover, five people were injured on Thursday evening in an Israeli airstrike on the village of Henawei in the Tyre district in southern Lebanon.\nThe airstrike resulted in the shattering of windows of houses surrounding the targeted area while also causing damage to the electricity and water networks in the village.\nA state of anticipation and caution prevails in Lebanon following Israel's attack on Dahieh in Beirut's southern suburbs, killing a Hezbollah senior military commander, Fouad Shokor, and seven civilians.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place."}, {"id": "87cd590f-b14d-4ccc-bced-fcd900252143", "title": "The threat Israel didnt foresee : Hezbollah growing drone power", "date": "2024-08-09 18:15", "url": "https://www.wsls.com/news/world/2024/08/09/the-threat-israel-didnt-foresee-hezbollahs-growing-drone-power/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "While Israel has built air defense systems, including the Iron Dome and David’s Sling to guard against Hezbollah's rocket and missile arsenal, there has been less focus on the drone threat.\nOn Tuesday, a Hezbollah drone attack on an Israeli army base near the northern city of Nahariya wounded six people.\nHezbollah’s increasing capabilities have come despite Israel killing some of its most important drone experts.\nMore recent strikes in Syria attributed to Israel killed Iranian and Hezbollah drone experts, including an official with the Iranian paramilitary Revolutionary Guard’s aerospace division.\nAfter the 34-day Israel-Hezbollah war in 2006, Lakkis, the Hezbollah drone mastermind, took charge of the drone program."}, {"id": "c99cdead-2651-43cf-b2a5-7e8ebf547f28", "title": "US updates injured count in Al Asad attack to 5 , down from 7", "date": "2024-08-09 01:15", "url": "https://kvia.com/your-voice-your-vote/politics/2024/08/08/us-updates-injured-count-in-al-asad-attack-to-5-down-from-7/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "By Haley Britzky, CNN(CNN) — Five US personnel were injured in an attack this week on Al Asad Airbase in Iraq, deputy Pentagon press secretary Sabrina Singh said Thursday, a smaller number than the seven injured originally reported.\n“After conducting a post-strike analysis, we determined that four service members and one contractor (were) actually injured in the attack.\nThe other two received, you know, very minor injuries and returned to duty right away,” Singh said.\nInitial reports said that seven US personnel — five US service members and two contractors — were injured in the rocket attack on Monday.\n“Make no mistake: the United States will not tolerate attacks on our personnel in the region,” Austin said."}, {"id": "b08ca119-6d9c-4295-9e04-98c653a19dfa", "title": "Russia bans night - time flights over Israel", "date": "2024-08-09 15:15", "url": "https://www.yahoo.com/news/russia-bans-nighttime-flights-over-143748507.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "It comes after Vladimir Putin urged Iran to show restraint and not target civilians with its attack on Israel.\nYemen’s Iran-aligned Houthi militants have launched attacks on international shipping in the Red Sea region since November in solidarity with Palestinians in the war between Israel and Hamas.\nIran has blamed Israel, while Israel has neither confirmed nor denied involvement.\nOn Thursday, Prime Minister Benjamin Netanyahu’s office said that Israel had agreed to resume Gaza ceasefire talks on Aug 15 at the request of US, Qatari and Egyptian mediators.\n“She does not support an arms embargo on Israel,” Phil Gordon, Ms Harris’s national security advisor, said on X."}, {"id": "67a398fb-cdae-43cd-b39d-071e31382394", "title": "Israel - Hamas war latest : Palestinians flee parts of south Gaza as Israel launches a new assault", "date": "2024-08-09 13:45", "url": "https://www.wgauradio.com/news/world/israel-hamas-war/S4RR7DQ4AVG7LEMWZH77H2R3YY/", "domain": "wgauradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "f0f8bb8f-e21c-4b64-b6ba-f6e7c1ff0810", "title": "Israeli strike kills senior Hamas figure in south Lebanon", "date": "2024-08-09 17:30", "url": "https://www.marketscreener.com/news/latest/Israeli-strike-kills-senior-Hamas-figure-in-south-Lebanon-47614739/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "BEIRUT (Reuters) - An Israeli airstrike on a car deep inside Lebanon killed a senior figure from Palestinian armed group Hamas on Friday evening, a Hamas source and two other security sources told Reuters.\nWhile most of the hostilities have been limited to the strip of border between Israel and Lebanon, Israeli strikes targeting senior figures in Hezbollah, Hamas and other groups have taken place further north.\nAn Israeli strike on the outskirts of Beirut in January killed Hamas's deputy chief Saleh Arouri.\nAnother Israeli strike on the same area last week killed Hezbollah's top military commander Fuad Shukr.\nHours after Shukr was killed, Hamas chief Ismail Haniyeh was assassinated in Tehran."}, {"id": "579d207b-7ccf-47a8-bc21-b8ab97923f26", "title": "Putin suffers biggest attack on his own territory since launching invasion", "date": "2024-08-09 07:30", "url": "https://metro.co.uk/2024/08/09/putin-suffers-biggest-attack-territory-since-launching-invasion-21391126/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "Both sides appeared to be throwing reinforcements into the fighting in the Kursk region, which saw Russians wrong-footed earlier this week after a sudden Ukrainian incursion into their territory.\nA huge explosion is seen on video in the village reportedly occupied by Ukrainian forces.\nSeparate footage showed the Russians striking a Ukrainian tank and an armoured vehicle with Lancet barrage munitions in Kursk region.\nSome Russian sources claimed that the Ukrainian advance in Kursk region had halted but that intense fighting was underway.\nThe Russian Defense Ministry said it had intercepted 75 drones overnight including 26 over Belgorod region, 19 over Lipetsk, and seven over Kursk region."}, {"id": "d416d82d-d75b-48e9-8a10-5c44b29ac6cd", "title": "USS Abraham Lincoln strike group steams toward Middle East after Guam , Saipan port calls", "date": "2024-08-09 04:30", "url": "https://www.stripes.com/branches/navy/2024-08-08/uss-abraham-lincoln-guam-middle-east-14800299.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "Sailors heave in the line on the fantail of the aircraft carrier USS Abraham Lincoln at Naval Base Guam on Aug. 8, 2024.\nNavy)The aircraft carrier USS Abraham Lincoln and its strike group pulled away from Guam and Saipan after a four-day respite before heading to the Middle East.\nOn Guam, 20 sailors and Marines assigned to Abraham Lincoln and Carrier Air Wing 9 reunited with more than 75 family members waiting pierside for their homecoming, Freutel wrote.\nThe Abraham Lincoln and Carrier Strike Group 3 were ordered on Aug. 2 to relieve the USS Theodore Roosevelt strike group, which was reportedly in the Persian Gulf that day.\nThe Pentagon announced Aug. 2 it was sending the Abraham Lincoln strike group and an additional fighter squadron and was preparing to deploy additional land-based ballistic missile defenses."}, {"id": "ae490ac0-09b0-4203-a9c1-9c8e175dbb00", "title": "US issues warning to Iran of  serious risk  if it carries out retaliatory attack against Israel : report", "date": "2024-08-09 05:45", "url": "https://wfin.com/fox-world-news/us-issues-warning-to-iran-of-serious-risk-if-it-carries-out-retaliatory-attack-against-israel-report/", "domain": "wfin.com", "domain_classification": "Unknown", "message": "The U.S. has reportedly warned Iran a retaliatory attack on Israel for the recent killing of a senior Hamas leader in Tehran would pose a “serious risk” for Iran’s economy and government and likely escalate the months-long conflict between Israel and Hamas.\nA U.S. official told The Wall Street Journal the U.S. has communicated to Iran that the risk of a major escalation is “extremely high” if it carries out a retaliatory attack.\nIran has signaled its intention to strike back at Israel, though the exact scope and timing of a potential attack are not clear.\nThat’s in contrast to Iran’s highly anticipated missile and drone attack on Israel in April in retaliation for Israel killing a senior Iranian paramilitary commander in Syria.\nThese developments come as Qatari, Egyptian and U.S. leaders have urged Israel to resume talks with Hamas Aug. 15."}, {"id": "e9b7ced8-4059-4a62-b292-c5b0896eab7e", "title": "Israel and the US prepare for  series of scenarios , including a potential Hezbollah attack – KTBB News , Weather , Talk", "date": "2024-08-09 12:45", "url": "https://ktbb.com/post/?p=1345549", "domain": "ktbb.com", "domain_classification": "Unknown", "message": "\"We don't have an interest in a war or escalation,\" the Israeli defense official said.\n\"What we are seeing is the U.S. taking a very clear position in their actions and their messaging, and it matters,\" the Israeli defense official told ABC News.\nThe Israeli defense official said these redeployments of American military assets, which were aimed at defending Israel, appeared to be \"unprecedented\" in scale and scope.\nThe Iranians have to take this into account,\" the former general told ABC News.\n\"They know they need to get this right,\" Javedanfar told ABC news."}, {"id": "07aafc57-5f2c-4760-9918-e263d5b70951", "title": "Radio Station WHMI 93 . 5 FM Livingston County Michigan News , Weather , Traffic , Sports , School Updates , and the Best Classic Hit", "date": "2024-08-09 10:45", "url": "https://www.whmi.com/news/national/israel-and-us-prepare-series-scenarios-including-potential-hezbollah-attack", "domain": "whmi.com", "domain_classification": "Unknown", "message": "\"We don't have an interest in a war or escalation,\" the Israeli defense official said.\n\"What we are seeing is the U.S. taking a very clear position in their actions and their messaging, and it matters,\" the Israeli defense official told ABC News.\nThe Israeli defense official said these redeployments of American military assets, which were aimed at defending Israel, appeared to be \"unprecedented\" in scale and scope.\nThe Iranians have to take this into account,\" the former general told ABC News.\n\"They know they need to get this right,\" Javedanfar told ABC news."}, {"id": "e3a02960-58a3-4932-8a1d-ed1e9a8bc1d3", "title": "World - HITS FM", "date": "2024-08-09 14:45", "url": "https://hitsfm.net/world/42a6a5e86516e32e4d193b96e8442960", "domain": "hitsfm.net", "domain_classification": "Unknown", "message": "\"We don't have an interest in a war or escalation,\" the Israeli defense official said.\n\"What we are seeing is the U.S. taking a very clear position in their actions and their messaging, and it matters,\" the Israeli defense official told ABC News.\nThe Israeli defense official said these redeployments of American military assets, which were aimed at defending Israel, appeared to be \"unprecedented\" in scale and scope.\nThe Iranians have to take this into account,\" the former general told ABC News.\n\"They know they need to get this right,\" Javedanfar told ABC news."}, {"id": "d1efbd5e-9e9c-4b63-bdc8-f5fcad869870", "title": "Israel and the US prepare for  series of scenarios , including a potential Hezbollah attack - WEIS", "date": "2024-08-09 11:00", "url": "https://weisradio.com/2024/08/09/israel-and-the-us-prepare-for-series-of-scenarios-including-a-potential-hezbollah-attack/", "domain": "weisradio.com", "domain_classification": "Unknown", "message": "People gather in support of the Islamic Revolutionary Guard Corps’ attack on Israel on April 14, 2024 in Tehran, Iran.\n“We don’t have an interest in a war or escalation,” the Israeli defense official said.\n“What we are seeing is the U.S. taking a very clear position in their actions and their messaging, and it matters,” the Israeli defense official told ABC News.\nThe Israeli defense official said these redeployments of American military assets, which were aimed at defending Israel, appeared to be “unprecedented” in scale and scope.\nThe Iranians have to take this into account,” the former general told ABC News."}, {"id": "44f52175-50fa-451c-9b07-7eb685fae9f7", "title": "World News - 1540 WADK Newport", "date": "2024-08-09 11:45", "url": "https://wadk.com/world-news/6051e9f20f506f782c7921eb2af9f397", "domain": "wadk.com", "domain_classification": "Unknown", "message": "\"We don't have an interest in a war or escalation,\" the Israeli defense official said.\n\"What we are seeing is the U.S. taking a very clear position in their actions and their messaging, and it matters,\" the Israeli defense official told ABC News.\nThe Israeli defense official said these redeployments of American military assets, which were aimed at defending Israel, appeared to be \"unprecedented\" in scale and scope.\nThe Iranians have to take this into account,\" the former general told ABC News.\n\"They know they need to get this right,\" Javedanfar told ABC news."}, {"id": "8550761d-af43-43f2-a2cc-3693527aa0a5", "title": "Israel and the US prepare for  series of scenarios , including a potential Hezbollah attack", "date": "2024-08-09 14:15", "url": "https://www.myiowainfo.com/syndicated-article/?id=1578361", "domain": "myiowainfo.com", "domain_classification": "Unknown", "message": "(TEL AVIV, Israel) — The Israeli military is working in close coordination with the Pentagon to prepare for a “series of scenarios” in which either Iran or one of its proxies, namely Hezbollah, could launch an attack or series of attacks against Israel, an Israeli defense official told ABC News.\n“We don’t have an interest in a war or escalation,” the Israeli defense official said.\n“What we are seeing is the U.S. taking a very clear position in their actions and their messaging, and it matters,” the Israeli defense official told ABC News.\nThe Israeli defense official said these redeployments of American military assets, which were aimed at defending Israel, appeared to be “unprecedented” in scale and scope.\nThe Iranians have to take this into account,” the former general told ABC News."}, {"id": "dd8cf417-9dff-4e6a-a1c2-9ea20603d691", "title": "Israel and the US prepare for  series of scenarios , including a potential Hezbollah attack", "date": "2024-08-09 16:45", "url": "https://www.gowatertown.net/syndicated-article/?id=1578361", "domain": "gowatertown.net", "domain_classification": "Unknown", "message": "(TEL AVIV, Israel) — The Israeli military is working in close coordination with the Pentagon to prepare for a “series of scenarios” in which either Iran or one of its proxies, namely Hezbollah, could launch an attack or series of attacks against Israel, an Israeli defense official told ABC News.\n“We don’t have an interest in a war or escalation,” the Israeli defense official said.\n“What we are seeing is the U.S. taking a very clear position in their actions and their messaging, and it matters,” the Israeli defense official told ABC News.\nThe Israeli defense official said these redeployments of American military assets, which were aimed at defending Israel, appeared to be “unprecedented” in scale and scope.\nThe Iranians have to take this into account,” the former general told ABC News."}, {"id": "ecef43a7-d05a-4d94-9347-f393a54e7768", "title": "Hezbollah conducts reprisal missile , drone attacks against Israel", "date": "2024-08-09 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240808-irna09.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah conducts reprisal missile, drone attacks against IsraelIRNA - Islamic Republic News AgencyAug 8, 2024Tehran, IRNA -- The Lebanese Hezbollah Resistance Movement have carried out more retaliatory attacks on the Zionist positions in the northern occupied Palestinian territories with rockets and missiles.\nHezbollah fighters also targeted a base of the occupying forces in the occupied Lebanese hills of Kafr Shuba.\nNews sources also reported the sighting of Hezbollah suicide drones in the skies over northern occupied Palestine and missile and drone attacks on the Zionist positions.\nAccording to Zionist regime sources of the, at least one Zionist was killed and five others injured one of them critically in the Galilee region.\nThe Israeli general also stated that the Gaza war should have stopped a long time ago and added: If we had stopped, Hezbollah would have stopped its attacks."}, {"id": "1d376293-8810-4bbc-8ec3-394fe1f37f20", "title": "Israel - Hamas War day 307 : What happening in Israel , Gaza , Lebanon ? ", "date": "2024-08-09 06:00", "url": "https://www.jpost.com/israel-hamas-war/2024-08-09/live-updates-814006", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Finance Minister Bezalel Smotrich gestures at the Knesset, in Jerusalem, on June 24, 2024 (photo credit: MARC ISRAEL SELLEM)National Security Communications Advisor John Kirby addressed reporters on Friday afternoon in a rare counterattack of Finance Minister Smotrich's \"extremist, ridiculous\" charges against a hostage deal less than 24 hours after Prime Minister Benjamin Netanyahu positively responded to the joint statement from the US, Qatar and Egypt imploring negotiations to continue next week.\nIn a Friday morning post on X, Smotrich accused the mediators of \"creating symmetry\" between the hostages and the Palestinian prisoners who would be exchanged for their release.\n\"The time has not come to release the abominable terrorists who killed the Jews,\" Smotrich wrote.\n\"And above all, the time has not really come for a surrender deal that would stop war before the destruction of the Nazis of Hamas and Daesh and allow them to rehabilitate and return to murdering Jews again.\""}, {"id": "b0c9f20c-734e-47d3-91aa-28ad3e8b8849", "title": "Israel - Gaza live updates : 59 % of Gaza buildings destroyed , analysis shows", "date": "2024-08-09 01:30", "url": "https://www.centralmoinfo.com/syndicated-article/?id=1578280", "domain": "centralmoinfo.com", "domain_classification": "Unknown", "message": "(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nThe attack comes as Israel awaits a military response from Hezbollah or Iran after it assassinated leaders of Hezbollah and Hamas.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "c3722f4b-44ed-490e-b35f-4b9b6a1ed25e", "title": "Israel - Gaza live updates : 59 % of Gaza buildings destroyed , analysis shows", "date": "2024-08-09 01:30", "url": "https://www.northwestmoinfo.com/syndicated-article/?id=1578280", "domain": "northwestmoinfo.com", "domain_classification": "Unknown", "message": "(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nThe attack comes as Israel awaits a military response from Hezbollah or Iran after it assassinated leaders of Hezbollah and Hamas.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "01b58700-5b31-41e1-b613-ca2a49f7dc82", "title": "Israel - Gaza live updates : 59 % of Gaza buildings destroyed , analysis shows", "date": "2024-08-09 01:30", "url": "https://www.wjnt.com/syndicated-article/?id=1578280", "domain": "wjnt.com", "domain_classification": "Unknown", "message": "(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nThe attack comes as Israel awaits a military response from Hezbollah or Iran after it assassinated leaders of Hezbollah and Hamas.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "3557a485-b25f-4f17-a053-8f07bf996c20", "title": "Israel - Gaza live updates : 59 % of Gaza buildings destroyed , analysis shows", "date": "2024-08-09 01:45", "url": "https://www.kxl.com/syndicated-article/?id=1578280", "domain": "kxl.com", "domain_classification": "Unknown", "message": "(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nThe attack comes as Israel awaits a military response from Hezbollah or Iran after it assassinated leaders of Hezbollah and Hamas.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "d6c157df-e8c8-4ca9-b7fe-6d9425e544c1", "title": "Israel - Gaza live updates : 59 % of Gaza buildings destroyed , analysis shows", "date": "2024-08-09 01:00", "url": "https://www.amazingmadison.com/syndicated-article/?id=1578280", "domain": "amazingmadison.com", "domain_classification": "Unknown", "message": "(NEW YORK) — As the Israel-Hamas war continues, tensions are escalating after the assassinations of two Hamas and Hezbollah leaders this week.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nThe attack comes as Israel awaits a military response from Hezbollah or Iran after it assassinated leaders of Hezbollah and Hamas.\nIsrael kills another Hezbollah commanderThe Israel Defense Forces confirmed on Monday they had killed another Hezbollah commander in a strike on Lebanon.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "35b1566e-e73a-4cb5-8217-e76ccad986e1", "title": "Iran attack on Israel could dash  any hope  of cease - fire in Gaza , Biden admin official warns", "date": "2024-08-09 02:45", "url": "https://nypost.com/2024/08/08/us-news/iran-attack-on-israel-could-dash-any-hope-of-ceasefire-biden-official/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Iran has threatened to attack Israel directly for the assassination of Hamas’ top leader in Tehran, Ismail Haniyeh.\nIranian-backed terror group Hezbollah is also reportedly expected to hit Israel in the coming days independent of possible strike from Iran.\n3 An Iranian attack on Israel would dramatically reduce the chances of any sort of cease-fire in Gaza, a senior administration official warned Thursday.\nPool/ABACA/Shutterstock3 The deal would ostensibly result in Hamas hostages being freed and Israeli military action in Gaza being halted.\nThe US “will be prepared for any contingency” should Iran launch an attack on Israel, the senior administration official asserted."}, {"id": "192c98cd-85b8-4836-b342-e5269ad30a2b", "title": "Putin unleashes fury over Zelensky border incursion humiliation", "date": "2024-08-09 14:45", "url": "https://www.dailymail.co.uk/news/article-13727839/Putin-unleashes-fury-Zelenskys-border-incursion-killing-ten-Kursk.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "'The lack of a coherent Russian response to the Ukrainian incursion into Kursk... and the reported rate of Ukrainian advance indicates that Ukrainian forces were able to achieve operational surprise,' the Washington-based ISW said late Thursday.\nThe huge blow enraged pro-war military channels in Russia who claimed it showed the sheer incompetence of their own military commanders.\nLipetsk city is about 210 miles from the Ukrainian border with Russia's Kursk region, where pro-Kyiv forces have been waging their ground offensive.\nBut a top adviser to Zelensky said Thursday that border region attacks will cause Russia to 'start to realise that the war is slowly creeping inside of Russian territory.'\nIt cautioned, however, that Ukrainian forces 'most certainly do not control' all of that territory."}, {"id": "2e926345-be5a-40c1-a851-77cac80b2218", "title": "As war drums beat , those in Beirut suburb have nowhere to flee", "date": "2024-08-09 11:45", "url": "https://www.marketscreener.com/news/latest/As-war-drums-beat-those-in-Beirut-suburb-have-nowhere-to-flee-47611751/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "In the last war between Israel and Hezbollah in 2006, Israeli strikes flattened buildings in Dahiyeh, sending residents fleeing to other towns and cities for safety.\nTAKING ADVANTAGEFollowing last week's strike, residents of Dahiyeh told Reuters that they had begun searching for apartments either in Aley or further east in the Bekaa Valley.\n\"The situation scares me... it's a crisis situation, and when you think about war you're afraid for your children,\" he told Reuters.\nIn 2006, Dahiyeh residents were hosted in some Christian neighbourhoods thanks to a Hezbollah alliance with a Christian party, the Free Patriotic Movement, sealed months earlier.\n\"No one's being empathetic, or understanding that it's a situation of war and we need to help each other out,\" he said."}, {"id": "774e319e-8e63-4279-8c23-6183ea98d699", "title": "The threat Israel didnt foresee : Hezbollah growing drone power", "date": "2024-08-09 16:30", "url": "https://www.ajc.com/news/nation-world/the-threat-israel-didnt-foresee-hezbollahs-growing-drone-power/TNQC22SWMVCZ5BPAUY647N3WRE/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "be506406-40f5-4ac6-bd0e-d6290f34e613", "title": "On the edge : On West Asia and the danger of a wider war", "date": "2024-08-09 06:30", "url": "https://myrepublica.nagariknetwork.com/news/on-the-edge-on-west-asia-and-the-danger-of-a-wider-war/", "domain": "myrepublica.nagariknetwork.com", "domain_classification": "Unknown", "message": "While protecting Israel, the West must also rein in NetanyahuThe killings of Fuad Shukr, a senior Hezbollah commander, in Beirut, and Ismail Haniyeh, the political chief of Hamas, in Tehran, within hours on July 30 have taken West Asia to the brink of a wider war.\nBy taking him out, Mr. Netanyahu is telling the world that he wants the war to continue.\nIf a direct war breaks out between Israel and Iran, the U.S. could be dragged into it, which is what Israel wants.\nThe Biden administration avoided such a disastrous outcome in April by reining in Israel after Iran's retaliation.\nBut that did not stop Israel from launching another provocative attack against Iran, taking the region back to the brink again."}, {"id": "f0a8b45a-0459-4c6b-8e4b-5d33770ba103", "title": "US forces destroy Houthi anti - ship missiles in Yemen ; F - 22 fighter jets arrive in West Asia", "date": "2024-08-09 05:30", "url": "https://news.webindia123.com/news/Articles/World/20240809/4223450.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "United States forces successfully destroyed two Iranian-backed Houthi anti-ship cruise missiles and one Houthi ground control station in Houthi-controlled areas of Yemen, according to the US Central Command.\nAdditionally, US forces successfully destroyed one Houthi uncrewed surface vessel in the Red Sea, it said in a press statement on Thursday (local time).\n\"These weapons presented a clear and imminent threat to US and coalition forces, and merchant vessels in the region.\nThe campaign has forced shipping firms to seek alternative routes, impacting approximately 12 per cent of global trade that traverses the Red Sea.\nOn August 2, US Defence Secretary Lloyd Austin ordered additional fighter jets and Navy ships to West Asia."}, {"id": "1d49f743-958a-4c7a-b963-ba95f61cbc1b", "title": "Putin launches horror shopping mall attack as Ukraine fights bloody ba | World | News", "date": "2024-08-09 10:15", "url": "https://www.express.co.uk/news/world/1934095/russia-strike-ukraine-shopping-mall-donetsk", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Russia attack Ukrainian supermarket in KostyantynivkaA supermarket in the Ukrainian town of Kostyantynivka has been hit by a Russian missile, causing massive damage and starting a huge fire.\nUkrainian officials say that around 50 people were in the supermarket when a Russian jet fired a missile into it.\nREAD MORE: Putin launches horror shopping mall attack as Ukraine fights bloody battleA shopping mall in Donetsk was reportedly targeted in a Russian strike.\nThis is another targeted attack on a crowded place, another act of terror from the Russians.\nThe Russians targeted the Donetsk city yesterday with artillery strikes that hit a private house and a kindergarten."}, {"id": "88be26a5-4cd9-4253-b263-bd03a09755cc", "title": "The threat Israel didnt foresee : Hezbollah growing drone power", "date": "2024-08-09 16:45", "url": "https://toronto.citynews.ca/2024/08/09/the-threat-israel-didnt-foresee-hezbollahs-growing-drone-power/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "While Israel has built air defense systems, including the Iron Dome and David’s Sling to guard against Hezbollah’s rocket and missile arsenal, there has been less focus on the drone threat.\nOn Tuesday, a Hezbollah drone attack on an Israeli army base near the northern city of Nahariya wounded six people.\nThe most high-profile was Shukur, who Israel said was responsible for most of Hezbollah’s most advanced weaponry, including missiles, long-range rockets and drones.\nMore recent strikes in Syria attributed to Israel killed Iranian and Hezbollah drone experts, including an official with the Iranian paramilitary Revolutionary Guard’s aerospace division.\nAfter the 34-day Israel-Hezbollah war in 2006, Lakkis, the Hezbollah drone mastermind, took charge of the drone program."}, {"id": "63ffa196-1057-4e29-b2e5-44824d44e20d", "title": "Ten killed , 35 hurt in Russian strike on supermarket in Ukraine east", "date": "2024-08-09 12:30", "url": "https://www.yahoo.com/news/two-killed-17-injured-russian-100242606.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(Reuters) -A Russian missile struck a supermarket in the Ukrainian town of Kostiantynivka in the front-line Donetsk region on Friday, killing at least 14 people and injuring 43 others, Ukrainian officials said.\n\"Russian terrorists hit an ordinary supermarket and a post office.\nUkrainian government-held parts of the Donetsk region regularly come under Russian shelling and air strikes.\n\"No situation on the battlefield can justify targeting civilians,\" Ukraine's Prosecutor General Andriy Kostin said on X, reporting an updated death toll in Kostiantynivka.\nNova Poshta, Ukraine's largest private postal company, said its cargo office in the supermarket was damaged in the strike."}, {"id": "e916aea0-b788-4c75-8ebc-ad70e5cca120", "title": "Ten killed , 35 hurt in Russian strike on supermarket in Ukraine east", "date": "2024-08-09 11:45", "url": "https://www.marketscreener.com/news/latest/Ten-killed-35-hurt-in-Russian-strike-on-supermarket-in-Ukraine-s-east-47610839/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "(Reuters) -A Russian missile strike hit a supermarket in the Ukrainian town of Kostiantynivka in the front-line Donetsk region on Friday, killing at least ten people and injuring 35 others, Ukrainian officials said.\nThe strike caused a fire that had been put out, the interior minister said.\nHeavy black smoke clouds rising from the destroyed building could be seen in the images and videos posted by officials.\n\"Russian terrorists hit an ordinary supermarket and a post office.\nNova Poshta, Ukraine's largest private postal company, said its cargo office in the supermarket was damaged in the strike."}, {"id": "c8d85027-6d4d-4e14-bf3c-1560ccaeda92", "title": "PH , US troops to fire HIMARS at ongoing  Salaknib  drills", "date": "2024-08-09 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240808-pna01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "PH, US troops to fire HIMARS at ongoing 'Salaknib' drillsPhilippine News AgencyBy Priam NepomucenoAugust 8, 2024, 10:14 amMANILA -- Philippine Army (PA) troops and their counterparts from the United States will be firing the American-made High Mobility Artillery Rocket System (HIMARS) platform in a military target range in Nueva Ecija on Friday.\nThe activity, part of the ongoing \"Salaknib\" Phase 2 exercises, is designed to \"enhance coordination and execution of military operations, highlighting the importance of combined training for regional security.\"\n\"It also highlights the tactical readiness, underscores the preparedness of both forces to rapidly deploy and execute precise military operations,\" Dema-ala said.\nAround 2,000 Filipino and American troops are participating in \"Salaknib\" Phase 2 which started May 11.\n\"Salaknib\", which means shield in Ilocano, is an annual exercise between the Philippines and the United States aimed at beefing the interoperability of Filipino and American ground troops."}, {"id": "2f2eed2b-b223-412e-ad6a-bb1eea8e69cd", "title": "Israel and U . S . bracing for imminent Iranian attack – NaturalNews . com", "date": "2024-08-09 07:30", "url": "https://www.naturalnews.com/2024-08-08-israel-us-bracing-imminent-iranian-attack.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "Israel and U.S. bracing for imminent Iranian attackAny moment now, Iran is expected to launch an attack on Israel over the Jewish state's killing of top Hamas leader Ismail Haniyeh, as well as several top Hezbollah leaders, including Fouad Shukr in Beirut.\nIran deployed hundreds of drones and missiles, but Israel reported minimal damage from the retaliatory attack.\nOfficials are expecting something bigger that could include Hezbollah forces in Lebanon, seeing as how Iran is promising that the \"entire Resistance Axis\" will participate this time in striking Israel.\n\"When Hezbollah and Iran are fighting, they just need to provide weapons and think tanks that are already experienced in wars.\nAnother asked why the U.S. armed forces have suddenly decided to openly play \"mercenary service for the defense of Israel.\""}, {"id": "7d94f9b5-39de-4e9a-9a7c-1e5dcdef960b", "title": "Iran keeps region guessing as it mulls revenge attack", "date": "2024-08-09 14:30", "url": "https://www.the-star.co.ke/news/world/2024-08-09-iran-keeps-region-guessing-as-it-mulls-revenge-attack/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "Both Iran and Hamas say the 31 July assassination was carried out by Israel, which has not commented but is widely believed to have been behind it.\nMeanwhile, there is also the wait for another expected attack on Israel, from Hezbollah, the Iranian-backed militia and political movement in Lebanon.\nWith its precision guided missiles and attack drones, Hezbollah is a key element of Iran’s deterrence, right on Israel’s borders.\nIsrael sees the Iranian nuclear programme as an existential threat, and Hezbollah would probably play a vital role in Iran’s response if its facilities came under Israeli attack.\nSome people are preparing for war and the region could, deliberately or by accident, slide into one."}, {"id": "cfc44cbb-470e-43ca-92bd-58ce0fc7758e", "title": "Russia declares an emergency in Kursk , under attack by Ukraine . 12 killed in Russian strike on mall", "date": "2024-08-09 16:45", "url": "https://www.startribune.com/russia-declares-a-federal-emergency-in-a-border-region-that-is-under-attack-from-ukrainian-forces/600979747", "domain": "startribune.com", "domain_classification": "Unknown", "message": "''There's been no changes in our policy approaches,\" Kirby said when asked if there had been a change in U.S. policy on use of weapons.\n\"They're using it in an area where we had said before that they could use U.S. weapons for cross-border strikes.\nThe end goal here is to help Ukraine defend itself.''"}, {"id": "2d414bc9-fd04-41cc-9c1b-48fb2f384062", "title": "Israel - Gaza live updates : IDF soldiers accused of abusing Palestinians denied release", "date": "2024-08-09 01:30", "url": "https://www.wjnt.com/syndicated-article/?id=1578297", "domain": "wjnt.com", "domain_classification": "Unknown", "message": "IDF soldiers accused of abusing Palestinian prisoners denied releaseFive Israel Defense Forces soldiers who are in custody under suspicion of aggravated abuse of a Palestinian prisoner have been denied release by a military court on Thursday, according to the IDF.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nThe attack comes as Israel awaits a military response from Hezbollah or Iran after it assassinated leaders of Hezbollah and Hamas.\nAt least 8 Palestinians killed during Israeli military raids in occupied West BankAt least eight Palestinians were killed by Israeli forces during military raids in the occupied West Bank on Tuesday, Palestinian health authorities said.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "1c0dcb36-eef6-4282-a36a-11c6779f5ece", "title": "Israel - Gaza live updates : IDF soldiers accused of abusing Palestinians denied release", "date": "2024-08-09 02:15", "url": "https://www.gowatertown.net/syndicated-article/?id=1578297", "domain": "gowatertown.net", "domain_classification": "Unknown", "message": "IDF soldiers accused of abusing Palestinian prisoners denied releaseFive Israel Defense Forces soldiers who are in custody under suspicion of aggravated abuse of a Palestinian prisoner have been denied release by a military court on Thursday, according to the IDF.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nThe attack comes as Israel awaits a military response from Hezbollah or Iran after it assassinated leaders of Hezbollah and Hamas.\nAt least 8 Palestinians killed during Israeli military raids in occupied West BankAt least eight Palestinians were killed by Israeli forces during military raids in the occupied West Bank on Tuesday, Palestinian health authorities said.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "3ae6d1c8-9f11-4bc6-9423-28ccc7e2cb63", "title": "Israel - Gaza live updates : IDF soldiers accused of abusing Palestinians denied release", "date": "2024-08-09 02:15", "url": "https://www.wntxradio.com/syndicated-article/?id=1578297", "domain": "wntxradio.com", "domain_classification": "Unknown", "message": "IDF soldiers accused of abusing Palestinian prisoners denied releaseFive Israel Defense Forces soldiers who are in custody under suspicion of aggravated abuse of a Palestinian prisoner have been denied release by a military court on Thursday, according to the IDF.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nThe attack comes as Israel awaits a military response from Hezbollah or Iran after it assassinated leaders of Hezbollah and Hamas.\nAt least 8 Palestinians killed during Israeli military raids in occupied West BankAt least eight Palestinians were killed by Israeli forces during military raids in the occupied West Bank on Tuesday, Palestinian health authorities said.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "c5578fc9-7fb2-40d7-9d12-4938067f77a6", "title": "Israel - Gaza live updates : IDF soldiers accused of abusing Palestinians denied release - WEIS", "date": "2024-08-09 01:15", "url": "https://weisradio.com/2024/08/08/israel-gaza-live-updates-idf-soldiers-accused-of-abusing-palestinians-denied-release/", "domain": "weisradio.com", "domain_classification": "Unknown", "message": "IDF soldiers accused of abusing Palestinian prisoners denied releaseFive Israel Defense Forces soldiers who are in custody under suspicion of aggravated abuse of a Palestinian prisoner have been denied release by a military court on Thursday, according to the IDF.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nThe attack comes as Israel awaits a military response from Hezbollah or Iran after it assassinated leaders of Hezbollah and Hamas.\nAt least 8 Palestinians killed during Israeli military raids in occupied West BankAt least eight Palestinians were killed by Israeli forces during military raids in the occupied West Bank on Tuesday, Palestinian health authorities said.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "c3721d73-5de5-4ab0-adf5-3f0af35bacf2", "title": "Israel - Gaza live updates : IDF soldiers accused of abusing Palestinians denied release", "date": "2024-08-09 04:45", "url": "https://www.yourfortdodge.com/syndicated-article/?id=1578297", "domain": "yourfortdodge.com", "domain_classification": "Unknown", "message": "IDF soldiers accused of abusing Palestinian prisoners denied releaseFive Israel Defense Forces soldiers who are in custody under suspicion of aggravated abuse of a Palestinian prisoner have been denied release by a military court on Thursday, according to the IDF.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nThe attack comes as Israel awaits a military response from Hezbollah or Iran after it assassinated leaders of Hezbollah and Hamas.\nAt least 8 Palestinians killed during Israeli military raids in occupied West BankAt least eight Palestinians were killed by Israeli forces during military raids in the occupied West Bank on Tuesday, Palestinian health authorities said.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "25c3ccf4-131f-4105-aeff-8cad593c053c", "title": "Israel - Gaza live updates : IDF soldiers accused of abusing Palestinians denied release", "date": "2024-08-09 10:45", "url": "https://www.centralmoinfo.com/syndicated-article/?id=1578297", "domain": "centralmoinfo.com", "domain_classification": "Unknown", "message": "IDF soldiers accused of abusing Palestinian prisoners denied releaseFive Israel Defense Forces soldiers who are in custody under suspicion of aggravated abuse of a Palestinian prisoner have been denied release by a military court on Thursday, according to the IDF.\nOf those killed, 18 Palestinians were killed in eastern and central Khan Yunis.\nThe attack comes as Israel awaits a military response from Hezbollah or Iran after it assassinated leaders of Hezbollah and Hamas.\nAt least 8 Palestinians killed during Israeli military raids in occupied West BankAt least eight Palestinians were killed by Israeli forces during military raids in the occupied West Bank on Tuesday, Palestinian health authorities said.\nDeif was allegedly one of the masterminds of the Oct. 7 attack on Israel, according to the Israel Defense Forces (IDF)."}, {"id": "10cdabae-f3ac-438c-ad47-6960f8eb1325", "title": "Missile Strike On Kostiantynivka : 11 Killed , 44 Injured", "date": "2024-08-09 17:30", "url": "https://menafn.com/1108537621/Missile-Strike-On-Kostiantynivka-11-Killed-44-Injured", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The injury toll from a Russian attack on Kostiantynivka, Donetsk region, has increased to 44 people.\nAccording to Ukrinform, the State Emergency Service of Ukraine reported this on .\n\"Kostiantynivka: 11 dead and 44 wounded as a result of the Russian attack on the city,\" the statement says.\nRussian strike on: Ten killed, 35 woundedThe State Emergency Service reported that emergency rescue operations are underway and all relevant services are working at the site.\nEarlier, 11 people were reported dead and 37 wounded."}, {"id": "e8b14829-517f-4a0c-9958-f1306b0ffc1f", "title": "US updates injured count in Al Asad attack to 5 , down from 7", "date": "2024-08-09 00:00", "url": "https://www.cbs58.com/news/us-updates-injured-count-in-al-asad-attack-to-5-down-from-7", "domain": "cbs58.com", "domain_classification": "Unknown", "message": "US updates injured count in Al Asad attack to 5, down from 7Nasser Nasser/AP via CNN NewsourceBy Haley Britzky(CNN) — Five US personnel were injured in an attack this week on Al Asad Airbase in Iraq, deputy Pentagon press secretary Sabrina Singh said Thursday, a smaller number than the seven injured originally reported.\n“After conducting a post-strike analysis, we determined that four service members and one contractor (were) actually injured in the attack.\nThe other two received, you know, very minor injuries and returned to duty right away,” Singh said.\nInitial reports said that seven US personnel — five US service members and two contractors — were injured in the rocket attack on Monday.\n“Make no mistake: the United States will not tolerate attacks on our personnel in the region,” Austin said."}, {"id": "647e042e-e5e6-4ad1-9ebb-422fc72ba943", "title": "Nagasaki Mayor Calls On Nuclear Umbrella Countries To Give Up Weapons", "date": "2024-08-09 06:15", "url": "https://menafn.com/1108535136/Nagasaki-Mayor-Calls-On-Nuclear-Umbrella-Countries-To-Give-Up-Weapons", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Nuclear powers and states under a nuclear umbrella must change their policies and work towards the complete elimination of nuclear weapons.\n\"As long as nuclear weapons exist, the threat to humanity will only grow,\" said Shiro Suzuki.\n\"Leaders of nuclear powers and countries under a nuclear umbrella!\nSuzuki added that a personal visit to Hiroshima and Nagasaki will help the leaders of such states understand the horror of nuclear weapons.\nJapan itself is under the US nuclear umbrella."}, {"id": "0ffa3fe6-240e-45a0-9f76-27497dc05b6d", "title": "Israeli drones strike vehicle in southern Lebanon , two Hamas figures assassinated", "date": "2024-08-09 16:00", "url": "https://www.albawaba.com/news/israeli-drones-strike-vehicle-southern-1580773", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "ALBAWABA- In a significant escalation, Israeli occupation drones have struck a civilian vehicle at the southern entrance of Sidon city in Lebanon, reportedly killing two Hamas members.\nThe attack targeted the vehicle near the entrance to the Ein el-Hilweh refugee camp, allegedly marking the assassination of two Hamas commanders.\nAmong those killed in the Israeli drone strike was Samer Al-Hajj, a Hamas security official in the Ein al-Hilweh refugee camp near Sidon.\nThis was followed by additional Israeli raids on the towns of Al-Kharibah and Aita al-Shaab in southern Lebanon.\nThe vehicle that was just struck in Sidon, southern Lebanon https://t.co/7Lll7bRIlg pic.twitter.com/XtoQzYw9LL — Open Source Intel (@Osint613) August 9, 2024"}, {"id": "b88203c1-464b-469a-b54a-69f9c34fbe2a", "title": "Woman Killed , Suspect Fatally Shot in Irvine", "date": "2024-08-09 04:00", "url": "https://mynewsla.com/crime/2024/08/08/woman-killed-suspect-fatally-shot-in-irvine/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "A man who allegedly stabbed a woman to death in Irvine was fatally shot by police responding to the attack Thursday.\nPolice were dispatched at 2:51 p.m. Thursday to reports of a man attacking a woman on Green Tree Lane near Royce Road, said Kyle Oldoerp of the Irvine Police Department.\nAs officers arrived, they saw the suspect apparently stabbing the woman on the street, and it led to police shooting him, Oldoerp said.\nThe victim and the suspect were both pronounced dead at the scene, Oldoerp said.\nAaron Matthew, 47, killed 38-year-old John Alexander Bash III before confronting police with a knife, which led to him getting fatally shot, police said."}, {"id": "91c35f45-ddf3-4ac9-8dd2-1e2a0339a548", "title": "Hezbollah retaliates after drone strike kills two in Naqoura", "date": "2024-08-09 11:45", "url": "https://www.naharnet.com:443/stories/en/307178-hezbollah-retaliates-after-drone-strike-kills-two-in-naqoura", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Two people were killed on Friday morning in an Israeli drone strike on the coastal border town of al-Naqoura in south Lebanon, with Hezbollah announcing the death of two of its fighters \"on the road to Jerusalem\".\nIsraeli artillery also shelled the southern border town of al-Khiam.\nHezbollah, for its part, targeted a post in the occupied Kfarshuba Hills, and soldiers in Metula and Menara in north Israel.\nHezbollah has traded near-daily fire with Israeli forces in support of ally Hamas since the Palestinian militant group's October 7 attack on Israel triggered war in Gaza.\nFears of all-out war have mounted after Israel killed Hezbollah's top military commander Fouad Shukur in an air strike in a Beirut suburb last week."}, {"id": "6f511879-461e-4a17-abf5-93a1b48ea5ef", "title": "Russian Strike on Ukraine Supermarket Kills 10 , Wounds 35 ; Zelenskyy Vows  Accountability For Terror  ", "date": "2024-08-09 13:45", "url": "https://www.news18.com/world/russian-strike-on-ukraine-supermarket-kills-10-wounds-35-zelenskyy-calls-it-terror-vows-accountability-9010535.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "A Russian missile strike hit a supermarket in the Ukrainian town located in the front-line Donetsk region on Friday, killing at least ten people and injuring 35 others, Ukrainian officials said.\nHeavy black smoke clouds rising from the destroyed building could be seen in the images and videos posted by officials.\n‘Russia will be held accountable’“Russian terrorists hit an ordinary supermarket and a post office.\nRussian terrorists hit an ordinary supermarket and a post office.\nNova Poshta, Ukraine’s largest private postal company, said its cargo office in the supermarket was damaged in the strike."}, {"id": "c84bdc5c-2853-4825-a76b-89958293b592", "title": "Mideast tension heightening amid looming Iranian retaliatory attack on Israel", "date": "2024-08-09 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240809-pdo04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Mideast tension heightening amid looming Iranian retaliatory attack on IsraelPeople's Daily Online(Xinhua) 08:48, August 09, 2024* The Middle East has been bracing for escalating tension amidst Iran and its allies' threats to avenge the killings of Hamas and Hezbollah leaders last week.\n* Nobody is interested in a regional war, and nobody is going to gain anything from a regional war, experts said.\nLOOMING REGIONAL ESCALATIONOn July 30, Hezbollah senior military commander Fouad Shokor was killed in an attack on Beirut's southern suburbs.\nNegativity has already seeped into various facets of people's lives in the Middle East due to the prolonged regional conflict.\nNobody is going to gain anything from a regional war,\" he said."}, {"id": "91aaec98-f1b9-4737-aa53-5a8cb9a7109b", "title": "US Ambassador Skips Nagasaki Commemorations Over Israel Snub", "date": "2024-08-09 14:45", "url": "https://www.theepochtimes.com/world/us-ambassador-skips-nagasaki-commemorations-over-israel-snub-5702465", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "The Nagasaki mayor said Israel was not invited because of concerns over protests, sabotage, or attacks on attendants.\nThe ambassadors not attending the Nagasaki ceremony on Aug. 9 will be represented in most cases by lower-ranking diplomats.\nNagasaki Mayor Shiro Suzuki expressed reluctance in June to invite Israel, noting the escalating Middle East conflict.\nA tank maneuvers near the Israel-Gaza border amid the ongoing conflict between Israel and Hamas on Aug. 7, 2024.\nIsrael’s killing outside Beirut of Hezbollah’s top military leader, Fuad Shukr, last week was followed a few hours later by the assassination in Tehran of Hamas leader Ismail Haniyeh."}, {"id": "2f1edc7d-af0d-4200-b212-620c1665bee9", "title": "Israel kills 40 Palestinians in Gaza airstrikes amid fears of wider war", "date": "2024-08-09 05:00", "url": "https://dunyanews.tv/en/World/829653-israel-kills-40-palestinians-in-gaza-airstrikes-amid-fears-of-wider-wa", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Israel kills 40 Palestinians in Gaza airstrikes amid fears of wider warWorld World Israel kills 40 Palestinians in Gaza airstrikes amid fears of wider warIsraeli airstrikes hit a cluster of houses in central Gaza's Al-Bureij and nearby Al-Nuseirat campsFollow on Updated On: Fri, 09 Aug 2024 09:31:49 PKTCAIRO (AFP) - Israeli forces stepped up airstrikes across the Gaza Strip on Thursday (Aug 8), killing at least 40 people, Palestinian medics said, in further battle with Hamas-led militants as Israel braced for potential wider war in the region.\nIsraeli airstrikes hit a cluster of houses in central Gaza's Al-Bureij camp, killing at least 15 people, and the nearby Al-Nuseirat camp, killed four, medics said.\nNuseirat and Bureij are among the densely populated enclave's eight historic camps and are seen by Israel as strongholds of armed militants.\nIsrael's military said it had struck dozens of military targets across Gaza over the past 24 hours, including rocket launching pads.\nThe Israeli military said it did not know of any such incident, adding that it had been in contact with WCK."}, {"id": "60819a30-46e4-4c27-98bb-9b1bab3bd100", "title": "Israel kills 40 Palestinians in Gaza airstrikes amid fears of wider war", "date": "2024-08-09 04:45", "url": "https://www.asiaone.com/world/israel-kills-40-palestinians-gaza-airstrikes-amid-fears-wider-war", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "CAIRO — Israeli forces stepped up airstrikes across the Gaza Strip on Thursday (Aug 8), killing at least 40 people, Palestinian medics said, in further battle with Hamas-led militants as Israel braced for potential wider war in the region.\nNuseirat and Bureij are among the densely populated enclave's eight historic camps and seen by Israel as strongholds of armed militants.\nThe Israeli military said it struck Hamas command and control centres embedded in the Abdel-Fattah Hamouda and Al-Zahra schools in the Tuffah neighbourhood of Gaza City, where Hamas militants were operating.\nIsrael's military said it had struck dozens of military targets across Gaza over the past 24 hours, including rocket launching pads.\nThe Israeli military said it did not know of any such incident, adding that it had been in contact with WCK."}, {"id": "dae431f9-e5e4-4148-9cb5-fc7c1b63e8cf", "title": "Israel - Hamas war latest : Palestinians flee parts of south Gaza as Israel launches a new assault", "date": "2024-08-09 11:15", "url": "https://www.news4jax.com/news/2024/08/09/israel-hamas-war-latest-palestinians-flee-parts-of-south-gaza-as-israel-launches-a-new-assault/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Hamas official killed in Lebanon by an Israeli drone strikeBEIRUT — An Israeli drone strike hit a car in a southern Lebanese city on Friday, killing a Hamas official.\nHezbollah has said that it will only stop firing toward Israel once the war in Gaza comes to and end.\n“The war in Gaza must stop,” Macron said in a post in English and French on X.\nMan wounded in Hezbollah drone attack on Israel earlier this week has diedJERUSALEM — A man who was seriously wounded by a Hezbollah drone attack on Israel earlier this week succumbed to his wounds Friday, hospital officials said.\nHowever, many of the ships attacked have little or no connection to the war, including some bound for Iran."}, {"id": "7f1cd06c-49ab-4b23-8ca0-42749a629e3c", "title": "Russia declares emergency in Kursk region as Ukraine launches mega attack", "date": "2024-08-09 14:45", "url": "https://timesofindia.indiatimes.com/world/europe/russia-declares-emergency-in-kursk-region-as-ukraine-launches-mega-attack/articleshow/112406905.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Russia declared a \"federal-level\" emergency in the Kursk region following a large-scale incursion from Ukraine, sending reinforcements on Friday.This move came four days after hundreds of Ukrainian troops crossed the border in what appears to be Kyiv's biggest attack on Russian soil since the war began.\nThe reinforcement includes multiple rocket launchers, towed artillery guns, tanks on trailers, and heavy tracked vehicles, according to the RIA-Novosti news agency citing the Defense Ministry.\nThe last reported number of evacuations in Kursk was 3,000.Little reliable information has emerged regarding the surprise Ukrainian operation, and its strategic aims remain unclear.\nHe also suggested that the operation could strengthen Kyiv's position in potential negotiations with Moscow.The Ukrainian army is concurrently striving to hold back an intense Russian push in eastern Ukraine, particularly in the Donetsk region.\nUkrainian drones attacked Russia's Lipetsk region, roughly 300 kilometers (180 miles) from the Ukraine border, during Thursday night.According to a security official who spoke to The Associated Press on condition of anonymity, drones operated by Ukraine's Security Service targeted a military airfield in Lipetsk."}, {"id": "972ed826-ffca-4634-b279-2c2d69dba907", "title": "Bangkok Post - Israel kills 40 Palestinians in Gaza airstrikes", "date": "2024-08-09 06:00", "url": "https://www.bangkokpost.com/world/2844452/israel-kills-40-palestinians-in-gaza-airstrikes-amid-fears-of-wider-war", "domain": "bangkokpost.com", "domain_classification": "Unknown", "message": "Smoke rises following Israeli strikes in Khan Younis in the southern Gaza Strip on Thursday.\nIsrael's military said it had struck dozens of military targets across Gaza over the past 24 hours, including rocket launching pads.\nMore burials in GazaOn Thursday dozens of Palestinians rushed into Nasser Hospital in Khan Younis to bid farewell to slain relatives before carrying them away for burials.\nBurial plots near a mass grave for Palestinians killed in the ongoing conflict between Israel and Hamas, in Khan Younis, southern Gaza, on Monday.\nThe Israeli military said it did not know of any such incident, adding that it had been in contact with WCK."}, {"id": "963a9e1a-83bf-4a5f-b123-69ade2f04901", "title": "As war drums beat , many in Beirut suburb have nowhere to flee", "date": "2024-08-09 19:15", "url": "https://www.marketscreener.com/news/latest/As-war-drums-beat-many-in-Beirut-suburb-have-nowhere-to-flee-47615293/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "This time around, there's no car, no rent money, and no sense of when hostilities may end.\nA five-year economic meltdown has devalued the dollar, cost him his savings, bringing his monthly salary down from more than $5,000 to barely $500.\nHe's sent his wife and children to live with his in-laws for their safety, while he has stayed in Dahiyeh to keep working.\nBut demand has seen monthly rent prices in those areas spiking, sometimes reaching $1,000.\n\"Now it's a psychological war more than a normal war, it is just a psychological one."}, {"id": "425fbdf3-9d5f-4b79-8860-77681d8d2c28", "title": "Terrified Russians FLEE and hundreds of Putin troops are killed as Ukraine presses on with its cross - border offensive , with military airfield also destroyed", "date": "2024-08-09 10:00", "url": "https://www.dailymail.co.uk/news/article-13726849/Terrified-Russians-FLEE-hundreds-Putins-troops-killed-Ukraine-presses-cross-border-offensive-military-airfield-destroyed.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "'Russia brought the war to our land and should feel what it has done,' Zelensky said, without directly referring to the offensive.\nBut more than a dozen armoured vehicles and trucks were said to be carrying hundreds of soldiers when the missiles struck.\nThe huge blow enraged pro-war military channels in Russia who claimed it showed the sheer incompetence of their own military commanders.\nSeparately, Ukraine hit a major Russia bomb store and military airfield in Lipetsk overnight.\nLipetsk city is about 210 miles from the Ukrainian border with Russia's Kursk region, where pro-Kyiv forces have been waging their ground offensive."}, {"id": "e7f312ea-2010-430a-ba60-aa7f9dbf9459", "title": "Iran - watchers look for signals of threatened attack on Israel", "date": "2024-08-09 12:30", "url": "https://www.bbc.com/news/articles/cvgewyx7pn5o", "domain": "bbc.com", "domain_classification": "International", "message": "The gathering was an opportunity for Iran, whose Supreme Leader Ayatollah Khamenei has vowed “harsh punishment” for the killing, to lay out the reasons for an expected retaliation.\nBoth Iran and Hamas say the 31 July assassination was carried out by Israel, which has not commented but is widely believed to have been behind it.\nLast week, American officials suggested that this time, Iran might have been preparing a bigger operation, perhaps in attempt to avoid repeating that failure.\nMeanwhile, there is also the wait for another expected attack on Israel, from Hezbollah, the Iranian-backed militia and political movement in Lebanon.\nHezbollah leader Hassan Nasrallah, who has promised a “strong” and “effective” response, described Shukr as one of the “strategic minds of the resistance” and said they had spoken on the phone an hour before his assassination."}, {"id": "71565bf9-c17b-44a9-aa68-99b192a45786", "title": "Russian strike on Ukraine supermarket kills at least nine , with 26 injured", "date": "2024-08-09 12:45", "url": "https://www.irishtimes.com/world/europe/2024/08/09/ukraine-russia-war-latest-news/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "READ MORE“Sudzha is under the full control of Ukrainian troops,” said the 61st mechanised brigade on Telegram.\nThe Ukrainian official claimed that up to 700 glide bombs stored in the warehouses were damaged or destroyed.\n“Most of the planes stationed at the military airfield ... did not have time to take off,” the Ukrainian official claimed.\nRussian military bloggers reported that no aircraft were damaged.\n⁠Mr Zagorodnyuk said the Ukrainian military was proving its ability to conduct “new tactics of combined arms operation” taught by western military trainers."}, {"id": "fc3c67a5-58e4-490a-b7ec-75c9dca4d972", "title": "Nagasaki Day 2024 : Why bombing on this city known as  Fat Man ? ", "date": "2024-08-09 07:45", "url": "https://www.jagranjosh.com/general-knowledge/why-bombing-on-nagasaki-is-known-as-fat-man-1723183868-1", "domain": "jagranjosh.com", "domain_classification": "Unknown", "message": "As we observe Nagasaki Day 2024, it is imperative to understand the complexities surrounding this tragic event.\nAfter the August 9, 1945 atomic bombing of #Nagasaki , Sanno Shrine's torii gate, Shiroyama National School Building, Urakami Cathedral's belfry, etc.\nThe Aftermath of the Nagasaki BombingDevastation in Nagasaki (Image Source: National World War II Museum)The detonation of \"Fat Man\" unleashed unimaginable destruction on Nagasaki.\nNagasaki Day TodayNagasaki Day is observed annually on August 9th as a solemn commemoration of the tragedy.\nREAD| Hiroshima and Nagasaki Day 2024: History, Photos and Bombing Facts"}, {"id": "1943f17a-f7a4-4e75-8f6a-220f0b30054a", "title": "Hamas consolidates power under alleged Oct . 7 mastermind after spate of Israeli assassinations", "date": "2024-08-09 18:15", "url": "https://www.nbcnews.com/news/world/israel-hamas-war-yahya-sinwar-leader-gaza-cease-fire-hostages-rcna165517", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "TEL AVIV — Yahya Sinwar, the alleged mastermind of the Oct. 7 terror attack on Israel, is the undisputed leader of Hamas after the militant group’s political leader Ismail Haniyeh was assassinated and Israel confirmed it had killed Mohammed Deif, the military chief.\nUntil now, Sinwar has remained largely out of the spotlight, a shadowy figure believed to be hiding in Hamas’ labyrinth of tunnels underneath the Gaza Strip.\nBut his appointment as the group’s political leader has left many wondering what it could mean for the ongoing cease-fire and hostage release talks.\nFor Basem Naim, a senior Hamas official, Sinwar’s promotion suggests it’s business as usual for the group.\n“Whoever decided to assassinate Ismail Haniyeh does not care about the hostages,” said Thabeet Elhmour, a Palestinian political analyst and writer based in Gaza’s southern city of Khan Younis."}, {"id": "76927c97-3e62-4e05-936c-e24464884841", "title": "Covering Gaza : The deadliest war for journalists", "date": "2024-08-09 09:30", "url": "https://globalvoices.org/2024/08/09/covering-gaza-the-deadliest-war-for-journalists/", "domain": "globalvoices.org", "domain_classification": "Unknown", "message": "This dangerous accusation — thoroughly refuted by the channel — has been used repeatedly by the Israeli side to justify killing journalists, which risks normalizing the targeting of journalists with unfounded accusations.\nThe Gaza government media office put the number at 165 Palestinian journalists and media workers killed.\nThe Al Jazeera Network — banned by Israel since May 2023 — has been heavily targeted, with five of its journalists killed in Gaza since the war began.\nThe scale of journalist killing by Israel during this war is best seen when comparing it to the global number.\nMore than three quarters of the 99 journalists killed worldwide in 2023 were killed in the Gaza war according to the CPJ."}, {"id": "9538013b-9c01-4733-8110-d4df714c527c", "title": "Kyiv offensive : Ukraine unleashes drone attack on Russian airfield", "date": "2024-08-09 13:45", "url": "https://www.cnbc.com/2024/08/09/kyiv-offensive-ukraine-unleashes-drone-attack-on-russian-airfield.html", "domain": "cnbc.com", "domain_classification": "Unknown", "message": "Ukrainian drones struck a key military airfield in Russia's Lipetsk region, forcing authorities to declare a state of emergency in another Russian region this week in the face of Kyiv's ongoing cross-border offensive.\nAll are receiving the necessary assistance,\" Artamonov said in a later Google-translated Telegram update, without detailing the state of those who had suffered injuries.\nKursk was still reporting missile danger alerts as of Friday, according to Google-translated Telegram updates from regional Governor Alexei Smirnov, who said the local situation remained \"difficult.\"\nMoscow has continued its own advances, with a Russian missile hitting a supermarket in the town of Kostiantynivka in the front-line Ukrainian region of Donetsk on Friday.\nAt least 10 people were killed and 35 others were injured as a result, according to Minister of Internal Affairs Ihor Klymenko in a Google-translated Telegram update."}, {"id": "df37536b-bc99-45ea-81ef-a1b0de05927d", "title": "Iran Israel latest news : Hezbollah and Iran vow retaliation as Gaza school bombings kill over a dozen", "date": "2024-08-09 07:30", "url": "https://www.independent.co.uk/news/world/middle-east/israel-iran-gaza-war-hamas-hezbollah-attack-airspace-news-b2593718.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nLebanon has already received just a third of the $74m it has sought in aid since the Gaza war began.\nMeanwhile, fighting intensified in Gaza as families fled from parts of the Strip’s second-largest city following an evacuation order issued by Israel’s military.\nIn Gaza City, around 15 people were killed after Israel bombed two schools being used to shelter displaced people in the northern Gaza Strip, Palestinian Civil Defence said.\nIsrael’s military said that the attacks were intended to destroy Hamas “command-and-control centres” inside the school compounds."}, {"id": "c18f7b43-5321-4e7e-801b-ae98aa0bee7b", "title": "F / A - 18E Super Hornets Fully Loaded With Air - To - Air Missiles Arrive In Jordan", "date": "2024-08-09 04:15", "url": "https://www.yahoo.com/news/f-18e-super-hornets-fully-013946818.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "US Navy F/A-18E Super Hornets brandishing full loads of nine air-to-air missiles have touched down at a base in Jordan ahead of expected Iranian attacks against Israel.\nU.S. Navy F/A-18E Super Hornets from the supercarrier USS Theodore Roosevelt are now operating from a major U.S. air operations hub in Jordan.\nA map showing the general location of Muwaffaq Salti Air Base in Jordan.\nGoogle MapsJust earlier this year, Navy Super Hornets became even better suited to help knock down hordes of incoming drones and cruise missiles.\nThe jets from VFA-25 that arrived at Muwaffaq Salti Air Base showcased this air-to-air munitions flexibility with four AIM-9Xs installed."}, {"id": "946916ae-de7d-445e-aee8-dbe3337bc3a7", "title": "M - E : Escalating Tensions", "date": "2024-08-09 10:45", "url": "https://www.thehitavada.com/Encyc/2024/8/9/M-E-Escalating-Tensions.html", "domain": "thehitavada.com", "domain_classification": "Unknown", "message": "The entire West Asia and the Middle East has been on the edge post the assassination of Ismail Haniyeh on July 31, 2024.\nAs per one report, almost 40,000 Palestinians have been killed in the Israel military campaign so far and half of Gaza has been razed to ground.\nWith the killing of Haniyeh, the conflagration of this conflict in West Asia is a clear possibility.\nWest Asia is a subregion of Asia that is bordered by Europe to the West, Central Asia to the North and South Asia to the East.\nThe Middle East is more of a political term whereas the West Asia is a geographical term with more clarity."}, {"id": "c7eb0c52-71f9-4855-840d-6f9ef1e3cdc2", "title": "Drone Attack Leaves Military Airfield Near Lipetsk In Flames", "date": "2024-08-09 10:00", "url": "https://menafn.com/1108536688/Drone-Attack-Leaves-Military-Airfield-Near-Lipetsk-In-Flames", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) A blaze broke out at a military airfield after a reported drone attack near Russia's Lipetsk in the early hours of Friday, August 9.\n\"Fire at the military airfield,\" reads the alert by the regional service of the of Emergency Situations.\nAccording to Astra, an ammunition warehouse likely caught fire after the drone attack targeting the airfield.\nThe governor of the region, Ihor Artamanov, never mentioned the fire at the airfield in his morning updates, only reporting a massive drone attack.\nAs Ukrinform wrote earlier, local authorities in Russia's Lipetsk and Belgorod regions reported drone attacks overnight Friday."}, {"id": "3fed8e47-33d0-4bd5-8707-7913f7f52127", "title": "Casualties As Russian Jet Artillery Pummels Kupiansk", "date": "2024-08-09 10:00", "url": "https://menafn.com/1108536685/Casualties-As-Russian-Jet-Artillery-Pummels-Kupiansk", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) In Kharkiv region, Russian invaders launched a massive strike targeting residential quarters in Kupiansk, leaving at least three civilians injured.\n\"According to tentative reports, three were as a result of an overnight enemy massive jet artillery strike on the residential quarters of the city of Kupiansk and nearby settlements,\" the statement reads.\nUkraine downs all 27 Russian kamikaze UAVs launched overnight FridayRescuers operated under intense enemy fire.\nAs Ukrinform reported earlier, on the morning of August 6, Russian troops targeted a densely populated area of Kharkiv, employing a ballistic missile, likely of the Iskander type.\nAccording to the police, the missile damaged a number of buildings, including a polyclinic and several apartment blocks, as well as 25 cars."}, {"id": "8c78dafe-cc5b-4c01-ba69-7af197e8ffa2", "title": "Russia declares an emergency in Kursk , under attack by Ukraine . 11 killed in Russian strike on mall – Winnipeg Free Press", "date": "2024-08-09 14:45", "url": "https://www.winnipegfreepress.com/breakingnews/2024/08/09/russia-declares-a-federal-emergency-in-a-border-region-that-is-under-attack-from-ukrainian-forces", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "The mall in Kostiantynivka, in the eastern Donetsk region, is located in the town’s residential area.\n“The operational situation in the Kursk region remains difficult,” Kursk acting governor Alexei Smirnov said on Telegram.\nEmergency workers search for victims after Russian missile hit a supermarket in Kostiantynivka, Donetsk region, Ukraine, Friday, Aug. 9, 2024.\nEmergency workers search for victims after Russian missile hit a supermarket in Kostiantynivka, Donetsk region, Ukraine, Friday, Aug. 9, 2024.\nThe Russian Defense Ministry said that 75 Ukrainian drones were shot down during the night, 19 of them over Lipetsk."}, {"id": "962d115b-ff69-4b52-b76f-449ae2d348c3", "title": "Trump gunman visited shooting range dozens of times including Christmas Day amid  intense attack preparations  ", "date": "2024-08-09 14:45", "url": "https://www.independent.co.uk/news/world/americas/us-politics/trump-gunman-shooting-range-christmas-b2593855.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "The 20-year-old even visited the site on holidays, with visits logged on Christmas Day, Valentine’s Day and Halloween.\nThen, minutes after Trump took to the stage, Crooks opened fire with an AR-15 rifle.\nWhy weren’t we?”The new details come as authorities – in particular the Secret Service – continue to face questions over the failings that day.\nLast month, Secret Service Director Kimberly Cheatle branded the agency’s inability to protect Trump “the most significant operational failure at the Secret Service in decades” – before resigning from her post.\nDuring a press conference last Friday, acting Secret Service director Ronald Rowe also admitted “we should have had more of a presence” at the building."}, {"id": "f722adb4-268a-4b6e-a9b6-dd2dee5a1d9b", "title": "Europe energy transition is holding back Ukraine recovery", "date": "2024-08-09 10:45", "url": "https://www.yahoo.com/news/europe-energy-transition-holding-back-093406777.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "In some respects, Europe’s energy transition has proved a boon to Ukraine; the decommissioning of coal plants in Germany, Poland, and elsewhere has created a stockpile of parts that Ukrainian energy officials are now scouring.\nThat’s both because of the emissions implications of refurbishing coal-fired plants, and because such investments may lose value in a post-war, post-energy transition Ukraine.\nRoom for DisagreementWhile it rebuilds its coal plants, DTEK’s ambitious plans to develop new wind farms and grid-scale energy storage are on hold.\nHis whole business strategy, he said, is predicated on the theory that first-movers in the energy transition will profit most after the war.\n“We need to get ready for this.”The View From KurskUkraine, meanwhile, is escalating its own counterattacks on energy infrastructure in Russia."}, {"id": "73a2302b-8a14-475d-ad3d-7ff898fe789e", "title": "Deputy Pentagon Press Secretary Sabrina Singh Holds a Press Conference", "date": "2024-08-09 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240808-dod01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "August 8, 2024TranscriptDeputy Pentagon Press Secretary Sabrina Singh Holds a Press ConferenceDEPUTY PRESS SECRETARY SABRINA SINGH: OK, good afternoon.\nWhen it comes to —SABRINA SINGH: I'm not going to be able to provide more at this time.\nSABRINA SINGH: I'm not aware of US forces being involved in the arrest of individuals that were responsible for the attack.\nI'm going to come back in the room, but I'm just going to go to the phone before I forget.\nSABRINA SINGH: I don't know the story that you're referencing, and I wouldn't comment on any specifics at this point."}, {"id": "ec851cd2-958d-436d-ad73-393229a5ef91", "title": "Alarmists | Philstar . com", "date": "2024-08-09 16:45", "url": "https://www.philstar.com/opinion/2024/08/10/2376719/alarmists", "domain": "philstar.com", "domain_classification": "Unknown", "message": "The sharply erratic behavior of the markets was aggravated by alarmists.\nThe US Fed is perceived to be behind the curve in lowering the interest rate regime, putting economic expansion on hold.\nWhile most economies had jacked up interest rates the past few years, Japan stubbornly maintained a very low interest rate regime.\nAs the rest of the world jacked up interest rates while Japan maintained low interest rates, “carry trades” were encouraged.\nInvestors took out yen loans at low interest rates and invested the money in economies with higher interest rates."}, {"id": "4d1d0e35-43e9-4c88-96e2-002e2c076cf4", "title": "Taylor Swift Vienna shows canceled after thwarted terror attack", "date": "2024-08-09 07:45", "url": "http://www.businessghana.com/site/news/entertainment/311838/Taylor-Swift", "domain": "businessghana.com", "domain_classification": "Unknown", "message": "Taylor Swift’s three planned concerts in Vienna this week have been canceled due to concerns over terrorism, organizers said on Wednesday.\n“Taylor Swift | The Eras Tour Vienna shows cancelled due to government officials confirmation of planned terrorist attack,” Barracuda Music, an Austria-based music promoter group, wrote on Instagram.\nWhat we knowPolice have arrested two people in connection with the attempted terror attack: the aforementioned 19-year-old and a 17-year-old.\nIn a post on X, Nehammer called the cancellation a \"bitter disappointment for all fans,\" but he emphasized that the \"planned terror attack in Vienna was very serious.\"\nLondon, the next stop on the tour, preparesVariety confirmed that Swift's concerts at Wembley Stadium in London have not been canceled."}, {"id": "e7a23ec1-3150-43eb-8d3e-259528a4ec15", "title": "Ten killed , 35 hurt in Russian strike on supermarket in Ukraine east", "date": "2024-08-09 14:45", "url": "https://kathmandupost.com/world/2024/08/09/ten-killed-35-hurt-in-russian-strike-on-supermarket-in-ukraine-s-east", "domain": "kathmandupost.com", "domain_classification": "Unknown", "message": "Ten killed, 35 hurt in Russian strike on supermarket in Ukraine’s eastKostiantynivka lies just about 13 kilometers from the active combat line in Ukraine’s east.\nKyiv-held parts of the Donetsk region regularly come under Russian shelling and air strikes.\nFirefighters and police officers work at a site of a supermarket heavily damaged by a Russian military strike, amid Russia's attack on Ukraine, in Kostiantynivka, Donetsk region, Ukraine August 9, 2024."}, {"id": "5b705047-4a80-44af-818c-555a81e5b9cf", "title": "Police release body cam footage from the day of Trump attempted assassination : NPR", "date": "2024-08-09 01:30", "url": "https://www.npr.org/2024/08/08/nx-s1-5068708/trump-assassination-attempt-police-body-cam", "domain": "npr.org", "domain_classification": "International", "message": "Newly released video shows chaos and confusion after Trump assassination attempttoggle caption Butler Township Police DepartmentNewly released body camera video reveals the chaotic law enforcement response to the assassination attempt on former President Donald Trump last month.\nHe’s got a book bag, he’s got mad s***.”As he is doing this his body camera captures a number of law enforcement officers attempting to reach the roof.\ntoggle caption Butler Township Police DepartmentA 50-year-old former fire chief, Corey Comperatore, was killed and two other rally-goers were seriously wounded in the attack.\nThat question is still unanswered as law enforcement, including the Secret Service, cite an ongoing investigation.\nA separate video from an officer outside the building where the gunman fire from underscores the confusion even among law enforcement early on."}, {"id": "03fa733e-b41d-482d-9db1-73ce0278d5f6", "title": "Israel Haifa engulfed by fear of Iran , Hezbollah retaliation : Media", "date": "2024-08-09 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240808-presstv10.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Israel's Haifa engulfed by fear of Iran, Hezbollah retaliation: MediaIran Press TVThursday, 08 August 2024 9:59 AMIsraeli media reports indicate that settlers in the strategic port city of Haifa in the northern occupied territories are increasingly anxious about potential retaliatory strikes from Iran and Lebanon's Hezbollah in response to recent Israeli assassinations of top resistance leaders.\nThe Israeli newspaper Haaretz said in a report on Wednesday that Haifa settlers are \"very afraid\" that their petrochemical factories in the port city, which contains hazardous materials, could be struck by Iran and Hezbollah.\nThe scenario that deprives many Haifa settlers of sleep is \"strikes on petrochemical plants, including oil refineries, where large concentrations of hazardous materials are stored,\" the paper said.\nThe survey stressed, \"There are dozens of companies working with hazardous materials, as well as a gas farm, located in the same area.\"\nThe paper said recent assessments suggest, \"Hezbollah will strike first, while Iran deliberates its response to Haniyeh's assassination.\""}, {"id": "e3c5e05a-5265-4078-88d4-6f88027b7a77", "title": "The 1948 Irgun Re - Born ? ", "date": "2024-08-09 04:30", "url": "https://www.zerohedge.com/geopolitical/1948-irgun-re-born", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "Yet these obvious facts are completely ignored by a rationality that, as Weinstein suggests, actively prefers fraud to truth.\nWashington says it does not want war with Iran, yet the latter explicitly was what Netanyahu advocated.\nAgain, overlooked but not in the news: The situation at Sde Teiman was widely-known and said to be “more horrific than anything we’ve heard about Abu Ghraib and Guantanamo”.\nReports suggest that the perpetrators at Sde Teiman enjoy high level protection.\nThe 1948 Irgun, drawing heavily on the Mizrahim, is being reborn?"}, {"id": "80e36054-676b-4cdb-9cf8-3fed64e94b69", "title": "19 Palestinians killed in fresh Israeli strikes on Gaza Khan Yunis", "date": "2024-08-09 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240808-presstv15.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "19 Palestinians killed in fresh Israeli strikes on Gaza's Khan YunisIran Press TVThursday, 08 August 2024 6:24 AMIsraeli warplanes have conducted fresh air raids on Khan Yunis governorate, in southern Gaza Strip, killing at least 19 Palestinians, some of whom were burned alive.\nFour more Palestinians were killed and an unspecified number wounded in an Israeli bombing of a house and a popular market west of Khan Yunis.\nMeanwhile, an aerial assault by the occupation's military near al-Shafi'i Mosque west of Khan Yunis claimed the lives of three people and injured 10, according to the Gaza Civil Defense.\nMany of the victims of the Israeli attacks on Khan Yunis tents were burned alive, Qatar-based Al Jazeera TV reported.\nThe International Criminal Court (ICC) is seeking arrest warrants for Israeli officials over war crimes and crimes against humanity in Gaza."}, {"id": "fd1bcfa0-4b97-4425-a440-cb3347811a4d", "title": "State plans to evacuate Kenyans in Lebanon as war fears grow", "date": "2024-08-09 14:30", "url": "https://www.the-star.co.ke/news/realtime/2024-08-09-state-plans-to-evacuate-kenyans-in-lebanon-as-war-fears-grow/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "The government is planning to evacuate Kenyans from Lebanon over security concerns, the office of Prime Cabinet Secretary and Foreign and Diaspora Affairs has said.\nIn a press statement, the ministry said the government is monitoring the unfolding situation in Lebanon and stands ready to rapidly evacuate Kenyans wishing to leave the Middle East country.\nIt said an Inter-Ministerial Committee led by the State Department for Diaspora Affairs is working round the dock to ensure the safety of the 26,599 Kenyans in Lebanon.\nIt further added that Kenyans in Lebanon wishing to be evacuated must urgently register through https itinyurl.com/me for timely information assistance.\nIt said the safety of Kenyans in diaspora remain a top government priority."}, {"id": "0797ef3a-783e-4e36-aebe-e781bbe95866", "title": "Israel - Hamas war latest : Palestinians flee parts of south Gaza as Israel launches a new assault", "date": "2024-08-09 10:45", "url": "https://www.ksat.com/news/2024/08/09/israel-hamas-war-latest-palestinians-flee-parts-of-south-gaza-as-israel-launches-a-new-assault/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Hamas official killed in Lebanon by an Israeli drone strikeBEIRUT — An Israeli drone strike hit a car in a southern Lebanese city on Friday, killing a Hamas official.\nHezbollah has said that it will only stop firing toward Israel once the war in Gaza comes to and end.\n“The war in Gaza must stop,” Macron said in a post in English and French on X.\nMan wounded in Hezbollah drone attack on Israel earlier this week has diedJERUSALEM — A man who was seriously wounded by a Hezbollah drone attack on Israel earlier this week succumbed to his wounds Friday, hospital officials said.\nHowever, many of the ships attacked have little or no connection to the war, including some bound for Iran."}, {"id": "ec3bc93e-fe32-4525-a512-bef992a31a6a", "title": "Russia declares an emergency in Kursk , under attack by Ukraine . 11 killed in Russian strike on mall", "date": "2024-08-09 13:45", "url": "https://www.local10.com/news/world/2024/08/09/russia-declares-a-federal-emergency-in-a-border-region-that-is-under-attack-from-ukrainian-forces/", "domain": "local10.com", "domain_classification": "Unknown", "message": "July saw the heaviest civilian casualties in Ukraine since October 2022, the U.N. Human Rights Monitoring Mission in Ukraine said Friday.\n“The operational situation in the Kursk region remains difficult,” Kursk acting governor Alexei Smirnov said on Telegram.\nA Russian Defense Ministry statement Friday said Russia's military “continues to repel the attempted invasion” and is responding with airstrikes, artillery and troops on the ground.\nUkraine has also kept up its strategy of hitting rear areas with long-range drones, targeting Russian military sites, oil refineries and other infrastructure.\nThe Russian Defense Ministry said that 75 Ukrainian drones were shot down during the night, 19 of them over Lipetsk."}, {"id": "5d5c6c03-cf6e-4754-92ac-8935183a6fd1", "title": "Russia declares an emergency in Kursk , under attack by Ukraine , 11 killed in Russian strike on mall", "date": "2024-08-09 14:15", "url": "https://www.stripes.com/theaters/europe/2024-08-09/russia-declares-emergency-kursk-14805542.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "Emergency workers search for victims after Russian missile hit a supermarket in Kostiantynivka, Donetsk region, Ukraine, Friday, Aug. 9, 2024.\nThe mall in Kostiantynivka, in the eastern Donetsk region, is located in the town’s residential area.\n“The operational situation in the Kursk region remains difficult,” Kursk acting governor Alexei Smirnov said on Telegram.\nThe Russian Defense ministry reported fighting in the western outskirts of Sudzha, about 10 kilometers (6 miles) from the border.\nThe Russian Defense Ministry said that 75 Ukrainian drones were shot down during the night, 19 of them over Lipetsk."}, {"id": "21da8acd-0dbf-4893-978e-75ee6a4f81ff", "title": "Maban MP demands justice for victims of Sudanese army airstrike", "date": "2024-08-09 11:45", "url": "https://www.radiotamazuj.org/en/news/article/maban-mp-demands-justice-for-victims-of-sudanese-army-strike", "domain": "radiotamazuj.org", "domain_classification": "Unknown", "message": "A lawmaker representing Upper Nile State’s Maban County in the Transitional National Legislative Assembly has decried Tuesday’s killing of two boys in a random Sudanese army airstrike in a border area with Sudan’s Blue Nile State.\nHe condemned the killing of the two South Sudanese citizens as gruesome and ultimate disregard for his country’s airspace.\nHe added, “The reason for them attacking the area is not clear but recently there was fighting near the border between SAF with SPLM-N and RSF.”The South Sudanese lawmaker demanded justice for the victims of the Sudanese army airstrike in Maban County.\nAs the army we are aware and the army leadership will officially inform the Sudanese side soon.\nSecondly, on compensation for the damages and the killing, this will be handled by our justice and foreign affairs ministries.”Calls to the Sudanese army spokesman went unanswered."}, {"id": "ed0fe517-2d51-4a18-9ad1-052dc0147647", "title": "Russia declares an emergency in Kursk , under attack by Ukraine . 11 killed in Russian strike on mall", "date": "2024-08-09 15:00", "url": "https://abcnews.go.com/International/wireStory/russia-declares-federal-emergency-border-region-attack-ukrainian-112704921", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Russia has declared a “federal-level” emergency in the Kursk region following a large-scale incursion from Ukraine and sent reinforcements thereRussia declares an emergency in Kursk, under attack by Ukraine.\n“The operational situation in the Kursk region remains difficult,” Kursk acting governor Alexei Smirnov said on Telegram.\nA Russian Defense Ministry statement Friday said Russia's military “continues to repel the attempted invasion” and is responding with airstrikes, artillery and troops on the ground.\nUkraine has also kept up its strategy of hitting rear areas with long-range drones, targeting Russian military sites, oil refineries and other infrastructure.\nThe Russian Defense Ministry said that 75 Ukrainian drones were shot down during the night, 19 of them over Lipetsk."}, {"id": "ee13e508-fee4-4d7d-a4db-387cb1770a92", "title": "Russia mobilises troops , arms to counter Ukraine incursion", "date": "2024-08-09 16:45", "url": "https://punchng.com/russia-mobilises-troops-arms-to-counter-ukraine-incursion/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "- Russian forces are still facing a major incursion by Ukrainian troops on their soil, in the Kursk border region, on August 8, 2024, an unexpected setback for the Kremlin whose army was to its advantage until then on the front.\nKyiv’s troops have been driving into Russia’s western Kursk region since Tuesday in a surprise offensive that appears to be the most significant attack on Russian soil since Moscow invaded in February 2022.\nAround 1,000 Ukrainian troops and more than two dozen armoured vehicles and tanks were involved in the initial attack, according to Russia’s estimates, although it has since claimed to have destroyed many more pieces of equipment.\nThousands have been evacuated from the border region, with Russia putting on an extra train to Moscow from the regional capital, Kursk, for those looking to leave.\nUkraine on Friday expanded its own evacuation zone in the Sumy region, just across the border from Kursk."}, {"id": "4d8b831a-2d1b-4804-bd5f-03e7cc76dc68", "title": "Watch fireball as Ukraine blitzes ANOTHER Putin region sparking evacuations", "date": "2024-08-09 14:30", "url": "https://www.the-sun.com/news/12152423/fireball-ukraine-blitzes-putin-region-evacuations-kursk-invasion/", "domain": "the-sun.com", "domain_classification": "Unknown", "message": "Chilling video shows the moment several deadly drones are sent plummeting towards the Russian region.\nShocking images show an entire military column packed with soldiers in the Kursk region moments after it was blasted - with piles of bodies on the road and inside of burnt out service trucks.\nSeparate Ukrainian strikes show a staged missile strike on a group of Russian forces in the Rylsky district of Kursk region.\nThousands of troops are still said to be holding onto the land in the Kursk region backed by tanks and armoured trucks.\n9 Russian drone footage showed Ukrainian troops and tanks inside Kursk Credit: East2West"}, {"id": "3f3b763b-5126-4635-b7ea-3bd05e184799", "title": "UK tourists told  get on the plane now  as situation  on knife edge  | World | News", "date": "2024-08-09 14:30", "url": "https://www.express.co.uk/news/world/1934269/uk-tourists-lebanon-warning-israel-iran-war", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "People at the Beirut International Airport amid mounting fears of all-out warA former British ambassador to Lebanon has urged UK nationals still in the Middle Eastern country to get out of it now.\nDuring the programme, Mr Fletcher confessed his love for the country and how often he has advised people to visit Lebanon.\nOn the weekend, the Foreign Office repeated a call for UK nationals to leave Lebanon and confirmed preparations were underway to help with an evacuation of the country if necessary.\nI talked to our ambassador last night, a brilliant ambassador with a great team, and lots of experience.\nIt must be the most tested UK Foreign Office crisis plan out there."}, {"id": "c48a7011-de6d-4c4a-b81c-1d6f974b7376", "title": "Ukraine ambushes Russian convoy in Kursk as Kremlin declares federal emergency", "date": "2024-08-09 14:30", "url": "https://www.theguardian.com/world/article/2024/aug/09/ukraine-ambushes-russian-convoy-in-kursk-as-kremlin-declares-federal-emergency", "domain": "theguardian.com", "domain_classification": "International", "message": "A video released by Zvezda, official Russian military media, showed a convoy of lorries carrying armoured vehicles down a highway.\nView image in fullscreen Some of the trucks in the Russian convoy from footage circulated by Russian military bloggers.\nUkraine was able to burst through a lightly defended Kursk border on Tuesday morning with several hundred troops, according to Russia.\nHowever, this week the White House has been relatively supportive, which Shelest said would be a relief to Ukraine’s leaders.\nIn April, the US publicly criticised Ukraine for targeting Russian oil refineries, fearing the impact on energy prices and inflation."}, {"id": "c9f17768-157a-43b3-9ad9-ac6001b81782", "title": "Russia declares an emergency in Kursk , under attack by Ukraine . 11 killed in Russian strike on mall", "date": "2024-08-09 14:45", "url": "https://www.news-gazette.com/news/nation-world/russia-declares-an-emergency-in-kursk-under-attack-by-ukraine-11-killed-in-russian-strike/article_a62f1b18-3c72-55d6-a8c6-e962173bfbcd.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "Russia declares an emergency in Kursk, under attack by Ukraine.\n11 killed in Russian strike on mallRussia has declared a “federal-level” emergency in the Kursk region following a large-scale incursion from Ukraine and sent reinforcements`, four days after hundreds of Ukrainian troops poured across the border in what appeared to be Kyiv’s biggest attack on Russian soil since the war began"}, {"id": "7f79b46c-eed6-45a0-b9a9-7e7be54ceab4", "title": "Russia declares an emergency in Kursk , under attack by Ukraine . 12 killed in Russian strike on mall | News , Sports , Jobs", "date": "2024-08-09 16:00", "url": "https://www.standard.net/top-headlines/2024/aug/09/russia-declares-an-emergency-in-kursk-under-attack-by-ukraine-12-killed-in-russian-strike-on-mall/", "domain": "standard.net", "domain_classification": "Unknown", "message": "Russia's Defense Ministry said that reinforcements were on their way to the Kursk region to counter Ukraine's daring raid.\nRussia is deploying multiple rocket launchers, towed artillery guns, tanks transported on trailers and heavy tracked vehicles, the RIA-Novosti new agency said, citing the Defense Ministry.\n\"The operational situation in the Kursk region remains difficult,\" Kursk acting governor Alexei Smirnov said on Telegram.\nThe Russian Defense ministry reported fighting in the western outskirts of Sudzha, about 10 kilometers (6 miles) from the border.\nThe Russian Defense Ministry said that 75 Ukrainian drones were shot down during the night, 19 of them over Lipetsk."}, {"id": "0e4b18fa-2669-415b-8f67-3a5ac0ad6d02", "title": "Russia declares federal emergency in area under attack from Ukrainian forces", "date": "2024-08-09 16:00", "url": "https://www.swindonadvertiser.co.uk/news/national/24508359.russia-declares-federal-emergency-area-attack-ukrainian-forces/", "domain": "swindonadvertiser.co.uk", "domain_classification": "Unknown", "message": "The shopping centre in Kostiantynivka, in the eastern Donetsk region, is located in the town’s residential area.\n“The operational situation in the Kursk region remains difficult,” Kursk acting governor Alexei Smirnov said on Telegram.\nThe Russian Defence Ministry reported fighting in the western outskirts of Sudzha, about 10 kilometres (six miles) from the border.\nFighting has broken out in the Kursk region (Governor of Kursk region telegram channel via AP)Social services and civic associations are providing assistance to people forced to flee their homes by the fighting, he said.\nThe Russian defence ministry said that 75 Ukrainian drones were shot down during the night, 19 of them over Lipetsk."}, {"id": "3a2083da-4eb2-45c1-90dc-a52a86843c39", "title": "Russia declares an emergency in Kursk , under attack by Ukraine . 12 killed in Russian strike on mall", "date": "2024-08-09 19:15", "url": "http://lasvegassun.com/news/2024/aug/09/russia-declares-an-emergency-in-kursk-under-attack/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Russia declares an emergency in Kursk, under attack by Ukraine.\nRussia's Defense Ministry said that reinforcements were on their way to the Kursk region to counter Ukraine's daring raid.\n“The operational situation in the Kursk region remains difficult,” Kursk acting governor Alexei Smirnov said on Telegram.\nThe Russian Defense ministry reported fighting in the western outskirts of Sudzha, about 10 kilometers (6 miles) from the border.\nThe Russian Defense Ministry said that 75 Ukrainian drones were shot down during the night, 19 of them over Lipetsk."}, {"id": "cf5e2027-b5b3-4e47-8a00-10e80ace037d", "title": " [ Bleep ], this is close : New bodycam footage shows immediate aftermath of Trump assassination attempt * WorldNetDaily * by Nicole Silverio , Daily Caller News Foundation", "date": "2024-08-09 01:15", "url": "https://www.wnd.com/2024/08/bleep-this-is-close-new-bodycam-footage-shows-immediate-aftermath-of-trump-assassination-attempt/", "domain": "wnd.com", "domain_classification": "Unknown", "message": "Bodycam footage released on Thursday shows officers’ actions taken immediately before and seconds after the attempted assassination on former President Donald Trump at a July 13 rally in Butler, Pennsylvania.\nThe first piece of footage shows the officer with body camera footage being hoisted on top of the roof and then immediately ducking down and sprinting toward his car to grab a more powerful weapon.\nA second piece of footage shows the officer talking to another state or local law enforcement officer expressing how angry they were that they could not find Crooks.\nNEW: Bodycam footage shows immediate aftermath of Trump assassination attempt pic.twitter.com/dw0Fv2lU21 — Daily Caller (@DailyCaller) August 8, 2024Additional footage shows an officer ordering people to exit the location as he had not confirmed Crooks was dead.\nNew police bodycam footage shows officer hoisted on roof, spotting Trump shooter before the attack."}, {"id": "74faabc4-d0a0-4fa1-a727-4813aa3636f0", "title": "40 Palestinians killed as Israel steps up strikes in Gaza - World", "date": "2024-08-09 06:30", "url": "https://www.dawn.com/news/1851038/40-palestinians-killed-as-israel-steps-up-strikes-in-gaza", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "Israeli aircraft also bombed a house in the heart of Gaza City in the north, killing five Palestinians, while another airstrike in the southern city of Khan Younis killed one person and wounded others, according to medics.\nLater on Thursday, 15 Palestinians were killed and 30 injured in Israeli bombings of two schools east of Gaza City, the territory’s Civil Emergency Service said in a statement.\nIsrael’s military said it had struck dozens of military targets across Gaza over the past 24 hours, including rocket launching pads.\nMore burialsOn Thursday, dozens of Palestinians rushed into Nasser Hospital in Khan Younis to bid farewell to slain relatives before carrying them away for burials.\nThe Israeli military renewed evacuation orders to Palestinian residents in several districts in eastern Khan Younis, saying it would act forcefully against fighters who had unleashed rockets from those areas."}, {"id": "eafc6a81-818c-455a-899e-7fe2d28463a1", "title": "Ukraine unleashes large drone attack on Russian airfield as Kyiv offensive continues", "date": "2024-08-09 16:45", "url": "https://www.nbcmiami.com/news/business/money-report/ukraine-unleashes-large-drone-attack-on-russian-airfield-as-kyivs-offensive-continues/3387958/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "Ukrainian drones struck a key military airfield in Russia's Lipetsk region, as Kyiv continues its largest offensive on Russian soil since the start of the war.\nEarlier in the week, the Ukrainian offensive led to the evacuation of thousands of people and a state of emergency being announced in Kursk.\nUkrainian drones struck a key military airfield in Russia's Lipetsk region, forcing authorities to declare a state of emergency in another Russian region this week in the face of Kyiv's ongoing cross-border offensive.\nKursk was still reporting missile danger alerts as of Friday, according to Google-translated Telegram updates from regional Governor Alexei Smirnov, who said the local situation remained \"difficult.\"\nAt least 10 people were killed and 35 others were injured as a result, according to Minister of Internal Affairs Ihor Klymenko in a Google-translated Telegram update."}, {"id": "711392d4-d664-4e95-9bb9-0bd68ab1669e", "title": "One false post triggered a wave of violence : here how social media needs to be reined in", "date": "2024-08-09 02:45", "url": "https://www.independent.ie/irish-news/one-false-post-triggered-a-wave-of-violence-heres-how-social-media-needs-to-be-reined-in/a1141946705.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "One false post triggered a wave of violence: here’s how social media needs to be reined inIn the wake of the Southport attack, racist narratives received millions of views, boosted by algorithms and established networks of opportunistic extremistsDeath threat: Taoiseach Simon Harris.\nPhoto: Sam Boal /Collins PhotosCiarán O'Connor Today at 03:30There are clear parallels between recent events in the UK and the stabbing incident on Parnell Square in Dublin last November.\nIn the immediate aftermath, before any police statements, Muslims and migrants were blamed online.\nCalls-to-action were shared, crowds fuelled by hatred assembled and violence broke out."}, {"id": "9b467788-a52d-472c-9616-96925f5a4634", "title": "Austrian teen held over  IS plot  to bomb Taylor Swift concert - World", "date": "2024-08-09 06:30", "url": "https://www.dawn.com/news/1851028/austrian-teen-held-over-is-plot-to-bomb-taylor-swift-concert", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "VIENNA: An Austrian teenager arrested over an alleged plot to strike a Taylor Swift concert in Vienna had built explosive devices for his attack and had pledged loyalty to the militant Islamic State group, authorities said on Thursday.\nTwo other Austrian youths aged 17 and 15 were also detained on Wednesday over the foiled plot.\nMusic world rockedUS broadcaster ABC cited law enforcement and intelligence sources as saying Austrian authorities had received information about the Swift concert threat from US intelligence.\nAustrian Interior Minister Gerhard Karner said foreign intelligence agencies had helped with the investigation, as Austrian law does not allow monitoring of messenger apps.\nThe plot in Austria also brought to mind a foiled plan by three IS-linked suspects against Vienna’s gay pride parade last year."}, {"id": "0c64f166-fade-4ade-81ae-6addfb4f4d41", "title": "Taylor Swift concert terror plot : Security experts on what to know about next show", "date": "2024-08-09 10:45", "url": "https://www.yahoo.com/news/taylor-swift-concert-terror-plot-080017624.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Taylor Swift concert terror plot: Security experts on what to know about next showTaylor Swift's Eras Tour London concerts will go on as scheduled after a foiled terror plot that led to the cancellation of the pop star's Austria concerts.\nTAYLOR SWIFT TERROR PLOT: SUSPECT WHO PLEDGED ALLEGIANCE TO ISIS HAD CHEMICAL SUBSTANCES, DEVICES AT HOMETaylor Swift's Eras Tour to continue in London after three Vienna shows were canceled.\nA screen displays a photo of a man arrested in connection with an alleged terrorist plot targeting Taylor Swift concerts in Vienna.\nThe suspected stalker had a ticket to Swift's concert at Gelsenkirchen's Veltins Arena on July 17, police said in a statement.\nOriginal article source: Taylor Swift concert terror plot: Security experts on what to know about next show"}, {"id": "07a84c16-8444-4d35-accd-b70011234574", "title": "Fears of wider war as Israel kills 40 in Gaza strikes", "date": "2024-08-09 05:15", "url": "https://www.canberratimes.com.au/story/8724107/fears-of-wider-war-as-israel-kills-40-in-gaza-strikes/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Families packed into buses and cars, many seeking shelter in Al-Mawasi, a sandy stretch of ground along the coast, though some expressed fear that it has been attacked in the past despite being designated as a safe zone by Israeli forces."}, {"id": "7197660c-c294-4d42-9c35-e34865048d5f", "title": "Russia declares federal level emergency in Kursk amid Ukrainian incursion", "date": "2024-08-09 14:30", "url": "https://komonews.com/news/nation-world/russia-declares-federal-level-emergency-in-kursk-amid-ukrainian-incursion-troops-border-kyiv-putin-zelenskyy-surprise-operation-moscow-donetsk-region-kremlin", "domain": "komonews.com", "domain_classification": "Unknown", "message": "The mall in Kostiantynivka, in the eastern Donetsk region, is located in the town's residential area.\n\"The operational situation in the Kursk region remains difficult,\" Kursk acting governor Alexei Smirnov said on Telegram.\nUkrainian officials have refused to comment specifically about the incursion, which is taking place about 500 kilometers (320 miles) southwest of Moscow.\nRussia declares federal-level emergencies when there are more than 500 victims or damage exceeds 500 million rubles (about $6 million).\nThe Russian Defense Ministry said that 75 Ukrainian drones were shot down during the night, 19 of them over Lipetsk."}, {"id": "f57e9ab8-2947-4dec-8f25-44bb3305d1f0", "title": "Netanyahu Finally Apologizes for Oct 7 Hamas Attack", "date": "2024-08-09 07:15", "url": "https://dailystar.com.lb/netanyahu-apologizes-oct-7-hamas-attack/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "In an interview published on Thursday (Aug 8), Netanyahu expressed his regret, stating, “Of course, of course.\nIn northern Gaza, an airstrike killed five Palestinians, while another strike in Khan Younis resulted in one death and one injury.\nThe Israel Defense Forces (IDF) stated that the schools were being used by Hamas operatives and terrorists.\nUS Stance on Arms Embargo on IsraelA policy advisor to US Vice President Kamala Harris clarified on Thursday that an arms embargo on Israel is not being considered in Washington, DC.\nShe does not support an arms embargo on Israel."}, {"id": "56cea58f-23ac-4e97-a001-f08c0060b787", "title": "4 suspected Houthi attacks target a ship off Yemen , authorities say", "date": "2024-08-09 16:30", "url": "https://isp.netscape.com/pf/story/0001/20240809/42cf4f862d3d29b86d08838bed490967", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "4 suspected Houthi attacks target a ship off Yemen, authorities sayDUBAI, United Arab Emirates (AP) — Four suspected attacks by Yemen's Houthi rebels targeted a Liberian-flagged oil tanker in the strategic Bab el-Mandeb Strait linking the Gulf of Aden to the Red Sea, including one that saw private security guards shoot and destroy a bomb-loaded drone boat, authorities said Friday.\nSince November, Houthi attacks have disrupted the $1 trillion of goods that flow annually through the region, while also sparking the most intense combat the U.S. Navy has seen since World War II.\nThe UKMTO later reported the incident as well, which happened as the vessel traveled north into the Red Sea.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nCentral Command later said that it destroyed two Houthi anti-ship cruise missiles and one Houthi ground control station, as well as a drone boat in the Red Sea."}, {"id": "1c6f2ceb-906c-484e-a965-2367e33d7c6a", "title": "Russia declares federal level emergency in Kursk amid Ukrainian incursion", "date": "2024-08-09 13:45", "url": "https://katu.com/news/nation-world/russia-declares-federal-level-emergency-in-kursk-amid-ukrainian-incursion-troops-border-kyiv-putin-zelenskyy-surprise-operation-moscow-donetsk-region-kremlin", "domain": "katu.com", "domain_classification": "Unknown", "message": "Russia's Defense Ministry said that reinforcements were on their way to the Kursk region to counter Ukraine's daring raid.\nRussia is deploying multiple rocket launchers, towed artillery guns, tanks transported on trailers and heavy tracked vehicles, the RIA-Novosti new agency said, citing the Defense Ministry.\n“The operational situation in the Kursk region remains difficult,” Kursk acting governor Alexei Smirnov said on Telegram.\nThe Russian Defense ministry reported fighting in the western outskirts of Sudzha, about 10 kilometers (6 miles) from the border.\nThe Russian Defense Ministry said that 75 Ukrainian drones were shot down during the night, 19 of them over Lipetsk."}, {"id": "a37cdf04-fc5b-488e-b178-efc77eff4dce", "title": "Taylor Swift fans gather in Vienna streets to sing her songs after canceled concerts", "date": "2024-08-09 01:30", "url": "https://www.yahoo.com/news/taylor-swift-fans-gather-vienna-005219005.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Taylor Swift fans gather in Vienna’s streets to sing her songs after canceled concertsTaylor Swift's fans in Vienna are gathering to console one another after the pop superstar was forced to cancel a series of \"Eras Tour\" concerts in the city due to terrorists threats.\nTaylor Swift fans take photos and sing together on Stephansplatz on Aug. 8 in Vienna.\nHe obtained explosives and weapons.”Taylor Swift fans sing together on Stephansplatz on Aug. 8, 2024 in Vienna, Austria.\n“That would have meant numerous deaths and injuries.”Police guards Stephansplatz as Taylor Swift fans gather to sing together on Aug. 8, 2024 in Vienna, Austria.\nTaylor Swift fans sing together on Stephansplatz on Aug. 8, 2024 in Vienna, Austria."}, {"id": "d0051267-b6c3-42cd-92c7-81c0448ce594", "title": "Taylor Swift fans gather in Vienna streets to sing her songs after canceled concerts", "date": "2024-08-09 01:30", "url": "https://www.aol.com/taylor-swift-fans-gather-vienna-005219330.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Taylor Swift fans take photos and sing together on Stephansplatz on Aug. 8 in Vienna.\n“There was a tremendous amount of planning, expense, and effort put into keeping my fans safe.”Taylor Swift fans sing together on Stephansplatz on Aug. 8, 2024 in Vienna, Austria.\nHe obtained explosives and weapons.”Taylor Swift fans sing together on Stephansplatz on Aug. 8, 2024 in Vienna, Austria.\n“That would have meant numerous deaths and injuries.”Police guards Stephansplatz as Taylor Swift fans gather to sing together on Aug. 8, 2024 in Vienna, Austria.\nTaylor Swift fans sing together on Stephansplatz on Aug. 8, 2024 in Vienna, Austria."}, {"id": "7c26a8c7-280a-453b-be9d-077b4dc2adaa", "title": "Knife - wielding California man fatally shot by police after stabbing his mother to death , authorities say", "date": "2024-08-09 14:45", "url": "https://www.eastbaytimes.com/2024/08/09/knife-wielding-man-fatally-shot-by-irvine-police-after-stabbing-woman-to-death-authorities-say/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "A knife-wielding man stabbed his mother to death in an Irvine neighborhood Thursday before he was fatally shot by police in what marked the second officer-involved shooting in the city this week.\nThe man was seen attacking the woman in the roadway in front of a residence when officers arrived.\nPolice said Thursday evening that the knife-wielding man was the adult son of the woman he stabbed.\nDave King, a resident along Green Tree Lane, said he heard at least six gunshots from his home Thursday afternoon.\nHe saw a man on the driveway, and noticed he was lying motionless before he saw the woman lying nearby."}, {"id": "abd7398c-dd22-4a70-a8cd-6b129991eb04", "title": "Mideast tension heightening amid looming Iranian retaliatory attack on Israel", "date": "2024-08-09 03:30", "url": "http://en.people.cn/n3/2024/0809/c90000-20203882.html", "domain": "en.people.cn", "domain_classification": "Unknown", "message": "Mideast tension heightening amid looming Iranian retaliatory attack on IsraelXinhua) 08:48, August 09, 2024* The Middle East has been bracing for escalating tension amidst Iran and its allies' threats to avenge the killings of Hamas and Hezbollah leaders last week.\n* Nobody is interested in a regional war, and nobody is going to gain anything from a regional war, experts said.\nNegativity has already seeped into various facets of people's lives in the Middle East due to the prolonged regional conflict.\nNobody is going to gain anything from a regional war,\" he said.\nAbdullah Mahmoud, a Cairo-based researcher in Iranian affairs of the Middle East Forum for Strategic Studies and National Security, said, \"The attack this time will be a collaboration of attacks by different resistance movements.\""}, {"id": "39761475-a1b1-48e9-a13e-6ab469986b14", "title": "Photos : Anti - Racism Protesters Rally Against Far - Right Groups In united kingdom Amid Riots", "date": "2024-08-09 07:15", "url": "https://www.outlookindia.com/international/photos-anti-racism-protesters-rally-against-far-right-groups-in-uk-amid-riots", "domain": "outlookindia.com", "domain_classification": "Unknown", "message": "A counter protestors holds a placard in front of boarded up windows in Liverpool ahead of anti-immigration groups planning to target dozens of locations throughout the country following a week of rioting fueled by misinformation over a stabbing attack against young girls."}, {"id": "096adf34-be1b-4fcb-b19a-44fcd4f4fc29", "title": "Swifties heartbroken after concerts cancelled due to foiled attack", "date": "2024-08-09 04:00", "url": "https://interaksyon.philstar.com/trends-spotlights/2024/08/09/281274/swifties-heartbroken-after-concerts-cancelled-due-to-foiled-attack/", "domain": "interaksyon.philstar.com", "domain_classification": "Unknown", "message": "Taylor Swift fans turned to social media on Thursday, grappling with sorrow, anger, and disbelief after the singer’s three Vienna concerts were abruptly cancelled following the Austrian government’s confirmation of a planned attack at the venue.\nREAD: Taylor Swift Vienna concerts canceled, Chancellor says tragedy averted | ISIS-inspired suspect in Taylor Swift show plot planned suicide attackSome 195,000 fans in total were expected for the concerts at Vienna’s Ernst Happel Stadium, with many having travelled from abroad for a chance to see the pop superstar live.\n“Please reschedule Vienna, your silence is just heartbreaking,” another fan wrote.\n?,” one frustrated fan commented on the singer’s Taylor Nation’s Instagram, which has over nine million followers.\n“We would never be able to afford the trip back again even if she does reschedule,” Neusser wrote on Instagram, asking how she could get a poster for the cancelled concert."}, {"id": "deef201d-f2ff-4a7e-89e7-721de0f624ab", "title": "Russia declares federal level emergency in Kursk amid Ukrainian incursion", "date": "2024-08-09 14:15", "url": "https://ktul.com/news/nation-world/russia-declares-federal-level-emergency-in-kursk-amid-ukrainian-incursion-troops-border-kyiv-putin-zelenskyy-surprise-operation-moscow-donetsk-region-kremlin", "domain": "ktul.com", "domain_classification": "Unknown", "message": "Russia's Defense Ministry said that reinforcements were on their way to the Kursk region to counter Ukraine's daring raid.\nRussia is deploying multiple rocket launchers, towed artillery guns, tanks transported on trailers and heavy tracked vehicles, the RIA-Novosti new agency said, citing the Defense Ministry.\n“The operational situation in the Kursk region remains difficult,” Kursk acting governor Alexei Smirnov said on Telegram.\nThe Russian Defense ministry reported fighting in the western outskirts of Sudzha, about 10 kilometers (6 miles) from the border.\nThe Russian Defense Ministry said that 75 Ukrainian drones were shot down during the night, 19 of them over Lipetsk."}, {"id": "eaff2a12-091c-4b42-a441-7c962fae8a48", "title": "Russia declares federal level emergency in Kursk amid Ukrainian incursion", "date": "2024-08-09 13:45", "url": "https://cbs12.com/news/nation-world/russia-declares-federal-level-emergency-in-kursk-amid-ukrainian-incursion-troops-border-kyiv-putin-zelenskyy-surprise-operation-moscow-donetsk-region-kremlin", "domain": "cbs12.com", "domain_classification": "Unknown", "message": "The mall in Kostiantynivka, in the eastern Donetsk region, is located in the town's residential area.\n\"The operational situation in the Kursk region remains difficult,\" Kursk acting governor Alexei Smirnov said on Telegram.\nUkrainian officials have refused to comment specifically about the incursion, which is taking place about 500 kilometers (320 miles) southwest of Moscow.\nRussia declares federal-level emergencies when there are more than 500 victims or damage exceeds 500 million rubles (about $6 million).\nThe Russian Defense Ministry said that 75 Ukrainian drones were shot down during the night, 19 of them over Lipetsk."}, {"id": "5af60f92-7f95-4b7f-af5f-da26bb855430", "title": "IS suspect planned suicide attack at Taylor Swift Vienna concert", "date": "2024-08-09 01:15", "url": "https://www.philstar.com/world/2024/08/09/2376619/suspect-planned-suicide-attack-taylor-swift-vienna-concert", "domain": "philstar.com", "domain_classification": "Unknown", "message": "IS suspect planned suicide attack at Taylor Swift Vienna concertSecurity guards remove barriers in front of the Ernst Happel Stadium in Vienna, Austria, on August 8, 2024, after the three concerts of US mega-star Taylor Swift were cancelled following the arrest of an Islamic State sympathiser in connection with an attack plot.\nVIENNA, Austria — A 19-year-old Islamic State sympathizer planned a deadly suicide attack at a Taylor Swift concert in Vienna, the country's intelligence agency said on Thursday.\nAustrian authorities detained two suspects Wednesday for allegedly plotting to attack one of three Vienna concerts by the US star, which had been due to start Thursday.\n\"The situation was very serious\", he added, particularly in view of last week's attack at a Taylor Swift themed event in Britain, where three girls were killed.\nAccording to Ruf, police \"did everything humanly possible to ensure\" that the Vienna concerts \"could go ahead\", but the cancellation decision was taken by the organisers."}, {"id": "177beeee-718e-4f4b-9023-cf039f02260f", "title": "Militant suspect planned suicide attack at Taylor Swift Vienna concert", "date": "2024-08-09 10:30", "url": "https://gulfnews.com/entertainment/music/militant-suspect-planned-suicide-attack-at-taylor-swift-vienna-concert-1.1723183488586", "domain": "gulfnews.com", "domain_classification": "Local - Middle East", "message": "Vienna: A 19-year-old Daesh sympathiser planned a deadly suicide attack at a Taylor Swift concert in Vienna, the country's intelligence agency said.\nAustrian authorities detained two suspects Wednesday for allegedly plotting to attack one of three Vienna concerts by the US star, which had been due to start Thursday.\n\"The situation was very serious\", he added, particularly in view of last week's attack at a Taylor Swift themed event in Britain, where three girls were killed.\nA fan of US singer Taylor Swift - a swiftie - fixes her beaded bracelets at the Swiftie Tree in Cornelius Strasse street in Vienna, Austria.\nAccording to Ruf, police \"did everything humanly possible to ensure\" that the Vienna concerts \"could go ahead\", but the cancellation decision was taken by the organisers."}, {"id": "a1cebb14-35b3-4d4a-a4dd-cb122f8b0e6f", "title": "Russia declares federal level emergency in Kursk amid Ukrainian incursion", "date": "2024-08-09 14:45", "url": "https://fox11online.com/news/nation-world/russia-declares-federal-level-emergency-in-kursk-amid-ukrainian-incursion-troops-border-kyiv-putin-zelenskyy-surprise-operation-moscow-donetsk-region-kremlin", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "The mall in Kostiantynivka, in the eastern Donetsk region, is located in the town's residential area.\n\"The operational situation in the Kursk region remains difficult,\" Kursk acting governor Alexei Smirnov said on Telegram.\nUkrainian officials have refused to comment specifically about the incursion, which is taking place about 500 kilometers (320 miles) southwest of Moscow.\nRussia declares federal-level emergencies when there are more than 500 victims or damage exceeds 500 million rubles (about $6 million).\nThe Russian Defense Ministry said that 75 Ukrainian drones were shot down during the night, 19 of them over Lipetsk."}, {"id": "3bea1196-e659-42cb-8253-01fc381a31f6", "title": "Iranian Guards navy has new highly explosive missiles , state media say", "date": "2024-08-09 11:30", "url": "https://www.yahoo.com/news/iranian-guards-navy-highly-explosive-110024670.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(Reuters) - The Iranian Revolutionary Guards said on Friday that its navy has new cruise missiles equipped with highly explosive warheads that are undetectable, state media reported.\n\"A large number of cruise missiles have been added to the Guards' navy fleet.\nThese new missiles have capabilities of highly explosive warheads that are undetectable and can cause extensive damage and sink their targets,\" a Guards statement said.\n\"These systems are among the most up-to-date anti-surface and sub-surface weapons in the Guards' navy,\" it said.\nThe navy added that only 210 of the 2,654 systems were shown as it was not possible to unveil other strategic ones for security reasons."}, {"id": "d6c60339-9f48-494a-be71-2ba123a8e7b5", "title": "Israel - Hamas war latest : Palestinians flee parts of south Gaza as Israel launches a new assault", "date": "2024-08-09 10:45", "url": "https://abcnews.go.com/International/wireStory/israel-hamas-war-latest-palestinians-flee-parts-south-112704332", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Palestinians are fleeing large areas around Khan Younis in southern Gaza where the Israeli military has begun a new assault after ordering another mass evacuationPalestinians are fleeing large areas around Khan Younis in southern Gaza where the Israeli military began a new assault after ordering another mass evacuation.\nRegional tensions have soared since Hamas political leader Ismail Haniyeh was killed July 31 in Iran by a presumed Israeli strike.\nHezbollah has said that it will only stop firing toward Israel once the war in Gaza comes to and end.\n“The war in Gaza must stop,” Macron said in a post in English and French on X.\nHowever, many of the ships attacked have little or no connection to the war, including some bound for Iran."}, {"id": "c8c0dd70-ec80-4c3d-b60c-468f37e23a09", "title": "Thug , 24 , who left baby with brain damage after drunkenly shaking the tot then stabbed a man while he was on bail is jailed for eight years", "date": "2024-08-09 14:00", "url": "https://www.dailymail.co.uk/news/article-13727807/Beast-left-baby-brain-damage-drunkenly-shaking-tot-stabbing-man-jailed-eight-years.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A brute who left a baby with brain damage then forced his way into a rival's home before stabbing him has been jailed.\nRyan Potter had been drinking before he shook the tot, who was left with bruising to the face, chest and arm and desperately ill in hospital.\nNewcastle Crown Court heard while on bail accused of the sickening baby attack, Potter barged into the home of a dad and stabbed him in the thigh.\nProsecutor Helen Towers told the court the baby was admitted to hospital and said: 'A CT scan revealed a subarachnoid haemorrhage, which is bleeding around the brain.\nMiss Towers said Potter was out on bail when he forced his way into a rival's home and stabbed him in the thigh."}, {"id": "d7307306-9fea-4e51-8b49-84dc9ad81934", "title": "Israeli troops launch a new assault into Gaza Khan Younis as mediators push for cease - fire talks", "date": "2024-08-09 10:00", "url": "https://www.bostonglobe.com/2024/08/09/world/israeli-troops-launch-new-assault-into-gazas-khan-younis-mediators-push-cease-fire-talks/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Israeli evacuation orders triggered yet another exodus of Palestinians from the heavily destroyed eastern districts of Khan Younis, where many had just returned less than two weeks ago — after the Israeli military’s last incursion into the city in July.\nIn the Gaza Strip, one of the airstrikes in Khan Younis hit the home of the Abu Moamar family, killing a Palestine TV journalist, his wife and three daughters.\nA third airstrike targeted a car in Khan Younis.\nIts new assault in Khan Younis drove more people into the camps and neighboring areas.\nGhazi Abu Daka, one of the evacuees, told the AP that he and his family have been forced to flee Khan Younis four times now."}, {"id": "3a3444cb-e2d2-4c17-9c8f-312e6534e6c4", "title": "Police release bodycam footage from assassination attempt on former President Trump", "date": "2024-08-09 04:00", "url": "https://www.wcax.com/2024/08/08/police-release-bodycam-footage-assassination-attempt-former-president-trump/", "domain": "wcax.com", "domain_classification": "Unknown", "message": "BUTLER COUNTY, Pa. (Gray News) - Authorities in Pennsylvania released dramatic bodycam videos of police responding to the attempted assassination of former President Donald Trump.\nLess than a minute later, Thomas Matthew Crooks turned back and fired eight shots at Trump, who was hit in the ear before a Secret Service sniper shot and killed him.\nIn some of the video clips obtained by CNN from that day, three shots can be heard ringing out, followed by five more shots fired rapidly.\nWhen officers ultimately access the top of the building, Crooks’ body can be seen along with his rifle and blood.\nThe FBI said it believes Crooks, who had bomb-making materials in the car he drove to the rally, acted alone and used an AR-style rifle in the assassination attempt."}, {"id": "705c9388-3cd2-4d3a-ade0-db3a0014dbbf", "title": "2 suspected Houthi attacks target a ship off Yemen in Bab el - Mandeb Strait , authorities say", "date": "2024-08-09 08:30", "url": "https://www.voanews.com/a/suspected-houthi-attacks-target-a-ship-off-yemen-in-bab-el-mandeb-strait-authorities-say/7735903.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Two suspected attacks by Yemen's Houthi rebels targeted a ship in the strategic Bab el-Mandeb Strait that links the Gulf of Aden to the Red Sea, authorities said Friday.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nSince November, Houthi attacks have disrupted the $1 trillion flow of goods passing through the region annually while also sparking the most intense combat the U.S. Navy has seen since World War II.\nAfter the strikes, the Houthis paused their attacks until Saturday, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nCentral Command later said it destroyed two Houthi anti-ship cruise missiles and one Houthi ground control station, as well as a drone boat in the Red Sea."}, {"id": "16ace6c4-94ae-4c19-b302-dac69c69b636", "title": "Two suspected Houthi attacks target a ship off Yemen in Bab el - Mandeb Strait , authorities say", "date": "2024-08-09 04:00", "url": "https://www.theglobeandmail.com/world/article-two-suspected-houthi-attacks-target-a-ship-off-yemen-in-bab-el-mandeb/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Two suspected attacks by Yemen’s Houthi rebels targeted a ship in the strategic Bab el-Mandeb Strait that links the Gulf of Aden to the Red Sea, authorities said Friday.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nSince November, Houthi attacks have disrupted the $1 trillion flow of goods passing through the region annually while also sparking the most intense combat the U.S. Navy has seen since World War II.\nAfter the strikes, the Houthis paused their attacks until Saturday, when they hit a Liberian-flagged container ship travelling through the Gulf of Aden.\nCentral Command later said it destroyed two Houthi anti-ship cruise missiles and one Houthi ground control station, as well as a drone boat in the Red Sea."}, {"id": "94d3211e-772a-4356-a993-9a84d14adece", "title": "3rd person detained over foiled attack on cancelled Vienna Taylor Swift shows , official says", "date": "2024-08-09 10:00", "url": "https://www.cbsnews.com/news/taylor-swift-vienna-3rd-person-detained-over-foiled-attack/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "A third teenager has been arrested in connection with a foiled attack on now-canceled Taylor Swift concerts in Vienna, Austria's interior minister said Friday.\nGerhard Karner said an 18-year-old was taken into custody Thursday evening in Vienna after allegedly being in contact with the main suspect.\nOfficials say a suspect has confessed to planning to \"kill as many people as possible outside the concert venue.\"\nFans of singer Taylor Swift gather in Vienna, Austria, on August 8, 2024, after concerts were cancelled at the last minute.\nLast month, an attacker in England killed three girls and wounded 10 people in a knife attack during a Taylor Swift-themed dance and yoga class."}, {"id": "0c280d7c-65c2-43b3-8472-1bbbcbdc6094", "title": "3rd person in custody over foiled attack on now - canceled Taylor Swift shows in Vienna , official says", "date": "2024-08-09 11:00", "url": "https://www.independent.co.uk/news/world/europe/vienna-ap-taylor-swift-islamic-state-swifties-b2593795.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}A third teenager has been arrested in connection with a foiled attack on now-canceled Taylor Swift concerts in Vienna.\nEurope is enamored with the American superstar: The German town of Gelsenkirchen renamed itself “Swiftkirchen” before its mid-July concerts.\nThe foiled attack was planned for Thursday or Friday, according to Austria’s interior minister, Gerhard Karner.\nAustrian rail operator OeBB in the meantime said that it would reimburse fans for unused train tickets for the concerts."}, {"id": "8f70526e-6c8a-4821-8a26-63657da7d4ff", "title": "Two suspected Houthi attacks target ship off Yemen in Bab el - Mandeb Strait , authorities say", "date": "2024-08-09 04:15", "url": "https://japantoday.com/category/world/two-suspected-houthi-attacks-target-a-ship-off-yemen-in-bab-el-mandeb-strait-authorities-say", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "(AP Photo)By JON GAMBRELLTwo suspected attacks by Yemen's Houthi rebels targeted a ship in the strategic Bab el-Mandeb Strait that links the Gulf of Aden to the Red Sea, authorities said Friday.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nSince November, Houthi attacks have disrupted the $1 trillion flow of goods passing through the region annually while also sparking the most intense combat the U.S. Navy has seen since World War II.\nAfter the strikes, the Houthis paused their attacks until Saturday, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nCentral Command later said it destroyed two Houthi anti-ship cruise missiles and one Houthi ground control station, as well as a drone boat in the Red Sea."}, {"id": "55f23120-a33c-4974-be14-0fa9f92b3848", "title": "Third person in custody over foiled plot targeting now - canceled Taylor Swift shows in Vienna", "date": "2024-08-09 10:00", "url": "https://www.bostonglobe.com/2024/08/09/world/third-person-custody-over-foiled-attack-now-canceled-taylor-swift-shows-vienna-official-says/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "The third suspect, an 18-year-old Iraqi citizen, was arrested Thursday evening, the interior minister said at an unrelated news conference Friday.\nColdplay is scheduled to play four nights at the same Vienna stadium later this month.\nThe main suspect, as well as the 18-year-old arrested Friday, pledged “an oath of allegiance” to the Islamic State group.\nAlthough the 18-year-old swore the oath and “comes from the social environment” of the main suspect, Interior Minister Gerhard Karner said, he is not directly linked to the plot.\nSwift fans often swap the beaded bracelets, typically bearing Swift’s song titles or popular phrases, with strangers at her concerts."}, {"id": "e4de0c1f-b275-44b7-8a84-1e9a5bc1a086", "title": "Four attacks on vessel near to Yemen coast , RPGs exploded close to crew", "date": "2024-08-09 11:00", "url": "https://www.jpost.com/breaking-news/article-814028", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Four missile attacks on vessels have been reported over the last day off the coast of Yemen, United Kingdom Maritime Trade Operations (UKMTO) reported on Friday morning.\nIn the first two attacks, an RPG exploded near to the vessel, which was 45 nautical miles off the coast of Al Mukha.\nThe ship's armed security team then fired at the USV which then exploded, UKMTO added.\nIn the fourth incident, a missile splashed into the sea close to the vessel but did not explode.\nThe crew are reported to be safe, UKMTO announced."}, {"id": "679f22a5-701d-4d32-80d4-4ed3e7346dd2", "title": "Russia declares a federal emergency in a border region that is under attack from Ukrainian forces", "date": "2024-08-09 11:45", "url": "https://www.durangoherald.com/articles/russia-declares-a-federal-emergency-in-a-border-region-that-is-under-attack-from-ukrainian-forces/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "July saw the heaviest civilian casualties in Ukraine since October 2022, the U.N. Human Rights Monitoring Mission in Ukraine said Friday.\n“The operational situation in the Kursk region remains difficult,” Kursk acting governor Alexei Smirnov said on Telegram.\nA Russian Defense Ministry statement Friday said Russia's military “continues to repel the attempted invasion” and is responding with airstrikes, artillery and troops on the ground.\nUkraine has also kept up its strategy of hitting rear areas with long-range drones, targeting Russian military sites, oil refineries and other infrastructure.\nThe Russian Defense Ministry said that 75 Ukrainian drones were shot down during the night, 19 of them over Lipetsk."}, {"id": "f87ad037-0756-460a-96ae-ea6b9a3e067e", "title": "Body camera footage shows local police anger at Secret Service after Trump assassination attempt", "date": "2024-08-09 19:15", "url": "https://abcnews.go.com/US/wireStory/body-camera-footage-shows-local-police-anger-secret-112718616", "domain": "abcnews.go.com", "domain_classification": "International", "message": "They also show police expressing confusion and anger about why no law enforcement had been stationed on the roof.\nHe asked how “the hell” they could have lost sight of Crooks after spotting him acting suspiciously if law enforcement had been on top of the building.\nRowe told lawmakers last month that Secret Service had “assumed that the state and locals had it” covered.\nA Secret Service spokesperson said Friday the agency is reviewing the body camera footage.\nThe acting Secret Service director has said local law enforcement did not alert his agency before the shooting that an armed person had been spotted on a nearby roof."}, {"id": "8cb0603b-9f3c-49cf-be5b-899c83720b82", "title": "3rd person in custody over foiled attack on now - cancelled Taylor Swift shows in Vienna official says", "date": "2024-08-09 10:45", "url": "https://www.theweek.in/wire-updates/international/2024/08/09/fgn22-austria-taylor-swift-concerts.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Vienna, Aug 9 (AP) A third teenager has been arrested in connection with a foiled attack on now-cancelled Taylor Swift concerts in Vienna.\nEurope is enamoured with the American superstar: The German town of Gelsenkirchen renamed itself “Swiftkirchen” before its mid-July concerts.\nThe foiled attack was planned for Thursday or Friday, according to Austria's interior minister, Gerhard Karner.\n“Moms and dads are looking after their daughters and sons, who were full of enthusiasm and anticipation for this concert.\nAustrian rail operator OeBB in the meantime said that it would reimburse fans for unused train tickets for the concerts."}, {"id": "b3803b89-0e94-4ee8-8177-3c426b73cb1b", "title": "U . S . Bolstering Defenses in the Middle East", "date": "2024-08-09 18:00", "url": "https://editorials.voa.gov/a/u-s-bolstering-defenses-in-the-middle-east/7736360.html", "domain": "editorials.voa.gov", "domain_classification": "Unknown", "message": "The United States continues to take steps to lower temperatures in the Middle East, “to ward off regional escalation by Iran and its partners and proxies,” said Secretary of Defense Lloyd Austin at a press briefing.\nIn April, the United States, along with allies and partners, including Saudi Arabia, the United Arab Emirates and Jordan, helped Israel fend off a massive drone and missile strike from Iran.\nThe Iranian attack followed the targeted killing by Israel of the leader of Iran’s Islamic Revolutionary Guard Corps-Qods Force, the organization responsible for the Iranian regime’s extraterritorial terrorist operations.\nIran has vowed to retaliate, and tensions have soared, with the United States working to stop the conflict from escalating, not only by bolstering its defense posture in the region, but by encouraging Israel and Hamas to agree to the cease-fire proposal they have been negotiating for the past two months.\nWith deterrence and diplomacy, the United States is sending a clear message: a wider conflict in the Middle East must be avoided."}, {"id": "2357ffcb-191b-415f-bcff-2ab4144454f2", "title": "Police release bodycam footage from assassination attempt on former President Trump", "date": "2024-08-09 07:15", "url": "https://www.kwtx.com/2024/08/08/police-release-bodycam-footage-assassination-attempt-former-president-trump/", "domain": "kwtx.com", "domain_classification": "Unknown", "message": "BUTLER COUNTY, Pa. (Gray News) - Authorities in Pennsylvania released dramatic bodycam videos of police responding to the attempted assassination of former President Donald Trump.\nLess than a minute later, Thomas Matthew Crooks turned back and fired eight shots at Trump, who was hit in the ear before a Secret Service sniper shot and killed him.\nIn some of the video clips obtained by CNN from that day, three shots can be heard ringing out, followed by five more shots fired rapidly.\nWhen officers ultimately access the top of the building, Crooks’ body can be seen along with his rifle and blood.\nThe FBI said it believes Crooks, who had bomb-making materials in the car he drove to the rally, acted alone and used an AR-style rifle in the assassination attempt."}, {"id": "7079b089-272b-4e50-83d2-406ba6a6a106", "title": "Russo - Ukraine War - 08 August 2024", "date": "2024-08-09 00:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-08.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn the Kharkiv direction, Russian forces throughout the day carried out six attacks near vovčans зka.\nAccording to preliminary data for today Russian forces lost more than 200 occupiers.\nIn the Orihiv direction, Ukrainian troops repelled one Russian attack near the Small Tokmačka, the opponent was unsuccessful."}, {"id": "80e7105f-e509-44f5-ab1b-90b536284df3", "title": "Caesar Doomsday War - Sky History", "date": "2024-08-09 01:15", "url": "https://www.tvguide.co.uk/schedule/53ed98c2-f267-506c-a4be-a4421865d817/caesars-doomsday-war", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Caesar's Doomsday WarSky History 7:00 AM to 8:00 AM Friday 9 August Share Add toCalendar +Invasion Season 1 Episode 1 of 2Part one of two.\nArchaeologists investigate the full story of how the most famous Roman leader, Julius Caesar, rose to power and the battle that took him to the brink of defeat.\nEmploying dramatic re-enactments, 3D modelling of the terrain, towns and fortifications and an impressive array of expert commentary, this film offers both a clear overview of the Gallic Wars and a visceral and confronting account of ancient warfareCaesar's Doomsday War airs on Sky History at 7:00 AM, Friday 9 August .\nLearn more about Caesar's Doomsday War and other education/science/factual topics on our factual page"}, {"id": "38c17301-52ec-4d9b-886d-c92a788f811d", "title": "SecAF Kendall visits 20th FW", "date": "2024-08-09 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240808-usaf02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "SecAF Kendall visits 20th FWPublished Aug. 8, 2024By Staff Sgt.\nDuring the two-day visit, Kendall attended mission briefs from various units, met with civic leaders from the local community and held an all-call to field questions from Shaw AFB's Airmen.\nThe visit also highlighted the 20th FW's combat readiness to support an expanding operational mission set globally.\n\"The thing I like to do the most during these visits is take the opportunity to say thank you for what you do,\" Kendall said.\nDuring his time at Shaw AFB, Kendall also visited with Airmen and leaders from the 25th Attack Group, 609th Air Operations Center, Ninth Air Force (Air Forces Central), and Fifteenth Air Force."}, {"id": "1182e334-dcf1-48bb-86c1-fed4ee23c724", "title": "Opinion : Fortune Favors the Brave", "date": "2024-08-09 07:45", "url": "https://www.kyivpost.com/opinion/37108", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "We are on the threshold of similar events, and the Kursk operation in Russia is their manifestation.\nFrom that moment on, it was only a matter of time before operations like the current Kursk incursion were carried out.\nThe Kursk operation required only one thing – the courage to “turn the table.” As they say: Fortis fortuna adiuvat – fortune favors the brave.\nYet another important result of the Kursk operation is the absolute impossibility of truce negotiations.\nThe views expressed in this opinion article are the author’s and not necessarily those of Kyiv Post."}, {"id": "33c676c8-5c04-4b66-bcb6-548bf6f100b2", "title": "SecAF Kendall visits 20th FW > Air Force Reserve Command > News", "date": "2024-08-09 01:15", "url": "https://www.afrc.af.mil/News/Article/3866250/secaf-kendall-visits-20th-fw/", "domain": "afrc.af.mil", "domain_classification": "Unknown", "message": "Secretary of the Air Force Frank Kendall visited Shaw Air Force Base, July 30-31, to gain a deeper understanding of the 20th Fighter Wing’s mission and combat operations, as well as those of tenant units co-located on the base.\nDuring the two-day visit, Kendall attended mission briefs from various units, met with civic leaders from the local community and held an all-call to field questions from Shaw AFB’s Airmen.\n“I’m very impressed with the focus on readiness and the mission by Team Shaw.\nThe visit also highlighted the 20th FW’s combat readiness to support an expanding operational mission set globally.In the past year, Shaw AFB and the 20th FW have been pushing the limits of innovation and ingenuity to increase mission readiness and capabilities within an ever-shifting combat landscape.\n“You all volunteered to wear the uniform for the United States, and every American citizen should be deeply grateful for what you do every day.”During his time at Shaw AFB, Kendall also visited with Airmen and leaders from the 25th Attack Group, 609th Air Operations Center, Ninth Air Force (Air Forces Central), and Fifteenth Air Force"}, {"id": "0defbde9-db04-440b-abcf-574d705f6144", "title": "Taiwan Proposes Highest - Ever Military Budget of $19 . 7 Billion", "date": "2024-08-09 00:45", "url": "https://www.breitbart.com/asia/2024/08/08/taiwan-proposes-highest-ever-military-budget-of-19-7-billion/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Taiwanese President William Lai Ching-te on Thursday announced a proposed defense budget of $19.76 billion in U.S. dollars for the 2025 fiscal year.\nThe proposal would increase military spending by 6.7 percent over 2024, reaching the highest level ever allocated for defense by the Republic of China (ROC).\nLai’s record defense budget proposal was not really a radical departure from Taipei’s normal spending priorities.\nThe new military budget is still considerably less than the three percent of GDP that is generally considered reasonable by international analysts, and Taiwan still spends more on social welfare, education, science, and economic development.\nTaiwan’s military budget has increased every year for the past five years, after hitting a low of two percent of GDP in 2019."}, {"id": "18e32e46-538a-4014-b976-cf272a0ee296", "title": "Naval War College Hosts Symposium on Innovation and Future of Warfare > United States Navy > News Stories", "date": "2024-08-09 16:45", "url": "https://www.navy.mil/Press-Office/News-Stories/Article/3867638/naval-war-college-hosts-symposium-on-innovation-and-future-of-warfare/", "domain": "navy.mil", "domain_classification": "Unknown", "message": "Here's how you knowAn official website of the United States government"}, {"id": "76eb89cd-5350-4517-9e45-72e3e5b6577b", "title": "Anti - drone  shoot - out  lets experienced soldiers wring out latest gear", "date": "2024-08-09 07:30", "url": "https://www.defenseone.com/technology/2024/08/anti-drone-shoot-out-lets-experience-soldiers-wring-out-latest-gear/398698/", "domain": "defenseone.com", "domain_classification": "Unknown", "message": "“You can't fake it with our soldiers,” said Maj. Anthony Padalino, a 10th Mountain Division field-artilleryt officer with experience against drones in Iraq.\nThe soldiers’ sharp eye helps inform DEVCOM’s fielding of weapons to soldiers, Padalino said.\nCounter-drone weapons fire into the air, which poses a risk in three dimensions rather than the flat plane of a shooting range.\nThe division wants to “eventually get to a point where any unit in 10th Mountain says, hey, I want to go out and practice counter-[drone],” he said.\nPadalino said small quadcopters like FPVs do not typically pose much of a threat to 10th Mountain troops."}, {"id": "9c5ec4a6-c60c-4333-b6b9-402e46169e09", "title": "A  robot dog  armed with an AI - enabled rifle for shooting down drones was tested at a US Army exercise", "date": "2024-08-09 04:00", "url": "https://www.businessinsider.in/defense/news/a-robot-dog-armed-with-an-ai-enabled-rifle-for-shooting-down-drones-was-tested-at-a-us-army-exercise/articleshow/112385453.cms", "domain": "businessinsider.in", "domain_classification": "Unknown", "message": "Industry partners demonstrated a four-legged \"robot dog\" aimed to counter drones at a recent Army exercise.\nA \"robot dog\" carrying an artificial intelligence-enabled rifle made an appearance at a recent US Army counter-drone exercise.\nA video shared from one portion of the exercise shows the so-called robot dog in action.\nPer the goals of Operation Hard Kill, the robotic dog was tested in a counter-drone role, mainly meant to identify and destroy unmanned aerial vehicles.\nThe US is far from the only military actively working on and, in some cases, already deploying robotic dogs in service."}, {"id": "59b402a5-5e8f-4e87-a6fc-1758ae1b1c31", "title": "Harris Team Scrambles to Quietly  Edit  Military Claims in Walz Campaign Bio", "date": "2024-08-09 01:30", "url": "https://redstate.com/wardclark/2024/08/08/harris-campaign-scrambles-to-edit-military-claims-in-walz-bio-n2177901", "domain": "redstate.com", "domain_classification": "Unknown", "message": "Now, after several days of being hammered on Minnesota Governor and vice presidential candidate Tim Walz's heavily embellishing his military record, the campaign is responding - by quietly amending Walz's campaign bio:AdvertisementSorry, but that's too little, too late.\nKamala Harris’ presidential campaign updated its online biography of running mate Tim Walz’s military service amid Republican efforts to question his record in the Army National Guard.\nIn the original biography, the same sentence called Walz “the son of an Army veteran and a retired Command Sergeant Major in the Army National Guard himself,” website archives show.\nA Harris campaign spokesperson did not immediately respond to a request for comment, nor did Walz’s gubernatorial office in Minnesota, the website for which still describes him as “Command Sergeant Major Walz.” Walz’s campaign website for governor also used this title.\nTim Walz is a liar."}, {"id": "1f87c532-3c3b-439e-a0aa-2b2a56fda289", "title": "Mali Is Still Unsafe Under the Military - Why It Hasnt Made Progress Against Rebels and Terrorists", "date": "2024-08-09 05:30", "url": "https://allafrica.com/stories/202408090014.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "We argue that in spite of the populist rhetoric by Malian military government and some recent success, there are at least three reasons for the continuing insecurity.\nTo turn the tide against rising insecurity, Malian counterinsurgency forces must adapt and respond effectively to these factors.\nThe Malian military doesn't have sufficient resources and advanced military assets to replace the security architecture placed at its disposal by defunct multilateral and bilateral military missions.\nLight attack aircraft, helicopters and combat drones are key to providing close air support in an effective and timely manner.\nRead more: Three likely changes in Mali after France withdraws - and two options for the juntaLimited military assistance and foreign influenceWith the departure of international military support missions, any progress made in the last decade towards improving general military capability of the country is now at risk."}, {"id": "ac2521f4-0bd6-4108-b8fe-0654a6a2aa21", "title": "Naftali Bennet speaks on war with Iran , terror and a post - Hamas Gaza", "date": "2024-08-09 11:00", "url": "https://www.jpost.com/israel-hamas-war/article-814034", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "“We’re fighting a war against total evil,” former Israeli prime minister Naftali Bennett told Piers Morgan in an appearance on \"Piers Morgan Uncensored\" on Thursday.\nMorgan questioned Bennett on the “catastrophic consequences” of such a conflict, to which Bennett replied that Israel was merely “hitting back” at a warmongering regime.\n'The epicenter of terror'“Iran's regime, the Iranian Islamic Republic of Iran, is the epicenter of terror.\n“We don't want to dispose of them; we don't want to annihilate them.”“But Iran wants to annihilate Israel.\nHamas wants to annihilate Israel."}, {"id": "a765d3df-67d3-4455-8044-82cda526190b", "title": "House Republican Veterans Slam  Coward  Walz Amid Stolen Valor Accusations", "date": "2024-08-09 02:45", "url": "https://www.breitbart.com/2024-election/2024/08/08/house-republicans-candidates-who-are-vets-slam-coward-walz-amid-stolen-valor-accusations/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Many Republican veterans who are either in the House of Representatives or are running for the House are blasting Democrat vice presidential candidate Tim Walz amid stolen valor accusations.\n“Tim Walz LIED about his rank.\n“And now, according to CNN, Walz LIED about carrying weapons of war in a war zone.”Tim Walz LIED about his rank.\nAnd now, according to CNN, Walz LIED about carrying weapons of war in a war zone.\n— Anna Paulina Luna (@realannapaulina) August 7, 2024“Today is Purple Heart day and we have a guy who is claiming to be a combat veteran as Harris’ running mate."}, {"id": "893e7a23-526a-4726-ba83-1b168f2720ae", "title": "JD Vance :  But did JD Vance see combat ? He was in public affair : CNN anchor slammed", "date": "2024-08-09 14:45", "url": "https://timesofindia.indiatimes.com/world/us/but-did-jd-vance-see-combat-he-was-in-public-affairs-cnn-anchor-slammed/articleshow/112407860.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "CNN anchor Brianna Keilar Thursday suggested that senator JD Vance may not be the right person to attack Tim Walz's military record as he was a \"combat correspondent\" during his deployment in Iraq.\n“But when you dig a little deeper into that, he was a public affairs specialist, someone who did not see combat, which certainly the title ‘combat correspondent’ kind of gives you a different impression.So he may be the imperfect messenger on that,” Keilar said.JD Vance took note of the suspicion and said it was disgusting.\n\"Brianna this is disgusting, and you and your entire network should be ashamed of yourselves.\nWhen I got the call to go to Iraq, I went.\nTim Walz said he carried a gun in a war."}, {"id": "4216a531-1eea-446b-8299-f795b364c3df", "title": "CNN fact - checks Tim Walz about  absolutely false  claim he carried weapons  in war  ", "date": "2024-08-09 04:15", "url": "https://freerepublic.com/focus/f-news/4257281/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "CNN fact-checks Tim Walz about ‘absolutely false’ claim he carried weapons 'in war'Fox News ^ | Aug 8, 2024 | Alexander HallPosted on by where's_the_Outrage?\nTim Walz, D-Minn., on Wednesday, declaring that \"there is no evidence\" he carried weapons in combat as the vice presidential candidate appeared to previously imply.\nWell, I wonder, Tim Walz, when were you ever in war?\nThere is undeniable video evidence that Walz said he carried a weapon of war in war.\nTampon Tim Walz: “We can make sure those weapons of war that I carried in war is the only place those weapons are”."}, {"id": "c0c4bf17-6419-44d5-875f-e0f80ae235d0", "title": "SECNAV Del Toro Delivers Remarks at the Future Warfighting Symposium", "date": "2024-08-09 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240808-usn04.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "SECNAV Del Toro Delivers Remarks at the Future Warfighting SymposiumUS NavyNaval War CollegeSpeech by Carlos Del ToroPresented on 08 August 2024Date Published 08 August 2024Good afternoon, everyone!\nA key tenet of Maritime Statecraft is the recognition that no great naval power has long endured without also being a commercial maritime power.\nWe expect these efforts will offer significant returns to Navy shipbuilding and sealift.\nIn China, we face a full spectrum global maritime power for the first time in over a century.\nI again emphasize that no great naval power has long endured without also being a maritime power."}, {"id": "5fc57dbe-094a-4586-a8d3-f2b7d308506c", "title": "Baltic Fleet specialists conduct training with servicemen on countering attack drones", "date": "2024-08-09 10:45", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/08/russia-240808-russia-mod01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Baltic Fleet specialists conduct training with servicemen on countering attack drones08.08.2024Baltic Fleet troops underwent training in Kaliningrad region to hone skills in countering unmanned aerial vehicles.\nThe groups consisted of electronic warfare and anti-aircraft specialists along with snipers.\nFollowing the scenario, the electronic warfare units searched for and tracked down small low-flying targets, and Strela-10 large-calibre machine guns and Strela-10 man-portable air defence systems.\nBased on the experience acquired during the special military operation, drills are conducted regularly, both as part of small units and as part of companies and battalions.\nMore than 100 servicemen took part in the drills and over 10 units of weapons, military and special equipment were involved."}, {"id": "ffaa4ad6-dc38-4a65-ad73-b3c013251310", "title": "  Geppetto Garden Gnome : Daily Caller Editor Issues Challenge To Kinzinger , CNN Anchor For Denigrating JD Vance Service", "date": "2024-08-09 14:45", "url": "https://dailycaller.com/2024/08/09/daily-caller-geoff-ingersoll-adam-kinzinger-brianna-keilar-jd-vance-marines-iraq/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "Daily Caller Editor-in-Chief Geoff Ingersoll issued a challenge to former Republican Illinois Rep. Adam Kinzinger and CNN host Brianna Keilar on Thursday for downplaying vice presidential candidate J.D.\nKeilar and Kinzinger both downplayed Vance’s service in Iraq on Wednesday and Thursday by arguing he was involved in “public affairs” rather than being in a combat zone.\nIngersoll, who was deployed to Iraq in 2006, said Keilar and Kinzinger should be “ashamed” for their remarks.\nYou just had a camera strapped to you.”Ingersoll, who previously served in the Marines as a combat correspondent, then issued a hiking challenge to Keilar, Kinzinger and Hasan.\nIt’s like Geppetto’s garden gnome, Adam Kinzinger,” Ingersoll said."}, {"id": "8c19ba33-a03c-4811-87ea-ce9c8a214838", "title": "Harris campaign changes Walz military biography after backlash | News", "date": "2024-08-09 06:30", "url": "https://gazette.com/news/wex/harris-campaign-changes-walz-s-military-biography-after-backlash/article_ca369bea-bfdb-5eee-ba61-7c496e936f58.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Tim Walz’s (D-MN) online biography after Republicans slammed its representation of her running mate's military record.\nDuring his 2018 race for governor in the North Star State, two retired command sergeant majors complained that Walz was misleading voters with his army titles.\nVance (R-OH), himself a Marine veteran, has led GOP attacks on Walz’s representation of his military record.\nDuring a campaign stop in Michigan on Wednesday, Vance blasted Walz for “stolen valor garbage,” saying he should be “ashamed” for allegedly lying about his military service.\nHe didn’t take that decision lightly at all.”The Washington Examiner reached out to the Harris campaign for comment."}, {"id": "89930813-cd81-4397-bfe8-84531572c339", "title": "Latest Monster Hunter Wilds trailer showcases the new Hunting Horn weapon", "date": "2024-08-09 16:30", "url": "https://www.kitguru.net/gaming/matthew-wilson/latest-monster-hunter-wilds-trailer-showcases-the-new-hunting-horn-weapon/", "domain": "kitguru.net", "domain_classification": "Unknown", "message": "Earlier this week, Capcom surprised Monster Hunter fans with new footage of the next-generation game, Monster Hunter Wilds.\nReleasing on PC, PS5 and Xbox Series X/S in 2025, fans can now check out how combat has been updated for the Hunting Horn weapon.\nIf this functions as well as I hope, it could essentially turn Monster Hunter into a rythm game.\nThere is no release date yet for Monster Hunter Wilds but it is due out in 2025, likely in the first half of the year.\nKitGuru Says: Are you planning on grabbing Monster Hunter Wilds when it drops?"}, {"id": "fb96804b-1634-4a65-b173-d0b8c8b78203", "title": "The Backstory : The 9 - year - old Union soldier | KC101", "date": "2024-08-09 05:00", "url": "https://kc101.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "kc101.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "fca159cc-09a8-4441-b2cf-7c66d3c01cdf", "title": "The Backstory : The 9 - year - old Union soldier | KISS 106 . 7", "date": "2024-08-09 05:00", "url": "https://kiss1067.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "kiss1067.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "cfc9a331-baf4-4506-9c90-377d8ce347a8", "title": "The Backstory : The 9 - year - old Union soldier | 107 . 1 KISS FM", "date": "2024-08-09 05:00", "url": "https://kissfm1071.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "kissfm1071.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "6b57589b-e3d7-4818-ad94-3864fffd3b84", "title": "The Backstory : The 9 - year - old Union soldier | Q102", "date": "2024-08-09 05:00", "url": "https://q102.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "q102.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "71697714-f51c-4c3b-aa4d-eac86fe34e42", "title": "The Backstory : The 9 - year - old Union soldier | 96 . 1 KISS FM", "date": "2024-08-09 05:45", "url": "https://961kissonline.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "961kissonline.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "d211dfb0-5a50-42f9-81cd-0fd190099c4b", "title": "The Backstory : The 9 - year - old Union soldier | 92 . 1 The Beat", "date": "2024-08-09 05:15", "url": "https://921thebeat.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "921thebeat.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "dd6fa99b-41ee-4037-9558-a71bbe3bf310", "title": "The Backstory : The 9 - year - old Union soldier | Z104", "date": "2024-08-09 04:45", "url": "https://z104fm.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "z104fm.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "19d844c1-50c0-405d-b9f5-f35e9ffbef7f", "title": "The Backstory : The 9 - year - old Union soldier | Hot 101 . 9", "date": "2024-08-09 08:30", "url": "https://hot1019nwa.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "hot1019nwa.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "d53bb14d-546d-4551-8d4b-c8ddbcfe8b13", "title": "The Backstory : The 9 - year - old Union soldier | KISS 95 . 7", "date": "2024-08-09 08:30", "url": "https://kisswheeling.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "kisswheeling.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "d0af1fa6-b0d9-48d0-939b-38d5298a9a40", "title": "The Backstory : The 9 - year - old Union soldier | 107 . 5 KISS FM", "date": "2024-08-09 07:45", "url": "https://1075kissfm.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "1075kissfm.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "5f444de6-2d5c-4434-a08a-4681b165c5b8", "title": "The Backstory : The 9 - year - old Union soldier | Elvis Duran and the Morning Show", "date": "2024-08-09 06:30", "url": "https://elvisduran.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "elvisduran.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "d6c11a1c-edae-4ad7-8703-0fbdddfec631", "title": "The Backstory : The 9 - year - old Union soldier | Power 97 . 3", "date": "2024-08-09 06:30", "url": "https://power973.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "power973.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "fe021e07-5a09-4a4f-9b97-043ee4f30f4c", "title": "The Backstory : The 9 - year - old Union soldier | Star 104", "date": "2024-08-09 07:30", "url": "https://star104.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/?pname=www.star104.com&sc=dnsredirect", "domain": "star104.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "f2b4c0ed-b5c0-4ead-be51-287b476f0a89", "title": "The Backstory : The 9 - year - old Union soldier | HOT 94 . 9", "date": "2024-08-09 07:30", "url": "https://hot949allthehits.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "hot949allthehits.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "c27f4cb7-f07a-4329-ac80-e979e638809c", "title": "The Backstory : The 9 - year - old Union soldier | 99 . 9 XTC", "date": "2024-08-09 07:30", "url": "https://999xtc.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "999xtc.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "8eb50bcb-de54-4770-844d-ab968a835a78", "title": "The Backstory : The 9 - year - old Union soldier | 93 . 7 NOW", "date": "2024-08-09 07:30", "url": "https://937now.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "937now.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "cb65ce44-7aed-4a6a-b570-ab62429af2c6", "title": "The Backstory : The 9 - year - old Union soldier | FM97 WLAN", "date": "2024-08-09 06:45", "url": "https://fm97.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "fm97.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "e8e19964-e586-48dd-92a3-aee46a8fd212", "title": "The Backstory : The 9 - year - old Union soldier | 97 . 5 FM", "date": "2024-08-09 06:45", "url": "https://975online.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "975online.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "f17e26e5-1af5-446b-badc-9a97ee529788", "title": "The Backstory : The 9 - year - old Union soldier | Z107", "date": "2024-08-09 06:45", "url": "https://z107fm.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "z107fm.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "a661faa9-021f-4e91-a7cf-59b7fc412d53", "title": "The Backstory : The 9 - year - old Union soldier | 107 . 1 KISS FM", "date": "2024-08-09 08:15", "url": "https://1071kissfm.iheart.com/featured/elvis-duran/content/2024-08-09-1014-elvis-duran-and-the-morni-the-backstory-the-9-year-old-union-soldier/", "domain": "1071kissfm.iheart.com", "domain_classification": "Unknown", "message": "War is a terrible thing under any circumstance.\nThere were more deaths than the combined total in WW1 and WW2.\nFood, uniforms, medical supplies, working weapons, and more, all in short supply with con artists stealing as much as 25% of government war funds.\nThis is the story of Johnny Clem who desperately wanted to fight for the Union.\nHe joined the military at 9 years old and retired as a general 55 years later after marrying a Confederate’s daughter!"}, {"id": "1089890b-7bf4-4258-a545-294f18143bdd", "title": "Battle Lines : Israel prepares for Iran retaliation , French advice on the united kingdom riots , political turmoil in Bangladesh", "date": "2024-08-09 05:30", "url": "https://www.yahoo.com/news/battle-lines-israel-prepares-iran-050000446.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "In this episode of Battle Lines, we look at how Israel is preparing for a possible war with Iran and a deep dive into how Hamas fights with Middle East Correspondent Jotam Confino.\nAcross the world, from Europe to Asia, from the Americas to the Middle East, tensions are rising between nation states as the traditional alliances and alignments evolve in the 21st century.\nThis year sees war in Europe and the Middle East, and elections in major economies, from the US and the UK to Taiwan.\nListen to Battle Lines using the audio player in this article or on Apple Podcasts, Spotify, Amazon Music, or your favourite podcast app.\nTry The Telegraph free for 3 months with unlimited access to our award-winning website, exclusive app, money-saving offers and more."}, {"id": "464d99fb-b230-46e4-8e9f-4a6d4e74f1c4", "title": "Battle Lines : Israel prepares for Iran retaliation , French advice on the united kingdom riots , political turmoil in Bangladesh", "date": "2024-08-09 05:45", "url": "https://www.telegraph.co.uk/world-news/2024/08/09/israel-prepares-for-irans-retaliation/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Across the world, from Europe to Asia, from the Americas to the Middle East, tensions are rising between nation states as the traditional alliances and alignments evolve in the 21st century.\nThis year sees war in Europe and the Middle East, and elections in major economies, from the US and the UK to Taiwan.\nInsurgencies flare in Yemen and Burma, tensions escalate in East Africa, and all around the world the international security architecture buckles under increasing pressure.\nBattle Lines, a new podcast from The Telegraph, combines on-the-ground reporting with analytical expertise to help the listener to better understand the course of world politics, wars and tensions, as fault lines grind and slip in an increasingly dangerous and confusing multipolar world.\nListen to Battle Lines using the audio player in this article or on Apple Podcasts, Spotify, Amazon Music, or your favourite podcast app."}, {"id": "7fe0b5f1-515e-4d20-9a19-d53a23a2efca", "title": "World War Two from Above - U y", "date": "2024-08-09 04:15", "url": "https://www.tvguide.co.uk/schedule/3f12b000-67e9-5dbe-b88e-13463e7df868/world-war-two-from-above", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "World War Two from AboveU&Yesterday 10:00 AM to 11:00 AM Friday 9 August Share Add toCalendar +Battle for the Skies Season 1 Episode 5 of 6 S SubtitlesFor the first time, the theatre of war takes place mainly in the air.\nFrom the invention of radar to Hitler's 'Wonder Weapons', all means are good to bring the enemy downWorld War Two from Above airs on U&Yesterday at 10:00 AM, Friday 9 August .\n(Subtitles.)"}, {"id": "88ce492e-e4c8-4d85-8052-78068c682711", "title": "Israel Paranoia - Live Event Reporting by Dunya News", "date": "2024-08-09 05:00", "url": "https://dunyanews.tv/en/Event-Reporting/221", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Just yesterday, two attacks on school shelters in Gaza City killed at least 15 Palestinians and injured some 30 others.\nFri, 09 Aug 2024 15:16:02 PKTUS army’s Central Command head meets Israeli military chief Michael Kurilla, the head of the US army’s Central Command, is back in Israel for the second time this week.\nThe Israeli military will “continue to deepen its relationship with the US Armed Forces out of commitment to strengthening regional stability and coordination between the two militaries,” the post added.\nFri, 09 Aug 2024 12:49:56 PKTIsrael shows no restrain: Hits 60 targets in a day Israel’s military showing no restrain to hit the Gaza areas.\nRead MoreFri, 09 Aug 2024 08:25:34 PKT"}, {"id": "7b3411f8-7426-47f8-9b08-9399764b460d", "title": "Harris - Waltz cling to Biden media strategy ; Stolen valor scandal gains momentum", "date": "2024-08-09 00:15", "url": "https://www.worldtribune.com/harris-waltz-cling-to-biden-media-strategy-stolen-valor-scandal-gains-momentum/", "domain": "worldtribune.com", "domain_classification": "Unknown", "message": "Urgent: Support Free Press FoundationThat Harris-Walz “robust communications strategy,” however, has hit a major snag — the issue of Walz’s military stolen valor.\nBut that’s not what Tim Walz told the public when he decided to run for public office upon abruptly leaving the military.\nInstead of being honest about his early departure from the military, Walz told the media a much more heroic tale, one that was entirely ficticious.\nWe can make sure those weapons of war, that I carried in war, are only carried in war,” Walz tells the audience.\nWalz campaign press release from 2005:Help Wanted"}, {"id": "17890846-24b0-4ca8-ba89-4fb735a77ceb", "title": "West Virginia first astronaut , Jon A . McBride , dies at 81", "date": "2024-08-09 07:45", "url": "https://wvmetronews.com/2024/08/08/west-virginias-first-astronaut-jon-a-mcbride-dies-at-81/", "domain": "wvmetronews.com", "domain_classification": "Unknown", "message": "BECKLEY, W.Va. — One of West Virginia’s greatest innovators, Jon McBride, died Wednesday after his battle with Alzheimer’s disease and cancer.\nMcBride was also on the command crew of the ASTRO-1 mission.\nMcBride worked at the Kennedy Space Center for two decades, and also flew over 60 combat missions during his time with the Navy.\nMcBride graduated from the United States Naval Postgraduate School in 1971, completing a degree in Aeronautical Engineering.\nAccording to his obituary, McBride’s last words were, “Oh boy!” as he watched a Kennedy Space Center rocket launch from his window."}, {"id": "d7b0b9ac-e49e-4d05-bc7d-a85d04db0a13", "title": "With  Swift Boat  architect at the helm , Trump campaign uses familiar playbook against Walz", "date": "2024-08-09 10:00", "url": "https://www.yahoo.com/news/swift-boat-architect-helm-trump-090002890.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "With ‘Swift Boat’ architect at the helm, Trump campaign uses familiar playbook against WalzThe Trump campaign’s attacks on Minnesota Gov.\nThe common denominator in both efforts: Trump campaign co-manager Chris LaCivita.\nLaCivita played a key role in the political advocacy group Swift Boat Veterans for Truth, which ran the TV ad campaign questioning Kerry’s military service.\nIt’s a playbook that the Trump campaign appears to be re-running after Vice President Kamala Harris tapped Walz, a 24-year veteran of the Army National Guard, as her running mate.\nVance, who is a Marine Corps veteran, has led the charge questioning Walz’s military service."}, {"id": "2e4909cc-cf67-4669-8945-bc75011c4937", "title": "With  Swift Boat  architect at the helm , Trump campaign uses familiar playbook against Walz", "date": "2024-08-09 12:30", "url": "https://us.cnn.com/2024/08/09/politics/tim-walz-service-swift-boat-attacks/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "The common denominator in both efforts: Trump campaign co-manager Chris LaCivita.\nLaCivita played a key role in the political advocacy group Swift Boat Veterans for Truth, which ran the TV ad campaign questioning Kerry’s military service.\nIt’s a playbook that the Trump campaign appears to be re-running after Vice President Kamala Harris tapped Walz, a 24-year veteran of the Army National Guard, as her running mate.\nThe hits on Walz’s military service align with Trump’s penchant for personal attacks against his political opponents, while also harkening back to the effort to sully Kerry’s military record two decades ago.\nVance, who is a Marine Corps veteran, has led the charge questioning Walz’s military service."}, {"id": "90d5526f-82a1-4bd2-83f0-d04f6285255b", "title": "Putin accuses Ukraine of a  large - scale provocation  with its raid in southwestern Russia - New Delhi Times - India Only International Newspaper", "date": "2024-08-09 06:30", "url": "https://www.newdelhitimes.com/putin-accuses-ukraine-of-a-large-scale-provocation-with-its-raid-in-southwestern-russia/", "domain": "newdelhitimes.com", "domain_classification": "Unknown", "message": "If confirmed, the cross-border foray would be among Ukraine’s largest since Russia’s full-scale invasion in February 2022, and unprecedented for its deployment of Ukrainian military units.\nRussian forces have swiftly repelled previous cross-border incursions, but not before they caused damage and embarrassed authorities.\nThe think tank also cast doubt on video shared by Russian military bloggers claiming to show the aftermath of the Ukrainian raids.\nIt also said that Ukrainian forces captured the Sudzha gas transit station, about 8 kilometers (5 miles) from the border.\nAnother pro-Kremlin military blog, Two Majors, claimed that Ukrainian troops had advanced up to 15 kilometers (9 miles) into the region."}, {"id": "8584e39a-465d-4e31-8627-9e7e70105af1", "title": "All of Tim Walz military service embellishments", "date": "2024-08-09 00:15", "url": "https://nypost.com/2024/08/08/us-news/all-of-tim-walzs-military-service-embellishments-from-claiming-he-carried-weapons-in-war-to-making-people-think-he-deployed-to-afghanistan/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "The trouble is, in his 24 years in the Minnesota National Guard, Walz never deployed to combat zones in Afghanistan or Iraq.\nWe can make sure those weapons of war, that I carried in war, are only carried in war.”6 Walz served 24 years in the National Guard until his retirement in 2005.\nNo one says ‘Operation Enduring Freedom Veteran.’ That goes on the hats you wear to the VA for doctors appointments.\n“Is there any question in your mind what Enduring Freedom is?” the veteran asks in a viral video of the encounter.\n“Ok, so I guess most people, yourself included, associate Enduring Freedom with Afghanistan?” he pressed."}, {"id": "fc065722-8c32-43da-a8f0-8dffa044e2fc", "title": "Tim Walz Military Record :  Listen ...: Tim Walz  stolen valor  controversy gets Kamala Harri reaction", "date": "2024-08-09 13:15", "url": "https://timesofindia.indiatimes.com/world/us/listen-tim-walzs-stolen-valor-controversy-gets-kamala-harris-reaction/articleshow/112406373.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "And I think that we all should,\" Kamala Harris said once and for all putting an end to the ' stolen valor ' controversy over her running mate Tim Walz.\nThe controversy was triggered by Tim Walz's rival, GOP VP candidate JD Vance who served in the military.\nIn August 2005, the unit that Walz was serving was asked to mobilize and in March 2006, it was deployed to Iraq.\nWell, I wonder, Tim Walz, when were you even in war?\nWhat bothers me about Tim Walz is the stolen valor garbage."}, {"id": "2eeb52e7-20a8-4e80-9497-8533130611d7", "title": "CNN Brianna Keilar : JD Vance Is an  Imperfect Messenger  As His Service in Iraq Is Not Really Combat", "date": "2024-08-09 01:30", "url": "https://redstate.com/streiff/2024/08/08/cnns-brianna-keilar-declares-jd-vances-service-in-iraq-is-not-really-combat-n2177907", "domain": "redstate.com", "domain_classification": "Unknown", "message": "The evidence against the pro-abort, anti-gun, and anti-courage Democrat nominee for vice president, Minnesota Governor Tim Walz, is overwhelming.\nAdvertisementI also think that JD Vance, as a messenger on this, may be an imperfect messenger.\nVance served in Anbar Province for six months in \"late 2005.\"\nMore to the point, whether Vance served in combat or even served at all is immaterial.\nHis campaign announced less than two months before Walz took a demotion and retired that he was deploying with his battalion."}, {"id": "be6ba5bd-abd9-48b0-8a53-f5d7910bd859", "title": "Leland Vittert Upends Walz Character Witness With Walz Own Words", "date": "2024-08-09 01:30", "url": "https://www.newsbusters.org/blogs/nb/mary-clare-waldron/2024/08/08/leland-vittert-upends-walz-character-witness-walzs-own-words", "domain": "newsbusters.org", "domain_classification": "Unknown", "message": "Yet, on Wednesday, NewsNation host Leland Vittert interviewed a member of the National Guard put forward by the Harris/Walz campaign and upended their defense with Walz’s own misleading words about his service.\nRetired Army National Guard Sergeant Major Joseph Eustice served with Waltz in the Minnesota National Guard for many years, up until his sudden retirement, nearly two months before the unit got the order they’d be getting deployed to Iraq.\nThese were more than rumors and as a Command Sergeant Major, Tim Walz would have been very aware of an imminent deployment.\nNow., from my perspective, you shouldn’t say when you don't, you shouldn’t say you used weapons in war when you did not.\nI guess I would say he shouldn’t have – he shouldn’t have said it."}, {"id": "45fc277d-c1d7-46be-a354-ec19ba9e3688", "title": "Leland Vittert Upends Walz Character Witness With Walz Own Words", "date": "2024-08-09 04:30", "url": "https://newsbusters.org/blogs/nb/mary-clare-waldron/2024/08/08/leland-vittert-upends-walz-character-witness-walzs-own-words", "domain": "newsbusters.org", "domain_classification": "Unknown", "message": "Yet, on Wednesday, NewsNation host Leland Vittert interviewed a member of the National Guard put forward by the Harris/Walz campaign and upended their defense with Walz’s own misleading words about his service.\nRetired Army National Guard Sergeant Major Joseph Eustice served with Waltz in the Minnesota National Guard for many years, up until his sudden retirement, nearly two months before the unit got the order they’d be getting deployed to Iraq.\nThese were more than rumors and as a Command Sergeant Major, Tim Walz would have been very aware of an imminent deployment.\nNow., from my perspective, you shouldn’t say when you don't, you shouldn’t say you used weapons in war when you did not.\nI guess I would say he shouldn’t have – he shouldn’t have said it."}, {"id": "3c7d6600-a959-4cfc-bf68-263e4e05e19c", "title": "Tim Walz military record is under scrutiny . Here a breakdown of his National Guard record and of JD Vance record as a Marine . ", "date": "2024-08-09 00:30", "url": "https://www.wsbradio.com/news/national/tim-walzs-military/DOVZIBMIVIESLSK2FLXL7GGQRY/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "0e235065-5505-42da-9590-d2977275a034", "title": "Fact - checking claims made by Vance and Walz on the campaign trail", "date": "2024-08-09 01:15", "url": "https://www.news5cleveland.com/politics/fact-checking-claims-made-by-vance-and-walz-on-the-campaign-trail", "domain": "news5cleveland.com", "domain_classification": "Unknown", "message": "Vice President Kamala Harris and her running mate Tim Walz held campaign events Wednesday in Michigan and Wisconsin.\nAnd in a speech Wednesday, Vance accused Walz of misleading voters about his time in the service.\nRELATED STORY | Who is Tim Walz?\n\"What bothers me about Tim Walz is the stolen valor garbage.\nIn regards to Vance's claim that Walz \"abandoned his unit,\" Walz actually retired two months before his unit received a letter to be deployed to Iraq in July of 2005."}, {"id": "096292ef-97bd-445d-815d-71ef4de4cad6", "title": "Is the rise of China drone carrier a threat to US naval supremacy ? ", "date": "2024-08-09 14:15", "url": "https://interestingengineering.com/front-lines/chinas-drone-carrier-us-naval-supremacy", "domain": "interestingengineering.com", "domain_classification": "Unknown", "message": "It also begs the question of how such developments might change the balance of maritime time power worldwide.\nSo, why is China so focused on drone technology, and what could this mean for trigger points like Taiwan and the South China Sea in general?\nDrone motherships are now in vogueWe’ve previously written about how several of the world’s navies invest heavily in drones, specifically drone carriers or motherships.\nA work-in-progress definition of a drone carrier could be a naval vessel designed to operate as a mobile aviation platform, mainly for unmanned aerial vehicles (UAVs).\nIn this sense, this type of ship would function as a command center, launch pad, and recovery site for UAV operations, extending the traditional role of aircraft carriers to include a focus on drone technology."}, {"id": "2606ebc0-7137-47ed-9e93-1e0a2f2af057", "title": "Vance accused Walz of  stolen valor . What to know about Walz military record", "date": "2024-08-09 01:15", "url": "https://www.kalw.org/npr-news/2024-08-08/vance-accused-walz-of-stolen-valor-what-to-know-about-walzs-military-record", "domain": "kalw.org", "domain_classification": "Unknown", "message": "But Vance and Walz are also both veterans, with another thing in common: neither one of them saw combat.\nHe didn’t take that decision lightly at all.”The unit didn’t go to Iraq until March 2006, 10 months after Walz retired, where it stayed for a grueling 22-month extended deployment.\nWalz served as a command sergeant major, the highest enlisted rank.\nThe Minnesota National Guard told NPR that Walz retired before completing academic requirements to keep the higher rank.\n“He held multiple positions within field artillery such as firing battery chief, operations sergeant, first sergeant and culminated his career serving as the command sergeant major for the battalion."}, {"id": "625b889c-e0e3-417f-a1fe-b12e3eac6a5b", "title": "Dhuluny Conference to explore 1824  martial law  in Bathurst and reconciliation", "date": "2024-08-09 10:45", "url": "https://news.csu.edu.au/latest-news/dhuluny-conference-to-explore-1824-martial-law-in-bathurst-and-reconciliation", "domain": "news.csu.edu.au", "domain_classification": "Unknown", "message": "Charles Sturt University will host the Dhuluny Conference on Thursday 15 and Friday 16 August as part of a wider community commemoration of the 200th anniversary of the 1824 declaration of martial law in Bathurst.\nThe Dhuluny Conference at Charles Sturt University in Bathurst on Thursday 15 and Friday 16 August marks the 200th anniversary of the 1824 declaration of martial law in Bathurst and is an opportunity to progress conversations about restitution and restorative justice for Aboriginal Peoples.\nCharles Sturt University will host the Dhuluny Conference on Thursday 15 and Friday 16 August as part of a wider community commemoration of the 200th anniversary of the 1824 declaration of martial law in Bathurst.\nDetails of all community events during the week can be found at the Dhuluny Events program.\n“While it is commonly misunderstood and assumed that martial law was imposed on the Wiradyuri, martial law was declared to cover all, both British and de facto British subjects (Wiradyuri), and to attempt to stop colonists taking the law into their own hands, as well as stop attacks on them,” he said."}, {"id": "b3313565-64a7-42ad-9f73-7095df4c96c7", "title": "Ship - killing guided bomb put to test as Air Force sinks cargo vessel", "date": "2024-08-09 19:15", "url": "https://www.armytimes.com/air/2024/08/09/ship-killing-guided-bomb-put-to-test-as-air-force-sinks-cargo-vessel/", "domain": "armytimes.com", "domain_classification": "Unknown", "message": "The Air Force in July tested a new ship-killing guided bomb to demonstrate the service’s growing ability to sink enemy vessels.\nThe Air Force is developing QUICKSINK to bolster its anti-ship capabilities, which would be crucial in a potential conflict with China or another major adversary.\nThe decommissioned cargo vessel the Monarch Countess slips beneath the waters of the Gulf of Mexico after being struck by a QUICKSINK weapon.\nHe previously covered leadership and personnel issues at Air Force Times, and the Pentagon, special operations and air warfare at Military.com.\nHe has traveled to the Middle East to cover U.S. Air Force operations."}, {"id": "b5f16646-11ef-489a-9888-f8847743bae6", "title": "Ukraine launches  massive  drone strike on Russia Lipetsk region , as cross - border attack rages on", "date": "2024-08-09 12:30", "url": "https://saudigazette.com.sa/article/644735/World/Europe/Ukraine-launches-massive-drone-strike-on-Russias-Lipetsk-region-as-cross-border-attack-rages-on", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "MOSCOW — Russia’s Lipetsk region has been struck by a “massive” Ukrainian drone attack, according to its governor, as Ukraine’s cross-border assault into Russia shows no sign of easing.\nAt least nine people were wounded in the attack, which damaged energy infrastructure and prompted the temporary evacuation of residents in several areas, Lipetsk governor Igor Artamonov wrote Friday on Telegram.\nOn Thursday, Ukrainian President Volodymyr Zelensky acknowledged the offensive for the first time, saying Moscow must “feel” the consequences of its brutal invasion of Ukraine.\nUS officials do not believe Ukraine intends to hold Russian territory for the long term.\nMykhailo Podolyak, an adviser to Zelensky, praised the Western response to the Ukrainian assault, saying “most quietly approve” of it."}, {"id": "f225ce37-e38b-4aed-8f9d-9ee79682c739", "title": "Meet the American who founded the Sturgis Motorcycle Rally ,  put the brotherhood in motorcycles  ", "date": "2024-08-09 11:45", "url": "https://www.yahoo.com/lifestyle/meet-american-founded-sturgis-motorcycle-080000314.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Meet the American who founded the Sturgis Motorcycle Rally, 'put the brotherhood in motorcycles'Meet the American who founded the Sturgis Motorcycle Rally, 'put the brotherhood in motorcycles'The Sturgis Motorcycle Rally is rolling through South Dakota for the 84th time this week.\nThe Hoels ran the Sturgis Motorcycle Rally for nearly 50 years, before turning it over to the City of Sturgis in the 1980s.\nMotorcycle enthusiasts attend the 81st annual Sturgis Motorcycle Rally on Aug. 8, 2021, in Sturgis, South Dakota.\nPappy's Vintage Cycles, Sturgis, owned today by motorcycle dealer Vinny Terranova, pays homage to Sturgis Motorcycle Rally founder J.C. \"Pappy\" Hoel.\nOriginal article source: Meet the American who founded the Sturgis Motorcycle Rally, 'put the brotherhood in motorcycles'"}, {"id": "58f09185-f525-4f54-8e67-4d26737424fb", "title": "Is Gordon Ryan retiring ? Struggling  King  reveals grappling future after  exhausting  prep for ADCC 2024", "date": "2024-08-09 16:30", "url": "https://www.mmamania.com/2024/8/9/24216756/is-gordon-ryan-retiring-struggling-king-reveals-grappling-future-exhausting-prep-adcc-2024", "domain": "mmamania.com", "domain_classification": "Unknown", "message": "Current Abu Dhabi Combat Club (ADCC) Superfight Champion Gordon Ryan will return for the upcoming ADCC 2024 tournament on Aug. 17-18 at T-Mobile Arena in Las Vegas, Nevada.\n“After this ADCC I’m just gonna try to get back to being healthy and there are really only two matches I’m gonna be interested in after ADCC,” Ryan told FloGrappling.\n“My health has been rough lately, so I don’t want to say I’m gonna retire but it’s very tiring doing camps like I’m doing them right now.\nJones and Ryan have a longstanding rivalry that sadly, will not be resolved on the mats.\nFor much more on the upcoming Craig Jones Invitational (CJI) click here."}, {"id": "70198304-d290-48c8-9b9f-e0f3d46c31cb", "title": "Walz military record under scrutiny as Vance , GOP question his service – East Bay Times", "date": "2024-08-09 18:45", "url": "https://www.eastbaytimes.com/2024/08/09/heres-a-look-at-questions-about-tim-walzs-military-record/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "Tim Walz’s military record after Vice President Kamala Harris named him as her running mate this week.\nAccording to the Guard, Walz retired from service in May of that year.\nIn a statement, the Harris campaign pushed back on GOP characterizations of Walz’s service, and also noted that he advocated for veterans once he was elected to the U.S. House.\nWhile attending the University of Houston in 1985, he was reclassified as a field artillery cannoneer as a member of the Texas Army National Guard, later serving as an instructor with the Arkansas Army National Guard.\nBy 1996, he transferred to the Minnesota Army National Guard."}, {"id": "3d89b5eb-8136-4d7b-bf5c-d5b7291dcda8", "title": "WoW : Patch 11 . 0 . 2 bringt endlich das , worauf die Spieler seit dem Pre Patch warten", "date": "2024-08-09 12:30", "url": "https://www.buffed.de/World-of-Warcraft-Spiel-42971/News/wow-the-war-within-patch-1102-update-1453363/", "domain": "buffed.de", "domain_classification": "Unknown", "message": "Rake initial damage increased by 30% and periodic damage increased by 5%.\nThrash initial damage increased by 30% and periodic damage increased by 5%.\nBlessed Champion now deals 25% reduced damage to secondary targets (was 50% reduced damage) and is now a 1-point talent (was 2).\nPrayer of Healing healing increased by 30%.\nCircle of Healing healing increased by 30%."}, {"id": "b6d13ca4-9a80-43b9-8cc0-5513a4da5ba0", "title": "Fact - checking claims made by Vance and Walz on the campaign trail", "date": "2024-08-09 01:30", "url": "https://www.ksby.com/politics/fact-checking-claims-made-by-vance-and-walz-on-the-campaign-trail", "domain": "ksby.com", "domain_classification": "Unknown", "message": "Vice President Kamala Harris and her running mate Tim Walz held campaign events Wednesday in Michigan and Wisconsin.\nAnd in a speech Wednesday, Vance accused Walz of misleading voters about his time in the service.\nRELATED STORY | Who is Tim Walz?\n\"What bothers me about Tim Walz is the stolen valor garbage.\nIn regards to Vance's claim that Walz \"abandoned his unit,\" Walz actually retired two months before his unit received a letter to be deployed to Iraq in July of 2005."}, {"id": "3fdb204b-774e-4b0d-9546-61125e4ecae4", "title": "Monticello residents among group who will attend Honor Flight to D . C . ", "date": "2024-08-09 10:45", "url": "https://www.news-gazette.com/news/monticello-residents-among-group-who-will-attend-honor-flight-to-d-c/article_e31d5ae0-55dc-11ef-9855-772253797be2.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "Champaign, IL (61820)TodaySunny to partly cloudy.\nHigh around 75F.\nWinds NW at 10 to 15 mph..TonightSome clouds this evening will give way to mainly clear skies overnight.\nWinds NW at 5 to 10 mph."}, {"id": "c8ab2dc4-21cf-4719-aa49-458f2470d992", "title": "Here a look at questions about Tim Walz military record | Chattanooga Times Free Press", "date": "2024-08-09 10:00", "url": "https://www.timesfreepress.com/news/2024/aug/08/walzs-military-record-under-scrutiny-as-vance-gop-question-his-service-tfp/", "domain": "timesfreepress.com", "domain_classification": "Unknown", "message": "Tim Walz's military record after Vice President Kamala Harris named him as her running mate this week.\nHere's a look at the issue:He retired before his unit's deployment to IraqWalz served a total of 24 years in various units and jobs in the Army National Guard.\nAccording to the Guard, Walz retired from service in May of that year.\nWhile attending the University of Houston in 1985, he was reclassified as a field artillery cannoneer as a member of the Texas Army National Guard, later serving as an instructor with the Arkansas Army National Guard.\nBy 1996, he transferred to the Minnesota Army National Guard."}, {"id": "f5ea8120-a2a1-4c84-88f7-7e3332fad0a1", "title": "Ukraine launches  massive  drone strike on Russia Lipetsk region , as cross - border attack rages on", "date": "2024-08-09 10:30", "url": "https://edition.cnn.com/2024/08/09/europe/russia-lipetsk-kursk-ukraine-zelensky-intl/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —A video that surfaced online appears to show bodies on burnt-out Russian military trucks in the country’s southwestern Kursk region, the latest sign that Ukraine’s cross-border assault is probing more deeply and inflicting significant damage on Moscow’s troops.\nSome of the trucks are completely burnt out, while others are undamaged but still appear to contain the bodies of military personnel.\nUkrainian President Volodymyr Zelensky said a rescue operation is underway to free people trapped under the rubble.\nUS officials say they do not believe Ukraine intends to hold Russian territory for the long term.\nRussian authorities help residents during evacuation efforts at a railway station in Oryol, Kursk region, August 9, 2024."}, {"id": "7763f384-e12f-48e6-a7f5-564103f2e000", "title": "J . D . Vance Melts Down Over Questions About His Military Record", "date": "2024-08-09 15:15", "url": "https://www.yahoo.com/news/j-d-vance-melts-down-131646605.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Vance seems perfectly happy to dish out criticism of Minnesota Governor Tim Walz over his military record, but he just can’t take it.\nVance blew up at CNN anchor Brianna Keilar on Thursday, after she called Vance an “imperfect messenger” to criticize Walz over his military service.\n“At what point did military service become a liability?” Keilar asked rhetorically on CNN’s Inside Politics.\nKeilar, who is married to an active duty Green Beret, took issue with how Vance’s own military service was being framed.\nShameful of @brikeilarcnn to slander an entire MOS,” Vance wrote in a post on X, referring to military occupation specialty."}, {"id": "f4983416-8b49-4dd7-852b-d7918fb659cf", "title": "With  Swift Boat  architect at the helm , Trump campaign uses familiar playbook against Walz", "date": "2024-08-09 16:30", "url": "https://ktvz.com/politics/cnn-us-politics/2024/08/09/with-swift-boat-architect-at-the-helm-trump-campaign-uses-familiar-playbook-against-walz/", "domain": "ktvz.com", "domain_classification": "Unknown", "message": "The common denominator in both efforts: Trump campaign co-manager Chris LaCivita.\nLaCivita played a key role in the political advocacy group Swift Boat Veterans for Truth, which ran the TV ad campaign questioning Kerry’s military service.\nIt’s a playbook that the Trump campaign appears to be re-running after Vice President Kamala Harris tapped Walz, a 24-year veteran of the Army National Guard, as her running mate.\nIn the 2024 presidential campaign, the allegations related to military service aren’t coming from an outside group but from the campaign directly – and one of its principals.\nVance, who is a Marine Corps veteran, has led the charge questioning Walz’s military service."}, {"id": "7d9b6ee5-4b23-4d23-8a9d-69e379e7e813", "title": "House Democrat : Walz attacks reminiscent of  Swift Boat bulls ‑‑‑ against Kerry", "date": "2024-08-09 15:15", "url": "https://www.yahoo.com/news/house-democrat-walz-attacks-reminiscent-133038625.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Tim Walz (D-Minn.) over his military service reminded her of the infamous Swift Boat attacks against former Sen. John Kerry (D-Mass.)\nShe called the attacks on his military background “a disgrace,” but said it’s the “same old divisive show” from former President Trump.\nThe Swift Boat controversy was a defining feature of the 2004 presidential race between Kerry and George W. Bush.\nA group known as the “Swift Boat Veterans for Truth” questioned Kerry’s military record, receiving widespread publicity.\nA driving force behind the Swift Boat campaign was Chris LaCivita, who is now former President Trump’s current campaign adviser."}, {"id": "5fb898b9-fd2e-4ed2-b3aa-8a8038ed6729", "title": "VP pick Tim Walz faced accusations in 2006 of embellishing his military service , which he called slander", "date": "2024-08-09 01:00", "url": "https://www.cnn.com/2024/08/08/politics/tim-walz-accusations-2006-embellishing-military-service/", "domain": "cnn.com", "domain_classification": "International", "message": "Walz was deployed between 2003 and 2004 to Europe to support Operation Enduring Freedom, but was never deployed to Afghanistan, where the operation occurred.\nCriticism prompts Walz responseIn 2006, the Walz campaign’s description of his service drew pushback in separate letters to the editors.\nOne letter to his local paper said the Walz campaign’s phrasing suggested service in Iraq or Afghanistan.\nIf Walz did not deploy downrange, he should say so.”The letter caused a string of letters in support of Walz.\n“I did 10 months with Operation Enduring Freedom, where, by luck of the draw, I served in Italy."}, {"id": "4f3b7599-efef-42f4-a29e-4017756efead", "title": "US leads G7 in ambassador boycott of ceremony commemorating atomic bombing of Nagasaki", "date": "2024-08-09 05:45", "url": "https://www.wsws.org/en/articles/2024/08/09/bjog-a09.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "The United States has led a boycott by six G7 members of Friday’s ceremony commemorating the atomic bombing of Nagasaki during World War II.\nPhoto from the U.S. Signal Corps showing the devastation left after an atomic bomb exploded over Nagasaki, Japan, on August 9 1945.\nIt followed just three days after the dropping of the first atomic bomb on Hiroshima on August 6, 1945.\nIn their letter protesting Israel’s exclusion, the ambassadors of the imperialist powers nonetheless had the audacity to accuse city authorities in Nagasaki of “politicising” the ceremony by failing to invite Israel.\nThe only way to stop the descent into imperialist barbarism in a third world war is through the development of a global anti-war movement led by the working class."}, {"id": "51e5721f-d69c-428b-b58a-e03f0355ce57", "title": "Tampon Tim Four Feathers - American Thinker", "date": "2024-08-09 11:30", "url": "https://www.americanthinker.com/blog/2024/08/tampon_tim_s_four_feathers.html", "domain": "americanthinker.com", "domain_classification": "Unknown", "message": "The term “weird” hardly covers the bizarre Democrat VP nominee, Tim Walz.\nRather than lead his men into combat, Walz chickened out, abruptly retiring on the eve of deployment.\nIf that sounds familiar, it’s the plot of the famous old British novel, The Four Feathers.\nIn the real-life Tim Walz version, however, our hero redeems himself in politics, winning ever higher offices with one disgraceful performance after another.\nIt shouldn’t take that long with Tim Walz."}, {"id": "26ecae09-0d87-4243-a0bf-71ab28ea40c6", "title": "David Boreanaz , 55 , reveals he had  four MRIs in four month and needs to give his body a rest after grueling SEAL Team finale", "date": "2024-08-09 17:30", "url": "https://www.dailymail.co.uk/tvshowbiz/article-13728571/David-Boreanaz-55-needs-rest-body-SEAL-Team-finale.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "David Boreanaz has revealed he's undergone 'four MRIs in four months' and his body cannot take the strain anymore of filming SEAL Team - as he prepares to bow out in the show's seventh and final season.\nHe told People: 'My body just can’t do it anymore!'\nI think I’ve had four MRIs in the past four months, for my knees, hips, shoulders.\n'Every day spent was a note of thanks to our men and women in the military and Special OPS.\nI think I’ve had four MRIs in the past four months, for my knees, hips, shoulders."}, {"id": "376dde0a-0a4d-4c13-a9b3-1901845ee021", "title": "Russia Lipetsk region hit by  massive  drone attack , governor says", "date": "2024-08-09 06:00", "url": "https://www.jpost.com/breaking-news/article-814011", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Russia was evacuating people on Friday from parts of its western region of Lipetsk, after a \"massive attack\" by Ukrainian drones caused explosions, disrupted power supply, and wounded six people, regional governor Igor Artamonov said.\nFour villages were being evacuated after a state of emergency was declared in the Lipetsk municipal district, Artamonov said on the Telegram messaging app, some of them situated near an air force base.\nA fire had broken out at the air base outside the city of Lipetsk, the Interfax news agency reported local emergency officials as saying.\nCalls on social media to evacuate the entire city were part of a campaign of psychological warfare by Ukraine, Artamonov added, however.\nUkrainian authorities have not reported any strikes on the Lipetsk region."}, {"id": "058ea83b-cc6e-4b58-b742-4f2e9c7a058e", "title": "After coming under attack by unmanned drones , Fort Drum soldiers train to shoot them down", "date": "2024-08-09 02:45", "url": "https://www.wwnytv.com/2024/08/08/after-coming-under-attack-by-unmanned-drones-fort-drum-soldiers-train-shoot-them-down/", "domain": "wwnytv.com", "domain_classification": "Unknown", "message": "FORT DRUM, New York (WWNY) - Training on Fort Drum Thursday focused on shooting down unmanned drones.\nThe 10th Mountain Division teamed up with the Army Development Command-Armaments Center to showcase different technology to help protect soldiers from unmanned attacks.\nOur Combat Aviation Brigade is there today” said Major General Scott Naumann, Commanding General of the 10th Mountain Division and Fort Drum.\nHe said there is still a lot to learn with this kind of warfare, and events like Thursday’s training will help soldiers get there.\nStaff Sergeant Brady Hollis also recently returned from deployment and will help train the 1st Brigade soldiers to counter unmanned aerial systems."}, {"id": "b52d77c6-3c90-4189-b47a-8375d3547422", "title": "Suspected Houthi Rocket - Propelled Grenade Attack Targets Ship Off Yemen , Authorities Say", "date": "2024-08-09 05:00", "url": "https://www.theepochtimes.com/world/suspected-houthi-rocket-propelled-grenade-attack-targets-ship-off-yemen-authorities-say-5702280", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates—A suspected attack by Yemen’s Houthi rebels targeted a ship Thursday in the strategic Bab el-Mandeb Strait that links the Gulf of Aden to the Red Sea, authorities said.\nThe attack saw a rocket-propelled grenade explode close to the ship, according to the British military’s United Kingdom Maritime Trade Operations center.\n“Authorities are investigating.”The Houthis sometimes take hours or even days to acknowledge their attacks, while claiming others that apparently haven’t happened.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nAfter the strikes, the Houthis paused their attacks until Saturday, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden."}, {"id": "a66b6867-8abb-4094-a32c-71938ab5644e", "title": "I hope youve got a spare 190GB kicking about for God Of War Ragnarok on PC", "date": "2024-08-09 12:30", "url": "https://www.rockpapershotgun.com/i-hope-youve-got-a-spare-190gb-kicking-about-for-god-of-war-ragnarok-on-pc", "domain": "rockpapershotgun.com", "domain_classification": "Unknown", "message": "The new God Of War duology has my favourite snow in gaming.\nIn God Of War Ragnarok, the action kicks off a during the apocalyptic fimbulwinter, which is probably bad for some characters I don’t care about, but it is good for me personally, because there’s a lot of snow to play with.\nTo be fair, this does include the roguelike Valhalla DLC, which comes as part of the package when Ragnarok releases on Steam and Epic on the 19th of September.\nThat’s a good 50GB on Baldur's Gate 3, for example, or 40GB more than Horizon Forbidden West with all the extras.\nI might try and wrangle a review of Ragnarok once it’s out, because I’ve got a lot to say about it."}, {"id": "3b51cd99-9096-4140-b62e-e2ad4555a5c1", "title": "Doug Casey Take [ ep .# 339 ] Michael Yon : The Life You Had Before is Over ... ", "date": "2024-08-09 14:15", "url": "https://freerepublic.com/focus/f-chat/4257333/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Doug Casey's Take [ep.#339] Michael Yon: The Life You Had Before is Over...Youtube ^ | 8 Aug, 2024 | Doug Casey, Matt Smith and guest Michael YonPosted on by MtnClimberToday we're joined by Michael Yon, a former Green Beret and Independent War Correspondent, to explore multifaceted threats confronting the United States and the world.\nReschedule your night, and watch/listen to this 1.5 hour @Michael_Yon podcast video instead of what you were going to do.\nby 3 posted onby MtnClimber (For photos of scenery and wildlife, click on my screen name for my FR home page.\nMichael Yon knows his stuff.\nThis is a video by Michael Yon who has covered immigration route at the Darien Gap, foreign and international domestic uprisings,and knows “first-hand” of what he speaks."}, {"id": "39d8a219-8fbd-495e-8cb1-f2b7abfb62bd", "title": "Russia Lipetsk region hit by  massive  drone attack , governor says", "date": "2024-08-09 04:15", "url": "https://gazette.com/news/us-world/russias-lipetsk-region-hit-by-massive-drone-attack-governor-says/article_530fead6-70ae-57af-b443-e738859b9b3a.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "(Reuters) -Russia evacuated people on Friday from parts of its western region of Lipetsk after a \"massive attack\" by Ukrainian drones caused explosions, disrupted power supply and wounded nine people, regional governor Igor Artamonov said.\nA fire had broken out at the air base outside Lipetsk city, the Interfax news agency reported, citing local emergency officials.\nArtamonov said the regional government has cancelled all entertainment events and would provide increased security for other events such as sports.\nRussia's defence ministry said a total of 75 Ukrainian drones have been destroyed overnight over Russia, according to the RIA news agency, most of them over the Belgorod and Lipetsk regions.\nUkrainian authorities have not reported any strikes on the Lipetsk region."}, {"id": "d95fc284-5228-4369-8299-2b9288b157dc", "title": "Oil set for 3 % weekly gain on rising Mideast tensions , better US outlook", "date": "2024-08-09 02:45", "url": "https://economictimes.indiatimes.com/markets/commodities/news/oil-set-for-3-weekly-gain-on-rising-mideast-tensions-better-us-outlook/articleshow/112389604.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "It seems like you're already an ETPrime member withLogin using your ET Prime credentials to enjoy all member benefitsLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."}, {"id": "91b8c65d-ec47-447d-afa7-f71971626a89", "title": "A rainbow of hatred : Adetshina battle for crown that a bridge too far", "date": "2024-08-09 11:15", "url": "https://www.timeslive.co.za/sunday-times-daily/opinion-and-analysis/2024-08-09-a-rainbow-of-hatred-adetshinas-battle-for-crown-thats-a-bridge-too-far/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device."}, {"id": "b7bc7b84-b442-4b4f-a847-d77bffb35da5", "title": "Ukraine launches  massive  drone strike on Russia Lipetsk region , as cross - border attack rages on", "date": "2024-08-09 10:00", "url": "https://www.yahoo.com/news/ukraine-launches-massive-drone-strike-085040198.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A video that surfaced online appears to show bodies on burnt-out Russian military trucks in the country’s southwestern Kursk region, the latest sign that Ukraine’s cross-border assault is probing more deeply and inflicting significant damage on Moscow’s troops.\nSome of the trucks are completely burnt out, while others are undamaged but still appear to contain the bodies of military personnel.\nUkrainian President Volodymyr Zelensky said a rescue operation is underway to free people trapped under the rubble.\nUS officials say they do not believe Ukraine intends to hold Russian territory for the long term.\nRussian authorities help residents during evacuation efforts at a railway station in Oryol, Kursk region, August 9, 2024."}, {"id": "45c321c5-0e3f-478a-8c66-6509252e4901", "title": "Suspected Houthi grenade attack targets ship off Yemen | Nation and World", "date": "2024-08-09 00:30", "url": "https://www.reviewjournal.com/news/nation-and-world/suspected-houthi-rocket-propelled-grenade-attack-targets-ship-off-yemen-officials-say-3120702/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "Navy via AP)DUBAI, United Arab Emirates — A suspected attack by Yemen’s Houthi terrorists targeted a ship Thursday in the strategic Bab el-Mandeb Strait that links the Gulf of Aden to the Red Sea, authorities said.\nThe attack saw a rocket-propelled grenade explode close to the ship, according to the British military’s United Kingdom Maritime Trade Operations center.\nThe Houthis have targeted more than 70 vessels with missiles and drones in a campaign that has killed four sailors.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nAfter the strikes, the Houthis paused their attacks until Saturday, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden."}, {"id": "225a6615-4136-49a2-9820-54038fff1033", "title": "VP pick Tim Walz faced accusations in 2006 of embellishing his military service , which he called slander", "date": "2024-08-09 05:45", "url": "https://kvia.com/your-voice-your-vote/politics/cnn-us-politics/2024/08/08/vp-pick-tim-walz-faced-accusations-in-2006-of-embellishing-his-military-service-which-he-called-slander-2/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "Walz was deployed between 2003 and 2004 to Europe to support Operation Enduring Freedom, but was never deployed to Afghanistan, where the operation occurred.\nCriticism prompts Walz responseIn 2006, the Walz campaign’s description of his service drew pushback in separate letters to the editors.\nOne letter to his local paper said the Walz campaign’s phrasing suggested service in Iraq or Afghanistan.\nIf Walz did not deploy downrange, he should say so.”The letter caused a string of letters in support of Walz.\n“I did 10 months with Operation Enduring Freedom, where, by luck of the draw, I served in Italy."}, {"id": "43869561-dbb5-458f-9cdd-c83625d9d103", "title": "VP pick Tim Walz faced accusations in 2006 of embellishing his military service , which he called slander", "date": "2024-08-09 05:45", "url": "https://kvia.com/your-voice-your-vote/politics/cnn-us-politics/2024/08/08/vp-pick-tim-walz-faced-accusations-in-2006-of-embellishing-his-military-service-which-he-called-slander/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "Walz was deployed between 2003 and 2004 to Europe to support Operation Enduring Freedom, but was never deployed to Afghanistan, where the operation occurred.\nCriticism prompts Walz responseIn 2006, the Walz campaign’s description of his service drew pushback in separate letters to the editors.\nOne letter to his local paper said the Walz campaign’s phrasing suggested service in Iraq or Afghanistan.\nIf Walz did not deploy downrange, he should say so.”The letter caused a string of letters in support of Walz.\n“I did 10 months with Operation Enduring Freedom, where, by luck of the draw, I served in Italy."}, {"id": "f2be7f01-5968-4248-badc-0f8a4bee9692", "title": "Vance Hits Walz Military Record as Questions Continue About His Claims", "date": "2024-08-09 02:15", "url": "https://thenewamerican.com/news/vance-hits-walzs-military-record-as-questions-continue-about-his-claims/", "domain": "thenewamerican.com", "domain_classification": "Unknown", "message": "Vance said it was “shameful” that Walz, as a command sergeant major, didn’t join his unit.\n“I’ve seen the reports on Tim Walz’s military record and he has some explaining to do,” Waltz said over a video in which he explains the problem with Walz’s record.\n“A lot of discussion out there in the veterans community about Governor Tim Walz’s military record.\n“On September 10th, 2005 conditionally promoted Command Sergeant Major Walz was reduced to Master Sergeant,” the letter says.\nLike the Harris campaign, Walz’s biography at his governor’s webpage strongly suggests that he retired as a command sergeant major."}, {"id": "838f7467-689c-409a-a4bb-0872042bcf3f", "title": "Houthi : Battle against Zionist regime at its height after assassinations", "date": "2024-08-09 10:45", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240808-presstv06.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Houthi: Battle against Zionist regime at its height after assassinationsIran Press TVThursday, 08 August 2024 4:53 PMThe leader of Yemen's Ansarullah says the battle against Israel is now at its height after the regime's assassinations of Hamas chief Ismail Haniyeh and Hezbollah commander Fuad Shukr.\n\"The Zionist regime's crime of assassinating Hamas leader Ismail Haniyeh and Hezbollah commander Fuad Shukr has greatly impacted the region's state of affairs,\" Abdul-Malik al-Houthi said on Thursday afternoon.\nThe Ansarullah chief said the recent assassinations have had a significant impact on the entire West Asia.\n\"The horrendous assassination of Haniyeh was met with the absolute cohesion of the Hamas resistance movement.\n\"The Israeli enemy is in a state of fear following recent assassinations of regional resistance leaders,\" he said."}, {"id": "46e883c1-ff4a-4a30-be4d-4066fc058454", "title": "Kursk attack  worsens conflict , dashes hopes for peace talks  ", "date": "2024-08-09 10:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/08/ukraine-240808-globaltimes01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Experts predicted that the attack will undoubtedly exacerbate the situation on the battlefield and dash the hard-won hopes for peace talks that the international community has worked hard to achieve.\nCNN reported that it would \"mark the first incursion of its kind from Ukraine\" in the two-year conflict if the attack is confirmed.\nA state of emergency has been declared in the Kursk region of Russia.\nRussian officials said the incursion resulted in five civilian deaths and 31 injuries, six of whom were children.\n\"With Western voices now calling for negotiations with Russia, Ukraine wants to demonstrate its combat capabilities and determination at this juncture to avoid being quickly abandoned,\" Cui said."}, {"id": "78d2d703-99d2-43d5-9c34-f60abfa7bfaf", "title": "3 Columbia deans resign after being removed from power earlier this summer for  very troubling  antisemitic text messages", "date": "2024-08-09 02:45", "url": "https://us.cnn.com/2024/08/08/us/columbia-deans-resign-antisemitic-texts/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "CNN —Three Columbia University deans who were permanently removed from their posts earlier this summer after the university’s president said they engaged in “very troubling” text messages that “touched on antisemitic tropes” have resigned, a school spokesperson confirmed to CNN on Thursday.\nThe deans, Susan Chang-Kim, Cristen Kromm and Matthew Patashnick, were removed from power in July after their actions during a May 31 panel discussion about Jewish life at an alumni event.\nIn a letter to the university community last month, Columbia President Minouche Shafik said the “senior administrators in Columbia College engaged in very troubling text message exchanges” and committed to holding them responsible.\n“The incident revealed behavior and sentiments that were not only unprofessional, but also, disturbingly touched on ancient antisemitic tropes,” Shafik said in the letter.\nCNN reached out to the deans for comment when they were placed on leave but did not receive a response."}, {"id": "19200b6f-e404-484b-b049-8f75366c2bdf", "title": "Russia says troops are battling to push Ukrainian forces back after cross - border incursion in Kursk", "date": "2024-08-09 00:15", "url": "https://www.thesunchronicle.com/business/russia-says-troops-are-battling-to-push-ukrainian-forces-back-after-cross-border-incursion-in/article_42f2aecc-6bcf-5658-ab35-a19b33fc56ea.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "Russia says troops are battling to push Ukrainian forces back after cross-border incursion in KurskRussia's Defense Ministry says the country's troops are fighting Ukrainian forces in the Kursk region on the third day of one of the largest cross-border incursions of the war"}, {"id": "38405b13-8eb2-4dbe-93be-316c2890e19d", "title": "Three suspected Houthi attacks target a ship off Yemen , authorities say", "date": "2024-08-09 10:45", "url": "https://www.newsday.com/news/nation/yemen-houthi-rebels-red-sea-attacks-israel-hamas-s94567", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Since November, Houthi attacks have disrupted the $1 trillion of goods that flow annually through the region, while also sparking the most intense combat the U.S. Navy has seen since World War II.\nThe UKMTO later reported the incident as well, which happened as the vessel traveled north into the Red Sea.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nAfter the strikes, the Houthis paused their attacks until Saturday, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nCentral Command later said that it destroyed two Houthi anti-ship cruise missiles and one Houthi ground control station, as well as a drone boat in the Red Sea."}, {"id": "78b7049f-e28b-4785-92f3-d9208f793bf5", "title": "Three suspected Houthi attacks target a ship off Yemen , authorities say", "date": "2024-08-09 07:45", "url": "https://www.ksat.com/news/world/2024/08/09/three-suspected-houthi-attacks-target-a-ship-off-yemen-authorities-say/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Recommended VideosSince November, Houthi attacks have disrupted the $1 trillion of goods that flow annually through the region, while also sparking the most intense combat the U.S. Navy has seen since World War II.\nThe UKMTO later reported the incident as well, which happened as the vessel traveled north into the Red Sea.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nAfter the strikes, the Houthis paused their attacks until Saturday, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nCentral Command later said that it destroyed two Houthi anti-ship cruise missiles and one Houthi ground control station, as well as a drone boat in the Red Sea."}, {"id": "fc075575-2805-4183-8e13-b7c067f0401a", "title": "Many Now Seeing Russia As Legitimate Target For Any Operation - Zelensky Office Advisor", "date": "2024-08-09 01:00", "url": "https://menafn.com/1108534460/Many-Now-Seeing-Russia-As-Legitimate-Target-For-Any-Operation-Zelenskys-Office-Advisor", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) A significant part of the international community now considers Russia a legitimate target for any military operation involving any type of weapons.\nThat's according to Mykhailo Podolyak , the advisor to the head of the Ukrainian President's Office, Ukrinform reports.\nThe dog, excuse me, was rightly recognized as mad.\nNow, a significant part of the global community considers Rf a legitimate target for any operations and types of weapons,” the advisor stressed.\nFrench Ministry of Armed Forces believes Ukraine's offensive inregion sees certain successAs Ukrinform reported earlier, Estonian defense expert Rainer Saks said the Ukrainian incursion into Russia's Kursk region may have far-reaching consequences for the Kremlin."}, {"id": "222d808e-c394-471d-b75c-44d092b4135b", "title": "In Ferry to Hong Kong , Casablanca meets The World of Suzie Wong , but cast nearly sinks it", "date": "2024-08-09 04:15", "url": "https://www.scmp.com/lifestyle/entertainment/article/3273567/ferry-hong-kong-casablanca-meets-world-suzie-wong-cast-nearly-sinks-it", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "The story concerns Mark Conrad (Curt Jürgens), a down-on-his-luck drinker and gambler who gets expelled from Hong Kong after a bar fight.\n(From left) Orson Welles, Jeremy Spenser and Curt Jürgens in a still from Ferry to Hong Kong.\nOrson Welles (left) and Curt Jürgens in a still from Ferry to Hong Kong.\nFaced with its own declining imperial power, Britain considered Hong Kong a prized possession, although one that was increasingly vulnerable to communist China.\nWhen we last see her, she is sinking in the South China Sea as Hong Kong life moves on around her."}, {"id": "1aa1f1c8-b797-49db-a37d-41a4b94acad1", "title": "Three suspected Houthi attacks target a ship off Yemen , authorities say", "date": "2024-08-09 07:15", "url": "https://www.news4jax.com/news/world/2024/08/09/three-suspected-houthi-attacks-target-a-ship-off-yemen-authorities-say/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Recommended VideosSince November, Houthi attacks have disrupted the $1 trillion of goods that flow annually through the region, while also sparking the most intense combat the U.S. Navy has seen since World War II.\nThe UKMTO later reported the incident as well, which happened as the vessel traveled north into the Red Sea.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nAfter the strikes, the Houthis paused their attacks until Saturday, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nCentral Command later said that it destroyed two Houthi anti-ship cruise missiles and one Houthi ground control station, as well as a drone boat in the Red Sea."}, {"id": "d67a2b86-9dfe-4e10-ab94-c91227c07ca7", "title": "Three suspected Houthi attacks target a ship off Yemen , authorities say – Winnipeg Free Press", "date": "2024-08-09 07:00", "url": "https://www.winnipegfreepress.com/world/2024/08/09/three-suspected-houthi-attacks-target-a-ship-off-yemen-authorities-say", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Since November, Houthi attacks have disrupted the $1 trillion of goods that flow annually through the region, while also sparking the most intense combat the U.S. Navy has seen since World War II.\nAfter a recent two-week pause, their attacks resumed following the assassination of Hamas leader Ismail Haniyeh in Iran, amid concerns of a wider regional war.\n“The vessel was assessed to be aligned with the Houthi target profile,” Ambrey said.\nAfter the strikes, the Houthis paused their attacks until Saturday, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nCentral Command later said that it destroyed two Houthi anti-ship cruise missiles and one Houthi ground control station, as well as a drone boat in the Red Sea."}, {"id": "f28535e1-bbf6-428b-a9cc-eb5d68bb7498", "title": "Israeli troops launch a new assault into Gaza Khan Younis as mediators push for cease - fire talks", "date": "2024-08-09 16:45", "url": "https://www.startribune.com/israeli-troops-launch-a-new-assault-into-gazas-khan-younis-as-mediators-push-for-cease-fire-talks/600978486", "domain": "startribune.com", "domain_classification": "Unknown", "message": "''Every day there is war.\nEvery day there are rockets.\nThere is no safe place in the eastern area.\nNow, we are displaced in the streets and don't know where to go,'' he said as he carried his son, a piece of cloth on his head to protect him from the heat."}, {"id": "6ec361fb-fe59-4504-813c-207cddc2e0ab", "title": "Setbacks to Counter - Terrorism - Daily Times", "date": "2024-08-09 07:00", "url": "https://dailytimes.com.pk/1215775/setbacks-to-counter-terrorism/", "domain": "dailytimes.com.pk", "domain_classification": "Unknown", "message": "Para 82 says that the Afghan Taliban sometimes acquiesce and at times support the TTP to intensify attacks inside Pakistan primarily targeting military installations.\nThis is how the TTP has been transformed into an umbrella organization for other terrorist groups active regionally.\nThrough the aforementioned three reasons, the report under discussion has mentioned clearly that Pakistan’s counter-terrorism efforts are meeting serious setbacks.\nNevertheless, Pakistan perceives that the US is punishing Pakistan through the Afghan Taliban.\nHitherto, the US has failed to realize that counter-terrorism efforts have made the US and Pakistan conjoined at the hip."}, {"id": "30a6d5da-8f1b-4428-9a88-2f9d4582be81", "title": "Israeli troops in Khan Younis assault as mediators push for ceasefire talks", "date": "2024-08-09 10:45", "url": "https://www.irishexaminer.com/world/arid-41453191.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "Israeli troops have launched a new assault into the southern Gaza city of Khan Younis, targeting Hamas fighters who the military claims still operate there despite repeated offensives.\nThe move comes as American, Qatari and Egyptian mediators renewed their push for Israel and Hamas to reach a ceasefire deal.\nIsraeli evacuation orders triggered yet another exodus of Palestinians from the heavily destroyed eastern districts of Khan Younis, where many had just returned less than two weeks ago — after the Israeli military’s last incursion into the city in July.\nYahya Sinwar, head of Hamas in Gaza (AP)Thousands fled on Thursday, carrying essentials like small gas cylinders, mattresses, tents, backpacks and blankets.\nA Palestinian woman flees the Khan Younis area of the Gaza Strip (Abdel Kareem Hana/AP)Mr Sinwar has already been closely involved in negotiations from behind the scenes."}, {"id": "3f762558-de33-498b-9914-8a70f40017be", "title": "Three suspected Houthi attacks target a ship off Yemen in Red Sea", "date": "2024-08-09 08:30", "url": "https://nypost.com/2024/08/09/world-news/three-suspected-houthi-attacks-target-a-ship-off-yemen-in-red-sea/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Three suspected attacks by Yemen’s Houthi rebels targeted a ship in the strategic Bab el-Mandeb Strait linking the Gulf of Aden to the Red Sea, including one that saw private security guards shoot and destroy a bomb-loaded drone boat, authorities said Friday.\nYemen’s Houthi rebels targeted a ship in the strategic Bab el-Mandeb Strait linking the Gulf of Aden to the Red Sea.\nOther missiles and drones have been either intercepted by a US-led coalition in the Red Sea or splashed down before reaching their targets.\nSince November, Houthi attacks have disrupted the $1 trillion of goods that flow annually through the region, while also sparking the most intense combat the US Navy has seen since World War II.\nCentral Command later said it destroyed two Houthi anti-ship cruise missiles and one Houthi ground control station, as well as a drone boat in the Red Sea."}, {"id": "fe9e9a7f-9c89-4c11-bc7e-9ac96a9f213a", "title": "Two suspected Houthi attacks target a ship off Yemen in Bab el - Mandeb Strait , authorities say", "date": "2024-08-09 05:45", "url": "https://www.bostonglobe.com/2024/08/08/world/two-suspected-houthi-attacks-target-ship-off-yemen-bab-el-mandeb-strait-authorities-say/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — Two suspected attacks by Yemen’s Houthi rebels targeted a ship in the strategic Bab el-Mandeb Strait that links the Gulf of Aden to the Red Sea, authorities said Friday.\n“The vessel was assessed to be aligned with the Houthi target profile,” Ambrey said.\nSince November, Houthi attacks have disrupted the $1 trillion flow of goods passing through the region annually while also sparking the most intense combat the U.S. Navy has seen since World War II.\nAfter the strikes, the Houthis paused their attacks until Saturday, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nCentral Command later said it destroyed two Houthi anti-ship cruise missiles and one Houthi ground control station, as well as a drone boat in the Red Sea."}, {"id": "37152a34-bc5a-4e0b-8a93-c023fedb00d8", "title": "Russian attack on Ukrainian supermarket kills 14 , officials say", "date": "2024-08-09 18:45", "url": "https://www.aljazeera.com/news/2024/8/9/russian-attack-on-ukrainian-supermarket-kills-14-officials-say", "domain": "aljazeera.com", "domain_classification": "International", "message": "Zelenskyy says Russia will be ‘held accountable for this terror’ as Ukrainian troops push on with Kursk assault.\nFriday’s attack is the second of its kind in the town over the last year, with 17 killed when a Russian missile hit an outdoor market last September.\nIn a post on Telegram, Ukrainian President Volodymyr Zelenskyy said Russia would be “held accountable for this terror”.\nMeanwhile, Russian authorities declared a “federal-level” state of emergency in the region of Kursk, four days after Ukrainian forces launched what appears to be their largest cross-border attack on Russian territory since the war began.\nThe Ukrainian military intelligence agency also stated that Ukrainian special forces carried out a raid on Russian-occupied Kinburn Spit on the Black Sea on Friday, destroying six armoured vehicles."}, {"id": "3fed9e49-0148-4c65-b9c0-e175626f68d4", "title": "Russia Sends Reinforcements to Embattled Border Region", "date": "2024-08-09 14:30", "url": "https://www.themoscowtimes.com/2024/08/09/russia-sends-reinforcements-to-embattled-border-region-a85979", "domain": "themoscowtimes.com", "domain_classification": "Unknown", "message": "The Russian military deployed additional forces to fight invading Ukrainian troops in the southwestern Kursk region, Defense Ministry-affiliated media reported Friday.\nThe Zvezda broadcaster shared videos of several army trucks and other military vehicles on a highway crossing into the Kursk region.\n“The marching columns include [BM-21] Grad multiple rocket launcher combat vehicles, tanks transported on trailers, towed artillery, heavy tracked vehicles, as well as Ural and Kamaz vehicles,” Zvezda said.\nCiting the Russian Defense Ministry, the broadcaster added that the columns were moving to “build up forces that are engaged in active combat with Ukrainian militants in the Sudzhansky district.”The independent investigative outlet Agentstvo said it was able to identify through road signs that at least one column had arrived from the neighboring Belgorod region and another from the Russian-occupied Donetsk region of eastern Ukraine."}, {"id": "18830110-cd08-4b0a-a2b3-ece127d1aa1a", "title": "Three suspected Houthi attacks target a ship off Yemen , authorities say", "date": "2024-08-09 08:30", "url": "https://www.wsls.com/news/world/2024/08/09/three-suspected-houthi-attacks-target-a-ship-off-yemen-authorities-say/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "Recommended VideosSince November, Houthi attacks have disrupted the $1 trillion of goods that flow annually through the region, while also sparking the most intense combat the U.S. Navy has seen since World War II.\nThe UKMTO later reported the incident as well, which happened as the vessel traveled north into the Red Sea.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nAfter the strikes, the Houthis paused their attacks until Saturday, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nCentral Command later said that it destroyed two Houthi anti-ship cruise missiles and one Houthi ground control station, as well as a drone boat in the Red Sea."}, {"id": "23adef26-35cb-4119-867a-12a602b94495", "title": "NRL , ONR - Global TechSolutions Provide Marines Littoral Operations Tactical Decision Aid at Modern Day Marine Expo > United States Navy > News Stories", "date": "2024-08-09 16:45", "url": "https://www.navy.mil/Press-Office/News-Stories/Article/3867433/nrl-onr-global-techsolutions-provide-marines-littoral-operations-tactical-decis/", "domain": "navy.mil", "domain_classification": "Unknown", "message": "Here's how you knowAn official website of the United States government"}, {"id": "ad99e223-216a-4693-8a5a-841d894d8b2e", "title": "Israelis anxiously await Iran attack - which is what the regime wants", "date": "2024-08-09 11:15", "url": "https://www.jpost.com/opinion/article-813952", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "As a leader of Hamas, he helped orchestrate the group’s terrorist strategies, culminating in the horrific massacre on October 7.\nYet, ten days following the Mossad’s reported assassination of Haniyeh, a haunting question lingers: Did Israel achieve the outcome it anticipated?\nIn any case, they are hoping that Donald Trump will win the election, a sentiment some ministers have no problem voicing publicly.\nThey believe that perpetual conflict is Israel’s story and that it is the reality we need to come to terms with.\nWhat is the larger plan that Israel wants out of this continued war and how will it chart a course to get there?"}, {"id": "f452df94-59c5-45fd-996f-9e98c5b12b63", "title": "As F - 16s soar over Ukraine , Zelenskyy announces new era of airpower on Air Force Day – The Ukrainian Weekly", "date": "2024-08-09 04:00", "url": "https://subscription.ukrweekly.com/2024/08/as-f-16s-soar-over-ukraine-zelenskyy-announces-new-era-of-airpower-on-air-force-day/", "domain": "subscription.ukrweekly.com", "domain_classification": "Unknown", "message": "We have ensured it,” Mr. Zelenskyy said.\nGradually, step by step, we managed to achieve the result,” Mr. Zelenskyy said in a video released on August 8.\nTraining of Ukrainian pilots began in the late summer of 2023.\nThe Telegraph reported that the Ukrain­ian Armed Forces have already used the F-16s for air defense missions in Ukraine.\nThese will be Ukrainian aircraft that will be used to train our own pilots,” Mr. Holubtsov said."}, {"id": "57e4c919-9c94-42f8-8804-506e7996e4ee", "title": "Russia Lipetsk region under  massive  drone attack , governor says | Russia - Ukraine war News", "date": "2024-08-09 05:00", "url": "https://www.aljazeera.com/news/2024/8/9/russias-lipetsk-region-under-massive-drone-attack-governor-says", "domain": "aljazeera.com", "domain_classification": "International", "message": "Residents ordered to evacuate with fire reported at military airfield in region about 460 kilometres south of Moscow.\nRussia has begun evacuating people from parts of its western region of Lipetsk, after a “massive attack” by Ukrainian drones, regional governor, Igor Artamonov, said.\nWriting on the Telegram messaging app in the early hours of Friday, Artamonov said Lipetsk had “been subjected to a massive UAV [unmanned aerial vehicle] attack”.\nLipetsk lies about 460 kilometres (286 miles) south of Moscow and about 300 kilometres (190 miles) from Ukraine’s eastern border.\nThe Kursk assault appears to be the most significant attack on Russian soil since Moscow ordered its full-scale invasion of Ukraine in February 2022."}, {"id": "5fc947c6-67f0-486c-b0c9-b1a91ae019c0", "title": "Russia - Ukraine fighting continues for 3rd day in Russia Kursk region", "date": "2024-08-09 10:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/08/ukraine-240808-voa01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Russia-Ukraine fighting continues for 3rd day in Russia's Kursk regionBy VOA News August 08, 2024Russian and Ukrainian forces are clashing in Russia's Kursk region for a third consecutive day, Russia's Defense Ministry said Thursday.\nBut a Defense Ministry statement said the Russian military and border guards have blocked Ukrainian forces from advancing deeper into the Kursk region in southwest Russia.\nUkrainian officials have not publicly commented on the fighting in the Kursk region around the town of Sudzha.\nThe incursion into Russia's Kursk region \"is consistent with our policy,\" said Pentagon deputy press secretary Sabrina Singh, while briefing reporters Thursday.\nMeanwhile, in Ukraine's Donetsk region, Russian shelling killed at least four people on Thursday, regional Governor Vadym Filashkin said."}, {"id": "99635730-8186-4ee4-a1ba-0dffb3df38ea", "title": "Paris Olympics : Van Rouwendaal slaked thirst with Seine water on way to gold", "date": "2024-08-09 02:45", "url": "https://www.asiaone.com/world/paris-olympics-van-rouwendaal-slaked-thirst-seine-water-way-gold", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "PARIS — Sharon van Rouwendaal paid little heed to concerns about bacterial infections when she drank a bit of Seine water on the way to Olympic gold on Thursday (Aug 8) in the women's 10km marathon swim along the famous river in Paris.\nI didn't even vomit, normally I vomit out of pain but, yeah, I didn't vomit after the race.\"\nThe battle with nature also left Van Rouwendaal with scratches up and down her right arm as revealed to reporters when she lowered part of her swimsuit.\nSwimming close against the bank on upstream legs to avoid the current, Van Rouwendaal said she was scratched by thorny bushes.\nVan Rouwendaal's toughness and determination no doubt helped the 2016 champion to become the first repeat winner in Olympic marathon swimming."}, {"id": "af1d08a0-42f8-4ef4-86a7-2909497e582b", "title": "Battles rage in Russia as Kremlin struggles to repel surprise Ukraine incursion", "date": "2024-08-09 14:45", "url": "https://www.yahoo.com/news/battles-rage-russia-kremlin-struggles-141252603.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Destroyed Russian military vehicles in Oktyabrskoye village, Kursk.\n“That’s very significant.”Russia’s defense ministry has boasted that Ukrainian troops had been stopped, but has yet to report pushing Kyiv’s forces back across the border.\nIt shared videos showing columns of heavy armor headed toward Kursk, and Russian jets bombing what it said were Ukrainian troops and equipment on Russian territory.\nPutin convened a national security meeting on the attack this week but his forces have struggled to repel the incursion.\nRussia launched an offensive in the neighboring Kharkiv region in May, and Ukrainian officials have warned that Russia could attack Sumy next."}, {"id": "47519e86-715f-4f4f-8eaa-d270fcc2181c", "title": "Ukrainian troops push deeper into Russia as the Kremlin scrambles forces to repel surprise incursion", "date": "2024-08-09 13:45", "url": "https://www.aol.com/ukrainian-troops-push-deeper-russia-121252723.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "For days now, Vladimir Putin’s forces have struggled to put down an incursion into Russian territory by Ukrainian troops, a surprise attack that threatens to upend the war’s status quo and open a new front in a daring challenge to the Kremlin.\nDestroyed Russian military vehicles in Oktyabrskoye village, Kursk.\n“That’s very significant.”Russia’s defense ministry has boasted that Ukrainian troops had been stopped, but has yet to report pushing Kyiv’s forces back across the border.\nIt shared videos showing columns of heavy armor headed toward Kursk, and Russian jets bombing what it said were Ukrainian troops and equipment on Russian territory.\nRussia launched an offensive in the neighboring Kharkiv region in May, and Ukrainian officials have warned that Russia could attack Sumy next."}, {"id": "11fe3af3-5de5-4b10-911b-4f288de4775d", "title": "Israeli troops launch a new assault into Gaza Khan Younis as mediators push for cease - fire talks", "date": "2024-08-09 10:00", "url": "https://www.yahoo.com/news/israeli-troops-launch-assault-gazas-093240621.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A Palestinian youth flees the Khan Younis area of the Gaza Strip, following Israeli military evacuation orders, saying its forces will soon operate there, Thursday, Aug. 8, 2024.\nIn the Gaza Strip, one of the airstrikes in Khan Younis hit the home of the Abu Moamar family, killing a Palestine TV journalist, his wife and three daughters.\nA third airstrike targeted a car in Khan Younis.\nIts new assault in Khan Younis drove more people into the camps and neighboring areas.\nGhazi Abu Daka, one of the evacuees, told the AP that he and his family have been forced to flee Khan Younis four times now."}, {"id": "677766c2-1f96-4b15-be30-638a019b56d3", "title": "Israeli troops launch a new assault into Gaza Khan Younis as mediators push for cease - fire talks", "date": "2024-08-09 11:30", "url": "https://www.aol.com/israeli-troops-launch-assault-gazas-093240220.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "A wave of Israeli airstrikes in the city Friday killed at least 21 Palestinians, medics at the city’s Nasser Hospital said.\nIn the Gaza Strip, one of the airstrikes in Khan Younis hit the home of the Abu Moamar family, killing a Palestine TV journalist, his wife and three daughters.\nA third airstrike targeted a car in Khan Younis.\nIts new assault in Khan Younis drove more people into the camps and neighboring areas.\nGhazi Abu Daka, one of the evacuees, told the AP that he and his family have been forced to flee Khan Younis four times now."}, {"id": "28807117-357e-4857-afdf-1cbccaf4a5ca", "title": "Israeli troops launch a new assault into Gaza Khan Younis as mediators push for cease - fire talks", "date": "2024-08-09 10:45", "url": "https://abcnews.go.com/International/wireStory/israeli-troops-launch-new-assault-gazas-khan-younis-112703956", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A wave of Israeli airstrikes in the city Friday killed at least 21 Palestinians, medics at the city’s Nasser Hospital said.\nIn the Gaza Strip, one of the airstrikes in Khan Younis hit the home of the Abu Moamar family, killing a Palestine TV journalist, his wife and three daughters.\nA third airstrike targeted a car in Khan Younis.\nIts new assault in Khan Younis drove more people into the camps and neighboring areas.\nGhazi Abu Daka, one of the evacuees, told the AP that he and his family have been forced to flee Khan Younis four times now."}, {"id": "77004d19-735f-4f25-9cb3-5ebcb5ebf6df", "title": "Israeli troops launch a new assault into Gaza Khan Younis as mediators push for cease - fire talks", "date": "2024-08-09 10:45", "url": "https://www.ksat.com/news/world/2024/08/09/israeli-troops-launch-a-new-assault-into-gazas-khan-younis-as-mediators-push-for-cease-fire-talks/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "A Palestinian youth flees the Khan Younis area of the Gaza Strip, following Israeli military evacuation orders, saying its forces will soon operate there, Thursday, Aug. 8, 2024.\nIn the Gaza Strip, one of the airstrikes in Khan Younis hit the home of the Abu Moamar family, killing a Palestine TV journalist, his wife and three daughters.\nA third airstrike targeted a car in Khan Younis.\nIts new assault in Khan Younis drove more people into the camps and neighboring areas.\nGhazi Abu Daka, one of the evacuees, told the AP that he and his family have been forced to flee Khan Younis four times now."}]