[{"id": "d1a02ac9-4dc0-46d0-aa0b-cc948f7a02a7", "title": "Debby leaves flooding and property damage in Southeast as more winds expected", "date": "2024-08-08 02:30", "url": "https://www.fox17online.com/weather/debby-leaves-flooding-and-property-damage-in-southeast-as-more-winds-expected", "domain": "fox17online.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby continued over land after the storm system hit the Florida coast, and churned over the U.S. Southeast to the north of Florida, with significant flooding and damage from winds seen in the historic city of Charleston, South Carolina.\nThe region had forecast more strong winds by Wednesday as the storm system lingered over the East Coast.\nRELATED STORY | New tools help better predict storms and alert the public for hurricane seasonTropical Storm Debby battered the southeastern U.S. after the deadly storm swamped areas along the East Coast.\nBy Wednesday, the center of the tropical storm was just off the coast of Georgia, moving toward the South Carolina coast to arrive by Thursday.\nDebby made landfall Monday as a Category 1 hurricane on Florida’s Gulf Coast, then moved on to Georgia."}, {"id": "33b48132-7a20-4ee3-9f39-4aed635a160c", "title": "Tropical Storm Debby stalls , poised to move north in US", "date": "2024-08-08 03:45", "url": "https://www.canberratimes.com.au/story/8723408/tropical-storm-debby-stalls-poised-to-move-north-in-us/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "At least six people have died in Florida and Georgia in the wake of the storm, which made landfall on Florida's Gulf Coast on Monday as a Category 1 hurricane and headed northeast.\nIt is expected to next menace the Southeastern and mid-Atlantic coasts for days."}, {"id": "e427d1c5-cfac-4efc-b38f-13af2ef712b9", "title": "DC , Maryland prepare for Tropical Storm Debby", "date": "2024-08-08 01:30", "url": "https://www.yahoo.com/news/dc-maryland-prepare-tropical-storm-225251863.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "WASHINGTON (DC News Now) — In D.C., preparations for the remnants of Tropical Storm Debby are underway.\nThe District’s Emergency Operations Center will be staffed over the next few days to respond.\nWest Virginia emergency crews on alert as Tropical Storm Debby approachesD.C.’s Emergency Operations Center is gearing up for a potentially dangerous storm Thursday night into Friday.\nTropical Storm Debby heading towards Virginia: Here’s how drivers can stay safeThe county has flood sensors near certain roads to alert drivers.\nFor the latest news, weather, sports, and streaming video, head to DC News Now | Washington, DC."}, {"id": "01c7987f-3214-41e8-9ad1-af1acd53b222", "title": "Tropical Storm Debby track shifts west", "date": "2024-08-08 01:15", "url": "https://www.unionleader.com/news/weather/tropical-storm-debby-track-shifts-west/article_fe9e78e4-550a-11ef-9ff9-37b0f1eec9d0.html", "domain": "unionleader.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "43bad07b-3104-4186-a6be-577efa7b9cf9", "title": "Tropical Storm Debby moves up East Coast as flood threat continues for Carolinas", "date": "2024-08-08 01:30", "url": "https://www.fox9.com/news/tropical-storm-debby-rain-carolinas-heads-north", "domain": "fox9.com", "domain_classification": "Unknown", "message": "The BriefTropical Storm Debby is moving up the East Coast, bringing heavy rain to areas as far as the Great Lakes and New Jersey.\nThe center of the storm was over the Atlantic Ocean near Charleston, South Carolina, on Wednesday afternoon.\nFILE-Homes sit on a flooded street due to Tropical Storm Debby on August 6, 2024 in Charleston, South Carolina.\nDebby could make a second landfall in either North Carolina or South Carolina, expected late Wednesday or early Thursday.\n(Credit: ExpandTropical Storm Warnings are still in effect for the South Carolina and southeastern North Carolina coasts."}, {"id": "55f405e9-3a9f-4e30-874f-d835cdbbbcea", "title": "Tropical Storm Debby moves up East Coast as flood threat continues for Carolinas", "date": "2024-08-08 00:00", "url": "https://www.fox26houston.com/news/tropical-storm-debby-rain-carolinas-heads-north", "domain": "fox26houston.com", "domain_classification": "Unknown", "message": "The BriefTropical Storm Debby is moving up the East Coast, bringing heavy rain to areas as far as the Great Lakes and New Jersey.\nThe center of the storm was over the Atlantic Ocean near Charleston, South Carolina, on Wednesday afternoon.\nFILE-Homes sit on a flooded street due to Tropical Storm Debby on August 6, 2024 in Charleston, South Carolina.\nDebby could make a second landfall in either North Carolina or South Carolina, expected late Wednesday or early Thursday.\n(Credit: ExpandTropical Storm Warnings are still in effect for the South Carolina and southeastern North Carolina coasts."}, {"id": "628f6cb3-281e-425a-9c43-5aa59bd8a733", "title": "Debby leaves flooding and property damage in Southeast as more winds expected", "date": "2024-08-08 01:15", "url": "https://www.kjrh.com/weather/debby-leaves-flooding-and-property-damage-in-southeast-as-more-winds-expected", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby continued over land after the storm system hit the Florida coast, and churned over the U.S. Southeast to the north of Florida, with significant flooding and damage from winds seen in the historic city of Charleston, South Carolina.\nThe region had forecast more strong winds by Wednesday as the storm system lingered over the East Coast.\nRELATED STORY | New tools help better predict storms and alert the public for hurricane seasonTropical Storm Debby battered the southeastern U.S. after the deadly storm swamped areas along the East Coast.\nBy Wednesday, the center of the tropical storm was just off the coast of Georgia, moving toward the South Carolina coast to arrive by Thursday.\nDebby made landfall Monday as a Category 1 hurricane on Florida’s Gulf Coast, then moved on to Georgia."}, {"id": "89f07c38-0101-4b11-9fcb-2a5d10207b3f", "title": "Tropical Storm Debby path : Storm heading north", "date": "2024-08-08 00:45", "url": "https://www.ctvnews.ca/climate-and-environment/tropical-storm-debby-doles-out-repeat-deluges-for-weather-weary-residents-1.6991347", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "The National Hurricane Center warned that isolated areas could see up to 25 inches (64 centimetres) of rain from Debby.\nIn South Carolina, Gov.\nThe centre of Debby was over the Atlantic on Wednesday evening, about 40 miles (65 kilometres) east-southeast of Charleston, the National Hurricane Center said.\nIn Charleston, South Carolina, the Brown Dog Deli closed early Monday and couldn't open Tuesday due to a curfew decreed by local officials.\n------Collins reported from Columbia, South Carolina."}, {"id": "271c67e5-fa3f-48f9-895e-ba3db1df0133", "title": "New Update - Debby Most Intense Rainfall Still Ahead : Here When Storm Will Affect Northeast", "date": "2024-08-08 03:45", "url": "https://dailyvoice.com/new-york/newrochelle/hurricane-debby-makes-landfall-along-florida-coast-latest-projected-track-timing/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "Landfall was around 7 a.m. Monday, Aug. 5 about 70 miles southeast of Tallahassee, the National Hurricane Center said.\nIt was downgraded to a tropical storm shortly thereafter as it hit Florida's Gulf Coast with flooding rain, damaging winds, and storm surge.\nThe slow-moving system is expected to affect the Northeast later this week, especially southern New England and potentially parts of Long Island.\nIn the first image above, areas that will experience some impacts are marked in yellow.\nDebby was upgraded from a tropical storm to a hurricane at about 11 p.m. Sunday, Aug. 4."}, {"id": "67f9471c-2cb2-4c7d-8cd7-e407f8bd72f8", "title": "Restaurants in Beaufort prepare for Tropical Storm Debby", "date": "2024-08-08 03:00", "url": "https://www.witn.com/2024/08/08/restaurants-beaufort-prepare-tropical-storm-debby/", "domain": "witn.com", "domain_classification": "Unknown", "message": "BEAUFORT, N.C. (WITN) - Tropical Storm Debby is inching closer to eastern Carolina, and restaurants across the area are preparing for the impact.\nAround Beaufort, tables and chairs were seen stacked as the town braces for Debby.\nCiara Heuser recently moved to the area and says the restaurant she works at will take the storm day by day.\n“We are one of the higher restaurants,” said Front Street Grill at Saltwater general manager Shannon Piner.\nTropical storms are something Piner says she is used to, which is why safety is top priority."}, {"id": "51741666-786a-4b62-9879-b500d283bfc0", "title": "Water district  takes dam safety very seriously  even in wake of  small earthquake  – St George News", "date": "2024-08-08 02:15", "url": "https://www.stgeorgeutah.com/news/archive/2024/08/07/mgk-water-district-takes-dam-safety-very-seriously-even-in-wake-of-small-earthquake/", "domain": "stgeorgeutah.com", "domain_classification": "Unknown", "message": "Jessop and others quickly checked the dams at the Kolob, Sand Hollow, Quail Creek, Ivins and Gunlock reservoirs for any potential problems.\nThe water district also works closely with engineers and the state’s own dam safety program, he said.\nOver 800 dams in Utah are monitored and inspected by the Division of Water Rights’ Dam Safety Section while the 50 federal dams in the state are overseen by the Bureau of Reclamation.\nBoth the state and federal agencies have standards for dam construction that include taking seismic, or earthquake, potential into account.\nZach Renstorm, the general manager of the county water district, praised the swift response of Jessop and others who made sure the dams weren’t affected by the earthquake."}, {"id": "4810c6ba-ccbf-4cde-842b-fd18f4e47daf", "title": "New York Residents Warned To Prepare For Tropical Storm Debby", "date": "2024-08-08 03:45", "url": "https://hudsonvalleycountry.com/ixp/854/p/update-new-york-residents-warned-to-prepare-for-tropical-storm-debby/", "domain": "hudsonvalleycountry.com", "domain_classification": "Unknown", "message": "Tropical Storm Debby is making its way to New York State, forcing Empire State officials to warn New Yorkers to prepare.\nIt's been downgraded to a Tropical Storm but is expected to break rainfall records in both Georgia and South Carolina.\nHochul notes Tropical Storm Debby will hit later in the week, but right now there's a flood watch in effect for many parts of the state.\nFor all the news that the Hudson Valley is sharing make sure to follow Hudson Valley Post on Facebook, download the Hudson Valley Post Mobile\"Rain could fall at rates up to two inches per hour with local rainfall rates up to three inches at times.\nThen, Empire State residents have to worry about Tropical Storm Debby."}, {"id": "8087e2e6-f068-45da-a364-b11d469883d7", "title": "Tropical Storm Debby doles out repeat deluges for weather - weary residents", "date": "2024-08-08 04:15", "url": "https://www.live5news.com/2024/08/07/tropical-storm-debby-swirls-over-atlantic-expected-again-douse-carolinas-before-moving-north/", "domain": "live5news.com", "domain_classification": "Unknown", "message": "A few doors down, Charles Grainger was cleaning up after about 8 inches (20 centimeters) of water got into his home.\nIt’s part of living on the creek.”The National Hurricane Center warned that isolated areas could see up to 25 inches (64 centimeters) of rain from Debby.\nMoisture from the tropical storm strengthened another system Tuesday evening, which caused strong thunderstorms, according to National Weather Service meteorologist Scott Kleebauer.\nTropical Storm Debby strengthened over the Atlantic Ocean.\nAt least six people have died due to the storm, five of them in traffic accidents or from fallen trees."}, {"id": "b341996a-5604-4d32-8266-30c47a430d91", "title": "Tropical rains flood homes in an inland Georgia neighborhood for the second time since 2016", "date": "2024-08-08 00:15", "url": "https://www.clickondetroit.com/news/national/2024/08/07/tropical-rains-flood-homes-in-an-inland-georgia-neighborhood-for-the-second-time-since-2016/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "In October 2016, heavy rain from Hurricane Matthew overwhelmed a nearby canal and flooded several of the same homes.\nSome low-lying neighborhoods flooded, including the homes on Tappan Zee Drive.\nHe didn't live on the street when Matthew struck in 2016, but said the street had flooded during a heavy rainstorm in 2020.\nBefore Debby arrived, soaking rains last filled the street in February, but not enough to damage any homes, said Jim Bartley, who also lives on Tappan Zee Drives.\nBut he also doesn't want to sell, like many of the street's homeowners who saw flood damage from the 2016 hurricane."}, {"id": "418a5dee-1640-4203-bd7b-236dc1a4ca1a", "title": "Charlotte gears up for storm : Hardware stores see surge , county Monitors water levels", "date": "2024-08-08 03:30", "url": "https://www.wbtv.com/2024/08/08/charlotte-gears-up-storm-hardware-stores-see-surge-county-monitors-water-levels/", "domain": "wbtv.com", "domain_classification": "Unknown", "message": "CHARLOTTE, N.C. (WBTV) - Charlotte residents are preparing for the approaching storm as local groups work to ensure they’re ready to respond.\nTim Trautman, the Mecklenburg County Stormwater Program Manager, highlighted a network of sensors and cameras monitoring water levels in real-time.\nThese systems become crucial during heavy rainfall events, alerting authorities to areas at risk of overflowing creeks and subsequent road closures.\nTrautman warned that last week’s storms brought water levels halfway up the banks of some creeks, raising concerns about potential flooding with the expected rainfall.\n“They communicate messages to our staff as well as our emergency managers, so that they can decide where to deploy resources.”Local hardware stores are experiencing a surge in storm preparation supplies."}, {"id": "61022ce2-dffd-4c4b-9d51-4144a54f9d91", "title": "Tropical rains flood homes in an inland Georgia neighborhood for the second time since 2016", "date": "2024-08-08 00:00", "url": "https://www.clickorlando.com/news/national/2024/08/07/tropical-rains-flood-homes-in-an-inland-georgia-neighborhood-for-the-second-time-since-2016/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "In October 2016, heavy rain from Hurricane Matthew overwhelmed a nearby canal and flooded several of the same homes.\nSome low-lying neighborhoods flooded, including the homes on Tappan Zee Drive.\nHe didn't live on the street when Matthew struck in 2016, but said the street had flooded during a heavy rainstorm in 2020.\nBefore Debby arrived, soaking rains last filled the street in February, but not enough to damage any homes, said Jim Bartley, who also lives on Tappan Zee Drives.\nBut he also doesn't want to sell, like many of the street's homeowners who saw flood damage from the 2016 hurricane."}, {"id": "41858983-1b6d-42c8-b544-edd30da5709a", "title": "Colorado wildfires : Evacuations lifted , containment grows", "date": "2024-08-08 02:30", "url": "https://www.denverpost.com/2024/08/07/colorado-wildfire-containment-alexander-mountain-quarry-mandatory-evacuations/", "domain": "denverpost.com", "domain_classification": "Unknown", "message": "Hundreds of Front Range residents returned home this week after increasing containment allowed fire officials to lift mandatory evacuations for the Quarry and Alexander Mountain wildfires.\nFire crews reached 100% containment on the Quarry fire Wednesday afternoon, a swift jump from the 45% containment as of Tuesday morning.\nContainment on the Alexander Mountain fire grew to 91% Wednesday, and Larimer County officials lifted all mandatory evacuation orders and reopened U.S. 34 between Loveland and Estes Park.\nHeavy rain over northern Colorado on Wednesday afternoon prompted National Weather Service forecasters to issue flash flood warnings for the Alexander Mountain and Stone Canyon burn scars.\nIn areas where fire burns hot or long enough, soil develops a water-repellent layer that reacts like rain on pavement, weather officials said."}, {"id": "0be0f164-1953-4a28-a11b-7f7592a93577", "title": "Cleanup begins after Debby : Colorado State University continues to call for an above - average Hurricane Season", "date": "2024-08-08 01:30", "url": "https://www.wuft.org/weather/2024-08-07/cleanup-begins-after-debby-colorado-state-university-continues-to-call-for-an-above-average-hurricane-season", "domain": "wuft.org", "domain_classification": "Unknown", "message": "So far there have been four named tropical systems in the 2024 Atlantic hurricane season, and if Colorado State University´s latest forecast verifies there would still be 19 storms to go.\nDebby, the fourth named storm of the season made landfall in Florida as a hurricane.\nMeteorologists and experts from Colorado State University release a couple of updates throughout the hurricane season.\nThe latest forecast is the last one of this season and will release a verification of this forecast in November 2024.\nThe latest forecast knocked down the total number of storms by 2 but kept the same for the hurricanes and major hurricanes that could form."}, {"id": "f6f8db52-e340-4a30-b520-5dad9f02b450", "title": "Cleanup begins after Debby : Colorado State University continues to call for an above - average hurricane season", "date": "2024-08-08 00:45", "url": "https://news.wgcu.org/hurricane/2024-08-07/cleanup-begins-after-debby-colorado-state-university-continues-to-call-for-an-above-average-hurricaneseason", "domain": "news.wgcu.org", "domain_classification": "Unknown", "message": "So far there have been four named tropical systems in the 2024 Atlantic hurricane season, and if Colorado State University´s latest forecast verifies there would still be 19 storms to go.\nDebby, the fourth named storm of the season made landfall in Florida as a hurricane.\nMeteorologists and experts from Colorado State University release a couple of updates throughout the hurricane season.\nThe latest forecast is the last one of this season and will release a verification of this forecast in November 2024.\nThe latest forecast knocked down the total number of storms by 2 but kept the same for the hurricanes and major hurricanes that could form."}, {"id": "e5315fe4-21f9-4592-8a4e-64c4fdd83b0e", "title": "Light earthquake 4 mag , Bonin Islands , Japan region", "date": "2024-08-08 01:15", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-4-mag-bonin-islands-japan-region-4/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4 (ml/mb) has occurred on Saturday, Bonin Islands, Japan region (0 miles).\nExact time and date of earthquake 13/07/24 / 2024-07-13 18:51:45 / July 13, 2024 @ 6:51 pm UTC/GMT.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us6000nexi.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: Bonin Islands, Japan region."}, {"id": "569396a4-2f63-4e1e-805b-99594cf2915c", "title": "Light earthquake , 4 . 4 mag was detected near southern East Pacific Rise", "date": "2024-08-08 01:15", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-4-4-mag-was-detected-near-southern-east-pacific-rise/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.4 (ml/mb) strikes southern East Pacific Rise (0 miles) on Wednesday.\nEvent ids that are associated to the earthquake: us6000nink.\nId of event: us6000nink.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: southern East Pacific Rise."}, {"id": "a18230cf-db17-4f93-aa91-a6119cd3885d", "title": "Light earthquake , 4 . 9 mag was detected near Longyearbyen in Svalbard and Jan Mayen", "date": "2024-08-08 01:15", "url": "https://www.earthquakenewstoday.com/2024/08/07/light-earthquake-4-9-mag-was-detected-near-longyearbyen-in-svalbard-and-jan-mayen-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.9 (ml/mb) has struck on Tuesday, 253 km SW of Longyearbyen, Svalbard and Jan Mayen (157 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, longitude 7.6355 East, latitude 76.7521 North, depth = 10 km.\nThe earthquake was roughly at a depth of 10 km (6 miles).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 253 km SW of Longyearbyen, Svalbard and Jan Mayen."}, {"id": "de43ea03-be09-424d-b2b3-d42d0c78fc8d", "title": "Baldwin EMC crews return home after two days of repairing storm damage in Florida", "date": "2024-08-08 00:00", "url": "https://www.yahoo.com/news/baldwin-emc-crews-return-home-214040116.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "BALDWIN COUNTY, Ala. (WKRG) — Crews from Baldwin EMC returned home on Wednesday afternoon after heading to Florida to assist with power outages from what was once Hurricane Debby.\nTalquin Electric Cooperative requested help restoring electricity to about 21,000 homes in Quincy, Fla. after the storm came through the area.\nUPDATE: Both suspects in deadly Grand Bay shooting now in custody; victim identifiedHowever, in Quincy, flooding wasn’t the issue — it was the tree damage caused by the storm.\nKnocking down power lines and blocking busy roads, fallen trees were responsible for many of the power outages.\nThat’s mainly what caused the outages in our area that we were at,” Baldwin EMC Journeyman Lineman Kenny Foley said."}, {"id": "43ca2a6f-9f18-418c-ae7a-93128c10846f", "title": "Tropical Storm Debby live updates : More flooding expected as storm nears 2nd landfall", "date": "2024-08-08 00:15", "url": "https://www.knzr.com/syndicated-article/?id=1577997", "domain": "knzr.com", "domain_classification": "Unknown", "message": "Debby is expected to remain a tropical storm into Thursday, when it’s forecast to make a second landfall in South Carolina.\nDebby is slowly moving eastward offshoreTropical Storm Debby is slowly moving eastward offshore the coasts of Georgia and South Carolina.\nSouth Carolina braces for severe floodingThe threat of severe flooding is very high across South Carolina with Tropical Storm Debby “creeping across our state,” South Carolina Gov.\nTropical Storm Debby slowing down as it moves across USTropical Storm Debby continues to weaken and slow down in forward speed as the center moves near the Florida-Georgia state line as of 5 p.m.\nTropical Storm Debby nearing hurricane strength at 70 mphWhile still a tropical storm, Debby is nearing hurricane strength, producing maximum sustained wind speeds up to 70 mph."}]