[{"id": "ef3e5073-1375-42a8-883b-04b17551219c", "title": "Ismail Haniyeh death explained by Hamas and Iranian media", "date": "2024-08-04 04:30", "url": "https://www.jpost.com/middle-east/article-813151", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Following the assassination of former Hamas political leader Ismail Haniyeh, there have been differing reports by Hamas and Iran regarding how he was killed, according to a Saturday report by the Arabic news outlet Al-Araby.\nKhaled Qaddoumi, Hamas's representative in Tehran, said that the assassination occurred through the targeting of Haniyeh's room with an \"aerial projectile,\" citing the explosion's impact on the room.\n\"The appearance of the place after the attack and the condition of the martyred leader Ismail Haniyeh's body clearly indicate that the targeting was by an aerial projectile, whether a missile or a shell.\"\nQaddoumi's remarks were consistent with what Khalil al-Hayya, senior head of Hamas in Gaza, stated in a press conference on Wednesday, hours after Haniyeh's assassination.\nThe Al-Araby report concluded that \"In the absence of a comprehensive official narrative, the execution of Ismail Haniyeh's assassination remains mysterious, despite the known identity of the perpetrators.\""}, {"id": "a10b983c-41a0-4ec2-9a14-f1d5a3c83eec", "title": "President Biden hopes Iran backs down from conflict with Israel - after Hezbollah fires rocket barrage from Lebanon", "date": "2024-08-04 05:30", "url": "https://news.sky.com/story/president-biden-hopes-iran-backs-down-from-conflict-with-israel-after-hezbollah-fires-rocket-barrage-from-lebanon-13190440", "domain": "news.sky.com", "domain_classification": "International", "message": "US President Joe Biden has said he hopes Iran will back down from threats of retaliation against Israel to avert a serious war in the Middle East.\nThe assassination came a day after the Israeli military claimed to have killed a senior commander of Lebanese militant group Hezbollah in Beirut.\nAnalysis:It seems inevitable assassinations will expand war zoneImage: L: Israel's Iron Dome targeting Hezbollah rockets.\nImage: President Joe Biden on 2 August outside the White House before travelling to Delaware, where he spoke to reporters.\nThe group said the barrage was a response to Israeli strikes which killed civilians in two villages in the south of Lebanon."}, {"id": "29b30fc1-60e1-4a7d-9021-16b2b676794a", "title": "Hezbollah fires dozens of rockets at Israel as full - blown war fears explode", "date": "2024-08-04 08:45", "url": "https://www.express.co.uk/news/world/1931818/hezbollah-fires-rockets-israel", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "The IDF said 'most' of the missiles were intercepted by Israel's Iron Dome defence system.\nHezbollah says it's fired “dozens” of rockets from Lebanon amid fears a full-blown war could break out between the two countries.\nIsrael had been bracing for a response from Iran and its proxies after the killing of Hamas’s political leader in Tehran.\nIsraeli media now reports that 50 rockets have been launched from southern Lebanon in the direction of upper Galilee alone.\nDramatic video showed Israel's Iron Dome air defence system being triggered to take out the incoming rockets, with the Israel Defence Forces (IDF) confiming that \"most\" of the 30 \"projectiles\" sent towards Israel on Satuday night were intercepted."}, {"id": "6fc80df3-2ade-4c90-82f9-e164017234b7", "title": "President Biden hopes Iran backs down from conflict with Israel - after Hezbollah fires rocket barrage from Lebanon", "date": "2024-08-04 05:45", "url": "https://www.iwradio.co.uk/news/sky-news/president-biden-hopes-iran-backs-down-from-conflict-with-israel-after-hezbollah-fires-rocket-barrage-from-lebanon/", "domain": "iwradio.co.uk", "domain_classification": "Unknown", "message": "US President Joe Biden has said he hopes Iran will back down from threats of retaliation against Israel to avert a serious war in the Middle East.\nThe assassination came a day after the Israeli military claimed to have killed a senior commander of Lebanese militant group Hezbollah in Beirut.\nHezbollah rockets firedHezbollah fired around 30 rockets from Lebanon towards upper Galilee overnight.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\n(c) Sky News 2024: President Biden hopes Iran backs down from conflict with Israel - after"}, {"id": "38a15f02-a3e9-476d-ac26-92d10738cb92", "title": "Known Details about Haniyeh Assassination : A Bomb was smuggled and planted a few Months ago in the Apartment", "date": "2024-08-04 02:30", "url": "https://sarajevotimes.com/known-details-about-haniyehs-assassination-a-bomb-was-smuggled-and-planted-a-few-months-ago-in-the-apartment/", "domain": "sarajevotimes.com", "domain_classification": "Unknown", "message": "The bomb was hidden in the apartment about two months ago, some sources claimed.\nIranian officials and Hamas stated on Wednesday that Israel was responsible for the assassination, a view shared by several U.S. officials who wished to remain anonymous.\nTwo Iranian officials who described the nature of the assassination said they did not know how or when the explosive was placed in the room.\nIsrael decided to carry out the assassination outside Qatar, where Haniyeh and other senior members of Hamas’s political leadership reside.\nThe deadly explosion early Wednesday shattered windows and brought down part of the wall of the complex, according to photos and statements by Iranian officials."}, {"id": "f39d8ee3-dc15-4d22-8260-163eb7027847", "title": "US President Biden appeals for Iran to stand down on Gaza conflict threat", "date": "2024-08-04 04:30", "url": "https://www.firstpost.com/world/us-president-biden-appeals-for-iran-to-stand-down-on-gaza-conflict-threat-13800617.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "AdvertisementIran and Hamas have blamed Israel for Haniyeh’s killing, and they, together with Hezbollah, have vowed revenge.\nAsked by reporters whether Iran would stand down, Biden said on Saturday in response to a shouted question, ”I hope so.\nViolence in Gaza and West BankViolence continued on Saturday in the Palestinian territories.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nBut Netanyahu said earlier this week that Israel had delivered crushing blows to Iran’s proxies of late, including Hamas and Hezbollah."}, {"id": "a39ef67d-756b-4fd7-9712-1dbf2bedaa7f", "title": "15 Killed In Israeli Airstrike On Gaza School Being Used As Shelter", "date": "2024-08-04 08:45", "url": "https://www.ndtv.com/world-news/15-killed-in-israeli-airstrike-on-gaza-school-being-used-as-shelter-6259495", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "In the Gaza Strip, at least 15 people were killed in the Israeli strike on a school.\nGAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nEgypt's foreign minister, Badr Abdelatty, stressed in a phone call with Iran's acting foreign minister, Ali Bagheri Kani, that recent developments in the region were \"unprecedented, very dangerous\" and threatening to stability, Egypt's government said."}, {"id": "fae06fc0-e6f3-403a-8a47-c1f65fa9cabd", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 05:45", "url": "https://www.channelnewsasia.com/world/israel-hamas-war-fear-conflict-spread-middle-east-retaliation-4525466", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "BEIRUT, Lebanon: Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Palestinian militant group Hamas in Gaza.\nIsrael, accused by Hamas, Iran and others of carrying out the attack, has not directly commented on it.\nIran said on Saturday it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel."}, {"id": "3ffd1182-b201-408c-928a-efdea2c9a585", "title": "Israel And Allies Mobilise Under  Abraham Alliance  As Fears Of Iranian Retaliation Grow", "date": "2024-08-04 06:00", "url": "https://www.news18.com/world/israel-prepares-for-potential-iranian-strike-coordinates-with-allies-us-and-uk-8989524.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "However, he stressed that the unprecedented scale of US support for Israel since October 7 should leave Iran, Hezbollah, and other groups with no doubt about US resolve.\nIsrael, accused by Hamas, Iran and others of carrying out the attack, has not directly commented on it.\nIran said on Saturday it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nSoon after, Hezbollah announced it had fired dozens of Katyusha rockets at the northern Israeli settlement of Beit Hillel."}, {"id": "955c65cb-309b-42c7-9965-34576236d87d", "title": "Haniyeh assassination gambit", "date": "2024-08-04 07:15", "url": "https://tribune.com.pk/story/2485294/haniyeh-assassination-gambit", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Hamas and Iranian officials blamed Israel, but the government of Prime Minister Benjamin Netanyahu did not comment on the assassination.\nThe US has claimed that it was “not involved in, or aware of” the assassination of Ismail Haniyeh, who it had designated as a global terrorist.\nBy killing Haniyeh, Israel has all but killed the hopes for a negotiated end to its brutal military campaign in the Gaza Strip.\nBy targeting Haniyeh in Tehran, Israel sought to humiliate the Islamic Republic and convey a message to the “Axis” leaders that they are not safe even in their safest sanctuary.\nHaniyeh’s assassination in a high security zone in the heart of capital Tehran has already exposed chinks in Iran’s armoury."}, {"id": "a6bc7dd3-a3f7-4c82-9345-d892e9a3fd68", "title": "US urges citizens to leave Lebanon on  any available ticket  - International", "date": "2024-08-04 07:00", "url": "https://www.dailymirror.lk/international/US-urges-citizens-to-leave-Lebanon-on-any-available-ticket/107-288716", "domain": "dailymirror.lk", "domain_classification": "Unknown", "message": "BBC - The US embassy in Beirut has urged its citizens to leave Lebanon on “any ticket available”, amid soaring tensions in the Middle East.\nJordan's Foreign Ministry has also issued advice to its citizens, telling those in Lebanon to leave immediately and warning others not to travel there.\nIt said that several airlines have suspended and cancelled flights, and many have sold out, but “commercial transportation options to leave Lebanon remain available\".\nThe UK said it was sending extra military personnel, consular staff and border force officials to help with any evacuations - but urged UK citizens to leave Lebanon “while commercial flights are running\".\nMany fear Iran’s retaliation on this occasion could take a similar form."}, {"id": "41b77fea-e2a8-43cd-9f1b-731387f8db68", "title": "What Does An All - out War Between Israel And Hezbollah Mean For Middle East ? What Are The Risks ? ", "date": "2024-08-04 07:00", "url": "https://www.news18.com/explainers/what-does-an-all-out-war-between-israel-and-hezbollah-mean-for-middle-east-what-are-the-risks-8989605.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "On Saturday, Hezbollah said it launched dozens of rockets on Moshav Beit Hillel in Israel injuring civilians there, The Times of Israel reported.\nMore than 400 people have been killed in Lebanon and 30 have been killed in Israel, as per a report by The Conversation.\nResident of Haifa in the north of Israel fear Hezbollah attacks, while people living in south Lebanon fear IDF attacks.\nAlso, Israel is the only country in the Middle East with nuclear power, which it does not acknowledge.\nIran could launch missile or armed drone strikes against Israeli military sites or infrastructure."}, {"id": "41f5012c-2954-4046-b348-a04010bf6f72", "title": "Israeli strike on Gaza school sheltering refugees kills 15", "date": "2024-08-04 02:00", "url": "https://www.odt.co.nz/news/world/israeli-strike-gaza-school-sheltering-refugees-kills-15", "domain": "odt.co.nz", "domain_classification": "Unknown", "message": "A Palestinian woman inspects the site of a former school, which was destroyed in an Israeli air strike.\nGAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "3f18743b-3d59-4044-a071-c5894e3fa397", "title": "Israeli strike kills at least 10 Palestinians in Gaza school sheltering displaced , Hamas says", "date": "2024-08-04 01:45", "url": "https://www.moneycontrol.com/news/world/israeli-strike-kills-at-least-10-palestinians-in-gaza-school-sheltering-displaced-hamas-says-12786293.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "associated byFollow us on:Israeli strike kills at least 10 Palestinians in Gaza school sheltering displaced, Hamas says"}, {"id": "1c085c5f-481e-4843-80ec-d0e35c289507", "title": "Israeli strikes kill 15 Palestinians in Gaza school , nine fighters in West Bank", "date": "2024-08-04 06:45", "url": "https://dunyanews.tv/en/World/828535-israeli-strikes-kill-15-palestinians-in-gaza-school-nine-fighters-in-", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Israeli strikes kill 15 Palestinians in Gaza school, nine fighters in West BankWorld World Israeli strikes kill 15 Palestinians in Gaza school, nine fighters in West BankThe school is sheltering displaced people in Gaza City's Sheikh Radwan neighbourhood, the Hamas saidFollow on Published On: Sun, 04 Aug 2024 09:36:31 PKTCAIRO/RAMALLAH (Reuters) – An Israeli airstrike on a school sheltering displaced people in Gaza City killed at least 15 Palestinians on Saturday, hours after two strikes in the occupied West Bank killed nine fighters, including a local Hamas commander, Hamas said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide fighters and manufacture weapons.\nEarlier on Saturday, Israeli strikes in the enclave killed six people in a house in the southern area of Rafah and two others in Gaza City, Gaza health officials said.\nThe Israeli military said its forces had struck and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "bafdc74a-2941-4443-bca5-2e088ed5cf52", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 01:45", "url": "https://www.wbal.com/us-sends-more-fighter-jets-and-ships-to-middle-east-ahead-of-possible-iranian-retaliation/", "domain": "wbal.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region."}, {"id": "20ad26ff-e460-40b7-a159-8040da737705", "title": "Israeli strikes kill 15 Palestinians in Gaza school , nine West Bank militants", "date": "2024-08-04 06:45", "url": "https://www.thestandard.com.hk/breaking-news/section/6/219045/Israeli-strikes-kill-15-Palestinians-in-Gaza-school,-nine-West-Bank-militants", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "Palestinians inspect the site of Israeli strikes on a school sheltering displaced people, amid Israel-Hamas conflict, in Gaza City, August 3, 2024.\n(Reuters)An Israeli airstrike on a school sheltering displaced persons in Gaza City killed at least 15 Palestinians on Saturday, hours after two strikes in the occupied West Bank killed nine militants including a local Hamas commander, Hamas said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "c827e0b8-dd66-4062-b832-e35c768f7f1d", "title": "10 Palestinians killed in Israeli airstrike on school in Gaza", "date": "2024-08-04 05:45", "url": "https://www.thestatesman.com/world/10-palestinians-killed-in-israeli-airstrike-on-school-in-gaza-1503327944.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "At least 10 Palestinians were killed and dozens of others wounded in an Israeli airstrike on a school in Gaza City, said Palestinian security and medical sources.\nAn Israeli jet bombed with one missile a school housing displaced people in Sheikh Radwan neighbourhood, north of Gaza City, Palestinian security sources told Xinhua news agency on Saturday.\nThe bombing killed 10 people and injured dozens of others, and the number of victims is expected to increase, Palestinian medical sources said.\nAdvertisementThe Israel Defense Forces said in a statement on Saturday that it targeted a Hamas command and control complex that was used to produce weapons and was previously used as a school in Gaza City, Xinhua news agency reported.\nThe complex was used as a “hideout for Hamas terrorists, and planning was carried out inside this complex to commit terrorist attacks against Israel,” the statement added."}, {"id": "18348ca0-0ef2-470d-a901-f08073f9c7df", "title": "10 Palestinians Killed In Israeli Airstrike On School In Gaza", "date": "2024-08-04 00:00", "url": "https://menafn.com/1108513929/10-Palestinians-Killed-In-Israeli-Airstrike-On-School-In-Gaza", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Gaza, Aug 4 (IANS) At least 10 Palestinians were killed and dozens of others wounded in an Israeli on a school in Gaza City, said Palestinian security and medical sources.\nAn Israeli jet bombed with one missile a school displaced people in Radwan neighbourhood, north of Gaza City, Palestinian security sources told Xinhua news agency on Saturday.\nThe bombing killed 10 people and dozens of others, and the number of is expected to increase, Palestinian medical sources said.\nThe Israel Defense Forces said in a statement on Saturday that it targeted a Hamas command and control complex that was used to produce weapons and was previously used as a school in Gaza City, Xinhua news agency reported.\nThe complex was used as a \"hideout for Hamas terrorists, and planning was carried out inside this complex to commit terrorist attacks against Israel,\" the statement added."}, {"id": "76b17581-69f9-43d8-99ea-459c6af244aa", "title": "Hezbollah rockets pour into Israel North - The Jerusalem Post", "date": "2024-08-04 03:00", "url": "https://www.jpost.com/breaking-news/article-813144", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Some cities and towns where the sirens were heard included Kiryat Shmona, Metualla, Beit Hillel, HaGoshrim, and Kfar Yuval.\nSocial media footage showed a barrage of rockets crossing into the Upper Galilee from Lebanon in the early hours of Sunday as dozens of rockets were launched at the area.\nIron dome anti-missile system fires interception missiles as rockets fired from Lebanon, as it seen over Kiryat Shmona, March 5, 2024.\nHeightened tensions in the Middle EastThe barrage comes as tension remains high between Israel and Lebanon's Hezbollah after Israel killed Hezbollah's military commander, Fuad Shukr, last week.\nIsrael's strike on Shukr came following a Hezbollah rocket launch last Saturday, which resulted in the deaths of 12 children from the Druze town of Majdal Shams."}, {"id": "ee1f63ba-1c29-4723-8174-81c0554e98fc", "title": "15 Displaced Civilians Killed In Israeli Strike On Gaza School", "date": "2024-08-04 08:45", "url": "https://menafn.com/1108514432/15-Displaced-Civilians-Killed-In-Israeli-Strike-On-Gaza-School", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) An Israeli on a school sheltering displaced persons in Gaza City killed at least 15 Palestinians yesterday, hours after two strikes in the occupied West killed nine, Palestinian resistance movement Hamas said.\nThe Israeli military said the first of two West Bank hit a vehicle in a town near the city of Tulkarm.\nIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City's Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nEarlier yesterday, Israeli strikes in the enclave killed six people in a house in the southern area of Rafah and two others in Gaza City, Gaza health officials said.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials."}, {"id": "c171efc5-f41a-41c6-b30d-976e6a768ef0", "title": "32 Killed As al - Shabab Attacks Somali Beach", "date": "2024-08-04 06:00", "url": "https://leadership.ng/32-killed-as-al-shabab-attacks-somali-beach/", "domain": "leadership.ng", "domain_classification": "Unknown", "message": "At least 32 people have been killed and many more wounded in a suicide bombing and gun attack on a popular beach in Somalia’s capital, Mogadishu, according to officials.\nAl-Shabab, an al-Qaeda-linked armed group, claimed responsibility for the attack on Lido Beach late on Friday via an affiliated radio station.\nThe assault began when a suicide bomber blew himself up at the entrance of Beach View Hotel.\nA witness told The Associated Press news agency in a phone call that he saw an attacker wearing an explosive vest moments before the man “blew himself up next to the Beach View Hotel”.\nMohamud Moalim also said some of his friends who were with him at the hotel were killed, and others were wounded."}, {"id": "74ca6581-1065-4fd1-96ea-64188d8dddeb", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 02:30", "url": "https://www.yahoo.com/news/suspected-missile-attack-yemens-houthi-015345114.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "908152fd-8e7d-4cfa-b98c-15308236df03", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 07:15", "url": "https://finance.yahoo.com/news/suspected-missile-attack-yemens-houthi-015345143.html", "domain": "finance.yahoo.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "969eb87b-e29e-4fa0-83a4-b2092307be48", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship", "date": "2024-08-04 04:30", "url": "https://abcnews.go.com/International/wireStory/suspected-missile-attack-yemens-houthi-rebels-hits-container-112548896", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A suspected missile attack by Yemen’s Houthi rebels struck a container ship traveling through the Gulf of Aden, likely the first assault by the group since Israeli airstrikes targeted themDUBAI, United Arab Emirates -- A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nDetails reported by the two organizations suggested the vessel targeted was the Liberian-flagged container ship Groton, which had left Fujairah in the United Arab Emirates bound for Jeddah, Saudi Arabia.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "9029467c-7e3e-4859-96ae-8935611534ec", "title": "Suspected missile attack by Yemen Houthi strikes container ship ; first assault in 2 weeks – Firstpost", "date": "2024-08-04 02:30", "url": "https://www.firstpost.com/world/suspected-missile-attack-by-yemens-houthi-strikes-container-ship-first-assault-in-two-weeks-13800620.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Reuters FileA suspected missile attack by Yemen’s Houthi rebels struck a container ship travelling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometres (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nOther missiles and drones have been either intercepted by a US-led coalition in the Red Sea or splashed down before reaching their targets.\nMeanwhile Saturday, the US military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "f474bd2d-1e7f-4dc3-8b70-edb01d0f17f9", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in two weeks", "date": "2024-08-04 05:45", "url": "https://www.newindianexpress.com/world/2024/Aug/04/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-two-weeks", "domain": "newindianexpress.com", "domain_classification": "Unknown", "message": "However, it can take the rebels hours or even days before they acknowledge an assault.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or splashed down before reaching their targets.\nThe Houthis also have launched drones and missiles toward Israel, including an attack July 19 that killed one person and wounded 10 others in Tel Aviv.\nIn the time since, there has not been a reported attack on shipping through the Red Sea corridor, which links Asia and the Middle East onto Europe through the Suez Canal."}, {"id": "e8b78f4d-5a1e-4192-97f4-0d18e3522e4f", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 05:45", "url": "https://www.clickondetroit.com/news/world/2024/08/04/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "DUBAI – A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "4423a230-f407-452c-9d40-9e352c225968", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 05:30", "url": "https://www.local10.com/news/world/2024/08/04/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "local10.com", "domain_classification": "Unknown", "message": "DUBAI – A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "d6b3c0b2-e18e-41b7-aed3-1b4a2153e2aa", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 00:45", "url": "https://www.juneesoutherncross.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/?cs=6417", "domain": "juneesoutherncross.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "5bee3f42-f655-4b71-9214-aae842379503", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 00:45", "url": "https://www.juneesoutherncross.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/?cs=6409", "domain": "juneesoutherncross.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "c2fc4269-e4c8-4995-9971-c7258062a08a", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 00:45", "url": "https://www.newcastleherald.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "cd6142fe-8967-4c6b-a2cd-5ec3ca3ba089", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 02:00", "url": "https://www.batemansbaypost.com.au/story/8717809/biden-voices-hope-iran-will-stand-down-but-is-uncertain/?cs=14264", "domain": "batemansbaypost.com.au", "domain_classification": "Unknown", "message": "The Israeli military said the first of two West Bank airstrikes hit a vehicle in a town near the city of Tulkarm, targeting a militant cell it said was on its way to carry out an attack."}, {"id": "d25e1838-624c-456a-802d-e69bb30ac04e", "title": "Middle East conflict : Iran - backed Hezbollah fires  dozen of rockets at Israel", "date": "2024-08-04 02:30", "url": "https://www.telegraph.co.uk/world-news/2024/08/04/israel-iran-hamas-hezbollah-war-latest/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "A Palestinian attacker killed two civilians and wounded two others in a stabbing spree in central Israel on Sunday before being shot dead by police, Israeli authorities said.\nThe stabbings took place during morning rush hour in the city of Holon, just outside Tel Aviv, in three different locations, including a petrol station, bus stop and park.\nA man in his 70s and a woman, 66, were killed and two others have been rushed to hospital, medical officials said.\nThe violence comes after Hezbollah claimed to have launched “dozens” of rockets from Lebanon at Israel overnight.\nIsrael’s military said that its Iron Dome system had intercepted “most” of the 30 “projectiles” and that no one was hurt."}, {"id": "aa77d138-176e-48c7-a82a-f88ef2a1967b", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 05:45", "url": "http://lasvegassun.com/news/2024/aug/03/suspected-missile-attack-by-yemens-houthi-rebels-h/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Suspected missile attack by Yemen’s Houthi rebels hits container ship in first attack in 2 weeksDUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "37151a88-1670-4709-bd4f-b269a64c9cf3", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 05:45", "url": "https://www.wsls.com/news/world/2024/08/04/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "DUBAI – A suspected missile attack by Yemen's Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military's Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas' Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "3e56bb48-1566-4a30-b583-495339dcf69f", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 04:30", "url": "https://www.moneycontrol.com/news/world/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks-12786316.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "associated byFollow us on:Suspected missile attack by Yemen's Houthi rebels hits container ship in first attack in 2 weeks"}, {"id": "5f99bcd0-9d8d-4e3d-aebb-8fd671c1e615", "title": "Fears of Middle East war grow", "date": "2024-08-04 07:00", "url": "https://www.omanobserver.om/article/1157160/world/region/fears-of-middle-east-war-grow", "domain": "omanobserver.om", "domain_classification": "Unknown", "message": "Beirut - Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Hamas in Gaza.\nIsrael, accused by Hamas, Iran and others of carrying out the attack, has not directly commented on it.\nIran said on Saturday it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel."}, {"id": "6d411eae-b1a8-4527-b231-154e322ee1a7", "title": "Biden voices hope Iran will stand down but is uncertain", "date": "2024-08-04 04:30", "url": "https://thesun.my/world/biden-voices-hope-iran-will-stand-down-but-is-uncertain-GK12813720", "domain": "thesun.my", "domain_classification": "Unknown", "message": "WILMINGTON: U.S. President Joe Biden expressed hope Iran would stand down despite its threat to avenge the assassination of Hamas’ leader in Tehran, as fears mounted that Israel’s war against Palestinian militants in Gaza could escalate into a wider Middle East conflict.\nIran and Hamas have blamed Israel for Haniyeh’s killing, and they, together with Hezbollah, have vowed revenge.\nAsked by reporters whether Iran would stand down, Biden said on Saturday in response to a shouted question, “I hope so.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nBut Netanyahu said earlier this week that Israel had delivered crushing blows to Iran’s proxies of late, including Hamas and Hezbollah."}, {"id": "3024b1df-baf7-4c1e-a195-9bbef43a2ed4", "title": "Fears Of Middle East War Grow After Haniyeh Killing", "date": "2024-08-04 08:45", "url": "https://menafn.com/1108514431/Fears-Of-Middle-East-War-Grow-After-Haniyehs-Killing", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Gulf Times) Middle East tensions soared yesterday as Iran and its allies readied their response to the assassination of Hamas's leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Palestinian group Hamas.\nIran said it expects Hezbollah to hit deeper inside Israel and to no longer be confined to military targets.\nWith such talk growing, the Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nThe New York Times, citing unnamed sources, reported that the explosion which killed Haniyeh was a bomb that was covertly smuggled into the guesthouse where he was staying in Tehran two months ago."}, {"id": "1d81134d-0762-4a49-a7e6-ff16bc042030", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks – Winnipeg Free Press", "date": "2024-08-04 03:00", "url": "https://www.winnipegfreepress.com/business/2024/08/03/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen’s Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war.\nIn the time since, Israel has killed at least 39,550 Palestinians in the Gaza Strip and 590 in the Israeli-occupied West Bank, Palestinian health officials say."}, {"id": "6e2b820c-cacd-44e2-bdf3-049a5fd0e767", "title": "Blinken Says U . S . not responsible for Haniyeh killing ; That Too Bad", "date": "2024-08-04 09:00", "url": "https://www.israelnationalnews.com/news/394057", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Secretary of State Antony Blinken denied any American responsibility for the assassination of Hamas political chief Ismail Haniyeh.\nDon't Fear Assassinating TerroristsNor should assassinating terror leaders be something from which the United States shies away.\nIf any explanation is due, it should be whether or not the United States had the intelligence that Israelis did.\nBlinken's statement that the United States was not responsible for Haniyeh's death was truly cringe-worthy, an expression of weakness that further diminishes the United States in the eyes of its enemies.\nThe only unfortunate aspect of Haniyeh's demise was that Israel beat the United States to it."}, {"id": "51b90160-07e8-4980-8017-054920a1016c", "title": "Suspected missile attack by Yemen Houthi rebels hits container ship in first attack in 2 weeks", "date": "2024-08-04 06:00", "url": "https://www.whec.com/business/suspected-missile-attack-by-yemens-houthi-rebels-hits-container-ship-in-first-attack-in-2-weeks/", "domain": "whec.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates (AP) — A suspected missile attack by Yemen’s Houthi rebels struck a container ship traveling through the Gulf of Aden, authorities said Sunday, likely the first assault by the group since Israeli airstrikes targeted them.\nThe attack on Saturday happened some 225 kilometers (140 miles) southeast of Aden in a stretch of the Gulf of Aden that has seen numerous Houthi attacks previously.\nThe rebels have targeted more than 70 vessels by firing missiles and drones in their campaign that have killed four sailors.\nMeanwhile Saturday, the U.S. military’s Central Command said its forces destroyed a Houthi missile and launcher in Yemen.\nHamas’ Oct. 7 attack on Israel, which killed 1,200 people and saw 250 others taken hostage, sparked the war."}, {"id": "cee50f7a-e0ac-4fd9-8b76-fa3138e86700", "title": "Hezbollah Launches Barrage Of Rockets At Israel , Sparks Fears Of War In The Region", "date": "2024-08-04 02:00", "url": "https://menafn.com/1108513957/Hezbollah-Launches-Barrage-Of-Rockets-At-Israel-Sparks-Fears-Of-War-In-The-Region", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Iran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and the Palestinian group Hamas in Gaza.\nIran said on Saturday that it expects Hezbollah to hit deeper inside Israel and no longer be confined to military targets.\nSoon after, Hezbollah announced it had fired dozens of Katyusha rockets at the northern Israeli settlement of Beit Hillel.\nHis death came hours after Israel struck south Beirut, killing Hezbollah military commander Fuad Shukr.\nHezbollah has been exchanging near-daily cross-border fire with Israeli forces since October, saying it is acting in support of Hamas."}, {"id": "09e7f8ec-76c7-4d9c-a943-3ef677d24c06", "title": "Strikes on Gaza kill 12 , stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 08:45", "url": "https://www.voanews.com/a/strikes-on-gaza-kill-12-and-stabbing-in-israel-kills-2-as-fears-of-wider-war-spike/7729191.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "70fea649-83f3-4042-b857-d79eab4b3ec4", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 09:00", "url": "https://www.edp24.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nA separate strike flattened a house in northern Gaza, killing at least eight people, including three children, their parents and their grandmother, according to the ministry.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "660b7072-2665-4b3e-8317-b16cebbb0083", "title": "France calls on citizens in Lebanon to leave  as soon as possible  ", "date": "2024-08-04 08:30", "url": "https://timesofindia.indiatimes.com/world/europe/france-calls-on-citizens-in-lebanon-to-leave-as-soon-as-possible/articleshow/112261774.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "France on Sunday called on its citizens in Lebanon to leave the country \"as soon as possible\" amid fears of all-out war between Israel and Hezbollah and a broader regional conflict.\n\"In a highly volatile security context, we once again call the attention of French nationals, particularly those passing through, to the fact that direct commercial flights and ones with stopovers to France are still available, and we invite them to make their arrangements now to leave Lebanon as soon as possible,\" the foreign ministry said in its travel advice notice for Lebanon.With its call, Paris is following the example of Washington and London, which had recommended their own nationals to leave from Saturday.France estimates that some 23,000 of its citizens live in Lebanon, and last month around 10,000 French citizens were visiting to the country.Sweden also announced the closure of its embassy in Beirut and called on its nationals to leave.On Thursday, the French foreign ministry had updated an information sheet by highlighting the continued availability of commercial flights to France while stopping short of calling on nationals to leave Lebanon.On Sunday, the ministry stressed French nationals were being \"urgently asked\" not to travel to Lebanon as fears of a regional conflagration after Iran and its allies threatened to respond to the assassination ofHamas 's political leader, blamed on Israel.Tehran, along with Hamas and Lebanese-based, Iranian-backed ally Hezbollah, accused Israel of Wednesday killing Ismail Haniyeh .Haniyeh was killed a day after a strike claimed by Israel killed Hezbollah military chief Fouad Chokr near Beirut.Hezbollah said Saturday it had launched dozens of Katyusha rockets at Israel, saying the attack was in response to Israeli attacks on Lebanon.Israeli Prime Minister Benjamin Netanyahu says his country is at \"a very high level\" of preparedness for any scenario -- \"defensive and offensive.\""}, {"id": "0ad51541-2775-40c7-a026-f35d8e8b6b6e", "title": "Strikes on Gaza kill 12 and stabbing in Israel kills 2 as fears of wider war spike", "date": "2024-08-04 08:30", "url": "https://www.theweek.in/wire-updates/international/2024/08/04/fgn13-israel-hamas-war.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' October 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nOver 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "722a8b2d-8169-4822-99a2-8bbd5edb09d6", "title": "Woman in 70s killed , 3 injured in a stabbing attack in Israel", "date": "2024-08-04 07:30", "url": "https://www.firstpost.com/world/woman-in-70s-killed-3-injured-in-a-stabbing-attack-in-israel-13800666.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Israel’s Magen David Adom rescue service later confirmed that the woman had died read moreIsraeli police and medics say a woman in her 70s was killed and three other people were wounded in a stabbing attack in a suburb of Tel Aviv.\nThe police said the attacker was a resident of the West Bank, suggesting that Sunday’s attack was carried out by a Palestinian militant.\nAdvertisementTensions have soared across the region since Hamas’ Oct. 7 attack ignited the war in Gaza last year.\nIsrael’s Magen David Adom rescue service later confirmed that the woman had died.\nIt said a 70-year-old man was in critical condition, a 68-year-old man was in severe condition and a 26-year-old man was in moderate condition."}, {"id": "53e67f91-3cdc-4aab-b05a-941039208286", "title": "Fresh Attack Hit Merchant Vessel Off Yemen", "date": "2024-08-04 01:45", "url": "https://menafn.com/1108513950/Fresh-Attack-Hit-Merchant-Vessel-Off-Yemen", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) SANAA, Aug 4 (NNN-SABA) – A merchant vessel in the Gulf of Aden, off Yemen, was struck by a second attack yesterday, just hours after an earlier attack on the same ship, according to Britain's Maritime Trade Operations (UKMTO).\nThe vessel was sailing 125 nautical miles east of Aden, when the incident occurred, the UKMTO said on social media.\nThe company's security officer reported that, the vessel was hit by a missile.\nHe stated, there was no fire, water ingress, or oil leak, adding that, the vessel is proceeding to its next of call, and authorities are investigating.\nEarlier, the UKMTO reported another attack on the same vessel, quoting the ship's master as saying, an explosion occurred in proximity, causing no damage.– NNN-SABA"}, {"id": "eaae48c1-ea51-4721-abeb-4bcb00afee28", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 01:45", "url": "https://www.wjol.com/syndicated-article/?id=1577376", "domain": "wjol.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region."}, {"id": "e5d59c46-882c-448f-b5a1-700f1b7d1e0e", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 00:30", "url": "https://www.mycentraloregon.com/2024/08/03/us-sends-more-fighter-jets-and-ships-to-middle-east-ahead-of-possible-iranian-retaliation/", "domain": "mycentraloregon.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region."}, {"id": "f3fedf23-4773-466b-9ec5-f0c247ca78f3", "title": "US sends more fighter jets and ships to Middle East ahead of possible Iranian retaliation", "date": "2024-08-04 00:30", "url": "https://www.wlip.com/syndicated-article/?id=1577376", "domain": "wlip.com", "domain_classification": "Unknown", "message": "The United States will also maintain an aircraft carrier presence in the Middle East as Defense Secretary Lloyd Austin ordered the USS Abraham Lincoln to replace the USS Theodore Roosevelt that was on a short-term deployment to the Middle East.\nAustin also ordered the deployment of an additional fighter squadron to the Middle East “reinforcing our defensive air support capability,” the statement said.\n“The Department is also taking steps to increase our readiness to deploy additional land-based ballistic missile defense,” it continued.\nCurrently deployed to the western Pacific, it’s unclear when the Lincoln would arrive in the Middle East to replace the Roosevelt, which is currently in the Gulf of Oman.\nThere are currently two other destroyers in the eastern Mediterranean that are part of a regular mission to provide ballistic missile defense capabilities in that region."}, {"id": "41f6228f-25fc-4d63-aa91-4d98d05833ec", "title": "A woman was killed and 3 others were wounded in a stabbing attack in Israel", "date": "2024-08-04 07:00", "url": "https://abcnews.go.com/International/wireStory/woman-killed-3-wounded-stabbing-attack-israel-112550718", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October.\nThe continuous strikes and counterstrikes have grown in severity in recent months, raising fears of an even more destructive regional war."}, {"id": "e7490cdd-fdbf-4ea8-b368-f06d03c6201f", "title": "A woman was killed and 3 others were wounded in a stabbing attack in Israel", "date": "2024-08-04 06:30", "url": "https://www.ksat.com/news/world/2024/08/04/a-woman-was-killed-and-3-others-were-wounded-in-a-stabbing-attack-in-israel/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "The strike killed several people including a woman and injured others, health officials confirmed.\nTensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nHamas-led militants killed some 1,200 people, mostly civilians, and took around 250 people hostage in their surprise attack into southern Israel last October."}, {"id": "18c9ebfc-5043-4cc7-9447-9f4b1a125378", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 08:45", "url": "https://www.swindonadvertiser.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "swindonadvertiser.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nA separate strike flattened a house in northern Gaza, killing at least eight people, including three children, their parents and their grandmother, according to the ministry.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "c7d4842d-c5a7-40c8-8146-2b5111117bd0", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 07:15", "url": "https://punchng.com/fears-of-middle-east-war-grow-after-hamas-leaders-killing/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas’s political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and Palestinian militant group Hamas in Gaza.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nHis death came hours after Israel struck south Beirut, killing Hezbollah military commander Fuad Shukr.\nHezbollah has been exchanging near-daily cross-border fire with Israeli forces since October, saying it is acting in support of Hamas."}, {"id": "8c4d0da0-aee6-4cc6-99c8-5d331767cb99", "title": "Israeli strikes kill 15 Palestinians in Gaza school , nine West Bank militants", "date": "2024-08-04 01:30", "url": "https://www.timesofearth.com/2024/08/04/israeli-strikes-kill-15-palestinians-in-gaza-school-nine-west-bank-militants/", "domain": "timesofearth.com", "domain_classification": "Unknown", "message": "GAZA STRIKESIn the Gaza Strip, at least 15 people were killed in the Israeli strike on a school sheltering displaced persons in Gaza City’s Sheikh Radwan neighbourhood, the Hamas run-government media office said.\nThe Israeli military said the school was being used as a command centre for Hamas, to hide militants and manufacture weapons.\nThe Israeli military said its forces had struck militants and destroyed Hamas infrastructure in Rafah and elsewhere in the enclave.\nAt least 39,550 Palestinians have been killed in the Israeli military campaign in Gaza, according to Gaza health officials.\nEgypt’s foreign minister, Badr Abdelatty, stressed in a phone call with Iran’s acting foreign minister, Ali Bagheri Kani, that recent developments in the region were “unprecedented, very dangerous” and threatening to stability, Egypt’s government said."}, {"id": "b51cb36d-f51f-4272-a620-f13058fb27b0", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 00:30", "url": "https://www.gjsentinel.com/news/national/fears-of-middle-east-war-grow-after-hamas-leaders-killing/article_2f7df98d-542b-58a9-b9d6-a9f514c0bc5d.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "An Israeli Navy corvette patrols along the coast of the northern port city of Haifa, as Iran said it expects Lebanon's Hezbollah movement to hit deeper inside Israel"}, {"id": "b48860ba-5f35-4a2f-9cfa-b88897aac33d", "title": "Fears of Middle East war grow after Hamas leader killing", "date": "2024-08-04 07:15", "url": "https://timesofmalta.com/article/fears-middle-east-war-grow-hamas-leader-killing.1096297", "domain": "timesofmalta.com", "domain_classification": "Unknown", "message": "Middle East tensions soared as Iran and its allies readied their response to the assassination of Hamas's political leader, blamed on Israel, spurring fears of a regional war.\nIran-backed groups from Lebanon, Yemen, Iraq and Syria have already been drawn into the nearly 10-month war between Israel and the Palestinian militant group Hamas in Gaza.\nThe Pentagon said it was bolstering its military presence in the Middle East to protect US personnel and defend Israel.\nHis death came hours after Israel struck south Beirut, killing Hezbollah military commander Fuad Shukr.\nHezbollah has been exchanging near-daily cross-border fire with Israeli forces since October, saying it is acting in support of Hamas."}, {"id": "51a1dd8c-8ab9-4710-8535-fa3e1e4ac602", "title": "Twelve dead in Israeli air strikes on Gaza after Tel Aviv stabbing", "date": "2024-08-04 08:30", "url": "https://www.oxfordmail.co.uk/news/national/24496249.twelve-dead-israeli-air-strikes-gaza-tel-aviv-stabbing/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nA woman in her 70s and an 80-year-old man were killed in the stabbing attack, according to Israel’s Magen David Adom rescue service and a nearby hospital, and two other men were injured.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas’s October 7 attack into Israel.\nA separate strike flattened a house in northern Gaza, killing at least eight people, including three children, their parents and their grandmother, according to the ministry.\nMore than 590 Palestinians have been killed by Israeli fire in the occupied West Bank since the start of the war in Gaza, according to the Palestinian Health Ministry."}, {"id": "6ef63f22-020d-4dca-9182-07d551790427", "title": "Iran Revolutionary Guards say Hamas leader Ismail Haniyeh was killed by US - backed Israel ; Vow revenge", "date": "2024-08-04 06:00", "url": "https://www.businessinsider.in/international/news/irans-revolutionary-guards-say-hamas-leader-ismail-haniyeh-was-killed-by-us-backed-israel-vow-revenge/articleshow/112258499.cms", "domain": "businessinsider.in", "domain_classification": "Unknown", "message": "Tehran [Iran], August 4 (ANI): Iran's Revolutionary Guards (IRGC) have said that Hamas leader Ismail Haniyeh was killed by Israel using a short-range projectile with a warhead and plans to take revenge \"at the appropriate time.\nThe Hamas leader and his bodyguard were killed in an Iranian government guest house in Tehran in the early hours of July 31.\nIsrael, which is at war with Hamas in the Gaza Strip, has neither acknowledged nor denied killing Haniyeh.\nEarlier on Wednesday, he also ordered Iran to strike Israel directly, in retaliation for the killing of Hamas leader.\nThey also discussed Iran's call for an extraordinary meeting of the Organization of Islamic Cooperation (OIC) member states over the assassination of the Hamas leader, IRNA reported."}, {"id": "5959c3eb-a424-463e-a338-86b6e6a65289", "title": "This Week in Explainers : Why more and more people are ditching fast food ( It not health ) – Firstpost", "date": "2024-08-04 04:30", "url": "https://www.firstpost.com/explainers/this-week-in-explainers-why-more-and-more-people-are-ditching-fast-food-its-not-health-13800184.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Amid news of an assassination, regional tensions, and a historic prisoner swap, a story that caught the attention of readers is one on the fast food industry.\nBut the region is on edge once again after the assassination of Hamas political leader Ismail Haniyeh.\nIn the age of heightened geopolitical tensions, the Russia and West carried out a historic prisoner swap deal.\nIt’s the biggest prisoner swap between Russia and Western countries since the Cold War.\nReporter Evan Gershkovich greets his colleagues following his release as part of a 24-person prisoner swap between Russia and the United States on 1 August."}, {"id": "d1c06712-09b7-454f-989d-ade8bd7b1246", "title": "Iran says Hamas chief killed by  short - range projectile  ", "date": "2024-08-04 05:45", "url": "https://www.thestatesman.com/world/iran-says-hamas-chief-killed-by-short-range-projectile-1503327940.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "Iran’s Islamic Revolution Guards Corps (IRGC) has said that Hamas Politburo Chief Ismail Haniyeh was assassinated by a “short-range projectile loaded with an almost 7-kg warhead”.\n“Given the conducted investigations, the terrorist operation has been carried out through firing from outside the guests’ residence a short-range projectile loaded with an almost 7 kg warhead, causing an intense explosion,” the IRGC said on Saturday in its third statement about Haniyeh’s assassination in an alleged Israeli attack in the Iranian capital Tehran, according to the armed force’s official news outlet Sepah News.\nThe statement added the “terrorist” attack had been designed and carried out by Israel with the US government’s support, Xinhua news agency reported.\nAdvertisementThe IRGC stressed that “the revenge for Haniyeh’s blood will be definite,” adding the “adventurist and terrorist” Israel would receive a “decisive response to this crime, which is a harsh punishment, at the appropriate time and place and with the appropriate quality”.\nHaniyeh, who had been invited to attend the swearing-in ceremony of Iranian President Masoud Pezeshkian on Tuesday, was killed along with his bodyguard early Wednesday when their residence in Tehran was hit."}, {"id": "0d7ac80c-b779-4ad5-a6f1-94bdfb8abc9e", "title": "A woman was killed and 3 others were wounded in a stabbing attack in Israel | iNFOnews", "date": "2024-08-04 07:30", "url": "https://infotel.ca/newsitem/ml-israel-palestinians/cp865066014", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "Tensions have soared following nearly 10 months of war in Gaza and the killing of two senior militants in separate strikes in Lebanon and Iran last week.\nThose killings brought threats of revenge from Iran and its allies and raised fears of an even more destructive regional war.\nBoth were linked to the ongoing war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nThe continuous strikes and counterstrikes have grown in severity in recent months, raising fears of an even more destructive regional war.\nIsrael captured the West Bank, Gaza and east Jerusalem in the 1967 Mideast war, and the Palestinians want all three territories for their future state."}, {"id": "a1ec329f-03ad-48d8-98d6-0fd03fead3d3", "title": "US Introducing F - 22 Raptors to Challenge Iran Terror Axis in the Middle East | The Jewish Press - JewishPress . com | David Israel | 29 Tammuz 5784 – Sunday , August 4 , 2024", "date": "2024-08-04 07:00", "url": "https://www.jewishpress.com/news/us-news/us-introducing-f-22-raptors-to-challenge-iran-terror-axis-in-the-middle-east/2024/08/04/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: Air Force Tech.\nAnthony NelsonOn Friday, Defense Secretary Lloyd J. Austin III ordered an increase in military presence in the Middle East.\nThe Pentagon announced that additional combat aircraft and missile-equipped warships will be deployed to the region.\nEven with the arrival of the more recent F-35 Lightning II, the F-22 Raptor continues to be a dominant force in air-superiority missions.\nIts cutting-edge sensors and robust combat capabilities have maintained its status as a top-tier fighter jet."}, {"id": "38f15439-9f1a-4a87-a7a7-24e4a1090ba7", "title": "Air Force commander : Ukraine destroys over 8 , 000 Russian air targets since Feb . 24 , 2022", "date": "2024-08-04 08:30", "url": "https://www.yahoo.com/news/air-force-commander-ukraine-destroys-080447699.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Ukrainian Air Force has destroyed over 8,000 Russian air targets since the start of the full-scale invasion in February 2022, Air Force Commander Mykola Oleshchuk reported on Aug. 4.\n\"In two and a half years, the Air Force has destroyed over 8,000 enemy air targets: hundreds of airplanes and helicopters, thousands of cruise missiles and drones.\nIn his statement, Oleshchuk also congratulated Ukrainian soldiers on the national Air Force Day, marked on the first Sunday of August in Ukraine.\n\"During the full-scale invasion, for their personal courage and dedication demonstrated in defending the state sovereignty and territorial integrity of Ukraine, 4,475 Air Force servicemen have been awarded state honors.\nRead also: Russia’s Su-57 – hype vs. reality\"The Air Force, shoulder to shoulder with the air defense of all the Defense Forces of Ukraine, repels the attacks."}, {"id": "50855a1e-1edc-4385-9dff-a3f8d77d6cb5", "title": "Protesters Rally Against AUKUS Nuclear - Powered Submarines In Sydney", "date": "2024-08-04 06:00", "url": "https://menafn.com/1108514264/Protesters-Rally-Against-AUKUS-Nuclear-Powered-Submarines-In-Sydney", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) SYDNEY, Aug 4 (NNN-AAP) – Dozens of protesters, including members from the local activist group, Sydney Anti-AUKUS Coalition, gathered at the Sydney Town Hall Square yesterday, to demand that the Australian reject the AUKUS nuclear-powered submarines.\nThey also reject the Australian opposition's proposal for nuclear power reactors on sites.\nPeter Murphy, convenor of Sydney Anti-AUKUS Coalition, said in his speech at the rally that, the AUKUS Pact between the United States, Britain and Australia was a super-secret project, to have Australia acquire nuclear-powered attack submarines, as well as, to jointly develop hyper-sonic missiles, cyber warfare, quantum computing and Artificial Intelligence weapons.\nThe protesters marched to the Defence Plaza Sydney, after the gathering, with banners that read,“Australia says No to AUKUS, No to NATO, No to War,”“Down with the AUKUS Nuclear Submarine Deal,”“Scrap AUKUS Now” and“No to Nuclear Subs.”Dennis Doherty, co-ordinator of Sydney Anti-AUKUS Coalition, said that, the nuclear industry, the nuclear weapons and the nuclear submarines, will have a negative impact on Australia.\nAnd that's why it's a bad move to have nuclear-powered submarines, because it's a threatening move, which will increase tension in our region, when we need to decrease tension,” he said.– NNN-AAP"}, {"id": "1d7be1b7-251f-4bdb-9abc-8fbb1c0b0c53", "title": "Russia loses 1 , 150 soldiers , five tanks and 59 artillery systems", "date": "2024-08-04 07:00", "url": "https://www.yahoo.com/news/russia-loses-1-150-soldiers-045050099.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Stock photo: General Staff of the Armed Forces of UkraineRussia has lost 1,150 soldiers, five tanks and 59 artillery systems in the war against Ukraine over the past day.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 4 August 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 582,910 (+1,150) military personnel;8,411 (+5) tanks;16,255 (+17) armoured combat vehicles;16,276 (+59) artillery systems;1,138 (+3) multiple-launch rocket systems;911 (+3) air defence systems;363 (+0) fixed-wing aircraft;326 (+0) helicopters;13,103 (+41) strategic and tactical UAVs;2,412 (+2) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;22,006 (+80) vehicles and tankers;2,734 (+11) special vehicles and other equipment.\nSupport UP or become our patron!"}, {"id": "271b2202-eb23-465b-82b8-2940c3a0e393", "title": "Big Chef Tertiary season 2 audition bus takes off on August 5", "date": "2024-08-04 08:45", "url": "https://www.myjoyonline.com/big-chef-tertiary-season-2-audition-bus-takes-off-on-august-5/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "The second edition of Joy Prime’s culinary contest between technical universities in Ghana is ready to kick start this August.\nThe first season featured six schools including Accra Technical University, Koforidua Technical University, Takoradi Technical University, Ho Technical University, Cape Coast Technical University and Kumasi Technical University.\nHo Technical University defeated the others and emerged as winners of the season.\nThe second season has been expanded to involve universities within the Northern part of Ghana.\nWa Technical University is privileged to be the first school to be auditioned prior to the main competition."}, {"id": "01772f0e-3247-450b-950c-6f1f6f3097cb", "title": "Event honoring men killed in Somalia held in Westmoreland County", "date": "2024-08-04 02:30", "url": "https://www.wpxi.com/news/local/event-honoring-men-killed-somalia-held-westmoreland-county/3KD2VQVHLJAITBCJ5UXRPOP4ZY/", "domain": "wpxi.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "0de5b96a-7d14-4611-9a93-9cb169df68b5", "title": "Captain Newman MD - ITV4", "date": "2024-08-04 07:15", "url": "https://www.tvguide.co.uk/schedule/e7b3e343-3f02-57c0-b007-16ecff34b2c0/captain-newman-md", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Captain Newman MD (1964)ITV4 1:55 PM to 3:30 PM Sunday 4 August Share Add toCalendar +Captain Newman MD S SubtitlesAn American Army psychiatrist stationed on an airbase during the final months of the Second World War faces a constant battle with bureaucracy as the army fails to recognise the seriousness of his patients' conditions.\nFortunately, he has a resourceful corporal on hand to beg, borrow or steal much-needed resources.\nComedy drama, starring Gregory Peck, Tony Curtis, Bobby Darin and Angie DickinsonCaptain Newman MD airs on ITV4 at 1:55 PM, Sunday 4 August .\n(Subtitles, continued.)\nCertificate 15Topics Movie ➝ Drama Comedy General"}, {"id": "24386cb7-c060-4e05-a56a-d5460534157d", "title": "Friendship as former foes honour Cowra Breakout fallen", "date": "2024-08-04 07:30", "url": "https://www.canberratimes.com.au/story/8717991/friendship-as-former-foes-honour-cowra-breakout-fallen/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "\"At a time when there is so much turmoil and conflict in the world, it is important to remember that out of those very dark days of World War II, has grown a friendship between our two nations,\" he said."}, {"id": "a3b7193b-27dd-41c4-b397-6548fa8b091c", "title": "Zelensky Thanks Air Defenders For Their Efficiency And Precision", "date": "2024-08-04 07:45", "url": "https://menafn.com/1108514380/Zelensky-Thanks-Air-Defenders-For-Their-Efficiency-And-Precision", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Ukrainian President Volodymyr Zelensky on Ukraine's Air Force Day thanked the defenders of the sky for every downed Russian target and for their efficiency and precision.\nToday, we express our special gratitude to all the defenders of our skies-to the Ukrainian warriors of the Air Force of the of Ukraine for every downed Russian target, for their efficiency and precision,\" Zelensky said.\n\"Our warriors have already destroyed thousands of Russian missiles and drones, and hundreds of Russian combat planes and helicopters.\nAnd we are doing everything to ensure that the Ukrainian Air Force can achieve even more.\nGlory to our Air Force!"}, {"id": "0be118bf-32d9-4e8e-8f3c-74825993b501", "title": "Zimbabwean Man Caught With USD 828 Million Worth of  Mutoriro  Meth in Australia – ZimEye", "date": "2024-08-04 02:30", "url": "https://www.zimeye.net/2024/08/04/zimbabwean-man-caught-with-usd-828-million-worth-of-mutoriro-meth-in-australia/", "domain": "zimeye.net", "domain_classification": "Unknown", "message": "Zimbabwean Man Caught With USD 828 Million Worth of ‘Mutoriro’ Meth in AustraliaSpread the loveSydney, Australia – In a significant drug bust, a Zimbabwean man has been apprehended in Sydney for allegedly smuggling 900 kilograms of methamphetamine, commonly known as “Mutoriro” in Zimbabwe, into Australia.\nThe illicit haul, valued at an astonishing USD 828 million, marks a dramatic escalation in the international narcotics trade involving the drug that has wreaked havoc in Zimbabwe.\nThis seizure will have a significant impact on the drug trade in New South Wales.”The Zimbabwean origin of the methamphetamine highlights a worrying trend.\nThe Australian Federal Police allege that the drugs were intended for distribution across the eastern seaboard, indicating a well-organized international drug syndicate.\n“This case underscores the global nature of the drug trade and the ongoing battle against narcotics that continue to devastate communities worldwide."}, {"id": "a2b5bfa8-deef-41fb-b654-cf78af8d0352", "title": "Indian Navy Eyes Boeing Multi - Mission Pod for P - 8I Fleet – Indian Defence Research Wing", "date": "2024-08-04 03:00", "url": "https://idrw.org/indian-navy-eyes-boeings-multi-mission-pod-for-p-8i-fleet/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Indian Navy Eyes Boeing’s Multi-Mission Pod for P-8I Fleet| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGThe Indian Navy is keenly interested in Boeing’s newly developed Multi-Mission Pod (MMP) for its P-8 Poseidon anti-submarine aircraft.\nAs per information provided to idrw.org, Boeing and the Indian Navy are working now to identify sensors that they would like to include in the Multi-Mission Pod (MMP) for India’s P-8 fleet that might consist of Indian-made sensors.\nCurrently operating 12 P-8I variants of the Poseidon, the Indian Navy is constantly seeking to enhance the capabilities of its maritime patrol aircraft.\nBy integrating potential in-country developed sensors into the MMP, the Indian Navy could tailor the P-8I to specific operational requirements.\nIf the Indian Navy decides to adopt this system, it would not only bolster its anti-submarine warfare capabilities but also position itself at the forefront of maritime surveillance and reconnaissance."}, {"id": "cc220281-8857-42b4-9d9d-935f3ba5356e", "title": "Canada buys 39 General Dynamics vehicles , eyes anti - tank weapons", "date": "2024-08-04 05:45", "url": "https://www.defensenews.com/land/2022/11/09/canada-buys-39-general-dynamics-vehicles-eyes-anti-tank-weapons/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The country also has plans to buy new-generation Carl Gustaf anti-tank systems to replace older weapons shipped to Ukraine.\nIn July, Canada announced it was redirecting 39 light-armored vehicles, originally ordered for the Canadian Army, to Ukraine.\nThe Armoured Combat Support Vehicles had just been built and were rolling off the assembly line at General Dynamics Land Systems’ location in London, Ontario.\nDan Le Bouthillier, the spokesman with the National Defence Department, said a new contract between Canada and General Dynamics for $165 million was signed for 39 ACSVs.\nThe Canadian Army is in the process of acquiring 360 new light-armored vehicles as part of a 2019 deal with General Dynamics Land Systems’ Canadian branch."}, {"id": "b33f5388-22e9-401f-823f-8bc999666c22", "title": "Njord : The Tumultuous Marriage of a Norse God of the Sea and a Goddess Giantess", "date": "2024-08-04 00:30", "url": "https://www.ancient-origins.net/myths-legends-europe/njord-tumultuous-marriage-norse-god-sea-and-goddess-giantess-009620", "domain": "ancient-origins.net", "domain_classification": "Unknown", "message": "Njord was the god Norse sailors and fisherman turned to in times of need.\nHe was a sea god with powers over the wind and the fertility of land along the coast.\nNjord – Norse god of the seas.\nAs Njord is a god of the sea, his abode was the sea, or more specifically, Nóatún (which means ‘Ship Enclosure’).\nAn illustration of the Norse god Njörðr, from an Icelandic 17th century manuscript."}, {"id": "82d03d63-ba76-4dc8-97d0-880216a4f589", "title": "Iain Glen brings WWI history to light in  The Last Front  ", "date": "2024-08-04 07:15", "url": "https://www.bostonherald.com/2024/08/04/iain-glen-brings-wwi-history-to-light-in-the-last-front/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "Iain Glen had good reason to jump into “The Last Front,” a WWI family drama set in a quiet Belgian village suddenly overrun by death-dealing German forces.\n“I wanted to do this because it was just a really lovely script,” Glen, 63, began in a Zoom interview.\nThis I thought was a different take into trying to encompass what war does to communities.\n“Yes, it’s a particular period set in the First World War, a simple, tender tale that looked at what war can do to communities.\nMy father was the eldest son of a farmer, and both my uncles are farmers,” said this son of Scotland."}, {"id": "596ab756-9d27-484b-ad7e-d8d003738cf7", "title": "Russia attacks Ukraine with 4 missiles and 5 UAVs overnight : Ukrainian defenders destroy all drones", "date": "2024-08-04 07:00", "url": "https://www.yahoo.com/news/russia-attacks-ukraine-4-missiles-041440518.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces targeted Ukraine with four missiles and five attack UAVs on the night of 3-4 August.\nUkrainian air defence units shot down all Russian drones.\nQuote: \"On the night of 3-4 August 2024, the enemy launched two S-300 anti-aircraft missiles on Kharkiv Oblast, two Kh-59 [air-to-surface] missiles on Poltava Oblast from the airspace of Kursk Oblast [Russia] and five Shahed attack drones from the area of [the city of] Primorsko-Akhtarsk, Russia.\"\nDetails: Oleshchuk noted that five Shahed-131/136 UAVs had been shot down by military assets and personnel from mobile firing groups of Ukraine's defence forces and electronic warfare units of the Air Force in Kherson, Dnipropetrovsk, Kirovohrad and Zaporizhzhia oblasts.\nSupport UP or become our patron!"}, {"id": "f69979f0-923b-4c6d-a331-a398c20e6399", "title": "Houston firefighters receive first paychecks from $650 million back pay settlement", "date": "2024-08-04 05:30", "url": "https://www.fox26houston.com/news/houston-firefighters-first-paychecks-650-million-back-pay-settlement", "domain": "fox26houston.com", "domain_classification": "Unknown", "message": "Houston firefighters are seeing a light at the end of the tunnel after a years-long battle with the City of Houston.\nThe Houston Profession Firefighters' Association is receiving $650 million in settlement money from the City of Houston.\n\"I’m hoping for all firefighters that today is just a day of healing for the Houston Fire Department,\" said Jason Wells of the Houston Fire Department.\nThe Houston Professional Firefighter’s Association’s legal battle with the City of Houston is coming to a close.\nSUGGESTED: Houston settles 8-year firefighters’ pay dispute with agreement approval\"This is the closure of the long-waged war against Houston firefighters and their families, and today marks a day of a new era,\" said Marty Lancton, the union president of the Houston Professional Firefighters Association."}, {"id": "58a2ee8a-6a0a-4b08-89ec-d756ae111324", "title": "One damn thing after the other", "date": "2024-08-04 07:15", "url": "https://tribune.com.pk/story/2485317/one-damn-thing-after-the-other", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Once asked what he thinks about history and politics, he very inelegantly said: “History is one damn thing after the other and politics is one damn thinker or one damn idea after another.” Why I am reminded of his reply is the frustration I feel in the inability of politics, both domestic and global, in becoming an answer to improve the overall human conditions.\nWhich wars can President Donald Trump shut down if he returns to power after American elections in November?\nIn August 2019, President Trump declared himself “history’s most pro-Israel U.S. president”.\nAbout 60,000 Israeli citizens have been displaced to central Israel due to the constant shelling of northern Israel by Hezbollah.\nHow right was Heny Ford — one damn thing after another, one damn thinker and idea after another."}, {"id": "3510a478-9730-4ae2-9b7f-762c525e72df", "title": "Israel - Iran war looms over Mideast : Will  Abraham Alliance  face off against  Axis of Resistance ? ", "date": "2024-08-04 07:15", "url": "https://economictimes.indiatimes.com/news/defence/israel-iran-war-looms-over-mideast-will-abraham-alliance-face-off-against-axis-of-resistance/articleshow/112260529.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "What is Abraham Alliance?\nThis proposal seeks to build on the Abraham Accords, normalisation agreements brokered during the Trump administration between Israel and several Arab states.Netanyahu introduced the Abraham Alliance as a response to recent coordinated actions against Iranian aggression.\n\"This alliance would be a natural extension of the Abraham Accords,\" Netanyahu stated.\n\"Iran and several allied groups, known collectively as the \"axis of resistance,\" have supported Hamas since the group launched its October 7 attack on Israel.\nHezbollah, or \"Party of God\" in Arabic, was established during Lebanon's civil war from 1975-1990 after Israel invaded Beirut in 1982."}, {"id": "76b3b86e-c3a9-4527-aeda-b9bd137de492", "title": "Friendship as former foes honour Cowra Breakout fallen", "date": "2024-08-04 07:15", "url": "https://www.bendigoadvertiser.com.au/story/8717991/friendship-as-former-foes-honour-cowra-breakout-fallen/", "domain": "bendigoadvertiser.com.au", "domain_classification": "Unknown", "message": "\"At a time when there is so much turmoil and conflict in the world, it is important to remember that out of those very dark days of World War II, has grown a friendship between our two nations,\" he said."}, {"id": "7261d2f3-509a-4771-8e0e-2c69fe275f62", "title": "Israel - Iran , Mossad , Hezbollah : Abraham Alliance vs Axis Of Resistance : Players In Israel - Iran Shadow War", "date": "2024-08-04 05:30", "url": "https://www.ndtv.com/world-news/israel-iran-mossad-hezbollah-abraham-alliance-vs-axis-of-resistance-players-in-israel-iran-shadow-war-6259187", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "In a speech to the United States Congress last month, Israel's Prime Minister Benjamin Netanyahu envisioned a new regional coalition in the Middle East, termed the \"Abraham Alliance\".\nThe Abraham AllianceThe Abraham Accords, initiated in September 2020, normalised relations between Israel and several Arab nations, including the United Arab Emirates (UAE), Bahrain, Morocco, and Sudan.\nNetanyahu's vision for the Abraham Alliance builds on these accords, seeking a coalition that could include current and future diplomatic partners of Israel.\nThese groups have engaged in longstanding conflicts with Israel, receiving financial and military support from Iran.\nTehran has provided substantial military support, including approximately 80,000 fighting personnel, to bolster Assad's forces."}, {"id": "dc342530-6014-4a6e-b042-30799316accc", "title": "Redon Systems Partners with Munitions India Limited for Advanced Munitions – Indian Defence Research Wing", "date": "2024-08-04 03:00", "url": "https://idrw.org/redon-systems-partners-with-munitions-india-limited-for-advanced-munitions/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Redon Systems Partners with Munitions India Limited for Advanced Munitions| BySOURCE: AFIRedon Systems, a leading player in the Indian drone technology sector, has announced a strategic partnership with Munitions India Limited (MIL) to develop advanced munitions for its barrel-launched loitering munition, “Achuk”.\nThis collaboration marks a significant step towards enhancing the capabilities of the Indian Armed Forces.\nBy joining forces with MIL, Redon Systems reaffirms its commitment to making India self-reliant in military drone technology.\nThis partnership is expected to boost the operational efficiency and effectiveness of the Indian defense forces.\nBoth companies are optimistic about the potential of this collaboration and are committed to delivering cutting-edge solutions to meet the evolving challenges of modern warfare."}, {"id": "cd666157-63aa-419b-995e-7249bdd1ceff", "title": "  Baltic Tiger  drill tests Berlin - to - Tallinn flow of reinforcements", "date": "2024-08-04 05:45", "url": "https://www.defensenews.com/global/europe/2022/11/10/baltic-tiger-drill-tests-berlin-to-tallinn-flow-of-reinforcements/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "It was the first time the German Air Force and Navy had trained together on such missions, and outside of their own nation, officials noted.\nMembers of the Air Force’s “Friesland” airfield protection unit were deployed, providing snipers, fire support, air mobility protection and close target reconnaissance.\nA handful of U.K. Royal Air Force, Belgian Air Force, and Danish Army personnel also participated.\nAir Defender 2023, a joint aerial drill between the U.S. Air National Guard and the German Air Force, is scheduled to take place next June.\nThe German Air Force wants to use all available air bases for this exercise, Gerhartz told reporters during Baltic Tiger."}, {"id": "637ac4c3-fa31-4a87-b6a6-661e23c8a2d5", "title": "Chinese warships off Alaska and Cambodia highlight role of near and far waters in sea power dominance", "date": "2024-08-04 02:00", "url": "https://japantoday.com/category/features/opinions/chinese-warships-off-alaska-and-cambodia-highlight-the-role-of-near-and-far-waters-in-sea-power-dominance", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "To understand the geopolitics of sea power, you need to understand two terms: “near waters” and “far waters.” Near waters are areas close to a country’s shoreline that are seen as important for its defense.\nFar waters are areas across the ocean that a country wants to be present in for economic and strategic interests.\nBut here’s the thing: The far waters of one country are the near waters of another, and that leads to tension.\nMore than shipbuildingChina is a global economic power, and that requires controlling its near waters and building a presence in far waters.\nIt raises the prospect of China’s ability to project power into its far waters – and near waters of the U.S.Albatrosses or hawks?"}, {"id": "5e598053-29c1-40a5-b831-d6c5a3b8c778", "title": "Putin willingness to hand over weapons to Houthis is way to divert Western support for Ukraine – ISW", "date": "2024-08-04 07:00", "url": "https://www.yahoo.com/news/putins-willingness-hand-over-weapons-005630922.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Putin's willingness to hand over weapons to Houthis is way to divert Western support for Ukraine – ISWResearchers at the Institute for the Study of War (ISW) have indicated that Russia’s willingness to supply weapons to the Yemeni Houthis reveals President Vladimir Putin’s strategy to compel the West to retract its support for Ukraine.\nThis move also underscores Russia’s reliance on Iran for precision weapons and components.\nCNN sources disclosed that at least three Russian military officers visited Yemen in late July 2024, possibly to advise the Houthis and assist them in live-fire exercises, which were later cancelled by the Houthis.\nPutin's willingness to consider supporting the Houthis as they attack Israel and international shipping is part of deepening Russian-Iranian military cooperation and Russia's increasing reliance on Iran for high-precision weapons and components.\nRussian authorities continue efforts to financially incentivize Russian military service in Ukraine."}, {"id": "1f37c477-5ead-4d99-991d-954e10986ae5", "title": "Prince George could make big change to his name - but it wont happen quite yet", "date": "2024-08-04 01:30", "url": "https://www.ok.co.uk/royal/prince-george-could-make-big-33339865", "domain": "ok.co.uk", "domain_classification": "Unknown", "message": "Whether it's William, George, Charles or Elizabeth, it's crucial that there are no overriding historical associations that could impact their future or draw negative comparisons.\nAnd while it may seem unlikely, this is an option that would be available to Prince George when his time as King arrives.\nFor such a common name, it's surprising that there had only been two kings named Charles before King Charles - but to say both had eventful reigns would be putting it mildly.\nPrince Albert, after his elder brother King Edward VIII abdicated, took on the name George and ascended to the throne as King George VI.\nThis was perceived as a symbol of stability and continuity from his father, King George V.While the concept of changing their names might seem perplexing in this digital era, it's highly probable that Prince William will adopt the title King William V upon succeeding his father, and Prince George is expected to eventually become King George VII."}, {"id": "643c3ce2-a6bc-480e-8951-c0326beeed21", "title": "The Army is obsessed with safety", "date": "2024-08-04 07:00", "url": "https://www.spectator.co.uk/article/the-army-is-obsessed-with-safety/", "domain": "spectator.co.uk", "domain_classification": "Unknown", "message": "Last week, the new head of the Army, General Sir Roly Walker, warned that war may be much closer than we think.\nTwo years ago, a syndicate of young officers published an article on the extreme shortage of division and brigade-level training in the British Army.\nIt’s worth first understanding how safety works in the British Army.\nThe military’s approach to safety is grounded in Lord Justice Haddon-Cave’s report on the 2006 Nimrod accident, which cost 14 lives.\nThe old saying that an hour-long safety brief does not encourage a better safety culture seems apt."}, {"id": "ab146beb-6ac2-4024-a22d-69bafb52e080", "title": "Daggerheart Testing Big Change in Post - Beta Development", "date": "2024-08-04 02:30", "url": "https://comicbook.com/gaming/news/daggerheart-testing-action-tracker-removal-in-post-beta-development/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "Daggerheart is considering the removal one of one of its combat mechanics – the Action Tracker subsystem.\nComicBook had the opportunity to play through a session of Daggerheart hosted by Darrington Press, Critical Role's game publishing arm.\nThe session, run by lead designer Spenser Starke, featured both character creation and a brief combat session with a notable exclusion – there was no Action Tracker.\nIn versions of Daggerheart made available to players, players placed tokens into the Action Tracker, and the GM used those tokens to activate various enemies on their turn.\nPlease note that this was a playtest session and there's no guarantee that the Action tracker subsystem will be removed from the final version of Daggerheart."}, {"id": "f31228d5-4617-4d8c-ae6d-6e4c05fc7ace", "title": "Protest against AUKUS nuclear - powered submarines", "date": "2024-08-04 08:45", "url": "https://www.sentinelassam.com/more-news/international/protest-against-aukus-nuclear-powered-submarines", "domain": "sentinelassam.com", "domain_classification": "Unknown", "message": "Sydney: Dozens of protesters, including members from the local activist group Sydney Anti-AUKUS Coalition, gathered at the Sydney Town Hall Square on Saturday to demand that the Australian government reject the AUKUS nuclear-powered submarines.\nThey also reject the Australian opposition’s proposal for nuclear power reactors on sites, Xinhua news agency reported.\nPeter Murphy, convener of Sydney Anti-AUKUS Coalition, said in his speech at the rally that the AUKUS Pact between the United States, Britain and Australia was a super-secret project to have Australia acquire nuclear-powered attack submarines, as well as to jointly develop hypersonic missiles, cyber warfare, quantum computing and Artificial Intelligence weapons.\nThe protesters marched to the Defence Plaza Sydney after the gathering, with banners that read, “Australia says No to AUKUS, No to NATO, No to War”, “Down with the AUKUS Nuclear Submarine Deal,” “Scrap AUKUS Now” and “No to Nuclear Subs.”Dennis Doherty, co-ordinator of Sydney Anti-AUKUS Coalition, told Xinhua that the nuclear industry, the nuclear weapons and the nuclear submarines will harm Australia.\n(IANS)Also read: South Korea warns to end North Korean regime if Pyongyang uses nuclear weapons (sentinelassam.com)"}, {"id": "eabc1b7d-268f-4c5b-87cb-455d75913059", "title": "Media blending against developing countries", "date": "2024-08-04 07:15", "url": "https://tribune.com.pk/story/2485315/media-blending-against-developing-countries", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Over 120 media organisations from 50 countries shared their experiences at this Forum of how the news is treated and spread by top Western media outlets.\nSeveral scholarly investigations into Western media’s coverage of the political developments taking place in developing countries exhibit a bias, positing that the Western media scrutinises democratic situation in developing countries with self-serving rhetoric but unpacking Western media’s propaganda needs credible data collection for policy initiatives to build more resilient society against media war.\nSometimes NGO financing is also used to create ‘color revolutions’ to destabilise developing countries, and deliberate media attacks are launched to discredit governance and democracy in targeted countries.\nA majority of the participants opined that Western media is a weapon against developing countries and against those who do not follow instructions from the West, and that the Western media works on a communication model of creating false narrative building based on syndicated, coordinated, deliberated moves to attack certain developing countries.\nShould media managers in Pakistan not sensitise the public about mechanisms that the Western media uses against countries like Pakistan?"}, {"id": "78fcea5b-814d-47ec-b495-f3d4c2c828be", "title": "Absurd connections : Israel , North Korea and nuclear war", "date": "2024-08-04 09:00", "url": "https://www.israelnationalnews.com/news/394060", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Even if Israel were able to keep Iran pre-nuclear, an already nuclear North Korea could still multiply and magnify Iranian aggressions.\nBy definition, an accidental nuclear war between Israel and North Korea would be unintentional, but an unintentional nuclear war would not necessarily be the result of an accident.\nAlways, regarding potential Iranian nuclear surrogate North Korea, Israel’s strategic policies should emphasize the maintenance of stable intra-war nuclear thresholds.\nNorth Korea would likely “win” an actual nuclear war with Israel, but any such “victory” would come at very high costs.\nSumming up, though the above-identified connections between Israel, Iran and North Korea may first seem implausible, they do represent credible connections."}, {"id": "76ff2fef-81d2-4840-a6d7-9ef6b469bf9f", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González double life", "date": "2024-08-04 07:00", "url": "https://abcnews.go.com/International/wireStory/spanish-journalist-russian-spy-mystery-pablo-gonzlezs-double-112549887", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nThey accused him of “participating in foreign intelligence activities against Poland” and said he was an agent of the GRU, Russian military intelligence.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\nHe recalled González once saying: “Life is good, life is almost too good.”\"And I thought: ‘Man, freelance life is never too good."}, {"id": "76db0acd-2547-497e-bba5-070cb4ade9bf", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González double life", "date": "2024-08-04 06:45", "url": "https://www.moneycontrol.com/news/world/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalezs-double-life-12786332.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "OTHERSOTHERSassociated byco-presented byFollow us on:My AccountororHello, LoginAllSpanish journalist or Russian spy?\nThe mystery around Pablo González's double life"}, {"id": "735e1e76-dc6f-43fe-a14a-fd3bd00835f8", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González double life", "date": "2024-08-04 06:30", "url": "https://www.ksat.com/news/2024/08/04/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalezs-double-life/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nThey accused him of “participating in foreign intelligence activities against Poland” and said he was an agent of the GRU, Russian military intelligence.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\nHe recalled González once saying: “Life is good, life is almost too good.”\"And I thought: ‘Man, freelance life is never too good."}, {"id": "b1b1c842-c8d4-479a-888d-0d859b7582ce", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González double life", "date": "2024-08-04 05:45", "url": "https://www.clickondetroit.com/news/2024/08/04/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalezs-double-life/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nThey accused him of “participating in foreign intelligence activities against Poland” and said he was an agent of the GRU, Russian military intelligence.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\nHe recalled González once saying: “Life is good, life is almost too good.”\"And I thought: ‘Man, freelance life is never too good."}, {"id": "54c90d33-eff9-4aaf-a050-5c7184d3daa1", "title": "Watch this US Air Force cargo plane launch a cruise missile in Norway", "date": "2024-08-04 05:45", "url": "https://www.defensenews.com/air/2022/11/10/watch-this-us-air-force-cargo-plane-launch-a-cruise-missile-in-norway/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "A U.S. Air Force MC-130J Commando II executes the first-ever European-theater live-fire demonstration of a Joint Air-to-Surface Standoff Missile during exercise Atreus in Norway on Nov. 9, 2022.\nAir Force)WASHINGTON — The U.S. Air Force has for the first time in an overseas test used its Rapid Dragon system, in which cruise missiles on pallets are launched from the back of a mobility aircraft.\nThe 352nd Special Operations Wing is based at RAF Mildenhall in England, and the MC-130 was from the wing’s 67th Special Operations Squadron.\nHe previously covered leadership and personnel issues at Air Force Times, and the Pentagon, special operations and air warfare at Military.com.\nHe has traveled to the Middle East to cover U.S. Air Force operations."}, {"id": "d2cab3ad-33b1-4839-a434-b6b734e91bd5", "title": "German engineering helps Ukrainian amputees walk again", "date": "2024-08-04 01:45", "url": "https://www.yahoo.com/news/german-engineering-helps-ukrainian-amputees-012137307.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The 42-year-old is among the first patients to be fitted for new prostheses in Germany with the help of an initiative to bring better care to Ukrainian amputees.\nHowever, the plan is to slowly hand over to the new prosthetics centre which the programme is helping to establish in Kyiv.\n\"We are looking to see what still needs to be ordered so that the prosthetics centre is fully equipped,\" said von Wolfersdorff.\nCurrently, the supply of prosthetics in Ukraine is \"catastrophic\", said Saiko, who spent nine months of his rehabilitation in Ukraine.\nWith his German prostheses, Saiko is managing to climb a staircase with ease, balance on a board or ride a bike -- even if the effort brings him out in a sweat."}, {"id": "7b014f07-2a4f-4828-92ca-6d9a7f6d64a8", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González double life", "date": "2024-08-04 05:30", "url": "https://www.local10.com/news/2024/08/04/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalezs-double-life/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nThey accused him of “participating in foreign intelligence activities against Poland” and said he was an agent of the GRU, Russian military intelligence.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\nHe recalled González once saying: “Life is good, life is almost too good.”\"And I thought: ‘Man, freelance life is never too good."}, {"id": "040ff19b-5a5a-48c4-af3d-b36f9c6bde10", "title": "Ukrainian Air Defenses Shoot Down Five Enemy Shahed Uavs Overnight", "date": "2024-08-04 06:00", "url": "https://menafn.com/1108514260/Ukrainian-Air-Defenses-Shoot-Down-Five-Enemy-Shahed-Uavs-Overnight", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The forces and means of the mobile firing groups of the Defense Forces and EW units of the Air Force of Ukraine shot down five enemy Shahed-131/136 UAVs in the Kherson, Dnipropetrovsk, Kirovohrad and Zaporizhzhia regions.\nUkrainian Air Force Commander, Lieutenant General Mykola Oleshchuk said this in a post on Telegram , Ukrinform reports.\n\"On the night of August 4, 2024, the enemy attacked the Kharkiv region with two S-300 anti-aircraft guided missiles, the Poltava region with two Kh-59 guided missiles from the airspace of the Kursk region, and launched five Shahed combat UAVs from Russia's Primorsko-Akhtarsk,\" the post says.\nshares video showing Russian fortifications, military infrastructure being destroyed near Sumy regioAs reported, Russia attacked Ukraine with combat drones."}, {"id": "8fedadec-8249-4bfc-9a6e-c9d9c56a2d29", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González", "date": "2024-08-04 07:15", "url": "https://knpr.org/npr/2024-08-03/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalez", "domain": "knpr.org", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nFriends were astonished — and, as Poland held González without trial for months that turned into years, some grew skeptical and organized protests in Spain demanding his release.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\n\"Pablo González contributed to a few VOA stories as a freelancer over a relatively short period of time starting in late 2020,\" spokesperson Emily Webb said in reply to an emailed query."}, {"id": "d84506ca-5410-492f-8001-3b75039bc9e1", "title": "Former Catholic Memorial star Ryan Higgins repeats as A Shot For Life champion", "date": "2024-08-04 02:30", "url": "https://www.bostonherald.com/2024/08/03/former-catholic-memorial-star-ryan-higgins-repeats-as-a-shot-for-life-champion/", "domain": "bostonherald.com", "domain_classification": "Unknown", "message": "Many of the participants had their own family cancer stories, including recent Catholic Memorial grad Ryan Higgins.\nThe Catholic Memorial assistant coach and college-bound athlete took the court together, with Bruce rebounding for Ryan.\nMacDonough was put in touch with ‘A Shot For Life’ after moving to the Commonwealth from Vermont, following a stint with the Lone Wolf Athletics AAU squad.\nNow, ‘A Shot For Life’ encompasses seven sports, hosting tournaments to fundraise across New England.\nNo matter how big we get, the Massachusetts ‘A Shot For Life’ Challenge will always be really special, because I did it as a kid."}, {"id": "65306d33-8fe5-488c-a04e-26c859261738", "title": "Russian Army Loses 1 , 150 More Soldiers In Ukraine Over Past Day", "date": "2024-08-04 06:45", "url": "https://menafn.com/1108514309/Russian-Army-Loses-1150-More-Soldiers-In-Ukraine-Over-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The Russian army's combat losses in Ukraine from February 24, 2022 to August 4, 2024 amount to nearly 582,910 invaders, including another 1,150 killed or wounded in action in the past day.\nThe General Staff of the of Ukraine said this in a post on , according to Ukrinform.\nThe Ukrainian defenders have also destroyed 8,411 enemy tanks (+5 in the past day), 16,255 armored combat vehicles (+17), 16,276 artillery systems (+59), 1,138 multiple launch rocket systems (+3), 911 air defense systems (+3), 363 aircraft, 326 helicopters, 13,103 unmanned aerial vehicles (+41), 2,412 cruise missiles (+2), 28 warships/cutters, 1 submarine, 22,006 motor vehicles (+80), and 2,734 special equipment units (+11).\nAs reported by Ukrinform, the Ukrainian air defenses shot down five enemy Shahed-131/136 UAVs over the Kherson, Dnipropetrovsk, Kirovohrad and Zaporizhzhia regions."}, {"id": "d60c3f18-9e23-4fef-bfcd-b31e668e7d23", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González double life", "date": "2024-08-04 05:45", "url": "https://www.wsls.com/news/2024/08/04/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalezs-double-life/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nThey accused him of “participating in foreign intelligence activities against Poland” and said he was an agent of the GRU, Russian military intelligence.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\nHe recalled González once saying: “Life is good, life is almost too good.”\"And I thought: ‘Man, freelance life is never too good."}, {"id": "b150c17a-a3a8-4496-8649-58ced060c26e", "title": "  Big nerd culture : Hundreds of Utah wargamers gather to battle with dice , figurines", "date": "2024-08-04 01:45", "url": "https://www.ksl.com:443/article/51089259/big-nerd-culture-hundreds-of-utah-wargamers-gather-to-battle-with-dice-figurines", "domain": "ksl.com", "domain_classification": "Unknown", "message": "That's according to Shawn Bagley, an organizer for the Salt Lake Open, a series of gaming tournaments happening this weekend at the Utah State Fairpark.\nMarcus Kubryn, Calgary, plays Star Wars Armada during the Sci-Fi, Fantasy and Historical Tabletop Gaming Convention at the Utah State Fairpark in Salt Lake City on Saturday.\n\"Utah just has a big nerd culture in general,\" said tournament organizer Abigail Hansen.\nThe game system Hansen is overseeing at the Salt Lake Open has the same amount of participants.\nPlayers compete during the 2024 Salt Lake Open tabletop gaming convention Saturday at the Utah State Fairpark."}, {"id": "6140dda0-933f-441a-89bf-83fdefd38c4a", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González", "date": "2024-08-04 05:30", "url": "https://www.npr.org/2024/08/04/g-s1-15275/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalez", "domain": "npr.org", "domain_classification": "International", "message": "Spanish journalist or Russian spy?\nAmong them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\n\"Pablo González contributed to a few VOA stories as a freelancer over a relatively short period of time starting in late 2020,\" spokesperson Emily Webb said in reply to an emailed query."}, {"id": "d8386928-dff1-4336-a8c3-e1201b42bcd3", "title": "BAE Systems Receives $493 Million U . S . Army Contract To Produce Additional M109A7 Self - Propelled Howitzers And M992A3 Ammunition Carriers", "date": "2024-08-04 02:00", "url": "https://menafn.com/1108510668/BAE-Systems-Receives-493-Million-US-Army-Contract-To-Produce-Additional-M109A7-Self-Propelled-Howitzers-And-M992A3-Ammunition-Carriers", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- PR Newswire) STERLING HEIGHTS,Mich., Aug. 2, 2024 /PRNewswire/ -- BAE Systems (LON: BA) received a $493 million contract to continue producing M109A7 Self-Propelled Howitzers (SPH) and M992A3 Ammunition Carriers for the U.S. Army.\nThe M109A7 ensures have the most modern artillery capabilities that are highly survivable, maintainable, proven, and responsive on the battlefield.\n(Credit: BAE Systems)Post this\"We are focused on producing and fielding modern artillery capabilities that provide the Army with overmatch in range, accuracy, and lethality,\" said Dan Furber, director of ground vehicle production for BAE Systems' Combat Mission Systems business.\n\"This contract ensures the ABCT will sustain operations of one of the most survivable indirect fire support systems for years to come.\"\nFor more information, please contact:Darby Dame, BAE SystemsMobile: +1 269 675 0273[email protected]@BAESystemsIncSOURCE BAE Systems, Inc."}, {"id": "96815fbf-a037-4a41-a407-cf51506926fb", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González", "date": "2024-08-04 07:45", "url": "https://www.kalw.org/npr-news/2024-08-03/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalez", "domain": "kalw.org", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nFriends were astonished — and, as Poland held González without trial for months that turned into years, some grew skeptical and organized protests in Spain demanding his release.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\n\"Pablo González contributed to a few VOA stories as a freelancer over a relatively short period of time starting in late 2020,\" spokesperson Emily Webb said in reply to an emailed query."}, {"id": "fb8b732d-1181-4486-8cd4-ab405aa5e8a8", "title": "IDF soldier seriously wounded in combat in southern Gaza", "date": "2024-08-04 07:00", "url": "https://www.jpost.com/breaking-news/article-813152", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "An IDF soldier was wounded seriously in combat in the southern Gaza Strip on Saturday, the military said on Sunday morning.\nThe soldier belonged to the 9th Battalion in the Armored Corps.\nHe was transferred to the hospital for further medical treatment, the IDF added."}, {"id": "b313117f-3047-44c9-9707-32b1316ea2a2", "title": "BERNAMA - Govt Must Address Uncontrolled Vaping Among School Students", "date": "2024-08-04 08:30", "url": "https://www.bernama.com/en/general/news.php?id=2325294", "domain": "bernama.com", "domain_classification": "Unknown", "message": "KUALA LUMPUR, Aug 4 (Bernama) -- Alliance for a Safe Community chairman Tan Sri Lee Lam Thye has called on the government to address the issue of uncontrolled vaping among school students with urgency.\nLee emphasised the need for nationwide school initiatives to combat vaping through awareness campaigns and concrete actions.\nHe expressed concern over recent reports of students vaping in school toilets and unused classroomsbootstrap slideshow “In a recent incident, six students at a secondary school in Selangor were found vomiting after sharing a vape.\nbootstrap slideshow He urged school authorities and students to support the Education Ministry's efforts to combat vaping, emphasising the effectiveness of peer-to-peer education programmes, where students who have quit vaping share their experiences.\nLee stressed the importance of involving parents and guardians in informational sessions to shape children’s attitudes and behaviors towards vaping."}, {"id": "d9bda593-9462-4075-8c9d-8e9de19c9163", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González", "date": "2024-08-04 07:45", "url": "https://www.houstonpublicmedia.org/npr/2024/08/04/g-s1-15275/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalez/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "Pablo González, a journalist from Spain who had been based in Poland, was freed in the largest prisoner swap since the Soviet era, confirming suspicions that he may have been a Russian operative.\nAmong them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\n\"Pablo González contributed to a few VOA stories as a freelancer over a relatively short period of time starting in late 2020,\" spokesperson Emily Webb said in reply to an emailed query."}, {"id": "228c1ad6-b89f-4b9a-8869-e7d79e1e8dfe", "title": "Fresh start for clans in Jimi", "date": "2024-08-04 05:45", "url": "https://www.postcourier.com.pg/fresh-start-for-clans-in-jimi/", "domain": "postcourier.com.pg", "domain_classification": "Unknown", "message": "MORE than 100 newly built semi-permanent houses, with furniture, beddings and kitchen utensils, will be given to more than 1000 election-related violence victims in Jimi district of Jiwaka Province by end of this month.\nWhile living in caves and makeshift shelters for almost two years, more than 30 have died due to no access in health services or proper sanitation.\nMr Kopa used his knowledge and wisdom writing letters seeking help from all levels of the government and international donors.\nTo his relief, the International Organisation for Migration (IOM) and the Care International promptly responded with help and support for resettlement back at their Dapaka village.\nThese two international partners have come in heavily with the support of building 123 semi-permanent houses and households’ basics for a complete restoration."}, {"id": "419dc90f-c673-484f-a741-6d6375d8819c", "title": "Indian Army Mulls Massive Expansion of K - 9 Vajra Fleet Amidst Evolving Threat Scenario – Indian Defence Research Wing", "date": "2024-08-04 03:00", "url": "https://idrw.org/indian-army-mulls-massive-expansion-of-k-9-vajra-fleet-amidst-evolving-threat-scenario/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Indian Army Mulls Massive Expansion of K-9 Vajra Fleet Amidst Evolving Threat Scenario| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGThe Indian Army is on the cusp of significantly bolstering its artillery firepower with the acquisition of an additional 100 K-9 Vajra self-propelled howitzers (SPH).\nHowever, the evolving geopolitical landscape, particularly the ongoing conflict in Ukraine, has prompted the Army to reassess its artillery requirements.\nThe increasing emphasis on mobility and survivability on the modern battlefield has led to a potential surge in demand for self-propelled artillery systems.\nConsequently, the Army is now contemplating an even more ambitious target of procuring up to 400 K-9 Vajra SPHs, necessitating an additional order of 200 units.\nThe initial batch of K-9 Vajra SPHs was optimized for desert warfare, primarily targeting the western border with Pakistan."}, {"id": "eb87de00-c91e-4ca9-8511-e2a6aca3f08c", "title": "Hamas to shoulder blame for no progress on Gaza deal Netanyahu office adviser - World", "date": "2024-08-04 02:30", "url": "https://tass.com/world/1824993", "domain": "tass.com", "domain_classification": "Unknown", "message": "The radical movement Hamas should be blamed that the Cairo talks on a Gaza deal are not making progress, as Israel has not put forward any new demands, Dmitry Gendelman, an adviser to Israeli Prime Minister Benjamin Netanyahu’s office, told TASS.\nThe lack of progress is solely because of Hamas,\" he said.\n\"Those who suggest giving in to Hamas’ demands in order to get applause in the studios are reducing the chances of the hostages’ release,\" the office said.\nThe plan envisages a complete ceasefire and the release of Israeli hostages held by Hamas in exchange for the release of hundreds of Palestinian inmates from Israeli prisons.\nIn response, Israel launched a military operation in Gaza to eradicate Hamas’ military and political structure and to release all the hostages."}, {"id": "18ac6a7a-3641-4667-a08c-313266be0217", "title": "Spanish journalist or Russian spy ? The mystery around Pablo González", "date": "2024-08-04 07:45", "url": "https://www.capeandislands.org/2024-08-04/spanish-journalist-or-russian-spy-the-mystery-around-pablo-gonzalez", "domain": "capeandislands.org", "domain_classification": "Unknown", "message": "Among them was Pablo González, a freelance journalist from Spain who had been based in Poland since 2019, working for Spanish news agency EFE, Voice of America and other outlets.\nFriends were astonished — and, as Poland held González without trial for months that turned into years, some grew skeptical and organized protests in Spain demanding his release.\nHis inclusion in the deal appears to confirm suspicions that González was a Russian operative using his cover as a journalist.\nBorn Pavel Rubtsov in 1982 in then-Soviet Moscow, González went to Spain with his Spanish mother at age 9, where he became a citizen and received the Spanish name of Pablo González Yagüe.\n\"Pablo González contributed to a few VOA stories as a freelancer over a relatively short period of time starting in late 2020,\" spokesperson Emily Webb said in reply to an emailed query."}, {"id": "8bbd6f1d-66ab-452c-bc2f-82e15219445d", "title": "Horror at deaths of 12 children unites Druze across borders . But Mideast wars tear at their bonds", "date": "2024-08-04 02:30", "url": "https://www.dailyexcelsior.com/horror-at-deaths-of-12-children-unites-druze-across-borders-but-mideasts-wars-tear-at-their-bonds/", "domain": "dailyexcelsior.com", "domain_classification": "Unknown", "message": "The Druze religious sect began as a 10th-century offshoot of Ismailism, a branch of Shiite Islam.\nIn Israel, Druze are highly regarded for their loyalty to the state and their military service, with many entering elite combat units, including fighting in Gaza.\nHe urged Israeli Druze not to join the war in Gaza or the increasingly volatile confrontation across the Lebanese-Israeli border.\nBut rather than criticizing Druze in the Israeli army, Khair said he would rather speak positively of voices among Israeli Druze that have backed the Palestinian cause.\nAcross Majdal Shams, there was raw pain as the community buried 12 small white coffins in the span of 24 hours."}, {"id": "bdc85423-5d3b-46b9-8914-cab0f3cf6482", "title": "Horror at deaths of 12 children unites Druze across borders", "date": "2024-08-04 08:30", "url": "https://www.santafenewmexican.com/news/national_and_world_news/horror-at-deaths-of-12-children-unites-druze-across-borders/article_afbaebcd-f2bf-53ef-be10-f4b309eecc04.html", "domain": "santafenewmexican.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "37fff35d-9ceb-450d-872b-ae2943d2172b", "title": "One of Ireland most experienced aid workers :  The secrecy of HIV and Aids is worse now , it went underground during Covid  – The Irish Times", "date": "2024-08-04 05:30", "url": "https://www.irishtimes.com/life-style/people/2024/08/04/one-of-irelands-most-experienced-aid-workers-the-secrecy-of-hiv-and-aids-is-worse-now-it-went-underground-during-covid/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "“Actually, the secrecy is worse now, it went underground during Covid.\nThe young Irish healthcare workers tended to prefer sleeping during the day so they could work through the night-time bombardments, she says.\nJust this week, the UN’s World Health Organisation warned that increasing attacks on hospitals in the besieged nation had left the Sudanese healthcare system “hanging by a thread”.\nIt’s the trusted health workers that people believe.\nThis year, the Wexford woman will formally retire from her role as Concern’s overseas health programme adviser and HIV technical assistance team lead."}, {"id": "ce600d05-5358-4169-b33a-a096933568b4", "title": "Bangladesh Students Step up Protests to Press PM Sheikh Hasina Resignation", "date": "2024-08-04 01:45", "url": "https://www.deccanchronicle.com/world/bangladesh-students-step-up-protests-to-press-pm-sheikh-hasinas-resignation-1814232", "domain": "deccanchronicle.com", "domain_classification": "Unknown", "message": "Students Against Discrimination have asked their compatriots to cease paying taxes and utility bills from Sunday to pile pressure on the government.\n\"She must go because we don't need this authoritarian government,\" Nijhum Yasmin, 20, told AFP from one of many protests staged around Dhaka on Saturday.\nThe looming non-cooperation campaign deliberately evokes a historical civil disobedience campaign during Bangladesh's 1971 liberation war against Pakistan.\n- 32 children killed -Hasina, 76, has ruled Bangladesh since 2009 and won her fourth consecutive election in January after a vote without genuine opposition.\nThe protests had remained largely peaceful until attacks on demonstrators by police and pro-government student groups."}, {"id": "ddec12da-2063-4f86-9985-88af649dd27e", "title": "An Upcoming Magic : The Gathering Release Features Two Baldur Gate 3 Favorites", "date": "2024-08-04 02:30", "url": "https://comicbook.com/gaming/news/magic-the-gathering-bg3-astarion-karlach/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "• Friends – You gain life equal to the amount of life you gained this turn.\n• Feed – Target opponent loses life equal to the amount of life they lost this turn.\n• Friends – You gain life equal to the amount of life you gained this turn.\nKarlach, Fury of AvernusWhenever you attack, if it's the first combat phase of the turn, untap all attacking creatures.\nJust as the Magic: The Gathering Monty Python Secret Lair sets sold out completely within an hour of their timed release, the Baldur's Gate 3 items will likely sell out incredibly fast – especially since this won't be a print-on-demand release as many fans would like for it to be."}, {"id": "231a24c7-7df9-4ffe-b3f4-3d6bcee54e7e", "title": "Weight Loss Diet : 5 Post - Workout Meals That Will Help in Recovery And Keep You Full All Day", "date": "2024-08-04 08:45", "url": "https://www.india.com/lifestyle/weight-loss-diet-5-post-workout-meals-that-will-help-in-recovery-and-keep-you-full-all-day-7138261/", "domain": "india.com", "domain_classification": "Unknown", "message": "HomeLifestyleWeight Loss Diet: 5 Post-Workout Meals That Will Help in Recovery And Keep You Full All DayWeight Loss Diet: 5 Post-Workout Meals That Will Help in Recovery And Keep You Full All DayA satisfying post-workout snack or meal is essential for maintaining your progress.\nSo, here are 5 options that you must incorporate in your training schedule for effective weight loss.\nWeight Loss Diet: 5 Post-Workout Meals That Will Help in Recovery And Keep You Full All DayMaintaining a healthy diet is essential for weight loss, and timing your meals correctly is just as crucial.\nSo, here are 5 post-workout meals that you must include in your training schedule for weight loss.\n5 Post-Workout Meals For Weight Loss And Muscle RecoveryBanana and peanut butter smoothie: Nothing is more comforting that a homemade banana and peanut butter smoothie."}, {"id": "31ea3b71-2daf-4646-be88-d84e02d93d98", "title": "The Civil War Didnt  Settle  The Question Of State Secession", "date": "2024-08-04 03:00", "url": "https://www.zerohedge.com/political/civil-war-didnt-settle-question-state-secession", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "By Brian McGlinchey at Stark RealitiesSecessionist inclinations are on the rise in the United States, and are sure to intensify after Nov. 5 regardless of which party prevails.\nWhen that happens, you can expect the accompanying discourse will be peppered with assertions that states have no right to secede, with many declaring the question was “settled” by the Civil War.\nThough the Civil War has conditioned many Americans to associate secession with war — and to reflexively recoil from it on that basis — secession is not an inherently violent proposition.\nLooking back to the run-up to the Civil War, slavery-abolitionists themselves championed secession, pushing for northern states to abandon the union.\nOthers who attempt to deny states’ right of secession point to the Constitution’s lack of a provision for a parting of ways."}, {"id": "fa25603d-0080-486b-8d89-8a380312ec73", "title": "Agent Zo : The woman who parachuted into Nazi - occupied Poland", "date": "2024-08-04 00:00", "url": "https://www.bbc.com/news/articles/cneej0r2n7go", "domain": "bbc.com", "domain_classification": "International", "message": "So who was the woman who went by the name of Zo, and what inspired her to acts of such defiance and bravery?\n\"It's really ironic,\" says Clare Mulley, historian and author of a new book, Agent Zo.\nAt one point, Mulley says, Zo leapt from the door of a moving train to evade an officer who had joined her in the carriage.\nFor Polish war hero Kazimierz Bilski, there was one thing for it.\nThe government-in-exile \"just can't believe that women should be given military legal status\", Mulley explains, and Zo was branded \"an insane feminist\"."}, {"id": "623e27ed-9001-403b-b756-fece9b7306a9", "title": "Government is ramping efforts to combat misinformation , disinformation – Fatimatu Abubakar", "date": "2024-08-04 07:00", "url": "https://www.ghanaweb.com/GhanaHomePage/NewsArchive/Government-is-ramping-efforts-to-combat-misinformation-disinformation-Fatimatu-Abubakar-1943847", "domain": "ghanaweb.com", "domain_classification": "Unknown", "message": "Ms Fatimatu Abubakar, the Minister of Information, made this known in an interview with the media in Accra on Saturday.\nUpon approval, the Minister said, it would sanitize the media ecosystem and make it unprofitable for people to spread false information.\nThe Action Plan has six-point strategy to combat misinformation and disinformation in Ghana, she said.\nThe Government is also working to pass the Broadcasting Bill into law to assist in addressing misinformation and disinformation.\n“The right to information is the right to truth and the right to fact and not to misinformation,” she said."}, {"id": "15572803-bbee-488f-8131-dbd5d6c3acfa", "title": "Ubisoft August Switch sale : Prince of Persia : The Lost Crown , more", "date": "2024-08-04 06:45", "url": "https://nintendoeverything.com/ubisoft-august-2024-switch-eshop-sale-lowest-prices-ever-for-prince-of-persia-the-lost-crown-valiant-hearts-coming-home-more/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "Ubisoft is currently hosting a new sale on the Switch eShop for August 2024, which features the lowest prices ever for Prince of Persia: The Lost Crown and Valiant Hearts: Coming Home.\nA bunch of other games are also included.\nThe full lineup is as follows:Ubisoft August 2024 Switch eShop sale prices– Assassin’s Creed: The Ezio Collection – $15.99 (was $39.99)– Assassin’s Creed: The Rebel Collection – $14.79 (was $39.99)– Child of Light – $4.99 (was $19.99)– Family Feud – $7.49 (was $29.99)– Immortals Fenyx Rising – $7.99 (was $39.99)– Jeopardy – $5.99 (was $19.99)– Just Dance 2024 Edition – $23.99 (was $59.99)– Mario + Rabbids Kingdom Battle – $13.99 (was $39.99)– Mario + Rabbids Sparks of Hope – $19.79 (was $59.99)– Monopoly (2017) – $7.99 (was $39.99)– Monopoly Madness – $7.49 (was $29.99)– OddBallers – $4.99 (was $19.99)– Prince of Persia: The Lost Crown – $23.99 (was $39.99)– Rabbids: Party of Legends – $9.99 (was $39.99)– Rayman Legends – $7.99 (was $39.99)– Scott Pilgrim vs.\nThe World: The Game – $4.89 (was $14.99)– South Park: The Fractured but Whole – $17.99 (was $59.99)– South Park: The Stick of Truth – $7.49 (was $29.99)– Starlink: Battle for Atlas – $8.99 (was $29.99)– Trials Rising – $5.99 (was $19.99)– Trivial Pursuit Live – $9.99 (was $19.99)– Uno – $3.99 (was $9.990– Valiant Hearts: Coming Home – $9.99 (was $14.99)– Wheel of Fortune – $6.99 (was $19.99)The Ubisoft August 2024 Switch eShop sale with Prince of Persia: The Lost Crown, Valiant Hearts: Coming Home, and more will be live until August 12, 2024.\nShare this:Related"}, {"id": "008377ec-181a-4784-ad2a-85d9c922b2c4", "title": "Henry Danger - Nickelodeon HD", "date": "2024-08-04 05:45", "url": "https://www.tvguide.co.uk/schedule/9c7c34e5-e1e8-5949-848b-740b651d47a1/henry-danger", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Henry DangerNickelodeon HD 11:29 AM to 12:00 PM Sunday 4 August Share Add toCalendar +Part 3-A New Hero Season 5 Episode 8 of 41 S SubtitlesSchwoz works to create an anti-virus while Kid Danger and Captain Man battle a villain.\nKid Danger's heroism is put to the test as they fight to save the world.\nHenry Danger airs on Nickelodeon HD at 11:29 AM, Sunday 4 August .\n(Subtitles.)"}]