[{"id": "ad7ed65c-d739-4173-857c-0857a4b2a288", "title": "UK ministers are drawing up plans to evacuate 60 , 000 Britons from Israel amid fears Iran could launch an attack - with the Navy already on stand - by for a  Dunkirk - style  rescue mission to save 16 , 000 Brits stranded in Lebanon", "date": "2024-08-14 00:30", "url": "https://www.dailymail.co.uk/news/article-13740979/uk-ministers-plans-evacuate-israel-iran-hezbollah.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "UK ministers are drawing up plans to evacuate British nationals from Israel amid fears of an attack from Iran.\nThe British Foreign Office is advising against all but essential travel to Israel, amid the war in Gaza, and is now looking at emergency plans to support some 60,000 Brits believed to be in the country, the Mirror reports.\nMasoud Pezeshkian, the newly-elected Iranian President, has insisted his country has the 'right to respond' to the attack on Iranian soil, without specifying details.\n'In essence, I think Iran and Israel would both prefer to avoid escalation out of control,' he said.\nSir Keir Starmer attempted to relay such concerns to Iran through a 'rare' phonecall to the new Iranian president on Monday."}, {"id": "8e639131-1ab1-4237-a631-875ba8e44fec", "title": "This is how Israel would defend itself against new missile attacks", "date": "2024-08-14 01:15", "url": "https://www.10news.com/world/israel-at-war/this-is-how-israel-would-defend-itself-against-new-missile-attacks-from-iran-or-others", "domain": "10news.com", "domain_classification": "Unknown", "message": "Tensions between Iran and Israel continue to climb following the killing of Hamas political leader Ismail Haniyeh in Tehran.\nIran also said it would not send delegates to revived cease-fire talks between Hamas and Israel.\nOn Monday, White House officials said it was likely Iran would strike Israel in some fashion this week.\nFor medium- to long-range rockets, Israel deploys the David's Sling system, which it jointly developed with the U.S.\nRELATED STORY | Amid heightened tensions, US deploys additional military resources to Middle EastTo combat longer-range missiles, Israel uses the Arrow system."}, {"id": "9dad5c2c-fd3c-4af8-ae80-92c324d45376", "title": "Analysis : High - wire diplomacy on possible Iran retaliation in Israel - Hamas war draws in world", "date": "2024-08-14 03:30", "url": "https://www.theday.com/nation/20240813/analysis-high-wire-diplomacy-on-possible-iran-retaliation-in-israel-hamas-war-draws-in-world/", "domain": "theday.com", "domain_classification": "Unknown", "message": "in Tehran, Iran, Thursday, Aug. 1, 2024.\nIt could also free the Israeli hostages who remain captive there since Hamas' Oct. 7 attack on southern Israel that killed 1,200 people and began the conflict.\nWidespread losses could push Israeli Prime Minister Benjamin Netanyahu's hard-line government into its own direct attack on Iran — and drag the wider Middle East into a regional war.\nIts first complex attack on Israel in April caused little damage, raising the risk of it needing to go larger this time in response.\nIt also has backed efforts mediated by Egypt and Qatar to reach a cease-fire in the wider war."}, {"id": "df1eeb9b-062f-44e4-960d-6633fe9813d1", "title": "UK tells UN  Palestinians have nowhere safe to turn  after Israel bombs Gaza school", "date": "2024-08-14 03:15", "url": "https://www.mirror.co.uk/news/uk-news/uk-tells-un-palestinians-nowhere-33458103", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Speaking before the UN Security Council, August 13, the UK's Ambassador James Kariuki said: \"The UK is appalled by the Israeli military strike on al-Tabeen school where Palestinian civilians were sheltering.\nThe UN tells us this strike killed dozens of Palestinians, many of whom are reported to be women and children.\nAmbassador Kariuki continued to express the UK Government's anger at Israel's recent military actions, saying: \"Palestinians have nowhere safe to turn.\n\"We have also heard completely unacceptable rhetoric from Israeli Ministers relating to the mistreatment of detainees and starvation of civilians in Gaza.\nInternational law could not be more clear – systemic mistreatment of detainees and the intentional starvation of civilians are war crimes.\""}, {"id": "7fcd371e-8fbb-44d7-9d19-a465f6412053", "title": "This is how Israel would defend itself against new missile attacks", "date": "2024-08-14 00:15", "url": "https://www.kjrh.com/world/israel-at-war/this-is-how-israel-would-defend-itself-against-new-missile-attacks-from-iran-or-others", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "Tensions between Iran and Israel continue to climb following the killing of Hamas political leader Ismail Haniyeh in Tehran.\nIran also said it would not send delegates to revived cease-fire talks between Hamas and Israel.\nOn Monday, White House officials said it was likely Iran would strike Israel in some fashion this week.\nFor medium- to long-range rockets, Israel deploys the David's Sling system, which it jointly developed with the U.S.\nRELATED STORY | Amid heightened tensions, US deploys additional military resources to Middle EastTo combat longer-range missiles, Israel uses the Arrow system."}, {"id": "bc4d4b06-c112-48ad-ac4b-1bb2225f708f", "title": "President Joe Biden believes Iran could scrap plans to strike Israel if it agrees to ceasefire with Hamas in Gaza - 14 - Aug - 2024", "date": "2024-08-14 00:15", "url": "https://home.nzcity.co.nz/news/article.aspx?id=404614&fm=psp,tsf", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "US President Joe Biden believes a Gaza ceasefire could be enough to convince Iran not to launch retaliatory air strikes against Israel, after the assassination of Hamas' top official in Tehran in late July.\nPresident Biden was asked whether he expected Iran to shelve plans, if a ceasefire and hostage deal between Israel and Hamas was agreed to after talks on Thursday.\nHamas has said fresh negotiations would only serve to delay a ceasefire, and allow Israel to continue its bombardment of the war ravaged Gaza Strip.\nIran and Hezbollah planning strikes after assassinations on home soilIran and Iranian-backed Lebanese group Hezbollah are furious with Israel for two assassinations last month.\nHamas said close to 40,000 Palestinians have been killed in Gaza since the war began, after around 1,100 Israelis were killed during Hamas led attacks on October 7."}, {"id": "47859a9f-b4a2-4d1d-aa63-5d36c8b96576", "title": "President Joe Biden believes Iran could scrap plans to strike Israel if it agrees to ceasefire with Hamas in Gaza - 14 - Aug - 2024", "date": "2024-08-14 00:15", "url": "https://home.nzcity.co.nz/news/article.aspx?id=404614&fm=psp,tst", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "US President Joe Biden believes a Gaza ceasefire could be enough to convince Iran not to launch retaliatory air strikes against Israel, after the assassination of Hamas' top official in Tehran in late July.\nPresident Biden was asked whether he expected Iran to shelve plans, if a ceasefire and hostage deal between Israel and Hamas was agreed to after talks on Thursday.\nHamas has said fresh negotiations would only serve to delay a ceasefire, and allow Israel to continue its bombardment of the war ravaged Gaza Strip.\nIran and Hezbollah planning strikes after assassinations on home soilIran and Iranian-backed Lebanese group Hezbollah are furious with Israel for two assassinations last month.\nHamas said close to 40,000 Palestinians have been killed in Gaza since the war began, after around 1,100 Israelis were killed during Hamas led attacks on October 7."}, {"id": "810d357c-3762-43f0-aaa4-0ae81b4619d0", "title": "Palestinian death toll in Gaza nears 40 , 000 : Health authorities", "date": "2024-08-14 02:15", "url": "http://www.china.org.cn/world/2024-08/14/content_117365984.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器People prepare to bury victims killed in an Israeli airstrike in Gaza City, on Aug. 12, 2024.\n[Photo/Xinhua]The Palestinian death toll from ongoing Israeli attacks on the Gaza Strip has risen to nearly 40,000, the Gaza-based health authorities said in a statement on Tuesday.\nMeanwhile, seven people were killed on Tuesday after an Israeli bombing of a house in the Al-Bureij refugee camp in the central Gaza Strip.\nFour people were killed in an Israeli bombing on Deir al-Balah, also in the central Gaza Strip, the Palestinian official news agency WAFA reported.\nOn Saturday and Sunday, the Israeli military issued two new evacuation orders, primarily for areas that were previously placed under evacuation."}, {"id": "04c1eada-2353-4085-a867-8da10165223e", "title": "Baby twins killed in Gaza as father registered births", "date": "2024-08-14 01:15", "url": "https://www.myjoyonline.com/baby-twins-killed-in-gaza-as-father-registered-births/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "Newborn twins were killed in an Israeli airstrike in Gaza while their father was at a local government office to register their birth.\nThe strike also killed his wife and the twins' grandmother.\nAn Israeli military spokesman said the school \"served as an active Hamas and Islamic Jihad military facility\", which Hamas denied.\nHamas-led gunmen killed about 1,200 people in an attack on Israel on 7 October, taking 251 others back to Gaza as hostages.\nThat attack triggered a massive Israeli military offensive on Gaza and the current war."}, {"id": "d0f26f44-eb5e-4039-89be-ba612bbf057a", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:45", "url": "https://www.lbc.co.uk/world-news/fb64487d4b6544e2a59d63b5b056f2b1/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "The Israeli strike on Monday destroyed a home near the southern city of Khan Younis, killing 10 people.\nThree-month-old baby Reem Abu Hayyah is the only member of her family to survive an Israeli airstrike in the Gaza Strip late on Monday.\nA few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "795bda2a-99c8-402e-940e-0ae8ac95d6c7", "title": "A ship in the Red Sea is targeted in a third attack by suspected Houthis", "date": "2024-08-14 02:30", "url": "https://www.timesfreepress.com/news/2024/aug/13/a-ship-in-the-red-sea-is-targeted-in-a-third-attack-by-suspected-houthis/", "domain": "timesfreepress.com", "domain_classification": "Unknown", "message": "The ship was first attacked as an explosive was detonated near it, the British military's United Kingdom Maritime Trade Operations center said.\nThe Houthis have targeted more than 70 vessels with missiles and drones since the start of the war in Gaza in October.\nOther missiles and drones have been either intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets.\nAfter the strikes, the Houthis paused their attacks until Aug. 3, when they hit a Liberian-flagged container ship traveling through the Gulf of Aden.\nAdditional F-22 fighter jets have flown into the region, while the USS Wasp, a large amphibious assault ship carrying F-35 fighter jets, is in the Mediterranean Sea."}, {"id": "71db0dc6-a6b4-4f4a-88ff-ef61f0382bd7", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 03:30", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/08/14/three-month-old-girl-is-only-surviving-member-of-family-after-airstrike/", "domain": "jerseyeveningpost.com", "domain_classification": "Unknown", "message": "Three-month-old baby Reem Abu Hayyah is the only member of her family to survive an Israeli airstrike in the Gaza Strip late on Monday.\nA few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe Health Ministry in Gaza said 115 newborns have been killed in the territory since the war began.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "fbcbb278-dcd8-4255-96f8-46ee08f6f2c3", "title": "Gallant reveals from northern intelligence base :  We took out Hezbollah military ch", "date": "2024-08-14 01:15", "url": "https://www.ynetnews.com/article/hyvvcrt5r", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Gallant reveals from northern intelligence base: 'We took out Hezbollah's military chief from here'Defense minister says IDF intelligence personnel in north preparing for any potential scenario, focused on eliminating threats, all while readying all to strike wherever Israel chooses"}, {"id": "6493e1d4-94f7-4213-8ddd-5dc5769a7a02", "title": "Biden says Gaza ceasefire could stop Iran attacking Israel", "date": "2024-08-14 01:15", "url": "https://www.al-monitor.com/originals/2024/08/biden-says-gaza-ceasefire-could-stop-iran-attacking-israel", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "US President Joe Biden said Tuesday that a ceasefire deal in Gaza could deter Iran from attacking Israel in retaliation for the killing of a Hamas leader that sent regional tensions soaring.\nAsked if a truce between Israel and Hamas could stave off an Iranian assault, Biden said: \"That's my expectation\".\n- Far-right minister opposes talks -The United States and its European allies also called for a ceasefire between Israel and Hamas in Gaza, with truce talks to resume on Thursday.\n\"We must win and not go to the talks in Doha or Cairo,\" the minister said, referring to the truce talks planned for Thursday.\n- Baby pulled from rubble -Despite more than 10 months of fighting in Gaza, Hamas has still on occasion been able to fire rockets into Israel."}, {"id": "75b71649-1b8e-4c50-a96c-5e801c4d1931", "title": "8 US Troops Treated for TBI , Smoke Inhalation After Syria Attack , Pentagon Says", "date": "2024-08-14 02:15", "url": "https://www.military.com/daily-news/2024/08/13/8-us-troops-treated-tbi-smoke-inhalation-after-syria-attack-pentagon-says.html", "domain": "military.com", "domain_classification": "Unknown", "message": "Eight U.S. service members were treated for traumatic brain injury and smoke inhalation after a one-way drone attack in Syria over the weekend, a Pentagon spokesperson confirmed Tuesday.\nRyder stressed that \"none of the injuries are life-threatening,\" but provided no other details on the condition of the service members or the severity of the brain injuries.\nThe drone strike in Syria is the second time in recent weeks that U.S. troops in the Middle East have been injured.\nEarlier this month, the Pentagon announced the USS Abraham Lincoln carrier strike group was heading to the region to replace the USS Theodore Roosevelt strike group.\nRelated: As Tensions Simmer in the Middle East, Pentagon Redirects Carrier Strike Group to the Area"}, {"id": "c1dc6b48-ff8e-40c9-a68d-71e6ac6f0586", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 03:45", "url": "https://www.breakingnews.ie/world/three-month-old-girl-is-only-surviving-member-of-family-after-airstrike-1661090.html", "domain": "breakingnews.ie", "domain_classification": "Unknown", "message": "Three-month-old baby Reem Abu Hayyah is the only member of her family to survive an Israeli airstrike in the Gaza Strip late on Monday.\nAdvertisementMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nAdvertisementThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nAdvertisementHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "b0af38bf-6a71-4f3b-8533-71d97773cb27", "title": "Ilhan Omar wins primaries in Minnesota", "date": "2024-08-14 04:00", "url": "https://www.israelnationalnews.com/news/394592", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Rep. Ilhan Omar (D-MN) fended off several primary challengers and won the Democratic nomination for the House of Representatives in Minnesota's 5th Congressional District, NBC News projected.\nOmar defeated former Minneapolis City Councilman Don Samuels, who lost to the congresswoman by just 2 percentage points in the 2022 primary, and two other challengers.\nIn late June, group member Jamaal Bowman lost his Democratic primary in New York to Westchester County Executive George Latimer.\nOmar did not face an onslaught of attack ads from outside groups as did the other candidates from “The Squad” who were defeated in their primaries.\nOmar has recently come under fire again for her condemnation of Israel’s actions in the war against Hamas."}, {"id": "b3b202ca-dea9-47ad-a499-4720906298bf", "title": "Biden expects Iran not to attack if a ceasefire is reached", "date": "2024-08-14 01:15", "url": "http://www.israelnationalnews.com/news/394582", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "US President Joe Biden said Tuesday that he expects Iran to back down from its threats to attack Israel if a ceasefire deal with Hamas is reached this week.\n“That’s my expectation,” Biden told reporters when asked if he believes Iran will not strike if a deal is signed.\nWe believe getting to a ceasefire deal is the best way to de-escalate the tensions that we’re seeing,” Jean-Pierre told reporters.\nIran has threatened for the last two weeks to retaliate for the assassination of Hamas leader Ismail Haniyeh in Tehran on July 31.\nIsraeli and US officials have stated that they believe an Iranian attack on Israel could happen in the coming days."}, {"id": "8177e048-1212-43aa-a428-8b70a22b4c50", "title": "Latest Israeli Attacks on Gaza Kill 32 Palestinians ; Hamas Says Hostages Killed , Wounded", "date": "2024-08-14 01:00", "url": "https://havanatimes.org/news/latest-israeli-attacks-on-gaza-kill-32-palestinians-hamas-says-hostages-killed-wounded/", "domain": "havanatimes.org", "domain_classification": "Unknown", "message": "By Democracy NowHAVANA TIMES – Israel’s assault on the Gaza Strip continues, with at least 32 more Palestinians killed in the past 24 hours, according to the Health Ministry in Gaza.\nOne overnight strike by Israel on a home in Khan Younis killed 10 Palestinians and wounded several others.\nAnother Israeli attack leveled a residential building in Gaza City, burying residents in their homes.\nWe came to see what had happened, and we found that the Israeli military had hit the building.\nMeanwhile, the United Nations Security Council is set to meet today in the wake of Saturday’s devastating Israeli airstrike on a school in Gaza City that killed over 100 Palestinians."}, {"id": "0f62bafa-6737-46c8-ac83-cbf6f298e31e", "title": "Pentagon says an attack by Iran on Israel is  certainly possible  this week :  We need to take it seriously  ", "date": "2024-08-14 01:00", "url": "https://www.yahoo.com/news/pentagon-says-attack-iran-israel-223037844.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Pentagon says an attack by Iran on Israel is 'certainly possible' this week: ‘We need to take it seriously'A Pentagon spokesperson told reporters on Tuesday that an attack by Iran on Israel is \"certainly possible\" this week, adding that the threat needs to be taken seriously, so more resources are being maneuvered to the region.\n\"Is an attack possible this week?\nThat’s certainly possible,\" Ryder said.\nUS MILITARY EXPANDS PRESENCE IN MIDDLE EAST, REPOSITIONS FORCES AS REGIONAL TENSIONS SIMMERPentagon Press Secretary Maj. Gen. Pat Ryder said an attack by Iran is \"certainly possible\" this week.\nOriginal article source: Pentagon says an attack by Iran on Israel is 'certainly possible' this week: ‘We need to take it seriously'"}, {"id": "69c66966-8950-4b11-a153-d98753ef4493", "title": "Officials head to Middle East for Gaza ceasefire talks in race to stop conflict from spreading", "date": "2024-08-14 04:00", "url": "https://www.theglobeandmail.com/world/article-officials-head-to-middle-east-for-gaza-ceasefire-talks-in-race-to-stop/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The ceasefire talks, which are set to take place in Doha, Qatar, or Cairo, were expected to include top intelligence officials from Egypt, Israel and the United States, as well as the Qatari Prime Minister.\nHamas leaders have not met directly with Israeli officials throughout the war, relying on Qatar and Egypt to act as intermediaries.\nBut Mr. Netanyahu has added new conditions to Israel’s demands that his own negotiators fear have created obstacles to a deal, according to unpublished documents reviewed by The New York Times.\nThey said they were willing to present a “final bridging proposal” to close a deal between Israel and Hamas.\nIsrael has not acknowledged that it was behind the explosion, but U.S. officials have privately assessed that it was."}, {"id": "e5a26b56-0862-45ae-b066-f96bf71f84f6", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 03:30", "url": "https://www.bournemouthecho.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "bournemouthecho.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "2f7fbe55-9ef6-4447-933d-be6580733953", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 04:15", "url": "https://www.theargus.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "theargus.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "401cb84c-6ed1-4a3c-b083-77bf45ea4434", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:00", "url": "https://www.echo-news.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "echo-news.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "c9de6367-8424-4d8b-9fcc-a0bb0e96dfad", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:30", "url": "https://www.salisburyjournal.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "salisburyjournal.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "7400c797-6c48-42a4-882b-020283bbfb9e", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:30", "url": "https://www.lancashiretelegraph.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "00b2dca4-9698-46cd-b911-5be5a5450555", "title": "Fearing Iran attack , Israeli museum hides top artworks", "date": "2024-08-14 04:00", "url": "https://www.khaleejtimes.com/world/mena/fearing-iran-attack-israeli-museum-hides-top-artworks", "domain": "khaleejtimes.com", "domain_classification": "Unknown", "message": "A sign leads visitors to a \"protected space\" at the Tel Aviv Museum of Art in Tel Aviv on Tuesday.\n-- AFPPublished: Wed 14 Aug 2024, 7:16 AMAn Israeli museum that hid some of its most valuable artworks after the October 7 attack has now stashed away even more, fearing a strike by Iran.\nPaintings by Pablo Picasso and Gustav Klimt are among the treasures moved by Tel Aviv Museum of Art to the \"safe\" -- a secured basement meant to shield them from missiles.\nMuseum staff moved many of the masterpieces at the start of the Gaza war, which was triggered by the Palestinian group Hamas's unprecedented attack on Israeli soil on October 7.\n\"So we took down several other works of art and the ones we felt that were most in danger."}, {"id": "6d4504a4-71c6-454c-a571-54d3a1dd0f19", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:45", "url": "https://www.eadt.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "eadt.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "319ba8c1-6197-4f5b-85ad-34d7a82aa416", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 04:30", "url": "https://www.theboltonnews.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "theboltonnews.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "03b457dd-f2fb-47cb-8337-e91c65aba51d", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 04:00", "url": "https://www.thenorthernecho.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "thenorthernecho.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "41495bbb-6e8e-4971-a0ff-c90561202203", "title": "WATCH : Possible lightning bolt causes spark , dirt explosion outside Florida home", "date": "2024-08-14 03:45", "url": "https://www.fox4news.com/news/lightstrike-strikes-tree-florida-home", "domain": "fox4news.com", "domain_classification": "Unknown", "message": "Earlier this week, a Florida homeowner's security camera appeared to capture a powerful lightning strike, causing a loud boom, and apparently sending dirt flying into the air.\nDavid Houghton, who lives in Ocoee, Florida, shared the video with FOX 35.\nThey assumed it was a lightning strike.\nFOX 35 went through frame by frame.\nHe said it also signifies the importance that there is no safe spot outside when lightning is around and that lightning can strike anywhere."}, {"id": "028378f9-5705-4d64-957f-978af00a8e88", "title": "Israeli strikes on Gaza leave orphans , childless parents", "date": "2024-08-14 02:00", "url": "https://www.mercurynews.com/2024/08/13/israeli-strikes-on-gaza-leave-orphans-childless-parents/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "It has left parents without children and children without parents or siblings.\nThe Israeli strike late Monday destroyed a home near the southern city of Khan Younis, killing 10 people.\nThe dead included Abu Hayyah’s parents and five siblings, ranging in age from 5 to 12, as well as the parents of three other children.\nAround 84% of Gaza’s territory has been placed under evacuation orders by the Israeli military, according to the United Nations.\nAbuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "c4991f58-804d-4a93-a58d-4d29c94e3d00", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:30", "url": "https://www.eveningnews24.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "eveningnews24.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "235056e8-7784-41c0-b6df-74c2d05b3304", "title": "Israeli strikes on Gaza leave orphans , childless parents", "date": "2024-08-14 01:30", "url": "https://www.eastbaytimes.com/2024/08/13/israeli-strikes-on-gaza-leave-orphans-childless-parents/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "It has left parents without children and children without parents or siblings.\nThe Israeli strike late Monday destroyed a home near the southern city of Khan Younis, killing 10 people.\nThe dead included Abu Hayyah’s parents and five siblings, ranging in age from 5 to 12, as well as the parents of three other children.\nAround 84% of Gaza’s territory has been placed under evacuation orders by the Israeli military, according to the United Nations.\nAbuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "d3ace2ed-2883-46d7-879e-54cb290404a6", "title": "Israeli strikes on Gaza leave children without parents and parents without children", "date": "2024-08-14 02:30", "url": "https://www.news-gazette.com/news/nation-world/israeli-strikes-on-gaza-leave-children-without-parents-and-parents-without-children/article_8c7fd72b-32b9-5f4e-8a83-6d9782c03831.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "Israeli strikes on Gaza leave children without parents and parents without childrenA 3-month-old infant was the only member of her family to survive an Israeli airstrike in the Gaza Strip late Monday"}, {"id": "154eca60-a570-4a87-9607-6d0a245cd230", "title": "Israeli strikes on Gaza leave children without parents and parents without children", "date": "2024-08-14 00:15", "url": "https://13wham.com/news/nation-world/israeli-strikes-on-gaza-leave-children-without-parents-and-parents-without-children-08-13-2024", "domain": "13wham.com", "domain_classification": "Unknown", "message": "It has left parents without children and children without parents, brothers or sisters.\nThe dead included Abu Hayyah’s parents and five siblings, ranging in age from 5 to 12, as well as the parents of three other children.\nIsraeli Prime Minister Benjamin Netanyahu has often said that “they killed parents in front of their children and children in front of their parents” to illustrate the brutality of the attack, most recently in his address to the U.S. Congress last month.\nAround 84% of Gaza’s territory has been placed under evacuation orders by the Israeli military, according to the United Nations.\nAbuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "678ee47a-d37a-43ec-b504-9b30361cf6c9", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 02:30", "url": "https://www.oxfordmail.co.uk/news/national/24516818.three-month-old-girl-surviving-member-family-airstrike/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "A few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe dead included Reem Abu Hayyah’s parents and five siblings, ranging in age from five to 12, as well as the parents of three other children.\nHis wife Joumana Arafa, a pharmacist, had given birth four days ago and announced the twins’ arrival on Facebook.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "9a601278-ca32-4f19-a329-b4889528c472", "title": "Israeli strikes on Gaza leave children without parents and parents without children", "date": "2024-08-14 01:45", "url": "https://isp.netscape.com/news/world/story/0001/20240814/36c11d9bb2c01b094e4301bf4e197f0b", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Israeli strikes on Gaza leave children without parents and parents without childrenDEIR AL-BALAH, Gaza Strip (AP) — Reem Abu Hayyah, just three months old, was the only member of her family to survive an Israeli airstrike in the Gaza Strip late Monday.\nIt has left parents without children and children without parents or siblings.\nThe dead included Abu Hayyah's parents and five siblings, ranging in age from 5 to 12, as well as the parents of three other children.\nAround 84% of Gaza's territory has been placed under evacuation orders by the Israeli military, according to the United Nations.\nAbuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "04254f11-6fd3-4816-aa10-31b995eaaa8a", "title": "Israeli strikes on Gaza leave children without parents and parents without children", "date": "2024-08-14 04:15", "url": "https://www.adn.com/nation-world/2024/08/13/israeli-strikes-on-gaza-leave-children-without-parents-and-parents-without-children/", "domain": "adn.com", "domain_classification": "Unknown", "message": "(AP Photo/Abdel Kareem Hana)DEIR AL-BALAH, Gaza Strip — Reem Abu Hayyah, just three months old, was the only member of her family to survive an Israeli airstrike in the Gaza Strip late Monday.\nIt has left parents without children and children without parents or siblings.\nThe dead included Abu Hayyah’s parents and five siblings, ranging in age from 5 to 12, as well as the parents of three other children.\nMohammad Abu Al-Qumsan, Center, prays next to the bodies of his 4-day-old twin children, killed in the Israeli bombardment of the Gaza Strip, at a hospital in Deir al-Balah, Tuesday, Aug. 13, 2024.\nAbuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "b7d054df-88fd-4f4f-be2e-2f8d439739c5", "title": "Hezbollah launches rockets towards N . Israel - World News", "date": "2024-08-14 04:00", "url": "http://english.sina.com/world/2024-08-14/detail-inciqnpq7835402.shtml", "domain": "english.sina.com", "domain_classification": "Unknown", "message": "Earlier, Hezbollah had launched over 20 rockets from southern Lebanon at the Meron base in northern Israel, both al-Manar and Al Jazeera have reported.\nIsraeli warplanes launched airstrikes targeting the Lebanese villages of At Tiri, Haddatha, and Rchaf around midnight, NNA added.\nIsraeli warplanes also conducted airstrikes on the Lebanese villages of Kafr Kila and Khiam, as well as the municipality of Kunin, it noted.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel the day before.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place."}, {"id": "3e576a14-e5e8-487d-8ba2-c0d16cb6e2cb", "title": "Hezbollah launches rockets towards Israel", "date": "2024-08-14 02:30", "url": "https://www.prokerala.com/news/articles/a1555747.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Earlier, Hezbollah had launched more than 20 rockets from southern Lebanon at the Meron base in northern Israel, both al-Manar and Al Jazeera have reported.\nIsraeli warplanes launched airstrikes targeting the Lebanese villages of At Tiri, Haddatha, and Rchaf around midnight, NNA added.\nIsraeli warplanes also conducted airstrikes on the Lebanese villages of Kafr Kila and Khiam, as well as the municipality of Kunin, it noted.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel on October 7.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place."}, {"id": "86c2db0a-ef25-4297-94e2-5dc418c47326", "title": "Hezbollah launches rockets towards Israel", "date": "2024-08-14 02:30", "url": "https://www.prokerala.com/news/articles/a1555748.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Earlier, Hezbollah had launched more than 20 rockets from southern Lebanon at the Meron base in northern Israel, both al-Manar and Al Jazeera have reported.\nIsraeli warplanes launched airstrikes targeting the Lebanese villages of At Tiri, Haddatha, and Rchaf around midnight, NNA added.\nIsraeli warplanes also conducted airstrikes on the Lebanese villages of Kafr Kila and Khiam, as well as the municipality of Kunin, it noted.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas' attack on Israel on October 7.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place."}, {"id": "c839644e-6a26-4f53-9fa4-3901d71ea87d", "title": "Israel - Hamas war latest : Iran rejects European leader call to refrain from any retaliatory attacks", "date": "2024-08-14 03:30", "url": "https://lufkindailynews.com/anpa/us/israel-hamas-war-latest-iran-rejects-european-leaders-call-to-refrain-from-any-retaliatory-attacks/article_e521f39c-73df-57e6-b478-3133e456c82f.html", "domain": "lufkindailynews.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "2a381292-f9f6-4263-9274-1e16aa15ae64", "title": "Hezbollah launches rockets towards Israel", "date": "2024-08-14 04:15", "url": "https://www.siasat.com/hezbollah-launches-rockets-towards-israel-3078636/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "Beirut: Hezbollah attacked the Mount Neria base, a battalion leadership headquarters of Israel’s Golani Brigade forces, with volleys of Katyusha rockets late Tuesday night, according to state media.\nEarlier, Hezbollah had launched more than 20 rockets from southern Lebanon at the Meron base in northern Israel, both al-Manar and Al Jazeera have reported.\nIsraeli warplanes launched airstrikes targeting the Lebanese villages of At Tiri, Haddatha, and Rchaf around midnight, NNA added.\nTensions along the Lebanon-Israel border escalated on October 8, 2023, following a barrage of rockets launched by the Lebanese armed group Hezbollah toward Israel in solidarity with Hamas’ attack on Israel on October 7.\nHezbollah Secretary-General Hassan Nasrallah threatened a definite and painful response to the Israeli raid at the appropriate time and place."}, {"id": "24ac1970-10aa-41b2-8a8a-3f58c3248ce9", "title": "Gaza ceasefire : Hamas says again it wants implementation , not more talks", "date": "2024-08-14 03:45", "url": "https://www.asiaone.com/world/gaza-ceasefire-hamas-says-again-it-wants-implementation-not-more-talks", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "Two rockets had been fired from Gaza, the Israeli military said, one of which fell in the sea and the other had not reached Israeli territory.\nIsraeli airstrikes killed 19 Palestinians in the central and southern Gaza Strip on Tuesday, medics said.\nThe Israeli military and Islamic Jihad and Hamas said they were fighting in several areas of Gaza.\nCeasefire talksThe US said on Monday that it expected Gaza ceasefire talks slated for Thursday to go ahead as planned, and that an agreement was still possible.\nBut Hamas is demanding a workable plan to implement the proposal, presented by US President Joe Biden in May — rather than more talks."}, {"id": "c11f6097-dec9-4fbb-adf4-008a60a80ee3", "title": "Three - month - old girl is only surviving member of family after airstrike", "date": "2024-08-14 03:45", "url": "https://guernseypress.com/news/world-news/2024/08/14/three-month-old-girl-is-only-surviving-member-of-family-after-airstrike/", "domain": "guernseypress.com", "domain_classification": "Unknown", "message": "Three-month-old baby Reem Abu Hayyah is the only member of her family to survive an Israeli airstrike in the Gaza Strip late on Monday.\nA few miles to the north, Mohamed Abuel-Qomasan lost his wife and their twin babies — just four days old — in another strike.\nMore than 10 months into its war with Hamas, Israel’s relentless bombardment of the isolated territory has wiped out extended families.\nThe Health Ministry in Gaza said 115 newborns have been killed in the territory since the war began.\nMr Abuel-Qomasan and his wife had heeded orders to evacuate Gaza City in the opening weeks of the war."}, {"id": "0f9092dd-7808-435e-8e85-6e2111ca017d", "title": "Israeli strikes on Gaza leave children without parents and parents without children", "date": "2024-08-14 04:15", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/israeli-strikes-on-gaza-leave-children-without-parents-and-parents-without-children/article_4cf9307e-6c29-568c-840d-d2a088a3129d.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Israeli strikes on Gaza leave children without parents and parents without childrenA 3-month-old infant was the only member of her family to survive an Israeli airstrike in the Gaza Strip late Monday"}, {"id": "0b1efb0f-1171-4d25-89c2-1035b7efae34", "title": "Woman violently attacked at Pasadena Metro station faces  long - term disfigurement , officials say", "date": "2024-08-14 00:00", "url": "https://www.yahoo.com/news/woman-violently-attacked-pasadena-metro-231858358.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The woman violently attacked at a Pasadena Metro station and dragged onto the 210 Freeway is facing \"long-term disfigurement,\" officials said Tuesday.\nThe victim was at the Allen Metro station near Pasadena City College early Wednesday morning when a man approached her and, out of the blue, struck her in the face, authorities said.\nThe damage to her head and face was severe enough that \"there is potential for long-term disfigurement,\" the department said.\nJuan Pablo Flores, 33, was arrested Wednesday around 5:45 a.m., shortly after the attack occurred, the L.A. County district attorney's office said Monday.\nSign up for Essential California for news, features and recommendations from the L.A. Times and beyond in your inbox six days a week."}, {"id": "bf8f4f2c-7c7d-4e89-9fa3-e883972a46d7", "title": "Over 1 , 000 arrested following united kingdom disorder : police", "date": "2024-08-14 01:00", "url": "https://www.geo.tv/latest/559109-over-1000-arrested-following-uk-disorder-police", "domain": "geo.tv", "domain_classification": "Unknown", "message": "—ReutersRiots started following death of three girls in stabbing.\nUK police have arrested over 1,000 people in connection with riots that took place over the last two weeks in England, officials said on Tuesday.\n\"Forces across the country have now made more than 1,000 arrests in connection with the recent violent disorder,\" the National Police Chiefs’ Council (NPCC) said on X.\nFar-right riots took place after misinformation spread about the identity of the alleged perpetrator of the knife attack, with multiple people being jailed for spreading hate online in recent days.\nOne man, John Honey, pleaded guilty to helping attack a car with three Romanian men in it and assaulting police during riots in Hull, northeast England."}, {"id": "bceaeb35-8059-465e-a07d-0dc825b352f6", "title": "Only Gaza ceasefire can delay Iran Israel response", "date": "2024-08-14 02:15", "url": "https://economictimes.indiatimes.com/news/defence/only-gaza-ceasefire-can-delay-irans-israel-response/articleshow/112509086.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Three regional government sources described conversations with Tehran to avoid escalation ahead of the Gaza ceasefire talks, due to begin on Thursday in either Egypt or Qatar.\n\"We hope our response will be timed and executed in a way that does not harm a potential ceasefire,\" Iran's mission to the U.N. said on Friday in a statement.\n\"Iran's foreign ministry and its Revolutionary Guards Corps did not immediately respond to questions for this story.\n\"Laylaz said Iran had not previously been involved in the Gaza peace process but was now ready to play \"a key role.\n\"Iran wants its response to be much more effective than the April 13 attack,\" said Farzin Nadimi, senior fellow with the Washington Institute for Near East policy."}, {"id": "f34f4f21-2b3d-40cb-9a6b-c1d8931f73e1", "title": "Iran Rejects Western Plea to Drop Israel Retaliation Threats", "date": "2024-08-14 01:30", "url": "https://www.breitbart.com/politics/2024/08/13/iran-rejects-western-plea-to-drop-israel-retaliation-threats/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Iran on Tuesday categorically refused Western calls to drop its threat to retaliate against Israel for last month’s killing of Hamas terrorist leader Ismail Haniyeh in Tehran.\nIsrael has been blamed for Haniyeh’s killing on July 31 during a visit to the Iranian capital for the swearing-in of President Masoud Pezeshkian.\nIran has since been publicly vowing revenge and on Monday key Western allies urged it to reconsider, as Breitbart News reported.\nThe United States has deployed an aircraft carrier strike group and a guided missile submarine to the region in support of Israel.\n“Such a request lacks political logic, flies in the face of the principles and rules of international law, and constitutes public and practical support” for Israel."}, {"id": "d9a32578-b9ce-4544-bbff-7631bdda141e", "title": "Bombing Putin palace or seizing an even greater prize : Ukraine invasion of Russia puts the end within reach , writes MARK ALMOND", "date": "2024-08-14 02:00", "url": "https://www.dailymail.co.uk/debate/article-13739933/Bombing-Putins-palace-seizing-greater-prize-Ukraines-invasion-Russia-puts-end-reach-writes-MARK-ALMOND.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "In the last few weeks, Kyiv had been signalling it was open to peace talks with Moscow; not to surrender but to arrange an honourable settlement that preserves the country’s independence and recovers as much ground as possible.\nA week ago, an elite Ukrainian unit stormed the border and its forces have since seized some 400 square miles of Russian territory in the Kursk region.\nIt appears that the Ukrainians have adopted the great Soviet art of ‘maskirovka’ – deception in warfare – and taught Putin a lesson in over-confidence.\nThe invasion of Kursk in particular, the first foreign incursion into Russia since the Second World War, will have hurt Putin.\nThat war ended in total victory, but this war will end with a messy compromise."}, {"id": "c0c7ed47-fcc2-4172-8685-7c9a848889c8", "title": "Air Force acquisition chief talks drone wingmen , supply chains , and the B - 21", "date": "2024-08-14 02:00", "url": "https://www.defensenews.com/air/2022/06/27/air-force-acquisition-chief-talks-drone-wingmen-supply-chains-and-the-b-21/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The Air Force is arguing with a key contractor over a program that continues to be delayed.\nAnd the Air Force is watching the corporate unrest at Aerojet Rocketdyne following its failed acquisition by Lockheed Martin and open conflict between the company’s executive chairman and chief executive.\nAerojet is a key supplier of solid rocket motors used by the Air Force.\nHe previously covered leadership and personnel issues at Air Force Times, and the Pentagon, special operations and air warfare at Military.com.\nHe has traveled to the Middle East to cover U.S. Air Force operations."}, {"id": "ab1f35f3-84b2-403a-913b-e921cd506f5d", "title": "Former member of Japanese germ - warfare unit exposes war crimes in China - China . org . cn", "date": "2024-08-14 02:15", "url": "http://www.china.org.cn/china/2024-08/14/content_117365389.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "With black background and white characters, the inscription on the monument reads: \"The Japanese Army's Unit 731 committed unprecedented national crimes in world history in China.\"\nStanding in front of the monument, Shimizu put his palms together and bowed deeply.\nOn Tuesday afternoon, Shimizu visited the Exhibition Hall of Evidences of Crime Committed by Unit 731 of the Japanese Imperial Army.\nUnit 731 was a top-secret biological and chemical warfare research base established in Harbin as the nerve center for Japanese biological warfare in China and Southeast Asia during World War II.\nAt least 3,000 people were used in human experiments by Unit 731, while more than 300,000 people in China were killed by Japan's biological weapons."}, {"id": "dc7b6b28-ebcb-4a13-a037-06e0568d85fb", "title": "Kennedy confirmed as Air Force cyber boss", "date": "2024-08-14 02:00", "url": "https://www.defensenews.com/cyber/2022/06/27/kennedy-confirmed-as-air-force-cyber-boss/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "WASHINGTON — The Senate confirmed a new leader for the U.S. Air Force’s information warfare branch, the latest move in a shuffling of cybersecurity leadership in the military.\nAir Force Maj. Gen. Kevin Kennedy was approved by voice vote to head up the 16th Air Force (Air Forces Cyber) and receive his third star on June 23, roughly one month after President Joe Biden nominated him.\nThe 16th Air Force was created in late 2019, after the service combined and deactivated the 24th Air Force and the 25th Air Force.\nThe 16th Air Force is an amalgam of cyber, electronic warfare, intelligence and weather disciplines.\nSenators this year also confirmed a new head for Army Cyber Command as well as a new chief of Navy Fleet Cyber Command."}, {"id": "1914dfa4-c749-4d60-b4d1-da281dccee73", "title": "Japanese veteran testifies to Unit 731 crimes , apologizes", "date": "2024-08-14 02:00", "url": "http://www.ecns.cn/news/society/2024-08-14/detail-ihefeyrz1375381.shtml", "domain": "ecns.cn", "domain_classification": "Unknown", "message": "\"I would like to express my sincere apologies and repentance to the Chinese victims, the victims of Unit 731, and the deceased,\" he said.\nShimizu was about 14 years old and among the last batches of Unit 731 Youth Corps members when he was sent to Harbin in March 1945.\nHe spent more than four months witnessing the war crimes committed by his unit, including the cultivation of pathogens, human dissections and experiments on humans.\nAt least 3,000 people were used for human experiments by Unit 731, and more than 300,000 people across China were killed by Japan's biological weapons.\nBefore leaving China, Unit 731 tried to gun down all survivors and destroy incriminating evidence of the atrocities it committed."}, {"id": "c8847b58-4c19-4b2d-97bd-ea756a1dedc3", "title": "Russia Aspirational Grom Combat Drone Design Totally Changes , Ditches Stealth For Speed", "date": "2024-08-14 01:30", "url": "https://www.yahoo.com/news/russia-aspirational-grom-combat-drone-005226338.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A new Russian design for a ‘loyal wingman’-type supersonic drone has been unveiled, marking the country’s latest foray into unmanned combat air vehicles (UCAVs).\nA new Russian design concept for a ‘loyal wingman’-type drone has been unveiled, marking the country’s latest aspirational foray into unmanned combat air vehicles (UCAVs).\nA mockup of the new Grom drone is on display at the Army 2024 defense exhibition that is taking place in the Moscow region from August 12 to 14.\n@MuxelAeroOverall, the design of the new-look Grom appears to be optimized for high speed and maneuverability, rather than low observability and endurance.\nNonetheless, the dramatic changes in the appearance of the drone concept are interesting in themselves and may well reflect broader changes in Russia’s concept of how future advanced unmanned combat air vehicles should be employed."}, {"id": "9d445dfe-237c-43c8-aaa0-825749282db3", "title": "Jon Ossoff says there progress in efforts to bring a new fighter squadron to Moody Air Force Base", "date": "2024-08-14 01:30", "url": "https://www.ajc.com/news/jon-ossoff-says-theres-progress-in-efforts-to-bring-a-new-fighter-squadron-to-moody-air-force-base/RVVEBFL2PVBDRCDK2LDBZ3CAEI/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "614a5a2c-bea5-492e-9f26-80997dc42992", "title": "Russo - Ukraine War - 13 August 2024", "date": "2024-08-14 01:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-13.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nThe blogger has appealed to Russian water producing companies to supply Russian military bases with additional water in Rostov, Voronezh and Crimean air bases.\nIn the Sívers велиkomu direction, Ukrainian troops led nanívec С five attempts of the opponent to improve the tactical position near Verkhnyokamiansky and Spirny.\nUp to fifteen AFU personnel, two armoured fighting vehicles, and two motor vehicles were neutralised."}, {"id": "a40217c3-ee8e-48f9-b34c-7091f4207c12", "title": "Strengthening America Defense : Six Steps", "date": "2024-08-14 02:00", "url": "https://www.heritage.org/defense/report/strengthening-americas-defense-six-steps", "domain": "heritage.org", "domain_classification": "Unknown", "message": "Seven years ago th e Reagan Administration embarked on a military modernization program to rectify nearly a decade of neglect of U.S. military forces.\nThe Reagan Administration has improved C31 capabilities for strategic and conventional forces, but the job is by no means over.\nThe challenge is to ensure that the c ost of developing and building advanced technology weapon systems is worth the resulting capability.\nWhat the U.S. needs is a comprehensive program to bring together all of the potential uses of advanced technologies for conventional defense.\nh) that NATO develop and deploy an anti-tactical ballistic missile defense force for protection against Soviet shorter-range ballistic missiles."}, {"id": "a8709a02-3467-41d6-b835-284615671409", "title": "Purple Heart recipients recognized in Mercer County", "date": "2024-08-14 00:15", "url": "https://www.yahoo.com/news/purple-heart-recipients-recognized-mercer-222054399.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "About a dozen Purple Heart recipients came together at the Michael Marzano Outpatient Clinic in Hermitage.\nThe Purple Heart is a military decoration, awarded for being wounded or killed while serving our country.\nHe wanted to talk with other Purple Heart recipients and share stories.\nThe memories, the honor, the stories — the Butler VA Health Care System wanted to honor the Purple Heart recipients.\nMercer County has 40 registered Purple Heart recipients."}, {"id": "47733545-fbe1-4a71-bd0b-d757620f71cd", "title": "Moving Soldier Monument is city latest bad idea", "date": "2024-08-14 00:45", "url": "https://www.santafenewmexican.com/news/local_news/moving-soldiers-monument-is-citys-latest-bad-idea/article_80622006-5975-11ef-83f4-335138ffab6c.html", "domain": "santafenewmexican.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "ad40048d-8053-4d74-8150-55bd74000565", "title": "Georgia Sen . Jon Ossoff says there progress in efforts to bring a new fighter squadron to Moody Air Force Base", "date": "2024-08-14 04:00", "url": "https://www.stripes.com/branches/air_force/2024-08-13/fighter-squadron-moody-air-force-base-14857262.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "“It is a big deal to have the Chief of Staff of the United States Air Force in Georgia,” Ossoff said during a press conference at Moody.\nTen other bases already operate the model, as the Air Force moves from legacy systems to new systems, phasing out the A-10 “Warthog” model designed for close air support.\nThe A-10 “has been part of the backbone of the Air Force since the Cold War, but the reality is that the air defense threats that our Air Force will face moving forward put the A-10 at risk, and so the Air Force has to innovate,” Ossoff said.\nThe Southern Georgia base employs approximately 5,000 military and civilian personal, according to a DOD website.\n“The airmen, the service members and the Department of Defense, civilians and contractors who work here at Moody Air Force Base are 100% committed to our national security — they’ve given their careers to it,” Ossoff said."}, {"id": "7aae819d-fffb-47a0-bb37-4d8dfbd1ecc6", "title": "Harris Campaign Rips Trump Interview with Musk Despite Kamala Hiding from Media for 22 Days", "date": "2024-08-14 01:30", "url": "https://www.breitbart.com/politics/2024/08/13/harris-campaign-rips-trumps-interview-with-musk-despite-kamala-hiding-from-media-for-22-days/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Vice President Kamala Harris’s presidential campaign attacked former President Donald Trump’s interview with Elon Musk on Monday despite her avoiding an unscripted interview for 22 straight days.\nThe lack of interviews runs counter to the multitude of interviews the media typically conduct when candidates enter presidential races.\nThe media have not interviewed Harris on television since June 24, 2024.\n“Happy to host Kamala on an X Spaces too,” Musk posted on X Tuesday morning.\nHappy to host Kamala on an Spaces too — Elon Musk (@elonmusk) August 13, 2024"}, {"id": "f1fbb9d4-d919-4dd5-8d6a-f01f44e6c3e6", "title": "India develops indigenous Kamikaze drones ahead of 78th Independence Day : Report", "date": "2024-08-14 03:15", "url": "https://www.moneycontrol.com/news/india/india-develops-indigenous-kamikaze-drones-ahead-of-78th-independence-day-report-12795955.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "f08bcf0c-44b1-4081-84ab-fb3614935da8", "title": "How Hernán Cortés Conquered the Aztec Empire", "date": "2024-08-14 04:15", "url": "https://www.history.com/news/hernan-cortes-conquered-aztec-empire", "domain": "history.com", "domain_classification": "Unknown", "message": "How did Cortés manage to overthrow the seat of the Aztec Empire?\nWhen Spanish conquistadors arrived in the Aztec imperial city in 1519, Mexico-Tenochtitlán was led by Moctezuma II.\nHernándo Cortés Makes Allies with Local TribesUniversal History Archive/Getty Images Hernándo Cortés, Spanish conquistador who conquered Mexico, with Moctezuma II, last Aztec emperor, 1519.\nLeaving his top lieutenant Pedro de Alvarado in charge of Tenochtitlán, Cortés took men to attack the Spanish forces at the coast.\nIn Cortés' absence, Alvarado had hundreds of Aztec nobles killed during a ceremonial feast, leading to further unrest among the Aztec people."}, {"id": "58be7c6c-d356-409e-b924-d198c61c4cfb", "title": "Kindermann Corp . Archives", "date": "2024-08-14 01:30", "url": "https://nintendoeverything.com/tag/kindermann-corp/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "After it recently came to Switch, Shikon-X Astro Defense Fortress was given a new round of gameplay.\nThose interested in getting a closer look can see 25 minutes of footage.\nFor those that need a recap, here’s an overview of the title:"}, {"id": "dbdb1768-5dd7-44fb-bd4d-9bcb477dd5c6", "title": "Tim Walz defends his military record in first solo campaign speech at labor event", "date": "2024-08-14 04:00", "url": "https://www.stripes.com/theaters/us/2024-08-13/tim-walz-defends-military-record-14857500.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "Tim Walz pushed back on GOP attacks on his military service and the timing of his departure from the Army National Guard during his first solo campaign appearance a week after being named Vice President Kamala Harris’s running mate.\nI am damn proud of my service to this country.”The Trump campaign has tried to capitalize on the controversy over the timing of Walz’s retirement.\nWalz did not serve in combat, according to the Minnesota Army National Guard.\n“When were you ever in a war?” Vance said at a recent campaign event in Michigan in comments directed to Walz.\n“Hi Tim, I thank you for your service,” Vance wrote."}, {"id": "d01aa8bb-a8c2-499b-a70d-2c618b51519a", "title": "The Greens vs . The Blacks in  House of the Dragon , Explained", "date": "2024-08-14 02:45", "url": "https://www.marieclaire.com/culture/tv-shows/the-greens-and-the-blacks-house-of-the-dragon-hbo/", "domain": "marieclaire.com", "domain_classification": "Unknown", "message": "Why are they called the Greens and the Blacks in 'House of the Dragon?'\nTeam Rhaenyra, but in House of the Dragon, the sides are known by the subtler designations of the Greens and the Blacks.\nOutside of the Red Keep, the Greens have allied with House Hightower, House Lannister, House Baratheon, and House Tyrell, counting these Great Houses and their vassals among their army.\nHowever, one notable house that will remain undeclared throughout the Dance of the Dragons: House Martell of Dorne.\nHugh Hammer claims Vermithor, the second-largest living dragon, in House of the Dragon season 2."}, {"id": "febc1258-a381-4ca9-888c-25afb48fcccd", "title": "Tim Walz defends his military record in first solo campaign speech in labor event", "date": "2024-08-14 01:45", "url": "https://www.adn.com/nation-world/2024/08/13/tim-walz-defends-his-military-record-in-first-solo-campaign-speech-in-labor-event/", "domain": "adn.com", "domain_classification": "Unknown", "message": "Tim Walz pushed back on GOP attacks on his military service and the timing of his departure from the Army National Guard during his first solo campaign appearance a week after being named Vice President Kamala Harris’s running mate.\n“I firmly believe you should never denigrate another person’s service record,” Walz said at the convention of the American Federation of State, County and Municipal Employees (AFSCME).\nADVERTISEMENTWalz did not serve in combat, according to the Minnesota Army National Guard.\n“Hi Tim, I thank you for your service,” Vance wrote.\nOn the campaign trail, Trump had repeatedly faulted Biden for the rise in prices due to inflation."}, {"id": "a739b5c5-1f58-40ac-9f87-49a8bcc67c17", "title": "Today in history , August 14 : Unveiling the events that shaped history", "date": "2024-08-14 03:15", "url": "https://www.moneycontrol.com/education/today-in-history-august-14-unveiling-the-events-that-shaped-history-article-12795966.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "OTHERSOTHERSFollow us on:My AccountororHello, LoginAllToday in history, August 14: Unveiling the events that shaped history"}, {"id": "ad9ec040-7128-405a-8629-0d3e7a6272df", "title": "Kamala Names Muslim Liaison Who Wore Orange to Support Gitmo Terrorists", "date": "2024-08-14 00:30", "url": "https://www.frontpagemag.com/kamala-names-muslim-liaison-who-wore-orange-to-support-gitmo-terrorists/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "And now Kamala introduced Nasrina Bargzie, whom Freedom Center Investigates profiled on August 9th as her Muslim liaison.\nThis way, Kamala has a Jewish liaison who hates Israel and a Muslim liaison who hates Israel.\nIn 2011 she joined the Asian Law Caucus and went to war against Jewish students facing antisemitic harassment.\nNasrina Bargzie accused Jewish students and organizations of “organized legal bullying” for suing universities.\nAlongside her was Zahra Billoo, the local head of CAIR, with whom Nasrina Bargzie had co-signed the letter, who would defend Hezbollah and Hamas."}, {"id": "7b5a37ab-68d8-4a8f-840d-d6c47221a1e9", "title": "Tim Walz Finally Breaks Silence on Military Service Record but Completely Avoids Stolen Valor Scandal", "date": "2024-08-14 00:30", "url": "https://redstate.com/bobhoge/2024/08/13/tim-walz-finally-breaks-silence-on-military-service-recordbut-completely-avoids-stolen-valor-scandal-n2178081", "domain": "redstate.com", "domain_classification": "Unknown", "message": "Tim Walz, Kamala Harris’ running mate, appeared at the 2024 American Federation of State, County and Municipal Employees (AFSCME) convention in Los Angeles Tuesday and finally addressed the questions about his military service that have clouded his nomination.\nInstead of addressing those serious allegations, he chose to wax poetic about his call to service and his patriotism.\nAnd I firmly believe you should never denigrate another person's service record.\nWatch:The Trump team took note:WALZ: \"These guys are even attacking me for my record of service.\"\npic.twitter.com/Kcd5jNqBlB — Trump War Room (@TrumpWarRoom) August 13, 2024AdvertisementFor anyone thinking Walz would man up and address this controversy, they were left disappointed."}, {"id": "4198b359-140d-4f91-8892-67c935e97ae7", "title": "Palestinian Christians Plea With the Global Church to Stand With Them", "date": "2024-08-14 01:15", "url": "https://relevantmagazine.com/current/world/palestinian-christians-plea-with-the-global-church-to-stand-with-them/", "domain": "relevantmagazine.com", "domain_classification": "Unknown", "message": "A group of Christian leaders from Palestine, Egypt, Jordan, Lebanon, Syria and Iraq has issued a plea to Christians around the world to know that they exist and to stand with them in solidarity.\nRecent data shows that there are approximately 15 million Christians in the Middle East.\nWhile the leaders recognize that they are in the religious minority, they want the global Church to know that their region is not a lost cause and that Christians have been living there consistently for 2,000 years.\n“This requires compassion from the global Christian community.\nTogether, we can shape the Middle East into a vibrant epicenter of outreach.”"}, {"id": "e8c6ae4c-fd8c-4cc0-b079-aa143ac98592", "title": "What US Aircraft Carrier Turned Museum Is Docked In Corpus Christi , Texas ? ", "date": "2024-08-14 00:15", "url": "https://www.slashgear.com/1641892/corpus-christi-aircraft-carrier-uss-lexington-museum-about/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "The aircraft carriers employed by the United States Navy are truly works of engineering art.\nWhen you have a model of engineering on your hands like that, you put it to good use.\nEven if you have an aircraft carrier that's not actively engaging in maritime activities, it wouldn't be right to just let it rot in the ocean.\nAdvertisementSuch is the story of the oldest remaining Essex-class aircraft carrier, the USS Lexington.\nOriginally created to fight in World War II, the USS Lexington was nearing the end of its operational rope in the late 1980s."}, {"id": "adc77a59-74a6-4782-a045-df17de08167e", "title": "Tim Walz visits Southern California as Kamala Harri running mate", "date": "2024-08-14 01:45", "url": "https://www.nbclosangeles.com/news/local/tim-walz-visits-southern-california-for-first-time-as-kamala-harris-running-mate/3487559/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "\"AFSCME stands for the American worker,'' the vice presidential contender said, one week after Harris named him as her running mate.\nThe Republican Party of Orange County issued a statement criticizing Walz regarding his record in the Minnesota National Guard.\n\"It's a slap in the face to Orange County veterans for Tim Walz to fundraise off stolen valor in a community with over 100,000 veterans,'' the county GOP contended.\nTim Walz does not belong here and his stolen valor is not welcome in Orange County.\nOrange County Supervisor Katrina Foley, who will attend the fundraiser, criticized the county Republican Party's statement on Walz."}, {"id": "0d302051-f385-4599-a127-cd3a3d7d2359", "title": "The latest skirmish in the ongoing war on Western civilization * WorldNetDaily * by Jerry Newcombe", "date": "2024-08-14 02:45", "url": "https://www.wnd.com/2024/08/the-latest-skirmish-in-the-ongoing-war-on-western-civilization/", "domain": "wnd.com", "domain_classification": "Unknown", "message": "Last week, in the New York City college named after Christopher Columbus (the arch-villain to today’s anti-Western civilization), there were calls for the destruction of that very Western civilization.\nAdams Sabes, deputy editor of Campusreform.org, reported that anti-Israel groups at Columbia posted on Instagram: “We are Westerners fighting for the total eradication of Western civilization.\nWhat is Western civilization?\nHe did so much to rally his beleaguered countrymen during World War II to stave off the Nazi barbarians from taking over the British Isles.\nFranklin Roosevelt spoke regularly during World War II about protecting Christian civilization against the Nazis."}, {"id": "f8857677-37f6-4d08-b061-29f506276e7e", "title": "Malaysia assures safety of troops in Lebanon", "date": "2024-08-14 01:00", "url": "https://www.thestar.com.my/news/nation/2024/08/14/malaysia-assures-safety-of-troops-in-lebanon", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "The Defence Minister said his ministry is closely monitoring the situation, and the safety of more than 800 personnel and officers in the region.\n“Rest assured, we have developed options for our troops, and they will only be mobilised if absolutely necessary,” he told reporters after attending the Firepower Training Exercise 2024 at the Syed Sirajuddin Camp’s shooting range here yesterday, Bernama reported.\nThe event is a comprehensive field training exercise, involving all three branches of the Malaysian Armed Forces (MAF).\nMeanwhile, he noted that this year’s training exercise focused on utilising drones for reconnaissance and strike missions, enhancing the effectiveness of indirect fire with air support, as well as integrating ground operations with aerial support.\nIt is a critical exercise to evaluate and align our assets with the country’s needs, and those of other nations,” he added."}, {"id": "e72beaef-eea2-4b2e-b749-806fa6be23d9", "title": "Tim Walz speaks in LA in first solo appearance as VP candidate , shows support for unions", "date": "2024-08-14 01:00", "url": "https://www.foxla.com/news/tim-walz-in-los-angeles-newport-beach", "domain": "foxla.com", "domain_classification": "Unknown", "message": "Democratic vice presidential nominee Tim Walz gave his first solo speech in downtown Los Angeles Tuesday since becoming Kamala Harris' running mate.\nSUGGESTED: Tim Walz picked as Kamala Harris’ running mate\"AFSCME stands for the American worker,\" Walz said, in his speech.\nWhen Tim Walz was called to Iraq in the National Guard, he was the first to run.\"\nTim Walz does not belong here and his stolen valor is not welcome in Orange County.\nOrange County Supervisor Katrina Foley, who will attend the fundraiser, criticized the county Republican Party's statement on Walz."}, {"id": "bd955246-89ba-4fd8-b0b3-064b96942d14", "title": "Tim Walz Defends Military Service , Thanks JD Vance For His", "date": "2024-08-14 01:00", "url": "https://www.mediaite.com/politics/im-damn-proud-of-my-service-tim-walz-defends-military-record-and-thanks-jd-vance-for-his-service/", "domain": "mediaite.com", "domain_classification": "Unknown", "message": "Tim Walz (D), Kamala Harris’s running mate, took on the accusations regarding his military service record during a solo stump speech on Tuesday.\nWalz recalled how he was inspired by his father’s service during the Korean War to enlist when he was 17.\n“Then in 2005, I felt the call of duty again, this time of being service to my country in the halls of Congress.\nAnd I firmly believe you should never denigrate another person’s service record.\npic.twitter.com/DN0CjLqRWc — Acyn (@Acyn) August 13, 2024Watch the clip above and full speech here."}, {"id": "2d3c46c7-37df-423c-9c31-833134f73b2f", "title": "Sir Peter Cosgrove to attend Vietnam Veteran Day in Warrnambool | The Standard", "date": "2024-08-14 03:15", "url": "https://www.standard.net.au/story/8729600/sir-peter-cosgrove-to-attend-vietnam-veterans-day-in-warrnambool/", "domain": "standard.net.au", "domain_classification": "Unknown", "message": "Fought in monsoonal rains in the Long Tan rubber plantation where Aussie soldiers were outnumbered 10 to one by the Viet Cong, the battle was one of the biggest and most costly, although ultimately successful encounter of the 1962-73 war for Australia at the time.\nEighteen Diggers from D Company 6RAR lost their lives in the battle."}, {"id": "2a4eb357-e44a-4d46-98ef-c75bf6b62894", "title": "Hillary Clinton Attempts to Rescue Tim Walz After Stolen Valor Claims", "date": "2024-08-14 01:30", "url": "https://www.breitbart.com/politics/2024/08/12/hillary-clinton-attempts-rescue-embattled-vice-president-pick-tim-walz-stolen-valor-claims/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Hillary Clinton — who once falsely claimed she took sniper fire in Bosnia — attempted to come to the rescue of Minnesota Gov.\n“Tim Walz served honorably for two decades.\nThe post did not address Walz’s false claims over the last two decades of being a retired command sergeant major when he actually retired at a rank below.\nNor did her post address Walz’s false claim that he carried weapons “in war” when he never served in combat.\nThe Harris campaign actually posted that video on its X account before Walz’s false claims about his military record grew into a scandal."}, {"id": "428c175b-f634-45d8-a4c8-643522e38eef", "title": "Airpower History Tour coming to Colorado Springs", "date": "2024-08-14 02:00", "url": "https://www.yahoo.com/news/airpower-history-tour-coming-colorado-233322659.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(COLORADO SPRINGS) — The Airpower History Tour is coming to the Colorado Springs Airport from Wednesday, Aug. 28, to Sunday, Sept. 1, bringing the sights, sounds, and stories of World War II (WWII) aviation to life when the B-29 Superfortress “FIFI” along with a T-6 Texan and an RC-45J Expeditor land.\nThe event, which tours airports across North America, is presented by the Commemorative Air Force (CAF).\nVisitors will have the opportunity to view all aircraft up close, purchase rides, and tour the B-29 cockpit in between flights.\nIt is known as the aircraft that helped bring the war to an end with its mission flying over Japan.\nThe CAF has become the world’s largest flying museum, collecting and flying WWII aircraft for over six decades."}, {"id": "3206cb1f-9878-4669-8d7f-58048d974dcb", "title": "Backlash Against Tim Walz for Mischaracterizing  Stolen Valor  Claims", "date": "2024-08-14 03:15", "url": "https://www.breitbart.com/politics/2024/08/13/backlash-against-tim-walz-for-mischaracterizing-stolen-valor-claims/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "No one is denigrating his actual service record, they’re denigrating the lies he tells about his service record.\nWalz is dishonoring himself by embellishing his military service record for political gain.”“It’s not ‘degrading someone’s service record’ to point out that they lied about serving in combat repeatedly,” said retired USAF pilot Dale Stark.\nNo one is denigrating his actual service record, they're denigrating the lies he tells about his service record.\nhttps://t.co/R3ZX4A35GB — Tim Walz (@Tim_Walz) July 27, 2024A subsequent report from the Washington Free Beacon also claimed that Walz had previously presented himself as a veteran of Operation Enduring Freedom.\nTim Walz (D), who is facing accusations of stolen valor, allegedly falsely claimed in a previous press release that he was a veteran of Afghanistan."}, {"id": "9306130b-9a69-4fe1-a274-14d095a1fd1d", "title": "VP Candidate Walz Declares  When Unions Are Strong , America is Strong  at Local Convention", "date": "2024-08-14 00:45", "url": "https://mynewsla.com/government/2024/08/13/tim-walz-speaks-at-downtown-la-union-convention-newport-beach-fundraiser-next-2/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "The Republican Party of Orange County issued a statement criticizing Walz regarding his record in the Minnesota National Guard.\n“It’s a slap in the face to Orange County veterans for Tim Walz to fundraise off stolen valor in a community with over 100,000 veterans,” the county GOP contended.\n“From the Lyon Air Museum and Veterans Memorial in Orange to Heroes Hall in Costa Mesa and Sid Goldstein Freedom Park in Westminster, Orange County honors our veterans.\nTim Walz does not belong here and his stolen valor is not welcome in Orange County.\nWalz has a clear record supporting veterans while in the National Guard and during his time in office,” Foley added."}, {"id": "65ced4c6-f92e-417d-94cf-ba382d3d6204", "title": "Kyodo News Digest : Aug . 14 , 2024", "date": "2024-08-14 04:30", "url": "https://english.kyodonews.net:443/news/2024/08/e9a36e81c110-kyodo-news-digest-aug-14-2024--1-.html", "domain": "english.kyodonews.net", "domain_classification": "Unknown", "message": "KYODO NEWS - 4 hours ago - 09:40 | All, Japan, WorldThe following is the latest list of selected news summaries by Kyodo News.\nHiroshi Kasamatsu, 53, the merchandise division chief of Aeon Orange Co., left Yangon on Tuesday and arrived in Bangkok the same day without any major health problems.\n----------Olympics: PM Kishida welcomes back Japan's Paris OlympiansTOKYO - Japan's Olympians returned home from Paris on Tuesday to a heroes' welcome and a meeting with Prime Minister Fumio Kishida.\nMorita, who died in a hospital in Sao Paulo, had been a military police officer in the Japanese city at the time of the U.S. atomic bombing.\nVideo: Japan's Olympians return home from Paris Games"}, {"id": "4b0e13fd-ca4c-4347-a652-c20394115627", "title": "Moscow claims it thwarted a new Ukraine push into Russia", "date": "2024-08-14 00:15", "url": "https://www.mercurynews.com/2024/08/13/moscow-claims-it-thwarted-a-new-ukraine-push-into-russia/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "“Ukraine is not interested in taking the territory of the Kursk region, but we want to protect the lives of our people,” Tykhyi was quoted as saying by local media.\nHe said Russia had launched more than 2,000 strikes from the Kursk region in recent months using anti-aircraft missiles, artillery, mortars, drones, 255 glide bombs and more than 100 missiles.\n“The purpose of this operation is to preserve the lives of our children, to protect the territory of Ukraine from Russian strikes,” he said.\nUkraine’s undermanned army has struggled to hold back the bigger, better-equipped Russian forces in Donetsk.\nThe goals of the swift advance into the Kursk region have been a closely guarded military secret."}, {"id": "345d83d7-5ab3-4611-8230-88abb29048cd", "title": "NATO to boost readiness numbers , approve new Ukraine aid at Madrid summit", "date": "2024-08-14 02:00", "url": "https://www.defensenews.com/global/europe/2022/06/27/nato-to-boost-readiness-numbers-approve-new-ukraine-aid-at-madrid-summit/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "STUTTGART, Germany — NATO plans to approve increased readiness objectives and provide more support to Ukraine, as well as formalize a key strategic document at its annual summit this week, alliance Secretary-General Jens Stoltenberg said Monday.\nNATO is also planning to upgrade its defense plans, and pre-assign troops to defend specific allies.\nNATO plans to approve a new comprehensive aid package for Kiev, to include “partial deliveries” of capabilities like secure communications, unmanned systems and fuel, per Stoltenberg.\n“But of course, then we need to respond to that reality.”Stoltenberg lauded the fact that NATO members have increased defense spending for the eighth consecutive year.\nShe previously reported for National Defense Magazine, Defense Daily, Via Satellite, Foreign Policy and the Dayton Daily News."}, {"id": "3b90aef6-d832-4d7b-87c4-7ad05400f696", "title": "Moscow claims it thwarted a new Ukraine push into Russia", "date": "2024-08-14 01:30", "url": "https://www.eastbaytimes.com/2024/08/13/moscow-claims-it-thwarted-a-new-ukraine-push-into-russia/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "“Ukraine is not interested in taking the territory of the Kursk region, but we want to protect the lives of our people,” Tykhyi was quoted as saying by local media.\nHe said Russia had launched more than 2,000 strikes from the Kursk region in recent months using anti-aircraft missiles, artillery, mortars, drones, 255 glide bombs and more than 100 missiles.\n“The purpose of this operation is to preserve the lives of our children, to protect the territory of Ukraine from Russian strikes,” he said.\nUkraine’s undermanned army has struggled to hold back the bigger, better-equipped Russian forces in Donetsk.\nThe goals of the swift advance into the Kursk region have been a closely guarded military secret."}, {"id": "03f3f757-3862-4845-bad5-2cdecb0b8fbb", "title": "Will the attacks on Walz military service stick like they did to John Kerry 20 years ago ? ", "date": "2024-08-14 02:30", "url": "https://www.adn.com/nation-world/2024/08/13/will-the-attacks-on-walzs-military-service-stick-like-they-did-to-john-kerry-20-years-ago/", "domain": "adn.com", "domain_classification": "Unknown", "message": "“It is a very different world,” said Tad Devine, a senior adviser to Kerry’s 2004 campaign.\nKamala Harris’ campaign has pushed back against the attacks, but some Democrats worry Republicans might succeed in turning Walz’s military service into a liability.\nADVERTISEMENTIn 2004, Kerry and President George W. Bush, the Republican nominee, took public funding, receiving $74.6 million each from the government, barring them from private donations.\nCould attacks on Walz’s 24 years of military service boomerang on the Republican standard-bearer?\nThe former president has been criticized for avoiding military service over claims he suffered from bone spurs."}, {"id": "d164de67-faa0-4f49-a5c6-98e85c22e20c", "title": "Ukraine advance into Russian Kursk region halted , Moscow claims", "date": "2024-08-14 01:30", "url": "https://news.sky.com/story/ukraine-advance-into-russian-kursk-region-halted-moscow-claims-13196728", "domain": "news.sky.com", "domain_classification": "International", "message": "Russia has begun to thwart a week-long Ukrainian incursion into its Kursk region, Moscow has claimed.\nPlease use Chrome browser for a more accessible video player 3:44 How long can Ukraine hold Kursk?\nAccording to foreign ministry spokesman Heorhii Tykhyi, Ukraine is \"not interested\" in holding territory in Kursk long term.\nVladimir Putin has vowed to hit back at Ukraine with a \"worthy response\" - and has accused Kyiv's \"Western masters\" of helping Ukraine.\nVolodymyr Zelenskyy said the operation had shown Ukraine was \"capable of protecting its interests and independence\"."}, {"id": "4378b8a4-531b-43fb-ae6d-2cfe045fb18b", "title": "Chuck Johnson performs  The Night Before Gettysburg  for auditorium fundraiser", "date": "2024-08-14 00:30", "url": "https://www.perhamfocus.com/news/local/chuck-johnson-performs-the-night-before-gettysburg-for-auditorium-fundraiser", "domain": "perhamfocus.com", "domain_classification": "Unknown", "message": "PERHAM — Chuck Johnson performed his original one-act play, \"The Night Before Gettysburg,\" for a fundraiser hosted by the Friends of the Perham Auditorium on Thursday, Aug. 8, at 7 p.m.\nI want to talk about something of great pride, the Minnesota First Regiment,” Johnson said.\nChuck Johnson on stage at the Perham Auditorium while he portrays Abraham Lincoln sitting alone at his desk polishing his Gettysburg Address.\n“If the Battle of Gettysburg goes to the Confederates, there’s a 99 percent chance that the Union would not have won the Civil War,” Johnson continued.\nThe Confederates started fighting their way up that hill and the Minnesota flag bearer heard somebody call for a charge."}, {"id": "15a1a5a2-2a73-4730-b2c8-9949e553cfdf", "title": "Russia says it thwarted a Ukrainian charge to expand its incursion . Kyiv says it wont occupy land", "date": "2024-08-14 00:45", "url": "https://www.smdailyjournal.com/news/world/russia-says-it-thwarted-a-ukrainian-charge-to-expand-its-incursion-kyiv-says-it-wont/article_61b76f58-59b6-11ef-bb9e-eb6f808bfa4c.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "428a1385-2bfb-485c-b21c-c0e9542f2a01", "title": "House of the Dragon Review : Marching towards the dance", "date": "2024-08-14 03:15", "url": "https://www.jamaicaobserver.com/2024/08/13/house-dragon-review-marching-towards-dance/", "domain": "jamaicaobserver.com", "domain_classification": "Unknown", "message": "Daemon walks towards Rhaenyra in a scene from the House of the Dragon Season 2 finale.\nAlicent appears to have done a complete 180, retreating to old habits of nibbling at her fingertips when nervous.\n“I must take Aegon’s head, and I must do it for all to see,” Rhaenyra reminds Alicent.\nAlicent’s season 2 journey from self-righteous confidence to bitter resignation and self-contempt is one of the most fascinating elements of this season of House of the Dragon.\nHow did House of the Dragon get so woke?"}, {"id": "473df048-4714-4ca5-a25b-2fed9af2c3f4", "title": "Here What Tim Walz Had to Say During First Solo Address Since Joining the Ticket", "date": "2024-08-14 03:45", "url": "https://townhall.com/tipsheet/rebeccadowns/2024/08/13/tim-walz-uses-same-tiring-talking-points-in-first-solo-address-since-joining-the-ticket-n2643371", "domain": "townhall.com", "domain_classification": "Unknown", "message": "Tim Walz (D-MN) gave his first solo address since being added to the ticket.\n\"These guys have--are even attacking me on my record of service,\" Walz said, without responding to specific claims about stolen valor.\npic.twitter.com/9a9rJSQurQ — Tim Walz (@Tim_Walz) August 13, 2024Freakish Timothy Walz lied about carrying weapons into war.\nFREAKISH TIM WALZ: \"We respect our neighbors and we respect their personal choices.\"\nWhile Vance can take it, it doesn't mean that he should, and also shows that Walz can't exactly claim \"we respect\" anybody."}, {"id": "2fb14ec7-a4c9-434a-b9c7-ff65c705fe69", "title": "Russia says it thwarted a Ukrainian charge to expand its incursion . Kyiv says it wont occupy land", "date": "2024-08-14 03:15", "url": "https://lasvegassun.com/news/2024/aug/13/russia-says-it-thwarted-a-ukrainian-charge-to-expa/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Russia says it thwarted a Ukrainian charge to expand its incursion.\nMeanwhile, Ukrainian Foreign Ministry spokesman Heorhii Tykhyi said the cross-border operation was aimed at protecting Ukrainian land from long-range strikes launched from Kursk.\nHe said Russia had launched more than 2,000 strikes from the Kursk region in recent months using anti-aircraft missiles, artillery, mortars, drones, 255 glide bombs and more than 100 missiles.\nUkraine's undermanned army has struggled to hold back the bigger, better-equipped Russian forces in Donetsk.\nThe goals of the swift advance into the Kursk region have been a closely guarded military secret."}, {"id": "4639db59-7b46-41d6-afbf-417566197089", "title": "Russia says it thwarted a Ukrainian charge to expand its incursion . Kyiv says it wont occupy land", "date": "2024-08-14 03:30", "url": "http://lasvegassun.com/news/2024/aug/13/russia-says-it-thwarted-a-ukrainian-charge-to-expa/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Russia says it thwarted a Ukrainian charge to expand its incursion.\nMeanwhile, Ukrainian Foreign Ministry spokesman Heorhii Tykhyi said the cross-border operation was aimed at protecting Ukrainian land from long-range strikes launched from Kursk.\nHe said Russia had launched more than 2,000 strikes from the Kursk region in recent months using anti-aircraft missiles, artillery, mortars, drones, 255 glide bombs and more than 100 missiles.\nUkraine's undermanned army has struggled to hold back the bigger, better-equipped Russian forces in Donetsk.\nThe goals of the swift advance into the Kursk region have been a closely guarded military secret."}, {"id": "8eb34a12-5a38-4624-9077-1152d4eb1c9a", "title": "Oil Theft : Reps Seek Special Fund For NSCDC , Customs", "date": "2024-08-14 01:00", "url": "https://leadership.ng/oil-theft-reps-seek-special-fund-for-nscdc-customs/", "domain": "leadership.ng", "domain_classification": "Unknown", "message": "The House of Representatives Special Committee on Oil Theft/Losses has called for a particular intervention fund to enable the Nigeria Security and Civil Defence Corps (NSCDC) and Nigeria Customs Service (NCS) to perform optimally.\nAlhasan Ado Doguwa, said this on Tuesday during a special session/hearing on the Use of Special Intervention Funds to Combat crude oil theft in the country.\nThe chairman promised to ensure that the NSCDC is fully involved in the war against oil theft and losses in Nigeria.\nThe Commandant General of NSCDC, Ahmed Audi, said the Corps‘ core mandate is to protect critical national assets and infrastructure across the Country.\nRepresented by his deputy, Philip Ayuba, the Commandant General also said the corps has been unable to fully access the special intervention fund from any agencies to carry out its mandates."}, {"id": "797f228d-27aa-4e6d-b88d-aeb79ab3e359", "title": "Veterans Will Not Be Fooled By Tim Walz", "date": "2024-08-14 00:30", "url": "https://www.frontpagemag.com/veterans-will-not-be-fooled-by-tim-walz/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "But vets know what they see when they look at this guy and it’s not good.\nHe was a senior noncommissioned officer—a high-ranking sergeant who was frocked as a command sergeant major.\nYou need to understand what a command sergeant major is.\nHe wasn’t an actual command sergeant major either, only holding the rank temporarily contingent on passing the Sergeant Majors Academy course.\nThe command sergeant major is supposed to take care of them."}, {"id": "aaa2b8fe-d72c-4c96-bdfa-871830f227e8", "title": "China Is in Denial About the War in Ukraine", "date": "2024-08-14 01:15", "url": "https://www.foreignaffairs.com/china/china-denial-about-war-ukraine-jude-blanchette", "domain": "foreignaffairs.com", "domain_classification": "Unknown", "message": "China has, in fact, incurred costs as a result of Putin’s war and Beijing’s economic and diplomatic support for it.\nThese blind spots matter because in China, the war in Ukraine is serving as both an observatory and a laboratory as the country prepares for heightened geopolitical conflict with the United States.\nThat effort offered a “vivid demonstration of the tools of economic power” that the United States could muster, Li wrote.\nAlthough Western sanctions have not broken the Russian economy, the war in Ukraine has spurred further global economic fragmentation.\nRussia’s war on Ukraine offers general lessons about the complexities of modern warfare, the possibilities for an international response to a purportedly regional dispute, and the costs of a protracted military conflict."}, {"id": "c36e1b2b-29f8-4cf4-bdbb-ac4fc0d05e4f", "title": "Russia says it thwarted expanding Ukrainian charge", "date": "2024-08-14 02:45", "url": "https://www.stltoday.com/news/nation-world/russia-ukraine-war-kursk/article_06804d2f-2f99-5d52-87b1-261c962a2d5a.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine — Russia said Tuesday its forces checked an effort by Ukrainian troops to expand a stunning weeklong incursion into the Kursk region, as a Ukrainian Foreign Ministry spokesman said Kyiv has no intention of occupying Russian territory.\nMeanwhile, Ukrainian Foreign Ministry spokesman Heorhii Tykhyi said the cross-border operation was aimed at protecting Ukrainian land from long-range strikes launched from Kursk.\nHe said Russia launched more than 2,000 strikes from the Kursk region in recent months using anti-aircraft missiles, artillery, mortars, drones, 255 glide bombs and more than 100 missiles.\nUkraine's undermanned army has struggled to hold back the bigger, better-equipped Russian forces in Donetsk.\nThe goals of the swift advance into the Kursk region were a closely guarded military secret."}, {"id": "0ebf0982-0a53-46cf-8d30-e4aea76b2885", "title": "Ukraine deals blow to Putin narrative with Kursk offensive", "date": "2024-08-14 00:30", "url": "https://www.yahoo.com/news/ukraine-deals-blow-putin-narrative-205800553.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces are struggling to beat back Ukrainian troops who are now digging into the territory they grabbed in a widely praised counteroffensive.\nThough the country lowered the draft age earlier this year, it will take time to replenish troops, and that could impact Ukraine’s ability to hold territory in Kursk.\nKursk borders the northeastern Ukrainian region of Sumy, which neighbors Ukraine’s Kharkiv province, where Russian forces are still trying to advance.\n“Unlike Russia, Ukraine doesn’t need something that belongs to someone else,” he said in remarks shared by state-run media.\nAnd we will find another weak point in [the] Russian border, and will attack.”Copyright 2024 Nexstar Media, Inc. All rights reserved."}]