[{"id": "0024c332-6c91-41ac-9c9a-33fa33918168", "title": "Ernesto retains strength as hurricane over open Atlantic", "date": "2024-08-20 02:15", "url": "https://www.voanews.com/a/ernesto-retains-strength-as-hurricane-over-open-atlantic-/7749219.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "Ernesto picked up strength as a hurricane early Monday as it headed farther out into the Atlantic toward easternmost Canada, but the storm was expected to stay offshore, causing powerful swells, dangerous surf and rip currents along the U.S. East Coast, the National Hurricane Center said.\nErnesto's maximum sustained winds increased Monday to near 90 mph (150 kph), with higher gusts, the hurricane center said.\nSwells generated by Ernesto were affecting portions of Bermuda, the U.S. East Coast, as well as the Canadian Atlantic coast.\nLife-threatening surf and rip current conditions are likely in these areas during the next couple of days, the hurricane center said.\nForecasters, citing local emergency management, said a 41-year-old man drowned Saturday in a rip current at Surf City, North Carolina."}, {"id": "d0f835dd-0c82-46ee-9cea-d3f85bd55775", "title": "Hurricane Ernesto strengthens to Category 1 storm again ; dangerous conditions for East Coast beaches", "date": "2024-08-20 00:45", "url": "https://abc13.com/post/hurricane-ernesto-strengthens-category-1-storm-dangerous-conditions-east-coast-beaches/15203380/", "domain": "abc13.com", "domain_classification": "Unknown", "message": "Ernesto picked up strength as a hurricane early Monday as it headed farther out in the Atlantic toward easternmost Canada, but the storm is expected to stay offshore, causing powerful swells, dangerous surf and rip currents along the U.S. East Coast, the National Hurricane Center said.\nErnesto's maximum sustained winds increased Monday to near 90 mph (150 kph), with higher gusts, the hurricane center said.\nSwells generated by Ernesto were affecting portions of Bermuda, the U.S. East Coast, as well as the Canadian Atlantic coast.\nLife-threatening surf and rip current conditions are likely in these areas during the next couple of days, the hurricane center said.\nForecasters, citing local emergency management, said a 41-year-old man drowned Saturday in a rip current at Surf City, North Carolina."}, {"id": "503d4832-0e5a-4c38-93a0-d152300ff93d", "title": "Dramatic Video Shows Severe Flooding in Connecticut , 2 Dead", "date": "2024-08-20 01:00", "url": "https://www.tmz.com/2024/08/19/severe-flooding-connecticut/", "domain": "tmz.com", "domain_classification": "Unknown", "message": "Play video content APSevere flooding in Connecticut turned peaceful country roads into a disaster scene when at least a foot of water pounded down Sunday night.\nThe rainfall was much more than your everyday summer storm, as residents in Connecticut and parts of New York were trapped in cars, restaurants and homes, forcing multiple rescue attempts by first-responders.\nWatch the vid ... local firefighters in Oxford, Connecticut executed a daring rescue, pulling patrons trapped inside a restaurant to safety after gushing water flooded the building.\nLives have already been lost due to the rainfall ... the bodies of 2 women -- both residents of Oxford -- were recovered on Monday.\nProfessor of meteorology William Syrett compared the Connecticut-area storm to an oncoming train, telling AP News, \"perfect conditions\" for severe thunderstorms created excessive rainfall and flash floods."}, {"id": "51ba5194-29a7-45c1-b12f-7e1de3f8e8d7", "title": "Russian seismologists predict  monster  9 Richter magnitude earthquake", "date": "2024-08-20 01:15", "url": "https://www.ynetnews.com/environment/article/rkiqaplsr", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "A magnitude 7.1 earthquake struck near Kamchatka Saturday, with the epicenter located in the Pacific Ocean, approximately 108 km southeast of Petropavlovsk-Kamchatsky, at a depth of around 6 km.\nThe earthquake was felt in the regional capital, with magnitudes up to six.\nSeismologists from the Russian Academy of Sciences warn of an increased likelihood of an even more powerful earthquake, potentially reaching up to 9.0 magnitude, in the Kamchatka region within the next two days.\nIn 1952, a submarine earthquake of 9 Richter magnitude caused a tsunami with thousands reported dead.\nThis article was written in collaboration with Generative AI news company AlchemiqSources: Bankingnews.gr, Athensmagazine.gr , Aftodioikisi.gr, Newsbomb.gr, Ntdtv.com, Exbulletin.com, Foxweather.com, Radiolaprimerisima.com, Noi.md."}, {"id": "ea940c02-c07f-48d1-9e9d-a7abc91304e5", "title": "More Than 1 Million Left Without Running Water After Hurricane Fiona Ripped Through The Dominican Republic", "date": "2024-08-20 03:00", "url": "https://thetablet.org/more-than-1-million-left-without-running-water-after-hurricane-fiona-ripped-through-the-dominican-republic/", "domain": "thetablet.org", "domain_classification": "Unknown", "message": "(CNN) — Hurricane Fiona is continuing its ruinous path Tuesday after devastating Puerto Rico with flooding rain then ripping through the Dominican Republic, where more than a million people were left without running water and dozens of homes were destroyed.\nAt least three people have died the severe weather, including one in the French territory of Guadeloupe and two in Puerto Rico, according to officials.\nJuan Miguel Gonzalez, a business owner in Puerto Rico told CNN that his neighborhood had still not finished its recovery from Maria when Fiona struck.\nEmergency crews battled against unrelenting rain to rescue approximately 1,000 people as of midday Monday, said Maj. Gen. José Reyes, adjutant general of the Puerto Rico National Guard.\nNew York Governor Kathy Hochul also announced the state would send 100 state troopers to assist relief efforts in Puerto Rico."}, {"id": "e565bd52-a3f3-4619-bbe1-fcd24a5935d6", "title": "Homeowners forced to evacuate after fire rips through neighborhoods :  Arson investigators are still assessing the scene  ", "date": "2024-08-20 01:00", "url": "https://www.yahoo.com/news/homeowners-forced-evacuate-fire-rips-230000172.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Homeowners forced to evacuate after fire rips through neighborhoods: 'Arson investigators are still assessing the scene'A wildfire spread quickly after it developed around 60 miles east of Los Angeles, leaving officials investigating its origins.\nThe Edgehill Fire spread rapidly as temperatures in the area were climbing to over 100 degrees, as the Washington Post reported.\nResidents of Shandin Hills, a hillside community less than 2 miles from California State University in San Bernardino, were forced to evacuate, CBS News reported.\nThe combined year-to-date acres burned through the middle of August were more than seven times the amount burned during the same period in 2023, according to Cal Fire and the U.S. Forest Service.\nTaking small steps in caring for your yard, like upgrading to electric yard tools, mulching leaves, and composting yard waste, can help."}, {"id": "a7790f94-d9d3-4771-8bde-346d9aec1dee", "title": "Flash floods from  training thunderstorm leave 2 dead in Connecticut", "date": "2024-08-20 00:30", "url": "https://www.10news.com/weather/flash-floods-from-training-thunderstorms-leave-2-dead-in-connecticut", "domain": "10news.com", "domain_classification": "Unknown", "message": "Torrential rain flooded parts of Connecticut and New York's Long Island, washing out roads, trapping people in cars and a restaurant, and sweeping two people into a river.\nTwo women died in the storms, which also caused problems in New Jersey late Sunday and early Monday, authorities said.\nThe two women who died were stranded in separate cars, Oxford Fire Chief Scott Pelletier said at a news conference with other Connecticut officials.\nA dramatic rescue took place at a restaurant in Oxford, where the Brookside Inn became surrounded by a rushing torrent of water.\nThe unusual part was the amount of rain that fell over several hours, Syrett said, not the thunderstorms."}, {"id": "b65a4dd5-dae9-46b5-b80c-6b5ba987fb70", "title": "Expert pinpoints day weather warnings likely as tail end of Hurricane Ernesto heads towards Ireland", "date": "2024-08-20 09:00", "url": "https://www.irishmirror.ie/news/irish-news/hurricane-ernesto-ireland-weather-warning-33498887", "domain": "irishmirror.ie", "domain_classification": "Unknown", "message": "Current signs are that the weekend will be a mix of sunshine and showers, with highest temperatures of 18 degrees.\nHighest temperatures 14 to 18 degrees in moderate to fresh and gusty westerly winds, strong at times on western and northern coasts.\nHighest temperatures 14 to 18 degrees.\nHighest temperatures 14 to 18 degrees.\nSaturdaySunshine and showers on Saturday, highest temperatures 14 to 18 degrees with mostly moderate westerly winds."}, {"id": "19c645c8-6a4d-4784-9595-da09f194305e", "title": "Women killed as torrential rain flooded parts of Connecticut , Long Island", "date": "2024-08-20 01:30", "url": "https://www.cbc.ca/news/world/connecticut-long-island-flooding-hurricane-ernesto-1.7298513", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Torrential rain flooded parts of Connecticut and New York's Long Island, washing out roads, trapping people in cars and a restaurant, and sweeping two people into a river.\nMembers of Beacon Hose Co. rescue people from the Brookside Inn in Oxford, Conn., on Sunday.\n(Beacon Hose Co./The Associated Press)William Syrett, an associate professor of meteorology and atmospheric science at Penn State University, referred to the Connecticut-New York system as \"training thunderstorms.\"\n(Beacon Hose Co./The Associated Press)Barber pulled the trapped driver, Patrick Jennings, out of the floating car along with his golden retriever.\n(Beacon Hose Co./The Associated Press)Dan Panico, the supervisor for the town of Brookhaven, N.Y., called the flooding \"an environmental and economic disaster.\""}, {"id": "b8738893-9bb8-425d-ab16-7b4d66ca88b3", "title": "Best of Ken Hoffman : The challenges of planning a vacation to France", "date": "2024-08-20 02:15", "url": "https://houston.culturemap.com/news/travel/ken-hoffman-france-vacation/", "domain": "houston.culturemap.com", "domain_classification": "Unknown", "message": "Ken On The MoveBest of Ken Hoffman: The challenges of planning a vacation to France"}, {"id": "f04049a8-ca22-408e-a3ce-3eaf82c02840", "title": "Technical Discussion : A First Alert Weather Day as strong storms are moving through", "date": "2024-08-20 02:00", "url": "https://www.wfsb.com/page/technical-discussion-a-first-alert-weather-day-due-to-a-renewed-risk-for-pm-flooding/", "domain": "wfsb.com", "domain_classification": "Unknown", "message": "The CT record currently is from 1955, when 12.77″ was measured in Burlington (also from August 18-19).\nThe high in Bridgeport was 72°, setting a record for March 15th; previously, the record high was 65° from 1990.\nWhen it comes to temperature, it was the 9th warmest with an average temperature of 53.7° (4.2° above normal).\nFor Bridgeport, the record high for Saturday was 72 (from 1961), it was surpassed by 1 degree.\nFrom June 28th through August 12th, every day featured a high temperature at or above 80 in the Hartford Area."}, {"id": "12d218df-0c80-419e-860c-258c5ec07bdb", "title": "Connecticut : two women killed as heavy rain brings  devastating  floods | Connecticut", "date": "2024-08-20 02:00", "url": "https://www.theguardian.com/us-news/article/2024/aug/19/connecticut-women-killed-rain-floods", "domain": "theguardian.com", "domain_classification": "International", "message": "The Connecticut governor Ned Lamont, who declared a state of emergency, said more than 100 people were evacuated by search and rescue teams Sunday evening.\nState police identified them Monday afternoon as Ethelyn Joiner, 65, and Audrey Rostkowski, 71, both of Oxford.\nFirefighters were trying to get one of the women to safety when the flooded Little River swept her away, the Oxford fire chief Scott Pelletier said at a news conference with other Connecticut officials.\nAs of Monday afternoon, 27 state roads were closed but no interstates were affected, said Garrett Eucalitto, commissioner of the Connecticut transportation department.\nThe Waterbury branch of the commuter Metro-North Railroad remained closed due to flooding and damage from a mudslide, officials said."}, {"id": "337cbd58-390d-422d-8402-633be43f2fce", "title": "Storms With Repeated Downpours Will Accompany Slow - Moving Front : Here Timing , 5 - Day Forecast", "date": "2024-08-20 00:30", "url": "https://dailyvoice.com/connecticut/darien/frontal-system-will-bring-storms-with-repeated-downpours-heres-timing-5-day-forecast/", "domain": "dailyvoice.com", "domain_classification": "Unknown", "message": "AccuWeather.com states the storms will \"tap into a growing zone of warm and moist air from the Appalachians to the Atlantic coast.\nThis will lead to drenching showers, thunderstorms, and the possibility of localized severe weather and flash flooding.\"\nThere will be repeated downpours at times throughout Sunday and Monday.\n\"Isolated to scattered instances of flash flooding are possible today and tonight,\" the National Weather Service said in a Hazardous Weather Outlook statement issued early Sunday morning.\nThe outlook for Thursday, Aug. 22 calls for sunny skies, with a high in the upper 70s."}, {"id": "3ab3f3f4-97f8-4a72-8987-f0f036c1d7ce", "title": "Light earthquake , 4 . 3 mag strikes near Volcano Islands , Japan region", "date": "2024-08-20 08:45", "url": "https://www.earthquakenewstoday.com/2024/08/20/light-earthquake-4-3-mag-strikes-near-volcano-islands-japan-region-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.3 (ml/mb) has occurred on Thursday, Volcano Islands, Japan region (0 miles).\nThe earthquake occurred at a depth of 190.589 km (118 miles) below the earth’s surface.\nExact time and date of event in UTC/GMT: 25/07/24 / 2024-07-25 11:16:48 / July 25, 2024 @ 11:16 am.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: Volcano Islands, Japan region."}, {"id": "5f41b5c9-43f4-4199-a6fe-aa4ad2be0843", "title": "Northeast saw two instances of roughly 1 - in - 1 , 000 year rainfall in one night", "date": "2024-08-20 02:15", "url": "https://www.nbcnews.com/science/environment/northeast-two-instances-1-in-1000-year-rainfall-rcna167204", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "In two places on the same night, the storm that deluged the Northeast this weekend dumped rain at or near rates that should be expected only once in a thousand years.\nIt dropped about 10 inches of rain over 12 hours on Sunday in parts of Connecticut including Oxford and Southbury.\nAbout 35 miles away, about 6.7 inches of rain fell in three hours on Sunday night in Stony Brook, New York.\nMona Hemmati, a postdoctoral research scientist at Columbia University in New York City, said that's a relatively unusual setup for extreme rainfall.\nBassil said New York City’s sewer pipes are designed to handle about 1.75 inches of rainfall per hour."}, {"id": "807941e0-0e80-46e9-8585-2e8a93ea667e", "title": "Sarasota County inspecting stormwater system after significant flooding from Debby", "date": "2024-08-20 02:00", "url": "https://www.yahoo.com/news/sarasota-county-inspecting-stormwater-system-232647531.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Monday’s work focused on the two 48-inch drainage pipes that run under Palmer Boulevard and Lorraine Road.\n“We didn’t find any large debris or damage to the pipes that would have contributed to the overall flooding,” Anderson said.\n“What we are going to do next is, we are doing a hydraulic analysis of the overall stormwater system to evaluate what we designed for, and then also the storm event that we had from Tropical Storm Debby.\n“We had almost the same amount of water with Ian that we did with Debby, yet we flooded with Debby.\nResults from the broad analysis are expected in the next two to three months, according to the Public Works Director."}, {"id": "9ad8dfb6-3733-4e3c-b23d-96a0ac231cfa", "title": "On one night , two places in the Northeast get hit with 1 - in - 1 , 000 year rainfall", "date": "2024-08-20 01:30", "url": "https://www.yahoo.com/news/one-night-two-places-northeast-010049540.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "On one night, two places in the Northeast get hit with 1-in-1,000 year rainfallIn two places on the same night, the storm that deluged the Northeast this weekend dumped rain at or near rates that should be expected only once in a thousand years.\nIt dropped about 10 inches of rain over 12 hours on Sunday in parts of Connecticut including Oxford and Southbury.\nAbout 35 miles away, about 6.7 inches of rain fell in three hours on Sunday night in Stony Brook, New York.\nMona Hemmati, a postdoctoral research scientist at Columbia University in New York City, said that's a relatively unusual setup for extreme rainfall.\nBassil said New York City’s sewer pipes are designed to handle about 1.75 inches of rainfall per hour."}, {"id": "835711dd-0d1c-4284-9c38-772e6435d742", "title": "London set to be battered by Hurricane Ernesto remnants | united kingdom News", "date": "2024-08-20 06:45", "url": "https://metro.co.uk/2024/08/20/london-set-battered-hurricane-ernesto-remnants-21451538/", "domain": "metro.co.uk", "domain_classification": "Unknown", "message": "Up to 150mm of rain is expected in some parts if the country (Picture: Shutterstock)The UK is set to be battered by the remnants of Hurricane Ernesto this week, with heavy winds and rain set to put a dampener on the August summer holidays.\nHurricane Ernesto tore through the North Atlantic earlier this week, with winds of up to 100mph wreaking havoc in Bermuda and Puerto Rico and leaving thousands without power.\nThe Met Office has now issued a series of heavy rain warnings across the UK this week, with unsettled outbreaks of rain or showers spreading in from the west, the forecaster said.\nStrong winds of up to 60mph are also likely to start on Friday, mostly affecting the west and north of the country.\nDeputy Chief Meteorologist Tony Wisson added: ‘Newspaper headlines suggesting that Ernesto itself is set to batter Britain aren’t accurate."}, {"id": "0dd1eb3d-554a-4e3b-94eb-ae889255d62e", "title": "Floods from  training thunderstorm lead to dramatic rescues and 2 deaths in Connecticut", "date": "2024-08-20 01:30", "url": "https://lasvegassun.com/news/2024/aug/19/floods-from-training-thunderstorms-lead-to-dramati/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Floods from ‘training thunderstorms’ lead to dramatic rescues and 2 deaths in ConnecticutOXFORD, Conn. — Torrential rains turned streets into raging rivers in parts of Connecticut and New York's Long Island, trapping people in cars and a restaurant, covering vehicles in mud, and sweeping two women to their deaths, authorities said.\nFirefighters were trying to get the first woman to safety when the flooded Little River swept her away, Oxford Fire Chief Scott Pelletier said at a news conference with other Connecticut officials.\nBarber, 30, said he drove to higher ground and grabbed rope he keeps in his car for emergencies.\nJennings took off his prosthetic leg, and Barber wrapped his rope around the man’s waist and chest.\nBarber said he went back a third time to fetch Jennings’ prosthetic leg, which was bobbing next to his car."}, {"id": "3a2510b1-d808-4501-aa17-0b93caf4f8fa", "title": "Tropics Watch : Did the forecast of an  explosive  hurricane season fizzle out ? ", "date": "2024-08-20 01:00", "url": "https://www.clickorlando.com/weather/2024/08/19/tropics-watch-did-the-forecast-of-an-explosive-hurricane-season-fizzle-out/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Those were some of the words used to describe the 2024 hurricane season before it started.\nPrior to the season, however, we highlighted some limiting factors that could make the season less-“explosive” than what was forecast.\nACE is a metric that measures intensity and longevity of tropical storms and hurricanes.\nModel guidance suggests that this feature could trend south through September to align with the peak of hurricane season.\nThe peak of hurricane season is Sept. 10 and runs through November."}, {"id": "c51faf26-bcf1-4999-956b-698854a1ffa5", "title": "Wet and windy tomorrow night with possible flooding as Ireland in line for tail end of hurricane", "date": "2024-08-20 09:00", "url": "https://www.thejournal.ie/weather-forecast-38-6467106-Aug2024/", "domain": "thejournal.ie", "domain_classification": "Unknown", "message": "THE WEATHER IS expected to turn wet and windy tomorrow night as the remnants of Hurricane Ernesto make their way to Ireland’s shores.\nMet Éireann is predicting heavy and persistent rain with a chance of flooding as the tail end of Ernest passes eastwards over the country.\nAdvertisementOn top of the rain, the forecaster said there will be strong, gusty southerly winds that is expected to ease as the rain clears.\nLowest temperatures are expected to be between 12 and 16 degrees.\nThe last of the overnight rain and strong winds will clear from the east of the country early on Thursday morning, Met Éireann said."}, {"id": "749fdfe2-ab7a-4213-9e4e-9d43aa676c2c", "title": "Floods from  training thunderstorm lead to dramatic rescues , 2 deaths in Connecticut", "date": "2024-08-20 01:15", "url": "https://www.pennlive.com/nation-world/2024/08/floods-from-training-thunderstorms-lead-to-dramatic-rescues-2-deaths-in-connecticut.html", "domain": "pennlive.com", "domain_classification": "Unknown", "message": "Dramatic rescues unfolded as a foot (30 centimeters) of rain fell on some parts of western Connecticut late Sunday and early Monday, coming down so fast that it caught drivers unaware.\nFirefighters were trying to get one of the women to safety when the flooded Little River swept her away, Oxford Fire Chief Scott Pelletier said at a news conference with other Connecticut officials.\nAs of Monday afternoon, 27 state roads were closed but no interstates were affected, said Garrett Eucalitto, commissioner of the Connecticut Department of Transportation.\nThe Waterbury branch of the commuter Metro-North Railroad remained closed due to flooding and damage from a mudslide, officials said.\nBarber said he went back a third time to fetch Jennings’ prosthetic leg, which was bobbing next to his car."}, {"id": "824f840e-3507-4798-93d1-78aadbd74c00", "title": "Tri - State Region Shocked as Severe Floods Take 2 Lives , Leave Trail of Destruction", "date": "2024-08-20 02:00", "url": "https://www.insurancejournal.com/news/east/2024/08/19/789131.htm", "domain": "insurancejournal.com", "domain_classification": "Unknown", "message": "The National Weather Service (NWS) issued flash flood warnings for parts of New Haven, Fairfield, Litchfield, and Hartford counties in Connecticut and Suffolk County in New York.\nWater rescues were undertaken for multiple motorists stranded in Monroe.\nIn Stamford, the NWS reported there were multiple road closures and fire department water rescues most of Sunday morning.\nOn Monday, Suffolk County declared a state of emergency.\n“We are shocked at the amount of damage in Suffolk County,” said Suffolk County Executive Ed Romaine at a news conference."}, {"id": "6f771509-92b3-42cf-83fb-0357b7116c0e", "title": "Incredibly Rare  Doomsday Fish  Washes Up in La Jolla Cove", "date": "2024-08-20 01:45", "url": "https://www.theinertia.com/news/oarfish-doomsday-fish-la-jolla-san-diego/", "domain": "theinertia.com", "domain_classification": "Unknown", "message": "There are plenty of very strange creatures sharing the planet with us, but the oarfish is one of the strangest.\nNot just because of its looks, but because we don’t actually know all that much about how they lives their lives.\nAnd recently, beachgoers at La Jolla Cove were among a very select few humans who’ve ever laid eyes on one in person.\nKnown also as the “Doomsday Fish,” they are thought to be — by the superstitious, at least — a harbinger of disaster.\nThe dead fish will be examined by the Marine Vertebrate Collection at Scripps, and researchers are hoping to glean much-needed information about the animal."}, {"id": "7f099ec4-cdaa-45a7-9ac5-6141efc201d2", "title": "More Major Flooding in Several Central & Upstate New York Towns", "date": "2024-08-20 08:15", "url": "https://lite987.com/ixp/39/p/flooding-new-york/", "domain": "lite987.com", "domain_classification": "Unknown", "message": "Heavy rain caused more flooding in Central and Upstate New York.\nDestruction in LowvilleNearly 10 inches of rain fell in Lowville from Hurricane Beryl flooding cars, homes, roads, and even the school.\nCars SubmergedJeb's Restaurant saw 7 inches of water, leaving cars in the parking lot submerged.\nLowville School FloodedIt's a good thing school is out for the summer.\nHospital Parking Lot FloodsThe parking lot of the Lowville hospital was more like a raging river than a place to park."}, {"id": "52da6a79-d5c6-4ed0-87c4-4540e94e6d45", "title": "Floods from  training thunderstorm lead to dramatic rescues , 2 deaths in Connecticut", "date": "2024-08-20 02:15", "url": "https://www.centralmaine.com/2024/08/19/floods-from-training-thunderstorms-lead-to-dramatic-rescues-2-deaths-in-connecticut/", "domain": "centralmaine.com", "domain_classification": "Unknown", "message": "Dramatic rescues unfolded as a foot of rain fell on some parts of western Connecticut late Sunday and early Monday, coming down so fast that it caught drivers unaware.\nFirefighters were trying to get one of the women to safety when the flooded Little River swept her away, Oxford Fire Chief Scott Pelletier said at a news conference with other Connecticut officials.\nAs of Monday afternoon, 27 state roads were closed but no interstates were affected, said Garrett Eucalitto, commissioner of the Connecticut Department of Transportation.\nThe Waterbury branch of the commuter Metro-North Railroad remained closed due to flooding and damage from a mudslide, officials said.\nBarber said he went back a third time to fetch Jennings’ prosthetic leg, which was bobbing next to his car."}, {"id": "6d188edb-f6d9-4dcc-8075-d620056b82f1", "title": "385 lightning strikes recorded in coastal region during weekend storms", "date": "2024-08-20 02:45", "url": "https://www.timescolonist.com/local-news/385-lightning-strikes-recorded-in-coastal-region-during-weekend-storms-9370030", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "Wildfire Service reported 385 lightning strikes over two days within the Coastal Fire Region, an area that includes Vancouver Island.\nEnvironment Canada issued weather warnings for severe thunderstorms and lightning activity over the weekend in the capital region, east Island and southern Gulf Islands.\nAt least two wildfires were sparked by lightning strikes on Vancouver Island — one ­southwest of Shawnigan Lake and another south of Cumberland.\nThe lightning show on the south Island over the weekend was followed by heavy rainfall in some regions.\nThe lightning strikes on the Island may not be over just yet."}, {"id": "e0b343db-7733-4aa2-bad2-147002bfe4b8", "title": "Monsoonal moisture lingers , potential for gusty winds and hail in some parts", "date": "2024-08-20 02:00", "url": "https://www.yahoo.com/news/monsoonal-moisture-lingers-potential-gusty-233441737.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Monsoonal moisture is lingering in the Beehive State today which means more thunderstorms, but not like what we saw over the weekend.\nMost of the activity will be focused on the higher terrain, but isolated thunderstorms will still rumble across valleys around the I-15 corridor and the Great Salt Lake Desert in the late afternoon and evening hours.\nApart from the isolated thunderstorms, it’ll be a mix of sun and clouds for most.\nThe Storm Prediction Center has most of northern and central Utah in a “marginal risk,” which means some isolated thunderstorms could become severe.\nThe biggest threat will be damaging winds, but we could see some small hail in some of these cells."}, {"id": "136dfc66-83c3-4f6d-8609-e3ea091e92c4", "title": "First Alert Forecast | Taste of September on the way", "date": "2024-08-20 00:15", "url": "https://www.wsaz.com/2024/08/19/first-alert-forecast-taste-september-way/", "domain": "wsaz.com", "domain_classification": "Unknown", "message": "(WSAZ) - After the passage of a cold front, cool air is flooding into the region, allowing highs to only reach into the upper 70s today!\nAs high pressure works in from the north, northerly winds will only increase, and continue to reinforce late-September like air into the region.\nHighs will only reach into the mid 70s tomorrow afternoon, with overnight lows dropping into the upper 40s and lower 50s.\nThis high pressure will work to the region’s south and east, eventually allowing for the development of southerly winds into the overall area.\nAs high pressure remains in control, we’ll be seeing fairly dry conditions throughout the entire forecast period, unfortunately exasperating drought conditions that we have seen over the entire summer."}, {"id": "1e81d6e1-82ae-4f28-ac9c-8328af01d6be", "title": "NYC weather forecast : More storms come to tri - state Monday – NBC New York", "date": "2024-08-20 02:00", "url": "https://www.nbcnewyork.com/weather/weather-stories/nyc-weather-storms-monday-flooding-long-island-connecticut/5718910/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "Get ready for a bit more rain — but don't worry, it won't be a repeat of Sunday when flash flooding devastated much of the tri-state.\nStorms produced around two or three inches of rain per hour on Sunday as storms stalled over parts of our area, producing accumulations close to 10 inches for some and upwards of a foot for others.\nGet Tri-state area news delivered to your inbox.\nFortunately, Monday’s storms won’t be as impactful as Sunday’s, but on the heels of such heavy rain, an additional one or two inches is enough to cause more flooding.\nBeyond flooding, Monday’s storms could produce damaging wind gusts up to 60mph."}, {"id": "ed3b3564-5513-42fd-8f4e-b3c13042269b", "title": "New Zealand sheep and cattle numbers down as carbon forestry , drought and low prices affect sector", "date": "2024-08-20 01:00", "url": "https://www.nzherald.co.nz/nz/new-zealand-sheep-and-cattle-numbers-down-as-carbon-forestry-drought-and-low-prices-affect-sector/3IDZUEUM5RDDBMZZZWRUFEAGC4/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "Canterbury and Marlborough, which have been dealing with drought, had the biggest drop in sheep numbers – at 12.2%.\nHuge flow-on effectsBeef and Lamb New Zealand chairwoman Kate Acland says that a drop in sheep numbers is having a flow-on effect in rural communities.\nBeef and Lamb New Zealand chairwoman Kate Acland said with no recovery in sheep numbers in sight the flow on effects will continue.\nPhoto / RNZ, Carole StilesDespite beef prices performing really well this year, beef cattle numbers fell 2.8% to 3.55 million in the year to the end of June.\nLike the drop in sheep numbers, Canterbury and Marlborough had the biggest dip in cattle numbers at 10.7% due to drought-reducing feed levels."}, {"id": "88debb0a-e3fd-459a-ae9f-545f93d85759", "title": "New Zealand sheep and cattle numbers down as carbon forestry , drought and low prices affect sector", "date": "2024-08-20 00:45", "url": "https://www.nzherald.co.nz/the-country/news/new-zealand-sheep-and-cattle-numbers-down-as-carbon-forestry-drought-and-low-prices-affect-sector/3IDZUEUM5RDDBMZZZWRUFEAGC4/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "Canterbury and Marlborough, which have been dealing with drought, had the biggest drop in sheep numbers – at 12.2%.\nHuge flow-on effectsBeef and Lamb New Zealand chairwoman Kate Acland says that a drop in sheep numbers is having a flow-on effect in rural communities.\nBeef and Lamb New Zealand chairwoman Kate Acland said with no recovery in sheep numbers in sight the flow on effects will continue.\nPhoto / RNZ, Carole StilesDespite beef prices performing really well this year, beef cattle numbers fell 2.8% to 3.55 million in the year to the end of June.\nLike the drop in sheep numbers, Canterbury and Marlborough had the biggest dip in cattle numbers at 10.7% due to drought-reducing feed levels."}, {"id": "0720978e-ce12-4f35-b475-4483df21ef5d", "title": "June too soon ? – Warmer Sea Surface Temperatures fuels Major Hurricane Beryl as it ploughs through the Southern Grenadines", "date": "2024-08-20 00:30", "url": "https://www.nbcsvg.com/2024/08/19/june-too-soon-warmer-sea-surface-temperatures-fuels-major-hurricane-beryl-as-it-plows-through-the-southern-grenadines/", "domain": "nbcsvg.com", "domain_classification": "Unknown", "message": "‘Major Hurricane Beryl devastates the Southern Grenadines’ …’Beryl leaves a trail of destruction in the Eastern Caribbean’ …’Total devastation on Union Island as residents pick up the pieces following Major Hurricane Beryl’These are just a few of the headlines that one saw across their screens and online in the immediate aftermath of the passage of Hurricane Beryl.\nAbove : Record warm temperatures spread through most of the Tropical Atlantic, of note is how warm Sea Surface Temperatures were as Hurricane Beryl Closed in on St Vincent and the Grenadines on July 1st .\nAs it would pan out, Beryl tracked directly over the island of Carriacou, with the strongest winds in the north-eastern quadrant sweeping across Union Island, Mayreau, and Canouan in the Southern Grenadines.\nHeidi Badnock, a resident of Union Island with a population of just under 3,000, shared her personal experience as to how quickly things went downhill.\nHe saw members of the community coming together like those on Union Island to immediately clear the roadways and assist each other in securing property from the elements."}, {"id": "b241f3d2-5fb5-44bc-b77f-46dd328b671d", "title": "Flash floods from  training thunderstorm leave two dead in Connecticut | News , Sports , Jobs", "date": "2024-08-20 07:30", "url": "https://www.lockhaven.com/uncategorized/2024/08/flash-floods-from-training-thunderstorms-leave-two-dead-in-connecticut/", "domain": "lockhaven.com", "domain_classification": "Unknown", "message": "Two women died in the storms, which also caused problems in New Jersey late Sunday and early Monday, authorities said.\nThe two women who died were stranded in separate cars, Oxford Fire Chief Scott Pelletier said at a news conference with other Connecticut officials.\nA dramatic rescue took place at a restaurant in Oxford, where the Brookside Inn became surrounded by a rushing torrent of water.\nThe water was “literally enveloping this whole restaurant,” Jeremy Rodorigo, a firefighter from the neighboring town of Beacon Falls, said Monday.\nThe unusual part was the amount of rain that fell over several hours, Syrett said, not the thunderstorms."}, {"id": "81644653-e178-445f-a15f-025210bd639e", "title": "High bacteria levels persist in Charleston waterways after Debby rains", "date": "2024-08-20 01:30", "url": "https://www.live5news.com/2024/08/19/high-bacteria-levels-persist-charleston-waterways-after-debbys-rains/", "domain": "live5news.com", "domain_classification": "Unknown", "message": "They decide if a site is safe or unsafe to swim based on bacteria levels.\nThe state bacteria standard for safe water is less than 104 bacteria cultures per 100 milliliters of water.\nThe Swim Alert project tests bacteria levels at 20 popular sites so you know when and where it’s safe to swim, according to the Charleston Waterkeeper's website.\n(Charleston Waterkeeper)“When we have a lot of rain, like what happened with Tropical Storm Debby, we always expect high bacteria results.\n“It’s important to know because swimming or recreating in water with high bacteria levels can get you sick."}, {"id": "56815e87-353f-4244-b69f-93257a6872e4", "title": "Toronto seeing wettest summer ever as rainfall grips Eastern Canada", "date": "2024-08-20 09:30", "url": "https://globalnews.ca/news/10705294/toronto-montreal-rainfall-records/", "domain": "globalnews.ca", "domain_classification": "Unknown", "message": "Send this page to someone via emailIf you’re thinking there has been a lot of rain this summer in Toronto, you’re right.\nIn fact, many parts of Eastern Canada have been seeing a wetter than normal year – and with just over a month until summer ends, the country’s largest city has seen already seen its wettest summer ever.\nStory continues below advertisementToronto Pearson Airport recorded 128.3 millimetres of rainfall Saturday, according to Environment Canada.\n“Toronto (Pearson Airport) has had its wettest summer (June, July, August) on record with a rain total of close to 500 mm so far, beating the previous wettest summer on record in 2008,” he said.\n“Many urban drainage systems and structures are not designed to withstand a month’s worth of rain or more within just hours,” he said."}, {"id": "07078c18-983c-4684-b326-bfaf445f69d1", "title": "FEMA visits Lakewood Ranch residents to offer federal help", "date": "2024-08-20 01:45", "url": "https://www.mysuncoast.com/2024/08/19/fema-visits-lakewood-ranch-residents-offer-federal-help/", "domain": "mysuncoast.com", "domain_classification": "Unknown", "message": "LAKEWOOD RANCH, Fla. (WWSB) - On Monday, representatives from the Federal Emergency Management Agency went door-to-door in the Summerfield community to speak with neighbors and offer help in the form of federal emergency funds after damage left behind in the wake of Hurricane Debby.\nFurniture, clothing, drywall, and appliances line the curbside outside many homes along Clubhouse Drive with many long-time neighbors saying the storm surge was something they’d not seen before in Lakewood Ranch.\nHe said he’s glad now that he took out a flood insurance policy several years ago.\nFEMA officials have set up a Disaster Recovery Center at the Lakewood Ranch Library at 16410 Rangeland Parkway which operates from 9 a.m. until 7 p.m. daily.\nTo find out more about federal emergency grants from FEMA, and a deadline to register, visit disasterassistance.gov or call 800-621-3362."}, {"id": "8e045a14-8f68-42ac-a71c-783aaffbb7f0", "title": "Paradise Gives Free Data After Hurricane Ernesto", "date": "2024-08-20 01:00", "url": "https://bernews.com/2024/08/paradise-gives-free-data-after-hurricane-ernesto/", "domain": "bernews.com", "domain_classification": "Unknown", "message": "Paradise Mobile is offering free unlimited data for seven days to help Bermuda’s community stay connected following Hurricane Ernesto.\nA spokesperson said, “In the wake of Hurricane Ernesto, Paradise Mobile, Bermuda’s fastest and most innovative network, is stepping up to support the community by offering free service with unlimited data for seven days.\nBy offering free unlimited data for seven days, Paradise Mobile aims to help the community stay in touch with loved ones and access important information with no strings attached.\n“Paradise Mobile launched in December and has already disrupted the telco industry in Bermuda by offering data more than two times faster than competitors and plans with unlimited data at much lower price points.\nThe team is on standby to assist in getting you connected as quickly as possible.”“We’re more than just a mobile network; we’re part of the community,” added Tabbara."}, {"id": "8ac237e0-dcda-47bd-954e-f8433447c800", "title": "10 of the Biggest Tornadoes in History", "date": "2024-08-20 00:30", "url": "https://www.mentalfloss.com/posts/biggest-tornadoes-in-history", "domain": "mentalfloss.com", "domain_classification": "Unknown", "message": "/ Missouri History Museum, Wikimedia Commons // Public DomainStriking St. Louis on May 27, 1896, this tornado is considered the third deadliest in American history.\nFor example, most tropical storm tornadoes are rated EF0 to EF1 (like 91.5 percent of the tornadoes in the 2004-2005 hurricane season) and don’t last long.\nBetween September 15–17, 2004, Hurricane Ivan delivered 120 tornadoes, unseating 1967’s Hurricane Beulah (which spawned 115) as the biggest producer in U.S. history.\nSpring Tornado Outbreaks of 2011 // Eastern, Central, and Southern U.S.A tornado outbreak flattened homes in Joplin, Missouri, in 2011.\nOutbreaks began with 30 tornadoes in the Carolinas and Virginia, followed by two supercell thunderstorms near St. Louis delivering five tornadoes, one of which was an EF4."}, {"id": "41495d48-c3af-43f9-9c9e-1a08c59cf301", "title": "Hurricane Ernesto update : NYC beaches closed again Tuesday – NBC New York", "date": "2024-08-20 02:00", "url": "https://www.nbcnewyork.com/news/local/nyc-beaches-remain-closed-tuesday-ernesto-rip-current/5719093/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "Swimming was initially prohibited at city beaches in Brooklyn and Queens through Sunday, but city officials extended the closure through Tuesday due to extended rip current threat.\nOn top of potentially life-threatening rip currents, forecasters were predicting ocean swells of up to 6 feet and wind gusts at 12 mph.\nThe dangerous rip current conditions are expected to remain in place at least for one more day.\n(Here's why rip currents are so threatening, and what to do if you find yourself in one.)\nIn New Jersey, state officials warned beachgoers to watch for rip currents and keep their feet in the sand until a lifeguard is on duty."}, {"id": "ca2a6409-74ea-4f92-a5de-bdc0e9d0174c", "title": "PLP Chair Thanks Community For Resilience", "date": "2024-08-20 01:00", "url": "https://bernews.com/2024/08/plp-chairman-thanks-community-for-resilience/", "domain": "bernews.com", "domain_classification": "Unknown", "message": "“”On behalf of the Bermuda Progressive Labour Party, I wish to express my heartfelt gratitude that Bermuda was spared the loss of life and extensive damage during Hurricane Ernesto,” PLP Chairperson Dawn Simmons said.\nMs Simmons said, “We are deeply thankful for the resilience and unity displayed by our community in the face of this formidable storm.\n“We owe them our deepest thanks for their professionalism and sacrifice, working around the clock to protect and serve us all.\n“We know that each of us has busy lives and personal challenges to deal with.\nBut wherever you can, we encourage you to become a greater part of helping our country and our people grow towards its full potential."}]