[{"id": "2282417a-3dd8-404c-8902-157ffc3f9b43", "title": "John Morales on this tropical disturbance and longer - range outlooks – NBC 6 South Florida", "date": "2024-08-02 05:30", "url": "https://www.nbcmiami.com/weather/hurricane-season/john-morales-tropical-disturbance-longer-range-forecasts/3379591/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "But the National Hurricane Center (NHC) began alerting us about a possible new tropical storm forming in the Atlantic seven days ago.\nNHC implemented a new longer-range Tropical Weather Outlook (TWO) this year.\nEven local National Weather Service offices have been compelled to send unscheduled messages to the public clarifying that little is known about what, if anything, could happen with the tropical disturbance.\nIt remains a tropical wave today as it moves across the Greater Antilles, namely eastern Cuba, likely on its way to the Gulf of Mexico.\nIt could still impact Florida, at minimum with rain, but still possibly as a tropical storm should it finally gain strength in the Gulf."}, {"id": "83367a5d-9912-4e37-a002-399e868033b5", "title": "Review of The Rumbling Earth The Story of Indian Earthquakes : Ground beneath India feet", "date": "2024-08-02 04:15", "url": "https://www.thehindu.com/books/books-reviews/earthquake-india-natural-disaster-building-collapse-lives-lost-casualty-environment/article68459616.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Rajendran and Kusala Rajendran in their book, The Rumbling Earth: The Story of Indian Earthquakes.\nSuch anecdotes pepper this accessible, concise history of earthquakes, which is exceptional in that it comes from an Indian vantage.\nOnly in the decade that men landed on the moon did earth scientists conclusively establish the theory explaining these links.\nPlate tectonics, as this theory is called, also explains the formation of continents, volcanic activity, tsunamis and the intensity and timing of earthquakes.\nThe Rumbling Earth: The Story of Indian Earthquakes; C.P."}, {"id": "d87cfc67-eed3-4a53-aaa2-1ad01ffb251c", "title": "Light earthquake : M4 . 8 quake has struck near the Loyalty Islands", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-8-quake-has-struck-near-the-loyalty-islands-6/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.8 (ml/mb) has occurred on Saturday, southeast of the Loyalty Islands (0 miles).\nId of earthquake: us6000nhe6.\nDate and time of earthquake in UTC/GMT: 20/07/24 / 2024-07-20 21:01:21 / July 20, 2024 @ 9:01 pm.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: southeast of the Loyalty Islands."}, {"id": "dcbfa18e-ed5d-45af-8da2-b5386aa749f7", "title": "Light earthquake : M4 . 6 quake has struck near Port - Vila in Vanuatu", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-6-quake-has-struck-near-port-vila-in-vanuatu-7/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.6 (ml/mb) has occurred on Saturday, 68 kilometers (42 miles) from Port-Vila in Vanuatu.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nEvent ids that are associated to the earthquake: us6000nhdv.\nThe epicenter was 69 km (43 miles) from Port-Vila (c. 35 900 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 68 km WNW of Port-Vila, Vanuatu."}, {"id": "8f3e3fd5-9b15-4faa-86fb-76ea1905ad82", "title": "Light earthquake , 4 . 2 mag has occurred near Vilyuchinsk in Russia", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-2-mag-has-occurred-near-vilyuchinsk-in-russia-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) has struck on Saturday, 147 km SSE of Vilyuchinsk, Russia (91 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 4.2-magnitude earthquake has occurred at 23:22:37 / 11:22 pm (local time epicenter).\nExact location of earthquake, 159.103° East, 51.6784° North, depth 50.108 km.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 147 km SSE of Vilyuchinsk, Russia."}, {"id": "2aecf8f6-f876-470c-adfe-5754dd86e884", "title": "Light earthquake : M4 . 5 quake has struck near Yomitan in Japan", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-5-quake-has-struck-near-yomitan-in-japan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.5 (ml/mb) has struck on Thursday, 50 kilometers (31 miles) from Yomitan in Japan.\nExact location of earthquake, longitude 127.2416 East, latitude 26.4762 North, depth = 51.946 km.\nThe earthquake was roughly at a depth of 51.946 km (32 miles).\nCountry/countries that might be effected, Japan (c. 127 288 000 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 50 km W of Yomitan, Japan."}, {"id": "a7095490-eb1c-45b7-91b1-7ade1fca2aa5", "title": "Light earthquake 4 . 6 mag , 39 km SW of Rabaul , Papua New Guinea", "date": "2024-08-02 05:00", "url": "https://www.earthquakenewstoday.com/2024/08/02/light-earthquake-4-6-mag-39-km-sw-of-rabaul-papua-new-guinea/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.6 (ml/mb) was detected on Friday, 39 kilometers (24 miles) from Rabaul in Papua New Guinea.\nExact location of earthquake, 151.9283° East, -4.4699° South, depth 156.303 km.\nThe epicenter was 39 km (24 miles) from Kokopo (c. 26 300 pop), 41 km (25 miles) from Rabaul (c. 8 100 pop).\nNearby country/countries that might be effected, Papua New Guinea (c. 6 065 000 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 39 km SW of Rabaul, Papua New Guinea."}, {"id": "2521f7ee-e326-4d22-b321-067a23ee6126", "title": "Light earthquake , 4 . 6 mag was detected near Yalina in Mexico", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-6-mag-was-detected-near-yalina-in-mexico/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.6 (ml/mb) was reported 4 kilometers (2 miles) from Yalina in Mexico on Thursday.\nThe earthquake occurred at a depth of 63.306 km (39 miles).\nId of earthquake: us6000nhf7.\nThe 4.6-magnitude earthquake has occurred at 19:19:01 / 7:19 pm (local time epicenter).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 4 km NW of Yalina, Mexico."}, {"id": "2be06276-0955-4c89-8c3f-26f95adbc1ee", "title": "Moderate earthquake , 5 . 1 mag was detected near Campana in Italy", "date": "2024-08-02 00:15", "url": "https://www.earthquakenewstoday.com/2024/08/01/moderate-earthquake-5-1-mag-was-detected-near-campana-in-italy/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A moderate earthquake with magnitude 5.1 (ml/mb) was detected on Thursday, 2 kilometers (1 miles) from Campana in Italy.\nThe epicenter was at a depth of 25.686 km (16 miles).\nNearby country/countries that might be effected, Italy (c. 60 340 000 pop).\nIn the past 24 hours, there have been one, in the last 10 days one, in the past 30 days one and in the last 365 days three earthquakes of magnitude 3.0 or greater that has occurred nearby.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 2 km W of Campana, Italy."}, {"id": "f1f929f1-e60b-4100-bfed-4d8f17950ef0", "title": "SHAREHOLDER ALERT : Pomerantz Law Firm Investigates Claims On Behalf of Investors of CenterPoint Energy , Inc . ", "date": "2024-08-02 00:00", "url": "https://www.prnewswire.com/news-releases/shareholder-alert-pomerantz-law-firm-investigates-claims-on-behalf-of-investors-of-centerpoint-energy-inc---cnp-302212818.html", "domain": "prnewswire.com", "domain_classification": "Unknown", "message": "NEW YORK, Aug. 1, 2024 /PRNewswire/ -- Pomerantz LLP is investigating claims on behalf of investors of CenterPoint Energy, Inc. (\"CenterPoint\" or the \"Company\") (NYSE: CNP).\nThe investigation concerns whether CenterPoint and certain of its officers and/or directors have engaged in securities fraud or other unlawful business practices.\nAt a press conference on July 14, 2024, Texas Governor Greg Abbott said that he was demanding an investigation into CenterPoint's response to Hurricane Beryl.\nFounded by the late Abraham L. Pomerantz, known as the dean of the class action bar, Pomerantz pioneered the field of securities class actions.\n7980SOURCE Pomerantz LLP"}, {"id": "5849a730-a3b9-4e30-b1ee-4d814ea67ce7", "title": "Toasty temps continue into Friday", "date": "2024-08-02 03:15", "url": "https://www.yahoo.com/news/toasty-temps-continue-friday-010713528.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Heat Advisories were in effect as “feels like” temps got above 100.\nA weak cool front arriving this weekend will tend to increase the rain chances, mainly in the afternoon and evening.\nThe front will drop temperatures to a more “seasonal” level of heat (highs around 90) by the end of the weekend.\nThe latest Drought Monitor shows big improvement across North Carolina; South Carolina, not so much.\nFor the latest news, weather, sports, and streaming video, head to Queen City News."}, {"id": "543c1e83-c3d4-4913-a90b-f5ee0d6dd156", "title": "CoralCarib survives Beryl and presses ahead", "date": "2024-08-02 08:15", "url": "https://jamaica-gleaner.com/article/news/20240802/coralcarib-survives-beryl-and-presses-ahead", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "CoralCarib was launched in April 2023 through a partnership with Nature Conservancy, a nonprofit international non-governmental organisation (NGO), and the Alligator Head Foundation.\nIts focus currently is on the restoration of coral reefs in east Portland.\nJamaica is still reeling from the effects of Hurricane Beryl, which passed over the island on July 3.\n“Coral reefs are one of our major barriers to storm surges and hurricanes.\nThe CoralCarib project will see both Nature Conservancy and the Alligator Head Foundation working to educate Jamaicans on preservation and restoration activities."}, {"id": "bb6ea66a-95f3-437c-986d-ed71467d6601", "title": "Invest 97L forecast : Tropical disturbance tracking towards Gulf of Mexico , near Florida", "date": "2024-08-02 00:15", "url": "https://www.wogx.com/news/florida-alert-tropical-downpours-models-shift-disturbance-gulf-mexico", "domain": "wogx.com", "domain_classification": "Unknown", "message": "The National Hurricane Center (NHC) said a tropical disturbance over Hispaniola, known as Invest 97L, is highly likely to develop further over the next seven days and possibly become a tropical depression as early as this weekend.\nAs it moves toward the Gulf of Mexico, it's expected to enter an environment more favorable for further development.\nThe NHC said it could become a tropical depression this weekend or early next week over the Gulf of Mexico, not far from Florida.\n\"Interests across the Greater Antilles, the Bahamas, and Florida should continue to monitor the progress of this system,\" the NHC said.\nThe tropical wave is getting more organized now and is starting to produce some big thunderstorms, as seen from satellite."}, {"id": "450b6af5-ae62-45cb-a227-a27e423eeb62", "title": "SVG on the brink of food insecurity - Agriculture Minister", "date": "2024-08-02 05:15", "url": "https://www.searchlight.vc/news/2024/08/02/svg-brink-food-insecurity-agriculture-minister/", "domain": "searchlight.vc", "domain_classification": "Unknown", "message": "NewsAs the impact from Hurricane Beryl continues to be assessed, preliminary damage assessments paint a grim picture for the agriculture sector in St Vincent and the Grenadines (SVG).\nFisheries and agriculture have taken a hard hit with Minister Saboto Caesar describing the situation by saying that the country is now “on the brink of food insecurity”.\nMinister Caesar explained that while the full damage assessment is yet to be completed, preliminary estimates show that the lobster and conch fishery were “basically destroyed”, while seamoss production was “totally gone”.\nHurricane Beryl also resulted in the loss of between 90 to 95 percent of banana and plantain trees.\nI want for us to take careful note that we are on the brink of food insecurity.”Caesar lamented the repeated blows SVG has suffered due to climate events over the last decade, and he noted that the situation has worsened in recent years."}, {"id": "77ea6012-4766-4f18-84f1-d9150bca21b4", "title": "High chance of a tropical system targeting Florida this weekend", "date": "2024-08-02 02:45", "url": "https://www.theweathernetwork.com/en/news/weather/forecasts/high-chance-of-a-tropical-system-targeting-florida-this-weekend-debby", "domain": "theweathernetwork.com", "domain_classification": "Unknown", "message": "Forecast Centre The Weather Network A tropical disturbance has a high chance of developing into a storm by this weekend as it approaches FloridaFlorida is on alert as a tropical disturbance gathering steam over the northern Caribbean takes aim at the state this weekend.\nForecasters give the disturbance a 70 percent (high) chance of developing into a tropical depression or a tropical storm over the next couple of days.\nVacationers are advised to keep a close watch on forecasts over the coming days as this system draws closer to the Sunshine State.\nEnvironmental conditions around the disturbance will gradually become favourable for tropical development as it moves west-northwest toward Florida this weekend.\nMUST SEE: Tropical systems don’t need a name to trigger devastating floodsVery warm water temperatures, sufficient humidity, and calmer winds should allow the disturbance to develop into a tropical depression or tropical storm by the end of the weekend."}, {"id": "d384be41-3870-4a05-bb73-62c15b8f9644", "title": "Louisiana at Risk ? Tropical Update Moves Storm Further Into Gulf", "date": "2024-08-02 00:00", "url": "https://973thedawg.com/ixp/36/p/forecast-shifts-potential-tropical-storm-westward-louisiana/", "domain": "973thedawg.com", "domain_classification": "Unknown", "message": "\"The latest models show it going into the eastern Gulf and then exploding there,\" AccuWeather Lead Long-Range Expert Paul Pastelok explained.\nBut whether it develops or not, we can expect a massive amount of rainfall coming from the storm.\nProper planning can make a significant difference in your ability to weather the storm and recover afterward.\nStart with a PlanFirst and foremost, create a family emergency plan.\nEmergency Kit EssentialsPrepare an emergency kit well in advance."}, {"id": "164a5ad4-c2b8-410b-a8a7-2637cf3826ee", "title": "At least 30 dead after Typhoon Gaemi cut off towns in China Hunan province - Boston News , Weather , Sports", "date": "2024-08-02 04:15", "url": "https://whdh.com/news/at-least-30-dead-after-typhoon-gaemi-cut-off-towns-in-chinas-hunan-province/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "Hong Kong (CNN) — Heavy rains and floods from Typhoon Gaemi caused at least 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan, state-run news agency Xinhua reported on Thursday, citing local authorities.\nOn Thursday, rescue teams reached eight towns that had been cut off from the outside world since last Sunday, due to destroyed infrastructure and power grids.\nTyphoon Gaemi initially made landfall in China on the evening of Thursday July 25, with winds approaching 110 kph (70 mph).\nThe storm previously caused torrential flooding in Taiwan, with rainfall in five townships totaling over 1,285mm (50 inches).\nTyphoon Gaemi was deflected off its forecasted track by Taiwan’s mountainous terrain and spent more than six hours offshore, making a loop near the Hualien coastline instead of making landfall on the evening of Wednesday, July 24."}, {"id": "eaa3cca0-4b2e-4d61-8ab6-c88831666cbf", "title": "Condo set to be demolished after sitting untouched post Hurricane Ian", "date": "2024-08-02 04:15", "url": "https://winknews.com/2024/08/01/condo-set-to-be-demolished-after-sitting-untouched-post-hurricane-ian/", "domain": "winknews.com", "domain_classification": "Unknown", "message": "A few weeks later, Hurricane ian changed everything.\nUntouched since Hurricane Ian: belongings still on the shelves, furniture smushed, and the remnants of someone’s entire life left behind.\nAnd then we’ll use our other machines to start to tear it down from there.”WINK News went up five of the seven floors.\nThe property is selling for $11 million, and the lot must be cleared before it’s sold.\nIt’s set for demolition in the next few weeks."}, {"id": "bc470bf6-da60-4270-acde-deca58ab6ff6", "title": "Invest 97L update : Gov . DeSantis declares state of emergency for 54 of Florida 67 counties", "date": "2024-08-02 00:15", "url": "https://www.wogx.com/news/invest-97l-gov-desantis-declares-state-emergency-ahead-tropical-system", "domain": "wogx.com", "domain_classification": "Unknown", "message": "Ron DeSantis declared a state of emergency in dozens of counties that could be impacted.\nCalled Invest 97L, the storm system on Thursday afternoon was producing a large area of disorganized showers and thunderstorms over regions such as Hispaniola, Puerto Rico and the southeastern Bahamas.\n\"A tropical storm at least is now likely.\nFlorida has declared a state of emergency in anticipation of a tropical system this weekend, which could cause flooding.\n\"The water tables in the affected areas are already nearing peak capacity, and incoming heavy rainfall will cause significant river flooding that may last for several weeks.\""}, {"id": "60009ad7-6a20-4eb4-aaa3-77e20b9639fa", "title": "At least 30 dead after Typhoon Gaemi cut off towns in China Hunan province", "date": "2024-08-02 00:00", "url": "https://krdo.com/news/national-world/cnn-world/2024/08/01/at-least-30-dead-after-typhoon-gaemi-cut-off-towns-in-chinas-hunan-province/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "By Shawn Deng, Hassan Tayir and Duarte Mendonca, CNNHong Kong (CNN) — Heavy rains and floods from Typhoon Gaemi caused at least 30 deaths and left 35 people missing across eight towns in the southern Chinese province of Hunan, state-run news agency Xinhua reported on Thursday, citing local authorities.\nOn Thursday, rescue teams reached eight towns that had been cut off from the outside world since last Sunday, due to destroyed infrastructure and power grids.\nTyphoon Gaemi initially made landfall in China on the evening of Thursday July 25, with winds approaching 110 kph (70 mph).\nThe storm previously caused torrential flooding in Taiwan, with rainfall in five townships totaling over 1,285mm (50 inches).\nTyphoon Gaemi was deflected off its forecasted track by Taiwan’s mountainous terrain and spent more than six hours offshore, making a loop near the Hualien coastline instead of making landfall on the evening of Wednesday, July 24."}, {"id": "97b82951-25e0-4fc7-a264-cd2140f70a61", "title": "Govt must provide additional disaster management funds to states without discrimination : Mallikarjun Kharge", "date": "2024-08-02 08:15", "url": "https://www.moneycontrol.com/news/politics/govt-must-provide-additional-disaster-management-funds-to-states-without-discrimination-mallikarjun-kharge-12785479.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "OTHERSOTHERSassociated byco-presented byFollow us on:My AccountororHello, LoginAllGovt must provide additional disaster management funds to states without discrimination: Mallikarjun Kharge"}, {"id": "79bdce20-eec7-4be4-a7f9-7b68daf3d019", "title": "Severe thunderstorms and flooding drive natural disaster losses in the first half of 2024 – ICSF", "date": "2024-08-02 08:30", "url": "https://www.icsf.net/newss/severe-thunderstorms-and-flooding-drive-natural-disaster-losses-in-the-first-half-of-2024/", "domain": "icsf.net", "domain_classification": "Unknown", "message": "However, 2023 was affected by extremely high losses in connection with the severe earthquake in Turkey and Syria.\nNotably, the share of claims for “non-peak perils” – which include severe thunderstorms, flooding and forest fires – was once again high: 68% of total losses and 76% of insured losses were caused by these natural disasters.\nThe costliest natural disaster in the first half of the year was an earthquake in Japan on New Year’s Day.\nEstimated total losses amounted to some US$ 10bn, including insured losses of roughly US$ 2bn.\nOne year earlier, overall losses for the first half-year were roughly US$ 52bn, including insured losses of US$ 40bn."}, {"id": "19b3ac0f-8b55-420c-a285-cbb272035e48", "title": "Govt must provide additional disaster management funds to states without discrimination : Kharge", "date": "2024-08-02 07:45", "url": "https://www.dailypioneer.com/2024/top-stories/govt-must-provide-additional-disaster-management-funds-to-states-without-discrimination--kharge.html", "domain": "dailypioneer.com", "domain_classification": "Unknown", "message": "Amid natural calamities in various parts of the country, Congress president Mallikarjun Kharge on Friday demanded that the Modi government should immediately provide additional disaster management funds to states without any discrimination.\nHe made the remarks while condoling the loss of lives due to cloudburst and heavy rainfall in Uttarakhand.\n\"The country is grappling with climate change, where floods, heavy rainfall, cloudburst and drought-like emergent situations have occurred in many states.\n\"We will also have to improve our disaster management.\nTo deal with these natural calamities occurring year after year, the Modi government should immediately provide additional disaster management funds to the states without any discrimination, the Congress chief asserted."}, {"id": "ed510180-d142-4032-b577-11ba13fa1790", "title": "Latest Projected Path of Tropical System Shifts Closer to Texas", "date": "2024-08-02 05:45", "url": "https://mix931fm.com/latest-projected-path-of-tropical-system-shifts-closer-to-texas/", "domain": "mix931fm.com", "domain_classification": "Unknown", "message": "Invest 97LThat's the name that the National Hurricane Center has given to a tropical system that continues to push west-northwestward across Puerto Rico.\nNational Hurricane Center National Hurricane Center loading...\nEvery weather model I have seen turns this tropical system northward into the U.S. before reaching New Orleans.\nNational Hurricane Center/Canva National Hurricane Center/Canva loading...\nNever Say NeverEven though there is a very low possibility of this tropical system adjusting its track to Texas, it would be a good idea to monitor the latest updates, just in case."}, {"id": "5ac2fe2d-695a-48e2-ac32-b56247f1354b", "title": "Minor Earthquake Felt in Parts of New York State", "date": "2024-08-02 04:45", "url": "https://wrrv.com/ixp/705/p/earthquake-tremor-new-york-felt-shake-ny-state-north/", "domain": "wrrv.com", "domain_classification": "Unknown", "message": "Several fault lines across the region have been a bit active as of late, as seismologists say an earthquake was felt in parts of New York state this week.\nAccording to the NESEC, around 551 earthquakes were recorded in New York state from 1737 to 2016.\nMinor Earthquake Felt in Parts of New York StateNBC reports that a 2.8 magnitude earthquake was felt in parts of Clinton and Franklin Counties in northern New York Monday.\n44 of Biggest Earthquakes to Shake New York State New York is no stranger to earthquakes.\nA 2008 study proposed that there may be an additional fault zone extending from the Ramapo Fault into southwestern Connecticut."}, {"id": "6817691d-9c48-4f60-bb38-aff053f66bb4", "title": "Heavy downpours batter the united kingdom as temperatures soar to 30C", "date": "2024-08-02 08:15", "url": "https://www.thetelegraphandargus.co.uk/news/national/24492685.heavy-downpours-batter-uk-temperatures-soar-30c/", "domain": "thetelegraphandargus.co.uk", "domain_classification": "Unknown", "message": "A yellow warning for thunderstorms was issued by the forecaster that covered the majority of the UK on Thursday as temperatures soared to highs of 30C.\nDrivers faced road closures and there were disruptions to public transport, power cuts and flooding.\nBenson Lock in Oxfordshire recorded 30mm of rainfall in an hour while Wisley, Surrey, enjoyed the highest temperature of the day of 30.2C.\nMet Office meteorologist Simon Partridge said: “There’s been very humid air which is why it’s felt so close and muggy as well.\n“The same air has been over northern France for the last day or two as well – so those heavy thundery showers that they had during the triathlon yesterday morning."}, {"id": "a3d7cfa0-c606-4b15-b86c-5cb184911d31", "title": "Heavy downpours batter the united kingdom as temperatures soar to 30C", "date": "2024-08-02 08:45", "url": "https://www.salisburyjournal.co.uk/news/national/24492685.heavy-downpours-batter-uk-temperatures-soar-30c/", "domain": "salisburyjournal.co.uk", "domain_classification": "Unknown", "message": "A yellow warning for thunderstorms was issued by the forecaster that covered the majority of the UK on Thursday as temperatures soared to highs of 30C.\nDrivers faced road closures and there were disruptions to public transport, power cuts and flooding.\nBenson Lock in Oxfordshire recorded 30mm of rainfall in an hour while Wisley, Surrey, enjoyed the highest temperature of the day of 30.2C.\nMet Office meteorologist Simon Partridge said: “There’s been very humid air which is why it’s felt so close and muggy as well.\n“The same air has been over northern France for the last day or two as well – so those heavy thundery showers that they had during the triathlon yesterday morning."}, {"id": "0e76af26-4510-4b46-ad44-88ccb447b332", "title": "Tropical development likely in the Gulf this weekend", "date": "2024-08-02 05:00", "url": "https://mynews13.com/fl/orlando/weather/2024/08/02/tropical-development-likely-in-the-gulf-this-weekend", "domain": "mynews13.com", "domain_classification": "Unknown", "message": "Development of this system will be slow for the next couple of days, then development is likely in the Eastern Gulf of Mexico up toward the Florida Big Bend going into Monday.\nRight now, all the computer guidance shows the intensity as a tropical depression or tropical storm.\nIt is important to remember, with a disorganized tropical depression or tropical storm, the exact center doesn’t matter as much.\nMost of the wet weather will be east of the track, bringing heavy rain to the west coast of Florida.\nBe sure to check back often as development is likely pretty close to the west coast of Florida as early as Sunday morning."}, {"id": "4448b850-328e-45e3-8435-5992a100c003", "title": "Tropical development likely in the Gulf this weekend", "date": "2024-08-02 03:30", "url": "https://mynews13.com:443/fl/orlando/weather/2024/08/02/tropical-development-likely-in-the-gulf-this-weekend", "domain": "mynews13.com", "domain_classification": "Unknown", "message": "Development of this system will be slow for the next couple of days, then development is likely in the Eastern Gulf of Mexico up toward the Florida Big Bend going into Monday.\nRight now, all the computer guidance shows the intensity as a tropical depression or tropical storm.\nIt is important to remember, with a disorganized tropical depression or tropical storm, the exact center doesn’t matter as much.\nMost of the wet weather will be east of the track, bringing heavy rain to the west coast of Florida.\nBe sure to check back often as development is likely pretty close to the west coast of Florida as early as Sunday morning."}, {"id": "27238077-7421-403d-ae26-147cd3944c9c", "title": "Heavy downpours batter the united kingdom as temperatures soar to 30C", "date": "2024-08-02 07:45", "url": "https://www.lancashiretelegraph.co.uk/news/national/24492685.heavy-downpours-batter-uk-temperatures-soar-30c/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "A yellow warning for thunderstorms was issued by the forecaster that covered the majority of the UK on Thursday as temperatures soared to highs of 30C.\nDrivers faced road closures and there were disruptions to public transport, power cuts and flooding.\nBenson Lock in Oxfordshire recorded 30mm of rainfall in an hour while Wisley, Surrey, enjoyed the highest temperature of the day of 30.2C.\nMet Office meteorologist Simon Partridge said: “There’s been very humid air which is why it’s felt so close and muggy as well.\n“The same air has been over northern France for the last day or two as well – so those heavy thundery showers that they had during the triathlon yesterday morning."}, {"id": "0fb0d416-119a-44e1-8e7d-1357dc8b6722", "title": "Heavy downpours batter the united kingdom as temperatures soar to 30C", "date": "2024-08-02 09:15", "url": "https://www.yorkpress.co.uk/news/national/24492685.heavy-downpours-batter-uk-temperatures-soar-30c/", "domain": "yorkpress.co.uk", "domain_classification": "Unknown", "message": "A yellow warning for thunderstorms was issued by the forecaster that covered the majority of the UK on Thursday as temperatures soared to highs of 30C.\nDrivers faced road closures and there were disruptions to public transport, power cuts and flooding.\nBenson Lock in Oxfordshire recorded 30mm of rainfall in an hour while Wisley, Surrey, enjoyed the highest temperature of the day of 30.2C.\nMet Office meteorologist Simon Partridge said: “There’s been very humid air which is why it’s felt so close and muggy as well.\n“The same air has been over northern France for the last day or two as well – so those heavy thundery showers that they had during the triathlon yesterday morning."}, {"id": "926ed123-ae89-437c-ad83-84f13ed08894", "title": "Latest Projected Path of Tropical System Shifts Closer to Texas", "date": "2024-08-02 00:15", "url": "https://kfox95.com/ixp/151/p/tropical-system-path-shifts-westward/", "domain": "kfox95.com", "domain_classification": "Unknown", "message": "Invest 97LThat's the name that the National Hurricane Center has given to a tropical system that continues to push west-northwestward across Puerto Rico.\nNational Hurricane Center National Hurricane Center loading...\nEvery weather model I have seen turns this tropical system northward into the U.S. before reaching New Orleans.\nNational Hurricane Center/Canva National Hurricane Center/Canva loading...\nNever Say NeverEven though there is a very low possibility of this tropical system adjusting its track to Texas, it would be a good idea to monitor the latest updates, just in case."}, {"id": "51702e99-9a6e-4c93-835f-09aaeb32b52b", "title": "Parks still be cleared of Beryl damage", "date": "2024-08-02 01:45", "url": "https://thefacts.com/news/parks-still-be-cleared-of-beryl-damage/article_f3417440-aafc-54ab-b20a-78d117e62dbb.html", "domain": "thefacts.com", "domain_classification": "Unknown", "message": "Clute, TX (77531)TodayMainly clear.\nS winds at 10 to 20 mph, decreasing to less than 5 mph..TonightMainly clear.\nS winds at 10 to 20 mph, decreasing to less than 5 mph."}, {"id": "7b61de42-dd05-428d-ac2f-ff3c6f9dd63a", "title": "Parks still need to be cleared of Beryl damage", "date": "2024-08-02 06:30", "url": "https://thefacts.com/news/parks-still-need-to-be-cleared-of-beryl-damage/article_f3417440-aafc-54ab-b20a-78d117e62dbb.html", "domain": "thefacts.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "06220deb-23d6-41e5-856c-4d26eca5019b", "title": "Status of Union Island Gecko unknown after Hurricane Beryl", "date": "2024-08-02 05:15", "url": "https://www.searchlight.vc/news/2024/08/02/status-union-island-gecko-unknown-hurricane-beryl/", "domain": "searchlight.vc", "domain_classification": "Unknown", "message": "NewsThe Forestry Department is preparing to conduct an assessment following the passage of Hurricane Beryl to determine the status of endemic species in the Southern Grenadines, particularly the Union Island Gecko.\nProvidence said the team has to assess the status of the gecko population as there was significant damage on the forested areas on Union Island.\nThe Union Island Gecko (Gonatodes daudini) is an endemic species found in the Chatham Bay forest area and is considered endangered due to the high demand from the illegal international pet trade.\n“When you look at the forest on Union Island, particularly the Chatham Bay forest area, we saw that there was total defoliation, just sticks standing.\nHe expressed confidence that the forested areas will rebound over time as was the case in Dominica when they were hit by a category five hurricane."}, {"id": "5d63485c-613a-4ab7-83ab-e2e8294f4c86", "title": "Invest 97L tracker : Forecast path , spaghetti models , timeline , watches and warnings", "date": "2024-08-02 04:00", "url": "https://www.fox35orlando.com/news/invest-97l-tracker-forecast-path-spaghetti-models-timeline-watches-warnings", "domain": "fox35orlando.com", "domain_classification": "Unknown", "message": "Stream FOX 35 NewsThe National Hurricane Center has named a tropical disturbance in the Atlantic with a high chance of further development over the next seven days.\nInvest 97L could possibly become a tropical depression or storm as early as this weekend.\nIt's still too early to tell exactly where this tropical wave will end up, whether it will become Tropical Storm Debby, and whether it will stay in the Gulf of Mexico or if it will make landfall over Florida – and where.\nRELATED HEADLINES:Below are the latest models that track the storm's possible development, path, timeline, and impacts.\nInvest 97L forecast pathInvest 97L spaghetti modelsSTAY CONNECTED WITH FOX 35 ORLANDO:Invest 97L tropical potential, rainfall, impactsTimeline of when Invest 97L (future \"Debby\") arrives"}, {"id": "17b26791-5e3b-44df-ae62-07d2434fdd29", "title": "Heavy downpours batter the united kingdom as temperatures soar to 30C", "date": "2024-08-02 09:00", "url": "https://www.oxfordmail.co.uk/news/national/24492685.heavy-downpours-batter-uk-temperatures-soar-30c/", "domain": "oxfordmail.co.uk", "domain_classification": "Unknown", "message": "A yellow warning for thunderstorms was issued by the forecaster that covered the majority of the UK on Thursday as temperatures soared to highs of 30C.\nDrivers faced road closures and there were disruptions to public transport, power cuts and flooding.\nBenson Lock in Oxfordshire recorded 30mm of rainfall in an hour while Wisley, Surrey, enjoyed the highest temperature of the day of 30.2C.\nMet Office meteorologist Simon Partridge said: “There’s been very humid air which is why it’s felt so close and muggy as well.\n“The same air has been over northern France for the last day or two as well – so those heavy thundery showers that they had during the triathlon yesterday morning."}, {"id": "2a6eaf50-395c-40a4-a0c1-a0304f677bfe", "title": "NY weather stays hot and stormy through weekend ; track radar here – NBC New York", "date": "2024-08-02 04:30", "url": "https://www.nbcnewyork.com/weather/extreme-heat-and-humidity-to-fuel-storms-through-the-weekend/5660198/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "Nearly every day has brought at least a few showers or storms, and we are going to increase the storm activity into the weekend.\nSome of those storms could be strong to severe, capable of producing some locally heavy rainfall.\nExtreme heat in and around the tri-state area will contribute to the instability, too.\nFriday’s storms will be strongest from the New York City area to the west and south.\nThe main threats from Friday’s and the weekend’s storms will be isolated flooding where downpours are the heaviest and isolated damaging straight line wind gusts."}, {"id": "7a13ea45-bc77-4303-b3a0-0004f06d048e", "title": "Hot temps , drought have meteorologists worried about the rest of Idaho wildfire season", "date": "2024-08-02 00:00", "url": "https://cdapress.com/news/2024/aug/01/hot-temps-drought-have-meteorologists-worried-about-the-rest-of-idahos-wildfire-season/", "domain": "cdapress.com", "domain_classification": "Unknown", "message": "The 2024 wildfire season is barely at the halfway mark, yet an especially dry, hot, and active summer has already resulted in 2024 wildfires burning over 4 million acres nationwide.\nThe Northwest wildfire season typically peaks in early July, according to the National Weather Service, and lasts until early September.\nIdaho’s 2024 wildfire season began in mid-July when smoke from two fires in northern California and eastern Oregon began blowing eastward.\nAs of Thursday morning, the Cow Valley fire was 99% contained and had burned 133,490 acres, according to federal wildfire tracker InciWeb.\nParker said this year’s wildfire season has started strongly because of drought and scorching temperatures."}, {"id": "3ebe5ff3-10a0-473f-83a9-91e18b5d2978", "title": "Rain - related disasters have killed more than 200 in a deadly week across Asia", "date": "2024-08-02 04:45", "url": "https://www.yahoo.com/news/rain-related-disasters-killed-more-041652407.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Rain-related disasters have killed more than 250 in a deadly week across AsiaFILE - Rescuers use a dinghy boat to evacuate villagers trapped by floodwaters in Jingtang village, Zixing city, in southern China's Hunan province, on July 28, 2024.\n(Chinatopix via AP, File)In India and China, torrential rains have killed more than 250 people in the past week.\nWidespread flooding has been reported in North Korea near the border with China with no word on whether anyone died.\nIn North Korea, the rain flooded 4,100 houses, 3,000 hectares (7,400 acres) of farmland and many public buildings, roads and railways.\nOne city near North Korea asked people living below the third floor to move higher as the Yalu River rose."}, {"id": "56f83bfc-e658-4a21-b3e1-1df37e39ee54", "title": "Congressman Eric Sorensen visits Fulton County to survey damage from July storms", "date": "2024-08-02 00:00", "url": "https://www.yahoo.com/news/congressman-eric-sorensen-visits-fulton-231444740.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "FULTON COUNTY, Ill. (WMBD) — Congressmen Eric Sorensen (D-17) visited Fulton County Thursday evening to assess damage from the severe storms that swept through the area in mid-July.\nFulton County leaders, and Illinois Emergency Management Agency representatives sat down with the congressman to explain the damage and what problems they are facing.\nLeaders said in order to get help from the Federal Emergency Management Agency, the area needs to meet certain benchmarks.\nThere needs to be $23.6 in uninsured damages, which Fulton County is having trouble meeting.\nWe’re never going to reach that benchmark.”Sorensen plans to take what he learned from the Fulton County leaders to Washington D.C. and work to change the process to receive federal help to assess storm damage."}, {"id": "201e90cb-0c4a-4d69-bcd5-fc5d431745e3", "title": "Rain - related disasters have killed more than 200 in a deadly week across Asia", "date": "2024-08-02 06:00", "url": "https://www.local10.com/news/world/2024/08/02/rain-related-disasters-have-killed-more-than-200-in-a-deadly-week-across-asia/", "domain": "local10.com", "domain_classification": "Unknown", "message": "(Chen Zhenhai/Xinhua via AP, File)In India and China, torrential rains have killed more than 250 people in the past week.\nWidespread flooding has been reported in North Korea near the border with China with no word on whether anyone died.\nThis time of year is monsoon and typhoon season in Asia, and climate change has intensified such storms.\nIn North Korea, the rain flooded 4,100 houses, 3,000 hectares (7,400 acres) of farmland and many public buildings, roads and railways.\nOne city near North Korea asked people living below the third floor to move higher as the Yalu River rose."}, {"id": "22cc054d-7be3-4318-a79f-08dd1e6ad0ec", "title": "Disturbance to enter the Gulf this weekend ; intense heat locally", "date": "2024-08-02 00:15", "url": "https://www.fox10tv.com/2024/08/01/disturbance-enter-gulf-this-weekend-intense-heat-locally/", "domain": "fox10tv.com", "domain_classification": "Unknown", "message": "(WALA) - We continue to keep a close eye on a tropical wave which is currently located between Haiti and Cuba.\nBy Saturday, this system will be emerging off the northern coast of Cuba and will then have an opportunity to develop.\nThe upper level steering environment gets really weak in the northern Gulf.\nThe GFS and European models l, the major global models, suggest that the system will run up Florida’s West Coast along the Eastern side of the Gulf.\nThe upper level steering environment is weak so a stalling system is possible near the northern Gulf Coast by early next week."}, {"id": "54bf96d0-0920-400c-af85-480c901d013f", "title": "Rain - related disasters have killed more than 200 in a deadly week across Asia – Winnipeg Free Press", "date": "2024-08-02 04:45", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/08/01/rain-related-disasters-have-killed-more-than-200-in-a-deadly-week-across-asia", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "In India and China, torrential rains have killed more than 250 people in the past week.\nWidespread flooding has been reported in North Korea near the border with China with no word on whether anyone died.\nHeavy rains have triggered landslides and flooding, devastating crops, destroying homes and taking lives.\n(AP Photo/Fareed Khan, File)In North Korea, the rain flooded 4,100 houses, 3,000 hectares (7,400 acres) of farmland and many public buildings, roads and railways.\nOne city near North Korea asked people living below the third floor to move higher as the Yalu River rose."}, {"id": "def92cd8-2a80-40c9-bc55-8ca66e8940cb", "title": "At 120 , seawall remains most visible symbol of Galveston grit", "date": "2024-08-02 06:30", "url": "https://www.galvnews.com/opinion/at-120-seawall-remains-most-visible-symbol-of-galveston-grit/article_344f2483-12d4-5dbf-961f-4e1ead96f500.html", "domain": "galvnews.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "31d188fe-bd69-4e21-bf68-59cdbdef0129", "title": "27 dead as heavy rains , flash floods batter KP , Punjab", "date": "2024-08-02 08:30", "url": "https://dailytimes.com.pk/1213705/27-dead-as-heavy-rains-flash-floods-batter-kp-punjab/", "domain": "dailytimes.com.pk", "domain_classification": "Unknown", "message": "The Provincial Disaster Management Authority (PDMA) has reported that torrential rains and flash floods in Khyber-Pakhtunkhwa (K-P) have claimed the lives of 24 individuals over the past three days.\nThe heavy rains and resulting accidents have affected various districts, including Kohat, Bajaur, Upper and Lower Chitral, Upper Dir, Upper and Lower Kohistan, Abbottabad, Haripur, Swat, Charsadda, Swabi, Mohmand, South Waziristan, and Hangu.\nRescue operations are underway in the affected areas, with district administrations and relief teams actively engaged in providing assistance.\nLahore’s rainfall led to significant flooding in areas such as Mall Road, Ferozepur Road, Model Town, Faisal Town, Lakshmi Chowk, and Anarkali.\nMeanwhile, Chief Minister Punjab Maryam Nawaz Sharif has directed members of the provincial assembly (MPAs) to oversee the rainwater drainage operation."}, {"id": "feb9af89-b094-4b79-a312-84ae5df1199d", "title": "Omaha storm recovery : Waterloo farm loses 125 - year - old sycamore", "date": "2024-08-02 06:00", "url": "https://www.wowt.com/2024/08/02/omaha-storm-recovery-waterloo-farm-loses-125-year-old-sycamore/", "domain": "wowt.com", "domain_classification": "Unknown", "message": "A Waterloo farm begins to rebuild after a 125-year-old tree falls.\n“We have the original deed with Ulysses S. Grant’s signature,” Homeowner Tom Grimm said.\nBut there were 4 sycamore trees, 2 were left.\n“This farm was always known as the place with the two tall sycamore trees,” Grimm said.\n“Now it’s the place with one.”We wondered if Tom had fond memories of climbing the sycamore trees as a kid."}, {"id": "2ced962c-87b2-48b5-b463-07ea10a6b961", "title": "Friday morning fog , afternoon storms", "date": "2024-08-02 08:45", "url": "https://wishtv.com/weather/friday-morning-fog-afternoon-storms/", "domain": "wishtv.com", "domain_classification": "Unknown", "message": "Friday morning fog, afternoon stormsINDIANAPOLIS (WISH) — Storms could produce heavy rainfall for parts of the state this afternoon.\nThese storms are staying below severe limits but are producing some pretty heavy rain in some spots.\nThere will likely be some areas of fog, but it shouldn’t be quite as dense as what we are dealing with on Friday morning.\nSaturday:Some areas of fog in the morning for Saturday.\nSunday:Again, we may have some areas of fog very early in the morning on Sunday."}, {"id": "a645c34a-b646-4c4b-a81f-4c2b5b58a427", "title": "Noto getting  nowhere near enough support , says volunteer", "date": "2024-08-02 09:00", "url": "https://www.japantimes.co.jp/news/2024/08/02/japan/society/noto-earthquake-volunteers/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "Tadakazu Sado, a 72-year-old from the city of Hiroshima, has dedicated himself to volunteering in the wake of numerous natural disasters since the 2011 Great East Japan Earthquake.\nIn June, Sado moved to the city of Wajima in Ishikawa Prefecture, a region badly hit by the Noto Peninsula earthquake in January.\nSeven months after the disaster, he is increasingly concerned about waning interest in volunteering and declining support.\nFollowing the New Year's Day earthquake, Sado immediately drove to the Noto region.\nInitially, he planned to volunteer until his savings were depleted, as he had done with previous disasters."}, {"id": "f7fcf4ca-a2c3-4cdd-b2b7-986aee4c7720", "title": "Rain - related disasters have killed more than 200 in a deadly week across Asia", "date": "2024-08-02 09:00", "url": "https://nypost.com/2024/08/02/world-news/rain-related-disasters-have-killed-more-than-200-in-a-deadly-week-across-asia/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "In India and China, torrential rains have killed more than 200 people in the past week.\nWidespread flooding has been reported in North Korea near the border with China with no word on whether anyone died.\nNorth Korea: Damage, but no information on deathsThe tropical storm also generated heavy rain in northeast China on the border with North Korea, overflowing the Yalu River, which divides the two countries.\nIn North Korea, the rain flooded 4,100 houses, 7,400 acres of farmland and many public buildings, roads and railways.\nOne city near North Korea asked people living below the third floor to move higher as the Yalu River rose."}, {"id": "d04a945c-9b24-4797-8c7f-77b886a636aa", "title": "CenterPoint Energy withdraws request to increase electricity rates", "date": "2024-08-02 03:15", "url": "https://www.click2houston.com/news/local/2024/08/01/centerpoint-energy-withdraws-request-to-increase-electricity-rates/", "domain": "click2houston.com", "domain_classification": "Unknown", "message": "CenterPoint President and CEO Jason Wells addresses the Public Utilities Commission at a hearing in Austin on July 25, 2024.\nThe energy company proposed action plans for improved customer communication and restoring power quickly in future outages.\nCenterPoint Energy announced its plans to withdraw its 2024 rate case filing with the Public Utilities Commission of Texas (PUC).\nIn a statement released by the company, CenterPoint said the decision to withdraw the request was centered around wanting to focus on improving resiliency around Houston as the hurricane season continues.\nOur company’s collective focus for the remainder of this hurricane season will be on being ready: that is our mission."}, {"id": "3580d073-ec38-4aeb-9151-ff7e978628a3", "title": "Heavy downpours batter the united kingdom as temperatures soar to 30C", "date": "2024-08-02 07:45", "url": "https://www.yourlocalguardian.co.uk/news/national/24492685.heavy-downpours-batter-uk-temperatures-soar-30c/", "domain": "yourlocalguardian.co.uk", "domain_classification": "Unknown", "message": "A yellow warning for thunderstorms was issued by the forecaster that covered the majority of the UK on Thursday as temperatures soared to highs of 30C.\nDrivers faced road closures and there were disruptions to public transport, power cuts and flooding.\nBenson Lock in Oxfordshire recorded 30mm of rainfall in an hour while Wisley, Surrey, enjoyed the highest temperature of the day of 30.2C.\nMet Office meteorologist Simon Partridge said: “There’s been very humid air which is why it’s felt so close and muggy as well.\n“The same air has been over northern France for the last day or two as well – so those heavy thundery showers that they had during the triathlon yesterday morning."}, {"id": "4f69a49e-dd12-4068-97fa-6092547e7a9e", "title": "Earthquake shakes southern Italy , no initial damage", "date": "2024-08-02 00:15", "url": "https://www.canberratimes.com.au/story/8716178/earthquake-shakes-southern-italy-no-initial-damage/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The epicentre of the quake was close to the town of Cosenza in the region of Calabria and occurred at 9.43pm on Thursday, Italy's National Institute of Geophysics and Vulcanology (INGV) said, giving a magnitude of 5.0."}]