[{"id": "74fbd9f8-3cf8-4a88-9ed8-dea9bee48947", "title": "US flies B - 1B bomber for 1st precision bombing drill in 7 years as tensions simmer with North Korea", "date": "2024-06-05 08:30", "url": "https://www.startribune.com/us-flies-bomber-for-first-jdam-bombing-drill-in-7-years-as-tensions-simmer-with-north-korea/600371146/", "message": "SEOUL, South Korea — The United States flew a long-range B-1B bomber over the Korean Peninsula on Wednesday for its first precision-guided bombing drill with South Korea in seven years, the South said Wednesday.\nThe drill — seen as a show of force against North Korea — comes as tensions are rising over the North's recent launches of rubbish-carrying balloons toward South Korea and other provocations.\nNorth Korea has previously responded to the flights of powerful U.S. aircraft in South Korea with its own missile tests.\nIn the past week, North Korea floated hundreds of huge balloons to drop manure, cigarette butts, scraps of cloth and waste batteries across South Korea.\nIt also test-fired nuclear-capable weapons for a drill simulating a pre-emptive strike on South Korea, and allegedly jammed GPS navigation signals in South Korea."}, {"id": "7fcef4e7-c125-4c94-b096-fe0c2b02ce02", "title": "For Strategic Defense : A New Strategy For the New Global Situation", "date": "2024-06-05 00:00", "url": "https://www.heritage.org/defense/report/strategic-defense-new-strategy-the-new-global-situation", "message": "(Department of Defense, \"Briefing on the Refocused Strategic Defense Initiative,\" February 12, 1991.)\n( Steven A. Hildreth, \"The Strategic Defense Initiative: Issues for Phase I Deployment,\" CRS Issue Brief (Washington, D.C.: Congressional Research Service, 1990) p.\nFor further information on G-PALS see: Department of Defense, \"Briefing on the Refocused Strategic Defense Initiative,\" February 12, 1991.)\nPrior to G-PALS, theater missile defense and strategic missile defense (or protecting U.S. territory) were not integrated into a common design.\n1446, would strip tactical missile defense programs -- presumably including Arrow and Patriot, although his bill does not specify -- from SDIO and establish a separate Theater Missile Defense office within the Pentagon."}, {"id": "956695b1-3247-4909-ac28-184adfe9e54b", "title": "AfD politician injured in second attack in less than a week in Mannheim , dpa reports", "date": "2024-06-05 08:30", "url": "https://www.thestar.com.my/news/world/2024/06/05/afd-politician-injured-in-second-attack-in-less-than-a-week-in-mannheim-dpa-reports", "message": "BERLIN (Reuters) - A local politician from the right-wing Alternative for Germany (AfD) party was injured in a knife attack in Mannheim late on Tuesday, the German news agency dpa reported on Wednesday.\nThe incident comes just days after another stabbing attack on an anti-Islam demonstration in which a policeman was killed.\nLocal police were not available for an immediate comment.\n(Reporting by Andrey Sychev; Editing by Miranda Murray)"}, {"id": "9f070a93-9408-45e8-8f96-8ef58a9b8927", "title": "US decision on weapons criticized", "date": "2024-06-05 03:15", "url": "http://europe.chinadaily.com.cn/a/202406/05/WS665fbfcfa31082fc043caf52.html", "message": "The Biden administration's policy shift to allow American weapons to be used by Ukraine against limited targets inside Russia is a dangerous escalation of the war, those opposed to the policy say.\n\"Joe Biden gave PERMISSION to Ukraine to use US weapons INSIDE of Russia!\nBipartisan coalition demands Biden authorize Ukraine to strike inside Russia with US intel/weapons.\"\nOn Monday, Ukrainian forces said that they had struck a Russian S-300 missile system using Western-supplied weapons inside Russian territory, although the origin of the weapons was unclear.\nChina's Foreign Ministry has said that Beijing supports a conference that's accepted by both Russia and Ukraine."}, {"id": "052c9674-3cb3-4f8d-b6eb-b92f2dab92ce", "title": "US decision on weapons criticized", "date": "2024-06-05 03:00", "url": "http://usa.chinadaily.com.cn/a/202406/05/WS665fbfcfa31082fc043caf52.html", "message": "The Biden administration's policy shift to allow American weapons to be used by Ukraine against limited targets inside Russia is a dangerous escalation of the war, those opposed to the policy say.\n\"Joe Biden gave PERMISSION to Ukraine to use US weapons INSIDE of Russia!\nBipartisan coalition demands Biden authorize Ukraine to strike inside Russia with US intel/weapons.\"\nOn Monday, Ukrainian forces said that they had struck a Russian S-300 missile system using Western-supplied weapons inside Russian territory, although the origin of the weapons was unclear.\nChina's Foreign Ministry has said that Beijing supports a conference that's accepted by both Russia and Ukraine."}, {"id": "177ac82e-70aa-4005-a9e5-0369a603e0a9", "title": "Israel - Gaza live updates : Hamas responds unfavorably to cease - fire proposal", "date": "2024-06-05 00:00", "url": "https://www.mymoinfo.com/syndicated-article/?id=1567558", "message": "Jun 03, 2:56 PMEgypt, Qatar, Jordan, Saudi Arabia, UAE support cease-fire dealThe foreign ministers of Egypt, Qatar, Jordan, Saudi Arabia and the United Arab Emirates released a joint statement Monday in support of the current cease-fire deal.\nIsrael had said it submitted a cease-fire proposal to Hamas earlier this week and was awaiting the group’s review of the deal.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\nIDF officials said the strike had targeted “significant Hamas terrorists” who were operating in a Hamas compound.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "45d1370b-77fc-4e8b-a9db-dc6c4980289f", "title": "Russia New TOS - 3  Dragon  Thermobaric Rocket Launcher Breaks Cover", "date": "2024-06-05 00:00", "url": "https://www.yahoo.com/news/russia-tos-3-dragon-thermobaric-221228825.html", "message": "The latest iteration of Russia’s TOS series of thermobaric rocket launchers has been seen, apparently for the first time, in military service.\nThe latest iteration of Russia’s TOS series of thermobaric rocket launchers has been seen, apparently for the first time, in military service.\nRussian TOS series thermobaric rocket launchers have traditionally been assigned to the Troops of Radiological, Chemical, and Biological Defense, rather than artillery units, as might be expected.\nPhoto by Leonid Faerberg/SOPA Images/LightRocket via Getty ImagesAnother point of confusion surrounding the TOS series is the nature of their rocket armament.\nThe TOS series was designed to provide general fire support alongside infantry and tanks."}, {"id": "35cb3cb3-9967-42f6-8fe6-c998064145fb", "title": "eSafety drops case against Musk X over church attack", "date": "2024-06-05 04:15", "url": "https://www.illawarramercury.com.au/story/8652865/esafety-drops-case-against-musks-x-over-church-attack/", "message": "\"The government backs our regulators, and we back the eSafety Commissioner - particularly in light of the reprehensible threats to her physical safety and the threats to her family in the course of doing her job,\" she told parliament."}, {"id": "7f681f1b-e121-4523-8493-5689764853ce", "title": "Australia drops court case against X over church stabbing videos", "date": "2024-06-05 06:00", "url": "https://www.yahoo.com/news/australia-drops-court-case-against-051831995.html", "message": "Monika Skolimowska/dpaAustralia's internet watchdog has dropped a court case against Elon Musk's social media platform X, eSafety commissioner Julie Inman-Grant said on Wednesday.\nAustralia wanted to force X to remove footage of a Sydney church stabbing from the platform.\nInman-Grant said in a statement a Federal Court case had now been abandoned.\nThe case was seen as a test of Australia's ability to have social media platforms comply with the country's laws.\nThe church attack came days after six people were killed and dozens injured in a stabbing at a Sydney shopping centre."}, {"id": "ba31e32a-4222-469a-be3d-9321e5398e8c", "title": "Fatal stabbing of toddler in North Olmsted parking lot was random attack", "date": "2024-06-05 05:15", "url": "https://www.wcpo.com/news/state/state-ohio/toddler-fatally-stabbed-in-what-police-call-random-attack-in-ohio-grocery-parking-lot", "message": "NORTH OLMSTED, Ohio — North Olmsted officials held a news conference Tuesday afternoon to shed light on what happened in the minutes leading up to the fatal stabbing of a toddler in the Giant Eagle parking lot.\nPrior to the stabbing, Beck said Ellis had come to the North Olmsted Police Department to inquire about property secured during the arrest.\nI know that all the residents of North Olmsted join me in sharing their profound grief.\nWe thank the North Olmsted Mayor's Office and the community's first responders for their unwavering commitment.\nWe are providing counseling services to our store teams and are ready to support our North Olmsted neighbors however we can.”"}, {"id": "a4f3b620-b109-4eee-add9-95dc6b0d6398", "title": "Russia Ukraine war live : Putin faces rare protest as Kyiv fires first US weapon inside Russia", "date": "2024-06-05 06:00", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-war-putin-attack-weapons-nato-b2556849.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Russia is ready to strike French troops if they are sent to to Ukraine to help train Kyiv’s soldiers, the Kremlin has suggested.\nUkraine’s top commander Oleksandr Syrskyi said French trainers would come to Ukraine “soon” last week, which was downplayed by both Paris and Kyiv.\nIt doesn’t matter whether they’re French or not.”In February, French president Emmanuel Macron said the situation in Ukraine was “dynamic” and nothing could be ruled out.\nIt comes as Britain is seeking to send 1,000 first-person view drones to Ukraine as part of an international support coalition."}, {"id": "7d1da7f7-1056-40e8-a65b-22df5939e9e1", "title": "Teen stabbed on MAX sues city for not jailing attacker after prior run - ins with police", "date": "2024-06-05 00:00", "url": "https://www.yahoo.com/news/teen-stabbed-max-sues-city-214618108.html", "message": "Teen stabbed on MAX sues city for not jailing attacker after prior run-ins with policePORTLAND, Ore. (KOIN) – A teenager who was stabbed on a Portland MAX train is suing the city, claiming authorities had several opportunities to jail the attacker before the September 2023 incident, according to court documents.\nThe lawsuit highlights several run-ins Portland police had with Cummins before the stabbing.\nThe lawsuit then alleges several run-ins with Portland police, starting on April 27, 2023, when officers allegedly responded to a fight involving Cummins at a MAX station.\nAccording to the complaint, Portland police recovered a gun and a silencer belonging to Cummins and learned of his felony conviction in Florida.\nKOIN 6 News reached out to the City of Portland."}, {"id": "f9e6f1b9-6b45-4c9f-a209-95ee3bc08994", "title": "US flies B - 1B bomber for 1st precision bombing drill in 7 years as tensions simmer with North Korea", "date": "2024-06-05 08:45", "url": "https://toronto.citynews.ca/2024/06/05/us-flies-bomber-for-first-jdam-bombing-drill-in-7-years-as-tensions-simmer-with-north-korea/", "message": "The drill — seen as a show of force against North Korea — comes as tensions are rising over the North’s recent launches of rubbish-carrying balloons toward South Korea and other provocations.\nNorth Korea has previously responded to the flights of powerful U.S. aircraft in South Korea with its own missile tests.\nIn the past week, North Korea floated hundreds of huge balloons to drop manure, cigarette butts, scraps of cloth and waste batteries across South Korea.\nIn response, South Korea vowed “unbearable” retaliatory steps and suspended a fragile tension-reducing military deal with North Korea, restoring its front-line military activities.\nIt also test-fired nuclear-capable weapons for a drill simulating a pre-emptive strike on South Korea, and allegedly jammed GPS navigation signals in South Korea."}, {"id": "388cf554-a13a-426c-a6e3-17057a756613", "title": "US flies B - 1B bomber for 1st precision bombing drill in 7 years as tensions simmer with North Korea", "date": "2024-06-05 09:00", "url": "https://www.coastreporter.net/world-news/us-flies-b-1b-bomber-for-1st-precision-bombing-drill-in-7-years-as-tensions-simmer-with-north-korea-8986172", "message": "The U.S.SEOUL, South Korea (AP) — The United States flew a long-range B-1B bomber over the Korean Peninsula on Wednesday for its first precision-guided bombing drill with South Korea in seven years, the South said Wednesday.\nThe U.S. B-1B bomber conducted joint aerial drills with other U.S. and South Korean fighter jets, South Korea’s Defense Ministry said in a statement.\nThe drill is seen as a show of force against North Korea amid rising tensions over its recent launches of trash-carrying balloons toward South Korea.\nIn the past week, North Korea floated hundreds of huge balloons containing manure, cigarette butts, scraps of cloth, dead batteries and reportedly dirty diapers across the border into South Korea.\nIn response, South Korea vowed “unbearable” retaliatory steps and suspended a fragile military deal meant to ease tensions with its northern neighbor."}, {"id": "d3af8015-7bea-4058-8e06-3c34f8193537", "title": "U . S . Navy F / A - 18 Super Hornet Spotted With SM - 6 Missile Under Its Right Wing", "date": "2024-06-05 00:00", "url": "https://theaviationist.com/2024/06/04/u-s-navy-super-hornet-with-sm-6/", "message": "Originally developed as a surface-to-air missile, the Standard Missile 6 has been now installed, once again, on a Super Hornet.\nA U.S. Navy F/A-18 Super Hornet was spotted with a rather uncommon payload under its wings, an inert Standard Missile 6 (SM-6) surface-to-air missile.\npic.twitter.com/kIMiWFXcBo — StinkJet (@StinkJet) June 3, 2024“I was shooting other aircraft in the R-2508 and heard some activity from VX-9 on the radio,” @StinkJet told us .\nAs soon as the photos circulated online, discussion started about a possible integration of the weapon as a long-range air-to-air missile on the Super Hornet.\nThe Standard Missile 6The RIM-174 Standard Extended Range Active Missile (ERAM), or Standard Missile 6 (SM-6), is one of the weapons employed for the air defense of the U.S. Navy ships."}, {"id": "8708273f-0ff5-4c72-88cb-66619a196e19", "title": "X labels eSafety case drop a win for freedom of speech", "date": "2024-06-05 05:30", "url": "https://www.standard.net.au/story/8652865/x-labels-esafety-case-drop-a-win-for-freedom-of-speech/", "message": "\"The government backs our regulators, and we back the eSafety Commissioner - particularly in light of the reprehensible threats to her physical safety and the threats to her family in the course of doing her job,\" she told parliament."}, {"id": "460b2f72-48c6-4f6a-ab70-4b081e7265a8", "title": "X labels eSafety church case drop a win for free speech", "date": "2024-06-05 08:30", "url": "https://www.canberratimes.com.au/story/8652865/x-labels-esafety-church-case-drop-a-win-for-free-speech/?cs=14329", "message": "\"The government backs our regulators, and we back the eSafety Commissioner - particularly in light of the reprehensible threats to her physical safety and the threats to her family in the course of doing her job,\" she told parliament."}, {"id": "9586d683-2d18-43ca-a526-42d6c7b0ca99", "title": "Iran vows response if UN nuclear watchdog approves censure", "date": "2024-06-05 01:45", "url": "https://www.thenews.com.pk/print/1197039-iran-vows-response-if-un-nuclear-watchdog-approves-censure", "message": "The Iranian flag flutters in front of the International Atomic Energy Agency (IAEA) headquarters in Vienna, Austria, June 5, 2023.\n— ReutersTEHRAN: Iran threatened to respond Tuesday if the UN nuclear watchdog approves a new censure resolution proposed by three European governments despite the opposition of the United States, Iranian media reported.\nBritain, France and Germany submitted a draft resolution to the International Atomic Energy Agency’s board on Monday, condemning Iran for its failure to fully cooperate with the watchdog and demanding more accountability.\nAt the last IAEA board meeting in March, European powers shelved their plans to confront Iran due to a lack of US support.\nThe IAEA board has not passed a resolution criticising the Islamic republic since November 2022, when Iran responded by stepping up its enrichment of uranium."}, {"id": "b8a16097-a8a1-45b4-9959-d62b6a8ec90f", "title": "Ukraine Air Force downs 22 out of 27 Russian Shahed drones", "date": "2024-06-05 08:15", "url": "https://www.yahoo.com/news/ukraines-air-force-downs-22-044606834.html", "message": "Repelling an air attack.\nStock photo: General Staff of the Armed Forces of Ukraine on FacebookRussian forces attacked Ukraine with 27 Shahed attack drones on the night of 4-5 June, and Ukrainian defenders managed to destroy 22 drones.\nSource: Ukraine’s Air Force on TelegramQuote from the Air Force: \"As a result of combat efforts, 22 Shahed drones were shot down in Mykolaiv, Kherson, Dnipropetrovsk, Sumy and Poltava oblasts.\"\nDetails: It is reported that the Russians launched drones from the vicinity of the Russian city of Kursk and from Cape Chauda in temporarily occupied Crimea.\nThe Ukrainian Air Force's anti-aircraft missile and electronic warfare units, as well as the Ukrainian Defence Forces' mobile fire groups, were involved in repelling the air attack."}, {"id": "daacca4b-c66a-4fa6-9b82-43db5fe41ce0", "title": "Lebanese army says gunman attacked US embassy", "date": "2024-06-05 07:15", "url": "https://www.yahoo.com/news/lebanese-army-says-gunman-attacked-064306218.html", "message": "Gunman captured after shootout outside US Embassy in LebanonLebanese security stand guard on a road that leads to the U.S. Embassy in Aukar, a northern suburb of Beirut, Lebanon, Wednesday, June 5, 2024.\nA gunman was captured by Lebanese soldiers after attempting to attack the U.S. Embassy near Beirut on Wednesday, the military said.\n(AP Photo/Bilal Hussein)BEIRUT (AP) — A gunman was shot and captured by Lebanese soldiers after a shootout outside the U.S. Embassy outside Beirut on Wednesday morning, the military said.\nThe U.S. Embassy said the attack by the embassy’s entrance did not cause any casualties among their staff, and that Lebanese troops and embassy security mobilized quickly.\nIn September 2023, Lebanese security forces detained a Lebanese man who opened fire by the U.S. Embassy."}, {"id": "ab1e0132-56e6-401a-b4ef-91cb6b13ecc8", "title": "Lebanese army says gunman attacked US embassy", "date": "2024-06-05 09:00", "url": "https://www.stripes.com/theaters/middle_east/2024-06-05/us-embassy-lebanon-attacked-14085678.html", "message": "(AP)BEIRUT — The Lebanese army said Wednesday a gunman attempted to attack on the U.S. embassy near Beirut.\nThe Lebanese military in a statement said that soldiers shot an assailant, who they only described as a Syrian national.\nThe U.S. Embassy said the morning attack by the embassy’s entrance did not cause any casualties among their staff, and that Lebanese troops and embassy security mobilized quickly.\nThe Lebanese military said it deployed troops around the embassy and surrounding areas.\nIn September 2023, Lebanese security forces detained a Lebanese man who opened fire by the U.S. Embassy."}, {"id": "3b120e08-2297-46c0-a774-c9763cd39581", "title": "Lebanese army says gunman attacked US embassy", "date": "2024-06-05 07:15", "url": "https://www.clickorlando.com/news/world/2024/06/05/lebanese-army-says-gunman-attacked-us-embassy/", "message": "Lebanese security stand guard on a road that leads to the U.S. Embassy in Aukar, a northern suburb of Beirut, Lebanon, Wednesday, June 5, 2024.\nA gunman was captured by Lebanese soldiers after attempting to attack the U.S. Embassy near Beirut on Wednesday, the military said.\n(AP Photo/Bilal Hussein)BEIRUT – A gunman was shot and captured by Lebanese soldiers after a shootout outside the U.S. Embassy outside Beirut on Wednesday morning, the military said.\nThe U.S. Embassy said the attack by the embassy’s entrance did not cause any casualties among their staff, and that Lebanese troops and embassy security mobilized quickly.\nIn September 2023, Lebanese security forces detained a Lebanese man who opened fire by the U.S. Embassy."}, {"id": "07644f19-1875-42d4-9384-114056d4dbd5", "title": "Germany :  Islamist Extremist Kills Police Officer ; Several Injured ( Worthy News Focus ) ", "date": "2024-06-05 01:30", "url": "https://www.worthynews.com/95888-germany-islamist-extremist-kills-police-officer-several-injured-worthy-news-focus", "message": "By Stefan J. Bos, Chief International Correspondent Worthy NewsBERLIN (Worthy News) – Authorities in Germany say they believe an Islamist extremist carried out a knife attack in the southwestern city of Mannheim that killed a young police officer and left five others injured.\nFive members of the BPE were injured, along with a police officer who tried to stop the attack.\nISLAMIST EXTREMISM SPREADINGWhile most have integrated, tens of thousands are believed to be Islamist extremists, according to German authorities.\nBefore Friday’s stabbing, four teenagers were detained in Germany suspected of planning Islamic terror attacks against churches or synagogues, police said.\nIn October, German prosecutors also charged two Syrian brothers for planning an attack inspired by Islamic State on a church in Sweden."}, {"id": "e42b09db-f25c-4643-bc29-ac3e58da0fdd", "title": "  Widespread attack on pro - Palestine supporters in SA", "date": "2024-06-05 09:15", "url": "https://www.ecr.co.za/news/news/widespread-attacks-pro-palestine-supporters-sa/", "message": "Africa4Palestine has been commenting after a suspect made his first court appearance following the murder of Umbilo's mother, Halima Hoosen-Preston.\nGrayson Beare lined up in the Durban Magistrate's Court on Tuesday on charges of murder and attempted murder.\nREAD: Durban man in court for stabbing death of ‘Palestine supporter’Hoosen-Preston was stabbed in an attack on Sunday that was alleged to have been motivated by her family's support for Palestine.\n\"There is a history of a string of violence against pro-Palestine campaigners in this country.\nALSO READ: Accused in stabbing death of Durban woman sent for mental assessmentHe will be back in court next week."}, {"id": "a479b8b0-594f-48bd-a06a-0b651d3ed4c4", "title": "Israeli white phosphorus stalks south Lebanon : rights groups", "date": "2024-06-05 05:00", "url": "https://www.hurriyetdailynews.com/israeli-white-phosphorus-stalks-south-lebanon-rights-groups-197052", "message": "Israeli white phosphorus stalks south Lebanon: rights groupsBEIRUTMohammad Hammud, in his late 70s, was at home with his wife in a south Lebanon border village when Israeli bombing hit.\n'Asphyxiation'Lebanon's official National News Agency has repeatedly reported Israeli phosphorus bombing in south Lebanon, including in recent days, sometimes causing fires.\nDoctors at three other hospitals in south Lebanon told AFP their facilities had treated people with respiratory symptoms of white phosphorus exposure.\nAmnesty International last year said it had \"evidence of Israel's unlawful use of white phosphorus\" in south Lebanon between Oct. 10 and 16.\nThe White House in December expressed concern over reports that Israel used U.S.-supplied white phosphorus in attacks on Lebanon."}, {"id": "0c77075d-4b0a-42b8-9fa0-41046316fb4a", "title": "Australia drops case against X over stabbing videos", "date": "2024-06-05 04:00", "url": "https://www.yahoo.com/news/australia-drops-case-against-x-032646616.html", "message": "Australia has abandoned a legal battle to have graphic footage of a church stabbing in Sydney removed from Elon Musk's social media platform X.\nAustralia's eSafety Commissioner, an independent regulator, threatened X and other social media companies with hefty fines if they did not remove videos of the stabbing, concerned it could incite further violence.\nThe case was seen as a test of Australia's ability to enforce its online safety rules on the social media giants.\nThe Federal Court had temporarily ordered X hide the videos - but it refused to comply saying the order was not valid.\nX, formerly Twitter, did eventually block access to the video in Australia, but users could easily get around this by using a VPN."}, {"id": "957c0d67-7c26-46d5-b9f8-c47a482934d1", "title": "Elon Musk : Australia drops case against X over stabbing videos", "date": "2024-06-05 05:00", "url": "https://www.bbc.com/news/articles/cv229qm7nepo", "message": "Australia drops case against X over stabbing videosDeclared a terror incident by police, the attack on bishop Mar Mari Emmanuel in April was livestreamed online and led to riots outside the Christ The Good Shepherd Church in Wakeley.\nAustralia's eSafety Commissioner, an independent regulator, threatened X and other social media companies with hefty fines if they did not remove videos of the stabbing, concerned it could incite further violence.\nThe case was seen as a test of Australia's ability to enforce its online safety rules on the social media giants.\nThe Federal Court had temporarily ordered X hide the videos - but it refused to comply saying the order was not valid.\nX, formerly Twitter, did eventually block access to the video in Australia, but users could easily get around this by using a VPN."}, {"id": "3da0a81c-2a0e-40ef-92c2-6a32d16890a6", "title": "Woman Mayor Assassinated In Mexico Following Sheinbaum Presidential Victory", "date": "2024-06-05 00:15", "url": "https://dailycaller.com/2024/06/04/yolanda-sanchez-figueroa-mayor-assassinated-mexico-sheinbaums-presidential-victory/", "message": "Yolanda Sanchez Figueroa, the mayor of Cotija, was killed along with her bodyguard in a violent attack Monday, CBS News reported.\nThe attack also claimed the life of her bodyguard, identified only as Jesús V, according to the local government, CBS News reported.\nWoman mayor shot dead in Mexico day after Claudia Sheinbaum’s historic presidential win https://t.co/zNUvt2H7I3 — CBS Evening News (@CBSEveningNews) June 4, 2024The Michoacan attorney general’s office reported that the attackers opened fire from their moving vehicle before making their escape, CBS News reported.\nAttacks targeted several mayoral candidates and other public officials in May, underscoring the dangerous conditions for public servants.\nFigueroa had previously encountered such threats and she was kidnapped Sept. 2023 in Guadalajara, Jalisco, and released three days later, CBS News reported."}, {"id": "e1e302f9-ac62-4b89-8b1c-1e93f4d1b1e8", "title": "Lebanese army says gunman attacked US embassy", "date": "2024-06-05 07:30", "url": "https://www.whec.com/national-world/lebanese-army-says-gunman-attacked-us-embassy/", "message": "BEIRUT (AP) — A gunman was shot and captured by Lebanese soldiers after a shootout outside the U.S. Embassy outside Beirut on Wednesday morning, the military said.\nThe Lebanese military in a statement said that soldiers shot an assailant, who they only described as a Syrian national.\nThe Lebanese army said Wednesday a gunman attempted to attack on the U.S. embassy near Beirut.\n(AP Photo/Bilal Hussein) Photo: ASSOCIATED PRESS/Bilal HusseinThe U.S. Embassy said the attack by the embassy’s entrance did not cause any casualties among their staff, and that Lebanese troops and embassy security mobilized quickly.\nIn September 2023, Lebanese security forces detained a Lebanese man who opened fire by the U.S. Embassy."}, {"id": "c18491af-ab19-4021-85c0-d1bf8a098688", "title": "Musk X off the hook as Australian watchdog abandons court battle over violent priest attack clips", "date": "2024-06-05 07:15", "url": "https://www.firstpost.com/world/musks-x-off-the-hook-as-australian-watchdog-abandons-court-battle-over-violent-priest-attack-clips-13778905.html", "message": "The watchdog had ordered Musk’s company to globally remove about 65 video and audio clips of the April 15 non-fatal attack against an Assyrian bishop read moreAustralia’s online watchdog on Wednesday dropped a legal effort to force Elon Musk’s X to remove posts depicting the violent stabbing of a Sydney priest.\n“I have decided to discontinue the proceedings in the Federal Court against X Corp,” eSafety Commissioner Julie Inman Grant said in a statement.\nThe watchdog had ordered Musk’s company to globally remove about 65 video and audio clips of the April 15 non-fatal attack against an Assyrian bishop.\nAdvertisementBut X challenged the commission’s right to make a global takedown order, arguing that geoblocking users in Australia was enough.\nThe eSafety Commissioner said she now “welcomed the opportunity” for a merits-based review of her decision by the country’s Administrative Appeals Tribunal."}, {"id": "bd33f6b2-416a-420f-b5e0-b42a778e9e44", "title": "Day 242 Update :  Israeli Missiles Kill Dozens Across Gaza  |", "date": "2024-06-05 04:15", "url": "https://imemc.org/article/day-242-update-israeli-missiles-kill-dozens-across-gaza/", "message": "On Tuesday, the Israeli army continued the bombing and shelling of various parts of the destroyed and besieged Gaza Strip, killing and wounding dozens of Palestinians, including women and children.\nAn earlier Israeli bombing killed three Palestinians and injured several others in a home in the Al-Maghazi refugee camp.\nFurthermore, an Israeli drone fired a missile at Palestinians, east of Rafah, in the Gaza Strip’s southmost area, killing at least two and injuring several others.\nThe Israeli army continued its invasions and bombings of large parts of Rafah, in Gaza’s southmost area, wired and detonated dozens of homes near the perimeter fence with Egypt.\nFurthermore, the army fired many artillery shells at various areas in the center of Rafah city and its western parts."}, {"id": "307305ac-1bd5-4278-a267-56aa8462497b", "title": "Organizer of deadly Mississauga restaurant shooting ordered men to  slaughter  victims , court hears", "date": "2024-06-05 02:45", "url": "https://www.cbc.ca/news/canada/toronto/mississauga-chicken-land-shooting-trial-june-4-1.7224721", "message": "I later found out that that was some ISIS leader,\" Aras told the 14-member jury.\n(Facebook/Canadian Druze Society)Prosecutors allege the men operated a business called TryALinc, and were buying and selling Amazon products out of a Mississauga warehouse.\nAras told the court Abbasi confessed to sending money they made from the business to Pakistan, where he is originally from, to support ISIS.\nShove it up your ass… you're a f—g idiot, loser,\" Abbasi told Akl on the call.\nAras testified Nath had a panic attack in the middle of the night on the night of the attack."}, {"id": "97b8257c-e053-473a-8a0b-c1588730fe14", "title": "Australian watchdog drops court fight with X over violent posts", "date": "2024-06-05 04:45", "url": "https://www.yahoo.com/news/australian-watchdog-drops-court-fight-040554798.html", "message": "Australia's online watchdog has dropped a legal effort to force Elon Musk's X to remove posts depicting the violent stabbing of a Sydney priest (Apu Gomes)Australia's online watchdog on Wednesday dropped a legal effort to force Elon Musk's X to remove posts depicting the violent stabbing of a Sydney priest.\n\"I have decided to discontinue the proceedings in the Federal Court against X Corp,\" eSafety Commissioner Julie Inman Grant said in a statement.\nThe watchdog had ordered Musk's company to globally remove about 65 video and audio clips of the April 15 non-fatal attack in a church.\nBut X challenged the commission's right to make a worldwide takedown order, insisting that geoblocking users in Australia was enough.\nThe watchdog had argued that X's measures were easily dodged with the use of popular location-masking services like VPN."}, {"id": "575bbad0-3dc7-4cd5-9a90-005d9ef9b910", "title": "Sky News Really Had a Rough Few Days of Headlines", "date": "2024-06-05 01:30", "url": "https://townhall.com/tipsheet/rebeccadowns/2024/06/04/sky-news-really-had-a-rough-few-days-of-headlines-n2639939", "message": "It's been a really rough few days for Sky News, which has been trending on social media for several problematic headlines on a variety of topics.\nIronically, the bio and cover photo for the Sky News X account claims readers get \"The full story, first.\"\nIn addition to sharing screenshots of the headlines, Bonchie at our sister site of RedState wrote multiple pieces last November about Sky News' problematic coverage regarding Hamas in the weeks following the October 7 terrorist attack.\nThere have been thousands of outraged reactions to the posts, including but not limited to the thousands of replies and quoted reposts that have served as a ratio to the problematic headlines.\nWe really don't hate the media enough pic.twitter.com/Ho0gqZJ0ro — End Wokeness (@EndWokeness) June 3, 2024This headline is amazing."}, {"id": "fc52e743-b0fe-4288-a4ac-9b84d033f597", "title": "Australian watchdog drops court fight with X over violent posts", "date": "2024-06-05 05:00", "url": "https://www.digitaljournal.com/world/australian-watchdog-drops-court-fight-with-x-over-violent-posts/article", "message": "Australia's online watchdog has dropped a legal effort to force Elon Musk's X to remove posts depicting the violent stabbing of a Sydney priest - Copyright GETTY IMAGES NORTH AMERICA/AFP/File Apu GomesDavid WILLIAMSAustralia’s online watchdog on Wednesday dropped a legal effort to force Elon Musk’s X to remove posts depicting the violent stabbing of a Sydney priest.\n“I have decided to discontinue the proceedings in the Federal Court against X Corp,” eSafety Commissioner Julie Inman Grant said in a statement.\nThe watchdog had ordered Musk’s company to globally remove about 65 video and audio clips of the April 15 non-fatal attack in a church.\nBut X challenged the commission’s right to make a global takedown order, arguing that geoblocking users in Australia was enough.\nThe disputed posts showed Assyrian orthodox Bishop Mar Mari Emmanuel being stabbed about six times during a livestreamed sermon."}, {"id": "4907ba81-baec-4c12-9041-d50b9506f5ed", "title": "Gunman attempts attack on US Embassy in Lebanon", "date": "2024-06-05 08:30", "url": "https://www.nbcbayarea.com/news/national-international/gunman-attempts-attack-on-us-embassy-in-lebanon/3557689/", "message": "A gunman was shot and captured by Lebanese soldiers after a shootout outside the U.S. Embassy outside Beirut on Wednesday morning, the military said.\nThe Lebanese military in a statement said that soldiers shot an assailant, who they only described as a Syrian national.\nThe U.S. Embassy said the attack by the embassy’s entrance did not cause any casualties among their staff, and that Lebanese troops and embassy security mobilized quickly.\nThe Lebanese military said it deployed troops around the embassy and surrounding areas.\nIn September 2023, Lebanese security forces detained a Lebanese man who opened fire by the U.S. Embassy."}, {"id": "be5f0c0f-cbe9-4a61-b5cc-6889b50018d6", "title": "Gunman attempts attack on US Embassy in Lebanon", "date": "2024-06-05 09:00", "url": "https://www.nbcphiladelphia.com/news/national-international/gunman-attempts-attack-on-us-embassy-in-lebanon/3877153/", "message": "A gunman was shot and captured by Lebanese soldiers after a shootout outside the U.S. Embassy outside Beirut on Wednesday morning, the military said.\nThe Lebanese military in a statement said that soldiers shot an assailant, who they only described as a Syrian national.\nThe U.S. Embassy said the attack by the embassy’s entrance did not cause any casualties among their staff, and that Lebanese troops and embassy security mobilized quickly.\nThe Lebanese military said it deployed troops around the embassy and surrounding areas.\nIn September 2023, Lebanese security forces detained a Lebanese man who opened fire by the U.S. Embassy."}, {"id": "782b10b5-9117-4d40-b8e6-4b32e9b357fa", "title": "US flies bomber for first JDAM bombing drill in 7 years as tensions simmer with North Korea – Winnipeg Free Press", "date": "2024-06-05 08:00", "url": "https://www.winnipegfreepress.com/world/2024/06/05/us-flies-bomber-for-first-jdam-bombing-drill-in-7-years-as-tensions-simmer-with-north-korea", "message": "The exercise was meant to demonstrate the U.S. security commitment to South Korea and strengthen the allies’ joint defense posture, according to the South Korean Defense Ministry.\nNorth Korea has previously responded to the flights of powerful U.S. aircraft in South Korea with its own missile tests.\nIn the past week, North Korea floated hundreds of huge balloons to drop manure, cigarette butts, scraps of cloth and waste batteries across South Korea.\nIn response, South Korea vowed “unbearable” retaliatory steps and suspended a fragile tension-reducing military deal with North Korea, restoring its front-line military activities.\nIt also test-fired nuclear-capable weapons for a drill simulating a pre-emptive strike on South Korea, and allegedly jammed GPS navigation signals in South Korea."}, {"id": "f87279fd-1ee6-4e47-b439-e0adb1222d00", "title": "Gunman attempts attack on US Embassy in Lebanon", "date": "2024-06-05 09:15", "url": "https://www.ky3.com/2024/06/05/lebanese-army-says-gunman-attacked-us-embassy/", "message": "BEIRUT (AP) - A gunman was shot and captured by Lebanese soldiers after a shootout outside the U.S. Embassy outside Beirut on Wednesday morning, the military said.\nThe Lebanese military in a statement said that soldiers shot an assailant, who they only described as a Syrian national.\nThe U.S. Embassy said the attack by the embassy’s entrance did not cause any casualties among their staff, and that Lebanese troops and embassy security mobilized quickly.\nFollowing that attack, the embassy was moved from central Beirut to the Christian suburb of Aukar, north of the capital.\nIn September 2023, Lebanese security forces detained a Lebanese man who opened fire by the U.S. Embassy."}, {"id": "ae03b8bb-782e-436b-9683-65b771c1a089", "title": "Elon Musk : Australian watchdog drops court fight with X over violent posts", "date": "2024-06-05 05:00", "url": "https://economictimes.indiatimes.com/tech/technology/australian-watchdog-drops-court-fight-with-x-over-violent-posts/articleshow/110720550.cms", "message": "Elevate Your Tech Prowess with High-Value Skill Courses Offering College Course Website IIT Delhi Certificate Programme in Data Science & Machine Learning Visit Indian School of Business ISB Product Management Visit MIT xPRO MIT Technology Leadership and Innovation VisitAustralia's online watchdog on Wednesday dropped a legal effort to force Elon Musk 's X to remove posts depicting the violent stabbing of a Sydney priest \"I have decided to discontinue the proceedings in the Federal Court against X Corp ,\" eSafety Commissioner Julie Inman Grant said in a statement.The watchdog had ordered Musk's company to globally remove about 65 video and audio clips of the April 15 non-fatal attack in a church.But X challenged the commission's right to make a global takedown order , arguing that geoblocking users in Australia was enough.The watchdog had argued X's measures were easily dodged with the use of popular location-masking services like VPN.Inman Grant -- a former Twitter employee -- defended the decision to take legal action: \"I stand by my investigators and the decisions eSafety made.\n\"\"Our sole goal and focus in issuing our removal notice was to prevent this extremely violent footage from going viral, potentially inciting further violence and inflicting more harm on the Australian community,\" she said.The disputed posts showed Assyrian orthodox Bishop Mar Mari Emmanuel being stabbed about six times during a livestreamed sermon.Video of the attack, which spread widely on social media and sparked a riot by followers of the church in western Sydney, has been blamed by Australian authorities for feeding tensions in the community.A 16-year-old has been charged with \"committing a terrorist act\" in relation to the attack, which is said to have been religiously motivated.The eSafety Commissioner said most Australians accepted that such graphic material should not be broadcast on television.This \"begs an obvious question of why it should be allowed to be distributed freely and accessible online 24/7 to anyone, including children,\" she said.Inman Grant said X routinely took down content globally, citing its removal of a compilation video of a knifeman's rampage in a Sydney shopping mall in April.Other major platforms had complied with the watchdog's requests and removal notices related to the church attack , she said, including Meta , Microsoft, Google, Snap, TikTok, Reddit and Telegram.\n\"This is because the video violated their terms of service and their standards of decency.\n\"Inman Grant said she now \"welcomed the opportunity\" for a merits-based review of her decision by the country's Administrative Appeals Tribunal.Her decision to drop the case followed a setback last month when the Federal Court refused to extend the order for a global ban while the court case was being fought."}, {"id": "18a51d02-44b9-4fbf-a5bf-98adec1a2a6e", "title": "Russia - Ukraine war : List of key events , day 831", "date": "2024-06-05 02:30", "url": "https://www.aljazeera.com/news/2024/6/5/russia-ukraine-war-list-of-key-events-day-831", "message": "Russia-Ukraine war: List of key events, day 831As the war enters its 831st day, these are the main developments."}, {"id": "d4a0fa7c-2e37-4937-a675-97bf5d7618cc", "title": "Perth man charged over Gooseberry Hill DV stabbing", "date": "2024-06-05 00:00", "url": "https://www.smh.com.au/national/western-australia/perth-man-charged-over-gooseberry-hill-dv-stabbing-20240605-p5jjdk.html", "message": "A Perth man has been charged with attempted murder over the stabbing of a woman in Gooseberry Hill last night, in yet another suspected family violence incident.\nChristopher John Sullivan, 72, is accused of stabbing the 60-year-old woman, who is known to him, multiple times in the neck and torso.\nIt’s alleged he then barricaded himself inside a property on Jessie Road, with tactical response group officers attending the scene to coax him out.\nA neighbour told 9 News Perth they heard screams and discovered the victim injured in a front garden around 5.30pm."}, {"id": "f764aa44-553d-4f46-bc77-0a2c8f36525c", "title": "  Ive stabbed someone : Teen who was filmed stabbing boy to death on dancefloor at party facing life sentence", "date": "2024-06-05 05:30", "url": "https://www.perthnow.com.au/news/crime/ive-stabbed-someone-teen-who-was-filmed-stabbing-boy-to-death-on-dancefloor-at-party-facing-life-sentence--c-14916261", "message": "A teenager filmed on a mobile phone stabbing a boy to death at a party is facing a life sentence.\nThe killer, who was 16 at the time, had prolonged the court ordeal for the parents of murdered Charlie Cosser by withdrawing his initial guilty plea.\nREAD NOWYesterday Charlie’s parents Martin and Tara wept in relief and hugged as the boy was convicted at Brighton Crown Court.\n“We were all hoping for it but you’ve got to hear them [the jury] say it.”Camera Icon Charlie Cosser, 17, died on July 25th.\nThe killer was then heard to say ‘I’ve stabbed someone five or six times” before he fled the party and then burned his clothes to hide the evidence."}, {"id": "68728fba-1fd2-4e54-94db-f27c58c45d40", "title": "Perth news ; WA news LIVE : Man charged with attempted murder over Gooseberry Hill DV stabbing", "date": "2024-06-05 00:00", "url": "https://www.smh.com.au/national/western-australia/wa-news-live-man-charged-with-attempted-murder-over-gooseberry-hill-dv-stabbing-20240604-p5jjae.html", "message": "St Andrew’s Grammar School in Dianella earlier today voiced its opposition for the proposal, which was also rejected by the City of Stirling a week ago.\n“I’d hate to think we’re looking back 10 years down the line with health concerns of anyone in this community.\nCommon sense needs to prevail here, it’s just not the right place to be placing that sorry of material.”However, Cook said the final approval rests with the WA Planning Commission.\n“There’s a proposal that’s been put to the WA Planning Commission, and they’ll consider that proposal in due course,” he said.\nThe site would include an excavation pit and dozens of trucks coming and going each day."}, {"id": "aeff162f-f695-4c5f-9e1b-1a163a804d2e", "title": "Perth man charged over Gooseberry Hill DV stabbing", "date": "2024-06-05 02:30", "url": "https://www.watoday.com.au/national/western-australia/perth-man-charged-over-gooseberry-hill-dv-stabbing-20240605-p5jjdk.html", "message": "A Perth man has been charged with attempted murder over the stabbing of a woman in Gooseberry Hill last night, in yet another suspected family violence incident.\nChristopher John Sullivan, 72, is accused of stabbing the 60-year-old woman, who is known to him, multiple times in the neck and torso.\nIt’s alleged he then barricaded himself inside a property on Jessie Road, with tactical response group officers attending the scene to coax him out.\nA neighbour told 9 News Perth they heard screams and discovered the victim injured in a front garden around 5.30pm."}, {"id": "0607c147-d415-4fd4-b7c8-66a6b8604b81", "title": "eSafety drops case against Musk X over church attack", "date": "2024-06-05 04:00", "url": "https://www.bunburymail.com.au/story/8652865/esafety-drops-case-against-musks-x-over-church-attack/?cs=30776", "message": "\"The government backs our regulators, and we back the eSafety Commissioner - particularly in light of the reprehensible threats to her physical safety and the threats to her family in the course of doing her job,\" she told parliament."}, {"id": "0d6ce32d-7e6e-40ae-8132-995f9d61c3de", "title": "Perth man charged over Gooseberry Hill DV stabbing", "date": "2024-06-05 00:15", "url": "https://www.brisbanetimes.com.au/national/western-australia/perth-man-charged-over-gooseberry-hill-dv-stabbing-20240605-p5jjdk.html", "message": "A Perth man has been charged with attempted murder over the stabbing of a woman in Gooseberry Hill last night, in yet another suspected family violence incident.\nChristopher John Sullivan, 72, is accused of stabbing the 60-year-old woman, who is known to him, multiple times in the neck and torso.\nIt’s alleged he then barricaded himself inside a property on Jessie Road, with tactical response group officers attending the scene to coax him out.\nA neighbour told 9 News Perth they heard screams and discovered the victim injured in a front garden around 5.30pm."}, {"id": "6366ffad-b5b8-4ae9-80f8-120afc1b27a4", "title": "Russia Yasen - M Class Submarine : Now A Hypersonic Nightmare for NATO ? ", "date": "2024-06-05 00:45", "url": "https://nationalinterest.org/blog/buzz/russias-yasen-m-class-submarine-now-hypersonic-nightmare-nato-210629", "message": "Russia is planning to enhance its naval capabilities by equipping its Yasen-M class nuclear submarines with the advanced Zircon hypersonic missiles.\nSummary: Russia is reportedly allocating funds to equip its new Yasen-M class nuclear submarines with Zircon hypersonic missiles.\nGame-Changer: Russian Submarines May Soon Deploy Zircon Hypersonic MissilesRussia is reportedly allocating funds to equip its new nuclear submarines with hypersonic missiles.\nLast summer, the head of Russia’s largest shipbuilder announced that the Zircon missile will be incorporated on the Yasen-M, the leading class of Russian submarines.\nIf these hypersonic missiles are incorporated onto the Yasen submarines, it will give a huge boost to Russia’s naval strategy."}, {"id": "ae7df741-b3a9-48fd-95a2-61116c4c91bd", "title": "Gunman attempts attack on US Embassy in Lebanon", "date": "2024-06-05 08:45", "url": "https://www.wilx.com/2024/06/05/lebanese-army-says-gunman-attacked-us-embassy/", "message": "BEIRUT (AP) - A gunman was shot and captured by Lebanese soldiers after a shootout outside the U.S. Embassy outside Beirut on Wednesday morning, the military said.\nThe Lebanese military in a statement said that soldiers shot an assailant, who they only described as a Syrian national.\nThe U.S. Embassy said the attack by the embassy’s entrance did not cause any casualties among their staff, and that Lebanese troops and embassy security mobilized quickly.\nFollowing that attack, the embassy was moved from central Beirut to the Christian suburb of Aukar, north of the capital.\nIn September 2023, Lebanese security forces detained a Lebanese man who opened fire by the U.S. Embassy."}, {"id": "fb3ac793-72e5-460b-8a96-52e4c3ff0dd5", "title": "eSafety drops case against Musk X over church attack", "date": "2024-06-05 04:15", "url": "https://www.newcastleherald.com.au/story/8652865/esafety-drops-case-against-musks-x-over-church-attack/", "message": "\"The government backs our regulators, and we back the eSafety Commissioner - particularly in light of the reprehensible threats to her physical safety and the threats to her family in the course of doing her job,\" she told parliament."}, {"id": "12001afd-2bbe-4204-9737-0875699ec596", "title": "Trial underway for Lincoln man accused in stepfather murder", "date": "2024-06-05 03:15", "url": "https://www.1011now.com/2024/06/04/trial-underway-lincoln-man-accused-stepfathers-murder/", "message": "(KOLN) - A trial is now underway for a Lincoln man accused of stabbing and killing his stepfather.\nJoseph Kruger has been charged with first-degree murder and use of a deadly weapon to commit a felony.\nAccording to court documents, it all started when Joseph Kruger scolded a child at a family gathering, upsetting his stepfather, Mark Kruger.\nAccording to Eric Miller, the prosecutor in the trial, Mark did throw the first punch, but was provoked by Joseph.\n“Joseph Kruger knowingly killed Mark Kruger, because he was angry with him,” Miller said."}, {"id": "ceaac7f5-3234-4a06-ac32-9034dddb5651", "title": "A Saab Success : How a Viggen Sale to India Could Have Reshaped Aviation History – Indian Defence Research Wing", "date": "2024-06-05 03:45", "url": "https://idrw.org/a-saab-success-how-a-viggen-sale-to-india-could-have-reshaped-aviation-history/", "message": "A Saab Success: How a Viggen Sale to India Could Have Reshaped Aviation History| BySOURCE: AFISaab Gripen-E which is one of the contender in the IAF’s MRFA tender for 114 jets was not the first instance when Swedish jet was offered to India.\nHere, we explore an alternate history where the US greenlights the sale of the Saab Viggen to India in the late 70s, with deliveries starting around 1979.\nWhile the MiG-27 remained a workhorse for the IAF, a successful Viggen induction might have seen the IAF prioritize it for specific roles.\nIAF had need for nearly 300 units of Jaguar and MiG-27 jet that were later locally assembled in India but Viggen sale to India could have negated such need for two separate types for Strike missions.\nOverall, a successful Viggen acquisition by India could have had a ripple effect, potentially boosting Saab’s sales and influencing the IAF’s future airpower strategy."}, {"id": "e1c27c55-0d23-4394-aeb3-18346d86bffd", "title": "India Nuclear Ambitions : Expansion Plans for Attack Submarines – Indian Defence Research Wing", "date": "2024-06-05 03:45", "url": "https://idrw.org/indias-nuclear-ambitions-expansion-plans-for-attack-submarines/", "message": "India’s Nuclear Ambitions: Expansion Plans for Attack Submarines| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGIndia’s strategic outlook in the Indian Ocean Region (IOR) is taking a significant leap forward with plans for a new fleet of nuclear attack submarines (SSNs).\nThis program, reportedly initiated in 2015 by the Cabinet Committee on Security (CCS), aims to bolster India’s “overall deterrence capability” in the region.\nThe new SSNs will complement India’s existing nuclear triad, which comprises land-based ballistic missiles, nuclear-powered ballistic missile submarines (SSBNs), and now, nuclear attack submarines.\nPhase II reportedly includes plans for an additional three submarines, while Phase III envisions even more advanced variants, potentially bringing the total fleet to nine.\nDespite the challenges, India’s SSN program reflects its aspirations for a more potent and versatile navy."}, {"id": "faa9437e-11db-4934-ba28-e2b573c8cd3a", "title": "Understanding the power of Iran IRGC Quds Force - opinion", "date": "2024-06-05 03:30", "url": "https://www.jpost.com/opinion/article-804996", "message": "In the intricate and turbulent world of international politics, few criminal entities are as controversial as Iran’s Quds Force.\nThese state-backed proxies are instrumental in extending Iran’s influence beyond its borders, undertaking much of the physical confrontations involved in Iran’s regional power plays.\nThe IRGC, with the Quds Force as its pivotal arm, has evolved into a formidable political and economic force within Iran.\nThis integration illustrates the profound roles that the IRGC and the Quds Force play in military operations and within the civic and economic realms of the country.\nAs events continue to unfold in the Middle East, the role of the Quds Force as both a precursor and a creator of geopolitical shifts is increasingly apparent."}, {"id": "02f92223-b8cf-46eb-81f0-26e7e41bc8cf", "title": "D - Day : What happened during the landings of 1944 ? ", "date": "2024-06-05 08:45", "url": "https://www.yahoo.com/news/d-day-happened-during-landings-080145111.html", "message": "D-Day: What happened during the landings of 1944?\nCommemorations for the 80th anniversary of the D-Day landings, also known as the Normandy landings, are under way.\nTroops from the UK, the US, Canada, and France attacked German forces on the coast of northern France, on 6 June 1944.\nD-Day is a military term for the first day of an operationWhat happened on the day?\nThe landings would not have been possible without the support of massive air and naval forces, which were much stronger than those of the Germans."}, {"id": "ed170948-d1cc-4796-b801-425bd2d49ab0", "title": "King Soopers mass shooting suspect attorneys request new venue for trial", "date": "2024-06-05 00:00", "url": "https://www.yahoo.com/news/king-soopers-mass-shooting-suspect-214642107.html", "message": "The mass shooting made headlines around the world.\nIn May, state experts found that Alissa had untreated mental illness at the time of the mass shooting but was legally sane for the attack.\nThose attorneys said even things like a museum dedicated to victims could impact potential jurors.\nFOX31 Newsletters: Sign up to get breaking news sent to your inboxSome 600 people are expected to be called as potential jurors starting Aug. 26.\nThe court is still trying to decide how to handle so many potential jurors and who will be allowed to attend that process."}, {"id": "cff3a1a9-56e7-4a82-bcad-d1dafd65e411", "title": "Letter | Appalled by antisemitism seen on UC campuses", "date": "2024-06-05 00:45", "url": "https://www.santacruzsentinel.com/2024/06/04/letter-appalled-by-antisemitism-seen-on-uc-campuses/", "message": "I am appalled by the recent displays of antisemitism in the U.S. Across the country there has been an expression of anti-Israel and antisemitic vitriol.\nThe protests against Israel Defense Forces actions by ill-informed students occupying campus open spaces and university buildings ring hollow.\nI am equally appalled by the faculty on UC campuses who choose to join these protests.\nTheir job is to teach students how to think, not to reward them for adopting the faculty’s favored political agenda.\nOccasionally, we reject letters simply because we’ve had so many on the same subject."}, {"id": "88f5a061-b87b-4157-ad72-69f75cfde023", "title": "A Three - Theater Defense Strategy", "date": "2024-06-05 08:15", "url": "https://www.foreignaffairs.com/united-states/theater-defense-war-asia-europe-middle-east", "message": "Under Presidents Barack Obama, Donald Trump, and Joe Biden, U.S. defense strategy has been premised on the optimistic notion that the United States will never need to fight more than one war at a time.\nPUTTING FRIENDS FIRSTThe first effort the United States and its allies must step up is defense production.\nTo solve this problem, the United States must streamline and speed up the process for foreign clients.\nThe United States is a global leader in some defense manufacturing areas, but many of its allies have comparative advantages in others.\nSHARING IS CARINGThe United States and its partners need to cooperate more closely on munitions, military basing, and the defense industry more broadly."}, {"id": "93d8968d-3003-4e39-b170-acc643bf343c", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-06-05 03:30", "url": "https://www.tvguide.co.uk/schedule/e139e489-1557-5d73-86a7-19080ffe27a9/combat-dealers", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Wednesday 5 June Share Add toCalendar +World War One Mystery Season 3 Episode 9 of 10 S Subtitles Audio DescriptionEccentric military equipment collector Bruce Crompton heads on a First World War treasure hunt, finding a mysterious soldier's medal from the Battle of the Somme as well as the world's most expensive footballCombat Dealers airs on Discovery Channel HD at 9:00 AM, Wednesday 5 June .\n(Subtitles, audio description.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual pageTopics Education ➝ Science ➝ Factual Topics Docu-soap"}, {"id": "1064ca84-928d-4107-998e-64cd7fd2f74b", "title": "West on course for  a decade of rearmament , warns boss of united kingdom explosives maker", "date": "2024-06-05 00:45", "url": "https://www.dailymail.co.uk/money/markets/article-13494413/West-course-decade-rearmament-warns-boss-UK-explosives-maker.html", "message": "The threat of global conflict will lead to a decade of rearmament as the West bolsters its defences, the boss of a UK explosives maker warned.\nMichael Ord, chief executive of Chemring, said the ‘increase in geo-political tensions around the world’ has prompted governments to raise military spending.\nThe FTSE 250 company, which specialises in devices to combat chemical and biological warfare, supplies large defence groups and Nato allies.\nThe rise in the value of its order book came alongside an 8 per cent jump in first-half revenues to £223.4million.\nChemring shares, up nearly 50 per cent since the Hamas attacks on Israel in October, were flat at 394.5p yesterday."}, {"id": "89482c26-c792-4865-8923-9bda6ab329d5", "title": "Biden showing signs of decline as pols , aides detail 81 - year - old slipping cognitive fitness :  Not the same person  ", "date": "2024-06-05 02:45", "url": "https://freerepublic.com/focus/f-news/4242252/posts", "message": "Biden showing signs of decline as pols, aides detail 81-year-old’s slipping cognitive fitness: ‘Not the same person’New York Post ^ | June 4, 2024 | Victor NavaPosted on by Reno89519President Biden’s cognitive decline is readily apparent and a concern for dozens who have interacted with the 81-year-old commander-in-chief in recent months, according to a shocking report Tuesday.\nby 2 posted onby Jonty30 (He hunted a mammoth for me, just because I said I was hungry.\nby 5 posted onby Leep (Leftardism strikes 1 in 5.)\nby 7 posted onby Bullish (...And just like that, I was dropped from the ping-list)To: Reno89519and deferred to aides puppeteers & large rabbits during conferences fixed itby 8 posted onby kiryandil (FR Democrat Party operatives!\nhttps://www.realclearpolling.com/polls/president/general/2020/trump-vs-bidenhttps://www.realclearpolling.com/polls/president/general/2024/trump-vs-bidenby 15 posted onby Zhang Fei (My dad had a Delta 88."}, {"id": "025fa908-57e7-4c90-9b02-ae6528e885c5", "title": "Did You Know That The British Used  Chemical Warfare  During The Malayan Emergency ? ", "date": "2024-06-05 06:45", "url": "https://www.therakyatpost.com/news/2024/06/05/did-you-know-that-the-british-used-chemical-warfare-during-the-malayan-emergency/", "message": "As we all know from our history books, Malaya suffered under the Japanese occupation but did you know that the British had used chemical and biological warfare on the locals then too?\nDuring the Malayan Emergency aka Darurat (1948-1960), an insurgency to overthrow the British colonial administration, the British used herbicides that are said to be a version of Agent Orange as part of their “Scorched Earth Policy.”The British journal New Scientist revealed in 1984 that the British army had used a herbicide identical to Agent Orange.\nAs such, the British also argued that using Agent Orange could not be considered biological or chemical warfare because it was considered a herbicide and defoliant.\nNga, a victim of Agent Orange herself, initially did not know she was exposed to the chemicals.\nShe suspected her child was a victim of Agent Orange decades later after encountering veterans and their disabled children in similar situations."}, {"id": "b62e015d-0263-44f9-9f1c-285b9dcec02a", "title": "Idris Elba helps uncover the WWII soldiers of color who never got their due - New Delhi Times - India Only International Newspaper", "date": "2024-06-05 05:15", "url": "https://www.newdelhitimes.com/idris-elba-helps-uncover-the-wwii-soldiers-of-color-who-never-got-their-due/", "message": "One of Idris Elba’s grandfathers fought in World War II, but he doesn’t know what he endured.\n“That part of my family’s history has been erased somewhat,” says Elba.\nEpisodes will also later be available on Disney+ and Hulu.\nMore than 8 million people of color served with the Allies, and the series digs deep to focus on how some fared at D-Day, Dunkirk, Pearl Harbor and the Battle of the Bulge.\nCredit : Associated Press (AP) | Photo Credit : (AP)"}, {"id": "59988c9d-02c5-47f4-a80d-9d4d506a5bb3", "title": "W . J . Moseley", "date": "2024-06-05 04:15", "url": "https://www.ocregister.com/obituaries/wj-moseley-ca/", "message": "As a naval aviator (regular and reserves) for 31 years, he served in the Western Pacific, North Africa, Central America, and Spain.\nHis primary duties involved anti-submarine warfare by long-range patrol planes; if mobilized, he would have commanded 54 such aircraft.\nNaval War College in Newport, Rhode Island.\nHe taught trial advocacy, organized training for prosecutors throughout the state, and shared his expertise at symposia and conferences.\nHe served the California State bar as a member of its Committee on Jury Instructions and as a disciplinary examiner."}, {"id": "a494d17a-4449-47fb-a0e1-41fb62ce3be7", "title": "All About The Most Decorated US Battleship : The USS New Jersey", "date": "2024-06-05 03:15", "url": "https://www.slashgear.com/1586903/most-decorated-us-battleship-uss-new-jersey-history/", "message": "The first was during the Korean War, where its guns were brought to bear in tours during 1951 and 1953.\nThe New Jersey would next be recommissioned in April 1968 for service during the Vietnam War, becoming the world's only operating battleship.\nDecommissioned after its Vietnam service in December 1969, the New Jersey was called on for one final duty assignment.\nAdding to this are the 19 commendations and awards that make it the most decorated battleship in U.S. history.\nNew Jersey carries on in its present mission as a museum ship in Camden, New Jersey."}, {"id": "4b088047-1c57-4dbd-9c2d-81f502410a05", "title": "Marines fast track qualified cyber , signals recruits to rank of gunny", "date": "2024-06-05 02:00", "url": "https://www.marinecorpstimes.com/news/2024/06/04/marines-fast-track-qualified-cyber-signals-recruits-to-rank-of-gunny/", "message": "The Marine Corps has launched a pilot program that will allow qualified recruits to enter the Corps with a rank as high as gunnery sergeant.\nThe pilot program will focus on military occupational specialty shortfalls, specifically in cyber and signals intelligence, for this first effort, according to the message.\nThose jobs are 1721 cyberspace warfare operator and 2629 signals intelligence collection manager.\nCivilians and other prior military service members must ship to recruit training prior to age 35.\nFor other military services, signals intelligence applicants must have held either an Army 35 series military intelligence; Air Force 1N intelligence series or Navy cryptologic technician series."}, {"id": "f0cada02-426d-490a-a9fb-c989298a1c03", "title": "Strategic Defense Needs Integrated Thinking and Jointness : Insights from Lt General P . R . Shankar – Indian Defence Research Wing", "date": "2024-06-05 03:45", "url": "https://idrw.org/strategic-defense-needs-integrated-thinking-and-jointness-insights-from-lt-general-p-r-shankar/", "message": "Strategic Defense Needs Integrated Thinking and Jointness: Insights from Lt General P.R.\nShankar| BySOURCE: AFIIn a recent lecture delivered at the Centre for Land Warfare Studies (CLAWS), Lt General P.R.\nShankar (Retd) stressed the necessity for India to adopt integrated thinking and jointness within its defense strategy.\nLt General Shankar emphasized that this approach is critical for India to maintain its strategic edge.\nLt General Shankar argued that fostering jointness is essential for India to respond effectively to contemporary security challenges."}, {"id": "a800ad5e-1b51-4cea-8913-de53f56fa8dd", "title": "Virginia budget changes education benefit for family of fallen and disabled servicemembers", "date": "2024-06-05 03:15", "url": "https://www.nbcwashington.com/news/local/virginia-budget-changes-education-benefit-for-family-of-fallen-and-disabled-servicemembers/3633051/", "message": "Virginia's recently approved state budget changed a program that pays in-state college tuition for spouses and children of servicemembers killed or severely disabled because of their duty.\nSince 1996, the Virginia Military Survivors and Dependents Program has covered those education expenses.\nKayla Owen, whose husband has severe disabilities after 20 years in the Marines and Coast Guard, planned to use the program to pay for a nursing program.\nTheir changes have left many military families scrambling to find new funding while also going into battle with lawmakers to restore the previous eligibility.\nYoungkin responded in a letter saying lawmakers must repeal the significant changes and he wants it done in a special legislative session before the end of June."}, {"id": "085135c9-ba45-4011-b717-82d413da6c9e", "title": "Honored Vietnam veteran escorts D - Day veterans to Normandy for 80th anniversary", "date": "2024-06-05 05:15", "url": "https://www.yahoo.com/news/honored-vietnam-veteran-escorts-d-030010657.html", "message": "PORTSMOUTH, England (KDVR) — It’s not just Normandy veterans making the trip to France this week to mark the 80th anniversary of D-Day.\n“Well you know, it’s going to be quite an experience,” Harvey Barnum, Jr. told FOX31 while riding a ferry boat across the English Channel, bound for Normandy on Sunday.\nOne of Colorado’s oldest veterans dies at 106Like the heroes who arrived in France and were immediately under fire, so was Barnum.\nHarvey Barnum, Jr. aboard a ferry‘There are no atheists on the battlefield’But ask Barnum — or any military veteran — and they’ll tell you it’s the heroics displayed by D-Day veterans that really stand out.\nAnd he’s honored to be in their company headed back to the beaches and battlefields of Normandy."}, {"id": "42793edc-ff53-40e6-9ac1-25c70c7287dc", "title": "Action PvPvE RPG Legacy : Steel & Sorcery Announced for PC", "date": "2024-06-05 00:00", "url": "https://www.vgchartz.com/article/461250/action-pvpve-rpg-legacy-steel-amp-sorcery-announced-for-pc/", "message": "Action PvPvE RPG Legacy: Steel & Sorcery Announced for PC - News/ 541 Viewsby, posted 13 hours agoPublisher and developer Notorious Studio has announced third-person action PvPvE RPG, Legacy: Steel & Sorcery, for PC Steam.\nView the official gameplay reveal trailer below:Read details on the game below:Legacy: Steel & Sorcery is a third-person action player-versus-player-versus-environment RPG featuring distinctive fantasy classes.\nGo on adventures solo or with friends to search for treasures, level up, and defeat any who stand in your way.\nFeel the impact of your attacks and use your abilities to carve out the flow of battle.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel."}, {"id": "eae5bbd1-c8b5-4440-96ed-302843c5b21e", "title": "Joe Biden suggests Benjamin Netanyahu is dragging out the Gaza war for political gains", "date": "2024-06-05 02:00", "url": "https://www.sbs.com.au/news/article/joe-biden-suggests-benjamin-netanyahu-is-dragging-out-the-gaza-war-for-political-gains/v9w22rtw0", "message": "Joe Biden has walked back comments he made recently about Israeli Prime Minister Benjamin Netanyahu.\nIn a Time magazine interview published on Tuesday, the United States president was asked whether he thought Netanyahu was prolonging the war for political reasons.\nIn the Time interview, Biden also said that Israel's leader had engaged in \"inappropriate\" conduct during the war sparked by Hamas' 7 October attack.\nREAD MORE Israel and Hamas considering three-phase peace deal to wind down Gaza warHow has Israel responded to the comments?\nMore than 36,470 people have been killed in Gaza since 7 October, according to the health ministry in Gaza."}, {"id": "98a665f0-95cf-4e2e-88cc-06281277412c", "title": "Memorial Day Program - History Behind The Holiday", "date": "2024-06-05 04:00", "url": "https://ironcountytoday.com/2024/06/04/memorial-day-program-history-behind-the-holiday/", "message": "On Monday, May, 29, the Iron County Veterans Coalition Memorial Day Program took place at the Cedar City Cemetery.\nMemorial Day is a day we pay homage to all those who didn’t come home.\nThis is not Veterans Day, it’s not a celebration, it is a day of column contemplation over the cost of freedom.\nWhile Memorial Day is meant to recognize those who paid the ultimate price, these days of recognition Armed Forces Day, Veteran’s Day, and Memorial Day will forever be inextricably intertwined.\nRemember who stands ready to protect our freedom, and remember those who died to keep freedom safe."}, {"id": "b48d4922-1fe7-4005-8eef-b4cda5addd57", "title": "Munitions debris found near American University , officials say", "date": "2024-06-05 05:00", "url": "https://www.yahoo.com/news/munitions-debris-found-near-american-001210172.html", "message": "WASHINGTON - The Army Corps of Engineers recovered nine munitions-related items at American University on Tuesday, according to university CFO Bronté Burleigh-Jones.\nAuthorities discovered the items at a remediation work site near Fletcher Gate on the south side of campus.\nThe area surrounding American University has a history of munition debris being found.\nFOX 5’s Melanie Alnwick won an Emmy for her coverage of the toxic site clean-up and the impact it had on several Northwest D.C. residents in the early 2000s.\nHer reporting showed that the military members responsible for discarding the toxic waste referred to the area as \"Death Valley\" and called a certain pit near what is now Glenbrook Road, \"Hades.\""}, {"id": "e687e678-823d-4072-ad98-764c6b67eba4", "title": "Russia Adds Anti - Drone  Cope Cage To All - Terrain Buggies , Motorcycles", "date": "2024-06-05 01:45", "url": "https://www.yahoo.com/news/russia-adds-anti-drone-cope-002627418.html", "message": "To counter that, it appears that the Russians have begun to install so-called metal cope cages on both types of vehicles.\nAlexander Sladkov shows off cope-cage clad All-Terrain Vehicles (ATVs).\nVideo has emerged showing the motorcycle modifications offered no protection against the kind of blast fragmentation warheads FPV drones often deliver.\nCope cages first appeared on Russian armor just prior to the all-out invasion of Ukraine in late 2021.\nVia TwitterUkraine too has crafted elaborate cope cages for its equipment, like Polish-supplied 155mm Krab self-propelled howitzers with particularly extensive arrays of screens around their turrets."}, {"id": "2fd283c7-2c5f-4100-9768-0762a7925725", "title": "Munitions debris found near American University , officials say", "date": "2024-06-05 00:45", "url": "https://www.fox5dc.com/news/munitions-debris-found-near-american-university-officials-say", "message": "articleThe Army Corps of Engineers recovered nine munitions-related items at American University on Tuesday, according to university CFO Bronté Burleigh-Jones.\nAuthorities discovered the items at a remediation work site near Fletcher Gate on the south side of campus.\nThe area surrounding American University has a history of munition debris being found.\nFOX 5’s Melanie Alnwick won an Emmy for her coverage of the toxic site clean-up and the impact it had on several Northwest D.C. residents in the early 2000s.\nHer reporting showed that the military members responsible for discarding the toxic waste referred to the area as \"Death Valley\" and called a certain pit near what is now Glenbrook Road, \"Hades.\""}, {"id": "e74af6e2-7987-4577-ae36-88c2121f28f3", "title": "Marines fast track qualified cyber , signals recruits to rank of gunny", "date": "2024-06-05 00:00", "url": "https://www.yahoo.com/news/marines-fast-track-qualified-cyber-224603519.html", "message": "The Marine Corps has launched a pilot program that will allow qualified recruits to enter the Corps with a rank as high as gunnery sergeant.\nThe pilot program will focus on military occupational specialty shortfalls, specifically in cyber and signals intelligence, for this first effort, according to the message.\nThose jobs are 1721 cyberspace warfare operator and 2629 signals intelligence collection manager.\nCivilians and other prior military service members must ship to recruit training prior to age 35.\nFor other military services, signals intelligence applicants must have held either an Army 35 series military intelligence; Air Force 1N intelligence series or Navy cryptologic technician series."}, {"id": "99e63e31-9bde-4c13-a513-d6c04639d310", "title": "House backs sanctions on ICC officials who target Israeli leaders", "date": "2024-06-05 05:15", "url": "https://www.stripes.com/theaters/us/2024-06-04/house-sanctions-icc-israeli-leaders-14084134.html", "message": "Starvation of civilians as a method of warfare is a war crime that violates the Rome Statute, which established the ICC.\nIsrael and its U.S. backers say the ICC doesn’t have jurisdiction because Israel, like the U.S., never signed the Rome Statute.\nSanctions as outlined by the bill could include visa bans, asset freezes, and restrictions on financial transactions that rely on the U.S. dollar.\nHumanitarian law experts say months of warnings and evidence about the widespread starvation — and even famine in some parts — caused by Israeli restrictions on moving humanitarian aid into the blockaded Palestinian enclave mean that Israeli officials know the impact of their policies.\nPalestinian civilians killed in the war deserve as much justice as Israeli civilians killed in the war, she said."}, {"id": "40e35f0b-fc3a-4e2c-ab89-0c9e23f65bce", "title": "The Remnant Newspaper - The Reasons for the Church Crisis", "date": "2024-06-05 02:45", "url": "https://remnantnewspaper.com/web/index.php/fetzen-fliegen/item/7215-the-reasons-for-the-church-s-crisis", "message": "Why has the Church's crisis broken out?\nThe aim here is to give internal and psychological reasons for the crisis, which explain the weakness of clerics and good Christians to defend the Faith, or even to play in favor of its devitalization.\n1) the most important and fundamental cause, leading to everything else: FORGETTING GOD'S JUSTICE AND GLORY.\nThis psychological logic born of intellectualizing theological knowledge, forgetting glory and justice, is a catastrophic calculation: the results and consequences obviously speak louder than anything else.\nThis psychological logic born of intellectualizing theological knowledge, forgetting glory and justice, is a catastrophic calculation: the results and consequences obviously speak louder than anything else."}, {"id": "ea228b24-1218-4388-a043-46237d69c102", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 03:00", "url": "https://www.belfasttelegraph.co.uk/news/uk/king-queen-and-prince-of-wales-join-veterans-to-mark-80th-anniversary-of-d-day/a816820682.html", "message": "The King, Queen and Prince of Wales will join veterans at a commemorative event in Portsmouth as major events begin in the UK and France to mark the 80th anniversary of D-Day.\nSome veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "e70acd6b-98db-4991-96f0-5f88b79fe4c0", "title": "Set in stone : Purple Heart Monument to be dedicated Aug . 7 | News , Sports , Jobs", "date": "2024-06-05 09:00", "url": "https://www.mariettatimes.com/news/2024/06/set-in-stone-purple-heart-monument-to-be-dedicated-aug-7/", "message": "A Medal of Honor recipient will dedicate the new Purple Heart Monument on Aug. 7 at Gold Star Park on Lancaster Street.\nThe monument will then be set for the Aug. 7 dedication, he said.\nChecks can be made payable to the MOV Purple Heart Chapter 743 and mail to WCVSC Office, Attn.\nAug. 7 is National Purple Heart Day, established in 2014.\nThe Purple Heart is the oldest medal in the United States, its roots from the Revolutionary War and was called the Badge of Merit."}, {"id": "88cfa5aa-fd23-4b2b-93a8-026188ee9ef5", "title": "Geneviève de Galard , French nurse and  angel of Dien Bien Phu , dies at 99", "date": "2024-06-05 02:30", "url": "https://www.stripes.com/theaters/europe/2024-06-04/galard-angel-dien-bien-phu-14084033.html", "message": "De Galard and others were soon allowed to evacuate Dien Bien Phu, a strategic foothold near the border with Laos.\nOn March 28, 1954, de Galard was aboard a Dakota C-47 that was making a landing in fog-shrouded Dien Bien Phu.\n“Dien Bien Phu will be your grave,” said messages on fliers from the Viet Minh.\n“In a way, I’m glad you’re in Dien Bien Phu,” wrote de Galard’s mother in a letter she shared with journalists.\n“I feel that in my existence there is a before and an after to Dien Bien Phu,” she told Le Monde."}, {"id": "b2f20240-e3ac-4722-81a2-33bae7ec384d", "title": "Guard - Veterans Day highlights past , present , future of Pa . National Guard", "date": "2024-06-05 00:00", "url": "https://www.yahoo.com/news/guard-veterans-day-highlights-past-213458210.html", "message": "HARRISBURG, Pa. (WHTM) — New members of the Pennsylvania National Guard were sworn in at the state capitol Tuesday.\nThe National Guard is always looking for those interested in serving their country,” Mark Schindler, Adjutant General of Pennsylvania, said.\nThe Pennsylvania Department of Military and Veterans Affairs (DMVA) hosted a Guard and Veterans Day event at the state capitol, showcasing its dual mission of supporting the Pennsylvania National Guard and Pennsylvania veterans.\nThe Pennsylvania Department of Military and Veterans Affairs (DMVA) hosted a Guard and Veterans Day event at the state capitol, showcasing its dual mission of supporting the Pennsylvania National Guard and Pennsylvania veterans.\nLt. Justin Crawford​, Pennsylvania National Guard – Air, speaks at ceremony enlisting 20 new Soldiers and Airmen into the the Army and Air Guard forces."}, {"id": "b2c2ff92-72e2-42ce-9910-3dec48102163", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 02:00", "url": "https://www.edp24.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "a737a0dc-7a2e-475c-a189-a371be7c8d35", "title": "Beloved Leader and Dedicated Native American Advocate Ernie Stevens Sr ., ( Oneida ) Walks On", "date": "2024-06-05 01:00", "url": "https://www.yahoo.com/news/beloved-leader-dedicated-native-american-003220615.html", "message": "Ernie L Stevens Sr., a distinguished member of the Oneida Nation and dedicated advocate for Indian Country, died Saturday, June 1, 2024, in Anna John Resident Centered Care Community facility in Oneida, Wisconsin.\nHis extensive career was marked by numerous leadership roles, reflecting his unwavering dedication to the advocacy of sovereignty, self-determination, self-governance, and Native rights.\nHis work with the Bureau of Indian Affairs was instrumental in transitioning Indian Policy from an era of termination to tribal self-determination.\nJames Parker Shield, Founder and CEO of the National Native American Hall of Fame, expressed his admiration, saying, “Ernie Stevens, Sr. was my personal hero, and inspiration.\nHe loved Indian Country, and he dedicated his life to making a difference for Indian people."}, {"id": "407f00ef-6ce0-40a9-af5f-9952b26b7dd8", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 05:00", "url": "https://www.kentonline.co.uk/news/national/king-queen-and-prince-of-wales-join-veterans-to-mark-80th-anniversary-of-d-day-119402/", "message": "The King, Queen and Prince of Wales will join veterans at a commemorative event in Portsmouth as major events begin in the UK and France to mark the 80th anniversary of D-Day.\nSome veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "3997e964-1230-4ac3-9f53-467fb518e9f5", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 02:30", "url": "https://www.bournemouthecho.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "a8cbd655-5918-46ad-aeef-76d47f91d6f4", "title": "Hezbollah says ready for  comprehensive war  with Israel", "date": "2024-06-05 02:30", "url": "http://www.china.org.cn/world/2024-06/05/content_117235525.htm", "message": "视频播放位置 下载安装Flash播放器Deputy Secretary-General of Hezbollah Sheikh Naim Qassem said on Tuesday that the Lebanese armed group is ready to face a comprehensive war with Israel should the latter expand its attacks against Lebanon, local news website Elnashra reported.\n\"If Israel wants to wage a comprehensive war, we are ready for it,\" Qassem said, stressing that \"any Israeli expansion of the war on Lebanon will be met with devastation, destruction, and displacement in Israel.\"\nThe Hezbollah official also said that \"talks about the withdrawal of the Radwan forces, a special operation forces unit of Hezbollah, from the Lebanese border with Israel, is not true,\" adding that the group only used \"a small portion\" of its capabilities during the border clash with Israel.\nTensions along the Lebanon-Israel border escalated on Oct. 8, 2023, following a barrage of rockets launched by Hezbollah toward Israel in solidarity with Hamas's attacks on Israel the day before.\nIsrael then retaliated by firing heavy artillery toward southeastern Lebanon."}, {"id": "df0e43bb-7df2-498c-98c8-45f865052bc9", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 05:15", "url": "https://www.theargus.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "994aadab-c494-4ec9-a663-6e8b6c2be21c", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 02:45", "url": "https://www.echo-news.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "ce711c4a-e389-4b92-a554-daa0433d52ec", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 02:15", "url": "https://www.salisburyjournal.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "c3611bd3-d6e8-45f2-9964-19769ac1f47c", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 02:30", "url": "https://www.eadt.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "c911a6e1-02a2-4e59-b09b-b325405d2603", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 02:00", "url": "https://www.ipswichstar.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "a7350826-ef5e-4b21-9972-976aaf6642d5", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 04:15", "url": "https://www.yorkpress.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "f39d8a4d-5a87-41d1-be72-1b29ffbbeba9", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 04:15", "url": "https://www.theboltonnews.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "db46f93d-502c-467b-9f8e-f70c30a74b54", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 03:30", "url": "https://www.thenorthernecho.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "2c06030c-5530-462c-9ac1-14f6e07aefb6", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 04:15", "url": "https://www.swindonadvertiser.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "b256d192-9e16-4b77-b05d-84c2a6146b79", "title": "Cillian Murphy to Star in Netflix  Peaky Blinder Movie", "date": "2024-06-05 04:00", "url": "https://www.vulture.com/article/peaky-blinders-movie-netflix-cast-release-date-details.html", "message": "After years of reports and rumors, Netflix confirmed on June 4 that it has officially greenlit a Peaky Blinders movie starring Murphy.\n“It seems like Tommy Shelby wasn’t finished with me,” Murphy said in a statement.\n“It is very gratifying to be recollaborating with Steven Knight and Tom Harper on the film version of Peaky Blinders.\nPeaky Blinders, which concluded in 2022 after six seasons, followed a crime gang in post-WWI Birmingham, England.\nHe also recently added to Netflix that the movie will be an “explosive chapter” and described it as full-on “Peaky Blinders at war,” so that seems to check out."}, {"id": "5ab8cb66-f6b5-4acd-9435-ebab51aec670", "title": "King , Queen , and Prince of Wales joining veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 04:00", "url": "https://news.sky.com/story/king-queen-and-prince-of-wales-joining-veterans-to-mark-80th-anniversary-of-d-day-13148082", "message": "The King, Queen and Prince of Wales will join veterans in Portsmouth today as major events begin in the UK and France to mark the 80th anniversary of D-Day.\nSpreaker Spreaker , which may be using cookies and other technologies.\nYou can use the buttons below to amend your preferences to enable Spreaker cookies or to allow those cookies just once.\nYou can change your settings at any time via the Privacy Options Unfortunately we have been unable to verify if you have consented to Spreaker cookies.\nWatch and follow the D-Day events on Sky News later today"}, {"id": "4a704a5c-7dee-4621-9734-f99f49e5ff84", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 04:45", "url": "https://www.eveningnews24.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "385b7970-d5a4-4e66-ad8e-db0b913eb7ca", "title": "Canadian D - Day veteran Bill Cameron dies just days before 80th anniversary events", "date": "2024-06-05 03:00", "url": "https://www.theglobeandmail.com/canada/article-canadian-d-day-veteran-bill-cameron-dies-just-days-before-80th/", "message": "The Second World War veteran was planning to be part of Canada’s delegation heading to Normandy, France, to mark the 80th anniversary of D-Day on June 6.\nLast Friday, his daughters Cheryl Powell and Donna Roy helped him get ready and the three had lunch together.\nIt seems likely that this will be the last major anniversary event to involve the men who witnessed D-Day.\nThe landing was devastating: 4,414 Allied troops were killed on D-Day and more than 5,000 were wounded.\nIn his final years Cameron spent a lot of time reading about the war, and about D-Day in particular."}, {"id": "df4bc90e-a2f2-4239-8d62-babb38de691d", "title": "Trails through Daybreak Demo Out Now for PS4 and Switch", "date": "2024-06-05 00:45", "url": "https://operationrainfall.com/2024/06/04/trails-through-daybreak-demo-out-now-for-ps4-and-switch/", "message": "The previously announced demo for The Legend of Heroes: Trails through Daybreak is now available to download for PlayStation 4 and Nintendo Switch.\nWhile there is no native PlayStation 5 demo, the PS4 demo is playable on PS5.\nPlayers will be able to play through the Prologue in the Switch demo while those playing the PS4 demo will be able to also play through Chapter 1.\nPS4 demo save data will be compatible with the full PS5 version.\nPS4 Demo TrailerSwitch Demo TrailerNIS America describes the game as follows:About the Game:In the aftermath of a brief war, Calvard is enjoying unprecedented economic prosperity."}, {"id": "650d4a80-9be4-4a8c-8a88-dd3a2108e128", "title": "Listings - ERASED : WW2 HEROES OF COLOR on HULU", "date": "2024-06-05 00:45", "url": "http://thefutoncritic.com/listings/20240603hulu10/", "message": "NEW ON HULU Streaming June 3 - June 10 ALSO NEW THIS WEEK ERASE: WWII'S HEROES OF COLOR: LIMITED SERIES PREMIERE (NAT GEO) \"Erased: WWII's Heroes of Color\" is a gripping journey to uncover the long-lost legacies of soldiers of color during the Second World War.\nExecutive produced and narrated by Idris Elba, whose own grandfather fought in the war, this landmark series sheds light on the immense contributions of over 8 million individuals who fought heroically for the Allied forces and whose stories have largely gone untold.\nLooking beyond the battlefield, the limited series also reveals the direct link between their wartime struggles and the rise of post-war-inspired movements for freedom that swept the globe.\nThe four-part series is a poignant testament to these heroes' courage, a tribute to their sacrifices, and a powerful reminder that the fight for equality and recognition continues to this day.\n(Streaming Tuesday, June 4) Share |"}, {"id": "585e1270-6a2d-427e-b9c6-e38e6c5ad861", "title": "U . S . lawmakers vote to sanction ICC after prosecutor seeks warrant for Israel Netanyahu", "date": "2024-06-05 02:45", "url": "https://www.cbc.ca/news/world/us-house-icc-sanctions-vote-1.7224751", "message": "The U.S. House of Representatives passed legislation Tuesday that would sanction the International Criminal Court for requesting arrest warrants for Israeli Prime Minister Benjamin Netanyahu and Defence Minister Yoav Gallant.\nThe House bill would apply sweeping economic sanctions and visa restrictions to individuals and judges associated with the ICC, including their family members.\nLast month, ICC prosecutor Karim Khan accused Netanyahu and his defence minister Gallant of war crimes and crimes against humanity in Gaza.\nNetanyahu and other Israeli leaders condemned the ICC's move as disgraceful and antisemitic.\nWATCH | ICC top prosecutor seeks rrest warrants for Israeli, Hamas leaders: Chief prosecutor of the ICC seeks arrest warrants for Israeli and Hamas leaders Duration 22:41 The chief prosecutor of the International Criminal Court says he is seeking arrest warrants for Israeli and Hamas leaders for alleged war crimes."}, {"id": "29db6af0-f9ed-4ae8-819b-0ecbc46d4b88", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 02:30", "url": "https://www.oxfordmail.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "ca016353-6347-4ec2-9e10-3ddaa83843d0", "title": "Countering China - Pak Defence Collaboration", "date": "2024-06-05 01:30", "url": "https://www.dailyexcelsior.com/countering-china-pak-defence-collaboration/", "message": "This collaboration includes constructing fortified bunkers, supplying advanced unmanned aerial and combat vehicles, and installing encrypted communication towers, signalling a strategic shift with far-reaching implications for regional security dynamics.\nAdvanced satellite imagery, surveillance drones, and human intelligence sources provide real-time data, allowing defence forces to assess and respond to potential threats swiftly.\nTo counter the enhanced military infrastructure provided by China to Pakistan, India has significantly invested in modernising its own defence capabilities.\nIndia’s strategic response is not limited to military measures; it also involves proactive diplomatic engagements and forging strategic alliances.\nCollaborations with international defence companies for joint ventures and technology transfers further enhance India’s defence industrial base."}, {"id": "68a6fb0d-d813-437b-9cb2-4b7cd6f20486", "title": "Dynasty Legends 2 adds Lu Meng to the Three Kingdoms - inspired action RPG", "date": "2024-06-05 08:15", "url": "https://www.pocketgamer.com/dynasty-legends-2/lu-meng/", "message": "Clear quests to earn Lu Meng shards and other rewardsEarn Lu Meng's Shard and Weapon Shard through limited-time questsSpecial events will run throughout the weekDiscover new boss fights in the Fair ArenaTaihe Interactive is welcoming a new character to Dynasty Legends 2, letting you wield the power of Lu Meng within the hack-and-slash action RPG.\nIn the latest update to Dynasty Legends 2, you can look forward to clearing event-specific quests to score Lu Meng's Shard and Lu Meng's Weapon Shard among other in-game goodies.\nMeanwhile, you can put your combat prowess to the test with Yuan Shao on the 8th and on the 9th.\nSubscribe to Pocket Gamer onIn case you're not familiar with the game, Dynasty Legends 2 offers flashy skills and thrilling combat you can show off across a variety of PvP modes on top of the story campaign.\nNow, if you're eager to join in on all the fun, you can do so by checking out Dynasty Legends 2 on Google Play and on the App Store."}, {"id": "fef66999-cfe4-4419-8102-d6de9c075879", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 02:45", "url": "https://www.aol.co.uk/king-queen-prince-wales-join-012208660.html", "message": "The King, Queen and Prince of Wales will join veterans at a commemorative event in Portsmouth as major events begin in the UK and France to mark the 80th anniversary of D-Day.\nSome veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "7fb0a86e-8c15-4460-9219-82f99205ce0f", "title": "Remains of World War II veteran from Roanoke identified after nearly 80 years", "date": "2024-06-05 04:45", "url": "https://www.wsls.com/news/local/2024/06/05/remains-of-world-war-ii-veteran-from-roanoke-identified-after-nearly-80-years/", "message": "A World War II veteran from Roanoke has finally been identified, according to the Defense Prisoner of War and Missing in Action Accounting Agency or DPAA.\nU.S. Army Sergeant Mayburn Hudson, 21, was killed in World War II.\nThe group searched the area, finding several sets of American remains, but were unable to identify one of them as Hudson.\nThe unidentified remains were then buried in the U.S. Military Cemetery in St. James, France, now known as the Britany American Cemetery.\nTo identify his remains, scientists from the DPAA used anthropological and dental analysis, as well as other circumstantial evidence."}, {"id": "d8892e87-daf7-4c92-8c57-9306731d1b9a", "title": "The last WWII vets converge on Normandy for D - Day and fallen friends and to cement their legacy | iNFOnews", "date": "2024-06-05 04:15", "url": "https://infotel.ca/newsitem/d-day-80th-anniversary-back-to-omaha/cp1237307772", "message": "The last WWII vets converge on Normandy for D-Day and fallen friends and to cement their legacyWorld War II veteran Joe Peterburs attends a service at the Normandy American Cemetery in Colleville-sur-Mer, France, Tuesday, June 4, 2024.\nOn the bluffs above Omaha, at the Normandy American Cemetery with 9,387 immaculately tended graves, 100-year-old Bob Gibson paid tribute to comrades who fell on D-Day, when he landed on the other, less-bloody American landing beach, code-named Utah.\nHe was part of the veteran group that visited Omaha on Tuesday, brought to France for the 80th anniversary by American Airlines.\nThe Allied toll grew appallingly in the Battle of Normandy that ensued, with 73,000 killed and 153,000 wounded.\nRAF veteran Bernard Morgan, who worked in communications on D-Day, chuckled: “It was more pleasant coming today than it was 80 years ago.\""}, {"id": "ecb83bde-e9ab-4b25-a87f-be86f5abb2e3", "title": "Canada Eyes Acquisition of 70 Training Aircraft", "date": "2024-06-05 00:00", "url": "https://theaviationist.com/2024/06/04/canada-eyes-acquisition-of-70-trainers/", "message": "The acquisition is to meet the new training requirements, following the modernization of the Royal Canadian Air Force’s front-line equipment and weapons systems.\nThe goal of the agreement is to cover the acquisition of more than 70 training aircraft split into five, type-specific fleets.\nWe’ve awarded a contract for the Future Aircrew Training (FAcT) Program and two contracts for the Logistics Vehicle Modernization (LVM) project.\nAdditionally, future RCAF pilots will be sent to other NATO countries with similar programs, such as the Fighter Lead-in Training (FLT) in Finland and the International Flight Training School in Italy.\nThe IFTS offers a course based on the T-346 aircraft, which is equipped with modern technologies like Voice Control Inputs (VCI), Helmet Mounted Display (HMD), and an NVG module for night operations training, making it suitable for 5th generation aircraft training."}, {"id": "5b04976e-080c-46c3-80f2-6d5d8c49aa84", "title": "In the news today : Trudeau , Vets in France for D - Day , Bank of Canada rate cut coming ? – Winnipeg Free Press", "date": "2024-06-05 08:45", "url": "https://www.winnipegfreepress.com/canada/2024/06/05/in-the-news-today-trudeau-vets-in-france-for-d-day-bank-of-canada-rate-cut-coming", "message": "Trudeau travels to Normandy for D-Day anniversaryPrime Minister Justin Trudeau is on his way to Normandy, France, to mark the 80th anniversary of D-Day.\nAround 160,000 Allied troops landed on the beaches on June 6, 1944, in what’s now known as the beginning of the end of the Second World War.\nCanada’s delegation also includes 13 Second World War veterans, the oldest of whom is 104.\nBoC to announce interest rate decision todayTo cut or not to cut — that is the question the Bank of Canada will answer this morning as it announces its latest interest rate decision.\nThe Bank of Canada’s key interest rate is currently sitting at five per cent, the highest it’s been since 2001."}, {"id": "690688b6-9068-4ee9-acf0-1048fa3cc071", "title": "2 Japanese F - 35 fighter jets make emergency landings after 1 has a mechanical problem - New Delhi Times - India Only International Newspaper", "date": "2024-06-05 05:15", "url": "https://www.newdelhitimes.com/2-japanese-f-35-fighter-jets-make-emergency-landings-after-1-has-a-mechanical-problem/", "message": "Two Japanese F-35A stealth fighter jets made emergency landings at a commercial airport in northern Japan on Monday, but there were no injuries or damage, officials said.\nThe fighter jets were on a training flight from Misawa Air Base and landed safely at nearby Aomori Airport after one developed an unspecified mechanical problem and requested an emergency landing, airport officials said.\nJapan’s Air Self Defense Force declined to provide details, including the cause of the emergency landing.\nThe airport said its runway was closed for about 20 minutes because of the emergency landing before operations returned to normal.\nThe incident is the latest in a series of problems involving flight training by Japan’s military."}, {"id": "e72e9e13-15e7-4b91-9189-bf88b4f67b17", "title": "Biden marks D - Day in France as Europe security under threat", "date": "2024-06-05 06:00", "url": "https://www.euronews.com/2024/06/05/biden-marks-d-day-in-france-as-europe-security-under-threat", "message": "By Euronews with APThe US president will mark the 80th anniversary of the World War Two invasion that liberated France from Nazi Germany.\nADVERTISEMENTJoe Biden is set to 80 years after the D-Day invasion in France this week as he tries to demonstrate steadfast support for European security.\nThe trip comes amid the deadliest fighting on the continent since World War II in Ukraine, where Russia is gaining ground on the battlefield.\nBiden will return to the United States on Sunday, stopping at a World War I cemetary for US soliders before he leaves.\n“This guy does not deserve to be president,” Biden said."}, {"id": "f2a97c63-1843-454b-975f-a97ef33fd296", "title": "Leo Horoscope Today , 05 - June - 2024 : Discover what stars say about your career , finance and love", "date": "2024-06-05 01:30", "url": "https://indianexpress.com/article/horoscope/leo-horoscope-today-05-june-2024-daily-astrology-prediction-for-leo-career-finance-money-love/", "message": "Leo Horoscope Prediction Today, 05-June-2024: When it comes to maintaining a balance in any relationship, you set an example for others to follow.\nIt is like an inner light guides you towards joyful coexistence, though, at times, it may entail making certain acts of sacrifice, says Ganesha.\nYou may choose to lose an argument in order to win hearts.\nJust remember that losing a battle is sometimes the only way to win the war.\nLok Sabha Election Results 2024Astrology Predictions: Leo Love Horoscope TodayListen to the heart of your loved one."}, {"id": "96051a44-001e-43e7-9d72-6b753327474f", "title": "Gray Eagle Order Placed for Army National Guard", "date": "2024-06-05 06:00", "url": "https://www.aero-news.net/index.cfm?do=main.textpost&id=7C32BE0A-981B-4ADA-8264-9B5EB9F0E2DE", "message": "Reserve Components Looking to Improve In-HouseGeneral Atomics Aeronautical Systems announced a fresh order for a dozen Gray Eagle 25M UAVs with accompanying equipment, for fulfillment to the Army National Guard (ARNG).\nThe manufacturer will see the order paid out of 2023 congressional funding, which helps to bring them ups to speed.\nTossing some Gray Eagles into the mix provides the ARNG with full multi-spectrum intel gathering capability, even a modest complement of ordnance from the air, which greatly enhances their capacity to leverage their artillery and field components.\nWith a few Gray Eagles on Tap, they can be more or less self reliant in planning, targeting, coordinating, and communicating.\n“The Gray Eagle platform has a proven record of performance with over a million hours of safe operations, including automatic takeoff and landing capability,” said GA-ASI Vice President of DoD Strategic Development Patrick Shortsleeve."}, {"id": "8bf68874-6997-483b-ad90-49ac156ba44e", "title": "When does The Acolyte take place on the Star Wars timeline ? ", "date": "2024-06-05 02:30", "url": "https://www.gamesradar.com/entertainment/star-wars-tv-shows/the-acolyte-timeline-star-wars-high-republic/", "message": "The Acolyte has a surprise place on the Star Wars timeline .\nBut one thing is clear, even for High Republic newcomers: we know exactly when The Acolyte takes place on the Star Wars timeline.\nWhen does The Acolyte take place on the Star Wars timeline?\nIn-universe, one date is key: the Battle of Yavin, AKA the assault on the Death Star in Star Wars: A New Hope.\nDive into more of Star Wars' history with our guide on how to watch The Clone Wars in order."}, {"id": "086b1cb9-6ad2-4bff-804e-e0a9ef183c4f", "title": "Southend made  momentous contribution  to D - Day and the war", "date": "2024-06-05 07:15", "url": "https://www.echo-news.co.uk/news/24366620.southend-made-momentous-contribution-d-day-war/", "message": "The book offers a candid look at the part Southend played in many wartime operations, including Dunkirk and D-Day.\nHis interest was sparked after he came across a dusty old booklet written by AP Herbert (Sir Alan Herbert), giving his first-hand account of commanding Naval Control Service operations in Southend during the war.\nSouthend would have the company of great and distinguished naval men who came back into the service from retirement.\nJohn explained: “The most intensive organisation and preparations of the war took place in Southend in the lead up to D-Day.\n“By next morning they had all left safely.”John will be giving a talk at 4pm tomorrow at The Forum in Southend about his book and the history of D-Day in Southend."}, {"id": "438d2b4d-e8fa-4e46-9f38-df33972c901b", "title": "Biden to meet with Zelensky in Normandy and at next week G7 , White House says", "date": "2024-06-05 04:45", "url": "https://www.yahoo.com/news/biden-meet-zelensky-normandy-next-034200878.html", "message": "Biden to meet with Zelensky in Normandy and at next week’s G7, White House saysPresident Joe Biden will meet with Ukrainian President Volodymyr Zelensky while he is in Normandy, France, according to White House national security adviser Jake Sullivan.\nCNN previously reported that Russian President Vladimir Putin was not extended an invitation, according to a French presidential source.\nSullivan added that Biden is also expected to meet with Zelensky during the G7 in Italy next week.\n“In the course of a little more than a week, the president will have two substantive engagements with President Zelensky,” Sullivan said.\nThe two leaders last met in person when Zelensky was in Washington, DC, in December 2023 to make an in-person plea for military and economic aid."}, {"id": "874587fd-2273-48ba-b55d-17cb0f671b4f", "title": "Biden to meet with Zelensky in Normandy and at next week G7 , White House says", "date": "2024-06-05 04:00", "url": "https://www.cnn.com/2024/06/04/politics/biden-zelensky-meeting-normandy-g7/", "message": "CNN —President Joe Biden will meet with Ukrainian President Volodymyr Zelensky while he is in Normandy, France, according to White House national security adviser Jake Sullivan.\nCNN previously reported that Russian President Vladimir Putin was not extended an invitation, according to a French presidential source.\nSullivan added that Biden is also expected to meet with Zelensky during the G7 in Italy next week.\n“In the course of a little more than a week, the president will have two substantive engagements with President Zelensky,” Sullivan said.\nThe two leaders last met in person when Zelensky was in Washington, DC, in December 2023 to make an in-person plea for military and economic aid."}, {"id": "4b33b996-ec56-4353-be41-b63a89345951", "title": "King , Queen and Prince of Wales join veterans to mark 80th anniversary of D - Day", "date": "2024-06-05 05:00", "url": "https://www.dorsetecho.co.uk/news/national/24366572.king-queen-prince-wales-join-veterans-mark-80th-anniversary-d-day/", "message": "Some veterans will attend two days of remembrance events in Portsmouth to mark the historic milestone.\nTherefore, D-Day veterans, politicians, the royals, and the general public will commemorate the historic battle at the very ports traversed by Allied soldiers in 1944.\nThe Prime Minister will then deliver a reading to the crowds and meet with veterans to hear their D-Day stories to mark the occasion.\nOn Thursday – the 80th anniversary of D-Day – commemorations will begin in Normandy at 7.25am, the same time the beach invasion began in 1944.\nThe UK’s Defence Secretary Grant Shapps and Foreign Secretary Lord David Cameron will also attend the Portsmouth and Normandy commemorations."}, {"id": "74e27396-0e17-4e31-8af6-62d26cbbecc0", "title": "UFC odds : Islam Makhachev opens as sizable betting favorite over Arman Tsarukyan and Belal Muhammad but not Leon Edwards", "date": "2024-06-05 00:45", "url": "https://www.mmamania.com/2024/6/4/24170709/ufc-odds-islam-makhachev-opens-sizable-favorite-over-arman-tsarukyan-belal-muhammad-not-leon-edwards", "message": "That hasn’t stopped Makhachev from dreaming about a potential welterweight title fight against reigning 170-pound kingpin, Leon Edwards.\nIslam Makhachev: -260Arman Tsarukyan: +220Note: The line opened Makhachev -325 and Tsarukyan +275.\nIslam Makhachev: +105Leon Edwards: -125Note: The line opened Edwards -150 and Makhachev +130.\nIslam Makhachev: -230Belal Muhammad: +195Note: The line opened Makhachev -200 and Muhammad +170.\nIt’s unlikely Makhachev will “Remember the Name.”“I would never fight him, 100 percent,” Muhammad told MMA Fighting."}, {"id": "bbecc6cf-9399-4278-af5e-3954c2b77d11", "title": "Hero Xoom Combat Edition launched at Rs 80 , 967", "date": "2024-06-05 08:15", "url": "https://www.team-bhp.com/news/hero-xoom-combat-edition-launched-rs-80967", "message": "The Xoom Combat Edition is based on the ZX variant.\nHero MotoCorp has launched a new variant of the Xoom, called the 'Combat Edition'.\nThe Hero Xoom Combat Edition comes in a special colour scheme called Matte Shadow Grey with yellow and black accents.\nAccording to the company, the colour scheme is inspired by fighter jets.\nThe Xoom Combat Edition is based on the ZX variant."}, {"id": "6cb76ea9-e691-4dcd-9088-506a8b5ca53f", "title": "The last WWII vets converge on Normandy for D - Day and fallen friends and to cement their legacy", "date": "2024-06-05 02:45", "url": "https://www.pressdemocrat.com/article/news/the-last-wwii-vets-converge-on-normandy-for-d-day-and-fallen-friends-and-to/", "message": "OMAHA BEACH, France — Under their feet, the sands of Omaha Beach, and in their rheumy eyes, tears that inevitably flowed from being on the revered shoreline in Normandy, France, where so many American young men were cut down 80 years ago on D-Day.\nThey also bore a message for generations behind them, who owe them so much: Don't forget what we did.\nOn the bluffs above Omaha, at the Normandy American Cemetery with 9,387 immaculately tended graves, 100-year-old Bob Gibson paid tribute to comrades who fell on D-Day, when he landed on the other, less-bloody American landing beach, code-named Utah.\nThe Allied toll grew appallingly in the Battle of Normandy that ensued, with 73,000 killed and 153,000 wounded.\nRAF veteran Bernard Morgan, who worked in communications on D-Day, chuckled: “It was more pleasant coming today than it was 80 years ago.\""}, {"id": "ef902986-2d35-4286-bf02-3131aabeaa7a", "title": "This year will likely be the last major D - Day anniversary with living veterans in attendance . Organizers are going all - out", "date": "2024-06-05 07:15", "url": "https://www.ktbs.com/news/national-world/this-year-will-likely-be-the-last-major-d-day-anniversary-with-living-veterans-in/article_02ec5cc6-2307-11ef-919c-0b7e3c11e1e1.html", "message": "Allied forces are seen landing on the beaches of Normandy on June 6, 1944.\nThursday will mark the 80th anniversary of D-Day.\nUS National Archives/AFP/Getty Images"}, {"id": "2b413fb9-b559-4857-baf6-f7d735d04a73", "title": "Angry at Yasukuni Shrine  toilet  graffiti , Japan man posts US$64 , 000 bounty for vandal arrest", "date": "2024-06-05 00:30", "url": "https://www.scmp.com/week-asia/politics/article/3265346/angry-japan-man-posts-us64000-bounty-yasukuni-shrine-toilet-vandals-arrest", "message": "A still from a video that circulated on Chinese social media shows an unidentified man next to the word “toilet” in red graffiti on a stone pillar at Tokyo’s Yasukuni Shrine.\nWorkers prepare to remove the graffiti, covered by a blue sheet, at Yasukuni Shrine on Saturday.\n“Do they not realise that by urinating on a Japanese shrine and then writing graffiti on a pillar, Japanese people will reach obvious conclusions about Chinese people?\nPeople queue to pay their respects at the Yasukuni Shrine in Tokyo last year, the 78th anniversary of Japan’s surrender at the end of World War II.\nHe was sentenced to a prison term, but South Korean courts refused to extradite him to Tokyo over the earlier attack on Yasukuni Shrine."}, {"id": "815e2e34-0acf-445f-95dd-3ed5a02b3234", "title": "Sammy says Windies taking  One game at a time  approach following opening win", "date": "2024-06-05 06:30", "url": "https://www.kaieteurnewsonline.com/2024/06/05/sammy-says-windies-taking-one-game-at-a-time-approach-following-opening-win/", "message": "Sammy says Windies taking “One game at a time” approach following opening win– as Caribbean side shifts focus to UgandaKaieteur Sports – West Indies Head Coach Darren Sammy lauded his team’s performance following their opening round win, but said the game plan is to take it one match at a time as they map their way towards a possible title.\nSunday’s opener at Providence ended in a 5-wicket win for the home team over a spirited Papua New Guinea team.\nThe Windies drew first blood thanks to all-round efforts from their stars and got back to working on their game during yesterday’s session at Providence.\nHowever, the brief interview which followed, Sammy said complacency and rushing into combat are moves the former 2-time champs are looking to avoid.\nWindies currently sit in second place behind the dangerous table-leaders Afghanistan, who they play after the Ugandans in the next game set for Saturday June 8 under lights at Providence."}, {"id": "94554600-6962-4b80-a0a6-3da218f5a0e7", "title": "Jason Peto Obituary", "date": "2024-06-05 02:15", "url": "https://www.ocregister.com/obituaries/jason-darren-peto-ca/", "message": "Jason was born on January 28, 1979 in Montebello, California to Ernest and Janie Peto.\nThe family moved to Vancouver, Washington in 1990 and Jason attended and graduated from Mountain View High School in Vancouver and was a member of the FFA.\nHe was deployed in 2005 to Ramadi, Iraq with the 3/7 India Co. Jason was gunner in a Humvee hit by an IED.\nJason was deployed again in 2007 to Ramadi, Iraq with 3/7 India Co. he was deployed for 7 months.\nJason is survived by his wife Tiffany of Vancouver, and parents, Ernest and Janie Peto of Vancouver, Washington."}, {"id": "c7ce32df-69b4-496e-bc6b-47e69b051f29", "title": "104 - year - old Kansas WWII Veteran shares his D - Day story", "date": "2024-06-05 02:00", "url": "https://www.wibw.com/2024/06/04/104-year-old-kansas-wwii-veteran-shares-his-d-day-story/", "message": "TOPEKA, Kan. (WIBW) - Jerry Hinton was drafted into the U.S. Army in 1941.\n“That year turned into 5 years because the Japanese bombed Pearl Harbor while I was in there that first year,” said WWII Veteran Jerry Hinton.\nThis almost 105-year-old was part of the history that helped the alliance win WWII.\nWhile the largest seaborne invasion in history was 80 years ago, Hinton remembers it like it was yesterday.\nHinton spent most of D-day circling the beach until that evening."}, {"id": "39faca51-5a9b-4c8f-9ca3-f7e14a47725a", "title": "The Challenge : Fans blast Tori Deal and Aneesa Ferreira as podcast hosts after All Stars 4 episode", "date": "2024-06-05 00:30", "url": "https://www.monstersandcritics.com/tv/reality-tv/the-challenge-fans-blast-tori-deal-and-aneesa-ferreira-as-podcast-hosts-after-all-stars-4-episode/", "message": "Fans of The Challenge expressed their displeasure as Tori Deal and Aneesa Ferreira are hosting MTV’s Official Challenge Podcast.\nThe weekly podcast covers each new season of MTV’s competition series and spinoff shows, such as The Challenge: All Stars 4.\nNeither Tori nor Aneesa appeared in Flora’s MTV Challenge season.\nThat included Aneesa’s elimination battle with her in Battle of the Bloodlines, a season Cara won.\nDevyn and Da’Vonne have hosted previous editions of MTV’s Official Challenge Podcast, including episodes covering the Battle For a New Champion season on MTV."}]