[{"id": "c521b1b8-295e-46d1-8fba-8b533e0d08ce", "title": "Yemen Houthi rebels launch a missile that strikes an oil tanker in the Red Sea , US military says", "date": "2024-05-19 02:00", "url": "https://www.dailyexcelsior.com/yemens-houthi-rebels-launch-a-missile-that-strikes-an-oil-tanker-in-the-red-sea-us-military-says/", "message": "DUBAI, May 18: Yemen’s Houthi rebels hit an oil tanker in the Red Sea with a ballistic missile today, damaging the Panama-flagged, Greek-owned vessel in their latest assault over the Israel-Hamas war in the Gaza Strip, officials said.\nStruck the oil tanker Wind, which recently docked in Russia and was bound for China, the U.S. Military’s Central Command said.\nBoth China and Russia maintain ties over military equipment and oil to Iran, the Houthis’ main benefactor.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\nShipping through the Red Sea and Gulf of Aden still remains low because of the threat, however."}, {"id": "a2d4dda5-c025-4047-bf74-bc8b2ad01f2f", "title": "Yemen Houthi rebels claim shooting down of American drone", "date": "2024-05-19 01:15", "url": "https://apnews.com/article/yemen-houthi-us-drone-israel-hamas-war-b440499cd3e96851088a5dd765864f5b", "message": "DUBAI, United Arab Emirates (AP) — Yemen’s Houthi rebels on Friday claimed to have shot down an American drone, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone.\nHe described the drone as “carrying out hostile actions” in Yemen’s Marib province, which remains held by allies of Yemen’s exiled, internationally recognized government.\nThe Houthis later released footage they claimed showed the surface-to-air-missile being launched at night, along with night-vision footage of the missile hitting the drone.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen.\n___This story has been corrected to give the name of the drone as Reaper, instead of Predator."}, {"id": "52565af1-69e3-4230-bde0-7b1cb7b0df2b", "title": "Yemen Houthi Rebels Claim Shooting Down Another US MQ - 9 Reaper Drone – The Yeshiva World", "date": "2024-05-19 05:30", "url": "https://www.theyeshivaworld.com/news/general/2284171/yemens-houthi-rebels-claim-shooting-down-another-us-mq-9-reaper-drone.html", "message": "Yemen’s Houthi rebels on Friday claimed to have shot down an American drone, hours after footage circulated online of what appeared to be the wreckage of an MQ-9 Reaper drone.\nGen. Yahya Saree claimed that rebels shot down the Reaper on Thursday with a surface-to-air missile.\nHe described the drone as “carrying out hostile actions” in Yemen’s Marib province, which remains held by allies of Yemen’s exiled, internationally recognized government.\nThe U.S. military did not respond to a request for comment from The Associated Press over the Houthi claim.\nHouthi attacks have dropped in recent weeks as the rebels have been targeted by a U.S.-led airstrike campaign in Yemen."}, {"id": "4abc0768-fea8-4f11-96a2-c006610f187c", "title": "Houthi rebels strike Greek oil tanker in Red Sea : US", "date": "2024-05-19 03:00", "url": "https://www.washingtonexaminer.com/news/world/3009198/houthi-rebels-strike-oil-tanker/", "message": "The Iranian-backed Houthi rebels conducted a missile strike on the Greek oil tanker M/T Wind on Saturday in the Red Sea, according to a release from U.S. Central Command.\n“A coalition vessel immediately responded to the distress call by M/T Wind, but no assistance was needed.\nThe crew of M/T Wind was able to restore propulsion and steering, and no casualties were reported.\nThe Jewish state began bombarding Gaza in the wake of the terrorist group’s deadly Oct. 7 attack, prompting the Houthis to respond by taking aim at ships in the Red Sea.\n“This continued malign and reckless behavior by the Iranian-backed Houthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden,” the release reads."}, {"id": "d66d2a18-64c2-4cb2-a29c-0a2830d80cf7", "title": "Israel Defense Forces Says Eliminated  Significant  Target During Strike on Jenin", "date": "2024-05-19 05:45", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240518-sputnik03.htm", "message": "Israel Defense Forces Says Eliminated \"Significant\" Target During Strike on JeninSputnik News20240518MOSCOW (Sputnik) The Israel Defense Forces (IDF), jointly with the Israel Security Agency (ISA), said they eliminated one of \"significant\" targets in an airstrike on their operations center in the West Bank city of Jenin.\nEarlier, the IDF said an Israeli fighter jet carried out an airstrike in the area of Jenin.\nThe Palestinian Health Ministry said in a statement that one person was killed and eight others injured in Israeli shelling of Jenin.\n\"Based on ISA intelligence, an IAF fighter jet and helicopter struck a compound used as an operations center,\" the statement read, adding that a number of \"significant\" militants were inside the compound.\nThe statement stressed that the IDF eliminated the militant, who was on the search list for alleged involvement in a number of attacks, including a shooting incident in May 2023."}, {"id": "59039d18-04bf-4e3c-8b54-3eca0fa9f5e8", "title": "Gaza war : UN defends casualty tally amid Israeli anger", "date": "2024-05-19 04:15", "url": "https://www.jpost.com/israel-hamas-war/article-801669", "message": "The UN humanitarian aid chief, Martin Griffiths, stood behind the organization’s Gaza death toll statistics by saying that they were “very cautious” in their approach, according to a BBC report from last week.\nUN data is most likely based on the data of the Hamas-run Government Media Office (GMO).\nThe UN reported 69% of the fatalities in Gaza since October 7 were women and children, but on May 8, they reduced it to 52%.\nHamas-run Health MinistryThe UN's Office for the Coordination of Humanitarian Affairs (OCHA) put the reduction down to incomplete information which was subsequently revised, according to the report.\nThe UN claims to now be using figures from the Hamas-run Health Ministry in Gaza rather than the Government Media Office (GMO)."}, {"id": "1abe5cca-109a-4488-8e8a-acef5d6573aa", "title": "Singapore tightens security after Johor police station attack", "date": "2024-05-19 07:15", "url": "https://www.themalaysianinsight.com/s/483164", "message": "SINGAPORE has tightened security measures following an attack on a Johor police station, which killed two police officers, Bernama reports.\nThe Home Affairs Ministry said yesterday that it has stepped up security at the country’s checkpoints.\n“Travellers should expect delays at the checkpoints due to enhanced checks and factor in additional time needed for immigration clearance.\nMHA said the authorties are monitoring the situation ad that the Internal Security Department has been in touch with its Malaysian counterparts.\nEarlier, police denied that the man who killed two cops at the Ulu Tiram police station was linked to a terrorist group."}, {"id": "b38e58e4-7d19-4b51-8f5b-774769e2de78", "title": "Iran Update , May 18 , 2024 | Institute for the Study of War", "date": "2024-05-19 01:45", "url": "https://www.understandingwar.org/backgrounder/iran-update-may-18-2024", "message": "Iran Update, May 18, 2024Ashka Jhaveri, Andie Parry, and Nicholas CarlInformation Cutoff: 2:00 pm ETThe Iran Update provides insights into Iranian and Iranian-sponsored activities abroad that undermine regional stability and threaten US forces and interests.\nIsraeli forces expanded clearing operations in eastern Rafah on May 18.\n[11] Several Palestinian militias claimed attacks targeting Israeli forces in the al Tanour neighborhood, indicating that Israeli forces have advanced to the area.\n[12] A Palestinian journalist reported that Israeli forces advanced and engaged Palestinian fighters in the Jninah and Brazil neighborhoods in eastern Rafah.\n[19] Israeli forces recovered the body along with the bodies of three other hostages on May 17."}, {"id": "a342221d-1890-4c9c-b69a-d887146ab635", "title": "Pak - US CT partnership : are we missing the point ? ", "date": "2024-05-19 06:30", "url": "https://tribune.com.pk/story/2467241/pak-us-ct-partnership-are-we-missing-the-point", "message": "Curiously, the joint statement does not mention those Baloch groups that regularly claim responsibility for terrorist attacks.\nYi said this a day after the US Institute for Peace warned about the resurgence of transnational terrorist groups in Afghanistan including TTP.\n“The post-U.S. withdrawal environment in Afghanistan offers terrorist groups a range of new opportunities for regrouping, plotting, and collaborating with one another,” said the latest study.\nShould this environment prompt the US, China, Russia, Iran, Pakistan and the Central Asian Republics to jointly work through a CT framework?\nBut India, a strategic partner of the US, is openly sympathetic to some of the Baloch groups."}, {"id": "3a776864-c553-440c-b315-06735aa93e1e", "title": "Ukraine air defense destroys 37 Shaheds in night attack", "date": "2024-05-19 09:00", "url": "https://www.yahoo.com/news/ukraine-air-defense-destroys-37-073000018.html", "message": "The work of the Air Defense ForcesUkrainian Air Defense Forces destroyed all 37 Shahed-131/136 attack drones launched by Russia, Air Force Commander Mykola Oleshchuk reported on Telegram on the night of May 19.\nUkrainian Air Defense Forces, along with anti-aircraft missile units, mobile fire groups, and electronic warfare (EW) units, were mobilized to counter the air attack.\nRead also:Drones were shot down across multiple Ukrainian oblasts including Kyiv, Odesa, Mykolaiv, Sumy, Vinnytsia, Zhytomyr, Cherkasy, and Kherson.\nHowever, the rate of destroying Russian drones decreased slightly to 82%.\nRead the original article on The New Voice of Ukraine"}, {"id": "33dd1598-0e01-44de-a1a8-4db28b24243b", "title": "Israel pushes further into parts of north Gaza ; new cracks in Netanyahu coalition", "date": "2024-05-19 00:00", "url": "http://www.koreatimes.co.kr/www/world/2024/05/501_374873.html", "message": "Israel has conducted renewed military sweeps this month of parts of northern Gaza where it had declared the end of major operations in January.\nThe Israeli military said its forces have continued to operate in areas across Gaza including Jabalia and Rafah, carrying out what it called \"precise operations against terrorists and infrastructure\".\nGantz said his proposal would include creating a temporary U.S.-European-Arab-Palestinian system of civil administration for Gaza while Israel retains security control.\nDefence Minister Yoav Gallant on Wednesday demanded clarity on post-war plans and for Netanyahu to forswear any military reoccupation of Gaza.\nIsrael's military said 281 soldiers have been killed in fighting since the first ground incursions in Gaza on Oct 20."}, {"id": "3d90f518-9a1b-429d-8942-22f61171805b", "title": "Israeli positions hit in fresh Hezbollah missile attacks", "date": "2024-05-19 05:45", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240518-irna04.htm", "message": "Israeli positions hit in fresh Hezbollah missile attacksIRNA - Islamic Republic News AgencyMay 18, 2024Tehran, IRNA -- Lebanon's Hezbollah Resistance Movement has carried out fresh attacks on positions in northern Israeli-occupied territories, in the latest act of support for the Palestinian people and their resistance fighters battling the regime in Gaza.\nHezbollah launched missiles at Biranit Barracks at 9:45 Beirut time, causing damage to the Israeli military facility, according to a statement by the Lebanese movement.\nIt added that an Israeli military base in Mutala settlement was targeted as well.\nHezbollah has been conducting drone and missile attacks on Israeli positions at or near Lebanon's southern border since October 8, a day after the Israeli regime launched its genocidal war on Gaza where more than 35,300 Palestinians are confirmed killed.\nThe Lebanese resistance movement has pledged to continue its anti-Israel operations until the regime stops its war on the besieged Gaza Strip."}, {"id": "9526f3d5-0acc-4553-9466-330afd363935", "title": "Cleared for publication : Two soldiers fell in battle in Gaza", "date": "2024-05-19 05:00", "url": "http://www.israelnationalnews.com/news/390170", "message": "The IDF Spokesperson’s Unit cleared for publication on Sunday morning the names of two soldiers who served in the Givati Brigade and who fell in battle in the southern Gaza Strip:First sergeant Nachman Meir Haim Vaknin, 20, from Eilat, and Sergeant Noam Bittan, 20, from Moshav Yad Rambam.\nOn Friday evening, the IDF cleared for publication that Sgt.\nBen Avishay, 20 from Nahariya fell in battle in the northern Gaza Strip.\nEarlier that day, it was cleared for publication that an IDF combat engineer suffered serious injuries during a battle with terrorists in Jabalya in northern Gaza.\nOver the weekend, IDF troops continued precise operations against terrorist operatives and infrastructure in eastern Rafah."}, {"id": "06bf1733-d3ae-47df-910a-1c6a0c917862", "title": "Cleared for publication : Two soldiers fell in battle in Gaza", "date": "2024-05-19 04:45", "url": "https://www.israelnationalnews.com/news/390170", "message": "The IDF Spokesperson’s Unit cleared for publication on Sunday morning the names of two soldiers who served in the Givati Brigade and who fell in battle in the southern Gaza Strip:First sergeant Nachman Meir Haim Vaknin, 20, from Eilat, and Sergeant Noam Bittan, 20, from Moshav Yad Rambam.\nOn Friday evening, the IDF cleared for publication that Sgt.\nBen Avishay, 20 from Nahariya fell in battle in the northern Gaza Strip.\nEarlier that day, it was cleared for publication that an IDF combat engineer suffered serious injuries during a battle with terrorists in Jabalya in northern Gaza.\nOver the weekend, IDF troops continued precise operations against terrorist operatives and infrastructure in eastern Rafah."}, {"id": "d60ac32c-6956-4856-9c98-f8adceae0b5f", "title": "Ukraine , Russia trade blame for targeting civilians in residential areas", "date": "2024-05-19 05:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240518-voa01.htm", "message": "Ukraine, Russia trade blame for targeting civilians in residential areasBy VOA News May 18, 2024Ukraine accused Russia of potential war crimes Saturday, saying their shelling targeted civilians in residential areas of two cities in northeastern Ukraine.\n\"Units of the northern troop group liberated the village of Starytsya in the Kharkiv region, and continued to advance deep into the enemy's defenses,\" it said.\nIn an interview with AFP, Zelenskyy said Kyiv needs more air defenses to hold the front line since Russia's surprise offensive in the Kharkiv region last week.\nZelenskyy said the situation in the Kharkiv region has been controlled but not stabilized.\nTo increase the number of Ukrainian troops, Zelenskyy signed two laws on Friday allowing prisoners to join the army while imposing steep fines for draft dodgers."}, {"id": "17d9970a-051c-41e7-9135-9dcaf1c76606", "title": "Gaza Humanitarian Crisis : Fierce fighting on streets of Gaza Rafah", "date": "2024-05-19 01:45", "url": "https://timesofindia.indiatimes.com/world/middle-east/fierce-fighting-on-streets-of-gazas-rafah/articleshow/110236853.cms", "message": "RAFAH: Heavy clashes and bombardment rocked Rafah on Saturday, as Israel pressed an assault against Hamas militants that has led hundreds of thousands of Palestinians to flee the southern Gaza city.The Israeli military said its air forces hit more than 70 targets across the Gaza Strip while ground troops conducted \"targeted raids\" in eastern Rafah, killing 50 militants and locating dozens of tunnel shafts.Hamas's armed wing, the ezzedine al-qassam Brigades, said it fired a barrage of rockets towards the Israeli city of Ashkelon and targeted an Israeli command centre at the Jabalia refugee camp in the north of the Gaza Strip.An AFP reporter said air strikes and artillery shells pounded eastern Rafah as warplanes criss-crossed over the city on Gaza's border with Egypt.More than 10 days into what the army called a \"limited\" operation in Rafah that sparked an exodus of Palestinians, fighting between Israeli forces and Palestinian militants has also flared again in northern Gaza.Israel said in early January it had dismantled Hamas's command structure in the north, but the army said Hamas whose October 7 attack sparked the war had been \"in complete control here in Jabalia until we arrived a few days ago\".Hamas slammed what it called Israel's \"intensified brutal raids\" on Jabalia, saying they had killed dozens of civilians and wounded hundreds more while targeting schools and shelters.\n\"The escalating crimes of the occupation will not succeed in breaking the will of our brave resistance or in deterring our proud people from their decision to stand firm on their land,\" it said.The Israeli incursion into Rafah, launched despite overwhelming international opposition and as mediators were hoping for a breakthrough in stalled truce talks, has worsened an already dire humanitarian crisis, aid groups say.With key land crossings closed or operating at limited capacity due to the fighting, some relief supplies began flowing into Gaza via a temporary, floating pier constructed by the United States.The Israeli army said 310 pallets began moving ashore in \"the first entry of humanitarian aid through the floating pier\".Satellite pictures taken on Saturday showed more than a dozen trucks lining up on the approach road to the pier.In the coming days, around 500 tonnes of aid are expected to be delivered to Gaza through the pier, according to US Central Command.But UN agencies and humanitarian aid groups have warned sea or air deliveries cannot replace far more efficient truck convoys into Gaza, where the United Nations has repeatedly warned of looming famine.The EU welcomed the first shipment from Cyprus to the Gaza pier, but called on Israel to \"expand deliveries by land and to immediately open additional crossings\".The Rafah crossing, a vital conduit for humanitarian assistance, has been closed since Israel launched its operation in the city last week.The war began after Hamas's unprecedented October 7 attack on Israel, which resulted in the deaths of more than 1,170 people, mostly civilians, according to an AFP tally based on Israeli official figures.Israel's retaliatory offensive against Hamas has killed at least 35,386 people in Gaza, mostly civilians, according to data provided by the Hamas-run territory's health ministry.The toll includes at least 83 deaths over the past 24 hours, said a ministry statement on Saturday.Out of 252 people taken hostage from Israel during the October 7 attack, 125 remain held in Gaza including 37 the army says are dead.The army said troops in Gaza had recovered late Thursday the bodies of three hostages whom it said had been killed on October 7.Israel has vowed to defeat remaining Hamas forces in Rafah, which it says is the last bastion of the Iran-backed group.The looming Israeli assault has prompted nearly 6,40,000 of the 1.4 million people who had been sheltering in the southern city to flee to other areas, the UN has said.Palestinian sources in Rafah said Israeli forces were operating in the city's Al-Salam and Jenina neighbourhoods as well as on the Philadelphi route along the Egyptian border.\n\"Troops are advancing and retreating around these areas,\" a security source said.Cairo, which has been involved in mediation efforts during the war, says a potential Israeli takeover of Philadelphi could violate its landmark 1979 peace deal with Egypt.In northern Gaza's beit lahia, witnesses reported air strikes near Kamal Adwan hospital on Saturday.The hospital's director Hussam Abu Safiya said Friday the facility had received \"large numbers\" of casualties from nearby Jabalia and was running low on supplies.The fuel aid that had reached the hospital was \"barely enough for a few days\", Abu Safiya told AFP.The World Health Organization has received no medical supplies in Gaza since the Rafah operation began on May 6, spokesman Tarik Jasarevic said Friday.On the diplomatic front, US National Security Advisor Jake Sullivan was heading to the region for weekend talks.Sullivan will meet Saudi Crown Prin"}, {"id": "161d1cf8-9636-49df-93cc-e26f24128661", "title": "Israeli war cabinet member threatens to quit if Benjamin Netanyahu doesnt change tack ... ", "date": "2024-05-19 07:45", "url": "https://www.lbc.co.uk/news/benny-gantz-threatens-to-quit-gaza-israel/", "message": "Israeli war cabinet member threatens to quit if Benjamin Netanyahu doesn't change tack on GazaIsraeli war cabinet member Benny Gantz has threatened to quit the government.\nPicture: AlamyBy Kit HerenA member of Israel's three-person war Cabinet has threatened to quit if Benjamin Netanyahu does not adopt a fresh plan on Gaza.\nThe departure of Mr Gantz, a centrist, could leave Mr Netanyahu more beholden to elements on the right wing of his government.\nIsraeli Prime Minister Benjamin Netanyahu.\nMr Netanyahu called the deaths \"heartbreaking\", saying: \"We will return all of our hostages, both the living and the dead.\""}, {"id": "47df5f77-19ab-4046-9bcd-cdbaf25c9fb9", "title": "UN chief renews call for two - state solution , calls Gaza war  open wound  ", "date": "2024-05-19 05:45", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240518-presstv02.htm", "message": "UN chief renews call for two-state solution, calls Gaza war 'open wound'Iran Press TVSaturday, 18 May 2024 7:30 PMUN Secretary-General Antonio Guterres has reiterated his call for a two-state solution, saying Israel's ongoing war on the besieged Gaza Strip \"is an open wound that threatens to infect the entire region.\"\n\"The only permanent way to end the cycle of violence and instability is through a two-state solution, Israel and Palestine living side-by-side in peace and security,\" with al-Quds as the capital of both, he said.\nIsraeli strikes and intense clashes with Palestinian resistance fighters rocked Rafah late Friday and early Saturday, with reports of shelling in the city's southeast and jets bombarding its eastern areas.\nPalestinian resistance groups say they have inflicted heavy casualties on Israeli soldiers by blowing up tunnels, launching rockets and mortars, and through sniping and close-quarters combat.\nIsrael launched its genocidal war against Gaza on October 7 last year."}, {"id": "581ecf6a-4de4-430a-8e61-34a95a31bcc9", "title": "Ivan Duque Accuses Cuban Government of Supporting Terrorism", "date": "2024-05-19 03:30", "url": "https://www.cubaheadlines.com/articles/282179", "message": "Former Colombian President Ivan Duque (2018-2022) has made a bold statement, asserting that the \"Cuban government has sponsored terrorism\" in various regions.\nThis declaration comes after the United States reaffirmed Cuba's position on the list of state sponsors of terrorism.\nDuque's Struggles with Cuban RegimeDuring his tenure, Duque had multiple confrontations with the Cuban regime, demanding accountability for the actions of guerrillas protected by Havana.\nA day before this incident, Duque once again questioned the Cuban authorities about the status of the extradition request for the guerrillas remaining on the island.\nThe Cuban regime demanded on Wednesday that the United States remove it from the list of state sponsors of terrorism, citing the sanctions that affect the island."}, {"id": "42f536e7-31df-4d38-9bbf-4c6c595ad556", "title": "Pak : Another girl school in South Waziristan bombed", "date": "2024-05-19 07:15", "url": "https://news.webindia123.com/news/Articles/World/20240519/4198496.html", "message": "The north-western region of the country has been plagued by terror attacks since mid-2021, with several girls' schools in KP districts being targeted.\nThe Sofia Noor School, established with support from the Wana Welfare Association to educate girls in the remote and underdeveloped district, fell victim to the bombing just weeks after its inception.\nOn May 9, the Islamia Girls School in Sheva town, North Waziristan, was also bombed, fortunately resulting in no casualties.\nReports indicate that construction was ongoing in some sections of the Sofia Noor School when the blast occurred around 3 am, causing damage to a portion of the building.\nWhile the situation improved after police and security forces launched operations, the recent attacks on schools in Waziristan have reignited concerns among the local population, Geo News reported."}, {"id": "e35d6942-807e-4eb9-8962-76649f81f997", "title": "Russian troops fire over 3 , 000 times on positions of Ukrainian Armed Forces and keep trying to capture Volchansk", "date": "2024-05-19 07:30", "url": "https://www.yahoo.com/news/russian-troops-fire-over-3-211656985.html", "message": "Russian troops fired over 3,000 times on the positions of Ukrainian troops and continued to try to capture Vovchansk over the past day.\nDetails: The General Staff reported that since the beginning of 18 May, Russian troops have launched 3 missile strikes and 38 airstrikes (including 56 aerial guided bombs), used 404 kamikaze drones, and fired more than 3,000 times on Ukrainian troops' positions.\nThe Russian troops also lost 31 pieces of weapons and military equipment, including three tanks, six cannons and mortars.\nOn the Vremivka front, the Russians made three unsuccessful attempts to break through the defences of Ukrainian troops near Staromaiorske.\nThe General Staff notes that the Russian forces were not successful, and Ukrainian defenders did not lose any positions."}, {"id": "2b769a0b-3bc7-4c78-a18c-f7b8c5ffe3ae", "title": "J - K :  Worked for development , known for sympathy , recalls friend of former Sarpanch killed in Shopian terror attack", "date": "2024-05-19 08:00", "url": "https://news.webindia123.com/news/Articles/India/20240519/4198500.html", "message": "Waseem Ahmad, a friend of the former Sarpanch, Aijaz Ahmad Sheikh, who was killed by terrorists in Jammu and Kashmir's Anantnag district, said they were at home when the learned about the incident.\nAhmad also said that the deceased was known for his sympathy and worked for the development of the area.\nIrfan Ahmad Sheikh, Kin of Aijaz Ahmad Sheikh said, \" Around 10 pm, we heard the sound of shooting but we had no idea who it was and from where the sound came from.\nThe BJP firmly stands with the family of Aijaz Ahmad, who lost his life in this terror attack,\" he added.\nAccording to police, terrorists fired upon Aijaz Ahmad Sheikh at Heerpora in Shopian district late on Saturday night."}, {"id": "740b7d36-56de-41fe-8532-05169bbd7ecb", "title": "Kharkiv : Life goes on as Russian advance menaces city", "date": "2024-05-19 06:30", "url": "https://us.cnn.com/2024/05/19/europe/life-goes-on-in-kharkiv-cmd-intl/", "message": "Kharkiv, Ukraine CNN —Thirty miles to the north, Russian forces are invading again.\n00:41 - Source: CNNHotel manager Olha SokolenkoOlha Sokolenko, director of Kharkiv Palace Hotel, was in the hotel at the moment of the strike.\nThis is my homeland.”Kharkiv’s mayorKharkiv's mayor, Ihor Terekhov, was elected just a few months before the Ukraine war broke out.\nTo send signals both to Kharkiv residents who stay here that life goes on, and signals to those outside of Kharkiv that Kharkiv is a Ukrainian city and people live here.”Lomako explains that he and his partners traveled across the country to collect local recipes and techniques.\nKharkiv theater goes undergroundThis theater in Kharkiv is one of several city institutions forced underground by the war."}, {"id": "e0db2bf9-bcf3-4236-8ebe-fe538fac3ce7", "title": "Kharkiv : Life goes on as Russian advance menaces city", "date": "2024-05-19 04:45", "url": "https://www.cnn.com/2024/05/19/europe/life-goes-on-in-kharkiv-cmd-intl/", "message": "Kharkiv, Ukraine CNN —Thirty miles to the north, Russian forces are invading again.\n00:41 - Source: CNNHotel manager Olha SokolenkoOlha Sokolenko, director of Kharkiv Palace Hotel, was in the hotel at the moment of the strike.\nThis is my homeland.”Kharkiv’s mayorKharkiv's mayor, Ihor Terekhov, was elected just a few months before the Ukraine war broke out.\nTo send signals both to Kharkiv residents who stay here that life goes on, and signals to those outside of Kharkiv that Kharkiv is a Ukrainian city and people live here.”Lomako explains that he and his partners traveled across the country to collect local recipes and techniques.\nKharkiv theater goes undergroundThis theater in Kharkiv is one of several city institutions forced underground by the war."}, {"id": "50c412d7-1b21-481b-8f53-712e6d3299db", "title": "Pak : Another girl school in South Waziristan bombed", "date": "2024-05-19 07:15", "url": "https://www.devdiscourse.com/article/international/2943366-pak-another-girls-school-in-south-waziristan-bombed", "message": "In another tragic blow to girls' education in Khyber Pakhtunkhwa amidst the ongoing wave of terrorism, terrorists have targeted a girls' school in the Wana tehsil of South Waziristan, as reported by Geo News.\nThe north-western region of the country has been plagued by terror attacks since mid-2021, with several girls' schools in KP districts being targeted.\nThe Sofia Noor School, established with support from the Wana Welfare Association to educate girls in the remote and underdeveloped district, fell victim to the bombing just weeks after its inception.\nOn May 9, the Islamia Girls School in Sheva town, North Waziristan, was also bombed, fortunately resulting in no casualties.\nWhile the situation improved after police and security forces launched operations, the recent attacks on schools in Waziristan have reignited concerns among the local population, Geo News reported."}, {"id": "a6be33fb-3664-4240-a46f-b6b331f76ffc", "title": "USS Carney will return to Naval Station Mayport Sunday morning after 7 month deployment", "date": "2024-05-19 03:30", "url": "https://www.news4jax.com/news/local/2024/05/19/uss-carney-will-return-to-naval-station-mayport-sunday-morning-after-7-month-deployment/", "message": "JACKSONVILLE, Fla. – The USS Carney will return to Naval Station Mayport on Sunday morning after a dangerous and historic seven-month deployment to the Middle East.\nShe described why the homecoming for the USS Carney will be so important.\nThe USS Carney can be seen on video launching missiles when Iranian-backed Houthis fired a ballistic missile at a Bermuda-owned M.V.\n231019-N-GF955-1113 RED SEA (Oct. 19, 2023) The Arleigh Burke-class guided-missile destroyer USS Carney (DDG 64) defeats a combination of Houthi missiles and unmanned aerial vehicles in the Red Sea, Oct. 19.\nThe Houthis launched missiles and drones into the Red Sea, targeting vessels from over 40 countries around the world."}, {"id": "1fcb3091-cdc8-452e-b5e9-2cd3aac2910e", "title": "Atlantic Magazine :  The Rosary Has Acquired a Militaristic Meaning  ", "date": "2024-05-19 06:30", "url": "https://newsbusters.org/blogs/nb/pj-gladnick/2022/08/15/atlantic-magazine-rosary-has-acquired-militaristic-meaning", "message": "A new symbol has joined the pantheon of hate along with the \"OK\" hand sign and the thumbs up according to Atlantic magazine.\nThis discovery was made by Daniel Panneton in Sunday's edition of the Atlantic whose headline blared \"How Extremist Gun Culture Is Trying to Co-Opt the Rosary.\"\nJust as the AR-15 rifle has become a sacred object for Christian nationalists in general, the rosary has acquired a militaristic meaning for radical-traditional (or “rad trad”) Catholics.\nOn this extremist fringe, rosary beads have been woven into a conspiratorial politics and absolutist gun culture.\nInfluencers on platforms such as Instagram share posts referencing “everyday carry” and “gat check” (gat is slang for “firearm”) that include soldiers’ “battle beads,” handguns, and assault rifles."}, {"id": "3b797932-dd36-426b-95d9-4063072452a2", "title": "US national security adviser , Saudi Arabia crown prince meet to discuss  semi - final  security deal", "date": "2024-05-19 05:30", "url": "https://abcnews.go.com/US/wireStory/us-national-security-adviser-saudi-arabias-crown-prince-110370666", "message": "President Joe Biden’s national security adviser Jake Sullivan has met with Saudi Arabia’s Crown Prince Mohammed bin Salman to discuss what the kingdom described as the “semi-final” version of a wide-ranging security agreement between the countriesDUBAI, United Arab Emirates -- President Joe Biden's national security adviser met early Sunday with Saudi Arabia's Crown Prince Mohammed bin Salman to discuss what the kingdom described as the “semi-final” version of a wide-ranging security agreement between the countries.\nThe announcement by the state-run Saudi Press Agency comes as the strategic deal had been upended after Hamas' Oct. 7 attack on Israel that killed 1,200 people and saw 250 others taken hostage back to the Gaza Strip.\nSaudi state media released no images of Jake Sullivan and Prince Mohammed meeting in Dhahran, a city in the kingdom's far east that's home to its state-run oil giant, the Saudi Arabian Oil Co. known as Saudi Aramco.\nSaudi Arabia has long called for an independent Palestinian state to be created along Israel's 1967 borders, with east Jerusalem as its capital.\nPrince Mohammed has said the kingdom would pursue a nuclear weapon if Iran had one."}, {"id": "ef06efc3-bd83-4ed0-ae06-aca7fde79f17", "title": "US national security adviser , Saudi Arabia crown prince meet to discuss  semi - final  security deal", "date": "2024-05-19 06:00", "url": "https://www.stripes.com/theaters/middle_east/2024-05-19/saudi-arabia-us-security-deal-13903675.html", "message": "This is a locator map for Saudi Arabia with its capital, Riyadh.\n(AP)DUBAI, United Arab Emirates — President Joe Biden’s national security adviser met early Sunday with Saudi Arabia’s Crown Prince Mohammed bin Salman to discuss what the kingdom described as the “semi-final” version of a wide-ranging security agreement between the countries.\nSaudi state media released no images of Jake Sullivan and Prince Mohammed meeting in Dhahran, a city in the kingdom’s far east that’s home to its state-run oil giant, the Saudi Arabian Oil Co. known as Saudi Aramco.\nSaudi Arabia has long called for an independent Palestinian state to be created along Israel’s 1967 borders, with east Jerusalem as its capital.\nPrince Mohammed has said the kingdom would pursue a nuclear weapon if Iran had one."}, {"id": "60b24f8b-378f-461f-ae74-28cd5ed79df2", "title": "US national security adviser , Saudi Arabia crown prince meet to discuss  semi - final  security deal – Winnipeg Free Press", "date": "2024-05-19 05:45", "url": "https://www.winnipegfreepress.com/world/2024/05/18/us-national-security-adviser-saudi-arabias-crown-prince-meet-to-discuss-semi-final-security-deal", "message": "DUBAI, United Arab Emirates (AP) — President Joe Biden’s national security adviser met early Sunday with Saudi Arabia’s Crown Prince Mohammed bin Salman to discuss what the kingdom described as the “semi-final” version of a wide-ranging security agreement between the countries.\nThe announcement by the state-run Saudi Press Agency comes as the strategic deal had been upended after Hamas’ Oct. 7 attack on Israel that killed 1,200 people and saw 250 others taken hostage back to the Gaza Strip.\nIn the time since, a punishing Israeli airstrike campaign and ground offensive there has killed over 35,000 Palestinians, endangering the security deal that had included Saudi Arabia diplomatically recognizing Israel for the first time since its founding in 1948.\nThis is a locator map for Saudi Arabia with its capital, Riyadh.\nSaudi Arabia has long called for an independent Palestinian state to be created along Israel’s 1967 borders, with east Jerusalem as its capital."}, {"id": "fd11f288-48f3-4a74-b8f6-f8f45a094fc4", "title": "  Nonsense situation : Zelensky says West  afraid  of both Russian , Ukrainian defeat", "date": "2024-05-19 05:45", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/05/ukraine-240518-presstv03.htm", "message": "'Nonsense situation': Zelensky says West 'afraid' of both Russian, Ukrainian defeatIran Press TVSaturday, 18 May 2024 9:28 AMUkrainian President Volodymyr Zelensky has denounced the West for its ban on using Western-donated arms to strike targets inside Russia, saying the West is \"afraid\" of both Russian and Ukrainian defeat.\nZelensky strongly criticized the West for simultaneously supporting Ukraine and being \"afraid\" of any clear defeat for Russia.\n\"We are in a nonsense situation where the West is afraid that Russia will lose the war.\n\"We want the war to end with a fair peace for us,\" while \"the West wants the war to end.\nBack in February, Putin stressed that certain Western countries are risking triggering a nuclear war by deploying boots in eastern Ukraine, warning Moscow could strike Western targets."}, {"id": "7ac24a09-6bc7-4cbf-9d09-d1116f6da00d", "title": "226 days of war : Numerous casualties in series of Israeli airstrikes across Gaza | World", "date": "2024-05-19 07:15", "url": "https://en.ammonnews.net/article/72715", "message": "Home World226 days of war: Numerous casualties in series of Israeli airstrikes across GazaAmmon News - A series of intense Israeli airstrikes and heavy artillery shelling struck the Nuseirat, Bureij, and Jabalia refugee camps, as well as the towns and cities of Beit Lahia, Rafah, and Gaza City late last night, resulting in multiple casualties among civilians, including a journalist.\nWAFA correspondents reported that Journalist Abdullah Al-Najjar was among those killed after being targeted by an Israeli airstrike in the town of Jabalia, northern Gaza.\nMeantime, several civilians were killed and injured when Israeli warplanes targeted a house belonging to the Shahin family in Gaza City.\nIsraeli warplanes also conducted airstrikes on Bureij refugee camp in central Gaza, as well as in the central, eastern, and northern neighborhoods of Rafah.\nEarlier, Israeli warplanes launched a series of airstrikes on various areas in the northern Gaza Strip."}, {"id": "b5184ed6-5366-431f-9db3-84c595238cba", "title": "UN says 800 , 000 people have fled Rafah as Israel kills dozens in Gaza", "date": "2024-05-19 02:30", "url": "https://www.aljazeera.com/news/2024/5/18/un-says-800000-people-have-fled-rafah-as-israel-kills-dozens-in-gaza", "message": "Israel says it recovered remains of one captive while Hamas claims several attacks against Israeli troops across Gaza.\nNearly 800,000 Palestinians have been displaced from Rafah since Israel launched its offensive against the southern Gaza city last week, Philippe Lazzarini, the head of the United Nations agency for Palestinian refugees, UNRWA, has said.\n”Saturday saw intense fighting across Gaza – not just in Rafah – with Israeli attacks killing dozens of Palestinians.\nThroughout the war, Israel has ordered Palestinian civilians in Gaza to move south as it invaded the territory from the north.\nBut as the Israeli army invades the city, fighting is raging in Jabalia and the Zeitoun neighbourhood of Gaza City in the north of the enclave."}, {"id": "46f471de-4827-4cca-9d3d-6b124a98a702", "title": "US national security adviser , Saudi Arabia crown prince meet to discuss  semi - final  security deal", "date": "2024-05-19 08:00", "url": "https://www.local10.com/news/world/2024/05/19/us-national-security-adviser-saudi-arabias-crown-prince-meet-to-discuss-semi-final-security-deal/", "message": "DUBAI – President Joe Biden's national security adviser met early Sunday with Saudi Arabia's Crown Prince Mohammed bin Salman to discuss what the kingdom described as the “semi-final” version of a wide-ranging security agreement between the countries.\nThe announcement by the state-run Saudi Press Agency comes as the strategic deal had been upended after Hamas' Oct. 7 attack on Israel that killed 1,200 people and saw 250 others taken hostage back to the Gaza Strip.\nRecommended VideosIn the time since, a punishing Israeli airstrike campaign and ground offensive there has killed over 35,000 Palestinians, endangering the security deal that had included Saudi Arabia diplomatically recognizing Israel for the first time since its founding in 1948.\nSaudi Arabia has long called for an independent Palestinian state to be created along Israel's 1967 borders, with east Jerusalem as its capital.\nPrince Mohammed has said the kingdom would pursue a nuclear weapon if Iran had one."}, {"id": "98894dde-122a-4acf-aca2-83a60b034a2d", "title": "US national security adviser , Saudi Arabia crown prince meet to discuss  semi - final  security deal", "date": "2024-05-19 08:30", "url": "https://www.news4jax.com/news/world/2024/05/19/us-national-security-adviser-saudi-arabias-crown-prince-meet-to-discuss-semi-final-security-deal/", "message": "DUBAI – President Joe Biden's national security adviser met early Sunday with Saudi Arabia's Crown Prince Mohammed bin Salman to discuss what the kingdom described as the “semi-final” version of a wide-ranging security agreement between the countries.\nThe announcement by the state-run Saudi Press Agency comes as the strategic deal had been upended after Hamas' Oct. 7 attack on Israel that killed 1,200 people and saw 250 others taken hostage back to the Gaza Strip.\nRecommended VideosIn the time since, a punishing Israeli airstrike campaign and ground offensive there has killed over 35,000 Palestinians, endangering the security deal that had included Saudi Arabia diplomatically recognizing Israel for the first time since its founding in 1948.\nSaudi Arabia has long called for an independent Palestinian state to be created along Israel's 1967 borders, with east Jerusalem as its capital.\nPrince Mohammed has said the kingdom would pursue a nuclear weapon if Iran had one."}]