[{"id": "0bec5754-01eb-4a15-aada-265144ad08aa", "title": "Missile attacks by Yemen Houthi rebels strike 2 ships in the Gulf of Aden , US military says", "date": "2024-06-10 04:00", "url": "https://abcnews.go.com/Business/wireStory/missile-attacks-yemens-houthi-rebels-strike-2-ships-110972856", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Missile attacks by Yemen’s Houthi rebels have struck two ships in the Gulf of Aden, the latest assaults on shipping in the regionMissile attacks by Yemen's Houthi rebels strike 2 ships in the Gulf of Aden, US military saysMANAMA, Bahrain -- Missile attacks by Yemen's Houthi rebels struck two ships in the Gulf of Aden, authorities said Sunday, the latest assaults on shipping in the region.\nTracking data analyzed by The Associated Press showed the Norderney was still in the Gulf of Aden on Sunday afternoon.\nIn a second attack, a Houthi ballistic missile hit the Tavvishi, a Liberian-flagged, Swiss-owned-and-operated container ship in the Gulf of Aden, Central Command.\nTracking data suggested the Tavvishi was in the Gulf of Aden at the time of the attack.\nA second ballistic missile fired by the Houthis at the ship was intercepted by a coalition warship, it added."}, {"id": "8d56184b-03ba-41c5-805a-0f2087912de7", "title": "Eyeing showdown with Hezbollah , Israel presses shadow campaign in Syria", "date": "2024-06-10 12:30", "url": "https://gazette.com/news/us-world/eyeing-showdown-with-hezbollah-israel-presses-shadow-campaign-in-syria/article_2a26aea1-56c1-5e9a-9800-e57b8ca1991c.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Reuters interviewed three Syrian officials, an Israeli government official and three Western diplomats about Israel's Syria campaign.\nThe Israeli government official said the campaign in Syria was also aimed at weakening Hezbollah and thus discouraging it from a war with Israel.\nA senior Israeli official said last year Israel was determined to prevent Syria becoming part of a new front.\nThe strikes have included the killing of some 20 IRGC officials and more than 30 Hezbollah commanders, Uysal said.\nIran sends limited numbers of advisers to Syria, such as the senior IRGC officials killed in the consulate bombing."}, {"id": "1af8b8f9-aab3-44ef-abd4-caf5299103af", "title": "Border clashes : Latest developments", "date": "2024-06-10 11:00", "url": "https://www.naharnet.com:443/stories/en/305809-border-clashes-latest-developments", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hezbollah targeted Monday several Israeli posts, in response to Israeli strikes on Lebanese villages.\nHezbollah also attacked two buildings used by Israeli soldiers in al-Manara and another building in Yir'on, in response to strikes on the villages of Houla and Shebaa.\nHezbollah carried out Sunday six attacks on Israeli posts in northern Israel and in the occupied Kfarshouba Heights, including with suicide drones.\nThe group has stepped up its attacks, striking deeper inside Israel and introducing new and more advanced weaponry.\nIsrael in response ramped up in past weeks its targeting of Hezbollah fighters and allied militants in cars and on motorbikes in south Lebanon."}, {"id": "f9fdfd57-789c-4a02-aa59-688ec36f2fd9", "title": "The defense forces hit Russian S - 300 and S - 400 in Crimea : the General Staff disclosed the details", "date": "2024-06-10 13:15", "url": "https://ukrainetoday.org/the-defense-forces-hit-russian-s-300-and-s-400-in-crimea-the-general-staff-disclosed-the-details/", "domain": "ukrainetoday.org", "domain_classification": "Unknown", "message": "Lesya Leshchenko12:55, 10.06.24The Armed Forces successfully hit Russian S-300 and S-400 air defense systems in Crimea / Photo: Ministry of Defense of the Russian FederationAir defense of the Russian invaders in the Ukrainian Crimea suffered significant losses.\nTonight, the Defense Forces of Ukraine successfully struck one S-400 anti-aircraft missile division of the occupiers in the Dzhankoya area, as well as two enemy S-300 anti-aircraft missile divisions near Chornomorskyi and Yevpatoria.\nThis was announced by the General Staff of the Armed Forces of Ukraine.\n“Thanks to the successful combat work of the Defense Forces, the air defense of the Russian invaders in the Ukrainian Crimea suffered significant losses,” the General Staff emphasized.\nStrikes by the Armed Forces against the occupiersAs UNIAN reported, the Armed Forces of Ukraine recently hit the S-300/400 air defense system in the Belgorod region ."}, {"id": "27d6cda5-eb6c-49ac-ac91-cf9dc4d52d67", "title": "Iran - backed Houthi rebels strike 2 commercial ships in Gulf of Aden", "date": "2024-06-10 04:15", "url": "https://www.yahoo.com/news/iran-backed-houthi-rebels-strike-014304185.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Iranian-backed Houthi rebels in Yemen struck two commercial ships in the Gulf of Aden over the weekend, increasing the number of launched attacks since Nov. 19, 2023 to upwards of 175.\nHouthi attacks ramped up earlier this month after joint U.S.-U.K. strikes targeting several Houthi locations, including a weapons storage facility, missile launchers and a command-and-control center in Yemen.\nU.S. Central Command said on Sunday that over the weekend, Houthis launched two anti-ship ballistic missiles (ASBM) from Yemen into the Gulf of Aden.\nThe attacks prompted the Pentagon to launch an international mission dubbed Operation Prosperity Guardian in late December to counter the Houthi attacks.\nOriginal article source: Iran-backed Houthi rebels strike 2 commercial ships in Gulf of Aden"}, {"id": "c0c63eb9-2d3c-45ca-b8f4-6f1b00c52beb", "title": "Israel IAI rolls out Air Lora , a new air - launched ballistic missile", "date": "2024-06-10 14:00", "url": "https://breakingdefense.com/2024/06/israels-iai-rolls-out-air-lora-a-new-air-launched-ballistic-missile/", "domain": "breakingdefense.com", "domain_classification": "Unknown", "message": "JERUSALEM — Israel Aerospace Industries unveiled a new air-launched variant of its Lora ballistic missile on June 6, a design the company claims will enhance Israel’s ability to provide long-range strike at rapid speed.\nThe Lora has its origins in a ground based long-range artillery weapon system that the company demonstrated at ranges up to 400 km back in 2020.\nIsrael also uses the air-launched Sparrow, which was developed by Rafael Advanced Defense Systems; Rafael also makes a system called Rocks, which is a long-range air-launched stand-off missile.\nFor IAI, the air-launched Lora may be a route to market abroad a competitor for those Rafael-made weapons.\nBack in June 2020 when IAI demonstrated the ground-based version of the Lora, it was billed as a precise ballistic strike missile."}, {"id": "c02a6525-9431-466d-a35e-0ff268cb13f9", "title": "Missile attacks by Yemen Houthi rebels strike 2 ships in the Gulf of Aden , US military says", "date": "2024-06-10 05:45", "url": "https://kdhnews.com/news/ap/missile-attacks-by-yemens-houthi-rebels-strike-2-ships-in-the-gulf-of-aden-us/article_bfdb89cd-d5cb-5db6-bf25-2bd032c8389d.html", "domain": "kdhnews.com", "domain_classification": "Unknown", "message": "It would free up time for the mayor, City Council, city manager and city staff.\nIt would give council members more time to study an issue before it is discussed.\nCouncil meetings are already too long.\nCutting the number of meetings means reducing residents’ input.\nThe proposal has some merit, but it could require marathon council sessions."}, {"id": "40ce70d8-1f32-4aa3-b434-bb593a5dcbaa", "title": "RIGHT SPEAK : UKR Stabilizes the North After Surprise RU Push ; RU Ramps Up Activity Near Pokrovsk ; Zelensky : RU Kharkiv Offensive Failed ; united kingdom Hits Russian Su - 57 Aircraft for 1st Time ; Could Be 2 ; UKR Hits RU Vessel Near Yeysk ; UKR...", "date": "2024-06-10 08:00", "url": "http://www.rightspeak.net/2024/06/ukr-stabilizes-north-after-surprise-ru.html", "domain": "rightspeak.net", "domain_classification": "Unknown", "message": "Blog Archive: Jun 2024 (50) May 2024 (153) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)"}, {"id": "9b67fb12-92d2-4887-8822-19e27c590ff6", "title": "Missile attacks by Yemen Houthi rebels strike 2 ships in the Gulf of Aden , US military says", "date": "2024-06-10 05:00", "url": "https://www.rnz.co.nz/news/world/519158/missile-attacks-by-yemen-s-houthi-rebels-strike-2-ships-in-the-gulf-of-aden-us-military-says", "domain": "rnz.co.nz", "domain_classification": "Unknown", "message": "Photo: AP PhotoMissile attacks by Yemen's Houthi rebels struck two ships in the Gulf of Aden, authorities said Sunday, the latest assaults on shipping in the region.\nTracking data analysed by The Associated Press showed the Norderney was still in the Gulf of Aden on Sunday afternoon.\nIn a second attack, a Houthi ballistic missile hit the Tavvishi, a Liberian-flagged, Swiss-owned-and-operated container ship in the Gulf of Aden, Central Command.\nTracking data suggested the Tavvishi was in the Gulf of Aden at the time of the attack.\nA second ballistic missile fired by the Houthis at the ship was intercepted by a coalition warship, it added."}, {"id": "49d4b138-b682-49b6-86e7-4e2f6a39021e", "title": "A small American bomb is killing Palestinians by the dozen in the Gaza Strip", "date": "2024-06-10 02:00", "url": "https://www.nzherald.co.nz/world/a-small-american-bomb-is-killing-palestinians-by-the-dozen-in-the-gaza-strip/XAFIGGFA3JB2JIT7MTMMH67NSM/", "domain": "nzherald.co.nz", "domain_classification": "Local - Oceania", "message": "The aftermath of an Israeli airstrike on a United Nations school complex in central Gaza last week, carried out with the American-made GBU-39 bomb.\nPhoto / APThe GBU-39 is increasingly the weapon of choice for the Israeli military and was used in two recent mass-casualty events.\nAn American-made, precision-guided bomb that homes in on specific targets and, ideally, limits civilian casualties, was used in airstrikes in the Gaza Strip that killed dozens of Palestinians, including women and children.\nIn both cases, the Israeli military defended its actions, saying the strikes were aimed at militants using civilians as human shields.\nAn unexploded GBU-39 bomb along with other ordnance fragments displayed in Gaza City in May last year."}, {"id": "d07e5465-216c-4f21-9a5e-aa8102d7c3f6", "title": "Iran says will  put Zionists in their place  if they destabilize region", "date": "2024-06-10 09:00", "url": "https://www.globalsecurity.org/wmd/library/news/iran/2024/iran-240609-presstv08.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "In an interview with CNN Turk on Saturday Ali Bagheri Kani said Israelis are well aware that Iran will \"wisely\" and \"effectively\" use its power to \"put them in their place.\"\n\"I think Zionists know very well that in case they try to destabilize the region and undermine its security, Iran will use its might to contain them and put them in their place,\" he added.\nThe series of retaliatory strikes, dubbed Operation True Promise, inflicted damage on Israeli military bases across the occupied lands.\n\"Iran's nuclear program and activities are fully legal and under the supervision of the IAEA,\" Bagheri Kani noted.\nTehran \"rejected all the allegations\" in the E3's letter and \"reiterated its position concerning its peaceful nuclear program and the JCPOA.\""}, {"id": "90f09036-b9fb-4689-a2cd-6a5a8eca3e51", "title": "Yemen Houthi rebels claim latest attack on cargo ship in Gulf of Aden", "date": "2024-06-10 02:00", "url": "http://www.huewire.com/yemens-houthi-rebels-claim-latest-attack-on-cargo-ship-in-gulf-of-aden/", "domain": "huewire.com", "domain_classification": "Unknown", "message": "Manama, Bahrain — A missile attack by Yemen’s Houthi rebels hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, the latest assault on shipping in the region.\nGen. Yahya Saree claimed the attack in a prerecorded video message Sunday, saying the vessel had been targeted with both missiles and drones.\nHe identified the vessel as the Norderney, a ship that tracking data analyzed by The Associated Press showed was still in the Gulf of Aden on Sunday afternoon.\nSaree also claimed unreported attacks on a warship and another vessel in the Arabian Sea, without providing any evidence to support his claim.\nThe Houthis have launched more than 50 attacks on shipping, killed three sailors, seized one vessel and sunk another since November, according to the U.S. Maritime Administration."}, {"id": "d7edccee-c815-4efa-871e-7e753fb45c85", "title": "Coordinated Ukrainian attack sinks Russian ship in Sea of Azov", "date": "2024-06-10 10:15", "url": "https://www.yahoo.com/news/coordinated-ukrainian-attack-sinks-russian-080400903.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian forces carried out a \"coordinated strike\" on a Russian landing ship recently relocated from the Black Sea to the Sea of Azov, according to Sky News on July 10.\n\"This successful strike shows Russians that they cannot operate freely neither in the Black Sea nor in the east,\" the source stated.\nAround midnight, according to the Crimean Wind monitoring channel, a Ukrainian drone launched an attack near the Russian port of Yeysk, targeting a ship allegedly following the Russian cruiser Moscow.\nFurther details are anticipated as \"we are waiting for official reports from the Armed Forces of Ukraine,\" Crimean Wind added.\nIn related news, the Russian Black Sea Fleet reportedly relocated several ships from Novorossiysk to the Sea of Azov during \"exercises,\" likely in an attempt to evade Ukrainian maritime drones."}, {"id": "2acb22a6-1cee-46c5-9811-6b01d91dd11d", "title": "Terrifying new bodycam footage shows moment paranoid conspiracy theorist Virginia home explodes after firing more than 30 flares at cops", "date": "2024-06-10 04:45", "url": "https://www.dailymail.co.uk/news/article-13511973/conspiracy-theorist-Virginia-home-explodes.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "New police bodycam video shows the moment a conspiracy theorist blew his Virginia home to pieces.\nArlington County officials showed bodycam video which laid out the sequence of events that led to Yoo's house exploding with multiple police officers in dangerously close proximity.\nInvestigators said Yoo, who believed his neighbors were spies who wanted to assassinate him, acted alone and that this explosion wasn't connected to terrorists.\nIn their search through the rubble on December 5, police found gasoline canisters, three guns, two flare guns, magazines, ammunition and more flares, WUSA9 reported.\n'Plaintiff believes he is the victim of conspiracy against him by his sister, his ex-wife, and others including RGH."}, {"id": "c422fd1f-e0be-4cea-bee0-234dfbf84e3f", "title": "Government condemns Israeli attack on Nuseirat camp in Gaza", "date": "2024-06-10 08:30", "url": "https://www.citizen.co.za/news/south-africa/sa-government-condemns-israeli-attack-nuseirat-refugee-camp/", "domain": "citizen.co.za", "domain_classification": "Unknown", "message": "SA government condemns Israeli attack on Nuseirat refugee camp in GazaDirco said Israel’s raid on the Nuseirat refugee camp on innocent civilians “is one of the single worst massacres\".\nA Palestinian boy carries a gas cooker as he walks amid the debris of a destroyed building in Nuseirat refugee camp in the central Gaza Strip.\nPicture: AFPGovernment has condemned an Israeli airstrike on the Nuseirat refugee camp in the Gaza Strip that killed dozens of displaced people who were sheltering there.\nThe Israeli strike in Gaza killed scores of people and left many more injured when it struck the facility without any prior warning.\n“While families mourn the loss of life, Israeli Defence Minister Yoav Gallant jubilantly termed the operation ‘daring in nature, planned brilliantly, and executed in an extraordinary fashion’."}, {"id": "0aab5f60-3490-4194-b18c-7c2e9f349037", "title": "AMIA bombing : Bringing Iran to justice 30 years later", "date": "2024-06-10 03:45", "url": "https://www.jpost.com/opinion/article-805566", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Until Hamas’s horrific attack on October 7, the AMIA bombing had been the deadliest antisemitic attack since the Holocaust, and remains the most lethal terrorist attack in Argentina’s history.\nWhile Israel is actively engaged in holding the October 7 perpetrators accountable, Argentina’s Jewish community and all of society are waiting for answers.\nAnsar Allah, the Palestinian terrorist group that claimed responsibility for the AMIA bombing, has admitted that it was funded and protected by Hezbollah and thereby Iran.\nUntil Hamas’s horrific attack on October 7, the AMIA bombing had been the deadliest antisemitic attack since the Holocaust, and remains the most lethal terrorist attack in Argentina’s history.\nAnsar Allah, the Palestinian terrorist group that claimed responsibility for the AMIA bombing, has admitted that it was funded and protected by Hezbollah and thereby Iran."}, {"id": "a0135bf7-d366-4668-8271-04ddecbffe8c", "title": "Next - Gen Rudram - II Missile build for Adaptability on all Fighter fleets of IAF : Report – Indian Defence Research Wing", "date": "2024-06-10 06:00", "url": "https://idrw.org/next-gen-rudram-ii-missile-build-for-adaptability-on-all-fighter-fleets-of-iaf-report/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Next-Gen Rudram-II Missile build for Adaptability on all Fighter fleets of IAF: Report| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGIndia’s Indigenous air warfare capabilities leapt forward on May 29th with the successful test-firing of the Rudram-II air-to-surface missile.\nLaunched from a Sukhoi Su-30MKI fighter jet off the coast of Odisha, this marked the first full-configuration test of the weapon.\nThe Su-30MKI can carry a formidable payload of three Rudram-II missiles, and so can Tejas MkII which also can be equipped with three Rudram-II.\nDeveloped by the DRDO (Defence Research and Development Organisation), the Rudram-II comes in two variants: an anti-radiation missile (ARM) and a ground-attack missile.\nDRDO Plans more trials of the missile to ascertain various launch parameters before the missile system is cleared for production."}, {"id": "c3d834e8-6ae2-4a38-9eaf-e9b1616b5096", "title": "Houthis claim attacks on vessels off coast of Yemen", "date": "2024-06-10 03:30", "url": "http://www.israelnationalnews.com/news/391343", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Yemen’s Houthi rebels on Sunday claimed a missile attack which hit an Antigua- and Barbuda-flagged cargo ship in the Gulf of Aden, The Associated Press reported.\nThe British military's United Kingdom Maritime Trade Operations center similarly reported the attack and fire in the same area off Aden, saying “damage control is underway.\"\nGen. Yahya Saree claimed the attack in a prerecorded video message Sunday, saying the vessel had been targeted with both missiles and drones.\nThe Houthis have upped their attacks on vessels in the Red Sea since the start of Israel’s war against Hamas in Gaza as a show of support for Palestinian Arabs.\nIn the wake of the uptick in Houthi attacks, the US formed a coalition , made up of more than 20 countries, aimed at safeguarding commercial traffic in the Red Sea from attacks by the Houthis."}, {"id": "bed42d3b-2014-4469-ab3e-4f68f7e81dac", "title": "Israel - Gaza live updates : Israel says it rescued 4 hostages", "date": "2024-06-10 04:00", "url": "https://www.koka.am/syndicated-article/?id=1568393", "domain": "koka.am", "domain_classification": "Unknown", "message": "Biden welcomed the safe return of four hostages from Gaza, pledging that the United States will not stop working until all hostages are home.\n-ABC News’ Samy Zyara and Nasser AttaJun 08, 7:12 AMIsrael says it rescued 4 hostagesIsrael rescued four hostages alive from two locations in the heart of Nuseirat, Gaza, Israel said Saturday.\nThe rescued hostages have been transferred to the ‘Sheba’ Tel-HaShomer Medical Center and are in good condition, the IDF said.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike."}, {"id": "d8c9e33c-cebd-4790-827e-44e009c616a0", "title": "Ukraine says it struck SU - 57 stealth fighter deep inside Russia", "date": "2024-06-10 02:00", "url": "https://www.defensenews.com/battlefield-tech/2024/06/09/ukraine-says-it-struck-su-57-stealth-fighter-deep-inside-russia/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine (AP) — Ukraine on Sunday said its forces hit an ultra-modern Russian warplane stationed on an air base nearly 600 kilometers (370 miles) from the front lines.\nIf confirmed, it would mark Ukraine’s first known successful strike on a twin-engine Su-57 stealth jet, lauded as Moscow’s most advanced fighter plane.\nBut the airstrip’s distance from Ukraine, as well as unofficial comments from Russia, point to the likely use of Ukrainian-made drones.\nSince Moscow’s full-scale invasion more than two years ago, Kyiv has ramped up domestic drone production and used the munitions to strike deep inside Russia.\nThe ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip."}, {"id": "0e293667-96da-42ef-9b39-db848f74dc82", "title": "Ukraine struck a top fighter plane deep inside Russia – NBC 7 San Diego", "date": "2024-06-10 10:00", "url": "https://www.nbcsandiego.com/news/national-international/ukraine-says-it-struck-a-top-fighter-plane-deep-inside-russia/3537008/", "domain": "nbcsandiego.com", "domain_classification": "Unknown", "message": "If confirmed, it would mark Ukraine's first known successful strike on a twin-engine Su-57 stealth jet, lauded as Moscow's most advanced fighter plane.\nBut the airstrip's distance from Ukraine, as well as unofficial comments from Russia, point to the likely use of Ukrainian-made drones.\nSince Moscow’s full-scale invasion more than two years ago, Kyiv has ramped up domestic drone production and used the munitions to strike deep inside Russia.\nThe ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nThe move drew a furious response from Moscow, and warnings it could embroil NATO in a war with Russia."}, {"id": "4ca08ea5-1621-4862-a611-d8602e9b0de1", "title": "Ukraine struck a top fighter plane deep inside Russia – NBC Chicago", "date": "2024-06-10 14:00", "url": "https://www.nbcchicago.com/news/national-international/ukraine-says-it-struck-a-top-fighter-plane-deep-inside-russia/3459355/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "If confirmed, it would mark Ukraine's first known successful strike on a twin-engine Su-57 stealth jet, lauded as Moscow's most advanced fighter plane.\nBut the airstrip's distance from Ukraine, as well as unofficial comments from Russia, point to the likely use of Ukrainian-made drones.\nSince Moscow’s full-scale invasion more than two years ago, Kyiv has ramped up domestic drone production and used the munitions to strike deep inside Russia.\nThe ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nAccording to an update by Pepel (Ashes), a channel run by Belgorod journalists now based outside Russia, Ukrainian drones on Sunday afternoon struck an ammunition depot outside the town of Rakitnoye, some 35 kilometres (22 miles) from Ukraine."}, {"id": "17e84451-fe5c-4848-a3c7-505978aed2e4", "title": "British sources report new maritime incident off Yemen coast", "date": "2024-06-10 09:00", "url": "https://www.globalsecurity.org/military/library/news/2024/06/mil-240609-irna07.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "British sources report new maritime incident off Yemen coastIRNA - Islamic Republic News AgencyJun 9, 2024Tehran, IRNA -- The UK Maritime Trade Operations (UKMTO) has reported yet another maritime-related incident in the Red sea without giving any further details.\nAccording to the same report, the British maritime security company Ambri also informed that a fire broke out after a missile hit a commercial ship in the southeast of Aden.\nSome news media have published pictures of damage caused to 2 American ships in a recent missile strike by the Yemeni armed forces.\nSince the Israeli genocidal war on Gaza, the Yemeni armed forces have targeted dozens of Israeli or Israeli-bound ships in the Red and Arabia Seas.\nBut over the past couple of months, Yemeni forces have also intensified attacks on American and British warships and commercial vessels in response to the two countries' aggression against Yemen."}, {"id": "8dd3db33-254b-4ff7-ba92-75299a0b7346", "title": "Ukraine says deep drone strike destroys rare Russian Su - 57 stealth fighter", "date": "2024-06-10 06:15", "url": "https://www.cnn.com/2024/06/10/europe/ukraine-drone-strike-destroys-russian-su57-stealth-fighter-intl-hnk-ml/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —Ukraine’s military on Sunday said it had destroyed one of Russia’s newest and most advanced fighter jets in a drone strike on a military base deep inside Russia.\nUkrainian forces said they successfully destroyed one of Russia's most advanced combat jets, SU-57, in a drone strike on a military base deep inside Russia.\nFlight Global’s “World Air Forces 2024” directory lists 14 Su-57s as active and another 62 as on order.\nTASS reported in 2022 that Russian forces will receive a total of 22 Su-57s by the end of this year.\nIf the reports of the Ukrainian drone strike deep inside Russia prove true, it marks another success of Kyiv’s low-cost drones taking out high-value Russian assets."}, {"id": "b54408f1-9c3d-4862-aacd-8ee6ae03569a", "title": "Rapper Foxy Brown Wanted as Star Witness for Tupac Murder Trial", "date": "2024-06-10 00:00", "url": "https://radaronline.com/p/rapper-foxy-brown-wanted-star-witness-tupac-murder-trial-keefe-d/", "domain": "radaronline.com", "domain_classification": "Unknown", "message": "Foxy, born Inga DeCarlo Fung Marchand, was in Las Vegas hanging out with Duane \"Keefe D\" Davis' friends on September 7, 1996, shortly before Tupac was tracked down and shot by a Southside Crip gang, prosecutors said.\nAccording to the U.S. Sun, the Clark County District Attorney's office is building a witness list corroborating their case that Davis was in Las Vegas and planning the assassination.\nSeveral informants have told prosecutors that Foxy saw Davis and even interacted with him hours before Tupac's shooting."}, {"id": "530c153b-3704-4354-8f18-af73906d9e79", "title": "US military confirms Houthi missile strikes on two ships in Gulf of Aden", "date": "2024-06-10 06:00", "url": "https://tribune.com.pk/story/2470683/us-military-confirms-houthi-missile-strikes-on-two-ships-in-gulf-of-aden", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Houthis hit the Tavvishi, a Liberian-flagged and Swiss-owned container ship with an anti-ship ballistic missile, CENTCOM said.\nTwo missiles fired by the Houthis struck the Norderney, a German-owned cargo ship operating under Antigua and Barbados flags, CENTCOM said.\nMSC Ship Management is the manager of the Tavvishi, according to LSEG data.\nSunship Schiffahrtskontor, manager of the Norderney according to LSEG, also could not be reached for comment.\nThe United States and Britain have carried out strikes against Houthi targets in response to the attacks."}, {"id": "47c67d72-5c1c-426b-ab52-c6e8fbcdb250", "title": "US military confirms Houthi missile strikes on two ships in Gulf of Aden", "date": "2024-06-10 05:15", "url": "https://www.channelnewsasia.com/world/us-military-confirms-houthi-missile-strikes-two-ships-gulf-aden-4398901", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "The Iran-backed Houthis hit the Tavvishi, a Liberian-flagged and Swiss-owned container ship with an anti-ship ballistic missile, CENTCOM said.\nTwo missiles fired by the Houthis struck the Norderney, a German-owned cargo ship operating under Antigua and Barbados flags, CENTCOM said.\nMSC Ship Management is the manager of the Tavvishi, according to LSEG data.\nSunship Schiffahrtskontor, manager of the Norderney according to LSEG, also could not be reached for comment.\nThe United States and Britain have carried out strikes against Houthi targets in response to the attacks."}, {"id": "727803a4-07a6-4d97-8958-b060450a14c6", "title": "Marines tout the Bongbong rockets that went bust during Marcos Sr . regime", "date": "2024-06-10 05:00", "url": "https://verafiles.org/articles/marines-tout-the-bongbong-rockets-that-went-bust-during-marcos-srs-regime", "domain": "verafiles.org", "domain_classification": "Unknown", "message": "When journalists first heard about the Bongbong rockets in March 1972, they thought it was just another government scam.\nBased on the Facebook posts of some of the park visitors, one of the exhibits there is a replica of a Bongbong rocket launch vehicle.\nThe rocket earned its moniker, “Bongbong Rocket” in honor of the then President Ferdinand E. Marcos’ son, Ferdinand “Bongbong” R. Marcos Jr, the 17th President of the Republic of the Philippines .\nBongbong rocket lift-offs—and letdownsThe first known rocket launch took place on March 12, 1972.\nThe dream for the Bongbong rockets ended neither with a whimper or a bang."}, {"id": "481e7b2a-9977-4adf-a663-01df4c45974e", "title": "Putin War , Week 119 . ", "date": "2024-06-10 02:00", "url": "https://redstate.com/streiff/2024/06/09/putins-war-week-119-n2174961", "domain": "redstate.com", "domain_classification": "Unknown", "message": "Welcome to my review of Week 119 of Putin's War in Ukraine and Day 10 since NATO blew through another of Putin's red lines that the Foreign Policy SmartSet ™.promised us would result in World War III.\nPutin's War, Week 118.\nJake Sullivan Under Fire, ATACMS Everywhere, and the Stalemate Continues – RedStatePutin's War, Week 118.\nBACKGROUND: Putin's War, Week 116.\nBACKGROUND: Putin's War, Week 118."}, {"id": "9770c764-dd32-4db5-ae19-fe24413319d5", "title": "Ukraine says it struck a top fighter plane deep inside Russia", "date": "2024-06-10 00:15", "url": "https://www.newsday.com/news/nation/russia-ukraine-war-su57-fighter-i20994", "domain": "newsday.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine — Ukraine on Sunday said its forces hit an ultra-modern Russian warplane stationed on an air base nearly 600 kilometers (370 miles) from the front lines.\nIf confirmed, it would mark Ukraine's first known successful strike on a twin-engine Su-57 stealth jet, lauded as Moscow's most advanced fighter plane.\nSince Moscow’s full-scale invasion more than two years ago, Kyiv has ramped up domestic drone production and used the munitions to strike deep inside Russia.\nThe ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nAccording to an update by Pepel (Ashes), a channel run by Belgorod journalists now based outside Russia, Ukrainian drones on Sunday afternoon struck an ammunition depot outside the town of Rakitnoye, some 35 kilometres (22 miles) from Ukraine."}, {"id": "4eb93c7e-2489-4936-a73e-83c95300fc03", "title": "Yemen Houthi group claims strikes on British warship , commercial vessels", "date": "2024-06-10 03:15", "url": "https://www.prokerala.com/news/articles/a1538250.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "Aden : , June 10 (IANS) The Houthi group in Yemen said that it had carried out strikes targeting a British naval destroyer and two commercial ships in the Red Sea and the Arabian Sea.\nHe declared that the Houthi forces' \"operations will not stop until the aggression stops and the siege on the Palestinian people in the Gaza Strip is lifted\".\nThe official said that the ship was struck in the stern section, causing a fire, but no casualties were reported among the crew.\nIn response to the Houthi naval attacks, the US and Britain launched a joint military operation in January 2024, involving airstrikes and missile strikes against Houthi targets in various areas of Yemen.\nThis prompted the group to expand its targeting to include American and British commercial and military ships in the Red Sea and the Gulf of Aden, further escalating the conflict in the strategic region."}, {"id": "70258dad-f898-4547-b900-491423a915bf", "title": "World - KSYL - AM", "date": "2024-06-10 00:30", "url": "https://ksyl.com/world/3f2aa3f7ef9fbbd57eb12dbd065ce2a4", "domain": "ksyl.com", "domain_classification": "Unknown", "message": "-ABC News' Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nAt least 150 Palestinians were killed in Israeli raids on Saturday, the Hamas-run Gaza Health Ministry said.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,\" he said, describing the aftermath of the deadly Rafah strike.\n\"A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "2a0a3e7f-b632-47c2-9603-0f03a4370f3b", "title": "Radio Station WHMI 93 . 5 FM Livingston County Michigan News , Weather , Traffic , Sports , School Updates , and the Best Classic Hit", "date": "2024-06-10 02:00", "url": "https://www.whmi.com/news/national/israel-gaza-live-updates-gantz-rejects-netanyahus-request-resigns", "domain": "whmi.com", "domain_classification": "Unknown", "message": "-ABC News' Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nIsraeli forces said Hamas \"terrorists\" were operating \"from a container inside the grounds\" of the school in Al-Shati.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,\" he said, describing the aftermath of the deadly Rafah strike.\n\"A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "89c6d51f-41c0-4a4a-9261-783131fe99ef", "title": "Israel - Gaza live updates : Gantz rejects Netanyahu request , resigns - WEIS | Local & Area News , Sports , & Weather", "date": "2024-06-10 04:15", "url": "https://weisradio.com/2024/06/09/israel-gaza-live-updates-gantz-rejects-netanyahus-request-resigns/", "domain": "weisradio.com", "domain_classification": "Unknown", "message": "Netanyahu’s coalition government will still retain a majority, but the move by Gantz is considered a major blow to the prime minister.\n-ABC News’ Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "031e50af-2395-43e1-b00f-9b9b0c802105", "title": "World - HITS FM", "date": "2024-06-10 03:15", "url": "https://hitsfm.net/world/ef44be3b95de4ae0b4d6676f87d47fb2", "domain": "hitsfm.net", "domain_classification": "Unknown", "message": "-ABC News' Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nAt least 150 Palestinians were killed in Israeli raids on Saturday, the Hamas-run Gaza Health Ministry said.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,\" he said, describing the aftermath of the deadly Rafah strike.\n\"A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "4b18db3b-b14a-407a-bba9-918f8b5d33b5", "title": "World News - 1540 WADK Newport", "date": "2024-06-10 02:15", "url": "https://wadk.com/world-news/47a796d110af5dee91923b541e9431fd", "domain": "wadk.com", "domain_classification": "Unknown", "message": "-ABC News' Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nAt least 150 Palestinians were killed in Israeli raids on Saturday, the Hamas-run Gaza Health Ministry said.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,\" he said, describing the aftermath of the deadly Rafah strike.\n\"A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "b9ab55f6-063a-4602-8d81-2e4fb17a17c0", "title": "Israel - Gaza live updates : Gantz rejects Netanyahu request , resigns", "date": "2024-06-10 05:00", "url": "https://www.wjnt.com/syndicated-article/?id=1568425", "domain": "wjnt.com", "domain_classification": "Unknown", "message": "Netanyahu’s coalition government will still retain a majority, but the move by Gantz is considered a major blow to the prime minister.\n-ABC News’ Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "e653d33e-1502-40e3-ae95-c9765c9d27d7", "title": "Israel - Gaza live updates : Gantz rejects Netanyahu request , resigns", "date": "2024-06-10 05:00", "url": "https://www.k101fm.net/syndicated-article/?id=1568425", "domain": "k101fm.net", "domain_classification": "Unknown", "message": "Netanyahu’s coalition government will still retain a majority, but the move by Gantz is considered a major blow to the prime minister.\n-ABC News’ Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "f2e4f43a-4388-4b74-963f-432b309707b5", "title": "Israel - Gaza live updates : Gantz rejects Netanyahu request , resigns", "date": "2024-06-10 05:00", "url": "https://www.amazingmadison.com/syndicated-article/?id=1568425", "domain": "amazingmadison.com", "domain_classification": "Unknown", "message": "Netanyahu’s coalition government will still retain a majority, but the move by Gantz is considered a major blow to the prime minister.\n-ABC News’ Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "e0cfd4a3-24c1-4194-b43f-8632bd343974", "title": "Israel - Gaza live updates : Gantz rejects Netanyahu request , resigns", "date": "2024-06-10 04:30", "url": "https://www.madrock1025.com/syndicated-article/?id=1568425", "domain": "madrock1025.com", "domain_classification": "Unknown", "message": "Netanyahu’s coalition government will still retain a majority, but the move by Gantz is considered a major blow to the prime minister.\n-ABC News’ Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "617ce0f6-dd92-451b-be54-c1d200608925", "title": "Israel - Gaza live updates : Gantz rejects Netanyahu request , resigns", "date": "2024-06-10 04:45", "url": "https://www.myiowainfo.com/syndicated-article/?id=1568425", "domain": "myiowainfo.com", "domain_classification": "Unknown", "message": "Netanyahu’s coalition government will still retain a majority, but the move by Gantz is considered a major blow to the prime minister.\n-ABC News’ Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "1913126b-46d6-4d2f-8b34-5f738cf27625", "title": "Israel - Gaza live updates : Gantz rejects Netanyahu request , resigns", "date": "2024-06-10 03:45", "url": "https://www.wntxradio.com/syndicated-article/?id=1568425", "domain": "wntxradio.com", "domain_classification": "Unknown", "message": "Netanyahu’s coalition government will still retain a majority, but the move by Gantz is considered a major blow to the prime minister.\n-ABC News’ Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "5be56263-0727-4da8-af87-1043547202ae", "title": "Israel - Gaza live updates : Gantz rejects Netanyahu request , resigns", "date": "2024-06-10 03:45", "url": "https://www.kdks.fm/syndicated-article/?id=1568425", "domain": "kdks.fm", "domain_classification": "Unknown", "message": "Netanyahu’s coalition government will still retain a majority, but the move by Gantz is considered a major blow to the prime minister.\n-ABC News’ Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "80bcb7c9-2b24-41dd-bdfc-1a7b1c26ec2d", "title": "Israel - Gaza live updates : Gantz rejects Netanyahu request , resigns", "date": "2024-06-10 04:15", "url": "https://www.mymoinfo.com/syndicated-article/?id=1568425", "domain": "mymoinfo.com", "domain_classification": "Unknown", "message": "Netanyahu’s coalition government will still retain a majority, but the move by Gantz is considered a major blow to the prime minister.\n-ABC News’ Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "36457fde-9169-4757-a7c5-694663534e2e", "title": "Israel - Gaza live updates : Gantz rejects Netanyahu request , resigns", "date": "2024-06-10 03:15", "url": "https://www.kxl.com/syndicated-article/?id=1568425", "domain": "kxl.com", "domain_classification": "Unknown", "message": "Netanyahu’s coalition government will still retain a majority, but the move by Gantz is considered a major blow to the prime minister.\n-ABC News’ Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "750de74d-59ca-4540-9582-082844aeef1d", "title": "Israel - Gaza live updates : Gantz rejects Netanyahu request , resigns", "date": "2024-06-10 06:45", "url": "https://www.exploreseiowa.com/syndicated-article/?id=1568425", "domain": "exploreseiowa.com", "domain_classification": "Unknown", "message": "Netanyahu’s coalition government will still retain a majority, but the move by Gantz is considered a major blow to the prime minister.\n-ABC News’ Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "8b587d7c-f38e-4010-bd74-bbd999d91ca0", "title": "Israel - Gaza live updates : Gantz rejects Netanyahu request , resigns", "date": "2024-06-10 06:00", "url": "https://www.northwestmoinfo.com/syndicated-article/?id=1568425", "domain": "northwestmoinfo.com", "domain_classification": "Unknown", "message": "Netanyahu’s coalition government will still retain a majority, but the move by Gantz is considered a major blow to the prime minister.\n-ABC News’ Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "ebf9ba68-b90b-4c68-8fa7-8ed1b7f35625", "title": "Israel - Gaza live updates : Gantz rejects Netanyahu request , resigns", "date": "2024-06-10 06:00", "url": "https://www.yourfortdodge.com/syndicated-article/?id=1568425", "domain": "yourfortdodge.com", "domain_classification": "Unknown", "message": "Netanyahu’s coalition government will still retain a majority, but the move by Gantz is considered a major blow to the prime minister.\n-ABC News’ Nathan LunaJun 08, 6:10 PMBlinken comments on hostage rescueSecretary of State Antony Blinken released a statement Saturday following the rescue of four Israeli hostages, welcoming their safe return.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "5e1b3a71-309e-4b0c-a310-ff7f43e2787b", "title": "Yemen Houthi Group Claims Strikes On British Warship , Commercial Vessels", "date": "2024-06-10 03:30", "url": "https://menafn.com/1108313139/Yemens-Houthi-Group-Claims-Strikes-On-British-Warship-Commercial-Vessels", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Aden (Yemen), June 10 (IANS) The Houthi group in Yemen said that it had carried out strikes targeting a British naval destroyer and two commercial ships in the Red Sea and the Arabian Sea.\nHe declared that the Houthi forces' \"operations will not stop until the aggression stops and the siege on the Palestinian people in the Gaza Strip is lifted\".\nThe official said that the ship was struck in the stern section, causing a fire, but no casualties were reported among the crew.\nIn response to the Houthi naval attacks, the US and Britain launched a joint military operation in January 2024, involving airstrikes and missile strikes against Houthi targets in various areas of Yemen.\nThis prompted the group to expand its targeting to include American and British commercial and military ships in the Red Sea and the Gulf of Aden, further escalating the conflict in the strategic region."}, {"id": "61a87e75-e610-44f0-b41f-80a6066d7a5f", "title": "Ukraine says it struck a top fighter plane deep inside Russia", "date": "2024-06-10 00:00", "url": "https://www.columbian.com/news/2024/jun/09/ukraine-says-it-struck-a-top-fighter-plane-deep-inside-russia/", "domain": "columbian.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine — Ukraine on Sunday said its forces hit an ultra-modern Russian warplane stationed on an air base nearly 600 kilometers (370 miles) from the front lines.\nKyiv’s main military intelligence service shared satellite photos it said showed the aftermath of the attack.\nIf confirmed, it would mark Ukraine’s first known successful strike on a twin-engine Su-57 stealth jet, lauded as Moscow’s most advanced fighter plane.\nAccording to the Main Intelligence Directorate of Ukraine’s Ministry of Defense, the strike took place on Saturday at the Akhtubinsk base in southern Russia, some 589 kilometers (366 miles) from the front line.\nThe Ukrainian agency said the plane, which is capable of carrying stealth missiles across hundreds of kilometers (miles), was among “a countable few” of its type in Moscow’s arsenal."}, {"id": "6004ebb8-65db-405e-a91f-33aa4b19d863", "title": "  Ultimate surprise : How an Israeli raid freed 4 hostages and killed scores of Palestinians in Gaza", "date": "2024-06-10 00:15", "url": "https://www.newsday.com/news/nation/israel-palestinians-hamas-war-hostages-casualties-t54674", "domain": "newsday.com", "domain_classification": "Unknown", "message": "By the time it was over, four Israeli hostages had been brought home alive and mostly unscathed, at least physically, and at least 274 Palestinians, and an Israeli commando, had been killed.\nHere's how it unfolded, according to the Israeli military and Palestinian witnesses.\nA Palestinian looks at the aftermath of the Israeli bombing in Nuseirat refugee camp, Gaza Strip, Saturday, June 8, 2024. Credit: AP/Jehad AlshrafiThey had been moved among different locations but were never held in Hamas' notorious tunnels.\nIsraeli intelligence figured out where they were and commandos spent weeks practicing the raid on life-size models of the buildings, according to Rear Adm. Daniel Hagari, the Israeli military spokesman.\nThe Gaza Health Ministry said 274 Palestinians were killed and around 700 were wounded."}, {"id": "500262a3-178e-437e-92a8-79275a5fd507", "title": "Ukraine says deep drone strike destroys rare Russian Su - 57 stealth fighter - LocalNews8 . com", "date": "2024-06-10 06:30", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/09/ukraine-says-deep-drone-strike-destroys-rare-russian-su-57-stealth-fighter/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "The Ukrainian Telegram post noted the Su-57’s ability to carry Kh-59 and Kh-69 cruise missiles, which the jet could launch against Ukraine from the safety of Russian airspace.\nFlight Global’s “World Air Forces 2024” directory lists 14 Su-57s as active and another 62 as on order.\n“The Russian Aerospace Forces currently have only a limited number of these combat aircraft in service,” the GUR Telegram post said.\nTASS reported in 2022 that Russian forces will receive a total of 22 Su-57s by the end of this year.\nIf the reports of the Ukrainian drone strike deep inside Russia prove true, it marks another success of Kyiv’s low-cost drones taking out high-value Russian assets."}, {"id": "ba31135c-c15a-4dd4-990d-4fb10005b0cd", "title": "Ukraine says deep drone strike destroys rare Russian Su - 57 stealth fighter - LocalNews8 . com", "date": "2024-06-10 06:30", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/09/ukraine-says-deep-drone-strike-destroys-rare-russian-su-57-stealth-fighter-2/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "The Ukrainian Telegram post noted the Su-57’s ability to carry Kh-59 and Kh-69 cruise missiles, which the jet could launch against Ukraine from the safety of Russian airspace.\nFlight Global’s “World Air Forces 2024” directory lists 14 Su-57s as active and another 62 as on order.\n“The Russian Aerospace Forces currently have only a limited number of these combat aircraft in service,” the GUR Telegram post said.\nTASS reported in 2022 that Russian forces will receive a total of 22 Su-57s by the end of this year.\nIf the reports of the Ukrainian drone strike deep inside Russia prove true, it marks another success of Kyiv’s low-cost drones taking out high-value Russian assets."}, {"id": "508fdfef-d7a6-456d-ad7b-d6d390296a1e", "title": "US military confirms Houthi missile strikes on two ships in Gulf of Aden", "date": "2024-06-10 04:30", "url": "https://www.jpost.com/breaking-news/article-805649", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The Iran-backed Houthis hit the Tavvishi, a Liberian-flagged and Swiss-owned container ship with an anti-ship ballistic missile, CENTCOM said.\nAccording to CENTCOM, the vessel was damaged, but no crew were injured.\nTwo missiles fired by the Houthis struck the Norderney, a German-owned cargo ship operating under Antigua and Barbados flags, CENTCOM said.\nThe Houthis previously said they had hit the Tavvishi and Norderney and claimed to have set the latter ablaze.\nThe United States and Britain have carried out strikes against Houthi targets in response to the attacks."}, {"id": "ce717f11-6f42-4cca-90b3-77f0b96a84aa", "title": "Ukraine says latest - generation Russian fighter jet hit for first time", "date": "2024-06-10 10:30", "url": "https://www.stabroeknews.com/2024/06/10/news/world/ukraine-says-latest-generation-russian-fighter-jet-hit-for-first-time/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "KYIV (Reuters) – Ukrainian forces have for the first time hit a latest-generation Russian Sukhoi Su-57 fighter jet at an air base inside Russia, Kyiv’s GUR defence intelligence agency said on Sunday, showing satellite pictures which it said confirmed the strike.\nIn a Telegram post, the GUR did not specify how the Su-57 was hit or by which unit of the Ukrainian military.\nRussian blogger Fighterbomber said the jet fighter was struck by shrapnel and the damage was currently being assessed to see if the aircraft could be repaired.\nDespite being touted as a Russian fifth-generation fighter aircraft to rival its U.S. equivalent, the Su-57 was plagued by development delays and a crash in 2019.\nIt is a heavy fighter jet capable of fulfilling a variety of battlefield roles."}, {"id": "9e90e38d-bade-41a9-94f1-85595f787c26", "title": "Al - Qaeda leader urges supporter to go to Afghanistan for military training : Long War Journal", "date": "2024-06-10 09:00", "url": "https://www.khaama.com/al-qaeda-leader-urges-supporter-to-go-to-afghanistan-for-military-training-long-war-journal/", "domain": "khaama.com", "domain_classification": "Unknown", "message": "The Long War Journal reported, citing an article by Saif al-Adel, believed to be the current leader of al-Qaeda, that the group has called on its supporters worldwide to migrate to Afghanistan for military training and experience.\nAyman al-Zawahiri, the previous leader of al-Qaeda, was killed in a U.S. airstrike in Kabul on August 1, 2022.\nDespite electing a new leader, al-Qaeda has remained silent on the details of al-Zawahiri’s death.\nThe Taliban have consistently denied the presence of terrorist groups in Afghanistan.\nAccording to the UN, al-Qaeda established eight new training camps in Afghanistan, including Ghazni, Laghman, Parwan, and Uruzgan, with an armory in Panjshir."}, {"id": "6443a1a4-208d-4aac-a210-7ebb58cb088f", "title": "Watch : Terrorist emerging from a tunnel with an RPG missile eliminated", "date": "2024-06-10 13:45", "url": "http://www.israelnationalnews.com/news/391372", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The forces, in cooperation with the Yahalom special forces engineering unit, are advancing in underground combat and so far have destroyed several tunnel routes.\nThe Kfir Brigade located weapons and arrested several terrorists who were transferred for further investigation by security forces.\nDuring the fighting, the 101st Battalion identified a terrorist emerging from a tunnel with an RPG missile using a drone.\nThe soldiers attacked the tunnel and eliminated the terrorist with small arms fire and tank shells.\nThe forces eliminated terrorists, among them a Nukhba terrorist who participated in the October 7th attack, and destroyed rocket launch areas and launchers."}, {"id": "e013f877-d991-41f7-80b5-10664c556505", "title": "Russo - Ukraine War - 09 June 2024", "date": "2024-06-10 00:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-09.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn the Kurakhiv direction, Russian forces attacked our positions in the areas of Paraskovíivka and Krasnogorivka eight times.\nIn the course of counter-battery warfare, one Polish-made 155-mm Krab self-propelled artillery system, one 152-mm Msta-B howitzer, one 122-mm Gvozdika self-propelled artillery system, one 122-mm D-30 howitzer, and one 122-mm Grad multiple-launch rocket system were hit.\nThe units defeated during counter-battery warfare: two 155-mm U.S.-made M777 howitzers, one 152-mm Akatsiya self-propelled artillery system, one 122-mm Gvozdika self-propelled artillery system, two 122-mm D-30 howitzers, and two 100-mm Rapira anti-tank guns."}, {"id": "f2e75719-8a79-44b1-b0bb-1443d8d96cf6", "title": "Queens Road murder probe update as police confirm location of  tragic  stabbing", "date": "2024-06-10 14:30", "url": "https://www.coventrytelegraph.net/news/local-news/queens-road-murder-probe-update-29325610", "domain": "coventrytelegraph.net", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nOur free Nuneaton & Bedworth email updates are the best way to get headlines direct to your inboxSomething went wrong, please try again later.\nMuch of the Queens Road entrance to the town centre was sealed off by police tape yesterday (June 9).\n\"We were called at 9.26pm on Saturday (8th June 2024) to reports of a stabbing on Queens Road, Nuneaton,\" the WMAS spokesperson said."}, {"id": "f34752fe-c882-4889-857e-d48eb60ec408", "title": "US : Houthi - fired missiles hit German and Swiss - owned ships", "date": "2024-06-10 00:15", "url": "https://www.yahoo.com/news/us-houthi-fired-missiles-hit-234657462.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Iran-backed Houthi rebels have attacked an Greek carrier ship in the Red Sea, the US military said on Tuesday.\nOsamah Yahya/dpaIran-backed Houthi rebels attacked two European-owned carrier ships in the Red Sea; damaging them, the US military said on Sunday.\nThe two vessels hit in the space of 24 hours were Liberian-flagged, Swiss-owned and operated container ship M/V Tavvishi and M/V Norderney, an Antigua and Barbados-flagged, German-owned and operated cargo ship, the US Central Command (CENTCOM) said in a statement.\nTwo anti-ship ballistic missiles (ASBM) were launched from Houthi controlled areas of Yemen into the Gulf of Aden, with one striking the M/V Tavvishi.\nThe European Union has also launched a military operation to protect merchant shipping in the Red Sea."}, {"id": "3d146b73-ad43-4f47-a523-3b23ddd9e912", "title": "Ukraine hits Russia most advanced stealth fighter for first time", "date": "2024-06-10 02:30", "url": "https://www.independent.ie/world-news/europe/ukraine-hits-russias-most-advanced-stealth-fighter-for-first-time/a1352601666.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "Military cadets of the Lviv lyceum celebrate after a graduation ceremony, amid Russia’s attack on Ukraine on Saturday.\nPhoto: ReutersUkraine has said its forces hit an ­ultra-modern Russian warplane ­stationed on an air base nearly 645km from the front line, after its Western allies allowed Kyiv to use their weapons for limited strikes inside Russia."}, {"id": "c037e8ff-fb56-4808-83c8-141be5ecf455", "title": "Ukraine claims it struck Su - 57 fighter jet deep inside Russia", "date": "2024-06-10 05:00", "url": "https://www.scmp.com/news/world/europe/article/3266000/ukraine-claims-it-struck-su-57-fighter-jet-deep-inside-russia", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "If confirmed, it would mark Ukraine’s first known successful strike on a twin-engined Su-57 stealth jet, lauded as Moscow’s most advanced fighter plane.\nUkraine said its forces hit an ultra-modern Russian warplane stationed on an airbase nearly 600km (370 miles) from the front lines.\nBut the airstrip’s distance from Ukraine, as well as unofficial comments from Russia, point to the likely use of Ukrainian-made drones.\nSince Moscow’s full-scale invasion more than two years ago, Kyiv has ramped up domestic drone production and used the munitions to strike deep inside Russia.\nA Russian Su-57 fifth-generation fighter in 2021."}, {"id": "b29565e0-0342-4531-b4b9-5873b621a980", "title": "Gaza , united states chiedono voto Onu su bozza risoluzione per tregua", "date": "2024-06-10 04:15", "url": "https://www.giornaledibrescia.it/italia-e-estero/gaza-usa-chiedono-voto-onu-su-bozza-risoluzione-per-tregua-mmxd84ek", "domain": "giornaledibrescia.it", "domain_classification": "Unknown", "message": "© Copyright Editoriale Bresciana S.p.A. - Brescia - P.IVA 00272770173Soggetto esercente l'attività di direzione e coordinamento: Gold Line SpA L'adattamento totale o parziale e la riproduzione con qualsiasi mezzo elettronico, in funzione della conseguente diffusione online, sono riservati per tutti i paesi.\nInformative e moduli privacy.\nEdizione online del Giornale di Brescia, quotidiano di informazione registrato al Tribunale di Brescia al n° 07/1948 in data 30 novembre 1948."}, {"id": "a1fc84a8-809d-4186-b9e3-f0dcb76943ff", "title": "DEAD OR ALIVE", "date": "2024-06-10 08:00", "url": "https://jamaica-gleaner.com/article/lead-stories/20240610/dead-or-alive", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "WESTERN BUREAU:Local law enforcement officials are being urged to defend themselves whenever they come under attack from criminals.\nFairclough, who was assigned to the St Ann Divisional Operational Support Unit, was shot in the parish capital on April 15.\nIt is reported that he was on Bravo Street when a man shot and injured a woman.\nShe also urged that local social media influencers play a part by urging criminals to turn in their guns.\nShe said this step must be taken to show his family “that the blood sweat and sacrifice was not in vain”."}, {"id": "22b65d9b-d76f-498a-b7d0-3ae3f2df55ad", "title": "Govt committed to eliminate terrorism : President , PM", "date": "2024-06-10 12:30", "url": "https://dunyanews.tv/en/Pakistan/817553-Govt-committed-to-eliminate-terrorism:-President,-PM", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Govt committed to eliminate terrorism: President, PMPakistan Pakistan Govt committed to eliminate terrorism: President, PMConveyed heartfelt condolences to the families of the martyrs in Lakki Marwat attackFollow on Updated On: Mon, 10 Jun 2024 13:21:48 PKT(Radio Pakistan) - President Asif Ali Zardari and Prime Minister Shehbaz Sharif have expressed resolve to continue fight against terrorism till its complete elimination.\nIn his message, President condemned IED attack on security forces.\nGovernor Khyber Pakhtunkhwa Faisal Karim Kundi and Chief Minister Ali Amin Gandapur also strongly condemned the terrorist attack on security forces vehicle in Lakki Marwat.\nIn their statements issued in Peshawar, they expressed deep grief and sorrow over the martyrdom of seven personnel includes Capt Faraz in the tragic incident.\nThey expressed sympathies with the bereaved families and said that the sacrifices of security forces will never be go in vain."}, {"id": "8f8d4dbb-d27e-4f1d-8550-c9c9e2f9ab33", "title": "Roadside bomb in northwestern Pakistan kills 7 soldiers", "date": "2024-06-10 09:00", "url": "https://www.globalsecurity.org/wmd/library/news/pakistan/2024/pakistan-240609-voa01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Roadside bomb in northwestern Pakistan kills 7 soldiersBy Ayaz Gul June 09, 2024Pakistani authorities said Sunday that a bomb blast targeted a military convoy in a militancy-hit northwestern region, killing at least seven soldiers.\nThe violence is claimed by Tehrik-i-Taliban Pakistan, or TTP, a globally designated terrorist organization, which Pakistani officials say is headquartered in Afghanistan.\nThe group has waged terrorist attacks in the country for years, killing thousands of Pakistani civilians and security forces.\nIt stated that Pakistani security forces had killed nearly 120 \"terrorists\" and arrested 300 others in military-led counterinsurgency operations during the same period.\nThe military has separately reported the fatalities of dozens of its personnel in bomb attacks and militant ambushes."}, {"id": "76d5a77a-b8b1-49fe-b8d3-6f5950fb199b", "title": "This week in history : June 10 - 16", "date": "2024-06-10 02:45", "url": "https://www.wsws.org/en/articles/2024/06/10/cjwk-j10.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "The NATO bombing campaign against Serbia had nothing to do with the defense of human rights.\nOn the evening of June 10, US President Bill Clinton appeared on national television to boast that NATO had “achieved victory” in Yugoslavia.\nOnly moments after they attempted to flee, Shea fired shots at Clifford Glover, hitting the child in the back.\n100 years ago: Anglo-Iraqi Treaty ratifiedOn June 10, 1924, the Iraqi Constituent Assembly in Baghdad ratified the Anglo Iraqi Treaty of 1922.\nThe Iraqi Constituent Assembly only ratified it in 1924 after the British High Commissioner, Sir Henry Dobbs, threatened to nullify the Iraqi Constitution."}, {"id": "6bb3b8fe-ca93-4601-98cc-ed8880e00cac", "title": "Deputies investigating reported stabbing in Clark County", "date": "2024-06-10 02:45", "url": "https://www.whio.com/news/local/deputies-investigating-reported-stabbing-clark-county/CYF4PWEM65ES3CTT7JSI2A67GE/", "domain": "whio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "149ce4fb-e320-40cf-8d92-4552c116de0b", "title": "Operation True Promise revealed Israeli regime fake deterrence : Iran acting FM", "date": "2024-06-10 09:00", "url": "https://www.globalsecurity.org/wmd/library/news/iran/2024/iran-240609-irna01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Operation True Promise revealed Israeli regime's fake deterrence: Iran acting FMIRNA - Islamic Republic News AgencyJun 9, 2024Tehran, IRNA -- Iran's Acting Foreign Minister Ali Bagheri Kani has said that the country's Operation True Promise against Israel proved that the regime's deterrence is fake.\n\"Operation True Promise showed that the Zionist regime's deterrence is fake.\n\"The Zionists now know very well that when the stability and security of the region is threatened and they try to destabilize the region, Iran will powerfully and vigilantly use its might to contain them\", he added.\nOn the Israeli genocide in Gaza, Bagheri Kani said that all governments should make efforts to stop the war.\nHe added that Tehran and Ankara enjoy high-level political and economic cooperation, and intend to further boost their ties in all fields."}, {"id": "cc7bbe33-34db-4dc6-b63e-c27c0d108c9b", "title": "Israel rescue raid kills 274 Palestinians", "date": "2024-06-10 04:00", "url": "http://europe.chinadaily.com.cn/a/202406/10/WS666637c9a31082fc043cba7d.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "In an update on Sunday, Gaza's Health Ministry said 274 Palestinians were killed and 698 were injured when Israeli special force commandos stormed into the densely populated Nuseirat refugee camp to rescue four hostages held since October by Hamas militants.\nThe rescued hostages were taken to hospital for medical checks and were in good health, the Israeli military said.\nHamas' raid killed some 1,200 people, according to Israeli authorities, and Israel's retaliatory bombardment and assault of Gaza has killed at least 37,084 Palestinians, Gaza's Health Ministry said on Sunday.\nAbu Ubaida, spokesperson for Hamas' armed al-Qassam Brigades, said some hostages were killed during the rescue operation.\n\"It's a blatant lie,\" Israeli military spokesman Peter Lerner told CNN, refuting the claim."}, {"id": "d699dc5f-120b-47f6-8b78-ada32cbcf011", "title": "Israel rescue raid kills 274 Palestinians", "date": "2024-06-10 04:15", "url": "http://usa.chinadaily.com.cn/a/202406/10/WS666637c9a31082fc043cba7d.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "In an update on Sunday, Gaza's Health Ministry said 274 Palestinians were killed and 698 were injured when Israeli special force commandos stormed into the densely populated Nuseirat refugee camp to rescue four hostages held since October by Hamas militants.\nThe rescued hostages were taken to hospital for medical checks and were in good health, the Israeli military said.\nHamas' raid killed some 1,200 people, according to Israeli authorities, and Israel's retaliatory bombardment and assault of Gaza has killed at least 37,084 Palestinians, Gaza's Health Ministry said on Sunday.\nAbu Ubaida, spokesperson for Hamas' armed al-Qassam Brigades, said some hostages were killed during the rescue operation.\n\"It's a blatant lie,\" Israeli military spokesman Peter Lerner told CNN, refuting the claim."}, {"id": "d39d8218-6b1b-4cfd-aa42-677cb1b763cf", "title": "Israel rescue raid kills 274 Palestinians", "date": "2024-06-10 05:30", "url": "http://africa.chinadaily.com.cn/a/202406/10/WS666637c9a31082fc043cba7d.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "In an update on Sunday, Gaza's Health Ministry said 274 Palestinians were killed and 698 were injured when Israeli special force commandos stormed into the densely populated Nuseirat refugee camp to rescue four hostages held since October by Hamas militants.\nThe rescued hostages were taken to hospital for medical checks and were in good health, the Israeli military said.\nHamas' raid killed some 1,200 people, according to Israeli authorities, and Israel's retaliatory bombardment and assault of Gaza has killed at least 37,084 Palestinians, Gaza's Health Ministry said on Sunday.\nAbu Ubaida, spokesperson for Hamas' armed al-Qassam Brigades, said some hostages were killed during the rescue operation.\n\"It's a blatant lie,\" Israeli military spokesman Peter Lerner told CNN, refuting the claim."}, {"id": "9274359d-1430-4eb5-88bc-5cfe718fc726", "title": "Japan for first time joins multinational Valiant Shield exercise near Guam", "date": "2024-06-10 12:30", "url": "https://www.stripes.com/branches/navy/2024-06-10/japan-valiant-shield-14136372.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "Navy)YOKOSUKA NAVAL BASE, Japan — The USS Ronald Reagan took center stage among eight warships in the Philippine Sea as the U.S. military commenced Valiant Shield, nearly two weeks of drills that included Japan for the first time.\nNumerous U.S., allied and partner nations’ ships and aircraft are involved in this year’s Valiant Shield, Mullick said by email Friday without going into details.\nAn EA-18G Growler lands on the USS Ronald Reagan during a Valiant Shield drill in the Philippine Sea, June 7, 2024.\nThis year’s exercise comes less than a month after China wrapped its own, smaller-scale exercise around Taiwan: Joint Sword 2024A.\nThe last Valiant Shield exercise, in 2022, brought together a similar set of participants, including more than 200 aircraft and around 13,000 personnel."}, {"id": "5dda2f45-6579-4c68-b3b0-4e9834ba7f22", "title": "Forbes : Su - 57 Damaged Is A Sign", "date": "2024-06-10 14:30", "url": "https://charter97.org/en/news/2024/6/10/598351/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Forbes: Su-57 Damaged Is A Sign 1 10.06.2024, 10:563,680Russia does not protect its aircraft well.\nIt is becoming quite clear that the Ukrainian UAV seriously damaged and possibly destroyed the Su-57 fighter of the Russian Air Force in the Astrakhan region of the Russian Federation at the Akhtubinsk air base.\nAccording to Forbes, it is quite possible that another such aircraft was also damaged.\nAt the same time, Fighterbomber confirmed that the SU-57 received shrapnel damage during Saturday's raid.\nThe Russian air force may not remove the surviving Su-57 from Akhtubinsk without jeopardizing the development of this type."}, {"id": "567a3675-626a-4791-904a-87987efa495d", "title": "1 person was killed and many were stabbed", "date": "2024-06-10 06:30", "url": "https://www.lportepilot.ca/1-person-was-killed-and-many-were-stabbed/", "domain": "lportepilot.ca", "domain_classification": "Unknown", "message": "SAN FRANCISCO – A male suspect was arrested Sunday in connection with a shooting that occurred during a fight at a lake in Northern California.\nA second person taken by helicopter was discharged from the hospital Sunday, said Henry Wofford, a spokesman for the Napa County Sheriff’s Office.\nWofford said the first deputy who arrived focused on the shooting victim and did not know how many combatants were involved.\nWofford said they believe they have a suspected gunman who is expected to be booked upon his release from the hospital.\n“We don’t see fights, we don’t see people being killed and stabbed,” he said."}, {"id": "0e5397f7-7df3-4684-8ad5-960624db0600", "title": "Repeat After Me : The U . S . Navy Aircraft Carrier Are All Done", "date": "2024-06-10 00:30", "url": "https://nationalinterest.org/blog/buzz/repeat-after-me-us-navy-aircraft-carriers-are-all-done-210317", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "The U.S. Navy's reliance on aircraft carriers is outdated in the face of modern anti-access/area-denial (A2/AD) threats from China, Russia, Iran, and North Korea.\n-In a conflict over Taiwan, submarines, long-range missiles, and amphibious capabilities should be prioritized over carriers.\n-The Navy must focus on destroying A2/AD systems before considering the deployment of aircraft carriers to avoid making them liabilities in a high-threat environment.\nThe US Army could conceivably provide long-range strike capability to target and annihilate known Chinese A2/AD emplacements.\nThe Marine Corps, with their widespread amphibious capability, could further destroy Chinese A2/AD systems spread throughout the area of responsibility."}, {"id": "1964f1dd-02c3-4b11-9e3f-ecaab180f911", "title": "Pro - Palestine protesters surround White House demanding end to Gaza war", "date": "2024-06-10 02:45", "url": "https://dunyanews.tv/en/World/817513-Pro-Palestine-protesters-surround-White-House-demanding-end-to-Gaza-war", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Pro-Palestine protesters surround White House demanding end to Gaza warWorld World Pro-Palestine protesters surround White House demanding end to Gaza warThousands of Gaza war protesters held a \"red line\" rally near the White House.\nFollow on Published On: Mon, 10 Jun 2024 07:28:42 PKTWASHINGTON (AFP) - Thousands of Gaza war protesters held a \"red line\" rally near the White House, voicing anger at what they said is US President Joe Biden's tolerance of Israel's bloody military campaign against Hamas.\n\"This 'red line' in his rhetoric is rubbish ... it shows his hypocrisy and his cowardice,\" Mahdawi told AFP.\nThe protesters - almost all wearing red clothing - held Palestinian flags and signs saying \"Biden's red line was a lie\" and \"Bombing children is not self-defence\".\nThe White House stepped up security with an additional anti-scale perimeter fence ahead of the demonstration, which saw chartered buses ferrying in people from as far afield as Maine and Florida."}, {"id": "62b60907-c828-4ebd-9b39-6ed85f2c1791", "title": "Ukrainian forces struck 1 Russian S - 400 and 2 S - 300 air defence battalions in Crimea overnight – Ukraine General Staff", "date": "2024-06-10 12:30", "url": "https://www.yahoo.com/news/ukrainian-forces-struck-1-russian-094800378.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian forces struck a Russian S-400 anti-aircraft missile battalion near the city of Dzhankoi and two S-300 anti-aircraft missile battalions near the settlements of Chornomorske and Yevpatoriia in Russian-occupied Crimea on the night of 9-10 June.\nSource: General Staff of Ukraine's Armed ForcesQuote: \"Ukrainian defence forces have successfully struck one S-400 anti-aircraft missile battalion belonging to the invaders near Dzhankoi and two enemy S-300 anti-aircraft missile battalions near Chornomorske and Yevpatoriia overnight.\nThe air defence of the Russian invaders in Ukrainian Crimea suffered heavy losses due to the successful combat work of the defence forces.\"\nThe S-300/S-400 radars immediately went down after the Ukrainian missile strikes in the areas mentioned above.\nIn addition, ammunition began detonating in all three launch areas of the Russian anti-aircraft missile battalions."}, {"id": "85406446-c665-4ec0-bbd0-84ac2f7ef23b", "title": "Over 280 Palestinians dead in  Nuseirat massacre  as Gantz quits Israeli war cabinet", "date": "2024-06-10 04:30", "url": "https://www.hurriyetdailynews.com/over-280-palestinians-dead-in-nuseirat-massacre-as-gantz-quits-israeli-war-cabinet-197238", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Over 280 Palestinians dead in 'Nuseirat massacre' as Gantz quits Israeli war cabinetGAZA STRIPIsraeli war cabinet minister Benny Gantz on Sunday announced his resignation amid celebrations for the rescue of four hostages from war-torn Gaza in a raid that Palestinians say killed hundreds.\nIt came after an Israeli operation on Saturday in central Gaza's crowded Nuseirat refugee camp area as they swooped in to free the four captives.\nThe health ministry in the Hamas-run territory said over 280 people were killed and 698 wounded, in what it labelled the \"Nuseirat massacre\", figures that could not be independently verified.\nAfter Saturday's rescue operation, 116 hostages remain in Gaza, although the army says 41 of them are dead.\nIsraeli helicopters were also firing east of the Bureij camp, near Nuseirat, witnesses told AFP."}, {"id": "40626e84-8cda-4db8-bfb8-ba2dfb1b7db7", "title": "Nigeria : Group Condemns Attack On Journalist By FCMB Security Guards", "date": "2024-06-10 05:45", "url": "https://allafrica.com/stories/202406100042.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "The journalist, Emmanuel Nwazue, who works at Afia TV, was allegedly assaulted by the security guards while he was monitoring the indefinite strike declared by the labour unions.\nThe Coalition for Whistleblowers Protection and Press Freedom (CWPPF) has condemned the alleged attack on a journalist by two security guards attached to a branch of First City Monument Bank (FCMB) in Umuahia, Abia State.\nPREMIUM TIMES reported how the journalist, Emmanuel Nwazue, who works at Afia TV, was assaulted by the security guards while he was monitoring the indefinite strike declared by the labour unions.\n\"Such a condemnable act from the security guards is totally unacceptable,\" the statement said.\nThe CWPPF asked the FCMB to thoroughly investigate the incident and discipline the security guards who allegedly attacked the journalist."}, {"id": "6f2a6f9c-4237-434a-ac27-35e88b9fbb98", "title": "Russia Protecting Crimean Bridge With Barges - Business Insider", "date": "2024-06-10 06:15", "url": "https://www.businessinsider.com/russia-protecting-crimean-bridge-with-barges-2024-6", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Russia is fortifying the Kerch Bridge with barges, says the UK's defense ministry.\nThe barges will help \"to defend the bridge and shipping channel\" from Ukrainian attacks, per the UK.\ndownload the app Email address Sign up By clicking “Sign Up”, you accept our Terms of Service and Privacy Policy .\nAdvertisementRussia is shoring up the defenses for the Kerch Bridge with barges, the UK's defense ministry said on Saturday.\n\"Analysis of imagery has identified the installation of eight barges on the southern side of the Kerch Bridge,\" the UK's defense ministry wrote in its intelligence dispatch."}, {"id": "8c86af6a-3354-4d1f-9484-4cdcb949ba01", "title": "Boy , 14 and woman , 55 , wounded Sunday night in Chicago", "date": "2024-06-10 14:00", "url": "https://www.chicagotribune.com/2024/06/10/boy-14-and-woman-55-wounded-sunday-night-in-west-pullman/", "domain": "chicagotribune.com", "domain_classification": "Unknown", "message": "A 14-year-old boy and 55-year-old woman were wounded Sunday night in a shooting on the South Side in the West Pullman neighborhood, according to police.\nShortly after 6:30 p.m., the pair was standing on the sidewalk on the 11800 block of South Michigan Avenue when shots were fired from a vehicle.\nThe boy was taken to the University of Chicago Medical Center’s Comer Children’s Hospital in fair condition with a gunshot wound to the right leg.\nThe woman was taken to Advocate Christ Medical Center in Oak Lawn also in fair condition with a gunshot wound to the right leg, police said.\nNo one is in custody for the attack, and detectives are investigating."}, {"id": "ada2fd2a-5f5e-4eaf-95bc-cc420b2af40f", "title": "Ukraine says it struck one of Russia most advanced warplanes", "date": "2024-06-10 02:45", "url": "https://timesofindia.indiatimes.com/world/europe/ukraine-says-it-struck-one-of-russias-most-advanced-warplanes/articleshow/110857631.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "If confirmed, it would mark Ukraine's first known successful strike on a Su-57 fighter plane, a twin-engine stealth fighter lauded as Moscow's most advanced military aircraft.In one photo, black soot marks and small craters can be seen dotting a concrete strip around the parked aircraft.\nAccording to reports by Russian agencies, Moscow's armed forces obtained \"more than 10\" new Su-57s last year, while 76 are set to be produced by 2028.Moscow did not immediately comment on the reports.\nThe Russian Defense Ministry said another drone was shot down over the nearby Bryansk region.Across Ukraine's front-line provinces, Russian shelling killed at least three civilians and wounded at least nine others on Saturday and overnight, according to reports by regional officials.\nA man died and two women suffered wounds in the village of Khotimla in Ukraine's northeastern Kharkiv region, where shelling damaged the local school, a council building and a shop, Gov.\nOleh Syniehubov said.Heavy battles continue in the area as Ukrainian troops try to beat back Russia's invading forces after a weekslong push by Moscow that sparked fears for Kharkiv and a wave of civilian evacuations."}, {"id": "5eeb4537-42a2-4270-bce2-2343690b0aa4", "title": "Explosion At SAM Plant In Poland", "date": "2024-06-10 14:30", "url": "https://charter97.org/en/news/2024/6/10/598393/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Explosion At SAM Plant In Poland 7 10.06.2024, 14:4010,338There are victims.\nAn explosion occurred at the Polish defense company Mesko S.A., RMF FM and Polsat reported.\nThe incident was confirmed by the head of the company, Elżbieta Śreniawska, to the Polish media.\nThe explosion at the plant, located in Skarżysku-Kamiennej, occurred in the department producing rocket fuel.\nThe company also produces portable SAM Piorun, anti-tank missiles, etc."}, {"id": "ccf1a776-53c6-44bf-ae5b-9ff7282c6628", "title": "Democratic Bills Could Strip Trump Secret Service Protection Over Felony", "date": "2024-06-10 10:15", "url": "https://www.huffingtonpost.co.uk/entry/democratic-bills-could-strip-trump-secret-service-protection-over-felony_uk_66669a78e4b0a01ba85b4f00", "domain": "huffingtonpost.co.uk", "domain_classification": "Unknown", "message": "LOADING ERROR LOADINGAs an ex-president now with a felony on his record, Donald Trump would lose his Secret Service protection or the usual perks, like an office, of post-White House life under bills sponsored by two House Democrats.\nThompson’s bill, introduced in April, would stop Secret Service protection for a protectee when they are sentenced for a state or federal crime that carries a penalty of at least one year in prison.\nIt would not affect any of the other post-presidency perks Trump enjoys.\n“President Trump is now a convicted felon, further emphasising why taxpayers shouldn’t have to foot the bill to honour him,” Sanchez said in a statement to HuffPost.\nAsked if he will reintroduce his bill next year if Democrats win the House in November, Thompson hedged."}, {"id": "2db20610-720e-4aa5-ab09-3f455dd9dfaa", "title": "Reasi Terror Attack : Pakistan Establishment Upset With Desperation of Lashkar and JeM ? ", "date": "2024-06-10 08:00", "url": "https://www.news18.com/india/exclusive-reasi-terror-attack-pakistan-establishment-upset-with-desperation-of-lashkar-and-jem-8927396.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "The Pakistan establishment is upset with terror groups like the Lashkar-e-Toiba and Jaish-e-Mohammad following the terror attack on a bus carrying pilgrims in Jammu and Kashmir’s Reasi, top police sources have told CNN-News18.\nEarlier, CNN-News18 had reported that the attack was a desperate attempt by TRF to prove their presence in the field.\nSources told CNN-News18 that the Reasi terror attack was a desperate attempt to revive terrorism in Jammu and Kashmir.\nA National Investigation Agency (NIA) team has been dispatched to help local authorities investigate Sunday’s terror attack.\nA CCTV footage showing the moments leading up to the Reasi terror strike in Jammu and Kashmir has also emerged."}, {"id": "225ccc9a-2dd7-4f96-b82b-5badc03534ba", "title": "Rangoon bomb kills one and wounds one", "date": "2024-06-10 14:30", "url": "https://karennews.org/2011/12/rangoon-bomb-kills-one-and-wounds-one/", "domain": "karennews.org", "domain_classification": "Unknown", "message": "A bomb exploded near the busy Hle Dan junction in Rangoon at 11am this morning killing one and wounding pedestrians.\nAn eyewitness spoke to Karen News (under the condition of anonymity) said the bomb exploded at a public toilet close to Hle Dan junction.\n“The bomb explosion killed one woman and an injured man was taken to Yangon Hospital.\nThe bomb ripped apart the roof of the toilet.”The Burmese based 7Days News Journal reported that security officers sources claimed two women were killed and one man wounded.\nAt the time of writing it was still unknown who is responsible for the bombing."}, {"id": "f9a1d6ef-3184-4283-ab95-8c546447fb39", "title": "Roster Doctor : Liverpool FC Squad Needs , Attackers Edition", "date": "2024-06-10 07:15", "url": "https://liverpooloffside.sbnation.com/2024/6/10/24174812/liverpool-squad-needs-attackers-edition-epl-salah-nunez-jota-diaz-barcelona-transfer-klopp-slot", "domain": "liverpooloffside.sbnation.com", "domain_classification": "Unknown", "message": "We finish our look at Liverpool’s squad as constructed with the attack.\nAs injuries beset the squad, including Mo’s absence first for the African Cup of Nations and then due to an injury sustained while at that tournament, teams also found ways to counter Liverpool’s attack.\nAnd so Liverpool’s hopes for more silverware beyond the magical, youth-buoyed League Cup win, evaporated along with the goals.\nWhen Mo was out, the team became incredibly dependent on Darwin to stretch defenses and to keep opposing backlines honest.\nThere’s a giant, looming question in the form of Mo Salah that needs to be answered in short order."}, {"id": "344c0c48-aa43-45ab-85e4-f4c6f90d6edb", "title": "Missiles Launched by Houthis Damage 2 Cargo Ships in Gulf of Aden", "date": "2024-06-10 06:30", "url": "https://sputnikglobe.com/20240610/missiles-launched-by-houthis-damage-2-cargo-ships-in-gulf-of-aden---centcom-1118887831.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240610/missiles-launched-by-houthis-damage-2-cargo-ships-in-gulf-of-aden---centcom-1118887831.htmlMissiles Launched by Houthis Damage 2 Cargo Ships in Gulf of Aden - CENTCOMMissiles Launched by Houthis Damage 2 Cargo Ships in Gulf of Aden - CENTCOMSputnik InternationalYemen's rebel Ansar Allah movement, also known as the Houthis, attacked two cargo ships in the Gulf of Aden with anti-ship missiles, the US Central Command (CENTCOM) said on Monday, adding that the ships stayed afloat after reporting damage.\n2024-06-10T05:14+00002024-06-10T05:14+00002024-06-10T05:14+0000worldmiddle eastyemengulf of adenadenhouthius central command (centcom)houthiscargo shipred sea crisishttps://cdn1.img.sputnikglobe.com/img/07e8/02/13/1116878808_0:160:3072:1888_1920x0_80_0_0_714a08abc3c821e742475350dc02b0d0.jpg\"In the past 24 hours, Iranian-backed Houthis launched two anti-ship ballistic missiles (ASBM) from Houthi controlled areas of Yemen into the Gulf of Aden.\nOne ASBM struck M/V Tavvishi, a Liberian-flagged, Swiss owned and operated container ship … Separately, Iranian-backed Houthis launched one ASBM and one anti-ship cruise missile (ASCM) into the Gulf of Aden.\nBoth missiles struck M/V Norderney, an Antigua and Barbados flagged, German owned and operated cargo ship,\" the command said in a statement on X.\nThe US military also destroyed one \"uncrewed aerial system,\" two cruise missiles and one missile launcher in Houthi-controlled areas of Yemen, the statement read."}, {"id": "1e7cad51-d61d-401c-9365-4b2f6af2c2c7", "title": "Ivan Yakovina : Putin , Lukashenka Preparing Flareup In Baltic Region", "date": "2024-06-10 09:30", "url": "https://charter97.org/en/news/2024/6/10/598322/", "domain": "charter97.org", "domain_classification": "Unknown", "message": "Ivan Yakovina: Putin, Lukashenka Preparing Flareup In Baltic Region 22 10.06.2024, 7:5524,846There are signs of preparation.\nI think that Putin is going to supply Lukashenka with cruise missiles, some kind of Oniks.\nThey won't even be needed in the war that Putin has planned against the Baltic states.\nThat is, the preparation of Vladimir Putin and his ally Aliaksandr Lukashenka for some very serious flareup in the Baltic region, I believe, is undoubtedly [ongoing].\nAnd without the United States, NATO will not do much in the Baltic region, it will simply not be able to."}, {"id": "f4bc278b-68d1-4be3-957b-9554c24b3b8d", "title": "  Ultimate surprise : How an Israeli raid freed 4 hostages and killed scores of Palestinians in Gaza", "date": "2024-06-10 14:30", "url": "https://www.independent.co.uk/news/ap-palestinians-doctors-without-borders-hamas-gaza-strip-b2559522.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nBy the time it was over, four Israeli hostages had been brought home alive and mostly unscathed, at least physically, and at least 274 Palestinians, and an Israeli commando, had been killed.\nHere's how it unfolded, according to the Israeli military and Palestinian witnesses.\nIsraeli intelligence figured out where they were and commandos spent weeks practicing the raid on life-size models of the buildings, according to Rear Adm. Daniel Hagari, the Israeli military spokesman.\nThe Gaza Health Ministry said 274 Palestinians were killed and around 700 were wounded."}, {"id": "9e241338-71b7-485f-bb0e-52611bf06304", "title": "By the time it was over , four Israeli hostages had been brought home alive and mostly unscathed , at least physically , and at least 274 Palestinians , and an Israeli commando , had been killed . ", "date": "2024-06-10 08:15", "url": "https://indianexpress.com/article/world/israeli-raid-freed-hostages-killed-palestine-9382830/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "By the time it was over, four Israeli hostages had been brought home alive and mostly unscathed, at least physically, and at least 274 Palestinians, and an Israeli commando, had been killed.\nA woman works at a ruined home, in the aftermath of Israeli strikes in the area, where Israeli hostages were rescued on Saturday (Reuters)Here's how it unfolded, according to the Israeli military and Palestinian witnesses.\nIsraeli intelligence figured out where they were and commandos spent weeks practicing the raid on life-size models of the buildings, according to Rear Adm. Daniel Hagari, the Israeli military spokesman.\nPeople walk among debris, aftermath of Israeli strikes at the area, where Israeli hostages were rescued on Saturday.\nThe Gaza Health Ministry said 274 Palestinians were killed and around 700 were wounded."}, {"id": "e9e92e0d-a45e-4c62-8ef3-adbbc19ab8a4", "title": "The Terrorism Warning Lights Are Blinking Red Again", "date": "2024-06-10 05:15", "url": "https://www.foreignaffairs.com/united-states/terrorism-warning-lights-are-blinking-red-again", "domain": "foreignaffairs.com", "domain_classification": "Unknown", "message": "That success—as well as the United States’ failure to prevent 9/11—offers valuable lessons for modern policymakers.\nTHE LOGIC OF THE THREATIdentifying terrorist threats involves identifying motive, means, and opportunity—the three key elements in any criminal investigation.\nLast year, hundreds of individuals on the United States’ terrorist watch list attempted to enter the country via the southern border.\nThe group, which again rules Afghanistan after two decades of war with the United States, considers ISIS-K an adversary.\nThe United States should likewise work with Pakistan, where ISIS-K also operates, to neutralize the group."}, {"id": "1b67cc9a-df64-4933-8e2d-1bae2c06eebe", "title": "  Ultimate surprise : How an Israeli raid freed 4 hostages and killed scores of Palestinians in Gaza", "date": "2024-06-10 00:15", "url": "https://www.ksat.com/news/world/2024/06/09/ultimate-surprise-how-an-israeli-raid-freed-4-hostages-and-killed-scores-of-palestinians-in-gaza/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Palestinians look at the aftermath of the Israeli bombing in Nuseirat refugee camp, Gaza Strip, Saturday, June 8, 2024.\nRecommended VideosBy the time it was over, four Israeli hostages had been brought home alive and mostly unscathed, at least physically, and at least 274 Palestinians, and an Israeli commando, had been killed.\nHere's how it unfolded, according to the Israeli military and Palestinian witnesses.\nIsraeli intelligence figured out where they were and commandos spent weeks practicing the raid on life-size models of the buildings, according to Rear Adm. Daniel Hagari, the Israeli military spokesman.\nThe Gaza Health Ministry said 274 Palestinians were killed and around 700 were wounded."}, {"id": "a20daf3c-fe5c-4201-9da5-a8730fbb2376", "title": "  Ultimate surprise : How an Israeli raid freed 4 hostages and killed scores of Palestinians in Gaza - Boston News , Weather , Sports", "date": "2024-06-10 05:30", "url": "https://whdh.com/news/ultimate-surprise-how-an-israeli-raid-freed-4-hostages-and-killed-scores-of-palestinians-in-gaza/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "By the time it was over, four Israeli hostages had been brought home alive and mostly unscathed, at least physically, and at least 274 Palestinians, and an Israeli commando, had been killed.\nFor Palestinians, it was a day of horror that sent hundreds of dead and wounded flooding into already beleaguered hospitals.\nHere’s how it unfolded, according to the Israeli military and Palestinian witnesses.\nIsraeli intelligence figured out where they were and commandos spent weeks practicing the raid on life-size models of the buildings, according to Rear Adm. Daniel Hagari, the Israeli military spokesman.\nThe Gaza Health Ministry said 274 Palestinians were killed and around 700 were wounded."}, {"id": "b1ee0d85-02f4-4113-b214-99ea5dcb7d5b", "title": "Iran - backed terrorist missiles damage ships in the Red Sea , Gulf of Aden", "date": "2024-06-10 14:30", "url": "https://jcpost.com/posts/cc0fed9b-decb-4a8f-ba6c-cc9e3dca780c", "domain": "jcpost.com", "domain_classification": "Unknown", "message": "The second missile was successfully destroyed by a coalition ship.\nSeparately, Iranian terrorists launched one ballistic missile and one anti-ship cruise missile (ASCM) into the Gulf of Aden.\nBoth missiles struck M/V Norderney, an Antigua and Barbados flagged, German owned and operated cargo ship.\nAdditionally, U.S. forces successfully destroyed one drone over the Gulf of Aden.\nLater, US forces successfully destroyed two Houthi land attack cruise missiles (LACM) and one missile launcher in Houthi-controlled areas of Yemen."}, {"id": "5ee14db3-1241-4799-b999-cf1649f588da", "title": "5 injured in stabbing in north Austin", "date": "2024-06-10 05:00", "url": "https://www.yahoo.com/news/5-injured-stabbing-north-austin-030858913.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "AUSTIN (KXAN) — Five people were taken to the hospital Sunday night after a stabbing in north Austin, according to the Austin Police Department.\nPolice said officers responded to a shoot/stab call at 8:42 p.m. at an apartment complex on North Lamar Boulevard.\nThe five victims were taken to hospitals with non-life-threatening injuries.\nPolice did not confirm if a suspect was in custody, but they did say the victims all knew the suspect.\nFor the latest news, weather, sports, and streaming video, head to KXAN Austin."}, {"id": "3526cca8-0c1b-4d9e-a5f1-81230e5584a1", "title": "Ukraine may keep some F - 16 jets abroad to protect them from Russian strikes", "date": "2024-06-10 13:00", "url": "https://www.edp24.co.uk/news/national/24377349.ukraine-may-keep-f-16-jets-abroad-protect-russian-strikes/", "domain": "edp24.co.uk", "domain_classification": "Unknown", "message": "Belgium, Denmark, the Netherlands and Norway have committed to providing Ukraine with over 60 US-made F-16 fighter jets to help it fend off Russian attacks.\nUkrainian pilots are currently undergoing training to fly the warplanes ahead of the deliveries expected to start later this year.\nUkrainian forces are fully in control of the situation in the Sumy region.\nIt is not clear how many Ukrainian air bases can meet those requirements, and Russia would be certain to quickly target a few that could accommodate them once the jets arrive.\nIn the latest strike, Ukrainian forces hit Russian air defence systems in Dzhankoy, Chornomorske and Yevpatoriya in the Moscow-occupied Crimea with missiles, Ukraine’s General Staff said."}, {"id": "71bcd44e-5ee9-457a-afca-914f857e4e5a", "title": "How an Israeli raid freed 4 hostages and killed at least 274 Palestinians in Gaza", "date": "2024-06-10 06:30", "url": "https://www.wfmz.com/news/how-an-israeli-raid-freed-4-hostages-and-killed-at-least-274-palestinians-in-gaza/article_37279db4-db03-560a-9ea4-f05c8ce13283.html", "domain": "wfmz.com", "domain_classification": "Unknown", "message": "Allentown, PA (18103)TodayMostly sunny to start, then partly to mostly cloudy in the afternoon with a few sprinkles, especially in the Poconos; a bit breezy..TonightBecoming mostly clear; cool and comfortable."}, {"id": "f28120bb-6f62-4ab7-8b12-d0bebce2ce8b", "title": "Abuja - based pastor abducted by suspected gunmen", "date": "2024-06-10 02:00", "url": "https://punchng.com/abuja-based-pastor-abducted-by-suspected-gunmen/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "A pastor known only as Àjàyí, based in Abuja, was reportedly kidnapped by suspected kidnappers from the El-Rufai Estate in the Bwari Area Council of the Federal Capital Territory.\nThe abduction occurred after a period of relative peace experienced by the residents, following a recent series of kidnappings in the FCT.\nBut they had already abducted the pastor before fleeing,” El-Ameen told our correspondent.\nBut since the FCT minister brought more security personnel to the area, we have not seen any incidents of the Tuesday attack.\nCalls and messages to its spokesperson, Josephine Adeh, remained unanswered as of the time this report was filed."}, {"id": "c50e1112-788e-4334-88b9-137791727183", "title": "70 - year - old man stabbed in  revenge  in Delhi , accused held | Delhi News", "date": "2024-06-10 03:30", "url": "https://timesofindia.indiatimes.com/city/delhi/70-year-old-man-stabbed-in-revenge-in-delhi-accused-held/articleshow/110857907.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "NEW DELHI: A 42-year-old man has been arrested for allegedly stabbing a 70-year-old at his Shastri Nagar residence in north Delhi.\nDuring the analysis of CCTVs footage, it was found that the suspect had removed his helmet at Karnal Road, and his photo was extracted, the DCP said.\n\"We were able to zero in on him, and raids were conducted at his possible hideouts, but he was found absconding.\nHe claimed the elderly frequently mistreated her over minor shortcomings and faults.\n\"Motivated by a desire for revenge, the accused attacked him with a sharp knife, then fled the scene on a friend's scooter,\" the officer added."}, {"id": "6c5a6bca-d365-4ca9-a253-c96d7f37012a", "title": "Ukraine war briefing : Ukrainian intelligence  strikes Su - 57 warplane deep inside Russia  | Ukraine", "date": "2024-06-10 00:30", "url": "https://www.theguardian.com/world/article/2024/jun/10/ukraine-war-briefing-ukrainian-intelligence-strikes-su-57-warplane-deep-inside-russia", "domain": "theguardian.com", "domain_classification": "International", "message": "Ukraine’s forces have hit an advanced Su-57 warplane on an airbase in Russia nearly 600km from the frontlines, according to Ukrainian military intelligence.\nThe strike took place on Saturday at the Akhtubinsk base in southern Russia, the GUR said.\nFor its part, the Russian defence ministry said its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nRussian forces appeared to be making headway in their assault on the strategic Ukrainian town of Chasiv Yar, according to reports on Sunday from both sides.\nUkrainian media outlet Ukrainska Pravda quoted a military source and a blogger as saying that Russian forces had begun occupying a district of Chasiv Yar alongside a canal."}, {"id": "f3ca258a-c4a6-469c-9719-bc03d858b86d", "title": "Hamas Says More Than 200 Killed As Israel Rescues Four Gaza Hostages", "date": "2024-06-10 05:30", "url": "https://menafn.com/1108313300/Hamas-Says-More-Than-200-Killed-As-Israel-Rescues-Four-Gaza-Hostages", "domain": "menafn.com", "domain_classification": "Unknown", "message": "They had been kidnapped from the Nova festival during Hamas's October 7 surprise attack that sparked war with Israel, now in its ninth month.\nThere are now 116 hostages remaining in Gaza, including 41 the army says are dead.\nThe Hamas media office said“the number of victims from the Israeli occupation's massacre in the Nuseirat camp has risen to 210 martyrs and more than 400 wounded”.\nIsrael accuses Hamas and its allies in Gaza of using civilian infrastructure, including UN-run facilities, as operational centres - charges the militants deny.\nIn Gaza City, five people were killed overnight when an Israeli warplane bombed the Mhana family home, emergency services said."}, {"id": "4c193223-e561-450a-a8b0-9dfec7ff262b", "title": "Ukraine may keep some F - 16 jets abroad to protect them from Russian strikes", "date": "2024-06-10 12:30", "url": "https://www.lancashiretelegraph.co.uk/news/national/24377349.ukraine-may-keep-f-16-jets-abroad-protect-russian-strikes/", "domain": "lancashiretelegraph.co.uk", "domain_classification": "Unknown", "message": "Belgium, Denmark, the Netherlands and Norway have committed to providing Ukraine with over 60 US-made F-16 fighter jets to help it fend off Russian attacks.\nUkrainian pilots are currently undergoing training to fly the warplanes ahead of the deliveries expected to start later this year.\nUkrainian forces are fully in control of the situation in the Sumy region.\nIt is not clear how many Ukrainian air bases can meet those requirements, and Russia would be certain to quickly target a few that could accommodate them once the jets arrive.\nIn the latest strike, Ukrainian forces hit Russian air defence systems in Dzhankoy, Chornomorske and Yevpatoriya in the Moscow-occupied Crimea with missiles, Ukraine’s General Staff said."}, {"id": "b9c0dfd2-de6f-4018-bf60-ca341b9feef8", "title": "Ukraine Says It Struck A Top Fighter Plane Deep Inside Russia – 710am KURV", "date": "2024-06-10 02:00", "url": "https://www.kurv.com/ukraine-says-it-struck-a-top-fighter-plane-deep-inside-russia/", "domain": "kurv.com", "domain_classification": "Unknown", "message": "If confirmed, it would mark Ukraine’s first known successful strike on a twin-engine Su-57 stealth jet, lauded as Moscow’s most advanced fighter plane.\nBut the airstrip’s distance from Ukraine, as well as unofficial comments from Russia, point to the likely use of Ukrainian-made drones.\nSince Moscow’s full-scale invasion more than two years ago, Kyiv has ramped up domestic drone production and used the munitions to strike deep inside Russia.\nThe ministry on Saturday claimed its forces downed three Ukrainian drones in the Astrakhan region, home to the Akhtubinsk airstrip.\nAccording to an update by Pepel (Ashes), a channel run by Belgorod journalists now based outside Russia, Ukrainian drones on Sunday afternoon struck an ammunition depot outside the town of Rakitnoye, some 35 kilometres (22 miles) from Ukraine."}, {"id": "9527309e-6b5e-47f0-b53b-e8a1a2909573", "title": "Ukraine says it struck a top fighter plane deep inside Russia", "date": "2024-06-10 01:15", "url": "https://www.virginislandsdailynews.com/ap/international/ukraine-says-it-struck-a-top-fighter-plane-deep-inside-russia/article_bd70daf6-f2d7-57a4-836f-390757f61172.html", "domain": "virginislandsdailynews.com", "domain_classification": "Unknown", "message": "Ukraine says its forces have hit an ultra-modern Russian warplane stationed on an air base nearly 370 miles from the front lines"}, {"id": "88f8ef8b-4ccf-4ac3-b948-36e3857d5dbf", "title": "US In A Quality Vs Quantity Drone Warfare Dilemma", "date": "2024-06-10 07:00", "url": "https://menafn.com/1108313570/US-In-A-Quality-Vs-Quantity-Drone-Warfare-Dilemma", "domain": "menafn.com", "domain_classification": "Unknown", "message": "The US is now actively seeking private partners to develop a large drone capable of performing multifaceted missions including reconnaissance, surveillance, security, attack, precision strike and intelligence collection, Breaking Defense reported .\nThe US Army's request for information, open until July 7, reflects a willingness to consider various options, the Breaking Defense report said.\nThose changes are seen in the discontinuation of the Future Attack Reconnaissance Aircraft (FARA) program and a gradual reduction in the use of smaller drone fleets.\nThe US Army has yet to officially announce if the new drone program aims to address the capability gap left by FARA's cancellation.\nSome analysts believe it may result in procuring more existing drones like the MQ-1C or developing new alternatives."}, {"id": "6a996671-0172-4166-8460-58b99755a9e7", "title": "  The killing and oppression in Gaza has to stop : Mass opposition to anti - democratic order to break University of California strike", "date": "2024-06-10 08:00", "url": "https://www.wsws.org/en/articles/2024/06/10/lggu-j10.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "A section of the picket line at University of California Santa Cruz, May 20, 2024Are you a UC academic worker?\nTo join the fight for rank-and-file committees and the expansion of the UC strike, fill out the form at the end of this article.\nThe strikebreaking order issued by a California judge last Friday has provoked broad opposition from University of California academic workers, who are determined to continue their historic walkout to stop the US-backed genocide in Gaza and the police crackdown on campus protests.\nUnder immense pressure from rank-and-file workers, however, the UAW has not made any public statements as of this writing on whether it will bow to the illegitimate injunction.\nThis means breaking the information blackout on the UC strike by the UAW apparatus, which has done nothing to inform UAW members about the decisive struggle."}, {"id": "6c708d6a-d943-4dcf-b73e-9b2302f2b1bd", "title": "Slovak PM suffers shock election defeat after assassination bid", "date": "2024-06-10 03:15", "url": "http://www.jordantimes.com/news/world/slovak-pm-suffers-shock-election-defeat-after-assassination-bid", "domain": "jordantimes.com", "domain_classification": "Unknown", "message": "Fico’s left-wing nationalist Smer-SD Party expressed “congratulations to the winner of the election, Progressive Slovakia” and its new European parliament members, on its Facebook page.\nProgressive Slovakia (PS) won 27.81 per cent of the votes in Sunday’s election, meaning six seats in the European Parliament, according to results widely reported in Slovak media ahead of their official publication.\nSmer-SD won 24.76 per cent, yielding it five seats in the 720-member EU assembly.\nPS Chairman Michal Simecka, a former vice-president of the European Parliament, said voters had a sent “a very important message to this government: slow down, because you cannot do whatever you want”.\nTurnout was higher than during previous EU elections in the country at just under 35 per cent."}, {"id": "4e0b0936-b47e-4499-87bb-8269548051cb", "title": "Palestinians recall horrors  not even in nightmare after Nuseirat refugee camp attacks", "date": "2024-06-10 02:15", "url": "http://www.china.org.cn/world/2024-06/10/content_117245248.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器Wounded people are seen after Israeli attacks in the Nuseirat refugee camp in the central Gaza Strip on June 8, 2024.\n(Photo by Marwan Daoud /Xinhua)Pedestrians can hardly walk through the streets of the Nuseirat refugee camp in central Gaza Strip on Sunday, which has been transformed overnight into a devastated area with the smell of death.\nEverything was normal: passers-by and vendors in the street, children playing in the sun, but everything changed in an instant,\" recalled Othman Zaki, a resident of the Nuseirat camp.\n\"Suddenly, Israeli planes started bombing violently everywhere.\nThis photo taken on June 8, 2024 shows buildings and vehicles damaged during Israeli attacks in the Nuseirat refugee camp in the central Gaza Strip."}, {"id": "06b06e91-5ca1-4bc7-a2ff-6e6eeb2cb7e9", "title": "A Giant IUD Lands in DC as Senate Blocks Contraception Access Bill", "date": "2024-06-10 00:00", "url": "https://hyperallergic.com/923478/a-giant-iud-lands-in-dc-as-senate-blocks-contraception-access-bill/", "domain": "hyperallergic.com", "domain_classification": "Unknown", "message": "Installed by Americans for Contraception (AFC), a campaign advocating for contraceptive access across the country, the lavender IUD is set to pop up in various states where birth control access is most at risk.\nWith a majority 51–39 tally, the bill that would have prevented states from passing restrictive legislation on hormonal and non-hormonal contraceptive access was only nine votes shy of moving forward.\nOnly two Senate Republicans voted in support of the bill, while nine Republicans and one Democrat didn’t show up to vote at all.\nEqual parts flexible and formidable, the lavender IUD commanded attention in Americans for Contraception’s bid to raise awareness surrounding flippant attitudes to the threat to contraceptive access.\nSome Senate Republicans criticized the Democratic party for pushing the Right to Contraception Act, claiming that there was no risk to contraceptive access and that Democrats were using the bill to stoke fear in voters."}, {"id": "d902942b-965c-4192-9b91-29ea0fc90c55", "title": "Man stabbed during fight at Goshen bar", "date": "2024-06-10 04:00", "url": "https://wsbt.com/news/local/man-stabbed-during-fight-at-goshen-bar", "domain": "wsbt.com", "domain_classification": "Unknown", "message": "Sunday morning, just after midnight, officers responded to the report of a possible stabbing at Crazyman's in Goshen.\nUpon arrival, officers found a 24-year-old male with a minor stab wound.\nHe was transported to the hospital with non-life-threatening injuries.\nDuring the investigation, officers learned the 24-year-old instigated a fight with a 37-year-old male, which resulted in the wound."}, {"id": "62eb78d8-1865-4c5e-abde-5ca4e7eb0e96", "title": "  I should be dead : Gazans recall chaos of Israeli hostage rescue raid", "date": "2024-06-10 07:30", "url": "https://dunyanews.tv/en/World/817515-%5C", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "'I should be dead': Gazans recall chaos of Israeli hostage rescue raidWorld World 'I should be dead': Gazans recall chaos of Israeli hostage rescue raidBombs were raining down and turning the Nuseirat refugee camp into \"smoke and flames\".\n'NO ONE COULD MOVE'Eyewitnesses said the Israeli raid and retreat were covered by heavy air strikes as well as drone and tank fire.\nSeveral told AFP they had seen bodies in the streets, which AFP could not independently verify.\nThe militants also took about 251 hostages, of whom 116 hostages now remain in Gaza, although the army says 41 of them are dead.\nAlaa al-Khatib, a displaced woman living in the camp, told AFP she was walking to a market when she saw people climbing out of a refrigerated truck and exiting a small white car."}, {"id": "2409b962-a137-4e28-a506-67c0c6f51eb2", "title": "Sudan fighting shuts last hospital in Darfur city : MSF", "date": "2024-06-10 12:30", "url": "https://www.hurriyetdailynews.com/sudan-fighting-shuts-last-hospital-in-darfur-city-msf-197260", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Sudan fighting shuts last hospital in Darfur city: MSFDARFURThe last operating hospital in western Sudan's El-Fasher has been closed after an attack by paramilitaries trying to seize the key Darfur city, medical charity Doctors Without Borders has said.\nMSF said that \"intensified fighting\" around the hospital earlier this week had triggered its evacuation, and by the time of the paramilitary attack \"there were only 10 patients and a reduced medical team\" there.\n\"Most patients and the remaining medical team... were able to flee the RSF shooting,\" MSF added.\nMichel-Olivier Lacharite, head of emergencies at MSF, said it was \"outrageous that the RSF opened fire inside the hospital\".\nThe war across Sudan has killed tens of thousands of people, including up to 15,000 in a single West Darfur town, U.N. experts say."}, {"id": "ee6464b6-a75c-4b93-bc46-8865a6f25860", "title": "Russia is attempting to protect a vital bridge and supply line with a set of barges , united kingdom intelligence says", "date": "2024-06-10 05:00", "url": "https://www.yahoo.com/news/russia-attempting-protect-vital-bridge-040105200.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia is attempting to protect a vital bridge and supply line with a set of barges, UK intelligence saysRussia is attempting to protect a vital bridge and supply line with a set of barges, UK intelligence saysRussia is fortifying the Kerch Bridge with barges, says the UK's defense ministry.\nRussia is shoring up the defenses for the Kerch Bridge with barges, the UK's defense ministry said on Saturday.\n\"Analysis of imagery has identified the installation of eight barges on the southern side of the Kerch Bridge,\" the UK's defense ministry wrote in its intelligence dispatch.\nThis isn't the first time barges have been placed near the bridge, which connects Russia to occupied Crimea, per the UK's defense ministry.\nRepresentatives for Russia's defense ministry did not immediately respond to a request for comment from Business Insider sent outside regular business hours."}, {"id": "8ee1052a-5186-48c9-82c1-5b221594947b", "title": "Russia is attempting to protect a vital bridge and supply line with a set of barges , united kingdom intelligence says", "date": "2024-06-10 06:00", "url": "https://www.yahoo.com/news/russia-attempting-protect-vital-bridge-040105675.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia is attempting to protect a vital bridge and supply line with a set of barges, UK intelligence saysRussia is attempting to protect a vital bridge and supply line with a set of barges, UK intelligence saysRussia is fortifying the Kerch Bridge with barges, says the UK's defense ministry.\nRussia is shoring up the defenses for the Kerch Bridge with barges, the UK's defense ministry said on Saturday.\n\"Analysis of imagery has identified the installation of eight barges on the southern side of the Kerch Bridge,\" the UK's defense ministry wrote in its intelligence dispatch.\nThis isn't the first time barges have been placed near the bridge, which connects Russia to occupied Crimea, per the UK's defense ministry.\nRepresentatives for Russia's defense ministry did not immediately respond to a request for comment from Business Insider sent outside regular business hours."}, {"id": "065bd2d1-e478-48d0-aa64-4bcbfefeaef9", "title": "NPFL : Rangers , Enyimba Oriental Derby Ends in Confusion in Enugu – THISDAYLIVE", "date": "2024-06-10 03:30", "url": "https://www.thisdaylive.com/index.php/2024/06/09/npfl-rangers-enyimba-oriental-derby-ends-in-confusion-in-enugu/", "domain": "thisdaylive.com", "domain_classification": "Unknown", "message": "The ‘Top of the Table’ clash was a good advertisement for the domestic league as it witnessed a capacity crowd.\nStarTimes, the exclusive broadcaster of the NPFL, aired the match live on its Beta Sports channel 244.\nThe hosts seized momentum from the blast of kickoff, looking more adventurous but visiting Enyimba were equal to the task as they thawed their chances for an early goal.\nAbia Warriors played goalless with visiting Bendel Insurance as Bayelsa United rallied back from two goals down to pick a draw against visiting Sporing Lagos.\nHeartland of Owerri won 3-1 against Doma United while Sunshine Stars of Akure were two nil better against visiting Akwa United."}, {"id": "5b92aeb4-d403-4049-b8ad-091f1d0578aa", "title": "Authorities Identify 77 - Year - Old Man Killed in Suburban Chicago Home Explosion", "date": "2024-06-10 06:00", "url": "https://www.theepochtimes.com/us/authorities-identify-77-year-old-man-killed-in-suburban-chicago-home-explosion-5665644", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "LAKE ZURICH, Ill.—Authorities released the name of a 77-year-old man who was found dead after a house exploded in suburban Chicago on Tuesday.\nThe Lake County Coroner’s Office identified the man as Timothy Toczylowski on Friday evening.\nFirst responders found the home leveled after the explosion at about 8:30 p.m. Tuesday in Lake Zurich, according to the Lake County sheriff’s office.\nTiffany Koch told WLS-TV that she heard the explosion, ran outside, and saw the nearby house burning.\nThe coroner’s office said Friday the cause of the explosion remains under investigation."}, {"id": "6a511e43-bdc1-4a69-878a-4be685c8bd02", "title": "US confirms Houthi strikes on two ships in Gulf of Aden", "date": "2024-06-10 04:15", "url": "https://www.yasstribune.com.au/story/8657707/us-confirms-houthi-strikes-on-two-ships-in-gulf-of-aden/?cs=14264", "domain": "yasstribune.com.au", "domain_classification": "Unknown", "message": "The Houthis control the most populous parts of Yemen and have attacked merchant ships since November in solidarity with Palestinians in Gaza.\nThe militants have sunk one ship, seized a different vessel and killed three crew members in a another attack."}, {"id": "bc06bbf0-3774-44ab-b24f-096303d24496", "title": "Shiga man arrested for stabbing probation officer to death", "date": "2024-06-10 09:30", "url": "https://www.japantimes.co.jp/news/2024/06/10/japan/crime-legal/probation-officer-killed/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "The Shiga Prefectural Police have placed a 35-year-old man under arrest on suspicion of murdering his 60-year-old probation officer last month.\nKohei Iitsuka, 35, from the city of Otsu in the prefecture, had been under probation following a conviction for a convenience store robbery.\nHe was supervised by Hiroshi Shinjo, a 60-year-old restaurant owner and probation officer.\nIitsuka was placed under arrest on Saturday for allegedly killing Shinjo by repeatedly stabbing him in the upper body with a knife at the latter’s home in the city at some point between 7:00 p.m. on May 24 and 4:00 p.m. on May 26.\nHe was sent to prosecutors on Monday."}, {"id": "ef1d0348-12cd-431c-a355-fce52aaf510b", "title": "North Korea vows response to South  psychological warfare  – DW – 06 / 10 / 2024", "date": "2024-06-10 05:00", "url": "https://www.dw.com/en/north-korea-vows-response-to-souths-psychological-warfare/a-69318182", "domain": "dw.com", "domain_classification": "International", "message": "In a tit-for-tat move, South Korea restarted loudspeaker propaganda broadcasts along the border with the North in response to Pyongyang's trash-carrying balloons.\nThe sound of the loudspeakers is believed to travel more than 20 kilometres (12.4 miles) into North Korea.\nYoon is seen as pursuing a tougher line on North Korea compared to his predecessors.\nIn recent years, North Korea has ramped up weapons testing, including missile and satellite launches.\nSome experts have speculated North Korea would continue to escalate tensions until the US presidential election this November."}, {"id": "07ed58d2-21a3-4bbf-b370-d7b20b13b3b8", "title": "US and Filipino forces end war drills that tested their endurance in brutal heat and shifty weather", "date": "2024-06-10 13:15", "url": "https://www.yahoo.com/news/us-filipino-forces-end-war-125525046.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The combat exercises, Cazarez said, were integrated in annual U.S.-Philippine army joint exercises called Salaknib for the first time this year.\nThe temperature this year had been exacerbated by the El Nino, an occasional warming of the Pacific that shifts global weather patterns.\nPhilippine army Maj. Gen. Andrew de Lara Costelo said the combat drills were designed to allow U.S. and Philippine forces and potentially other allies to operate seamlessly in future contingencies.\nThe Philippine military says the military drills didn't target any country and served to deter aggression.\nChina had warned that the increased U.S. military presence would “drag the Philippines into the abyss of geopolitical strife.”"}, {"id": "8d20c61f-c1fc-41e9-b6d3-16dade29ed2b", "title": "US and Filipino forces end drills that tested their endurance in brutal heat and volatile weather", "date": "2024-06-10 14:30", "url": "https://www.startribune.com/us-and-filipino-forces-end-war-drills-that-tested-their-endurance-in-brutal-heat-and-shifty-weather/600372341/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "The large-scale battle drills, which have been held in Hawaii in recent years under the U.S. Army's Joint Pacific Multinational Readiness Center, have been introduced in the Philippines this year.\nThe combat exercises, Cazarez said, were integrated in annual U.S.-Philippine army joint exercises called Salaknib for the first time this year.\nAbout 1,500 U.S. and Filipino soldiers participated in the new battle drills staged in a hinterland in Fort Magsaysay, a sprawling Philippine army camp in an agricultural region known for its scorching weather.\nPhilippine army Maj. Gen. Andrew de Lara Costelo said the combat drills were designed to allow U.S. and Philippine forces and potentially other allies to operate seamlessly in future contingencies.\nThe Philippine military says the military drills didn't target any country and served to deter aggression."}, {"id": "81248573-d946-4485-95ff-edc5b0d83327", "title": "US and Filipino forces end drills that tested their endurance in brutal heat and volatile weather", "date": "2024-06-10 14:30", "url": "https://www.clickorlando.com/news/world/2024/06/10/us-and-filipino-forces-end-war-drills-that-tested-their-endurance-in-brutal-heat-and-shifty-weather/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "The combat exercises, Cazarez said, were integrated in annual U.S.-Philippine army joint exercises called Salaknib for the first time this year.\nThe temperature this year had been exacerbated by the El Nino, an occasional warming of the Pacific that shifts global weather patterns.\nPhilippine army Maj. Gen. Andrew de Lara Costelo said the combat drills were designed to allow U.S. and Philippine forces and potentially other allies to operate seamlessly in future contingencies.\nThe Philippine military says the military drills didn't target any country and served to deter aggression.\nChina had warned that the increased U.S. military presence would “drag the Philippines into the abyss of geopolitical strife.”"}, {"id": "d87c485e-627f-4ce2-9699-a3944fdb32e6", "title": "How to watch CoD Next 2024 : Black Ops 6 event date , streams , more", "date": "2024-06-10 01:00", "url": "https://www.destructoid.com/how-to-watch-cod-next-2024-black-ops-6-event-date-streams-more/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "CoD Next is back for a third consecutive year and is set to give fans an in-depth look at Call of Duty: Black Ops 6.\nDuring the CoD Direct, Treyarch dropped a boatload of information about the campaign, multiplayer, and zombies.\nKey highlights included 16 new multiplayer maps, a new omnidirectional movement system, two round-based zombies maps, and a spy action thriller campaign set in a post-cold war landscape in 1991.\nHow to watch CoD Next 2024CoD Next 2024 will be streamed on the official Call of Duty YouTube and Twitch channels.\nCoD Next 2024 will most likely follow a similar format and provide gameplay footage from some of the 16 new multiplayer maps."}, {"id": "b459c953-ef1b-4fa5-b6f8-53e8f6118cba", "title": "How a  loudspeaker battle  is flaring up between North and South Korea", "date": "2024-06-10 14:30", "url": "https://www.firstpost.com/explainers/how-a-loudspeaker-battle-is-flaring-up-between-north-and-south-korea-13780949.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "In a response to North Korea’s trash-filled balloon campaign, South Korea has begun broadcasting anti-Pyongyang messages, international news, K-pop and more over loudspeakers.\nThe loudspeaker battleThe conflict began when South Korea on Sunday resumed broadcasting anti-North Korean propaganda through loudspeakers in border areas which reportedly included news, criticism about North Korea’s government, and South Korean pop music.\nSouth Korean media reported another activist group also flew balloons with 200,000 propaganda leaflets toward North Korea on Friday.\nIt said that any additional broadcasts are “entirely dependent on North Korea’s behaviour.”South Korea has accused North Korea of sending balloons filled with faeces and trash across the border.\nIn 2015, when South Korea resumed loudspeaker broadcasts after an 11-year hiatus, North Korea responded by firing artillery rounds across the border, leading to a brief exchange of fire, according to South Korean officials."}, {"id": "f3728612-402a-4879-92cd-a131bad33d1a", "title": "  AFU Warplane Hits Target in Russia for First Time – Ukraine at War Update for June 10", "date": "2024-06-10 03:45", "url": "https://www.kyivpost.com/post/34015", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "In Austria, the far right FPÖ (“Freedom Party”) narrowly won first place in EU parliamentary elections, with 25.5 percent of the vote.\nSky News: UAF hits target within Russia using a combat aircraft for the first timeSky News reported on Sunday, quoting an anonymous military source, that a Ukrainian warplane for the first time had struck a target within Russia.\nAdvertisement“This is the first UAF air-delivered munition delivered against a target within Russia,” the source said.\nThis reportedly was Russia’s fifth Ropucha-class landing ship to be “rendered unserviceable” by Ukrainian attacks.\n“This successful strike shows the Russians they cannot operate with freedom either in the Black Sea or eastward,” the source noted."}, {"id": "6c158dcc-9cf3-4d40-9c52-3dbfa34ee7fc", "title": "The German board game that changed the face of war", "date": "2024-06-10 00:30", "url": "https://www.yahoo.com/news/german-board-game-changed-face-060000787.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "This aborted invasion, like many of their plans, had been workshopped using Kriegsspiel (“war game”), a battle simulator.\nMost German officers thought it too radical to work, and those who supported it did so largely out of desperation – the Nazis were out of moves.\nA Kriegsspiel (\"war game\") session in progressKriegsspiel had been used by German strategists for nearly a century, but it was far older than that.\nHe used the game to plan a range of astonishing victories that united the first German Empire.\nIn late 1940, Hitler’s officers used it to plan their invasion of the Soviet Union."}, {"id": "0f031a3d-e4b8-458c-b9ad-1a911615283b", "title": "Killing Floor 3 Releases in Early 2025 for PS5 , Xbox Series X", "date": "2024-06-10 00:15", "url": "https://www.vgchartz.com/article/461388/killing-floor-3-releases-in-early-2025-for-ps5-xbox-series-xs-and-pc/", "domain": "vgchartz.com", "domain_classification": "Unknown", "message": "Killing Floor 3 Releases in Early 2025 for PS5, Xbox Series X|S, and PC - News/ 599 Viewsby, posted 15 hours agoTripwire Interactive has announced Killing Floor 3 will launch for the PlayStation 5, Xbox Series X|S, and PC via Steam and Epic Games Store in early 2025.\n\"We are incredibly excited for players to experience the action / horror world we are creating for Killing Floor III,\" said Tripwire Interactive creative director Bryan Wynia.\n\"Today we released our first gameplay trailer giving fans an extended look at the game that we’ve been busy developing, and the absolute carnage they can expect when Killing Floor III launches in early 2025!\"\nView the gameplay trailer below:Read details on the game below:Killing Floor III‘s gameplay trailer introduces the first three new playable Nightfall specialists including the highly-anticipated return of fan-favorite commando, Mr. Foster.\nThe Battle Begins with NightfallKilling Floor III is the next installment in the legendary co-op action/horror FPS series."}, {"id": "50f491db-b76f-480d-a60f-4e5de574c483", "title": "Research reveals carbon cost of Israel - Gaza war", "date": "2024-06-10 14:30", "url": "https://www.dezeen.com/2024/06/10/israel-gaza-war-carbon-cost/", "domain": "dezeen.com", "domain_classification": "Unknown", "message": "Researchers have estimated that rebuilding the damage caused in the first four months of the Israel-Gaza war will generate up to 60 million tonnes of CO2 equivalent.\nAccording to the paper, between 156,000 and 200,000 buildings in Gaza were destroyed in the first 120 days of the war.\nThe team also estimated the immediate carbon impact of the first 120 days of the Israel-Gaza war.\nAdditionally, the research analysed the carbon cost of war infrastructure and fortification constructed by Israel and Hamas in the 16 years prior to the 7 October assault, including the Hamas tunnel network and Israel's Iron Wall.\nThe paper acknowledged that not all carbon emissions related to the war were covered and that there were gaps in the data available, saying that analysis of a wider scope is needed."}, {"id": "4ba5af46-a7cb-40c2-9bfb-d57dfc003c5f", "title": "Pixel Persona - Like Demonschool Starts Semester Soon on PS5 , PS4", "date": "2024-06-10 07:45", "url": "https://www.pushsquare.com/news/2024/06/pixel-persona-like-demonschool-starts-semester-soon-on-ps5-ps4", "domain": "pushsquare.com", "domain_classification": "Unknown", "message": "Subscribe to Push Square on YouTube 145kPixel art Persona-like Demonschool tasks players with leading a team of teens into battle with demons.\nPlayers must balance this battle against evil while maintaining a demanding high school curriculum.\nSchool starts on September 13th on PS5 and PS4.\nCheck out a couple more trailers to better understand what's on offer.\nSubscribe to Push Square on YouTube 145k"}, {"id": "2c4ee26b-dead-4635-8c3a-6325bf94163a", "title": "Killing Floor 3 Trailer Sees Tripwire Unleash Fresh Hell on PS5 in 2025", "date": "2024-06-10 14:00", "url": "https://www.playstationlifestyle.net/2024/06/10/killing-floor-3-trailer-ps5-2025/", "domain": "playstationlifestyle.net", "domain_classification": "Unknown", "message": "Tripwire Interactive has revealed the first Killing Floor 3 trailer and set an early 2025 release window for the horror shooter sequel.\nKilling Floor 3 trailerKilling Floor III‘s gameplay trailer introduces the first three new playable Nightfall specialists.\nMaps in Killing Floor III come to life with new levels of verticality and traversability.\nKilling Floor III is the next installment in the legendary co-op action/horror FPS series.\nKilling Floor 3 will be on PS5, Xbox Series X|S, and PC via Steam and Epic Games Store."}, {"id": "b33e1dd8-76dc-4884-adac-458307743edc", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-06-10 03:30", "url": "https://www.tvguide.co.uk/schedule/79ea1820-7137-5600-8c4f-856baf3d75e5/combat-dealers", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Monday 10 June Share Add toCalendar +WWI Season 4 Episode 2 of 10 S SubtitlesBruce Crompton heads to Ypres in Belgium to look for items from the First World War and also goes for a ride in one of the first tanks ever used in combatCombat Dealers airs on Discovery Channel HD at 9:00 AM, Monday 10 June .\n(Subtitles.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual pageTopics Education ➝ Science ➝ Factual Topics Docu-soap"}, {"id": "a1d44b93-5a56-4e9b-95f8-3be0f79142e7", "title": "Opinion : Growing Defense Sovereignty Efforts Can Help Exports", "date": "2024-06-10 09:30", "url": "https://aviationweek.com/defense-space/supply-chain/opinion-growing-defense-sovereignty-efforts-can-help-exports", "domain": "aviationweek.com", "domain_classification": "Unknown", "message": "In theory, this could be bad for legacy defense exporters and for defense trade.\nIf a country has its own national fighter jet, it’s less likely to buy an imported Lockheed Martin F-35 or Dassault Rafale, right?\nSome of this boom in the defense trade, paradoxically, is due to the move toward sovereignty.\nThe shift toward defense autonomy is best illustrated by the number of national fighter jets in gestation.\nStrong defense trade growth reflects global demand."}, {"id": "1c8b8c41-cdd9-41b4-8f84-80045979a118", "title": "Russia Forcing African Migrants and Students to Fight in Ukraine", "date": "2024-06-10 06:15", "url": "https://www.businessinsider.com/russia-forcing-african-migrants-and-students-to-fight-in-ukraine-2024-6", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "Read previewRussia is forcing thousands of African migrants and students to join in their war efforts against Ukraine, Bloomberg reported on Sunday, citing assessments from European officials.\nAccording to Bloomberg's report, Russian officials have threatened not to renew the visas of African migrant workers and students if they didn't join the Russian Armed Forces.\nSome African workers have even been threatened with deportation if they do not agree to fight in Ukraine, one European official told Bloomberg.\nRussia's reliance on attrition warfare has seen it continually drawing on its prison population to fuel its war effort.\nRussia's prison population stood at 420,000 before the war."}, {"id": "a97418ab-089d-410d-bdf3-e9367206fb00", "title": "It not just convicts . Russia is forcing its African migrants and students to fight for them in Ukraine . ", "date": "2024-06-10 06:00", "url": "https://www.yahoo.com/news/not-just-convicts-russia-forcing-050807426.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia is forcing its African migrants and students to fight for them in Ukraine.\nRussia is forcing its African migrants and students to fight for them in Ukraine.\nRussia is replenishing its troops with an unlikely source — African migrants and students.\nRussia is forcing thousands of African migrants and students to join in their war efforts against Ukraine, Bloomberg reported on Sunday, citing assessments from European officials.\nSome African workers have even been threatened with deportation if they do not agree to fight in Ukraine, one European official told Bloomberg."}, {"id": "c3e7e2b6-7c6f-4d9e-b89d-f537828fe06c", "title": "Civilian defense chief ends decades - long  formalitie in armed forces", "date": "2024-06-10 09:00", "url": "https://www.globalsecurity.org/wmd/library/news/taiwan/2024/taiwan-240609-cna01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Civilian defense chief ends decades-long 'formalities' in armed forcesROC Central News Agency06/09/2024 03:38 PMTaipei, June 9 (CNA) Taiwan's new civilian Defense Minister Wellington Koo (éˇ§ç«‹é›„) has announced a decision to scrap a series of decades-old practices in the nation's armed forces viewed by many experts as mere \"formalities.\"\nThese moves are meant to make it easier for senior military personnel to take care of their families, according to Koo.\nIn addition, previously military personnel could only join group tours when they wished to travel aboard on vacation.\nThe ROC military's traditional bayonet training was originally established in 1965 by combining American and Japanese styles of bayonet charge practices.\nKoo, 65, succeeded his immediate predecessor Chiu Kuo-cheng (é‚±ĺś‹ć­Ł) on May 20 as President Lai Ching-te (čł´ć¸…ĺľ·) took office, becoming the first civilian defense minister in over a decade in Taiwan."}, {"id": "9d060b77-58f7-4321-a4a4-824b227ad86a", "title": "Russia Su - 75 Checkmate Stealth Fighter Nightmare Has Now Begun", "date": "2024-06-10 00:30", "url": "https://nationalinterest.org/blog/buzz/russias-su-75-checkmate-stealth-fighter-nightmare-has-now-begun-210472", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "Summary and Key Points: Russia's Su-75 Checkmate fighter jet, an ambitious project, faces challenges with high costs and unclear capabilities.\nThe Su-75 Checkmate fighter jet is one of the most ambitious Russian projects currently in the works.\nThe Su-75 CheckmateTo begin with, it is unclear whether the Su-75 Checkmate will be a stealth fighter jet.\nRight now, the Su-75 Checkmate program seems stuck in a mire of high costs and lack of funds.\nThe Su-75 Checkmate is still several years away, and if recent history is a guide, the Russian fighter jet will underperform the Kremlin’s fancy promises."}, {"id": "7b9127d7-43ea-4826-b2c9-d6e9c92e0fa3", "title": "Three Odd & Strange Camouflage Patterns Used By WWI Ships", "date": "2024-06-10 01:30", "url": "https://www.slashgear.com/1595023/unusual-camoflage-patterns-ww1-naval-vessels/", "domain": "slashgear.com", "domain_classification": "Unknown", "message": "Three Unusual Camouflage Patterns Used By WWI Naval VesselsMilitaries began using camouflage during World War I as the rise of aerial photography and trench warfare rose in popularity.\nMost camouflage used during World War I was found on vehicles and equipment, but soon after its introduction, people began wearing clothing to match their environments.\nThe world's militaries continued adapting and upgrading their camouflage patterns throughout the Great War and in various places where the conflict raged.\nIt was during WWI that militaries began experimenting with untraditional patterns, and despite the way they appeared, most of them worked rather well.\nThis is especially true of naval vessels that sported some of the oddest camo patterns in military history."}, {"id": "afc5c29f-4975-4040-9a73-c73996823f10", "title": "N . Korea sends more balloons as Kim Jong Un sister warns of  new counteraction  ", "date": "2024-06-10 06:30", "url": "https://economictimes.indiatimes.com/news/defence/n-korea-sends-more-balloons-as-kim-jong-uns-sister-warns-of-new-counteraction/articleshow/110864163.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community"}, {"id": "d8f5a34f-c3c5-4257-808d-4aa0df769134", "title": "North Korea sends more balloons as Kim sister warns of  new counteraction  ", "date": "2024-06-10 04:00", "url": "https://www.thehindu.com/news/international/north-korea-sends-more-balloons-as-kims-sister-warns-of-new-counteraction/article68272545.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "North Korea sent hundreds more trash-carrying balloons over the border, Seoul's military said on June 10, after Kim Jong Un's powerful sister warned of further responses if the South keeps up its \"psychological warfare\".\n\"The latest batch of waste-loaded balloons sent late Sunday contained scrap paper and plastic, with no toxic material detected so far,\" isaid, citing the Joint Chiefs of Staff.\n- 'Beyond our imagination' -The statement from Mr. Kim's sister shows that \"North Korea is raising its voice in order to shift the blame for the current situation to South Korea and also to justify their provocation,\" Kim Dong-yub, professor at the University of North Korean Studies in Seoul, told AFP.\nIt is likely that the cycle of escalation will continue and \"North Korea will do something beyond our imagination,\" Kim said.\nThe tit-for-tat balloon blitz started in mid-May when activists in the South — including North Korean defectors — sent dozens of missives carrying anti-Kim propaganda and flash drives of K-pop music northwards."}, {"id": "1657d9b8-0844-4eb4-91ae-f42af4abcd10", "title": "N Korea sends more balloons as Kim sister warns of  new counteraction  ", "date": "2024-06-10 04:15", "url": "https://www.hurriyetdailynews.com/n-korea-sends-more-balloons-as-kims-sister-warns-of-new-counteraction-197236", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "N Korea sends more balloons as Kim's sister warns of 'new counteraction'PYONGYANGNorth Korea sent hundreds more trash-carrying balloons over the border, Seoul's military said Monday, after Kim Jong Un's powerful sister warned of further responses if the South keeps up its \"psychological warfare.\"\nKim's sister and key government spokeswoman Kim Yo Jong said in a statement released early Monday that South Korea would \"suffer a bitter embarrassment of picking up waste paper without rest and it will be its daily work\".\n\"The latest batch of waste-loaded balloons sent late Sunday contained scrap paper and plastic, with no toxic material detected so far,\" Yonhap said, citing the Joint Chiefs of Staff.\nIt is likely that the cycle of escalation will continue and \"North Korea will do something beyond our imagination,\" Kim said.\nThe tit-for-tat balloon blitz started in mid-May when activists in the South — including North Korean defectors — sent dozens of missives carrying anti-Kim propaganda and flash drives of K-pop music northwards."}, {"id": "1a03dd31-0ef5-46fb-8a72-18169f163505", "title": "Armed conflicts in 2023 highest since end of WWII : study", "date": "2024-06-10 12:30", "url": "https://www.hurriyetdailynews.com/armed-conflicts-in-2023-highest-since-end-of-wwii-study-197269", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Armed conflicts in 2023 highest since end of WWII: studyOSLOMore armed conflicts took place worldwide in 2023 than any other year since the end of the Second World War, according to a Norwegian study published Monday.\nLast year saw 59 conflicts of which 28 were in Africa, the the Peace Research Institute of Oslo (PRIO) showed.\nBut the number of countries which experienced conflicts declined from 39 in 2022 to 34.\nWhile the number of combat deaths decreased last year, the accumulated number for the past three years is the highest for a three-year period in 30 years.\nA total of 28 armed conflicts were registered in Africa, followed by Asia with 17, the Middle East with 10, Europe with three and the Americas with one."}, {"id": "789c34e5-0e1b-4c61-8dbc-3417dba1b82e", "title": "Su - 35 Flanker - E : This Russian Fighter Jet Is a Real Powerhouse", "date": "2024-06-10 00:30", "url": "https://nationalinterest.org/blog/buzz/su-35-flanker-e-russian-fighter-jet-real-powerhouse-210058", "domain": "nationalinterest.org", "domain_classification": "Unknown", "message": "-The Russian defense industry is shifting focus to the Su-57, indicating the Su-35 has not met expectations.\nRussia's Su-35: Is the 'Fourth-Generation ++' Fighter Jet Falling Short?\nA supped-up variant of the Su-27, NATO has designated the Su-35 as the “Flanker-E.” The Russian defense community has claimed that the Su-35 is better than the US Air Force’s F-16.\nSome have even asserted that Flanker-E is comparable to America’s fifth-generation warplane, the F-35 Lightning II.\nSu-35 Flanker-E in Ukraine WarRussia’s Su-35 has faced the crucible of combat in the Ukraine War."}, {"id": "aa6a03e3-0fc2-4a90-a844-bd01c515cb27", "title": "Armed conflicts in 2023 highest since end of WWII study", "date": "2024-06-10 12:30", "url": "https://www.philstar.com/world/2024/06/10/2361834/armed-conflicts-2023-highest-end-wwii-study", "domain": "philstar.com", "domain_classification": "Unknown", "message": "Armed conflicts in 2023 highest since end of WWII — studySmoke plumes billow following Israeli bombardment in Gaza City on Oct. 11, 2023 on the fifth day of fighting between Israel and the Hamas movement.\nIsrael declared war on Hamas on October 8 following a shock land, air and sea assault by the Gaza-based Islamists.\nOSLO, Norway — More armed conflicts took place worldwide in 2023 than any other year since the end of the Second World War, according to a Norwegian study published Monday.\nLast year saw 59 conflicts of which 28 were in Africa, the the Peace Research Institute of Oslo (PRIO) showed.\nA total of 28 armed conflicts were registered in Africa, followed by Asia with 17, the Middle East with 10, Europe with three and the Americas with one."}, {"id": "2862770b-c760-474c-8cd9-999bf2655c31", "title": "On This Day : Lumière brothers introduced Autochrome Lumière , an early colour photography process in 1907", "date": "2024-06-10 03:45", "url": "https://in-cyprus.philenews.com/international/on-this-day-lumiere-brothers-introduced-autochrome-lumiere-an-early-colour-photography-process-in-1907/", "domain": "in-cyprus.philenews.com", "domain_classification": "Unknown", "message": "Following are some of the major events to have occurred on June 10:1619: The Battle of Záblatí, a pivotal moment in the Bohemian Revolt during the Thirty Years’ War, took place.\n1692: Bridget Bishop, the first person hanged during the Salem witch trials, was executed in Salem, Massachusetts.\n1719: A battle between British government forces and Jacobite rebels occurred at Glen Shiel, Scotland.\n1786: A massive landslide dam on the Dadu River in China collapsed after an earthquake, causing an estimated 100,000 deaths in Sichuan province.\n1907: The Lumière brothers introduced Autochrome Lumière, an early colour photography process."}, {"id": "39c85b95-bb72-443d-9946-23c045b860eb", "title": "IDF prepares for escalation with Hezbollah , northern enemies - Israel News", "date": "2024-06-10 00:15", "url": "https://www.jpost.com/israel-news/article-805627", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The IDF continued its effort to prepare its soldiers to defend the country, with two units about to complete their training.\n“We are essentially part of Artillery Brigade 282, expected to support Brigade 36 if there's a flare-up in the northern sector.\nIn Brigade 36, they claimed the capability to escalate combat intensity and fire on Hezbollah targets.\nOver the weekend, the IDF targeted and killed three Hezbollah militants in a vehicle and a hut.\nGallant emphasized the importance of continuing to eliminate Hezbollah terrorists and commanders, urging commanders to maintain offensive initiatives against Lebanon's terror targets."}, {"id": "2929d138-a5b5-4452-9438-e01f459a0b51", "title": "US and Filipino forces end drills that tested their endurance in brutal heat and volatile weather", "date": "2024-06-10 14:30", "url": "https://www.wgauradio.com/news/world/us-filipino-forces/5WSL6WRRBJJBPA3VOF4L5QJ7OM/", "domain": "wgauradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "4942a8e3-3255-4fdc-8df1-5d848796bef1", "title": "Call of Duty : Black Ops 6 announced", "date": "2024-06-10 03:00", "url": "https://www.newgamenetwork.com/news/22390/call-of-duty-black-ops-6-announced/", "domain": "newgamenetwork.com", "domain_classification": "Unknown", "message": "Call of Duty: Black Ops 6 announcedCampaign, zombies, and multiplayer will be includedActivision, and developers Treyarch and Raven Software, have announced Call of Duty: Black Ops 6.\nDevelopment on the Black Ops 6 Campaign is led by Raven Software, in partnership with Treyarch.\nUnlike the previous entry in the franchise, Call of Duty: Modern Warfare II and Modern Warfare III content will not carry forward to the Black Ops 6 Premium experience.\nCarry Forward content for players of Call of Duty: Warzone will continue, with Modern Warfare II, Modern Warfare III, and Black Ops 6 content being integrated with the arrival of Season 1.\nBlack Ops 6 is releasing worldwide on Friday, October 25 for PC, Xbox One, Xbox Series X|S, PS4, and PS5."}, {"id": "9917ed44-8213-44d2-976f-af16c017f1ac", "title": "Armed conflicts in 2023 highest since end of WWII : study", "date": "2024-06-10 12:30", "url": "https://www.bssnews.net/international/194378", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "OSLO, June 10, 2024 (BSS/AFP) - More armed conflicts took place worldwide in2023 than any other year since the end of the Second World War, according toa Norwegian study published Monday.\nLast year saw 59 conflicts of which 28 were in Africa, the the Peace ResearchInstitute of Oslo (PRIO) showed.\nBut the number of countries which experienced conflicts declined from 39 in2022 to 34.\n\"The figures suggest that the conflict landscape has become increasinglycomplex, with more conflict actors operating within the same country,\" sheexplained.\nA total of 28 armed conflicts were registered in Africa, followed by Asiawith 17, the Middle East with 10, Europe with three and the Americas withone."}, {"id": "afe8940c-390c-4a0e-bf36-630bedd1b712", "title": "F1 24 Debuts in 2nd on the New Zealand Charts", "date": "2024-06-10 00:15", "url": "https://www.vgchartz.com/article/461387/f1-24-debuts-in-2nd-on-the-new-zealand-charts/", "domain": "vgchartz.com", "domain_classification": "Unknown", "message": "F1 24 Debuts in 2nd on the New Zealand Charts - Sales/ 637 Viewsby, posted 15 hours agoF1 24 has debuted in second place on the New Zealand charts, according to IGEA for the week ending June 2, 2024.\nNBA 2K24 is up from seventh to first place, while Grand Theft Auto V and Hogwarts Legacy remained in third and fourth places, respectively.\nCall of Duty: Modern Warfare III dropped four spots to fifth place, Red Dead Redemption 2 re-entered the top 10 in sixth place, and Rugby 22 is up three spots to seventh place.\nEA Sports FC 24, Tom Clancy's Rainbow Six Siege, andIt Takes Two re-entered the top 10 in eighth, ninth, and 10th places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel."}, {"id": "2a653f9a-5b73-48a3-86f1-3bd2ac6833f0", "title": "F1 24 Debuts in 1st Place on the Australian Charts", "date": "2024-06-10 00:15", "url": "https://www.vgchartz.com/article/461386/f1-24-debuts-in-1st-place-on-the-australian-charts/", "domain": "vgchartz.com", "domain_classification": "Unknown", "message": "F1 24 Debuts in 1st Place on the Australian Charts - Sales/ 688 Viewsby, posted 15 hours agoF1 24 has debuted in first place on the Australian charts, according to IGEA for the week ending June 2, 2024.\nGrand Theft Auto V remained in second place, NBA 2K24 is up three spots to third place, and Red Dead Redemption 2 re-entered the top 10 in fourth place.\nEA Sports FC 24 is up from 10th to fifth place, while Paper Mario: The Thousand-Year Door in its second week dropped five spots to six place,Hogwarts Legacy re-entered the top 10 in seventh place and Call of Duty: Modern Warfare III fell four spots to eighth place.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel.\nYou can contact the author on Twitter @TrunksWD."}, {"id": "cd7bafea-26ee-47c7-942c-d6f65673b174", "title": "F1 24 Debuts in 2nd on the New Zealand Charts", "date": "2024-06-10 02:45", "url": "https://www.vgchartz.com/article/461387/new-zealand-weekly-week-22-2024/", "domain": "vgchartz.com", "domain_classification": "Unknown", "message": "F1 24 Debuts in 2nd on the New Zealand Charts - Sales/ 639 Viewsby, posted 15 hours agoF1 24 has debuted in second place on the New Zealand charts, according to IGEA for the week ending June 2, 2024.\nNBA 2K24 is up from seventh to first place, while Grand Theft Auto V and Hogwarts Legacy remained in third and fourth places, respectively.\nCall of Duty: Modern Warfare III dropped four spots to fifth place, Red Dead Redemption 2 re-entered the top 10 in sixth place, and Rugby 22 is up three spots to seventh place.\nEA Sports FC 24, Tom Clancy's Rainbow Six Siege, andIt Takes Two re-entered the top 10 in eighth, ninth, and 10th places, respectively.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel."}, {"id": "65f0cfd3-5ff4-4713-9270-67023e3bf781", "title": "F1 24 Debuts in 1st Place on the Australian Charts", "date": "2024-06-10 02:45", "url": "https://www.vgchartz.com/article/461386/australia-weekly-week-22-2024/", "domain": "vgchartz.com", "domain_classification": "Unknown", "message": "F1 24 Debuts in 1st Place on the Australian Charts - Sales/ 690 Viewsby, posted 15 hours agoF1 24 has debuted in first place on the Australian charts, according to IGEA for the week ending June 2, 2024.\nGrand Theft Auto V remained in second place, NBA 2K24 is up three spots to third place, and Red Dead Redemption 2 re-entered the top 10 in fourth place.\nEA Sports FC 24 is up from 10th to fifth place, while Paper Mario: The Thousand-Year Door in its second week dropped five spots to six place,Hogwarts Legacy re-entered the top 10 in seventh place and Call of Duty: Modern Warfare III fell four spots to eighth place.\nHe has expanded his involvement in the gaming community by producing content on his own YouTube channel and Twitch channel.\nYou can contact the author on Twitter @TrunksWD."}, {"id": "c5ed09f6-0391-4524-ad58-6ff3bb377513", "title": "The World at War - Yesterday", "date": "2024-06-10 10:15", "url": "https://www.tvguide.co.uk/schedule/2ffab86e-3a48-524f-aaaa-a32c080d18cc/the-world-at-war", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "The World at WarYesterday 4:00 PM to 5:00 PM Monday 10 June Share Add toCalendar +Alone Season 1 Episode 4 of 27 S SubtitlesThe drop in morale of Churchill's forces following the fall of France to Nazi forces during the Second World War, and how the Dunkirk evacuation and the Battle of Britain helped to restore British confidence.\nPlus, America's reasons for initially refusing to enter the conflictThe World at War airs on Yesterday at 4:00 PM, Monday 10 June .\n(Subtitles.)\nTopics News ➝ Current Affairs Documentary"}, {"id": "9717cb44-5411-4e49-b9d0-7e5165f98dd7", "title": "Gruesome Tactical RPG  Demonschool  Finally Gets A Switch Release Date In September", "date": "2024-06-10 02:30", "url": "https://www.nintendolife.com/news/2024/06/gruesome-tactical-rpg-demonschool-finally-gets-a-switch-release-date-in-september", "domain": "nintendolife.com", "domain_classification": "Unknown", "message": "Subscribe to Nintendo Life on YouTube 768kFollowing a delay that pushed it out of 2023 into this year, tactical RPG Demonschool is finally coming to Switch (and other platforms) on 13th September — appropriately, it's a Friday.\nIf you're unfamiliar, Demonschool is coming from developer Necrosoft Games (Hyper Gunsport) and blends school life into a tactical RPG with Italian horror cinema vibes and Nintendo DS-inspired visuals.\nThere's a bit of Persona and Shin Megami Tensei in there, but it's wrapped up in a package that feels pretty unique.\nStrategize on tactics gameplay influenced by Into the Breach and painted in the hues of JRPG classics like Shin Megami Tensei and Persona.\nSeptember can't come soon enough — let us know below if you're similarly taken with Demonschool."}, {"id": "4b4ee2be-7ea6-42f1-beba-14cbe9f1715b", "title": "Video Game News , Reviews , Walkthroughs And Guides | GamingBolt", "date": "2024-06-10 02:45", "url": "https://gamingbolt.com/page/5436", "domain": "gamingbolt.com", "domain_classification": "Unknown", "message": "There would be only a few people who don't know anything about video games and those who know even a bit about games the few of the very first name they'll be able to recall would be street fighter .\n... Read More"}, {"id": "22f1660d-aed5-4022-b08b-b0184ff1f782", "title": "Demonschool release date set for September , new trailer", "date": "2024-06-10 00:00", "url": "https://nintendoeverything.com/demonschool-release-date-set-for-september-new-trailer/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "We’ve been waiting to hear about the release date for Demonschool, and today, publisher Ysbryd Games and developer Necrosoft shared that information.\nOriginally announced in 2022, Demonschool is a school-life tactics RPG with hints of Persona, Shin Megami Tensei, and Italian horror cinema.\nStrategize on tactics gameplay influenced by Into the Breach and painted in the hues of JRPG classics like Shin Megami Tensei and Persona.\nWe’re looking forward to seeing new ideas we haven’t even thought of play out on the battlefield!”Find a new release date trailer for Demonschool below.\nRelease Date TrailerYou can keep an eye on our coverage of Demonschool here."}, {"id": "b685fd28-735f-462a-a219-0eed67919dc5", "title": "Israel Hamas War News Live Updates : UN food agency pauses aid work at US pier in Gaza over security concerns", "date": "2024-06-10 03:30", "url": "https://timesofindia.indiatimes.com/world/middle-east/israel-palestine-war-news-live-updates-gaza-rafah-lebanon-june-10-june-11/liveblog/110855427.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "14:28 (IST) Jun 10A senior Hamas official urged the United States on Monday to pressure Israel to end the war in Gaza, ahead of the planned visit on Monday by US Secretary of State Antony Blinken to the region to push forward ceasefire efforts.Blinken is set to visit Egypt and Israel on Monday.\nHe also aims to ensure the war does not expand into Lebanon.\n\"We call upon the US administration to put pressure on the occupation to stop the war on Gaza and the Hamas movement is ready to deal positively with any initiative that secures an end to the war,\" senior Hamas official Sami Abu Zuhri said.In his eighth visit to the region since Hamas militants attacked Israel on Oct. 7, triggering the bloodiest episode in the decades-long Israeli-Palestinian conflict, Blinken is also set to travel to Jordan and Qatar this week.He is set to meet with Egyptian President Abdel Fattah al-Sisi in Cairo before traveling to Israel later on Monday, where he will meet with Prime Minister Benjamin Netanyahu and Defence Minister Yoav Gallant, according to a State Department schedule.On Monday, Palestinian residents said tanks had been trying to thrust deeper towards the north in the early hours of Monday, edging Shaboura, one of the most densely populated and militant stronghold neighborhoods at the heart of the city.Israeli tank forces have since seized Gaza's entire border strip with Egypt running through Rafah to the Mediterranean coast and invaded many districts of the city of 280,000 residents, prompting around one million displaced people who had been sheltering in Rafah to flee elsewhere."}, {"id": "e4d0129c-7926-48ad-859a-5ee39546d5c1", "title": "ESR | June 10 , 2024 | The war in Gaza : Can contemporary international law cope with today terror ? ", "date": "2024-06-10 07:45", "url": "http://www.enterstageright.com/archive/articles/0624/asymwarlaw.html", "domain": "enterstageright.com", "domain_classification": "Unknown", "message": "The war in Gaza: Can contemporary international law cope with today's terror?\nOver the years, the international community has updated international law by adopting several counter-terror conventions aimed at addressing contemporary issues of terror, whether this be terror against and aboard aircraft, airports, and maritime navigation, terror against diplomats and internationally protected persons, terror involving the taking of hostages, nuclear terror, and state-funded terror.\nThis lacuna amplifies the need to adapt international humanitarian law to the conflict scenarios of today's world realities.\nThis is particularly evident in the response of the international community to Israel's engagement in combat with such terror organizations.\nTerror groups and their state sponsors manipulate and abuse the United Nations, its related organs, human rights, and international humanitarian law bodies."}, {"id": "2cc695e2-9d18-4fc8-b398-611ac0f50145", "title": "Biden And Macron Bow To Zelensky At D - Day Event | Armstrong Economics", "date": "2024-06-10 05:30", "url": "https://www.armstrongeconomics.com/world-news/war/biden-and-macron-bow-to-zelensky-at-d-day-event/", "domain": "armstrongeconomics.com", "domain_classification": "Unknown", "message": "Spread the loveUS President Joe Biden met with Ukrainian President Volodymyr Zelensky to once again discuss America’s role in funding Ukraine’s war with Russia.\nBiden publicly apologized to Zelensky for delaying the $61 billion aid package, as US Senators have stalled the bill in a failed attempt to coerce Biden to invest in his own country.\nThe entire D-Day memorial was shamefully transformed into a public spectacle to promote the West’s war against Russia.\nPresident Macron of France was also on board with celebrating a future Ukrainian victory rather than honoring the troops in attendance.\nThese world leaders are keen on ushering in World War III regardless of the will of the people."}, {"id": "399681d9-433f-4b70-bf95-2f32246bda23", "title": "N Korea sends more balloons , warns of  new counteraction  ", "date": "2024-06-10 07:30", "url": "https://www.rte.ie/news/2024/0610/1453920-korea-balloons/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "The powerful sister of North Korean leader Kim Jong Un has warned of a new response against South Korea if the South continued with loudspeaker broadcasts and allowing leaflet balloon flights amid simmering tensions.\nSigns that North Korea was installing its own loudspeakers have been detected, the Joint Chiefs of Staff said, adding that South Korea does not plan to operate its loudspeakers today.\nNorth Korea on Saturday launched about 330 balloons with rubbish attached; about 80 of them landed over the border, South Korea's military said.\nSouth Korea's broadcasts include world news and information about democratic and capitalist society, with a mix of popular K-pop music.\nThe sound is believed to travel more than 20 kilometres into North Korea, though some analysts say their actual reach is much less."}, {"id": "c626fdc6-d6b4-4436-b40f-9325a26d3fe7", "title": "North Korea threatens South with daily trash duty  without rest  from balloons", "date": "2024-06-10 05:00", "url": "https://www.scmp.com/news/asia/east-asia/article/3265999/north-korea-threatens-south-daily-trash-duty-without-rest-balloons", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "In recent weeks, North Korea has sent hundreds of balloons into the South , carrying trash like cigarette butts and toilet paper, in what it calls retaliation for balloons laden with anti-Pyongyang propaganda floated northwards by activists in the South, which Seoul legally cannot stop.\nSouth Korean soldiers wearing protective gear check trash from a balloon presumably sent by North Korea earlier this month in Incheon.\nThe cycle of escalation is likely to continue and “North Korea will do something beyond our imagination,” Kim said.\nSouth Korean soldiers prepare a propaganda loudspeaker near the border with North Korea in Paju on Sunday.\n“North Korea may have already miscalculated, as South Korea’s democracy cannot simply turn off NGO balloon launches the way an autocracy would expect.”"}, {"id": "bf1987a3-d45e-4e47-a3be-aa4f18f7b330", "title": "North Korea sends more balloons as Kim sister warns of  new counteraction  ", "date": "2024-06-10 03:30", "url": "https://www.channelnewsasia.com/east-asia/north-korea-sends-more-ballons-kim-jong-yo-kim-jong-un-sister-warns-new-counteraction-4398881", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "SEOUL: North Korea sent hundreds more trash-carrying balloons over the border, Seoul's military said on Monday (Jun 10), after Kim Jong Un's powerful sister warned of further responses if the South keeps up its \"psychological warfare\".\nSeoul's military said the North had sent more than 300 trash-carrying balloons overnight, but that the winds had not worked in Pyongyang's favour.\n\"Although they launched over 310 balloons many of them flew toward North Korea,\" the Joint Chiefs of Staff (JCS) said, adding that around 50 had landed in the South so far, with more expected.\n\"So far we haven't seen any special movement within the North Korean military,\" a JCS official said, adding that they had \"detected signs of North Korea installing loudspeakers to broadcast to the South in the front area\".\nNorth Korea has also used its own loudspeakers along the border since the 1960s, typically broadcasting praise of the Kim family, but it suspended them in 2018 as ties warmed."}, {"id": "076b8e06-a724-4d5c-bbe8-34eef93002fe", "title": "North Korea sent excrement balloons . South Korea response : Blasting BTS hits", "date": "2024-06-10 12:00", "url": "https://www.livemint.com/global/north-korea-sent-excrement-balloons-south-korea-s-response-blasting-bts-hits-11718018113917.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "SEOUL—After enduring days of balloon bombardment from the Kim Jong Un regime, South Korea countered with an airwaves assault of its own: blaring the chart-topping hits of boyband BTS.\nStarting late last month, the Kim regime flew into South Korea more than a thousand massive balloons carrying bags of trash and excrement.\nThen, on Thursday, a South Korean activist group floated balloons containing anti-regime leaflets and foreign media into the North.\nWithin hours, Kim’s younger sister, Kim Yo Jong, North Korea’s go-to critic of the U.S. and South Korea, warned of a “new counteraction\" should the unwelcomed transmissions continue.\nSouth Korea chose not to broadcast anything on Monday, though could resume at a moment’s notice."}, {"id": "9e5eefe3-e143-4467-9687-2a882b31e97e", "title": "He helped bring back American POWs in Normandy . 80 years later , he got married there", "date": "2024-06-10 04:00", "url": "https://www.tpr.org/military-veterans-issues/2024-06-09/he-helped-bring-back-american-pows-in-normandy-80-years-later-he-got-married-there", "domain": "tpr.org", "domain_classification": "Unknown", "message": "Eighty years later, Terens returned to the region in northern France with another mission at hand — to tie the knot with his sweetheart Jeanne Swerlin.\n\"I am blessed that I am going to be married to the beautiful girl that she is.\n\"Congratulations to the newlyweds,\" Macron said as the crowd of prominent French figures, celebrities and business leaders cheered for Terens and Swerlin.\nOn D-Day in 1944, Terens was in England working on radios and helping repair planes for battle.\nTwelve days later, he volunteered to go to Normandy and help bring back American and British prisoners of war, who were previously held in German camps."}, {"id": "74d9b2b4-6a61-4a29-ad58-e97a439e3ed0", "title": "How Will AI Change War ? - Bloomberg", "date": "2024-06-10 06:30", "url": "https://www.bloomberg.com/opinion/features/2024-06-09/how-will-ai-change-war", "domain": "bloomberg.com", "domain_classification": "International", "message": "Why did this happen?\nPlease make sure your browser supports JavaScript and cookies and that you are not blocking them from loading.\nFor more information you can review our Terms of Service and Cookie Policy."}, {"id": "673a4a75-cb23-42f8-bf13-adbded4d8926", "title": "U . S . Navy Cruiser Countdown The U . S . Navy cruisers will all be gone before 2027 is over . Here the order in which theyll go . ", "date": "2024-06-10 04:30", "url": "https://freerepublic.com/focus/f-news/4243311/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "U.S. Navy’s Cruiser Countdown The U.S. Navy’s cruisers will all be gone before 2027 is over.\nby 2 posted onby laplata (They want each crisis to take the greatest toll possible.)\nTo: Morgie56; rlmorel*by 3 posted onby Chode (there is no fall back position, there's no rally point, there is no LZ... we're on our own.\nby 4 posted onby Sequoyah101 (The Government that got us in this mess is not the Government that can get us out of it.)\nby 7 posted onby laplata (They want each crisis to take the greatest toll possible.)"}, {"id": "7726fe92-086d-4a27-a6d8-a98b874740fc", "title": "INTO THE FRAY : Fickle Feckless France - Egalite , Fraternite … ANTISEMITISME | The Jewish Press - JewishPress . com | Dr . Martin Sherman | 4 Sivan 5784 – Monday , June 10 , 2024", "date": "2024-06-10 03:45", "url": "https://www.jewishpress.com/indepth/columns/into-the-fray-martin-sherman/into-the-fray-fickle-feckless-france-egalite-fraternite-antisemitisme/2024/06/10/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "AdvertisementThe latest surge in antisemitic sentiment has once more pushed the issue of Judeophobia to the epicenter of public debate.\nGallic gallIn recent decades, the focus of anti-Jewish bias has shifted from the Jewish individual to the Jewish collective-i.e.\nThis sense of anti-Israel animosity is reflected in the perceptions of France by the Israeli public.\nIndeed, as the NYT sardonically commented: France provided no specifics to support the allegation which Azerbaijan vehemently denies.\nIndeed, last week, France barred Israeli participation in a premier arms exhibition, yet welcomed countries with more-than-questionable democratic/humanitarian credentials…including Turkey, Saudi Arabia, and China!!"}, {"id": "254e419e-70eb-4f18-9c29-a5cf784a6e4d", "title": "Biden warns of isolationism at war cemetery that Trump skipped", "date": "2024-06-10 04:00", "url": "https://www.japantimes.co.jp/news/2024/06/10/world/politics/biden-isolationism-war-cemetery/", "domain": "japantimes.co.jp", "domain_classification": "Local - Asia", "message": "U.S. President Joe Biden warned against the rise of isolationism in the U.S. while visiting an American military cemetery in France that his predecessor, Donald Trump, famously skipped six years ago.\nThe World War I-era Aisne-Marne American Cemetery is the final resting place for soldiers who fought in the deadliest U.S. Marine Corps battle until then, Biden said, and he could not fathom \"the idea that I’d come to Normandy and not make the short trip here to pay tribute.”The U.S. president didn’t name Trump during a brief discussion with reporters after a wreath-laying ceremony and declined to answer a question about his expected 2024 opponent, but his target was unmistakable."}, {"id": "18e78a6f-0a1b-4afd-a931-4e90804153d6", "title": "US in Gaza ceasefire push with UN vote , Mideast tour", "date": "2024-06-10 05:00", "url": "https://www.yahoo.com/news/us-gaza-ceasefire-push-un-041812837.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Gantz, a former army chief, criticised Netanyahu especially for failing to outline a post-war governance plan for Gaza, arguing that tough decisions are needed to achieve \"real victory\".\nThe latest clashes follow major combat and heavy airstrikes during Saturday's hostage rescue mission in the Nuseirat camp.\nEU foreign policy chief Josep Borrell welcomed the hostage rescue but also demanded that \"the bloodbath must end immediately\".\nAfter Saturday's rescue mission, 116 hostages remain in Gaza, although the army says 41 of them are dead.\nIn Egypt, Blinken was also expected to speak to Sisi about solutions to open the key crossing into Gaza at Rafah."}, {"id": "429dc894-e40a-4144-9be6-844bd9584560", "title": "US top diplomat deployed as pressure mounts on Israel to accept ceasefire", "date": "2024-06-10 08:00", "url": "https://www.thejournal.ie/us-top-diplomat-deployed-as-pressure-mounts-on-israel-to-accept-ceasefire-6404309-Jun2024/", "domain": "thejournal.ie", "domain_classification": "Unknown", "message": "THE UNITED STATES is stepping up pressure today for a Gaza ceasefire with a call for a UN Security Council vote on a truce as it redeployed Washington’s top diplomat to the region scarred by eight months of war.\nWashington sought to bring a ceasefire closer by tabling a draft resolution at the United Nations, calling for an “immediate ceasefire with the release of hostages” between Israel and militant group Hamas.\nA staunch ally of Israel, the United States has been widely criticised for having blocked several earlier UN draft resolutions calling for a halt to the fighting.\nPressure is mounting over Netanyahu’s failure to return remaining hostages and the departure of Gantz from the war cabinet marked a major political blow.\nHamas has insisted on a permanent truce and full Israeli withdrawal from all parts of Gaza – demands that Israel has firmly rejected."}, {"id": "1230f7b5-514b-433e-bdca-05c4451518a8", "title": "Morale : Russian Soldiers Refuse Death in Ukraine", "date": "2024-06-10 06:00", "url": "http://www.strategypage.com/%5Chtmw%5Chtmoral%5Carticles%5C202406090548.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "No one knows exactly how many Russian soldiers have been shot dead by their officers for refusing to fight or for trying to walk away from the fighting.\nRussia conscripts a quarter million young Russian men each year for one year of conscript service.\nThis forced the government to spend a lot more money to get more nominally volunteer contract soldiers by forcing men with prior military service, and many with none, into the military as better paid contract soldiers.\nThis worked initially until reports of the high casualty rates of contract soldiers in Ukraine became widely known.\nPay for contract soldiers was competitive with similar jobs, which was not a bad deal when there was not a war going on in Ukraine."}, {"id": "ddb40296-a43a-4485-a683-2efdc87dbe11", "title": "If You Only Check Out One Game From Today Xbox Showcase , Please Make It This New Turn - Based RPG", "date": "2024-06-10 03:15", "url": "https://www.kotaku.com.au/2024/06/clair-obscur-expedition-33-xbox-games-showcase-trailer/", "domain": "kotaku.com.au", "domain_classification": "Unknown", "message": "Today’s Xbox Games Showcase was bursting at the seams with global premieres, but while plenty of the titles that finally got to see the light of day were already on the cards (or leaked), we did get a brand new title nobody was expecting: Clair Obscur: Expedition 33.\nThe nearly three-minute long Clair Obscur: Expedition 33 reveal trailer dropped during the Xbox Games Showcase explores a world where a being known as the Paintress “repaints” the world every year.\nThe first Clair Obscur: Expedition 33 trailer gave us a good look at the combat and world exploration, and much to my delight – it’s turn-based combat with real time elements to really change things up.\nSandfall Interactive’s debut title, published by Kepler Interactive, is set to launch in 2025 on Xbox Seires X|S and will be available from day one on Xbox Game Pass.\nWhile today’s trailer focused on the Xbox release, the website seems to suggest we’ll be getting a PC launch for Clair Obscur: Expedition 33 via Steam as well as a PlayStation release."}, {"id": "299fbe34-5d4a-443d-9ba3-5df10560673e", "title": "Daniel Weiss Obituary - Naperville , IL", "date": "2024-06-10 14:30", "url": "https://www.chicagotribune.com/obituaries/daniel-a-weiss-naperville-il/", "domain": "chicagotribune.com", "domain_classification": "Unknown", "message": "Weiss, Daniel A., 1st Lt. 25, served as a Rifle Platoon Leader in Attack Company, 2nd Battalion, 75th Ranger Regiment.\nSubsequently, he received his commission as an Infantry Officer, serving as a Rifle Platoon Leader in Afghanistan with the 1-17 Infantry, 5th Stryker Brigade Combat Team.\nFollowing combat, he was assigned as a Rifle Platoon Leader in Attack Company.\nHis awards and decorations include US Army Ranger Course and Airborne School, the Army Commendation Medal, Army Achievement Medal, National Defense Service Medal, Afghanistan Campaign Medal, Global War on Terror Service Medal, Army Service Ribbon, Overseas Service Ribbon, the NATO Medal, Combat Infantryman’s Badge, Expert Infantryman’s Badge, Ranger Tab, and Airborne Wings.\nFriedrich-Jones Funeral Home & Cremation Services 44 South Mill St, Naperville, IL 60540 (630) 355 – 0213 www.friedrichjones.com"}, {"id": "4d71b5ff-b5a0-4682-8aa9-9a96a36734c1", "title": "N . Korea sends more balloons as Kim sister warns of  new counteraction  ", "date": "2024-06-10 08:00", "url": "https://www.gjsentinel.com/news/national/n-korea-sends-more-balloons-as-kims-sister-warns-of-new-counteraction/article_950183db-5295-50c6-b5a5-c73d88b68ec3.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "Seoul's military said the North had sent more than 300 trash-carrying balloons overnight, but that the winds had not worked in Pyongyang's favour"}, {"id": "b66ad156-62ef-4a34-b430-d953c475d763", "title": "6 / 10 / 24 National Security and Korean News and Commentary", "date": "2024-06-10 14:30", "url": "https://smallwarsjournal.com/blog/61024-national-security-and-korean-news-and-commentary", "domain": "smallwarsjournal.com", "domain_classification": "Unknown", "message": "The Cries of Byai Phu (Myanmar, north Korea, Ukraine, Gaza, and Anti-semitism and Israel)3.\nIsrael's special forces hostage rescue was aided by US intelligence, report says9.\nIsrael's special forces hostage rescue was aided by US intelligence, report says12.\nInside Israel’s hostage rescue: Secret plans and a deadly ‘wall of fire’13.\nNorth Korea Sent Excrement Balloons."}, {"id": "baea5e7a-0145-400e-904f-9a0a477a40a7", "title": "Turkiye First Foray Into Tank - Building : What We Know About the Altay MBT", "date": "2024-06-10 09:00", "url": "https://www.globalsecurity.org/wmd/library/news/turkey/2024/turkey-240608-sputnik01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Turkiye's Defense Industry Agency recently announced the start of mass production of the new Altay main battle tank.\nThe Turkish tank is equipped with South Korean-designed composite armor and Aselsan AKKOR active protection.\nThe MKE 120 mm laser-guided smoothbore gun is the tank's main armament.\nThe Turkish tank has a stated on road/off road performance of 70 and 45 km per hour, respectively, and an operational range of 450 km before refueling.\nBefore building the Altay, Turkiye spent decades relying on American M48 and M60 tanks, and West German Leopard 1 and Leopard 2 MBTs."}, {"id": "f77a28d9-26e6-4cd2-9b99-968e1dd92d3d", "title": "US steps up pressure for Gaza ceasefire", "date": "2024-06-10 12:00", "url": "https://www.euractiv.com/section/global-europe/news/us-steps-up-pressure-for-gaza-ceasefire/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "The United States stepped up pressure Monday (10 June) for a Gaza ceasefire with a call for a UN Security Council vote on a truce as it redeployed Washington’s top diplomat to the region scarred by eight months of war.\nWashington sought to bring a ceasefire closer by tabling a draft resolution at the United Nations, calling for an “immediate ceasefire with the release of hostages” between Israel and militant group Hamas.\nAfter Saturday’s rescue operation, 116 hostages remain in Gaza, although the army says 41 of them are dead.\nHamas has insisted on a permanent truce and full Israeli withdrawal from all parts of Gaza — demands that Israel has firmly rejected.\nIsrael’s retaliatory military offensive has killed at least 37,084 people in Gaza, also mostly civilians, according to the territory’s health ministry."}, {"id": "86f87e73-f658-49c6-972a-02a54f0f47ca", "title": "Diablo 4 : Vessel of Hatred release date | When is the expansion coming ? ", "date": "2024-06-10 12:30", "url": "https://www.radiotimes.com/technology/gaming/diablo-4-expansion-release-date/", "domain": "radiotimes.com", "domain_classification": "Unknown", "message": "Read on for all of the information you need on Vessel of Hatred.\nMore like thisDiablo IV: Vessel of Hatred will be released on Tuesday 8th October 2024.\nWhat’s included in Diablo 4: Vessel of Hatred?\nOn top of the new region of Sanctuary called Nagantu, Vessel of Hatred will also include the debut of a new character class called the Spiritborn.\nThe Spiritborn in Diablo IV: Vessel of Hatred."}, {"id": "e79a6a96-a223-41fe-b43e-e0f0861384e1", "title": "Benny Gantz quits war cabinet as Israeli government unified front crumbles – The Forward", "date": "2024-06-10 11:00", "url": "https://forward.com/fast-forward/620989/benny-gantz-quits-war-cabinet-as-israeli-governments-unified-front-crumbles/", "domain": "forward.com", "domain_classification": "Unknown", "message": "By Ron Kampeas June 10, 2024Former Defense Minister Benny Gantz quit Israel’s three-person war Cabinet, repositioning himself as a potential replacement for his longtime rival Prime Minister Benjamin Netanyahu as the unity that defined Israel’s initial response to the war against Hamas is crumbling.\nGantz, who joined the government and war cabinet shortly after Hamas’ invasion of Israel on Oct. 7, had planned his resignation for Saturday, but delayed his announcement while Israel celebrated the return of the hostages to their homes.\nThe departure of Gantz and Eisenkot comes just weeks after another faction, led by Gideon Saar, another Netanyahu rival, left the government.\n“Despite the strenuous efforts of myself and my colleagues, the Cabinet under your leadership has for some time avoided the determinative decisions required to end the war,” Eisenkot said in his resignation letter.\nNetanyahu is scheduled next month to address Congress, where he hopes to rally support for how he is conducting the war."}, {"id": "5237f5a2-7bf2-43d7-ae77-3e58d63ed575", "title": "Eiza González pictured in NYC as she promotes new miniseries La Máquina after saying her good looks have cost her roles", "date": "2024-06-10 05:30", "url": "https://www.dailymail.co.uk/tvshowbiz/article-13512277/Eiza-Gonzalez-NYC-miniseries-La-Maquina-saying-pretty.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "González took to Instagram Stories Sunday in which she said she had a 'press day' for her new Hulu mini-series La Máquina, which costars Gael García Bernal and Diego Luna.\nIn the social media post promoting the Spanish-language boxing drama, González looked amazing as she donned a white silk shirt with a light layer of makeup.\nThe Godzilla vs. Kong actress told the outlet, 'I remember being [told for] so many projects, \"She's too pretty for the role.\nGonzález's remarks brought forth a strong response via social media, as many users said her remarks had an arrogant tenor to them, and that she had overestimated her acting skills.\nGonzález earlier this month took to the social media platform to defend Jennifer Lopez from what she said was online bullying."}, {"id": "4c62d994-777c-46eb-9149-51bb0bddd4ef", "title": "Israeli war cabinet minister Benny Gantz quits emergency government", "date": "2024-06-10 10:00", "url": "https://www.the-star.co.ke/news/world/2024-06-10-israeli-war-cabinet-minister-benny-gantz-quits-emergency-government/", "domain": "the-star.co.ke", "domain_classification": "Unknown", "message": "Israeli war cabinet minister Benny Gantz has quit the emergency government in a sign of deepening divisions over Prime Minister Benjamin Netanyahu's post-conflict plans for Gaza.\nSpeaking during a news conference in Tel Aviv on Sunday where he announced his resignation, Mr Gantz said the decision was made with a \"heavy heart\".\nConsidered by some to be a potential challenger for power in Israel, Mr Gantz called on Mr Netanyahu to set a date for elections.\nMr Gantz is a political rival of Mr Netanyahu and a former chief of staff of the Israel Defense Forces (IDF).\nA retired army general and frequent critic of Mr Netayanhu, Mr Gantz had been a member of Israel's key decision-making \"war cabinet\", along with the prime minister and Defence Minister Yoav Gallant."}, {"id": "a7e833ac-6a04-46e9-b139-f6008f2a821e", "title": "Israel - Gaza live updates : US calls for Security Council vote on Gaza cease - fire , hostage deal resolution", "date": "2024-06-10 06:15", "url": "https://abcnews.go.com/International/live-updates/israel-hamas-war-in-gaza/united-states-doubling-down-on-efforts-for-israel-to-reach-a-ceasefire-110970129?id=110972861", "domain": "abcnews.go.com", "domain_classification": "International", "message": "\"My message to governments throughout the region, to people throughout the region: If you want a cease-fire, press Hamas to say yes,\" Blinken said.\n\"If you want to alleviate the terrible suffering of Palestinians in Gaza, press Hamas to say yes.\nIf you want to get all the hostages home, press Hamas to say yes.\nIf you want to put present Palestinians and Israelis alike on the path to more durable peace and security, if you want to prevent this conflict from spreading, press Hamas to say yes.\"\nHe said a cease-fire would open a path to \"more durable security, calm, peace in Gaza.\""}, {"id": "a16b95f0-9fa9-4ff2-9892-bf8a6858703f", "title": "Israel - Gaza live updates : US calls for Security Council vote on Gaza cease - fire , hostage deal resolution", "date": "2024-06-10 05:30", "url": "https://abcnews.go.com/International/live-updates/israel-hamas-war-in-gaza/?id=110972861", "domain": "abcnews.go.com", "domain_classification": "International", "message": "\"My message to governments throughout the region, to people throughout the region: If you want a cease-fire, press Hamas to say yes,\" Blinken said.\n\"If you want to alleviate the terrible suffering of Palestinians in Gaza, press Hamas to say yes.\nIf you want to get all the hostages home, press Hamas to say yes.\nIf you want to put present Palestinians and Israelis alike on the path to more durable peace and security, if you want to prevent this conflict from spreading, press Hamas to say yes.\"\nHe said a cease-fire would open a path to \"more durable security, calm, peace in Gaza.\""}, {"id": "c91c947e-0d24-4483-b9b6-294bf3e788ac", "title": "Israel - Gaza live updates : US calls for Security Council vote on Gaza cease - fire , hostage deal resolution", "date": "2024-06-10 05:45", "url": "https://abcnews.go.com/International/live-updates/israel-hamas-war-in-gaza?id=110972861", "domain": "abcnews.go.com", "domain_classification": "International", "message": "\"My message to governments throughout the region, to people throughout the region: If you want a cease-fire, press Hamas to say yes,\" Blinken said.\n\"If you want to alleviate the terrible suffering of Palestinians in Gaza, press Hamas to say yes.\nIf you want to get all the hostages home, press Hamas to say yes.\nIf you want to put present Palestinians and Israelis alike on the path to more durable peace and security, if you want to prevent this conflict from spreading, press Hamas to say yes.\"\nHe said a cease-fire would open a path to \"more durable security, calm, peace in Gaza.\""}, {"id": "229a8d93-73c0-426b-9ece-883d61a8e990", "title": "Halifax bomber memorial would mark fatal crash", "date": "2024-06-10 14:00", "url": "https://www.yahoo.com/news/halifax-bomber-memorial-mark-fatal-132502150.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Planning permission is being sought to erect a small monument of a Halifax bomber in Kirton in Lindsey [Getty Images]Proposals have been submitted for a Halifax bomber memorial in North Lincolnshire.\nPlanning permission is being sought to put up a small sculpture of the World War Two plane in Kirton in Lindsey.\nIt would commemorate a fatal crash in the town in 1944, which involved a Halifax, as well as the area's wartime links.\nIt would be built from brick, with a small sculpture of a Halifax bomber mounted on top.\nThe applicant for the memorial, Tony Bartlett, previously designed a sculpture in Kirton of a farmer with an old potato plough."}, {"id": "ec2d95a7-4221-4c0c-bfd2-7d435c8705c9", "title": "Biden wants to  bastardize  his family stories to get  weird political points with certain demographics  ", "date": "2024-06-10 04:15", "url": "https://www.yahoo.com/news/biden-wants-bastardize-family-stories-013345471.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Biden wants to ‘bastardize’ his family stories to get ‘weird political points with certain demographics’Fox News Contributor Joey Jones said President Biden continues to make mistakes in his attempts to appeal to voters on this Sunday's episode of \"The Big Weekend Show.\"\n\"It upsets me that he's willing to take the tragedies within his own family and bastardize them so that he can score some weird political points with certain demographics,\" Jones said.\nThree men, including Mr. Biden’s uncle, were lost in the crash while a fourth was rescued by a passing barge.\nThere are no indications that the plane was shot down or that Mr. Finnegan was flying the plane,\" she continued.\nOriginal article source: Biden wants to ‘bastardize’ his family stories to get ‘weird political points with certain demographics’"}, {"id": "55a7eda7-7f22-4e63-8aa8-84ec8fb9557d", "title": "Israeli minister Benny Gantz resigns from Benjamin Netanyahu emergency government", "date": "2024-06-10 01:00", "url": "https://www.fijivillage.com/news/Israeli-minister-Benny-Gantz-resigns-from-Benjamin-Netanyahus-emergency-government-85x4rf/", "domain": "fijivillage.com", "domain_classification": "Unknown", "message": "Israeli minister Benny Gantz resigns from Benjamin Netanyahu's emergency governmentIsraeli minister Benny Gantz resigns from Benjamin Netanyahu's emergency governmentIsraeli minister Benny Gantz addresses the media after withdrawing his party from Israel's governing coalition.\n(Reuters: Nir Elias)Israeli war cabinet minister Benny Gantz has resigned from Prime Minister Benjamin Netanyahu's emergency government over his handling of the war in Gaza.\nIn a televised address, Mr Gantz said Mr Netanyahu was \"preventing us from advancing toward true victory\".\nMr Gantz then joined Mr Netanyahu's war cabinet.\nLast month, Mr Gantz presented Mr Netanyahu with a June 8 deadline to come up with a clear strategy for post-war Gaza."}, {"id": "9a5746e5-4e57-464f-9e3b-2cdc1d5ac8f1", "title": "Benny Gantz resigns from Israel war cabinet , accuses Netanyahu of mismanaging Gaza conflict", "date": "2024-06-10 04:15", "url": "https://www.sbs.com.au/news/podcast-episode/benny-gantz-resigns-from-israels-war-cabinet-accuses-netanyahu-of-mismanaging-gaza-conflict/amqmvqjgx", "domain": "sbs.com.au", "domain_classification": "Unknown", "message": "TRANSCRIPTThe centrist member of Israel's war cabinet Benny Gantz has resigned, accusing Israeli Prime Minister Benjamin Netanyahu of mismanaging the war effort against Hamas.\nBut Mr Gantz says the country is being prevented from progressing to victory.\nThe move does not immediately pose a threat to Mr Netanyahu, who still controls a majority coalition in parliament, but Mr Gantz has called on Mr Netanyahu to set a date for elections.\nRESIDENT 1: \"I think Gantz leaving the government, I think maybe it can be a positive thing.\nMeanwhile, Israeli Prime Minister Benjamin Netanyahu says his country is fighting against several organisations including the International Criminal Court."}, {"id": "84a4a000-b0d7-4578-8191-2a385db4b3be", "title": "Germany Is A Naive Pawn Of The united states With No Power To Turn Things Around", "date": "2024-06-10 06:15", "url": "https://www.zerohedge.com/geopolitical/germany-naive-pawn-usa-no-power-turn-things-around", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "Germany has been controlled from Washington since the end of the Second World War.\nMany people who are indoctrinated by the media and politicians do not realise the increasingly tangible risk of a third world war.\nBack in February 2023, I pointed out this dangerous trend in “Sleepwalkers at work: World War 3 has probably already begun” and concluded even then that World War 3 had already begun in purely material terms.\nIt is somewhat surprising that many people still believe today that Germany was solely responsible for the First World War.\nBack to the top with courage, stubbornness and disciplineThe economic miracle after the Second World War was an impressive achievement by the Germans after the Second World War."}, {"id": "e795997f-d4f2-415d-b4cd-df96ed95f604", "title": "Just Askin : Which is the oldest cemetery in the city of Cincinnati ? A hint : it not big", "date": "2024-06-10 02:30", "url": "https://www.yahoo.com/news/just-askin-oldest-cemetery-city-232025456.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Just Askin': Which is the oldest cemetery in the city of Cincinnati?\nAnd it's the oldest cemetery in Hamilton County, according to the City of Cincinnati Park Board.\nGraves in Pioneer Cemetery, officially the Columbia Baptist Cemetery, the oldest cemetery in Hamilton County.\nThe sign for the Pioneer Cemetery, the old Columbia Baptist Cemetery near Lunken Airport in Columbia-Tusculum.\nThis article originally appeared on Cincinnati Enquirer: What's the oldest cemetery in Cincinnati?"}, {"id": "eba11015-2781-4307-869d-8cd9a6619269", "title": "Trump calls J6 defendants  warriors  ", "date": "2024-06-10 04:15", "url": "https://www.yahoo.com/news/trump-calls-j6-defendants-warriors-014615884.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Former President Trump defended his supporters who rioted at the Capitol on Jan. 6, 2021, and called them “warriors” at a Nevada rally on Sunday.\n“Those J6 warriors – they were warriors – but they were really, more than anything else, they’re victims of what happened,” Trump said at the rally, speaking to a crowd of supporters.\nThat’s what they were doing,” Trump continued, repeating his false claims that the 2024 presidential election was rigged against him.\nTrump also falsely claimed police welcomed rioters into the Capitol and, Trump said, told the rioters, “Go in, go in, go in, go in.”“What a set up that was,” Trump added.\nTrump, in the past, has used similar words to describe those jailed over their actions during the Jan. 6 attack."}, {"id": "708263c8-2768-4016-b1ce-8c38d8db5315", "title": "Trump calls Jan . 6 defendants  warriors  ", "date": "2024-06-10 13:45", "url": "https://www.aol.com/trump-calls-j6-defendants-warriors-014615326.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Former President Trump defended his supporters who rioted at the Capitol on Jan. 6, 2021, and called them “warriors” at a Nevada rally on Sunday.\n“Those J6 warriors – they were warriors – but they were really, more than anything else, they’re victims of what happened,” Trump said at the rally, speaking to a crowd of supporters.\nThat’s what they were doing,” Trump continued, repeating his false claims that the 2024 presidential election was rigged against him.\nTrump also falsely claimed police welcomed rioters into the Capitol and, Trump said, told the rioters, “Go in, go in, go in, go in.”“What a set up that was,” Trump added.\nTrump, in the past, has used similar words to describe those jailed over their actions during the Jan. 6 attack."}, {"id": "6cc060a2-9b00-45be-b1fc-a8f86ea6efde", "title": "Worthplaying |  Killing Floor III  Reveals More Game Details , Comes To PS5 , Xbox Series X|S And PC In 2025 , Shows Off First Gameplay", "date": "2024-06-10 06:15", "url": "https://worthplaying.com/article/2024/6/9/news/142404-killing-floor-iii-reveals-more-game-details-comes-to-ps5-xbox-series-xs-and-pc-in-2025-shows-off-first-gameplay-screens-trailer/", "domain": "worthplaying.com", "domain_classification": "Unknown", "message": "Since the release of the original Killing Floor in 2009, and the sequel Killing Floor 2 in 2016, over 28 million players around the globe have joined the battle for survival against hordes of horrific Zeds across PC and consoles.\nOver that time, Tripwire has engaged and grown the massive Killing Floor community through the steady release of free and premium post-launch content, with industry-leading games-as-a-service (GaaS) support.\nKilling Floor 3’s gameplay trailer introduces the first three new playable Nightfall specialists including the highly-anticipated return of fan-favorite commando, Mr. Foster.\n“We are incredibly excited for players to experience the action/horror world we are creating for Killing Floor 3,\" said Bryan Wynia, Studio Creative Director at Tripwire Interactive.\nKilling Floor III in coming to PS5, Xbox Series X|S and PC in 2025."}, {"id": "333d476a-cb20-4878-8a46-a58e458f395d", "title": "Watch headcam footage of hostages rescue", "date": "2024-06-10 01:30", "url": "https://www.ynetnews.com/magazine/article/rjrhz5msa", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Footage of the rescue ( Video: IDF Spokesperson's unit )The IDF released new details on Sunday, on the hostages rescue, Operation Arnon, named after Commander Arnon Zamora, who was killed during the raid .\nA video released by the IDF shows helmet camera footage from Shayetet 13 naval commandos as they transferred the hostages from the National Counterterrorism Unit (Yamam) and Shin Bet forces to IDF personnel.\nThe Paratroopers Brigade, leading the rescue under fire, successfully transferred the hostages to a helicopter extraction point deep within Gaza.\nThe 7th Brigade, with armored and engineering units, worked swiftly to eliminate terrorists and destroy terror infrastructures to enable the hostages' rescue.\n\"Operation Arnon\" Minute by MinuteKey details of the rescue operation, conducted in the Nuseirat refugee camp, emerged on Sunday."}, {"id": "b3824eba-39e4-4cac-9687-5673d8247529", "title": "North Korea sends more trash balloons as Kim sister warns of  new counteraction  ", "date": "2024-06-10 06:15", "url": "https://www.cnn.com/2024/06/10/asia/north-korea-trash-balloons-south-korea-loudspeakers-intl-hnk/", "domain": "cnn.com", "domain_classification": "International", "message": "Balloons possibly sent from North Korea seen off the coast of Incheon, South Korea on June 9, 2024.\nYonhap News Agency/ReutersThe broadcasts inform North Korean soldiers and residents of the “reality of North Korea,” and the development of South Korea, and modern Korean culture, according to the JCS.\nAs of Monday morning, the South Korean military had found “around 50 balloons” that fell into its territory overnight Sunday.\nMany other balloons are believed to have flown back into North Korea due to the wind, according to the JCS spokesman.\nBut the situation in North Korea deteriorated in the following years and diplomatic talks fell apart – prompting strict rules to snap back into place in the North."}, {"id": "7b840d9b-19e4-4fa6-a1fb-1c077dd4c689", "title": "North Korea sends more trash balloons as Kim sister warns of  new counteraction  ", "date": "2024-06-10 08:15", "url": "https://edition.cnn.com/2024/06/10/asia/north-korea-trash-balloons-south-korea-loudspeakers-intl-hnk/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "Balloons possibly sent from North Korea seen off the coast of Incheon, South Korea on June 9, 2024.\nYonhap News Agency/ReutersThe broadcasts inform North Korean soldiers and residents of the “reality of North Korea,” and the development of South Korea, and modern Korean culture, according to the JCS.\nAs of Monday morning, the South Korean military had found “around 50 balloons” that fell into its territory overnight Sunday.\nMany other balloons are believed to have flown back into North Korea due to the wind, according to the JCS spokesman.\nBut the situation in North Korea deteriorated in the following years and diplomatic talks fell apart – prompting strict rules to snap back into place in the North."}, {"id": "ad2c9918-0395-450c-b628-3acdc0f8d4e7", "title": "NE Wisconsin WW2 Vets reflect on Normandy trip", "date": "2024-06-10 04:15", "url": "https://www.yahoo.com/news/ne-wisconsin-ww2-vets-reflect-021454359.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "APPLETON INTERNATIONAL AIRPORT, Wis. (WFRV) – Three of Northeast Wisconsin’s World War II heroes have returned from their once-in-a-lifetime visit to Normandy, France.\nLocal 5 News was at both the Appleton International Airport and Austin Straubel International Airport when those World War II heroes returned from their trips from Normandy.\n“My purpose was to go there and represent all the American forces who lost their lives on D-Day,” said Vaughn Collicott.\nWW2 Vet Vaughn Collicott on Normandy tripWW2 Vet Vaughn Collicott on Normandy tripWW2 Vet Vaughn Collicott on Normandy tripWW2 Vet Vaughn Collicott on Normandy tripWW2 Vet Vaughn Collicott on Normandy tripWW2 Vet Vaughn Collicott on Normandy tripAlso making the trip and returning to the Appleton International Airport this weekend was Larry Eckstein.\nWW2 Vet Lawrence Eckstein on Normandy tripWW2 Vet Lawrence Eckstein on Normandy trip“You just take it all in and you’re looking out at the water,” said Julie."}, {"id": "85030dd8-0557-4acf-9e5e-50f649796f95", "title": "A hip - hop breaking time at the Paris Olympics - Victoria Times Colonist", "date": "2024-06-10 11:45", "url": "https://www.timescolonist.com/opinion/david-sovka-a-hip-hop-breaking-time-at-the-paris-olympics-8993413", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "MICHEL EULER, THE ASSOCIATED PRESS1 / 1 The argument for including breakdancing in the 2024 Olympics, along with surfing, climbing, skateboarding and BMX freestyle, is that it makes the games “more urban,” writes David Sovka.\nMICHEL EULER, THE ASSOCIATED PRESS AdvertisementThis is an even year, and that can only mean one thing: Summer Olympics!\n“Breaking” is now the preferred term for the, uh, I guess we’re calling it a sport now.\nThe Olympics breakdancing events will take place over two days this summer at Paris’s Place de la ­Concorde, at the end of the Champs-Elysees.\nIf they prove to be popular, the 2028 summer ­Olympic Games will trial other more urban games, including traffic rage, sprawling homeless camps and sewage treatment during droughts."}, {"id": "1f9724bc-be72-4311-9cf4-f2cce7eefa50", "title": "South Korea says North Korea is installing its own loudspeakers along the border", "date": "2024-06-10 10:30", "url": "https://www.aol.com/south-korea-says-north-korea-082927121.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korea’s military on Monday said it’s detecting signs that North Korea is installing its own loudspeakers along their heavily armed border, a day after the South blared anti-Pyongyang propaganda broadcasts over its speakers for the first time in years as the rivals engage in a Cold War-style psychological warfare.\nNorth Korea has described its balloon campaign as a response to South Korean civilian groups using balloons to fly anti-North Korean propaganda leaflets across the border.\nIn their latest nuclear planning talks in Seoul, U.S. and South Korean officials reviewed an undisclosed guideline mapping out their nuclear deterrence strategies to counter growing North Korean threats.\nSouth Korea on Sunday activated its loudspeakers for an initial broadcast into North Korea, which reportedly included news, criticism about North Korea’s government and South Korean pop music.\nIn 2015, when South Korea restarted loudspeaker broadcasts for the first time in 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire, according to South Korean officials."}, {"id": "fab20b41-4911-4ad4-86ac-b58a6aa789dc", "title": "Australian public sector workers take a stand against Gaza genocide", "date": "2024-06-10 08:00", "url": "https://www.wsws.org/en/articles/2024/06/10/mscw-j10.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Elbit is Israel’s largest defence company, and has manufactured many of the weapons of war being used against Gaza.\nIn appending their names to the letter, the public servants have taken a courageous stand.\nThey have openly defied draconian employment conditions, set out in federal, state and territory codes of conduct, which generally prohibit public sector workers from speaking publicly on political matters.\nAmong them are dozens if not hundreds of education workers, health staff, including doctors and nurses, and community workers.\nFirstly, it asserts that Labor support for the genocide is an error, because the war crimes are not in Australia’s interests."}, {"id": "b62c081c-b719-4d5f-84b4-54984f086d3f", "title": "Why the  balloon war  between North Korea and South Korea could spiral out of control", "date": "2024-06-10 14:30", "url": "https://www.independent.co.uk/asia/east-asia/north-korea-balloon-wars-south-korea-kim-jongun-b2559636.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Please try again later {{ /verifyErrors }}The North Korean leadership has vowed retaliation after South Korea resumed loudspeaker broadcasts and activists floated propaganda leaflets over the border, escalating the ongoing “balloon war” and damaging their already fraught bilateral relationship.\nLee Sung-joon, spokesperson for South Korea’s Joint Chiefs of Staff, said Ms Kim’s comments marked an increase in verbal threats from North Korea.\nStrategic experts said North Korea’s failure to comprehend democracy meant the “balloon war” could spiral out of control.\nNorth Korea may have already miscalculated, as South Korea’s democracy cannot simply turn off NGO balloon launches the way an autocracy would expect.”South Korean soldier wearing protective gears checks the trash from a balloon presumably sent by North Korea, in Incheon, South Korea ( AP )Mr Easley said the previous South Korean government had amended a law to prohibit its citizens from flying balloons into North Korea.\nSouth Korean president Yoon Suk-yeol last week called North Korea “the darkest place on earth” and its trash balloons “despicable provocation”."}]