[{"id": "af6c522c-1c90-43c3-99d0-72da12842981", "title": "Belgium arts center cancels Jewish school event over Gaza  genocide  ", "date": "2024-06-16 17:30", "url": "https://nypost.com/2024/06/16/world-news/belgium-arts-center-cancels-jewish-schools-event-over-gaza-genocide/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "A Belgian arts center has riled up controversy over its director canceling a Jewish school’s event there because Israel was committing “genocide” in Gaza, according to a new report.\n“We look with horror at the genocide that is currently taking place in Gaza,” Willems wrote.\nLana Willems, director of the publicly funded Monty Hall arts center, in Antwerp, Belgium, rejected a rental request from a Jewish school over the ”genocide” in Gaza.\nThe center received immediate backlash, with Jewish leaders condemning the decision to cancel the school event as racist and antisemitic.\nIt remains unclear if the Tachkemoni Jewish School will work with the Monty Hall arts center on an event there."}, {"id": "6922dd18-be1b-4078-b8d2-39bc55e950ce", "title": "Rishi Sunak pledges to keep British Jews safe amid Israel", "date": "2024-06-16 11:30", "url": "http://www.myanmarmuslim.net/news/20240616173e599772.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosRishi Sunak has said he will “stop at nothing” to keep Britain’s Jewish community safe, before promising support for Israel along with other world leaders after the Hamas attacks.\nThe UK prime minister addressed a synagogue in north London to express his solidarity for Israel and to reassure Britain’s Jews.\n“We stand with Israel, the United Kingdom stands with Israel against this terrorism today, tomorrow and always,” Mr Sunak said.\nThe most senior Palestinian diplomat in the UK accused Israel of a “war crime” against civilians.\nIt’s not going to lead anywhere.”The British Red Cross has launched an emergency fundraising appeal to provide humanitarian support in Israel and Gaza."}, {"id": "cde98792-9383-4da9-bacf-44ccf5753ba6", "title": "Charlotte Church joins pro - Winning Odds", "date": "2024-06-16 13:30", "url": "http://www.myanmarmuslim.net/news/20240616574f599423.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosWelsh singer Charlotte Church said she was spreading a “loving message” as she joined a pro-Palestine rally following the backlash she received for singing a protest chant.\nIn late February, the 38-year-old led a rendition of From The River To The Sea at a Sing For Palestine fundraising event in Wales which the Campaign Against Antisemitism called a “genocidal chant”.\nOn Saturday, the singer from Cardiff marched alongside thousands of protesters in central London calling for an immediate ceasefire in Gaza.\n“But a strong, a peaceful, a loving message, that’s what every single march that I’ve been on for Palestine has been about.\nIt comes as the Government’s counter-extremism tsar warned that London’s streets have become a “no-go zone for Jews” during pro-Palestine protests."}, {"id": "c924af02-a044-4c7a-9f7c-c46e691bdc6a", "title": "Jews grieve and pray for peace in first Shabbat services since Hamas attack", "date": "2024-06-16 20:15", "url": "http://www.myanmarmuslim.net/news/20240617299b599646.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Source：world cup logosJews in communities far from Israel have gathered at synagogues this weekend for their first Shabbat services since Hamas militants attacked Israel, igniting an ongoing war.\nOne US rabbi based in Pittsburgh said the deadly Hamas attack is not just another geopolitical event for Jewish people – it is dredging up generations of visceral trauma, especially in a city scarred by the deadliest antisemitic attack in US history.\nBy comparison, last week’s Hamas attack was “tragic and horrifying and gut wrenching, but it was believable”.\nAfter the Pittsburgh synagogue attack, “we felt the whole community embraced us,” Rabbi Adelson said.\nThe heightened safety measures come in reaction to global tensions triggered by Hamas’ attack, and Israel’s subsequent bombing of Gaza, as well as calls on social media to violently protest in front of Jewish institutions in Germany."}, {"id": "50b67f61-074c-4dee-ba30-8780ddd9ac75", "title": "Israel Hamas : Hate comes to university camp but hides its face", "date": "2024-06-16 02:00", "url": "https://www.watoday.com.au/national/hate-comes-to-university-campus-but-hides-its-face-20240613-p5jlif.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "As it seeks to recruit and radicalise, Hizb ut-Tahrir is using front groups to infiltrate the university encampment and pro-Palestine movements.\nFounded in 1953 in the Middle East, Hizb ut-Tahrir has publicly differentiated itself from violent outfits such as Islamic State.\nDeakin University extremism expert Josh Roose says Hizb ut-Tahrir has used the Gaza conflict to boost its activism.\nHe also believes there is a pressing and “clear case” to strength Australia’s hate speech legislation to combat Hizb ut-Tahrir’s “violent rhetoric” and antisemitism.\nSpeakers at its launch included Sheikh Ibrahim Dadoun and another Hizb ut-Tahrir activist, who noted the “important contribution of Hizb ut-Tahrir in lending help and an important hand with the logistics and the volunteers”."}, {"id": "1a2a7c81-ab77-4bd8-b9d6-9f24708c667e", "title": "Israel Hamas : Hate comes to university camp but hides its face", "date": "2024-06-16 06:00", "url": "https://www.brisbanetimes.com.au/national/hate-comes-to-university-campus-but-hides-its-face-20240613-p5jlif.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "As it seeks to recruit and radicalise, Hizb ut-Tahrir is using front groups to infiltrate the university encampment and pro-Palestine movements.\nFounded in 1953 in the Middle East, Hizb ut-Tahrir has publicly differentiated itself from violent outfits such as Islamic State.\nDeakin University extremism expert Josh Roose says Hizb ut-Tahrir has used the Gaza conflict to boost its activism.\nHe also believes there is a pressing and “clear case” to strength Australia’s hate speech legislation to combat Hizb ut-Tahrir’s “violent rhetoric” and antisemitism.\nSpeakers at its launch included Sheikh Ibrahim Dadoun and another Hizb ut-Tahrir activist, who noted the “important contribution of Hizb ut-Tahrir in lending help and an important hand with the logistics and the volunteers”."}, {"id": "d50357f1-4513-4232-bce7-3e4fab8f7878", "title": "British Labour Party withdraws support for by", "date": "2024-06-16 18:45", "url": "http://www.myanmarmuslim.net/news/20240617991f599006.html", "domain": "myanmarmuslim.net", "domain_classification": "Unknown", "message": "Britain's opposition Labour Party has withdrawn support for its candidate to become a member of parliament in a special election after he was recorded espousing conspiracy theories about Israel.\nThe paper also said the now-former Labour candidate claimed that Israel planned to “get rid of [Palestinians] from Gaza” and “grab” some of the land.\nBut the party leadership is now being pressed on why Mr Ali had not been immediately suspended after the comments emerged.\nFrontbenchers Lisa Nandy and Anneliese Dodds had been out campaigning for Mr Ali in the constituency at the weekend.\nAlso running in Rochdale are former Labour MP Simon Danczuk, now the Reform Party candidate, and George Galloway, of the Workers Party of Britain, who is campaigning against Labour’s stance on Gaza."}, {"id": "53afdc3f-ffb6-4c80-b095-4171b5589cef", "title": "Letters : In praise of the kindness of strangers at a frightening time", "date": "2024-06-16 02:30", "url": "https://www.independent.ie/opinion/letters/letters-in-praise-of-the-kindness-of-strangers-at-a-frightening-time/a1951174018.html", "domain": "independent.ie", "domain_classification": "Unknown", "message": "I am extremely grateful to each and every one for the kindness shown to me at the time I needed it most.\nAnd people who fancy a flutter or a visit to a racetrack might reflect on what they are supporting.\nI would like to think the Government will respond to the RTÉ report, an example of public broadcasting at its best.\nOur relay teams typify the ­Ireland that I love, which is built on that great Irish custom of inclusiveness.\nGiven the world we live in today and as a fellow Dubliner, I think it’s important to say this again."}, {"id": "5bb51640-2f63-4e6b-ba0d-1222a6b8d16c", "title": "Latest Articles", "date": "2024-06-16 16:15", "url": "https://freerepublic.com/tag/*/index?more=4244652", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Just another reminder that the story which about 10 days ago was BLASTED over the news that a Facebook poster named Michael Anderson who claimed his juror cousin in the Manhattan Kangaroo Court declared the jury had already found Trump guilty the day BEFORE the verdict was handed down has NOT been debunked.\nAnd the big TELL for that is that the media has DROPPED this story like a hot potato.\nBelieve me, if this story had been investigated and proven to be false, it would be all over the news.So has this claim by Michael Anderson been investigated?"}]