[{"id": "3cd8a46d-214a-4372-9bd1-fd3166ad89b8", "title": "Trump Warns US Jews in Most Danger Since Holocaust", "date": "2024-08-18 22:30", "url": "https://www.algemeiner.com/2024/08/18/trump-warns-us-jews-in-most-danger-since-holocaust/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "JNS.org – Republican presidential nominee Donald Trump said on Saturday that Jews in the United States are facing their greatest threat since World War II.\nHe made similar remarks on Thursday at a “Fighting Antisemitism” event with Miriam Adelson at the Trump National Golf Club in Bedminster, New Jersey.\nThe New Jersey event, featuring prominent Jewish supporters, took place the day the Trump campaign launched an initiative to reach out to Jewish voters.\nTrump’s comments come amid a surge in antisemitism in the United States and globally after Hamas started a war against Israel on Oct. 7, 2023.\nIn the United States, the ADL recorded 7,523 incidents in 2023 compared to 3,697 in 2022."}, {"id": "99450a4d-d2f7-4a1b-8981-1c65f89fe7bf", "title": "Trump says there has  never been a more dangerous time  for Jews in America since Holocaust", "date": "2024-08-18 02:45", "url": "https://nypost.com/2024/08/17/us-news/trump-says-there-has-never-been-a-more-dangerous-time-for-jews-in-america-since-holocaust/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Former President Donald Trump declared there has “never been a more dangerous time since the Holocaust” to be Jewish in the US on Saturday night.\n“They turned him down because he’s Jewish,” Trump told a packed house at the Mohegan Sun Arena.\nShapiro has dismissed allegations that he was overlooked for his faith, saying Harris’ choice of Minn. Gov.\nREUTERS5 “What’s happening with Israel and Jewish people, there has never been a more dangerous time since the Holocaust if you happen to be Jewish in America,” Trump said.\nNew York City has seen nearly weekly anti-Israel protesters taking to the streets of Manhattan, often disrupting the city’s main transit hubs."}, {"id": "7d65ff55-5376-49dc-8018-ad269a41b07a", "title": "Trump : Shapiro wasnt picked because he Jewish , antisemitism at a high", "date": "2024-08-18 07:00", "url": "https://www.jpost.com/american-politics/article-815148", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "“They turned him down for other reasons, but the primary reason is because he’s Jewish,” Trump claimed.\nTrump, continuing his speech on antisemitism, went on to claim that his opponent, VP Kamala Harris, had rejected selecting Penn.\n“They turned him down because he’s Jewish,” Trump told crowds in Connecticut.\nThere has never been a more dangerous time since the Holocaust if you happen to be Jewish in America,” he said.\nJosh Shapiro takes the stage at an election rally for Kamala Harris and Tim Walz, in Philadelphia, last week."}, {"id": "e1612d95-8035-4927-bbca-0078e34011cc", "title": "Jewish groups , Ottawa mayor boycott pride over Gaza statement", "date": "2024-08-18 20:00", "url": "https://www.jpost.com/diaspora/antisemitism/article-815219", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Canadian Jewish organizations and the Ottawa mayor withdrew from attending a pride parade in the capital over the organizer’s statement of solidarity with Palestinians that alleged that Israel was conducting genocide in Gaza.\n“We are deeply concerned by the rising tide of antisemitism and Islamophobia we are witnessing here in Canada,” said Capital Pride.\n(credit: Arlyn McAdorey/Reuters)The Jewish Federation of Ottawa said Wednesday that it had attempted to meet with Capital Pride about the remarks, but the organization’s board was unwilling to reconsider its position.\n“Capital Pride has chosen a divisive position that further marginalizes Jews, who are victimized by more hate crimes than any other group in Canada.\nCTV News reported on Saturday that the Children’s Hospital of Eastern Ontario and The Ottawa Hospital also withdrew from the parade as a result of Capital Pride’s statement."}, {"id": "656de435-4904-40df-b677-8545b42b5647", "title": "The Christian case for backing Israel", "date": "2024-08-18 14:00", "url": "https://www.christianpost.com:443/voices/the-christian-case-for-backing-israel.html", "domain": "christianpost.com", "domain_classification": "Unknown", "message": "Home Opinion The Christian case for backing IsraelThe Bible vividly portrays Israel as a central theme in God's plan for humanity.\nBut what does it mean to say we support Israel in today’s geo-political climate?\nI agree with my colleague, Dr. Jeff Myers, president of Summit Ministries and author of Should Christians Support Israel?\nClearly, through the prophet Isaiah, God chose Israel to be a beacon of hope, truth, and divine revelation to the entire world.\nBy supporting Israel, we are obeying God's will and aligning ourselves with His promises, purposes, and plans for the world."}, {"id": "cf46a322-278b-42a0-aff0-e6eb750f7d1c", "title": "Jewish NGOs to Host Sideline Events at Democratic National Convention", "date": "2024-08-18 22:30", "url": "https://www.algemeiner.com/2024/08/18/jewish-ngos-to-host-sideline-events-at-democratic-national-convention/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "JNS.org – While presidential nominee Kamala Harris and running mate Tim Walz take hits from both right and left for their stances on Israel, the Democratic National Convention will feature a number of events tied to the American Jewish community.\nThe Jewish Democratic Council of America (JDCA), which is led by Halie Soifer, Harris’s former national security adviser, will hold a series of events on the DNC sidelines throughout the week.\nDoug Emhoff, Harris’s Jewish husband, is set to keynote on Tuesday.\nRepublican nominee Donald Trump recently denigrated Emhoff’s Jewishness, calling him a “crappy Jew,” while critiquing American Jews who vote Democratic.\nThe Republican Jewish Coalition has issued a “Praise Israel” challenge, saying it would donate 1,800 trees to the Jewish state in honor of anyone who would address the Democratic convention from the main stage and ask the crowd to cheer for Israel."}, {"id": "6ed80221-6318-4b63-a5eb-795996437c1a", "title": "Victoria synagogue sees influx of congregants - Victoria Times Colonist", "date": "2024-08-18 12:45", "url": "https://www.timescolonist.com/local-news/victoria-synagogue-in-midst-of-major-reno-sees-influx-of-congregants-amid-conflict-9365586", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "Built in 1863, Congregation Emanu-El at 1461 Blanshard St. is the ­oldest synagogue still in use in Canada.\nTIMES COLONIST Built in 1863, Congregation Emanu-El at 1461 Blanshard Street is the oldest synagogue building still in use as a synagogue in Canada.\nTIMES COLONIST1 / 1 Built in 1863, Congregation Emanu-El at 1461 Blanshard St. is the ­oldest synagogue still in use in Canada.\nTIMES COLONIST Built in 1863, Congregation Emanu-El at 1461 Blanshard Street is the oldest synagogue building still in use as a synagogue in Canada.\nTIMES COLONIST AdvertisementCongregation Emanu-El — in its 161st year at Blanshard Street — is undertaking a $1.5-million restoration project as Canada’s oldest synagogue community sees an influx of new congregants."}, {"id": "fe80748e-9400-45ee-b121-69640d38d972", "title": "Did the united kingdom government fuel race riots with close border push ? ", "date": "2024-08-18 07:00", "url": "https://www.jpost.com/international/article-815146", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Before winning a landslide victory last month, the Labour Party said the country does need to offer asylum to those fleeing war or persecution.\nHowever, both the Labour Party and the then-governing Conservative Party campaigned on bringing down immigration and stopping boats of migrants and asylum seekers crossing into the UK.\nSubscribe to The Jerusalem Post Newsletter Subscribe NowThe UK saw anti-immigration protests turn violent as rioters targeted hotels housing asylum seekers and mosques.\nIn early August, rioters lit bins on fire and pushed them toward the Rotherham Holiday Inn Express, where asylum seekers were staying.\nBoswell said the event showed how asylum seekers can be targeted and not protected in such hotels."}, {"id": "9173bbb8-8bbe-4bc2-991b-a36e6715b2db", "title": "Israel , Gaza and Josh Shapiro : What were watching for during the Democratic National Convention – The Forward", "date": "2024-08-18 14:45", "url": "https://forward.com/news/644982/israel-gaza-and-josh-shapiro-what-were-watching-for-during-the-democratic-national-convention/", "domain": "forward.com", "domain_classification": "Unknown", "message": "Harris’ Jewish husband, Doug Emhoff, is also expected to take a primetime turn.\nThe Democratic convention will run Monday through Thursday in Chicago, with marquee speakers — including Harris, Walz and former presidents Barack Obama and Bill Clinton — speaking in the evening.\n​Jim Zogby, the president of the Arab American Institute and a longtime Democratic Party operative, said progressive protesters are showing up in large numbers at the Democratic convention because they feel betrayed by the Democratic administration.\n“Israel’s genocidal war in Gaza has become central to the agenda of progressives in the Democratic Party,” he said in his most recent weekly newsletter.\nIf either — or both — mention the war, Jewish organizations will closely scrutinize the differences, as will pro-Palestinian activists."}, {"id": "1d90b84a-c703-4d5a-91cb-4d5b061bc643", "title": "Pro - Palestinian activists face complicated new decisions as Democrats gather to support a surging Kamala Harris", "date": "2024-08-18 19:00", "url": "https://us.cnn.com/2024/08/18/politics/pro-palestine-activists-dnc-harris/", "domain": "us.cnn.com", "domain_classification": "Unknown", "message": "One was Vice President Harris not attending Netanyahu’s speech.\nVice President Harris giving a statement that she won’t be ‘silent’ about the killing of civilians.\nAt some points during the speech, the vice president was interrupted by pro-Palestinian protesters.\n“I can’t tell my community that I ‘feel’ or ‘think’ Vice President Harris is more sympathetic to Palestinians, so we should vote for her.\n“Julie is traveling to Michigan as part of our campaign’s ongoing outreach to communities across the country,” said Harris campaign spokesman Ammar Moussa."}]