[{"id": "9526cdf8-02be-4d85-8b95-5e2692f2de1e", "title": "How the IDF Saves Civilians | Frontpage Mag", "date": "2024-05-21 04:30", "url": "https://www.frontpagemag.com/the-idf-takes-more-steps-to-warn-civilians-away-from-combat-areas-than-any-other-military/", "message": "The IDF strives always to warn civilians away from places about to be targeted, even when those warnings remove the element of surprise, which often is the critical element in a military attack.\nAs the war raged on, Israel began giving out its military maps to civilians so they could conduct localized evacuations.\nActually, the IDF estimated the number of Hamas combatants killed to be 13,000 as of late January.\nThat would mean some 18,000 civilians have died in Gaza, a ratio of roughly 1 combatant to 1.5 civilians.\nEven if we were to accept Hamas’ figure of 31,000 Gazans dead (Hamas does not offer separate numbers for civilians and combatants), and subtract from that figure the 15,000 Hamas fighters killed, that would mean at most 16,000 civilians were killed."}, {"id": "3276ef05-97a4-42d4-9c9d-2d9b0afaf4dc", "title": "Russo - Ukraine War - 20 May 2024", "date": "2024-05-21 03:15", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-05-20.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nToday, Russian forces made five attempts to break through the defenses of Ukrainian troops in the areas of Staritsa, Liptsiv and Vovchansk.\nToday in the Kharkiv direction, Russian foreigners have already lost 26 people killed and wounded and 15 units of weapons and military equipment.\nUkrainian troops are using border control measures and regrouping in particular areas."}, {"id": "f2503a97-1e5f-4afd-9740-cf48d78b5869", "title": "Student Anger Over The Vietnam War Erupted Into Violence In The  60S − A Terrorism Expert Explores If The Same Could Happen Today", "date": "2024-05-21 01:45", "url": "https://menafn.com/1108234918/Student-Anger-Over-The-Vietnam-War-Erupted-Into-Violence-In-The-60S-A-Terrorism-Expert-Explores-If-The-Same-Could-Happen-Today", "message": "The dramatic scenes of police and state troopers dismantling student encampments on campuses and arresting protesters have sparked some accusations of heavy-handed law enforcement tactics .\nThe wave of recent pro-Palestinian, student-led protests reminds me of another tense era in the U.S. that was also prompted by U.S. engagement in a foreign war – the Vietnam War in the late 1960s and early 1970s.\nStudents' anger over the long-running U.S. war in Vietnam reached a boiling point on Aug. 28, 1968, at the Democratic National Convention in Chicago.\nDuring a 1981 bank robbery in Nanuet, New York, three law enforcement officers were killed during a shootout with Weather Underground members.\nDuring this time, the FBI worked closely with various state and law enforcement agencies to investigate the group and criminally prosecute various members ."}, {"id": "247dbd65-eb0c-469c-9007-8ba89af3328a", "title": "Defund ICC  kangaroo court  as it wages anti - Israel lawfare : Richard Goldberg", "date": "2024-05-21 02:00", "url": "https://www.foxnews.com/world/defund-iccs-kangaroo-court-wages-anti-israel-lawfare-richard-goldberg", "message": "American policy should now turn toward pressuring allies to defund this kangaroo court and imposing financial sanctions to grind its operations to a halt.\nTomorrow, however, it might be the United States.\nDefending Israel from the ICC’s lawfare now will help protect American soldiers and government officials down the road.\nNo democracy can call itself an ally of the United States and fund antisemitic lawfare against Israel that invites future lawfare against America, too.\nThe institution is misusing law as a weapon of war, and the United States should act accordingly."}, {"id": "39561860-f5f4-4585-b421-a6d7fa6e9c20", "title": "Meet the mastermind of the October 7 strike on Israel – Ya Libnan", "date": "2024-05-21 04:15", "url": "https://yalibnan.com/2024/05/21/meet-the-mastermind-of-the-october-7-strike-on-israel/", "message": "In the months since Oct. 7, Deif is believed to have been directing Hamas military operations from the tunnels and backstreets of Gaza, alongside senior colleagues.\nRising up the Hamas ranks over 30 years, Deif developed the group’s network of tunnels and its bomb-making expertise.\nAn Israeli security source said Deif was directly involved in the planning and operational aspects of the attack.\nHe was arrested by Israel in 1989 and spent about 16 months in detention, a Hamas source said.\nHe did not use modern digital technology such as smart phones, the source close to Hamas said."}, {"id": "e040118d-5969-4745-8f60-0c477537173f", "title": "Destroyer USS Carney Returns Home After Seven - Month Deployment , 51 Houthi Engagements", "date": "2024-05-21 00:45", "url": "https://news.usni.org/2024/05/20/destroyer-uss-carney-returns-home-after-seven-month-deployment-51-houthi-engagements", "message": "USS Carney (DDG-64) had 51 total engagements with Houthi missiles and drones during its time in the Red Sea and Gulf of Aden, its commanding officer said Monday.\nCarney was not damaged and did not suffer any crew injuries or deaths during its time in the Red Sea.\n“It’s very dynamic, and it’s very fast.”There was no typical day aboard the destroyer once the Houthi attacks began.\n“Some days you had an activity where there’d be a launch and nothing would actually make it into the Red Sea.\nIt was not clear how the Houthi attacks would affect the commercial traffic flow."}, {"id": "dcf6aeca-0051-4ce0-83e2-95d74e0d16a7", "title": "Flashback : Biden , U . N . Hosted  Butcher of Tehran  President Raisi in NY Against GOP Opposition", "date": "2024-05-21 00:45", "url": "https://www.breitbart.com/politics/2024/05/20/flashback-biden-u-n-hosted-butcher-tehran-president-raisi-ny-against-gop-opposition/", "message": "On Sunday, search teams reportedly located the site where a helicopter carrying the Iranian president crashed, according to the Islamic Republic News Agency (IRNA), the state’s news agency.\n“This administration is opening the door for Iranian President Ebrahim Raisi into the U.S. while he assassinates dissidents and ignores basic human rights.”Murderers shouldn’t get US visas.\nThis administration is opening the door for Iranian President Ebrahim Raisi into the U.S. while he assassinates dissidents and ignores basic human rights.\nIran’s President Raisi is a serial human rights abuser and a mass murderer with a history of targeting Americans.\n“We must immediately ban President Raisi from attending the UNGA!”“This is a complete outrage,” wrote Texas Republican Senator Ted Cruz."}, {"id": "bca5d60c-0a8b-496b-979b-d34f9148fe03", "title": "Source close to Hizbollah says 4 dead in Israeli strikes on Lebanon", "date": "2024-05-21 00:45", "url": "http://www.jordantimes.com/news/region/source-close-hizbollah-says-4-dead-israeli-strikes-lebanon", "message": "Hizbollah, a Hamas ally, has traded near daily cross-border fire with Israeli forces since the Palestinian group's October 7 surprise attack on southern Israel that sparked the war in Gaza.\nThe source close to Hizbollah told AFP that \"at least four Hizbollah fighters were killed in Israeli raids on two different sites in southern Lebanon\", identifying the locations as Naqura on the coast and Mais Al Jabal, a border village to the east.\nA Hizbollah fighter was also killed on Monday in a strike in neighbouring Syria blamed on Israel, a separate source from the group told AFP.\nHizbollah said it launched a heavy rocket attack at an Israeli army barracks in the country’s north “in retaliation” for the Naqura strike, while also announcing other attacks on Israeli positions.\nThe violence has raised fears of all-out conflict between Hizbollah and Israel, which went to war in 2006."}, {"id": "f03ccc1d-6506-4457-a40b-ed00d1aee838", "title": "Iran president dies in helicopter crash – Boston Herald", "date": "2024-05-21 04:15", "url": "https://www.bostonherald.com/2024/05/20/irans-president-dies-in-helicopter-crash/", "message": "Iran has offered no cause for the crash nor suggested sabotage brought down the helicopter, which fell in mountainous terrain in a sudden, intense fog.\nIn Tehran, Iran’s capital, businesses were open and children attended school Monday.\nLater in the day, hundreds of mourners crowded into downtown Vali-e-Asr square holding posters of Raisi and waving Palestinian flags.\nIran-backed Hamas led the attack that started the conflict, and Hezbollah, also supported by Tehran, has fired rockets at Israel.\nThe crash killed all eight people aboard a Bell 212 helicopter that Iran purchased in the early 2000s, according to the state-run IRNA news agency."}, {"id": "b7ceb74a-17ff-4c02-aa38-a3093caf137c", "title": "Ukraine Situation Report : Russia Advances On Vovchansk", "date": "2024-05-21 01:45", "url": "https://www.yahoo.com/news/ukraine-situation-report-russia-advances-235510096.html", "message": "Previously, Russia claimed its forces had entered Vovchansk , something that Ukraine has denied.\nRussian forces continue their attacks near Starytsya and in the direction of Prylipka (both southwest of Vovchansk) and near Tykhe (east of Vovchansk).\nHe said: “The enemy continues to try, especially inside Vovchansk, to push the Ukrainian armed forces out of the town.\nhttps://www.twitter.com/kromark/status/1792515295371743744There is also talk of a Russian attack on the Ukrainian airbase at Mirgorod in central Ukraine.\nNow, we have a video showing the explosive demise of one of these air defense systems, as the result of a Ukrainian drone strike."}, {"id": "b0f0060b-2e63-4818-92de-1de4a9d6562a", "title": "Zelensky : Every Limitation Of Russia Terrorist Potential Is Forcing It To Peace", "date": "2024-05-21 00:00", "url": "https://menafn.com/1108236875/Zelensky-Every-Limitation-Of-Russias-Terrorist-Potential-Is-Forcing-It-To-Peace", "message": "(MENAFN- UkrinForm) The basis of Kremlin leader Vladimir Putin's capabilities is terror, so every restriction on Russia's terrorist potential is a compulsion to peace.\nAnd every restriction on the terrorist potential of the Russian Federation is forcing Russia to peace.\nOur weapons to defend Ukrainian positions, our joint diplomatic efforts for the sake of the Peace Formula, our work for Russia's legal responsibility for the war - all this brings peace closer,\" he said.\n\"This brings us back to the need for air defence - for additional defence systems that could significantly reduce the difficulties for our soldiers and the threat to our cities and communities.\nI am grateful to all our partners who understand this need and its importance - the real strategic power of air defence in this war,\" Zelensky said."}, {"id": "799d055e-8c75-456b-88d3-9ac50fe194d2", "title": "Helicopter crash that killed Iran president and others could reverberate across the Middle East", "date": "2024-05-21 03:00", "url": "https://www.thegazette.com/nation-world/helicopter-crash-that-killed-irans-president-and-others-could-reverberate-across-the-middle-east/", "message": "(AP Photo/Alexander Zemlianichenko)JERUSALEM (AP) — The helicopter crash in which Iranian President Ebrahim Raisi, the country’s foreign minister and other officials were killed is likely to reverberate across the Middle East, where Iran’s influence runs wide and deep.\nIsrael is believed to have carried out numerous attacks over the years targeting senior Iranian military officials and nuclear scientists.\nThe apparent crash of a helicopter carrying Iranian President Ebrahim Raisi, the country's foreign minister and other top officials is likely to reverberate across the Middle East.\nIran has always insisted its nuclear program is for purely peaceful purposes, but the United States and others believe it had an active nuclear weapons program until 2003.\nIsrael is widely believed to be the only nuclear-armed power in the Middle East but has never acknowledged having such weapons."}, {"id": "5304d1af-07c2-4813-bb89-7e9d4b3511d4", "title": "ICC warrant unlikely to bring change to operations in Israel - Hamas war", "date": "2024-05-21 02:15", "url": "https://kpic.com/news/nation-world/icc-warrant-unlikely-to-bring-change-to-operations-in-israel-hamas-war-international-criminal-court-war-crime-benjamin-netanyahu-yoav-gallant-yahya-sinwar-muhammad-deif-ismail-haniyeh", "message": "Neither Israel nor the United States are member states of the ICC, but it will still complicate tense diplomatic issues connected to the war.\nThe ICC’s warrant request is unlikely to change either side’s military objectives moving forward.\nIsraeli War Cabinet member Benny Gantz and Netanyahu critic rejecting Khan’s claims in a statement Monday morning.\nMore than half of Gaza’s population had fled to the city and its surrounding areas amid the war between Israel and Hamas.\nRepublican lawmakers in Congress have blasted the court for targeting Israeli leaders with warrants, threatening to pull U.S. support for it and to levy sanctions against it."}, {"id": "02f6d8f0-b3ca-4ec8-b700-a2f8c3c8b0f6", "title": "Progressive senator backs potential ICC arrest warrant for Netanyahu :  Unprecedented war  ", "date": "2024-05-21 00:00", "url": "https://www.yahoo.com/news/progressive-senator-backs-potential-icc-210442330.html", "message": "\"The ICC prosecutor is right,\" Sanders said in a statement Monday afternoon on X.\n\"These arrest warrants may or may not be carried out, but it is imperative that the global community uphold international law.\nNETANYAHU RIVAL THREATENS TO QUIT WAR CABINET OVER GAZA STRATEGYSen. Bernie Sanders agreed with the ICC prosecutor Monday afternoon.\nNETANYAHU ARREST WARRANT CALLED ‘GIFT TO TERRORISTS’ AS PRO-ISRAEL LAWMAKERS VOW REVENGEMeanwhile, House GOP lawmakers called the ICC's petition for arrest warrants \"a gift to terrorists around the globe.\"\nOriginal article source: Progressive senator backs potential ICC arrest warrant for Netanyahu: 'Unprecedented war'"}, {"id": "47968aef-eadd-45c8-b3ad-fd9f7c5c8876", "title": "Navy  Hell Hound Squadron Crafting Missions for Small , Lethal Drone Fleet", "date": "2024-05-21 00:45", "url": "https://news.usni.org/2024/05/20/navy-hell-hounds-squadron-crafting-missions-for-small-lethal-drone-fleet", "message": "CORONADO, Calif. – The Navy on Friday took another step toward creating a surface fleet seamlessly integrated with uncrewed vessels by formally establishing its second unmanned surface drone unit.\nWell before Friday’s establishment ceremony, the first groups of USVRON-3 plankholders had put their small USVs through initial paces with fleet units, officials said.\nSmall USVs will be developed with five missions in mind, he added: maritime security; antiair warfare; surface warfare; antisubmarine warfare and intelligence, surveillance and reconnaissance.\nStill, small USVs present a challenge, said Thompson.\n“The integration of small USVs into fleet operations and exercise[s] will increase our planning options and enhance our warfighting capabilities at a reduced risk to forces and at a reduced cost.”"}, {"id": "0ea9d5db-13f1-48a8-9fc2-f3723b1851bc", "title": "Helicopter crash that killed Iran president and others could reverberate across Middle East", "date": "2024-05-21 02:00", "url": "https://www.stripes.com/theaters/middle_east/2024-05-20/death-iran-president-upheaval-middle-east-13916464.html", "message": "(Vahid Salemi/AP)JERUSALEM — The helicopter crash in which Iranian President Ebrahim Raisi, the country’s foreign minister and other officials were killed is likely to reverberate across the Middle East, where Iran’s influence runs wide and deep.\nIsrael is believed to have carried out numerous attacks over the years targeting senior Iranian military officials and nuclear scientists.\nThere is no evidence Israel was involved in Sunday’s helicopter crash, and Israeli officials have not commented on the incident.\nIran has always insisted its nuclear program is for purely peaceful purposes, but the United States and others believe it had an active nuclear weapons program until 2003.\nIsrael is widely believed to be the only nuclear-armed power in the Middle East but has never acknowledged having such weapons."}, {"id": "f508d37c-2a20-4d58-ada9-852881c11277", "title": "Two dead in stabbing at central China primary school", "date": "2024-05-21 00:00", "url": "https://www.thenews.com.pk/print/1191438-two-dead-in-stabbing-at-central-china-primary-school", "message": "A police cordon is placed in the aftermath of a stabbing attack at a kindergarten in Lianjiang county, Guangdong province, footage from social media shows.\n— Reuters/fileBEIJING: A woman wielding a fruit knife killed two people and injured four more on Monday at a primary school in central China, state media said, citing local police.\nThe assault took place around midday in the city of Guixi in Jiangxi province, state broadcaster CCTV said.\nThe suspect, a 45-year-old surnamed Pan, is being held by police and the case is under investigation, CCTV said.\nMass violent crime is relatively rare in China, which strictly prohibits citizens from owning firearms, but there has been a spate of stabbings in recent years."}, {"id": "c87401bc-9894-4430-af2d-5149dccf86bd", "title": "Iran helicopter crash could reverberate across Middle East", "date": "2024-05-21 02:15", "url": "https://apnews.com/article/iran-helicopter-raisi-israel-hezbollah-hamas-yemen-f5145ec19b169417d3b40a50ca9ff5b0", "message": "JERUSALEM (AP) — The helicopter crash in which Iranian President Ebrahim Raisi, the country’s foreign minister and other officials were killed is likely to reverberate across the Middle East, where Iran’s influence runs wide and deep.\nThere is no evidence Israel was involved in Sunday’s helicopter crash, and Israeli officials have not commented on the incident.\n(AP Photo/Vahid Salemi)BEYOND THE MIDDLE EASTIran’s influence extends beyond the Middle East and its rivalry with Israel.\nIran has always insisted its nuclear program is for purely peaceful purposes, but the United States and others believe it had an active nuclear weapons program until 2003.\nIsrael is widely believed to be the only nuclear-armed power in the Middle East but has never acknowledged having such weapons."}, {"id": "ba3b8f16-1425-475b-a4ba-deecfff8558f", "title": "Netanyahu , Hamas both decry war crime warrants", "date": "2024-05-21 00:30", "url": "https://www.canberratimes.com.au/story/8635320/netanyahu-hamas-both-decry-war-crime-warrants/?cs=14329", "message": "Israel is not a member of the court, so even if the arrest warrants are issued, Netanyahu and Gallant do not face any immediate risk of prosecution.\nBut the threat of arrest could make it difficult for the Israeli leaders to travel abroad."}, {"id": "94ba0606-85d8-435f-943e-dde1cf639ed8", "title": "The Biden administration should have ignored Raisi death rather than memorialize him", "date": "2024-05-21 00:15", "url": "https://www.washingtonexaminer.com/opinion/beltway-confidential/3009442/biden-administration-ignore-raisi-death-memorialize/", "message": "The Biden administration has made a strategic error by memorializing Iranian President Ebrahim Raisi.\nFor a start, the cursory hat tip to Iranian human rights is laughable.\nRaisi, after all, spent his life ensuring the destruction of Iranian human rights.\nA far more appropriate response would have been to simply ignore Raisi’s death.\nAt the very least, the Biden administration dishonors Raisi’s victims and those he would have helped to kill had Iran’s various plots not been detected."}, {"id": "0b05c92f-56b9-43b8-b85f-1adf15187936", "title": "Israel plans to expand Rafah operation despite US concerns", "date": "2024-05-21 03:15", "url": "https://www.yahoo.com/news/israel-plans-expand-rafah-operation-012906317.html", "message": "Gallant also presented humanitarian aid plans for the population of the Gaza Strip.\nSullivan stressed the importance of Israel and Egypt concluding their talks on the reopening of the Rafah border crossing.\nHumanitarian workers must be able to safely deliver aid to those in need throughout the Gaza Strip, Sullivan said.\nMany of them are refugees from other parts of the Gaza Strip who had sought refuge in its southernmost point.\nThe Hamas-controlled health authority reported the deaths on Sunday of at least 24 Palestinians in the Nuseirat refugee camp in the centre of the Gaza Strip."}, {"id": "8b05a015-ddf5-4b40-9591-2a33d10610c2", "title": "Explosion kills 1 , injures 3 in Afghanistan Kandahar", "date": "2024-05-21 02:15", "url": "https://www.khaama.com/explosion-kills-1-injures-3-in-afghanistans-kandahar/", "message": "Sources in Kandahar province, which had previously confirmed explosions in the province, say that this explosion also resulted in casualties.\nAccording to a source, on Monday, May 20, an explosion occurred at the ‘Kabul Station’ in the central district of this province, resulting in several deaths and injuries.\nMullah Asadullah Jamshid, spokesperson for the security command in Kandahar, also confirmed the explosion and stated that one civilian was killed and three others were injured.\nMedia outlets, citing their sources in Kandahar, have reported that yesterday’s explosion was caused by a planted mine in a stall resulting in 6 deaths and over 10 injuries.\nIt is worth noting that this is the second explosion to occur in Kandahar since the beginning of the current solar year."}]