[{"id": "93edb0a5-068c-4bce-ae07-da20ec8a10dd", "title": "Israel celebration by Jewish groups at Detroit Zoo stirs pride and protest", "date": "2024-06-08 13:45", "url": "https://www.yahoo.com/news/israel-celebration-jewish-groups-detroit-100157540.html", "message": "More than 1,500 people from Michigan's Jewish community attended the event, said an official with Jewish Federation of Detroit.\nThe gathering on May 28th at the Detroit Zoo was a vivid illustration of the close bonds that metro Detroit's Jewish community has with Israel.\nComments on the Instagram page of the Detroit Zoo were flooded with people opposed to the Israel event.\nCamels at the Detroit Zoo, seen on May 28, 2024, during an event celebrating Israel's independence day organized by local Jewish groups.\nContact Niraj Warikoo:nwarikoo@freepress.com or X @nwarikooThis article originally appeared on Detroit Free Press: Jewish groups in metro Detroit hold event for Israel at Detroit Zoo"}, {"id": "cd9fa3b6-8e30-401f-81e4-2809fcb17060", "title": "NJ high school yearbook replaces Jewish group with Muslim students", "date": "2024-06-08 19:30", "url": "https://www.nydailynews.com/2024/06/08/east-brunswick-nj-yearbook-antisemitism-jewish-student-union/", "message": "A New Jersey school district has hired an outside law firm to investigate how and why a Jewish student group was erased from the high school yearbook, with the members’ names omitted from the page and their photo replaced with a picture of a group of Muslim students.\n“They’ve been given complete authority to investigate whatever they need to investigate.”The superintendent apologized previously for “the hurt, pain and anguish this event has caused our Jewish students” and offered a separate apology to Muslim students.\n“Hate has no place in East Brunswick and antisemitism will not be tolerated,” he said.\nThe situation came to light Tuesday after about 375 yearbooks were distributed at East Brunswick High.\nDiscipline could be warranted depending on the outcome of the probe, and a corrective plan will be developed for the yearbook, Valeski said."}, {"id": "5ac093fd-dee0-4255-bc35-12807406251d", "title": "Adam Shatz · Israel Descent", "date": "2024-06-08 10:15", "url": "https://www.lrb.co.uk/the-paper/v46/n12/adam-shatz/israel-s-descent", "message": "But it also reveals the extent to which Israeli Jews inhabit what Jean Daniel called ‘the Jewish prison’.\nThe leading expert in the US on the Palestinian refugees, Don Peretz, was employed by the American Jewish Committee (AJC).\nAnd in the wake of the Six-Day War in 1967, the American Jewish community underwent what Norman Podhoretz called a ‘complete Zionisation’.\nAmong many young American Jewish liberals, this contradiction has proved intolerable: Jewish students have made up an unusually high number of the protesters on campus.\nToday it is difficult to imagine an alliance between Palestinians and progressive Israeli Jews of the kind that flickered during the First Intifada."}, {"id": "78dbd1e2-a540-4255-8f0e-d7c9d996f076", "title": "East Brunswick High School yearbook : A Jewish student group photo was replaced with a picture of Muslim students", "date": "2024-06-08 16:15", "url": "https://www.cnn.com/2024/06/08/us/east-brunswick-high-school-yearbook-reaj/", "message": "CNN —An investigation is underway after seniors at East Brunswick High School in New Jersey received yearbooks this week with a Jewish Student Union photo replaced by a photo of Muslim students, the superintendent said.\nEast Brunswick Mayor Brad Cohen called the incident a “blatant Anti-Semitic act.”“The action resulted in a picture of Muslim students replacing the original photograph of the Jewish students,” the mayor posted on Facebook.\nZain expressed sympathy for the Jewish community and described the Islamophobia he’s endured since seeing his face in the misplaced photo.\nThe high school junior questioned the differing responses to the Jewish community and the Muslim community.\nThe new page will include a photo of the actual Jewish Student Union and the names of the club’s members."}, {"id": "88823b7f-bdf0-4be6-a515-2c4254fb4ba7", "title": "East Brunswick High School yearbook : A Jewish student group photo was replaced with a picture of Muslim students", "date": "2024-06-08 17:15", "url": "https://us.cnn.com/2024/06/08/us/east-brunswick-high-school-yearbook-reaj/", "message": "CNN —An investigation is underway after seniors at East Brunswick High School in New Jersey received yearbooks this week with a Jewish Student Union photo replaced by a photo of Muslim students, the superintendent said.\nEast Brunswick Mayor Brad Cohen called the incident a “blatant Anti-Semitic act.”“The action resulted in a picture of Muslim students replacing the original photograph of the Jewish students,” the mayor posted on Facebook.\nZain expressed sympathy for the Jewish community and described the Islamophobia he’s endured since seeing his face in the misplaced photo.\nThe high school junior questioned the differing responses to the Jewish community and the Muslim community.\nThe new page will include a photo of the actual Jewish Student Union and the names of the club’s members."}, {"id": "ce992d15-4d34-48e4-8a64-32ba743b2493", "title": "A New Jersey school district is looking for answers after a photo with Muslim students replaced a Jewish group in a yearbook", "date": "2024-06-08 17:00", "url": "https://ktvz.com/news/national-world/cnn-national/2024/06/08/a-new-jersey-school-district-is-looking-for-answers-after-a-photo-with-muslim-students-replaced-a-jewish-group-in-a-yearbook/", "message": "East Brunswick Mayor Brad Cohen called the incident a “blatant Anti-Semitic act.”“The action resulted in a picture of Muslim students replacing the original photograph of the Jewish students,” the mayor posted on Facebook.\nZain expressed sympathy for the Jewish community and described the Islamophobia he’s endured since seeing his face in the misplaced photo.\nThe high school junior questioned the differing responses to the Jewish community and the Muslim community.\n“As I mentioned impacts to our Jewish students and families earlier today, I want to offer sincere apologies to our Muslim students and families, as well,” Valeski wrote Wednesday.\nThe new page will include a photo of the actual Jewish Student Union and the names of the club’s members."}, {"id": "0f035739-414d-4b83-9b87-49ca295e5e92", "title": "How Toronto police are tackling the alarming rise in hate crimes", "date": "2024-06-08 12:15", "url": "https://www.cbc.ca/news/thenational/hate-crimes-toronto-1.7228778", "message": "Our crew could meet detectives from the force's Hate Crimes Unit on site.\nA few minutes later, detectives Kiran Bisla and Pat Alberga from the Hate Crimes Unit arrived and noted the several broken windows.\nSince Oct. 7, the Hate Crimes Unit has expanded from a team of six to 32 and has responded to more than a thousand such reports, up from 225 in the previous year.\nPolice say more than half of the hate crimes reported this year have targeted Jewish people.\nWATCH | Hate crimes on the rise: Synagogue vandalized again Duration 1:04 Toronto’s Hate Crime Unit has responded to over a thousand hate-related reports since the beginning of the Israel-Hamas war."}, {"id": "3d7cbbe5-325d-4266-8f44-5514db04e938", "title": "Will the Olympics committee play fair with Israeli swimmers ? | WND", "date": "2024-06-08 17:30", "url": "https://www.wnd.com/2024/06/will-olympics-committee-play-fair-israeli-swimmers/", "message": "Will the Olympics committee play fair with Israeli swimmers?\nDeciding not to move the World Championship out of Qatar rankled advocates for fair treatment of Jewish and Israeli athletes in all sports.\nOther efforts to discriminate against or treat Jewish or Israeli athletes differently this year have sparked international controversy.\n“Intimidation and harassment of Israeli athletes, sadly, is nothing new,” May told RealClearPolitics in an interview.\n“[Anastasia] Gorbenko’s unfortunate experience is a testament to the resilience and spirit of Israeli athletes,” Spitz said."}, {"id": "70492960-2982-4594-a0ee-5c7db1873b72", "title": "Genesis Prize Marks Tenth Anniversary by Honoring Barbra Streisand", "date": "2024-06-08 03:15", "url": "https://www.theautochannel.com/news/2024/06/07/1391209-genesis-prize-marks-tenth-anniversary-by-honoring-barbra-streisand.html", "message": "(https://www.genesisprize.org/honorees)Founder and Chairman of The Genesis Prize Foundation Stan Polovets said: \"The entire world knows and adores Barbra Streisand as a singer, actress, and director.\nBarbra Streisand stated: \"I am delighted to be honored by the special 10th Anniversary Genesis Prize and to work with The Genesis Prize Foundation to support organizations that acknowledge our shared humanity and seek to better our society.\nAll Genesis Prize laureates donate their $1 million prize to philanthropic causes.\nShe founded the Barbra Streisand Women's Heart Center at Cedars-Sinai to support research and raise awareness about women's heart disease.\nAbout The Genesis Prize FoundationThe Genesis Prize is a global award that celebrates Jewish achievement and contribution to humanity."}, {"id": "586d909f-d569-4f3a-ae48-f830101dc824", "title": "Valley News - Dartmouth commencement marks end to trying , tumultuous year", "date": "2024-06-08 03:00", "url": "https://www.vnews.com/Sunday-s-commencement-marks-the-close-of-a-challenging-year-for-Dartmouth-55416821", "message": "Teevens, a Dartmouth alum with a national profile in football, was in many ways the charismatic face of the college.\nSo it came as something of a shock on Sept. 19 when news broke that Teevens, 66, had died, ushering in a season of grief on the Dartmouth campus.\nSurgeon General Vivek Murthy and all six of his living predecessors visited the Dartmouth campus in September for forums and events related to Beilock’s mental health and wellness initiative.\nAs a condition of their bail, the arrested Dartmouth students were banned from the Green and from entering Parkhurst Hall, the campus’ administrative building.\nThe governing board “supports the difficult decisions President Beilock made,” Chairperson Liz Lempres said by email Thursday."}]