[{"id": "de903875-cc07-4d18-8896-ef4fc25ffb5b", "title": "Wildfire danger in Eagle County is pretty low , thanks to a cool , moist spring", "date": "2024-05-16 03:00", "url": "https://www.vaildaily.com/news/eagle-county-fire-danger-low-spring/", "message": "Mitigation efforts over the past several years have helped reduce the risk of wildfire, but nothing helps keep fire danger at bay like a lot of snow and a cool, moist spring.\nBirch Barron, the county’s emergency management director, on Tuesday updated the Eagle County Board of Commissioners on current wildfire conditions in the area.\nBut, he noted, no part of Eagle County was in any form of drought at the end of April, adding that the county was bordering on “abnormally dry” at the end of April in 2023.\nThat snow is coming off fairly slowly, again thanks to a reasonably cool spring so far.\nThe good news from the cooler spring conditions applies to spring runoff."}, {"id": "6d2ab401-09e1-401e-8cae-6a0e17468102", "title": "Why is Texas prone to flooding in the spring ? Here how to find out if your home is in danger", "date": "2024-05-16 20:30", "url": "https://www.yahoo.com/news/why-texas-prone-flooding-spring-194351878.html", "message": "Texas is frequently battered by storm after storm in the spring, leaving a soggy landscape with nowhere to let all the rain out.\nTexas’ version of the water cycle frequently causes flooding because of the state’s diverse terrain and location along the Gulf of Mexico.\nA Blue Ribbon Study found that Texas had 4,722 flash floods during the 14-year period from 1986 to 2000.\nTypes of flooding most common in TexasGiven that Texas is located in “flash flood alley,” it is not shocking that more than 500 flash floods have been reported in the previous ten years.\nThe most vulnerable time of year for flooding in Texas depends on the type of flood."}, {"id": "7e9e0e85-a92e-4b5b-91e9-a1304aa483f9", "title": "Texas and Louisiana flooding : Rare high risk of extreme rainfall to trigger  life - threatening  flooding", "date": "2024-05-16 15:30", "url": "https://us.cnn.com/2024/05/16/weather/south-flooding-texas-louisiana-climate/", "message": "CNN —A dangerous, life-threatening flash flooding event is unfolding Thursday as torrential storms pound the already-soaked South.\nA rare Level 4 of 4 high risk of excessive rainfall was issued for parts of eastern Texas and western Louisiana by the Weather Prediction Center Thursday.\nTexas and Louisiana have been in the bull’s-eye of seemingly unrelenting rounds of torrential, flooding downpours since the start of April.\nRainfall rates up to 3 inches per hour are possible in the heaviest storms, which could lead to life-threatening flash flooding, according to the WPC.\nSerious flash flooding is likely in any areas caught under multiple storms unloading 2 to 3 inches of rain per hour."}, {"id": "301f969e-20d8-4c94-827b-c81e657ec1c4", "title": "Flood - Prone Houston Faces a Deluge of More Rain : Weather Watch", "date": "2024-05-16 18:45", "url": "https://www.insurancejournal.com/news/southcentral/2024/05/16/774512.htm", "message": "Heavy rain will sweep across eastern Texas into Louisiana and Mississippi on Thursday, raising flood risks across the Gulf of Mexico states.\nFlood watches have been posted from Dallas and Houston eastward across Louisiana and Mississippi.\nFlood-prone Houston saw waters rising earlier this month, closing roads, affecting energy supplies and sending residents fleeing.\nModerate geomagnetic storms are likely in coming days, the US Space Weather Prediction Center said.\nTopics Texas Louisiana Flood Mississippi"}, {"id": "8fc6df7b-1b78-4f79-be1d-2cc81e215f21", "title": "Flood - Prone Houston Faces a Deluge of More Rain : Weather Watch", "date": "2024-05-16 16:45", "url": "https://www.bnnbloomberg.ca/flood-prone-houston-faces-a-deluge-of-more-rain-weather-watch-1.2074027", "message": "Heavy rain will sweep across eastern Texas into Louisiana and Mississippi on Thursday, raising flood risks across the Gulf of Mexico states.\nFlood watches have been posted from Dallas and Houston eastward across Louisiana and Mississippi.\nFlood-prone Houston saw waters rising earlier this month, closing roads, affecting energy supplies and sending residents fleeing.\nOravec said the heaviest rains will move east into Louisiana and Mississippi, giving Texas a potential respite on Friday.\nModerate geomagnetic storms are likely in coming days, the US Space Weather Prediction Center said."}, {"id": "2f24e822-d1a8-430e-83e8-e410aeb2a228", "title": "Tornado warning goes up as severe storms near Houston", "date": "2024-05-16 23:15", "url": "http://www.houstonchronicle.com/news/houston-weather/forecast/article/houston-severe-weather-tornado-watch-19462273.php", "message": "Strong storms arrive late Thursday afternoon north of Houston and will push into Houston around the time of the evening commute.\nThose under the tornado watch need to be prepared to seek shelter immediately if a tornado warning is issued for your location.\nIf you do not have a basement or storm shelter, seek shelter in an interior closet in the lowest level of your home.\nAdvertisement Article continues below this adScattered strong storms have been ongoing north of I-10 early Thursday afternoon.\nStrong storms will arrive north of I-10 by the evening commute and will push into Houston after commuters hit the road."}, {"id": "9d1b49d4-7966-4954-9ee6-f433f0bdf1b5", "title": "Oregon officials say 2024 fire season threat slightly less than 2023", "date": "2024-05-16 05:45", "url": "https://www.kptv.com/2024/05/16/oregon-officials-say-2024-fire-season-threat-slightly-less-than-2023/", "message": "PORTLAND Ore. (KPTV) - The threat of wildfires in Oregon for summer 2024 should be less than last year, at least for the early summer months, state forestry experts said on Wednesday.\nThat’s according to experts with the state’s forestry department - who provided a look at what we can expect as wildfire season approaches.\nOregon saw a considerable amount of rain and snow throughout the winter months, building a strong snowpack.\nTina Kotek, said this could mean more complex and challenging wildfire conditions in the later summer months.\nThe Department of Forestry said it’s preparing for the season by making sure resources are in place to fight fires when they do start, including new modernized equipment."}, {"id": "d0a71714-e24e-41e0-a7cb-6dc00fa0e9a0", "title": "Moderate earthquake : M5 . 3 quake has struck near Tobelo in Indonesia", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-m5-3-quake-has-struck-near-tobelo-in-indonesia/", "message": "A moderate earthquake with magnitude 5.3 (ml/mb) was detected on Tuesday, 152 km WNW of Tobelo, Indonesia (94 miles).\nThe earthquake occurred at a depth of 35 km (22 miles) below the earth’s surface.\nExact location of earthquake, 126.7684° East, 2.3081° North, depth 35 km.\nDate and time of earthquake in UTC/GMT: 30/04/24 / 2024-04-30 13:52:43 / April 30, 2024 @ 1:52 pm.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 152 km WNW of Tobelo, Indonesia."}, {"id": "ef67b8b7-a67d-49d4-a12b-9cf549224dd3", "title": "Moderate earthquake 5 . 3 mag , South Sandwich Islands region", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-south-sandwich-islands-region-2/", "message": "A moderate earthquake magnitude 5.3 (ml/mb) has occurred on Thursday, South Sandwich Islands region (0 miles).\nExact location of earthquake, -27.01° West, -55.8567° South, depth 12.416 km.\nIds that are associated to the earthquake: us6000mvmb.\nIn the past 24 hours, there have been twelve, in the last 10 days fourteen, in the past 30 days sixteen and in the last 365 days sixteen earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: South Sandwich Islands region."}, {"id": "d98b08c6-96d4-4ae9-8468-8b6cc2a7c8c9", "title": "Moderate earthquake 5 . 2 mag , 195 km SE of Akutan , Alaska", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-195-km-se-of-akutan-alaska/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) has occurred on Sunday, 195 km SE of Akutan, Alaska (121 miles).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 5.2-magnitude earthquake has occurred at 08:27:46 / 8:27 am (local time epicenter).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 195 km SE of Akutan, Alaska."}, {"id": "ccece27d-9595-4398-8c3e-ca58bad39bfe", "title": "Moderate earthquake : M5 . 1 quake has struck near western Xizang", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-m5-1-quake-has-struck-near-western-xizang-2/", "message": "A moderate earthquake magnitude 5.1 (ml/mb) has struck on Thursday, western Xizang (0 miles).\nThe 5.1-magnitude earthquake has occurred at 17:40:02 / 5:40 pm (local time epicenter).\nId of earthquake: us7000mczb.\nThe earthquake occurred at a depth of 10 km (6 miles).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: western Xizang."}, {"id": "4888c56f-ba99-4348-8be7-d30353322611", "title": "Moderate earthquake , 5 . 4 mag was detected near Kermadec Islands , New Zealand", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-4-mag-was-detected-near-kermadec-islands-new-zealand/", "message": "A moderate earthquake with magnitude 5.4 (ml/mb) was detected on Sunday, Kermadec Islands, New Zealand (0 miles).\nExact time and date of earthquake 12/05/24 / 2024-05-12 03:26:19 / May 12, 2024 @ 3:26 am UTC/GMT.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvery year there are an estimated 1320 moderate earthquakes in the world.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: Kermadec Islands, New Zealand."}, {"id": "8a753f14-349b-456e-9c6f-72e68280e7cd", "title": "State wildfire agencies prepared to respond to fire season but will need more staff in future", "date": "2024-05-16 00:15", "url": "https://www.yahoo.com/news/state-wildfire-agencies-prepared-respond-225435339.html", "message": "Oregon wildfire officials said they are increasing the scale of prescribed burns across the state to prevent severe wildfires.\nOregon wildfire officials said they are increasing the scale of prescribed burns across the state to prevent severe wildfires.\nAt a news conference Wednesday, the leaders of the Oregon Department of Forestry, the Oregon State Fire Marshal and the Oregon Department of Emergency Management discussed the upcoming wildfire season, which typically begins in mid-May.\n“This is all trying to get (the land) health back to a more natural state,” Cline said.\nThe post State wildfire agencies prepared to respond to fire season but will need more staff in future appeared first on Oregon Capital Chronicle."}, {"id": "cd9b631a-f09f-4240-9590-e86be50f22c4", "title": "Moderate earthquake , 5 . 3 mag has occurred near Kermadec Islands , New Zealand", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-has-occurred-near-kermadec-islands-new-zealand/", "message": "A moderate earthquake magnitude 5.3 (ml/mb) has struck on Sunday, Kermadec Islands, New Zealand (0 miles).\nExact time and date of earthquake 05/05/24 / 2024-05-05 06:15:37 / May 5, 2024 @ 6:15 am UTC/GMT.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nExact location of earthquake, longitude -178.6294 West, latitude -29.4481 South, depth = 216.068 km.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: Kermadec Islands, New Zealand."}, {"id": "9fd73ab4-5686-4551-9491-309f5f356883", "title": "Moderate earthquake , 5 . 4 mag was detected near Pacific - Antarctic Ridge", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-4-mag-was-detected-near-pacific-antarctic-ridge-2/", "message": "A moderate earthquake magnitude 5.4 (ml/mb) strikes Pacific-Antarctic Ridge (0 miles) on Tuesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us6000myih.\nEvery year there are an estimated 1320 moderate earthquakes in the world.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: Pacific-Antarctic Ridge."}, {"id": "4bf5cfcb-1d5a-484d-b11b-0e5e0f50edc4", "title": "Moderate earthquake , 5 . 2 mag strikes near Vanuatu region", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-strikes-near-vanuatu-region/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) has occurred on Monday, Vanuatu region (0 miles).\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nThe 5.2-magnitude earthquake has occurred at 13:33:38 / 1:33 pm (local time epicenter).\nEach year there are an estimated 1320 moderate earthquakes in the world.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: Vanuatu region."}, {"id": "d7e13668-0374-4771-88d9-01e928f54530", "title": "Moderate earthquake : M5 . 2 quake has struck near Finschhafen in Papua New Guinea", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-m5-2-quake-has-struck-near-finschhafen-in-papua-new-guinea-2/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) strikes 84 km SE of Finschhafen, Papua New Guinea (52 miles) on Thursday.\nDate and time of earthquake in UTC/GMT: 16/05/24 / 2024-05-16 03:48:01 / May 16, 2024 @ 3:48 am.\nThe earthquake was roughly at a depth of 10 km (6 miles).\nEvent ids that are associated to the earthquake: us6000mywa.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 84 km SE of Finschhafen, Papua New Guinea."}, {"id": "bce3ee13-c3b8-4f1e-a9e1-3eb4f7fff6c2", "title": "Moderate earthquake , 5 . 2 mag was detected near Kandrian in Papua New Guinea", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-was-detected-near-kandrian-in-papua-new-guinea/", "message": "A moderate earthquake with magnitude 5.2 (ml/mb) was reported 113 km WNW of Kandrian, Papua New Guinea (70 miles) on Monday.\nThe 5.2-magnitude earthquake was detected at 12:32:35 / 12:32 pm (local time epicenter).\nIds that are associated to the earthquake: us6000my9b.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 113 km WNW of Kandrian, Papua New Guinea."}, {"id": "a85a0f23-b141-4920-a82f-ecfd4d82effb", "title": "Looming fires force thousands of Canadians to evacuate . Some may not return home until next week", "date": "2024-05-16 07:00", "url": "https://www.cnn.com/2024/05/16/weather/canada-wildfires-fort-mcmurray-climate-thursday/", "message": "CNN —Colossal wildfires burning across Canada over the last week have driven thousands of people to evacuate with their kids, pets and precious belongings in tow – many uncertain when they may be able to return home.\nMore than 6,000 people have evacuated from Fort McMurray in Alberta since Tuesday as a 51,000 acre fire burns less than 5 miles from the city’s edge.\nFlames and smoke fill the air as wildfires burn nearby in Fort McMurray, Alberta, Canada on May 2016.\nCourtesy Jocelyn Routhier Flames and smoke fill the air as wildfires burn nearby in Fort McMurray, Alberta, Canada on May 14, 2024.\nCourtesy Jocelyn Routhier Fort McMurray resident Jocelyn Routhier photographed the 2016 and May 2024 fires from the same spot on her porch."}, {"id": "55df44db-e155-4b37-a479-dac09054ad69", "title": "Moderate earthquake , 5 . 3 mag has occurred near central East Pacific Rise", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-has-occurred-near-central-east-pacific-rise/", "message": "A moderate earthquake magnitude 5.3 (ml/mb) strikes central East Pacific Rise (0 miles) on Monday.\nId of earthquake: us6000my7f.\nExact location of earthquake, -103.7904° West, -4.0317° South, depth 10 km.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: central East Pacific Rise."}, {"id": "9b91c1e0-2026-4306-b847-e39700b5e9dd", "title": "Moderate earthquake 5 . 1 mag , Kermadec Islands region", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-1-mag-kermadec-islands-region-7/", "message": "A moderate earthquake magnitude 5.1 (ml/mb) has struck on Sunday, Kermadec Islands region (0 miles).\nThe earthquake occurred at a depth of 46.324 km (29 miles).\nEvery year there are an estimated 1320 moderate earthquakes in the world.\nIn the past 24 hours, there have been six, in the last 10 days seven, in the past 30 days seven and in the last 365 days seven earthquakes of magnitude 3.0 or greater that has occurred nearby.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: Kermadec Islands region."}, {"id": "ebeb777f-d084-452b-ad8a-721caf39469d", "title": "Moderate earthquake , 5 . 3 mag has occurred near Mid - Indian Ridge", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-has-occurred-near-mid-indian-ridge-3/", "message": "A moderate earthquake magnitude 5.3 (ml/mb) has occurred on Saturday, Mid-Indian Ridge (0 miles).\nDate and time of earthquake in UTC/GMT: 27/04/24 / 2024-04-27 01:44:21 / April 27, 2024 @ 1:44 am.\nThe earthquake occurred at a depth of 10 km (6 miles) below the earth’s surface.\nIn the past 24 hours, there have been thirty-nine, in the last 10 days thirty-nine, in the past 30 days thirty-nine and in the last 365 days thirty-nine earthquakes of magnitude 3.0 or greater that have been detected in the same area.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: Mid-Indian Ridge."}, {"id": "817ee946-555e-4d00-b8e7-8321184a6fb2", "title": "Moderate earthquake , 5 . 2 mag has occurred near Houma in Tonga", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-has-occurred-near-houma-in-tonga/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) strikes 153 km WSW of Houma, Tonga (95 miles) on Sunday.\nThe earthquake occurred at a depth of 168.178 km (105 miles) below the earth’s surface.\nThe 5.2-magnitude earthquake has occurred at 12:55:52 / 12:55 pm (local time epicenter).\nEach year there are an estimated 1320 moderate earthquakes in the world.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 153 km WSW of Houma, Tonga."}, {"id": "3d538912-0129-4678-aaaf-f27e61df73c1", "title": "Moderate earthquake : M5 . 2 quake has struck near South Sandwich Islands region", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-m5-2-quake-has-struck-near-south-sandwich-islands-region/", "message": "A moderate earthquake with magnitude 5.2 (ml/mb) was detected on Thursday, South Sandwich Islands region (0 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nIds that are associated to the earthquake: us6000mvnj.\nThe 5.2-magnitude earthquake was detected at 08:02:27 / 8:02 am (local time epicenter).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: South Sandwich Islands region."}, {"id": "69bae694-b86a-4095-9352-e95fcc1d67d4", "title": "Moderate earthquake , 5 . 2 mag has occurred near Luganville in Vanuatu", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-has-occurred-near-luganville-in-vanuatu-2/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) strikes 113 km ENE of Luganville, Vanuatu (70 miles) on Wednesday.\nIds that are associated to the event: us6000mx7t.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nIn the past 24 hours, there have been sixteen, in the last 10 days seventeen, in the past 30 days seventeen and in the last 365 days seventeen earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 113 km ENE of Luganville, Vanuatu."}, {"id": "3ee3de32-d701-4526-83e1-7a98f821dceb", "title": "Moderate earthquake 5 . 3 mag , 97 km NNW of Finschhafen , Papua New Guinea", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-97-km-nnw-of-finschhafen-papua-new-guinea/", "message": "A moderate earthquake with magnitude 5.3 (ml/mb) was detected on Sunday, 97 km NNW of Finschhafen, Papua New Guinea (60 miles).\nEvent ids that are associated to the earthquake: us6000mxsc.\nId of event: us6000mxsc.\nIn the past 24 hours, there have been four, in the last 10 days five, in the past 30 days seven and in the last 365 days seven earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 97 km NNW of Finschhafen, Papua New Guinea."}, {"id": "657015a7-0dfc-4e1c-bfa0-6aa43ba36e08", "title": "Moderate earthquake , 5 . 3 mag strikes near Höfn in Iceland", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-strikes-near-hofn-in-iceland/", "message": "A moderate earthquake magnitude 5.3 (ml/mb) has struck on Sunday, 119 km WNW of Höfn, Iceland (74 miles).\nEvent ids that are associated to the earthquake: us7000mdlk.\nId of event: us7000mdlk.\nEvery year there are an estimated 1320 moderate earthquakes in the world.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 119 km WNW of Höfn, Iceland."}, {"id": "87495177-41ea-4674-8238-16d3fc070639", "title": "Moderate earthquake : M5 . 2 quake has struck near Lajes das Flores in Portugal", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-m5-2-quake-has-struck-near-lajes-das-flores-in-portugal/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) strikes 138 km SSE of Lajes das Flores, Portugal (86 miles) on Tuesday.\nThe epicenter was at a depth of 18.011 km (11 miles).\nEvent ids that are associated to the earthquake: us6000mt7i.\nId of event: us6000mt7i.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 138 km SSE of Lajes das Flores, Portugal."}, {"id": "6f03fac2-ca79-4b0a-9593-abce6237a14d", "title": "Moderate earthquake , 5 . 1 mag strikes near Trenggalek in Indonesia", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-1-mag-strikes-near-trenggalek-in-indonesia/", "message": "A moderate earthquake with magnitude 5.1 (ml/mb) was detected on Monday, 107 km SSW of Trenggalek, Indonesia (66 miles).\nEvent id: us7000mdtk.\nIds that are associated to the earthquake: us7000mdtk.\nThe 5.1-magnitude earthquake was detected at 11:10:48 / 11:10 am (local time epicenter).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 107 km SSW of Trenggalek, Indonesia."}, {"id": "91a54882-fe5d-47ef-9ab9-7402a15894f7", "title": "Army Corps prepares Lake Okeechobee ahead of  extremely active  hurricane season", "date": "2024-05-16 03:45", "url": "https://winknews.com/2024/05/15/army-corps-prepares-lake-okeechobee-ahead-of-extremely-active-hurricane-season/", "message": "In February, the Corps implemented releases to the Caloosahatchee and St. Lucie Estuary to bring lake levels down ahead of the 2024 hurricane season, which is already forecasted to be “extremely active.”The plan worked.\nAs of Wednesday, May 15, 2024, Lake Okeechobee stands at 13.73 feet.\nThe 143-mile earthen dam system encircles Lake Okeechobee and is routinely inspected.\nIt reduces impacts from flooding as a result of high lake levels for a large area of south Florida.\nOn the cusp of this hurricane season, the Corps is prepared for it."}, {"id": "2f2b01f9-1bb2-44f8-be15-47044b2f0572", "title": "Moderate earthquake , 5 . 4 mag was detected near Rabaul in Papua New Guinea", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-4-mag-was-detected-near-rabaul-in-papua-new-guinea-2/", "message": "A moderate earthquake with magnitude 5.4 (ml/mb) was detected on Thursday, 83 kilometers (52 miles) from Rabaul in Papua New Guinea.\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nClose country/countries that might be effected, Papua New Guinea (c. 6 065 000 pop).\nEpicenter of the earthquake was 102 km (64 miles) from Kokopo (c. 26 300 pop), 85 km (53 miles) from Rabaul (c. 8 100 pop).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, detected near: 83 km WNW of Rabaul, Papua New Guinea."}, {"id": "f8319343-ffd4-4dc3-9e9b-1a8c930fd60d", "title": "Moderate earthquake , 5 . 2 mag was detected near Constitución in Chile", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-was-detected-near-constitucion-in-chile/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) has occurred on Monday, 76 kilometers (47 miles) from Constitución in Chile.\nThe 5.2-magnitude earthquake was detected at 09:18:49 / 9:18 am (local time epicenter).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nEarthquake epicenter was 76 km (47 miles) from Constitución (c. 37 900 pop), 104 km (65 miles) from Cauquenes (c. 31 400 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 76 km W of Constitución, Chile."}, {"id": "08ccd646-8352-4d89-a6a4-ae98d51a390c", "title": "Moderate earthquake 5 . 3 mag , 71 km NNW of Neiafu , Tonga", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-71-km-nnw-of-neiafu-tonga/", "message": "A moderate earthquake with magnitude 5.3 (ml/mb) was reported 71 kilometers (44 miles) from Neiafu in Tonga on Wednesday.\nThe earthquake was roughly at a depth of 138.285 km (86 miles).\nExact location of event, depth 138.285 km, -174.1443° West, -18.0276° South.\nEarthquake epicenter was 71 km (44 miles) from Neiafu (c. 4 300 pop).\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 71 km NNW of Neiafu, Tonga."}, {"id": "a2a6543b-d871-43d2-b1e7-7d94886c181b", "title": "Moderate earthquake , 5 . 3 mag was detected near Basco in Philippines", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-was-detected-near-basco-in-philippines/", "message": "A moderate earthquake with magnitude 5.3 (ml/mb) was reported 74 kilometers (46 miles) from Basco in Philippines on Tuesday.\nThe earthquake occurred at a depth of 19.555 km (12 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nEvent epicenter was 75 km (46 miles) from Basco (c. 7 300 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 74 km WSW of Basco, Philippines."}, {"id": "35de9fe1-8a95-48f3-aa1b-ad2f702806d1", "title": "KATU News special  Wildfire Season : Prepare & Protect  ", "date": "2024-05-16 03:45", "url": "https://katu.com/news/local/katu-news-special-wildfire-season-prepare-protect", "message": "Wildfire season 2024 is here.\nThe first fire started burning last month 25 miles southeast of Chemult in southern Oregon.\nKATU News is 'On Your Side,' helping you prepare before a wildfire threatens your health, life, or home.\nIn KATU’s half-hour special called ‘Wildfire Season: Prepare & Protect,’ we’ll show you how to make the area around your home more fire-safe and how to build ‘defensible space.\"\nWatch ‘Wildfire Season: Prepare & Protect’ Memorial Day May 27th at 6:30 p.m. on KATU."}, {"id": "5c12d732-8b98-48af-9463-c7ff4a10d3df", "title": "Moderate earthquake , 5 . 3 mag was detected near Port - Olry in Vanuatu", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-was-detected-near-port-olry-in-vanuatu/", "message": "A moderate earthquake magnitude 5.3 (ml/mb) has struck on Saturday, 44 kilometers (27 miles) from Port-Olry in Vanuatu.\nCountry/countries that might be effected, Vanuatu (c. 222 000 pop).\nEpicenter of the event was 97 km (60 miles) from Luganville (c. 13 400 pop), 95 km (59 miles) from Sola (c. 1 200 pop).\nIn the past 24 hours, there have been twelve, in the last 10 days thirteen, in the past 30 days thirteen and in the last 365 days thirteen earthquakes of magnitude 3.0 or greater that has struck near.\nRead more about the earthquake, Location, Distances, Seismometer information, Date-Time, Parameters and details about this quake, reported near: 44 km NNE of Port-Olry, Vanuatu."}, {"id": "63e2659b-8d46-4f73-80e9-3ae9f814b1c3", "title": "Moderate earthquake , 5 . 2 mag has occurred near Modisi in Indonesia", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-has-occurred-near-modisi-in-indonesia/", "message": "A moderate earthquake with magnitude 5.2 (ml/mb) was reported 83 kilometers (52 miles) from Modisi in Indonesia on Monday.\nThe earthquake was roughly at a depth of 271.971 km (169 miles).\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nAll ids that are associated to the event: us6000my6q.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 83 km NW of Modisi, Indonesia."}, {"id": "16fc7eb4-cdf0-431a-a88f-bfc429e2bf1b", "title": "Canadian wildfires haze U . S . skies , trigger air quality warnings in multiple states", "date": "2024-05-16 00:00", "url": "https://wjla.com/weather/first-alert-weather-blog/canadian-wildfire-smoke-returns-northern-united-states-minneapolis-kansas-city-upper-level-winds-wisconsin-wildfire-season-snowpack-cooler-weather-washington-dc-dmv", "message": "Wildfire smoke has lowered air quality and made for some hazy skies in areas like Minneapolis and Kansas City this week.\nThe upper-level winds have shifted, which resulted in the smoke from these fires filtering into the United States.\nOn Tuesday, Code Orange (3 of 6) air quality was reported in cities like Topeka, Kansas.\nThe 2023 Canadian wildfire season was record-breaking with about 45 million acres burned, which is nearly two and a half times the previous record of 17.5 million acres burned in 1995.\nWhile it is expected to be another busy wildfire season this year, it is also not expected to be anywhere near the activity and widespread as last year."}, {"id": "b460cc09-a918-4688-8325-76440f46cf69", "title": "Moderate earthquake , 5 . 1 mag was detected near Hualien City in Taiwan", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-1-mag-was-detected-near-hualien-city-in-taiwan/", "message": "A moderate earthquake with magnitude 5.1 (ml/mb) was reported 56 kilometers (35 miles) from Hualien City in Taiwan on Sunday.\nThe earthquake was roughly at a depth of 34.394 km (21 miles).\nNearest city/cities or towns, with min 5000 pop, to epicentrum/hypocenter was Lugu, Taitung City, Puli.\nEpicenter of the event was 57 km (35 miles) from Hualian (c. 350 500 pop), 92 km (57 miles) from Taitung City (c. 109 600 pop), 86 km (54 miles) from Puli (c. 86 400 pop), 93 km (58 miles) from Lugu (c. 19 600 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 56 km S of Hualien City, Taiwan."}, {"id": "a207d81a-59be-4a66-a695-42f0e3dee02e", "title": "Moderate earthquake , 5 . 3 mag strikes near Hualien City in Taiwan", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-strikes-near-hualien-city-in-taiwan-2/", "message": "A moderate earthquake with magnitude 5.3 (ml/mb) was reported 24 kilometers (15 miles) from Hualien City in Taiwan on Monday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 12.232 km (8 miles) below the earth’s surface.\nCountry/countries that might be effected, Taiwan (c. 22 894 000 pop).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 24 km S of Hualien City, Taiwan."}, {"id": "44308b36-3443-4055-995e-6a171bf71c7a", "title": "Moderate earthquake 5 . 2 mag , 51 km WSW of Santiago , Peru", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-2-mag-51-km-wsw-of-santiago-peru/", "message": "A moderate earthquake magnitude 5.2 (ml/mb) has struck on Thursday, 51 kilometers (32 miles) from Santiago in Peru.\nExact location of event, depth 35 km, -76.1516° West, -14.3528° South.\nId of earthquake: us6000mywl.\nThe epicenter was at a depth of 35 km (22 miles).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 51 km WSW of Santiago, Peru."}, {"id": "419d2cb0-a0d8-4b43-bf0b-a36b03379b98", "title": "Clay Humane shares do and donts to get your pets storm ready", "date": "2024-05-16 15:15", "url": "https://www.news4jax.com/news/local/2024/05/16/clay-humane-shares-dos-and-donts-to-get-your-pets-storm-ready/", "message": "Identify Pet-Friendly Shelters: Not all shelters accept pets, and the ones that do may have limitations on which animals they allow.\nDon’ts:Don’t Leave Pets Outside: It isn’t safe to leave pets outside during a storm.\nDon’t Leave Pets Behind: If you evacuate, be sure to take your animals with you.\n“This leaves pet owners at risk of not finding essential pet supplies or being equipped to evacuate and find pet-friendly shelters.\nFollowing these do’s and don’ts can set pet owners and their animals up for a safer hurricane season.”"}, {"id": "5b0cabfa-874d-49fd-a3f2-3ef3a72ef5f5", "title": "Moderate earthquake , 5 . 3 mag strikes near Hualien City in Taiwan", "date": "2024-05-16 18:30", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-3-mag-strikes-near-hualien-city-in-taiwan/", "message": "A moderate earthquake with magnitude 5.3 (ml/mb) was reported 30 kilometers (19 miles) from Hualien City in Taiwan on Monday.\nExact location of event, longitude 121.6098 East, latitude 23.7004 North, depth = 8.892 km.\nThe earthquake occurred at a depth of 8.892 km (6 miles) below the earth’s surface.\nNearby country/countries, Taiwan (c. 22 894 000 pop) (That might be effected).\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: 30 km S of Hualien City, Taiwan."}, {"id": "b12f7b68-06bf-40d2-b086-9f1b625fd1e3", "title": "Moderate earthquake , 5 . 1 mag has occurred near Hualien City in Taiwan", "date": "2024-05-16 22:15", "url": "https://www.earthquakenewstoday.com/2024/05/16/moderate-earthquake-5-1-mag-has-occurred-near-hualien-city-in-taiwan/", "message": "A moderate earthquake magnitude 5.1 (ml/mb) strikes 21 kilometers (13 miles) from Hualien City in Taiwan on Monday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe epicenter of the earthquake was roughly 10 km (6 miles) below the earth’s surface.\nThe 5.1-magnitude earthquake was detected at 09:12:11 / 9:12 am (local time epicenter).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: 21 km S of Hualien City, Taiwan."}, {"id": "f0d3f20a-f78e-4ee2-a64a-b4bdde222784", "title": "Fort Nelson , B . C ., wildfire expands to 127 sq km but cooler temps expected", "date": "2024-05-16 18:00", "url": "https://globalnews.ca/news/10500486/fort-nelson-bc-fire-size-latest/", "message": "See more sharing optionsSend this page to someone via emailShare this item on TwitterShare this item via WhatsAppShare this item on FacebookBritish Columbia’s wildfire service says the blaze threatening the northern community of Fort Nelson now spans nearly 130 square kilometres, but it had spread away from the town along its southern flank.\nThe service says the Parker Lake fire has been mapped at 127 square kilometres in size, up from 84 square kilometres earlier this week.\nIt says cooler temperatures and higher relative humidity were expected to make for more favourable conditions over the next couple of days fighting the fire that was only two kilometres southwest of the town earlier this week.\nStory continues below advertisementThere may be some light rain, but the BC Wildfire Service says it won’t be enough to “offset the prolonged drought and cause the fires to self-extinguish.”The email you need for the day's top news stories from Canada and around the world.\nRob Fraser, the mayor of the Northern Rockies Regional Municipality, which includes Fort Nelson, told a community meeting that he now feels confident they will get word eventually that the fire is not threatening the community."}, {"id": "b942a9fb-1627-44d5-99e1-f5f653700a12", "title": "Looming fires are forcing thousands of Canadians to evacuate . Some may not return home until next week", "date": "2024-05-16 07:00", "url": "https://www.yahoo.com/news/looming-fires-forcing-thousands-canadians-060956937.html", "message": "Colossal wildfires burning across Canada over the last week have driven thousands of people to evacuate with their kids, pets and precious belongings in tow – many uncertain when they may be able to return home.\nMore than 6,000 people have evacuated from Fort McMurray in Alberta since Tuesday as a 51,000 acre fire burns less than 5 miles from the city’s edge.\nBut that is far from the amount of precipitation needed to offset drought conditions and extinguish the fires, the British Columbia Wildfire Service said.\nSmoke rises as fire singes Fort Nelson on May 14.\n“This region has experienced multiple years of drought, with a below normal snowpack this past winter,” said Ben Boghean, fire behavior specialist for the BC Wildfire Service."}, {"id": "3d99229f-e742-4c24-b055-d7f6c54800ac", "title": "Maritime weather : Wildfire , spring precipitation update", "date": "2024-05-16 21:45", "url": "https://atlantic.ctvnews.ca/spring-precipitation-wildfire-update-for-the-maritimes-1.6889857", "message": "Spring 2024 has so far been characterized by near normal precipitation totals for the Maritimes.\nThe season has been front loaded with the bulk of the total precipitation falling in the month of March.\nApril finished with below normal precipitation and so far, May has trended towards below normal precipitation as well.\nSo far, spring 2024 has seen near normal amounts of total precipitation.\nWildfire ConditionsThe spring has seen periods of restricted and ban notices issued for domestic burning by all three Maritime provincial governments."}, {"id": "3a4247b9-0690-40eb-8c2c-d6547e1591af", "title": "Settlement reached on New Orleans corroding storm pumps | Environment", "date": "2024-05-16 15:30", "url": "https://www.nola.com/news/environment/repairs-to-new-orleans-corroding-hurricane-protection-pumps-boosted-by-settlement/article_6c9b4e84-1308-11ef-9abf-e76157826ca4.html", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "bdc5901c-0f83-431a-830a-7b2c86478179", "title": "Local officials keeping eye on busy hurricane season forecast", "date": "2024-05-16 16:45", "url": "https://coastalcourier.com/news/local-officials-keeping-eye-busy-hurricane-season-forecast/", "message": "Predictions are calling for a busier than usual Atlantic storm season, and Liberty County officials have begun getting organized for a potentially active summer and fall.\nHurricane season begins June 1 and ends November 30.\nForecasters at Colorado State University are predicting an unusually active Atlantic hurricane season, with 23 named storms, 11 hurricanes and five major hurricanes.\nWater temperatures in the eastern and central Atlantic are at record warm levels and are expected to remain well above average for the upcoming hurricane season.\nCSU’s forecast team anticipates a well above-average probability for major hurricanes making landfall along the U.S. coast for the 2024 hurricane season."}, {"id": "33b6315a-e0fa-497c-b199-727ce8c3df3e", "title": "Local officials keeping eye on busy hurricane season forecast", "date": "2024-05-16 16:45", "url": "https://www.bryancountynews.com/news/local-officials-keeping-eye-busy-hurricane-season-forecast/", "message": "Predictions are calling for a busier than usual Atlantic storm season, and Liberty County officials have begun getting organized for a potentially active summer and fall.\nHurricane season begins June 1 and ends November 30.\nForecasters at Colorado State University are predicting an unusually active Atlantic hurricane season, with 23 named storms, 11 hurricanes and five major hurricanes.\nWater temperatures in the eastern and central Atlantic are at record warm levels and are expected to remain well above average for the upcoming hurricane season.\nCSU’s forecast team anticipates a well above-average probability for major hurricanes making landfall along the U.S. coast for the 2024 hurricane season."}, {"id": "ed61fbba-731b-4654-b5c8-41f756ff2960", "title": "Threat of heavy rain , strong storms ramping up Thursday night", "date": "2024-05-16 23:15", "url": "https://www.wbrz.com/news/threat-of-heavy-rain-strong-storms-ramping-up-thursday-night", "message": "1 to 4 inches of rainfall with locally higher amounts in excess of 6 inches will be possible, enhancing the flash flooding threat.\nThe Storm Prediction Center has placed most of the WBRZ coverage area under a slight (2/5) risk for severe weather for Thursday night storms.\nThat said, the flash flooding threat will be higher just to the north of the front.\nWhile the severe weather threat should be lower with the storms into early Saturday, they still pose threat of flash flooding.\nClick HERE to watch WBRZ streaming live onlineClick HERE for the WBRZ weather page."}, {"id": "326b9390-33a6-49f9-87d6-35c775707f1e", "title": "Prepare for the Coming Storm Season at Port St . Lucie 2024 Hurricane Expo", "date": "2024-05-16 16:45", "url": "https://www.wqcs.org/wqcs-news/2024-05-16/prepare-for-the-coming-storm-season-at-port-st-lucies-2024-hurricane-expo", "message": "Port St. Lucie - Thursday May 16, 2024: Hurricane season is right around the corner, which makes now the perfect time to start preparing.\nThe 18th annual Hurricane Preparedness Expo will take place Saturday, June 1 from 10 a.m. to 2 p.m. at MIDFLORIDA Event Center, located at 9221 SE Event Center Place in Port St. Lucie.\nThis free, family-friendly event connects residents with businesses and emergency providers who can help them prepare for extreme weather situations.\nThis year’s Expo will feature informative presentations from meteorologists, emergency managers, City of Port St. Lucie staff and community organizations that can assist with hurricane preparations.\nWhile supplies last, attendees will receive a tote bag with hurricane and preparedness information, and those who complete the scavenger hunt will receive a water bottle."}, {"id": "623da068-6b80-4118-8471-dffbc76d45cd", "title": "Haunting photos show a Six Flags in New Orleans that has been abandoned for almost 2 decades", "date": "2024-05-16 18:15", "url": "https://www.yahoo.com/news/haunting-photos-show-six-flags-171512166.html", "message": "Almost two decades later, Six Flags New Orleans still sits abandoned, now a time capsule of life before Katrina.\nOriginally called Jazzland, it was acquired by Six Flags in 2003 and renamed Six Flags New Orleans (SFNO).\nWhen another company made its interest in the land known, pitching the \"Dreamlanding Festival Park,\" Mayor Landrieu didn't approve.\nGone was the scent of cotton candy and the sounds of laughter as I walked into the abandoned Six Flags Amusement Park.\nAs Biz New Orleans reported, the next step is raising $500 million to begin construction, and signing tenants."}, {"id": "aa214ba8-eabf-4047-b3cb-6aeb1ad5b127", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 03:45", "url": "https://katu.com/news/local/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said."}, {"id": "fc44710a-1552-406d-a709-3b25184ae2d3", "title": "Houston weather : Heavy rain , flooding possible for Thursday through early Friday", "date": "2024-05-16 07:00", "url": "https://www.fox26houston.com/weather/houston-weather-heavy-rain-flooding-possible-for-thursday-through-early-friday", "message": "You might have heavy rain and severe storm fatigue, but buckle up for another round!\nThursday through early Friday are now FOX 26 Storm Alert Days and will likely feature rounds of heavy rain and a few strong to severe storms!\nThat means you need to be on alert and prepared to take action with the threat for hail, damaging winds and heavy rain that could lead to flooding increasing.\nRounds of heavy rain and a few strong to severe storms will be most likely Thursday afternoon through Friday morning.\nAlso some areas north of Houston have picked up 10-20\" of rain recently."}, {"id": "33e5b266-3171-4f78-94b1-6a0362670e7d", "title": "Houston weather : FOX 26 Storm Alert Day issued for Thursday through early Friday", "date": "2024-05-16 02:30", "url": "https://www.fox26houston.com/weather/houston-weather-fox-26-storm-alert-day-for-thursday-through-early-friday", "message": "You might have heavy rain and severe storm fatigue, but buckle up for another round!\nThursday through early Friday are now FOX 26 Storm Alert Days and will likely feature rounds of heavy rain and a few strong to severe storms!\nThat means you need to be on alert and prepared to take action with the threat for hail, damaging winds and heavy rain that could lead to flooding increasing.\nRounds of heavy rain and a few strong to severe storms will be most likely Thursday afternoon through Friday morning.\nAlso some areas north of Houston have picked up 10-20\" of rain recently."}, {"id": "a7324cda-b2b2-4113-a51b-f476a9765164", "title": "Wet roads , poor visibility for morning commute", "date": "2024-05-16 09:45", "url": "https://www.wfsb.com/2024/05/16/wet-roads-poor-visibility-morning-commute/", "message": "(WFSB) - A storm that brought heavy rain and some wind led to some road closures in parts of the state.\nChannel 3 meteorologists issued a First Alert through Thursday morning because of an isolated chance for minor flooding and gusty winds.\nSimsbury police posted that Old Meadow Plain Road was closed between Lawton Road and Pine Glen because of a downed tree.\nIn Enfield, police said Taylor Road was closed between Scitico Plaza and Heron Road because of a crash that brought down wires in the road.\nClick HERE for the latest FIRST ALERT TRAFFIC information for your MORNING COMMUTEClick HERE for the latest FIRST ALERT WEATHER FORECAST from Channel 3 Meteorologists."}, {"id": "3ca678b9-ab53-4550-90fc-910571bfa4ad", "title": "Huge wildfires burn across Canada", "date": "2024-05-16 15:30", "url": "https://www.cbc.bb/news/international-news/huge-wildfires-burn-across-canada/", "message": "Fire officials warn slight changes in weather conditions or wind direction could quickly place nearby homes and businesses at risk.\nMore than 6,000 people have evacuated from Fort McMurray in Alberta since Tuesday as a 51,000 acre fire burns less than 5 miles from the city’s edge.\nBut that is far from the amount of precipitation needed to offset drought conditions and extinguish the fires, the British Columbia Wildfire Service said.\n“Because the conditions are so extremely dry up there, the fires burned down deep,” Earl Simmons, the director of the Manitoba Wildfire Service, told CBC.\n“This region has experienced multiple years of drought, with a below normal snowpack this past winter,” said Ben Boghean, fire behavior specialist for the BC Wildfire Service."}, {"id": "98f0493a-f5e5-473d-882f-8901f97deddb", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 06:45", "url": "https://kval.com/news/local/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said."}, {"id": "4133aaae-f085-45c6-8a32-d7a809385214", "title": "After storms washed away the old boardwalk in Sandwich , a new , more resilient one to open this summer", "date": "2024-05-16 21:45", "url": "https://www.bostonglobe.com/2024/05/16/science/after-storms-washed-away-old-boardwalk-sandwich-new-more-resilient-one-open-this-summer/", "message": "“If you Google Sandwich, Mass., the boardwalk comes up,” said David DeConto, the director of natural resources for Sandwich.\n“That’s how much of a landmark it is.”SANDWICH — At the beginning of May, construction workers were at full speed, putting on the finishing touches of the new Sandwich boardwalk.\nBarnstable resident Johnny Johnson took a photograph of the Sandwich boardwalk, which was closed after the bridge was damaged after the strong winter storm in 2022.\nConstruction workers walked on the nearly complete new Sandwich boardwalk on Tuesday.\nSuzanne Kreiter/Globe Staff“There’s nothing to say that weather won’t claim it again,” said Candus Thomson, a Sandwich resident."}, {"id": "460e266f-3702-4fcc-b14d-1ccc19de4066", "title": "Wildfire approaches Canada largest oil - producing area . again . | World News", "date": "2024-05-16 15:30", "url": "https://indianexpress.com/article/world/wildfire-approaches-canadas-largest-oil-producing-9333513/", "message": "A wildfire near Canada’s largest oil-producing region prompted the evacuation of about 6,600 people Tuesday from Fort McMurray, Alberta.\nOn Wednesday morning, the leading edge of the fire was about 3 miles from parts of Fort McMurray.\nAlberta Wildfire said diminishing winds and cooler temperatures were reducing the fire’s severity.\nBut she said the strong winds that were expanding the fire while pushing it toward Fort McMurray had weakened and reversed direction Wednesday.\n“Please, please allow these communities to evacuate first,” Butz told residents during a news conference Tuesday."}, {"id": "c868377b-64fc-4ff8-a494-065661c70d15", "title": "Two rainstorms heading for Ghana - GMet warns", "date": "2024-05-16 08:15", "url": "https://www.myjoyonline.com/two-rainstorms-heading-for-ghana-gmet-warns/", "message": "The Ghana Meteorological Agency (GMet) says its weather monitoring station has observed double rainstorms heading for the country on Thursday, May 16.\nAreas within the coastal and northern sectors will be hit by heavy rainfall accompanied by strong winds and thundery conditions.\n\"A rainstorm that is moderately producing thunderstorms with rain over northern Benin into Togo is expected to drift further westwards to affect the northern half of Ghana.\nHowever, a separate rainstorm observed over Nigeria is also expected to propagate westwards to affect the coastal and middle sectors of the country,\" the statement read.\nThe recent severe rainstorm left in its wake destruction in parts of Accra, as trees fell and damaged several cars."}, {"id": "c5a7aea3-d8f6-40b9-8839-71b262ac67cf", "title": "Officials learn from the past in responding to this year Fort McMurray wildfire", "date": "2024-05-16 12:15", "url": "https://www.theglobeandmail.com/canada/article-officials-learn-from-the-past-in-responding-to-this-years-fort/", "message": "Josée St-Onge, a spokesperson for Alberta Wildfire, said until 11 p.m. on Wednesday there were still open flames stretching into the sky.\nAnother fire burning about three kilometres north of Fort McMurray is now classified as being held, which means it is not likely to spread beyond its current boundaries.\nIt is about one hectare in size and Alberta Wildfire said in its morning update that it poses no threat to the city.\nMore than 6,000 residents from four neighbourhoods are still under an evacuation order that was issued on Tuesday.\nThere were 42 active wildfires in Alberta, as of early Thursday, with the Fort McMurray inferno being the only one classified as out-of-control."}, {"id": "6de09231-ef24-4fb4-b4a9-46d68afe029f", "title": "First song from NTR Jr  Devara  to be out on actor birthday eve", "date": "2024-05-16 07:30", "url": "https://www.siasat.com/first-song-from-ntr-jrs-devara-to-be-out-on-actors-birthday-eve-3027274/", "message": "Mumbai: This birthday will be extremely special for NTR Jr’s fans as the makers of ‘Devara Part 1’ are all set to release the first single from the film.\nAnnouncing the same on social media with a film poster, team ‘Devara’ unveiled that the song is created by musician Anirudh Ravichander and wrote, “ALL SET for the mighty storm.\n#DevaraFirstSingle ~ #FearSong will unleash tsunami of madness that will sweep through every coast on May 19th An @anirudhofficial Musical.”The track will be out on May 19 – NTR Jr’s birthday eve.\nThe magnum opus is produced by Yuvasudha Arts and NTR Arts and presented by Nandamuri Kalyan Ram.\nThe Pan-India film, co-starring Saif Ali Khan and Janhvi Kapoor in key roles, ‘Devara: Part 1’ will hit theatres on October 10."}, {"id": "559b09b9-b327-4782-a1da-acc384661946", "title": "Holdover wildfires : Why B . C . may see more overwinter fires this season – Brandon Sun", "date": "2024-05-16 22:30", "url": "https://www.brandonsun.com/lifestyles/2024/05/16/holdover-wildfires-why-b-c-may-see-more-overwinter-fires-this-season", "message": "FORT NELSON, B.C.\n– One of the largest wildfires burning in Western Canada is the Patry Creek fire, 25 kilometres north of Fort Nelson, B.C., which re-emerged May 2 after smouldering through the winter.\nHere’s a closer look at what holdover fires are and their threat to Western Canada.\n—What are holdover fires?\nIn January, more than 100 wildfires were still listed as burning in B.C., a number much higher than the typical few dozen holdovers from year to year, according to BC Wildfire Service spokesman Forrest Tower."}, {"id": "d0606dde-a164-4dc4-8f17-7bab361cd6c0", "title": "Houston under flood watch Thursday ahead of soaking rains", "date": "2024-05-16 00:15", "url": "http://www.houstonchronicle.com/news/houston-weather/forecast/article/houston-texas-flood-watch-weather-19460286.php", "message": "He brings five years of experience forecasting tropical systems, severe weather outbreaks, and blizzards to the Houston Chronicle.\nJustin looks forward to his work with the Houston Chronicle, where he'll be responsible for posting daily weather forecasts.\nOn top of daily forecasts, he is excited to tackle more in-depth weather and climate stories that impact the residents of Southeast Texas.\nA North Carolina native, Justin joined the Chronicle in July 2023.\nHe graduated with his bachelor's degree in meteorology from the University of North Carolina at Charlotte in December 2017."}, {"id": "2e890c4f-62c1-4727-ab5d-6329388052ce", "title": "Cities look for new ways to keep people safe and alive as extreme summer heat looms", "date": "2024-05-16 10:45", "url": "https://www.nbcnews.com/science/science-news/cities-prepare-extreme-heat-summer-rcna151029", "message": "“We prepare for heat year-round in Phoenix,” Mayor Kate Gallego said.\nThe 2023 heat waves revealed how challenging it can be to cope with extreme temperatures for weeks on end, even in places where residents are accustomed to warm weather.\nThat has prompted cities across the South and the Southwest to re-evaluate how best to keep people safe — and alive — this summer.\nGallego said Phoenix has been creating “cool corridors” by planting trees and resurfacing the pavement with more reflective coatings to reduce urban heat.\nA primary focus right now is mitigating high overnight temperatures, which plagued the city last summer."}, {"id": "11109a3e-e4ac-447a-b1a1-7b7135d09e72", "title": "Firefighters Gain Control of One Blaze Threatening Oil Sands in Alberta", "date": "2024-05-16 20:45", "url": "https://finance.yahoo.com/news/firefighters-gain-control-one-blaze-195526122.html", "message": "(Bloomberg) -- Firefighters gained control of one wildfire near the main oil-sands region of Alberta on Wednesday, but continued to battle a much larger blaze to the south that’s threatening the area’s biggest city.\nWorkers based in Fort McMurray help staff the surrounding oil-sands operations that produce the bulk of Canada’s 4.9 million barrels of daily crude output.\n“More than 2.1 million barrels per day of marketable oil sands output could be at risk should conditions materially worsen.”So far, no oil-sands producer has reported operational disruptions.\nA devastating fire eight years ago leveled parts of Fort McMurray and forced the entire population to evacuate.\nThat blaze shut more than 1 million barrels of daily oil output for weeks and caused about C$3.7 billion ($2.7 billion) in insured losses, making it Canada’s costliest natural disaster."}, {"id": "5a6691af-c6c2-4a87-a76e-b8dd4c14c213", "title": "The US Navy only forward - deployed aircraft carrier , USS Ronald Reagan , is leaving Japan after nearly a decade in the Pacific", "date": "2024-05-16 18:00", "url": "https://news.yahoo.com/news/us-navys-only-forward-deployed-153926735.html", "message": "After nearly a decade, the USS Ronald Reagan is leaving the Pacific.\nUSS Ronald Reagan has served in other roles, providing air support in Afghanistan and aiding Japan after its 2011 disaster.\nThe USS Ronald Reagan, the only aircraft carrier in the US Navy forward deployed, or permanently stationed in another country, is leaving Japan after spending nearly a decade in the Pacific.\nUSS Ronald Reagan traveling through the Straits of Magellan, to San Diego, CA, in a transfer move.\n\"Whether it's aboard USS Ronald Reagan today or USS George Washington in the future, we will continue to strengthen those ties at all levels, on-shore and at-sea.\""}, {"id": "0fe8d409-316d-43e3-970a-0b6e171aa57c", "title": "Charleston Heights homeowners report more flooding after SC Ports construction", "date": "2024-05-16 23:00", "url": "https://www.live5news.com/2024/05/16/charleston-heights-homeowners-report-more-flooding-after-sc-ports-construction/", "message": "CHARLESTON, S.C. (WCSC) - Longtime Charleston Heights neighbors report flooding issues have become exponentially worse after the South Carolina Ports Authority began construction on its multi-million-dollar project next door, leaving them with the clean-up.\nBut neighbors say they really began to notice an issue in the summertime.\nThe South Carolina Ports Authority released the following statement:“South Carolina Ports is proactively working with the City of North Charleston to improve the stormwater drainage system at Orvid Street as this area is susceptible to flooding, much like other low-lying areas in Charleston.\nThe South Carolina Ports Authority reported temporary measures were in place to alleviate flooding on May 1.\nSome neighbors are hopeful the Ports Authority will take accountability for their damaged property, and that the problem will be solved."}, {"id": "7b205e62-c424-484f-bc26-3a9ba0316b01", "title": "Devara Part 1 : First Single of Jr NTR starrer to be unveiled on his birthday eve : Bollywood News", "date": "2024-05-16 07:45", "url": "https://www.bollywoodhungama.com/news/south-cinema/devara-part-1-first-single-jr-ntr-starrer-unveiled-birthday-may-19/", "message": "Jr NTR is all set to take theatres by storm this year after the stupendous success of RRR, with Devara: Part 1 starring Janhvi Kapoor and Saif Ali Khan.\nWhile fans eagerly are awaiting the release of the magnum opus, adding to all the anticipation, we hear Jr NTR will treating his millions fans with the ultimate return gift on his birthday which falls on May 20.\nFollowing a recent teaser which were unveiled by the film’s makers on social media, it’s now confirmed that the first single titled ‘Fear Song’ from this mass action entertainer will release on Jr NTR’s birthday Eve on May 19.\nThe big announcement will definitely have sparked massive celebration among fans who celebrate his birthday like a festival each year.\nAlso Read: Biz Talk: Prabhas, Allu Arjun, Jr NTR, Ram Charan, Kamal Haasan and Suriya to rescue Bollywood from box office drought this yearBOLLYWOOD NEWS - LIVE UPDATESCatch us for latest Bollywood News, New Bollywood Movies update, Box office collection, New Movies Release , Bollywood News Hindi, Entertainment News, Bollywood Live News Today & Upcoming Movies 2024 and stay updated with latest hindi movies only on Bollywood Hungama."}, {"id": "afa43c9b-2e09-49de-a356-34f969acf92f", "title": "U . S . spacecraft snap stunning views of auroras encircling Earth", "date": "2024-05-16 14:00", "url": "https://mashable.com/article/aurora-northern-lights-space-view", "message": "A view from above Earth showing the vibrant auroras on May 11, 2024.\nA view from above Earth showing the vibrant auroras on May 11, 2024. Credit: NOAAA parade of intense solar storms have hit Earth — the strongest since Halloween over 20 years ago.\n\"It's like scooping up a piece of the sun and ejecting it into space,\" Mark Miesch, a scientist with the National Oceanic and Atmospheric Administration's Space Weather Prediction Center, previously told Mashable.\nWhen they collide with Earth, solar particles can become trapped by our planet's magnetic field, traveling to the poles and colliding with the molecules and particles in our atmosphere.\nThe expansive auroras as seen from space on May 11, 2024. Credit: NOAAMore intense solar activity may lead to more vivid auroras in 2024."}, {"id": "2fb02d69-3de2-4332-99f2-b8b100d248a7", "title": "Construction of Kasoa storm drains expected to take 17 months - Ghana Hydrological Authority", "date": "2024-05-16 06:45", "url": "https://www.ghanaweb.com/GhanaHomePage/business/Construction-of-Kasoa-storm-drains-expected-to-take-17-months-Ghana-Hydrological-Authority-1931045", "message": "Business News of Thursday, 16 May 2024Source: rainbowradioonline.comThe Ghana Hydrological Authority has announced that the construction of storm drains to address chronic flooding on the Mallam-Kasoa Highway is expected to take 17 months.\nFrancis Asenso-Boakye, the roads minister, toured the area to assess the situation and later assured the press that the government would construct storm drains to help address the issue.\nRichard Kofi Ameko, Head of Drainage at the Ghana Hydrological Authority, also informed the Minister that the Authority has developed a plan to handle the crisis, scheduled to be completed within the next 17 months.\n\"We've completed phase one; this is phase two, and it's about a 17-month project,\" he explained.\nDr. Daniel Sowah, Works Engineer of the Ga South Municipal Assembly, indicated that the Ghana Highway Authority is working on a solution to manage the situation."}, {"id": "fc82b17b-c600-4d76-a6e2-8c1e7abd1485", "title": "Brazil Flooded South Paralyzed As Waters Remain High", "date": "2024-05-16 04:45", "url": "https://menafn.com/1108219647/Brazils-Flooded-South-Paralyzed-As-Waters-Remain-High", "message": "Regional capital Porto Alegre's international airport remains under water, as do agricultural fields and roads, while more than 360,000 students were not in school.\n“It is not the moment to return to homes in risk zones,” state governor Eduardo Leite told a press conference.\nThe Guaiba, an estuary bordering Porto Alegre which overflows when waters hit three metres, reached a historic high of 5.3 metres last week.\n“We are experiencing the aftermath of an endless drama here in Rio Grande do Sul,” the state's deputy governor Gabriel Souza told the Globo broadcaster.\nConcordia Mayor Francisco Azcue said waters were expected to continue to rise in the coming days."}, {"id": "3cacdafa-fe89-4c4e-a1cc-70c8f52b2a07", "title": "US Navy flagship carrier USS Ronald Reagan leaves its Japan home port after nearly 9 years", "date": "2024-05-16 15:30", "url": "https://www.dailypress.com/2024/05/16/us-navy-flagship-carrier-uss-ronald-reagan-leaves-its-japan-home-port-after-nearly-9-years/", "message": "The departure of USS Ronald Reagan — one of America’s largest warships and a nuclear-powered Nimitz-class aircraft carrier — comes at a time of growing tension in the face of increasingly assertive China in the Indo-Pacific.\nIt will be replaced later this year by USS George Washington, another Nimitz-class carrier.\nThe USS George Washington departed April 25 from Naval Station Norfolk, embarking on a monthslong journey to Japan.\nFamily members and friends of the Reagan’s crew were on hand to wave the carrier off from Yokosuka Naval Base after its final patrolling mission earlier in the day.\nUSS Ronald Reagan first arrived in Yokosuka in 2015."}, {"id": "16450267-cd9b-4da6-9155-29542913e98d", "title": "  Short fuse storm are a major concern as Florida prepares for hurricane season", "date": "2024-05-16 19:00", "url": "https://www.wfit.org/tropical-weather/2024-05-16/short-fuse-storms-are-a-major-concern-as-florida-prepares-for-hurricane-season", "message": "“These short fuse storms are hurricane emergencies that require the ability to put action plans into place on constrained or reduced timelines — not even five days out,” National Hurricane Center Director Mike Brennan said during the annual Governor’s Hurricane Conference in West Palm Beach.\nForecasters are also able to better predict storm surge and wind field, helpfully explained in simple graphics.\nDaniel Kozin / AP This aerial photo shows homes surrounded by floodwaters in Steinhatchee, Fla., Wednesday, Aug. 30, 2023, left behind by Hurricane Idalia.\n“There were no storm surge fatalities in Idalia in Florida,” Brennan said.\nWe're going to stage, like we did in Hurricane Idalia, 8,000 National Guard members."}, {"id": "33bd6102-82ed-40ea-a57f-efe3c87aa0cf", "title": "Weather Alert : Flash flood potential continues this morning . ", "date": "2024-05-16 10:45", "url": "https://turnto10.com/weather/weather-blog/weather-alert-flash-flood-potential-continues-this-morning", "message": "9:30 AM UPDATE: Our Areal Flood Warning has been extended until lunch time for much of the region.\nLowland flooding is ongoing and will likely continue where rain persists.\n6:30 AM UPDATE: An areal flooding has been issued for much of the region until 9:30 AM.\nAs expected, a wide swath of 1-3\" of rainfall is being reported across the region this morning.\nThe heaviest rain this morning has been slowly shifting from the south coast northward towards Providence."}, {"id": "1774b35e-d0e5-4aa7-bd6c-3dd4aef84906", "title": "GMet alert : Two rainstorms set to hit Ghana , residents urged to prepare", "date": "2024-05-16 12:15", "url": "https://www.businessghana.com/site/news/General/306886/GMet-alert:-Two-rainstorms-set-to-hit-Ghana,-residents-urged-to-prepare", "message": "Their morning forecast pinpointed the arrival of dual rainstorms, with the Nigerian storm projected to make landfall around 9:30 am.\nRegions along the coast and in the north are anticipated to bear the brunt of heavy downpours, accompanied by robust winds and thunderous conditions.\nThe statement elaborated, “A rainstorm that is moderately producing thunderstorms with rain over northern Benin into Togo is expected to drift further westwards to affect the northern half of Ghana.\nHowever, a separate rainstorm observed over Nigeria is also expected to propagate westwards to affect the coastal and middle sectors of the country.”GMet emphasised the heightened risk of flooding and wind damage, urging residents in vulnerable areas to remain vigilant and take necessary precautions."}, {"id": "67cd5048-a6b9-4496-b0da-8bcbe2ae2449", "title": "Damaging thunderstorms to jolt Gulf Coast states into the weekend", "date": "2024-05-16 16:45", "url": "https://www.yahoo.com/news/damaging-thunderstorms-jolt-gulf-coast-151035425.html", "message": "AccuWeather meteorologists are tracking new episodes of severe weather that are forecast to erupt into the weekend.\nWhile hazardous weather will shift eastward across the South into Saturday, the central Plains will once again take center stage for damaging thunderstorms by the end of the weekend.\n\"Severe thunderstorms could cause isolated tornadoes, damaging wind gusts and hail in this zone,\" Pydynowski said.\nGET THE FREE ACCUWEATHER APPThe risk of severe weather will continue into the weekend, at least in a localized fashion.\nTuesday could be a significant day of severe weather as the storm system intensifies and pulls warm and humid air northward from the Gulf of Mexico."}, {"id": "ec4afc04-489b-4f91-8f61-926efdffaced", "title": "Utility restoration updates for Thursday , May 16", "date": "2024-05-16 19:30", "url": "https://www.katc.com/news/local-news/in-your-parish/utility-restoration-updates-for-thursday-may-16", "message": "Around midnight last night, Slemco reported that everyone who could accept power was restored:\"We officially have no customers without power!\nUnfortunately, we do have a few who had so much damage, power can’t be restored until home repairs are made.\nMeanwhile, restoration efforts continue in Lafayette, Carencro and Henderson where a heavy presence of utility crews are repairing and rebuilding portions of the electric system that likely sustained tornado damage.\nThere is also a heavy presence of crews in the Crescent area of Plaquemine to restore customers along Bayou Road.\nIf your electric equipment appears undamaged, text OUT to 36778 or call 1-800-9OUTAGE."}, {"id": "d3db6c99-98ba-4c4e-8a92-37909f1efff5", "title": "Warm sun and a few storms this weekend", "date": "2024-05-16 22:30", "url": "https://www.startribune.com/warm-sun-and-a-few-storms-this-weekend/600366528/", "message": "Seeing smoke on the weather map is a little like seeing your ex at Costco.\nWe can rationalize the sloppy storms and noisy fronts (hey, we need the rain!\nOdds favor another hotter-than-average summer and more annoying smoke fronts.\nSunday starts out sunny and dry, but the next storm arrives with more heavy showers and storms late Sunday.\nA little rain."}, {"id": "6f2239c1-a849-40b9-a6e7-067dd1f202b9", "title": "Storms arrive tonight with multiple rounds into the weekend", "date": "2024-05-16 14:00", "url": "https://www.fox8live.com/2024/05/16/storms-arrive-tonight-with-multiple-rounds-into-weekend/", "message": "NEW ORLEANS (WVUE) - A stormy period is expected to develop over the region starting tonight and continuing into the weekend.\nThere will be a small shower chance this morning but as the day progresses, dry skies will become more likely.\nOur first storm threat develops overnight tonight as a line of strong to severe storms move in around midnight.\nI’m not too concerned about flooding with tonight’s round of storms as it should be moving pretty quickly.\nThe second round of storms develops later Friday in the late afternoon and evening."}, {"id": "8c017689-c338-4548-91a5-fd8087d2f622", "title": "Help available for Pointe Coupee residents ahead of new round of storms", "date": "2024-05-16 04:00", "url": "https://www.wbrz.com/news/help-available-for-pointe-coupee-residents-ahead-of-new-round-of-storms", "message": "Help available for Pointe Coupee residents ahead of new round of stormsPOINTE COUPEE - As a new round of storms is set to roll in this week, some residents in Pointe Coupee Parish are just starting to clean up from the damage caused Monday.\nPointe Coupee fire district 4 firefighters were handing out free tarps before the next round of storms hit.\nTerence Sellers was there picking up some after trees crashed into his family's trailer home.\nSellers said he's still nervous about what's to come, especially since they're still without power, with no estimate on when it'll come back.\n“I usually don't get nervous but this one made me really nervous with all the wind that was blowing."}, {"id": "145a5730-bd24-4c6a-8ecf-4b47bab47137", "title": "NHC begins issuing outlooks today , including 7 - day outlook", "date": "2024-05-16 22:45", "url": "https://www.wuwf.org/florida-news/2024-05-16/nhc-begins-issuing-outlooks-today-including-7-day-outlook", "message": "The 2024 Atlantic hurricane season is still a little over two weeks away, but the first forecasts start today.\nThe National Hurricane Center began issuing their tropical weather outlooks today, which show the probability of tropical cyclones forming over a given area in the next two to seven days.\nEven though hurricane season doesn’t officially begin until June 1, the National Hurricane Center started issuing their outlooks ahead of the season to account for early activity, which has been common in recent years.\nThe NHC started issuing the Tropical Outlook products in Mid May of 2021.\nAlthough a special outlook was issued in late April for a system with a sub-30-percent chance of development, it failed to become a tropical system."}, {"id": "06ebaf6a-4f14-4cf6-ab62-db0b2cca24c5", "title": "Omaha area flash flood warning expires", "date": "2024-05-16 04:30", "url": "https://omaha.com/news/local/weather/omaha-area-flash-flood-warning-expires/article_05926272-1308-11ef-8cc5-0316b0405c6f.html", "message": "Parts of the Omaha metro area was under a flash flood warning as strong rains moved through the area Wednesday evening.\nA Flash Flood Warning was issued until 8 p.m. for Omaha, Council Bluffs and La Vista, according to the National Weather Service.\nBecky Kern, warning coordination meteorologist with the NWS office in Valley, said they had received unofficial reports of rain falling at a rate of more than 3 inches per hour in parts of the Omaha area.\nThe weather service issued a reminder on social media to not drive through flooded roadways.\nThe Omaha Public Power District said more than 3,600 customers were without power as of 5:15 p.m. due to a circuit outage in northwest Omaha and another in north central Omaha."}, {"id": "1e672113-6f46-4ff6-9a56-ebe4b773d0b1", "title": "Thursday Threat of Flash Flooding in East Texas Raised to HIGH", "date": "2024-05-16 16:45", "url": "https://kicks105.com/east-texas-flash-flooding-outlook/", "message": "A storm system will push across East Texas and western Louisiana today and tonight and bring severe storms and high rainfall amounts.\nFlash Flooding RiskWeather Prediction Center Weather Prediction Center loading...\nModerate to high flash flooding outlooks are in effect for much of East Texas all the way to the Dallas/Fort Worth Metroplex.\nWeather Prediction Center Weather Prediction Center loading...\nStorm Prediction Center Storm Prediction Center loading...A large to very large hail threat is expected from central Texas through much of the Hill Country."}, {"id": "59bbea37-a0ff-4319-bcfc-f2bb317b92e3", "title": "Thursday Threat of Flash Flooding in East Texas Raised to HIGH", "date": "2024-05-16 18:30", "url": "https://kfox95.com/ixp/151/p/east-texas-flash-flooding-outlook/", "message": "A storm system will push across East Texas and western Louisiana today and tonight and bring severe storms and high rainfall amounts.\nFlash Flooding RiskWeather Prediction Center Weather Prediction Center loading...\nModerate to high flash flooding outlooks are in effect for much of East Texas all the way to the Dallas/Fort Worth Metroplex.\nWeather Prediction Center Weather Prediction Center loading...\nStorm Prediction Center Storm Prediction Center loading...A large to very large hail threat is expected from central Texas through much of the Hill Country."}, {"id": "46f8d40b-6b1a-4a29-8c4d-91a8129e9bef", "title": "Thursday Threat of Flash Flooding in East Texas Raised to HIGH", "date": "2024-05-16 22:15", "url": "https://q1077.com/ixp/151/p/east-texas-flash-flooding-outlook/", "message": "A storm system will push across East Texas and western Louisiana today and tonight and bring severe storms and high rainfall amounts.\nFlash Flooding RiskWeather Prediction Center Weather Prediction Center loading...\nModerate to high flash flooding outlooks are in effect for much of East Texas all the way to the Dallas/Fort Worth Metroplex.\nWeather Prediction Center Weather Prediction Center loading...\nStorm Prediction Center Storm Prediction Center loading...A large to very large hail threat is expected from central Texas through much of the Hill Country."}, {"id": "34171a73-4250-4b26-9777-a98263a5666c", "title": "A pole fire caused a mass Tampa Bay internet outage , company says . Is it a warning ? ", "date": "2024-05-16 15:15", "url": "https://www.tampabay.com/news/business/2024/05/16/why-spectrum-internet-outage-pinellas-manatee-st-petersburg-refund/", "message": "PINELLAS PARK — A hint of smoke smell still hung in the air along Park Boulevard near 73rd Street North days after a utility pole caught fire and, according to the provider, sparked a mass Spectrum internet outage Saturday.\nThis electricity pole caught fire at about 4 a.m. Saturday, according to the Pinellas Park Fire Department.\nThe reason that a fire on an electricity pole impacted internet and cell service is because of how interconnected our grid has become, experts said.\nBoth Verizon and Frontier also have cables on that same pole or underground beneath it, the companies told the Times.\nTelecommunications companies are generally less regulated, because it’s assumed that, unlike with monopoly power companies, customers can take their business elsewhere if service is bad."}, {"id": "9414a351-922f-4625-ac91-61a13fa925c5", "title": "Canada oil sands wildfires expected to die down , but summer fire season approaches", "date": "2024-05-16 12:15", "url": "https://www.foxnews.com/world/fires-expected-die-down-canadas-oil-sands-summer-fire-season-approaches", "message": "But scientists have said it's not clear that wildfire smoke will be the same problem it was last year, when unusual weather patterns drove the haze southward.\n\"We’ve come to accept columns of smoke blocking out the whole sky and yet we’re still drilling for oil.\"\nAlberta, the province that includes Fort McMurray, draws significant revenue from the fossil fuel industry.\nFire officials said evacuation orders would likely be in place in Fort McMurray until Tuesday.\nCLICK HERE TO GET THE FOX NEWS APP\"They just never bothered to tell the people in Fort McMurray who are living with the consequences of peak C02,\" Angus wrote."}, {"id": "facbedbc-a9bd-43e2-8886-2a53c7ef93cf", "title": "Oilsands capital of Canada now grappling with second wildfire", "date": "2024-05-16 11:30", "url": "https://www.bnnbloomberg.ca/oilsands-capital-of-canada-now-grappling-with-second-wildfire-1.2073586", "message": "The unofficial capital of Canada’s oilsands industry is now facing a second wildfire that’s north of the city and closer to major energy operations.\nThe new blaze near Fort McMurray, Alberta, is about 3 hectares (7 acres) in size, and is about 10 kilometers (6 miles) away from Suncor Energy Inc.’s Millennium and Steepbank mine sites, provincial data show.\nAlready, more than 6,000 people have been evacuated from Fort McMurray communities, and long-term prospects of rain extinguishing the blazes are low.\nSuncor, which operates oil-sands mines to the north of the city, said the latest fire hasn’t affected operations.\nWinds were expected to weaken and push the fire away from Fort McMurray, helping firefighting efforts."}, {"id": "e75e865b-06de-4cc0-bf6a-33143bc920e5", "title": "Insurance Premiums Are Heating Up in States Prones to Wildfires", "date": "2024-05-16 01:30", "url": "https://robbreport.com/shelter/homes-for-sale/wildfires-raising-home-insurance-rates-1235618129/", "message": "“She wanted to renegotiate.”Then, in March, State Farm announced that it was discontinuing fire insurance policies across the state ahead of the 2024 wildfire season.\n“She wanted to renegotiate.”Then, in March, State Farm announced that it was discontinuing fire insurance policies across the state ahead of the 2024 wildfire season.\nMorris told the news site that after the American International Group canceled his policy in 2022, he switched over to a $22,000 per year plan with State Farm.\n“It’s a problem that’s not going away.”Insurance companies including State Farm have pulled out of California due to wildfire risks.\nPaul Bersebach/MediaNews Group/Orange County Register via Getty ImagesIt’s a similar story in Florida, where insurance rates tripled over the last three years."}, {"id": "3b80759c-8151-4e27-904c-5bf39cc5e4b4", "title": "Texas renewable energy sources : ABC13 tours new Wharton Co . wind farm Prairie Switch Wind Project near Highway 59", "date": "2024-05-16 00:15", "url": "https://abc13.com/post/prairie-switch-wind-project-farm-in-wharton-county-southeast-texas-turbines-renewable-energy-source/14815678/", "message": "ONLY ON ABC13: A closer look at southeast Texas' 1st wind farm ahead of its ribbon cutting ceremonyBehind the scenes with Fengate's Prairie Switch Wind Project at a new wind farm in Wharton County near Highway 59, the first in southeast Texas.\nBehind the scenes with Fengate's Prairie Switch Wind Project at a new wind farm in Wharton County near Highway 59, the first in southeast Texas.\nBehind the scenes with Fengate's Prairie Switch Wind Project at a new wind farm in Wharton County near Highway 59, the first in southeast Texas.\nBehind the scenes with Fengate's Prairie Switch Wind Project at a new wind farm in Wharton County near Highway 59, the first in southeast Texas.\nWHARTON COUNTY, Texas (KTRK) -- Down Highway 59 in central Wharton County, 48 towering turbines are now spinning at the Prairie Switch Wind Project."}, {"id": "bcbdcbc8-f06d-4090-8b20-03848b0dd07b", "title": "Oil - Sands Capital of Canada Now Grappling With Second Wildfire", "date": "2024-05-16 09:45", "url": "https://www.insurancejournal.com/news/international/2024/05/16/774400.htm", "message": "The unofficial capital of Canada’s oil-sands industry is now facing a second wildfire that’s north of the city and closer to major energy operations.\nThe new blaze near Fort McMurray, Alberta, is about 3 hectares (7 acres) in size, and is about 10 kilometers (6 miles) away from Suncor Energy Inc.’s Millennium and Steepbank mine sites, provincial data show.\nAlready, more than 6,000 people have been evacuated from Fort McMurray communities, and long-term prospects of rain extinguishing the blazes are low.\nWinds were expected to weaken and push the fire away from Fort McMurray, helping firefighting efforts.\nTopics Catastrophe Natural Disasters Wildfire Energy Oil Gas Canada"}, {"id": "1a2d2fef-efdf-4f26-8b7a-16094d05e915", "title": "Population growth , housing market added challenges for governor conference", "date": "2024-05-16 22:15", "url": "https://www.wflx.com/2024/05/16/population-growth-housing-market-added-challenges-governors-conference/", "message": "\"So many lessons learned that they tell you things you would never expect,\" Martin County's Emergency Management Director Sally Waite said.\n\"You really got to be ready for all that temporary housing, disaster housing, where do you put people?”That seemed to be the conundrum across the region this year: finding disaster housing for a population exponentially larger.\nMartin County Emergency Management Director Sally Waite says the aim is to learn from other directors and see what the needs are in a disaster.\n“I think recovery is huge after seeing Ian for most emergency management directors,\" Waite said.\nThe Governor's Hurricane Conference runs through May 17 at the Palm Beach County Convention Center."}, {"id": "b5a5079b-0a77-4e58-96ae-4a550ae5ed63", "title": "Fear , anxiety in Fort McMurray as people watch wildfire approach the city", "date": "2024-05-16 02:15", "url": "https://www.theglobeandmail.com/canada/alberta/article-fear-anxiety-in-fort-mcmurray-as-people-watch-wildfire-approach-the/", "message": "Open this photo in gallery: Trees burned in the 2016 wildfire in Fort McMurray, Alta., stand sentinel over a neighbourhood in the city on May 15.\nAnd when fire started to threaten Fort McMurray this year, she packed more bags.\n“My nerves are just shot,” Mr. Grant said Wednesday afternoon, in the yard where they rebuilt their home in Fort McMurray.\nThe smoke turned the sky grey over Fort McMurray on Wednesday, with the odd helicopter flying overhead.\nPremier Danielle Smith acknowledged the fear and uncertainty blanketing Fort McMurray and offered her sympathy to residents."}, {"id": "9b186630-5c94-4f7d-88c5-fe0c3fb91b87", "title": "Fire threat eases near Canada oil sands hub , but long , hot summer looms", "date": "2024-05-16 16:45", "url": "https://www.naharnet.com:443/stories/en/305262-fire-threat-eases-near-canada-s-oil-sands-hub-but-long-hot-summer-looms", "message": "But scientists have said it's not clear that wildfire smoke will be the same problem it was last year, when unusual weather patterns drove the haze southward.\nIn Fort McMurray, about 6,600 residents fled parts of the city's southern end while others were on on alert.\nAlberta, the province that includes Fort McMurray, draws significant revenue from the fossil fuel industry.\nFire officials said evacuation orders would likely be in place in Fort McMurray until Tuesday.\n\"They just never bothered to tell the people in Fort McMurray who are living with the consequences of peak C02,\" Angus wrote."}, {"id": "b18e3d73-72d3-4dd5-b761-4f53fffe7644", "title": "Fire threat eases near Canada oil sands hub , but a long , hot summer looms", "date": "2024-05-16 04:15", "url": "https://www.columbian.com/news/2024/may/15/fire-threat-eases-near-canadas-oil-sands-hub-but-a-long-hot-summer-looms/", "message": "The threat from a wildfire near Canada’s oil sands hub of Fort McMurray, Alberta, appeared to be easing on Wednesday, a day after it forced thousands of residents to evacuate and stirred memories of a damaging blaze nearly a decade earlier.\nFavorable winds were expected to push the fire away from the city of about 68,000 in northwest Canada, where many residents earn a paycheck from the nearby oil industry.\nBut scientists have said it’s not clear that wildfire smoke will be the same problem it was last year, when unusual weather patterns drove the haze southward.\nIn Fort McMurray, about 6,600 residents fled parts of the city’s southern end while others were on on alert.\nIt was familiar terrain for the Albertan city, which survived a catastrophic blaze in 2016 that destroyed 2,400 homes and forced more than 80,000 people to flee."}, {"id": "37e2a838-d7e8-4c41-bf25-41412a67e96e", "title": "As floods become more common in Tampa Bay , were looking for answers", "date": "2024-05-16 18:15", "url": "https://www.tampabay.com/opinion/2024/05/16/floods-become-more-common-tampa-bay-were-looking-answers/", "message": "The surface temperature increase also warms the ocean, causing more sea level rise because warm water is less dense and takes up more space.\nWhat worries the scientists, though, is that the rate of sea level rise is increasing.\nHere in the Tampa Bay area we are also aware of more frequent flooding of our streets at high tide.\nBefore arriving at USF, Mitchum was director of the University of Hawaii Sea Level Center, where he developed an interest in sea level rise.\nHe will be one of five panelists for a community conversation on Tuesday, May 21, about climate change, the latest installment of the Tampa Bay Times’ Spotlight Tampa Bay series."}, {"id": "8bacafdf-aa35-48f6-ab4f-52115283d10c", "title": "USS Ronald Reagan leaves its Japan homeport after nearly 9 years", "date": "2024-05-16 22:15", "url": "https://www.navytimes.com/news/your-navy/2024/05/16/uss-ronald-reagan-leaves-its-japan-homeport-after-nearly-9-years/", "message": "The departure of USS Ronald Reagan — one of America’s largest warships and a nuclear-powered Nimitz-class aircraft carrier — comes at a time of growing tension in the face of increasingly assertive China in the Indo-Pacific.\nRELATED USS Ronald Reagan pulls into the Philippines amidst tension with ChinaIt will be replaced later this year by USS George Washington, another Nimitz-class carrier.\nAmbassador to Japan Rahm Emanuel ensured a “seamless transition.”“The USS Ronald Reagan and her crew have ensured that millions of people across the Indo-Pacific have been able to live their lives free of coercion, aggression and suppression,” Emanuel later told reporters.\nUSS Ronald Reagan first arrived in Yokosuka in 2015.\n“We have a sense of urgency that we must not let the East China Sea become another South China Sea,” she said."}, {"id": "7aaafe0b-e906-4411-ba35-34761e276523", "title": "Earthquake this Morning , Storms & Showers Coming Tonight", "date": "2024-05-16 22:00", "url": "https://www.wbbjtv.com/2024/05/16/earthquake-this-morning-storms-showers-coming-tonight/", "message": "Earthquake this Morning, Storms & Showers Coming TonightWBBJ 7 Forecast UpdateWBBJ 7 Forecast Update:An earthquake felt as far away as Parsons hit just after 3am, 4 miles south of Ridgely this morning and a couple small aftershocks developed this afternoon.\nWe will have a recap on the earthquake, tracking any storms on the radar and your complete weekend forecast all coming up here.\nShowers and storms will be possible during the late evening and especially overnight into Friday morning with increasing in coverage and intensity.\nChances for rain overnight Thursday into Friday morning is at 90% as of now.\nFRIDAY:Like Tuesday earlier this week, showers and storms are expected to impact almost all of our viewing area."}, {"id": "1109ec35-9d94-475d-95d7-88b9e9c0e26a", "title": "Natural Disasters Are Making It Harder for Wealthy Homeowners to Insure Their Properties", "date": "2024-05-16 00:00", "url": "https://finance.yahoo.com/news/natural-disasters-making-harder-wealthy-220000573.html", "message": "“She wanted to renegotiate.”More from Robb ReportThen, in March, State Farm announced that it was discontinuing fire insurance policies across the state ahead of the 2024 wildfire season.\n“She wanted to renegotiate.”Then, in March, State Farm announced that it was discontinuing fire insurance policies across the state ahead of the 2024 wildfire season.\nMorris told the news site that after the American International Group canceled his policy in 2022, he switched over to a $22,000 per year plan with State Farm.\n“It’s a problem that’s not going away.”Insurance companies including State Farm have pulled out of California due to wildfire risks.\nIt’s a similar story in Florida, where insurance rates tripled over the last three years."}, {"id": "4427b3df-726f-41ba-9198-5b17652dc58e", "title": "Tropics watch : National Hurricane Center tropical outlook . See what weather is out there", "date": "2024-05-16 14:00", "url": "https://www.yahoo.com/news/tropics-watch-national-hurricane-centers-121746633.html", "message": "The National Hurricane Center's second tropical outlook for the 2024 Atlantic hurricane season is out.\nForecasters with the National Hurricane Center didn't highlight any tropical cyclones or tropical waves in Thursday morning's outlook.\nWeather watches and warnings issued in FloridaWhen is the Atlantic hurricane season?\nThe Atlantic hurricane season runs from June 1 through Nov. 30.\nThis article originally appeared on Treasure Coast Newspapers: Hurricane season: NHC forecasts no tropical cyclone activity 7 days"}, {"id": "227e2228-161b-45fe-b6c7-a42d95017b0a", "title": "Buckle Up For More Dust Storms Thanks To Land Degradation , Climate Change", "date": "2024-05-16 02:45", "url": "https://www.freepressjournal.in/analysis/buckle-up-for-more-dust-storms-thanks-to-land-degradation-climate-change", "message": "In India dust storm and thunderstorm activity usually peak in the pre-monsoon period, between March and May.\nThe worst sand and dust storms India experienced was on May 2, 2018 when severe dust storms, thunderstorms and lightning hit several parts of India, resulting in the deaths of at least 124 people and injuries to 300 others.\nClimate change — which is bringing droughts and more extreme temperatures — is amplifying these factors.\nIn some areas, desert dust has doubled in the 20th century, increasing the chance of sand and dust storms.\nCombating sand and dust storms requires accelerated action and relevant capacity in multiple- hazard risk reduction for both adaptation and mitigation."}, {"id": "25d4f06b-0bdb-4fc2-be60-dc167ced10c2", "title": "USS Ronald Reagan leaves its Japan homeport after nearly 9 years", "date": "2024-05-16 18:15", "url": "https://www.yahoo.com/news/uss-ronald-reagan-leaves-japan-175130999.html", "message": "The departure of USS Ronald Reagan — one of America’s largest warships and a nuclear-powered Nimitz-class aircraft carrier — comes at a time of growing tension in the face of increasingly assertive China in the Indo-Pacific.\nUSS Ronald Reagan pulls into the Philippines amidst tension with ChinaIt will be replaced later this year by USS George Washington, another Nimitz-class carrier.\nAmbassador to Japan Rahm Emanuel ensured a “seamless transition.”“The USS Ronald Reagan and her crew have ensured that millions of people across the Indo-Pacific have been able to live their lives free of coercion, aggression and suppression,” Emanuel later told reporters.\nUSS Ronald Reagan first arrived in Yokosuka in 2015.\n“We have a sense of urgency that we must not let the East China Sea become another South China Sea,” she said."}, {"id": "1053024b-4197-4306-ba22-8e6379c77909", "title": "Turn Around Dont Drown : More Flooding Possible in So . Indiana", "date": "2024-05-16 03:00", "url": "https://103gbfrocks.com/turn-around-indiana-flooding/", "message": "Recent rains have caused flooding in some Southern Indiana neighborhoods, and the National Weather Service is predicting more rainfall in the coming days.\nSo here is your reminder of the importance of the phrase Turn Around Don't Drown.\nThe National Weather Service has issued a Hazardous Weather Outlook for a number of counties in Indiana, Kentucky, and Illinois, including Vanderburgh, Warrick, Posey, and Henderson Counties.\nTurn Around Don't DrownWith the possibility of flash flooding in the forecast, it felt like the right time to remind you: Turn Around Don't Drown.\n[Source: National Weather Service]"}, {"id": "8233240f-a66d-40e9-8d66-3d916cca3a04", "title": "Tampa Safety Concerns", "date": "2024-05-16 14:00", "url": "https://www.wduv.com/news/tampa-safety-concerns/OVKPZW4FZ5DJ3JK6ZKB6VDCBDQ/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "7efe2e3f-ea85-449b-9134-680c538a1102", "title": "Coimbatore Corporation must implement pre - emptive measures ahead of heavy rain , say experts", "date": "2024-05-16 14:15", "url": "https://www.thehindu.com/news/cities/Coimbatore/coimbatore-corporation-must-implement-pre-emptive-measures-ahead-of-heavy-rain-say-experts/article68182774.ece", "message": "As the district is expected to get heavy rain in the coming days, residents have urged Coimbatore Corporation take a three-fold approach to tackle monsoon-related problems: clean stormwater drains, promote rainwater harvesting, and check electric lines.\n“Once the monsoon arrives, we often witness flooded underpasses and unfortunate cases of electrocution, all pointing to the unpreparedness of the civic body,” said J. Jayaprakash, a resident.\nAccording to the Corporation, areas near the seven smart city lakes are susceptible to flooding because of their low-lying terrain, particularly along Selvachintamani tank and Valankulam, which are downstream.\n“We have also begun cleaning storm water drains across the city.\n“Today, no civic body can afford to waste rainwater."}, {"id": "ccf9766e-efe0-43a2-8173-291126d5806c", "title": "Update : Allegheny County under a flash flood warning Wednesday night", "date": "2024-05-16 02:45", "url": "https://www.pennlive.com/weather-alerts/2024/05/allegheny-county-under-a-flash-flood-warning-wednesday-night.html", "message": "On Wednesday at 9:04 p.m. the National Weather Service issued an updated flash flood warning in effect until 10:30 p.m. for Allegheny County.\n\"Flash flooding of small creeks and streams, urban areas, highways, streets and underpasses as well as other poor drainage and low-lying areas.\"\nUnderstanding the differences between advisories, watches, and warningsFlash flood warning: Take action!\nA flash flood warning is issued when a flash flood is imminent or occurring.\nA flash flood is a sudden violent flood that can take from minutes to hours to develop."}, {"id": "7366ecb4-3309-4e4e-9577-27fb6b43f556", "title": "Province urges British Columbians to be  FireSmart  ahead of long weekend", "date": "2024-05-16 17:45", "url": "https://globalnews.ca/news/10500567/bc-firesmart-long-weekend/", "message": "Send this page to someone via emailThe government of British Columbia is urging its residents and community members to be cautious and “FireSmart” ahead of the coming Victoria Day long weekend.\nWildfires near Fort Nelson and the Fort Nelson First Nation have already resulted in evacuation orders and alerts for several communities in northeastern B.C.\nduring wildfire season are encouraged to stay up to date with the upgraded BC Wildfire Service mobile app.\nThe app will provide critical information such as evacuation orders and alerts, fire bans and wildfire details.\nFor the upcoming Victoria Day long weekend, the government is warning that there will be an increase in traffic volume around the province."}, {"id": "62413e4b-fc37-480b-ae1d-ffbb90b25fef", "title": "Scientists aim to improve Western snowfall , water supply forecasts with research project in Colorado", "date": "2024-05-16 22:15", "url": "https://knpr.org/2024-05-16/scientists-improve-western-snowfall-water-supply-forecasts-project-colorado", "message": "Next winter, research scientists from several institutions, including Colorado State University and the University of Utah, will converge in the Park Range mountains of northwestern Colorado.\nThroughout the 2024-2025 winter season, the team will use radar technology and snow-sampling tools to measure the size and shape of snowflakes.\nBrenda Dolan, a Colorado State research scientist involved with the project, said collecting this precipitation and climate data is crucial.\nThe National Science Foundation is funding the $4.8 million project, led by the University of Michigan.\nThe University of Wisconsin, University of Washington, and Stony Brook University in New York are also involved."}, {"id": "245f997d-9025-4c8e-a537-4a2f5376fc8d", "title": "Fort Nelson , B . C ., wildfire expands to 127 square kilometres , but away from town", "date": "2024-05-16 16:45", "url": "https://toronto.citynews.ca/2024/05/16/fort-nelson-b-c-wildfire-expands-to-127-square-kilometres-but-away-from-town/", "message": "FORT ST. JOHN, B.C.\n— A wildfire threatening the town of Fort Nelson in far northeast B.C.\nStaff at the emergency operations centre in Fort Nelson were assessing the damage and contacting property owners, he said in an interview on Thursday.\n“That would be just a nightmare.”For Fort St. John businesses, the impact of the influx was almost immediate.\nA previous version said Fort St. John is in the northwest of B.C."}, {"id": "e0980fb2-db6c-41b2-955c-eb7e4021f2f5", "title": "Fort Nelson , B . C ., wildfire expands to 127 square kilometres , but away from town", "date": "2024-05-16 18:30", "url": "https://energeticcity.ca/2024/05/16/fort-nelson-b-c-wildfire-expands-to-127-square-kilometres-but-away-from-town/", "message": "Your Community, Your NewsDid you know that Energeticcity.ca is the only newsroom in Fort St. John with ALL of our staff based here?\nThat’s why you can trust us to deliver accurate, timely and reliable news when you need it most."}, {"id": "b9de9272-0862-413e-bc94-3f2edb9effce", "title": "US Navy USS Ronald Reagan departs Japan home port after nearly a decade", "date": "2024-05-16 18:00", "url": "https://www.foxnews.com/world/us-navys-uss-ronald-reagan-departs-japan-home-port-nearly-decade", "message": "The USS Ronald Reagan, a key component in bolstering defense ties in the Indo-Pacific, departed its Japanese home port after almost a decade.\nIt will be replaced by another Nimitz-class carrier, the USS George Washington, later this year.\nFamily and friends bid farewell to the USS Ronald Reagan at Yokosuka Naval Base after its final patrol.\n\"The USS Ronald Reagan and her crew have ensured that millions of people across the Indo-Pacific have been able to live their lives free of coercion, aggression and suppression,\" Emanuel later told reporters.\n\"We have a sense of urgency that we must not let the East China Sea become another South China Sea,\" she said."}, {"id": "aafa58fa-27f0-4e1d-a5cf-38abc1d81b79", "title": "Strictly Johannes Radebe as youve never seen him before ! ", "date": "2024-05-16 12:15", "url": "https://www.dailymail.co.uk/tvshowbiz/johannes-radebe/article-13425407/Strictlys-Johannes-Radebe-youve-never-seen-pro-dancer-dons-dress-foliage-upcoming-Chelsea-Flower-Show.html", "message": "Strictly's Johannes Radebe donned a flower dress on Thursday to promote WaterAid's rain garden the Chelsea Flower Show at the Royal Hospital Chelsea in London.\nThe flowers on Johannes' outfit were drought-resistant to promote WaterAid’s new rain garden which will debut at the Show in May.\n'WaterAid is doing amazing work helping get clean water to people, and their garden at Chelsea Flower Show next week will highlight the crucial importance of clean water for all, whatever the weather.'\nThe RHS Chelsea Flower Show, formally known as the Great Spring Show, begins on May 21 and ends on May 25.\n'Everyone needs clean water so we can all stay safe, healthy and thrive."}, {"id": "3083d502-19b1-453b-af73-d272961f901a", "title": "Mysterious bang at Saltwater Point , NSW | Great Lakes Advocate", "date": "2024-05-16 07:45", "url": "https://www.greatlakesadvocate.com.au/story/8631440/mysterious-bang-at-saltwater-point-nsw/?cs=2726", "message": "The Volcano Discovery website reported: \"A possible earthquake might have occurred near Forster, New South Wales, Australia, in the morning of Thursday, May 16, 2024 at around 10.42am local time (GMT +10).\nDetails of the quake (if it is one) are so far unkown until confirmed by a seismic agency, but the event was reported felt.\nWe will update the status of the event on this page as soon as more information becomes available.\""}, {"id": "45ea7927-e748-4189-bdd7-71dec069f02b", "title": "Mysterious bang at Saltwater Point , NSW | Great Lakes Advocate", "date": "2024-05-16 12:15", "url": "https://www.greatlakesadvocate.com.au/story/8631440/mysterious-bang-at-saltwater-point-nsw/?cs=305", "message": "The Volcano Discovery website reported: \"A possible earthquake might have occurred near Forster, New South Wales, Australia, in the morning of Thursday, May 16, 2024 at around 10.42am local time (GMT +10).\nDetails of the quake (if it is one) are so far unkown until confirmed by a seismic agency, but the event was reported felt.\nWe will update the status of the event on this page as soon as more information becomes available.\""}, {"id": "d3c828fb-c394-4031-967d-4c2cd858104a", "title": "Mysterious bang at Saltwater Point , NSW | Great Lakes Advocate", "date": "2024-05-16 10:15", "url": "https://www.greatlakesadvocate.com.au/story/8631440/mysterious-bang-at-saltwater-point-nsw/", "message": "The Volcano Discovery website reported: \"A possible earthquake might have occurred near Forster, New South Wales, Australia, in the morning of Thursday, May 16, 2024 at around 10.42am local time (GMT +10).\nDetails of the quake (if it is one) are so far unkown until confirmed by a seismic agency, but the event was reported felt.\nWe will update the status of the event on this page as soon as more information becomes available.\""}, {"id": "bd593982-ee8a-4e3d-aa9d-4a96a231c7a6", "title": "Mysterious bang at Saltwater Point , NSW | Manning River Times", "date": "2024-05-16 08:15", "url": "https://www.manningrivertimes.com.au/story/8631440/mysterious-bang-at-saltwater-point-nsw/?cs=2681", "message": "The Volcano Discovery website reported: \"A possible earthquake might have occurred near Forster, New South Wales, Australia, in the morning of Thursday, May 16, 2024 at around 10.42am local time (GMT +10).\nDetails of the quake (if it is one) are so far unkown until confirmed by a seismic agency, but the event was reported felt.\nWe will update the status of the event on this page as soon as more information becomes available.\""}, {"id": "63fb0cb6-baa5-41dc-89fe-db42cd2bc623", "title": "Mysterious bang at Saltwater Point , NSW | Manning River Times", "date": "2024-05-16 11:15", "url": "https://www.manningrivertimes.com.au/story/8631440/mysterious-bang-at-saltwater-point-nsw/?cs=305", "message": "The Volcano Discovery website reported: \"A possible earthquake might have occurred near Forster, New South Wales, Australia, in the morning of Thursday, May 16, 2024 at around 10.42am local time (GMT +10).\nDetails of the quake (if it is one) are so far unkown until confirmed by a seismic agency, but the event was reported felt.\nWe will update the status of the event on this page as soon as more information becomes available.\""}, {"id": "ea966648-ff98-473d-98ef-2e28ca989071", "title": "Our city protector - The Seawall", "date": "2024-05-16 22:45", "url": "https://www.kristv.com/coastal-bend-history/our-citys-protector-the-seawall", "message": "From the Doc McGregor Collection courtesy of the Corpus Christi Museum of Science and HistoryProtecting downtown and the city became a top priority.\nBuilt in 1925, the breakwater was required by the federal government before the Port of Corpus Christi could open.\nSeawall repairs began a year and a half later and wrapped up in 2006 at a total cost of $43.4 million.\nCorpus Christi Caller-TimesThe seawall fund still exists today and helps fund not just repairs but upgrades, and development.\nThe most recent seawall repairs are expected to last for at least 50 years."}, {"id": "07a6954e-b1f4-4d3a-b7eb-725363aa4ed3", "title": "FIRST ALERT | Chris Bailey says here we go again", "date": "2024-05-16 20:30", "url": "https://www.wkyt.com/2024/05/16/first-alert-chris-bailey-says-here-we-go-again/", "message": "LEXINGTON, Ky. (WKYT) - Much better weather is back in the Bluegrass state today and you had better get out there and enjoy it!\nRounds of showers and storms are back in here for the next couple of days.\nLow pressure to our west then rumbles toward the region into Friday with more waves of showers and storms spinning through.\nA few of those may get into western Kentucky this evening and there’s even the low-end risk for a few severe storms.\nHere’s today’s Severe Weather Outlook from the Storm Prediction Center."}, {"id": "3b36a633-00a0-4dc3-ac3e-9c0bc75bba0c", "title": "New Mexico getting $28 million for wildfire defense", "date": "2024-05-16 21:45", "url": "https://www.yahoo.com/news/mexico-getting-28-million-wildfire-200830652.html", "message": "NEW MEXICO (KRQE) – Around New Mexico, 11 communities are getting a share of $28 million to boost wildfire defenses.\nOtero County received $243,100 to develop a community wildfire protection plan for Otero County.\nValencia County received $159,600 to update and expand community wildfire protection plans throughout the county of Valencia, NM.\nSan Miguel County received $88,000 to update the San Miguel County community wildfire protection plan following the Hermits Peak/Calf Canyon Fire.\nMora County received $88,000 to update the Mora County community wildfire protection plan following the Hermits Peak/Calf Canyon Fire."}, {"id": "54394629-ebc8-41af-98ef-97909ea668e3", "title": "DeSantis signs bill deleting climate change mentions from Florida state law", "date": "2024-05-16 00:00", "url": "https://us.cnn.com/2024/05/15/politics/desantis-bill-climate-change-florida/", "message": "CNN —As Florida copes with rising seas and record temperatures, lawmakers are going to exceptional lengths to delete many mentions of climate change from state laws in a new bill that Republican Gov.\nThe wide-ranging law makes several changes to the state’s energy policy – in some cases deleting entire sections of state law that talk about the importance of cutting planet-warming pollution.\n“It goes further than any other state has gone in repealing its existing climate laws,” Michael Gerrard, founder of the Sabin Center for Climate Change Law at Columbia University, told CNN.\nDeSantis vetoed over $29 million dollars in federal energy rebates and energy efficiency grants from the Inflation Reduction Act and Bipartisan Infrastructure Law.\nHammond called focusing on adapting to climate change and hardening infrastructure without attribute it to a warming planet “consistent to the conservative approach.”“They don’t want to acknowledge that climate change is happening; they acknowledge they have flooding,” Gerrard said."}, {"id": "e5753413-b5ee-4400-bcc0-f5c182747706", "title": "Climate change brings rising Lake Michigan water levels . Art Museum , Summerfest , others respond", "date": "2024-05-16 11:15", "url": "https://www.yahoo.com/news/climate-change-brings-rising-lake-100425880.html", "message": "Lake levels fluctuate ― with climate change bringing big swingsRunoff and precipitation add water to Lake Michigan, with evaporation and diversions removing water.\nIncreased lake levels bring challengesLong-term increases in Great Lakes water levels will bring some big challenges.\n\"Higher lake levels mean that storms, flooding events and natural variability will have more extreme impacts on the lake shores, and coastal decision makers will have to adapt to higher lake levels in the coming years,\" the article said.\n\"We are actively watching water level trends and considering record water levels with any construction project,\" Dieckelman said.\nThe subjects are Bay View Park, Bender Park, Big Bay Park, Bradford Beach and McKinley Park, Cupertino Park, Doctors Park, Grant Park, Lake Park/Linnwood Revetment, Sheridan Park, South Shore Park, Veterans Park and Warnimont Park."}, {"id": "af18f6f3-bab2-448f-8a3d-ef66a4fe50ab", "title": "Tyson Foods CEO Unsure When Nation Collapsing Beef Herd Will Reverse", "date": "2024-05-16 00:15", "url": "https://www.zerohedge.com/commodities/tyson-foods-ceo-unsure-when-nations-collapsing-beef-herd-will-reverse", "message": "Tyson Foods CEO Donnie King spoke at the BMO Global Farm to Market Conference in Toronto on Wednesday, expressing much uncertainty about when US ranchers will rebuild tight cattle herds meaningfully.\nHe stated ranchers had been pressured in recent years to offload cattle due to high grain costs and drought, which, in return, sent the nation's beef cattle herd plunging to the lowest in more than half a century.\nAll in all, King's comments did not provide confidence that the nation's beef cattle herd would reverse from seven-decade lows as ranches continue offloading cows to slaughterhouses.\nThe latest figures from the US Department of Agriculture show that the nation's cattle herd is 87.2 million head (as of Jan. 1), the lowest level since 1951.\nThis perfect storm has sent beef prices at the supermarket to record highs."}, {"id": "448aef52-ffe8-43a7-ab64-e76afe75cc47", "title": "Sewage scandal water group to pay shareholders £320million", "date": "2024-05-16 15:30", "url": "https://www.express.co.uk/finance/city/1900087/Sewage-scandal-water-group-to-pay-shareholders-320million", "message": "United Utilities plans to pay its shareholders £320million in dividends, just days after the revelation that it pumped millions of litres of raw sewage into Lake Windermere.\nA spokesman defended the payouts and said that they were necessary to attract the investment it needs to update its infrastructure and prevent future spills.\nThat is 9.4% higher than last year and represents a £320million payday for its shareholders.\nLake Windermere, a Unesco world heritage site, had millions of litres of raw sewage pumped into itTrendingEarlier this week, United was engulfed in a storm after it emerged that it had pumped sewage into the iconic lake in February.\nIt blamed a telecoms fault which caused its main pumps to stop and for emergency pumps discharging untreated sewage into Windermere, a Unesco World Heritage site, for 10 hours."}, {"id": "d0ee70a0-734a-445f-8141-6de8cafe379c", "title": "4 . 0 Magnitude Earthquake Reported In US | NewsRadio 1450 / 1370 WKIP", "date": "2024-05-16 00:00", "url": "https://1450wkip.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "dc1e5f08-1ff3-43ea-aa33-1d90fc20a694", "title": "4 . 0 Magnitude Earthquake Reported In US", "date": "2024-05-16 00:00", "url": "https://kprcradio.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "3af06230-114a-4d97-ab1d-017e485e372a", "title": "4 . 0 Magnitude Earthquake Reported In US | News Talk 99 . 5 WRNO", "date": "2024-05-16 00:00", "url": "https://wrno.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "4598034e-7a44-4ca3-a831-d2dff54123d0", "title": "4 . 0 Magnitude Earthquake Reported In US | Newsradio WTAM 1100", "date": "2024-05-16 00:00", "url": "https://wtam.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "2de6ae09-201c-4720-8bca-60683d284a0c", "title": "4 . 0 Magnitude Earthquake Reported In US", "date": "2024-05-16 00:00", "url": "https://600wrec.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "1d27e79d-2cd5-4de8-a3ac-22937ad873cb", "title": "4 . 0 Magnitude Earthquake Reported In US | Talk Radio 105 . 9", "date": "2024-05-16 00:00", "url": "https://knrs.iheart.com/content/2024-05-15-40-magnitude-earthquake-reported-in-us/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "b41e673d-b282-4a59-9bc9-b0bc84ddcc6c", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State | News Radio 103 . 1 and 810 WGY", "date": "2024-05-16 21:30", "url": "https://wgy.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "3e15dd93-9c3f-42f3-8bc5-63d2197183b0", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 21:30", "url": "https://wonw1280.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "8b84184e-1ce0-4d49-9624-962870bb6d28", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 21:15", "url": "https://720thevoice.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "e3fc7367-9ca1-4c9f-8af6-8f8517030fde", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:15", "url": "https://kxic.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "9e5fb5e9-e4b9-4ef7-9807-cb71c59cde14", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://talk1200boston.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "a8b6328e-587b-41ac-9cea-586ad9e2fdd3", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://kfiam640.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "eaa67357-99fe-4ca7-b934-b1592e0c03c5", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://newsradio540.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "4bbce615-c1d5-401e-9b81-6b6905aa545b", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://kfab.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "7ed4a88e-b358-4336-916d-8ccccc9142ed", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://twincitiesnewstalk.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "866a65ed-7a01-4474-abe0-30e753e2261f", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://wrko.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "fce216d9-638f-48b1-b601-ceed11166be7", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://800wvhu.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "38c9b5cb-192a-4793-97be-1571e532276c", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:30", "url": "https://790waeb.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "bdde34c5-3c38-4393-85da-d59ca0ca4371", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State | PowerTalk 1460 AM & 101 . 1 FM", "date": "2024-05-16 20:45", "url": "https://powertalk1460.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "5cb5ac77-b05c-4fda-8a4f-7f362493e60a", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:45", "url": "https://newsradio710.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "4d6e9123-c80a-43b9-aa26-4f96399a5ce9", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:45", "url": "https://ktsmradio.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "483b416c-1a75-4db6-a3c7-95eddeca5e9e", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State | NewsTalk WMEQ", "date": "2024-05-16 20:45", "url": "https://wmeq.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "3d02ea2a-aa95-441b-b597-b74313569a32", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 20:45", "url": "https://710wor.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "19c37975-f596-45cb-b359-a3c43d8f0d8e", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 21:45", "url": "https://wilm.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "f22b1b2a-4c5b-4576-8a21-8dec1a1aedd1", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 21:45", "url": "https://wham1180.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "60e658c8-d987-4d64-9592-b6f2c650cb7d", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 21:45", "url": "https://wspd.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "aa76be9d-1b5f-4245-8f9e-ba6a43077a1c", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 21:45", "url": "https://realradio.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "3f8fdd95-1bf4-4c28-90b8-90b3f9ffbffe", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:15", "url": "https://kwhn.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "0d2ebaec-9a35-42ba-89c4-28b12156b34f", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:15", "url": "https://khvhradio.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "6f813ee8-4f13-4bf3-ab17-d606b16de6ae", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:15", "url": "https://700wlw.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "74144487-3bc3-4c73-b3f4-c6211ba58157", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State | AM 600 WMT", "date": "2024-05-16 22:15", "url": "https://600wmtradio.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "b4a1af16-152f-4c41-8d19-b190cfd64cc2", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:15", "url": "https://hallelujah955.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "4970af4f-da29-453b-b6c9-3c8a4cdf9f6f", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:30", "url": "https://wlap.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "25d5827d-e4e6-4e45-89ad-2cc32bf6001c", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:30", "url": "https://kfyi.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "d9b698f0-03be-426e-ae79-77d51c51d74a", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:30", "url": "https://wbhpam.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "6f11bdea-6dbe-457c-9494-458066e69364", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State | NewsRadio WKCY", "date": "2024-05-16 22:30", "url": "https://newsradiowkcy.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "6983ef21-1bc2-4404-9215-75ddafb99ef2", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://knst.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "1f264a97-5bed-4d55-b8af-b057d0ab1739", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://wccfradio.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "9556dd4b-4d29-47ad-a87f-9c62054d23b6", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://945wpti.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "cd0d178e-2e96-47e3-8e7c-f5a8825f0f85", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://600wrec.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "5eb0e910-c3be-4aed-bb43-6923dd61735b", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://55krc.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "da92b7f9-105d-4155-8240-20bc8b487f0f", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State | NewsRadio 1450 / 1370 WKIP", "date": "2024-05-16 22:45", "url": "https://1450wkip.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "93f506e7-9feb-4a50-a2e2-69fbc576e3ff", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://wrak.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "437a5e8c-e92e-46bd-806b-efbe96643c3a", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://newstalk1090.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "dc27324a-a133-448d-8337-0bd9bcc0e92f", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 22:45", "url": "https://veropatriot.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "2bc3a9dc-dd8a-42e9-80ef-819f32f41a92", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:00", "url": "https://newstalk1230.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "021c7f9a-77c4-4e64-9a8c-7152a52713a8", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:00", "url": "https://koacolorado.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "4ab43bfe-61f5-49c5-b6da-1f3d2b001003", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:00", "url": "https://newstalk1130.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "b784245f-1692-447f-8c04-fed25499dbd1", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:00", "url": "https://ktok.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "e367e947-abed-40e9-9bb2-438a8d7340f9", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:00", "url": "https://whp580.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "e2472320-3653-4720-adbe-f088b849f8f6", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:15", "url": "https://wgiram.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "29f02042-a309-4ea5-b359-b2f0b8798f44", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:15", "url": "https://wsyr.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "ec539feb-23cc-4818-b2a5-3c8b9ce834a0", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:15", "url": "https://wtag.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "967bda80-e1e3-4205-b1e7-82f3eb563b15", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:15", "url": "https://newsradio967.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "ecc657a0-e759-4589-b251-4f00a405d8d9", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:15", "url": "https://wiba.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "575b9927-80eb-4ce5-a55b-87bef5a9e9e5", "title": "3 . 8 Magnitude Earthquake Reported In Surprising US State", "date": "2024-05-16 23:15", "url": "https://wjno.iheart.com/content/2024-05-16-38-magnitude-earthquake-reported-in-us-state/", "message": "The Indonesia earthquake was reported hours after a 5.2-magnitude earthquake struck Chile on Monday (May 13), according to the United States Geological Survey.\nThe Chile earthquake was reported hours after a 6.4 earthquake was reported in Mexico, Guatemala and El Salvador on Sunday (May 12).\nThe latest California earthquake came weeks after a 4.3-magnitude earthquake struck the state on April 18, according to the United States Geological Survey.\nA 6.1-magnitude earthquake struck Indonesia hours after a 6.5-magnitude earthquake struck a Japanese island region.\nBoth earthquakes reported days after a 6.0-magnitude earthquake struck Taiwan on April 22, according to the United States Geological Survey."}, {"id": "985a4d8b-654c-4a14-b0f0-4c280e899c82", "title": "Wildfire updates today : Fort McMurray , Fort Nelson", "date": "2024-05-16 11:15", "url": "https://www.ctvnews.ca/climate-and-environment/latest-updates-on-the-major-wildfires-currently-burning-in-canada-1.6889304", "message": "At present, 76 of those fires are listed as under control, meaning further spread is prevented, with another 14 controlled enough to hold within predetermined boundaries and 30 spreading out of firefighter control.\nA further nine active fires are under the jurisdiction of Parks Canada.\nSeven large wildfires ranging from 3,300 to more than 80,000 hectares are now burning out of control near the community.\nMeanwhile in Alberta, a nearly 20,000-hectare fire near Fort McMurrayshrunk slightly on Thursday and is about six kilometres from city limits.\nFurther information about local fires may be found through their respective provincial wildfire services."}, {"id": "fb86d882-ddc7-49f6-85bb-4dbc6de38cd3", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 06:30", "url": "https://nbc16.com/news/wildfires/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said."}, {"id": "d9899a98-7a7a-43b9-8bcd-e3180984083d", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 07:15", "url": "https://kpic.com/news/local/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said."}, {"id": "0419013e-aa7b-4774-b58f-11fbde8ed577", "title": "Oregon prepares for above - average wildfire season amid firefighter staffing challenges", "date": "2024-05-16 04:30", "url": "https://kcby.com/news/local/oregon-prepares-for-above-average-wildfire-season-amid-firefighter-staffing-challenges", "message": "Officials from the Oregon Department of Forestry and Oregon State Fire Marshal said Wednesday they expect an above-average wildfire season for July and August in eastern parts of the state.\n\"Just as we saw last weekend, temperatures are increasing in our state,” said Doug Grafe, wildfire adviser for Gov.\nThe Oregon Department of Forestry relies on more than 700 firefighters.\nState Fire Marshal Mariana Ruiz-Temple said further complicating Oregon’s fire season is a dwindling pool of firefighters.\n“On average, this investment brings about 1,600 firefighters, supports 1,600 firefighters during key fire season,” she said."}, {"id": "021059a0-418f-4ab2-a0e1-ef904b2f5cd9", "title": "Hurricane Katrina victim identified nearly 2 decades after storm pounded Gulf Coast", "date": "2024-05-16 16:15", "url": "https://www.cbsnews.com/news/tonette-jackson-hurricane-katrina-victim-identified-decades-later-dna-mississippi/", "message": "CBS News' Tracy Smith was in New Orleans after Hurricane Katrina hit, covering the crisis that followed the stormCBS News' Tracy Smith was in New Orleans after Hurricane Katrina hit, covering the crisis that followed the stormAlmost two decades after a woman's death during Hurricane Katrina, modern forensic tests finally allowed authorities to identify her remains.\nTonette Waltman Jackson's remains were identified in May 2024 — almost two decades after her death during Hurricane Katrina.\nHe added: \"In 2005, when Jane Love or Tonette's remains were found, forensic genetic genealogy was not a tool that was available.\"\nEarlier this month, testing on a DNA sample submitted by one of Jackson's close family members confirmed her identity.\nHardy Jackson gave an on-camera interview to CBS affiliate WKRG in the immediate aftermath of Hurricane Katrina and shared his wife's story."}, {"id": "31e0637a-1b26-4a35-b096-e073a0687248", "title": "Texas Will Feel The Wrath of La Niña , Starting This Summer", "date": "2024-05-16 23:15", "url": "https://kfyo.com/ixp/190/p/la-nina-return/", "message": "The eastward winds of El Niño are fading, but a terrible little girl we know as La Niña is brewing on the horizon.\nWith El Niño, the temperatures in the eastern Pacific Ocean drop by half a degree Celsius; with El Niña, the inverse holds true.\nThe key difference between El Niño and La Niña in how it impacts Texas is that the former brings about a wet winter, the latter brings warmer, drier weather.\nThere may be a period of neutral weather, but we can expect a rapid cycle over to La Niña by June or August at the latest.\nAll aboard the Somewhat Small Texas Panhandle Towns tour!"}, {"id": "418f815d-f362-4f95-b7a9-770f3a8f830f", "title": "Fort St . John eatery out of burgers as B . C . widlfire evacuees swell town", "date": "2024-05-16 21:30", "url": "https://www.interior-news.com/news/fort-st-john-eatery-out-of-burgers-as-bc-widlfire-evacuees-swell-town-7360715", "message": "Things looking up in Fort Nelson as blaze spreads away from town and conditions improveThe Denny’s restaurant in Fort St. John, B.C., ran out of burgers on Tuesday, a waiter said.\nFort St. John businesses have been doing their best to welcome the influx, offering free movie nights — popcorn included — and discount burritos.\nThe service says the Parker Lake fire has been mapped at 127 square kilometres in size, up from 84 square kilometres earlier this week.\nFor Fort St. John businesses, the impact of the influx of evacuees was almost immediate.\nThe BC Wildfire Service said the blaze about two kilometres west of the town now spans 127 square kilometres, up from 84 square kilometres earlier this week, but it has spread away from the town along its southern flank."}, {"id": "99588f08-8d06-4c84-9d26-ffa1e574465c", "title": "Fort St . John eatery out of burgers as B . C . widlfire evacuees swell town", "date": "2024-05-16 20:45", "url": "https://www.thefreepress.ca/news/fort-st-john-eatery-out-of-burgers-as-bc-widlfire-evacuees-swell-town-7360715", "message": "Things looking up in Fort Nelson as blaze spreads away from town and conditions improveThe Denny’s restaurant in Fort St. John, B.C., ran out of burgers on Tuesday, a waiter said.\nFort St. John businesses have been doing their best to welcome the influx, offering free movie nights — popcorn included — and discount burritos.\nThe service says the Parker Lake fire has been mapped at 127 square kilometres in size, up from 84 square kilometres earlier this week.\nFor Fort St. John businesses, the impact of the influx of evacuees was almost immediate.\nThe BC Wildfire Service said the blaze about two kilometres west of the town now spans 127 square kilometres, up from 84 square kilometres earlier this week, but it has spread away from the town along its southern flank."}, {"id": "6d7a4f2c-6009-424e-8956-98f672127b57", "title": "Fort St . John eatery out of burgers as B . C . widlfire evacuees swell town", "date": "2024-05-16 21:45", "url": "https://www.vernonmorningstar.com/news/fort-st-john-eatery-out-of-burgers-as-bc-widlfire-evacuees-swell-town-7360715", "message": "Fort St. John eatery runs out of burgers as B.C.\nwildfire evacuees swell townA wildfire threatening the town of Fort Nelson in far northeast B.C.\nRob Fraser, the mayor of the Northern Rockies Regional Municipality, which includes Fort Nelson, says the damage occurred on rural properties outside town, around the northern flank of the fire.\nStaff at the emergency operations centre in Fort Nelson were assessing the damage and contacting property owners, he said in an interview on Thursday.\n“That would be just a nightmare.”For Fort St. John businesses, the impact of the influx was almost immediate."}, {"id": "6117f8d4-0782-4d77-8bf1-443ad3cbe252", "title": "Fort St . John eatery out of burgers as B . C . widlfire evacuees swell town", "date": "2024-05-16 21:45", "url": "https://www.cowichanvalleycitizen.com/news/fort-st-john-eatery-out-of-burgers-as-bc-widlfire-evacuees-swell-town-7360715", "message": "Things looking up in Fort Nelson as blaze spreads away from town and conditions improveThe Denny’s restaurant in Fort St. John, B.C., ran out of burgers on Tuesday, a waiter said.\nFort St. John businesses have been doing their best to welcome the influx, offering free movie nights — popcorn included — and discount burritos.\nThe service says the Parker Lake fire has been mapped at 127 square kilometres in size, up from 84 square kilometres earlier this week.\nFor Fort St. John businesses, the impact of the influx of evacuees was almost immediate.\nThe BC Wildfire Service said the blaze about two kilometres west of the town now spans 127 square kilometres, up from 84 square kilometres earlier this week, but it has spread away from the town along its southern flank."}, {"id": "92224504-0a01-4451-b4e2-91889f156381", "title": "Fort St . John eatery out of burgers as B . C . widlfire evacuees swell town", "date": "2024-05-16 22:15", "url": "https://www.quesnelobserver.com/news/fort-st-john-eatery-out-of-burgers-as-bc-widlfire-evacuees-swell-town-7360715", "message": "Things looking up in Fort Nelson as blaze spreads away from town and conditions improveThe Denny’s restaurant in Fort St. John, B.C., ran out of burgers on Tuesday, a waiter said.\nFort St. John businesses have been doing their best to welcome the influx, offering free movie nights — popcorn included — and discount burritos.\nThe service says the Parker Lake fire has been mapped at 127 square kilometres in size, up from 84 square kilometres earlier this week.\nFor Fort St. John businesses, the impact of the influx of evacuees was almost immediate.\nThe BC Wildfire Service said the blaze about two kilometres west of the town now spans 127 square kilometres, up from 84 square kilometres earlier this week, but it has spread away from the town along its southern flank."}, {"id": "658295ac-b402-459b-9488-b81fde2a4639", "title": "Fort St . John eatery out of burgers as B . C . widlfire evacuees swell town", "date": "2024-05-16 22:30", "url": "https://www.comoxvalleyrecord.com/news/fort-st-john-eatery-out-of-burgers-as-bc-widlfire-evacuees-swell-town-7360715", "message": "Fort St. John eatery runs out of burgers as B.C.\nwildfire evacuees swell townA wildfire threatening the town of Fort Nelson in far northeast B.C.\nRob Fraser, the mayor of the Northern Rockies Regional Municipality, which includes Fort Nelson, says the damage occurred on rural properties outside town, around the northern flank of the fire.\nStaff at the emergency operations centre in Fort Nelson were assessing the damage and contacting property owners, he said in an interview on Thursday.\n“That would be just a nightmare.”For Fort St. John businesses, the impact of the influx was almost immediate."}, {"id": "c81c9728-5a62-42f0-8a84-25363095f6e7", "title": "Fort St . John eatery out of burgers as B . C . wildfire evacuees swell town", "date": "2024-05-16 22:45", "url": "https://www.kimberleybulletin.com/news/fort-st-john-eatery-out-of-burgers-as-bc-wildfire-evacuees-swell-town-7360715", "message": "Fort St. John eatery runs out of burgers as B.C.\nwildfire evacuees swell townA wildfire threatening the town of Fort Nelson in far northeast B.C.\nRob Fraser, the mayor of the Northern Rockies Regional Municipality, which includes Fort Nelson, says the damage occurred on rural properties outside town, around the northern flank of the fire.\nStaff at the emergency operations centre in Fort Nelson were assessing the damage and contacting property owners, he said in an interview on Thursday.\n“That would be just a nightmare.”For Fort St. John businesses, the impact of the influx was almost immediate."}, {"id": "32d1813d-6eba-4e27-856b-8dc34f2d52c8", "title": "Fort St . John eatery out of burgers as B . C . wildfire evacuees swell town", "date": "2024-05-16 23:15", "url": "https://www.cranbrooktownsman.com/news/fort-st-john-eatery-out-of-burgers-as-bc-wildfire-evacuees-swell-town-7360715", "message": "Fort St. John eatery runs out of burgers as B.C.\nwildfire evacuees swell townA wildfire threatening the town of Fort Nelson in far northeast B.C.\nRob Fraser, the mayor of the Northern Rockies Regional Municipality, which includes Fort Nelson, says the damage occurred on rural properties outside town, around the northern flank of the fire.\nStaff at the emergency operations centre in Fort Nelson were assessing the damage and contacting property owners, he said in an interview on Thursday.\n“That would be just a nightmare.”For Fort St. John businesses, the impact of the influx was almost immediate."}, {"id": "d03fb0a8-cb58-423a-bb99-cab3973c87a1", "title": "Severe storm threat increases across San Antonio . What can you expect ? ", "date": "2024-05-16 20:30", "url": "http://www.expressnews.com/san-antonio-weather/forecast/article/severe-storm-threat-increases-across-san-antonio-19461712.php", "message": "SEVERE THREATSWhat’s new for San Antonio is the upgraded severe threat from the Storm Prediction Center.\nSan Antonio has been upgraded to a level 2 of 5 severe threat for the afternoon and evening.\nNational Weather ServiceAccording to the National Weather Service, once the capping inversion erodes around lunchtime, we will see isolated to widely scattered thunderstorms develop and quickly intensify.\nFLOODING IS POSSIBLEIn addition to the severe thunderstorms, heavy rain is likely, especially east and north of San Antonio.\nHeavy downpours are likely with any strong storms but the heaviest rain will happen north and east of San Antonio."}, {"id": "86db07ca-e220-4c1b-8098-25169f6b6af6", "title": "Rainfall in Fort Nelson assists Parker Lake wildfire suppression efforts", "date": "2024-05-16 23:30", "url": "https://energeticcity.ca/2024/05/16/rainfall-in-fort-nelson-assists-parker-lake-wildfire-suppression-efforts/", "message": "Your Community, Your NewsDid you know that Energeticcity.ca is the only newsroom in Fort St. John with ALL of our staff based here?\nThat’s why you can trust us to deliver accurate, timely and reliable news when you need it most."}, {"id": "9c36ae60-56f4-4e69-b05b-30f0da918489", "title": "Flagstaff scientists to use satellites to spot new wildfires", "date": "2024-05-16 04:15", "url": "https://www.azfamily.com/2024/05/16/flagstaff-scientists-aim-use-satellites-spot-wildfires-within-minute-their-start/", "message": "PHOENIX (AZFamily) — The fight to prevent destructive wildfires is a global issue, and scientists right here in Arizona are at the forefront.\nAlexander Shenkin, an assistant research professor at Northern Arizona University, said all the fires are costing money, homes and forests.\nThat’s led NAU scientists, Flagstaff engineers, and fire leaders with the same passion for preventing wildfires to come together.\n“This thing I’m holding is a 3D print one-to-one scale model of the camera that we’re going to put on our satellites,” Trilling said.\n“Say 100 million bucks to stick this constellation of satellites in the air,” Shenkin said."}, {"id": "6135d5fa-b7b2-439e-902c-3871922fc9b9", "title": "Light magnitude earthquake hits Stilfontein in North West", "date": "2024-05-16 08:15", "url": "https://www.citizen.co.za/news/south-africa/earthquake-hits-stilfontein-north-west/", "message": "Light magnitude earthquake hits Stilfontein in North WestThe quake was felt by many near the epicentre.\nAccording to Volcano Discovery, the 3.5 earthquake hit 15.6 km away from Stilfontein just after 10am on Wednesday.\nPicture: iStockThere were no reports of any damages or injuries after a light magnitude earthquake hit the North West province.\nJust two weeks later, on 29 June, Johannesburg residents were shaken awake by a 2.9 magnitude quake originating in Soweto.\nALSO READ: 2.5 magnitude earthquake rattles parts of Joburg and West Rand"}, {"id": "87795757-85d1-4ff0-8846-8a3bb67a79c5", "title": "Canadian wildfire smoke just blanketed the Midwest . Again . ", "date": "2024-05-16 21:45", "url": "https://grist.org/wildfires/canadian-wildfire-smoke-just-blanketed-the-midwest-again/", "message": "“We issue this particular advisory when it’s at a 10-plus, and it is due to wildfire smoke,” Smith said.\nHere's HowIn 2023, parts of the Midwest and Northeast United States saw some of the worst air quality in the world.\nAnd while the movement of wildfire smoke is difficult to predict, the location of the fires is an important factor.\nLast summer, some of the wildfire smoke that blanketed much of the Midwest and Northeast U.S. came from areas that were hard to reach, according to Alec Kownacki, a meteorologist with Michigan’s Air Quality Division.\nThere’s no access roads.’”In Canada, fires are initially managed by local governments in partnership with provinces and territories."}, {"id": "5033f9aa-f55d-4a17-bfb0-c33253ce1bb4", "title": "Rains Helping To Ease Iowa Drought | AM 600 WMT", "date": "2024-05-16 22:15", "url": "https://600wmtradio.iheart.com/content/2024-05-16-rains-helping-to-ease-iowas-drought/", "message": "(Undated) -- This week's U.S. Drought Monitor shows continued improvement in Iowa.\nRecent heavy rains have helped to lift more areas out of drought and to ease the severity of drought in other locations.\nThe driest conditions continue to be in northeast Iowa, where a large part of that region remains in severe drought.\nThe National Weather Service is predicting warm and dry weather for the next few days.\nForecasters are predicting active weather next week with more chances for storms."}, {"id": "c9e83a56-9d9f-40e6-bb08-e0fec38867ed", "title": "Nebraska Drought Improves Slightly | NewsRadio 1110 KFAB", "date": "2024-05-16 20:30", "url": "https://kfab.iheart.com/content/2024-05-16-nebraska-drought-improves-slightly/", "message": "(Lincoln, NE) -- Drought conditions in Nebraska improved slightly in the past week.\nThe U.S. Drought Monitor shows around 30-percent of the state as either abnormally dry or in moderate drought.\nIowa's drought picture has improved as well.\nMost of Pottawattamie County, Iowa is in moderate drought.\nThe National Weather Service in Valley, NE predicts warm temperatures this weekend with a good chance at widespread showers and thunderstorms returning on Sunday."}, {"id": "5310daa1-a6e5-4c64-a8b6-cbd664f00c9a", "title": "Is the death rate of Tahoe trees getting better or worse ? ", "date": "2024-05-16 16:45", "url": "https://www.tahoedailytribune.com/news/is-the-death-rate-of-tahoe-trees-getting-better-or-worse/", "message": "– California red fir mortality increased to approximately 1.6 million dead trees across 63,000 acres in 2023 from ~1.3 million dead trees across 54,000 acres in 2022.\n– In 2023, white fir mortality decreased to 6 dead trees from an estimated 14,000 dead trees across 1,500 acres in 2022.\n18- Tahoe National Forest– Mortality increased to an estimated 6.5 million dead trees across 330,000 acres in 2023 from ~5 million dead trees across 260,000 acres in 2022.\n– California red fir mortality increased to approximately 6 million dead trees across 290,000 acres in 2023 from ~3.8 million dead trees across 170,000 acres in 2022.\n– White fir mortality decreased to approximately 160,000 dead trees across 22,000 acres in 2023 from ~890,000 dead trees across 74,000 acres in 2022."}, {"id": "192cbb3c-1769-42f2-b4bd-bd786e1842f6", "title": "A vital , mostly invisible undersea industry is facing a labor shortage", "date": "2024-05-16 12:45", "url": "https://www.marketplace.org/shows/marketplace-tech/labor-problems-facing-global-communication-infrastructure-repair-under-sea/", "message": "This vital industry is largely invisible and facing some big challenges.\nAnd so I wanted to find out more about it, and [that] happened to coincide with a period of change in the industry.\nAnd so I wanted to write about the challenges facing this extremely important, and I think, largely unknown industry.\nAnd so a lot of the people in this industry are, you know, have decades of experience, and are really knowledgeable.\nThat’s largely a result of the fact that most people don’t know the industry exists at all."}, {"id": "4ee9cc82-b84a-499f-b787-6bbf37c91a40", "title": "Less than a third of Iowa has drought", "date": "2024-05-16 18:00", "url": "https://www.yahoo.com/news/less-third-iowa-drought-162602963.html", "message": "(Courtesy of National Drought Mitigation Center)The state’s dryness has subsided to a level comparable with about a year ago, and less than a third of Iowa now has drought, according to the U.S. Drought Monitor.\nA Thursday report — which is a snapshot of the conditions two days before — said about 27% of the state has some measure of drought.\nAlmost all of the remaining drought resides in the northeast quadrant of the state, and most of that drought is classified as “severe.”About 92% of the topsoil in farm fields has adequate or surplus moisture for growing crops, the USDA reported Monday.\nThose totals might exceed two inches in parts of northern and eastern Iowa.\nThe post Less than a third of Iowa has drought appeared first on Iowa Capital Dispatch."}, {"id": "0106b649-0525-4ae4-9789-f4ab991d3f50", "title": "ESA - Canada wildfire season begins", "date": "2024-05-16 14:00", "url": "https://www.esa.int/Applications/Observing_the_Earth/Copernicus/Canada_s_wildfire_season_begins", "message": "Applications Canada’s wildfire season begins 16/05/2024 171 views 3 likesWildfire season has arrived in full force in Canada, prompting evacuation orders and alerts in several towns in British Columbia and Alberta due to the danger of uncontrolled blazes.\nThe 2023 wildfire season in Canada was one of the worst on record.\nWith the 2024 wildfire season already in full swing, Canadian authorities are bracing for a challenging summer.\nWildfire season in Canada typically runs from April until September or October when cooler temperatures dampen fire activity.\nAs the wildfire season progresses, ESA’s World Fire Atlas continues to be a valuable resource in tracking new fire outbreaks."}, {"id": "24b3ba17-51f2-457d-aee0-5e3527490ebb", "title": "The latest news on wildfires in Canada as thousands forced from homes in the West – Winnipeg Free Press", "date": "2024-05-16 16:45", "url": "https://www.winnipegfreepress.com/arts-and-life/life/greenpage/2024/05/16/the-latest-news-on-wildfires-in-canada-as-thousands-forced-from-homes-in-the-west-2", "message": "Roughly 6,600 residents have been evacuated out of parts of Fort McMurray, Alta., while the rest of the city remains on evacuation alert.\nIn Fort Nelson, B.C., about 4,700 people are out of their homes.\nRob Fraser says staff at the emergency operations centre in Fort Nelson are working to assess the damage and contact property owners.\nCrews are back on the fire line today near Fort McMurray.\n_9: 50 a.m.A spokesman for Athabasca Oil Corp. says the company has taken a number of measures to protects its facility near Fort McMurray."}, {"id": "5c6508a0-2b02-467d-98f7-6c02068767b8", "title": "John Swinney confirms support Fife residents affected by Storm Gerrit", "date": "2024-05-16 21:45", "url": "https://www.thenational.scot/news/24326020.john-swinney-confirms-support-fife-residents-affected-storm-gerrit/", "message": "John Swinney announced on Thursday that funds will be made available to Fife Council to support households and businesses in Cupar flooded as a result of Storm Gerrit, on the same basis as the support provided to those worst affected by Storm Babet.\nSwinney said the Scottish Government takes the issue of flood resilience “very seriously”, adding that the grant will be made available for residents “as swiftly as possible”.\nDear WillieFlood support for Cupar residents and businessesThank you for raising the issue of support for Cupar residents and businesses impacted by flooding from Storm Gerrit.\nWe know that in the face of climate change improving flood resilience is one of the largest adaptation challenges we face.\nResponsibility for flood resilience is primarily that of the occupier of a property, and then for a Local Authority to consider community level resilience."}, {"id": "22309699-1915-4f8c-8949-0952374be51a", "title": "Cities look for new ways to keep people safe and alive as extreme summer heat looms", "date": "2024-05-16 10:45", "url": "https://www.yahoo.com/news/cities-look-ways-keep-people-100556373.html", "message": "Ward and her colleagues specialize in “heat governance,” helping local and state governments prepare for extreme heat events.\nThe work includes finding ways to mitigate heat and develop emergency responses for major heat waves.\nWard said that it’s heartening to see cities take extreme heat seriously but emphasized that major challenges lie ahead.\nFor one, preparing early for extreme heat requires funding, which is a major challenge, especially for rural communities.\nEven trickier will be addressing the underlying social issues that get magnified during heat waves, such as homelessness, rising energy costs and economic inequality."}, {"id": "411d9647-6bfe-42ac-af69-51ac3c583650", "title": "Every united kingdom town at risk of flooding this weekend as Brits warned of travel chaos", "date": "2024-05-16 18:30", "url": "https://www.mirror.co.uk/news/uk-news/every-uk-town-risk-flooding-32828666", "message": "Currently, 30 flood alerts are in place across the south of England including Canterbury, Swindon and Cambridge, as well as Luton and Winchester.\nFlooding is likely tonight as nearly one month's rainfall is expected to batter the UK in just a few hours, the Met Office said.\nLoss of power is likely, homes and businesses could be damaged and hail and lightning will become hazardous for many.\n\"Local flooding is also possible but not expected more widely across England today (Thursday) and again on Friday and Saturday.\nFlood alert area: Areas at risk from Groundwater flooding including Caterham Bourne, Coulsdon Bourne, Beddington, Carshalton, Coulsdon, Kenley, Purley, South Croydon, Whyteleafe, Bromley, Bexley, Greenwich and Lewisham.\""}, {"id": "cdcc7821-81c4-442c-b6e5-43bb0036411b", "title": "The Joint Recovery Action Plan ( JRAP ) in Nepal receives £13 Million from FCDO to meet the critical needs of Western Nepal Earthquake - affected population - Nepal", "date": "2024-05-16 10:45", "url": "https://reliefweb.int/report/nepal/joint-recovery-action-plan-jrap-nepal-receives-ps13-million-fcdo-meet-critical-needs-western-nepals-earthquake-affected-population", "message": "“The Joint Recovery Action Plan was developed to respond the needs of the disaster-affected communities and to build resilience,\" said Ms. Hanaa Singer Hamdy, the UN Resident and Humanitarian Coordinator in Nepal.\nThe funding will address the water sanitation and hygiene (WASH), nutrition, protection, shelter, and food security needs of approximately 50 thousand earthquake-affected people in western Nepal.\nThe Chief Executive of the NDRRMA Mr. Anil Pokhrel said, “FCDO has been consistently supporting the Government of Nepal’s Humanitarian Response including reconstruction and recovery.\nOut of the total funding need, FCDO is providing GBP 13 million (equivalent to USD 16.2 million).\nFor more information:Simrika SharmaE: simrika.sharma@un.orgNational Information Officer, UN Information CentrePrerana MarasiniE: Prerana.Marasini@fcdo.gov.ukCommunications Manager, British Embassy Kathmandu"}, {"id": "2beccb4b-5650-43cb-b2fc-545003d78324", "title": "Centre must revise parameters for State to declare Idukki drought - hit , says Prasad", "date": "2024-05-16 15:30", "url": "https://www.thehindu.com/news/national/kerala/centre-must-revise-parameters-for-state-to-declare-idukki-drought-hit-says-prasad/article68183055.ece", "message": "Addressing the media after inspecting the affected areas, primarily comprising cardamom plantations, in Idukki on Thursday, Mr. Prasad reiterated the State government’s call to the Central authorities to revise the drought parameters.\n‘Send special team’He said the State government would request the Centre to dispatch a special team to assess the drought situation in the State, particularly in Idukki.\n“Only a visit by a special team can confirm the reality of the drought situation in the State.\nFinancial assistance from the Centre is crucial to mitigate this crisis,” Mr. Prasad said.\nAccompanied by Water Resources Minister Roshy Augustine, Mr. Prasad led a team that toured the drought-affected cardamom-growing areas in Idukki."}, {"id": "037aa8d7-0e29-48e5-8fcf-173484fe8699", "title": "Canadian oil sands city evacuated as wildfire draws near", "date": "2024-05-16 01:00", "url": "http://www.jordantimes.com/news/world/canadian-oil-sands-city-evacuated-wildfire-draws-near", "message": "Resident Ashley Russell was packed and ready to leave on a moment’s notice, as the rest of the city was put on alert.\n“We’re seeing extreme fire behaviour,” Alberta Wildfire spokeswoman Josee St-Onge told a news conference.\nFears of 2016 repeatIn 2016, the entire city with a population of more than 90,000 was evacuated while production of 1 million barrels of oil per day — almost one third of Canada’s total output at the time — stopped.\nThousands of residents never returned to the city.\nRob Fraser, the mayor of Fort Nelson told AFP: “It’s cool, it’s overcast and the wind is just very slight."}, {"id": "5468bcf2-b78d-49f2-836a-7c2b68be68cb", "title": "Canadian oil sands city evacuated as wildfire draws near", "date": "2024-05-16 00:45", "url": "http://jordantimes.com/news/world/canadian-oil-sands-city-evacuated-wildfire-draws-near", "message": "Resident Ashley Russell was packed and ready to leave on a moment’s notice, as the rest of the city was put on alert.\n“We’re seeing extreme fire behaviour,” Alberta Wildfire spokeswoman Josee St-Onge told a news conference.\nFears of 2016 repeatIn 2016, the entire city with a population of more than 90,000 was evacuated while production of 1 million barrels of oil per day — almost one third of Canada’s total output at the time — stopped.\nThousands of residents never returned to the city.\nRob Fraser, the mayor of Fort Nelson told AFP: “It’s cool, it’s overcast and the wind is just very slight."}, {"id": "76f08077-2d74-4146-a243-1ab5cffef823", "title": "Congressional Delegation On $60M From Inflation Reduction Act To Strengthen Water Security In Rio Grande Basin", "date": "2024-05-16 22:15", "url": "https://ladailypost.com/new-mexico-congressional-delegation-announces-60-million-from-inflation-reduction-act-to-strengthen-water-security-in-rio-grande-basin/", "message": "Representatives Teresa Leger Fernández (D-N.M.), Melanie Stansbury (D-N.M.), and Gabe Vasquez (D-N.M.) are announcing $60 million from the Inflation Reduction Act to help Doña Ana and Sierra County residents and farmers with drought mitigation and climate adaptation efforts, which will strengthen water security in the Rio Grande Basin.\n“New Mexicans are regularly seeing the effects of climate change and long-term aridification on the Rio Grande.\nShorter irrigation seasons and an increased reliance on groundwater pumping demonstrate the dramatic changes the Rio Grande has undergone as our water resources decline,” Heinrich said.\nThis funding from the Inflation Reduction Act means communities in New Mexico will now have more resources to protect the Rio Grande and the clean, essential water supply it brings to the state.\nIn 2022, Heinrich and Luján wrote to DOI Assistant Secretary Tanya Trujillo requesting that DOI allocate funds appropriated by the Inflation Reduction Act to support drought mitigation, resilience, and Tribal and Pueblo irrigation and water needs in the Rio Grande Basin."}, {"id": "a701bf4d-2f3d-4725-9368-4e64d78bf317", "title": "Burgers run out , hotels heave , as wildfire evacuees swell a B . C . town", "date": "2024-05-16 20:30", "url": "https://lethbridgeherald.com/news/national-news/2024/05/16/burgers-run-out-hotels-heave-as-wildfire-evacuees-swell-a-bc-town/", "message": "Burgers run out, hotels heave, as wildfire evacuees swell a B.C.\nA view of the Parker Lake wildfire near Fort Nelson, B.C.\nis shown on Monday, May 13, 2024 in a BC Wildfire Service handout photo.\nis shown on Monday, May 13, 2024 in a BC Wildfire Service handout photo.\n– The Denny’s restaurant in Fort St. John, B.C., ran out of burgers on Tuesday, a waiter said."}]