[{"id": "b4eaf515-1e38-48f1-ba4b-5fae92b05259", "title": "Israel used US - made bomb in deadly Rafah strike , experts say", "date": "2024-05-30 03:45", "url": "https://www.stripes.com/theaters/middle_east/2024-05-29/israel-us-made-bomb-rafah-14023186.html", "message": "MUST CREDIT: Alam Sadeq (Alam Sadeq)Four weapons experts said the Israeli military used a U.S.-made precision bomb in a strike that killed at least 45 people in southern Gaza on Sunday, after reviewing visual evidence provided to The Washington Post.\nThe findings do not contradict Israel’s assertion that it used a small munition, weapons experts said.\nSecretary of State Antony Blinken said Wednesday that the United States couldn’t confirm what weapons were used or how they were used in the strike.\nIsrael said the attack on the encampment in Rafah was a \"targeted\" strike against two Hamas militants and employed \"the smallest munition\" Israeli fighter jets can use.\nAn Israeli military spokesman reached Wednesday said he could not comment further on the munition used or what measures were taken to prevent civilian casualties."}, {"id": "11002ea1-ea83-4618-b4ae-e1d82395fa0f", "title": "Syria reports young girl killed 10 other people hurt in alleged", "date": "2024-05-30 02:30", "url": "https://muslimnews.co.uk/news/syria/syria-reports-young-girl-killed-10-other-people-hurt-in-alleged/", "message": "Syria’s defense ministry said an Israeli airstrike Syria reports on Wednesday killed a girl and wounded 10 civilians.\nbvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvs bvsA war monitor said a parallel strike in the same region killed three pro-Hezbollah Syrian fighters.\nThe alleged Israeli strikes targeted “at least one military site… in the eastern countryside of Homs, causing plumes of smoke to rise,” it added.\nIt said a second strike on central Syria killed three Syrian fighters working with Lebanon’s Hezbollah group.\nAccording to Syria reports, the strike was the 42nd apparent Israeli attack on Syria since the beginning of the year."}, {"id": "29d402b7-43a8-4235-8508-95244fb5e212", "title": "Russia told to light  demonstrative  nuclear explosion | World | News", "date": "2024-05-30 09:00", "url": "https://www.express.co.uk/news/world/1905221/world-war-3-russia-nuclear-weapons", "message": "The suggestion comes amid escalating tensions with the West over Ukraine use of Western-supplied arms against Russian targets.\nPutin cautioned that allowing Ukraine to use Western weapons for strikes inside Russia could ignite a global conflict, a sentiment he underscored with warnings of dire consequences.\nHowever, earlier this month, the Kremlin signaled its dissatisfaction with what it perceives as increasingly aggressive Western rhetoric by ordering tactical nuclear weapons drills.\nIn addition to the nuclear test proposal, Suslov recommended that Russia initiate strategic nuclear exercises and issue stern warnings.\nHe also hinted that Russia might consider using nuclear weapons if such a country retaliated conventionally."}, {"id": "b8297b74-a145-476e-9cdf-843c20a56589", "title": "North Korea Fires Ballistic Missiles Days After Rocket Fails", "date": "2024-05-30 01:00", "url": "https://www.livemint.com/news/world/north-korea-fires-ballistic-missiles-days-after-rocket-fails-11717025291499.html", "message": "North Korea fired multiple suspected ballistic missiles on Thursday, just days after leader Kim Jong Un’s space program was dealt a blow when a rocket blew up soon after liftoff.\nJapan’s Coast Guard said what appears to have been a ballistic missile has fallen.\nNorth Korea typically does not comment on missile launches until the day after they take place.\nThis is the sixth test of ballistic missiles from Kim’s regime this year.\nNorth Korea’s last ballistic missile launch took place about two weeks ago when it fired multiple short-range rockets."}, {"id": "31b1864e-67e8-4ba0-8a1e-7bacb6703777", "title": "In A 24 Hour News Cycle Speed Beats Accuracy When It Comes To News About Israel | Newstalk Florida", "date": "2024-05-30 06:00", "url": "https://www.newstalkflorida.com/featured/in-a-24-hour-news-cycle-speed-beats-accuracy-when-it-comes-to-news-about-israel/", "message": "On Wednesday morning, Tal Heinrich, the spokesperson for the Office of Prime Minister Benjamin Netanyahu, expressed frustration with the media’s coverage of the war between Israel and Hamas.\nOn May 27, 2024, an Israeli airstrike targeted two Hamas operatives in Rafah, southern Gaza, who were allegedly planning an attack on Israel.\nHeadlines worldwide have attributed the attack and resulting fatalities in Rafah to Israel, ahead of the IDF’s investigation, leading to widespread international condemnation.\nWhite House spokesman John Kirby stated on Tuesday that Israel had not initiated a “major ground operation” in the city.\nJim Williams, based in Washington, D.C., provides comprehensive written articles and video reports on the conflict between Israel and Hamas, among other Middle Eastern issues."}, {"id": "a2ae238a-fdef-4196-af72-3a4cf34bfdbc", "title": "Blinken signals US may allow Ukraine to strike inside Russia with American weapons", "date": "2024-05-30 08:45", "url": "https://www.livemint.com/politics/blinken-signals-us-may-allow-ukraine-to-strike-inside-russia-with-american-weapons-11717053955333.html", "message": "Previously, the U.S. has said it wouldn’t allow Ukraine to attack targets on Russian territory with ATACMS missiles or other U.S. weapons.\nHe repeated earlier assertions that the U.S. has neither encouraged nor enabled strikes on Russian territory.\nAs Russia has been making territorial gains in northeast Ukraine, Kyiv has repeatedly asked for permission to strike targets with U.S. weapons on Russian territory.\nOn Tuesday, Russian President Vladimir Putin warned that the use of Western-supplied weapons to strike Russian territory could risk escalation and, he hinted, retaliation.\nEarlier this month, the U.K. suggested Ukraine had the right to use British-supplied weapons against targets in Russia."}, {"id": "114ff4b5-98ae-46e5-abc3-d02a171c3393", "title": "Woman pleads guilty to stabbing , killing cousin in 2021 in York County", "date": "2024-05-30 01:15", "url": "https://www.yahoo.com/news/woman-pleads-guilty-stabbing-killing-222058569.html", "message": "Woman pleads guilty to stabbing, killing cousin in 2021 in York CountyYORK COUNTY, Pa. (WHTM) — A woman accused of stabbing and killing a relative in York County years ago pleaded guilty Tuesday.\nNinoska Santos-Cruz, 25, of York, entered an open plea to third-degree murder for the deadly stabbing on Dec. 26, 2021, the York County District Attorney’s Office confirmed.\nYork County babysitter claimed girl ‘seduced me’ during rape investigation, police sayJoselito Pagan-Ocasio, 36, was found dead at his home at the 300 block of E. King Street in York City.\nFirst responders were dispatched for a fatality that was originally reported from a shooting but turned out to be from a stabbing.\nAn autopsy found Pagan-Ocasio died from a stab wound to the chest and the manner was ruled a homicide."}, {"id": "0b1e5fa8-633f-4f11-af6f-6d3f88d50423", "title": "Chicago police shooting : Family says stabbing suspect Tracey Watson fatally shot in South Austin was defending himself from attack", "date": "2024-05-30 07:00", "url": "https://abc7chicago.com/post/south-austin-chicago-police-fatal-shooting-family-speaks-out/14889006/", "message": "Police say Tracey Watson was stabbing another man before officers ordered him to drop his weaponFamily claims man fatally shot by Chicago police in South Austin was defending himself from attackRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nRelatives of Tracey Watson, killed in a Chicago police-involved shooting Monday in South Austin, claim he was defending himself from an attack.\nChicago police say the suspect, Tracey Watson, attempted to stab a man on the street around 11 p.m. in the 300-block of South Cicero Avenue in South Austin."}, {"id": "c5db8224-4e21-452f-86ea-8453e352b892", "title": "Rafah deaths havent breached Biden  red lines  ", "date": "2024-05-30 02:15", "url": "http://usa.chinadaily.com.cn/a/202405/30/WS6657d761a31082fc043c9f5d.html", "message": "Palestinians flee from the southern city of Rafah, Gaza Strip, during an Israeli offensive on Tuesday.\nRecent deaths in Rafah have tested US President Joe Biden's promise to withhold weapons from Israel if a major assault on Rafah would put displaced people there at risk.\nThe Biden administration said on Tuesday it was closely monitoring the probe into a deadly Israeli airstrike it called \"tragic\", but that the recent deaths in Rafah did not constitute a major ground operation that crosses any US red lines.\nIn Beijing, Chinese Foreign Ministry spokeswoman Mao Ning said on Wednesday that China is gravely concerned over Israel's military operation in Rafah.\nMore than 36,171 Palestinians were killed in Israel's offensive in the Gaza Strip since Hamas' surprise attack on Oct 7, which caused about 1,200 Israeli deaths, data from Palestinian and Israeli sources showed."}, {"id": "59bbc64f-6821-471d-9547-af34417835a9", "title": "Rafah deaths havent breached Biden  red lines  ", "date": "2024-05-30 02:45", "url": "http://europe.chinadaily.com.cn/a/202405/30/WS6657d761a31082fc043c9f5d.html", "message": "Palestinians flee from the southern city of Rafah, Gaza Strip, during an Israeli offensive on Tuesday.\nRecent deaths in Rafah have tested US President Joe Biden's promise to withhold weapons from Israel if a major assault on Rafah would put displaced people there at risk.\nThe Biden administration said on Tuesday it was closely monitoring the probe into a deadly Israeli airstrike it called \"tragic\", but that the recent deaths in Rafah did not constitute a major ground operation that crosses any US red lines.\nIn Beijing, Chinese Foreign Ministry spokeswoman Mao Ning said on Wednesday that China is gravely concerned over Israel's military operation in Rafah.\nMore than 36,171 Palestinians were killed in Israel's offensive in the Gaza Strip since Hamas' surprise attack on Oct 7, which caused about 1,200 Israeli deaths, data from Palestinian and Israeli sources showed."}, {"id": "0af92a95-5dd7-4c1d-8418-8fc5b4f4ecd5", "title": "Rafah deaths havent breached Biden  red lines  ", "date": "2024-05-30 05:45", "url": "http://africa.chinadaily.com.cn/a/202405/30/WS6657d761a31082fc043c9f5d.html", "message": "Palestinians flee from the southern city of Rafah, Gaza Strip, during an Israeli offensive on Tuesday.\nRecent deaths in Rafah have tested US President Joe Biden's promise to withhold weapons from Israel if a major assault on Rafah would put displaced people there at risk.\nThe Biden administration said on Tuesday it was closely monitoring the probe into a deadly Israeli airstrike it called \"tragic\", but that the recent deaths in Rafah did not constitute a major ground operation that crosses any US red lines.\nIn Beijing, Chinese Foreign Ministry spokeswoman Mao Ning said on Wednesday that China is gravely concerned over Israel's military operation in Rafah.\nMore than 36,171 Palestinians were killed in Israel's offensive in the Gaza Strip since Hamas' surprise attack on Oct 7, which caused about 1,200 Israeli deaths, data from Palestinian and Israeli sources showed."}, {"id": "cd10a546-cc13-47db-96d3-cadc45621fed", "title": "Paramore , Dua Lipa , more celebs call for ceasefire in Israel - Hamas war :  Cannot support a genocide  ", "date": "2024-05-30 02:15", "url": "https://www.yahoo.com/entertainment/paramore-dua-lipa-more-celebs-012749202.html", "message": "Paramore is speaking out on the ongoing violence in the Israel-Hamas war following a deadly airstrike in the Gaza region over the weekend.\nOther stars such as Dua Lipa, Katy Perry and John Legend are lending their voices to the humanitarian crisis.\nKaty Perry joins call for 'immediate ceasefire' in Israel-Hamas warOn Wednesday, Perry reposted a graphic from the humanitarian aid organization UNICEF on Instagram.\n\"A military besiegement and ground incursion in Rafah, Gaza, poses a catastrophic risk to the children sheltering there,\" the caption on Perry's repost read.\nContributing: Karissa Waddick, USA TODAY; Nidal Al-Mughrabi and Dan Williams, ReutersThis article originally appeared on USA TODAY: Paramore, Dua Lipa, more stars call for ceasefire in Israel-Hamas war"}, {"id": "5789c366-ec92-43c0-8cd0-d415dd33f963", "title": "Ukraine war : influential Russian think tank proposes a  demonstrative  nuclear explosion", "date": "2024-05-30 06:00", "url": "https://www.scmp.com/news/world/russia-central-asia/article/3264672/ukraine-war-influential-russian-think-tank-proposes-demonstrative-nuclear-explosion", "message": "A senior member of a Russian think tank whose ideas sometimes become government policy has suggested Moscow consider a “demonstrative” nuclear explosion to cow the West into refusing to allow Ukraine to use its arms against targets inside Russia.\nRussia’s missile forces during tactical nuclear weapons drills.\nRussian diplomats said at the time that Russia, which has not carried out a post-Soviet nuclear test, would not resume nuclear testing unless Washington does.\nRussia warned Britain this month that it could strike British military installations and equipment both inside Ukraine and elsewhere if British weapons were used by Ukraine – with London’s blessing – to strike Russian territory.\nIt issued the warning after British Foreign Secretary David Cameron said Kyiv had the right to use UK-supplied weapons to strike targets inside Russia."}, {"id": "b9ad0b06-7ce2-46ba-940c-6666ba84db44", "title": "Street battles , Israeli strikes rock Gaza Rafah", "date": "2024-05-30 03:00", "url": "https://dunyanews.tv/en/World/815140-Street-battles,-Israeli-strikes-rock-Gaza%5C", "message": "Street battles, Israeli strikes rock Gaza's RafahWorld World Street battles, Israeli strikes rock Gaza's RafahStreet fighting and Israeli bombardment rocked Gaza's far-southern Rafah on Wednesday.\nBut fighting again flared in Rafah, where an AFP reporter said street battles raged and an Israeli helicopter fired guns and missiles at targets in the city centre.\nIn the north, Israeli military vehicles unleashed intense gunfire east of Gaza City, an AFP reporter said, while residents reported air strikes on parts of Jabalia.\nUN SECURITY COUNCILNearly eight months into the deadliest Gaza war, Israel has faced ever louder opposition, as well as cases before two Netherlands-based international courts.\nTurkish President Recep Tayyip Erdogan meanwhile hit out at the United Nations after the latest deadly Israeli strikes in Rafah."}, {"id": "f0323e9a-319a-4fdd-8a76-e4348610d087", "title": "Israel Launches Airstrikes Deep Into Syria - Reports Of Civilians Dead & Wounded", "date": "2024-05-30 01:30", "url": "https://www.zerohedge.com/geopolitical/israel-launches-airstrikes-deep-syria-reports-civilians-dead-wounded", "message": "Israel's military on Wednesday launched a fresh attack on targets deep inside Syria, which reportedly left civilian casualties, according to state media.\nSyrian government sources said the Israeli strike killed a girl and wounded ten civilians.\n\"Syrian air defense intercepts enemy targets in the skies of the city of Homs,\" the official SANA news agency also reported.\nIsrael was also part of this covert campaign, which saw the anti-Assad axis arm, train, and fund various al-Qaeda and jihadist groups.\nIn the initial days and weeks after Oct.7, Syria had lobbed several rockets toward the Israeli-occupied Golan Heights, which left no casualties."}, {"id": "86e7c6d1-090a-483a-9c7d-e47cedb8ba84", "title": "Russia Ukraine war live : Putin - backed think tank says Kremlin should consider nuclear blast to warn West", "date": "2024-05-30 06:00", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-news-putin-nuclear-war-latest-b2553638.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Sweden has sent two crucial ASC 890 control and surveillance aircraft to Ukraine as part of a £981 million military package.\nIt comes as Russia fired more than 50 missiles and drones into Ukraine overnight, the Ukrainian Air Forces have claimed.\nMykola Oleschuk, commander of the air force, said Russian forces attacked “military facilities and critical infrastructure in Ukraine” but did not provide additional details.\nHe said they had shot down seven missiles and 32 drones."}, {"id": "314108ca-01b6-44f3-a1fc-4edb4847fcb3", "title": "North Korea Flies Trash And Manure Balloons Into South As It Doubles Down On Satellite Ambitions", "date": "2024-05-30 03:15", "url": "https://www.theyeshivaworld.com/news/general/2286787/north-korea-flies-trash-and-manure-balloons-into-south-as-it-doubles-down-on-satellite-ambitions.html", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine."}, {"id": "a2878844-6f52-45bb-8187-771f4e81e64e", "title": "Nikki Haley writes  finish them  on IDF shells during Israel visit", "date": "2024-05-30 03:30", "url": "https://www.nzherald.co.nz/world/nikki-haley-writes-finish-them-on-idf-shells-during-israel-visit/KOINBXCXXRAY3PSFUFE3DLOC5Y/", "message": "Former U.S Ambassador to the United Nations, Nikki Haley signing an Israeli artillery shell while touring Israel’s northern border with Lebanon.\nPhoto / APFormer U.S Ambassador to the United Nations, Nikki Haley signing an Israeli artillery shell while touring Israel’s northern border with Lebanon.\nPhoto / APNikki Haley wrote “finish them!” on the side of a fresh Israeli artillery shell during a visit to Israel.\nOn Tuesday, she visited an artillery post on the country’s northern border and wrote on a shell: “Finish them!\nDon’t let anybody make you feel wrong because Israel is not wrong in this,” Haley said in a press conference on Monday."}, {"id": "c16410dd-2ba3-40fa-8d2b-db871c0871cb", "title": "North Korea flies trash balloons over the South", "date": "2024-05-30 07:15", "url": "https://www.10news.com/world/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite-ambitions", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine."}, {"id": "c7d4fc89-aa5b-437f-8422-73b99d28458a", "title": "Missile attacks damage a ship in the Red Sea off Yemen coast near previous Houthi rebel assaults - New Delhi Times - India Only International Newspaper", "date": "2024-05-30 01:30", "url": "https://www.newdelhitimes.com/missile-attacks-damage-a-ship-in-the-red-sea-off-yemens-coast-near-previous-houthi-rebel-assaults/", "message": "Missile attacks twice damaged a Marshall Islands-flagged, Greek-owned ship Tuesday in the Red Sea off the coast of Yemen, with a private security firm saying radio traffic suggested the vessel took on water after being struck.\nThe vessel reported being headed to Fujairah in the United Arab Emirates.\nCentral Command separately said it destroyed five Houthi drones over the Red Sea amid the attacks.\nShipping through the Red Sea and Gulf of Aden has declined because of the threat.\nIn recent weeks, the tempo of Houthi attacks has dropped, though the rebels have claimed shooting down U.S. surveillance drones."}, {"id": "4a679287-788f-4112-b572-147213e6c0c6", "title": "  All Eyes on Rafah  social media post shared by 44 million people on Instagram", "date": "2024-05-30 09:00", "url": "https://www.firstpost.com/world/all-eyes-on-rafah-instagram-post-israel-gaza-war-13776736.html", "message": "Thousands of Palestinians are currently living in refugee camps in Rafah to escape Israel’s bombardment read moreThe 'All Eyes on Rafah' image which has gone viral in the last 24 hours on Instagram.\nImage Courtesy: @insiderworld/X“All eyes on Rafah,” the post going viral on social media, specifically on Instagram, has been shared by 44 million accounts since Monday after Israel launched a deadly strike in an encampment in Rafah.\nThe AI-generated image was shared widely on Instagram including celebrities like Gigi Hadid, Bella Hadid, and Pedro Pascal.\nIn India, the post was shared by actors like Alia Bhatt, Priyanka Chopra and Kareena Kapoor.\nThousands of Palestinians are currently living in refugee camps in Rafah to escape Israel’s bombardment."}, {"id": "56659858-97ee-40cd-89e7-0b39e4236168", "title": "France Macron Backs Ukrainian Strikes Inside Russia", "date": "2024-05-30 06:45", "url": "https://www.zerohedge.com/geopolitical/frances-macron-backs-ukrainian-strikes-inside-russia", "message": "“That’s self-defense and they have the right to self-defense, and we should help them to uphold the right of self-defense.”Germany More Cautious About Russia StrikesMr. Scholz expressed reservations this weekend about encouraging Ukrainian strikes inside Russia.\nWhile standing beside his French counterpart on Tuesday, Mr. Scholz avoided expressing outright support or opposition to Ukrainian strikes inside Russia.\nBy contrast, Italian Prime Minister Giorgia Meloni and her government have distanced themselves from Mr. Stoltenberg’s calls for NATO to support Ukrainian strikes inside Russia.\nThe Biden administration’s overarching policy has been one of opposition to Ukrainian strikes inside Russia, but some have urged a policy change or suggested caveats.\nPutin Warns NATO MembersRussian President Vladimir Putin hasn’t remained silent regarding NATO’s discussion of Ukrainian strikes inside Russia."}, {"id": "39134889-faeb-4076-b091-add7dfce3c8b", "title": "Street battles , Israeli strikes rock Rafah - Newspaper", "date": "2024-05-30 02:45", "url": "https://www.dawn.com/news/1836545/street-battles-israeli-strikes-rock-rafah", "message": "RAFAH: Street fighting and Israeli bombardment rocked Rafah in the Gaza Strip on Wednesday, residents and officials said, a day after Israeli tanks rolled into the centre of the city near the Egyptian border.\nIsrael’s National Security Adviser Tzachi Hanegbi said on Wednesday the war could go on until the year’s end.\nFighting has again flared in Rafah, where an AFP reporter said an Israeli helicopter fired guns and missiles at targets in the city centre.\nThe spirit of the United Nations is dead in Gaza,” Erdogan told lawmakers from his AKP party.\nThe Turkish leader also hit out at fellow Muslim-majority countries for failing to take common action over the Israeli strike."}, {"id": "14c79e44-a3a3-42fe-a02d-6ddaa9f094cc", "title": "Ocean City , New Jersey officials to announce new public safety measures following chaos during Memorial Day weekend", "date": "2024-05-30 07:15", "url": "https://6abc.com/ocean-city-new-jersey-officials-announce-new-public/14889198/", "message": "Ocean City to announce new public safety measures following weekend chaosCape May County prosecutor warns of arrests, charges after chaotic holiday weekend at Jersey ShoreCape May County prosecutor warns of arrests, charges after chaotic holiday weekend at Jersey ShoreCape May County prosecutor warns of arrests, charges after chaotic holiday weekend at Jersey ShoreCape May County prosecutor warns of arrests, charges after chaotic holiday weekend at Jersey ShoreOCEAN CITY, New Jersey (WPVI) -- Cape May County officials are holding a press conference on Thursday in the aftermath of a chaotic Memorial Day weekend at the Jersey shore.\nThe press conference will be held at 4 p.m. outside the Ocean City Music Pier on the Ocean City Boardwalk at Moorlyn Terrace.\nCity officials are set to announce new measures being taken to protect public safety on the boardwalk and throughout the area.\nThis comes after numerous fights, disturbances, and the stabbing of a 15-year-old boy over the long weekend.\nOcean City Mayor Jay Gillian, Police Chief Bill Campbell, County Commission Director Lenny Desiderio, and State Assemblyman Antwan McClellan are set to attend the press conference on Thursday."}, {"id": "b17b88ed-7f40-4788-a575-dadab10e804c", "title": "Nikki Haley writes  Finish them ! on Israeli artillery days after Rafah strike", "date": "2024-05-30 02:45", "url": "https://www.10news.com/politics/nikki-haley-writes-finish-them-on-israeli-artillery-shell-days-after-rafah-airstrike", "message": "Nikki Haley, a former presidential candidate for the Republican party, wrote \"Finish them!\"\non an Israeli artillery shell, days after Israel drew heightened criticism for its airstrike that killed dozens and displaced hundreds of Palestinians.\nThere, Danon's office shared a photo of Haley writing on a munition on social media, with the caption, \"This is what my friend, the former ambassador Nikki Haley, wrote ...\nAlways, Nikki Haley.\"\n\"America needs to do whatever Israel needs and stop telling them how to fight this war."}, {"id": "dc196682-8fa3-49c9-a2b0-e010bbb77e01", "title": "  All eyes on Rafah  social media trend explained as backlash grows over Israel airstrike", "date": "2024-05-30 01:00", "url": "https://www.independent.co.uk/news/world/middle-east/all-eyes-on-rafah-israel-gaza-b2553094.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}An image urging people to pay attention to Israel’s ongoing conflict in Gaza is getting shared by millions on social media following a deadly Israeli airstrike killing dozens of civilians.\nThe picture, which has rows of tents stretching into the distance and is emblazoned with the words “All eyes on Rafah”, has now been posted almost 40 million times on Instagram.\nIsrael said it had targeted two senior Hamas operatives and had not intended to cause civilian casualties.\nPrior to Israel’s ground invasion of Gaza in February, he said: “All eyes are on Rafah.” It is thought the artwork itself was created using Artificial Intelligence (AI)."}, {"id": "d052dc83-5f2d-497c-ade9-c6788c6e1d42", "title": "Operation Iron Swords", "date": "2024-05-30 00:30", "url": "https://www.globalsecurity.org/military/world/war/operation-iron-swords-2024-05-29.htm", "message": "Operation Iron Swords - Day 236 - 29 May 2024\u0093At any point, Hamas could have ended this burgeoning tragedy tosurrender and release every hostage.\nGaza war unit tracker @2023gazawar reported : \" Today the 98th Division left the Gaza Strip and ended the Jabaliya Raid.\nThe statement added that the second operation targeted the ship (MOREA) and the third operation targeted the ship (Sealady).\nTasnim reported that inspired by Iran, the Yemeni military forces have obtained the technology to manufacture anti-ship ballistic missiles.\nThese challenges are compounded by collapsed negotiations due to Israeli obstinacy and its military operation in Rafah."}, {"id": "50e1854b-bd0b-49d8-9664-eaf7fff7fc03", "title": "NATO ally Erdogan blames US for Palestinian deaths in Gaza and denounces  vampire  Netanyahu", "date": "2024-05-30 05:00", "url": "https://www.washingtonexaminer.com/news/world/3021655/erdogan-blames-us-deaths-gaza-denounces-vampire-netanyahu/", "message": "Though several other NATO members have been critical of Israel during its war in Gaza, the Turkish president has perhaps topped them all, going so far as to show support for Hamas.\nHis Wednesday remarks denouncing Israel and Netanyahu are his strongest yet, comparing the prime minister with a supernatural monster.\n“The world is watching the barbarism of a sick man, a maniac, a psychopath, and a blood-feeding vampire called Netanyahu,” Erdogan said.\nIn March, Erdogan reaffirmed his support for the group while denouncing Israel as “Nazis.”“No one can make us qualify Hamas as a terrorist organization.\nNetanyahu issued a rare apology over the strike, calling it a “tragic mistake.”The strike has led to condemnations around the globe."}, {"id": "83db809f-e376-459e-ae90-09292885c334", "title": "  We Have Adapted and Adjusted  – Ukraine at War Update for May 30", "date": "2024-05-30 03:00", "url": "https://www.kyivpost.com/post/33480", "message": "Asked if he was supporting a change, Blinken was quoted by AFP as saying, “At every step along the way we’ve adapted and adjusted as necessary.\nSpecifically, Russian units recently marginally advanced north of Kharkiv, near Lyptsi amid continued ground assaults in the area on Wednesday.\nConfirmed footage posted that day seems to indicate that the invaders recently advanced within southeastern Hlyboke (north of Lyptsi and Kharkiv).\nRussian forces also recently made gains near Vovchansk, ISW continued.\nGeolocated footage published on Wednesday seems to show that Moscow’s troops have advanced within northeastern Starystya (northeast of Kharkiv)."}, {"id": "c4a4c7b2-218e-42cf-b9f1-4ab60fccdf9c", "title": "NATO ally Erdogan blames US for Palestinian deaths in Gaza and denounces  vampire  Netanyahu | News", "date": "2024-05-30 02:45", "url": "https://gazette.com/news/wex/nato-ally-erdogan-blames-us-for-palestinian-deaths-in-gaza-and-denounces-vampire-netanyahu/article_3d9c67f8-6eb8-50a8-8707-4febaea3f845.html", "message": "Turkish President Recep Tayyip Erdogan, an important NATO ally, blamed the United States for a \"genocide\" in Gaza while labeling Israeli Prime Minister Benjamin Netanyahu a bloodthirsty \"vampire.\"\nErdogan made the comments in a speech to Turkey's parliament, speaking after a recent Israeli airstrike led to dozens of civilian deaths in Rafah.\nHis Wednesday remarks denouncing Israel and Netanyahu are his strongest yet, comparing the prime minister with a supernatural monster.\n\"The world is watching the barbarism of a sick man, a maniac, a psychopath, and a blood-feeding vampire called Netanyahu,\" Erdogan said.\n\"Israel is not just a threat to Gaza but to all of humanity,\" Erdogan said."}, {"id": "811a1b71-f269-45bc-8710-f859375f04fe", "title": "Nana Oppong , one of the united kingdom most wanted fugitives arrested for murder . ", "date": "2024-05-30 09:30", "url": "https://www.ghanaweb.com/GhanaHomePage/NewsArchive/Nana-Oppong-one-of-the-UK-s-most-wanted-fugitives-arrested-for-murder-1933286", "message": "General News of Thursday, 30 May 2024Source: www.ghanaweb.comA high-level drug dealer and one of the UK's most wanted fugitives, Nana Oppong, was apprehended while attempting to enter Morocco, hidden in the back of a lorry.\nThe prosecution detailed how Oppong led a team of accomplices, including drivers and spotters, to carry out the murder.\nThe National Crime Agency named Oppong as one of the UK's most wanted fugitives.\nHis co-defendant, Israar Shah, 39, of Kelvedon Hatch, Essex, was also convicted of murder and firearm possession.\nThe court learned that other participants in the murder, including Temitope Adeyinka, known as 'Limo,' remain at large."}, {"id": "de3f26db-7f58-4ede-b6e7-2eac324b8fbb", "title": "  All Eyes on Rafah : 44 Million Instagram Users , Global Celebrities Share AI Image To Draw Focus On Gaza Crisis", "date": "2024-05-30 06:00", "url": "https://www.news18.com/world/all-eyes-on-rafah-44-million-instagram-users-global-celebrities-share-ai-image-to-draw-focus-on-gaza-crisis-8909611.html", "message": "More than 44 million Instagram users have shared an AI-generated image with the caption “All eyes on Rafah” as of Thursday morning, according to a count by Instagram.\nThe area located near the Egyptian border Rafah has recently been subjected to bombing by Israeli forces.\nThe international community has criticised Israel for the deaths because Rafah was previously a humanitarian zone for civilians.\nMilitants also took 252 hostages, 121 of whom remain in Gaza, including 37 the Israeli army says are dead.\nIsrael’s retaliatory offensive has killed at least 36,171 people in Gaza, mostly civilians, according to the Hamas-run territory’s health ministry."}, {"id": "f373a912-1557-4340-8013-ded40489ced7", "title": "Woman arrested in stabbing at Emeryville Chick - fil - A", "date": "2024-05-30 00:30", "url": "http://www.sfchronicle.com/bayarea/article/woman-arrested-stabbing-emeryville-chick-fil-a-19485054.php", "message": "Jordan Parker is a breaking news reporter for The San Francisco Chronicle.\nHe graduated from Sacramento State University in May 2022 with a degree in journalism.\nDuring his time there, he spent three years as a reporter and editor for the university's award-winning student newspaper, The State Hornet.\nHe spent his senior year of college serving as The Hornet's first Black editor in chief, leading the organization to two Pacemaker awards and several other national honors from the Associated Collegiate Press.\nWhen he's not chasing down a story, he likes watching movies, traveling and trying new restaurants."}, {"id": "d038092f-c60c-4600-babc-7180f2fd669c", "title": "Yemen Houthis shoot down MQ - 9 Reaper drone", "date": "2024-05-30 00:00", "url": "https://www.prokerala.com/news/articles/a1535334.html", "message": "Sanaa, May 30 : Houthi group has said it shot down an MQ-9 Reaper drone over Yemen's central Marib.\nYahya Sarea, the group's military spokesman, said on Wednesday in the statement broadcast by Houthi-run al-Masirah TV that \"a locally made surface-to-air missile is used in the operation, and this is the sixth MQ-9 Reaper drone we shot down in six months\".\nHe added that \"we will continue to develop our military defence capabilities to counter the US-British coalition aggression against our country\".\nThe Houthi television said it would broadcast a video showing the operation of shooting down this drone.\nIt has broadcasted videos of all previous operations, showing the debris of the drones."}, {"id": "8a309b8a-8128-4fbc-a087-0272f4e4f00f", "title": "Yemen Houthis shoot down MQ - 9 Reaper drone", "date": "2024-05-30 04:00", "url": "http://www.china.org.cn/world/2024-05/30/content_117223023.htm", "message": "视频播放位置 下载安装Flash播放器Houthi group said it shot down an MQ-9 Reaper drone on Wednesday over Yemen's central Marib.\nYahya Sarea, the group's military spokesman, said in the statement broadcast by Houthi-run al-Masirah TV that \"a locally made surface-to-air missile is used in the operation, and this is the sixth MQ-9 Reaper drone we shot down in six months.\"\nHe added that \"we will continue to develop our military defense capabilities to counter the U.S.- British coalition aggression against our country.\"\n\"We will also continue to support the Palestine people against the Israeli aggression until the conflict and blockade stop,\" the spokesman stressed.\nThe Houthi television said it would broadcast a video showing the operation of shooting down this drone."}, {"id": "d5889b98-a2ef-423b-aaf0-9dee4082f8e3", "title": "Man Pleads Guilty , Sentenced to 14 Years for DHS Hotel Stabbing", "date": "2024-05-30 04:00", "url": "https://mynewsla.com/crime/2024/05/29/man-pleads-guilty-sentenced-to-14-years-for-dhs-hotel-stabbing/", "message": "A man pleaded guilty Wednesday to assault and burglary charges for his role in a stabbing at a Desert Hot Springs hotel and was immediately sentenced to 14 years in prison.\nAnthony Rene Ayala, 30, pleaded guilty before Judge Jason Stone at the Larson Justice Center in Indio to assault causing great bodily injury and first-degree burglary, according to Riverside County District Attorney’s office spokesman John Hall.\nTwo other men charged in the case, 30-year-old Jose Luis Garcia and 32-year-old Moises Mazariegos, previously pleaded guilty to the same charges.\nThe stabbing occurred around 11 p.m. April 15, 2021, at a hotel in the 11000 block of Palm Drive, according to the Desert Hot Springs Police Department.\nAyala has two robbery convictions, Garcia has convictions for burglary and attempted robbery, and Reynaga and Mazariegos have convictions for burglary and robbery."}, {"id": "8cf686ca-3db6-4303-a137-2d4ce2f6d95c", "title": "Israel used U . S .- made bombs to kill dozens of civilians in Rafah , weapons experts reveal , after blast sparked international outcry", "date": "2024-05-30 06:45", "url": "https://www.dailymail.co.uk/news/article-13474831/Israel-used-bombs-kill-dozens-civilians-Rafah.html", "message": "The U.S. had been pushing for leaders in the Israeli military to use GBU-39 bombs more often because they are more precise and better suited to urban environments than larger bombs.\nEarlier this month, President Biden said the United States was pausing a delivery of the larger 2000-pound bombs that Israel often uses.\n'The strike was conducted using two munitions with small warheads suited for this targeted strike,' Rear Adm. Daniel Hagari, the Israeli military spokesman, said.\nIt already has complained about Israel taking over the Rafah border crossing, the only crossing between Gaza and Egypt.\nAn Israeli military official said Israel had notified Egypt of the takeover."}, {"id": "b701ab7c-0588-409d-8b43-e3ab14483f36", "title": "US the big holdout in allowing Ukraine to hit Russia with Western weapons", "date": "2024-05-30 04:30", "url": "https://www.politico.eu/article/us-is-the-big-holdout-in-allowing-ukraine-to-hit-russia-with-western-weapons-zelenskyy-putin-biden-kharkiv-radars-missiles-macron-scholz/", "message": "“It is important that our partners have enough determination for preemptive protection against Russian terrorists, just as they would strike at any other terrorists — destroying them before they start taking lives,” President Volodymyr Zelenskyy said in a statement after Russian attacks on Kharkiv region last week.\nUkraine’s allies are listening.\nSo far, the U.K., Sweden, Finland, the Baltic countries, the Netherlands, Poland, the Czech Republic, Canada and others have said they have no problem with Ukraine's using their weapons to hit Russia.\nOn Tuesday, France and Germany also agreed — with caveats.\nNATO Secretary-General Jens Stoltenberg wants countries to reassess policies that “tie[] one hand of the Ukrainians on their back.”"}, {"id": "51f688c6-a9d2-4894-b58c-4030ce88c1af", "title": "Pop diva Dua Lipa condemns Israel for enabling genocide in Gaza", "date": "2024-05-30 03:30", "url": "https://economictimes.indiatimes.com/magazines/panache/pop-diva-dua-lipa-condemns-israel-for-enabling-genocide-in-gaza/articleshow/110548872.cms", "message": "London, May 29, 2024 -British-Albanian pop singer Dua Lipa has denounced Israel 's offensive in Gaza as a \" genocide \", after a new pro-Palestinian protest took place in London that saw dozens of people arrested.\n\"Burning children alive can never be justified.\nThe whole world is mobilising to stop the Israeli genocide\", the singer wrote on an Instagram story late Tuesday with the hashtag \"#AllEyesOnRafah\", which has been trending on social media.Israel's military operations in Gaza, concentrated now on Rafah , provoked a renewed backlash after Gaza officials said an Israeli strike this weekend set ablaze a crowded refugee camp, killing 45.American actor Pedro Pascal and model Bella Hadid also posted graphics with \"All eyes on Rafah\" on Instagram.\nShe had previously signed an open letter to US President Joe Biden calling for \"an end to the bombing of Gaza and the safe release of hostages\".Forty people were arrested on Tuesday night in London following a pro-Palestinian demonstration of up to 10,000 people, UK police said.Rock star Paul Weller, the rapper Stormzy and actor Tilda Swinton are among British celebrities who have previously called for a ceasefire in Gaza.\nHamas launched an unprecedented attack on October 7 that resulted in the deaths of 1,189 people, mostly civilians, according to an AFP tally based on Israeli official figures.Militants also took 252 hostages, 121 of whom remain in Gaza, including 37 the army says are dead.Israel's retaliatory offensive has killed at least 36,171 people in Gaza, mostly civilians, according to the territory's health ministry."}, {"id": "fce48c6b-aa37-46df-a45c-0f39227c149b", "title": "Mokwena : Ill never give up on Shalulile - Sport", "date": "2024-05-30 08:45", "url": "https://www.namibian.com.na/mokwena-ill-never-give-up-on-shalulile/", "message": "Sometime during the DStv Premiership campaign that has just ended, when many were declaring that Peter Shalulile had reached his sell-by date, coach Rulani Mokwena stood up for the striker.\nShalulile expressed his gratitude to coach and teammates as he looked ahead to Saturday’s Nedbank Cup final against Orlando Pirates at the Mbombela Stadium.\n“I had the support of my teammates, and the coach never gave up on me.\n“You know, I’ll say if you believe in yourself and if you know you are a good striker, you will never give up.\n“The best, CR7 (Cristiano Ronaldo), people thought he was done but he is breaking records and he still believes in himself."}, {"id": "5d4491d5-78ca-4c6b-966b-ae39dff93617", "title": "UN Security Council to convene this week over NK satellite launch : Seoul official", "date": "2024-05-30 03:30", "url": "https://www.koreaherald.com/view.php?ud=20240530050100", "message": "(Getty Images)The UN Security Council will convene an open meeting this week to discuss North Korea's recent launch of a military reconnaissance satellite that ended in failure, a Seoul official said Wednesday.\n\"The Security Council has a responsibility to protect global peace and security, defend the global nonproliferation regime, and uphold its resolutions,\" Evans said.\n\"The United States urges all Security Council members to take this responsibility seriously and unite in condemning the DPRK's dangerous and unlawful behavior.\"\nDPRK stands for the North's official name, the Democratic People's Republic of Korea.\nOn Tuesday, UN Secretary-General Antonio Guterres condemned the North's launch and called on Pyongyang to return to dialogue in a statement issued by his spokesperson, Stephane Dujarric."}, {"id": "3f51a8a9-1146-4d9e-99b7-a5999697a853", "title": "Day 237 of genocide : Dozens of civilians killed , others injured | World", "date": "2024-05-30 09:30", "url": "https://en.ammonnews.net/article/72958", "message": "Home WorldDay 237 of genocide: Dozens of civilians killed, others injuredAmmon News - At least seven civilians were killed and others were injured as the Israeli occupation forces bombed several areas in the Gaza Strip.\nFour civilians were killed and 15 others were injured as a result of the occupation warplanes bombing a house belonging to the Zaqout family in the Nuseirat camp in the central Gaza Strip.\nIn the Tal Al-Hawa neighborhood, west of Gaza City, three civilians were killed by occupation army snipers on Street 8 and the vicinity of the University College.\nThe occupation also targeted, with artillery shelling, a number of citizens’ homes.\nOccupation tanks also bombed the southern areas of the Al-Zaytoun neighborhood, southeast of Gaza City, with artillery shells and gunfire."}, {"id": "dbf1fb9a-5bb7-4391-b434-81a1e92ed3e2", "title": "North Korea flies trash balloons over the South as leader Kim doubles down on satellite ambitions - New Delhi Times - India Only International Newspaper", "date": "2024-05-30 06:00", "url": "https://www.newdelhitimes.com/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite-ambitions/", "message": "It advised civilians not to touch the objects flown from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nNorth Korea hasn’t commented on when it would be ready to attempt a satellite launch again, which some experts say could take months.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine."}, {"id": "5b6c7edd-dc34-4eec-8d80-692db193c381", "title": "War in Gaza could last another seven months , Israel warns", "date": "2024-05-30 05:00", "url": "https://www.cnn.com/2024/05/29/middleeast/israel-gaza-war-seven-months-end-year-intl/", "message": "CNN —The war in Gaza will likely continue through at least the end of the year, an Israeli official warned Wednesday, seeming to dismiss the idea that fighting would end after the military offensive against Hamas in Rafah.\nIsrael’s national security adviser, Tzachi Hanegbi, said the year 2024 has been “defined as a year of combat” by Israel’s war cabinet.\nThe Israeli government had previously signaled that entering Rafah would be the final stage of its war against Hamas, which attacked Israel on October 7, killing about 1,200 people and taking some 250 people hostage.\nIn response, Israel launched a devastating offensive in Gaza which has killed more than 36,000 people, according to Palestinian officials.\nThis resilience is what has allowed this nation to survive for 75 years, and even for 3,000 years before that."}, {"id": "d5c47d82-d579-4874-a4d2-1d02cac727ad", "title": "War in Gaza could last another seven months , Israel warns", "date": "2024-05-30 05:30", "url": "https://us.cnn.com/2024/05/29/middleeast/israel-gaza-war-seven-months-end-year-intl/", "message": "CNN —The war in Gaza will likely continue through at least the end of the year, an Israeli official warned Wednesday, seeming to dismiss the idea that fighting would end after the military offensive against Hamas in Rafah.\nIsrael’s national security adviser, Tzachi Hanegbi, said the year 2024 has been “defined as a year of combat” by Israel’s war cabinet.\nThe Israeli government had previously signaled that entering Rafah would be the final stage of its war against Hamas, which attacked Israel on October 7, killing about 1,200 people and taking some 250 people hostage.\nIn response, Israel launched a devastating offensive in Gaza which has killed more than 36,000 people, according to Palestinian officials.\nThis resilience is what has allowed this nation to survive for 75 years, and even for 3,000 years before that."}, {"id": "993d9514-9a35-499b-96ef-05fed9562d50", "title": "Russia - Ukraine war : List of key events , day 825", "date": "2024-05-30 03:15", "url": "https://www.aljazeera.com/news/2024/5/30/russia-ukraine-war-list-of-key-events-day-825", "message": "Ukraine’s air force said its defence systems destroyed seven Russia-launched missiles and 32 drones overnight.\nThe commander said Russian forces attacked “military facilities and critical infrastructure in Ukraine” but did not provide additional details."}, {"id": "43ef0a1c-b1a7-4675-8baa-13a1ece11bae", "title": "N . J . police union calls for  real consequence for rowdy teens on boardwalk", "date": "2024-05-30 02:15", "url": "https://www.pennlive.com/crime/2024/05/nj-police-union-calls-for-real-consequences-for-drunk-rowdy-teens-after-boardwalk-unrest.html", "message": "Ocean City suffered its second consecutive Memorial Day weekend of disruptions, with numerous fights, disturbances and the stabbing of a 15-year-old boy.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n“We have a highly qualified team of officers on the boardwalk and throughout town, and they will enforce all laws to the fullest."}, {"id": "ca6f057e-a53d-4ae2-a99a-1c248eb28569", "title": "Syria says Israeli strike kills girl , wounds 10 civilians", "date": "2024-05-30 03:00", "url": "https://dunyanews.tv/en/World/815135-Syria-says-Israeli-strike-kills-girl,-wounds-10-civilians", "message": "Syria says Israeli strike kills girl, wounds 10 civiliansWorld World Syria says Israeli strike kills girl, wounds 10 civiliansIsraeli air strike targeted a central site and a residential building in Baniyas city.\nThe Britain-based Observatory also said the Israeli strike on central Syria killed three Syrian fighters working with Lebanon's Iran-backed Hezbollah group and two other non-Syrian fighters working for the same movement.\nEarlier on Wednesday, state media said air defences intercepted Israeli \"targets\" over central Syria.\nThe Observatory said the Israeli strikes targeted \"at least one military site... in the eastern countryside of Homs, causing plumes of smoke to rise\".\nOn Saturday, an Israeli drone strike in central Syria, near the border with Lebanon, killed two Hezbollah fighters, the Observatory had said."}, {"id": "97c79d8b-9ea8-4348-9b96-40ce6fbf04cd", "title": "New Jersey police union calls for  real consequence for drunk , rowdy teens after Jersey Shore boardwalk unrest – NBC New York", "date": "2024-05-30 04:00", "url": "https://www.nbcnewyork.com/news/local/new-jersey-police-union-calls-for-real-consequences-for-drunk-rowdy-teens-after-jersey-shore-boardwalk-unrest/5458273/", "message": "Ocean City suffered its second consecutive Memorial Day weekend of disruptions, with numerous fights, disturbances and the stabbing of a 15-year-old boy.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n\"We have a highly qualified team of officers on the boardwalk and throughout town, and they will enforce all laws to the fullest."}, {"id": "069d8b86-914b-4a1c-b66b-211416c0866f", "title": "Western Leaders Depending on Putin To Avoid WWIII", "date": "2024-05-30 00:30", "url": "https://sputnikglobe.com/20240529/the-west-depends-on-putins-rationality-to-avoid-wwiii-1118692662.html", "message": "https://sputnikglobe.com/20240529/the-west-depends-on-putins-rationality-to-avoid-wwiii-1118692662.htmlThe West Depends on Putin’s Rationality to Avoid WWIIIThe West Depends on Putin’s Rationality to Avoid WWIIISputnik InternationalWestern countries are depending on Russian President Vladimir Putin's rationality to avoid World War III, as they continue to escalate in Ukraine.\n2024-05-29T22:40+00002024-05-29T22:40+00002024-05-30T04:29+0000analysisvladimir putinmark slebodarussiaukrainekievnatonuclear warworld war iiifault lineshttps://cdn1.img.sputnikglobe.com/img/07e8/05/1c/1118669563_0:0:3140:1767_1920x0_80_0_0_156d3dfce5937fb9b4a1e55b2e9ef887.jpgWhile Ukrainian military officials insisted they needed permission to strike inside Russia to counter coming Russian attacks in the Kharkov region, it has since used Western weapons to attack targets irrelevant to the special military operation.Over the past week, Ukraine claimed that it struck two Russian early warning radar systems designed to detect long-range ballistic missile attacks, including nuclear strikes.\nNeither system that was targeted was turned toward Ukrainian territory, which seems to implicate an alternative motive than affecting the Ukrainian theater.The attack represented a significant escalation of the conflict and came as NATO countries toyed with the idea of sending their troops to Ukraine to fill Kiev’s manpower shortage.Since Russia has proven more than capable of defeating NATO equipment and tactics on the battlefield, it has little reason to fear a conventional land war against NATO countries in Ukraine, but that could easily spiral into a nuclear war which forces any rational actor to behave with caution.“NATO representatives, especially in Europe, should be aware of what they are playing with,” Putin said at a press conference in Uzbekistan on Tuesday.Western countries don’t fear allowing Kiev to strike inside of Russia because they already have and those countries didn’t suffer any significant consequences, noted Sleboda.On Wednesday, the Head of the Delegation of the Russian Federation to the Vienna Negotiations on Military Security and Arms Control, Konstantin Gavrilov warned that “A potential aggressor needs to realize that, if attacked, we reserve the right to act ‘as the situation demands,’ so to speak, and use all our capabilities,” adding that any response to violating Russian redlines “may be truly devastating.”With its numerous successes on the battlefield over the past several months Russia has no reason to seek escalation, but Western countries continue to try to provoke Russia into a wider war despite the consequences it could hold for all of civilization.A recent study by Nature estimated that a nuclear war between the United States and Russia would result in around 5 billion deaths worldwide.\nhttps://sputnikglobe.com/20240528/poland-not-excluding-sending-troops-to-ukraine-in-future---foreign-ministry-1118662023.htmlrussiaukrainekievSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 602024Ian DeMartinoIan DeMartinoNewsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Ian DeMartinoworld war iii, will ukraine cause world war 3, who wins world war 3, nato escalations in ukraine, nato troops in ukraine, french mercenaries in ukraine, russian early warning radar, ukraine strikes inside russia"}, {"id": "9135fc94-d27d-43fb-ab0c-0795b2108373", "title": "NJ police union calls for  real consequence after Jersey Shore boardwalk unrest", "date": "2024-05-30 01:45", "url": "https://www.fox5ny.com/news/new-jersey-police-union-calls-real-consequences-drunk-rowdy-teens-after-boardwalk-unrest", "message": "Peter Andreyev, president of the New Jersey State Policemens' Benevolent Association, issued a statement calling for changes in laws and procedures governing how police interact with disorderly teens and young adults.\nAnd a false report of a shooting in Seaside Heights briefly led to panic on the boardwalk there, authorities said.\nThere needs to be real consequences for violent, drunken, and dangerous behavior for both juveniles and adults.\nOcean City Mayor Jay Gillian said his city has had enough of rowdy young people bent on causing trouble.\n\"We wholeheartedly support the city of Wildwood Police Department in protecting this community from these nuisance crowds on our boardwalk and in the city.\""}, {"id": "e3c889c2-5039-46f6-998b-8ed304cef2c1", "title": "Israel warns war in Gaza may extend seven more months", "date": "2024-05-30 02:15", "url": "https://economictimes.indiatimes.com/news/defence/israel-warns-war-in-gaza-may-extend-seven-more-months/articleshow/110548309.cms", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelTel Aviv [Israel]: An Israeli official cautioned Wednesday that the war in Gaza might persist until the year's end, casting doubt on hopes that the fighting would cease after the military operation against Hamas in Rafah CNN reported.Tzachi Hanegbi, Israel 's national security adviser, indicated that 2024 had been designated a \"year of combat \" by Israel's war cabinet.\n\"We are now in the fifth month of 2024, which means we expect another seven months of fighting to deepen our achievements and achieve our goal of destroying the military and governmental capabilities of Hamas and Islamic Jihad,\" Hanegbi stated.These remarks come as Israeli tanks, spotted in central Rafah for the first time since the operation commenced, continued to advance on the southern Gaza city on Wednesday.\nThis action persists despite mounting global pressure to halt the offensive , as reported by CNN.Initially, the Israeli government suggested that entering Rafah would mark the final stage of its war against Hamas, which initiated attacks on Israel in October, resulting in approximately 1,200 casualties and the abduction of around 250 individuals.\nHe urged patience and resilience, cautioning against setting ultimatums, according to CNN.Meanwhile, Israel persists with its military offensive despite growing global outrage, triggered by an Israeli airstrike on Sunday that killed at least 45 people and injured 200 others in Rafah at a camp for displaced people, previously designated as a safe zone.Footage from the Tal al-Sultan camp depicted scenes of horror, with charred bodies extracted from rubble and a man holding the headless body of a child amidst raging fires.Despite calls for reconsideration, US President Joe Biden has maintained his stance on Israel, indicating that the Rafah strike had not yet crossed a red line warranting alterations in American support.The strike occurred shortly after the International Court of Justice (ICJ) ordered Israel to \"immediately halt\" its offensive in Rafah or any actions exacerbating conditions for Palestinians in Gaza.\nThe ICJ described the humanitarian situation in Rafah as \"disastrous,\" warning of further deterioration if Israel's operation persists, CNN reported."}, {"id": "d7e5c5c5-4b5b-41fa-b1f4-b1c1367c0c97", "title": "Israel warns war in Gaza may extend seven more months", "date": "2024-05-30 02:45", "url": "https://www.dnaindia.com/world/report-israel-warns-war-in-gaza-may-extend-seven-more-months-3091201", "message": "Israel warns war in Gaza may extend seven more monthsInitially, the Israeli government suggested that entering Rafah would mark the final stage of its war against Hamas, which initiated attacks on Israel in October, resulting in approximately 1,200 casualties and the abduction of around 250 individuals.\nTzachi Hanegbi, Israel's national security adviser, indicated that 2024 had been designated a \"year of combat\" by Israel's war cabinet.\nIn response, Israel launched a devastating offensive in Gaza, claiming the lives of over 36,000 people, according to Palestinian officials.\nThe strike occurred shortly after the International Court of Justice (ICJ) ordered Israel to \"immediately halt\" its offensive in Rafah or any actions exacerbating conditions for Palestinians in Gaza.\nThe ICJ described the humanitarian situation in Rafah as \"disastrous,\" warning of further deterioration if Israel's operation persists, CNN reported."}, {"id": "ec409e6c-eb04-4817-933b-2f1b2562453c", "title": "Pakistan : Terrorists torch girl  middle school in North Waziristan", "date": "2024-05-30 06:30", "url": "https://news.webindia123.com/news/Articles/Asia/20240530/4201651.html", "message": "Some unidentified terrorists torched a girls'' middle school in the Razmak tehsil of North Waziristan in Khyber Pakhtunkhwa province of Pakistan destroying furniture, computers and books, police said on Wednesday, Dawn reported.\nAbrar, a member of Shakhimar Welfare Organisation, told Dawn the school was constructed by an organisation along with Pakistan Army''s 7th Division in 2020.\nOn May 9, terrorists set fire to a girls'' private school in the Shawa area of South Waziristan.\nSimilarly, on May 17, unidentified terrorists bombed an under-construction girls'' private school in Lower South Waziristan.\nAround 500 girls were enrolled in the two schools, Government Girls Middle School Noor Jannat and Government Girls Middle School Yunus Kot which were targeted by the attackers around midnight."}, {"id": "63ab8805-1406-40ea-8877-93e4492e99aa", "title": "Caledonia man indicted in stabbing investigation", "date": "2024-05-30 02:30", "url": "https://www.wcbi.com/caledonia-man-indicted-in-stabbing-investigation/", "message": "Caledonia man indicted in stabbing investigationLOWNDES COUNTY, Miss.\n(WCBI) – A Caledonia man was indicted in a stabbing investigation.\nA Lowndes County grand jury recently returned the indictment against him.\nProsecutors alleged Umfress stabbed the victim multiple times.\nFor 24/7 news and updates, follow us on Facebook and X"}, {"id": "911fb8da-838a-4141-9e94-705b6ad660b0", "title": "Ukraine to Get Sweden AWACS in First Airborne Radar Donation", "date": "2024-05-30 01:30", "url": "https://theaviationist.com/2024/05/29/ukraine-to-get-swedish-awacs/", "message": "ASC890 Will Boost SurveillanceAccording to Jonson, the ASC (Airborne Surveillance Control) 890 will lend a “military capability” that will “strengthen Ukraine’s air defense.” Called “Package 16,” it will be the “largest Swedish military aid package at Euro 1.16 Billion.\nThe ASC890 Erieye is the name of the airborne radar system, mounted on the Saab 340B twin-engine turboprop aircraft.\nThe Swedish AWACS can fly from close to western and northwestern Ukraine to detect possible Russian land-strike missiles before the F-16s take off.\nThese aircraft help Ukraine collect a lot of data on Russian ground radar placements before its UAV and Storm Shadow ALCM strikes into Russia’s rear or in Crimea.\nFurthermore, Ukraine’s command and control capability will be strengthened in the package through a donation of terminals with subscriptions for satellite communications."}, {"id": "8057069c-c71b-4dda-ade6-43f96a47c766", "title": "Israel undermines goals by harming civilians in Gaza , US tells UN - Newspaper", "date": "2024-05-30 02:45", "url": "https://www.dawn.com/news/1836543/israel-undermines-goals-by-harming-civilians-in-gaza-us-tells-un", "message": "“The continued pattern of significant civilian harm resulting from incidents like Sunday’s airstrikes undermines Israel’s strategic goals in Gaza,” deputy US Ambassador to the UN Robert Wood told the 15-member council.\nAn airstrike on Sunday set off a blaze in a tent camp in Rafah in southern Gaza, killing at least 45 people.\nIsrael — a US ally — said it had targeted Hamas militants and had not intended to harm civilians.\nOn Wednesday, Wood told reporters that Washington was reviewing it, but UN action was unlikely to be helpful or change the situation on the ground.\nHamas chooses to exploit the civilians of Gaza as human shields,” he told the council."}, {"id": "db93b4af-c978-4a99-b3fe-375df8bfe693", "title": "London shooting : Four wounded , including child , in Hackney | united kingdom | News", "date": "2024-05-30 03:00", "url": "https://www.express.co.uk/news/uk/1905183/london-shooting-hackney-four-wounded-child", "message": "Police were called following an incident in London.\nThree adults and a child have suffered serious injuries following a shooting near to a restaurant in Hackney, London.\nA major police operation was launched following an incident on Kingsland High Street, Dalston just after 9.20pm on Wednesday.\nThe Metropolitan Police confirmed all four had suffered \"gunshot injuries\" and were rushed to an east London hospital.\nOfficers have not yet arrested anyone in connection with the attack."}, {"id": "a405ecab-ecfd-44bb-820f-96e6fee3e997", "title": "Rafah battles intensify as Israel takes over Gaza - Egypt border strip", "date": "2024-05-30 09:30", "url": "https://www.digitaljournal.com/world/rafah-battles-intensify-as-israel-takes-over-gaza-egypt-border-strip/article", "message": "The Israeli military launched its incursion into Rafah in early May despite international objections over the fate of Palestinian civilians sheltering there.\nMilitary spokesman Rear Admiral Daniel Hagari announced Israel had taken “operational control” of the narrow border area, where he said troops had “discovered around 20 tunnels”.\nOn the ground in the Gaza Strip, witnesses reported fighting in central and western Rafah.\nThe United States has been among the countries urging Israel to refrain from a full-scale Rafah offensive because of the risk to civilians.\nThe New York Times and CNN, citing weapons experts and analysis of video from the scene of the weekend Rafah strike, reported that the bomb believed to have started the fatal fire was a US-made GBU-39 guided munition."}, {"id": "722b141c-4e8f-41d7-b762-9ff8a6f14b8f", "title": "North Korea flies trash balloons over the South", "date": "2024-05-30 07:00", "url": "https://www.koaa.com/world/north-korea-flies-trash-balloons-over-the-south-as-leader-kim-doubles-down-on-satellite-ambitions", "message": "South Korea’s Joint Chiefs of Staff said North Korea also has been flying large numbers of trash-carrying balloons toward the South since Tuesday night in retaliation against South Korean activists for flying anti-North Korean propaganda leaflets across the border.\nIt advised civilians not to touch the objects from North Korea and to report to military or police after discovering them.\nKim has described spy satellites as crucial for monitoring U.S. and South Korean military activities and enhancing the threat posed by his nuclear-capable missiles.\nIt is believed that North Korea’s previous space rockets used unsymmetrical dimethylhydrazine as fuel and dinitrogen tetroxide as an oxidizer.\nThe U.S. and South Korea have also accused North Korea of providing Russia with artillery shells, missiles and other military equipment to help prolong its fighting in Ukraine."}, {"id": "d2c4d4e2-3590-4b13-98c5-3d5885628017", "title": "Job recruitment in Ireland is taking on some of the worst aspects of dating app culture", "date": "2024-05-30 09:30", "url": "https://www.irishtimes.com/business/work/2024/05/30/job-recruitment-in-ireland-is-taking-on-some-of-the-worst-aspects-of-dating-app-culture/", "message": "“It’s amazing that people have still not figured out that candidates’ number one complaint is that they never hear back; half of job seekers say that’s still happening,” he says.\n[ Here’s a cautionary tale from a seasoned senior manager’s recent job interview ]Employees want to move.\nAnother practice getting the thumbs down from job seekers is “baiting”, which attracts a candidate to take a job based on the advertised criteria.\nToday’s job seekers are more than willing to share their experiences on public forums.\nWhat was also eye-opening about the Greenhouse survey was that the mistakes don’t stop at the application stage."}, {"id": "fb883103-a8d3-4de6-bcbc-bbf69b6d0702", "title": "An image calling for  All Eyes on Rafah  is going viral . But it seems AI - generated", "date": "2024-05-30 02:15", "url": "https://www.smh.com.au/world/middle-east/an-image-calling-for-all-eyes-on-rafah-is-going-viral-but-it-seems-ai-generated-20240530-p5jhuc.html", "message": "“All Eyes on Rafah,” reads the image.\nMore than 40 million Instagram users have shared this graphic to their stories using a user-generated template in recent days, according to Instagram.\nA tent camp housing Palestinians displaced by the Israeli offensive in Rafah, Gaza Strip.\nCredit: APUnlike other graphic imagery about the war that has gone viral, this image is likely to have been generated by artificial intelligence.\nSome on social media have criticised the image as replacing distressing footage of what’s actually happening in Gaza – from photographers and people on the ground – with a fake image generated by technology."}, {"id": "8f34a007-7433-4f99-8971-844192871a6d", "title": "An image calling for  All Eyes on Rafah  is going viral . But it seems AI - generated", "date": "2024-05-30 02:30", "url": "https://www.theage.com.au/world/middle-east/an-image-calling-for-all-eyes-on-rafah-is-going-viral-but-it-seems-ai-generated-20240530-p5jhuc.html", "message": "“All Eyes on Rafah,” reads the image.\nMore than 40 million Instagram users have shared this graphic to their stories using a user-generated template in recent days, according to Instagram.\nA tent camp housing Palestinians displaced by the Israeli offensive in Rafah, Gaza Strip.\nCredit: APUnlike other graphic imagery about the war that has gone viral, this image is likely to have been generated by artificial intelligence.\nSome on social media have criticised the image as replacing distressing footage of what’s actually happening in Gaza – from photographers and people on the ground – with a fake image generated by technology."}, {"id": "abce5d4b-614d-4ba4-83f7-73d77f6d2766", "title": "Married At First Sight star points out the major problem with All Eyes On Rafah social media campaign :  Dont kid yourselves  ", "date": "2024-05-30 06:00", "url": "https://www.dailymail.co.uk/tvshowbiz/article-13474705/Married-Sight-star-points-major-problem-Eyes-Rafah-social-media-campaign-Dont-kid-yourselves.html", "message": "A Married At First Sight bride has pointed out a major problem with social media influencers urging people to pay attention to Israel's ongoing conflict in Gaza.\nHayley Vernon, who appeared on the Channel Nine dating show in 2020, took to her social media to weigh in with her views.\n'Everyone posting all eyes on Rafah - who is actually donating, helping offering any kind of support even on an international level - posting an Instagram post isn't doing anything.\nThe phrase 'All Eyes on Rafah' has gained momentum on social media throughout the last few months.\nMatt Navarra, a social media consultant and industry analyst, told NBC: 'The trend of posting 'All Eyes on Rafah' has been something that has been building for a little while."}, {"id": "e6b16ec9-5cd0-4a5b-8f27-f173cf89f80b", "title": "An image calling for  All Eyes on Rafah  is going viral . But it seems AI - generated", "date": "2024-05-30 02:15", "url": "https://www.watoday.com.au/world/middle-east/an-image-calling-for-all-eyes-on-rafah-is-going-viral-but-it-seems-ai-generated-20240530-p5jhuc.html", "message": "“All Eyes on Rafah,” reads the image.\nMore than 40 million Instagram users have shared this graphic to their stories using a user-generated template in recent days, according to Instagram.\nA tent camp housing Palestinians displaced by the Israeli offensive in Rafah, Gaza Strip.\nCredit: APUnlike other graphic imagery about the war that has gone viral, this image is likely to have been generated by artificial intelligence.\nSome on social media have criticised the image as replacing distressing footage of what’s actually happening in Gaza – from photographers and people on the ground – with a fake image generated by technology."}, {"id": "607df6dc-981a-4126-b00d-81fa4cea04e9", "title": "An image calling for  All Eyes on Rafah  is going viral . But it seems AI - generated", "date": "2024-05-30 03:30", "url": "https://www.brisbanetimes.com.au/world/middle-east/an-image-calling-for-all-eyes-on-rafah-is-going-viral-but-it-seems-ai-generated-20240530-p5jhuc.html", "message": "“All Eyes on Rafah,” reads the image.\nMore than 40 million Instagram users have shared this graphic to their stories using a user-generated template in recent days, according to Instagram.\nA tent camp housing Palestinians displaced by the Israeli offensive in Rafah, Gaza Strip.\nCredit: APUnlike other graphic imagery about the war that has gone viral, this image is likely to have been generated by artificial intelligence.\nSome on social media have criticised the image as replacing distressing footage of what’s actually happening in Gaza – from photographers and people on the ground – with a fake image generated by technology."}, {"id": "a8cd0cdd-106d-4cbf-8f9a-d4b5a5a7eaa8", "title": "  Dozens killed in fresh Israeli attacks on Rafah  Says Palestinian medics", "date": "2024-05-30 08:45", "url": "https://www.sentinelassam.com/more-news/international/dozens-killed-in-fresh-israeli-attacks-on-rafah-says-palestinian-medics", "message": "Gaza: Palestinian medics have said dozens of people have died in fresh Israeli attacks on the southern Gaza city of Rafah on Tuesday, two days after 45 people were reportedly killed in an airstrike which sparked international condemnation.\nThe Israeli military said it was investigating reports of an attack on a shelter for displaced persons in western Rafah.\nEarlier on Tuesday, a spokesman for the Hamas-run health authority in Gaza said a further 18 people were killed overnight in separate Israeli attacks in Rafah.\nEyewitness reports from Rafah on Tuesday suggested the Israeli army has advanced into the city centre.\n(IANS)Also Read: Gaza: ‘All Eyes on Rafah’ Campaign Gains Momentum Amidst Israeli Offensive In RafaAlso Watch:"}, {"id": "fd811577-94fd-4830-b2f1-10feca7fe7e7", "title": "Live updates : Israel - Hamas war in Gaza , Rafah offensive draws global outcry", "date": "2024-05-30 05:30", "url": "https://us.cnn.com/middleeast/live-news/israel-hamas-war-gaza-news-05-30-24/", "message": "President Joe Biden waits to speak at a dinner for the Detroit chapter of the NAACP on May 19.\nWhere, exactly, that line rests remains somewhat elusive since Biden first confirmed to an interviewer in March that such a threshold exists.\nHe has told Prime Minister Benjamin Netanyahu as much during telephone calls and conveyed his stance publicly in an interview with CNN.\nMany Democrats, along with foreign leaders who the US counts as allies, say Israel’s actions clearly cross a red line – if not Biden’s, then their own and those of international law.\nRead more about what that red line might mean for Biden here."}, {"id": "23fc3e1a-a163-4f0f-9c5f-b1d0d5167446", "title": "MW3 and Warzone : How to Unlock the Superi 46", "date": "2024-05-30 02:45", "url": "https://gameranx.com/features/id/499849/article/mw3-and-warzone-how-to-unlock-the-superi-46/", "message": "One of those weapons belongs to the submachine gun category and it goes by the name of the Superi 46.\nIf you want to see what the Superi 46 is capable of in MW3 and Warzone, you’re going to have to spend some time unlocking it first.\n| Call of Duty: Warzone – Lockdown Mode Explained | Call of Duty: Warzone – What is the Specialist Perk Package?\n| Call of Duty: Modern Warfare 3 – Arcade Playlist Explained | Call of Duty: Warzone – What is the Utility Box Field Upgrade?\nIf you’re too eager to wait, you can always purchase a bundle containing a Superi 46 blueprint."}, {"id": "b0123705-1f69-47c3-8af7-684913901d34", "title": "Drones Filling The Skies Over Ukraine Battlefields", "date": "2024-05-30 01:45", "url": "https://menafn.com/1108273441/Drones-Filling-The-Skies-Over-Ukraine-Battlefields", "message": "A recent report highlighted howUkraineneeded to pull US-provided M1A1 Abrams main battle tanks from the battlefield, due to their vulnerability to drones.\nAs a result, the battle between drones continues to shift toward whoever has the edge in electronic warfare.\nDrones' growing importance on the battlefield will continue whether it's by becoming more autonomous or playing a supporting role to other weapon systems.\nDrones alone won't determine who wins battles, but they will play a vital role for military planners in the future.\nMany of Russia's assaults on Ukrainian positions are thwarted by Ukrainian infantry supported by FPV drones."}, {"id": "5d5a4928-7d1e-4a34-a255-bacc39858b7a", "title": "Türkiye starts mass production of domestic Altay tank : Official", "date": "2024-05-30 09:30", "url": "https://www.dailysabah.com/business/defense/turkiye-starts-mass-production-of-domestic-altay-tank-official", "message": "Türkiye has started mass production of the country's first domestically made main battle tank, the Altay, a top defense official said Wednesday.\n\"We have started the mass production of our national tank.\nThe new generation Altay tank, produced by BMC Defence under the project of the SSB, has been upgraded to meet the conditions of modern combat environments.\n\"Many subsystems have been localized, updated technologies and innovations have been added to enhance its combat capabilities,\" Görgün said.\nReflecting the experience gained from the recent operations of the Turkish Armed Forces (TSK), the Altay tank has been equipped with additional features."}, {"id": "51adda40-2c2c-42c5-9062-bad9ebfb9db6", "title": "Veteran Salute : Serving in WWII with a legendary unit", "date": "2024-05-30 05:30", "url": "https://www.yahoo.com/news/veteran-salute-serving-wwii-legendary-032442612.html", "message": "LEROY (KSNT) – Fighting across Europe during World War II, Corporal Carl Otto served in an elite combat signal battalion and engaged in the Battle of the Bulge.\n“I went overseas with the 35th signal battalion,” he said, “and was stationed in Leominster, England, doing nothing.\nI was getting pretty bored, and the Battle of the Bulge started.”Veteran Salute: Serving in health and communications overseasVolunteering for infantry replacement, Otto made his way to Bastogne in Belgium.\nIf the conflict overseas wasn’t intense enough, even the terrain showed hostility to Otto and his unit.\nWe were all about to freeze to death, so that was my introduction into the combat area.”Otto served in a legendary unit, the 94th Signal Battalion."}, {"id": "b31bb78e-7b5c-4341-9f09-50d3d818e9cc", "title": "HYD : Two IDF Soldiers Murdered In Terror Attack Near Shechem – The Yeshiva World", "date": "2024-05-30 08:15", "url": "https://www.theyeshivaworld.com/news/israel-news/2286929/hyd-three-idf-soldiers-killed-in-gaza.html", "message": "The IDF released for publication on Thursday morning that two IDF soldiers were killed in the ramming attack near Shechem on Wednesday evening and a third soldier was killed in battle in the northern Gaza Strip on Wednesday.\nThe ramming attack occurred at an IDF checkpoint near Shechem.\nAs IDF soldiers were checking cars, the terrorist sped to the front of the line and rammed into two soldiers.\nAccording to a preliminary investigation, the ramming attack occurred in seconds and the soldiers had no time to respond by opening fire.\nThe soldier who fell in battle in northern Gaza on Wednesday was identified as Staff Sgt."}, {"id": "9243131b-2e6e-4e1b-a81f-5aa85de53b6d", "title": "MW3 and Warzone : How to Unlock the Kar98k", "date": "2024-05-30 02:45", "url": "https://gameranx.com/features/id/499864/article/mw3-and-warzone-how-to-unlock-the-kar98k/", "message": "The Kar98k has returned to MW3 and Warzone to the joy of many players.\nBefore you can begin sniping through the opposition, you must unlock the weapon as you play MW3 and Warzone.\nMore Call of Duty guidesMW3 and Warzone: How to Unlock the Superi 46 | MW3 and Warzone: How to Unlock the JAK Harbinger Kit | Modern Warfare 3: How to get a DNA Bomb | Call of Duty: Modern Warfare 3 – How to Earn Weapon Prestige Camos | Call of Duty: Warzone – What is the Rebirth Infil Strikes Public Event?\n| Call of Duty: Warzone – Lockdown Mode Explained | Call of Duty: Warzone – What is the Specialist Perk Package?\n| Call of Duty: Modern Warfare 3 – Arcade Playlist Explained | Call of Duty: Warzone – What is the Utility Box Field Upgrade?"}, {"id": "c2e40939-1e80-491e-9d0d-2af99a3978b3", "title": "Call of Duty Gets on the Fallout Craze , New Crossover Leaked", "date": "2024-05-30 09:30", "url": "https://www.techtimes.com/articles/305157/20240530/call-duty-gets-fallout-fame-new-crossover-leaked.htm", "message": "The latest leak behind Call of Duty suggests that it will have a massive crossover with the popular Fallout franchise shortly, offering the Wasteland experiences to the war zone of the game.\nIn this crossover, leaks reveal that it will feature skins, weapons, vehicles, and more that will get the Fallout treatment, available to access via Call of Duty.\nCall of Duty Gets on the Fallout Craze, Crossover Leaks AppearModernWarzone, a renowned COD leaker, brought a new rumor in the first-person shooter game's future developments with Call of Duty getting on the Fallout craze soon.\nLeaks behind a Fallout crossover appeared online, with Modern Warzone known for being a notable insider behind the franchise, centering on a possible skin dropping in.\nRead Also: Call of Duty: Modern Warfare 3 to Bring Back Fan-Favorite, Classic Weapons-LEAKSMicrosoft's Call of Duty and Fallout: What to Expect?"}, {"id": "6a51e872-5799-4126-9ec8-1c8812eb6ec6", "title": "Call of Duty : Modern Warfare III DLC Season 4 begins", "date": "2024-05-30 08:00", "url": "https://www.newgamenetwork.com/news/22326/call-of-duty-modern-warfare-iii-dlc-season-4-begins/", "message": "Call of Duty: Modern Warfare III DLC Season 4 beginsNew content for the shooter is biohazard-themedActivision has announced that Season 4 for Call of Duty: Modern Warfare III, Call of Duty: Warzone, and Call of Duty: Warzone Mobile, is now live.\nFor MWIII multiplayer, the season will bring three new core 6v6 maps - Tokyo (Launch), Paris (Launch), and Incline (Mid-Season) are medium sized, while Das Gross (Mid-Season), is small sized.\nThe season will also bring Demolition (Launch), Hyper Cranked (Launch), Headshots Only (Mid-Season), and Havoc (Mid-Season) modes.\nZombies will offer a new level Unstable Rift (Mid-Season), while Warzone will see a variety of changes to the map and Gulag.\nModern Warfare III is available worldwide now on PlayStation 5, PlayStation 4, Xbox Series X|S, Xbox One, and PC on Battle.net, and on Steam."}, {"id": "137067d9-ad90-4cff-b1bc-fe81810b0796", "title": "MW3 and Warzone : How to Unlock the JAK Harbinger Kit", "date": "2024-05-30 02:45", "url": "https://gameranx.com/features/id/499833/article/mw3-and-warzone-how-to-unlock-the-jak-harbinger-kit/", "message": "Call of Duty: Modern Warfare 3 and Warzone has transitioned into Season 4.\nWeekly challenges have been reset, meaning more Conversion Kits will roll out, with the first being the JAK Harbinger Kit for the M4.\n| Call of Duty: Warzone – Lockdown Mode Explained | Call of Duty: Warzone – What is the Specialist Perk Package?\n| Call of Duty: Warzone – What are Weapon Trade Stations?\n| Call of Duty: Modern Warfare 3 – Arcade Playlist Explained | Call of Duty: Warzone – What is the Utility Box Field Upgrade?"}, {"id": "5a583573-599c-4569-9038-cb1962c093ef", "title": "Opinion : Do we still understand how wars are won ? | Chattanooga Times Free Press", "date": "2024-05-30 02:15", "url": "https://www.timesfreepress.com/news/2024/may/29/do-we-still-understand-how-wars-are-won/", "message": "We won limited victories against Saddam Hussein in 1991 and Moammar Gadhafi in 2011, only to fumble the endgames.\nIf you're on the left, you'd probably say that most, if not all, of these wars were unnecessary, unwinnable or unworthy.\nEither way, none of these wars were about our very existence.\nNations, especially democracies, often have second thoughts about the means they use to win existential wars.\nBut the tragedy of America's recent battle history is that thousands of those soldiers died in wars we lacked the will to win."}, {"id": "ce0c676b-d528-413b-bad6-3a31c2f1bd19", "title": "Grand Words From the Gipper", "date": "2024-05-30 05:45", "url": "https://townhall.com/columnists/marklewis/2024/05/30/grand-words-from-the-gipper-n2639717", "message": "Almost all the world’s constitutions are documents in which governments tell the people what their privileges are.\nVery few countries have ever had such a system, which is what made America a unique, and grand, experiment in liberty.\nAlexander Hamilton wanted a national bank, a “Band of the United States,” which Thomas Jefferson argued was unconstitutional.\nOther matters became debated before the war—land grants to colleges, a protective tariff, the national bank.\nAdvertisementMr. Reagan’s words quoted at the beginning of this column are what the men who wrote our Constitution (perhaps Hamilton excluded) intended."}, {"id": "6d093b64-828a-4c59-b03b-b17ab1386a8a", "title": "COD : Black Ops 6 Vault Edition and Pre - Order Bonus Leaks", "date": "2024-05-30 02:15", "url": "https://www.playstationlifestyle.net/2024/05/29/cod-black-ops-6-vault-edition-and-pre-order-bonus-leaks/", "message": "This previously included a blurred version of the box art, with a new leak revealing the game’s pre-order bonus, Vault Edition, and more.\nBlack Ops 6 pre-order bonus, Vault Edition, and Cross-Gen Bundle leakKnown leaker and data miner BobUK released several images, as MP1st reported.\nAccording to the leaks, The Frank Woods pre-order bonus is included in Black Ops 6’s Vault Edition.\nBlack Ops 6 now officially confirmed for last-genLogo for Black Ops 6 Cross-Gen Bundle found in files pic.twitter.com/WFNB1O0MGa — CharlieIntel (@charlieINTEL) May 29, 2024In addition to the leaks provided by BobUK, CharlieIntel also revealed the existence of a new Cross-Gen Bundle for Black Ops 6.\nSeemingly corroborating reports that Black Ops 6 is coming to PS4 and Xbox One, in addition to the newer consoles."}, {"id": "e5940f5b-a826-4486-9cfa-a354aa20ee67", "title": "Differentiating innovation : From performance art to production scale", "date": "2024-05-30 01:15", "url": "https://breakingdefense.com/2024/05/differentiating-innovation-from-performance-art-to-production-scale/", "message": "TOPGUN, initiated after the US Navy’s poor air-to-air performance in the Vietnam War, can be seen as a form of concept innovation.\nWhether process innovation saves money or improves speed to field, the silent partner in defense innovation must be silent no more.\nAn organization tasked with capability innovation is going to define its problem and build an empowered program team differently than an organization focused on process innovation.\nSimilarly, the types of leadership support needed for concept innovation are going to differ in kind, scale, and duration from those needed for process innovation.\nThe creation of innovation organizations that are fit for purpose and possess a clearly defined mission is already underway."}, {"id": "ad9ccc42-8584-44c0-bb6b-0e7d3866772f", "title": "Sudan : How El Fasher Went From Darfur Safe Haven to All - Out War", "date": "2024-05-30 05:30", "url": "https://allafrica.com/stories/202405300066.html", "message": "UN officials have called the situation in El Fasher \"Hell on Earth\" and are warning that genocide crimes may be committed.\nDaily interviews that I am doing with friends and human rights monitors in El Fasher suggest that neither claim is an understatement.\nThe battle for El Fasher - home to as many as two million people - started last month but had long been telegraphed.\nLocal volunteers from the Shaqra Emergency Response Room prepare food for displaced people camped just outside of El Fasher.\nThe camp is on the outskirts of El Fasher and is located close to conflict front lines."}, {"id": "8d50e858-877b-4d90-b2c0-62ab2522710a", "title": "Tampa Bay WWII vets return to Normandy for D - Day ceremonies", "date": "2024-05-30 00:00", "url": "https://www.yahoo.com/news/tampa-bay-wwii-vets-return-220924783.html", "message": "TAMPA, Fla. (WFLA) — Five Tampa-area World War II veterans are heading to Normandy for the 80th anniversary of the D-Day invasion.\n“They got my baggage and put it on the Queen Mary and that’s where I stayed for three nights,” said Griep.\n(Handout)He remembers nights of combat and he remembers being there as the 42nd liberated Jewish prisoners at the Dachau Concentration camp.\nNow, thanks to the Elks Club of Florida, Griep will be traveling back to Normandy with members of his family.\n“The World War II vets and the Korean War vets thought their lives were over and nobody recognized, nobody remembered what they did."}, {"id": "0f9c4038-1b4b-4802-9d5d-e87dc020c399", "title": "Xbox Games Are Selling Gangbusters on PS5", "date": "2024-05-30 00:30", "url": "https://www.pushsquare.com/news/2024/05/xbox-games-are-selling-gangbusters-on-ps5", "message": "But yes i too agree that might just ruffle to many feathers for it’s own good.\nI included Jamie cause i know he feels similar without speaking for him.\nBut wish for Xbox to stop making hardware.i fish and hunt as my outdoor hobbies and sure there is brand loyalty in rods reels and lures.\nBut never online in chat forums and topic threads do i see other fisherman wish for other companies to go out of business.\nSorry for the rant but none of that makes any logical sense in business or otherwise."}, {"id": "74ff1e14-36fd-4da4-bf61-92d6113d48d5", "title": "Modern Warfare 3 : All Ranked Play Rewards | Season 4", "date": "2024-05-30 02:45", "url": "https://gameranx.com/features/id/499881/article/modern-warfare-3-all-ranked-play-rewards-season-4/", "message": "Season 4 of Modern Warfare 3 and Warzone has arrived which means ranks have reset and there’s a whole season of competitive play to look forward to.\nIf you’re queuing into Ranked Play, the main goal is to beat your opposition to bank yourself as much SR as possible.\n| Call of Duty: Warzone – Lockdown Mode Explained | Call of Duty: Warzone – What is the Specialist Perk Package?\n| Call of Duty: Warzone – What is the Utility Box Field Upgrade?\n| Call of Duty: Modern Warfare 3 – Minefield Mode Explained | Call of Duty: Warzone – All Urzikstan Nuke Rewards | Call of Duty: Warzone – How to get a Nuke and Complete the Champion’s Quest in Urzikstan |Modern Warfare 3 Season 4 Ranked Play rewardsHere are the all the Modern Warfare 3 Season 4 competitor goodies."}, {"id": "54ad20c5-2bf4-4aec-a64b-3688d4d76812", "title": "Crestview World War II reenactors plan 80th anniversary observance for 2025", "date": "2024-05-30 04:30", "url": "https://www.yahoo.com/news/crestview-world-war-ii-reenactors-021641072.html", "message": "CRESTVIEW, Fla. (WKRG) — World War II reenactors are already planning how Crestview will observe the 80th anniversary of the end of World War II in Europe, and they decided on an event.\nThe event commemorating the 80th anniversary of the end of World War II is will be called “Race to Rhein: Victory in Europe.” It is scheduled for April 4 and April 5, 2025, according to a press release.\nWith education as a goal, April 4 will be student and Veterans Day with guided tours for classes and groups.\n“We have no tolerance for ‘farb’ by our reenactors,” Event Organizer Andrew Daigle said.\nFor the latest news, weather, sports, and streaming video, head to WKRG News 5."}, {"id": "4658bfd9-8683-4780-b064-845b42b94470", "title": "Israel says it expects to continue war in Gaza for another 7 months", "date": "2024-05-30 01:00", "url": "https://www.kenyan-post.com/2024/05/israel-says-it-expects-to-continue-war.html", "message": "Wednesday, May 29, 2024 - Israel's head of national Security Council has said the country expects \"another seven months of fighting\" in Gaza to achieve the objective of destroying Hamas.\nThe war has elicited strong reactions worldwide, with more European countries now recognizing the state of Palestine and the International Criminal Court charging Israeli Prime Minister for war crimes.\n\"It is built on a staged basis, with the year 2024 defined as a year of combat.\nThis resilience is what has allowed this nation to survive for 75 years, and even for 3,000 years before that.\nJust don't use a stopwatch on ourselves or set ultimatums,\" he said."}, {"id": "569379ca-87a7-4e25-810d-d3a126bf590d", "title": "Call of Duty Crossover With Fallout Leaks Early", "date": "2024-05-30 03:30", "url": "https://www.kotaku.com.au/2024/05/call-of-dutys-crossover-with-fallout-leaks-early/", "message": "Unsurprisingly, some players have already started datamining it, and in so doing, have found what appears to be the first in-game look at an upcoming, still-unannounced Fallout crossover.\nThe image shows four Call of Duty characters, including Ghost and Price, wearing Fallout 4-style blue and gold Vault outfits.\nThe characters in the promo image are also sporting PipBoy computers on their wrists, and one soldier has a Vault-Tec assault rifle skin, too.\nThe promo image lists the outfits and cosmetic items as being part of a “Fallout: Vault Dweller” pack.\nOf course, until Activision or Bethesda officially announces a Fallout X Call of Duty crossover, this isn’t confirmed."}, {"id": "d5211026-5af5-44e9-a2e5-c2ad1d63d8bb", "title": "IDF Announces Death Of Two Soldiers In West Bank Car Ramming Attack , One In Gaza Fighting", "date": "2024-05-30 09:30", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-idf-announces-death-of-two-soldiers-in-west-bank-one-in-gaza", "message": "Eliya Hilel, 20 from Tel Zion, and Staff Sergeant Diego Shvisha Harsaj, 20 from Tel Aviv, were severely injured in a car-ramming attack near Shechem.\nYedidya Azugi, 20 from the settlement of Revava, fell in a battle in the north of the Gaza Strip.\nThe death toll in the Gaza Strip since the start of the ground offensive now stands at 287.\nIDF spokespersonSergeant Yedidia Azugi, 21, from the settlement of Revava, a fighter in the 101st Battalion, Paratroopers Brigade, fell in battle in the north of the Gaza Strip.\nThe entire Revava settlement is in deep mourning."}, {"id": "1ad74937-94ed-4383-bade-5a6ba4158930", "title": "Poland bolsters border with Belarus after migrant stabs solider :  Hybrid warfare  ", "date": "2024-05-30 03:30", "url": "https://wjla.com/news/nation-world/poland-bolsters-belarus-border-after-migrant-stabs-solider-hybrid-warfare-european-union-border-security-russia-putin-ukraine-war-eastern-europe-united-nations-donald-tusk-", "message": "Poland will fortify its border with Belarus after a migrant stabbed a Polish soldier on Tuesday, according to the .\nThe migrant reached through the barrier to stab the soldier in the ribs, according to the Associated Press report.\nA 2021 U.S. Congressional Research Service suggested Belarus tried to create chaos and violence at its border with Poland to use in anti-European Union propaganda.\nFormer Polish Prime Minister Mateusz Morawiecki claimed Belarus was attacking Poland, according to the report.\nLast year, he warned Poland that any attack on Belarus would represent an attack on Russia."}, {"id": "b3b80105-9b3f-4279-ba13-820d182cd9f1", "title": "Asymmetrical Warfare | The Jewish Press - JewishPress . com | Michael Krampner | 22 Iyyar 5784 – Thursday , May 30 , 2024", "date": "2024-05-30 03:45", "url": "https://www.jewishpress.com/indepth/opinions/asymmetrical-warfare/2024/05/30/", "message": "Photo Credit: 123rf.comWhen asymmetrical warfare is discussed, the focus is usually what happens on the battlefield.\nBut I want to discuss some other aspects of the asymmetries – the inequalities – in the current Gaza/Hamas war against Israel.\nThere are only approximately seventeen million Jews in the world today and only one Jewish majority country.\nIf Israel had that result, it would be the end of the almost constant warfare that Israel has suffered these last seventy-six years.\nDifferent authorities in the field give different reasons for Arab and Muslim hatred of Jews and the little Jewish state (which Arabs and others try to disguise as “anti-Zionism”)."}, {"id": "9a53d40e-b616-4103-8398-9a7258ed14c6", "title": "  He died for our country : Buffalo WWII Navy sailor sunken submarine located", "date": "2024-05-30 02:15", "url": "https://www.wkbw.com/news/local-news/he-died-for-our-country-buffalo-wwii-navy-sailors-sunken-submarine-located-after-80-years-missing", "message": "TOWN OF NIAGARA, N.Y. — A World War II Navy veteran from Buffalo was lost at sea when his crew’s submarine sank in battle.\nAfter 80 years lost to the bottom of the ocean, that local sailor’s ship has been found.\n“We wish he was still here, so we could talk to him, but that obviously wasn’t going to happen,” Dallessandro’s nephew Donald Mullen said.\nDallessandro, a Buffalo native, was a torpedoman's mate in the U.S. Navy, sailing aboard the USS Harder submarine.\n“I just couldn’t believe it, that’s 80 years ago,” another one of Dallessandro’s nephews, James Mullen, said."}, {"id": "81ed9d7e-a165-415f-aef8-e7065583fb36", "title": "Shin Megami Tensei V : Vengeance The Ultimate Beginning trailer", "date": "2024-05-30 03:00", "url": "https://nintendoeverything.com/shin-megami-tensei-v-vengeance-the-ultimate-beginning-trailer/", "message": "Atlus just published a new video for Shin Megami Tensei V: Vengeance titled “The Ultimate Beginning”.\nMassively expanded with new areas, demons, and music, Shin Megami Tensei V: Vengeance features more accessible gameplay, an improved battle system, new demon experiences, and greater field exploration.\nExperience a brand-new tale of revenge by the fallen or the original story of Shin Megami Tensei V, both filled with conflicting and tragic choices, forcing you to confront which ideologies you are willing to fight for.\nGet a look at the Shin Megami Tensei V: Vengeance “The Ultimate Beginning” trailer below.\nThe Ultimate Beginning TrailerShin Megami Tensei V: Vengeance will be out for Switch on June 14, 2024."}, {"id": "c9cfb47c-43e0-4eae-bb13-5c5d39b8cb39", "title": "Israeli national security adviser predicts war in Gaza will last to the end of the year", "date": "2024-05-30 05:00", "url": "https://www.jta.org/2024/05/29/politics/israeli-national-security-adviser-predicts-war-will-last-to-the-end-of-the-year", "message": "(JTA) — Tzachi Hanegbi, the national security adviser to Israeli Prime Minister Benjamin Netanyahu, predicted that Israel’s war with Hamas would last until the end of the year, raising the specter of further bloodshed in what would be one of Israel’s longest wars.\nThe war continuing until January would also increase tension with the Biden administration, which is pressing for a ceasefire.\nThe Biden administration has been seeking a temporary ceasefire that it hopes could lead to a more permanent end to hostilities..\nJohn Kirby, the spokesman for the White House National Security Council, declined in a call with reporters to comment on Israel’s war plans, but said the White House favored a resolution sooner rather than later.\nWe’ve got to get them home.”He said the hope was that a temporary ceasefire could become long-lasting."}, {"id": "6a53f087-ec60-49d4-94ae-5a26df928a03", "title": "nelson - peltz - sells - disney - stock", "date": "2024-05-30 03:45", "url": "https://www.thewrap.com/nelson-peltz-sells-his-entire-1-billion-stake-in-disney-after-losing-proxy-battle-cnbc-reports/", "message": "Nelson Peltz has sold all of his shares in Disney, just weeks after his attempt to place himself and former Disney finance chief Jay Rasulo to the company’s board via a proxy battle waged by his company Trian Fund Management and Blackwells Capital, was resoundingly defeated.\nCNBC reported Wednesday that Peltz sold his stock at approximately $120 a share, higher than the company’s current price per share of approximately $101.00.\nIn mounting his challenge to the company board, Peltz cited business concerns such, including the lack of a succession plan for CEO Bob Iger, as well as the rough patch the company has had since 2020.\nIger won 94% of the vote, while Peltz came away with 31%.\nTrian dropped its first battle against the company in February 2023 after it said Disney made “plans to do everything we wanted them to do.”"}, {"id": "11ed70d9-6385-4b7e-8558-a6d296a680d3", "title": "Trudeau must more publicly support ICC decisions : ex - ministers", "date": "2024-05-30 05:00", "url": "https://www.cp24.com/news/trudeau-must-more-publicly-support-icc-decisions-amid-israel-hamas-war-ex-ministers-1.6906057", "message": "\"That is a racist, dehumanizing and discriminatory approach to international justice which Canada cannot countenance in any way.\"\nThe ICC's chief prosecutor requested arrest warrants last week for Israeli Prime Minister Benjamin Netanyahu and his defence minister, as well as three senior Hamas leaders.\nJoly has recently avoided saying whether Canada would arrest Israeli officials if they did end up subject to an international arrest warrant and visited Canada.\n\"Strong support is vital at this time given that the prosecutor, ICC staff and the ICC as an institution are facing considerable political pressure, unfounded and inflammatory criticism (and) attacks on the Court’s independence,\" the letter reads.\nThe ICC prosecutor says Israel has been starving civilians as a method of warfare and intentionally directing attacks against civilians, which are war crimes."}, {"id": "0e95cee5-0845-450a-b025-1f5752d08ff3", "title": "Deaths of 3 more soldiers : 2 killed in West Bank car - ramming attack , 1 fell in battle", "date": "2024-05-30 07:15", "url": "https://www.ynetnews.com/article/b17hg5h4c", "message": "The IDF spokesman announced on Thursday morning the deaths of three IDF soldiers.\nYedidya Azugi, 21, from Revava, of the Paratrooper Brigade’s 101st Battalion, was killed in battle in the northern Gaza Strip.\nSince October 7, 642 IDF soldiers have been killed, including 291 in Gaza ground operation.\n1 View gallery Staff Sgt.\nAzugi, who fell in the northern Gaza Strip, lived in the West Bank settlement of Revava."}, {"id": "3d5a16d5-00d6-41a0-92e4-e7d99b10915f", "title": "Jake Paul has insisted his fight with Mike Tyson is still happening despite the boxing legend health scare . - 30 - May - 2024", "date": "2024-05-30 03:00", "url": "https://home.nzcity.co.nz/news/article.aspx?id=399316&fm=psp,tst", "message": "Jake Paul has insisted his fight with Mike Tyson is still happening despite the boxing legend's health scare.\nTyson's rep told People magazine in a statement: \"He is appreciative to the medical staff that were there to help him.\"\nHe previously said: \"I'm very much looking forward to stepping into the ring with Jake Paul at the AT and T Stadium in Arlington, Texas.\nJake recently described facing Mike as the \"ultimate test of warfare\".\n\"This is my ultimate test of warfare and that excites me.\""}, {"id": "9476f69d-b2e9-4b14-8334-bddf7e872c8e", "title": "S Korea accuses North of sending balloons with excrement across border", "date": "2024-05-30 02:30", "url": "https://japantoday.com/category/world/s.korea-accuses-north-of-sending-balloons-with-excrement-across-border", "message": "Yonhap via REUTERS/File photoBy Jack KimSouth Korea accused North Korea on Wednesday of sending a large number of balloons across their heavily fortified border to drop objects including trash and excrement, calling the act base and dangerous.\nPhotographs released by the South Korean military showed inflated balloons with plastic bags tethered to them.\nBalloons have regularly been sent the other way by South Korean activists, often led by North Korean defectors.\nNorth Korea also attempted to jam GPS signals in South Korea on early Wednesday morning, although no damage was reported, the Donga Ilbo newspaper said, citing multiple unnamed government sources.\nThe two Koreas' large militaries face off across the military border and North Korea routinely threatens to annihilate its neighbor."}, {"id": "c3ff40d5-84e0-456d-a2d3-f3619c214055", "title": " [ Bradford DeLong ] The threat of Trumpflation and a Fed war", "date": "2024-05-30 01:15", "url": "https://www.koreaherald.com/view.php?ud=20240529050716", "message": "In fact, the Bank War ultimately brought financial disruption, commercial bankruptcies, and deflation, thus destroying some share of national wealth and shifting the rest from entrepreneurial debtors to already-rich creditors.\nShould Trump return to the White House and launch a Fed War, the effect would be as economically damaging as Jackson’s Bank War.\nBut, like the Bank War, the effort would probably be popular with his base.\nFed governors and bank presidents who do not feel like spending $5,000 a day on security might be induced to resign.\nJ. Bradford DeLongJ. Bradford DeLong, a former deputy assistant US Treasury secretary, is a professor of economics at the University of California, Berkeley."}, {"id": "ecd06c22-8448-488e-864b-4cec1edf47ef", "title": "How America inadvertently created an  axis of evasion  led by China", "date": "2024-05-30 07:45", "url": "https://www.livemint.com/politics/how-america-inadvertently-created-an-axis-of-evasion-led-by-china-11717053847378.html", "message": "They have inadvertently birthed a global shadow economy tying together democracy’s chief foes, with Washington’s primary adversary, China, at the center.\nUnprecedented finance and trade restrictions on Russia, Iran, Venezuela, North Korea, China and other authoritarian regimes have squeezed those economies by curbing access to Western goods and markets.\nBut Beijing has increasingly foiled those U.S.-led efforts by bolstering trade ties, according to Western officials and customs data.\n“China carries out normal economic and trade exchanges with relevant countries on the basis of equality and mutual benefit,\" he said.\nThe governments of Russia, Iran, Venezuela and North Korea, contacted through their diplomatic offices in the U.S., didn’t respond to requests for comment."}, {"id": "f1298b8b-09ee-4d3b-8f68-af0cadc2df61", "title": "Taiwan says China is  nibbling away  at its space , trying to create a new normal", "date": "2024-05-30 03:00", "url": "https://www.yahoo.com/news/taiwan-says-china-nibbling-away-024047925.html", "message": "China's military says Taiwan drills met goals but it is ready for further actionA screen shows news footage of military drills conducted in areas around the island of Taiwan by the Eastern Theatre Command of the PLA in BeijingBy Laurie Chen and Ben BlanchardBEIJING/TAIPEI (Reuters) - China's military achieved its \"expected goals\" during two days of drills around Taiwan last week but is prepared for further action if provoked, a defence ministry spokesperson said on Thursday.\nWhile the drills have formally ended, China's military activities have not, with Taiwan saying on Wednesday that Chinese warplanes and warships carried out a \"joint combat readiness patrol\".\n\"The Chinese communists' pressure on Taiwan is all encompassing, especially diplomatically,\" Foreign Minister Lin Chia-lung told reporters at parliament.\nChinese pressure keeps Taiwan out of most international bodies.\n\"The Chinese communists are continuing to change the status quo,\" he said."}, {"id": "175e1ffa-5a68-4f7b-be48-1cd0858cc8be", "title": "Montrose Coastguard station moves from erosion - hit seafront", "date": "2024-05-30 06:00", "url": "https://www.thecourier.co.uk/fp/news/angus-mearns/4995221/montrose-coastguard-station-relocates/", "message": "Montrose Coastguard team has set up a new permanent base after storm damage forced it from the rapidly-shrinking town seafront.\nAnd sections of the seafront eventually fell “like a pack of cards” during further severe weather and high tides.\nBut the damage led to the road outside the Coastguard station being closed for weeks.\nThe lifesaving team relocated temporarily to Montrose fire station.\n“The new facility has ample garage space for rescue vehicles and the maintenance of vital rescue equipment."}, {"id": "58469a47-292e-4a23-9e80-c25df00848e8", "title": "Ditching deportation deal a concern for New Zealand", "date": "2024-05-30 09:15", "url": "https://www.smh.com.au/politics/federal/ditching-deportation-deal-a-concern-for-new-zealand-20240530-p5jhwy.html", "message": "The moon that night set about an hour and a half before daylight.\nThis just gave time for the warships and transports of the covering force to steam in and land the troops before dawn.”Charles Bean, the Herald’s first war correspondent.\nLoadingAs the beleaguered Immigration Minister Andrew Giles scrambles to rewrite laws to make it easier to deport them, New Zealand does not want Australia to send Kiwi criminals with little connection to the country across the Tasman.\n“We accept that Australia has the right to determine what level of offending by non-citizens is unacceptable,” New Zealand Foreign Minister Winston Peters said in a statement.\n“But we do not want to see deportation of people with little or no connection to New Zealand, whose formative experiences were nearly all in Australia.”"}, {"id": "f4e9078f-6adc-462f-8dd8-dbd9f547a274", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 10:30", "url": "https://www.newsday.com/news/nation/Andy-Negra-World-War-II-DDay-s81979", "message": "SERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nHe recalled being on the road with the 6th Armored Division, part of a push to retake the French port city of Brest, when his column was strafed by five German planes."}, {"id": "a5c0cb6d-008a-4d66-8abf-b1d6436ddd78", "title": "Belarus halts participation in European military treaty", "date": "2024-05-30 07:15", "url": "https://www.thehindu.com/news/international/belarus-halts-participation-in-european-military-treaty/article68228601.ece", "message": "President Alexander Lukashenko has signed a decree suspending Belarus' participation in a treaty that limits the deployment of conventional forces in Europe, matching a move already taken by ally Russia.\nAlthough not directly involved in the conflict in Ukraine, Belarus hosted Russian troops as Moscow readied to launch its special military operation against Kyiv in February 2022.\nIt said it was doing so after Western countries and NATO members refused to ratify a new version of the treaty that was amended in 1999.\nIn 2008, Russia sent troops into the Georgian regions of Abkhazia and South Ossetia.\nRussian President Vladimir Putin officially rubber stamped Russia's exit from the treaty in May 2023."}, {"id": "56def2e7-f34d-40c2-8173-a65f550b5e08", "title": "1 arrest after pro - Palestinian protesters block UBC intersection", "date": "2024-05-30 00:00", "url": "https://www.cbc.ca/news/canada/british-columbia/ubc-pro-palestinian-protest-1.7218456", "message": "On Wednesday morning the protesters moved to the road, with about 100 of them blocking the intersection of University Boulevard and Wesbrook Mall, about 250 metres east of the camp.\n\"Despite attempts to facilitate communication with protesters, police action was required to clear the intersection.\"\nA statement from UBC issued on Wednesday afternoon says classes, graduations and other events are proceeding as scheduled.\n\"Any protest actions must be conducted with respect for others and within the boundaries of UBC policy and the law.\"\nPolice block pro-Palestinian protesters from entering an area with recent graduates at the University of British Columbia in Vancouver."}, {"id": "3ee1a846-d8be-420a-b190-3dd132731c21", "title": "Comic Review - It the Calm Before the Storm ( But Not Really ) in  Star Wars : The High Republic Adventures  ( 2023 ) # 6", "date": "2024-05-30 03:30", "url": "https://www.laughingplace.com/w/disney-entertainment/star-wars-high-republic-adventures-2023-6-comic-review/", "message": "Today saw the release of issue #6 in Phase III of Star Wars: The High Republic Adventures from Dark Horse Comics, and below are my brief recap and thoughts on this installment.\nThere, Lula Talisola, Zeen Mrala, and their Jedi friends have taken a bit of shore leave after the space-prison-break events of the past few issues.\nThis immediately makes me wonder how– or if, I suppose– this decision will be squared with the events of an upcoming The High Republic novel, but that’s not out yet so I won’t say why in this review.\nSo it seems like even though she’s leaving the Order, she and Zeen are going to stick around and help out anyway?\nStar Wars: The High Republic Adventures #6 is available now wherever comic books are sold."}, {"id": "6d9f816c-ac3d-40c5-b2c2-b3e674467368", "title": "11  Bad  Games Well Die Defending", "date": "2024-05-30 03:30", "url": "https://www.kotaku.com.au/2024/05/11-bad-games-well-die-defending/", "message": "Final Fantasy XIII | Final Fantasy XIII-2 | Lightning Returns: Final Fantasy XIIIImage: Square EnixInitially, this was going to be an entry for the original Final Fantasy XIII, but actually, it’s an entry for the entire XIII trilogy, because it all whips.\nBut its sequels, Final Fantasy XIII-2 and Lightning Returns: Final Fantasy XIII are also really great.\nSome might even say Lightning Returns’ Majora’s Mask-style end-of-the-world time management makes for the best single-player Final Fantasy entry since the Final Fantasy X duology.\nZelda II: The Adventure of LinkImage: NintendoI’ve spent a lifetime hearing folks malign Zelda II: The Adventure of Link as “objectively the worst Zelda game” or making other similarly denigrating statements.\nZelda II is both a great game in its own right and one of the best Zelda games."}, {"id": "86d5c8ec-72d6-4821-b50a-84874998f201", "title": "Wichita U . S . Army Veteran built bridges during Vietnam", "date": "2024-05-30 03:15", "url": "https://www.yahoo.com/news/wichita-u-army-veteran-built-010000923.html", "message": "WICHITA, Kan. (KSNW) — Vernon Brooks was drafted while he was attending high school at Sedgwick.\nLike, we done construction of bridges like rope bridges, cable bridges, and log bridges to get our men and supplies across in our training and under fire,” said Brooks.\nHe trained and worked on building different kinds of bridges at the Army base for his entire two-year enlistment.\nU.S. Army Iraq War Veteran struggles with nightmares and PTSD“Well, if you love the country, it’s the thing to do.\nIf you want to nominate a veteran for our Veteran Salute, email KSN reporter Jason Lamb at jason.lamb@ksn.com."}, {"id": "d25726a3-c970-4215-be8a-ddb576b57a8a", "title": "  Am I too fat to ride a horse ? - Horsetalk . co . nz", "date": "2024-05-30 04:00", "url": "https://horsetalk.co.nz/2015/08/18/too-fat-ride-horse/", "message": "This would mean 80 percent of the people riding horses today are too fat!\nAccording to The US Cavalry Manual of Horse Management (1941) a horse should not carry more than 20 percent of its own weight.\nFor most of the 5000 years men have been riding horses they have used them to go places to kill each other.\nAdd this to 200lb of an average armed warrior and the Roman warhorse carried 300lb, well over 30 percent of horse weight.\nBayard Fox, the owner of Equitours, sends people to dozens of countries to ride horses – but he has a weight limit of 200lb."}, {"id": "20f0c8ae-e052-4e12-a345-9d864ec98b26", "title": "Palantir Wins $480 Million AI Computer Vision Deal With US Army", "date": "2024-05-30 01:30", "url": "https://www.bnnbloomberg.ca/palantir-wins-480-million-ai-computer-vision-deal-with-us-army-1.2078871", "message": "(Bloomberg) -- The US Army awarded a $480 million contract to Palantir Technologies Inc. for work on a project called the Maven Smart System through 2029.\nThe Maven deal was disclosed Wednesday as part of the Defense Department’s daily contract announcements.\nThe deal further extends Palantir’s relationship with the military, and makes use of the company’s growing suite of artificial intelligence offerings.\nThe Maven project uses AI and computer vision to help soldiers more quickly and accurately identify targets.\nAs more companies have demanded AI tools, Palantir has expanded its commercial business, though government revenue still makes up the majority of sales."}, {"id": "4597658f-49aa-4695-92ed-54c21d37b62e", "title": "Splatoon 3 update announced ( version 8 . 0 . 0 ), patch notes", "date": "2024-05-30 03:00", "url": "https://nintendoeverything.com/splatoon-3-update-announced-version-8-0-0-patch-notes/", "message": "Splatoon 3 is gearing up for its next big update, which will be version 8.0.0.\nStage Change Details Barnacle & Dime Changed terrain in all modes to increase routes into the center and options for strategic points.\nHammerhead Bridge Changed terrain in all modes to increase routes into the center and options for strategic points.\nChanged the shape of walls surrounding the center in the following modes: Splat Zones Rainmaker Um’ami Ruins Changed terrain in all modes.\nCrableg Capital Slightly changed terrain in the following modes: Turf War Splat Zones Bluefin Depot Slightly changed terrain in Clam Blitz mode."}, {"id": "91425bb6-9f65-4bed-afb4-56dfcbd2b190", "title": "New Zealand Defence Force disposes of World War II - era mortar bomb in Whanganui", "date": "2024-05-30 00:00", "url": "https://www.nzherald.co.nz/whanganui-chronicle/news/new-zealand-defence-force-disposes-of-world-war-ii-era-mortar-bomb-in-whanganui/B2YCZ6TRTRFP5BNPCVAPXZHMOA/", "message": "Kyle Dalton said Landguard Bluff had been used for well over a century for army exercises.\nPhoto / Bevan ConleyKyle Dalton said Landguard Bluff had been used for well over a century for army exercises.\nPhoto / Bevan ConleyA three-inch drill mortar bomb found by the New Zealand Defence Force (NZDF) on Landguard Rd in Whanganui came from Word War II-era training exercises.\n“The mortar was replaced by the L16 81mm mortar in the 1960s but was likely used in training until the mid-1980s.\n“Three-inch mortars were used between the 1930s and 1960s, and obviously, out at Landguard Bluff, they used to hold a lot of training [sessions] there."}, {"id": "d2510744-37c6-414b-ba1d-beab24e76fe8", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . – Winnipeg Free Press", "date": "2024-05-30 04:45", "url": "https://www.winnipegfreepress.com/world/2024/05/29/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world", "message": "SERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\nWorld War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\n(AP Photo/Sharon Johnson)“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division."}, {"id": "a7fb5309-30c2-4cab-aa36-dc189d3b62b7", "title": "Splatoon 3 Receives A Fresh New Update ( Version 8 . 0 . 0 ), Here Are The Full Patch Notes", "date": "2024-05-30 04:15", "url": "https://www.nintendolife.com/news/2024/05/splatoon-3-receives-a-fresh-new-update-version-8-0-0-here-are-the-full-patch-notes", "message": "Nintendo has announced its next major update for Splatoon 3, bumping the Switch title up to Version 8.0.0.\nStage Change Details Barnacle & Dime Changed terrain in all modes to increase routes into the center and options for strategic points.\nHammerhead Bridge Changed terrain in all modes to increase routes into the center and options for strategic points.\nChanged the shape of walls surrounding the center in the following modes: Splat Zones Rainmaker Um'ami Ruins Changed terrain in all modes.\nCrableg Capital Slightly changed terrain in the following modes: Turf War Splat Zones Bluefin Depot Slightly changed terrain in Clam Blitz mode."}, {"id": "0316c18b-3c6f-4db0-b099-c4430de8cba4", "title": "Taiwan says China is  nibbling away  at its space , trying to create a new normal", "date": "2024-05-30 04:00", "url": "https://www.thestandard.com.hk/breaking-news/section/3/216887/Taiwan-says-China-is-", "message": "Taiwan says China is 'nibbling away' at its space, trying to create a new normalChina is trying to \"nibble away\" at Taiwan's space and create a new normal with its military drills and other moves to exert pressure, which is a matter for global concern, Taiwanese Foreign Minister Lin Chia-lung said on Thursday.\n\"The Chinese communists' pressure on Taiwan is all encompassing, especially diplomatically,\" Lin told reporters at parliament before taking lawmaker questions.\nChinese pressure keeps Taiwan out of most international bodies.\n\"The Chinese communists are continuing to change the status quo,\" he said.\n\"They are creating a new normal, pressing on at every stage, trying to nibble away and annex (us).\""}, {"id": "10941ebe-f485-478b-8ad9-564f3f2d1121", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 04:45", "url": "https://www.yahoo.com/news/100-vet-says-greatest-generation-041238567.html", "message": "At 100, this vet says the 'greatest generation' moniker fits 'because we saved the world.'\nWorld War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school."}, {"id": "fd811f3a-e441-4b65-8707-5f692722a730", "title": "Gripen E testing set to ramp up ahead of deliveries to Swedish air force", "date": "2024-05-30 08:00", "url": "https://www.flightglobal.com/defence/gripen-e-testing-set-to-ramp-up-ahead-of-deliveries-to-swedish-air-force/158535.article", "message": "Activities to date have included general performance and sensor testing, along with supporting pilot training for the Swedish air force.\nOther current focus areas for Saab’s Gripen E flight-test programme include weapons integration tasks.\nSeven Gripen Es are already in squadron service with the Brazilian air force at Anapolis air base, with one test aircraft also in use in the country.\nThe nation’s air force will take eight examples, along with 28 single-seat Es, with the first F to be delivered next year for flight testing.\n“The [Hungarian] air force is extremely happy with the Gripen,” notes deputy head of sales and marketing Richard Smith."}, {"id": "dd8663e8-8fe2-47d1-a862-3252cd26243e", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 05:15", "url": "https://www.ksat.com/news/2024/05/30/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nRecommended VideosSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else."}, {"id": "cfb1645c-f263-4750-a35a-34436c3c9091", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 06:00", "url": "https://www.local10.com/news/2024/05/30/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nRecommended VideosSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else."}, {"id": "69423be5-797b-437a-8b8b-8d70a0d996b5", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 07:45", "url": "https://www.news4jax.com/news/2024/05/30/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\nRecommended VideosSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else."}, {"id": "3776f840-cc29-4de6-a5b4-a07dfb24b2fa", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . – Metro US", "date": "2024-05-30 08:45", "url": "https://www.metro.us/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\nSERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n“There was a war going on, so I went along with everybody else."}, {"id": "0a75b8ac-a111-49a2-861c-538681e86335", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 07:15", "url": "https://gazette.com/ap/national/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/article_1ab2ee9e-8b89-5a92-b747-073caeb8332c.html", "message": "At 100, this vet says the 'greatest generation' moniker fits 'because we saved the world.'\nAndy Negra Jr_ proudly lays claim to being among the last of what is known as “The Greatest Generation.”"}, {"id": "17072dd3-f37c-4ea7-85e0-e8117aab1ac6", "title": "Deadline", "date": "2024-05-30 03:15", "url": "https://deadline.com/print-article/1235944326/", "message": "Nelson Peltz may have lost the battle with Disney, but in strict financial terms may have won the war.\nMultiple media outlets, citing an unidentified source familiar with the transaction reported that Peltz’s firm, Trian Fund Management, unloaded its entire stake in Disney.\nA rep from Trian declined to comment when contacted by Deadline.\nThe profit from the stock sale, which occurred as shares were at around $120, came to about $1 billion, reports said.\nDisney stock closed Wednesday at $100.88Peltz, who has waged successful battles against corporate behemoths like Procter & Gamble, came into the Disney clash already a billionaire."}, {"id": "e53bf30e-88e3-42d6-ae6a-5f0630cd84e6", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 05:45", "url": "https://www.news-gazette.com/news/nation-world/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/article_759e7e19-e1a0-5aa1-9062-ae42a1b496dc.html", "message": "At 100, this vet says the 'greatest generation' moniker fits 'because we saved the world.'\nAndy Negra Jr_ proudly lays claim to being among the last of what is known as “The Greatest Generation.”"}, {"id": "ab992843-5db9-428a-8627-5121eb4df0c3", "title": "Dominican Republic : The Coup That Became a War", "date": "2024-05-30 09:45", "url": "https://time.com/archive/6833716/dominican-republic-the-coup-that-became-a-war/", "message": "Twice before, General Wessin y Wessin, 40, had relied on his planes and tank-equipped supporting troops to settle political disputes in the Dominican Republic.\nAnd for help this time, he called on the U.S. Said Wessin y Wessin: “We saved the country by only a hair.\nMost often it was in the person of Wessin y Wessin.\nIn 1962, Wessin y Wessin helped stop the Armed Forces Secretary from overthrowing the seven-man civilian Council of State that administered the country after Trujillo.\nHe called Wessin y Wessin, who immediately agreed."}, {"id": "a0300f2c-d253-4d06-8688-42b1bc5e75a1", "title": "Chrishell Stause Is Officially Joining The Cast Of Neighbours", "date": "2024-05-30 01:00", "url": "https://www.pedestrian.tv/entertainment/chrishell-stause-neighbours-cast/", "message": "There is a tug-of-war that exists in every Australian’s conciousness, and it is a battle between the allure of Sesame Street and the high-stakes drama of Ramsay Street.\nUnfortunately for Elmo, everyone and their dog will now desire going and living amongst the Neighbours now that icon Chrishell Stause is joining the ranks.\nAnnounced this morning, Selling Sunset star Chrishell Stause will soon be bitch-slapping Karl Kennedy, cheating on Paul Robinson and resurrecting Rosemary Daniels on the set of Neighbours.\n“Chrishell Stause will bring glitz, glamour and LOTS of drama when she arrives in Erinsborough later this year.”Business CHIC (Source: Channel 10).\nWill G Flip make a random appearance on Ramsay Street?"}, {"id": "aa8720d7-dbf1-4196-936e-686e4504bcba", "title": "Battle of Chinese and Taiwanese Chatbots and a Balloon Battle Between the Koreas", "date": "2024-05-30 00:45", "url": "https://www.houstonpublicmedia.org/npr/2024/05/29/1196981303/battle-of-chinese-and-taiwanese-chatbots-and-a-balloon-battle-between-the-koreas/", "message": "NPRBattle of Chinese and Taiwanese Chatbots and a Balloon Battle Between the KoreasTaiwan has developed a large language model artificial intelligence chat bot to compete with a product from China because of fears regarding national security.\nAnd North Korea sends garbage-filled balloons over the border into South Korea, escalating a long-standing balloon battle between the Koreas.\nSign up for State of the World+ to listen sponsor-free and support the work of NPR journalists.\nVisit plus.npr.org."}, {"id": "225cfe08-7646-4170-8257-0648f87adf24", "title": "Remembering Hattie B . Dorsey : Atlanta civil rights , equitable housing leader", "date": "2024-05-30 01:30", "url": "https://www.fox5atlanta.com/news/remembering-hattie-b-dorsey-atlanta-civil-rights-equitable-housing-leader", "message": "articleAtlanta is mourning the passing of civil rights activist and community development leader Hattie B. Dorsey.\n\"Hattie supported me as a city council candidate and mayoral candidate, and we talked all the time about our favorite topic: affordable housing.\nHattie B. Dorsey’s early life and educationDorsey grew up witnessing the struggles associated with inadequate housing and economic disparities.\nIn Atlanta, Dorsey continued her education at David T. Howard High School.\nWhile Hattie B. Dorsey may not be a household name, her impact on affordable housing and community redevelopment is undeniable."}, {"id": "02aedb6f-f9fd-4b3b-9e32-f739df3289b2", "title": "Cleared for publication : Two soldiers murdered in attack near Shechem", "date": "2024-05-30 03:45", "url": "https://www.israelnationalnews.com/news/390786", "message": "The IDF Spokesperson's Unit on Thursday morning cleared for publication that two soldiers were murdered in the ramming attack near Shechem (Nablus) on Wednesday evening: Staff sergeant Eliya Hilel, 20, from Tel Zion, and Staff sergeant Diego Shvisha Harsaj, 20, from Tel Aviv.\nIn addition, the IDF confirmed that Staff sergeant Yedidya Azugi , 21, from Revava, fell in battle in the northern Gaza Strip.\nA soldier from the 101st Battalion of the Paratroopers Brigade was seriously injured in the battle in which Azugi fell.\nIn addition, two soldiers from the 601st Battalion were seriously injured in the battle in the southern Gaza Strip.\nAll the soldiers were evacuated to hospital for medical treatment and their families were notified."}, {"id": "b481fe6a-6718-410e-bb5b-1a3fc845804d", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 06:15", "url": "https://www.wfmz.com/news/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/article_9829ce9e-f750-5f23-bbf3-940c28dbb2a6.html", "message": "World War II veteran Andy Negra sits in his home in Helen, Ga, on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\n(AP Photo/Sharon Johnson)"}, {"id": "094347ab-6052-4f7e-b142-6fd708f941eb", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-05-30 05:00", "url": "https://www.tvguide.co.uk/schedule/93e198e4-a2ef-5017-84e3-a1519e0b1237/combat-dealers", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Thursday 30 May Share Add toCalendar +Hidden Heroes of D-Day Season 3 Episode 5 of 10 S Subtitles Audio DescriptionBruce Crompton uncovers plans for the D-Day invasion, experiences a bumpy landing in a Dakota aeroplane, and in France his passion hits new heights with a parachute jumpCombat Dealers airs on Discovery Channel HD at 9:00 AM, Thursday 30 May .\n(Subtitles, audio description.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual pageTopics Education ➝ Science ➝ Factual Topics Docu-soap"}, {"id": "b572c1cd-df2b-488c-9cd7-00d199e99e2e", "title": "What America Can Learn From Israel on the Battlefield", "date": "2024-05-30 05:30", "url": "https://www.frontpagemag.com/what-america-can-learn-from-israel-on-the-battlefield/", "message": "America has never successfully liberated and held territory from Islamic terrorists.\nAfter thousands dead in Afghanistan and Iraq: both countries are now controlled by Islamic terrorists.\nBut those successes pitted one group of Islamic terrorists against another.\nIslamic terrorists fighting warring gangs over territory are far preferable to terrorists building rockets and missiles.\nIn Afghanistan and Iraq, we used military force to achieve political and diplomatic aims, while Israel is using military force to achieve military aims."}, {"id": "d2687874-201d-49fc-b1c7-abffba3b8885", "title": "Israel says offensive in Gaza could last for seven months", "date": "2024-05-30 00:00", "url": "https://www.pasadenastarnews.com/2024/05/29/israel-says-offensive-in-gaza-could-last-for-seven-months/", "message": "Israel says the corridor is awash in tunnels that have funneled weapons and other goods for Hamas — despite a yearslong blockade imposed by Israel and Egypt.\nIt already has complained about Israel taking over the Rafah border crossing, the only crossing between Gaza and Egypt.\nAn Israeli military official said Israel had notified Egypt of the takeover.\nEgypt has repeatedly expressed concerns that the Israeli offensive could push Palestinians across the border — a scenario Egypt says is unacceptable.\nThe Israeli military official said Israel has also taken “tactical control” of Tel al-Sultan, a neighborhood on Rafah’s northwest edge."}, {"id": "8cbe78c6-6b1e-4ffd-910b-fc4986493f8f", "title": "Loran Smith : Alan Kinder returns to France for 80th anniversary of D - Day", "date": "2024-05-30 08:45", "url": "https://www.yahoo.com/news/loran-smith-alan-kinder-returns-081042434.html", "message": "Kinder is the guest of a patriotic nonprofit which is taking him and seven other Normandy veterans to France for the invasion anniversary celebration.\nThe most significant vignette in Kinder’s miliary career came later when Japan’s official and unconditional surrender came about Sept. 2, 1945.\n“We were all so grateful for the Japanese surrender.\nKinder, grew up on acreage near Bellevue, Washington, where he tended pigs, cows, and chickens.\nThis article originally appeared on Augusta Chronicle: Loran Smith: Alan Kinder was part of the D-Day invasion in France"}, {"id": "7f40ae61-5186-4f2e-b1c5-1ef1f97e9606", "title": "Putin purge of his top generals | The Spectator", "date": "2024-05-30 00:00", "url": "https://www.spectator.co.uk/article/putins-purge-of-his-top-generals/", "message": "More are likely to follow in what looks like a gathering purge by the Federal Security Service (FSB).\nBut could Putin’s purge hinder the war effort by throwing the military leadership into disarray at a time when Russia is seeking to take advantage of Kyiv’s munitions shortages?\nIt’s worth looking at the last major purge of Russian military top brass, undertaken by Stalin between 1937 and 1940.\nPutin’s purge will of course be less dramatic.\nBut with half the top brass covering their backsides and the other half seeking to denounce their way to the top, there is potential for much disruption in Putin’s war plans."}, {"id": "1dc1c8ad-b439-451b-946c-fef2562ebcdc", "title": "Vonn Bell , Jordan Battle rotating at safety ; Dax Hill working at cornerback", "date": "2024-05-30 01:45", "url": "https://www.cincyjungle.com/2024/5/29/24167140/vonn-bell-jordan-battle-safety-dax-hill-cornerback-bengals-otas", "message": "The Cincinnati Bengals secondary struggled at times in 2023, largely thanks to inexperience at the safety position.\nDax Hill struggled as Jessie Bates’ replacement, and Nick Scott was completely ineffective, eventually being replaced by rookie Jordan Battle.\nThe team focused on the safety position this offseason by signing Geno Stone and bringing Bell back to Cincinnati.\nAccording to Charlie Clifford, Bell was taking starting snaps at safety over Battle, and DJ Turner was taking snaps at starting outside corner opposite Cam Taylor-Britt ahead of Hill.\nAt the corner position, it should be no surprise that Turner is taking snaps over Hill."}, {"id": "70927788-5349-4b44-9dda-790807b98eba", "title": "Rose Festival Grand Floral Parade Grand Marshal Announced", "date": "2024-05-30 00:00", "url": "https://k103.iheart.com/content/2024-05-29-rose-festival-grand-floral-parade-grand-marshal-announced/", "message": "The Portland Rose Festival announced today the 2024 Grand Floral Parade Grand Marshal is Greg McKelvey, the prolific band director at Battle Ground High School.\n“Greg represents everything we love about the Rose Festival and Grand Floral Parade,” said Contesa Diaz-Nicolaidis, Rose Festival Board President.\nWe are so fortunate that Greg’s dedication to his students was matched in his dedication to sharing their talents with Portland and the world, for so many years.”Greg McKelvey is a Rose Festival legend, maybe the most prolific high school band director to participate in Rose Festival events over his decades-long career.\nThe Rose Festival is pleased to honor Greg as this year's Grand Floral Parade Grand Marshal, with gratitude and good wishes for his decades of dedication to music education and to his students.\nSource: Rose Festival"}, {"id": "49ef1d81-5ab1-4ff2-b3d0-c7358fdf5b43", "title": "Rose Festival Grand Floral Parade Grand Marshal Announced", "date": "2024-05-30 00:30", "url": "https://1059thebrew.iheart.com/content/2024-05-29-rose-festival-grand-floral-parade-grand-marshal-announced/", "message": "The Portland Rose Festival announced today the 2024 Grand Floral Parade Grand Marshal is Greg McKelvey, the prolific band director at Battle Ground High School.\n“Greg represents everything we love about the Rose Festival and Grand Floral Parade,” said Contesa Diaz-Nicolaidis, Rose Festival Board President.\nWe are so fortunate that Greg’s dedication to his students was matched in his dedication to sharing their talents with Portland and the world, for so many years.”Greg McKelvey is a Rose Festival legend, maybe the most prolific high school band director to participate in Rose Festival events over his decades-long career.\nThe Rose Festival is pleased to honor Greg as this year's Grand Floral Parade Grand Marshal, with gratitude and good wishes for his decades of dedication to music education and to his students.\nSource: Rose Festival"}, {"id": "5bb5eee6-4b8e-41fe-9a5c-3d61f39fc430", "title": "Clash of Ancient Warriors - Sky History", "date": "2024-05-30 08:45", "url": "https://www.tvguide.co.uk/schedule/26310aca-a5fb-503e-bdde-7a12f8f9723c/clash-of-ancient-warriors", "message": "Clash of Ancient WarriorsSky History 2:00 PM to 3:00 PM Thursday 30 May Share Add toCalendar +The Battle of Thermopylae Season 1 Episode 3 S SubtitlesThe Battle of Thermopylae, fought in 480 BC between the Achaemenid Persian Empire under Xerxes I and an alliance of Greek city-states led by Sparta under Leonidas I.\nThe Persians ultimately claimed victoryClash of Ancient Warriors airs on Sky History at 2:00 PM, Thursday 30 May .\n(Subtitles.)\nLearn more about Clash of Ancient Warriors and other education/science/factual topics on our factual page"}, {"id": "1dcd06ee-4f48-4a3a-81ea-ede1e059a3f7", "title": "In Mayurbhanj , it  Odisha ki beti  vs Naveen welfare schemes | India News", "date": "2024-05-30 01:45", "url": "https://timesofindia.indiatimes.com/india/in-mayurbhanj-its-odisha-ki-beti-vs-naveens-welfare-schemes/articleshow/110547914.cms", "message": "“Modi govt has honoured the tribal community by picking Mayurbhanj’s Murmu as President.\n“The CM has been working to take Odisha to a new height of development.\nIn the five elections from 1980 to 1996, it was with Congress.On the ground, opinions of locals present a mixed picture.\nRabindra Pattanayak, 65, an advocate based in Rairangpur, for instance, believes that President Murmu’s connection to Mayurbhanj is a major draw for voters.\nHowever, Saiba Murmu, 25, also from Rairangpur, lauds the BJD govt’s pro-poor and pro-tribal schemes."}, {"id": "241b9867-0b8d-486b-87f7-82f2bb01c538", "title": "At 100 , this vet says the  greatest generation  moniker fits  because we saved the world . ", "date": "2024-05-30 05:00", "url": "https://www.whec.com/national-world/at-100-this-vet-says-the-greatest-generation-moniker-fits-because-we-saved-the-world/", "message": "SERVICE: Army’s 128th Armored Field Artillery Battalion, 6th Armored Division.\n“BECAUSE WE SAVED THE WORLD”It was 1943, and Andrew “Andy” Negra Jr. had just finished high school.\n‘I need you.’ And, I was drafted.”World War II veteran Andy Negra sits in his home in Helen, Ga., on April 10, 2024.\nHe shows a photo of himself during his time with the Army's 128th Armored Field Artillery Battalion, 6th Armored Division.\n“There was a war going on, so I went along with everybody else."}, {"id": "b2f49c1f-1d0b-4245-b6bd-cfd4ea12b8f1", "title": "Evidence of cancer treatment found in 4 , 000 - year - old skull", "date": "2024-05-30 03:00", "url": "https://dunyanews.tv/en/WeirdNews/815138-Evidence-of-cancer-treatment-found-in-4,000-year-old-skull", "message": "Evidence of cancer treatment found in 4,000-year-old skullWeirdNews WeirdNews Evidence of cancer treatment found in 4,000-year-old skullThis is an extraordinary new perspective in our understanding of the history of medicineFollow on Published On: Thu, 30 May 2024 07:36:34 PKT(Web Desk) - An international team of researchers says it has found evidence of ancient Egyptians performing experimental treatments or medical explorations of human cancer more than 4,000 years ago.\nResearchers noted that the man had a tumor — they observed about 30 small round lesions scattered across his skull.\nThe Cancer History Project reports that the earliest description of human cancer dates back to Egypt from around 3000 BC.\nThe Greek physician Hippocrates (460-370 BC) is credited with first calling the disease cancer.\nThe female skull, meanwhile, showed bone destruction from a cancerous tumor and two healed lesions from injuries."}, {"id": "275d12b2-1c6d-4c5b-83c4-eca7a4fa2d21", "title": "Tekken 8 plus Mortal Kombat 1 and its Kombat Pack discounted to cheapest price ever in PlayStation Days of Play sale", "date": "2024-05-30 01:15", "url": "https://www.eventhubs.com/news/2024/may/29/play-sale-tekken-mk1/", "message": "PlayStation just launched its Days of Play sale, which includes some pretty sweet fighting game deals, to kick off the end of the school year and start of the Summer season.\nUnfortunately, said standard version and the Ultimate Edition remain their usual prices though this is also only the second time we've seen Tekken 8 go on sale now after launching back in January.\nThe other big pick up in this sale is Mortal Kombat 1 plus its Kombat Pack hitting the lowest prices the game and its DLC have have reached with both discounted a whopping 60%.\nNickelodeon All-Star Brawl 2 plus its Season Pass DLC are also included in the sale alongside Guilty Gear Strive with its first two seasons (though those still holding out for a Season 3 discount will need to keep waiting).\nYou can check out the full list of fighting games and DLC in the Days of Play sale below, which will go on until June 14."}, {"id": "db66770f-6934-4c3c-bf75-816f1e188093", "title": "San Francisco quietly removes  Appeal to Heaven  flag from outside City Hall after Alito flap", "date": "2024-05-30 01:00", "url": "https://www.foxnews.com/media/san-francisco-quietly-removes-appeal-heaven-flag-from-outside-city-hall-after-alito-flap", "message": "The city of San Francisco confirmed it had removed the \"Appeal to Heaven\" flag from outside City Hall over the weekend, just days after it was reported to have been flown outside a conservative Supreme Court justice's house.\nThe San Francisco Chronicle reported Wednesday that the Revolutionary War-era flag was taken down after 60 years in the Civic Center Plaza on Saturday.\nThe outlet reported that the Appeal to Heaven flag \"was among the original 18 raised by the city on June 14 — Flag Day — in 1964.\"\n\"The ‘Appeal to Heaven’ flag is part of our proud heritage of Faith and Freedom and every American should be proud to fly it,\" he concluded.\nSen. Sheldon Whitehouse, D-R.I., said on X that Alito’s \"Appeal to Heaven\" flag was a \"MAGA battle flag,\" in one instance."}, {"id": "c5fde1ce-8925-4a84-9b63-9c73e9088032", "title": "Call of Duty : Warzone - All Ranked Play Rewards | Season 4", "date": "2024-05-30 02:45", "url": "https://gameranx.com/features/id/499896/article/call-of-duty-warzone-all-ranked-play-rewards-season-4/", "message": "More Call of Duty guidesModern Warfare 3: All Ranked Play Rewards | Season 4 | MW3 and Warzone: How to Unlock the Kar98k | MW3 and Warzone: How to Unlock the Superi 46 | MW3 and Warzone: How to Unlock the JAK Harbinger Kit | Modern Warfare 3: How to get a DNA Bomb | Call of Duty: Modern Warfare 3 – How to Earn Weapon Prestige Camos | Call of Duty: Warzone – What is the Rebirth Infil Strikes Public Event?\n| Call of Duty: Warzone – Lockdown Mode Explained | Call of Duty: Warzone – What is the Specialist Perk Package?\n| Call of Duty: Warzone – What are Weapon Trade Stations?\n| Call of Duty: Warzone – What is the Utility Box Field Upgrade?\n| Call of Duty: Modern Warfare 3 – Minefield Mode Explained | Call of Duty: Warzone – All Urzikstan Nuke Rewards | Call of Duty: Warzone – How to get a Nuke and Complete the Champion’s Quest in Urzikstan |How high will you climb?"}]