[{"id": "af425d0e-4816-407f-9bf4-2e606750b3a5", "title": "Zelensky assassination plot : Ukraine arrests two officials for treason over alleged Russian plot", "date": "2024-05-07 13:45", "url": "https://edition.cnn.com/2024/05/07/europe/zelensky-assassination-plot-ukraine-russia-intl/", "message": "CNN —Ukraine has detained two security officials allegedly involved in a Russian plot to assassinate President Volodymyr Zelensky, which Kyiv’s state security service (SBU) said it foiled.\nThe prosecutor’s office said one of the suspects received two drones and ammunition from Russia’s state security service (FSB), which they intended to transfer to another accomplice to carry out an explosion.\nZelensky has reportedly faced several attempts on his life since Russia began its full-scale invasion of Ukraine in February 2022.\nA woman from the southern Ukrainian region of Mykolaiv was arrested in August 2023 in connection to a plot to assassinate Zelensky.\nThe SBU said it caught the woman “red-handed” as she tried “to pass intelligence to the invaders.”In April, a Polish man was accused of assisting another alleged Russian assassination plot against Zelensky."}, {"id": "9912c570-7c28-4230-a2f5-a9ede8e80ec5", "title": "Ukraine arrests two officials for treason over alleged Russian plot to kill Zelensky", "date": "2024-05-07 18:15", "url": "https://ktvz.com/news/national-world/cnn-world/2024/05/07/two-ukrainian-security-officials-detained-over-zelensky-assassination-plot/", "message": "(CNN) — Ukraine has detained two security officials allegedly involved in a Russian plot to assassinate President Volodymyr Zelensky, which Kyiv’s state security service (SBU) said it foiled.\nThe prosecutor’s office said one of the suspects received two drones and ammunition from Russia’s state security service (FSB), which they intended to transfer to another accomplice to carry out an explosion.\nZelensky has reportedly faced several attempts on his life since Russia began its full-scale invasion of Ukraine in February 2022.\nA woman from the southern Ukrainian region of Mykolaiv was arrested in August 2023 in connection to a plot to assassinate Zelensky.\nThe SBU said it caught the woman “red-handed” as she tried “to pass intelligence to the invaders.”In April, a Polish man was accused of assisting another alleged Russian assassination plot against Zelensky."}, {"id": "3bce225c-2fa8-4db3-ac63-af3a9cd44c6b", "title": "Debunking the Argument for Columbia Journalism School Terrorist Propagandist Memorial", "date": "2024-05-07 21:15", "url": "https://www.meforum.org/65874/debunking-the-argument-for-columbia-journalism", "message": "That line of justification occupies extreme fringes of mainstream academia counterterrorism, military, and law enforcement thinking worldwide, notably in the United States.\nHomeland Security and presidents on both sides of the aisle regard propagandists for designated terrorist groups like ISIS and Al Qaeda as dangerous enough to assassinate abroad with Hellfire missiles.\nInside the United States, the establishment prosecutes and imprisons propagandists like those on Columbia Journalism School's walls whenever possible.\nThe Line of Argument Journalism Groups Use to Defend Their Tribute ListsThe binary \"if-not-combatant-then-hero\" argument is hardly new.\nThe U.S. justice system has brooked no mercy for Hamas operatives inside the United States who merely raised money for Hamas."}, {"id": "af3475a7-c4b3-4d1d-aa24-6fb9b26523a0", "title": "IDF names two fatalities in Monday drone strike on Metula", "date": "2024-05-07 07:30", "url": "https://www.ynetnews.com/article/skx787vmc", "message": "The IDF said on Tuesday that 31-year old Master sergeant (res.)\nNahman Natan Hertz from the West Bank settlement of Elazar and 31-year old Master sergeant (res.)\nDan Kamkagi from the settlement of Kfar Oranim were killed in the Monday Hezbollahdrone strike on Metula"}, {"id": "9031733d-2720-472f-9651-53d32d35d323", "title": "Ukraine busts up Russia Zelenskyy assassination plot in massive  failure  of Putin spies", "date": "2024-05-07 22:00", "url": "https://1010wcsi.com/fox-world/ukraine-busts-up-russias-zelenskyy-assassination-plot-in-massive-failure-of-putins-spies/", "message": "Ukrainian authorities have arrested two colonels from the Ukrainian forces who had allegedly collaborated with Russians to plot the assassination of Ukrainian President Volodymyr Zelenskyy.\n“The enemy was actively developing plans to eliminate President Volodymyr Zelensky,” the SBU added.\nThe colonels agreed to betray their country for $50,000, which Russian Federal Security Service (FSB) handlers teased could increase to $80,000.\nPrior to their arrest, the colonels spied on Zelenskyy and provided information to FSB on the presidential guard, as well as Zelenskyy’s movements.\nUkraine’s SBU managed to catch one of the colonels as he traveled out to another region of Ukraine allegedly to collect weapons for the operation."}, {"id": "de86b718-0aad-4436-a7f6-ee52bf210c26", "title": "Ukraine busts up Russia Zelenskyy assassination plot in massive  failure  of Putin spies", "date": "2024-05-07 22:00", "url": "https://wfin.com/fox-world-news/ukraine-busts-up-russias-zelenskyy-assassination-plot-in-massive-failure-of-putins-spies/", "message": "Ukrainian authorities have arrested two colonels from the Ukrainian forces who had allegedly collaborated with Russians to plot the assassination of Ukrainian President Volodymyr Zelenskyy.\n“The enemy was actively developing plans to eliminate President Volodymyr Zelensky,” the SBU added.\nThe colonels agreed to betray their country for $50,000, which Russian Federal Security Service (FSB) handlers teased could increase to $80,000.\nPrior to their arrest, the colonels spied on Zelenskyy and provided information to FSB on the presidential guard, as well as Zelenskyy’s movements.\nUkraine’s SBU managed to catch one of the colonels as he traveled out to another region of Ukraine allegedly to collect weapons for the operation."}, {"id": "9c3d3621-153d-4f48-940c-79b9b5e9a022", "title": "Ukraine Foils Plot To Assassinate Zelensky , Arrests 2 Security Officials", "date": "2024-05-07 15:15", "url": "https://leadership.ng/ukraine-foils-plot-to-assassinate-zelensky-arrests-2-security-officials/", "message": "The Ukrainian State Security Service (SBU) said two government protection unit colonels have been arrested for allegedly planning to assassinate President Volodymyr Zelensky.\nThe SBU said on Tuesday that the officials were apprehended after it exposed a network of agents belonging to Russia’s State Security Service (FSB).\nThe SBU said it had “foiled” the “actively developing plans” to assassinate Zelensky.\nThe Ukrainian security agency said the assassination plot also targeted other senior officials, including the head of the SBU, Vasyl Maliuk, and the head of the Defence Intelligence of Ukraine, Kyrylo Budanov.\nIn August 2023, a woman from the southern Ukrainian region of Mykolaiv was equally arrested over a a plot to assassinate Zelensky."}, {"id": "5b00d972-2dc2-4cf7-bd8e-5cfcc688a093", "title": "Israeli forces seize Rafah crossing in Gaza , threatening aid and putting cease - fire talks on edge", "date": "2024-05-07 19:00", "url": "https://www.ocregister.com/2024/05/07/israeli-forces-seize-rafah-crossing-in-gaza-threatening-aid-and-putting-cease-fire-talks-on-edge/", "message": "(AP Photo/Ramez Habboub)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians mourn their relatives killed in the Israeli bombardment in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)A Palestinian wounded in the Israeli bombardment of the Gaza Strip is brought to a hospital in Rafah, southern Gaza Strip, Tuesday, May 7, 2024."}, {"id": "8af98b16-b9fa-466b-8bd1-9df64366916c", "title": "Hezbollah Escalates Attacks on Northern Israel | The Jewish Press - JewishPress . com | Hana Levi Julian | 30 Nisan 5784 – Tuesday , May 7 , 2024", "date": "2024-05-07 22:30", "url": "https://www.jewishpress.com/news/middle-east/lebanon/hezbollah-escalates-attacks-on-northern-israel/2024/05/07/", "message": "Photo Credit: Resistance News NetworkLebanon’s Iranian proxy, Hezbollah, continued on Tuesday to escalate its attacks on northern Israel, firing anti-tank guided missiles (ATGMs), Katyusha rockets and explosive suicide drones at communities along the border.\nTwo IDF soldiers were killed Monday by Hezbollah in an explosive suicide drone attack on the city of Metula: Master Sgt.\nAdvertisementOn Tuesday, the terror organization continued its escalation, claiming responsibility for eight separate attacks on northern Israel.\nShortly before, two houses sustained direct hits by anti-tank guided missiles in Moshav Shtula, in the western Galilee.\n“But we reserve the right to attack Hezbollah in Lebanon and to push them back if they will not move back voluntarily."}, {"id": "9525ffbc-1762-48b5-bd23-2e1d8100a822", "title": "Israeli forces seize Rafah crossing in Gaza , threatening aid and putting cease - fire talks on edge", "date": "2024-05-07 19:00", "url": "https://www.dailynews.com/2024/05/07/israeli-forces-seize-rafah-crossing-in-gaza-threatening-aid-and-putting-cease-fire-talks-on-edge/", "message": "(AP Photo/Ramez Habboub)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians mourn their relatives killed in the Israeli bombardment in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)A Palestinian wounded in the Israeli bombardment of the Gaza Strip is brought to a hospital in Rafah, southern Gaza Strip, Tuesday, May 7, 2024."}, {"id": "045408a5-dc62-4f7a-87a5-05c91ddae3c1", "title": "Teen shot dead by police blows up toilet with homemade bomb", "date": "2024-05-07 03:30", "url": "https://www.perthnow.com.au/news/teen-shot-dead-by-police-blows-up-toilet-with-homemade-bomb-c-14574103", "message": "Footage has resurfaced of the Perth teenager shot dead by police using a homemade explosive to blow up a school toilet two years earlier.\nIn the video, students are left screaming and laughing following the explosion inside Rossmoyne Senior High School in Perth.\nREAD NOWCamera Icon The 16-year-old was shot by police after a carpark stabbing.\nSupplied Credit: NCA NewsWireCamera Icon The Rossmoyne Senior High School student had been enrolled in a deradicalisation program.\nCamera Icon The 16-year-old boy blew up a school toilet with a homemade explosive device."}, {"id": "4763cb89-6190-4597-ace9-e796ca32418f", "title": "Israeli forces seize Rafah crossing in Gaza , threatening aid and putting cease - fire talks on edge", "date": "2024-05-07 19:30", "url": "https://www.presstelegram.com/2024/05/07/israeli-forces-seize-rafah-crossing-in-gaza-threatening-aid-and-putting-cease-fire-talks-on-edge/", "message": "(AP Photo/Ramez Habboub)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians mourn their relatives killed in the Israeli bombardment in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)A Palestinian wounded in the Israeli bombardment of the Gaza Strip is brought to a hospital in Rafah, southern Gaza Strip, Tuesday, May 7, 2024."}, {"id": "6026039e-5df7-483e-a489-921e0f39d0c9", "title": "Rep . Rashida Tlaib : Arrest Netanyahu for  crimes against humanity  ", "date": "2024-05-07 19:15", "url": "https://www.upi.com/Top_News/World-News/2024/05/07/world-tlaib-ICC-arrest-netanyahu/7151715104292/", "message": "1 of 3 | Rep. Rashida Tlaib, D-Mich., urged the International Criminal Court to arrest Israel Prime Minister Benjamin Netanyahu and others for \"crimes against humanity\" that she says will occur as Israel Defense Forces began their push into Rafah in southern Gaza Tuesday.\nFile photo by Andrew Harnik/UPI | License PhotoMay 7 (UPI) -- U.S. Rep. Rashida Tlaib, D-Mich., said Israel is about to commit \"crimes against humanity\" and on Tuesday urged the International Criminal Court to arrest Israel Prime Minister Benjamin Netanyahu.\n\"Over 1.5 million Palestinian civilians, including over 600,000 children, are trapped in Rafah,\" Tlaib said in a statement Tuesday.\nTlaib urged the ICC to arrest Netanyahu and top Israeli officials to \"hold them accountable\" for what she described as genocide as described by \"the Genocide Convention under international law.\"\nIsraeli forces warned Gazans sheltering in Rafah to leave as Israel Defense Forces prepared to enter Rafah."}, {"id": "cf29640f-4f17-49da-901f-32eea9cb79e2", "title": "Israel : Two reservists killed by Hezbollah fire on Lebanese border", "date": "2024-05-07 10:45", "url": "https://www.prokerala.com/news/articles/a1529040.html", "message": "DO NOT RELEASE----Israel: Two reservists killed by Hezbollah fire on Lebanese border.\nImage Source: IANS NewsTel Aviv/Beirut, May 7 : Two Israeli reservists have been killed in a drone attack by the Lebanese Shiite militia Hezbollah, the Israeli army said on Tuesday.\nThe two 31-year-old soldiers were killed on Monday in an incident on Israel's northern border, the army said.\nAccording to Lebanese reports, four civilians - a couple and their two sons - were killed in an Israeli airstrike in Lebanon on Sunday.\nSince the beginning of the Gaza war seven months ago, there have been repeated military confrontations between Israel's army and the Hezbollah militia in Lebanon on the border, with multiple casualties on both sides."}, {"id": "025288fc-6017-46ac-b0d2-291debc09f55", "title": "Australian Boy Killed by Police Was in Deradicalization Program since Causing School Explosion", "date": "2024-05-07 12:30", "url": "https://www.newsmax.com/world/globaltalk/australia-perth-police-shot-stabbed-boy/2024/05/07/id/1163721/", "message": "The boy had injured a man with a kitchen knife in a hardware store parking lot on Saturday night before police killed him with a single shot.\nWestern Australia Police Commissioner Col Blanch said the boy killed in Perth had been a voluntary participant of the federally funded Countering Violent Extremism program since 2022 when he caused an explosion at a toilet at the Rossmoyne Senior High School, which he attended.\n“To be in a CVE program automatically says that we have concerns about his behavior and his thinking,” Blanch told Perth Radio 6PR.\nHe urged the school community to contact police with any concerns rather sharing those concerns through social media.\nWestern Australia police but had found no links between the Perth boy and an alleged network of teen extremists in the east coast city of Sydney."}, {"id": "1751f729-2147-4b6e-b0cd-6013bfef0c52", "title": "Australian Boy Shot By Police After Stabbing Was In Deradicalization Program Since Causing School Explosion", "date": "2024-05-07 19:30", "url": "https://www.theyeshivaworld.com/news/general/2281556/australian-boy-shot-by-police-after-stabbing-was-in-deradicalization-program-since-causing-school-explosion.html", "message": "A 16-year-old boy who was shot dead by police after stabbing a man in the Australian west coast city of Perth had been engaged in a deradicalization program since he detonated a homemade explosive device in a school toilet block two years ago, police said on Tuesday.\nThe boy had injured a man with a kitchen knife in a hardware store parking lot on Saturday night before police killed him with a single shot.\n“To be in a CVE program automatically says that we have concerns about his behavior and his thinking,” Blanch told Perth Radio 6PR.\nHe urged the school community to contact police with any concerns rather sharing those concerns through social media.\nWestern Australia police but had found no links between the Perth boy and an alleged network of teen extremists in the east coast city of Sydney."}, {"id": "aeb068c3-7e73-4d81-841b-6fee7e112f8a", "title": "Iran IRGC Terrorists Sail Warship into Southern Hemisphere", "date": "2024-05-07 03:30", "url": "https://www.breitbart.com/middle-east/2024/05/06/irans-irgc-terrorists-sail-warship-into-southern-hemisphere/", "message": "Iran announced that Shahid Mahdavi, an Islamic Revolutionary Guard Corps (IRGC) warship, crossed the equator into the Southern Hemisphere for the first time.\nThe Shahid Mahdavi is on a “long-distance mission” in international waters, the Iranian state-owned PressTV propaganda outlet reported.\nIranian state media claimed that the warship was “conducting its biggest mission in terms of distance and operation,” without specifying further.\nIran's IRGC Navy floating base Shahid Mahdavi used as mobile platform at sea to launch ballistic missiles.\nDezful medium-range ballistic missile launched from 40-foot containers on the deck of the Shahid Mahdavi."}, {"id": "16e62645-4f9d-4b1f-ae96-56945d6fdcfc", "title": "Military correspondent severe criticism on IDF attacks in Lebanon :  Back to Oct . 6 ? | Israel National News", "date": "2024-05-07 20:45", "url": "http://www.israelnationalnews.com/news/389570", "message": "התקיפות בלבנון דובר צה\"לGalei Tzahal's correspondent for military and security affairs, Doron Kadosh, sharply criticized the IDF's attacks in Lebanon in response to the vast number of missiles Hezbollah fired at Israel.\nKadosh voiced his criticism after the IDF announced on Tuesday evening that \"IDF forces are simultaneously attacking Hezbollah terrorist targets in six areas in southern Lebanon.\"\nThe announcement stated that, “Air Force fighter jets attacked Hezbollah military structures earlier today, in a number of areas in southern Lebanon, including in Blida, Maroun al-Ras, Yaroun, and Khiam.\"\nHe criticized: \"Not a single Hezbollah terrorist has been eliminated for ten days.\nand vast damage, of course,”He added: \"There does not seem to be any substantial change in the IDF's attacks, while Hezbollah is undoubtedly escalating its operations."}, {"id": "a1a29f6b-c22e-493e-864b-3e6dea836c24", "title": "Do you know these men ? NSW Police reveal new faces of Wakeley riot after Mar Mari Emmanuel was stavved", "date": "2024-05-07 04:00", "url": "https://www.dailymail.co.uk/news/article-13389131/Search-people-church-riots-Sydney.html", "message": "The first person depicted (Person P) is described as being a man of Mediterranean/Middle Eastern appearance, slim build, with short dark hair.\nHe is shown wearing light coloured clothing, dark coloured shoes and carrying a black bag across his body.\nHe is shown wearing a grey hooded jumper, black cap, black shorts and white shoes.\nHe is shown wearing a black singlet, shorts, cap and shoes.\nShe is shown wearing a singlet top and shorts, with a shirt tied around her waist and a dark coloured cap."}, {"id": "3bd84e24-eb5b-4b4f-affa-1ad0509c6bcf", "title": "Russian plot to assassinate Zelensky foiled , Ukraine intelligence agents say", "date": "2024-05-07 13:00", "url": "https://www.yahoo.com/news/russian-plot-assassinate-zelensky-foiled-105733310.html", "message": "Ukrainian intelligence agents say they have foiled a Russian plot to assassinate Volodymyr Zelensky.\nUkraine’s SBU State Security Service said it had caught Russian agents within the Ukrainian state guard plotting the kidnap and assassination of the president and other senior governmental officials.\nWithout providing evidence, they wrote: “The enemy was actively developing plans to eliminate President Volodymyr Zelensky.\nMr Zelensky said in 2022 there had been at least 10 attempts to assassinate him.\nAlso, prosecutors in Poland said last month a Polish man had been arrested on allegations of being ready to spy on behalf of Russia’s military intelligence in an alleged plot to assassinate Mr Zelensky."}, {"id": "1ca98e57-0c02-45ec-8fe1-9662f561f1cb", "title": "Early Edition : May 7 , 2024", "date": "2024-05-07 13:00", "url": "https://www.justsecurity.org/95475/early-edition-may-7-2024/", "message": "by Beatrice YahiaSignup to receive the Early Edition in your inbox here.\nHere’s today’s news:ISRAEL-HAMAS WARThe Israeli military said this morning it has “operational control” of the Palestinian side of the Rafah crossing.\nThe “vast majority” of people ordered to evacuate parts of Rafah have left the area, the Israeli military said today.\nHopes for a pause in the fighting have been renewed after Hamas said yesterday it has agreed to a Qatari-Egyptian ceasefire proposal.\nPolice arrested some 125 activists as they broke up a pro-Palestinian demonstration camp at the University of Amsterdam early today."}, {"id": "2ecbc0ef-5485-4aea-aee5-c3c3ccfdc3ce", "title": "Pakistan : Afghan - based terrorists planned suicide attack on Chinese engineers", "date": "2024-05-07 16:45", "url": "https://www.voanews.com/a/pakistan-afghan-based-terrorists-planned-suicide-attack-on-chinese/7601372.html", "message": "Pakistan said Tuesday that recent militant attacks in the country, including a deadly suicide car bombing on Chinese engineers, were planned from “terrorist sanctuaries” in Afghanistan.\nIn late March, a suicide bomber rammed his explosives-laden car into a convoy of Chinese engineers and workers in northwestern Pakistan, killing five of them and their local driver.\n“This attack was planned in Afghanistan, and terrorists and their facilitators were also being controlled from there,” said Sharif.\nEnayatullah Khwarizmi asserted in a statement that the killing of Chinese citizens occurred deep inside Pakistan and \"shows the weakness\" of Pakistani security agencies.\nHe noted that more than 563,000 Afghans living illegally in Pakistan had gone home since October, when Islamabad began its crackdown on undocumented migrants."}, {"id": "a80fa924-9011-4d46-a664-0d8ff0912d09", "title": "HRW : Israel attack on Lebanon rescuers was  unlawful  ", "date": "2024-05-07 06:30", "url": "https://www.yahoo.com/news/hrw-israel-attack-lebanon-rescuers-055011584.html", "message": "The March 27 strike levelled the emergency services centre in the Lebanese village of Habariyeh (Rabih DAHER)Human Rights Watch said Tuesday an Israeli strike in Lebanon that killed seven first responders was \"an unlawful attack on civilians\", and urged Washington to suspend weapons sales to Israel.\n\"An Israeli strike on an emergency and relief centre\" in the southern village of Habariyeh on March 27 \"killed seven emergency and relief volunteers\" and constituted an \"unlawful attack on civilians that failed to take all necessary precautions\", HRW said in a statement.\nThe Israeli military did not immediately comment when contacted by AFP.\n\"Israeli forces used a US weapon to conduct a strike that killed seven civilian relief workers in Lebanon who were merely doing their jobs,\" HRW's Lebanon researcher, Ramzi Kaiss, said.\nThe rights group urged the United States to \"immediately suspend arms sales and military assistance to Israel given evidence that the Israeli military is using US weapons unlawfully\"."}, {"id": "782587fc-f436-4d1e-818d-34696c58f0cd", "title": "Fetterman demands Biden admin stop withholding weapons from Israel :  Strongly disagree  ", "date": "2024-05-07 22:00", "url": "https://news3lv.com/news/nation-world/fetterman-demands-biden-admin-stop-withholding-weapons-from-israel-strongly-disagree-sen-john-fetterman-d-pa-hamas-middle-east-conflict-palestine-gaza-war-aid", "message": "Sen. John Fetterman, D-Pa., on Tuesday shared his outrage after learning the Biden administration reportedly withheld weapons from Israel.\nOfficials are delaying the aid shipment to send a “political message” to Israel, to Politico.\nTaking to X, Sen. Fetterman demanded an immediate reversal.\nSen. Fetterman has been a vocal ally of Israel during its war against Hamas, a stance not shared by some of his more progressive colleagues in the Democratic Party.\nREAD MORE |“If a homicidal, Iranian-funded, terrorism proxy wants to pick up your college education tab, you really, really might want to reevaluate things,” he said via X."}, {"id": "d1c4e622-c692-45d0-b0e1-0722579c4ed3", "title": "After the Attacks Between Israel and Iran : What Can We Expect Next ? ", "date": "2024-05-07 12:00", "url": "https://www.thenation.com/article/world/offensive-error/", "message": "Comment / After the Attacks Between Israel and Iran—What Comes Next?\nYet on closer inspection, Israel’s tense escalatory exchanges with Iran were hardly a win for Israel.\nTehran calculated that, in the ongoing shadow war between Israel and Iran, time was on Iran’s side.\nIsrael appears to have easily evaded Iran’s air defenses, inflicting damage on some military installations, though the extent of the damage remains unknown.\nSimilarly, the notion that this episode revealed a new military alliance between Israel and Arab states does not survive scrutiny."}, {"id": "abdfa182-ae8f-47e3-9906-f6ab4342ee54", "title": "Fetterman demands Biden admin stop withholding weapons from Israel :  Strongly disagree  ", "date": "2024-05-07 22:00", "url": "https://kval.com/news/nation-world/fetterman-demands-biden-admin-stop-withholding-weapons-from-israel-strongly-disagree-sen-john-fetterman-d-pa-hamas-middle-east-conflict-palestine-gaza-war-aid", "message": "Sen. John Fetterman, D-Pa., on Tuesday shared his outrage after learning the Biden administration reportedly withheld weapons from Israel.\nOfficials are delaying the aid shipment to send a “political message” to Israel, to Politico.\nTaking to X, Sen. Fetterman demanded an immediate reversal.\nSen. Fetterman has been a vocal ally of Israel during its war against Hamas, a stance not shared by some of his more progressive colleagues in the Democratic Party.\nREAD MORE |“If a homicidal, Iranian-funded, terrorism proxy wants to pick up your college education tab, you really, really might want to reevaluate things,” he said via X."}, {"id": "7fbc377b-524b-42f5-8ade-9f57c335904a", "title": "Israeli forces seize Rafah crossing in Gaza , threatening aid and putting cease - fire talks on edge", "date": "2024-05-07 19:30", "url": "https://www.sgvtribune.com/2024/05/07/israeli-forces-seize-rafah-crossing-in-gaza-threatening-aid-and-putting-cease-fire-talks-on-edge/", "message": "(AP Photo/Ramez Habboub)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians mourn their relatives killed in the Israeli bombardment in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)A Palestinian wounded in the Israeli bombardment of the Gaza Strip is brought to a hospital in Rafah, southern Gaza Strip, Tuesday, May 7, 2024."}, {"id": "77270d01-fb38-4d8d-9787-ee00a25f2426", "title": "Israeli forces seize Rafah crossing in Gaza , threatening aid and putting cease - fire talks on edge", "date": "2024-05-07 22:00", "url": "https://www.sbsun.com/2024/05/07/israeli-forces-seize-rafah-crossing-in-gaza-threatening-aid-and-putting-cease-fire-talks-on-edge/", "message": "(AP Photo/Ramez Habboub)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)Palestinians mourn their relatives killed in the Israeli bombardment in Rafah, Gaza Strip, Tuesday, May 7, 2024.\n(AP Photo/Ismael Abu Dayyah)A Palestinian wounded in the Israeli bombardment of the Gaza Strip is brought to a hospital in Rafah, southern Gaza Strip, Tuesday, May 7, 2024."}, {"id": "25c65f75-3509-42b7-b71a-7a8622745e58", "title": "Labour new West Midlands mayor tells LBC he would  absolutely  support an arms embargo ... ", "date": "2024-05-07 19:15", "url": "https://www.lbc.co.uk/news/rafah-border-crossing-israel-richard-parker-labour/", "message": "ExclusiveLabour's new West Midlands mayor tells LBC he would ‘absolutely’ support an arms embargo on IsraelRichard Parker says 'he would like an arms embargo' on Israel in due courseBy Jenny MedlicottThe newly elected Mayor of the West Midlands Richard Parker has told LBC he would ‘absolutely’ like to see an arms embargo imposed on Israel.\nEarlier on the show, former British diplomat Sir Jeremy Greenstock said that he thought the UK would be “very reluctant” to impose an arms embargo but wouldn’t rule it out.\nMr Sunak urged both Israel and Hamas to \"continue talking\" despite Israel saying earlier that it had rejected a Hamas ceasefire proposal as a \"ruse\".\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\nHamas said on Monday it would accept the latest Gaza ceasefire proposal, mediated by Egypt and Qatar."}, {"id": "b3a7d74e-6aa9-4445-b247-d242f3ca3dbf", "title": "Ranked : The Top 5 U . S . Navy Warships Right Now", "date": "2024-05-07 17:30", "url": "https://nationalinterest.org/blog/buzz/ranked-top-5-us-navy-warships-right-now-210925", "message": "Top 5 U.S. Navy warships today: The Ford-class, Nimitz-class, Zumwalt-class, Virginia-class Block V and Ohio-class submarines - The U.S. Navy is the world’s most powerful sea-based service, and it has been since World War II.\nFrom nuclear submarines and aircraft carriers to fighter jets and destroyers, the Navy has a means to any end, and a platform for every mission.\nTop 5 U.S. Navy Warships Right NowAmerica’s projection of power would be impossible without the prowess and versatility of its naval forces.\nMeasuring about 610 feet in length and displacing 16,000 metric tons, Zumwalt ships are equipped with two 155mm naval guns.\nOhio-class ships can carry 154 Tomahawk missiles and are capable of supporting special operations forces."}, {"id": "d190a813-90ef-4cb3-a891-bdedb1e0bc50", "title": "Fetterman demands Biden admin stop withholding weapons from Israel :  Strongly disagree  ", "date": "2024-05-07 22:45", "url": "https://bakersfieldnow.com/news/nation-world/fetterman-demands-biden-admin-stop-withholding-weapons-from-israel-strongly-disagree-sen-john-fetterman-d-pa-hamas-middle-east-conflict-palestine-gaza-war-aid", "message": "Sen. John Fetterman, D-Pa., on Tuesday shared his outrage after learning the Biden administration reportedly withheld weapons from Israel.\nOfficials are delaying the aid shipment to send a “political message” to Israel, to Politico.\nTaking to X, Sen. Fetterman demanded an immediate reversal.\nSen. Fetterman has been a vocal ally of Israel during its war against Hamas, a stance not shared by some of his more progressive colleagues in the Democratic Party.\nREAD MORE |“If a homicidal, Iranian-funded, terrorism proxy wants to pick up your college education tab, you really, really might want to reevaluate things,” he said via X."}, {"id": "94a2ca8a-9d9a-443c-81c7-34c634a165de", "title": "Ukraine says it foiled alleged Russian plot to kill Zelenskyy and intelligence officials as gift for Putin", "date": "2024-05-07 20:45", "url": "https://www.cbc.ca/news/world/ukraine-foiled-assassination-plot-zelenskyy-1.7196815", "message": "Ukraine's state security service said it caught two agents for Russia plotting the assassination of Ukrainian President Volodymyr Zelenskyy and other top officials as \"a gift\" for Russian President Vladimir Putin as he was sworn in for a new term in the Kremlin on Tuesday.\nThe two men were colonels in Ukraine's state guard service recruited by Russia's Federal Security Service (FSB) who leaked classified information to Moscow, the Security Service of Ukraine (SBU) said on the Telegram app.\nThey were tasked with finding someone close to the presidential guard who would take Zelenskyy hostage and later kill him, the SBU statement said, without making clear at what point the alleged plot had been foiled.\nThe Kremlin declined to comment last month when asked about the arrest in Poland of a man accused of working with Russian intelligence to prepare a possible attempt to assassinate Zelenskyy.\nOne of the arrested men was involved in transporting and storing drones and explosives for the operation, it said."}, {"id": "cb3803cb-636d-46b0-b51c-ccb328f841aa", "title": "US cannot blame Israel for civilian deaths and ignore its own history", "date": "2024-05-07 04:00", "url": "https://www.jpost.com/opinion/article-800170", "message": "Quite frankly, the hypocrisy and holier-than-thou attitude of the United States toward Israel is truly infuriating.\nThe United States had tracked a 53-year-old shepherd in northern Syria with a highly sophisticated Predator Drone.\nTurns out, the United States tracked a simple shepherd named Lufti Hassan Masto thinking he was an al-Qaeda leader.\nIt makes clear that the United States, too, makes mistakes.\nOne report I read brought the total of innocent civilians killed by the United States via drone and missile strikes to 140,000."}, {"id": "57701a07-6bf1-4285-8f4f-575d818f14b2", "title": "IDF Completes 20 - Hour Operation in Tulkarem | The Jewish Press - JewishPress . com | Hana Levi Julian | 30 Nisan 5784 – Tuesday , May 7 , 2024", "date": "2024-05-07 18:00", "url": "https://www.jewishpress.com/news/eye-on-palestine/idf-completes-20-hour-operation-in-tulkarem/2024/05/07/", "message": "Photo Credit: Nasser Ishtayeh / Flash 90Israel Defense Forces and Border Guard Police announced the completion of a 20-hour military operation in the Palestinian Authority city of Tulkarem.\nThe IDF said Tuesday afternoon that six wanted terror suspects were arrested during the operation, and a seventh gunman was eliminated.\nAdvertisementThe troops also seized weapons and demolished three lab facilities used for producing explosives, the IDF said.\nThis past weekend, IDF fighters killed five gunmen in the nearby village of Deir al-Ghusun during an overnight raid near Tulkarem.\nDuring the 13-hour operation, the terrorists opened fire at Israeli forces from inside one of the homes in the village."}, {"id": "7bd7b435-31e7-480e-bb47-6db64c4c9c61", "title": "Putin inauguration - united kingdom and US boycott ceremony as Kremlin leader sworn in again - World News", "date": "2024-05-07 07:45", "url": "https://www.mirror.co.uk/news/world-news/putins-inauguration-uk-boycotts-opulent-32750266", "message": "Image: POOL/AFP via Getty Images) POOL/AFP via Getty Images)\"The UK will not field a representative at the inauguration of President Vladimir Putin,” said a spokesman for the Foreign Office.\nImage: POOL/AFP via Getty Images) POOL/AFP via Getty Images)On Monday, ambassador Nigel Casey was summoned to the Foreign Ministry in Moscow, according to Russian reports.\nImage: POOL/AFP via Getty Images) POOL/AFP via Getty Images)This was a “serious escalation and confirmation of London's increasing involvement in military operations on the side of Kyiv”.\nImage: POOL/AFP via Getty Images) POOL/AFP via Getty Images)It comes as Russia has lost another £40 million Su-34 bomber on a combat mission.\nImage: POOL/AFP via Getty Images) POOL/AFP via Getty Images)One key area to watch is the Defence Ministry."}, {"id": "2b4874dc-590e-40f2-96a1-c279f5ab3b81", "title": "It time to for Rafah action - The Jerusalem Post", "date": "2024-05-07 04:00", "url": "https://www.jpost.com/opinion/article-800164", "message": "Entering Rafah will enable Israel to directly confront the terrorist infrastructure that poses an existential threat to its citizens.\nBy establishing a presence in Rafah, Israel would be able to further degrade Hamas’s ability to launch attacks and disrupt its ability to operate with impunity.\nBy showing resolve, Israel can better deter future attacks and create a more secure environment for its people.\nBy intervening in Rafah, Israel can help alleviate human suffering, facilitate the delivery of aid, and provide hope for a better future for all residents of Gaza.\nBy confronting the terrorist threat head-on, Israel can protect its citizens, deter future attacks, and pave the way for a brighter future for everyone in the region."}, {"id": "d0b73b10-690b-4579-bbbe-267e8168672d", "title": "A street in Kharkiv to be named after a fallen IDF soldier", "date": "2024-05-07 00:00", "url": "https://www.jpost.com/diaspora/article-800183", "message": "A street in the city of Kharkiv will be named after Corporal Alexei-Asher Nikov, who was killed in a terrorist attack during an operation in Gush Katif in 1998.\nFollowing his heroic act, the city council of his birthplace, Kharkiv, Ukraine, decided to name a street after him.\nUploaded on 7/5/2024 (credit: Courtesy)Nikov studied at the Jewish school \"Ohr Avner\" in Kharkiv, founded by the city's Chief Rabbi and Chabad emissary, Rabbi Moshe Moskovitz.\nThe school is now located on the street named after Nikov.\nThe initiative was supported by Israeli journalist and historian Shimon Briman, together with the head of the city council, Irina Goncharova, and Rabbi Moshe Moskovitz."}, {"id": "a9f5b0e5-d635-4be1-a83a-93bc78a2de7a", "title": "Police appeal for help identifying nine men after Wakeley riot", "date": "2024-05-07 03:30", "url": "https://www.standard.net.au/story/8619653/police-appeal-for-help-identifying-nine-men-after-wakeley-riot/?cs=9676", "message": "Some of those who flocked to the church had gone to support its parishioners, but many others had attended \"for the wrong reasons\", say police."}, {"id": "d3b095bf-e99b-43b6-8b7c-5987287233ee", "title": "Police appeal for help identifying nine men after Wakeley riot", "date": "2024-05-07 02:30", "url": "https://www.examiner.com.au/story/8619653/police-appeal-for-help-identifying-nine-men-after-wakeley-riot/?cs=2596", "message": "Some of those who flocked to the church had gone to support its parishioners, but many others had attended \"for the wrong reasons\", say police."}, {"id": "08dbe343-c41f-42ed-8f4d-5e7028d67879", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-07 11:00", "url": "https://www.irishnews.com/news/world/israeli-forces-take-control-of-gaza-side-of-rafah-crossing-with-egypt-ARECKTAEWRMDXKR2ZRG5P7LXCQ/", "message": "The White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa) (Leo Correa/AP)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nWael Abu Omar, a spokesman for the Palestinian Crossings Authority, acknowledged Israeli forces had seized the crossing and had closed the facility for the time being.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah) (Ismael Abu Dayyah/AP)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "417a3ba2-e116-4647-b11a-5cb56cc1f8b3", "title": "Ukraine Intelligence Says It Foiled Russian Plot To Assassinate President Zelenskyy", "date": "2024-05-07 22:00", "url": "https://saharareporters.com/2024/05/07/ukraine-intelligence-says-it-foiled-russian-plot-assassinate-president-zelenskyy", "message": "Ukrainian intelligence agents have said that they foiled a Russian plot to assassinate President Volodymyr Zelenskyy.\nUkraine’s SBU State Security Service said it caught Russian agents within the Ukrainian state guard plotting the kidnap and assassination of the president and other senior governmental officials, Independent UK reports.\nThe SBU claimed on Telegram that a Russian secret agent had passed on coordinates of a safe house ahead of a planned rocket attack.\nThe force added that Russia had planned to destroy all traces of the drone used to target the president with another missile.\nWithout providing evidence, they wrote: “The enemy was actively developing plans to eliminate President Volodymyr Zelensky."}, {"id": "b54dd340-3fe7-427e-913e-e587bd8c2d45", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-07 19:00", "url": "https://www.theboltonnews.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "242e0134-75df-43a0-956a-68b4776f3f43", "title": "Police appeal for help identifying nine men after Wakeley riot", "date": "2024-05-07 04:30", "url": "https://www.illawarramercury.com.au/story/8619653/police-appeal-for-help-identifying-nine-men-after-wakeley-riot/?cs=9676", "message": "Some of those who flocked to the church had gone to support its parishioners, but many others had attended \"for the wrong reasons\", say police."}, {"id": "b48b17aa-5ec5-46c5-b403-5582e819a890", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-07 19:00", "url": "https://www.bucksfreepress.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "bd913821-dc2d-444a-bfe4-a1155cd77e84", "title": "U . N . Condemns Israel After Mass Graves Found in Gaza", "date": "2024-05-07 05:45", "url": "https://www.mediaite.com/news/u-n-condemns-israel-after-mass-graves-found-in-gaza-bodies-reportedly-showing-signs-of-torture-and-summary-executions/", "message": "The United Nations condemned Israel’s ongoing war in Gaza after the discovery of mass graves discovered at two hospitals.\nIsrael has been waging war in Gaza since the Oct. 7 terrorist attacks in which Hamas militants killed 1,200 Israelis and abducted more than 200 others.\nHamas, which controls Gaza, said on Monday it accepted the terms of a ceasefire agreement proposed by Egypt and Qatar.\nMore than 30,000 Palestinians have been killed in Gaza, where nearly 90% of the population has been displaced.\n“We are horrified at details emerging from mass graves recently unearthed in the Gaza Strip,” the U.N. press release stated."}, {"id": "4a2bf810-236d-4906-90f2-899b0de4653d", "title": "Russia Ukraine War : Russian Agent Plan To Kill Zelensky As  Gift  For Putin Foiled : Ukraine", "date": "2024-05-07 22:30", "url": "https://www.ndtv.com/world-news/russia-ukraine-war-russian-agents-plan-to-kill-zelensky-as-gift-for-putin-foiled-ukraine-5610171", "message": "(File)Ukraine's state security service said it caught two agents for Russia plotting the assassination of President Volodymyr Zelenskiy and other top officials as \"a gift\" for Vladimir Putin as he was sworn in for a new term in the Kremlin on Tuesday.\nThe two men were colonels in Ukraine's state guard service recruited by Russia's Federal Security Service (FSB) who leaked classified information to Moscow, the Security Service of Ukraine (SBU) said on the Telegram app.\nThe spy group also planned to \"eliminate\" Maliuk and Kyrylo Budanov, the military intelligence agency's head, the SBU said.\nThe agents sought to inform the Russian side of the whereabouts of Budanov so they could carry out missile and drone attacks at the location, it said.\n(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)"}, {"id": "7edbbf62-af47-4c33-a833-f0ef5053c693", "title": "IRGC warship sails into Southern Hemisphere", "date": "2024-05-07 11:00", "url": "https://www.globalsecurity.org/wmd/library/news/iran/2024/iran-240505-isna01.htm", "message": "IRGC's warship sails into Southern HemisphereISNA - Iranian Students' News AgencySun / 5 May 2024 / 11:46A domestically-developed oceangoing warship operated by Iran's Islamic Revolution Guards Corps (IRGC) Navy has crossed the line of zero degrees latitude, the Equator, and sailed into the Southern Hemisphere.\nThe 2,100-tonne vessel, which is 240 meters in length and 27 meters in width, joined the IRGC's naval fleet in March 2023.\nThe oceangoing warship is equipped with a three-dimensional phased array radar, sea-to-sea and sea-to-air missiles, and sophisticated telecommunication systems for electronic warfare.\nIn February 2024, the IRGC Navy launched two ballistic missiles from inside two containers on board the warship.\nLeader of the Islamic Revolution Ayatollah Seyyed Ali Khamenei has repeatedly called for efforts to maintain and boost Iran's defense capabilities."}, {"id": "1bdb2321-8991-478b-a5b5-cdd5584934bb", "title": "Obama 2010 Defense Budget : Top Five Worst Choices for National Security", "date": "2024-05-07 12:45", "url": "https://www.heritage.org/defense/report/obamas-2010-defense-budget-top-five-worst-choices-national-security", "message": "President Obama has submitted a defense budget request to Congress for fiscal year 2010 that, if implemented, will dramatically reshape America's military.\nScaling Back Missile DefensePresident Obama's 2010 defense budget proposes cutting $1.4 billion from the Missile Defense Agency's budget.\nIt is one thing to carefully oversee the operational capability and technical feasibility of specific ballistic missile defense (BMD) programs; it is an entirely different endeavor to substantially cut the overall missile defense budget when the risk of a ballistic missile launch is palpably growing.\nThe ideological opposition by many to missile defense dates back to the Cold War, when the left believed missile defense would destabilize America's relationship with the Soviet Union.\nBut the Cold War has been over for nearly 20 years, and missile defense today is a clear tool for peace."}, {"id": "7bd9f4cf-62f8-449c-9a37-b5bd8e3edf02", "title": "Hamas accepts Gaza truce proposal , Israel urges Rafah evacuation", "date": "2024-05-07 02:15", "url": "https://www.philstar.com/world/2024/05/07/2353268/hamas-accepts-gaza-truce-proposal-israel-urges-rafah-evacuation", "message": "RAFAH, Palestinian territories — Hamas on Monday said it accepts a proposal for a truce in the seven-month-old war in Gaza, as Israel renewed an order for Palestinians in Rafah to evacuate ahead of a long-threatened invasion of the city.\nHamas member Khalil al-Hayya told the Qatar-based Al Jazeera channel the proposal agreed to by Hamas includes a three-phased truce.\nLater, Dujarric said that Guterres called on both Israel and Hamas to \"go the extra mile needed\" to seal a truce.\n'Return all hostages'Soon after the war started, Israel told Palestinians in northern Gaza to move south to \"safe zones\" –- including Rafah.\nEmergency workers said air strikes killed 16 people in Rafah on Sunday, hours after Hamas rockets killed the Israeli soldiers."}, {"id": "98dff154-5c5b-40ec-b2f7-68f4e7fd0654", "title": "Australian boy killed by police was in deradicalization program since causing school explosion", "date": "2024-05-07 13:15", "url": "https://www.mymotherlode.com/news/asia/3353494/australian-boy-killed-by-police-was-in-deradicalization-program-since-causing-school-explosion.html", "message": "Australian boy killed by police was in deradicalization program since causing school explosionAustralian boy killed by police was in deradicalization program since causing school explosion View PhotoMELBOURNE, Australia (AP) — A 16-year-old boy who was shot dead by police after stabbing a man in the Australian west coast city of Perth had been engaged in a deradicalization program since he detonated a homemade explosive device in a school toilet block two years ago, police said on Tuesday.\nWestern Australia Police Commissioner Col Blanch said the boy killed in Perth had been a voluntary participant of the federally funded Countering Violent Extremism program since 2022 when he caused an explosion at a toilet at the Rossmoyne Senior High School, which he attended.\n“To be in a CVE program automatically says that we have concerns about his behavior and his thinking,” Blanch told Perth Radio 6PR.\nHe urged the school community to contact police with any concerns rather sharing those concerns through social media.\nWestern Australia police but had found no links between the Perth boy and an alleged network of teen extremists in the east coast city of Sydney."}, {"id": "a3d05bcf-10d1-434f-afbe-74d1c47b58f7", "title": "Police appeal for help identifying nine men after Wakeley riot", "date": "2024-05-07 02:45", "url": "https://www.theadvocate.com.au/story/8619653/police-appeal-for-help-identifying-nine-men-after-wakeley-riot/?cs=2605", "message": "Some of those who flocked to the church had gone to support its parishioners, but many others had attended \"for the wrong reasons\", say police."}, {"id": "0fe56cdc-741e-4089-9714-54ea98e941b1", "title": "Police appeal for help identifying nine men after Wakeley riot", "date": "2024-05-07 02:45", "url": "https://www.theadvocate.com.au/story/8619653/police-appeal-for-help-identifying-nine-men-after-wakeley-riot/?cs=9676", "message": "Some of those who flocked to the church had gone to support its parishioners, but many others had attended \"for the wrong reasons\", say police."}, {"id": "a00f7e73-ed1c-43b6-8c8a-6d5a210c6671", "title": "Hamas accepts Gaza truce proposal , Israel urges Rafah evacuation", "date": "2024-05-07 03:15", "url": "https://dunyanews.tv/en/World/809957-Hamas-accepts-Gaza-truce-proposal,-Israel-urges-Rafah-evacuation", "message": "Hamas accepts Gaza truce proposal, Israel urges Rafah evacuationWorld World Hamas accepts Gaza truce proposal, Israel urges Rafah evacuationIsrael renewed an order for Palestinians in Rafah to evacuate ahead of a long-threatened invasion.\nHamas member Khalil al-Hayya told the Qatar-based Al Jazeera that the proposal agreed to by Hamas includes a three-phased truce.\nLater, Dujarric said that Guterres called on both Israel and Hamas to \"go the extra mile needed\" to seal a truce.\nAsked how many people should move, an Israeli military spokesman said: \"The estimate is around 100,000 people.\"\n\"RETURN ALL HOSTAGES\"Soon after the war started, Israel told Palestinians in northern Gaza to move south to safe zones, including Rafah."}, {"id": "b9dbb078-1e59-43b9-aa88-c850f6619b28", "title": "Israel news : Forces seize Gaza Rafah crossing", "date": "2024-05-07 18:15", "url": "https://www.ctvnews.ca/world/israeli-forces-seize-rafah-crossing-in-gaza-threatening-aid-and-putting-ceasefire-talks-on-edge-1.6876357", "message": "They have been closed for at least the past two days, though the smaller Erez crossing between Israel and northern Gaza continues to operate.\nBiden warned Netanyahu again Monday against launching an invasion of the city after Israel ordered 100,000 Palestinians to evacuate from parts of Rafah.\nIsrael's 401st Brigade took “operational control” of the Gaza side of the Rafah crossing early Tuesday, the military said.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\nA tank with an Israel flag is seen entering the Gazan side of the Rafah border crossing on Tuesday, May 7, 2024."}, {"id": "a744bdba-9077-4751-a44f-faea48a2b098", "title": "De - radicalisation programs work despite attacks : expert", "date": "2024-05-07 02:15", "url": "https://www.cessnockadvertiser.com.au/story/8619866/de-radicalisation-programs-work-despite-attacks-expert/?cs=9676", "message": "\"I have seen them work, personally seen them work, and so I don't think that we should be holus-bolus going 'oh, these programs don't work' and walking away from them,\" she told ABC radio on Tuesday."}, {"id": "a8281ba1-4c95-456d-92d6-913f212e273a", "title": "De - radicalisation programs work despite attacks : expert", "date": "2024-05-07 02:15", "url": "https://www.katherinetimes.com.au/story/8619866/de-radicalisation-programs-work-despite-attacks-expert/", "message": "\"I have seen them work, personally seen them work, and so I don't think that we should be holus-bolus going 'oh, these programs don't work' and walking away from them,\" she told ABC radio on Tuesday."}, {"id": "38176971-2b19-48a5-a7d4-e57fb5a8d5f3", "title": "De - radicalisation programs work despite attacks : expert", "date": "2024-05-07 02:15", "url": "https://www.dailyliberal.com.au/story/8619866/de-radicalisation-programs-work-despite-attacks-expert/", "message": "\"I have seen them work, personally seen them work, and so I don't think that we should be holus-bolus going 'oh, these programs don't work' and walking away from them,\" she told ABC radio on Tuesday."}, {"id": "3cbcb490-23cc-467b-86c4-7684f455eb40", "title": "De - radicalisation programs work despite attacks : expert", "date": "2024-05-07 02:00", "url": "https://www.newcastleherald.com.au/story/8619866/de-radicalisation-programs-work-despite-attacks-expert/", "message": "\"I have seen them work, personally seen them work, and so I don't think that we should be holus-bolus going 'oh, these programs don't work' and walking away from them,\" she told ABC radio on Tuesday."}, {"id": "a38f67b9-68f0-45b2-9dd2-22a107bd51f2", "title": "De - radicalisation programs work despite attacks : expert", "date": "2024-05-07 02:00", "url": "https://www.theleader.com.au/story/8619866/de-radicalisation-programs-work-despite-attacks-expert/?cs=30776", "message": "\"I have seen them work, personally seen them work, and so I don't think that we should be holus-bolus going 'oh, these programs don't work' and walking away from them,\" she told ABC radio on Tuesday."}, {"id": "d3e745a5-03a6-4b5e-a659-124b0d8cdbe9", "title": "Commander Allied Air Command General James B . Hecker visited the Czech Republic", "date": "2024-05-07 11:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240506-czechmdfa01.htm", "message": "Commander Allied Air Command General James B. Hecker visited the Czech RepublicMinistry of Defence & Armed Forces of the Czech Republic6.5.2024Author: by Filip TesařCommander of the Allied Air Command (AIRCOM) General James B. Hecker visited the Czech Republic on April 29-30th.\nThe Czech Air Force Commander Major General Petr Čepelka accompanied him during his visit of the 21st Tactical Air Force Base Čáslav on Monday.\nGeneral Hecker opined the aircraft with the support of other components should overcome the Russian air defence.\nAccording to General Hecker, the Čáslav Air Force Base, which is being prepared for the F-35 aircraft, is very promising.\nLastly, General Hecker and General Řehka emphasised the importance to continue the support of Ukraine."}, {"id": "c270df64-ec99-42f0-9aa0-8aaca37e2404", "title": "Mother of Manchester Arena bombing victim to walk to Downing Street to demand new law", "date": "2024-05-07 02:30", "url": "https://news.sky.com/story/mother-of-manchester-arena-bombing-victim-to-walk-to-downing-street-to-demand-new-law-13130839", "message": "The mother of one of the Manchester Arena bombing victims has set off on a 200-mile walk from the spot her son was killed to Downing Street to demand stronger protections against terrorism.\nShe will arrive at Downing Street on 22 May, the seventh anniversary of her son's death.\nThis morning Greater Manchester mayor Andy Burnham joined family and friends, at the AO Arena in central Manchester, to see Ms Murray off at 11am.\nDuring the 186-mile walk to Downing Street, she will be visiting memorials to victims of terror attacks to pay her respects.\nRead more:Injured survivors from Manchester Arena bombing suing MI5Could MI5 have prevented Manchester bombing?"}, {"id": "29451f4e-44eb-42b0-a43c-722af94e3631", "title": "Israeli forces seize Rafah crossing in Gaza , threatening aid and putting cease - fire talks on edge", "date": "2024-05-07 16:45", "url": "https://www.boston.com/news/world-news/2024/05/07/israeli-forces-seize-rafah-gaza-threatening-aid-cease-fire-talks/", "message": "World News Israeli forces seize Rafah crossing in Gaza, threatening aid and putting cease-fire talks on edge The U.N. warned of a potential collapse of the flow of aid to Palestinians from the closure of Rafah and the other main crossing into Gaza, Kerem Shalom, at a time when officials say northern Gaza is experiencing “full-blown famine.” Palestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip, Tuesday, May 7, 2024.\nIsraeli Prime Minister Benjamin Netanyahu called it an “important step” toward dismantling Hamas’ military and governing capabilities.\nAdvertisement:Israel’s 401st Brigade took “operational control” of the Gaza side of the Rafah crossing early Tuesday, the military said.\nThe Rafah crossing with Egypt and the Kerem Shalom crossing with Israel are critical points of entry for food, medicine and other supplies keeping Gaza’s population of 2.3 million alive.\nIsraeli authorities denied the U.N. humanitarian affairs office access to the Rafah crossing Tuesday, said its spokesman, Jens Laerke, warning the disruption could break the fragile aid operation."}, {"id": "33009d71-e33f-4bd4-8429-04e837e076eb", "title": "Hezbollah targets Israeli military command base in occupied Golan Heights", "date": "2024-05-07 11:00", "url": "https://www.globalsecurity.org/military/library/news/2024/05/mil-240506-presstv06.htm", "message": "Hezbollah targets Israeli military command base in occupied Golan HeightsIran Press TVMonday, 06 May 2024 10:33 AMThe Lebanese Hezbollah resistance movement has targeted an Israeli military command base in the occupied Syrian Golan Heights with dozens of Katyusha rockets.\nHeavy rocket barrages were launched from southern Lebanon at Israeli military installations at the Galilee panhandle in the northern part of the 1948 Israeli-occupied territories as well as the occupied Golan Heights.\nIsraeli media outlets reported that sirens blared over incoming rocket fire in a number of communities in the Golan Heights and close to the border with Lebanon.\nThere were reports that nearly 70 missiles were launched from Lebanon at the southern Golan Heights.\nIn retaliation, Hezbollah has launched near-daily rocket attacks on Israeli positions."}, {"id": "7f6a79f2-02e0-4e54-9ca5-151902ae9b14", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-07 08:00", "url": "https://www.edp24.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}, {"id": "30181d85-daf5-45d0-94de-9a3148b2cace", "title": "Israeli forces take control of Gaza side of Rafah crossing with Egypt", "date": "2024-05-07 07:30", "url": "https://www.theargus.co.uk/news/national/24302162.israeli-forces-take-control-gaza-side-rafah-crossing-egypt/", "message": "Osama Hamdan, a Hamas official based in Beirut, said the militant group would not respond to military pressure or threats and would not accept any “occupying force” at the Rafah crossing.\nThe White House has said that the Israeli operation along the Gaza-Egypt border was not a full-on invasion of the city (AP Photo/Leo Correa)Footage released by the Israeli military showed a tank entering the crossing.\nDetails of the video matched known features of the crossing and showed Israeli flags flying from tanks that seized the area.\nThe Israeli military claimed it seized the crossing after receiving intelligence it was “being used for terrorist purposes”.\nPalestinians look at the destruction after an Israeli strike on residential building in Rafah, Gaza Strip (AP Photo/Ismael Abu Dayyah)An Egyptian Foreign Ministry spokesperson declined to immediately comment on the Israeli seizure."}]