[{"id": "73c10289-ffbe-415d-94ba-e07de911238c", "title": "Trump says there has  never been a more dangerous time  for Jews in America since Holocaust", "date": "2024-08-18 02:45", "url": "https://nypost.com/2024/08/17/us-news/trump-says-there-has-never-been-a-more-dangerous-time-for-jews-in-america-since-holocaust/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Former President Donald Trump declared there has “never been a more dangerous time since the Holocaust” to be Jewish in the US on Saturday night.\n“They turned him down because he’s Jewish,” Trump told a packed house at the Mohegan Sun Arena.\nShapiro has dismissed allegations that he was overlooked for his faith, saying Harris’ choice of Minn. Gov.\nREUTERS5 “What’s happening with Israel and Jewish people, there has never been a more dangerous time since the Holocaust if you happen to be Jewish in America,” Trump said.\nNew York City has seen nearly weekly anti-Israel protesters taking to the streets of Manhattan, often disrupting the city’s main transit hubs."}, {"id": "15d21483-440b-4ac2-b240-69c4926bb41f", "title": "Trump : Shapiro wasnt picked because he Jewish , antisemitism at a high", "date": "2024-08-18 07:00", "url": "https://www.jpost.com/american-politics/article-815148", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "“They turned him down for other reasons, but the primary reason is because he’s Jewish,” Trump claimed.\nTrump, continuing his speech on antisemitism, went on to claim that his opponent, VP Kamala Harris, had rejected selecting Penn.\n“They turned him down because he’s Jewish,” Trump told crowds in Connecticut.\nThere has never been a more dangerous time since the Holocaust if you happen to be Jewish in America,” he said.\nJosh Shapiro takes the stage at an election rally for Kamala Harris and Tim Walz, in Philadelphia, last week."}, {"id": "cd51718a-bcce-429d-b2f7-a11efc3c5f20", "title": "The Christian case for backing Israel", "date": "2024-08-18 14:00", "url": "https://www.christianpost.com:443/voices/the-christian-case-for-backing-israel.html", "domain": "christianpost.com", "domain_classification": "Unknown", "message": "Home Opinion The Christian case for backing IsraelThe Bible vividly portrays Israel as a central theme in God's plan for humanity.\nBut what does it mean to say we support Israel in today’s geo-political climate?\nI agree with my colleague, Dr. Jeff Myers, president of Summit Ministries and author of Should Christians Support Israel?\nClearly, through the prophet Isaiah, God chose Israel to be a beacon of hope, truth, and divine revelation to the entire world.\nBy supporting Israel, we are obeying God's will and aligning ourselves with His promises, purposes, and plans for the world."}, {"id": "3fc11e45-de48-4924-ad9c-86bbb8c68981", "title": "Victoria synagogue sees influx of congregants - Victoria Times Colonist", "date": "2024-08-18 12:45", "url": "https://www.timescolonist.com/local-news/victoria-synagogue-in-midst-of-major-reno-sees-influx-of-congregants-amid-conflict-9365586", "domain": "timescolonist.com", "domain_classification": "Unknown", "message": "Built in 1863, Congregation Emanu-El at 1461 Blanshard St. is the ­oldest synagogue still in use in Canada.\nTIMES COLONIST Built in 1863, Congregation Emanu-El at 1461 Blanshard Street is the oldest synagogue building still in use as a synagogue in Canada.\nTIMES COLONIST1 / 1 Built in 1863, Congregation Emanu-El at 1461 Blanshard St. is the ­oldest synagogue still in use in Canada.\nTIMES COLONIST Built in 1863, Congregation Emanu-El at 1461 Blanshard Street is the oldest synagogue building still in use as a synagogue in Canada.\nTIMES COLONIST AdvertisementCongregation Emanu-El — in its 161st year at Blanshard Street — is undertaking a $1.5-million restoration project as Canada’s oldest synagogue community sees an influx of new congregants."}, {"id": "d794ccd0-469b-442a-b957-1469216bd899", "title": "Did the united kingdom government fuel race riots with close border push ? ", "date": "2024-08-18 07:00", "url": "https://www.jpost.com/international/article-815146", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Before winning a landslide victory last month, the Labour Party said the country does need to offer asylum to those fleeing war or persecution.\nHowever, both the Labour Party and the then-governing Conservative Party campaigned on bringing down immigration and stopping boats of migrants and asylum seekers crossing into the UK.\nSubscribe to The Jerusalem Post Newsletter Subscribe NowThe UK saw anti-immigration protests turn violent as rioters targeted hotels housing asylum seekers and mosques.\nIn early August, rioters lit bins on fire and pushed them toward the Rotherham Holiday Inn Express, where asylum seekers were staying.\nBoswell said the event showed how asylum seekers can be targeted and not protected in such hotels."}]