[{"id": "f777e37e-6dca-48d0-9793-560316170486", "title": "Antisemitic incidents in united kingdom shatter prior records , numbering nearly 2 , 000 in six months", "date": "2024-08-12 08:45", "url": "https://ejpress.org/antisemitic-incidents-in-uk-shatter-prior-records-numbering-nearly-2000-in-six-months/", "domain": "ejpress.org", "domain_classification": "Unknown", "message": "By JNSThe number of antisemitic incidents in the United Kingdom from January to June of this year shattered previous records with nearly 2,000 incidents recorded, including more than 120 assaults, according to the CST, Community Security Trust.\nThe report recorded that while there were 964 incidents of antisemitism recorded in the first six months of 2023, this year that number has more than doubled to 1,978.\nThe previous high number of antisemitic incidents over a six-month period was 1,371, recorded in 2021.\n“As documented in CST’s Antisemitic Incidents Report 2023, there was an instant increase in antisemitic incident levels in the UK following Hamas’ attack on Israel, before Israel had coordinated any large-scale military response in Gaza,” the CST report stated.\nAccording to the report, “anti-Jewish discourse” accounted for more than 1,000 of all incidents."}, {"id": "2c5e92ee-16ff-475e-a6b6-07bd45f9f3b9", "title": "Jewish man attacker charged with hate crime - The Jerusalem Post", "date": "2024-08-12 06:00", "url": "https://www.jpost.com/diaspora/article-814325", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "A man has been charged with a hate crime after allegedly stabbing a Jewish man near the Chabad Hasidic movement’s headquarters in Brooklyn in the early hours of Saturday morning.\nSumpter has been charged with eight felonies, including assault as a hate crime, for the incident, according to an arrest report.\nIn July, there were 30 antisemitic incidents reported to police, three times higher than the 10 incidents reported during the same month last year.\nJews have been targeted in reported hate crimes more than all other groups combined almost every month in the past year.\nIn another incident, in April, a man was charged with a number of hate crimes after aiming his car at Orthodox Jews in Brooklyn."}, {"id": "10e8cc0b-9d61-481e-9654-39369f7c5d22", "title": "Trump rhetoric vs . Harris policies – J - Wire", "date": "2024-08-12 10:30", "url": "https://www.jwire.com.au/trumps-rhetoric-vs-harriss-policies/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Trump’s rhetoric vs. Harris’s policiesRead on for articleFormer President Donald Trump drives liberal Jews to distraction when he says that American Jews have to be crazy to vote for his Democratic opponent.\nAmerican Jewish concerns and convictionsAccording to a Pew survey of American Jews from March, 89% of American Jews are supportive of Israel.\nA June 2024 survey of American Jews conducted by the American Jewish Committee showed that their commitment has only grown since Oct. 7.\nTlaib and Bush, of course are outspoken in their hatred for Israel and for American Jews who support Israel.\nThis week pollster Richard Baris released a survey that found Harris’s support among Jews stands at a mere 52.7%, with 45.9% favoring Trump."}, {"id": "76e4485d-929b-432e-9e23-2b614591f896", "title": "Doug Emhoff reveals what world leaders  whispered  to him at the Olympics about Biden dropping out and his wife Kamala becoming the nominee", "date": "2024-08-12 14:30", "url": "https://www.dailymail.co.uk/news/article-13735487/doug-emhoff-kamala-harris-world-leaders-olympics.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Doug Emhoff revealed what world leaders told him at the Olympics about his wife Kamala Harris' campaign for president.\nThe second gentleman led the U.S. delegation for the Summer Games closing ceremony while Harris was campaigning back in the United States.\nPresident Biden claims that after he won the 2020 election he reassured fellow world leaders America was 'back' after Donald Trump pursued a more isolationist strategy.\nYou can't let him win,'' Biden told Time magazine.\nThe second gentleman was in the stands women's soccer team won their first gold medal since 2012."}, {"id": "fbdf95c1-1e98-4f60-97a9-97b4a848da19", "title": "Elon Musk to interview Trump on X social media network", "date": "2024-08-12 14:00", "url": "https://www.theglobeandmail.com/world/us-politics/article-elon-musk-to-interview-trump-on-x-social-media-network/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The interview on Musk’s social media platform could allow Trump to reach a different audience than the conservative faithful who attend his rallies and watch his interviews on Fox News.\nThe interview will be hosted live using Trump’s official X account, his campaign said on Sunday.\nTrump frequently posts on his Truth Social social media platform, which was launched in February 2022.\nThe world’s richest person backed Democratic President Joe Biden in 2020 but has tacked rightward since and endorsed the Republican following the attempted assassination of Trump in July.\nMusk in November 2023 endorsed an antisemitic post on X that said members of the Jewish community were stoking hatred against white people."}, {"id": "8d5d002d-dd13-4316-8a20-d00968a037c3", "title": "  Entertainment guaranteed : Musk to host Trump interview on X", "date": "2024-08-12 15:15", "url": "https://www.dailysabah.com/world/americas/entertainment-guaranteed-musk-to-host-trump-interview-on-x", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "Billionaire entrepreneur Elon Musk is set to interview Republican presidential candidate Donald Trump on the X social media platform this Monday, an event that could add new twists to the already unpredictable U.S. presidential election.\nThe interview will be hosted live using Trump's official X account, his campaign said on Sunday.\nTrump frequently posts on his Truth Social social media platform, which was launched in Feb. 2022.\nThe world's richest person backed Democratic President Joe Biden in 2020 but has tacked rightward since and endorsed the Republican following the attempted assassination of Trump in July.\nMusk in Nov. 2023 endorsed an antisemitic post on X that said members of the Jewish community were stoking hatred against white people."}, {"id": "460e2c2c-2370-479b-9363-586d8ce06e05", "title": "Elon Musk to host interview with Donald Trump on X", "date": "2024-08-12 11:30", "url": "https://www.dailysabah.com/world/americas/elon-musk-to-host-interview-with-donald-trump-on-x", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "Billionaire entrepreneur Elon Musk is set to interview Republican presidential candidate Donald Trump on the X social media platform this Monday, an event that could add new twists to the already unpredictable U.S. presidential election.\nThe interview will be hosted live using Trump's official X account, his campaign said on Sunday.\nTrump frequently posts on his Truth Social social media platform, which was launched in Feb. 2022.\nThe world's richest person backed Democratic President Joe Biden in 2020 but has tacked rightward since and endorsed the Republican following the attempted assassination of Trump in July.\nMusk in Nov. 2023 endorsed an antisemitic post on X that said members of the Jewish community were stoking hatred against white people."}, {"id": "a215d971-8b31-4aaf-8196-4328a7329bb5", "title": "Elon Musk to interview Trump on X social media network", "date": "2024-08-12 11:00", "url": "https://www.thestar.com.my/news/world/2024/08/12/elon-musk-to-interview-trump-on-x-social-media-network", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "WASHINGTON (Reuters) -Republican presidential candidate Donald Trump was back on social media platform X ahead of his interview with billionaire entrepreneur Elon Musk on Monday in an event that could inject more surprises into the turbulent U.S. presidential election.\nThe interview on Musk's social media platform could allow Trump to reach a different audience than the conservative faithful who attend his rallies and watch his interviews on Fox News.\nThe interview will be hosted live using Trump's official X account, his campaign said on Sunday.\nX and the Trump campaign did not immediately respond to a request for information on whether there had been a pro-Trump ad buy.\nMusk, who heads electric car company Tesla, also started an external super PAC spending group to support Trump’s campaign."}, {"id": "aa725e7b-f803-41f3-a80e-0b678bf925d9", "title": "Elon Musk to interview Trump on X social media network", "date": "2024-08-12 15:15", "url": "https://www.rappler.com/world/us-canada/elon-musk-interview-trump-social-media-network/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "The interview on Musk’s social media platform could allow Trump to reach a different audience than the conservative faithful who attend his rallies and watch his interviews on Fox News.\nThe interview will be hosted live using Trump’s official X account, his campaign said on Sunday.\nThe world’s richest person backed Democratic President Joe Biden in 2020 but has tacked rightward since and endorsed the Republican following the attempted assassination of Trump in July.\nMusk, who heads electric car company Tesla Inc, also started a fundraising organization to support Trump’s campaign.\nMusk in November 2023 endorsed an antisemitic post on X that said members of the Jewish community were stoking hatred against white people."}, {"id": "705e9a06-3ad0-4f7a-bc56-24909573c11f", "title": "Elon Musk to interview Trump on X social media network", "date": "2024-08-12 10:30", "url": "https://www.marketscreener.com/business-leaders/ELON-MUSK-1364/news/Elon-Musk-to-interview-Trump-on-X-social-media-network-47624090/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "WASHINGTON, Aug 12 (Reuters) - Billionaire entrepreneur Elon Musk is due to interview Republican presidential candidate Donald Trump on the X social media network on Monday in an event that could inject more surprises into the turbulent U.S. presidential election.\nThe interview on Musk's social media platform could allow Trump to reach a different audience than the conservative faithful who attend his rallies and watch his interviews on Fox News.\nThe interview will be hosted live using Trump's official X account, his campaign said on Sunday.\nTrump frequently posts on his Truth Social social media platform, which was launched in February 2022.\nThe world's richest person backed Democratic President Joe Biden in 2020 but has tacked rightward since and endorsed the Republican following the attempted assassination of Trump in July."}, {"id": "11b3fb36-c410-42a6-a507-1cb781de94fe", "title": "Elon Musk to interview Trump on X social media network", "date": "2024-08-12 18:15", "url": "https://www.swissinfo.ch/eng/elon-musk-to-interview-trump-on-x-social-media-network/86686993", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Trump back on social media site X ahead of interview with Elon Muskreuters_tickers5 minutesBy Richard Cowan and Andy SullivanWASHINGTON (Reuters) -Republican presidential candidate Donald Trump was back on social media platform X ahead of his interview with billionaire entrepreneur Elon Musk on Monday in an event that could inject more surprises into the turbulent U.S. presidential election.\nHe quickly followed with a half-dozen other posts, a potential indication he will be more active on X going forward.\nTrump frequently posts on his Truth Social platform, which was launched in February 2022, but his posts there reach a much smaller audience than on X.\nThe interview on Musk’s social media platform could allow Trump to reach a different audience than the conservative faithful who attend his rallies and watch his interviews on Fox News.\nThe interview will be hosted live using Trump’s official X account, his campaign said on Sunday."}, {"id": "20e8ef2f-1eb7-471d-ac72-4558b414e4f0", "title": "Imam Asad Zaman : An Islamist extremist hosted by Tim Walz", "date": "2024-08-12 16:00", "url": "https://www.jpost.com/international/article-814387", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Tim Walz, Kamala Harris's new running mate in her presidential campaign, has hosted an extremist Islamist Imam on several occasions, the Washington Examiner first reported over the weekend.\nWalz hosted Zaman three times in 2019, once in 2020, and again in 2023, among others, the Washington Examiner reported.\nThe Washington Free Beacon found last week that Walz appeared alongside an antisemitic scholar at a conference called \"Challenging Islamophobia,\" hosted by CAIR in 2019.\nImam Asad Zaman pledged his support to Palestinians after October 7 and has previously promoted a Neo-Nazi propaganda film expressing support for Hitler, the Washington Examiner revealed.\nThe Washington Examiner claimed Friday that Walz has also donated $100,000 to the Muslim American Society of Minnesota, a non-profit headed by Asad Zaman."}, {"id": "514613fa-276b-46de-aa92-3dc00f8fb31d", "title": "Walzing With Hamas | Frontpage Mag", "date": "2024-08-12 04:45", "url": "https://www.frontpagemag.com/walzing-with-hamas/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "Walz’s stolen valor scandal isn’t going away anytime soon, and another one looms in its wake: Walz has repeatedly associated with Muslim leaders with known ties to Hamas and other jihad groups.\nEven worse, CAIR officials have refused to denounce Hamas and Hizballah as terrorist groups.\nCAIR is an unindicted co-conspirator in a Hamas terror funding case — so named by the Justice Department.\nSeveral former CAIR officials have been convicted of various crimes related to jihad terror.\n“Islamophobia” is a smear propaganda term designed to intimidate people into thinking it is wrong and “bigoted” to oppose jihad terror and Sharia oppression."}, {"id": "481f5094-9de8-48df-8362-761838b7cb9d", "title": "Trump back on social media site X ahead of interview with Elon Musk", "date": "2024-08-12 22:15", "url": "https://japantoday.com/category/world/trump-back-on-social-media-site-x-ahead-of-interview-with-elon-musk", "domain": "japantoday.com", "domain_classification": "Unknown", "message": "REUTERS/Jonathan Ernst/File PhotoBy Richard Cowan and Andy SullivanRepublican presidential candidate Donald Trump was back on social media platform X ahead of his interview with billionaire entrepreneur Elon Musk on Monday in an event that could inject more surprises into the turbulent U.S. presidential election.\nThe interview on Musk's social media platform could allow Trump to reach a different audience than the conservative faithful who attend his rallies and watch his interviews on Fox News.\nThe interview will be hosted live using Trump's official X account, his campaign said on Sunday.\nX and the Trump campaign did not immediately respond to a request for information on whether there had been a pro-Trump ad buy.\nMusk, who heads electric car company Tesla, also started an external super PAC spending group to support Trump’s campaign."}, {"id": "60dc851a-ac04-4f35-9656-55c6432585a2", "title": "State and Local Efforts to Divest From Israel Are Gaining Steam", "date": "2024-08-12 22:30", "url": "https://truthout.org/articles/state-and-local-efforts-to-divest-from-israel-are-gaining-steam/", "domain": "truthout.org", "domain_classification": "Unknown", "message": "At least $1.6 billion in Israel Bonds is held between state governments, municipal governments, and public pension funds nationwide.\nAcross the U.S., dozens of states and municipalities purchase Israel Bonds.\nPalm Beach County, Florida, recently made headlines for being the world’s largest investor in Israel Bonds with $700 million in holdings.\nIn Ohio, besides Cuyahoga County’s $16 million in holdings, 14 other Ohio counties also hold Israel Bonds, while the Ohio Treasury has more than $260 million in Israel Bonds.\nA Break the Bonds campaign based in Providence, Rhode Island, has also gathered steam since last year."}, {"id": "a58c5c4c-58b3-4ddc-ae9d-0aa7a885eb0c", "title": "Elon Musk to interview Trump on X social media account", "date": "2024-08-12 11:30", "url": "https://www.goulburnpost.com.au/story/8727587/elon-musk-to-interview-trump-on-x-social-media-account/?cs=14264", "domain": "goulburnpost.com.au", "domain_classification": "Unknown", "message": "The interview will be hosted live using Trump's official X account, his campaign said.\nTrump's access to his account, @realDonaldTrump, was restored a month into Musk's ownership of X after being suspended by the platform's previous owners following the January 6, 2021, attack on Congress by his supporters."}]