[{"id": "a6c0d78d-95c0-45c0-aaf5-500e1ae6483c", "title": "Fire rains down from the sky as Israel launches missile attack on Gaza", "date": "2024-06-04 00:45", "url": "https://www.dailymail.co.uk/news/article-13490561/Israel-missile-attack-Gaza-Middle-East.html", "message": "Fire rains down from the sky during Israel's latest missile attack on Gaza as the Middle Eastern conflict shows no signs of ending.\nPhotographs taken today show smoke and flames engulfing buildings in the Al Bureij Camp in Deir al-Balah — a city in the central Gaza strip.\nIt comes after Israel's military confirmed the deaths of four more hostages held in Gaza since the October 7 attack on a music festival.\n'Under the proposal, Israel will continue to insist these conditions are met before a permanent ceasefire is put in place.\nThe notion that Israel will agree to a permanent ceasefire before these conditions are fulfilled is a non-starter.'"}, {"id": "8fef518e-1a67-45a8-a390-b3e3db7bf3be", "title": "US to Buy Norwegian Joint Strike Missile for its F - 35A Stealth Aircraft", "date": "2024-06-04 00:00", "url": "https://theaviationist.com/2024/06/03/us-to-buy-norwegian-jsm/", "message": "F-35A Expands Strike Capabilities with New JSM (Joint Strike Missile) Contract.\n“The Joint Strike Missile (JSM) is an air-launched strike missile and is designed to fit into the internal weapons bay and to fulfil complex missions, such as ASuW (Anti-Surface Warfare) and land attack.\nThe JSM is the air-launched version of Kongsberh’s NSM (Naval Strike Missile).\nThe F-35 cannot carry large missiles like the AGM-158C LRASM (Long-Range Anti-Ship Missile) and the AGM-158A JASSM (Joint Air-to-Surface Standoff Missile) inside its internal weapons bay in the underbelly.\nConsistent with F-35’s ‘Strike Orientation’Like the ship-borne NSM, the JSM too can be used against both ship and land-targets, making it versatile and allowing commanders significant tactical flexibility."}, {"id": "25df564e-097f-429d-a72a-c5d4d9c763f1", "title": "The atomic club", "date": "2024-06-04 04:30", "url": "https://www.thenews.com.pk/print/1196564-the-atomic-club", "message": "Within two weeks of these nuclear tests, Pakistan followed suit by demonstrating its own nuclear capability on May 18, 1998.\nIndia’s aggressive pursuit of its nuclear capability leads us to one conclusion: the international community, throughout history, has largely turned a blind eye towards India’s nuclear developments.\nIn fact, the global nuclear powers, particularly the US, failed to implement stringent measures against India’s nuclear weapons programme.\nPakistan was indeed a reluctant entrant to the nuclear club.\nDespite the potential for heightened tensions following the launch of the missile by India, Pakistan chose to approach the situation with measured calmness."}, {"id": "84b04ad5-04d1-4593-bcf0-4745a4e174af", "title": "2 Hezbollah fighters die in Lebanon - Newspaper", "date": "2024-06-04 02:45", "url": "https://www.dawn.com/news/1837655/2-hezbollah-fighters-die-in-lebanon", "message": "BEIRUT: Hezbollah said two of its fighters were killed by Israeli fire on Monday, after Lebanese official media reported fatalities in Israeli strikes on a car and a motorcycle in the country’s south.\nAlmost eight months of regular cross-border clas­hes between the Iran-backed Hezbollah group, a Hamas ally, and Israel have intensified in recent days.\nThe latest violence came as Iran’s acting foreign minister Ali Bagheri was visiting Lebanon, where he was expected to meet Hezbollah leader Hassan Nasrallah.\nOn Sunday, Hezbollah said its fighters had bombarded two army positions in the Israeli-annexed Golan Heights after deadly Israeli strikes on south Lebanon, which an official said killed two shepherds.\nThe violence since early October has killed at least 453 people in Lebanon, mostly fighters but including 88 civilians, according to a tally."}, {"id": "0402ad73-e921-41bf-89e9-eab700d4adb5", "title": "BBC pundit forced to apologise after posting image of Rishi Sunak , President Biden and other world leaders with Hitler moustaches that labelled them the  Kids Killers Union  ", "date": "2024-06-04 01:00", "url": "https://www.dailymail.co.uk/news/article-13491255/BBC-pundit-forced-apologise-posting-image-Rishi-Sunak-President-Biden-world-leaders-Hitler-moustaches-labelled-Kids-Killers-Union.html", "message": "A BBC pundit has been forced to apologise after posting an image of Rishi Sunak, President Biden and other world leaders with Hitler moustaches.\nQasim Sheikh, a former Scotland international cricketer, reposted the picture of the prime minister, along with other world leaders with the caption 'Kids Killers Union'.\nThe post featured President Biden, Binyamin Netanyahu, the Israeli prime minister, Olaf Scholz, the German chancellor and Ursula von der Leyen, the president of the European Commission.\nThe sports pundit, 39, shared the post in January as well as other inflammatory statements appearing to justify the horrific October 7 attacks on Israel.\nTo make it even worse the oppressor Israel has tried to blame someone else for the bombing.'"}, {"id": "6c4f31e1-4f01-4e6f-8d9d-d1e7e324f5e3", "title": "Yemen Houthis claim launching missiles at Israeli port city", "date": "2024-06-04 03:00", "url": "https://article.wn.com/view/2024/06/04/Yemens_Houthis_claim_launching_missiles_at_Israeli_port_city/", "message": "Yemen's Houthi group on Monday said they launched a ballistic missile attack on southern Israel's port city of Eilat, the group's Military Spokesman Yahya Sarea said in a statement.\nThe missile forces of the Houthi group targeted a military site in Eilat with a new self-made missile called \"Palestine,\" said the Houthi... read full story"}, {"id": "73a944e7-315e-4f20-a708-898eb4df5456", "title": "Nuclear war is unimaginable – but US author wants us to try", "date": "2024-06-04 02:00", "url": "https://www.nzherald.co.nz/the-listener/books/nuclear-war-is-unimaginable-but-us-author-wants-us-to-try/HQHNZSFVKFA6ZAZWWDWLK27XJA/", "message": "Gone in 72 minutes: Writer Anne Jacobson outlines a nuclear war scenario that sees our world destroyed in little more than one hour.\nPhoto / Getty ImagesBook review: Day in and day out, the American Secret Service trains its staff for nuclear war.\nNuclear war is unimaginable – but Jacobsen would like you to try.\nHer minute by minute timeline of unfolding Armageddon reveals long practised US and Russian plans for nuclear war.\nA nuclear war, of the kind planned for and rehearsed by the US and Russian military, will lead to the deaths of billions of people."}, {"id": "5308523c-705c-4097-a7e7-0b4a5ad08c02", "title": "Sherlock Holmes - Talking Pictures TV", "date": "2024-06-04 02:45", "url": "https://www.tvguide.co.uk/schedule/cdb90c2c-2943-5f73-bef7-021becbaf00f/sherlock-holmes", "message": "Sherlock HolmesTalking Pictures TV 8:00 AM to 8:35 AM Tuesday 4 June Share Add toCalendar +The Case of the Reluctant Carpenter Season 1 Episode 21 of 39 S SubtitlesCovent Garden is rocked by a bombing, and the culprit threatens to strike again if his demands are not met.\nHolmes and Watson race against time to find the second deviceSherlock Holmes airs on Talking Pictures TV at 8:00 AM, Tuesday 4 June .\n(Subtitles.)\nLearn more about Sherlock Holmes and other movie/drama on our drama page"}, {"id": "1088977b-3ff3-447f-9f47-b8c1ebbfa067", "title": "Man charged with murder over young surfer stabbing", "date": "2024-06-04 03:45", "url": "https://www.illawarramercury.com.au/story/8651498/man-charged-with-murder-over-young-surfers-stabbing/", "message": "Police are still trying to track down the weapon used to kill Kye Schaefer, who was stabbed multiple times in the chest and neck during the attack on May 2."}, {"id": "cf239b75-b5b3-4dd1-92d8-4c3eed7e739f", "title": "Houthis claim launching missiles at Israeli port city", "date": "2024-06-04 03:00", "url": "https://www.prokerala.com/news/articles/a1536644.html", "message": "Sanaa, June 4 : Yemen's Houthi group has said they launched a ballistic missile attack on southern Israel's port city of Eilat, the group's Military Spokesman Yahya Sarea said in a statement.\nThe missile forces of the Houthi group targeted on Monday a military site in Eilat with a new self-made missile called \"Palestine\", said the Houthi official, claiming that \"the operation achieved its goal successfully\", Xinhua news agency reported.\nHe also pledged continued military operations \"in support of the Palestinian people\" until Israel stops its attacks on the Palestinian enclave.\nEarlier on Monday, Israeli media outlets reported that the Israeli forces in Eilat intercepted a ballistic missile coming from the direction of the Red Sea.\nSeveral ships had been reportedly damaged by Houthi attacks."}, {"id": "79d87402-52c0-43a9-99bd-ff8c61fdc8c2", "title": "Kye Schaefer breakthrough : Man is charged with murdering surfer after leaving the water in Coffs Harbour", "date": "2024-06-04 03:00", "url": "https://www.dailymail.co.uk/news/article-13491525/Kye-Schaefer-man-charged-murder-surfer.html", "message": "A man has been charged with murder after a young surfer was allegedly stabbed to death moments after leaving the water.\nKye Schaefer, 21, was allegedly stabbed in the neck and chest after stepping out of the surf at Park Beach on Ocean Parade in Coffs Harbour around 6.40am on May 2.\nNSW Police revealed on Tuesday a 36-year-old homeless man had been arrested at a Coffs Harbour correctional facility.\nThe man was refused bail to appear before Coffs Harbour Local Court on Tuesday.\nKye was treated at the scene and transported to Coffs Harbour Base Hospital, but died shortly after arriving from serious neck and chest wounds."}, {"id": "8072f92f-12d8-41d1-ba9e-d1edafb5b811", "title": "Mishawaka teen charged with stabbing mom , 2 dogs ruled insane", "date": "2024-06-04 01:15", "url": "https://wsbt.com/news/local/mishawaka-teen-charged-with-stabbing-mom-13-times-2-dogs-ruled-reason-insanity-acquitted-manipulated-satan-kill-demon-police-investigation-not-trial-mother-agrees-mental-health-ill-dangerous-disabled", "message": "No trial for the Mishawaka teen accused of stabbing his s.The courts say 17-year-old Caden Rutledge who was being charged as an adult, is not responsible by reason of insanity.\nDuring the investigation Rutledge claims he was manipulated by Satan to stab his mother and 2 dogs when questioned by police.\nCaden Rutledge was set for trial until the courts ruled him not responsible by reason of insanity.\nBack in August of 2023, Mishawaka Police found Rutledge's mother bleeding from multiple stab wounds to her face, neck and head at her neighbor's home.\nRutledge admitted stabbing his mother to \"kill the demon inside of her and that it was the right thing to do.\""}, {"id": "8ee71ca3-a7e9-4a03-89e1-16aba91782bc", "title": "Houthis Claim Launching Missiles At Israeli Port City", "date": "2024-06-04 02:00", "url": "https://menafn.com/1108292275/Houthis-Claim-Launching-Missiles-At-Israeli-Port-City", "message": "(MENAFN- IANS) Sanaa, June 4 (IANS) Yemen's Houthi group has said they launched a ballistic missile attack on southern Israel's city of Eilat, the group's Military Spokesman Yahya Sarea said in a statement.\nThe missile forces of the Houthi group targeted on Monday a military site in Eilat with a new self-made missile called \"Palestine\", said the Houthi official, claiming that \"the operation achieved its goal successfully\", Xinhua news agency reported.\nHe also pledged continued military operations \"in support of the Palestinian people\" until Israel stops its on the Palestinian enclave.\nEarlier on Monday, Israeli media outlets reported that the Israeli forces in Eilat intercepted a ballistic missile coming from the direction of the Red Sea.\nSeveral ships had been reportedly damaged by Houthi attacks."}, {"id": "d0b3c7bc-1b11-4305-9bc4-9010497e88e6", "title": "The Latest | Four more Israeli hostages declared dead , and Palestinians seek to join genocide case", "date": "2024-06-04 03:30", "url": "https://wtop.com/national/2024/06/the-latest-israel-finds-the-remains-of-a-presumed-hostage-as-the-us-pushes-a-cease-fire-plan/", "message": "At the top U.N. court, Palestinian officials asked Monday to join South Africa’s case accusing Israel of committing genocide in Gaza.\nCurrently:— Israel declares four hostages are dead in Gaza, including three older men who appeared in video.\nWhen Biden made the announcement he called it an Israeli offer that includes an “enduring cease-fire” and Israeli withdrawal from Gaza if Hamas releases all hostages it is holding.\nIn the second phase, all remaining living hostages would be released including soldiers, and Israeli forces would withdraw from Gaza.\nBiden last week announced what he called an Israeli offer that includes an “enduring cease-fire” and Israeli withdrawal from Gaza if Hamas releases all hostages it is holding."}, {"id": "fb16edd8-977a-432c-84da-88b830b313a6", "title": "Iran Update , June 3 , 2024 | Institute for the Study of War", "date": "2024-06-04 02:45", "url": "https://www.understandingwar.org/backgrounder/iran-update-june-3-2024", "message": "Iran Update, June 3, 2024Ashka Jhaveri, Annika Ganzeveld, Andie Parry, Kathryn Tyson, Kelly Campa, Kitaneh Fitzpatrick, and Brian CarterInformation Cutoff: 2:00pm ETThe Iran Update provides insights into Iranian and Iranian-sponsored activities abroad that undermine regional stability and threaten US forces and interests.\n[63]Key Takeaways:Iranian Presidential Elections: Hardliners overwhelmingly dominate the candidate pool for the upcoming Iranian presidential election.\n[71] Israeli forces located tunnel shafts, and a weapons stash including long-range rockets, ”combat transmission systems,” and explosive charges.\n[74] Three Palestinian militias have mortared Israeli forces along the Egypt-Gaza Strip border since CTP-ISW's last data cut off on June 2.\n[85] The al Aqsa Martyrs’ Brigades fired small arms and detonated IEDs targeting Israeli forces in the Balata refugee camp in Nablus."}, {"id": "2e0a506c-f191-4fe2-bc06-23d38dc171e2", "title": "Ukraine claims it hit missile system in Russian territory with Western weapons", "date": "2024-06-04 03:00", "url": "https://us.cnn.com/2024/06/03/europe/ukraine-western-weapons-hit-russian-territory-intl-latam/", "message": "CNN —Ukrainian forces claimed Monday that they had successfully hit a Russian S-300 missile system using Western-supplied weapons inside Russian territory.\nOn Russian territory.\nThe first days after permission to use Western weapons on enemy territory,” Ukrainian government minister Iryna Vereshchuk posted on Facebook alongside a picture purporting to show the strike.\nThis comes just days after US President Joe Biden gave Ukraine permission to carry out limited strikes using US weapons in Russian territory around Kharkiv, after several European nations had removed restrictions on how the weapons can be used.\nWhile the removal of this taboo appears to mark a new chapter in the war, Russia has already experienced Ukrainian strikes with Western weapons on territory to which it lays claim."}, {"id": "cbab9b6e-d800-45a4-9318-cbf47a0799d5", "title": "16 killed in Israeli strike near Aleppo", "date": "2024-06-04 03:00", "url": "https://article.wn.com/view/2024/06/04/16_killed_in_Israeli_strike_near_Aleppo/", "message": "BEIRUT: A war monitoring body on Monday said that 16 members from groups’ allied with Iran, were killed in an Israeli strike near the northern Syrian city of Aleppo.\nState media also reported the ‘deadly Israeli attack’.\n“The death toll of the Israeli strike on a factory in Hayyan, in the western Aleppo province has... read full story\"The death toll of the Israeli strike on a factory in Hayyan, in the western Aleppo province has risen to 16 pro-Iran group members, including Syrian and foreigner fighters\""}, {"id": "71e8bb68-e6fd-4af1-8cb1-062b6aeef409", "title": "16 killed in Israeli strike near Aleppo - Newspaper", "date": "2024-06-04 02:45", "url": "https://www.dawn.com/news/1837658/16-killed-in-israeli-strike-near-aleppo", "message": "BEIRUT: A war monitoring body on Monday said that 16 members from groups’ allied with Iran, were killed in an Israeli strike near the northern Syrian city of Aleppo.\n“The death toll of the Israeli strike on a factory in Hayyan, in the western Aleppo province has risen to 16 pro-Iran group members, including Syrian and foreigner fighters” stated the Syrian Observatory for Human Rights.\nA Syrian defence ministry statement read “after midnight, the Israeli enemy launched an air attack from the southeast of Aleppo, targeting some positions” near the city.\nOn Wednesday, according to the Observatory, Israeli strikes in western and central Syria killed a girl and six fighters working with Hezbollah (including three Syrians).\nIn March, the Observatory had said that Israeli air strikes near Aleppo’s airport had killed 52 people."}, {"id": "83876aa2-b4d2-4a21-a6bc-982df56c3b0d", "title": "Russia Ukraine war live : Kyiv fires US weapon Himars inside Russia for the first time", "date": "2024-06-04 04:30", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-war-live-news-putin-weapons-b2556153.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Russian sources claim Ukraine has fired US-made weapons inside Russia’s Belgorod for the first time as Washington lifted the ban on using its ammunition on Moscow.\nLast week, the US allowed Ukraine a limited right to use US-made weapons at military targets inside Russia as Russian forces intensified their offensive on Ukrainian cities and villages.\nThis comes as Ukrainian president Volodymyr Zelensky has accused China of helping Russia to disrupt an upcoming Swiss-organised peace conference on the war in Ukraine.\nSpeaking at Asia’s premier security conference, Mr Zelensky said that China is pressuring other countries and their leaders not to attend the upcoming talks."}, {"id": "3dc81748-47d4-432b-a66d-7c98bff60387", "title": "Ukraine claims it hit missile system inside Russian territory using Western weapons - LocalNews8 . com", "date": "2024-06-04 02:45", "url": "https://localnews8.com/news/national-world/cnn-world/2024/06/03/ukraine-claims-it-hit-missile-system-inside-russian-territory-using-western-weapons/", "message": "By AnneClaire Stapleton, CNN(CNN) — Ukrainian forces claimed Monday that they had successfully hit a Russian S-300 missile system using Western-supplied weapons inside Russian territory.\nOn Russian territory.\nThe first days after permission to use Western weapons on enemy territory,” Ukrainian government minister Iryna Vereshchuk posted on Facebook alongside a picture purporting to show the strike.\nThis comes just days after US President Joe Biden gave Ukraine permission to carry out limited strikes using US weapons in Russian territory around Kharkiv, after several European nations had removed restrictions on how the weapons can be used.\nUkraine has frequently targeted occupied Crimea, which Russia annexed in 2014, using “Storm Shadow” missiles provided by the UK."}, {"id": "f62683d6-719d-4144-8376-acaeca1dcd94", "title": "Israel - Hamas : Israel declares four more hostages dead in Gaza", "date": "2024-06-04 00:00", "url": "https://www.theage.com.au/world/middle-east/mark-of-disgrace-israel-declares-four-hostages-dead-in-gaza-20240604-p5jj0b.html", "message": "Jerusalem: Four more hostages kidnapped on October 7 last year have been declared dead by the Israeli military, including three older adults seen in a Hamas video begging to be released.\nThe announcement on Tuesday heightens pressure on the Israeli government to agree to a US ceasefire proposal that could secure the return of the hostages still held in Gaza and end the eight-month war.\nDeceased hostage Nadav Popplewell.\nCredit: Hostages Families Forum Headquarters via APMilitants are believed to be holding about 80 hostages alive and the remains of 43 others.\nSince the Biden administration announced the three-phase ceasefire proposal on Saturday, Israel has seen some of its largest protests calling on the government to bring the surviving hostages home."}, {"id": "76bc5b5d-bd30-43a6-af3b-2c19a006cb35", "title": "Four more Israeli hostages have died in Hamas custody", "date": "2024-06-04 01:15", "url": "https://www.nbcdfw.com/news/national-international/four-more-israeli-hostages-died-hamas-custody/3558188/", "message": "But in March, Al-Qassam Brigades spokesperson Abu Ubaida announced that Perry, Metzger and Cooper were among the seven hostages killed in an Israeli airstrike on Gaza.\nLast month, Popplewell was seen in a propaganda video released by Hamas, Israeli media reported.\nPopplewell's elderly mother, Hanna Perry, was among a group of more than a dozen Israeli hostages who were released on Nov. 24 as part of a temporary cease-fire deal.\n“We are really worried about their condition.”Perry, who was also 80, and lived in the same kibbutz as Metzger, Hagari said.\nSome 125 Israeli hostages remain in captivity nearly eight months after they were abducted in a deadly surprise attack by Hamas that sparked the ongoing war in Gaza."}, {"id": "934bcaa8-05b2-453e-a0c4-9a7656bb8dd5", "title": "Israel - Hamas : Israel declares four more hostages dead in Gaza", "date": "2024-06-04 00:15", "url": "https://www.brisbanetimes.com.au/world/middle-east/mark-of-disgrace-israel-declares-four-hostages-dead-in-gaza-20240604-p5jj0b.html", "message": "Jerusalem: Four more hostages kidnapped on October 7 last year have been declared dead by the Israeli military, including three older adults seen in a Hamas video begging to be released.\nThe announcement on Tuesday heightens pressure on the Israeli government to agree to a US ceasefire proposal that could secure the return of the hostages still held in Gaza and end the eight-month war.\nDeceased hostage Nadav Popplewell.\nCredit: Hostages Families Forum Headquarters via APMilitants are believed to be holding about 80 hostages alive and the remains of 43 others.\nSince the Biden administration announced the three-phase ceasefire proposal on Saturday, Israel has seen some of its largest protests calling on the government to bring the surviving hostages home."}, {"id": "281b7f4c-1829-4855-ba09-40448b0c83fc", "title": "Israel declares 4 more hostages dead in Gaza , including 3 older men from Hamas video", "date": "2024-06-04 02:45", "url": "https://www.koreatimes.co.kr:443/www/world/2024/06/501_375929.html", "message": "Four more hostages kidnapped on Oct. 7 were declared dead by the Israeli military — including three older men seen in a Hamas video begging to be released.\nAbout 80 hostages in Gaza are believed to be alive, alongside the remains of 43 others.\nAlthough Biden said the proposal was Israeli, the Israeli leadership has appeared to distance itself from the plan, vowing to keep conducting military operations against Hamas until the militant group is destroyed.\nIsraeli bombardments and ground operations in Gaza have killed more than 36,000 Palestinians, according to Gaza’s Health Ministry , which does not distinguish between combatants and civilians.\nIsrael has been expanding its offensive in the southern city of Rafah, once the main hub of humanitarian aid operations."}, {"id": "1acfdf73-c2d6-4615-b67f-38ac73e61d10", "title": "Man charged with murder over young surfer stabbing", "date": "2024-06-04 04:15", "url": "https://www.yasstribune.com.au/story/8651498/man-charged-with-murder-over-young-surfers-stabbing/?cs=14264", "message": "Kye Schaefer was stabbed multiple times in the chest and neck in a car park at Coffs Harbour, on the NSW north coast, after he arrived at the beach early on May 2."}, {"id": "8ba3efd3-f358-4a01-92eb-742917cb04cc", "title": "Man charged with murder over young surfer stabbing", "date": "2024-06-04 04:15", "url": "https://www.muswellbrookchronicle.com.au/story/8651498/man-charged-with-murder-over-young-surfers-stabbing/?cs=9676", "message": "Kye Schaefer was stabbed multiple times in the chest and neck in a car park at Coffs Harbour, on the NSW north coast, after he arrived at the beach early on May 2."}, {"id": "e8669743-9edc-41b3-a573-025dd80dd632", "title": "Man charged with murder over young surfer stabbing", "date": "2024-06-04 04:15", "url": "https://www.theleader.com.au/story/8651498/man-charged-with-murder-over-young-surfers-stabbing/?cs=30776", "message": "Police are still trying to track down the weapon used to kill Kye Schaefer, who was stabbed multiple times in the chest and neck during the attack on May 2."}, {"id": "6c032a68-3f5c-44d9-a21d-8dc539162230", "title": "Man charged with murder over young surfer stabbing", "date": "2024-06-04 04:30", "url": "https://www.northerndailyleader.com.au/story/8651498/man-charged-with-murder-over-young-surfers-stabbing/", "message": "Police are still trying to track down the weapon used to kill Kye Schaefer, who was stabbed multiple times in the chest and neck during the attack on May 2."}, {"id": "22a4bc7f-048b-4fbe-80c2-1e7717cd0e0b", "title": "OC rideshare driver who shot suspect allegedly assaulting woman could face charges", "date": "2024-06-04 00:30", "url": "https://www.foxla.com/news/rideshare-driver-stanton-shoots-man-assaulting-woman", "message": "A man was hospitalized after being shot by a rideshare driver who allegedly witnessed the man assaulting a woman and took action to stop the attack.\nIt is unclear what happened next, but authorities said the rideshare driver shot the suspect.\nThe man assaulting the woman, only identified as a 20-year-old, sustained a gunshot wound and was taken to the hospital in critical but stable condition.\nThe sheriff's office said the rideshare driver remained at the scene and called dispatch to report the shooting.\nHe may face charges pending further investigation, the sheriff’s office said in a statement."}, {"id": "ce7d1dba-d1be-4054-a634-a62fe451dd08", "title": "Four more Israeli hostages have died in Hamas custody", "date": "2024-06-04 01:00", "url": "https://www.nbcwashington.com/news/national-international/four-more-israeli-hostages-died-hamas-custody/3631679/", "message": "But in March, Al-Qassam Brigades spokesperson Abu Ubaida announced that Perry, Metzger and Cooper were among the seven hostages killed in an Israeli airstrike on Gaza.\nLast month, Popplewell was seen in a propaganda video released by Hamas, Israeli media reported.\nPopplewell's elderly mother, Hanna Perry, was among a group of more than a dozen Israeli hostages who were released on Nov. 24 as part of a temporary cease-fire deal.\n“We are really worried about their condition.”Perry, who was also 80, and lived in the same kibbutz as Metzger, Hagari said.\nSome 125 Israeli hostages remain in captivity nearly eight months after they were abducted in a deadly surprise attack by Hamas that sparked the ongoing war in Gaza."}, {"id": "aa34f15e-e9b1-4118-997a-0c378164f5a5", "title": "Russo - Ukraine War - 03 June 2024", "date": "2024-06-04 00:00", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-03.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn addition, the Russian occupiers carried out more than 2,100 shelling positions of Ukrainian troops and settlements using different types of weapons.\nIn the Kharkiv direction, Russian forces six times attacked the positions of Ukrainian defenders in the areas of lipcív and vovchansk.\nWithin a day, previously, Russian forces lost living force 91 occupants dead and wounded."}, {"id": "5ee099f3-60e4-4ecc-9583-2cb565e849cf", "title": "Las Vegas WWII veteran recalls his time on the USS Cavalier , 80 years since D - Day", "date": "2024-06-04 03:45", "url": "https://www.yahoo.com/news/las-vegas-wwii-veteran-recalls-012300406.html", "message": "Las Vegas WWII veteran recalls his time on the USS Cavalier, 80 years since D-DayLAS VEGAS (KLAS) — As his 99th birthday approaches, a Las Vegas local looked back on his experience in the Second World War and reflected on the 80 years since the Normandy landings on D-Day in 1944.\nA photo shows Herb Cohen, a Las Vegas local who served as a U.S. Coast Guardsman aboard the USS Cavalier.\nHerb Cohen served aboard the USS Cavalier, an attack transport deployed to the Pacific Theater during World War II.\nFrom the Cavalier, Cohen and his brothers-in-arms helped to fight off the Japanese army, a brutal and bloody conflict that left its mark on the young man.\nEventually, the soldier settled down, made Las Vegas his home, married, and had a family."}, {"id": "3233743e-eb76-469f-94d8-1de44f5ac6c0", "title": "SOF Pic of the Day : German Navy Kampfschwimmer", "date": "2024-06-04 04:15", "url": "https://sofrep.com/news/sof-pic-of-the-day-german-navy-kampfschwimmer/", "message": "They are adept at conducting a variety of operations, including reconnaissance, sabotage, direct action, and counter-terrorism.\nThis ability to move silently and remain unseen is a hallmark of Kampfschwimmer operations.\nWhen it comes to elite maritime special forces, few units are as storied and formidable as the Kampfschwimmer of the German Navy.\nWhen it comes to elite maritime special forces, few units are as storied and formidable as the Kampfschwimmer of the German Navy.\nThis ability to move silently and remain unseen is a hallmark of Kampfschwimmer operations."}, {"id": "5b500ced-46b6-463f-b33c-04e83cc1a662", "title": "Putin troops film blindfolded Ukrainian PoWs on harrowing death march before mock execution in sick footage sent to UN", "date": "2024-06-04 01:00", "url": "https://www.the-sun.com/news/11524195/putin-troops-video-ukrainian-pows-un/", "message": "HARROWING footage shows the sick reality of Vladimir Putin's war in Ukraine, as Russian troops lead Ukrainian prisoners to a mock execution.\nOne of the Russian soldiers turned the camera back to his own face after the gun fired and frowned.\nUkrainian ombudsman Dmytro Lubinets said the footage showed Russian soldiers \"mocking Ukrainian prisoners of war\".\n\"Unfortunately, such treatment of Ukrainian prisoners of war is not an exception to the rules, but a common tactic for the occupiers.\"\nSeriously-ill PoWs must be returned home, and all PoWs must be released - and sent home without delay - when the conflict ends."}, {"id": "91abe55d-fc9d-482f-8150-496aeea7d052", "title": "Storymode + Warfare + Azazel = ? addon - S . T . A . L . K . E . R . Anomaly mod for S . T . A . L . K . E . R .: Call of Pripyat", "date": "2024-06-04 01:15", "url": "https://www.moddb.com/mods/stalker-anomaly/addons/storymode-warfare-azazel", "message": "There is a mod that allowing to play both Story and Warfare, and there was a way to play Azazel and Story.\nAllows to play Story mode AND Warfare mode AND Azazel mode assuming you pick the latter first.\n(except the Go to 'NPC' and recieve a special random job)TLDR:Install mod with MO2 and click on Azazel mode first.\nSpecial thanks:Yonte - For leaving Azazel Mode + Story Mode in unplayable state.\nVintar0 - For 'Warfare ALife Overhaul 1.4.2' that break my saves, but having 'story mode + Warfare' feature."}, {"id": "63f52f13-dc2b-46fa-9568-5852d9455dfe", "title": "IHC questions spie ability over failure to trace those who doxxed judge - Newspaper", "date": "2024-06-04 04:30", "url": "https://www.dawn.com/news/1837644/ihc-questions-spies-ability-over-failure-to-trace-those-who-doxxed-judge", "message": "An IHC larger bench comprising Justices Mohsin Akhtar Kayani, Tariq Mehmood Jahangiri and Sardar Ejaz Ishaq Khan took up the case on Monday.\nThe IHC bench expressed displeasure over the report and rejected it.\nThe spy agency was subsequently directed to submit a fresh report.\nThe bench noted that after six IHC judges wrote a letter to the Supreme Judicial Council, “three malicious campaigns were simultaneously orchestrated against them”.\nAn FIA official who appeared in the court said several X accounts also shared controversial posts against the judge."}, {"id": "39a8119d-aba7-4014-a605-2c75774f213b", "title": "Combat Dealers - Discovery Channel HD", "date": "2024-06-04 03:30", "url": "https://www.tvguide.co.uk/schedule/42db5852-8aa0-5a34-9876-8cc0733c7273/combat-dealers", "message": "Combat DealersDiscovery Channel HD 9:00 AM to 10:00 AM Tuesday 4 June Share Add toCalendar +Mission Impossible Season 3 Episode 8 of 10 S Subtitles Audio DescriptionMilitary equipment collector Bruce Crompton heads to Finland looking for props, including Cold War Russian anti-aircraft guns, for a new blockbuster movieCombat Dealers airs on Discovery Channel HD at 9:00 AM, Tuesday 4 June .\n(Subtitles, audio description.)\nLearn more about Combat Dealers and other education/science/factual topics on our factual pageTopics Education ➝ Science ➝ Factual Topics Docu-soap"}, {"id": "086a1677-2c87-4d2a-b0ca-d2c5755620fd", "title": "South Korea is suspending a military deal with North Korea after tensions over North balloons", "date": "2024-06-04 04:15", "url": "https://www.clickorlando.com/news/world/2024/06/04/south-korea-is-suspending-a-military-deal-with-north-korea-after-tensions-over-norths-balloons/", "message": "Visitors use binoculars to see the North Korean side from the unification observatory in Paju, South Korea, Tuesday, June 4, 2024.\nSouth Koreas government has approved the suspension of a contentious military agreement with North Korea, a step that would allow it to take tougher responses to North Korean provocations.\n2 official, said the government assessed that the 2018 deal has weakened South Korean military readiness at a time when repeated North Korean provocations pose real threats to the South Korean public.\nHan cited North Korea’s balloon campaign,tests of nuclear-capable weapons targeting South Korea and alleged jamming of GPS navigation signals in the South.\nIn the past week, North Korea used balloons to drop manure, cigarette butts, scraps of cloth and waste paper on South Korea, prompting South Korea to vow unspecified “unbearable” retaliatory steps."}, {"id": "8150577f-b2ff-4108-b0ee-e2e97d8c3287", "title": "A Black medic wounded on D - Day is finally posthumously honored", "date": "2024-06-04 00:00", "url": "https://www.capitalgazette.com/2024/06/03/a-black-medic-wounded-on-d-day-saved-dozens-of-lives-hes-finally-being-posthumously-honored/", "message": "We have numerous accounts of what he did to save his fellow soldiers even as he was wounded.\nMembers of the First Army, which included Woodson’s unit during World War II, is taking a World War II-era Distinguished Service Cross with them to France.\nWoodson was just 21 years old when his unit, the 320th Barrage Balloon Battalion, took part in the Allied operation.\nAlthough 1.2 million Black Americans served in the military during World War II, none was among the original recipients of the Medal of Honor awarded in the conflict.\nUltimately, seven Black World War II troops were awarded the Medal of Honor in 1997."}, {"id": "489d2cab-5a49-4d55-b35f-a45f77c99827", "title": "South Korea suspending military deal with North Korea", "date": "2024-06-04 04:30", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/06/04/south-korea-suspending-military-deal-with-north-korea/", "message": "South Korea’s government has approved the suspension of a contentious military agreement with North Korea, a step that would allow it to take tougher responses to North Korean provocations.\nSouth Korea’s Cabinet Council passed a proposal on Tuesday aimed at suspending the 2018 inter-Korean agreement on lowering down frontline military tensions.\nSouth Korean soldier wearing protective gears checks the trash from a balloon presumably sent by North Korea, in Incheon, South Korea (Im Sun-suk/Yonhap/AP)Mr Han cited North Korea’s balloon campaign, tests of nuclear-capable weapons targeting South Korea and alleged jamming of GPS navigation signals in the South.\nIn the past week, North Korea used balloons to drop manure, cigarette butts, scraps of cloth and waste paper on South Korea, who vowed unspecified “unbearable” retaliatory steps.\nSouth Korean officials said the suspension of the 2018 deal would allow it to stage frontline military drills but didn’t publicly elaborate on other steps."}, {"id": "873f4274-96c9-4db6-8c09-e4a0c89171ae", "title": "South Korea is suspending a military deal with North Korea after tensions over North balloons – Winnipeg Free Press", "date": "2024-06-04 04:15", "url": "https://www.winnipegfreepress.com/world/2024/06/03/south-korea-is-suspending-a-military-deal-with-north-korea-after-tensions-over-norths-balloons", "message": "SEOUL, South Korea (AP) — South Korea’s government approved the suspension of a contentious military agreement with North Korea on Tuesday, a step that would allow it to take tougher responses to North Korean provocations.\nVisitors use binoculars to see the North Korean side from the unification observatory in Paju, South Korea, Tuesday, June 4, 2024.\n2 official, said the government assessed that the 2018 deal has weakened South Korean military readiness at a time when repeated North Korean provocations pose real threats to the South Korean public.\nHan cited North Korea’s balloon campaign,tests of nuclear-capable weapons targeting South Korea and alleged jamming of GPS navigation signals in the South.\nIn the past week, North Korea used balloons to drop manure, cigarette butts, scraps of cloth and waste paper on South Korea, prompting South Korea to vow unspecified “unbearable” retaliatory steps."}, {"id": "57aeca37-bcb4-4a21-bc59-f33da028101d", "title": "Idris Elba tells untold stories of Black , Brown soldiers in Nat Geo docuseries  Erased : WW2 Heroes of Color  ", "date": "2024-06-04 02:00", "url": "https://abc11.com/post/idris-elba-tells-untold-stories-black-brown-soldiers/14907207/", "message": "Idris Elba tells untold stories of Black, Brown soldiers in 'Erased: WW2's Heroes of Color'Actor Idris Elba has a strong connection to World War II.\nActor Idris Elba has a strong connection to World War II.\nActor Idris Elba has a strong connection to World War II.\n\"The telling of World War II stories has been told in many, many versions, good documentaries, great films.\n\"Erased: WW2's Heroes of Color\" premieres June 3 on National Geographic and streams the next day on Hulu."}, {"id": "156a32dd-cd93-4f9d-8a37-43ee315a9490", "title": "Idris Elba tells untold stories of Black , Brown soldiers in Nat Geo docuseries  Erased : WW2 Heroes of Color  ", "date": "2024-06-04 00:45", "url": "https://abc13.com/post/idris-elba-tells-untold-stories-black-brown-soldiers/14907207/", "message": "Idris Elba tells untold stories of Black, Brown soldiers in 'Erased: WW2's Heroes of Color'Actor Idris Elba has a strong connection to World War II.\nActor Idris Elba has a strong connection to World War II.\nActor Idris Elba has a strong connection to World War II.\n\"The telling of World War II stories has been told in many, many versions, good documentaries, great films.\n\"Erased: WW2's Heroes of Color\" premieres June 3 on National Geographic and streams the next day on Hulu."}, {"id": "e16d796a-f5b8-46c4-8cbc-62675ac6b4a9", "title": "Idris Elba tells untold stories of Black , Brown soldiers in Nat Geo docuseries  Erased : WW2 Heroes of Color  ", "date": "2024-06-04 01:15", "url": "https://abc7chicago.com/post/idris-elba-tells-untold-stories-black-brown-soldiers/14907207/", "message": "Idris Elba tells untold stories of Black, Brown soldiers in 'Erased: WW2's Heroes of Color'Actor Idris Elba has a strong connection to World War II.\nActor Idris Elba has a strong connection to World War II.\nActor Idris Elba has a strong connection to World War II.\n\"The telling of World War II stories has been told in many, many versions, good documentaries, great films.\n\"Erased: WW2's Heroes of Color\" premieres June 3 on National Geographic and streams the next day on Hulu."}, {"id": "ff2fc857-0928-4330-ab69-1e016ff0cf04", "title": "United flight taking three World War II veterans from Chicago OHare Airport to France for 80th D - Day anniversary", "date": "2024-06-04 01:15", "url": "https://abc7chicago.com/post/united-flight-taking-world-war-ii-veterans-chicago/14907935/", "message": "Three World War II veterans fly from O'Hare to France to celebrate 80th anniversary of D-DayA United flight is taking three World War II veterans from Chicago O'Hare Airport to France for the 80th D-Day and Normandy invasion anniversary.\nA United flight is taking three World War II veterans from Chicago O'Hare Airport to France for the 80th D-Day and Normandy invasion anniversary.\nA United flight is taking three World War II veterans from Chicago O'Hare Airport to France for the 80th D-Day and Normandy invasion anniversary.\nA United flight is taking three World War II veterans from Chicago O'Hare Airport to France for the 80th D-Day and Normandy invasion anniversary.\nThis could be the last time any World War II veterans might be there in-person, so organizers are going all-out."}, {"id": "9c0ccd26-52a1-4fe2-af27-a7b62cb04d26", "title": "Glenn Youngkin discusses antisemitism at Norfolk conference :  We have to continue to stand against hate  – Daily Press", "date": "2024-06-04 01:15", "url": "https://www.dailypress.com/2024/06/03/glenn-youngkin-discusses-antisemitism-at-norfolk-conference-we-have-to-continue-to-stand-against-hate/", "message": "Glenn Youngkin, gathered Monday to share experiences and ideas on how to stand up to antisemitism.\nVirginia Summit to Combat Antisemitism, a two-day conference that began Sunday, was held at the Hilton Norfolk The Main.\nAdditionally, several Hampton Roads city leaders gave remarks, including Norfolk Mayor Kenny Alexander and Virginia Beach Mayor Bobby Dyer.\nVirginia Beach Councilman Chris Taylor was on a panel about the best ways to safeguard Jewish communities.\nThough advocates have pushed the issue in Newport News, Norfolk and Virginia Beach, none of those cities have adopted a resolution."}, {"id": "89b1d26c-5c5c-46df-95e8-74a2d40fe713", "title": "  All Quiet on the Western Front  screenwriter dies aged 54 after losing pancreatic cancer battle", "date": "2024-06-04 00:45", "url": "https://www.femalefirst.co.uk/celebrity/quiet-western-front-screenwriter-dies-aged-54-after-losing-pancreatic-cancer-battle-1400705.html", "message": "Filmmaker Lesley Paterson’s husband Simon Marshall has died aged 54 after losing his pancreatic cancer battle.\nFilmmaker Lesley Paterson’s husband Simon Marshall has died aged 54 after losing his pancreatic cancer battleThe husband-and-wife team co-wrote the script for the brutal 2022 anti-war movie ‘All Quiet on the Western Front’, already considered a classic.\nLesley launched a crowd-funding drive last year after her husband and creative partner was diagnosed with stage four pancreatic cancer.\nTheir ‘All Quiet on the Western Front’ adaptation won four Oscars and seven Baftas.\n“The pain is real but I will take this suffering and turn it into beauty in honour of his spirit."}, {"id": "7378a2e9-6a4b-4fd3-8628-d86451fbfd0e", "title": "Delhi Minister Saurabh Bharadwaj conducts surprise inspection of  Rain basera  ", "date": "2024-06-04 03:15", "url": "https://news.webindia123.com/news/Articles/India/20240604/4203137.html", "message": "To ensure adequate arrangements at 'Rain baseras' during the ongoing heat wave, Delhi's Urban Development Minister Saurabh Bharadwaj on Monday afternoon conducted a surprise inspection of several night shelters in Delhi, an official statement said.\nSaurabh Bharadwaj, who is Vice Chairman of the Delhi Urban Shelter Improvement Board (DUSIB) took stock of the arrangements made at the night shelters.\nIssuing a statement, Minister Bharadwaj said, \"he saw adequate arrangements for water dispensers to provide cold drinking water to the people and water air coolers for cold air.\"\n\"Arrangements must be made immediately wherevr any deficiency is found in the water arrangement or supply of cold water.\nAnd, wherever a problem with the air cooler is noticed, that problem should be resolved immediately,\" he said."}, {"id": "36042ec1-6a80-4353-a548-e267b1810eea", "title": "Bagpipes , flags welcome Chicago - area WWII veterans heading back to France for D - Day anniversary", "date": "2024-06-04 03:45", "url": "https://www.fox32chicago.com/news/chicago-veterans-heading-back-france-d-day-anniversary", "message": "There were bagpipes, flags, and a grand procession at O'Hare Airport's Terminal 1 as three World War II veterans headed back to France on Monday.\n\"Many of us here could not even fathom the sacrifices and contributions you made to our country,\" said Omar Idris of United Airlines.\n\"You realize how bad it was when you walk the cemeteries in France,\" Malin said.\nThe three men and their families were cheered all the way to the gate as the event was coordinated by United Airlines and its United for Veterans Group.\nEven more special, the entire flight crew to France was made up of veterans."}, {"id": "5383a501-128f-4682-9c42-97555ff05307", "title": "The Eastern Front : A History of the First World War by Nick Lloyd : A compelling and authoritative read", "date": "2024-06-04 04:30", "url": "https://www.irishtimes.com/culture/books/review/2024/06/04/the-eastern-front-a-history-of-the-first-world-war-by-nick-lloyd-a-compelling-and-authoritative-read/", "message": "Photograph: Oesterreichsches Volkshochschularchiv/Imagno/Getty ImagesThe Eastern Front: A History of the First World War Author : Nick Lloyd ISBN-13 : 978-0241506851 Publisher : Viking Guideline Price : £30The first World War started with the assassination 110 years ago of Archduke Franz Ferdinand in Sarajevo, yet the Eastern Front is little known or understood in the West.\nREAD MOREThe three main protagonists, Germany, the Austro-Hungarian empire and Russian empire, were defeated.\nThe Russian empire, as has been exhaustively chronicled elsewhere, withdrew from the war to preserve the nascent Bolshevik revolution.\nItaly lost 500,000 men in the first World War and got nothing like the territories it had anticipated despite being on the winning side.\nIt was out of the chaos of the first World War that the first Ukrainian state was declared in January 1918."}, {"id": "bc88d27f-63e0-461d-9f3a-5b3d03f1c39b", "title": "CS Runn Announces His Military Thriller The Moral Conundrum", "date": "2024-06-04 01:45", "url": "https://menafn.com/1108287742/CS-Runn-Announces-His-Military-Thriller-The-Moral-Conundrum", "message": "(MENAFN- BookBuzz) CS Runn announces the promotion of his riveting action thriller, The Moral Conundrum.\nIn The Moral Conundrum, readers are introduced to Reed Stanton, a navy fighter pilot and devoted family man.\nAuthor CS Runn brings a wealth of personal experience to The Moral Conundrum, drawing on his background as a navy veteran and former employee of the Federal Aviation Administration.\nExperience the adrenaline rush of The Moral Conundrum today!\nA passionate explorer of America's national parks, CS Runn currently resides in San Diego, California."}, {"id": "7e391384-800a-4adb-8f71-17f2f7578c3d", "title": "Fostering Tri - Service Collaboration At Grassroot Level : 40 Trainee Officers Commence Joint Training At DSSC", "date": "2024-06-04 03:30", "url": "https://menafn.com/1108292449/Fostering-Tri-Service-Collaboration-At-Grassroot-Level-40-Trainee-Officers-Commence-Joint-Training-At-DSSC", "message": "For the first time, a select number of officers are being trained under the newly established joint training team at the Defence Services Staff College (DSSC).\nSources in the defence and security establishment said:“About 40 trainee officers are under the newly appointed head of the Joint Training team.\"\nRecently, a Brigadier-level Joint Training Officer was appointed to lead the new joint training team.\n\"As the tri-services posting has already begun, this step is aimed at taking the joint training to the grassroots level,” sources added.\n\"Over the years joint training capsules at DSSC have been increasing to reach the level of above 70 percent now,” sources said."}, {"id": "78c02ece-f332-408b-a150-fb929fb24a65", "title": "2 Japanese F - 35 fighter jets make emergency landings after 1 has a mechanical problem | News , Sports , Jobs", "date": "2024-06-04 01:15", "url": "https://www.mauinews.com/news/local-news/2024/06/2-japanese-f-35-fighter-jets-make-emergency-landings-after-1-has-a-mechanical-problem/", "message": "TOKYO (AP) — Two Japanese F-35A stealth fighter jets made emergency landings at a commercial airport in northern Japan on Monday, but there were no injuries or damage, officials said.\nThe fighter jets were on a training flight from Misawa Air Base and landed safely at nearby Aomori Airport after one developed an unspecified mechanical problem and requested an emergency landing, airport officials said.\nJapan’s Air Self Defense Force declined to provide details, including the cause of the emergency landing.\nThe airport said its runway was closed for about 20 minutes because of the emergency landing before operations returned to normal.\nThe incident is the latest in a series of problems involving flight training by Japan’s military."}, {"id": "0f272226-cf17-40c9-8e7c-4e0e25ba5ed7", "title": "John Nelson : Purple Heart recipient reflects on days in Vietnam", "date": "2024-06-04 02:00", "url": "https://mtstandard.com/brandavestudios/john-nelson-purple-heart-recipient-reflects-on-days-in-vietnam/article_4b7dea2c-18da-5e78-8cbb-39e3d2efc4d4.html", "message": "In all, Nelson logged 2,600 hours of combat flight during his two years in Vietnam.\nThe Air Force also recognized Nelson with five additional Air Medals for his service.\nBut Nelson doesn’t like to talk much about his experience or awards from his war days.\nAfter graduating from the University of Montana and marrying his high school sweetheart, Caryl Ann Burgess, Nelson entered the U.S. Air Force.\nAfter completing his tour of Vietnam, Nelson was stationed in Texas at Laredo AFB for two years, where he taught new pilots."}, {"id": "237fa1b5-e15d-497c-92cc-ba3c911ae296", "title": "In the New Cold War , Europe Approach to China Is Already Outdated – The Diplomat", "date": "2024-06-04 04:30", "url": "https://thediplomat.com/2024/06/in-the-new-cold-war-europes-approach-to-china-is-already-outdated/", "message": "In the new Cold War, Russia is more important to the Chinese leadership than Europe.\nIn the new Cold War, Eastern Europe and the Indo-Pacific are part of a united Eurasian strategic theater.\nGeographically, just like the 20th-century Cold War, the new one reflects the expansive logic of malleable buffer zones.\nIt appears that both Moscow and Beijing are ready for the turbulence of the new Cold War.\nThe most pressing issue along the two geographical fault lines in the coming years is keeping the new Cold War “cold” and preventing it from becoming a full-blown global hot war."}, {"id": "9bfcab88-6ded-45ee-bdf2-6189e8291981", "title": "Today in History : June 4 , World War II Battle of Midway begins in the Pacific", "date": "2024-06-04 04:30", "url": "https://www.startribune.com/today-in-history-june-4-world-war-iis-battle-of-midway-begins-in-the-pacific/600370806/", "message": "Today's Highlight in History:On June 4, 1942, the World War II Battle of Midway began, resulting in a decisive American victory against Japan and marking the turning point of the war in the Pacific.\nIn 1940, during World War II, the Allied military evacuation of some 338,000 troops from Dunkirk, France, ended.\nBritish Prime Minister Winston Churchill declared: ''We shall fight on the beaches, we shall fight on the landing grounds, we shall fight in the fields and in the streets, we shall fight in the hills; we shall never surrender.''\nRock musician JoJo Garza (Los Lonely Boys) is 44.\nRock musician Zac Farro is 34."}, {"id": "ba9d2c6c-cba4-46a5-bdb2-a13e82019a31", "title": "World Environment Day : How smart and sustainable cities can transform our ecosystems", "date": "2024-06-04 04:15", "url": "https://gulfnews.com/opinion/op-eds/world-environment-day-how-smart-and-sustainable-cities-can-transform-our-ecosystems-1.102944421", "message": "The World Environment Day 2024 offers a window of opportunity and action at a time when nearly one-fifth of earth’s land is damaged, forests are disappearing, water bodies are shrinking, and farms are turning into dust bowls.\nEmbracing sustainable developmentIndeed, GCC states have emerged as true global leaders in the fight against climate change and embracing sustainable development.\nThe World Environment Day hosted by the region is the perfect occasion to reflect why the cities of the future must be sustainable and smart, and help preserve our precious natural resources for future generations, through collaborative work between the private and public sectors.\nAs demonstrated by pioneering sustainable projects in the UAE, such as Sharjah Sustainable City, cities that offer an eco-friendly lifestyle and pave the way for a net-zero future are already here.\nThat’s why there’s no better time than this World Environment Day to turn those ambitions and commitments into a turning point for environmental action for a transformative future."}]