[{"id": "83aaaa27-5714-40a6-bc85-50991feb4c12", "title": "Rebuilding the Jewish Brand in America", "date": "2024-08-04 21:30", "url": "https://www.algemeiner.com/2024/08/04/rebuilding-the-jewish-brand-in-america/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "This side effect, if we don’t take action, has the potential to severely weaken the Jewish brand in America.\nThis not only “shrinks” the Jewish brand, but it’s also not true to who we are.\nAs critical as safety is, Israel reminds us that there’s a lot more to the Jewish brand than seeking protection.\nThe spreading of Jewish contributions, creativity and goodness won’t just revitalize the Jewish brand throughout America, it will also provide a welcome injection of positive energy into our anxious community.\nBut we must also never relent in honoring the Jewish way of never settling, of always aiming higher."}, {"id": "2ef7637a-dc34-4b1a-895e-88f68a0bd7cc", "title": "How Gabrielle Zevin Book Became an Unlikely Lightning Rod in Literary Fights Over the Israel - Hamas War", "date": "2024-08-04 23:30", "url": "http://www.washingtonjewishweek.com/how-gabrielle-zevins-book-became-an-unlikely-lightning-rod-in-literary-fights-over-the-israel-hamas-war/", "domain": "washingtonjewishweek.com", "domain_classification": "Unknown", "message": "She published her first novels in 2005 and has had a steady output since, but “Tomorrow and Tomorrow and Tomorrow” has been far and away her most successful work.\n“Gabrielle Zevin included Israeli sympathy into her books,” one pro-Palestinian proponent of boycotting “known Zionist authors” wrote on X.\nIn response to such incidents, the Jewish Book Council has launched an initiative for authors to report any antisemitism they experience in the literary world.\n“We will continue to welcome and host Jewish authors in our space,” it said.\n“I think the worlds that my characters find themselves in in the book is the world,” she said."}, {"id": "4dfc0845-689a-4241-b594-8d3ac378bb7a", "title": "Should We Impose a Fairness Doctrine on Academia ? ", "date": "2024-08-04 21:30", "url": "https://www.algemeiner.com/2024/08/04/should-we-impose-a-fairness-doctrine-on-academia/", "domain": "algemeiner.com", "domain_classification": "Unknown", "message": "There are numerous possibilities, but the best solution has yet to be mentioned: the imposition of a “fairness doctrine” on academia.\nThe fairness doctrine was a policy applied to media outlets by the Federal Communications Commission (FCC) for much of the 20th century.\nThe fairness doctrine lasted until the late 1980s when it was finally done away with by the Reagan administration.\nMoreover, the implementation of a fairness doctrine would be a simple matter: For example, when a leftist professor or administrator is hired, a conservative professor or administrator must be hired next.\nAs a cabal of progressive leftists, it has consistently advocated for the reimposition of the fairness doctrine on the media."}, {"id": "3e9f3664-00f3-4775-8201-63dcb201da9f", "title": "Worrying Signals on the Middle East From Britain New Labour Government", "date": "2024-08-04 23:30", "url": "http://www.washingtonjewishweek.com/worrying-signals-on-the-middle-east-from-britains-new-labour-government/", "domain": "washingtonjewishweek.com", "domain_classification": "Unknown", "message": "It’s a task complicated by the Labour Party’s recent history and Starmer’s own role in the torrid conflict over the antisemitism in its ranks.\nAfter assuming the Labour leadership, Starmer, a centrist, set about purging the far-left.\nWhen it comes to Starmer, there is no doubting his personal detestation of antisemitism and his determination to root it out of the Labour Party.\nAs it settles into office, Labour has already made three Middle East-related policy announcements that should be greeted with alarm.\nStarmer will no doubt face a demand from elements of his own party to do the same."}]