[{"id": "c2926170-d541-45d0-8696-6e82115e31fb", "title": "SC legislators approve antisemitism bill amid national wave of Israel - Hamas war protests", "date": "2024-05-03 19:45", "url": "https://www.yahoo.com/news/sc-legislators-approve-antisemitism-bill-183503227.html", "message": "And no reports of insults, harassment or threats of violence aimed at Jewish students.\nStill, as students finish final exams and campuses empty for the summer, lawmakers point to a bill codifying a definition of antisemitism into state law.\nProtests in SCOut of South Carolina’s largest college campuses, only one — the University of South Carolina — has reported minor protest activity.\nApplying the definitionBernstein acknowledged that if her bill becomes state law, applications of what’s antisemitic would be limited to policies and regulations at state agencies, which include public universities.\nThe post SC legislators approve antisemitism bill amid national wave of Israel-Hamas war protests appeared first on SC Daily Gazette."}, {"id": "ed626662-94ab-4837-b3b5-e0a16ae86732", "title": "What is Zionism ? The movement college protesters oppose , explained . ", "date": "2024-05-03 18:00", "url": "https://www.bostonglobe.com/2024/05/03/nation/zionism-explainer/", "message": "The modern movement of Zionism, which began in the late 1800s, has had many definitions and aims.\nThe Post interviewed a range of people, from student protesters and experts on antisemitism and Zionism to student advocates for Zionism.\nJVP sees Zionism as a movement whose aim “is to deny the rights of Palestinians and the humanity of Palestinians,” she said.\nThe U.N. General Assembly in 1947 passed a partition plan to create an Arab state, a Jewish state and international control over Jerusalem.\nToday, Tur-Paz says, Israelis generally don’t see the word “Zionism” as implying specific policies or borders."}, {"id": "d440ae42-0d01-4a52-b5db-8ba31df05c0c", "title": "Antisemitism Report : Anti - Jewish hate goes from bad to worse in 2023", "date": "2024-05-05 17:15", "url": "https://www.jpost.com/diaspora/antisemitism/article-799850", "message": "“October 7 helped spread a fire that was already out of control,” the report stated.\nAustralia in particular recorded 622 antisemitic incidents in October and November 2023, in comparison to 79 during the same period in 2022.\n“Israel does not have a meaningful strategic plan for combating antisemitism that is based on the needs of Jewish communities.\nFighting antisemitism is failingTHE IMPOSSIBILITY of reliably tracking antisemitic incidents in Russia at present was discussed in the report as well.\n“Two years ago, this report stated that the fight against antisemitism was failing."}, {"id": "166bbbc5-832d-4fe1-b733-e56cd084e287", "title": "Education secretary condemns  abhorrent  antisemitic incidents on campus", "date": "2024-05-03 21:00", "url": "https://www.yahoo.com/news/education-secretary-condemns-abhorrent-antisemitic-202443746.html", "message": "Education Secretary Miguel Cardona sent a letter Friday to college and university presidents condemning what he called “abhorrent” antisemitic incidents on campus, the latest response from the Biden administration to the ongoing nationwide protests.\n“These and other such incidents are abhorrent, period,” he wrote.\nMost protests have denounced antisemitism and have not explicitly endorsed Hamas, but a few incidents have become part of the larger controversy around the demonstrations.\nAs the protests continue, calls for the Biden administration to do more to address on-campus antisemitism have risen.\nSince Oct. 7, the Anti-Defamation League has reported that there’s been an unprecedented rise in antisemitism in the United States."}, {"id": "5bf2226a-25f6-42f6-bc7d-48dd9740217f", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests", "date": "2024-05-03 17:45", "url": "https://www.chicagotribune.com/2024/05/03/campus-protests/", "message": "As strident pro-Palestinian protests dominated U.S. colleges in recent weeks, few Jewish students responded with rallies in support of Israel or against perceived displays of antisemitism.\nLike many Americans, Jewish students’ views on the war in Gaza and the broader Israeli-Palestinian conflict are wide-ranging and often nuanced.\nNow, groups in solidarity with Jewish students plan dozens of rallies in the coming days from coast to coast.\nBut punctuations of hatred among the antiwar protests have rattled many Jewish students, regardless of how they feel about Israel’s government or its treatment of Palestinians.\nA few argued to ignore the pro-Palestinian encampment on campus, to show that “you can do that, but you’re not affecting us,” said Jewish student Eliana Halivni."}, {"id": "e67ad13e-207e-4353-98a0-b16e5de0357b", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests", "date": "2024-05-04 04:15", "url": "https://www.pressherald.com/2024/05/03/jewish-students-grapple-with-how-to-respond-to-pro-palestinian-campus-protests-2/", "message": "As strident pro-Palestinian protests dominated U.S. colleges in recent weeks, few Jewish students responded with rallies in support of Israel or against perceived displays of antisemitism.\nLike many Americans, Jewish students’ views on the war in Gaza and the broader Israeli-Palestinian conflict are wide-ranging and often nuanced.\nNow, groups in solidarity with Jewish students plan dozens of rallies in the coming days from coast to coast.\nBut punctuations of hatred among the antiwar protests have rattled many Jewish students, regardless of how they feel about Israel’s government or its treatment of Palestinians.\nA few argued to ignore the pro-Palestinian encampment on campus, to show that “you can do that, but you’re not affecting us,” said Jewish student Eliana Halivni."}, {"id": "b9fee4ca-8506-47c3-8032-029f2fc4ff12", "title": "SJP receive funds , resources from Hamas - linked groups - report", "date": "2024-05-03 18:45", "url": "https://www.jpost.com/israel-hamas-war/article-799733", "message": "The widely-banned campus protest groups Students for Justice in Palestine (SJP) and National Students for Justice in Palestine (NSJP) are receiving funds from a web of Hamas-linked organizations, according to new research by The Institute for the Study of Global Antisemitism and Policy (ISGAP) which was published on Friday.\nThe research, entitled ‘National Students for Justice in Palestine (NSJP): Antisemitism, Anti-Americanism, Violent Extremism and the Threat to American Universities,’ claimed that non-profit organizations with links to the Hamas terror group were funding the student groups.\nThe report named WESPAC, Tides, American Muslims for Palestine (AMP), Americans for Justice in Palestine (AJP), and Jewish Voice for Peace (JVP) as the Hamas-linked funders.\nAMP, which is reportedly a non-profit under investigation by the Virginia attorney general, has also been accused of directly funding Hamas.\nEnabling SJP actionsThe report also charged that legal advocacy organizations like Palestine Legal provided legal assistance to defend SJP chapters against criticism, while simultaneously launching legal attacks against opponents."}, {"id": "5ddb2e59-e888-4707-a2a5-404aa22eb5e6", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests", "date": "2024-05-03 18:45", "url": "https://dunyanews.tv/en/World/809260-Jewish-students-grapple-with-how-to-respond-to-pro-Palestinian-campus-pr", "message": "Jewish students grapple with how to respond to pro-Palestinian campus protestsWorld World Jewish students grapple with how to respond to pro-Palestinian campus protestsJewish students grapple with how to respond to pro-Palestinian campus protestsFollow on Published On: Fri, 03 May 2024 23:19:30 PKTNEW YORK (AP) As strident pro-Palestinian protests dominated U.S. colleges in recent weeks, few Jewish students responded with rallies in support of Israel or against perceived displays of antisemitism.\nLike many Americans, Jewish students’ views on the war in Gaza and the broader Israeli-Palestinian conflict are wide-ranging and often nuanced.\nNow, groups in solidarity with Jewish students plan dozens of rallies in the coming days from coast to coast.\nBut punctuations of hatred among the antiwar protests have rattled many Jewish students, regardless of how they feel about Israel’s government or its treatment of Palestinians.\nA few argued to ignore the pro-Palestinian encampment on campus, to show that “you can do that, but you’re not affecting us,” said Jewish student Eliana Halivni."}, {"id": "0cf2b154-393a-4890-b12b-3c4e2ec68c40", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests – WABE", "date": "2024-05-03 19:30", "url": "https://www.wabe.org/jewish-students-grapple-with-how-to-respond-to-pro-palestinian-campus-protests/", "message": "Jewish students grapple with how to respond to pro-Palestinian campus protestsAs strident pro-Palestinian protests dominated U.S. colleges in recent weeks, few Jewish students responded with rallies in support of Israel or against perceived displays of antisemitism.\nLike many Americans, Jewish students’ views on the war in Gaza and the broader Israeli-Palestinian conflict are wide-ranging and often nuanced.\nNow, groups in solidarity with Jewish students plan dozens of rallies in the coming days from coast to coast.\nBut punctuations of hatred among the antiwar protests have rattled many Jewish students, regardless of how they feel about Israel’s government or its treatment of Palestinians.\nA few argued to ignore the pro-Palestinian encampment on campus, to show that “you can do that, but you’re not affecting us,” said Jewish student Eliana Halivni."}, {"id": "a01c2c00-88a1-44b3-9cf9-d0d6730eea7d", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests", "date": "2024-05-03 19:45", "url": "https://www.news4jax.com/news/national/2024/05/03/jewish-students-grapple-with-how-to-respond-to-pro-palestinian-campus-protests/", "message": "Recommended VideosLike many Americans, Jewish students’ views on the Israeli-Palestinian conflict are wide-ranging and often nuanced.\nTheir goals include standing in solidarity with Jewish students and showing there’s room for empathy for both Palestinians and Israelis affected by the war.\nAt George Washington University in Washington, D.C., about 150 people — including many Jewish students — gathered Thursday in a grassy courtyard.\nBut instances of hatred among the antiwar protests have rattled many Jewish students, regardless of how they feel about Israel's government or its treatment of Palestinians.\nA few argued to ignore the pro-Palestinian encampment on campus, to show that “you can do that, but you’re not affecting us,” said Jewish student Eliana Halivni."}, {"id": "2b88568f-2fe4-4745-8c34-df82fa05454b", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests", "date": "2024-05-03 19:30", "url": "https://www.bangordailynews.com/2024/05/03/nation/jewish-students-grapple-with-how-to-respond-to-pro-palestinian-campus-protests/", "message": "Like many Americans, Jewish students’ views on the Israeli-Palestinian conflict are wide-ranging and often nuanced.\nTheir goals include standing in solidarity with Jewish students and showing there’s room for empathy for both Palestinians and Israelis affected by the war.\nAt George Washington University in Washington, D.C., about 150 people — including many Jewish students — gathered Thursday in a grassy courtyard.\nBut instances of hatred among the antiwar protests have rattled many Jewish students, regardless of how they feel about Israel’s government or its treatment of Palestinians.\nA few argued to ignore the pro-Palestinian encampment on campus, to show that “you can do that, but you’re not affecting us,” said Jewish student Eliana Halivni."}, {"id": "d74774b4-8245-48a0-96eb-988b2ff60892", "title": "Holocaust Remembrance Day to see procession through Oxford", "date": "2024-05-04 16:30", "url": "https://www.oxfordmail.co.uk/news/24298728.holocaust-remembrance-day-see-procession-oxford/", "message": "Initiated in Germany in 2007, March of Life has the motto \"Remembering – Reconciliation – Taking a Stand Against Antisemitism\".\nThere will be a public memorial event in Bonn Square following the procession (Image: Newsquest)The annual processions represent a platform for Holocaust survivors, encourages reconciliation between descendants of victims and perpetrators, and rallies against present-day antisemitism.\nOn May 6 at 3pm, the Christian community in Oxford will start from the mediaeval Jewish cemetery outside the Botanic Garden, walk up High Street, and conclude the march at Bonn Square.\nIt will be the first time the event has been held in Oxford but it is hoped it will become an annual fixture.\n\"We choose to act instead in solidarity with the Jewish community as they face ever-increasing hatred both at home and abroad.\""}, {"id": "69989a7e-9721-4e18-9480-30e7470ac4ba", "title": "Louisa County suspends funding to PVCC over alleged  antisemitic  film screening", "date": "2024-05-04 13:15", "url": "https://dailyprogress.com/news/local/education/louisa-county-suspends-funding-to-pvcc-over-alleged-antisemitic-film-screening/article_6a271bf4-07f2-11ef-9479-1ffc71a6b6cd.html", "message": "The Louisa County Board of Supervisors found this to be “antisemitic” and unanimously passed a resolution Monday night suspending all of the locality’s funding to the community college, which comes to just under $6,000.\nThough the resolution cites the film as the grounds for its decision, the board’s chairman, Duane Adams, said he was unaware of any film or film screening when The Daily Progress first reached out.\n“I don’t think there was anything to do with a film screening,” Adams told The Daily Progress by phone.\nHowever, the decision could be reversed following “an in-person explanation by PVCC of the college’s stance on discrimination and antisemitism” to the Louisa County board of supervisors.\nThe total amount of funds from the localities, including Louisa County, reached $58,653 in 2022, which is over 10% of the school’s annual revenue."}, {"id": "1327e3db-4cfa-4340-a98f-542df9a42d7b", "title": "Jewish students react to antisemitic vandalism on campus , President Perez responds", "date": "2024-05-04 05:45", "url": "https://theorion.com/100194/news/jewish-students-react-to-antisemitic-vandalism-on-campus-president-perez-responds/", "message": "“ “Let me state unequivocally—this cowardly and vile hatred has absolutely no place at Chico State.” — Chico State President Steve PerezChico State President Steve Perez sent an email to the campus community on Friday condemning recent acts of hate-based, antisemitic vandalism on campus.\nIn the email, Perez wrote that he was “angry and deeply upset” upon receiving multiple reports of graffiti and vandalism.\n“Reports included antisemitic messages in a bathroom, on light posts, and in stairwells on campus,” Perez said in the email.\nAmar also recognizes the activism on other campuses, and said she feels grateful that Chico State is not that extreme.\nChico Hillel shares their appreciation for Perez who checked in on Jewish students at a previous meeting and extended kindness and support to them, Collins said."}, {"id": "d606fb66-acfc-4e36-9c53-d91d049b1bdc", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests", "date": "2024-05-03 20:15", "url": "https://www.wokv.com/news/national/jewish-students/JW6FSHGFF6QOLNMGO4VMV2WM7I/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "acba3fc6-15b3-434c-837a-57681ac6376c", "title": "Jewish students grapple with how to respond to pro - Palestinian campus protests", "date": "2024-05-03 20:45", "url": "https://kdhnews.com/news/nation/jewish-students-grapple-with-how-to-respond-to-pro-palestinian-campus-protests/article_d2d8446c-3415-57d5-9fa6-0d6bccd911e7.html", "message": "Killeen, TX (76540)TodayPartly cloudy this morning, then becoming cloudy during the afternoon.\nA stray shower or thunderstorm is possible.\nWinds SSE at 5 to 10 mph..TonightMostly cloudy skies this evening.\nA few showers developing late.\nWinds SE at 5 to 10 mph."}, {"id": "3ff3692c-ae24-46c2-9cd2-5647563b70d0", "title": "Holocaust Remembrance Day to see procession through Oxford", "date": "2024-05-04 20:30", "url": "https://www.thisisoxfordshire.co.uk/news/24298728.holocaust-remembrance-day-see-procession-oxford/", "message": "Initiated in Germany in 2007, March of Life has the motto \"Remembering – Reconciliation – Taking a Stand Against Antisemitism\".\nThere will be a public memorial event in Bonn Square following the procession (Image: Newsquest)The annual processions represent a platform for Holocaust survivors, encourages reconciliation between descendants of victims and perpetrators, and rallies against present-day antisemitism.\nOn May 6 at 3pm, the Christian community in Oxford will start from the mediaeval Jewish cemetery outside the Botanic Garden, walk up High Street, and conclude the march at Bonn Square.\nIt will be the first time the event has been held in Oxford but it is hoped it will become an annual fixture.\n\"We choose to act instead in solidarity with the Jewish community as they face ever-increasing hatred both at home and abroad.\""}, {"id": "f09ab620-d5b4-4ada-91c4-a0696594b7b7", "title": "Holocaust scholar coming to Tulsa says antisemitism persists", "date": "2024-05-05 10:00", "url": "https://tulsaworld.com/news/local/holocaust-scholar-danny-m-cohen/article_937bd5e0-0639-11ef-ac8f-b7feb1131214.html", "message": "“We’ve done a really excellent job of collecting testimonies,” said Danny M. Cohen, a Chicago-based Holocaust scholar, educator and writer.\nThe grandson of a Holocaust survivor, Cohen has dedicated his career to Holocaust studies and human rights advocacy.\nOr we might call it ‘inherited trauma.’”Many have even compared Oct. 7 to the Holocaust, Cohen added.\nWe want the Palestinian people to be able to work toward self-determination.”“My stance is, I’m on the side to end suffering,” Cohen added.\nAdmission: Free, registration required Presented by: Tulsa Jewish Federation's Tulsa Council for Holocaust Education, in partnership with the Tulsa City-County Library, the Sherwin Miller Museum of Jewish Art, Congregation B'nai Emunah and Temple Israel To register or for more information: Go to jewishtulsa.org/yomhashoah2024."}, {"id": "017bb8e7-03fe-49d0-ae40-1a9a5fc8263b", "title": "Pro - Palestine university encampments : Fine unis that fail to crack down on  racist  protests , says Coalition", "date": "2024-05-04 21:15", "url": "https://www.smh.com.au/politics/federal/fine-unis-that-fail-to-crack-down-on-racist-pro-palestine-encampments-coalition-20240503-p5fotz.html", "message": "The University of Melbourne student encampment in protest against the war in Gaza.\n“Freedom of speech is not unfettered, and it doesn’t give a right to bully and coerce and intimidate,” he said.\nIn another case, a tutor advised a student to skip class if they felt uncomfortable with it being held alongside an encampment.\nDutton has argued that the protests are “racist”, and says Jews are being targeted in a way that would not be accepted for other minority groups.\nOur instinct is never to pre-emptively shut down free speech and debate and the right to protest.”"}, {"id": "c01d92b4-284b-43f9-8bd9-7da93d3b7e3a", "title": "Pro - Palestine university encampments : Fine unis that fail to crack down on  racist  protests , says Coalition", "date": "2024-05-04 20:30", "url": "https://www.watoday.com.au/politics/federal/fine-unis-that-fail-to-crack-down-on-racist-pro-palestine-encampments-coalition-20240503-p5fotz.html", "message": "The University of Melbourne student encampment in protest against the war in Gaza.\n“Freedom of speech is not unfettered, and it doesn’t give a right to bully and coerce and intimidate,” he said.\nIn another case, a tutor advised a student to skip class if they felt uncomfortable with it being held alongside an encampment.\nDutton has argued that the protests are “racist”, and says Jews are being targeted in a way that would not be accepted for other minority groups.\nOur instinct is never to pre-emptively shut down free speech and debate and the right to protest.”"}, {"id": "aa066e4f-e996-4d40-a359-39cdfd1d8a5b", "title": "Pro - Palestine university encampments : Fine unis that fail to crack down on  racist  protests , says Coalition", "date": "2024-05-04 19:15", "url": "https://www.brisbanetimes.com.au/politics/federal/fine-unis-that-fail-to-crack-down-on-racist-pro-palestine-encampments-coalition-20240503-p5fotz.html", "message": "The University of Melbourne student encampment in protest against the war in Gaza.\n“Freedom of speech is not unfettered, and it doesn’t give a right to bully and coerce and intimidate,” he said.\nIn another case, a tutor advised a student to skip class if they felt uncomfortable with it being held alongside an encampment.\nDutton has argued that the protests are “racist”, and says Jews are being targeted in a way that would not be accepted for other minority groups.\nOur instinct is never to pre-emptively shut down free speech and debate and the right to protest.”"}, {"id": "6dfa6073-3e76-406b-aac1-0466d2cb036f", "title": "Students to erect pro - Palestinian camp at U of M – Winnipeg Free Press", "date": "2024-05-04 00:15", "url": "https://www.winnipegfreepress.com/breakingnews/2024/05/03/students-to-erect-pro-palestinian-camp-at-u-of-m", "message": "The wave of university encampment protests that have been set up in solidarity with the Palestinian people in Gaza as they endure a months-long Israeli offensive has reached Winnipeg.\nStudents for Justice in Palestine, a group at the University of Manitoba, plans to set up an encampment to advocate “for justice in Palestine” next week.\nPro-Palestinian protests have popped up at several Canadian campuses in recent days, including at McGill University.\nThe group also warns that, if they go to the encampment, “international students may face heightened risks, and non-U of M students risk trespassing charges.”Zangana said they expect 200 students to pitch their tents in solidarity with the protest.\nThe University of Manitoba said in a statement “we are aware of a protest encampment next week on UM’s Fort Garry campus."}, {"id": "1fc3115f-2715-4762-ae81-e9db72d7084c", "title": "How Jews plan to mark Yom HaShoah 7 months after the deadliest day for Jews since the Holocaust", "date": "2024-05-04 00:00", "url": "https://www.jta.org/2024/05/03/israel/how-jews-plan-to-mark-yom-hashoah-7-months-after-the-deadliest-day-for-jews-since-the-holocaust", "message": "(JTA) — Yom HaShoah, Israel’s Holocaust Remembrance Day, begins Sunday night, marking the anniversary of the Warsaw Ghetto Uprising and serving as a memorial day for the 6 million Jews murdered by the Nazis.\nThis year, as the Israel-Hamas war enters its seventh month, the day takes on added symbolism: It is the first Yom HaShoah since Hamas’ Oct. 7 attack, which was the deadliest day for Jews since the Holocaust.\nThe United Nations’ International Holocaust Remembrance Day, which falls annually on Jan. 27, often draws attention from non-Jews, offering an opportunity for Holocaust survivors and Jewish groups to reach a wide audience.\nSome Yom HaShoah initiatives and gatherings are expecting large turnouts, in part because of the recent reported rise in antisemitism.\n“This Yom HaShoah cuts us more deeply than any before,” the band wrote in an email to its followers."}, {"id": "5e5d0d84-ada6-4954-b394-2f3c0c1ab6b4", "title": "In lead - up to Yom HaShoah , Oporto Jewish community teaches the evolution of Antisemitism to schoolchildren", "date": "2024-05-05 00:30", "url": "https://ejpress.org/in-lead-up-to-yom-hashoah-oporto-jewish-community-teaches-the-evolution-of-antisemitism-to-schoolchildren/", "message": "800 Portuguese schoolchildren visited the Holocaust Museum of Oporto on Friday to learn about the Holocaust and the evolution of Antisemitism throughout the centuries that led to the annihilation of Six Million Jews and continues today.\n“In this museum, we press the importance of having the children and teenagers asking how it was possible for this unspeakable tragedy to take place,” said Gabriel Senderowicz, the President of the Oporto Jewish community that built and runs the museum.\nIt focuses on the general public, especially youths and schoolchildren, and invests in education, professional training for educators, promoting exhibitions, and supporting research.\nDavid Garrett, a jurist who is a board member of the Jewish community of Oporto, highlighted that “a genocide can be national or local and kill millions, thousands or even dozens of people.\nCredit: Jewish Community of Oporto"}, {"id": "771c8e94-0140-4b46-99b9-108708487d66", "title": "Yom Hashoah amid Israel - Hamas war : Commemorating October 7 significanc - Israel News", "date": "2024-05-04 04:30", "url": "https://www.jpost.com/israel-news/article-799772", "message": "(JTA) - Yom HaShoah, Israel’s Holocaust Remembrance Day, begins Sunday night, marking the anniversary of the Warsaw Ghetto Uprising and serving as a memorial day for the 6 million Jews murdered by the Nazis.\nThe United Nations’ International Holocaust Remembrance Day, which falls annually on Jan. 27, often draws attention from non-Jews, offering an opportunity for Holocaust survivors and Jewish groups to reach a wide audience.\nMarch of the Living with survivorsA Holocaust survivor and family member light the torch during a ceremony held at the Yad Vashem Holocaust Memorial Museum in Jerusalem, as Israel marks annual Holocaust Remembrance Day.\nSome Yom HaShoah initiatives and gatherings are expecting large turnouts, in part because of the recent reported rise in antisemitism.\n“This Yom HaShoah cuts us more deeply than any before,” the band wrote in an email to its followers."}, {"id": "20d84499-47ee-4f62-a1be-fed3175d5e07", "title": "How Jews plan to mark Yom HaShoah – The Forward", "date": "2024-05-04 01:45", "url": "https://forward.com/fast-forward/609733/how-jews-plan-to-mark-yom-hashoah-7-months-after-the-deadliest-day-for-jews-since-the-holocaust/", "message": "By Jacob Gurvis May 3, 2024(JTA) — Yom HaShoah, Israel’s Holocaust Remembrance Day, begins Sunday night, marking the anniversary of the Warsaw Ghetto Uprising and serving as a memorial day for the 6 million Jews murdered by the Nazis.\nThis year, as the Israel-Hamas war enters its seventh month, the day takes on added symbolism: It is the first Yom HaShoah since Hamas’ Oct. 7 attack, which was the deadliest day for Jews since the Holocaust.\nThe United Nations’ International Holocaust Remembrance Day, which falls annually on Jan. 27, often draws attention from non-Jews, offering an opportunity for Holocaust survivors and Jewish groups to reach a wide audience.\nSome Yom HaShoah initiatives and gatherings are expecting large turnouts, in part because of the recent reported rise in antisemitism.\n“This Yom HaShoah cuts us more deeply than any before,” the band wrote in an email to its followers."}, {"id": "dd6594a5-1005-441c-a25d-f8a681e40ec1", "title": "  Like family : three women – two Palestinian , one Jewish – find peace amid campus chaos | California", "date": "2024-05-05 12:45", "url": "https://www.theguardian.com/us-news/ng-interactive/2024/may/05/palestinian-jewish-students-campus-protests", "message": "Ginsborg is Jewish, and Omer and Abdallah are first-generation Palestinian American.\nThousands of miles from Gaza, Ginsborg, Omer and Abdallah met after classes on Tuesday afternoon, reminiscing about student-led events from the past week.\nBut opinions differ among Jewish students across the nation, with many students experiencing a palpable sense of unease at their schools.\nBeing Jewish on campus over the last seven months has been “incredibly hard,” they said.\n“He always said, ‘I grew up with a Jewish family on my left side and a Christian family on my right side,’” she said."}, {"id": "bac3e639-ab4a-43c8-a115-15e18e3286a8", "title": "Glick : Jewish Vote Up for Grabs , It May Decide the Election", "date": "2024-05-04 12:30", "url": "https://www.newsmax.com/world/globaltalk/michigan-tlaib-trump/2024/05/04/id/1163471/", "message": "Noting that he is someone \"who is finely attuned to American Jewish sentiment,\" Hirsch told Democratic elected officials: \"Do not take American Jews for granted.\"\nFirst, most American Jews see themselves first and foremost as Democrats or liberals, not as Jews.\nAnd second, the Jewish vote doesn’t matter because most American Jews live in deep blue states that will never tilt Republican.\nThe Muslim vote, on the other hand, is always in contention.\nAnd, of course, they also insisted that Trump’s advantage in most of the Michigan presidential polls owes to the Muslim vote."}, {"id": "452402c2-46f4-4586-b679-3cc983c52af3", "title": "The Jewish Vote is up for Grabs , and it May Decide the Election | The Jewish Press - JewishPress . com | Caroline B . Glick | 27 Nisan 5784 – Sunday , May 5 , 2024", "date": "2024-05-05 01:30", "url": "https://www.jewishpress.com/indepth/opinions/the-jewish-vote-is-up-for-grabs-and-it-may-decide-the-election/2024/05/05/", "message": "And second, the Jewish vote doesn’t matter because most American Jews live in deep blue states that will never tilt Republican.\nBut anecdotal evidence is piling up that the Jewish vote is in contention like it hasn’t been in more than 40 years.\nMoreover, American Jewish voters may well turn out to be the demographic that determines the outcome of the 2024 presidential election.\nIn 1976, Jimmy Carter won 71% of the Jewish vote in his race against incumbent Gerald Ford.\nIndependent candidate John Anderson won 15% of the Jewish vote, and Ronald Reagan won 39% of the Jewish vote—and the presidency."}, {"id": "80104795-fc8a-486f-b2d4-afd8bc533188", "title": "Rutgers forces Jewish BBQ off campus , gives into anti - Israel encampment demands", "date": "2024-05-04 14:15", "url": "https://nypost.com/2024/05/04/us-news/rutgers-forces-jewish-bbq-off-campus-gives-into-anti-israel-encampments-demands/", "message": "Rutgers University refused to let a Jewish group hold a pro-Israel barbecue on the campus’ Vorhees Mall, despite allowing pro-terror protesters to camp there for days, emails obtained by The Post claim.\nRutgers ChabadThe encampments finally ended after administrators caved into protester demands, including blanket amnesty for demonstrators.\nDespite being forced off campus in the middle of finals, about 100 to 150 people turned out for the barbecue.\n“They can try to intimidate us but we’re not afraid to be pro-Israel on campus,” said Students Supporting Israel co-president Michael Batushansky.\n3 Kelly Shapiro, co-founder of Students Supporting Israel, which organized the barbecue, called the university’s response a clear “antisemitic double standard.” Rutgers Chabad“Our pride won’t be squashed,” added Vaynberg."}, {"id": "bfb9f291-e407-4df0-9554-20e5dc64dabf", "title": "Who is paying for the American campus protests ? ", "date": "2024-05-04 21:45", "url": "https://www.israelnationalnews.com/news/389407", "message": "A closer look into the organizational structure of these mob actions reveals a complex web of student groups, NGOs, nonprofits and even foreign governments.\nAs of 2019, Qatar regularly spends $405 million a year to finance activities at six American universities with branches in Doha.\nIn 2020, American author and translator Raymond Ibrahim published a report showing that Qatar had invested $5.6 billion in 81 American universities since 2007, including Harvard, Yale, Cornell and Stanford.\nOne was a desire to spread Islamic thought into the West and inculcate the American student body in Islamic theology, proselytizing being a core tenant of Wahabi Islam.\nThe Qatari government has openly denied any connection to the student protests on American campuses."}, {"id": "b812f3df-9158-43da-8095-5410d6cf798c", "title": "Beyond bullets and bombs : Lessons of faith , pragmatism , and survival from the vilna g", "date": "2024-05-04 23:45", "url": "https://www.ynetnews.com/article/rj78izvfc", "message": "The diaries of Zelig Kalmanovich, a prominent Jewish scholar in the Vilna Ghetto, offer a glimpse into the agonizing choices faced by individuals trapped within Nazi tyranny.\n3 View gallery Jews in the Vilna Ghetto ( Photo: The Association of Jews from Vilna and Vicinity in Israel )Vilna was once a vibrant center of Jewish life and learning.\nVilna was swiftly occupied by the Germans, and the Jewish population was confined to a crowded ghetto.\nHe championed the ghetto's schools, synagogues, and libraries, viewing them as battlegrounds for the preservation of Jewish identity and a continuation of Jewish history.\nThe perspective of the long Jewish history is essential in analyzing the current events."}, {"id": "bc8d0410-d1b2-491a-a841-8b552a0f3432", "title": "Why is Jew - hatred and anti - Israelism on the rise ? - The Jerusalem Post", "date": "2024-05-04 01:30", "url": "https://www.jpost.com/opinion/article-799568", "message": "Eighty-five years ago, World War II began; the Holocaust had begun earlier, and the Nazi plan of the Final Solution was implemented in 1942.\nThis is a world war against the Jewish people and Israel, supported by most Muslim countries and Muslim authorities.\n(credit: Elizabeth Frantz/Reuters)Eighty-five years ago, World War II was launched against the Nazis; today, the world sees Israel as the enemy.\nAttempts to explain the rise in anti-Israelism in Europe and around the world ignore its historical roots in Jew-hatred.\nRejecting Luther’s Jew-hatred, for example, did not and could not prevent people from reading what he wrote about Jews."}, {"id": "61a0b8d7-f665-4b23-a388-fc38b010859a", "title": "Stewart Weiss on Holocaust Remembrance Day amid student protests", "date": "2024-05-05 02:00", "url": "https://www.jpost.com/opinion/article-799536", "message": "The week(s) ahead offer both tears and cheers as they lead us once again into the modern “Yom” holidays: Yom Hashoah, Yom Hazikaron, and Yom Ha’atzmaut (and later, Yom Yerushalayim).\nDangerous times: Antisemitism and anti-Israel protestsWe live in a dangerous world at a dangerous time, with equal parts ignorance and evil surrounding us.\nA STUDENT protester waves a Palestinian flag above Hamilton Hall on the campus of Columbia University in New York City on Tuesday.\nTragically, there is no shortage of un-Jewish Jews who have joined together with the antisemitic mob, helping to add credence to their crusade.\nThis, he said, was an attempt of the prisoners to gain a false sense of empowerment by “joining” with their persecutors."}, {"id": "51468f54-b121-4421-af61-b1ac84d817d9", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 05:45", "url": "https://abcnews.go.com/International/wireStory/holocaust-survivor-mark-history-differently-after-horrors-oct-109936441", "message": "KIBBUTZ MEFALSIM, Israel -- When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "07d81321-c6c5-4e01-8a14-72b50097eb23", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 07:15", "url": "https://www.clickondetroit.com/news/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nTzamir, whose kibbutz fended off Hamas attackers on Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "b5df155c-d3f3-4352-a776-0b9c11861d25", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7 – Metro US", "date": "2024-05-05 06:45", "url": "https://www.metro.us/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nKIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "83df909f-cd80-498d-8ae7-3097e7d07fb1", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 06:15", "url": "https://www.clickorlando.com/news/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nTzamir, whose kibbutz fended off Hamas attackers on Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "26543570-1804-49bb-ad92-12862cc52b57", "title": "Biden says  order must prevail  during campus protests over the war in Gaza | News , Sports , Jobs", "date": "2024-05-04 05:30", "url": "https://www.weirtondailytimes.com/news/local-news/2024/05/biden-says-order-must-prevail-during-campus-protests-over-the-war-in-gaza/", "message": "As college campuses convulsed with anger over the Vietnam War in 1968, Biden was in law school at Syracuse University.\n“You know, that’s not me.”The White House has also maintained its focus on combating antisemitism.\n“What’s happening on college campuses right now is wrong.”Johnson visited Columbia University with other members of his caucus last week.\n“The radical extremists and far-left agitators are terrorizing college campuses, as you possibly noticed,” Trump said.\nThey saw that it wasn’t based in reality.”Apart from condemning antisemitism, the White House has been reluctant to directly engage on the issue."}, {"id": "29ea4625-6080-4437-a5f3-27ad41ee03df", "title": "The Sources of Anti - Semitic Conduct", "date": "2024-05-05 13:15", "url": "https://freebeacon.com/culture/the-sources-of-anti-semitic-conduct/", "message": "All this makes reading Stone’s book a particularly painful experience.\nYet at the same time, Stone’s descriptions of anti-Semitism of the past sound eerily similar to anti-Semitism manifest today in spheres regarding which the author seems unconcerned.\nWhy, for Stone, is the history of the Holocaust \"unfinished\"?\nIt features a man holding a sign featuring both an Israeli and Palestinian flag, a sign emblazoned with two words: \"Final Solution.\"\nIt is my hope that in a post-October 7 world, Dan Stone can see these dangers too."}, {"id": "2bec8ebc-ba61-40be-bb25-d916df747a9d", "title": "Unrest on American campuses : Inspired by Columbia example , pro - Palestinian encampments spring up at colleges nationwide", "date": "2024-05-03 18:00", "url": "https://www.heritagefl.com/story/2024/05/03/news/unrest-on-american-campuses-inspired-by-columbia-example-pro-palestinian-encampments-spring-up-at-colleges-nationwide/19869.html", "message": "The spread of the demonstrations is being promoted and celebrated by pro-Palestinian activists, including the anti-Zionist Jewish Voice for Peace.\nAnd it’s prompting alarm from Jewish campus groups that are calling on administrators to take more aggressive action.\nAt some schools, including UNC, those encampments have already been dismantled after administrators intervened.\nThe MIT group urged the school to clear the encampment while also providing remote learning options for Jewish students.\nBecause the administration is now doing the oppressing of the students.”Some pro-Palestinian student activists see hypocrisy in their universities’ efforts to crack down on their behavior."}, {"id": "d57d8d8e-437b-4694-a40d-8e1990402808", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 06:45", "url": "https://www.smdailyjournal.com/news/world/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/article_4eac6fac-948d-5499-9d91-85d89390f604.html", "message": "Premium SubscriptionAs low as $8.25 per monthPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "10b4745c-cbd6-4c2d-ae06-0babd29e6dc2", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 09:00", "url": "https://www.newsday.com/news/nation/Israel-Poland-Holocaust-Gaza-march-Auschwitz-h48121", "message": "KIBBUTZ MEFALSIM, Israel — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nHamas militants poured over the border from Gaza and attacked towns, army bases and a music festival in southern Israel."}, {"id": "a2a843b1-e112-4c73-8e3e-a51c32643058", "title": "A Holocaust Survivor Will Mark That History Differently after the Horrors of Oct . 7", "date": "2024-05-05 08:45", "url": "https://www.newsmax.com/world/globaltalk/israel-poland-holocaust-gaza-march-auschwitz/2024/05/05/id/1163510/", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "1b62349c-243c-4bc1-8a1c-bfec214d0959", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 09:45", "url": "https://www.kob.com/news/us-and-world-news/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nJudith Tzamir, a Holocaust survivor from Germany, speaks to a journalist in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "e07865ef-fbde-49f0-9d5e-17667d20ea70", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 08:30", "url": "https://www.wfmz.com/news/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/article_e8f14bc4-6d3a-595d-af45-a5281e1aec28.html", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in the garden of her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\n(AP Photo/Maya Alleruzzo)"}, {"id": "6c1a394e-dbbd-4511-9e3f-0e5837659768", "title": "Holocaust Survivor Finds Solace in Retelling Story in Wake of Recent Tragedy", "date": "2024-05-05 07:00", "url": "https://www.devdiscourse.com/article/law-order/2927949-holocaust-survivor-finds-solace-in-retelling-story-in-wake-of-recent-tragedy", "message": "When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year's Holocaust Remembrance Day, which begins Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nTzamir, whose kibbutz fended off Hamas attackers Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates 132,000 Holocaust survivors live in Israel."}, {"id": "53a7b52c-bbe5-45bf-9511-6eee969c4e2f", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 08:30", "url": "https://www.wsls.com/news/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "Judith Tzamir, a Holocaust survivor from Germany, poses for a portrait in her family home in Kibbutz Meflasim, southern Israel, Friday, May 3, 2024.\nOn Monday, Tzamir will join 55 other Holocaust survivors from Israel and around the world for a memorial march in Poland, called March of the Living.\nTzamir, whose kibbutz fended off Hamas attackers on Oct. 7, will join 55 other Holocaust survivors from around the world and about 10,000 others participating in the March of the Living.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nThe ministry estimates that 132,000 Holocaust survivors live in Israel."}, {"id": "c3bb1c3b-8df0-404c-bc51-42f2e1e1e73a", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 11:30", "url": "https://isp.netscape.com/news/world/story/0001/20240505/492eab9a3b95de64602ccdec863f1b37", "message": "A Holocaust survivor will mark that history differently after the horrors of Oct. 7KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}, {"id": "5bd57f7a-4aac-4dcb-8dae-b53a95412dfa", "title": "The aftermath of police action at UNC pro - Palestinian encampment", "date": "2024-05-05 15:30", "url": "https://indyweek.com/news/orange/our-campuses-have-been-turned-into-war-zones-the-aftermath-of-police-action-at-uncs-pro-palestinian-encampment/", "message": "But a statement from Campus Y student leadership disputed both assertions.\nIn addition to reduced hours, students cannot book Campus Y facilities as the booking portal was removed from the Campus Y website.\nAt around 6 a.m. that morning, university police removed a pro-Palestinian encampment and arrested 36 protestors.\nAt noon, UNC Students for Justice in Palestine (SJP) organized another vigil.\nDuke Academics and Staff for Justice in Palestine has raised more than $50,000 in support of UNC encampment arrestees."}, {"id": "dd4fdcc2-5db2-40a3-8f04-4efe5fbca43d", "title": "  Theyre sending a message : harsh police tactics questioned amid US campus protest crackdowns | US campus protests", "date": "2024-05-04 15:30", "url": "https://www.theguardian.com/us-news/article/2024/may/04/police-tactics-us-campus-protest-crackdowns", "message": "More than 1,400 people have been arrested across the US during a week of intense police crackdowns on a sprawling campus movement of pro-Palestine student demonstrations.\n“They’re sending a message to American students,” she said.\nA police officer fired a gun as police cleared one campus building, which the department later said was an accidental discharge.\nAt student protests where there were no counter-demonstrators, the analysis found, “police have intervened against pro-Palestine demonstrations more than four times as often as pro-Israel demonstrations”.\nBefore officers in heavy body armor arrived at Dartmouth, the nascent student Palestine solidarity protest was “100% peaceful” and “remarkably diverse”, Orleck said."}, {"id": "3a3ba171-2bc0-42c1-ae80-f29b3c65b786", "title": "How did Jews celebrate Passover during a war ? - opinion", "date": "2024-05-04 22:45", "url": "https://www.jpost.com/opinion/article-799791", "message": "This tranquil setting was the location of a dance/music event billed as a festival of “Friends, Love, and Infinite Freedom,” Nova was attended by more than 3,500 young Israelis.\nThe kibbutz is populated by young, idealistic Jews who wish to work the holy soil.\nOn October 7, despite a ceasefire between Hamas and Israel being in place, it was attacked by the Palestinian hordes.\nThese displaced Israelis are among the forgotten in Israel as the war enters its eighth month.\nI can’t imagine any other country at war demonstrating more humanitarian concern than Israel.”Our celebration of Passover in Israel reinforced an important age-old lesson for our family."}, {"id": "542b39cc-c060-4671-8c7b-542e106e581f", "title": "Dueling Israeli - Palestinian protesters clash at UCLA", "date": "2024-05-05 01:45", "url": "https://sundial.csun.edu/181482/news/dueling-israeli-palestinian-protesters-clash-at-ucla/", "message": "Pro-Palestinian protesters had just days earlier constructed an encampment a few hundred yards away.\nOther elements of the crowd were more aggressive and agitating, including some who repeatedly attempted to engage pro-Palestinian protesters in dialogue despite continually getting no response.\nNumerous protesters played drums and banged buckets throughout the hourslong event, as the hundreds of pro-Palestinian protesters were led in chant by supporters with megaphones.\nRoughly two dozen pro-Palestinian protesters were asked for their perspective on the Israeli-Palestinian conflict and the day’s protests at UCLA.\n“[But] at least over here, there’s some sharing of ideas.”No pro-Palestinian protesters wished to express their views publically."}, {"id": "b8351b68-1ce8-41b1-8d79-775fb6083c94", "title": "Progressive Charlestown : College administrators are falling into a tried and true trap laid by the right", "date": "2024-05-04 16:00", "url": "https://www.progressive-charlestown.com/2024/05/college-administrators-are-falling-into.html", "message": "If you were looking for the Charlestown Democratic Town Committee website and ended up here, try thisGot news tips, gossip, suggestions, complaints?E-mail us: progressivecharlestown@gmail.com We strive to avoid errors in our articles.\nOur correction policy can be found here"}, {"id": "ce7df0be-5094-4a5d-9639-3a24bdaf0f46", "title": "How Hampton Roads is responding to student protests", "date": "2024-05-04 20:30", "url": "https://www.pilotonline.com/2024/05/04/as-colleges-responses-to-student-protests-come-under-scrutiny-heres-how-hampton-roads-schools-are-responding/", "message": "As colleges’ responses to student protests come under scrutiny, here’s how Hampton Roads schools are responding"}, {"id": "4ddd9236-b42c-49cb-95ec-d114db0c6b4e", "title": "College protests at Emerson mean criticism for school president", "date": "2024-05-04 12:15", "url": "https://www.bostonglobe.com/2024/05/04/metro/emerson-college-boston-president-protests-critcism/", "message": "“It was a terrible, horrible, no good, very bad day for President Bernhardt,” said Russell Newman, professor and president of the full-time faculty union.\nEmerson students locked arms in protest at the entrance to alley near the tent encampment on April 24.\nTwelve Emerson students were arrested while protesting outside the event against tuition increases and the college’s “silence on the ongoing genocide in Gaza,” according to an Instagram post from Emerson Students for Justice in Palestine.\n“However, we must also emphasize that we cannot prevent the enforcement of Boston city ordinances or Massachusetts state law.”Police arrested pro-Palestinian demonstrators at Emerson College on April 25.\nAn Emerson College student cried during a meeting to call on the school’s president, Jay Bernhardt, to resign on April 26."}, {"id": "0eaefb12-d814-43cf-a172-db1bce56bf81", "title": "How Hampton Roads is responding to student protests", "date": "2024-05-04 20:15", "url": "https://www.dailypress.com/2024/05/04/as-colleges-responses-to-student-protests-come-under-scrutiny-heres-how-hampton-roads-schools-are-responding/", "message": "As colleges’ responses to student protests come under scrutiny, here’s how Hampton Roads schools are responding"}, {"id": "823c67e9-cb9c-47cd-8a9a-5554b711b743", "title": "Reflections on the German state silencing of the Berlin Palestine Congress – Mondoweiss", "date": "2024-05-04 18:15", "url": "https://mondoweiss.net/2024/05/reflections-on-the-german-states-silencing-of-the-berlin-palestine-congress/", "message": "I was inside the Palestine Congress in Berlin two weeks ago, and what took place can only be described as a travesty of justice and an example of the creeping resurgence of fascism in the German state.\nFor weeks, the German media had written about the Congress, or what they described as a gathering where “antisemites plan hate summit.” Weeks leading up to the Congress, Berlin politicians have said they will do everything in their power to stop the gathering from taking place.\nIt was a complete profile filled with my articles, work as a journalist, and social media posts to depict me as an antisemite and supporter of terrorism.\nZaid Abdulnasser, although not a part of the Congress program, received a notice in the mail from the State Immigration Office in Berlin.\nOthers are not only getting fired and receiving notices that they are being investigated by the authorities, but are facing collective punishment by the German state."}, {"id": "879d0c63-02be-4d28-a870-ec8a1438c470", "title": "UC Berkeley opens civil rights investigation into backyard confrontation between a law professor and a student", "date": "2024-05-03 22:30", "url": "https://www.nbcnews.com/news/us-news/uc-berkeley-opens-civil-rights-investigation-backyard-confrontation-la-rcna150667", "message": "The University of California, Berkeley, has opened a Title IX civil rights investigation into whether a law professor harassed a Muslim student during a dinner last month in the professor’s backyard.\nThe investigation by the university’s Office for the Prevention of Harassment and Discrimination stems from an April 9 incident at the home of professor Catherine Fisk and her husband, who is dean of the university’s law school.\nGraduating law student Malak Afaneh said she was subjected to harassment and discrimination when she attempted to deliver an unexpected pro-Palestinian speech at the invitation-only dinner.\nThe two appeared to briefly jostle for the microphone before Fisk released her grip.\nIn an emailed statement at the time, Chancellor Carol Christ said she was “appalled and deeply disturbed by what occurred” and offered support to Fisk and Chemerinsky."}, {"id": "4567baff-2d08-4b31-9069-1c0dbac7db4f", "title": "Here where things stand one week since Penn ordered the Gaza Solidarity Encampment to disband", "date": "2024-05-04 19:00", "url": "https://www.thedp.com/article/2024/05/penn-gaza-solidarity-encampment-day-eight", "message": "The videos, which together are nearly six minutes long, were filmed by a Jewish student walking near the encampment.\nAt one point, the Jewish student asked an encampment participant if they were a student.\nThe DP could not confirm whether DPS has reached out to the student or whether the encampment participant was a student.\nThe DP could not independently corroborate Yakoby's allegation that encampment members have used slurs towards Jewish students.\nHe called on Penn’s leadership to keep students safe and said that Penn has not requested help from state police to disband the encampment."}, {"id": "c0ed716e-2736-479d-a655-68bfae315e11", "title": "The Recent Protests Prove One Thing Above All :  I Feel Unsafe  Isnt Working", "date": "2024-05-03 19:00", "url": "https://www.yahoo.com/news/recent-protests-prove-one-thing-172134647.html", "message": "Well before Israel’s war in Gaza and the U.S. campus protests of it, This is harmful and it makes me unsafe was a familiar claim on college campuses.\nIn the shadow of actual violence, the merely ideologically offensive pales, and the suggestion that even challenging ideas are inherently “unsafe” seems laughable.\nCampus objections to BDS have also centered on the movement’s being “harmful,” with some students asserting that divestment campaigns make them feel unsafe.\nOnce Israel launched its brutal war of reprisal and pro-Palestinian students responded with protests, the safety-related claims escalated.\nStill, as George Packer wrote in the Atlantic of the students making safety claims, “Who could blame them?"}, {"id": "51900bdd-e508-4c68-812c-fa2e7691bc86", "title": "Campus protests and arrests : Recent weeks have shown that colleges cant make everyone feel safe . Maybe they shouldnt need to . ", "date": "2024-05-03 19:30", "url": "https://slate.com/news-and-politics/2024/05/college-protests-ucla-columbia-arrests-antisemitism.html", "message": "Well before Israel’s war in Gaza and the U.S. campus protests of it, This is harmful and it makes me unsafe was a familiar claim on college campuses.\nAdvertisementFor decades, college administrators and professors have emphasized student safety, promising that students won’t just be physically safe on their campuses but will feel safe.\nOnce Israel launched its brutal war of reprisal and pro-Palestinian students responded with protests, the safety-related claims escalated.\nAdvertisementAdvertisementJewish students have reported legitimate safety concerns, including being harassed, threatened, intimidated, and assaulted on campus and near it.\nStill, as George Packer wrote in the Atlantic of the students making safety claims, “Who could blame them?"}, {"id": "6eab34c6-eba5-414f-9a1b-f3e279875f89", "title": "Live updates : Pro - Palestinian college protests against Israel - Hamas war at Portland State , UCLA , Columbia campuses", "date": "2024-05-04 05:30", "url": "https://www.cnn.com/business/live-news/university-protests-pro-palestinian-israel-05-04-24/", "message": "The University of Mississippi has opened a student conduct investigation after actions of “hostility and racist overtones” were portrayed during a demonstration on campus.\nJaylin R. Smith, 24, confirmed to CNN she is the woman seen in the video.\nThe video viewed by CNN shows a large group of counterprotesters yelling at Smith as she walks toward them while holding her phone.\nSmith is heard in the video saying, “I’m not so peaceful” repeatedly as police usher her away from the counterprotesters.\nCNN has been unable to identify any of the counterprotesters seen in the video."}, {"id": "58a95041-b517-4843-8e8c-78904f325de2", "title": "A Holocaust survivor will mark that history differently after the horrors of Oct . 7", "date": "2024-05-05 05:45", "url": "https://toronto.citynews.ca/2024/05/05/a-holocaust-survivor-will-mark-that-history-differently-after-the-horrors-of-oct-7/", "message": "KIBBUTZ MEFALSIM, Israel (AP) — When Hamas fighters invaded southern Israel on Oct. 7, the militant group that rules the Gaza Strip perpetrated the deadliest attack on Jews since the Holocaust.\nSo this year’s Holocaust Remembrance Day, which begins on Sunday evening in Israel, carries a heavier weight than usual for many Jews around the world.\nThe event, now in its 36th year, usually draws thousands of participants, including Holocaust survivors and Jewish students, leaders and politicians.\nTzamir said the Oct. 7 attack brought up all kinds of memories from her childhood trauma.\n“We are coming back.”___This story has been corrected to show that the spelling of the kibbutz is Mefalsim."}]