[{"id": "992d56ac-43f9-49c1-b1f2-2f51ee9c530e", "title": "Scientists in Japan warn of possible  major earthquake  in wake of magnitude 7 . 1 quake Thursday", "date": "2024-08-09 04:15", "url": "https://www.fox29.com/news/japan-earthquake-scientists-warn-possible-major-earthquake-wake-magnitude-7-1-quake-thursday", "domain": "fox29.com", "domain_classification": "Unknown", "message": "Officials in Japan held an emergency meeting in the wake of Thursday’s earthquake and tsunami threat and urged residents to be prepared to take immediate action should a major earthquake occur.\nHOW TO WATCH FOX WEATHERThat data, the JMA said, includes a magnitude 7.0 earthquake that struck two days before a catastrophic magnitude 9.0 earthquake and Pacific-wide tsunami that rocked the region in March 2011.\nThis graphic shows information on the earthquake that struck Japan on Thursday, Aug. 8, 2024.\nAfter the earthquake, scientists met to discuss the relationship between this quake and whether it had impacted the Nankai Trough, which sits about 560 miles offshore.\n\"The Japan Meteorological Agency will continue to carefully monitor the progress of crustal activity along the Nankai Trough.\""}, {"id": "a4046bcf-c735-4675-9e29-a512dbb483cc", "title": "Scientists in Japan warn of possible  major earthquake  in wake of magnitude 7 . 1 quake Thursday", "date": "2024-08-09 04:15", "url": "https://www.fox5ny.com/news/japan-earthquake-scientists-warn-possible-major-earthquake-wake-magnitude-7-1-quake-thursday", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "Officials in Japan held an emergency meeting in the wake of Thursday’s earthquake and tsunami threat and urged residents to be prepared to take immediate action should a major earthquake occur.\nHOW TO WATCH FOX WEATHERThat data, the JMA said, includes a magnitude 7.0 earthquake that struck two days before a catastrophic magnitude 9.0 earthquake and Pacific-wide tsunami that rocked the region in March 2011.\nThis graphic shows information on the earthquake that struck Japan on Thursday, Aug. 8, 2024.\nAfter the earthquake, scientists met to discuss the relationship between this quake and whether it had impacted the Nankai Trough, which sits about 560 miles offshore.\n\"The Japan Meteorological Agency will continue to carefully monitor the progress of crustal activity along the Nankai Trough.\""}, {"id": "bf5a56dd-ff1a-411d-b378-e679158e8142", "title": "Tropical Storm Debby : Tropical storm Debby fury : Tornadoes and floods impact homes , schools , and lives", "date": "2024-08-09 04:30", "url": "https://timesofindia.indiatimes.com/world/us/tropical-storm-debbys-fury-tornadoes-and-floods-impact-homes-schools-and-lives/articleshow/112391314.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Damage to schools and infrastructureFlooding and continued threatFlooding concerns extend to GeorgiaRecovery efforts and challengesTornadoes spawned by Tropical Storm Debby wreaked havoc across North and South Carolina early Thursday.\nThe storms leveled homes, damaged Springfield Middle School, and resulted in one fatality in Lucama , North Carolina .Genesis Cooper’s home in Lucama, located about 40 miles east of Raleigh, was destroyed in just 15 seconds.\nWilson County spokesperson Stephen Mann confirmed the death of one person in a home damaged by the tornado.\nNorth and South Carolina face additional flooding, with up to 6 more inches of rain expected.\nHenry McMaster urged residents to remain vigilant as flooding from North Carolina could affect downstream areas."}, {"id": "d234fb76-ca42-457b-8522-52abb6414323", "title": "Georgetown County clean up underway after Debby leaves minor impact", "date": "2024-08-09 00:15", "url": "https://www.yahoo.com/news/georgetown-county-clean-underway-debby-222503119.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "GEORGETOWN, S.C. (WCBD) — Tropical Storm Debby made a second landfall around 2 a.m. near Bulls Bay and made its way up the coast.\nDespite moving through Georgetown County, residents in the area were spared from most of the significant impacts we saw here in the Lowcountry.\nAfter bracing for significant rain, flooding, and winds, officials in Georgetown County are breathing a sigh of relief.\nThe original forecast was bleak, and we prepared for that and were prepared for anywhere from 20 to 30 inches of rainfall in Georgetown County.\nWe received a fraction of that over the past several days,” said Brandon Ellis, Emergency service director for Georgetown County."}, {"id": "9ae07b80-af96-4452-bcd1-2e45b9e9cc53", "title": "Japan issues first  megaquake  warning after 7 . 1 - magnitude tremor", "date": "2024-08-09 01:00", "url": "https://www.perthnow.com.au/news/world/japan-issues-first-megaquake-warning-after-71-magnitude-tremor-c-15641964", "domain": "perthnow.com.au", "domain_classification": "Unknown", "message": "Japan issued its first warning on Thursday about the possibility of a long-feared “megaquake”.\nThe earthquake occurred off the coast of Miyazaki Prefecture on the main island of Kyushu at 4.42pm local time at a depth of about 29km, according to the Japan Meteorological Agency.\nPolice in Miyazaki Prefecture said there had been 10 reports of damage.\nCredit: APEarlier, officials issued a tsunami advisory following Thursday morning’s quake, warning residents to immediately leave coastal areas of Kochi and Miyazaki prefectures until the warning is lifted.\nPolice in Miyazaki Prefecture said there have been some reports of landslides and some traffic lights have stopped working."}, {"id": "1573a716-166f-4c85-999b-d1076dfc03e2", "title": "Storm Debby makes second landfall in South Carolina", "date": "2024-08-09 01:45", "url": "https://www.canberratimes.com.au/story/8724210/storm-debby-makes-second-landfall-in-south-carolina/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Debby was forecast to bring another 7cm of rain on Thursday to parts of eastern South Carolina, the National Hurricane Center said, with total amounts in some spots exceeding 64cm since Monday.\nRainfall totals could reach 38cm in southeastern North Carolina and 25cm in parts of Virginia."}, {"id": "61f9a52a-ed00-46d4-b1bc-8e50b67a660f", "title": "Local Red Cross Volunteer recounts relief efforts amid flooding from Debby in Florida", "date": "2024-08-09 01:30", "url": "https://13wham.com/news/local/local-red-cross-volunteer-recounts-relief-efforts-amid-flooding-from-debby-in-florida", "domain": "13wham.com", "domain_classification": "Unknown", "message": "Rochester, N.Y. (WHAM) — The American Red Cross has sent several people to support relief efforts in Florida after Tropical Storm Debby made landfall in the state Monday as a hurricane.\nMORE:|Tim Seitz, a volunteer from Webster, got the call to help Saturday evening.\nHe was in Jacksonville as of Thursday afternoon, and anticipates he'll be sent elsewhere as Debby continues to move north.\nYou can see where they had a lot of flooding, and obviously, that was the cause of the apartment complex to collapse.\"\nBesides shelter, the Red Cross usually also makes spiritual, mental and medical care available for those who have been displaced."}, {"id": "a42517d7-3032-4203-8e59-5685ba1deed3", "title": "Pray For Japan : Major Earthquake Strikes Causing Tsunami Advisory | Positive Encouraging K - LOVE", "date": "2024-08-09 01:15", "url": "https://www.klove.com/news/us-and-world/pray-for-japan-major-earthquake-strikes-causing-tsunami-advisory-51470", "domain": "klove.com", "domain_classification": "Unknown", "message": "TOKYO (AP) — A powerful earthquake struck off Japan’s southern coast on Thursday, triggering a tsunami advisory that urged residents to stay away from the coastline.\nThe quake most strongly shook Nichinan city and nearby areas in Miyazaki prefecture on Kyushu island.\nThe tsunami advisory was lifted from most coastlines except those along the Miyazaki prefecture.\nPolice stand outside a damaged building following an earthquake in Miyazaki, western Japan, Thursday, Aug. 8, 2024.\nEarthquakes in areas with nuclear power plants have been a major concern since a massive earthquake and tsunami in March 2011 triggered the Fukushima nuclear disaster."}, {"id": "c8b42386-8993-4b6f-8f10-2d61c1897155", "title": "N . J . storm update : Latest forecast , wind , flood , surf alerts as Debby remnants move closer", "date": "2024-08-09 00:30", "url": "https://www.nj.com/weather/2024/08/nj-storm-update-latest-forecast-wind-flood-surf-alerts-as-debby-remnants-move-closer.html", "domain": "nj.com", "domain_classification": "Unknown", "message": "The National Weather Service has started issuing a series of alerts as New Jersey braces for strong gusty winds, heavy downpours, severe thunderstorms and isolated tornadoes from the remnants of Tropical Storm Debby on Friday.\nThe National Hurricane Center said Debby is now moving toward the north-northwest at a speed of about 10 mph.\n“A faster northward or north-northeastward motion is expected during the next day or two,” the agency said in its latest public storm advisory.\nTropical Storm Debby has lost some of its wind strength, so it was downgraded to a tropical depression shortly before 5 p.m. Thursday.\nHudson County is under wind advisory from noon to 11 p.m. Friday, with southerly winds of 15 to 25 mph and gusts up to 50 mph expected."}, {"id": "bd831724-e71f-4b58-95b7-d742ef8046e5", "title": "Woman dies after tree falls on Rockingham County home", "date": "2024-08-09 04:00", "url": "https://www.yahoo.com/news/woman-dies-tree-falls-rockingham-014158558.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ROCKINGHAM COUNTY, N.C. (WGHP) — A woman died on Thursday when a tree fell on her home, according to the Williamsburg Fire Department.\nRockingham County Sheriff Sam Page says the incident on Clearwater Lane appears to be storm-related as Tropical Depression Debby rolls through the Piedmont Triad.\nWoman dies after tree falls on Rockingham County home (WGHP)Woman dies after tree falls on Rockingham County home (WGHP)Woman dies after tree falls on Rockingham County home (WGHP)Woman dies after tree falls on Rockingham County home (WGHP)Woman dies after tree falls on Rockingham County home (WGHP)Large tree falls on Guilford County Veterans’ Memorial in GreensboroThe storm is causing heavy rainfall and flooding.\nA trailing surface front will hold over western and central North Carolina Friday through Saturday then slowly sweep east through the area Sunday into Monday.\nAcross portions of southeastern North Carolina, the maximum storm total amount of rainfall could be as high as 15 inches with “considerable flooding” expected."}, {"id": "98cd87ef-5b31-4df0-abf9-e0ce3b6c32a9", "title": "  Gut wrenching : Madison County campground experiences major flooding following Debby", "date": "2024-08-09 01:30", "url": "https://www.wctv.tv/2024/08/08/gut-wrenching-madison-county-campground-experiences-major-flooding-following-debby/", "domain": "wctv.tv", "domain_classification": "Unknown", "message": "MADISON COUNTY, Fla. (WCTV) - Flooding from Debby is threatening homes and businesses as water continues to rise days after the storm soaked the Big Bend.\nRagans Family Campground in Madison County was forced to shut down temporarily due to excessive flooding, with picnic tables, benches and grills partially submerged in the waters.\nCampground manager Edward Carlick said the campground experienced minor flooding during Hurricane Debby, which he thought would be the worst of it.\n“It was gut wrenching, you know, and it’s a lot of work,” Carlick said.\nHe said the flooding within the park intensified Wednesday night, and he expects it could get worse before it gets better."}, {"id": "6b9c51dd-1977-4225-8d0b-e340b9be3df0", "title": "Japan PM Kishida may cancel key Central Asia visit over earthquake warning", "date": "2024-08-09 04:30", "url": "https://www.firstpost.com/world/japan-pm-kishida-may-cancel-key-central-asia-visit-over-earthquake-warning-13802699.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "The Japan Meteorological Agency on Thursday warned of the “relatively higher chance” of another major earthquake near Japan’s Pacific coast, following one of magnitude 7.1 off the southwestern island of Kyushu earlier in the day.\nThe seismic activity prompted the Japan Meteorological Agency (JMA) to issue a tsunami advisory.\nPlease do not enter the sea or approach the coast until the warning is lifted,” the Japan Meteorological Agency said in a post on X on Thursday.\nJapan is one of the world’s most earthquake-prone areas as it is situated along the “Pacific Ring of fire\" which is the “most active” earthquake belt globally.\nJapan is located on the joint of four different plates, with the Pacific plate and the Philippine plate to the east and the North America plate and the Eurasian plate to the west."}, {"id": "3604e595-d32e-4e9d-84bf-6bce98e14de6", "title": "Billion Dollar Disasters : 19 So Far in 2024", "date": "2024-08-09 02:15", "url": "http://www.weathernationtv.com/news/billion-dollar-disasters-19-so-far-in-2024", "domain": "weathernationtv.com", "domain_classification": "Unknown", "message": "According to experts from NOAA’s National Centers for Environmental Information, there were four new billion-dollar disasters confirmed for the month, putting the U.S. at 19 for the year.\nThe four new events included a severe weather outbreak in the southern U.S. in mid-May, western wildfires in New Mexico, late June severe weather in the northeast, and Hurricane Beryl.\nOf the 19 $B weather and climate disasters this year, 15 have been severe storm events, two wildfire events, one tropical cyclone, and one winter storm.\nThese disasters consisted of 15 severe storm events, one tropical cyclone event, one wildfire event, and two winter storms.\nAccording to NCEI:\"The U.S. has sustained 395 separate weather and climate disasters since 1980 where overall damages/costs reached or exceeded $1 billion (including CPI adjustment to 2024)."}, {"id": "362314e8-f3aa-48dd-b454-b7207067701b", "title": "City leaders react to flood water study in Punta Gorda", "date": "2024-08-09 02:15", "url": "https://winknews.com/2024/08/08/city-leaders-react-to-flood-water-study-in-punta-gorda/", "domain": "winknews.com", "domain_classification": "Unknown", "message": "A trend of flooding in Punta Gorda has now triggered a plan for a floodwater study.\nAs the water rose, flooding the streets of Punta Gorda, homes like Debbie Wilson-Clay’s looked more like islands.\nThis is the reality for downtown Punta Gorda neighbors, holding their breath during any above-average rain and when the water goes down and feeling their distress falls on deaf ears.\nI wouldn’t want to be living where I hold my breath every time a storm is coming,” said Melissa Reichert, the Punta Gorda Assistant City Manager.\nIf the drains’ design issues are problematic, as many neighbors believe, Reichert says the study will identify them."}]