[{"id": "f8792134-08f6-46eb-aee2-c62e323199c1", "title": "14 Days : High alert", "date": "2024-04-28 02:30", "url": "https://www.jpost.com/israel-news/article-798483", "message": "On March 29, Israeli strikes on Aleppo killed 42 people, including a top Hezbollah figure, Reuters reported.\nOn March 27, Zaher Bashara, 38, from a Druze village, was killed when Hezbollah launched a barrage of rockets at Kiryat Shmona.\nGAZA WAROn April 7, the IDF announced that 604 soldiers and more than 12,000 terrorists had been killed since October 7.\nThe last casualties before the IDF withdrew all forces from the southern Gaza Strip were Capt.\nSecurity forces killed the terrorist, a 26-year-old from Tira."}, {"id": "5f62af3d-ac1a-4227-a1e3-a5d52189d498", "title": "Hezbollah says it fired drones and guided missiles at northern Israel", "date": "2024-04-28 17:30", "url": "https://www.thehindu.com/news/international/hezbollah-says-it-fired-drones-and-guided-missiles-at-northern-israel/article68118107.ece", "message": "April 28, 2024 10:30 pm | Updated 10:30 pm IST - BeirutLebanon’s Iran-backed Hezbollah movement said on Saturday it had targeted northern Israel with drones and guided missiles after cross-border Israeli strikes killed three people, including two of its members.\nThe Israeli Army said its Iron Dome air-defence system “successfully intercepted a suspicious aerial target that crossed from Lebanon into the area of Manara in northern Israel”.\nThe Army also “struck the sources of fire” of several anti-tank missiles launched from Lebanon into the Manara border area, it added.\nOvernight Saturday to Sunday Hezbollah said it had launched dozens of rockets at the Israeli military base at Meron, northern Israel.\nHezbollah has intensified its targeting of military sites in Israel since tensions soared between Israel and Iran over the bombing of Tehran’s Damascus consulate on April 1, widely blamed on Israel."}, {"id": "b5f52511-9314-4601-82f1-b80a5fb7d304", "title": "A new type of warfare - Newspaper", "date": "2024-04-28 07:30", "url": "https://www.dawn.com/news/1830150/a-new-type-of-warfare", "message": "SOME strange yet interesting lessons in the history of warfare surfaced during the recent Iranian attack on Israel.\nIndeed, telling the US meant telling Israel, the target, itself.\nMoreover, the definitions of ‘limited war’, ‘proxy war’ ‘asymmetric war’ are also frequently changing now, and along with it the weapons of war are also undergoing a metamorphosis.\nThe most commonly used weapons of war now are missiles, precision-guided weapons, rockets and drones.\nThe world is rapidly moving towards modern warfare tactics."}, {"id": "61272906-64ac-44eb-8c1b-344be66b0d06", "title": "Hezbollah fires dozens of rockets at Israel Meron in response to attacks", "date": "2024-04-28 10:30", "url": "https://www.naharnet.com:443/stories/en/304889-hezbollah-fires-dozens-of-rockets-at-israel-s-meron-in-response-to-attacks", "message": "Hezbollah said it fired overnight dozens of Katyusha rockets at Israel's Meron settlement and nearby areas in response to attacks on Lebanese towns and civilian homes, especially in Qawzah, Markaba and Srebbine.\nOn Saturday, Hezbollah said it targeted northern Israel with drones and guided missiles after cross-border Israeli strikes killed three people, including two of its members.\nThe army also \"struck the sources of fire\" of several anti-tank missiles launched from Lebanon into the Manara border area, it added.\nEarlier Saturday, Israeli fighter jets \"struck a Hezbollah military structure in the area of Qawzah in southern Lebanon,\" the Israeli army said in a statement.\nIn two separate statements earlier Saturday, Hezbollah mourned the deaths of two fighters from the villages of Kfar Kila and Khiam."}, {"id": "90f03372-c4cb-4c3a-88dc-4ca180f67bc4", "title": "Hezbollah fires dozens of rockets at Israel Meron in response to attacks", "date": "2024-04-29 10:00", "url": "https://naharnet.com/stories/en/304889-hezbollah-fires-dozens-of-rockets-at-israel-s-meron-in-response-to-attacks", "message": "Hezbollah said it fired overnight dozens of Katyusha rockets at Israel's Meron settlement and nearby areas in response to attacks on Lebanese towns and civilian homes, especially in Qawzah, Markaba and Srebbine.\nOn Saturday, Hezbollah said it targeted northern Israel with drones and guided missiles after cross-border Israeli strikes killed three people, including two of its members.\nThe army also \"struck the sources of fire\" of several anti-tank missiles launched from Lebanon into the Manara border area, it added.\nEarlier Saturday, Israeli fighter jets \"struck a Hezbollah military structure in the area of Qawzah in southern Lebanon,\" the Israeli army said in a statement.\nIn two separate statements earlier Saturday, Hezbollah mourned the deaths of two fighters from the villages of Kfar Kila and Khiam."}, {"id": "26112111-3f9f-41e4-a855-f55a8a56efd9", "title": "Richard D . Fisher On Taiwan : Surviving The Next Four Years", "date": "2024-04-28 17:15", "url": "https://www.taipeitimes.com/News/editorials/archives/2024/04/29/2003817089", "message": "Richard D. Fisher On Taiwan: Surviving The Next Four YearsFor the incoming Administration of President-elect William Lai (賴清德), successfully deterring a Chinese Communist Party (CCP) attack or invasion of democratic Taiwan over his four-year term would be a clear victory.\nBut it could also be a curse, because during those four years the CCP’s People’s Liberation Army (PLA) will grow far stronger.\nAs such, increased vigilance in Washington and Taipei will be needed to ensure that already multiplying CCP threat trends don’t overwhelm Taiwan, the United States, and their democratic allies.\nFirst it is necessary to acknowledge that short of actual shooting, the CCP is at war with the United States, Taiwan, and most other democracies.\nRichard D. Fisher, Jr. is a senior fellow with the International Assessment and Strategy Center."}, {"id": "e3d59a18-dd0d-4179-8b67-06773ab1c6a0", "title": "Hamas claims rocket barrage from Lebanon into north Israel", "date": "2024-04-29 10:15", "url": "https://www.firstpost.com/world/hamas-claims-rocket-barrage-from-lebanon-into-north-israel-13764997.html", "message": "AdvertisementAccording to a Telegram announcement from the Ezzedine al-Qassam Brigades, Hamas forces “have fired a concentrated rocket barrage from south Lebanon towards” an Israeli military position.\nAs a “response to the massacres of the Zionist enemy (Israel)” in Gaza and the occupied West Bank, the armed wing explained the attack.\nThe latest rocket barrage came as Hamas negotiators were expected to arrive in Egypt on Monday, where they were due to respond to Israel’s latest proposal for a long-sought truce in Gaza and hostage release.\nOn April 21, the Qassam Brigades claimed a rocket barrage into northern Israel.\nA strike in January, which a US defence official said was carried out by Israel, killed Hamas deputy leader Saleh al-Aruri and six other militants in Hezbollah’s south Beirut stronghold."}, {"id": "4dc2d1e5-bb45-4c54-be3a-69ae75cf195d", "title": "Israeli military hit 270 Gaza terror targets since start of Passover Holiday", "date": "2024-04-28 16:15", "url": "https://www.devdiscourse.com/article/international/2920628-israeli-military-hit-270-gaza-terror-targets-since-start-of-passover-holiday", "message": "Tel Aviv [Israel], April 28 (ANI/TPS): The Israel Defence Forces (IDF) said that over the first six day of the Passover holiday its forces attacked about 270 terrorist targets throughout the Gaza Strip, of which more than 20 were terror infrastructures that were aimed at the territory of Israel.\nIn the attacks rocket launch sites were destroyed.\nIn addition, the IDF attacked a launch site located in the designated humanitarian area in the southern Gaza Strip, using Israel Air Force aircraft.\nThe launch site was loaded and attacked before it could launch rockets at Israeli territory.\nThe IDF said that this was \"further evidence of Hamas's cynical use of civilian spaces for terrorist purposes.\""}, {"id": "92814a66-2027-497f-a25a-776ea7c922c2", "title": "Somalia - Six Hormuud Telecom Staff Killed in Tragic Mogadishu Blast", "date": "2024-04-29 13:15", "url": "https://allafrica.com/stories/202404290199.html", "message": "Mogadishu, Somalia — On the afternoon of April 28, 2024, a devastating explosion rocked the outskirts of Mogadishu, Somalia, claiming the lives of six employees of Hormuud Telecom, the country's largest telecommunications company.\nHormuud Telecom confirmed the deaths of their staff members in a statement expressing deep condolences to the families, friends, and colleagues of the victims.\nThe explosion is part of a disturbing pattern of violence against commercial companies in Somalia, with Hormuud Telecom being a frequent target.\nHormuud Telecom has vowed to continue its operations despite the challenges, emphasizing its commitment to providing essential telecommunications services to the Somali people.\nAs the investigation into the attack continues, the families of the victims and the entire Hormuud Telecom community mourn the loss of their colleagues, friends, and loved ones."}, {"id": "55f24b65-e4be-478e-a6eb-e45b19fd4ee0", "title": "A three - dimensional view of the Israel - Iran crisis", "date": "2024-04-28 20:00", "url": "https://www.thehindu.com/opinion/lead/a-three-dimensional-view-of-the-israel-iran-crisis/article68118479.ece", "message": "“Iran, Iran, Iran,” responded the Prime Minister.\nMr. Netanyahu, Israel’s longest-serving Prime Minister, has never minced words about Iran.\nAnd Israel’s response to the Iran attack was rather “feeble”, as Mr. Netanyahu’s National Security Minister Itamar Ben Gvir himself called it.\nAnd then, Mr. Biden told Mr. Netanyahu that the U.S. would not participate in any Israeli retaliation against Iran.\nBut when Mr. Biden told him that the U.S. would not join Israel’s retaliation, it limited Mr. Netanyahu’s options."}, {"id": "3a74beea-1722-4475-b485-e12f44f7dd21", "title": "Hezbollah Says Fires Drones , Guided Missiles At Israel In Retaliatory Strike", "date": "2024-04-27 21:45", "url": "https://www.ndtv.com/world-news/hezbollah-says-fires-drones-guided-missiles-at-israel-in-retaliatory-strike-5538883", "message": "The border between Lebanon and Israel has seen near-daily exchanges of fire (Representational)Lebanon's Iran-backed Hezbollah movement said Saturday it had targeted northern Israel with drones and guided missiles after cross-border Israeli strikes killed three people, including two of its members.\nThe army also \"struck the sources of fire\" of several anti-tank missiles launched from Lebanon into the Manara border area, it added.\nEarlier Saturday, Israeli fighter jets \"struck a Hezbollah military structure in the area of Qouzah in southern Lebanon,\" the army said in a statement.\nThe border between Lebanon and Israel has seen near-daily exchanges of fire since the Israel-Hamas war in Gaza began nearly seven months ago.\nHezbollah has intensified its targeting of military sites in Israel since tensions soared between Israel and Iran over the bombing of Tehran's Damascus consulate on April 1, widely blamed on Israel."}, {"id": "89ab2eb2-b4c8-429f-9561-569feb580f28", "title": "Israel - Hamas : Biden speaks with Netanyahu as Mideast tensions in U . S . mount", "date": "2024-04-29 05:30", "url": "https://www.cnbc.com/2024/04/29/israel-hamas-biden-speaks-with-netanyahu-as-mideast-tensions-in-us-mount.html", "message": "President Joe Biden (L) listens to Israel's Prime Minister Benjamin Netanyahu as he joins a meeting of the Israeli war cabinet in Tel Aviv.\nPresident Joe Biden held a phone call on Sunday with Israel's Prime Minister Benjamin Netanyahu against the backdrop of growing U.S. college campus protests and a possibly imminent invasion of Rafah.\nNetanyahu shows no signs of backing away from a ground offensive there — a potential move that the U.S. publicly opposes.\nSunday's conversation was Biden and Netanyahu's first phone call since April 4, when Biden spoke with Netanyahu after an Israeli airstrike killed seven World Central Kitchen humanitarian workers.\nBiden said in early April that he thinks Netanyahu is making a \"mistake\" with his handling of the war, adding, \"I don't agree with his approach.\""}, {"id": "98e1036f-4e68-464e-81d1-af2b14f4c455", "title": "Biden speaks with Netanyahu as tensions over the Israel - Hamas war mount in the US", "date": "2024-04-29 00:45", "url": "https://www.nbcnews.com/politics/white-house/biden-speaks-netanyahu-tensions-israel-hamas-war-mount-us-rcna149724", "message": "WASHINGTON — President Joe Biden held a phone call on Sunday with Israel's Prime Minister Benjamin Netanyahu against the backdrop of growing U.S. college campus protests and a possibly imminent invasion of Rafah.\nNetanyahu shows no signs of backing away from a ground offensive there — a potential move that the U.S. publicly opposes.\nSunday's conversation was Biden and Netanyahu's first phone call since April 4, when Biden spoke with Netanyahu after an Israeli airstrike killed seven World Central Kitchen humanitarian workers.\nDuring the earlier April call, Biden \"emphasized that the strikes on humanitarian workers and the overall humanitarian situation are unacceptable,\" according to the White House readout.\nBiden said in early April that he thinks Netanyahu is making a “mistake” with his handling of the war, adding, “I don’t agree with his approach.”"}, {"id": "7c0a2d3f-9d71-4be4-8726-8a7da0546830", "title": "Court Arrests 12th Suspect in Crocus City Hall Attack Case", "date": "2024-04-28 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/04/russia-240427-sputnik02.htm", "message": "Court Arrests 12th Suspect in Crocus City Hall Attack CaseSputnik News20240427MOSCOW (Sputnik) - The Basmanny District Court of Moscow has arrested Dzhumokhon Kurbonov, the twelfth defendant in the Crocus City Hall terrorist attack case, who will remain in custody until May 22, a Sputnik correspondent reported on Saturday.\nSo far, 11 defendants have been charged with committing a terrorist attack resulting in death as part of an organized group under paragraph b of Part 3 of Article 205 of the Russian criminal code.\nKurbonov allegedly provided his accomplices with means of communication and money to pay bills, the Moscow City Court said.\nOn March 22, several armed men broke into the Crocus City Hall concert venue near Moscow and started shooting indiscriminately at concert-goers.\nThe main suspects in the case tried to flee the scene in a car but were detained and charged with terrorism."}, {"id": "275ff102-ee32-4327-8531-ad5ae990ac5e", "title": "Terrorist  sent to hell  after gun battle with security forces in Balochistan Harnai", "date": "2024-04-27 17:30", "url": "https://www.geo.tv/latest/541363-terrorist-sent-to-hell-after-gun-battle-with-security-forces-in-balochistans-harnai", "message": "A terrorist was killed and another was injured in a gun battle between security forces and militants trying to intercept civilian vehicles on Sanjavi Road in Balochistan's district Harnai, the Inter-Services Public Relations (ISPR) said on Saturday.\nThe exchange of fire took place today (April 27) as the security forces reacted immediately and effectively engaged the terrorists, the military's media wing added.\nThe ISPR said that the timely response by the security forces thwarted nefarious intent of the terrorists, saving innocent lives.\nOn Thursday, the security forces killed three terrorists including two ringleaders Sohail aka Azmato and Haji Gul alias Zarkavi in an intelligence-based operation (IBO) in Khyber district.\nAs per the ISPR, the operation was conducted by the security forces on April 24-25 on the reported presence of terrorists in the KP's tribal district."}, {"id": "0eb906ad-b6f1-407c-aa33-ce796275df2e", "title": "Hamas reviewing Israeli proposal for Gaza cease - fire", "date": "2024-04-28 01:45", "url": "https://siouxcityjournal.com/news/nation-world/government-politics/politics-war-conflict-palestinians-protests-hostages/article_adf23418-5d82-5a37-b246-290863384d84.html", "message": "CAIRO — Hamas said Saturday it was reviewing a new Israeli proposal for a cease-fire in Gaza, as Egypt intensified efforts to broker a deal to end the monthslong war and stave off a planned Israeli ground offensive into the southern city of Rafah.\nHamas previously said it won't back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThe Israeli military massed dozens of tanks and armored vehicles in southern Israel close to Rafah and hits the city with near-daily airstrikes.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nGaza war protests ignite on US college campuses"}, {"id": "82fa7d0e-619a-4603-9ad6-272cbc55eb29", "title": "Daughter of prominent Palestinian poet killed in Israeli airstrike in Gaza - LocalNews8 . com", "date": "2024-04-27 15:15", "url": "https://localnews8.com/news/national-world/cnn-world/2024/04/27/daughter-of-prominent-palestinian-poet-killed-in-israeli-airstrike-in-gaza/", "message": "Eyewitnesses in Al-Rimal neighborhood told CNN that three Israeli missiles struck a home where the family were sheltering.\nShaima was the daughter of Palestinian poet Refaat Alareer, who was killed along with several other family members when an Israeli airstrike hit their home in the Shujayya neighborhood in December.\nVideo shot for CNN shows residents running towards the house after the strike and gathering around the bodies of those killed.\nResidents told CNN the family’s remains were taken to Al-Ahli Baptist Hospital.\nJournalist Mohammad Al Sawalhi contributed reporting from central Gaza, as did Khader Al-Za’anoun of Wafa, the official Palestinian news agency."}, {"id": "d5ce5570-e4b7-450e-a9b4-87c2cde6af92", "title": "Security forces eliminate two terrorists in DI Khan IBO", "date": "2024-04-28 16:15", "url": "https://www.thenews.com.pk/latest/1183293-security-forces-eliminate-two-terrorists-in-di-khan-ibo", "message": "— AFP/FileThe security forces on Sunday eliminated two terrorists involved in target killing and extortion in an intelligence-based operation (IBO) in Dera Ismail Khan District of Khyber Pakhtunkhwa, Inter-Services Public Relations (ISPR) said.\nAs per the military’s media wing, the security forces conducted the IBO in Dera Ismail Khan on the reported presence of terrorists.\nThe ISPR reaffirmed Pakistan security forces’ determination to wipe-out the menace of terrorism from the country.\nOn Saturday, the security forces killed a terrorist and injured another in a gun battle in Balochistan's district Harnai, the ISPR stated.\nThe exchange of fire took place as the security forces reacted immediately and effectively engaged the terrorists trying to intercept civilian vehicles on Sanjavi Road, it added."}, {"id": "abb5cc30-1346-4461-a0a8-a56ed37e0445", "title": "Pakistan : Two terrorists shot dead by security forces in Khyber Pakhtunkhwa", "date": "2024-04-29 06:15", "url": "https://www.devdiscourse.com/article/international/2920920-pakistan-two-terrorists-shot-dead-by-security-forces-in-khyber-pakhtunkhwa", "message": "In an intense exchange of gunfire with the security forces, two terrorists were killed in the Dera Ismail Khan district of Khyber Pakhtunkhwa on Sunday, Geo News reported citing the Inter-Services Public Relations (ISPR).\nAs per the military's media wing, the security forces conducted an intelligence-based operation in Dera Ismail Khan on the reported presence of terrorists in the area.\nThe ISPR reaffirmed Pakistan's security forces' determination to wipe out the menace of terrorism from the country, according to Geo News.\nOn Saturday as well, the security forces killed a terrorist and injured another in a gun battle in Balochistan's district Harnai, Geo News reported.\nThe exchange of fire took place as the security forces reacted and effectively engaged the terrorists trying to intercept civilian vehicles on Sanjavi Road, it added."}, {"id": "887edfa5-75ae-4211-afeb-851ae98675d1", "title": "Hamas is reviewing an Israeli proposal for a cease - fire in Gaza , as a planned Rafah offensive looms", "date": "2024-04-27 21:30", "url": "https://www.denverpost.com/2024/04/27/hamas-is-reviewing-an-israeli-proposal-for-a-cease-fire-in-gaza-as-a-planned-rafah-offensive-looms/", "message": "A separate Hamas statement said leaders from the three main militant groups active in Gaza discussed attempts to end the war.\nHamas has said it won’t back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThe Israeli military has massed dozens of tanks and armored vehicles in southern Israel close to Rafah and hit locations in the city in near-daily airstrikes.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael’s military confirmed Saturday that it would be operational by early May."}, {"id": "cfa14350-d14e-4580-8e10-0acc1afc3be4", "title": "World Central Kitchen will resume feeding operations in Gaza weeks after deadly Israeli strike", "date": "2024-04-28 16:15", "url": "https://www.10news.com/world/israel-at-war/world-central-kitchen-will-resume-feeding-operations-in-gaza-weeks-after-deadly-israeli-strike", "message": "World Central Kitchen said it plans to restart aid operations in Gaza on Monday after halting its relief efforts when an Israeli airstrike killed seven of its workers on April 1.\nPrior to the airstrike, World Central Kitchen had distributed more than 43 millions in Gaza, the charity said.\nIsrael at War World Central Kitchen saves lives with food but paid a price in blood AP via Scripps News“The humanitarian situation in Gaza remains dire,” said Erin Gore, World Central Kitchen’s chief executive officer.\nWorld Central Kitchen plans to open a third, high-production kitchen in the region.\nOr keep feeding knowing that aid, aid workers and civilians are being intimidated and killed,” Gore said in a statement."}, {"id": "0f414f3d-b553-4d47-889c-4bc176bfe255", "title": "Hamas is reviewing an Israeli proposal for a cease - fire in Gaza , as a planned Rafah offensive looms - Boston News , Weather , Sports", "date": "2024-04-28 02:00", "url": "https://whdh.com/news/hamas-is-reviewing-an-israeli-proposal-for-a-cease-fire-in-gaza-as-a-planned-rafah-offensive-looms/", "message": "A separate Hamas statement said leaders from the three main militant groups active in Gaza discussed attempts to end the war.\nHamas has said it won’t back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThe Israeli military has massed dozens of tanks and armored vehicles in southern Israel close to Rafah and hit locations in the city in near-daily airstrikes.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael’s military confirmed Saturday that it would be operational by early May."}, {"id": "7f3e85da-6dac-421c-b993-529004e9fe42", "title": "Hamas is reviewing an Israeli proposal for a cease - fire in Gaza , as a planned Rafah offensive looms", "date": "2024-04-27 20:30", "url": "https://www.yahoo.com/news/hamas-reviewing-israeli-proposal-cease-195638742.html", "message": "CAIRO — Hamas said Saturday it was reviewing a new Israeli proposal for a cease-fire in Gaza, as Egypt intensified efforts to broker a deal to end the monthslong war and stave off a planned Israeli ground offensive into the southern city of Rafah.\nHamas has said it won’t back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThe Israeli military has massed dozens of tanks and armored vehicles in southern Israel close to Rafah and hit locations in the city in near-daily airstrikes.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael’s military confirmed Saturday that it would be operational by early May."}, {"id": "f96ea01c-f239-49be-a333-6bdba8272998", "title": "Hamas reviews Israeli proposal for cease - fire in Gaza as planned Rafah assault looms", "date": "2024-04-27 18:45", "url": "https://www.pbs.org/newshour/world/hamas-reviews-israeli-proposal-for-cease-fire-in-gaza-as-planned-rafah-assault-looms", "message": "Senior Hamas official Khalil al-Hayya gave no details of Israel’s offer, but said it was in response to a proposal from Hamas two weeks ago.\nA separate Hamas statement said leaders from the three main militant groups active in Gaza discussed attempts to end the war.\nThe Israeli military has massed dozens of tanks and armored vehicles in southern Israel close to Rafah, and hit locations in the city in near-daily airstrikes.\nAn Israeli airstrike later Saturday on a three-story building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael’s military said Saturday that it would be operational by early May."}, {"id": "3f356a6a-d671-4850-aac0-57413c35467f", "title": "Gaza news : Hamas reviews ceasefire proposal as Rafah offensive looms", "date": "2024-04-27 18:45", "url": "https://www.ctvnews.ca/world/hamas-is-reviewing-an-israeli-proposal-for-a-ceasefire-in-gaza-as-a-planned-rafah-offensive-looms-1.6864376", "message": "Senior Hamas official Khalil al-Hayya gave no details of Israel's offer, but said it was in response to a proposal from Hamas two weeks ago.\nA separate Hamas statement said leaders from the three main militant groups active in Gaza discussed attempts to end the war.\nThe Israeli military has massed dozens of tanks and armored vehicles in southern Israel close to Rafah, and hit locations in the city in near-daily airstrikes.\nAn Israeli airstrike later Saturday on a three-story building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael's military said Saturday that it would be operational by early May."}, {"id": "88981e65-b5c6-4885-80a9-d53fa02f0875", "title": "Hamas is reviewing an Israeli proposal for a cease - fire in Gaza , as a planned Rafah offensive looms", "date": "2024-04-28 01:45", "url": "https://www.twincities.com/2024/04/27/hamas-is-reviewing-an-israeli-proposal-for-a-cease-fire-in-gaza-as-a-planned-rafah-offensive-looms/", "message": "CAIRO — Hamas said Saturday it was reviewing a new Israeli proposal for a cease-fire in Gaza, as Egypt intensified efforts to broker a deal to end the months-long war and stave off a planned Israeli ground offensive into the southern city of Rafah.\nHamas has said it won’t back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThe Israeli military has massed dozens of tanks and armored vehicles in southern Israel close to Rafah and hit locations in the city in near-daily airstrikes.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael’s military confirmed Saturday that it would be operational by early May."}, {"id": "21183051-76cc-43e5-9ced-0e37bbaed7d7", "title": "Hamas reviewing Israeli proposal for cease - fire in Gaza , as a planned Rafah offensive looms", "date": "2024-04-27 22:15", "url": "https://japantoday.com/category/world/hamas-is-reviewing-an-israeli-proposal-for-a-cease-fire-in-gaza-as-possible-rafah-offensive-looms", "message": "A separate Hamas statement said leaders from the three main militant groups active in Gaza discussed attempts to end the war.\nHamas has said it won’t back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThe Israeli military has massed dozens of tanks and armored vehicles in southern Israel close to Rafah and hit locations in the city in near-daily airstrikes.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael's military confirmed Saturday that it would be operational by early May."}, {"id": "7070fcf5-b951-4ef7-baac-8b0ad6c6fceb", "title": "Israeli officials concerned about possible ICC arrest warrants as pressure mounts over war in Gaza", "date": "2024-04-29 10:30", "url": "https://www.durangoherald.com/articles/israeli-officials-concerned-about-possible-icc-arrest-warrants-as-pressure-mounts-over-war-in-gaza/", "message": "×JERUSALEM (AP) — Israeli officials appeared increasingly concerned that the International Criminal Court may issue arrest warrants against the country’s leaders, as international pressure mounts over the war in Gaza.\nMeanwhile, Israeli officials have referred in recent days to an ICC probe launched three years ago into possible war crimes committed by Israel and Palestinian militants going back to the 2014 Israel-Hamas war.\nThere was no comment from the court on Monday, and it has given no indication warrants in the case are imminent.\nBut Israel’s Foreign Ministry said late Sunday that it had informed Israeli missions of “rumors” that warrants might be issued against senior political and military officials.\nForeign Minister Israel Katz said any such warrants would “provide a morale boost” to Hamas and other militant groups."}, {"id": "4b22daf7-9c44-4386-b90a-108d66a8e18d", "title": "Ghana needs new counter - terrorism Act to tackle radicalised youth – CISA", "date": "2024-04-28 03:15", "url": "https://www.ghanaweb.com/GhanaHomePage/NewsArchive/Ghana-needs-new-counter-terrorism-Act-to-tackle-radicalised-youth-CISA-1928185", "message": "It was on the theme: “The Media and Security in an Election Year.”The Ghana Anti-Terrorism Act, 2008, Act 762, is the principal legislation that underlines the legal framework on Violent Extremism and Terrorism in Ghana.\n“The absence of Foreign Fighters Act is worrying as more Ghanaian youth run to war zones, terrorist cells; and return as radicalised lone wolves or form sleeper cells,” Mr Inusah said.\n“It is now time for most countries in Africa, especially Ghana, to consider the urgent need to address these concerns through the enactment of new counter-terrorism legislation (Foreign Fighters Act.\n“The FFA will bestow the law enforcement agencies with the powers to take effective action in advance of any terrorist act being committed,” he added.\nIt uses various tools, including systematic research and publication of articles by CISA analysts and seasoned security and intelligence practitioners to achieve its goals."}, {"id": "040e0ff2-007b-45ef-b563-f97702991333", "title": "Hamas reviewing Israeli proposal for a ceasefire in Gaza , as a planned Rafah offensive looms", "date": "2024-04-28 01:00", "url": "https://www.nzherald.co.nz/world/hamas-reviewing-israeli-proposal-for-a-ceasefire-in-gaza-as-a-planned-rafah-offensive-looms/QYC3XVJCONFERIGOCGCN4JGIAA/", "message": "Senior Hamas official Khalil al-Hayya gave no details of Israel’s offer but said it was in response to a Hamas proposal two weeks ago.\nA separate Hamas statement said leaders from the three main militant groups active in Gaza discussed attempts to end the war.\nThe Israeli military has massed dozens of tanks and armoured vehicles in southern Israel close to Rafah and hit locations in the city in near-daily airstrikes.\nAn Israeli airstrike later on Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael’s military confirmed on Saturday that it would be operational by early May."}, {"id": "db58b3dd-48e6-4826-bc7a-fac5fe37454b", "title": "Terrorists gun down VDG member in Udhampur", "date": "2024-04-28 16:15", "url": "https://www.thestatesman.com/india/terrorists-gun-down-vdg-member-in-udhampur-1503295020.html", "message": "A member of the Village Defence Group (VDG) was on Sunday killed in a gunfight with terrorists in the Udhampur district of Jammu.\nThe deceased, Mohammad Sharief (48 years), sustained critical injuries in the exchange of gunfire with terrorists and passed away later, police said.\nAdvertisementIn a post on X, ADGP (Jammu Range) Anand Jain said: “The J&K Police swiftly responded to intelligence inputs on terrorists near the Basantgarh police station in Udhampur district.\nA clash ensued as the police confronted the hiding terrorists, resulting in one VDC member sustaining injuries.\nOne VDG member sustained injuries in the initial exchange of firing."}, {"id": "f022cb53-0c84-425d-a97a-72cc142749f2", "title": "As US pulls troops from Niger and Chad , what happens to counterterrorism ? ", "date": "2024-04-29 14:00", "url": "https://www.washingtonexaminer.com/opinion/2982332/as-us-pulls-troops-niger-chad-what-happens-counterterrorism/", "message": "Niger and Chad are two of the poorest countries on the planet.\nShortly after, the junta tore up the decadelong security agreement Niger had with Washington and ordered the roughly 1,000 U.S. troops in the country to leave.\nChad, thought to be a reliable U.S. security partner in the Sahel, is putting pressure on Washington as well.\nDeep down, however, it’s not entirely clear why the U.S. should be freaking about leaving Niger and possibly Chad.\nAlso, realistically speaking, staying in a country whose government no longer wants U.S. troops there is an unsustainable situation."}, {"id": "e901fa0e-f4bd-47b5-87e5-cd5343019b39", "title": "Hamas reviewing new Israeli cease - fire proposal amid growing international pressure", "date": "2024-04-27 20:30", "url": "https://kfdm.com/news/nation-world/hamas-reviewing-new-israeli-cease-fire-proposal-amid-growing-international-pressure-gaza-palestine-war-middle-east-ground-offensive-rafah-hostages-prisoners-egyptian-mediators-humanitarian-crisis", "message": "Senior Hamas official Khalil al-Hayya gave no details of Israel's offer, but said it was in response to a Hamas proposal two weeks ago.\nHamas has said it won't back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThere is growing international pressure for Hamas and Israel to reach a cease-fire deal and avert an Israeli attack on Rafah, where more than half of Gaza's 2.3 million people have sought refuge.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael's military confirmed Saturday that it would be operational by early May."}, {"id": "846e6e2c-3abe-43d5-83d5-864e0247a79f", "title": "World Central Kitchen will resume operations in Gaza after killing of 7 aid workers", "date": "2024-04-28 21:15", "url": "https://www.nbcnews.com/news/world-central-kitchen-resume-operations-gaza-rcna149711", "message": "World Central Kitchen announced that it will resume operations in Gaza on Monday, almost one month after seven of its aid workers were killed in an Israeli airstrike in the enclave.\nThe IDF took full responsibility for killing the aid workers, saying it was the result of soldiers mistaking them for Hamas gunmen.\nA car used by World Central Kitchen that was hit by an Israeli strike the previous day is pictured in Deir al-Balah, Gaza, on April 2.\nA hole is blasted through the roof of a World Central Kitchen vehicle, pictured on April 2, the day after an Israeli strike in Deir al-Balah, Gaza.\nGore, the charity's chief executive officer, says WCK was “forced to make a decision: Stop feeding altogether during one of the worst hunger crises ever” or “keep feeding knowing that aid, aid workers and civilians are being intimidated and killed.”“These are the hardest conversations, and we have considered all perspectives when deliberating,” Gore said."}, {"id": "dc9244d4-e9e2-40ac-ba39-31e2acb6bc5b", "title": "Hamas is reviewing an Israeli proposal for a cease - fire in Gaza , as a planned Rafah offensive looms – Metro US", "date": "2024-04-27 17:00", "url": "https://www.metro.us/hamas-is-reviewing-an-israeli-proposal-for-a-cease-fire-in-gaza-as-possible-rafah-offensive-looms/", "message": "A separate Hamas statement said leaders from the three main militant groups active in Gaza discussed attempts to end the war.\nHamas has said it won’t back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThe Israeli military has massed dozens of tanks and armored vehicles in southern Israel close to Rafah and hit locations in the city in near-daily airstrikes.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael’s military confirmed Saturday that it would be operational by early May."}, {"id": "7ac3e834-94f9-40d4-abdd-a2859f02ec6a", "title": "Israel presents new cease - fire proposal as Hamas reviews options amidst intensified peace efforts | Samy Magdy & David Rising / The Associated Press", "date": "2024-04-28 13:45", "url": "https://businessmirror.com.ph/2024/04/28/israel-presents-new-cease-fire-proposal-as-hamas-reviews-options-amidst-intensified-peace-efforts/", "message": "Senior Hamas official Khalil al-Hayya gave no details of Israel’s offer, but said it was in response to a Hamas proposal two weeks ago.\nHamas has said it won’t back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThe Israeli military has massed dozens of tanks and armored vehicles in southern Israel close to Rafah and hit locations in the city in near-daily airstrikes.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael’s military confirmed Saturday that it would be operational by early May."}, {"id": "50fffc92-a98d-4adf-afb6-b8971484a242", "title": "Hamas Is Reviewing An Israeli Proposal For Gaza Cease - Fire , As Rafah Offensive Looms", "date": "2024-04-27 21:30", "url": "https://www.huffpost.com/entry/hamas-reviewing-israeli-proposal-for-gaza-cease-fire-rafah-offensive-looms_n_662d2a80e4b00d7cf28523f2", "message": "Hamas has said it won’t back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nAdvertisementRAFAH, GAZA - APRIL 27: Palestinian residents living in the area including children, inspect the destroyed buildings among the rubbles after an Israeli attack on Barhoum family's house in Rafah, Gaza on April 27, 2024.\nThe Israeli military has massed dozens of tanks and armored vehicles in southern Israel close to Rafah and hit locations in the city in near-daily airstrikes.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael’s military confirmed Saturday that it would be operational by early May."}, {"id": "d705b69e-d56f-485d-9e32-b2e90b7a72f8", "title": "Hamas reviewing Israeli proposal for ceasefire in Gaza , as possible Rafah offensive looms", "date": "2024-04-27 15:00", "url": "https://indianexpress.com/article/world/hamas-israeli-proposal-ceasefire-gaza-rafah-offensive-looms-9293946/", "message": "Hamas said Saturday it was reviewing a new Israeli proposal for a cease-fire in Gaza, as Egypt intensified efforts to broker a deal to end the months-long war and stave off a possible Israeli ground offensive into the southern Gaza city of Rafah.\nIt was not immediately clear whether Israel’s latest response to Hamas on a cease-fire was directly related to Friday’s visit to Tel Aviv by Egyptian mediators.\nIsrael says it will continue military operations until Hamas is defeated and that it will retain a security presence in Gaza afterward.\nThe ministry said Saturday that 32 people killed in Israeli strikes had been brought to local hospitals over the past 24 hours.\nIsrael has reported at least 260 of its soldiers killed since the start of ground operations in Gaza."}, {"id": "0ff4f315-cc21-4d99-81fb-35a301c66d03", "title": "Hamas is reviewing an Israeli proposal for a cease - fire in Gaza", "date": "2024-04-27 20:45", "url": "https://lasvegassun.com/news/2024/apr/27/hamas-is-reviewing-an-israeli-proposal-for-a-cease/", "message": "Hamas is reviewing an Israeli proposal for a cease-fire in GazaJeff Moore / PA via APCAIRO — Hamas said Saturday that it was reviewing a new Israeli proposal for a cease-fire in Gaza, as Egypt intensified efforts to broker a deal to end the months-long war and stave off a planned Israeli ground offensive into the southern city of Rafah.\nSenior Hamas official Khalil al-Hayya gave no details of Israel's offer, but said it was in response to a proposal from Hamas two weeks ago.\nNegotiations earlier this month centered on a six-week cease-fire proposal and the release of 40 civilian and sick hostages in exchange for freeing hundreds of Palestinian prisoners in Israeli jails.\nA separate Hamas statement said leaders from the three main militant groups active in Gaza discussed attempts to end the war.\nIt didn't mention the Israeli proposal."}, {"id": "52b69569-d7ed-46a0-a200-5025582c4900", "title": "My struggle to keep family safe while covering Gaza war", "date": "2024-04-29 05:30", "url": "https://www.the-star.co.ke/news/world/2024-04-29-my-struggle-to-keep-family-safe-while-covering-gaza-war/", "message": "I looked at the faces of my wife and children, huddled in the bitter cold in Khan Younis in southern Gaza, and felt helpless.\nEventually, my family moved to an apartment in Nuseirat in central Gaza, while I stayed with the BBC team in a tent at Nasser hospital in Khan Younis.\nThe Israeli military says it takes \"feasible precautions\" to reduce civilian casualties, and in this case had \"targeted Hamas terrorist infrastructure in the area\".\nAfter that terrifying and surreal journey south, and our night outside the Red Crescent headquarters, I continued working from Khan Younis for several weeks.\nThe Israeli military also closed the main road leading north, which connected me and my family."}, {"id": "14958f50-9cb2-445b-84f6-2fd75f1353f8", "title": "Hezbollah says fires drones and guided missiles at Israel", "date": "2024-04-28 23:00", "url": "https://voiceofvienna.org/2024/04/hezbollah-says-fires-drones-and-guided-missiles-at-israel/", "message": "Lebanon’s Iran-backed Hezbollah movement said Saturday it had targeted northern Israel with drones and guided missiles after cross-border Israeli strikes killed three people, including two of its members.\nThe Israeli army said its Iron Dome air-defence system “successfully intercepted a suspicious aerial target that crossed from Lebanon into the area of Manara in northern Israel”.\nThe army also “struck the sources of fire” of several anti-tank missiles launched from Lebanon into the Manara border area, it added.\nOvernight Saturday to Sunday Hezbollah said it had launched dozens of rockets at the Israeli military base at Meron, northern Israel.\nAn Israeli army statement said its Iron Dome system had succeeded in intercepting missiles fired towards northern Israel from Lebanon’s al-Manara region."}, {"id": "c1c113e9-2579-4bfd-8517-b1f155d4f6c1", "title": "Hamas is reviewing an Israeli proposal for a cease - fire in Gaza", "date": "2024-04-27 14:30", "url": "https://apnews.com/article/israel-hamas-war-news-04-27-2024-7ea816cac94138492f7dddf2865c1d2f", "message": "CAIRO (AP) — Hamas said Saturday it was reviewing a new Israeli proposal for a cease-fire in Gaza, as Egypt intensified efforts to broker a deal to end the months-long war and stave off a planned Israeli ground offensive into the southern city of Rafah.\nHamas has said it won’t back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThe Israeli military has massed dozens of tanks and armored vehicles in southern Israel close to Rafah and hit locations in the city in near-daily airstrikes.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael’s military confirmed Saturday that it would be operational by early May."}, {"id": "ca0df2ba-c3f1-4ed3-a74a-eda54e575ab7", "title": "Hamas claims rocket barrage from Lebanon into north Israel", "date": "2024-04-29 10:00", "url": "https://naharnet.com/stories/en/304893-hamas-claims-rocket-barrage-from-lebanon-into-north-israel", "message": "Hamas' armed wing the Ezzedine al-Qassam Brigades fired Monday a barrage of rockets from south Lebanon toward a command center in northern Israel.\nHamas fighters \"have fired a concentrated rocket barrage from south Lebanon towards\" an Israeli military position, said the Ezzedine al-Qassam Brigades in a statement on Telegram.\nHamas' rocket barrage came as Hamas negotiators were expected to arrive in Egypt on Monday, where they were due to respond to Israel's latest proposal for a long-sought truce in Gaza and hostage release.\nOn April 21, the Qassam Brigades claimed a rocket barrage into northern Israel.\nAn Israeli strike later in March killed a Hamas operative near the Palestinian refugee camp of Rashidiyeh in the Tyre district."}, {"id": "dbccb106-3fa5-4bca-b186-b31b48d65b23", "title": "Hamas claims rocket barrage from Lebanon into north Israel", "date": "2024-04-29 10:30", "url": "https://www.naharnet.com:443/stories/en/304893-hamas-claims-rocket-barrage-from-lebanon-into-north-israel", "message": "Hamas' armed wing the Ezzedine al-Qassam Brigades fired Monday a barrage of rockets from south Lebanon toward a command center in northern Israel.\nHamas fighters \"have fired a concentrated rocket barrage from south Lebanon towards\" an Israeli military position, said the Ezzedine al-Qassam Brigades in a statement on Telegram.\nHamas' rocket barrage came as Hamas negotiators were expected to arrive in Egypt on Monday, where they were due to respond to Israel's latest proposal for a long-sought truce in Gaza and hostage release.\nOn April 21, the Qassam Brigades claimed a rocket barrage into northern Israel.\nAn Israeli strike later in March killed a Hamas operative near the Palestinian refugee camp of Rashidiyeh in the Tyre district."}, {"id": "214e5b12-d370-4fdc-a034-310f49b4fa83", "title": "Hamas is reviewing an Israeli proposal for a cease - fire in Gaza , as possible Rafah offensive looms", "date": "2024-04-27 14:30", "url": "https://www.stripes.com/theaters/middle_east/2024-04-27/israeli-ceasefire-proposal-hamas-13676463.html", "message": "A separate Hamas statement said leaders from the three main militant groups active in Gaza discussed attempts to end the war.\nHamas has said it won’t back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThe Israeli military has massed dozens of tanks and armored vehicles in southern Israel close to Rafah and hit locations in the city in near-daily airstrikes.\nElsewhere, Israeli forces shot and killed two Palestinian men at a checkpoint in the Israeli-occupied West Bank, the military said.\nIsrael’s military confirmed Saturday that it would be operational by early May."}, {"id": "a2fc7fb6-2581-4d6d-8b2e-4243fc3c58e5", "title": "Hamas is reviewing an Israeli proposal for a cease - fire in Gaza – NECN", "date": "2024-04-27 17:30", "url": "https://www.necn.com/news/national-international/hamas-reviewing-israeli-proposal-cease-fire-amid-rafah-threat/3220773/", "message": "Hamas said Saturday it was reviewing a new Israeli proposal for a cease-fire in Gaza, as Egypt intensified efforts to broker a deal to end the months-long war and stave off a possible Israeli ground offensive into the southern Gaza city of Rafah.\nNegotiations earlier this month centered on a six-week cease-fire proposal and the release of 40 civilian and sick hostages in exchange for freeing hundreds of Palestinian prisoners in Israeli jails.\nIt was not immediately clear whether Israel’s latest response to Hamas on a cease-fire was directly related to Friday’s visit to Tel Aviv by Egyptian mediators.\nIsrael says it will continue military operations until Hamas is defeated and that it will retain a security presence in Gaza afterward.\nIsrael has reported at least 260 of its soldiers killed since the start of ground operations in Gaza."}, {"id": "41e80633-967e-486f-a375-bce77f1c4a8a", "title": "Abducted Senior Judge Released In Northwestern Pakistan", "date": "2024-04-29 09:30", "url": "https://www.rferl.org/a/pakistan-kidnapped-judge-released-marwat-taliban/32924821.html", "message": "The ruling Georgian Dream party has argued that the legislation would bring transparency among NGOs and combat what they call \"values imposed by foreigners.\"\nThe decision to expel the seven was made by session chairman Anri Okhanashvili of Georgian Dream, who cited what he said were \"violations\" of parliamentary procedures.\nSeveral other members of the opposition were not allowed to finish their speeches against the piece of legislation advanced by Georgian Dream.\nThe ruling Georgian Dream party introduced the legislation in 2023 but was forced to withdraw it following mass protests.\nHowever, Zurabishvili said Georgian Dream had enough lawmakers to override her if she does use her veto."}, {"id": "4915c79d-1217-4e01-88b7-8cc064598f17", "title": "Australia raids radical suspects following church stabbing", "date": "2024-04-28 08:00", "url": "https://menafn.com/1108147510/Australia-raids-radical-suspects-following-church-stabbing", "message": "(MENAFN) In a significant counter-terrorism operation, Australian law enforcement officers detained seven individuals in Sydney on Wednesday, involving the collaboration of over 400 local, state, and federal authorities.\nThe operation was initiated in response to the stabbing of an Assyrian Christian bishop earlier this month, which authorities have classified as a terrorist incident.\nNew South Wales Police Deputy Commissioner David Hudson addressed reporters, explaining that the raids were conducted as a follow-up to the initial stabbing incident, during which several associates were identified and deemed to require further investigation.\nHowever, the behavior of the detained individuals led authorities to believe that an attack may have been imminent, prompting the pre-emptive detention operation.\nThe operation underscores the ongoing efforts of Australian authorities to address threats posed by extremist ideologies and to ensure the safety and security of the public."}, {"id": "2cf9b3cc-2a85-478c-a3ab-87210433c4dd", "title": "Hamas is reviewing an Israeli proposal for a cease - fire in Gaza , as a planned Rafah offensive looms", "date": "2024-04-27 19:00", "url": "https://www.yakimaherald.com/news/nation_and_world/world/hamas-is-reviewing-an-israeli-proposal-for-a-cease-fire-in-gaza-as-a-planned/article_1c21a47a-e3a7-5c17-8b70-bf50ed5fdbd8.html", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "220d13d5-0a0a-47b5-aedd-e807f52a41b9", "title": "Hamas is reviewing an Israeli proposal for a cease - fire in Gaza , as a planned Rafah offensive looms | iNFOnews", "date": "2024-04-27 17:30", "url": "https://infotel.ca/newsitem/ml-israel-palestinians/cp56134991", "message": "Hamas is reviewing an Israeli proposal for a cease-fire in Gaza, as a planned Rafah offensive loomsPeople protest against Israeli Prime Minister Benjamin Netanyahu's government and call for the release of hostages held in the Gaza Strip by the Hamas militant group in Tel Aviv, Israel, Saturday, April 27, 2024.\nSenior Hamas official Khalil al-Hayya gave no details of Israel's offer, but said it was in response to a Hamas proposal two weeks ago.\nIt didn't mention the Israeli proposal.\nIt wasn't immediately clear whether Israel’s proposal was directly related to the visit.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue."}, {"id": "be16322e-d5d3-4b15-ab29-97de841ea3cb", "title": "Iran Teases New Drone Visually Similar to Russia Lancet", "date": "2024-04-29 10:15", "url": "https://www.globalsecurity.org/wmd/library/news/iran/2024/iran-240428-sputnik01.htm", "message": "Iran Teases New Drone Visually Similar to Russia's LancetSputnik News20240428Ilya TsukanovKicking off its foray into drone design and manufacturing in the 1980s during the Iran-Iraq War, Iran has gone on to create more than 50 different kinds of unmanned aerial vehicles, from reconnaissance and strike drones to loitering munitions.\nIran's Islamic Revolutionary Guard Corps has teased a new drone design apparently taking cues from Russia's distinct X-winged Lancet series of loitering munitions.\nRussia's Lancet DronesThe Russian loitering munitions going under the name \"Lancet\" actually constitute an entire lineup of kamikaze drones, all of them featuring a distinctive single or dual X-wing design.\nIn February, Ukraine announced that it would begin the production of its own Lancet-style drone, signaling a begrudging recognition of the Russian UAV design's potential.\nIran's DronesIran's drone manufacturers have created over 50 different drone designs, from short-range tactical UAVs and loitering munitions to rocket and propeller-powered long-range reconnaissance, attack and electronic warfare drones."}, {"id": "2d91fa93-b720-4e4f-9d32-51dca02fc057", "title": "Horror  General Nuclear War  documents reveal who will be wiped out first if bombing starts", "date": "2024-04-27 14:30", "url": "https://www.dailystar.co.uk/news/world-news/horror-general-nuclear-war-documents-32684414", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\nGeneral Nuclear War are newly-declassified papers which have been kept top-secret by the US government, reveal that if the unspeakable were to happen, Washington DC could be the first to be annihilated.\nClick for more of the latest news from across the world from the Daily Star."}, {"id": "40cca69f-c97f-4ca3-8018-1fce68f4b283", "title": "Hamas - Israel war : Hamas reviewing Israeli proposal for Gaza cease - fire as planned Rafah offensive looms", "date": "2024-04-27 21:30", "url": "https://abc11.com/hamas-israel-war-hamas-reviewing-israeli-proposal-for-gaza-cease-fire-as-planned-rafah-offensive-looms/14739302/", "message": "Hamas is reviewing an Israeli proposal for a cease-fire in Gaza, as a planned Rafah offensive loomsThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nCAIRO -- Hamas said Saturday that it was reviewing a new Israeli proposal for a cease-fire in Gaza, as Egypt intensified efforts to broker a deal to end the months-long war and stave off a planned Israeli ground offensive into the southern city of Rafah."}, {"id": "0df59078-f07e-401c-87c2-b037cd258219", "title": "Hamas - Israel war : Hamas reviewing Israeli proposal for Gaza cease - fire as planned Rafah offensive looms", "date": "2024-04-27 20:15", "url": "https://abc13.com/hamas-israel-war-hamas-reviewing-israeli-proposal-for-gaza-cease-fire-as-planned-rafah-offensive-looms/14739302/", "message": "Hamas is reviewing an Israeli proposal for a cease-fire in Gaza, as a planned Rafah offensive loomsThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nCAIRO -- Hamas said Saturday that it was reviewing a new Israeli proposal for a cease-fire in Gaza, as Egypt intensified efforts to broker a deal to end the months-long war and stave off a planned Israeli ground offensive into the southern city of Rafah."}, {"id": "2c5bd072-7c4a-42e8-a3b6-f3ef95f6d297", "title": "Hamas - Israel war : Hamas reviewing Israeli proposal for Gaza cease - fire as planned Rafah offensive looms", "date": "2024-04-27 17:30", "url": "https://abc7chicago.com/hamas-israel-war-hamas-reviewing-israeli-proposal-for-gaza-cease-fire-as-planned-rafah-offensive-looms/14739302/", "message": "Hamas is reviewing an Israeli proposal for a cease-fire in Gaza, as a planned Rafah offensive loomsThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nCAIRO -- Hamas said Saturday that it was reviewing a new Israeli proposal for a cease-fire in Gaza, as Egypt intensified efforts to broker a deal to end the months-long war and stave off a planned Israeli ground offensive into the southern city of Rafah."}, {"id": "d0908e2c-a773-4cc1-b76a-f5b462f1f087", "title": "Hamas - Israel war : Hamas reviewing Israeli proposal for Gaza cease - fire as planned Rafah offensive looms", "date": "2024-04-27 19:00", "url": "https://abc7ny.com/hamas-israel-war-hamas-reviewing-israeli-proposal-for-gaza-cease-fire-as-planned-rafah-offensive-looms/14739302/", "message": "Hamas is reviewing an Israeli proposal for a cease-fire in Gaza, as a planned Rafah offensive loomsThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nThe U.S. declined to sanction three Israeli military units accused of abusing Palestinian civilians.\nCAIRO -- Hamas said Saturday that it was reviewing a new Israeli proposal for a cease-fire in Gaza, as Egypt intensified efforts to broker a deal to end the months-long war and stave off a planned Israeli ground offensive into the southern city of Rafah."}, {"id": "cce585fd-97fd-4dcc-9a42-8b7a76ea93e9", "title": "Hamas reviewing new Israeli cease - fire proposal amid growing international pressure", "date": "2024-04-27 19:45", "url": "https://katu.com/news/nation-world/hamas-reviewing-new-israeli-cease-fire-proposal-amid-growing-international-pressure-gaza-palestine-war-middle-east-ground-offensive-rafah-hostages-prisoners-egyptian-mediators-humanitarian-crisis", "message": "Senior Hamas official Khalil al-Hayya gave no details of Israel's offer, but said it was in response to a Hamas proposal two weeks ago.\nHamas has said it won't back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThere is growing international pressure for Hamas and Israel to reach a cease-fire deal and avert an Israeli attack on Rafah, where more than half of Gaza's 2.3 million people have sought refuge.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael's military confirmed Saturday that it would be operational by early May."}, {"id": "04a3ff5a-323a-4f84-93f5-795c89827877", "title": "BBC Gaza reporter : My struggle to keep family safe while covering the war", "date": "2024-04-29 00:30", "url": "https://www.yahoo.com/news/bbc-gaza-reporter-struggle-keep-231759103.html", "message": "The BBC Arabic reporter shares the harrowing moments he faced covering a war that pushed him to his limits.\nI looked at the faces of my wife and children, huddled in the bitter cold in Khan Younis in southern Gaza, and felt helpless.\nIn Khan Younis, the BBC team - about seven of us - lived on one meal a day.\nThe Israeli military says it takes \"feasible precautions\" to reduce civilian casualties, and in this case had \"targeted Hamas terrorist infrastructure in the area\".\n[BBC]Reporting Gaza: My WarIn Gaza, Palestinian journalists document the war as they live it on a daily basis."}, {"id": "7cebe3c6-61fa-4537-a416-10170fddedb8", "title": "Hamas reviewing new Israeli cease - fire proposal amid growing international pressure", "date": "2024-04-27 18:15", "url": "https://wpde.com/news/nation-world/hamas-reviewing-new-israeli-cease-fire-proposal-amid-growing-international-pressure-gaza-palestine-war-middle-east-ground-offensive-rafah-hostages-prisoners-egyptian-mediators-humanitarian-crisis", "message": "Senior Hamas official Khalil al-Hayya gave no details of Israel's offer, but said it was in response to a Hamas proposal two weeks ago.\nHamas has said it won't back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThere is growing international pressure for Hamas and Israel to reach a cease-fire deal and avert an Israeli attack on Rafah, where more than half of Gaza's 2.3 million people have sought refuge.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael's military confirmed Saturday that it would be operational by early May."}, {"id": "45295c3a-ce82-4554-a5b5-292a63a0f17b", "title": "Hamas reviewing new Israeli cease - fire proposal amid growing international pressure", "date": "2024-04-27 17:15", "url": "https://wjla.com/news/nation-world/hamas-reviewing-new-israeli-cease-fire-proposal-amid-growing-international-pressure-gaza-palestine-war-middle-east-ground-offensive-rafah-hostages-prisoners-egyptian-mediators-humanitarian-crisis", "message": "Senior Hamas official Khalil al-Hayya gave no details of Israel's offer, but said it was in response to a Hamas proposal two weeks ago.\nHamas has said it won't back down from demands for a permanent cease-fire and full withdrawal of Israeli troops.\nThere is growing international pressure for Hamas and Israel to reach a cease-fire deal and avert an Israeli attack on Rafah, where more than half of Gaza's 2.3 million people have sought refuge.\nAn Israeli airstrike later Saturday on a building in Rafah killed seven people, including six members of the Ashour family, according to the morgue.\nIsrael's military confirmed Saturday that it would be operational by early May."}, {"id": "e3eb0a7e-3b46-427a-8bad-c21ad2902ab0", "title": "Hamas reviewing Israeli ceasefire proposal as possible Rafah offensive looms", "date": "2024-04-27 14:30", "url": "https://www.breakingnews.ie/israel-hamas/hamas-reviewing-israeli-ceasefire-proposal-as-possible-rafah-offensive-looms-1618539.html", "message": "Hamas said on Saturday it was reviewing a new Israeli proposal for a ceasefire in Gaza, as Egypt intensified efforts to broker a deal to end the months-long war and stave off a possible Israeli ground offensive into the southern Gaza city of Rafah.\nSenior Hamas official Khalil al-Hayya said the Palestinian militant group was evaluating Israel’s proposal, and “upon completion of its study, it will submit its response”.\nAdvertisementHe gave no details of Israel’s offer but said it was in response to a proposal from Hamas two weeks ago.\nNegotiations earlier this month centred on a six-week ceasefire proposal and the release of 40 civilian and sick hostages in exchange for freeing hundreds of Palestinian prisoners in Israeli jails.\nSince then, 491 Palestinians have been killed by Israeli fire in the territory according to the Ramallah-based health ministry."}]