[{"id": "9bf7c064-cec3-4a3f-9ec9-59d0ec6c7ff9", "title": "Israeli Strike Kills 1 , Wounds Many East Of Lebanon Tyre - Report", "date": "2024-06-14 06:30", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-israeli-strike-kills-1-wounds-many-east-of-lebanon-s-tyre-report", "domain": "i24news.tv", "domain_classification": "Unknown", "message": "Initial reports indicated that an Israeli airstrike targeted a residential building between the towns of Jannata and Deir Qanoun En Nahr in southern Lebanon, according to Lebanon’s official National News Agency.\nAl Arabiya sources suggest that the building allegedly targeted by the Israel Defense Forces (IDF) in Jannata was rented by Hezbollah.\nAccording to the Lebanese news outlet An-Nahar, several drones were seen above the building during the missile attack.\nThe strike came shortly after Hezbollah claimed launching rockets and weaponized drones at several Israeli military sites in a coordinated attack on the country's north earlier on Thursday.\nHostilities on the Israel-Lebanon border have intensified after the Israeli military on Tuesday carried out a strike in the same district, killing a senior Hezbollah commander."}, {"id": "21d37202-f9c7-4df3-9aac-6c847cf3046f", "title": "Two Lebanese Women Martyred , Dozens Injured in Israeli Air on South Lebanon", "date": "2024-06-14 09:15", "url": "https://english.almanar.com.lb/2131582", "domain": "english.almanar.com.lb", "domain_classification": "Unknown", "message": "Two Lebanese women lost their lives and 14 people were wounded in an Israeli air strike on a building in Jennata, South Lebanon.\nThe attack sparked fears of retaliation from Hezbollah, with Israeli media warning of unpredictable responses.\nAs rescue teams search for survivors under the rubble, tensions escalate as Hezbollah carried out a significant counterattack in response to the ongoing assaults on Lebanese towns and civilians by the Israeli occupation.\nThe Resistance launched a joint missile and drone attack, targeting multiple Israeli occupation military sites and barracks in a 30-minute operation.\nIsraeli media reported the attack involved 150 rockets, drones, and anti-tank missiles, marking the largest assault since October 7."}, {"id": "9e5a8e75-d212-48fb-84ff-fdc2dbeb97db", "title": "Hezbollah fires new barrage at Israel , which vows to hit back", "date": "2024-06-14 04:45", "url": "https://dunyanews.tv/en/World/818434-Hezbollah-fires-new-barrage-at-Israel,-which-vows-to-hit-back", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Hezbollah fires new barrage at Israel, which vows to hit backWorld World Hezbollah fires new barrage at Israel, which vows to hit backHezbollah group said it had fired waves of rockets and drones at the Israeli army on Thursday.\nThe major attack comes after months of near-daily cross-border fire between the group and the Israeli military since Hezbollah ally Hamas's October 7 attack on Israel triggered the Gaza war.\nThe Israeli army said during the afternoon that about \"40 projectiles were launched toward the Galilee and Golan Heights area\", adding most were intercepted, while some ignited fires.\nThe Israeli army confirmed it carried out the strike that \"eliminated\" Abdallah on Tuesday, describing him as \"one of Hezbollah's most senior commanders in southern Lebanon\".\nA Lebanese military source said he was the \"most important\" Hezbollah commander to have been killed since the start of the war."}, {"id": "eb7bc551-7ad9-4410-ae5d-89a1c079c9dd", "title": "Hizbollah Rains Rockets On Israel After Strike Kills Commander", "date": "2024-06-14 04:45", "url": "https://menafn.com/1108331324/Hizbollah-Rains-Rockets-On-Israel-After-Strike-Kills-Commander", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Hizbollah has traded near-daily cross-border fire with Israeli forces since its Palestinian ally Hamas attacked southern Israel on October 7, triggering war in the Gaza Strip.\nThe exchanges have escalated in recent weeks, with Hizbollah stepping up its use of drones to attack Israeli military positions and Israel hitting back with targeted strikes against the fighters.\nThe Israeli forces on Wednesday confirmed it had“eliminated” Taleb Sami Abdallah in a strike the day before on a Hizbollah command centre in southern Lebanon.\nOn Tuesday, Hizbollah said it fired about 50 rockets at Israeli positions in the annexed Golan Heights.\nTens of thousands of people have been displaced on both sides of the border since the violence erupted the day after the Hamas attack on southern Israel."}, {"id": "2046dbfb-0554-4e76-a4a2-9199360b5eb3", "title": "Man arrested in connection with three stabbings throughout Charlotte", "date": "2024-06-14 01:30", "url": "https://www.wsoctv.com/news/local/cmpd-arrests-suspect-accused-stabbing-woman-she-left-work/BCHDJ7F4WNGEPCVCMMINDRHVYQ/", "domain": "wsoctv.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "4af9eee3-3185-46eb-b5a0-e415e67111e1", "title": "Gaza : 30 Palestinians killed , 105 injured by Israeli bombings last 24hrs - The Muslim News", "date": "2024-06-14 02:00", "url": "https://muslimnews.co.uk/news/palestine/gaza-30-palestinians-killed-105-injured-by-israeli-bombings-last-24hrs/", "domain": "muslimnews.co.uk", "domain_classification": "Unknown", "message": "By Abdul Adil(The Muslim News): At least 30 people were killed and 105 others were injured in Israeli indiscriminate bombings in Gaza Strip in the last 24 hours, according to the Health Ministry.\nThe Israeli artillery fired shells at Palestinian homes northwest of the Nuseirat camp and Al-Mughraqa area in the central Gaza Strip.\nWAFA correspondent reported that Israeli warplanes targeted a house in the Nafeq Street area of Gaza City with two missiles.\nAn Israeli airstrike on a residential apartment in Gaza City killed seven Palestinians and injured others, including children and women, on Thursday, according to Gaza’s Civil Defense Agency.\nWitnesses also told Anadolu that Israeli artillery continues to shell areas and homes in the Al-Zaytoun neighborhood in southeast of Gaza City."}, {"id": "6baab345-46bd-443c-9990-71eb27250b55", "title": "Hezbollah claims biggest attack on Israel since outbreak of Gaza conflict - Xinhua", "date": "2024-06-14 08:30", "url": "https://english.news.cn/20240613/f195ee24eb9a4c59b20511b318dd55c4/c.html", "domain": "english.news.cn", "domain_classification": "Unknown", "message": "A member of the Lebanese Civil Defense works to extinguish fires in Marjeyoun, Lebanon, on June 13, 2024.\nTuesday's attack hit a house in Jouaiya, killing Abu Talib and three of his companions.\nA Lebanese military source told Xinhua that the Lebanese Army's observation posts on Thursday monitored the launch of about 150 surface-to-surface missiles and about 20 drones from Lebanon towards northern Israel.\nTensions along the Lebanon-Israel border escalated on Oct. 8, 2023, following a barrage of rockets launched by Hezbollah towards Israel in solidarity with Hamas's attack on Israel the day before.\n(Photo by Taher Abu Hamdan/Xinhua)A member of the Lebanese Civil Defense works to extinguish fires in Marjeyoun, Lebanon, on June 13, 2024."}, {"id": "0e7c0c31-ba48-4afa-995b-ec2ebbddfd02", "title": "Huthi missile attack severely injures sailor on cargo ship : US military", "date": "2024-06-14 04:45", "url": "https://dunyanews.tv/en/World/818432-Huthi-missile-attack-severely-injures-sailor-on-cargo-ship:-US-military", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Huthi missile attack severely injures sailor on cargo ship: US militaryWorld World Huthi missile attack severely injures sailor on cargo ship: US militaryTwo cruise missiles launched by Huthi rebels struck a bulk cargo carrier in the Gulf of Aden.\nOne civilian mariner was severely injured during the attack,\" the US Central Command (CENTCOM) said in a statement.\n\"This continued reckless behavior by the Iranian-backed Huthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden.\"\nOn Wednesday, the Huthis struck the Tutor, a Liberian-flagged bulk carrier, southwest of Hodeida.\nCENTCOM later said the Tutor had been struck by a Huthi \"unmanned surface vessel\" that \"caused severe flooding and damage to the engine room\"."}, {"id": "5151ddd3-cfc7-4087-9ea6-f300e201f5e9", "title": "Houthi missile strikes set ship ablaze , injure one crew , US military says", "date": "2024-06-14 04:30", "url": "https://interaksyon.philstar.com/politics-issues/2024/06/14/277392/houthi-missile-strikes-set-ship-ablaze-injure-one-crew-us-military-says/", "domain": "interaksyon.philstar.com", "domain_classification": "Unknown", "message": "The Iran-allied Mouths have launched dozens of attacks on international shipping in the Red Sea region since November in solidarity with the Palestinians in the war between Israel and Hamas.\nThree missiles struck the Verbena on Thursday, sparking a fire and damaging the ship, the United Kingdom Maritime Trade Operations (UKMTO) agency said.\nA day earlier, Yemen’s Houthi militants took responsibility for small watercraft and missile attacks that left the Tutor, a Greek-owned cargo ship, taking in water and in need of rescue near Yemen’s Red Sea port of Hodeidah.\nThe Houthi campaign in the Red Sea region has disrupted global shipping, cascading delays and costs through supply chains.\nUKMTO said the master of one of those reported an explosion near the vessel that did not cause any damage or injury."}, {"id": "f6b99f39-9a15-4315-ae61-1a0365a15cfe", "title": "Ukraine Presumed Air Base Targeted by Russian Combined Missile and Drone Attack", "date": "2024-06-14 07:30", "url": "https://www.kyivpost.com/post/34262", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "The primary target of the strike was Starokostyantyniv in the Khmelnytsky region, which is widely thought to be home to a vast Ukrainian air base.\nThe assault began at approximately 22:40 with the attack by Iranian-made Shahed combat drones, followed by the launch of cruise missiles, and concluded at 04:43.\nFor the first time since a Russian Tu-22M3 was shot down, the strategic bomber was employed within reach of Ukraine’s air defense systems.\nJust over an hour later, at 06:00, Starokostyantyniv was attacked using a Kh-47M2 Kinzhal hypersonic missile.\nAdvertisementUkraine's Air Force successfully intercepted five out of 7 missiles and 14 out of 17 drones during the assault, with air defenses reacting in the Khmelnytsky, Kyiv, Dnipropetrovsk, Zaporizhia, Mylolaiv, Kharkiv and Odesa regions."}, {"id": "27dd5aae-e560-46be-a875-db30d8525518", "title": "A missile strike from Yemen Houthi rebels sets a cargo ship on fire in Gulf of Aden", "date": "2024-06-14 05:30", "url": "https://abcnews.go.com/Business/wireStory/missile-strike-yemens-houthi-rebels-sets-cargo-ship-111114121", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Earlier Thursday, the British military's United Kingdom Maritime Trade Operations center said a vessel had been attacked and had caught fire.\nThe Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nThe Houthis, who seized Yemen’s capital nearly a decade ago and have been fighting a Saudi-led coalition since shortly after, have been targeting shipping throughout the Red Sea corridor."}, {"id": "df1edee9-c41d-4bc9-9cb7-204a2974043f", "title": "Hezbollah says it attacked 9 Israeli military sites with rockets and drones", "date": "2024-06-14 00:00", "url": "https://www.scmp.com/news/world/middle-east/article/3266548/hezbollah-says-it-attacked-9-israeli-military-sites-rockets-and-drones", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Asked about the incident, the Israeli military said it was looking into it.\nThe attacks were carried out in retaliation for an Israeli strike on Tuesday that killed a senior Hezbollah field commander .\nHezbollah said it had launched rockets and weaponised drones at nine Israeli military sites in a coordinated attack on Thursday, ramping up hostilities on Lebanon’s southern border for the second consecutive day.\nHezbollah said in a statement earlier that it had fired volleys of Katyusha and Falaq rockets at six Israeli military locations.\nState broadcaster Kan broadcast footage of numerous mid-air interceptions of rockets above Israeli towns, including in Safed, some 12km (7.5 miles) from the border."}, {"id": "9bd14836-1c18-4eeb-839e-e94251e54c43", "title": "A missile strike from Yemen  Houthi rebels sets a cargo ship on fire in Gulf of Aden", "date": "2024-06-14 05:15", "url": "https://www.theweek.in/wire-updates/international/2024/06/14/fgn9-yemen-houthi--rebels-cargo.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Dubai, Jun 14 (AP) Yemen's Houthi rebels launched two anti-ship cruise missiles and struck a commercial ship Thursday in the Gulf of Aden off Yemen, setting it on fire and severely wounding one civilian mariner, authorities said.\nThe Houthis later claimed the attack on the Verbena, as well as attacks on two other ships in the Red Sea.\nThe attack on the Verbena follows the Houthis launching a boat-borne bomb attack against a commercial ship in the Red Sea on Wednesday.\nCentral Command also said it destroyed a Houthi drone boat and two patrol boats in the Red Sea, as well as one airborne drone.\nThe Houthis, who seized Yemen's capital nearly a decade ago and have been fighting a Saudi-led coalition since shortly after, have been targeting shipping throughout the Red Sea corridor."}, {"id": "761de6ca-8dcb-47cb-9283-af1a6d35340f", "title": "Wakeley church terrorist attack : Alleged Wakeley church terror stabber faces new charges", "date": "2024-06-14 03:30", "url": "https://www.9news.com.au/national/alleged-wakeley-church-terror-stabber-faces-new-charges/f623106b-629a-4955-bcb5-a100806141af", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "Investigators will comb through thousands of videos and images on the phone of a 16-year-old boy accused of stabbing a bishop during a live-streamed sermon.\nFresh charges have been levelled against a 16-year-old boy accused of stabbing a bishop.\nThe teen is behind bars, accused of stabbing Assyrian bishop Mar Mari Emmanuel and priest Isaac Royel during a live-streamed service at Christ the Good Shepherd Church on April 15.\nThe fresh intent to murder charge relates to Bishop Emmanuel, while the intent to cause grievous bodily harm charge relates to Father Royel.\nThe stabbing, which investigators say was religiously motivated, left Bishop Emmanuel seriously injured before the teenager was subdued."}, {"id": "cca004c0-ab82-4a27-b557-c75170231456", "title": "Houthi missile strike on cargo ship severely injures sailor", "date": "2024-06-14 09:00", "url": "https://www.thenationalnews.com/news/mena/2024/06/14/houthi-missile-strike-on-cargo-ship-severely-injures-sailor/", "domain": "thenationalnews.com", "domain_classification": "Local - Middle East", "message": "A sailor was severely wounded after a cargo ship in the Gulf of Aden was hit by two cruise missiles fired by Yemen's Houthi rebels on Thursday.\nAircraft from USS Philippine Sea missile cruiser evacuated the injured sailor to another ship for treatment, it said.\nHouthi rebels in Yemen have pledged to disrupt all shipping destined for Israel through the Red Sea and the Suez Canal.\nCentcom said the Houthis had launched two ballistic missiles in the Red Sea that caused “no injuries or significant damage”.\nCentcom also said it destroyed an unmanned Houthi boat and two patrol vessels in the Red Sea, as well as one drone."}, {"id": "7a67d599-ebc9-493c-8299-7f568da7ad63", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:45", "url": "https://970kfbx.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "970kfbx.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "7d5b7abd-3f74-446b-8bb7-6ab743d56522", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:30", "url": "https://talkradio1080.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "talkradio1080.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "c11efe84-01ab-47c0-b965-dbc7655be3a9", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:30", "url": "https://newsradio1470.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "newsradio1470.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "75b20ef6-2aeb-48da-8477-89c2265502ae", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building | NewsRadio WKCY", "date": "2024-06-14 00:30", "url": "https://newsradiowkcy.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "newsradiowkcy.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "0bc35e23-82c9-48b0-b348-db52438f7399", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:00", "url": "https://ktok.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/", "domain": "ktok.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "fb1cb9d5-a59d-4276-82e1-ac49c8151c7e", "title": "Dispute Over Stolen Wallet Led To Possible Bombing At Apartment Building", "date": "2024-06-14 00:00", "url": "https://jetradio1400.iheart.com/content/2024-06-13-dispute-over-stolen-wallet-led-to-possible-bombing-at-apartment-building/?pname=www.jetradio1400.com&sc=dnsredirect", "domain": "jetradio1400.iheart.com", "domain_classification": "Unknown", "message": "Authorities in Connecticut are investigating an explosion at an apartment building that resulted in the evacuation of 150 people from the surrounding area.\nBridgeport Police Chief Roderick Porter said that a fire broke out on the third floor of an apartment building just before 12:30 a.m.\nAbout 150 people were evacuated from the immediate area as officers combed the building for other potential devices.\nTwo sources with the investigation told WVIT that the bombing stemmed from a dispute between two people over a stolen wallet.\nThey believe that one of those people placed the small explosive device on the third floor of the apartment building and detonated it."}, {"id": "b3a6018a-412b-4b7f-9ea0-66a8447fb56c", "title": "Middle East crisis : As border clashes intensify , Hezbollah fires rockets into northern Israel again", "date": "2024-06-14 04:30", "url": "https://thelabradorian.ca/middle-east-crisis-as-border-clashes-intensify-hezbollah-fires-rockets-into-northern-israel-again/", "domain": "thelabradorian.ca", "domain_classification": "Unknown", "message": "But al-Manar, the group’s broadcaster, reported at one point that more than 100 people had been shot in a coordinated attack targeting several Israeli military installations.\nIsrael’s military said in the afternoon that Hezbollah had fired more than 40 rockets across the border, but the barrage continued into the evening.\nOn Wednesday, Israel fired more than 200 rockets at Israel, according to the military, but they did little damage.\nThe Israeli military said Thursday that its warplanes struck “Hezbollah military structures” in Lebanese border villages overnight.\nSome residents said they had never seen the leaflets, while others said they were confused by the numbering system the Israeli military uses to define “humanitarian zones”."}, {"id": "f270f636-5e94-4465-b2b5-c448c1df8f5a", "title": "Six more charged over church riot after bishop stabbing", "date": "2024-06-14 00:45", "url": "https://www.hawkesburygazette.com.au/story/8662401/six-more-charged-over-church-riot-after-bishop-stabbing/?cs=30776", "domain": "hawkesburygazette.com.au", "domain_classification": "Unknown", "message": "A 29-year-old man and a 20-year-old man were charged with similar offences and will both appear at the same court, the first on July 10 and the latter on July 17."}, {"id": "0a6d1463-68b4-49ed-abf0-3f05a27f04d0", "title": "Six more charged over church riot after bishop stabbing", "date": "2024-06-14 01:00", "url": "https://www.batemansbaypost.com.au/story/8662401/six-more-charged-over-church-riot-after-bishop-stabbing/?cs=14264", "domain": "batemansbaypost.com.au", "domain_classification": "Unknown", "message": "A 29-year-old man and a 20-year-old man were charged with similar offences and will both appear at the same court, the first on July 10 and the latter on July 17."}, {"id": "97fa97d5-991d-4116-8da5-be68eda55ac7", "title": "Six more charged over church riot after bishop stabbing", "date": "2024-06-14 00:00", "url": "https://www.bunburymail.com.au/story/8662401/six-more-charged-over-church-riot-after-bishop-stabbing/", "domain": "bunburymail.com.au", "domain_classification": "Unknown", "message": "A 29-year-old man and a 20-year-old man were charged with similar offences and will both appear at the same court, the first on July 10 and the latter on July 17."}, {"id": "682b290a-0e7c-45b4-9b10-517440200c54", "title": "Six more charged over church riot after bishop stabbing", "date": "2024-06-14 00:00", "url": "https://www.bunburymail.com.au/story/8662401/six-more-charged-over-church-riot-after-bishop-stabbing/?cs=30776", "domain": "bunburymail.com.au", "domain_classification": "Unknown", "message": "A 29-year-old man and a 20-year-old man were charged with similar offences and will both appear at the same court, the first on July 10 and the latter on July 17."}, {"id": "61e618d0-65e5-47c1-ac67-dd9d3cc5d523", "title": "Lebanon Hezbollah reveals more of its arms in risky escalation with Israel", "date": "2024-06-14 05:15", "url": "https://www.scmp.com/news/world/middle-east/article/3266577/lebanons-hezbollah-reveals-more-its-arms-risky-escalation-israel", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Hezbollah rockets have set off wildfires in northern Israel.\nHezbollah began trading fire with Israel on October 8, a day after its Palestinian ally Hamas attacked southern Israel, sparking the Gaza war.\nHezbollah says it will cease fire only when the Gaza war stops.\nPhoto: ReutersPrior to this conflict, Israel and Hezbollah had avoided a major clash since a month-long war in 2006, deterred since then by mutual threats of catastrophic destruction.\nThe aftermath of an Israeli air strike in the southern Lebanese town of Wadi Jilo."}, {"id": "bef07791-5ff1-4982-8d67-3edca64ac657", "title": "Officials ban some fireworks in unincorporated portions of Santa Fe County", "date": "2024-06-14 00:00", "url": "https://www.yahoo.com/news/officials-ban-fireworks-unincorporated-portions-220128554.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SANTA FE, N.M. (KRQE) – The Board of County Commissioners has banned the sale and use of certain types of fireworks within unincorporated portions of Santa Fe County for at least the next 30 days.\nThe resolution does not ban all types of fireworks.\nOn wildlands within Santa Fe County, all fireworks are banned, the resolution notes.\nThe county says the following types of fireworks are NOT banned by the resolution.\nFor the latest news, weather, sports, and streaming video, head to KRQE NEWS 13 - Breaking News, Albuquerque News, New Mexico News, Weather, and Videos."}, {"id": "3a089a10-4e7e-4dfa-9766-b6cfba87ad2f", "title": "Huthi missile attack severely injures sailor on cargo ship US military", "date": "2024-06-14 07:30", "url": "https://www.philstar.com/world/2024/06/14/2362846/huthi-missile-attack-severely-injures-sailor-cargo-ship-us-military", "domain": "philstar.com", "domain_classification": "Unknown", "message": "DUBAI, United Arab Emirates — Two cruise missiles launched by Yemen's Huthi rebels struck a bulk cargo carrier in the Gulf of Aden on Thursday, severely injuring a sailor who was evacuated by American forces, the US military said.\nThe M/V Verbena -- a Palauan-flagged, Ukrainian-owned, Polish-operated ship -- \"reported damage and subsequent fires on board.\nOne civilian mariner was severely injured during the attack,\" the US Central Command (CENTCOM) said in a statement.\n\"This continued reckless behavior by the Iranian-backed Huthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden.\"\nThe first reported fatalities from the attacks on ships occurred in the Gulf of Aden in March."}, {"id": "1d0099dd-71ad-45c0-b973-1d512d3a8398", "title": "Two Men Arrested in Connection with Fatal Stabbing in Costa Mesa", "date": "2024-06-14 06:15", "url": "https://mynewsla.com/crime/2024/06/13/two-men-arrested-in-connection-with-fatal-stabbing-in-costa-mesa/", "domain": "mynewsla.com", "domain_classification": "Unknown", "message": "Two men from Costa Mesa suspected in a fatal stabbing in the city that police said they believed was gang-related were behind bars Thursday.\nIsrael Antonio Valencia, 25, and Christopher Mathew Pena, 18, were arrested Wednesday, according to Roxi Fyad of the Costa Mesa Police Department.\nThey are accused in the killing of a 22-year-old man, Fyad said.\nOfficers responded to a knife attack in the 1700 block of Placentia Avenue, near 17th Street, at about 11 p.m. Tuesday.\nWhile investigating the fatal stabbing, police found a 19-year-old man who had been attacked earlier at Placentia Avenue and Shalimar Drive."}, {"id": "1421fe92-d605-4519-ab22-68af93183b3e", "title": "Houthi missile attack severely injures sailor on cargo ship : U . S . military", "date": "2024-06-14 06:00", "url": "https://www.thehindu.com/news/international/houthi-missile-attack-severely-injures-sailor-on-cargo-ship-us-military/article68288033.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "Two cruise missiles launched by Yemen's Houthi rebels struck a bulk cargo carrier in the Gulf of Aden on June 13, severely injuring a sailor who was evacuated by American forces, the U.S. military said.\nOne civilian mariner was severely injured during the attack,\" the U.S. Central Command (CENTCOM) said in a statement.\n\"This continued reckless behavior by the Iranian-backed Huthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden.\"\nJune 13 U.S. Central Command UpdateIn the past 24 hours, U.S. Central Command (USCENTCOM) forces successfully destroyed one air defense sensor in a Houthi controlled area of Yemen.\nThe first reported fatalities from the attacks on ships occurred in the Gulf of Aden in March."}, {"id": "1dac5343-a4fb-4b44-9385-8b097b5f9d9c", "title": "Huthi missile attack severely injures sailor on cargo ship : US military", "date": "2024-06-14 05:30", "url": "https://www.bssnews.net/news/195119", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "DUBAI, June 14, 2024 (AFP) - Two cruise missiles launched by Yemen's Huthi rebels struck a bulk cargo carrier in the Gulf of Aden on Thursday, severely injuring a sailor who was evacuated by American forces, the US military said.\nThe M/V Verbena -- a Palauan-flagged, Ukrainian-owned, Polish-operated ship -- \"reported damage and subsequent fires on board.\nOne civilian mariner was severely injured during the attack,\" the US Central Command (CENTCOM) said in a statement.\n\"This continued reckless behavior by the Iranian-backed Huthis threatens regional stability and endangers the lives of mariners across the Red Sea and Gulf of Aden.\"\nThe first reported fatalities from the attacks on ships occurred in the Gulf of Aden in March."}, {"id": "a276f626-b0f0-499e-b213-7ad6a10a9184", "title": "Yemen Houthis claim fresh missile attacks against 3 ships", "date": "2024-06-14 03:15", "url": "http://usa.chinadaily.com.cn/a/202406/14/WS666b9849a31095c51c508df8.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "SANAA - Yemen's Houthi group on Thursday claimed responsibility for missile attacks against three ships in the Arabian Sea and the Red Sea.\n\"The first attack targeted the vessel Verbena in the Arabian Sea, causing damage and a fire on board,\" Houthi military spokesman Yahya Sarea said in a televised statement, adding the other two attacks struck Seaguardian and Athina ships in the Red Sea.\n\"All attacks were carried out with several ballistic and naval missiles and drones and achieved their goals successfully,\" he noted.\nSince last November, the Houthi group, which controls much of northern Yemen, has initiated the launch of anti-ship ballistic missiles and drones targeting what it said were Israeli-linked ships transiting the Red Sea, to show solidarity with the Palestinians in the Gaza Strip.\nIn response, the U.S.-British naval coalition stationed in the area has since January conducted air raids and missile strikes against Houthi targets to deter the group, which, however, only led to an expansion of Houthi attacks to include U.S. and British commercial vessels and naval ships."}, {"id": "3bccd6ca-058a-4321-92ea-c3dd572b4029", "title": "Yemen Houthis claim fresh missile attacks against 3 ships", "date": "2024-06-14 02:00", "url": "http://europe.chinadaily.com.cn/a/202406/14/WS666b9849a31095c51c508df8.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "SANAA - Yemen's Houthi group on Thursday claimed responsibility for missile attacks against three ships in the Arabian Sea and the Red Sea.\n\"The first attack targeted the vessel Verbena in the Arabian Sea, causing damage and a fire on board,\" Houthi military spokesman Yahya Sarea said in a televised statement, adding the other two attacks struck Seaguardian and Athina ships in the Red Sea.\n\"All attacks were carried out with several ballistic and naval missiles and drones and achieved their goals successfully,\" he noted.\nSince last November, the Houthi group, which controls much of northern Yemen, has initiated the launch of anti-ship ballistic missiles and drones targeting what it said were Israeli-linked ships transiting the Red Sea, to show solidarity with the Palestinians in the Gaza Strip.\nIn response, the U.S.-British naval coalition stationed in the area has since January conducted air raids and missile strikes against Houthi targets to deter the group, which, however, only led to an expansion of Houthi attacks to include U.S. and British commercial vessels and naval ships."}, {"id": "b3a67a34-1000-4447-9343-6bb838cca0dd", "title": "Russian attack sub discovered just 200 miles from US East Coast is given safe harbor during Hurricane Sandy", "date": "2024-06-14 05:00", "url": "https://engineeringevil.com/2012/11/06/russian-attack-sub-discovered-just-200-miles-from-us-east-coast-is-given-safe-harbor-during-hurricane-sandy/", "domain": "engineeringevil.com", "domain_classification": "Unknown", "message": "Officials said the submarine was probably conducting anti-submarine warfare efforts against U.S. ballistic and cruise missile submarines at Kings Bay, Georgia.\nThe submarine did not sail near Kings Bay or threaten a U.S. aircraft carrier group conducting exercises near it in the eastern Atlantic.\nThere are two guided missile submarines and six nuclear missile submarines docked at Kings Bay Naval Submarine Base.\nThose American vessels are a known target of Russian attack subs.\nFlexing their muscle: Officials say Russian sub patrols have increased in recent yearsHowever, the Russian sub was considered safe enough that it was given a safe harbor in Jacksonville, Florida’s commercial port during Hurricane Sandy, within listening range of Kings Bay."}, {"id": "89bf37f0-bd1a-46aa-9fc0-7d23626a3633", "title": "Man accused of planning mass shooting to start  race war  arrested in New Mexico", "date": "2024-06-14 00:00", "url": "https://www.yahoo.com/news/man-accused-planning-mass-shooting-220550403.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "NEW MEXICO (KRQE) – An Arizona man who is accused of planning a mass shooting in an attempt to start a “race war” was arrested in New Mexico, according to federal authorities.\nCourt documents noted that Prieto reportedly planned to carry out the attack along with the two undercover government individuals.\nPrieto was arrested by law enforcement on May 14 while he was driving east from Arizona through New Mexico along Interstate 40, the U.S. Attorney’s Office in Arizona said.\nOfficials did not specify what law enforcement agency arrested Prieto, but said law enforcement found Prieto was in possession of seven guns, ammo, and was taken into federal custody.\nFor the latest news, weather, sports, and streaming video, head to KRQE NEWS 13 - Breaking News, Albuquerque News, New Mexico News, Weather, and Videos."}, {"id": "e4413fd2-2e57-4b96-a342-8f2661ff6397", "title": "Yemen Houthi rebels launch 2 cruise missles and hit ship in Gulf of Aden , sparking blaze , US says", "date": "2024-06-14 00:45", "url": "https://www.ivpressonline.com/news/world/yemens-houthi-rebels-launch-2-cruise-missles-and-hit-ship-in-gulf-of-aden-sparking/article_de3fa657-9317-59d3-b5e8-2de2ac045abd.html", "domain": "ivpressonline.com", "domain_classification": "Unknown", "message": "1371138342::cfb49c8e-2422-11e5-99a3-d7f5c6e8b241A weekly review of the best and most popular stories published in the Imperial Valley Press.\nAlso, featured upcoming events, new movies at local theaters, the week in photos and much more."}, {"id": "90f4db34-1492-4335-8d7f-c4b2e8d7f9d8", "title": "Man Indicted For Planning Shooting At Bad Bunny Concert", "date": "2024-06-14 05:30", "url": "https://uproxx.com/music/man-indicted-allegedly-planning-shooting-bad-bunny-concert/", "domain": "uproxx.com", "domain_classification": "Unknown", "message": "An Arizona man has been indicted in Atlanta after planning to carry out a mass shooting a Bad Bunny concert, according to a report from NBC.\nMark Adams Prieto was indicted earlier this week after his arrest last month for the alleged plot.\nPrieto was reportedly charged with Possession of an Unregistered Firearm, Firearms Trafficking, and Transfer of a Firearm for Use in a Hate Crime.\nPrieto evidently planned the attack for after Super Tuesday, after the presidential candidates were set, the source revealed.\nLaw enforcement has since executed a search warrant at Prieto’s home and recovered more firearms, including an unregistered short-barreled rifle."}, {"id": "5f39078a-3fd3-4962-9229-c29da5dd249c", "title": "Russian warships reach Cuba ahead of military exercises", "date": "2024-06-14 00:00", "url": "https://www.dailymail.co.uk/news/article-13528593/Russian-warships-reach-Cuba-ahead-military-exercises-just-two-weeks-Biden-approved-Ukraine-using-weapons-inside-Russia-ominous-echo-Cold-War.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Russian warships reached Cuba this week ahead of planned military exercises in echos of the cold-war missile crisis.\nThe fleet, made up of a frigate, a nuclear-powered submarine, an oil tanker and a rescue tug, crossed into Havana Bay after drills in the Atlantic Ocean.\nUS officials expect the ships to remain in the region through the summer and possibly also stop in Venezuela.\nRussia is a longtime ally of Venezuela and Cuba, and its warships and aircraft have periodically made forays into the Caribbean.\nAlthough the fleet includes a nuclear-powered submarine, a senior US administration official said that the intelligence community has determined no vessel is carrying nuclear weapons."}, {"id": "37565edb-5e67-4a40-94ce-b5113d9e8a15", "title": "A missile strike from Yemen Houthi rebels sets a cargo ship on fire in Gulf of Aden", "date": "2024-06-14 05:00", "url": "https://kdhnews.com/news/world/a-missile-strike-from-yemens-houthi-rebels-sets-a-cargo-ship-on-fire-in-gulf/article_0397a67f-e472-5b70-85b9-989a5e9bbdbe.html", "domain": "kdhnews.com", "domain_classification": "Unknown", "message": "It would free up time for the mayor, City Council, city manager and city staff.\nIt would give council members more time to study an issue before it is discussed.\nCouncil meetings are already too long.\nCutting the number of meetings means reducing residents’ input.\nThe proposal has some merit, but it could require marathon council sessions."}, {"id": "9c9a1cd2-ba57-4a1e-aab0-4cd12f3a0042", "title": "Russia , Ukraine exchange drone , missile attacks", "date": "2024-06-14 08:45", "url": "https://punchng.com/russia-ukraine-exchange-drone-missile-attacks/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "Kyiv and Moscow staged dozens of drone and missile attacks overnight, officials said Friday, leaving several wounded in Ukraine and damaging a fuel reservoir site in a Russian border region.\nRussia said it had downed 87 Ukrainian drones, of which 70 had targeted the southern Rostov region that houses the headquarters of its military operation against Kyiv.\nThe attacks sparked power cuts in several areas of the Rostov region, its governor Vasily Golubev said on social media.\nIn Voronezh, which borders Ukraine, a fuel reservoir was slightly damaged by falling debris, its regional governor Aleksander Gusev said.\nKyiv meanwhile said Ukrainian air defence systems had downed 24 out of 31 Russian drones and missiles fired overnight."}, {"id": "635d8765-3422-40ec-8dfa-09dc6640b5b7", "title": "Houthis strike bulk carrier in Gulf of Aden : US Centcom", "date": "2024-06-14 05:45", "url": "https://www.argusmedia.com/en/news-and-insights/latest-market-news/2578114-houthis-strike-bulk-carrier-in-gulf-of-aden-us-centcom", "domain": "argusmedia.com", "domain_classification": "Unknown", "message": "NewsPossible Canadian rail strike start delayed againWashington, 31 May (Argus) — The start of a threatened strike by some union workers at Canadian National (CN) and Canadian Pacific Kansas City (CPKC) has been pushed back again as concerns about fuel and food supplies rise.\nThe Canada Industrial Relations Board (CIRB), which is investigating federal government concerns, has postponed reply comments to 14 June from 31 May.\nIf CIRB ruled on 15 June, the Teamsters Canada Rail Conference (TCRC) would have to provide three days' notice to CN and CPKC before workers could strike.\nTCRC members had authorized a strike to start as early as 22 May.\nThe railroads and union met with CIRB on Monday and discussed the comments filed by groups that could be affected by a strike."}, {"id": "68261408-5522-409a-b094-f6ff6b95820e", "title": "Accused church terror stabber facing fresh charges", "date": "2024-06-14 03:45", "url": "https://www.canberratimes.com.au/story/8662628/accused-church-terror-stabber-facing-fresh-charges/?cs=9676", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Your digital subscription includes access to content from all our websites in your region.\nAccess unlimited news content and The Canberra Times app.\nPremium subscribers also enjoy interactive puzzles and access to the digital version of our print edition - Today's Paper."}, {"id": "d7287ce1-3330-4c60-ba7e-8b1bc1178834", "title": "Protection in Danger Monthly News Brief - May 2024 - Democratic Republic of the Congo", "date": "2024-06-14 09:30", "url": "https://reliefweb.int/report/democratic-republic-congo/protection-danger-monthly-news-brief-may-2024", "domain": "reliefweb.int", "domain_classification": "Unknown", "message": "Sources: Al Jazeera and UNICEF03 May 2024: In Mugunga IDP Camp, Goma city, North Kivu province, at least 15 civilians were killed and 37 others injured rockets fired by M23.\nSource: ActualiteEthiopia18 May 2024: In Alemwach Refugee Camp, Dabat woreda, Amhara region, an Eritrean refugee was kidnapped by unidentified perpetrators.\nSource: Personal Communication24 May 2024: In Kumer Refugee Camp, North Gondar zone, Amhara region, an ambulance transporting seven patients was attacked by gunmen.\nSource: Radio Tamazuj12 May 2024: In Abu Shouk Refugee Camp, Al Fasher city, North Darfur state, nine people were killed and 35 wounded amid bombardments.\nSource: Sudan TribuneAs reported on 23 May 2024: In Naivasha Refugee Camp, Omdurman city, Khartoum state, heavy weaponry was reported inside the camp."}, {"id": "88adf90c-91cb-430d-9c51-920883d7284a", "title": "Police chief finds tools to combat PTSD in veterans , officers during trip to Israel", "date": "2024-06-14 00:00", "url": "https://wlos.com/news/local/waynesville-police-chief-israel-trip-combatting-ptsd-veterans-officers-tools", "domain": "wlos.com", "domain_classification": "Unknown", "message": "It’s not connected to the ongoing war with Hamas, but rather to gain knowledge to benefit both military veterans and even police officers here.\nHe recently wrapped up a 10-day trip as a coach for Heroes to Heroes, which helps combat veterans heal from the traumas of war and often the moral injuries they carry with them.\nAdams says that spirituality can help veterans combat suicidal thoughts and reintegrate into communities with support and planning“A lot of them struggle ...I think they're averaging now still around 22 a day take their lives.\nThe mission of Heroes to Heroes has extended from veterans to law enforcement officers who put their lives on the line too.\nAdams is carrying back from Israel tools his officers can use including listening to unique stories, mental health awareness and physical fitness."}, {"id": "ed56d1e6-0609-4208-932d-16d712dbb02a", "title": "Major events in the Russian invasion of Ukraine", "date": "2024-06-14 05:30", "url": "https://uk.news.yahoo.com/major-events-russian-invasion-ukraine-050627865.html", "domain": "uk.news.yahoo.com", "domain_classification": "Unknown", "message": "(Reuters) - Russia's all-out invasion of Ukraine in February, 2022, has led to Europe's bloodiest conflict since World War Two.\nMay 20, 2022: Russian forces capture Mariupol in southeastern Ukraine after a three-month siege, during which Kyiv estimates more than 20,000 civilians were killed.\nMay 20, 2023: Russian forces finally capture Bakhmut after nine months of fighting, in Europe's bloodiest land battle since World War Two.\nSpring 2024: Following the failure of Ukraine's 2023 counteroffensive, Russian forces seize the battlefield momentum, taking advantage of superior manpower and firepower.\nIn May, Russian forces open a new front with an assault on Ukraine's northeastern Kharkiv province, which Kyiv's commanders say risks diverting resources from defending against the main Russian effort in the east."}, {"id": "f2112120-9ec0-4701-b16b-de69b84ee191", "title": "Major events in the Russian invasion of Ukraine", "date": "2024-06-14 05:45", "url": "https://www.moneycontrol.com/news/world/major-events-in-the-russian-invasion-of-ukraine-12748501.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "422e6700-aa02-4329-970d-483db473bc51", "title": "The Third World War 1989 mod for Civilization III : Conquests", "date": "2024-06-14 04:45", "url": "https://www.moddb.com/mods/the-third-world-war-1989", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Nearly ten years after its original release, The Third World War 1989 scenario for Civilization III has been re-uploaded and is at your fingertips.\nThe game is now capable of running with the CXE patch, which allows new modding options never before available to Civ 3.\nPrimarily, this means that the number of starting units has been severely cut down, with emphasis on reducing battalion-sized forces and reserves.\nOverhauled combat - While the map may look the same, every aspect of land, sea, and air warfare has been updated.\nThe game is still capable of being run normally without CXE, but a large number of changes are now available."}, {"id": "cfd192c2-6179-487d-bb43-eb28affb7d67", "title": "Marine training shifts may ad tech , change officer assignments", "date": "2024-06-14 00:00", "url": "https://www.marinecorpstimes.com/news/your-marine-corps/2024/06/13/marine-training-shifts-may-ad-tech-change-officer-assignments/", "domain": "marinecorpstimes.com", "domain_classification": "Unknown", "message": "“These initiatives collectively aim to equip the Marine Corps with the most modern, lethal, and capable Marines conceivable,” Iiams said.\nThe communication training battalion at Training Command is assessing how to combine critical skillsets from three communications job fields, 062X, 063X and 067X.\nAlso in the tech vein, the service will have deployed live, virtual, constructed training simulators to Marine Corps Air Ground Combat Center, Twentynine Palms, California, Camp Pendleton, California and Marine Corps Bases Hawaii and Okinawa, Japan, before October.\nAt the same time, each Marine expeditionary force and the Marine air-ground task force training command will receive one battalion-capable Marine Corps Tactical Instrumentation System by summer.\nThe training command is preparing to field electromagnetic spectrum simulators at Twentynine Palms, California, that can replicate adversary electronic warfare capabilities in training."}, {"id": "24a448ed-409c-4bee-9b1a-a47d6e964144", "title": "Europe Bloodiest Conflict : Ukraine Struggle Against Russia", "date": "2024-06-14 06:00", "url": "https://www.devdiscourse.com/article/law-order/2982442-europes-bloodiest-conflict-ukraines-struggle-against-russia", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Russia's all-out invasion of Ukraine in February, 2022, has led to Europe's bloodiest conflict since World War Two.\nFeb-April, 2022: Advancing Russian forces are halted at the outskirts of Kyiv after meeting stiffer-than-expected resistance.\nMay 20, 2023: Russian forces finally capture Bakhmut after nine months of fighting, in Europe's bloodiest land battle since World War Two.\nSpring 2024: Following the failure of Ukraine's 2023 counteroffensive, Russian forces seize the battlefield momentum, taking advantage of superior manpower and firepower.\nIn May, Russian forces open a new front with an assault on Ukraine's northeastern Kharkiv province, which Kyiv's commanders say risks diverting resources from defending against the main Russian effort in the east."}, {"id": "61af0587-5517-43e4-9267-f85bafcc05d5", "title": "We must support IDF soldiers , bot mentally and physically", "date": "2024-06-14 07:00", "url": "https://www.jpost.com/opinion/article-806160", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The tragic story of Eliran Mizrahi has haunted the country for the last week.\nHowever, inexplicably, he received a Tzav 8 (emergency call-up order) from the IDF last week to return to Gaza two days later.\nInstead, at the beginning of the week, Mizrahi took his own life.\nThe decision was made after consultations with Defense Minister Yoav Gallant and IDF Chief of Staff Lt.-Col. Herzi Halevi.\nMay the lesson from his tragic story resonate with the IDF and those who send our sons and daughters to war."}, {"id": "812c328d-7dcd-41bd-bf3c-7c1ce99479ce", "title": "The American public must rethink its relationship with the military", "date": "2024-06-14 00:00", "url": "https://www.michigandaily.com/opinion/columns/the-american-public-must-rethink-its-relationship-with-the-military/", "domain": "michigandaily.com", "domain_classification": "Unknown", "message": "The military budget is one aspect that needs this closer look.\nRegardless of who the American public feels may be the aggressor, prioritizing a diplomatic when possible approach avoids breeding contempt in foreign areas.\nMoreover, lowering our military budget doesn’t necessarily mean creating a power vacuum that a new country would fill.\nReworking our relationship with military contractors will allow us to reduce our spending without affecting our military capabilities.\nMoreover, reducing our defense spending and avoiding unwinnable wars not only preserves American lives, but also spares countless lives abroad."}, {"id": "54d0d88b-3b1c-4a1a-80f0-f7afef74971c", "title": "G7 leaders tackle the issue of migration on the second day of summit in Italy", "date": "2024-06-14 09:30", "url": "https://www.irishexaminer.com/world/arid-41416108.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "Leaders of the G7 are turning their attention to migration on the second day of their summit on Friday, seeking ways to combat trafficking and increase investment in countries from where migrants start out on often life-threatening journeys.\nShe has also spearheaded the “Mattei Plan” for Africa, a continentwide strategy to increase economic opportunities at home and so discourage migration to Europe.\nUS President Joe Biden introduced new policies to curb migration after a bill he tried to get through Congress failed to pass.\nTackling migration “is a common challenge,” European Council president Charles Michel said after arriving at the summit.\nPope Francis will also become the first pontiff to address a G7 summit when he delivers a speech on artificial intelligence on Friday."}, {"id": "2f0a1b46-a288-48dc-b533-689a31cdc27a", "title": "Russian warships off the Florida coast | LETTER | Letters", "date": "2024-06-14 05:00", "url": "https://www.reviewjournal.com/opinion/letters/letter-russian-warships-off-the-florida-coast-3068878/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "It’s strange that the mainstream media are treating Russian combat ships miles off the Florida coast as nothing to see here.\nIt’s strange that the mainstream media are treating Russian combat ships miles off the Florida coast as nothing to see here.\nWe should be worried that ships potentially carrying hypersonic missiles and subs possibly carrying atomic warheads are so close.\nThis is the second time we’ve come close to nuclear war, both times during Democratic presidencies.\nI hope cooler heads prevail, but for the media to downplay this because it’s the candidate of their choice who is putting us in harm’s way is a disgrace."}, {"id": "0bf7d2ea-71e0-40a9-8e31-9c2f2afabc56", "title": "NATO to build three large bases to supply weapons to Ukraine , Orban says", "date": "2024-06-14 09:00", "url": "https://tass.com/world/1803245", "domain": "tass.com", "domain_classification": "Unknown", "message": "The North Atlantic Alliance is planning to establish three large military bases in ally countries in order to coordinate weapons supplies to Ukraine, Hungarian Prime Minister Viktor Orban said.\nAccording to the Hungarian premier, the bloc seeks \"to help Ukraine by establishing the so-called NATO’s Ukraine mission.\"\n\"This means that NATO will coordinate weapons supplies to Ukraine,\" Orban told a morning talk show on Radio Kossuth.\nOrban expressed concern that should these bases be built in Poland, Romania, Slovakia and other Ukrainian neighbors they will \"become military targets.\"\n\"Obviously, colossal pressure is being put on us from the [other] 31 NATO member countries to sway us from the position of peace to the side of war,\" Orban continued."}, {"id": "2aaedc12-a455-44e3-b3b1-f74cd591ed1d", "title": "How to get Civil War on 4K Blu - ray and DVD", "date": "2024-06-14 00:45", "url": "https://www.digitalspy.com/movies/a61101394/civil-war-4k-blu-ray-dvd/", "domain": "digitalspy.com", "domain_classification": "Unknown", "message": "The critically acclaimed film Civil War is coming soon to home video.\nWhile Civil War has already had its digital release on streaming services, the film will be getting its physical release next month.\nYou can opt for the standard Blu-ray release of Civil War, available for pre-order now for for £14.99 or £16.99 on .\nThe film concludes with a haunting and violent climax — one that's unlikely to leave your thoughts for some time after seeing Civil War.\nCivil War is now streaming on all major digital retailers in the UK."}, {"id": "57a6773b-4cd0-4912-bea8-5f59e84cb733", "title": "The story of the flags raised on Iwo Jima | News , Sports , Jobs", "date": "2024-06-14 08:45", "url": "https://www.ironmountaindailynews.com/opinion/2024/06/the-story-of-the-flags-raised-on-iwo-jima/", "domain": "ironmountaindailynews.com", "domain_classification": "Unknown", "message": "The time and place: Let’s turn back the hands of time to Feb. 23, 1945, (World War II) to Iwo Jima and Mount Suribachi.\nThe considerably larger flag could be seen from the countryside by the Marines and naval ships surrounding Iwo Jima.\nThe fighting with the Japanese soldiers spanned another 31 brutal, cruel days.\nThey were marked with hand-to-hand combat, suicide charges by the Japanese soldiers and fighting in the caves where they were entrenched.\nIt was the raising of the flag (the colors) on Mount Suribachi that gave them hope."}, {"id": "267971ce-7c9f-4f11-bc45-5ffbadc5deee", "title": "Dr . Francis Boyle : COVID Injections Meet The Criteria For Biological Weapons Of Mass Destruction", "date": "2024-06-14 00:30", "url": "https://www.shtfplan.com/headline-news/dr-francis-boyle-covid-injections-meet-the-criteria-for-biological-weapons-of-mass-destruction", "domain": "shtfplan.com", "domain_classification": "Unknown", "message": "“It is my expert opinion that [the COVID injections] meet the criteria of biological weapons and weapons of mass destruction according to Biological Weapons [Convention],” his affidavit states.\nDr. Boyle is considered one of the world’s leading legal experts on biological weapons and he drafted the US Biological Weapons and Antiterrorism Act (“the Act”), which was passed into law in 1989 to implement the Biological Weapons Convention to criminalize the development, production, and possession of biological weapons.\nIn his affidavit for Dr. Sansone’s case, Dr. Boyle stated that COVID injections violate the Act.\nHe asserted that “covid-19 injections,” “covid-19 nanoparticle injections,” and “mRNA nanoparticle injections” are biological weapons and weapons of mass destruction which violate Biological Weapons 18 USC § 175; Weapons and Firearms § 790.166 Fla. Stat.\nIt is my expert opinion that ‘COVID-19 nanoparticle injections’ or ‘mRNA nanoparticle injections’ or ‘COVID-19 injections’ meet the criteria of biological weapons and weapons of mass destruction according to Biological Weapons 18 USC § 175; Weapons and Firearms § 790.166 Fla. Stat."}, {"id": "d285e5b3-8b99-49d8-9e41-3bcf510b19d8", "title": "RIGHT SPEAK : Fighting Most Tense in Kurakhove , Pokrovsk , Kramatorsk Axes ; UKR Stabilizes Kharkiv Front ; UKR Repels RU Arm - Attacks Near Chasiv Yar ; UKR Recapture Key Positions in Vovchansk ; UKR Decimates RU Radars , Air Defenses in Belgorod O...", "date": "2024-06-14 04:45", "url": "http://www.rightspeak.net/2024/06/fighting-most-tense-in-kurakhove.html", "domain": "rightspeak.net", "domain_classification": "Unknown", "message": "Blog Archive: Jun 2024 (70) May 2024 (153) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)"}, {"id": "e23b606f-573d-4c3d-b8e5-5447391dac55", "title": "Distinguished Historian Randall Woods to Speak on John Quincy Adams", "date": "2024-06-14 06:45", "url": "https://news.uark.edu/articles/70576/distinguished-historian-randall-woods-to-speak-on-john-quincy-adams", "domain": "news.uark.edu", "domain_classification": "Unknown", "message": "Distinguished Historian Randall Woods to Speak on John Quincy AdamsPhoto SubmittedOn Friday, June 28, the Fayetteville Public Library will host a talk with Randall Woods, the John A. Cooper Distinguished Professor of History at the U of A, to mark the release of his newest book, John Quincy Adams: A Man for the Whole People.\nJames M. McPherson, Pulitzer Prize winning author of Battle Cry of Freedom: The Civil War Era, notes that John Quincy Adams \"served his country for more than a half century as diplomat, senator, secretary of state, president, public intellectual and in a unique post-presidential career as gadfly of the slave power in Congress.\"\nHe says that \"Randall Woods skillfully interweaves the narrative of these events with intimate accounts of Adams' personal and family life in a warmly human manner.\"\nWoods will take questions and be available to sign books following the discussion.\nWoods has taught at the U of A since 1971, and his book on Adams follows on the heels of his award-winning biographies LBJ: Architect of American Ambition and Fulbright: A Biography."}, {"id": "f022cdc8-4e41-46f9-85e9-6c585654e35c", "title": "Zimbabwe Has 8 , 000 Doses of Cabotegravir Anti - HIV Drug", "date": "2024-06-14 06:45", "url": "https://allafrica.com/stories/202406140105.html", "domain": "allafrica.com", "domain_classification": "Local - Africa", "message": "Zimbabwe has 8,000 doses of injectable pre-exposure prophylaxis drug, cabotegravir, for use in the ongoing pilot programme to establish its efficacy in preventing HIV as the country pulls all the stops to completely eradicate all new infections of the virus by 2030.\n\"We are doing a pilot programme to test the drug's efficacy especially looking at things like the side effects that it causes.\nWe have about 8000 doses of CAB-LA that we are using and this pilot programme that involves about 1000 people.\"\nDr Mugurungi noted that the new pre-exposure prophylaxis drug, if successful and approved, will be handy in the battle against taming new HIV infections.\nClose Sign up for free AllAfrica Newsletters Get the latest in African news delivered straight to your inbox Top Headlines AIDS Zimbabwe By submitting above, you agree to our privacy policy."}, {"id": "d608e988-0344-461a-9930-7482025e81e7", "title": "Australia arms export comes under scrutiny . Is Canberra  complicit  in Israel - Gaza war ? ", "date": "2024-06-14 01:30", "url": "https://www.scmp.com/week-asia/politics/article/3266529/australias-arms-export-comes-under-scrutiny-canberra-complicit-israel-gaza-war", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "There are also existing permits that allowed Australian manufacturers to supply weapons parts for the manufacture of F-35 jets.\nAustralia’s export of weapons to Israel amid the Israel-Gaza war has sparked controversy, with recent senate hearings confirming Canberra has issued new permits for military equipment exports to Israel since the start of the crisis.\nFor months, researchers, humanitarian groups, war protesters and Australia’s third-largest political party, the Australian Greens, have sought clarity over Australia’s exports of weapons and parts to Israel.\nIn older permits, Australia also sent “dual use technology” parts to Israel, but they were not military equipment, Marles added.\nThe Arms Trade Treaty, which regulates the international trade of arms, also makes clear that parts and components of weapons are also considered weapons."}, {"id": "32122255-26a6-4008-a340-8a4b56765e82", "title": "Video - Jake Paul Faces Off With Sean OMalley After Accepting Offer To  Save  UFC 303", "date": "2024-06-14 03:15", "url": "https://www.lowkickmma.com/jake-paul-sean-omalley-face-off-rubi-rose/", "domain": "lowkickmma.com", "domain_classification": "Unknown", "message": "Jake Paul and Sean O’Malley are ready to step and save UFC 303.\nEmanating from T-Mobile Arena on June 29, the International Fight Week finale was expected to be headlined by the long-awaited return of former two-division titleholder Conor McGregor.\nAfter exchanging words on social media, ‘The Problem Child’ and reigning bantamweight world champion ‘Sugar’ Sean O’Malley went face-to-face, giving fans a little taste of the UFC vs. PFL clash they hope to bring to ‘Sin City’ later this month.\nAdding insult to injury, the UFC 303 co-main event is now in need of replacing.\nCarlos Ulberg agreed to step in and take Rountree’s spot, but it now sounds like the fight needs yet another replacement."}, {"id": "46d84675-44a5-4a92-9e16-3a0599649b20", "title": "Gaza war : with both Sides playing Politics , dont expect a Ceasefire any time Soon", "date": "2024-06-14 06:30", "url": "https://www.juancole.com/2024/06/playing-politics-ceasefire.html", "domain": "juancole.com", "domain_classification": "Unknown", "message": "China supported the resolution, but doubted whether there had been notable developments since the previous ceasefire motion.\nProminent among these are how the war goes from here, the Israeli political environment and the extent of pressure on Israel from the Washington for a ceasefire.\nThere were more violations against children in Gaza, the West Bank and Israel than anywhere else in the world last year, the report says.\nThere has been a similar response to a further UN report accusing Israel as well as Hamas of war crimes.\nOn the Palestinian side, there are certainly some differences between the Hamas military leadership in Gaza and the overall political leadership in Qatar."}, {"id": "7d6bc066-d694-4d08-8e10-789278cb1391", "title": "Father of American hostage held by Hamas talks about efforts to free his son", "date": "2024-06-14 05:00", "url": "https://www.news4jax.com/news/local/2024/06/14/father-of-american-hostage-held-by-hamas-talks-about-efforts-to-free-his-son/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "The father of an American man talked to News4JAX about his son’s experience as a hostage taken by Hamas terrorists during the October attack.\nIt’s been eight months since 35-year-old Sagui Dekel Chen, a father of three, was kidnapped.\nHis father, Jonathan Dekel-Chen said 40 of the 79 people kidnapped from his Kibbutz were released in the first hostage deal in late November.\n“They saw my son and many other people from our Kibbutz who were taken hostage.\nLast week, four hostages were rescued during an Israeli military operation that, according to Hamas, killed more than 200 Palestinians."}, {"id": "7f8c0045-4651-40e8-9971-190164a53083", "title": "Battles rage in Rafah as Biden blames Hamas for truce delay", "date": "2024-06-14 03:30", "url": "https://dunyanews.tv/en/World/818435-Battles-rage-in-Rafah-as-Biden-blames-Hamas-for-truce-delay", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Battles rage in Rafah as Biden blames Hamas for truce delayWorld World Battles rage in Rafah as Biden blames Hamas for truce delayUS President Joe Biden called Hamas the \"biggest hang-up\" to another truce.\nIn Italy at a G7 summit, Biden called Hamas \"the biggest hang-up so far\" to a deal on a Gaza truce and hostage release.\nThe plan for the first Gaza truce since a week-long pause in November includes a six-week ceasefire, a hostage-prisoner exchange and Gaza reconstruction.\nFallout from the Gaza war is regularly felt on the Israeli-Lebanon frontier, where deadly cross-border exchanges have escalated.\nThe Israeli military said most launches had been intercepted while others ignited fires."}, {"id": "97f1f8ad-e072-4d10-b49c-04383f6ba483", "title": "Lee  Once Were Warrior Tamahori wraps trilogy with The Convert", "date": "2024-06-14 00:45", "url": "https://www.brisbanetimes.com.au/culture/movies/lee-once-were-warriors-tamahori-wraps-trilogy-with-the-convert-20240607-p5jk6d.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Got it Normal text size Larger text size Very large text size Thirty years after breaking through with his debut feature Once Were Warriors, Lee Tamahori has made The Convert, a film that completes a trilogy he always intended to make – without knowing exactly what it would be about.\nWarriors catapulted him into Hollywood, a step that, then aged in his mid-40s, he was more than ready to take.\nAs it happens, he has effectively made a trilogy in reverse, with three films about the state of Maori culture at different points in New Zealand’s history since European settlement.\nThere’s quite a complex history.” Tioreore Ngatai-Melbourne as Rangimai in Lee Tamahori’s movie The Convert.\nLee Tamahori on the set of The Convert with leading man Guy Pearce."}, {"id": "87aba94a-7554-4a8f-9124-5b5a7478781e", "title": "Meet the American who stitched the Stars & Stripes , Betsy Ross", "date": "2024-06-14 08:45", "url": "https://www.foxnews.com/lifestyle/meet-american-who-stitched-stars-stripes-betsy-ross-reputed-wartime-seductress", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Flagmaker Betsy Ross is embraced as one of the most popular figures of the American Revolution.\nThe real story of Betsy Ross is even greater than the highly plausible account of America’s first flagmaker.\nNeither Betsy Ross story — America’s first flagmaker or Washington’s secret-ally seductress — is proven in the eyes of historians.\nHer version, the 13 stars in a circle, is still known as the Betsy Ross Flag.\nHe credits historian Joseph Tustin for naming Betsy Ross the possible seductress."}, {"id": "fb8cc8df-cc9c-4f03-89a5-b410c4c2eaf6", "title": "The best announcements from Summer Game Fest 2024", "date": "2024-06-14 08:45", "url": "https://www.stuff.tv/features/the-best-announcements-from-summer-game-fest-2024/", "domain": "stuff.tv", "domain_classification": "Unknown", "message": "PlayStation had its own State of Play the week before while Nintendo has still yet to confirm its own summer Direct.\nTo save you a good many hours, we’ve put together the most exciting trailers and announcements that came from the past week of Summer Game Fest 2024, from the big blockbusters to the indie darlings.\nRelease: 2025CairnPlayIf last year’s indie game Jusant conveyed the calm of climbing, then Cairn seems to want to really focus on the other end of the extreme.\nRelease: TBAEverything elseWith just so many streams happening during Summer Game Fest, it’s simply too much to go for more honourable mentions.\nBut if you want to watch them in full for yourself then simply follow the links below:– Summer Game Fest Live, Day of the Devs and Devolver Direct– Wholesome Direct Indie Showcase– Xbox Games Showcase, Call of Duty: Black Ops 6 Direct– Future Games Show: Summer Games Showcase– The PC Gaming Show– Ubisoft ForwardAlan Wen About Stuff contributor Areas of expertise gaming"}, {"id": "d807f52a-758d-47e1-9e6f-8f73ac8e8bcb", "title": "New Video Reveals Glimpse Of The Manta Ray Underwater Drone Propulsion System", "date": "2024-06-14 00:30", "url": "https://theaviationist.com/2024/06/13/manta-ray-rear-section/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "An initial scene shows the Manta Ray in a controlled environment, possibly a lab or testing facility.\nThe Manta Ray prototype underwent extensive full-scale testing off the coast of Southern California in February and March 2024.\nThe Manta Ray ProgramThe Manta Ray‘s development is part of a DARPA initiative to advance critical technologies for future unmanned underwater vehicle (UUV) designs.\nThe data collected by Manta Ray will enhance decision-making for joint forces, providing a strategic advantage in missions.\nEach contractor is responsible for creating unique vehicles to showcase specific capabilities within the Manta Ray program."}, {"id": "550b2f84-5d43-4f3b-b826-296d31fef831", "title": "Germany Uniper wins $14 billion arbitration ruling against Gazprom – Euractiv", "date": "2024-06-14 09:15", "url": "https://www.euractiv.com/section/energy-environment/news/germanys-uniper-wins-14-billion-arbitration-ruling-against-gazprom/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "German utility Uniper has won a multi-billion euro arbitration against former long-time supplier Gazprom, it said on Wednesday (12 June), allowing it to tear up dormant gas supply contracts and potentially setting a precedent for similar cases.\nSources told Reuters last month that the arbitration tribunal could allow Uniper to terminate the 250 terawatt hours in dormant Russian gas contracts, some of which run until the middle of the next decade.\nWith the right of termination that we received in the arbitration ruling, we are ending the contracts with Gazprom Export,” Uniper CEO Michael Lewis said in a statement.\nThe German government is also taking part in the discussions between the European Commission and those countries that are still dependent on Russian gas, Economy Minister Robert Habeck said on Tuesday.\n“I am personally very involved in it,” Habeck said, adding that the talks aim to ensure secure gas supply for southeastern Europe without filling Russia’s coffers."}, {"id": "e0ea4442-e10b-414f-91ce-5325f0b83650", "title": "Mark Alexander : Profile of Valor : Forgotten Hero ? ", "date": "2024-06-14 09:30", "url": "https://patriotpost.us/alexander/107653-profile-of-valor-forgotten-hero-2024-06-14", "domain": "patriotpost.us", "domain_classification": "Unknown", "message": "Woody Woodson was a Philadelphia native.\nThe hunt’s still ongoing.”There are 94 black recipients, proportionally far less than the percentage of black Americans serving, but until the 1960s, black soldiers were mostly excluded from combat roles.\nThe first Medal of Honor to a black recipient was awarded for his valorous actions during the War Between the States.\nCPL Waverly “Woody” Woodson Jr.: Your example of valor — a humble American Patriot defending Liberty for all above and beyond the call of duty, and in disregard for the peril to your own life — is eternal.\nSemper Vigilans Fortis Paratus et FidelisPro Deo et Libertate — 1776Follow Mark Alexander on X/Twitter."}, {"id": "e8ba74a0-0293-4f6c-95a3-e572e0c59b79", "title": "Slipknot Clown , New Guy and Eloy Casagrande Describe Love of Masks and Demons in Promotional Collaboration with Atlu Shin Megami Tensei V : Vengeance™", "date": "2024-06-14 03:30", "url": "https://www.animenewsnetwork.com/press-release/2024-06-13/slipknot-clown-new-guy-and-eloy-casagrande-describe-love-of-masks-and-demons-in-promotional-/.211923", "domain": "animenewsnetwork.com", "domain_classification": "Unknown", "message": "SlipknotSlipknotSlipknotSlipknotSlipknotPlayStationNintendoAtlusATLUSATLUSATLUSATLUSATLUSAtlusSEGASEGASEGASEGASEGAATLUSSEGASegatoday announced the second and final promotional video for the upcoming RPG Shin Megami Tensei V: Vengeance, which features the iconic heavy metal band.\nThey further share their unique perspective on masks, the iconography of the demons of Shin Megami Tensei V: Vengeance, and how the band's own masks affect their creative process.The Shin Megami Tensei V: Vengeance masks featured in the video will be available for three lucky fans in the Shin Megami Tensei V: Vengeance xDemon Mask Sweepstakes (one mask per winner).\nSign up to the Godhood Guild HERE.Originally released in 2021 for theSwitch, Shin Megami Tensei V opens with the protagonist awakening buried and unconscious after stumbling across a grisly murder scene.\nThe Shin Megami Tensei™ series has a rich history in the gaming space and celebrated its 30th anniversary in 2023.The latest title in the series, Shin Megami Tensei V: Vengeance allows players to enjoy the story of Shin Megami Tensei V in its entirety, with a new story path that was not told in the original release.\nIts globally beloved franchises include Sonic the Hedgehog™, Like a Dragon™,™, Super Monkey Ball™, and Phantasy Star Online™, along with' Persona and Shin Megami Tensei series."}, {"id": "53ab4bc1-8ffb-49d8-8e3d-b18122ca3177", "title": "Anti - money laundering report rates Nigeria high", "date": "2024-06-14 06:30", "url": "https://punchng.com/anti-money-laundering-report-rates-nigeria-high/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "An inter-governmental action group against money laundering in West Africa, says Nigeria recorded significant achievements in its war against money laundering and terrorism financing in 2023.\nGIABA said this in its 2023 annual report unveiled for ambassadors of member states, technical and financial partners on Thursday in Dakar, Senegal.\nAccording to the report, Nigeria made progress in addressing the technical compliance identified in GIABA’s Mutual Evaluation Report in relation to various recommendations made to the country.\n“Nigeria demonstrated that it has mechanisms for international cooperation and procedures to respond to international requests for information on NPOs suspected of terrorist financing or involved in other forms of support for terrorists.\n“Nigeria demonstrated that it has a system for maintaining statistics on its Anti-money Laundering and Combating the Financing of Terrorism system,” the report said."}, {"id": "77edfcd3-0859-4d0e-8098-c8cab35a5167", "title": "G7 leaders tackle the issue of migration on the second day of summit in Italy", "date": "2024-06-14 06:15", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/06/14/g7-leaders-tackle-the-issue-of-migration-on-the-second-day-of-summit-in-italy/", "domain": "jerseyeveningpost.com", "domain_classification": "Unknown", "message": "Leaders of the G7 are turning their attention to migration on the second day of their summit on Friday, seeking ways to combat trafficking and increase investment in countries from where migrants start out on often life-threatening journeys.\nMigration is of particular interest to summit host Italy, which lies on one of the major routes into the European Union for people fleeing war and poverty in Africa, the Middle East and Asia.\nUS President Joe Biden introduced new policies to curb migration after a bill he tried to get through Congress failed to pass.\nTackling migration “is a common challenge,” European Council president Charles Michel said after arriving at the summit.\nPope Francis will also become the first pontiff to address a G7 summit when he delivers a speech on artificial intelligence on Friday."}, {"id": "44af73bd-4883-4379-9f96-8830dd9ee267", "title": "Last of the Summer Wine - GOLD", "date": "2024-06-14 05:45", "url": "https://www.tvguide.co.uk/schedule/cd6c5659-bb66-5b3c-8cc1-2ec0f1a37b25/last-of-the-summer-wine", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Last of the Summer WineGOLD 11:20 AM to 12:00 PM Friday 14 June Share Add toCalendar +The General's Greatest Battle Season 25 Episode 2 of 11 S SubtitlesChaos abounds at an annual parade held to celebrate a famous battle.\nThe lifelike effigy of the old General has been spruced up and Nora Batty prepares to sit on a float playing the part of his wife.\nNorman Wisdom makes a cameo appearanceLast of the Summer Wine airs on GOLD at 11:20 AM, Friday 14 June .\n(Subtitles.)\nLearn more about Last of the Summer Wine and other movie/drama on our drama pageTopics Movie ➝ Drama Sitcom"}, {"id": "fd25bf5b-3ee9-45fd-b4d8-3c8dcf48a60c", "title": "Highly decorated Army colonel comes out as gay in obituary", "date": "2024-06-14 00:45", "url": "https://www.yahoo.com/news/highly-decorated-army-colonel-comes-232513209.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Highly decorated Army colonel comes out as gay in obituaryJune 13 (UPI) -- After living a life of secrecy, a decorated Vietnam veteran came out as gay in his obituary.\n\"I was gay all my life: through grade school, through high school, through college, through life.\"\nDespite keeping his sexuality hidden from most of the world, Ryan said in the obituary that he had a 25-year relationship with the \"love of my life\" Paul Cavagnaro.\nDays after his obituary was published, about 150 people wrote messages of support for the late Ryan.\nA life of service that continues with his final wishes to share his truth so others may learn of love.\""}, {"id": "6a025da5-8940-4751-b641-c876740a9ad0", "title": "G - 7 Pledge to Step Up Action on Russia Oil Fleet , Energy , Metals", "date": "2024-06-14 09:00", "url": "https://www.bnnbloomberg.ca/g-7-pledge-to-step-up-action-on-russia-oil-fleet-energy-metals-1.2085211", "domain": "bnnbloomberg.ca", "domain_classification": "Unknown", "message": "(Bloomberg) -- Group of Seven leaders meeting in Italy this week will pledge to tighten enforcement of their price cap on Russian oil, choke the Kremlin’s future energy projects and reduce Moscow’s revenues from metals, according to a statement seen by Bloomberg.\n“We will continue to apply significant pressure on Russian revenues from energy and other commodities,” the statement, which is expected to be published on Friday, says.\nThe G-7 price cap on Russian crude oil and petroleum products bans western shipowners, insurers and intermediaries from providing vessels and services for cargoes priced above the thresholds.\nG-7 leaders will also pledge to do more to impede the “development of future energy projects and disrupting access to the goods and services on which those projects rely,” and will continue to reduce Russia’s revenues from metals.\nThe G-7 were joined in Italy by the leaders of Argentina, Brazil, Turkey, the United Arab Emirates, Ukraine and the Pope."}]