[{"id": "", "title": "Jewish students discuss incidents of antisemitism , harassment on campus", "date": "2024-05-29 09:30", "url": "https://dailytrojan.com/2024/05/29/jewish-students-discuss-incidents-of-antisemitism-harassment-on-campus/", "message": "Jahan said she witnessed a woman who appeared to be a student spitting at the feet of one of the Jewish organizers.\nSeveral Jewish students told the Daily Trojan they felt increasingly unsafe on campus this past year.\nIn stark contrast, Folt’s administration seems to default to unleashing police forces to torment, brutalize and repress USC students,” the statement read.\nSeveral Jewish students told the Daily Trojan that hearing the phrases made them feel unsafe.\n“It literally means calling for violence against Jews.”Other Jewish students expressed similar sentiments, saying the phrase was painful for them to hear from their classmates."}, {"id": "", "title": "U . S . government working overtime to grant special protections to one ethnic group : Jews – NaturalNews . com", "date": "2024-05-29 07:30", "url": "https://www.naturalnews.com/2024-05-28-government-working-overtime-grant-special-protections-jews.html", "message": "U.S. government working overtime to grant special protections to one ethnic group: JewsAs Israel presses forward with its highly controversial offensive in Rafah, a city where more than a million displaced Palestinians are currently sheltering, the U.S. government continues to work overtime to keep criticism of Israel at bay.\nHuman knowledge is under attack!\nWe are preserving human knowledge using AI technology while building the infrastructure of human freedom.\nAfter all, Congress recently passed legislation that effectively bans criticism of Israel and Jews.\nSome argue that it could even be interpreted as criminalizing the Gospel because part of its definition of antisemitic speech is “claims of Jews killing Jesus,” which is something that is directly stated in the Bible."}, {"id": "", "title": "Top adviser to Dem Senate candidate posted photo with religious leader who compared Jews to termites", "date": "2024-05-29 10:30", "url": "https://www.yahoo.com/news/top-adviser-dem-senate-candidate-080043661.html", "message": "Farrakhan, the leader of the Nation of Islam, has been vocal about what he thinks of Jews, comparing them to termites and saying they are \"Satanic.\"\n\"Great time with my Brothers at Savior's Day Convention,\" Defoe said, including the names of some of the Nation of Islam activists she attended with.\nMuhammad, who serves as a \"State Representative for Minister Louis Farrakhan and Minister of Muhammad Mosque No.\nFarrakhan has blamed Jews for, among other things, the slave trade, Jim Crow and black oppression in general.\nOriginal article source: Top adviser to Dem Senate candidate posted photo with religious leader who compared Jews to termites"}, {"id": "", "title": "Report : Levi Strauss Heir Rachel Gelman a Major Force Behind Pro - Hamas Groups | The Jewish Press - JewishPress . com | David Israel | 21 Iyyar 5784 – Wednesday , May 29 , 2024", "date": "2024-05-29 11:15", "url": "https://www.jewishpress.com/news/jewish-news/antisemitism-news/anti-israel-ngos/report-levi-strauss-heir-rachel-gelman-a-major-force-behind-pro-hamas-groups/2024/05/29/", "message": "Palestinian Youth Movement (PYM)4.\nOn Tuesday, the Daily Beast revealed the identity of the woman behind the Bafrayung Fund.\nBetween 2019 and 2022, the most recent year with available disclosures, the Gelmans contributed $3,470,000 to the Bafrayung Fund.\nThe Palestinian Youth Movement extensively has been the force behind numerous pro-Hamas encampments on US campuses, the flagship of which was at Columbia University.\nThe Bafrayung Fund has provided $298,000 in funding to Critical Resistance, an organization that has taken part in multiple events expressing support for Hamas."}, {"id": "", "title": "Top adviser to Dem Senate candidate posted photo with religious leader who compared Jews to termites", "date": "2024-05-29 12:00", "url": "https://wfin.com/fox-political-news/top-adviser-to-dem-senate-candidate-posted-photo-with-religious-leader-who-compared-jews-to-termites/", "message": "A spokesperson for Duggan claimed “the mayor has never attended a Saviours’ day event.”“This was a private meeting.\nMuhammad, who serves as a “State Representative for Minister Louis Farrakhan and Minister of Muhammad Mosque No.\nSince taking leadership of the Nation of Islam in the late 1970s, Farrakhan has been accused of antisemitismand homophobia for his comments and sermons.\nFarrakhan has blamed Jews for, among other things, the slave trade, Jim Crow and black oppression in general.\nFox News Digital reached out to Slotkin’s office and campaign but did not receive a response."}, {"id": "", "title": "Shavuot : Remembering to stand together - Jewish Community Voice", "date": "2024-05-29 15:45", "url": "https://www.jewishvoicesnj.org/articles/shavuot-remembering-to-stand-together/", "message": "In a few weeks, we will celebrate the Jewish holiday of Shavuot, the moment in history when the Jewish people received the Torah from G-d on Mount Sinai.\nShavuot, which is also known as the Festival of Weeks, is the day that occurs seven weeks after the Exodus of the Jewish people from Egypt.\nOur Southern New Jersey Jewish community is extremely diverse.\nAt its core, Shavuot is a joyous holiday, associated with the grain harvest and the exodus from Egypt.\nWe remember that Shavuot marks the entering into a covenant between G-d and Israel."}, {"id": "", "title": "Starmer pledges to stand firm with Jews – but gets tougher over Rafah", "date": "2024-05-29 13:30", "url": "https://www.thejc.com/news/uk/starmer-pledges-to-stand-firm-with-jews-but-gets-tougher-over-rafah-q2hdae8u", "message": "“I don’t think comparisons like that are very helpful at all,” Starmer said.\nHowever, he called on Israel to halt its offensive in Rafah following an airstrike said to have killed 45 civilians.\n“I support the independence of the court… it will be up to the court to make a decision,” he said.\n“We’ve been ruthless in the past four years over rooting out antisemitism and changing the Labour Party, but it will never be ‘job done’.\nStarmer said that Labour was no longer committed to recognising a Palestinian state immediately on taking office."}, {"id": "", "title": "Pastor Jack Graham says antisemitism due to  spiritual warfare  ", "date": "2024-05-29 00:15", "url": "https://www.christianpost.com/news/pastor-jack-graham-says-antisemitism-due-to-spiritual-warfare.html", "message": "I believe the hatred is because God loves the Jewish people.\nAnd Satan hates everything and everyone that God loves.\nBut according to Graham, Christians have a duty to support Israel, rooted in both faith and moral conviction.\n\"God loves Israel,\" Graham emphasized.\nAnd so, we must stand against that hatred at our church.”Recent events, such as the Oct. 7 attacks by Hamas, Graham said, have brought this struggle into sharp focus."}, {"id": "", "title": "Arne Duncan : Peaceful protest and compromise strengthen democracy", "date": "2024-05-29 12:00", "url": "https://www.chicagotribune.com/2024/05/29/opinion-college-protests-gaza-israel-democracy/", "message": "Since the Oct. 7 assault on Israel by Hamas and the Israeli government’s subsequent response in Gaza, many college campuses have become flashpoints of protest, vehement disagreement and, in some cases, expressions of hate and violence.\nThese agreements remind us that peaceful protest and compromise are signs of a healthy democracy.\nThe ability to listen, compromise and advance goals — however partial or limited — is desperately needed in every part of society: on college campuses, in government, in business and in life.\nI thank them for their strength and pragmatism and for setting an example for our political leaders across the country to follow.\nWe don’t have to allow disagreements — no matter how vehement — on many issues to block agreement or compromise on any issues."}, {"id": "", "title": "Support for Israel declines among younger Evangelicals | Church & Ministries News", "date": "2024-05-29 07:00", "url": "https://www.christianpost.com/news/support-for-israel-declines-among-younger-evangelicals.html", "message": "Home News Support for Israel, dispensationalism declines among younger Evangelicals: study Evangelicals under 30 increasingly embrace amillennialism, postmillennialismThe number of young Evangelicals in the United States who support Israel and view it as crucial to the End Times is declining as they increasingly move toward amillennial and postmillennial eschatology, according to a recent study.\nIn 2021, 24.3% of young Evangelicals said they support the Palestinians, compared to only 5% in 2018.\nAmillennialism also teaches that the Second Coming and Last Judgment will take place simultaneously at the end of the age.\nOne is that the younger Evangelicals have been to university in the last 20 years, and the universities have, to a significant degree, been subverted by Arab oil money.\"\nThere's a cause-and-effect relationship: as 'pre-trib' wanes and 'post-trib' waxes, the intensity of the support for Israel wanes.\""}, {"id": "", "title": "Repress U ., Class of 2024 : How to Build a Homeland Security Campus in Seven More Steps", "date": "2024-05-29 05:15", "url": "https://www.nakedcapitalism.com/2024/05/repress-u-class-of-2024-how-to-build-a-homeland-security-campus-in-seven-more-steps.html", "message": "This post argues that the “homeland security campus” was underway even before then.\nWelcome to Repress U., class of 2024: a homeland security campus for the ages.\nSome years ago, in the wake of Occupy Wall Street, I wrote a step-by-step guide to how the original homeland security campus was created.\nConsider the building of just such a homeland security campus a seven-step process.\nPunish student protest."}, {"id": "", "title": "Hamtramck approves resolution to divest from Israel", "date": "2024-05-29 19:30", "url": "https://www.yahoo.com/news/hamtramck-approves-resolution-divest-israel-180524349.html", "message": "Hamtramck City Manager Max Garbarino told the Free Press after the vote that \"we're going to use our best efforts to divest.\nBill Meyer, a Hamtramck activist, said the Hamtramck resolution goes even further in using the language of the BDS movement.\nIn January 2023, the Hamtramck council approved a resolution to allow animal sacrifices at home for Islamic holidays.\nIn his remarks, Hassan warned supporters of Israel that newer immigrant communities in the U.S. will eventually change policies supporting Israel.\nThis article originally appeared on Detroit Free Press: Hamtramck council approves resolution supporting Israel divestment"}, {"id": "", "title": "Latest Articles", "date": "2024-05-29 13:30", "url": "https://freerepublic.com/tag/*/index?more=4240748", "message": "“For momentary, light affliction is producing for us an eternal weight of glory far beyond all comparison” (2 Corinthians 4:17).\nBelievers are far more blessed when they concentrate on the spiritual rather than physical aspects of life.\nOne reason he was able to endure pain and trials was that he knew the physical was far less important and lasting than the spiritual.\nHe realized that our physical bodies are naturally aging and therefore not permanent.\nHe was probably aware of this more than most people because his rigorous ministry with its travel..."}]