[{"id": "3f4ea870-06ae-44b2-b97b-69f9247d3b14", "title": "Why most American Jews will and should vote for Kamala Harris", "date": "2024-08-14 10:45", "url": "https://www.jwire.com.au/why-most-american-jews-will-and-should-vote-for-kamala-harris/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Two separate issues are front and centre for American Jews in the run-up to Election Day on November 5.\nI support Kamala Harris enthusiastically in large part because there are, in fact, two Americas.\nand George W. Bush, And yes, it is the America of Kamala Harris.\nWhich brings us to why American Jews roughly 75 percent of American Jews did not want anything to do with Trump the last two go rounds and are almost certain to remain true to form this year.\nYet another reason: Almost as many American Jews support continued aid to Ukraine (77 percent) as support aid to Israel (80 percent)."}, {"id": "65499ae9-8d3d-465a-a2dc-2418b889684d", "title": "Do VP Kamala Harris And Tim Walz Have What It Takes ? ", "date": "2024-08-14 02:30", "url": "https://newsone.com/5476652/kamala-harris-tim-walz/", "domain": "newsone.com", "domain_classification": "Unknown", "message": "NewsOne Featured Video CLOSEVice President Kamala Harris and her running mate, Minnesota Governor Tim Walz, are preparing to face off against former President Donald Trump and Republican VP candidate JD Vance this November.\nDrama aside, Harris and Walz are focused on their goals as the November election approaches, with many Americans supporting their bid.\nimprove the economy in a manner that can be felt by all communities – particularly communities of color, 3.)\nWe hope Harris and Walz can meet the American people’s demands.\nSEE ALSO:Why Tim Walz Is The Perfect VP Pick For Kamala HarrisWhy Fear About Kamala Harris’ Candidacy Is Misguided"}, {"id": "faeca0e1-233b-4dce-b216-d2ed89a032f8", "title": "All the Jewish Medalists at the 2024 Paris Olympics", "date": "2024-08-14 13:45", "url": "http://www.washingtonjewishweek.com/all-the-jewish-medalists-at-the-2024-paris-olympics/", "domain": "washingtonjewishweek.com", "domain_classification": "Unknown", "message": "Jacob Gurvis | JTA.orgThe 2024 Paris Olympics concluded on Aug. 11, and at least 21 Jewish athletes from the United States, Australia and Israel returned home with some new hardware: The tally includes seven golds (with one athlete winning two), 11 silvers and five bronzes.\nAmit ElorU.S. wrestler Amit Elor entered the Paris Olympics, her first Games, on a winning streak dating to 2019.\nFox, 27, and her sister join a rare class of Jewish siblings to win medals at the same Olympics.\nTom ReuvenyWindsurfer Tom Reuveny won Israel’s first gold medal of the Paris Olympics in the men’s iQFoil windsurfing final.\nBronze medalistsNick ItkinFoil fencer Nick Itkin won bronze early on in the Paris Olympics, improving on his 12th-place finish in the individual competition in Tokyo."}, {"id": "f3703bff-c16f-4e12-bc22-e58899c32718", "title": "Do VP Kamala Harris And Tim Walz Have What It Takes ? ", "date": "2024-08-14 13:45", "url": "https://thebeatdfw.com/4161183/do-vp-kamala-harris-and-tim-walz-have-what-it-takes-to-bring-change-to-america/", "domain": "thebeatdfw.com", "domain_classification": "Unknown", "message": "97.9 The Beat Featured Video CLOSEVice President Kamala Harris and her running mate, Minnesota Governor Tim Walz, are preparing to face off against former President Donald Trump and Republican VP candidate JD Vance this November.\nAs Tim Walz vies for the presidency, he’s already contending with fierce criticism from the right.\nDrama aside, Harris and Walz are focused on their goals as the November election approaches, with many Americans supporting their bid.\nSEE ALSO:Why Tim Walz Is The Perfect VP Pick For Kamala HarrisWhy Fear About Kamala Harris’ Candidacy Is MisguidedThe post Do VP Kamala Harris And Tim Walz Have What It Takes To Bring Change To America?\nDo VP Kamala Harris And Tim Walz Have What It Takes To Bring Change To America?"}]