[{"id": "91eb1758-197d-4d80-940d-da73d69a076a", "title": "Harvard University Deceived Public in Response to Antisemitism , Shocking Congressional Report Alleges", "date": "2024-05-16 22:45", "url": "https://www.algemeiner.com/2024/05/16/harvard-university-deceived-public-response-antisemitism-shocking-congressional-report-alleges/", "message": "“The administration has repeatedly ignored Jewish students’ complaints despite clear violations of Harvard’s non-discrimination and anti-bullying policies,” the report said.\nThe environment at Harvard University, America’s oldest and arguably most prestigious institution of higher learning, has been closely scrutinized since Oct. 7.\nShame!” into his ears, and the Harvard Law School student government passed a resolution that falsely accused Israel of genocide and ethnic cleansing.\nHarvard University will be dealing with the fallout of the events of this academic year for the foreseeable future.\nHarvard, which argues that the plaintiffs’ complaint lacks legal standing, has twice attempted to have the suit dismissed."}, {"id": "e9020b45-96d7-495f-b6e6-a335721fed3d", "title": "What Biden forgot in his Holocaust Memorial speech", "date": "2024-05-16 00:00", "url": "https://www.startribune.com/what-biden-forget-in-his-holocaust-memorial-speech/600366243/", "message": "Opinion editor's note: Star Tribune Opinion publishes a mix of national and local commentaries online and in print each day.\nHolocaust Memorial's Annual Days of Remembrance Ceremony, President Joe Biden compared what happened in Israel on Oct. 7 to that broad event of the 20th century.\n'Never again,' simply translated for me,\" said Biden, speaking at the U.S. Capitol's Emancipation Hall, \"means: 'Never forget.'\nThe Holocaust industry made the Holocaust all about the Jews and Hitler, and not a human tragedy.\nIn his book \"The Holocaust Industry: Reflections on the Exploitation of Jewish Suffering,\" Norman Finkelstein argues that the American Jewish establishment exploits the memory of the Nazi Holocaust for political and financial gain and to further Israeli interests."}, {"id": "3066181f-23ce-4aad-9d0d-2060b13e48df", "title": "Berkeley Special Brand of  Anti - Zionism  Has Spread to Middle Schools", "date": "2024-05-16 04:00", "url": "https://hotair.com/john-s-2/2024/05/15/berkeleys-special-brand-of-anti-zionism-has-spread-to-middle-schools-n3788491", "message": "Our local Jewish community is both horrified and petrified.\nSome Jewish students, and their self-described Zionist parents, felt frightened by what they saw and heard, including a vulgar shout about Zionism — a claim vigorously denied by demonstrators.\nIn Berkeley, even the Middle School kids, ages 10-14, are holding walkouts for Gaza.\nThe Friday walkout included more than 100 students, ages 11 to 14, from the district’s three middle schools, with marches to UC Berkeley’s Sproul Plaza to join Gaza protesters at their pro-Palestinian encampment.\nMiddle School kids aren't supposed to leave school during the day."}, {"id": "011fcafe-0a64-4acc-b9e0-edc7769a6658", "title": "Campus Gaza protests :  Safetyism  has made colleges less safe", "date": "2024-05-16 20:45", "url": "https://www.bostonglobe.com/2024/05/16/opinion/campus-protests-safetyism/", "message": "Indeed, the incident highlights a mentality shared across the encampments that sprang up on college campuses to protest the Israeli invasion of Gaza.\nBut the protesters I saw and talked to at Harvard, MIT, Columbia, and NYU expected to be treated differently, and seemed bewildered when they weren’t.\nAdvertisementThe encampment in Harvard Yard of students opposed to the Israeli invasion of Gaza.\nBoston Globe/Photographer: Boston Globe/GettyThough the encampments are now gone — Harvard students packed theirs up Tuesday — the mentality that informed them remains intact.\nMaintenance staff and waste disposal crews cleaned up after police cleared a protest encampment on the campus of the University of Pennsylvania."}, {"id": "e5dd1c19-dd55-49df-8521-315aed03c626", "title": "Pro - Palestinian group marches at UC San Diego – NBC 7 San Diego", "date": "2024-05-16 03:00", "url": "https://www.nbcsandiego.com/news/local/pro-palestinian-uc-san-diego-protest/3515661/", "message": "Hundreds of pro-Palestinian supporters marched through the UC San Diego campus Wednesday to protest the war in Gaza and to call on their university to divest from companies supporting Israel.\nGet San Diego local news, weather forecasts, sports and lifestyle stories to your inbox.\nSign up for NBC San Diego newsletters.\nThe London Telegraph reported the following year that he was living in San Diego and attending a church in Pacific Beach.\nUC San Diego Encampment and UnrestLast week, tensions flared at UC San Diego when law enforcement cleared a \"Gaza Solidarity\" encampment on campus and arrested 64 people, 40 of whom were students, according to the university."}, {"id": "823bb012-d150-4acd-a788-017b3fb418bb", "title": "Columbia University president hit with no - confidence vote from faculty group over handling of pro - Palestinian campus protests", "date": "2024-05-16 22:00", "url": "https://edition.cnn.com/2024/05/16/us/university-of-washington-protests-antisemitic-graffiti/", "message": "Columbia cited security concerns in canceling the large event, a school official told CNN, and instead is holding smaller ones.\n“Canceling the traditional commencement ceremony was one of the toughest calls in a year of many tough calls,” Shafik wrote in an op-ed in the Columbia Daily Spectator, noting her top priority has been the safety of students, faculty and staff.\nFifty people were arrested, and police began the booking process onsite, university spokesperson Tom Vasich said in an email.\nPro-Palestinian protesters had set up a campus encampment on April 29, when the university also called in local law enforcement.\n“This is not protest, this is pure hate.”The building’s takeover came a day after the UCB Divest Coalition agreed to end its campus encampment following discussions with university leadership."}, {"id": "6c9173d8-96e3-4ea8-b2fa-617ce6cc5ceb", "title": "Revisiting Duke student movements demanding divestment from Israel", "date": "2024-05-16 06:45", "url": "https://www.dukechronicle.com/article/2024/05/duke-university-history-of-calls-for-divestment-from-israel-activism-pro-palestinian-the-chronicle-opinion-palestine-solidarity-movement-brodhead-dukedivest", "message": "This is not the first time Duke students have mobilized in support of divestment from Israel.\n2003 DukeDivest movementWidespread engagement with the Israel divestment movement at Duke began in January 2003 when DukeDivest organized a teach-in forum, sparking debate among panelists and the audience.\nStudents in favor of divestment from Israel sought to replicate the success of the South Africa divestment campaign in 1986.\nBut the Israel divestment campaign did not receive the same response from the University.\nRecognizing that prejudice had no place at an institution like Duke, Brodhead reaffirmed the importance of free expression."}, {"id": "d0710f54-6350-4d60-92d1-03d82d54b204", "title": "Student activists set to attend  people ceremony  after Columbia cancels graduation", "date": "2024-05-16 13:45", "url": "https://gothamist.com/news/student-activists-set-to-attend-peoples-ceremony-after-columbia-cancels-graduation", "message": "An unofficial graduation ceremony for student activists at Columbia University on Thursday will celebrate the protests that roiled campus for months, culminating in mass arrests and the main commencement's cancellation.\nThis is a way of ensuring a graduation ceremony for all graduating students,” said Barnard faculty organizer Shayoni Mitra.\n“Hopefully this is the beginning of a long road of resistance.”The student encampments at Columbia were imitated on campuses around the country.\nPresident Minouche Shafik surveyed the damage at Hamilton Hall on May 1, after the NYPD cleared out student activists.\nPolice arrested pro-Palestinian student activists who had occupied Hamilton Hall on April 30."}, {"id": "877d7154-45c6-4182-88c8-61083d7a7cc6", "title": "College professor to stand trial in death of pro - Israel counter - protester last year", "date": "2024-05-16 12:15", "url": "https://www.cbsnews.com/news/college-professor-loay-alnaji-stand-trial-paul-kessler-death-pro-israel-counter-protester/", "message": "How one college says it ended campus Gaza protests with dialogueHow one college ended campus protests with talksHow one college ended campus protests with talksVentura, Calif. — A judge decided Wednesday that a Southern California college professor will stand trial for involuntary manslaughter and battery in the death of a Jewish counter-protester during demonstrations over the Israel-Hamas war last year.\nAlnaji was charged with two felonies: involuntary manslaughter and battery causing serious bodily injury, with special allegations of personally inflicting great bodily harm injury on each count, the DA's office said.\n's office says it \"continues to translate and review messages, social media postings, files, and documents belonging to Alnaji.\nThis evaluation is ongoing and comprehensive, but to date it has not revealed evidence to support a hate crime.\nWhile antisemitic hate speech was heard at the November 5, 2023, rally, there is no evidence those words were said by Alnaji.\""}, {"id": "db943e1b-e58e-4c56-b444-d9d57ab939d3", "title": "Palestinians recount painful history with war in Gaza as a reminder", "date": "2024-05-16 00:45", "url": "https://isp.netscape.com/news/world/story/0001/20240515/a58e1a4f7fd224e1adfedf0da9b3608e", "message": "Palestinians recount painful history with war in Gaza as a reminderDawud Assad still has nightmares of the day Jewish militias attacked his village of Deir Yassin outside Jerusalem 76 years ago.\nIt refers to the exodus of some 700,000 Palestinians who fled or were forced from what is now Israel.\nIsrael holds the Palestinians and Arab states responsible for the events of 1948 because they rejected the U.N. partition plan and declared war.\nMore Palestinians fled in the years after 1948, including during the 1967 Middle East war, when Israel captured the West Bank, east Jerusalem and Gaza.\nAcross the Middle East, Palestinians are marking the Nakba with their eyes on the war in Gaza."}, {"id": "224487a9-3b9e-4649-b090-2ee996b383f8", "title": "Palestinians recount painful history with war in Gaza as a reminder", "date": "2024-05-16 00:15", "url": "https://upnorthlive.com/news/nation-world/palestinians-recount-painful-history-with-war-in-gaza-as-a-reminder", "message": "It refers to the exodus of some 700,000 Palestinians who fled or were forced from what is now Israel.\nIsrael holds the Palestinians and Arab states responsible for the events of 1948 because they rejected the U.N. partition plan and declared war.\nMore Palestinians fled in the years after 1948, including during the 1967 Middle East war, when Israel captured the West Bank, east Jerusalem and Gaza.\nThe fear now is if Palestinians leave Gaza altogether, they, like those who were forced to leave in 1948, will never be allowed to return.\nAcross the Middle East, Palestinians are marking the Nakba with their eyes on the war in Gaza."}, {"id": "260337fc-4d2b-4201-9c43-a4ce8e03b51f", "title": "Palestinians recount painful history with war in Gaza as a reminder", "date": "2024-05-16 03:45", "url": "https://apnews.com/article/nakba-gaza-israel-hamas-war-a58e1a4f7fd224e1adfedf0da9b3608e", "message": "It refers to the exodus of some 700,000 Palestinians who fled or were forced from what is now Israel.\nIsraeli leaders have said the Palestinian refugees should be absorbed by neighboring Arab states or in a future Palestinian state.\nMore Palestinians fled in the years after 1948, including during the 1967 Middle East war, when Israel captured the West Bank, east Jerusalem and Gaza.\nFILE - Displaced Palestinians arrive in central Gaza after fleeing from the southern Gaza city of Rafah in Deir al Balah, on May 8, 2024.\nAcross the Middle East, Palestinians are marking the Nakba with their eyes on the war in Gaza."}, {"id": "759ec064-582d-4d4b-bb01-826b34df657e", "title": "Palestinians recount painful history with war in Gaza as a reminder", "date": "2024-05-16 02:00", "url": "https://www.wdbo.com/news/world/palestinians-recount/HUFSWQ55VCNFHX2GRG5CO72YX4/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "4f98de2b-4161-474c-8f78-bebc6fd5eb66", "title": "Palestinians recount painful history with war in Gaza as a reminder", "date": "2024-05-16 01:30", "url": "https://www.2news.com/news/national/palestinians-recount-painful-history-with-war-in-gaza-as-a-reminder/article_560f02bc-102b-5048-bad5-1389684da5ff.html", "message": "We're always interested in hearing about news in our community.\nLet us know what's going on!"}, {"id": "d781f321-f8fc-466f-bbab-83755390ff97", "title": "Palestinians recount painful history with war in Gaza as a reminder", "date": "2024-05-16 02:15", "url": "https://santamariatimes.com/news/national/palestinians-recount-painful-history-with-war-in-gaza-as-a-reminder/article_1798ccc9-456a-5574-aeb1-33fb93670739.html", "message": "Palestinians recount painful history with war in Gaza as a reminderDawud Assad still has nightmares of the day Jewish militias attacked his village of Deir Yassin outside Jerusalem 76 years ago, killing more than 100 people"}, {"id": "10fb2f9c-055c-4986-b4a0-801db9e3bd1a", "title": "Palestinians recount painful history with war in Gaza as a reminder", "date": "2024-05-16 00:45", "url": "https://midmichigannow.com/news/nation-world/palestinians-recount-painful-history-with-war-in-gaza-as-a-reminder", "message": "It refers to the exodus of some 700,000 Palestinians who fled or were forced from what is now Israel.\nIsrael holds the Palestinians and Arab states responsible for the events of 1948 because they rejected the U.N. partition plan and declared war.\nMore Palestinians fled in the years after 1948, including during the 1967 Middle East war, when Israel captured the West Bank, east Jerusalem and Gaza.\nThe fear now is if Palestinians leave Gaza altogether, they, like those who were forced to leave in 1948, will never be allowed to return.\nAcross the Middle East, Palestinians are marking the Nakba with their eyes on the war in Gaza."}, {"id": "6a7d4bd1-d2fc-4314-888b-f38335976b7b", "title": "Palestinians recount painful history with war in Gaza as a reminder", "date": "2024-05-16 04:45", "url": "https://www.ksgf.com/2024/05/15/palestinians-recount-painful-history-with-war-in-gaza-as-a-reminder/", "message": "It refers to the exodus of some 700,000 Palestinians who fled or were forced from what is now Israel.\nAnd it notes that hundreds of thousands of Jews were forced out or fled Arab countries in the wake of Israel’s founding and were absorbed by the newly independent country.\nMore Palestinians fled in the years after 1948, including during the 1967 Middle East war, when Israel captured the West Bank, east Jerusalem and Gaza.\nThe fear now is if Palestinians leave Gaza altogether, they, like those who were forced to leave in 1948, will never be allowed to return.\nAcross the Middle East, Palestinians are marking the Nakba with their eyes on the war in Gaza."}, {"id": "e68665fa-2924-43a0-a905-c5cf946ab6ef", "title": "Palestinians recount painful history with war in Gaza as a reminder", "date": "2024-05-16 03:15", "url": "https://www.krmg.com/news/world/palestinians-recount/HUFSWQ55VCNFHX2GRG5CO72YX4/", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "aa2a99ca-2b68-4e0c-ad2d-07c9d5302fed", "title": "Palestinians recount painful history with war in Gaza as a reminder", "date": "2024-05-16 03:15", "url": "https://www.thesunchronicle.com/news/nation_world/palestinians-recount-painful-history-with-war-in-gaza-as-a-reminder/article_483c5789-b842-5175-891f-3f874059451a.html", "message": "Palestinians recount painful history with war in Gaza as a reminderDawud Assad still has nightmares of the day Jewish militias attacked his village of Deir Yassin outside Jerusalem 76 years ago, killing more than 100 people"}, {"id": "52f2f27b-befa-4482-a688-648367c5c63e", "title": "CPD , Public Safety tear down DePaul protest encampment", "date": "2024-05-16 20:30", "url": "https://depauliaonline.com/70601/news/cpd-public-safety-tear-down-depaul-protest-encampment/", "message": "The email stated that DePaul received many “credible threats” to the encampment that also prompted its removal.\nUpon arrival, CPD officers, who wore helmets and face shields and carried batons, tore down tents as students screamed and scrambled to gather belongings.\nFollowed by 10 CPD officers, the remaining encampment members marched from the Quad’s north entrance down Kenmore Avenue to join others.\nDePaul University spokespeople responded to The DePaulia’s request for comment by referring to Manuel’s most recent statement.\nHein said DePaul administration and CPD issued multiple dispersal orders for those in the encampment to leave or be arrested."}, {"id": "7cb63f0c-89f6-4b1d-94d1-61064832ee27", "title": "Why the world stopped laughing at  tone - deaf rich guy  Jerry Seinfeld", "date": "2024-05-16 11:15", "url": "https://www.telegraph.co.uk/tv/0/why-the-world-stopped-laughing-at-jerry-seinfeld/", "message": "The cause of the protests was Seinfeld’s support for Israel in its war against Hamas.\nHence the rather less than welcoming response at Duke, where, ironically, two of Seinfeld’s own children studied.\nBut the comedian has not exactly been winning fans in recent months, ever since he began his publicity campaign for his new Netflix comedy, Unfrosted.\nThe film, which explores the creation of Kellogg’s Pop-Tarts in the Sixties, not only starred Seinfeld, but was directed, co-written and co-produced by him as well.\nAs Richard Roeper put it in the Chicago Sun-Times: “Unfrosted is one of the worst films of the decade so far.”"}]