[{"id": "e37114a0-1a74-47f5-a9b0-bb160988f961", "title": "Abraham Foxman describes antisemitism at DNC , Jews meet in secret", "date": "2024-08-22 00:00", "url": "https://www.jpost.com/diaspora/antisemitism/article-815794", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Holocaust survivor and former Anti-Defamation League national director Abraham Foxman expressed concern on Wednesday that the situation for Jews in the US had deteriorated to the point that they had to meet in secret at events like the Democratic Party National Convention.\nFoxman’s concern came after a Tuesday Agudath Israel of America DNC event on rising antisemitism against Orthodox Jews was disrupted by anti-Israel activists.\n“Brick by brick, wall by wall, Zionism will fall,” the activists chanted in a video published by Agudath Israel.\nSubscribe to The Jerusalem Post Newsletter Subscribe NowFoxman praised President Joe Biden, who spoke at the DNC late Monday night.\nThe ex-ADL head said that Biden had opposed Russian aggression against Ukraine, committed the US government to fight antisemitism, and supported Israel when it fell under attack on October 7."}, {"id": "058d5507-1e62-4de9-999f-8d32c109606a", "title": "Seattle Museum , Jewish Groups Agree To Remove Exhibit On  Antisemitism  After Staffers Walked Out On Job Over It", "date": "2024-08-22 16:45", "url": "https://dailycaller.com/2024/08/22/seattle-museum-jewish-groups-remove-antisemitism-exhibit-pro-palestine-staffer-walk-out/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "The Wing Luke Museum in Seattle agreed to remove a Jewish exhibit on antisemitism at the behest of Jewish groups due to dozens of their own staffers walking out in protest over it, The Jewish Telegraphic Agency (JTA) reported Wednesday.\nThe protest forced the museum to close down, the JTA reported.\n“Immense harm has been caused to the Jewish community by not being able to show the exhibit.\nThe Jewish organizations add that the exhibit is slated to be shown next month at a “special event.”Wing Luke Museum spokesman Steve McLean told The Cholent, an independent media outlet, that the museum had not expected the exhibit to be withdrawn.\n“We are naturally disappointed that the Jewish Historical Society felt they needed to do that,” McLean reportedly said."}, {"id": "2a0793bf-2ada-42fb-987e-b7672cf8e1f9", "title": "The DNC is a display of Jewish unity – The Forward", "date": "2024-08-22 14:30", "url": "https://forward.com/opinion/646440/dnc-jamie-raskin-doug-emhoff-chuck-schumer-josh-shapiro-jewish/", "domain": "forward.com", "domain_classification": "Unknown", "message": "Some American Jews have rallied for Israel; others have protested against its war.\nRelationships of all kinds have fractured under the pressure of different beliefs about the Jewish state, and its role in American Jewish life.\nI’m not referring to the side events typically held explicitly for American Jews, although there have been plenty in Chicago, held on subjects like “the American Jewish community and Israel after Oct. 7.\nThe Democratic Party, American Jews, and Democratic Jews have spent months fighting bitterly over antisemitism and what it means to have Jewish political representation.\nOn Monday night, there was Rep. Jamie Raskin of Maryland, vehemently defending the U.S. constitution and American liberal democracy, part of a history of American Jews who have expressed Jewish particularity by defending constitutional liberalism."}, {"id": "3a3b5657-34ee-496f-ade9-dc0bdf2015a0", "title": "What Kamala Harris , Doug Emhoff mean to Black Jewish families – The Forward", "date": "2024-08-22 14:30", "url": "https://forward.com/opinion/646860/kamala-harris-doug-emhoff-black-jewish-family/", "domain": "forward.com", "domain_classification": "Unknown", "message": "Carly Pildis August 22, 2024To my 7-year-old Black Jewish daughter, Vice President Kamala Harris is Taylor Swift, Beyoncé, and Bluey all rolled into one.\nMy daughter is deeply inspired by the idea of a Black woman president — especially one with a Jewish husband who celebrates Jewish holidays like Passover and Rosh Hashanah.\nThe daughter of a Black Jewish father and white-presenting Ashkenazi Jewish mother, she sees herself in Harris.\nOur daughters are American, Black, Jewish and female, all beautiful — and perilous — things to be.\nWin or lose, it’s a huge moment for little girls — especially little Black Jewish girls."}, {"id": "1fc334c1-2e0f-47b2-a4f2-aecfe8f2d992", "title": "Candace Owens Says She Was  Encouraged  To Talk Negatively About Black People After Anti - Semitic Conspiracies", "date": "2024-08-22 00:00", "url": "https://www.enstarz.com/articles/235591/20240821/candace-owens-says-she-was-encouraged-talk-negatively-about-black-people-after-anti-semitic.htm", "domain": "enstarz.com", "domain_classification": "Unknown", "message": "Candace Owens came under fire after a video of her making inflammatory remarks about Israel went viral over the weekend.\nhttps://t.co/iX9Uihpw7p — Candace Owens (@RealCandaceO) August 18, 2024\"No.\nShapiro — who is Jewish, called Owens' comments \"disgraceful,\" blasting her \"faux sophistication\" on the topic in November.\nJeremy Boreing, chief executive of the publication, shared in an online statement that the \"Daily Wire and Candace Owens have ended their relationship.\"\nIn 2021, the author joined 'The Daily Wire' to host a political talk show titled 'Candace.'"}]