[{"id": "b665d7e8-33ce-42ce-b5d3-debd650b89dd", "title": "WWU issues apology to Arab students , agrees to some of war protester demands", "date": "2024-06-01 00:15", "url": "https://www.yahoo.com/news/wwu-issues-apology-arab-students-230000813.html", "message": "In addition to the apology, university officials negotiated a solution to the demands listed by student protesters.\n▪ WWU officials will review study-abroad programs such as the one with the University of Haifa.\nA Jewish student reported to police that they were spat upon and followed home on May 17, as they walked past a Gaza war protest.\nUniversity officials told The Bellingham Herald that none of the incidents has been linked to encampment participants.\nLast week, Jewish faculty, students and others told The Herald that the administration wasn’t taking their safety seriously."}, {"id": "9d6bbc19-719a-4fc0-bdb3-21ce275c3bb4", "title": "WWU issues apology to Arab students , agrees to some of war protester demands", "date": "2024-06-01 01:00", "url": "https://www.yahoo.com/news/wwu-issues-apology-arab-students-230000528.html", "message": "In addition to the apology, university officials negotiated a solution to the demands listed by student protesters.\n▪ WWU officials will review study-abroad programs such as the one with the University of Haifa.\nA Jewish student reported to police that they were spat upon and followed home on May 17, as they walked past a Gaza war protest.\nUniversity officials told The Bellingham Herald that none of the incidents has been linked to encampment participants.\nLast week, Jewish faculty, students and others told The Herald that the administration wasn’t taking their safety seriously."}, {"id": "d9be0ef1-5bdb-4387-b69b-4e2a6fb350bb", "title": "Nevada sees  concerning  rise in Holocaust misinformation , denial", "date": "2024-06-01 10:30", "url": "https://lasvegassun.com/news/2024/jun/01/state-sees-concerning-rise-in-holocaust-denial/", "message": "Nevada sees ‘concerning’ rise in Holocaust misinformation, denialHolocaust denial and distortion is increasing in Nevada, and young adults are especially prone to having inaccurate knowledge of the genocide, according to a survey commissioned by the Nevada Governor’s Advisory Council on Education Relating to the Holocaust.\nThe survey was conducted in order to gauge and analyze the level of understanding of the Holocaust and other genocides, and the prevalence of Holocaust denial and antisemitism.\nJewish Nevada co-sponsored the online survey, which reached about 1,400 registered voters around the state in March.\n• 86% knew the Holocaust happened and said the number of Jews who died in it has been accurately described.\nAnd we have the opportunity to fix that.”In a video message, Sen. Jacky Rosen, D-Nev., said she is continuing her advocacy in the Capitol for Holocaust education."}, {"id": "5f4574da-41ea-4190-9a35-876d89bdbb19", "title": "Jewish New Yorkers , Police Brace for Pro - Hamas Protests at Israel Parade | The Jewish Press - JewishPress . com | Mike Wagenheim | 25 Iyyar 5784 – Saturday , June 1 , 2024", "date": "2024-06-01 22:15", "url": "https://www.jewishpress.com/news/us-news/ny/jewish-new-yorkers-police-brace-for-pro-hamas-protests-at-israel-parade/2024/06/01/", "message": "Photo Credit: Simcha Rothman's Spokesperson(JNS) The New York City Police Department announced it will be doubling its normal presence on Sunday’s annual “Celebrate Israel Parade,” devoting half of the officers present to deal with an expected contingent of pro-Hamas protesters.\nThe New York Jewish community has seen many violent disruptions over the past several years by Hamas supporters.\nAdvertisementThe parade route runs north on Fifth Avenue from 57th to 74th streets.\nA survey of Jewish New Yorkers released on Thursday shows significant concern over safety heading into the parade.\nThe majority of those planning on attending the parade up Fifth Avenue said the situation in Israel and the United States since Oct. 7 has impacted their decisions."}, {"id": "b1372ddb-2363-4901-9465-a233051186c5", "title": "Plea for Return of Hostages Held by Hamas Will Add Somber Undertone to This Year Parade for Israel at New York", "date": "2024-06-01 00:30", "url": "https://www.nysun.com/article/plea-for-return-of-hostages-held-by-hamas-will-add-somber-undertone-to-this-years-parade-for-israel-at-new-york", "message": "Following the October 7 terrorist attack on Israel, the annual parade for Israel on Fifth Avenue will be less of a celebration and more of a show of solidarity, organizers say.\nNew York City’s parade for Israel, which has been held annually since 1964 and draws thousands of people to Manhattan’s Fifth Avenue in support of the Jewish state, will take a more somber tone this year.\nThe parade messaging will also prominently feature the words “Bring Them Home,” a plea to return the hostages taken by Hamas that has been heard and seen on posters around the world, New York Jewish Week reported.\nThe families of victims and hostages of the October 7 terrorist attack will be at Sunday’s parade, the event organizers say.\nIsraeli diplomat Ofir Akunis, a long-time parade attendee, will march this year for the first time as Consul General of Israel at New York."}, {"id": "98c1f7f7-5c0b-4929-9bb4-83b9cb130ef8", "title": "NYPD to step up security for Israel parade , but no known threats", "date": "2024-06-01 05:45", "url": "https://www.jpost.com/diaspora/antisemitism/article-804560", "message": "The NYPD will increase security for Sunday’s Israel parade due to tensions surrounding the war in Gaza and after months of increased antisemitism in the city, but said there are no known threats to the annual event.\nFrequent anti-Israel protests have taken place across the city since Hamas’ invasion of Israel on Oct. 7 and during the subsequent war.\n“These security measures are a little bit more increased from last year but these measures aren’t new,” said NYPD Chief of Department Jeffrey Maddrey.\nDespite the concerns, Caban said, “There is no specific or credible threats to the parade or to New York City in general.” He urged participants to report any suspicious activity to police.\nThe NYPD also urged participants to travel to the event by public transportation because there will be limited parking and heavy traffic."}, {"id": "f761a70e-8867-4c75-a0f1-4b58e6ca9d48", "title": "Civil disobedience and calls for financial divestments  have an important place in democracy  but many schools also have donors to worry about", "date": "2024-06-01 11:15", "url": "https://fortune.com/2024/06/01/civil-disobedience-and-calls-for-financial-divestments-have-an-important-place-in-democracy-but-many-schools-also-have-donors-to-worry-about/", "message": "Protesting students want their universities to sever partnerships and financial programs connected to the Israeli government and military.\nFaced with student protestors’ demands, educational institutions are finding themselves between a rock and a hard place.\nFor student protestors, the view is that their university— a moral authority—is profiting from a military campaign they vehemently disagree with.\nIt’s an especially complex decision for schools that have large endowments or networks of donors who can influence the investments and financial decisions of an institution.\nThe most aggressive campus responses to encampments include authorizing police to mass arrest students and suspending, expelling, and evicting student activists."}, {"id": "a9d8aa86-8add-41a3-b286-130dfbe79733", "title": "Grapevine May 31 , 2024 : Corruption in high places", "date": "2024-06-01 03:30", "url": "https://www.jpost.com/israel-news/article-804445", "message": "No one should be shocked by revelations of corruption in high places in Israel.\nAmong the MKs who were placed behind bars were Meir Kahane, Naomi Blumenthal, Omri Sharon, and Fania Kirschenbaum.\nYair Golan attends a conference at the Reichman University in Herzliya, on February 6, 2024.\nAmong his most recent is an honorary doctorate from the University of Haifa to which he has been a most generous benefactor.\nThe keynote speaker at Wednesday’s event will be Danny Adeno Abebe, the journalist and prize-winning author of From Africa to Zion, who is among the more widely known and more influential members of Israel’s Ethiopian community."}, {"id": "44f9f1cc-c1c7-44c8-b5ba-7c990ebe4f74", "title": "ANU airs documentary detailing plight of Sephardi crypto - Jews", "date": "2024-06-01 03:30", "url": "https://www.jpost.com/diaspora/antisemitism/article-804339", "message": "Research for the film took the Milgroms and director Otero to locations in Cuba, Spain, Portugal, the Canary Islands, Cartagena, Colombia, Costa Rica, France, Miami, and Key West.\n“Having discovered my lineage dating back to pre-Inquisition Spain and Portugal, I felt compelled to travel back in time and confront my history head-on.\nShe has come across thousands of these little-known documents of Jewish life in Spain and Portugal prior to and during the Inquisition.\nPerry is founder of Reconectar, an organization set up to assist in connecting the descendants of Spanish and Portuguese Jewish communities to the mainstream Jewish world, both online and in person.\nWith his contacts in the Israeli government and the legal world, Perry has been able to help place the issue of Bnei Anusim on the global Jewish agenda."}, {"id": "e2e47f4f-4cc1-46f0-928a-9dda73ee3a2d", "title": "Simpering MSNBC host brands Manhattan DA Alvin Bragg  the anointed one  for turning Donald Trump into a felon", "date": "2024-06-01 06:15", "url": "https://www.dailymail.co.uk/news/article-13482993/Simpering-MSNBC-host-brands-Manhattan-DA-Alvin-Bragg-anointed-one.html", "message": "MSNBC host Lawrence O'Donnell couldn't contain his praise for Manhattan DA Alvin Bragg after he successfully prosecuted Donald Trump, referring to the prosecutor as 'the anointed one.'\nHe referenced a 1995 op-ed written in the Harvard Crimson that called Bragg - then a student and a leader in the Harvard Black Students Association - 'the anointed one.'\nMSNBC host Lawrence O'Donnell couldn't contain his praise for Manhattan DA Alvin Bragg after he successfully prosecuted Donald Trump, referring to him as 'the anointed one'He continued, 'The people of Manhattan who elected him, that's what they saw.\n'In a country in the Trump era that desperately needs lessons in modesty, Alvin Bragg is that lesson.'\nThe Harvard Crimson op-ed praised an event Bragg organized in 1992, a speech by City University of New York professor Leonard Jeffries."}, {"id": "46fe6ee8-43d5-4ac0-b379-0af647480020", "title": "Ben Platt is On Our Mind", "date": "2024-06-01 23:00", "url": "https://metrosource.com/ben-platt-is-on-our-mind/", "message": "Ben sounds at his most reflective, his most sincere, and his most relaxed even as he soars through his vocal register.\nWe both feel really lucky as queer people to be in a position to share our relationship.\nI feel like that is the period where I really kind of started to get a handle on my actual point of view.\nIn 2019, Ben released the music video for “Ease My Mind,” the second single on his debut album Sing to Me Instead.\nFor information on Ben’s Honeymind tour, head to BenPlattMusic.comBen Platt Honeymind prideLast modified: June 1, 2024"}, {"id": "69cae1b3-6ee3-4caf-bbcf-da75d7dbd0f4", "title": "The Independent Pride List 2024 : the LGBT+ people making change happen", "date": "2024-06-01 19:30", "url": "https://www.independent.co.uk/lgbt/pride-list-2024-lgbt-changemakers-b2554470.html", "message": "Reflecting The Independent’s philosophy of making change happen, the Pride List is not just a roll-call of big names but honours the influence of those making a difference to LGBT+ lives in Britain and beyond.\nPublishing the list today marks the start of Pride Month, which culminates in the annual Pride in London march on Saturday 29 June.\nCrystalFirst appearing on the UK’s first RuPaul’s Drag Race show in 2019, Canadian-born drag artist Crystal has gone on to host queer TV shows and their own podcast too.\nShe co-founded the UK Black Pride movement in 2005 and was appointed as the first CEO of UK Black Pride in November 2023.\nCumming is bisexual and supports plenty of charities, including LGBT Youth Scotland."}]