[{"id": "9b71f8c8-a367-4390-95bd-b4fe3561d86d", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries", "date": "2024-06-12 04:30", "url": "https://www.yahoo.com/news/dutch-court-delivering-verdicts-trial-040922867.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De VriesFILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\nA Dutch court is delivering verdicts Wednesday, June 12, 2024 in the trial of nine men suspected of involvement in the 2021 assassination of popular campaigning journalist Peter R. de Vries on a downtown Amsterdam street.\n(AP Photo/Peter Dejong, File)THE HAGUE, Netherlands (AP) — A Dutch court is delivering verdicts Wednesday in the trial of nine men suspected of involvement in the assassination three years ago of popular campaigning journalist Peter R. de Vries on a busy Amsterdam street.\nIn January, prosecutors requested sentences ranging from of three to 21 years for the six other suspects in the case.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "62262dc3-9f61-4fde-a3fe-8fbeccde17ed", "title": "A Dutch court is delivering verdicts in the trial of 9 suspects in the slaying of reporter De Vries – Winnipeg Free Press", "date": "2024-06-12 04:30", "url": "https://www.winnipegfreepress.com/world/2024/06/11/a-dutch-court-is-delivering-verdicts-in-the-trial-of-9-suspects-in-the-slaying-of-reporter-de-vries", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "THE HAGUE, Netherlands (AP) — A Dutch court is delivering verdicts Wednesday in the trial of nine men suspected of involvement in the assassination three years ago of popular campaigning journalist Peter R. de Vries on a busy Amsterdam street.\nIn January, prosecutors requested sentences ranging from of three to 21 years for the six other suspects in the case.\nFILE - Dutch crime reporter Peter R. de Vries looks on prior to attending a live TV show in Amsterdam, Netherlands, on Jan. 31, 2008.\nA Dutch court is delivering verdicts Wednesday, June 12, 2024 in the trial of nine men suspected of involvement in the 2021 assassination of popular campaigning journalist Peter R. de Vries on a downtown Amsterdam street.\nProsecutors told judges at Amsterdam District Court that the weapon used to shoot de Vries was found in their car."}, {"id": "563bb4e9-002e-44a2-8448-f9c006f384c9", "title": "Lake Berryessa shooting suspect arrested by Napa County authorities", "date": "2024-06-12 02:15", "url": "https://www.mercurynews.com/2024/06/11/lake-berryessa-shooting-suspect-arrested-by-napa-county-authorities/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "A North Bay man was arrested on suspicion of fatally shooting another person during a brawl at Lake Berryessa on Saturday, according to a news release from the Napa County Sheriff’s Office.\nOne person was fatally shot and at least five people were stabbed during a large fight June 8 on the shore of Lake Berryessa, the Napa County Sheriff’s Office said.\nThe shooting victim was identified as Andrew Fabian Sandoval Garcia, a 39-year-old Vallejo resident.\nAccording to Sheriff’s Office spokesman Henry Wofford, two people with stab wounds were airlifted to local hospitals in serious condition.\nThe cause of the fight and how many people were involved has yet to be determined by investigators."}, {"id": "b3a8dcd2-27c3-4495-97aa-56ffd2290264", "title": "Hamas leader suggests civilian deaths are  necessary sacrifice in war with Israel : Report | News", "date": "2024-06-12 03:15", "url": "https://gazette.com/news/wex/hamas-leader-suggests-civilian-deaths-are-necessary-sacrifices-in-war-with-israel-report/article_64934c25-1f5d-5e3a-9e51-8887a95b7bf4.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Yahya Sinwar, the military leader of Hamas, reportedly suggested civilian deaths are \"necessary sacrifices\" amid its war with Israel in a message to the terrorist organization's leaders in Doha, Qatar.\nThe war between Hamas and Israel, much of it taking place within Gaza and the West Bank, has resulted in thousands of civilian deaths.\nBut Sinwar's remarks, reported by the Wall Street Journal, indicate that Hamas is willing to continue its war with Israel despite the heavy civilian cost.\nThe report also suggests that with the growing backlash Israel is facing over civilian deaths, he believes Hamas could deal with a depleted Israeli arsenal as allies hesitate to supply the nation further.\nFeatured Local SavingsHamas began the recent conflict with its Oct. 7 attacks on Israel, which killed hundreds of Israeli military personnel and citizens."}, {"id": "3dc37b45-ac5e-42c3-8245-b9c85b961f1e", "title": "4 killed in Israeli airstrike on SE Lebanese town", "date": "2024-06-12 01:15", "url": "https://article.wn.com/view/2024/06/12/4_killed_in_Israeli_airstrike_on_SE_Lebanese_town/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "BEIRUT, June 11 (Xinhua) -- Four people were killed and 10 others injured late Tuesday in an Israeli airstrike on the town of Jouaiya in the southeastern Lebanese city of Tyre, Lebanese media reported.\nThe airstrike hit a house with three missiles in Jouaiya, killing Abu Talib, a senior military leader of the Lebanese... read full story\"the crossing of 12 drones and about 80 surface-to-surface missiles from the Lebanese side to northern Israel,\""}, {"id": "4f275d7b-486a-4b46-b4fd-bdcb22255a6d", "title": "4 US instructors wounded in China stabbing attack", "date": "2024-06-12 03:30", "url": "https://article.wn.com/view/2024/06/12/4_US_instructors_wounded_in_China_stabbing_attack/", "domain": "article.wn.com", "domain_classification": "Unknown", "message": "BEIJING: Four American instructors from a small Iowa university were wounded in a stabbing attack in a public park in northeast China’s Jilin province on Monday, prompting an investigation into the attacker’s motive, Chinese officials said.\nThe alleged assaults occurred shortly before noon on Monday at a park in Jilin... read full story\"Cui collided into a foreigner while walking in Beishan Park, and then stabbed the foreigner and three fellow foreigners with a knife, as well as a Chinese tourist who tried to stop him,\""}, {"id": "cf7ab4f3-aec2-49c8-9d55-646b0cf92e89", "title": "BREAKING : IDF Eliminates Senior Hezbollah Official ; Highest Ranking Officer Neutralized Since Oct . 7", "date": "2024-06-12 04:15", "url": "https://freerepublic.com/focus/f-bloggers/4243746/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Posted on by SeekAndFindReports are emerging that the IDF hit a significant Hezbollah target in Lebanon on Tuesday afternoon.\nAccording to the reports, an Israeli strike in Jouya, in southern Lebanon, killed at least four Hezbollah officials.\nHezbollah identified the killed commander by his rank in a statement, naming him as Taleb Abdallah.\nThe sources, who spoke on condition of anonymity, said the commander's role in Hezbollah was as significant as that of Wissam Tawil, a senior Hezbollah commander killed in an Israeli strike in January.\nMAJOR UPDATE: The IDF had intel about the Hezbollah senior commander's secret meeting; they hit the meeting place and took out two of their most senior commanders."}, {"id": "b5f046b1-967a-44b1-a2f2-872205b10490", "title": "India Nuclear Journey : From Pokhran to Global Power – Indian Defence Research Wing", "date": "2024-06-12 04:15", "url": "https://idrw.org/indias-nuclear-journey-from-pokhran-to-global-power/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "India’s Nuclear Journey: From Pokhran to Global Power| BySOURCE: AFIThe journey began with the vision of physicist Homi Bhabha, who convinced Prime Minister Nehru to invest in nuclear technology despite international disapproval.\nIndia’s first Peaceful Nuclear Explosion (PNE) in Pokhran in 1974 marked a significant achievement, but it also triggered international condemnation.\nThis resulted in exclusion from crucial nuclear groups like the NSG (Nuclear Suppliers Group) and CTBT (Comprehensive Test Ban Treaty).\nIndia’s nuclear doctrine emphasizes “No First Use,” meaning it would only retaliate with nuclear weapons in response to a first strike by another nuclear state or a large-scale chemical/biological attack.\nChina, however, possesses a significantly larger arsenal (estimated at over 300 warheads), primarily aimed at deterring the US and its allies."}, {"id": "a71c498d-4f7f-4b54-a6d9-ec0b848a64c7", "title": "Woman found guilty in 2023 fatal Springfield nightclub stabbing", "date": "2024-06-12 03:45", "url": "https://www.westernmassnews.com/2024/06/12/woman-found-guilty-2023-fatal-springfield-nightclub-stabbing/", "domain": "westernmassnews.com", "domain_classification": "Unknown", "message": "SPRINGFIELD, Mass.\n(WGGB/WSHM) - A woman found guilty of manslaughter on Tuesday in connection to a fatal stabbing in Springfield.\nIn January of last year, Springfield Police responded to the top shelf nightclub for reports of a stabbing victim.\nOfficers said the attack started outside the nightclub on chestnut street, and they found the victim in a parking lot across the street.\nShe pleaded not guilty to murder charges in January of 2023 and on Tuesday she has been found guilty of manslaughter."}, {"id": "207c02e5-2ab7-4de1-bf8c-31252545e941", "title": "Four US college instructors stabbed in public park in China", "date": "2024-06-12 02:00", "url": "https://hotair.com/headlines/2024/06/11/four-us-college-instructors-stabbed-in-public-park-in-china-n3790084", "domain": "hotair.com", "domain_classification": "Unknown", "message": "Police in China have arrested a 55-year-old man after four US university tutors were stabbed at a public park.\nThe Iowa Cornell College instructors were taken to hospital after a \"serious incident\" during the daytime attack in the northern province of Jilin, a college statement said.\nAdvertisementIowa Representative Adam Zabner said his brother, David, was one of the four instructors injured in what he described as a stabbing...On Tuesday, searches for terms such as \"foreigners Jilin\" produced no results despite the search term trending on Weibo."}, {"id": "23ae37a6-4d27-4829-a8d8-76f01a5e8926", "title": "HAL LCH to Test Helina Anti - Tank Missile – Indian Defence Research Wing", "date": "2024-06-12 04:15", "url": "https://idrw.org/hals-lch-to-test-helina-anti-tank-missile/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "HAL’s LCH to Test Helina Anti-Tank Missile| BySOURCE: RAUNAK KUNDE / NEWS BEAT / IDRW.ORGHindustan Aeronautics Limited’s (HAL) indigenously developed Light Combat Helicopter (LCH), also known as Prachand, is poised for a crucial milestone later this year.\nThe helicopter will undergo integration and testing with the Helina Anti-Tank Guided Missile (ATGM), a key weapon system for the platform.\nHelina, the helicopter-launched version of the Nag missile, has already been successfully test-fired from the ALH-Rudra attack helicopter.\nHelina boasts advanced capabilities, making it a potent weapon for the LCH.\nThe successful integration of Helina will significantly enhance the Prachand’s combat capabilities, making it a more potent weapon system for the Indian Armed Forces."}, {"id": "84fa4ccc-600b-49c7-81a3-2ac428a6fc98", "title": "19 - year - old killed in  explosion of gunfire  during Las Vegas marijuana transaction", "date": "2024-06-12 02:45", "url": "https://www.yahoo.com/news/19-old-killed-explosion-gunfire-005157243.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "LAS VEGAS (KLAS) — Four people shot and killed a 19-year-old in “an explosion of gunfire” during a marijuana transaction, prosecutors said.\nA Clark County grand jury later indicted Smith on charges including open murder and conspiracy murder.\nSmith and three others allegedly conspired to rob Foreman during a marijuana transaction.\nAfter meeting outside of the east valley apartment complex, the meeting turned into “an explosion of gunfire,” prosecutors said.\nFour people shot and killed a 19-year-old in “an explosion of gunfire” during a marijuana transaction, prosecutors said."}, {"id": "193190f1-faef-47b6-878a-6e19f1c9018f", "title": "Iran seeks de - escalation on Israel - Lebanon border", "date": "2024-06-12 00:30", "url": "https://global.chinadaily.com.cn/a/202406/11/WS666848e8a31082fc043cbed2.html", "domain": "global.chinadaily.com.cn", "domain_classification": "Unknown", "message": "[Photo/Agencies]As tensions rise on the Israel-Lebanon border, Iran hopes the situation can be de-escalated and there is no new full-blown war in the region, with Israel urged not to launch any actions that infringe on Lebanon's territorial integrity.\nIsraeli military have said they are ready for cross-border attacks while Lebanon resistance forces said they will counter possible Israeli offensives, according to local media.\nThat's why, for the various reasons, Iran doesn't want to see an expansion of the conflict and war to Lebanon,\" he added.\nLebanese armed group Hezbollah said on June 10 that it shot down an Israeli drone over southern Lebanon.\nAll-out war with Hezbollah would draw Iran into the conflict, then who knows which Arab countries might want to side with them.\""}, {"id": "189f79a5-9753-49c6-9e17-342debf94c9d", "title": "Iran seeks de - escalation on Israel - Lebanon border", "date": "2024-06-12 02:45", "url": "http://usa.chinadaily.com.cn/a/202406/11/WS666848e8a31082fc043cbed2.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Smoke rises above Lebanon, following an Israeli strike, as seen from Israel's border with Lebanon in northern Israel, May 5, 2024.\nIsraeli military have said they are ready for cross-border attacks while Lebanon resistance forces said they will counter possible Israeli offensives, according to local media.\nThat's why, for the various reasons, Iran doesn't want to see an expansion of the conflict and war to Lebanon,\" he added.\nLebanese armed group Hezbollah said on June 10 that it shot down an Israeli drone over southern Lebanon.\nAll-out war with Hezbollah would draw Iran into the conflict, then who knows which Arab countries might want to side with them.\""}, {"id": "d028d0d8-be62-425c-8c6d-17df5448115b", "title": "Iran seeks de - escalation on Israel - Lebanon border", "date": "2024-06-12 01:30", "url": "http://europe.chinadaily.com.cn/a/202406/11/WS666848e8a31082fc043cbed2.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Smoke rises above Lebanon, following an Israeli strike, as seen from Israel's border with Lebanon in northern Israel, May 5, 2024.\nIsraeli military have said they are ready for cross-border attacks while Lebanon resistance forces said they will counter possible Israeli offensives, according to local media.\nThat's why, for the various reasons, Iran doesn't want to see an expansion of the conflict and war to Lebanon,\" he added.\nLebanese armed group Hezbollah said on June 10 that it shot down an Israeli drone over southern Lebanon.\nAll-out war with Hezbollah would draw Iran into the conflict, then who knows which Arab countries might want to side with them.\""}, {"id": "adfac2f9-584d-4584-9dc5-150242b9c9a8", "title": "Iran seeks de - escalation on Israel - Lebanon border", "date": "2024-06-12 01:30", "url": "http://africa.chinadaily.com.cn/a/202406/11/WS666848e8a31082fc043cbed2.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Smoke rises above Lebanon, following an Israeli strike, as seen from Israel's border with Lebanon in northern Israel, May 5, 2024.\nIsraeli military have said they are ready for cross-border attacks while Lebanon resistance forces said they will counter possible Israeli offensives, according to local media.\nThat's why, for the various reasons, Iran doesn't want to see an expansion of the conflict and war to Lebanon,\" he added.\nLebanese armed group Hezbollah said on June 10 that it shot down an Israeli drone over southern Lebanon.\nAll-out war with Hezbollah would draw Iran into the conflict, then who knows which Arab countries might want to side with them.\""}, {"id": "18845627-df89-48c7-a719-0bddfd259f01", "title": "Russia launches missile and drone attack on Kyiv , Ukraine military says", "date": "2024-06-12 03:45", "url": "https://www.theglobeandmail.com/world/article-russia-launches-missile-and-drone-attack-on-kyiv-ukraines-military/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Russia launched a missile and drone attack on Kyiv early on Wednesday with preliminary information showing there were no injuries or damage in the Ukrainian capital, Ukrainian military said.\nUkraine’s air defence systems destroyed all air weapons on their approach to the city, Serhiy Popko, head of Kyiv’s military administration said on the Telegram messaging app.\nHe added that according to preliminary information, Russia used a combination of cruise and ballistic missiles as well as drones in its attack.\nReuters could not independently verify what weapons were used, but Reuters witnesses said that several blasts that sounded like air defence systems at work were heard in and around Kyiv.\nThat is often the case when Russia launches an air attack on Ukraine’s western regions."}, {"id": "a434595e-9bf4-49a4-8bf4-b2f0783f51cb", "title": "Russia launches missile and drone attack on Kyiv , Ukraine military says", "date": "2024-06-12 03:30", "url": "https://www.thestar.com.my/news/world/2024/06/12/russia-launches-missile-and-drone-attack-on-kyiv-ukraine039s-military-says", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "KYIV (Reuters) - Russia launched a missile and drone attack on Kyiv early on Wednesday with preliminary information showing there were no injuries or damage in the Ukrainian capital, Ukrainian military said.\nUkraine's air defence systems destroyed all air weapons on their approach to the city, Serhiy Popko, head of Kyiv's military administration said on the Telegram messaging app.\nHe added that according to preliminary information, Russia used a combination of cruise and ballistic missiles as well as drones in its attack.\nThat is often the case when Russia launches an air attack on Ukraine's western regions.\n(Reporting by Valentyn Ogirenko and Sergiy Karazy; Writing by Lidia Kelly in Melbourne; Editing by Himani Sarkar and Michael Perry)"}, {"id": "42e008f4-8390-428d-af91-533a2d851d03", "title": "Three FC men injured in IED attack near Kuchlak - Newspaper", "date": "2024-06-12 04:15", "url": "https://www.dawn.com/news/1839332/three-fc-men-injured-in-ied-attack-near-kuchlak", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "QUETTA: Three Frontier Corps personnel have been injured in an IED attack near Kuchlak at the Quetta-Chaman Highway late on Tuesday night.\nAccording to officials, the IED exploded close to the personnel’s vehicle, which was damaged as a result of the powerful blast.\nThe window panes of a nearby building were smashed due to the explosion’s intensity.\nPolice and FC personnel shifted the injured soldiers to Quetta’s Combined Military Hospital.\n“It seems like a remote control IED blast,” a senior police officer posted in Kuchlak told Dawn."}, {"id": "ae319dc0-9b38-4752-ad85-249b8f4fc150", "title": "Can China Turn Its Property Glut Into Affordable Housing ? ", "date": "2024-06-12 02:45", "url": "https://foreignpolicy.com/2024/06/11/china-property-crisis-affordable-housing-plan/?tpcc=recirc_trending062921", "domain": "foreignpolicy.com", "domain_classification": "Unknown", "message": "China currently has 3.6 billion square feet—or roughly 5.5 million homes—of unsold housing inventory due to the collapse of its property bubble.\nNationwide, that could raise the percentage of affordable housing from just 5 percent of China’s stock to 30 percent.\nUnfortunately, affordable housing projects in China do not have a good record.\nEven when affordable housing was built, it was often distributed to the well-connected rather than the needy, including officials and their families.\nAnother common dodge was for developers to get the money and permits to build affordable housing and then switch most of it to conventional commercial use upon launch, only retaining a small number of affordable residential units."}, {"id": "0079533f-2b62-4bb9-b495-864540084a51", "title": "Media : Explosions reported across occupied Crimea , Krasnodar Krai", "date": "2024-06-12 04:15", "url": "https://www.yahoo.com/news/media-explosions-reported-across-occupied-023803519.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Explosions were heard in missile attacks in multiple cities across occupied Crimea, as well as in a community in Russia's Krasnodar Krai overnight on June 12, the Telegram channel Crimean Wind reported.\nA small number of explosions was also heard in the community of Armyanskii in Russia's Krasnodar Krai around 4 a.m. local time, according to Crimean Wind.\nAccording to Crimean Wind, unconfirmed reports suggest that an S-400 air defense system may have been damaged as a result of the attack.\nUkraine's General Staff confirmed on June 10 that Armed Forces attacked Russian S-400 and S-300 anti-aircraft missile systems in several areas in occupied Crimea overnight.\nRead also: Russia has seized almost $24 million in Ukrainian assets from occupied Crimea since 2022, proxy leader saysWe’ve been working hard to bring you independent, locally-sourced news from Ukraine."}, {"id": "45e9577d-e108-466b-936e-5c30fb6d1052", "title": "  The Cranes Call  Review : Tribeca Hunt for Russian War Criminals", "date": "2024-06-12 02:30", "url": "https://www.thewrap.com/the-cranes-call-review-russia-war-criminals-documentary/", "domain": "thewrap.com", "domain_classification": "Unknown", "message": "If you walked into a theater showing Laura Warner’s “The Cranes Call” by accident, two things would happen.\n“The Cranes Call” is the latest documentary about the ongoing, horrifying Russian invasion of Ukraine.\nIt follows Anya Neistat, a human rights activist working for the Clooney Foundation for Justice, run by Amal Clooney and her husband George.\nWhether that day will come, Neistat and Stasiv do not know.\nThe visual approach vaunts Neistat and Stasiv a little, but given their chosen profession and nearly impossible tasks, that’s understandable."}, {"id": "c803463e-158b-4772-9c20-a43a717ae589", "title": "Convicted killer Paul Flores moved to another prison over safety concerns", "date": "2024-06-12 03:45", "url": "https://www.ksby.com/news/kristin-smart-case/convicted-killer-paul-flores-moved-to-another-prison-for-his-safety", "domain": "ksby.com", "domain_classification": "Unknown", "message": "Kristin Smart's killer, Paul Flores, has been moved to a new prison for safety reasons.\nThe move comes after Flores was attacked twice at Pleasant Valley State Prison in Coalinga.\nIn April of this year, prison staff reportedly witnessed another inmate stabbing Flores in the recreation yard.\nAccording to his attorney, Harold Mesick, Flores was moved to Corcoran State Prison on June 6.\nFlores was initially placed at Pleasant Valley State Prison last August to begin serving his 25 years-to-life sentence for Smart's murder."}, {"id": "d6d6a6c4-83ae-4167-9402-b7041202c4d2", "title": "Russian military exercises in the Caribbean : Here what to expect", "date": "2024-06-12 02:30", "url": "https://www.cbsnews.com/news/russia-cuba-ships-military-exercises-caribbean-what-to-expect/?intcid=CNR-02-0623", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "Three Russian ships and a nuclear-powered submarine are expected to arrive in Cuba this week ahead of military exercises in the Caribbean, officials said.\nWhat Russian ships are arriving in Cuba?\nAccording to the Cuban Foreign Ministry, the three Russian ships are a frigate, a fleet oil tanker and a salvage tug.\nAnother destroyer and a U.S. Coast Guard cutter are shadowing the three Russian ships.\nThe two U.S. officials said Tuesday the Russian ships are expected to head to Venezuela after Cuba, but it's unclear what the submarine will do."}, {"id": "fc1efb68-532b-4e85-b796-6d84694ebb30", "title": "Chicago crime : South Loop man Ivan Weldon charged in 3 CTA Green Line attacks", "date": "2024-06-12 04:30", "url": "https://abc7chicago.com/post/chicago-crime-south-loop-man-ivan-weldon-charged/14937930/", "domain": "abc7chicago.com", "domain_classification": "Unknown", "message": "South Loop man charged in 3 CTA Green Line attacksCHICAGO -- A South Loop man remains jailed on attempted murder and battery charges in connection with several attacks on CTA passengers.\nIvan Weldon, 42, is accused of using a box cutter to slice a 48-year-old man's neck and stabbing him multiple times May 31 on a Green Line train near the Garfield station, 320 E. Garfield Boulevard.\nWeldon faces three felony charges in connection with that attack: attempted murder, aggravated battery in a public place and aggravated battery causing great bodily harm.\nOn the same day, Weldon allegedly attacked two more passengers at the CTA Green Line Bronzeville stop, 16 E. 35th St.\nTwo felony counts each of aggravated battery in a public place and aggravated battery were filed in those attacks."}, {"id": "9be196b1-d28b-4a13-8cc4-b14e82b14ad0", "title": "Man who led SLO County police on chase during 2023 crime spree sentenced", "date": "2024-06-12 03:45", "url": "https://www.ksby.com/news/local-news/man-who-led-san-luis-obispo-co-law-enforcement-on-chase-during-2023-crime-spree-sentenced", "domain": "ksby.com", "domain_classification": "Unknown", "message": "San Luis Obispo County District Attorney Dan Dow announced Tuesday the sentencing of a Visalia man who led county law enforcement on a chase during a 2023 crime spree.\nJoshua Lee Arnold was sentenced to serve 26 years plus 28 years to life in prison for attempted murder and assault with a handgun during a crime spree.\nIt happened on August 17, 2023, when at approximately 1:00 pm, Arnold attempted to rob a clerk at a 7-Eleven in Grover Beach.\nMultiple agencies assisted in the investigation, including the Grover Beach Police Department, the San Luis Obispo County Sheriff’s Office, the San Luis Obispo Police Department, and the San Luis Obispo County District Attorney’s Office Bureau of Investigation.\nOn April 9, 2024, Arnold pleaded no contest to three counts of attempted murder with deliberation and premeditation, and two counts of assault with a semiautomatic firearm."}, {"id": "9f40efcb-22fc-4521-b157-2e81954ff0e1", "title": "Charges filed in series of CTA Green Line attacks – NBC Chicago", "date": "2024-06-12 04:30", "url": "https://www.nbcchicago.com/news/local/south-loop-man-charged-in-3-cta-green-line-attacks/3461438/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "A South Loop man remains jailed on attempted murder and battery charges in connection with several attacks on CTA passengers.\nWeldon faces three felony charges in connection with that attack: attempted murder, aggravated battery in a public place and aggravated battery causing great bodily harm.\nOn the same day, Weldon allegedly attacked two more passengers at the CTA Green Line Bronzeville stop, 16 E. 35th St.\nWeldon punched another man in the face at the Bronzeville station as the man was trying to get on a train, prosecutors allege.\nTwo felony counts each of aggravated battery in a public place and aggravated battery were filed in those attacks."}, {"id": "2b66a011-ad9f-4cec-8c9f-8bd514d905a3", "title": "Third Terror Attack in Jammu In 48 Hours : Police And Army Joint Naka In Doda Latest Target Of Ultras", "date": "2024-06-12 02:30", "url": "https://www.timesnownews.com/india/terrorists-open-fire-at-police-and-armys-joint-naka-in-doda-3rd-incident-in-jammu-in-48-hours-article-110924101", "domain": "timesnownews.com", "domain_classification": "Unknown", "message": "The terror attack in Chattergala in J&K’s Doda district was reported within hours of a attack by the ultras at a village near the International Border (IB) in Kathua district.\nJammu: Terrorists opened fire at a police and army team in Jammu and Kashmir's Doda district on Wednesday midnight - the third terror incident in the region in a span of 48 hours.\nThe police and army team at the joint naka promptly retaliated to their fire and killed a terrorist, officials said.\nThe terror attack in Chattergala in J&K’s Doda district was reported within hours of an attack by the ultras at a village near the International Border (IB) in Kathua district.\nIt was the first major attack near the Pir Panjal range since 2003, when it witnessed a high peak of terror activities."}, {"id": "9aaf6141-43fe-4a8f-a154-da4312d17215", "title": "Tops gunman lawyers file to exempt him from the death penalty", "date": "2024-06-12 02:45", "url": "https://www.wrvo.org/2024-06-11/tops-gunmans-lawyers-file-to-exempt-him-from-the-death-penalty", "domain": "wrvo.org", "domain_classification": "Unknown", "message": "Attorneys representing the Tops massacre gunman are trying to exempt their client from the death penalty.\nIn a separate federal case, the Department of Justice filed a notice to seek the death penalty for Gendron back in January.\nBut lawyers representing Gendron argue he should be exempt from that punishment on account of his age at the time of the alleged capital crimes.\nGendron was 18 years old at the time of the attack, and so meets the minimum legal age limit to face the death penalty when tried for capital offences in the U.S..\nTherefore - his lawyers argue - the government should be barred from seeking the death penalty in the case."}, {"id": "63982477-bd06-46f4-b06e-81f54c6df950", "title": "Tops gunman lawyers file to exempt him from the death penalty", "date": "2024-06-12 03:45", "url": "https://www.wbfo.org/2024-06-11/tops-gunmans-lawyers-file-to-exempt-him-from-the-death-penalty", "domain": "wbfo.org", "domain_classification": "Unknown", "message": "Attorneys representing the Tops massacre gunman are trying to exempt their client from the death penalty.\nIn a separate federal case, the Department of Justice filed a notice to seek the death penalty for Gendron back in January.\nBut lawyers representing Gendron argue he should be exempt from that punishment on account of his age at the time of the alleged capital crimes.\nGendron was 18 years old at the time of the attack, and so meets the minimum legal age limit to face the death penalty when tried for capital offences in the U.S..\nTherefore - his lawyers argue - the government should be barred from seeking the death penalty in the case."}, {"id": "7d055472-5b61-43b4-82d3-858d07fa31b9", "title": "Stabbing Case : Stabbing case : One more held | Mangaluru News", "date": "2024-06-12 04:00", "url": "https://timesofindia.indiatimes.com/city/mangaluru/stabbing-case-one-more-held/articleshow/110923550.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "We also published the following articles recently2 BJP workers stabbed in DK; 5 arrestedFive persons were arrested by Mangaluru City police for allegedly stabbing two BJP workers in the Konaje police limits.\n70-year-old man stabbed in 'revenge' in Delhi, accused heldAmit arrested for stabbing 70-year-old over maid's mistreatment.\nAs part of the procession held to celebrate the swearing-in ceremony of Prime Minister Narendra Modi, the BJP workers raised provocative statements near an auto stand in Boliyar, which was also circulated on social media.\nThe police have booked cases against those who stabbed and also against those who raised provocative slogans.\nThe provocative slogans referred to Muslims as Pakistanis and hurt their sentiments,” he said.Notices have also been served to the suspects who are still absconding."}, {"id": "77d6bd97-f894-48eb-a913-182e196d0623", "title": "WATCH : Alleged Mountain View  don  gunned down on Windward Road", "date": "2024-06-12 00:15", "url": "https://www.jamaicaobserver.com/2024/06/11/alleged-mountain-view-don-gunned-windward-road/", "domain": "jamaicaobserver.com", "domain_classification": "Unknown", "message": "KINGSTON, Jamaica – An alleged ‘don’ was killed in a brazen afternoon shooting on Windward Road on Tuesday.\nObserver Online understands that the deceased, identified thus far by his alias, ‘Dangles, hailed from Mountain View.\nHe was reportedly gunned down in an attack carried out by armed motorcyclists.\nAccording to eyewitness, two men drove up alongside the vehicle the now-deceased was travelling and opened fire.\nThe vehicle then crashed into an embankment in the area."}, {"id": "094b625f-c3e0-4e1e-9009-528d48f32cff", "title": "China arrests a man in connection to stabbing of 4 U . S . college instructors", "date": "2024-06-12 01:45", "url": "https://news.wjct.org/national-news/2024-06-11/china-arrests-a-man-in-connection-to-stabbing-of-4-u-s-college-instructors", "domain": "news.wjct.org", "domain_classification": "Unknown", "message": "Four U.S. instructors from a college in Iowa were injured in a stabbing in China, Chinese authorities said.\nPolice in the northeastern Chinese province of Jilin said on Tuesday the four victims are receiving medical care for non-life-threatening wounds and that they arrested a man in connection to the stabbing.\nThe four instructors were visiting China from Cornell College, a small private liberal arts college in Mount Vernon, Iowa, which has had an academic partnership with Beihua University in Jilin since 2018.\nOne of the stabbing victims, David Zabner, spoke to NPR member station Iowa Public Radio from a hospital about the incident.\nBut analyst say that anti-Western sentiment in China, bolstered by growing nationalism and COVID-era restrictions, has been growing in recent years."}, {"id": "c01901c6-a1d8-4d08-bf8d-deeb6b126da7", "title": "US to provide another Patriot system to Ukraine : Report", "date": "2024-06-12 04:30", "url": "https://www.prokerala.com/news/articles/a1538816.html", "domain": "prokerala.com", "domain_classification": "Unknown", "message": "US to provide another Patriot system to Ukraine: Report.\nImage Source: IANS NewsWashington, June 12 : US President Joe Biden is planning to make another Patriot air defence system available to Ukraine to fend off Russian aerial attacks, the media reported, citing unnamed US government sources.\nBiden took the decision following several high-level meetings last week, the New York Times reported on Tuesday.\nAccording to the New York Times, the system in question is in Poland and could be deployed to the front line in Ukraine within days.\nIf confirmed it would be the second US-made Patriot system provided to Kiev by Washington."}, {"id": "539782e4-da6e-4b79-be79-692fa4fc2bd4", "title": "US To Provide Another Patriot System To Ukraine : Report", "date": "2024-06-12 02:45", "url": "https://menafn.com/1108322504/US-To-Provide-Another-Patriot-System-To-Ukraine-Report", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- IANS) Washington, June 12 (IANS/DPA) US President Joe Biden is planning to make another Patriot air defence system available to Ukraine to fend off Russian aerial attacks, the reported, citing unnamed US sources.\nBiden took the decision following several high-level meetings last week, the New York Times reported on Tuesday.\nAccording to the New York Times, the system in question is in Poland and could be deployed to the front line in Ukraine within days.\nIf confirmed it would be the second US-made Patriot system provided to Kiev by Washington.\nGermany has also provided Ukraine with two such systems and pledged to send another one."}, {"id": "b2288f6a-1c06-4b6f-abc7-f59e6165f3bb", "title": "Metal Gear Solid Fans Love the New Game Battle Damage Feature", "date": "2024-06-12 04:15", "url": "https://comicbook.com/gaming/news/metal-gear-solid-delta-snake-eater-damage-system-ps5-xbox-pc/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "One of the most notable partner showcases was Konami's Metal Gear Solid Delta: Snake Eater.\nMetal Gear Solid Delta: Snake Eater Battle Damage UpgradeOne of the big additions Konami made with the original Metal Gear Solid 3: Snake Eater was the battle damage system.\nWith Metal Gear Solid Delta, the team is taking that system one step further to finally show some of that damage.\nTouches like this have fans very excited to play Metal Gear Solid Delta: Snake Eater.\nMetal Gear Solid Delta: Snake Eater launches later this year on PlayStation 5, Xbox Series X/S, and PC"}, {"id": "8bd4dfb6-25ce-4916-bb22-2b726f69f4b7", "title": "World War II : Secrets from Above - National Geographic Channel HD", "date": "2024-06-12 04:15", "url": "https://www.tvguide.co.uk/schedule/ac4a1d71-7c6f-53ef-b863-c7b70d735b0d/world-war-ii-secrets-from-above", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "World War II: Secrets from AboveNational Geographic Channel HD 10:00 AM to 11:00 AM Wednesday 12 June Share Add toCalendar +Battle of Britain Season 2 Episode 1 of 6 S Subtitles Audio DescriptionThe Battle of Britain from a unique aerial perspective, as over 1500 British and German planes engage in a duel to the death above EnglandWorld War II: Secrets from Above airs on National Geographic Channel HD at 10:00 AM, Wednesday 12 June .\n(Subtitles, audio description.)\nLearn more about World War II: Secrets from Above and other education/science/factual topics on our factual page"}, {"id": "f5653859-08c9-4d39-94de-fbee86d308f4", "title": "Enemies are attacking Israel from all sides , but there hope | WND", "date": "2024-06-12 01:30", "url": "https://www.wnd.com/2024/06/enemies-attacking-israel-sides-hope/", "domain": "wnd.com", "domain_classification": "Unknown", "message": "One cannot negotiate with those who are solemnly sworn to the destruction of the Jewish State of Israel and the annihilation of Jewish people.\nOn that very first day, Biden – by removing sanctions – allowed the Iranian régime to sell its oil.\nOn his first day, Biden also stopped the Keystone Pipeline so America could no longer export oil, robbing America of its energy independence.\nDo these countries fail to remember that the charter of this proposed Palestinian state will call for the destruction of the Jewish state of Israel?\nWith so many enemies attacking Israel at the same time and Iran very close to achieving its goal of a nuclear weapon, we may be frightened for the survival of the Jewish State of Israel."}, {"id": "3dd39058-6671-40dd-9169-da9d7f9dada3", "title": "Assassin Creed Shadows 13 - min . walkthrough shows combat & more", "date": "2024-06-12 01:15", "url": "https://www.androidheadlines.com/2024/06/assassins-creed-shadows-13-min-walkthrough-shows-combat-more.html", "domain": "androidheadlines.com", "domain_classification": "Unknown", "message": "Assassin’s Creed Shadows is due out on November 15, but Ubisoft saw fit to give players a taste of the game early through a 13-minute extended walkthrough.\nFor players eager to step into the role of Naoe and Yasuke, the extended gameplay walkthrough is a must-watch.\nUbisoft discusses more of this world in a developer insight video which it released alongside the extended gameplay walkthrough.\nMost of this video is just Dansereau alongside Game Director Charles Benoit breaking down the extended gameplay walkthrough.\nAssassin’s Creed Shadows launches on November 15 for PC via Ubisoft Connect, and Ubisoft+ Premium members will be able to play the game through that service."}, {"id": "6e5cb4ca-a363-4ea9-bc57-369dbe27b799", "title": "Ukraine war briefing : Washington clears Azov brigade for US weapons and training", "date": "2024-06-12 03:00", "url": "https://www.theguardian.com/world/article/2024/jun/12/ukraine-war-briefing-washington-clears-azov-brigade-for-us-weapons-and-training", "domain": "theguardian.com", "domain_classification": "International", "message": "The US has lifted a ban on providing weapons and training to Ukraine’s Azov Brigade, which had far-right roots but proved key to the defence of the major port city of Mariupol.\nAzov was absorbed into Ukraine’s national guard as the 12th Special Forces Brigade and current members reject accusations of extremism and ties with far-right movements.\nUS law prohibits providing equipment and training to foreign military units or individuals suspected of committing gross human rights violations.\n“This is a new page in our unit’s history,” the Azov Brigade said in a statement.\nSpeaking in Madrid recently, Ukraine’s president, Volodymyr Zelenskiy, said Ukraine needed another seven Patriot systems to defend against Russian strikes."}, {"id": "b12eaeb6-5405-46c4-afd0-27e4dc9b9010", "title": "Bizarre psychological warfare using K - pop and trash balloons raises tensions between the 2 Koreas | News , Sports , Jobs", "date": "2024-06-12 01:45", "url": "https://www.standard.net/top-headlines/2024/jun/11/bizarre-psychological-warfare-using-k-pop-and-trash-balloons-raises-tensions-between-the-2-koreas/", "domain": "standard.net", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — Mammoth South Korean loudspeakers blaring BTS music.\nSmall South Korean civilian leaflets slamming North Korean leader Kim Jong Un.\nNorth Korean broadcasts in the past revolved mainly around praising its system and harsh censuring of South Korea.\nThey said past North Korean broadcasts from its loudspeakers were not clearly audible in South Korean areas.\nSouth Korean military said it’s ready to launch immediate, strong retaliation if attacked."}, {"id": "68a6e950-6d43-4d62-8507-4a0e62e0c620", "title": "Depressing : US Soldiers More Likely to Die by Suicide Than in Combat", "date": "2024-06-12 02:00", "url": "https://hotair.com/jazz-shaw/2024/06/11/depressing-us-soldiers-more-likely-to-die-by-suicide-than-in-combat-n3790070", "domain": "hotair.com", "domain_classification": "Unknown", "message": "One of the most alarming statistics reveals that U.S. soldiers were more likely to die by suicide than from combat industries.\nSoldiers were nine times more likely to die in that manner.\nThe suicide figures from 2019 predate some Army and Pentagon initiatives to combat suicide, including a workforce that addresses harmful behaviors like alcohol abuse that can contribute to deaths by suicide.\nIn one sense, the ratio of suicides to combat deaths is probably not an ideal indicator.\nAfter all, we're no longer actively involved in any hot wars (at least for the moment) so the rate of combat deaths should be lower."}, {"id": "404ac342-3b4e-4c2a-8a38-c78656465574", "title": "Chinese armed forces have been upgrading . India must keep up", "date": "2024-06-12 02:45", "url": "https://indianexpress.com/article/opinion/columns/chinese-armed-forces-have-been-upgrading-india-must-keep-up-9386658/", "domain": "indianexpress.com", "domain_classification": "Unknown", "message": "This was a test of the interplay between Command and Control (C2) and ground-based air defence units.\nAt the same time, the WTC air forces have their long-range surface-to-air missile installations.\nThe WTC is enabling PLA ground and air forces to combine air defence systems.\nIn light of this, India is investing in its own indigenous Very Short-Range Air Defence Systems (VSHORADS) and Man-Portable Air Defence Systems (MANPADS) to expand Army Air Defence (AAD) capabilities.\nOver the years, anti-aircraft artillery units along with ground-to-air missile units, have become the backbone of the WTC’s air defence capabilities."}, {"id": "a65dc578-2f4b-405d-bc15-0bf5064c44d4", "title": "Biden Still Thinks He Can Win a Civil War", "date": "2024-06-12 01:00", "url": "https://redstate.com/brandon_morse/2024/06/11/biden-still-thinks-he-can-win-a-civil-war-n2175345", "domain": "redstate.com", "domain_classification": "Unknown", "message": "AdvertisementThis is why when I see our quickly deteriorating president fantasizing or commenting about matters pertaining to a civil war, I get a sinking feeling.\nLet's say that Biden declared war against a group of people for refusing to comply with his rule.\nFirstly, if Biden thinks he's going to have the manpower to wage war against the American people, he's horrifically mistaken:Let’s start with logistics.\nBiden wouldn't have any F-15s because he'd likely have no one to fly them.\nAdvertisementThere is no scenario where Biden wins a civil war, and he should wipe that smirk off his face when discussing it."}, {"id": "1bdf1121-c5c6-47bd-b245-45f796a902dd", "title": "Democracy Under Siege . Ursula Von der Leyen and Dr . Egon Cholakian on Combating Hybrid Warfare and Disinformation", "date": "2024-06-12 03:30", "url": "https://www.reviewjournal.com/bp/business/democracy-under-siege-ursula-von-der-leyen-and-dr-egon-cholakian-on-combating-hybrid-warfare-and-disinformation/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "Today, the need for immediate action to defend democracy is not just a […]The upcoming European Parliament elections are set for June 6-9.\nToday, many experts agree that democracy faces hybrid warfare, which includes elements of information warfare and economic and political manipulations.\nIn his latest analytical video report, Dr. Egon Cholakian presents the results of an extensive 30-year investigation into this issue and discusses the existence of a hidden anti-democratic entity within democratic countries.\nThe report explores disinformation methods using the example of a deliberate 10-year campaign aimed at discrediting the ALLATRA International Public Movement.\nUrsula von der Leyen proposes creating a European Democratic Shield, which will identify and eliminate online disinformation based on the EU’s digital rules and the Digital Services Act."}]