[{"id": "350caea0-1f08-4961-a60f-c815d3454b52", "title": "Israel airstrikes : Hezbollah announces death of four members", "date": "2024-08-21 04:15", "url": "https://www.siasat.com/israel-airstrikes-hezbollah-announces-death-of-four-members-3082380/", "domain": "siasat.com", "domain_classification": "Unknown", "message": "The militant group based out of Lebanon has in a statement that four of its members were killed “On the road to Jerusalem” — its term for its operatives and cadres killed in Israeli strikes.\nMeanwhile, Lebanon’s health ministry in a statement early Wednesday said that Israeli strikes in the country’s east killed one person and wounded 19 others.\nIt may be recalled that Hezbollah chief Hassan Nasrallah had announced heavy attacks on Israel following the assassination of its military head, Fuad Shukr on July 30.\nHezbollah has been attacking Israel from the northern area while Hamas attacked it from the southern area near the Gaza Strip.\nIsrael has been maintaining that both Hezbollah and Hamas were the proxies of the Islamic Republic of Iran."}, {"id": "8278bf0f-c5c1-4cce-9de3-97cdf010fdaa", "title": "King Charles visits Southport after dance class stabbing", "date": "2024-08-21 00:30", "url": "https://www.9news.com.au/world/king-charles-meets-southport-stabbing-attack-survivors-london/7b74f6e9-4c81-49a7-ada1-d4698c994a6e", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "After the meeting, Charles signed the book of condolence at Southport Town Hall, adding, \"In deepest sympathy.\"\nBritain's King Charles III looks at the tributes outside Southport Town Hall.\nBut in Southport, the community has focused on the three young girls who lost their lives in the attack: Bebe King, 6, Elsie Dot Stancombe, 7, and Alice Dasilva Aguiar, 9.\nREAD MORE: Ten killed in Gaza school strike after six dead hostages recovered ﻿Alice Dasilva Aguiar, nine; Bebe King, six; and Elsie Dot Stancombe, seven, weren named as the victims of the stabbing attack in Southport.\n(Supplied)Crowds cheered the king outside Southport Town Hall, where mourners have placed bunches of flowers and cuddly toys in tribute to the slain children."}, {"id": "04458324-2373-4089-9976-e8f0460cd0c9", "title": "Xinhua world news summary at 0030 GMT , Aug . 21", "date": "2024-08-21 01:45", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-08/21/content_117378725.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "(Malawi-Plane Crash)- - - -GAZA -- At least nine people were killed in an Israeli airstrike on a market in Deir al-Balah in the central Gaza Strip, Palestinian sources said Tuesday.\nPalestinian security sources told Xinhua that an Israeli aircraft launched at least one missile at the market, which was packed with shoppers.\n(Gaza Strip-Israeli Attack-Casualty)- - - -PRAGUE -- A bus and a lorry collided Tuesday in western Slovakia, leaving seven people injured, local media reported.\nThe accident occurred near the village of Turna in the Kosice region Tuesday afternoon.\nKP.3.1.1, of the Omicron family, is among many currently co-circulating JN.1-derived variants in the United States."}, {"id": "a598cd46-38fa-4063-9964-d77608bb8156", "title": "Israel recovers bodies of 6 hostages from Gaza as Blinken pushes cease - fire deal", "date": "2024-08-21 02:15", "url": "https://www.ksby.com/world/israel-at-war/israel-recovers-bodies-of-6-hostages-from-gaza-as-blinken-tries-to-advance-cease-fire-deal", "domain": "ksby.com", "domain_classification": "Unknown", "message": "The military said its forces recovered the bodies in an overnight operation in southern Gaza, without saying when or how the six died.\nAnother strike killed a mother and her five children in central Gaza.\nThe recovery of the remains is a blow to Hamas, which hopes to exchange hostages for Palestinian prisoners, an Israeli withdrawal and a lasting cease-fire.\nOver 100 hostages were released in exchange for Palestinians imprisoned in Israel during a weeklong cease-fire last year.\nAn Israeli airstrike in central Gaza killed five children and their mother, according to the nearby Al-Aqsa Martyrs Hospital, where an Associated Press reporter counted the bodies."}, {"id": "d0f26f81-10f7-4753-8001-eca84a6346c0", "title": "9 killed by Israeli airstrike at school in Gaza City - People Daily Online", "date": "2024-08-21 02:15", "url": "http://en.people.cn/n3/2024/0821/c90000-20208197.html", "domain": "en.people.cn", "domain_classification": "Unknown", "message": "9 killed by Israeli airstrike at school in Gaza CityXinhua) 08:58, August 21, 2024People search for victims among the rubble of a school building destroyed in an Israeli airstrike at the al-Rimal neighborhood in Gaza City, on Aug. 20, 2024.\nAt least nine Palestinians were killed, and others were wounded in an Israeli airstrike on a school sheltering displaced people in Gaza City, Palestinian security and medical sources said Tuesday.\nAt least nine Palestinians were killed, and others were wounded in an Israeli airstrike on a school sheltering displaced people in Gaza City, Palestinian security and medical sources said Tuesday.\nAt least nine Palestinians were killed, and others were wounded in an Israeli airstrike on a school sheltering displaced people in Gaza City, Palestinian security and medical sources said Tuesday.\nAt least nine Palestinians were killed, and others were wounded in an Israeli airstrike on a school sheltering displaced people in Gaza City, Palestinian security and medical sources said Tuesday."}, {"id": "77710d11-8681-427b-820b-ee031bb92e89", "title": "It Was a Local Cop Who Stopped Crooks in Butler", "date": "2024-08-21 00:15", "url": "https://hotair.com/david-strom/2024/08/20/it-was-a-local-cop-who-stopped-crooks-in-butler-n3793401", "domain": "hotair.com", "domain_classification": "Unknown", "message": "It was a local cop who stopped the shooting and disabled the weapon of Thomas Matthew Crooks.\n“He stopped Crooks and importantly, I believe the shot damaged the buffer tube on Crooks’ AR,” Higgins added, citing eyewitness testimony.\nIf the cop hadn't shot Crooks' gun, the president might have been killed, or many other bystanders.\nThe complete and utter failure of the Secret Service to do even the minimum necessary to provide more than protection theater is puzzling.\nThe more we hear--and it is remarkably little so far, shockingly--the worse the Secret Service sounds and the better the local law enforcement folks do."}, {"id": "21cdd5c7-95bd-4d20-bf43-8497904c6085", "title": "Like a Liberation Army – Resistance Roundup – Day 319", "date": "2024-08-21 01:00", "url": "https://www.palestinechronicle.com/like-a-liberation-army-resistance-roundup-day-319/", "domain": "palestinechronicle.com", "domain_classification": "Unknown", "message": "The new tactics suggest that the Palestinian Resistance now behaves as a unified liberation army, as opposed to various Resistance groups that may coordinate but ultimately operate independently.\nThe Brigades said that the operation was carried out in conjunction with the Al-Qassam Brigades, the military wing of Hamas.\nThe footage showed the targeting of Israeli vehicles from inside demolished buildings, as well as the targeting of an Israeli military vehicle that had opened fire at Resistance fighters, before being hit.\nThe footage also showed a number of fighters from both groups firing mortar shells at Israeli soldiers and military vehicles penetrating into the camp.\nBelow are the latest statements by the two main Resistance forces in Gaza, and the Lebanese Resistance Movement Hezbollah."}, {"id": "a6cc68c1-3bd1-4069-9ccd-bf2a3c36ff5b", "title": "Blinken ends latest Mideast visit without a cease - fire", "date": "2024-08-21 01:30", "url": "https://www.stltoday.com/news/nation-world/blinken-mideast-cease-fire-israel-hamas/article_d9e35308-538d-5be0-b9a1-6a01e773e527.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "JERUSALEM — U.S. Secretary of State Antony Blinken ended his ninth visit to the Middle East since the war in Gaza began without securing a cease-fire deal, warning Tuesday that “time is of the essence” even as Hamas and Israel suggested challenges remain.\n\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nFew details were released about the so-called bridging proposal put forth by the U.S., Egypt and Qatar.\nIsraeli Prime Minister Benjamin Netanyahu, meanwhile, met with right-wing groups of families of fallen soldiers and hostages in Gaza.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "c088857b-c124-46e2-8f83-60a1cfcec03c", "title": "Russia and Ukraine Cant Mount Major Offensives Against Each Other , US Says", "date": "2024-08-21 01:00", "url": "https://www.yahoo.com/news/russia-ukraine-t-mount-major-214513871.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia and Ukraine Can’t Mount Major Offensives Against Each Other, US Says(Bloomberg) -- Ukraine and Russia both lack the military assets to mount major offensives against each other, the Pentagon’s intelligence agency said in new assessments that suggests the two sides are headed toward stalemate.\nThe Defense Intelligence Agency’s conclusions are included in the latest quarterly report on US assistance to Ukraine issued by the Pentagon’s inspector general, Robert Storch.\nSince then, Ukraine launched a surprise incursion into Russia’s Kursk region and has started to fly allied-provided F-16 fighters.\nA Ukrainian ATACMS missile strike on Sevastopol on May 18 sank a corvette.\nUkraine also used the system to strike Russian air defenses in Crimea, destroying several of the most advanced S-400 missile systems, the report noted."}, {"id": "e38bf01e-f352-4afb-a2ae-9f1d9c1bf3a7", "title": "King Charles III meets with survivors of stabbing rampage that fueled unrest across Britain", "date": "2024-08-21 02:15", "url": "https://isp.netscape.com/entertainment/story/0001/20240820/a8a71a32d537fa5fcb2299c1837a58d7", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "King Charles III meets with survivors of stabbing rampage that fueled unrest across BritainLONDON (AP) — King Charles III met Tuesday with survivors of the stabbing rampage that killed three young girls in northern England, viewing flowers and teddy bears laid in remembrance of the victims and signing a book of condolence as Britain recovers from widespread unrest fueled by misinformation around the tragedy.\nCrowds cheered the king outside Southport Town Hall, where mourners have placed bunches of flowers and cuddly toys in tribute to the slain children.\nAmong those meeting the monarch were Paige Whitby, Harriet Neal, Naomi Taylor, all 13, and 10-year-old Emie Todd.\n“We wanted to give out ice creams after the riot because the kids had all been terrified,″ Jenna Johnson said.\n“We wanted to give them something to come out of the house for.”The U.K.’s worst unrest in more than a decade led to some 1,100 arrests."}, {"id": "7b119cdd-f3dc-44f4-b035-e48eef25dfb1", "title": "King Charles III meets with survivors of stabbing rampage that fueled unrest across Britain", "date": "2024-08-21 02:15", "url": "https://isp.netscape.com/news/world/story/0001/20240820/a8a71a32d537fa5fcb2299c1837a58d7", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "King Charles III meets with survivors of stabbing rampage that fueled unrest across BritainLONDON (AP) — King Charles III met Tuesday with survivors of the stabbing rampage that killed three young girls in northern England, viewing flowers and teddy bears laid in remembrance of the victims and signing a book of condolence as Britain recovers from widespread unrest fueled by misinformation around the tragedy.\nCrowds cheered the king outside Southport Town Hall, where mourners have placed bunches of flowers and cuddly toys in tribute to the slain children.\nAmong those meeting the monarch were Paige Whitby, Harriet Neal, Naomi Taylor, all 13, and 10-year-old Emie Todd.\n“We wanted to give out ice creams after the riot because the kids had all been terrified,″ Jenna Johnson said.\n“We wanted to give them something to come out of the house for.”The U.K.’s worst unrest in more than a decade led to some 1,100 arrests."}, {"id": "6c07829f-1ee4-45b3-a7d6-55ecba1bf062", "title": "Mother mourns son allegedly killed by man with three prior murder charges", "date": "2024-08-21 01:45", "url": "https://wjla.com/news/local/man-stabbed-killed-parking-lot-suitland-maryland-chris-woodland-nelson-ford-first-degree-murder-violent-past-pleaded-guilty-second-degree-murder-sondra-woodland-prince-georges-county-crime", "domain": "wjla.com", "domain_classification": "Unknown", "message": "Prince George’s police said her son, 41-year-old Chris Woodland, was murdered by 45-year-old Nelson Ford during a dispute.\nWhat makes the case highly unusual is that 7News has learned this is the fourth time Ford has been charged with murder.\nIn 2015 he was charged with murder for stabbing a man in Suitland.\nTuesday afternoon, a spokesperson for Prince George’s County State’s attorney Aisha Braveboy sent 7News this statement in response to our questions.\nAny other charges against Mr. Ford predated State’s Attorney Braveboy’s administration; therefore, we are unable to comment on any decisions or court actions taken in those cases,\" according to the statement."}, {"id": "0d3c76d1-1373-4dee-86a0-c4e1f6149086", "title": "Salem man dies following July stabbing", "date": "2024-08-21 01:00", "url": "https://www.kptv.com/2024/08/20/salem-man-dies-following-july-stabbing/", "domain": "kptv.com", "domain_classification": "Unknown", "message": "SALEM Ore. (KPTV) - A 19-year-old man has died from injuries sustained nearly a month ago in a stabbing at Wallace Marine Park, according to police.\nThe Salem Police Department says the attack occurred around 2:15 a.m. on the morning of July 27 at the park in west Salem.\nResponding officers found the victim, Salem resident Riley John Adams, with multiple stab wounds.\nPolice are investigating the attack as a homicide, but have not released any details regarding any potential suspects.\nAnyone with information concerning what transpired that Saturday morning and led to Adams’ death is asked to call the Salem Police Tips Line at 503‑588‑8477."}, {"id": "b8aaaa93-de1f-48a5-9168-3608c237040f", "title": "Ukraine war briefing : Russian PoWs from Kursk  abandoned by our command  | Ukraine", "date": "2024-08-21 01:30", "url": "https://www.theguardian.com/world/article/2024/aug/21/ukraine-war-briefing-russian-pows-from-kursk-abandoned-by-our-command", "domain": "theguardian.com", "domain_classification": "International", "message": "Ukraine has said large numbers of Russian servicemen – reportedly in the hundreds – gave themselves up during the Kursk offensive that began on 6 August.\nRussia has formed three new military groupings to bolster security in regions bordering Ukraine, the Russian defence minister, Andrei Belousov, has said.\nRussian air defence destroyed 45 drones that Ukraine launched overnight targeting Moscow and several other regions, Russia’s defence ministry said on Wednesday.\nEleven of the drones were destroyed over the Moscow region, 23 over the border Bryansk region, six over the Belgorod region, three over the Kaluga region and two over the Kursk region, the ministry said.\nThe Russian defence minister, Andrei Belousov, said on national TV that Russia was sending additional troops to the Pokrovsk region."}, {"id": "cfbe08c4-1536-4d59-b0ff-bf9af4142fb0", "title": "Blinken ends latest Mideast visit without a cease - fire warning  time is of the essence  ", "date": "2024-08-21 04:30", "url": "https://www.theweek.in/wire-updates/international/2024/08/21/fgn4-us-blinken-mideast.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nIsraeli Prime Minister Benjamin Netanyahu, meanwhile, met with right-wing groups of families of fallen soldiers and hostages in Gaza.\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "ca3dcb96-e5bd-414f-ad8c-a7cf6ad41374", "title": "Russia - Ukraine war : Kyiv launches  one of largest ever  drone attacks on Moscow : mayor", "date": "2024-08-21 04:00", "url": "https://www.smh.com.au/world/europe/kyiv-launches-one-of-largest-ever-drone-attacks-on-moscow-mayor-20240821-p5k44y.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Ukraine has launched one of the largest ever drone attacks on Moscow, the city’s mayor said, with Russian air defence units destroying at least 10 drones flying towards the capital on Wednesday.\nSome of the drones were destroyed over the city of Podolsk, Mayor Sergei Sobyanin said.\nThe city in the Moscow region is some 38 kilometres south of the Kremlin.\n“The air defence systems of the Defence Ministry continue to repel enemy UAV [unmanned aerial vehicles] attacks,” Sobyanin said on the Telegram messaging app at 4.43am (11.43am AEST).\n“This is one of the largest attempts to attack Moscow using drones ever."}, {"id": "31c6ac79-67ae-4644-847c-51c20337a520", "title": "Trump to hold first outdoor rally since assassination attempt", "date": "2024-08-21 01:45", "url": "https://www.yahoo.com/news/trump-hold-first-outdoor-rally-011847001.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Trump, who has held roughly a dozen indoor rallies since the shooting, has publicly stated he wants a return to open-air events.\nDays earlier, the 78-year-old Trump posted on social media that he would continue to hold open-air events, \"and the Secret Service has agreed to substantially step up their operation.\nSecurity was also airtight at last month's Republican National Convention, which took place in Milwaukee, Wisconsin just days after the assassination attempt.\nTrump is scheduled to take the stage at the North Carolina Aviation Museum & Hall of Fame, along with his running mate Senate J.D.\nThe southern state of North Carolina is considered one of a handful of swing states that are expected to determine the outcome of the November 5 election."}, {"id": "33b205bf-ee0c-4680-ad5c-9b92e90f58c5", "title": "Trump to hold first outdoor rally since assassination attempt", "date": "2024-08-21 04:30", "url": "https://www.thedailystar.net/news/world/usa/news/trump-hold-first-outdoor-rally-assassination-attempt-3682611", "domain": "thedailystar.net", "domain_classification": "Unknown", "message": "Donald Trump will hold a rally outdoors Wednesday in North Carolina, the former US president's first open-air campaign event since he narrowly escaped an assassination attempt at an open-air appearance one month ago.\nDays earlier, the 78-year-old Trump posted on social media that he would continue to hold open-air events, \"and the Secret Service has agreed to substantially step up their operation.\nSecurity was also airtight at last month's Republican National Convention, which took place in Milwaukee, Wisconsin just days after the assassination attempt.\nTrump is scheduled to take the stage at the North Carolina Aviation Museum & Hall of Fame, along with his running mate Senate J.D.\nThe southern state of North Carolina is considered one of a handful of swing states that are expected to determine the outcome of the November 5 election."}, {"id": "4ead87ed-015b-4f97-b780-d3f4cd600933", "title": "Russia - Ukraine war : Kyiv launches  one of largest ever  drone attacks on Moscow : mayor", "date": "2024-08-21 03:30", "url": "https://www.brisbanetimes.com.au/world/europe/kyiv-launches-one-of-largest-ever-drone-attacks-on-moscow-mayor-20240821-p5k44y.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Ukraine has launched one of the largest ever drone attacks on Moscow, the city’s mayor said, with Russian air defence units destroying at least 10 drones flying towards the capital on Wednesday.\nSome of the drones were destroyed over the city of Podolsk, Mayor Sergei Sobyanin said.\nThe city in the Moscow region is some 38 kilometres south of the Kremlin.\n“The air defence systems of the Defence Ministry continue to repel enemy UAV [unmanned aerial vehicles] attacks,” Sobyanin said on the Telegram messaging app at 4.43am (11.43am AEST).\n“This is one of the largest attempts to attack Moscow using drones ever."}, {"id": "77bf07a3-8f76-40e4-bc5b-0f07aaee20ac", "title": "Day 319 Update : Including Children , Israel Kills Dozens In Gaza", "date": "2024-08-21 01:30", "url": "https://imemc.org/article/day-319-update-including-children-israel-kills-dozens-in-gaza/", "domain": "imemc.org", "domain_classification": "Unknown", "message": "On Tuesday, Day 319 of the ongoing genocide, Israeli missiles and shells killed and injured dozens of Palestinians, including children and women, in several parts of the besieged, devastated, destroyed, and starved Gaza Strip.\nIn Deir Al-Balah, in central Gaza, the army fired missiles and shells at a market, killing at least eight Palestinians, mostly children and women, and wounding many more.\nMedical sources said that besides the slain and injured Palestinians, many remain under the rubble while the search continues to locate them despite limited means.\nFurthermore, ten Palestinians, including children and women, were killed, and others were wounded when Israeli warplanes bombed a school sheltering displaced people in the Rimal neighborhood west of Gaza City.\nIn northern Gaza, the army fired missiles at an apartment in Tal Az-Za’tar in the Jabalia refugee camp, killing and wounding many Palestinians, including children and women."}, {"id": "3a54c05f-167b-40da-aa8a-8ed44b42c4f4", "title": "School And Market Targeted As Israeli Genocide Escalates - Workers Revolutionary Party", "date": "2024-08-21 02:45", "url": "https://wrp.org.uk/news/school-and-market-targeted-as-israeli-genocide-escalates/", "domain": "wrp.org.uk", "domain_classification": "Unknown", "message": "‘BOMBARDMENT is overwhelming the entire Gaza Strip, with no respite since the early hours of this morning,’ Palestinians reported from Gaza yesterday.\nAt least nine Palestinians were killed in an Israeli airstrike on a market in Deir Al Balah in central Gaza yesterday afternoon, with children among the dead.\nAnother overnight attack on a car in northern Gaza killed at least four.\nIn central Gaza, the Israeli military destroyed a family house in the Bureij refugee camp without any warning, killing six Palestinians.\nEgypt has always rejected a permanent Israeli military presence in the Philadelphi Corridor as well as Israeli control over the Palestinian side of the Rafah crossing,’ Haridy said."}, {"id": "68cd8fd8-3e9a-4299-9d56-8d3f6341de28", "title": "", "date": "2024-08-21 00:30", "url": "http://www.israelnationalnews.com/news/394934", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Palestinian Arabs reported a \"work accident\" on Tuesday evening, after an explosive device went off on terrorists as they tried to plant it in the town of Tammun, located in the northern Jordan Valley.\nSuch “work accidents” occur from time to time , mostly in the Gaza Strip, when terrorists mishandle an explosive device .\nIn August of last year, an explosion ripped through a Hamas site in the central Gaza Strip, killing Ashraf Hussein, a member of Hamas’ military wing, the Qassam Brigades.\nLast week, a car with two terrorists inside exploded near Hebron , injuring the two terrorists as well as two additional people.\nIt appears the car contained explosives that were intended to be used against Israelis in a terror attack."}, {"id": "19fc8ecb-f321-42b2-b506-c0f2d86f00e7", "title": "", "date": "2024-08-21 01:30", "url": "https://www.israelnationalnews.com/news/394934", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Palestinian Arabs reported a \"work accident\" on Tuesday evening, after an explosive device went off on terrorists as they tried to plant it in the town of Tammun, located in the northern Jordan Valley.\nSuch “work accidents” occur from time to time , mostly in the Gaza Strip, when terrorists mishandle an explosive device .\nIn August of last year, an explosion ripped through a Hamas site in the central Gaza Strip, killing Ashraf Hussein, a member of Hamas’ military wing, the Qassam Brigades.\nLast week, a car with two terrorists inside exploded near Hebron , injuring the two terrorists as well as two additional people.\nIt appears the car contained explosives that were intended to be used against Israelis in a terror attack."}, {"id": "f3b4d42f-02cb-41de-8124-e6867d955ad3", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 03:30", "url": "https://komonews.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "komonews.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "976b47c8-b773-4288-a45d-c24e52549cee", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:45", "url": "https://www.wcti12.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "b60b7b53-61b8-45cc-bcd9-86bd9b1b1395", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 03:30", "url": "https://katu.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "katu.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "69b2337c-f937-44e3-9fdd-4a229932f834", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:15", "url": "https://wpde.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "wpde.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "174999ee-ad4a-4f83-a846-b584f6f314e3", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 00:15", "url": "https://wset.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "wset.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "f5597844-a0e7-4076-8af7-b72a9b494d44", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 01:45", "url": "https://wjla.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "wjla.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "585dbcb7-cd50-4be8-bfdc-23d0a62c2b78", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 03:30", "url": "https://wwmt.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "wwmt.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "fcaada91-efac-4c5f-ac46-2821499868a5", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:15", "url": "https://www.theday.com/nation/20240820/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence/", "domain": "theday.com", "domain_classification": "Unknown", "message": "U.S. Secretary of State Antony Blinken gestures as he departs for Egypt, in Tel Aviv, Israel, Aug. 20, 2024.\n(AP Photo/Ariel Schalit)U.S. Secretary of State Antony Blinken gestures as he departs for Egypt, in Tel Aviv, Israel, Aug. 20, 2024.\n(The Hostages Families Forum via AP)U.S. Secretary of State Antony Blinken walks after arriving at El-Alamein, Egypt, Tuesday, Aug.20, 2024.\n(Kevin Mohatt//Pool Photo via AP)U.S. Secretary of State Antony Blinken, left, meets with Egypt's Foreign Minister Badr Abdelatty in El-Alamein, Egypt, Tuesday, Aug. 20, 2024.\n(Kevin Mohatt/Pool Photo via AP)Israeli police officers move a demonstrator blocking a street during a protest, in Jerusalem, Tuesday, Aug. 20, 2024."}, {"id": "53a9a695-e55b-4123-ae4e-48fe5e054112", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 03:30", "url": "https://abc6onyourside.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "abc6onyourside.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "647fec90-cd0d-4641-9b07-607c720de7e6", "title": "Syrskyi reveals statistics : over 9 , 000 missiles and 14 , 000 drones fired by Russia since invasion began", "date": "2024-08-21 01:45", "url": "https://www.yahoo.com/news/syrskyi-reveals-statistics-over-9-000314659.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Syrskyi reveals statistics: over 9,000 missiles and 14,000 drones fired by Russia since invasion beganOn August 20, Ukrainian Armed Forces Commander-in-Chief Oleksandr Syrskyi reported that since the start of Russia's full-scale invasion, over 9,600 missiles and nearly 14,000 attack drones have been used against Ukraine.\nDuring a meeting of local and regional authorities, Syrskyi revealed that Ukrainian air defense has successfully destroyed more than 2,400 missiles and 9,200 drones.\nSyrskyi published statistics about the missile attacks and numbers, and he pointed out the various missile types used by Russian forces, including Kalibr, Dagger, and S-300/S-400 missiles.\nUkraine was primarily targeted with S-300/S-400 missiles, totaling 3,008 strikes.\nThe second most frequently used weapons were Kh-555/Kh-101 cruise missiles, with 1,846 recorded attacks."}, {"id": "07aab551-45b6-4ebe-aef3-df23b66fd88a", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:15", "url": "https://katv.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "katv.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "f342d0bc-2aa3-4f91-8935-746a9d7aaa69", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 04:15", "url": "https://www.wcyb.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "wcyb.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "c41434a8-0a8d-4bcc-a0a1-933576914f91", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 01:00", "url": "https://turnto10.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "turnto10.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "59d7ce65-8393-416e-b709-9ef9b6ab7d9c", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 01:30", "url": "https://kfdm.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "kfdm.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "bc0204ef-ea90-4dbb-b07e-b67a8e4228e6", "title": "Trial set for man accused of trying to kill Justice Kavanaugh", "date": "2024-08-21 04:15", "url": "https://gazette.com/news/wex/trial-set-for-man-accused-of-trying-to-kill-justice-kavanaugh/article_701afd1c-6e0f-54d1-aa58-bdaa33a11995.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "A federal judge scheduled a trial to start on June 9, 2025, for a California man charged with trying to assassinate Supreme Court Justice Brett Kavanaugh over two years ago.\nFollowing the leaked court opinion on the Dobbs v. Jackson Women's Health Organization case that overturned abortion protections, then-26-year-old Nicholas Roske traveled to Washington, D.C., to kill Kavanaugh and conservative justices, prosecutors allege.\nThe leaked court opinion sparked protesters to gather outside the homes of the conservative justices, whose addresses were also leaked online.\nRoske was arrested and charged with attempting to murder a justice of the United States, and he has pleaded not guilty.\nLast month, prosecutors asked to move the case forward with a trial date."}, {"id": "ff2a356a-bb90-4916-86d0-5d7329f564af", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:30", "url": "https://ktul.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "ktul.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "a9fdf4c9-835a-477a-8cc2-80266dedb568", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 01:00", "url": "https://cbs12.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "cbs12.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "ca393fea-3a41-4208-958c-a99adbd7e834", "title": "Ukraine launches drone attack on Moscow , other regions , Russian officials say", "date": "2024-08-21 02:30", "url": "https://economictimes.indiatimes.com/news/defence/ukraine-launches-drone-attack-on-moscow-other-regions-russian-officials-say/articleshow/112667289.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelUkraine launched a widespread drone attack on Russia on Wednesday, with air defence units destroying three drones some 38 kms (24 miles) south of the Kremlin, and 15 over the border Bryansk region, Russian officials said.The three attack drones heading towards Moscow were downed over the city of Podolsk in the Moscow region, Moscow's Mayor Sergei Sobyanin said on the Telegram messaging app.\n\"According to preliminary data, there is no damage or casualties at the site where the debris fell,\" Sobyanin said.There were also no casualties or damage reported in the aftermath of the drone attack on the border Bryansk region in Russia's southwest, Alexander Bogomaz, the governor of the region wrote on Telegram.Russia's RIA state news agency reported also that two drones were destroyed over the Tula region, which borders the Moscow region to its north.Separately, Vasily Golubev, governor of the Rostov region in Russia's southwest, said that air defence forces destroyed a Ukraine-launched missile over the region, with no injuries reported.It was not clear how many drones and missiles in total Ukraine launched.Reuters could not independently verify the reports.\nThere was no immediate comment from Ukraine.In recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow's war efforts.\nIt also says that its attacks are in response to Russia's continued strikes on Ukrainian territory."}, {"id": "7d4eeaac-4e51-4f2b-a017-ba002354b6f5", "title": "Ukraine launches drone attack on Moscow , other regions , Russian officials say", "date": "2024-08-21 02:30", "url": "https://www.theglobeandmail.com/world/article-ukraine-launches-drone-attack-on-moscow-other-regions-russian/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "Ukraine launched one of the largest ever drone attacks on Moscow on Wednesday, the city’s mayor said, with Russian air defence units destroying at least 10 drones flying towards the capital.\nThe city in the Moscow region is some 38 kilometres south of the Kremlin.\n“This is one of the largest attempts to attack Moscow using drones ever.\nRussian officials rarely disclose the full size of the attacks, reporting only drones that its air defence units destroy.\nIn recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow’s war efforts."}, {"id": "ee722c40-b6fd-4d37-9d61-16d6df97b364", "title": "Ukraine launches drone attack on Moscow , other regions , Russian officials say", "date": "2024-08-21 02:15", "url": "https://www.thestar.com.my/news/world/2024/08/21/ukraine-launches-drone-attack-on-moscow-other-regions-russian-officials-say", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "(Reuters) -Ukraine launched one of the largest ever drone attacks on Moscow on Wednesday, the city's mayor said, with Russian air defence units destroying 11 drones flying towards the capital.\nThe city in the Moscow region is some 38 kms (24 miles) south of the Kremlin.\n\"This is one of the largest attempts to attack Moscow using drones ever,\" Sobyanin said on the Telegram messaging app at 4:43 a.m. (0143 GMT).\nThe Russia defence ministry did not mention neither Tula nor Rostov in its statement listing destroyed air weapons.\nIn recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow's war efforts."}, {"id": "e04fb29e-3aa0-4b33-ac24-569b414e3654", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:15", "url": "https://fox11online.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "f09b7a4e-3b47-4348-a857-a0fa2d045a2e", "title": "Ceasefire elusive as Blinken leaves Middle East , with future Israeli presence in Gaza key sticking point", "date": "2024-08-21 01:30", "url": "https://www.theguardian.com/world/article/2024/aug/21/israel-hamas-ceasefire-deal-negotiations-antony-blinken-middle-east", "domain": "theguardian.com", "domain_classification": "International", "message": "US secretary of state Antony Blinken said that “time is of the essence” to secure a Gaza ceasefire, as he wrapped up a Middle East tour with an agreement between Israel and Hamas still elusive.\n“The United States does not accept any long-term occupation of Gaza by Israel,” Blinken said.\n“More specifically, the agreement is very clear on the schedule and the locations of [Israel Defense Forces] withdrawals from Gaza, and Israel has agreed to that.\nSome relatives told Israeli media that Netanyahu told them Israel will not abandon two strategic corridors in Gaza, the Philadelphi and Netzarim corridors.\nA White House spokesperson rejected as “totally untrue” that Netanyahu had told Blinken that Israel would never leave the Philadelphi and Netzarim corridors."}, {"id": "a00d0eee-5b24-437f-bea5-6d4502602299", "title": "Chicago police prepare for more protests on day 2 of the DNC", "date": "2024-08-21 00:30", "url": "https://www.yahoo.com/news/chicago-police-prepare-more-protests-222255309.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Protestors clash with police amid rally outside Israeli Consulate on day 2 of DNCCHICAGO — Protestors in the West Loop confronted police on Tuesday night during a demonstration outside the Israeli Consulate.\nBecause of the protests, Amtrak Police have closed off access to Chicago Union Station from Madison Street.\nConsulate General of Israel to the MidwestThe first day of the DNC also saw protests inside and outside of the United Center.\n(Myung J. Chun/Los Angeles Times via Getty Images)DNC CHICAGO, IL AUGUST 19, 2024 Pro-Palestine protesters at Union Park on Monday, August 19, 2024 in Chicago, IL.\n(Myung J. Chun/Los Angeles Times via Getty Images)DNC CHICAGO, IL AUGUST 19, 2024 Pro-Israel supporters demonstrate near pro-Palestine protesters (left) at Union Park on Monday, August 19, 2024 in Chicago, IL."}, {"id": "75cce189-72b7-4fc5-b630-0e7bb83329de", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 02:15", "url": "https://upnorthlive.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "upnorthlive.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "2e1d3a2a-b61e-4b46-ac0c-1f6af7b95dc5", "title": "Ukraine launches drone attack on Moscow , other regions , Russian officials say", "date": "2024-08-21 03:15", "url": "https://www.swissinfo.ch/eng/ukraine-launches-drone-attack-on-moscow,-other-regions,-russian-officials-say/87315074", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Ukraine launches ‘one of largest ever’ drone attacks on Moscow, mayor says3 minutesBy Lidia Kelly(Reuters) -Ukraine launched one of the largest ever drone attacks on Moscow on Wednesday, the city’s mayor said, with Russian air defence units destroying at least 10 drones flying towards the capital.\nThe city in the Moscow region is some 38 kms (24 miles) south of the Kremlin.\n“This is one of the largest attempts to attack Moscow using drones ever.\nRussian officials rarely disclose the full size of the attacks, reporting only drones that its air defence units destroy.\nIn recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow’s war efforts."}, {"id": "508160e7-ee36-4d32-9e4f-2a42a0bac72e", "title": "Is God Protecting Trump ? ", "date": "2024-08-21 04:15", "url": "https://newswithviews.com/is-god-protecting-trump/", "domain": "newswithviews.com", "domain_classification": "Unknown", "message": "Even the “conservative” channels focus on this, suggesting that President Trump take a different tack.\nYet, our media would prefer to drop this subject, when it should be the defining issue of the campaign.\nThe new issue of The Trumpet has a very interesting article on official federal involvement in the attempted murder of President Trump, an issue that must be front and center in this campaign.\nAs disturbing as this notion is, nothing makes sense unless someone on the inside wants Trump dead.\nAs more of these details come out, the more improbable it is that the Trump assassination attempt was merely a series of independent “innocent” mistakes."}, {"id": "ca5dec7c-1b1d-40cb-9020-d5c447347048", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 03:30", "url": "https://khqa.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "khqa.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "afa460ee-7b38-4038-b506-d29dcc030201", "title": "John Barrasso easily wins Wyoming GOP Senate primary", "date": "2024-08-21 02:45", "url": "https://www.foxnews.com/politics/john-barrasso-easily-wins-wyoming-gop-senate-primary", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Wyoming Sen. John Barrasso on Tuesday defeated a Republican primary challenger, setting up a battle for a third term in November.\nBarrasso, currently the chair of the Senate Republican Conference, the third-ranking position among Senate Republicans, and a ranking member of the Senate Energy and Natural Resources Committee, defeated Reid Rasner, a financial adviser.\nBarrasso made headlines recently for criticizing the Secret Service after the assassination attempt of former President Donald Trump.\nSEN. JOHN BARRASSO CALLS SECRET SERVICE CONFERENCE CALL A '100% COVER-YOUR-A--' BRIEFINGCLICK HERE TO GET THE FOX NEWS APPIn January, Barrasso's wife lost her battle with brain cancer.\n\"After a courageous battle with cancer, Bobbi is now at peace and at home with the Lord,\" Barrasso said in a statement."}, {"id": "58aa873c-2199-4ce1-92e8-bc338bea9364", "title": "Drone wreckage found in Romanian town near Ukrainian border", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/drone-wreckage-found-romanian-town-231155093.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Drone fragments were discovered in Romania near its border with Ukraine, specifically in the area around the village of Periprava, Tulcea county.\nThe discovery follows a recent Russian drone and missile attack on Ukraine, during which Ukrainian forces shot down several air targets.\nThis is not the first time drone debris has been found in Romania, with NATO previously stating that these incidents are irresponsible and dangerous.\nRussian forces have repeatedly targeted Ukrainian port infrastructure on the Danube River that separates Ukraine and Romania.\nRomania has taken measures to protect its citizens who live close to the Ukrainian border, including the construction of air raid shelters and the deployment of drone defense systems."}, {"id": "844fc403-6f9d-4f20-9d66-8bf7f940ea83", "title": "Ukraine launches  one of largest ever  drone attacks on Moscow , mayor says", "date": "2024-08-21 03:15", "url": "https://economictimes.indiatimes.com/news/defence/ukraine-launches-one-of-largest-ever-drone-attacks-on-moscow-mayor-says/articleshow/112667596.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "The city in the Moscow region is some 38 kms (24 miles) south of the Kremlin.\n\"The air defence systems of the defence ministry continue to repel enemy UAV (unmanned aerial vehicles) attacks,\" Sobyanin said on the Telegram messaging app at 4:43 a.m. (0143 GMT).\n\"This is one of the largest attempts to attack Moscow using drones ever.\nThere was no immediate comment from Ukraine.In recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow's war efforts.\nIt also says that its attacks are in response to Russia's continued strikes on Ukrainian territory."}, {"id": "ad1d4d4a-3b50-4248-856b-75b513b1b554", "title": "Ukraine launches drone attack on Moscow , Russian air defence destroys 3 near Kremlin", "date": "2024-08-21 04:15", "url": "https://www.firstpost.com/world/ukraine-launches-drone-attack-on-moscow-russian-air-defence-destroys-3-near-kremlin-13806696.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Moscow faced one of its largest drone strikes yet, with Russian air defenses downing numerous drones targeting the capital.\nThe city in the Moscow region is some 38 kms (24 miles) south of the Kremlin.\nAdvertisement“This is one of the largest attempts to attack Moscow using drones ever.\nRussian officials rarely disclose the full size of the attacks, reporting only drones that its air defence units destroy.\nIn recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow’s war efforts."}, {"id": "552aba65-0443-4c51-a648-80e169303541", "title": "Ukraine launches  large  drone attack on Moscow", "date": "2024-08-21 04:15", "url": "https://www.rte.ie/news/2024/0821/1465950-ukraine/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Ukraine launched one of the largest ever drone attacks on Moscow, the city's mayor said, with Russian air defence units destroying at least 10 drones flying towards the capital.\nThe city in the Moscow region is 38km south of the Kremlin.\n\"This is one of the largest attempts to attack Moscow using drones ever.\nUkraine has often launched one or two drones targeting Moscow in recent months, causing no substantial damage.\nIn recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow's war efforts."}, {"id": "7aadd0db-f642-482d-aea5-c08b0536d393", "title": "Lebanon says five killed in fresh Israel strikes", "date": "2024-08-21 02:45", "url": "https://www.rte.ie/news/2024/0821/1465948-middle-east/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Lebanon's health ministry said that Israeli strikes in the country's east killed one person and wounded 20 others, hours after it said four people were killed in the south.\n\"Israeli enemy strikes on the Bekaa\" valley killed one person \"and wounded 20 others\", the health ministry said in an updated toll.\nHealth workers 'targeted'The Israeli military in separate statements said a total of around 115 \"projectiles\" were identified crossing from Lebanon.\nThe military also said air forces struck projectile launchers and several \"Hezbollah military\" structures in south Lebanon.\nAn Israeli strike on Beirut's southern suburbs killed a top Hezbollah commander, Fuad Shukr, shortly before an attack in Tehran blamed on Israel killed Hamas political leader Ismail Haniyeh."}, {"id": "dc9181af-70de-4930-8f50-8909a4ef1eb2", "title": "3 suspects in fatal shooting of Israeli Arab businessman in Istanbul detained in Romania", "date": "2024-08-21 04:15", "url": "https://abcnews.go.com/International/wireStory/3-suspects-fatal-shooting-israeli-arab-businessman-istanbul-113009342", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Police in Turkey say three suspects wanted in connection with the killing of an Israeli Arab businessman in Istanbul have been detained in Romania3 suspects in fatal shooting of Israeli Arab businessman in Istanbul detained in RomaniaISTANBUL -- Three suspects wanted in connection with the killing of an Israeli Arab businessman in Istanbul have been detained in Romania, Turkish police said late Tuesday.\nAbdulkadir Anas was shot dead on Sunday evening as he sat in a car.\nThe alleged assailants escaped across the Bulgarian border within 2 1/2 hours of the shooting in Istanbul’s Kagithane district.\nThe Istanbul Governor’s Office said the attack was motivated by a dispute over money.\nFour people said to have been involved in planning the attack were arrested Monday."}, {"id": "3563f887-61eb-4654-ab86-cf7ff6faa438", "title": "PD : 60 - year - old man dies days after stabbing in Walnut Hills", "date": "2024-08-21 03:30", "url": "https://www.wcpo.com/news/local-news/hamilton-county/cincinnati/walnut-hills/pd-60-year-old-man-dies-days-after-stabbing-in-walnut-hills", "domain": "wcpo.com", "domain_classification": "Unknown", "message": "CINCINNATI — A 60-year-old man was fatally stabbed Saturday afternoon in Walnut Hills, Cincinnati police said.\nOfficers responded to the 2900 block of Gilbert Avenue around 1:45 p.m. for a reported stabbing.\nPolice have not released any suspect information in the stabbing.\nCPD's Homicide Unit is investigating the stabbing.\nAnyone with information is asked to call the Homicide Unit at 513-352-3542."}, {"id": "3e83d9d0-838d-4fee-a949-875ebbba2f4f", "title": "3 suspects in fatal shooting of Israeli Arab businessman in Istanbul detained in Romania", "date": "2024-08-21 04:15", "url": "https://apnews.com/article/istanbul-gun-attack-businessman-romania-ced34043f817d1206552484f8c509456", "domain": "apnews.com", "domain_classification": "International", "message": "ISTANBUL (AP) — Three suspects wanted in connection with the killing of an Israeli Arab businessman in Istanbul have been detained in Romania, Turkish police said late Tuesday.\nAbdulkadir Anas was shot dead on Sunday evening as he sat in a car.\nThe alleged assailants escaped across the Bulgarian border within 2 1/2 hours of the shooting in Istanbul’s Kagithane district.\nThe Istanbul Governor’s Office said the attack was motivated by a dispute over money.\nFour people said to have been involved in planning the attack were arrested Monday."}, {"id": "44fe3640-1637-4228-bec6-cc40f59e6128", "title": "King visits united kingdom town to pay tribute to stabbing victims", "date": "2024-08-21 03:30", "url": "https://www.perthnow.com.au/news/human-interest/king-visits-uk-town-to-pay-tribute-to-stabbing-victims-c-15774525", "domain": "perthnow.com.au", "domain_classification": "Unknown", "message": "King Charles has travelled to northern England to pay tribute to victims and families of those affected by a mass stabbing last month which sparked riots and attacks targeting Muslims and migrants.\nOn a visit to Southport, the town where the attack took place, Charles met some of the surviving children and their families before later meeting representatives from local emergency services and community groups.\nHe also looked at flowers and toys that had been left in memory of the victims of the attack, to cheers and applause from the gathered crowds.\nCharles has taken a keen interest in helping young people, setting up the Princes Trust charity in the 1970s.\nIt has continued to operate, including in locations hit by the riots, since his coronation."}, {"id": "2b980460-5c88-45ce-81c5-7fba2bfa9c69", "title": "Lebanon says five killed in fresh Israel strikes", "date": "2024-08-21 00:15", "url": "https://www.al-monitor.com/originals/2024/08/lebanon-says-five-killed-fresh-israel-strikes", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "Lebanon's health ministry said early Wednesday that Israeli strikes in the country's east killed one person and wounded 20 others, hours after it said four people were killed in the south.\n\"Israeli enemy strikes on the Bekaa\" valley killed one person \"and wounded 20 others\", the health ministry said in an updated toll.\n- Health workers 'targeted' -The Israeli military in separate statements said a total of around 115 \"projectiles\" were identified crossing from Lebanon.\nThe military also said air forces struck projectile launchers and several \"Hezbollah military\" structures in south Lebanon.\nAn Israeli strike on Beirut's southern suburbs killed a top Hezbollah commander, Fuad Shukr, shortly before an attack in Tehran blamed on Israel killed Hamas political leader Ismail Haniyeh."}, {"id": "5cc4344e-9f3e-438b-902d-ff6254e40952", "title": "3 suspects in fatal shooting of Israeli Arab businessman in Istanbul detained in Romania – Winnipeg Free Press", "date": "2024-08-21 04:15", "url": "https://www.winnipegfreepress.com/world/2024/08/20/3-suspects-in-fatal-shooting-of-israeli-arab-businessman-in-istanbul-detained-in-romania", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "ISTANBUL (AP) — Three suspects wanted in connection with the killing of an Israeli Arab businessman in Istanbul have been detained in Romania, Turkish police said late Tuesday.\nAbdulkadir Anas was shot dead on Sunday evening as he sat in a car.\nThe alleged assailants escaped across the Bulgarian border within 2 1/2 hours of the shooting in Istanbul’s Kagithane district.\nThe Istanbul Governor’s Office said the attack was motivated by a dispute over money.\nFour people said to have been involved in planning the attack were arrested Monday."}, {"id": "213ee5d0-c4f5-4479-b716-4dc1060eaf4e", "title": "Ukraine launches  one of largest ever  drone attacks on Moscow , mayor says", "date": "2024-08-21 02:45", "url": "https://www.marketscreener.com/quote/currency/US-DOLLAR-RUSSIAN-ROUBLE--2370597/news/Ukraine-launches-one-of-largest-ever-drone-attacks-on-Moscow-mayor-says-47695296/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "(Reuters) -Ukraine launched one of the largest ever drone attacks on Moscow on Wednesday, the city's mayor said, with Russian air defence units destroying at least 10 drones flying towards the capital.\nThe city in the Moscow region is some 38 kms (24 miles) south of the Kremlin.\n\"This is one of the largest attempts to attack Moscow using drones ever.\nRussian officials rarely disclose the full size of the attacks, reporting only drones that its air defence units destroy.\nIn recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow's war efforts."}, {"id": "bbbc5ac0-8f7d-4bb6-a99a-3a6ee9dff1c7", "title": "Ukraine launches  one of largest ever  drone attacks on Moscow , mayor says", "date": "2024-08-21 04:15", "url": "https://www.swissinfo.ch/eng/ukraine-launches-", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Ukraine launches ‘one of largest ever’ drone attacks on Moscow, mayor says3 minutesBy Lidia Kelly(Reuters) -Ukraine launched one of the largest ever drone attacks on Moscow on Wednesday, the city’s mayor said, with Russian air defence units destroying at least 10 drones flying towards the capital.\nThe city in the Moscow region is some 38 kms (24 miles) south of the Kremlin.\n“This is one of the largest attempts to attack Moscow using drones ever.\nRussian officials rarely disclose the full size of the attacks, reporting only drones that its air defence units destroy.\nIn recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow’s war efforts."}, {"id": "6a387a3b-ee25-4c3d-8a36-06829622f2c3", "title": "Ukraine launches  one of largest ever  drone attacks on Moscow , mayor says", "date": "2024-08-21 04:00", "url": "https://www.cnn.com/2024/08/20/europe/ukraine-drone-attack-moscow-intl-hnk/", "domain": "cnn.com", "domain_classification": "International", "message": "Ukraine launched one of the largest ever drone attacks on Moscow on Wednesday, the city’s mayor said, with Russian air defense units destroying at least 10 drones flying towards the capital.\nThe city in the Moscow region is some 38 kilometers (24 miles) south of the Kremlin.\nRussian officials rarely disclose the full size of the attacks, reporting only drones that its air defense units destroy.\nRussia’s state news agency RIA also reported that two drones were destroyed over the Tula region, which borders the Moscow region.\nIn recent months, Kyiv has stepped up its air attacks on Russian territory, saying its aim is to destroy infrastructure key to Moscow’s war efforts."}, {"id": "0885077d-bbe2-4992-919a-dd8a69b2b0e8", "title": "Netanyahu , accused of  abandoning  hostages , says cease - fire deal may not happen", "date": "2024-08-21 02:00", "url": "https://www.aol.com/netanyahu-accused-abandoning-hostages-says-160112920.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "The group accused Netanyahu of refusing any hostage deal.\nThe Biden administration has been promoting a bridging proposal amid hopes a deal could be hammered out by week's end.\nHours later, President Joe Biden accused Hamas of \"backing away\" from a deal.\nIsraeli opposition leader: Netanyahu sabotaging talksIsraeli opposition leader Yair Lapid led a chorus of opposition to Netanyahu, accusing him of trying to derail the cease-fire talks.\nContributing: ReutersThis article originally appeared on USA TODAY: Israel war: Netanyahu says cease-fire may not happen"}, {"id": "65cc2bf8-c7a2-4012-a50b-5622279c3cbc", "title": "Lebanon says fresh Israel strikes on east kill 1 , wound 19", "date": "2024-08-21 00:30", "url": "https://www.gjsentinel.com/news/national/lebanon-says-fresh-israel-strikes-on-east-kill-1-wound-19/article_8aed3b81-128b-5b24-8ff5-115d45df187d.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "This picture taken during a guided tour by the media office of the Lebanese Shiite movement Hezbollah shows buildings near the site of reported overnight Israeli bombardment on Sarein in the Bekaa valley in east-central Lebanon on August 20, 2024"}, {"id": "8bd1ad84-6e6f-4623-b009-0459556f91ac", "title": "Lebanon says five killed in fresh Israel strikes", "date": "2024-08-21 04:00", "url": "https://dunyanews.tv/en/World/832097-lebanon-says-five-killed-in-fresh-israel-strikes", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Lebanon says five killed in fresh Israel strikesWorld World Lebanon says five killed in fresh Israel strikesThe strikes came more than 24 hours after Israel carried out similar raids deep inside east LebanonFollow on Published On: Wed, 21 Aug 2024 07:40:19 PKTBEIRUT (Lebanon) (AFP) – Lebanon's health ministry said early Wednesday that Israeli strikes in the country's east killed one person and wounded 20 others, hours after it said four people were killed in the south.\n\"Israeli enemy strikes on the Bekaa\" valley killed one person \"and wounded 20 others\", the health ministry said in an updated toll.\nHEALTH WORKERS 'TARGETED'The Israeli military in separate statements said a total of around 115 \"projectiles\" were identified crossing from Lebanon.\nThe military also said air forces struck projectile launchers and several \"Hezbollah military\" structures in south Lebanon.\nAn Israeli strike on Beirut's southern suburbs killed a top Hezbollah commander, Fuad Shukr, shortly before an attack in Tehran blamed on Israel killed Hamas political leader Ismail Haniyeh."}, {"id": "b2192ac3-24c4-4104-a98e-ce8f15a03195", "title": "Blinken ends latest Mideast visit without a cease - fire , warning  time is of the essence  ", "date": "2024-08-21 04:00", "url": "https://bakersfieldnow.com/news/nation-world/blinken-ends-latest-mideast-visit-without-a-cease-fire-warning-time-is-of-the-essence-08-20-2024", "domain": "bakersfieldnow.com", "domain_classification": "Unknown", "message": "\"We need to get a cease-fire and hostage agreement over the finish line, and we need to do it now.\nBlinken said it is \"very clear on the schedule and the locations of (Israeli military) withdrawals from Gaza.\"\nWide gaps appeared to remain between Israel and Hamas, though angry statements often serve as pressure tactics during negotiations.\nOver 100 other hostages were released during last year's cease-fire in exchange for Palestinians imprisoned in Israel.\nAnother airstrike in central Gaza killed five children and their mother, according to Al-Aqsa Martyrs Hospital, where an AP journalist counted the bodies."}, {"id": "668da894-4a4a-4055-af73-5c0a596181b5", "title": "Rocket explodes at united kingdom new spaceport", "date": "2024-08-21 02:30", "url": "http://usa.chinadaily.com.cn/a/202408/21/WS66c4d266a31060630b9240da.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "The United Kingdom's newest spaceport, on the tiny Scottish island of Unst, has been rocked by a massive explosion after a rocket engine failed during testing by the German company Rocket Factory Augsburg, or RFA.\nThe enterprise hopes to eventually launch the UK's first vertical-takeoff rocket and was moving forward with the project on the island, which is part of the Shetland Islands, by conducting trials.\nThe spaceport, which only opened three months ago, has received approval from the UK's Civil Aviation Authority to start launching spaceships this year and is the first facility in Western Europe to be licensed to launch vessels vertically.\nA spokesman for SaxaVord Spaceport said: \"This was a test, and test campaigns are designed to identify issues prior to the next stage.\nThe UK's only other spaceport, in the county of Cornwall in southwest England, was the first to become operational but is not licensed to launch vessels vertically and instead puts them into orbit piggy-backed on an aircraft."}, {"id": "4efffc18-28f2-490c-9444-20ebf61efa17", "title": "Rocket explodes at united kingdom new spaceport", "date": "2024-08-21 03:00", "url": "http://africa.chinadaily.com.cn/a/202408/21/WS66c4d266a31060630b9240da.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "The United Kingdom's newest spaceport, on the tiny Scottish island of Unst, has been rocked by a massive explosion after a rocket engine failed during testing by the German company Rocket Factory Augsburg, or RFA.\nThe enterprise hopes to eventually launch the UK's first vertical-takeoff rocket and was moving forward with the project on the island, which is part of the Shetland Islands, by conducting trials.\nThe spaceport, which only opened three months ago, has received approval from the UK's Civil Aviation Authority to start launching spaceships this year and is the first facility in Western Europe to be licensed to launch vessels vertically.\nA spokesman for SaxaVord Spaceport said: \"This was a test, and test campaigns are designed to identify issues prior to the next stage.\nThe UK's only other spaceport, in the county of Cornwall in southwest England, was the first to become operational but is not licensed to launch vessels vertically and instead puts them into orbit piggy-backed on an aircraft."}, {"id": "36236efb-d60b-48fd-937c-141d08683819", "title": "Kingdom Come : Deliverance II - Gameplay Teaser Trailer", "date": "2024-08-21 04:15", "url": "https://n4g.com/news/2617297/kingdom-come-deliverance-ii-gameplay-teaser-trailer", "domain": "n4g.com", "domain_classification": "Unknown", "message": "50°Delta Force - Gamescom 2024 TrailerDelta Force is a free-to-play first-person tactical shooter coming soon to Xbox, PC and mobile.\nAs the latest installment of the classic series that has defined the genre for 25 years, Delta Force is back with an upgraded arsenal of weaponry, jaw-dropping environments, and a truly dynamic world.\nDrop into large-scale multiplayer combat and take the fight to the enemy across land, sea and air in Havoc Warfare, experience intense extraction-based action with your squad in Hazard Operations, or transport back to 1993 for our Black Hawk Down campaign mode based on the classic Ridley Scott movie.\nThree great ways to play, one exciting package!"}, {"id": "8d8fb81b-3101-476a-8160-141153ee5901", "title": "Delta Force - Gamescom 2024 Trailer", "date": "2024-08-21 04:15", "url": "https://n4g.com/news/2617298/delta-force-gamescom-2024-trailer", "domain": "n4g.com", "domain_classification": "Unknown", "message": "50°Delta Force - Gamescom 2024 TrailerDelta Force is a free-to-play first-person tactical shooter coming soon to Xbox, PC and mobile.\nAs the latest installment of the classic series that has defined the genre for 25 years, Delta Force is back with an upgraded arsenal of weaponry, jaw-dropping environments, and a truly dynamic world.\nDrop into large-scale multiplayer combat and take the fight to the enemy across land, sea and air in Havoc Warfare, experience intense extraction-based action with your squad in Hazard Operations, or transport back to 1993 for our Black Hawk Down campaign mode based on the classic Ridley Scott movie.\nThree great ways to play, one exciting package!"}, {"id": "04ae2a8f-94a6-4de6-a6bf-479f899baa36", "title": "Lost Records : Bloom & Rage - First Look Gameplay Trailer", "date": "2024-08-21 04:15", "url": "https://n4g.com/news/2617301/lost-records-bloom-and-rage-first-look-gameplay-trailer", "domain": "n4g.com", "domain_classification": "Unknown", "message": "50°Delta Force - Gamescom 2024 TrailerDelta Force is a free-to-play first-person tactical shooter coming soon to Xbox, PC and mobile.\nAs the latest installment of the classic series that has defined the genre for 25 years, Delta Force is back with an upgraded arsenal of weaponry, jaw-dropping environments, and a truly dynamic world.\nDrop into large-scale multiplayer combat and take the fight to the enemy across land, sea and air in Havoc Warfare, experience intense extraction-based action with your squad in Hazard Operations, or transport back to 1993 for our Black Hawk Down campaign mode based on the classic Ridley Scott movie.\nThree great ways to play, one exciting package!"}, {"id": "3d1bd802-ddd7-4a97-a91d-35476b112e87", "title": "Towerborne - Gameplay Trailer - Gamescom 2024", "date": "2024-08-21 04:15", "url": "https://n4g.com/news/2617296/towerborne-gameplay-trailer-gamescom-2024", "domain": "n4g.com", "domain_classification": "Unknown", "message": "50°Delta Force - Gamescom 2024 TrailerDelta Force is a free-to-play first-person tactical shooter coming soon to Xbox, PC and mobile.\nAs the latest installment of the classic series that has defined the genre for 25 years, Delta Force is back with an upgraded arsenal of weaponry, jaw-dropping environments, and a truly dynamic world.\nDrop into large-scale multiplayer combat and take the fight to the enemy across land, sea and air in Havoc Warfare, experience intense extraction-based action with your squad in Hazard Operations, or transport back to 1993 for our Black Hawk Down campaign mode based on the classic Ridley Scott movie.\nThree great ways to play, one exciting package!"}, {"id": "528f3838-194f-4610-8353-0b724c01ca38", "title": "Dune : Awakening To Be Released in Early 2025", "date": "2024-08-21 01:00", "url": "https://wccftech.com/dune-awakening-to-be-released-in-early-2025/", "domain": "wccftech.com", "domain_classification": "Unknown", "message": "Dune: Awakening was one of the major games showcased at Gamescom 2024, where they announced the plans to release the game in Early 2025.\nAdditionally, during Gamescom, 30 minutes of Dune: Awakening gameplay will be showcased later in the week.\nThe reveal for Dune: Awakening shows the player's rise from scavenging and survival to mobilizing an entire guild hunting for spice.\nDune: Awakening will launch in early 2025 on PC, with the game arriving on PlayStation 5 and Xbox Series X|S later.\nIn addition to the 30-minute showcase of Dune: Awakening, Funcom has announced that a third Dune: Awakening Direct will air on August 29."}, {"id": "336184a1-b692-47c1-844d-e90a8a1ee127", "title": "12 killed in fresh Israeli strike on school shelter - World", "date": "2024-08-21 04:30", "url": "https://www.dawn.com/news/1853664/12-killed-in-fresh-israeli-strike-on-school-shelter", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "GAZA STRIP: Gaza’s civil defence agency said an Israeli strike on a school-turned-shelter killed at least 12 people on Tuesday, while the Israeli military said it struck a Hamas command centre.\n“Our crews retrieved 12 martyrs from the Mustafa Hafiz school, which was bombed by the Israeli occupation west of Gaza City,” agency spokesman Mahmud Bassal told AFP.\nThousands of displaced Palestinians had sought refuge in the school, he said, amid the ongoing war in the Gaza Strip.\nThe Israeli military said the school was targeted because it housed a command-and-control centre.\nThe school was reduced to rubble, with scores of Palestinian men and women, many holding children, fleeing the site after the strike."}, {"id": "6da442b8-7128-46c0-8ae0-d6c7d028aa5a", "title": "Shoplifters & Scammers : At War with the Law", "date": "2024-08-21 04:15", "url": "https://www.tvguide.co.uk/schedule/80185786-526d-5c41-9d4b-fdff5e9c7f10/shoplifters-and-scammers-at-war-with-the-law", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Shoplifters & Scammers: At War with the Law5STAR 10:00 AM to 11:00 AM Wednesday 21 August Share Add toCalendar +S SubtitlesDocumentary following shopping centre security teams who are locked in a cat and mouse battle to catch criminalsShoplifters & Scammers: At War with the Law airs on 5STAR at 10:00 AM, Wednesday 21 August .\n(Subtitles.)\nLearn more about Shoplifters & Scammers: At War with the Law and other education/science/factual topics on our factual page"}, {"id": "0dbe7cb9-0d96-4319-88e2-02d69862b4f9", "title": "The Nightly : August 20th , 2024", "date": "2024-08-21 03:30", "url": "https://www.cagesideseats.com/2024/8/20/24225019/the-nightly-august-20th-2024", "domain": "cagesideseats.com", "domain_classification": "Unknown", "message": "Tonight, it’s tri brand warfare as we take a look at Survivor Series 2019.\nThe first match was the women’s Survivor Series match and the match was a mess.\nAnd in the main event, it was Becky Lynch vs. Bayley vs. Shayna Baszler.\nThis was an unpopular match at the time, and while I do think it’s a bit overhated, I don’t think this is a good main event.\nThis didn’t need to main event, and the styles from all three didn’t mesh together."}, {"id": "204827d0-27cf-4fe1-b5e5-20b7e1aa6dfd", "title": "What we know about assault on Joint Base San Antonio entry gate", "date": "2024-08-21 00:15", "url": "http://www.expressnews.com/news/article/shooting-joint-base-san-antonio-questions-mystery-19667096.php", "domain": "expressnews.com", "domain_classification": "Unknown", "message": "Air Force trainees down meal rations during a break from exercises at the Chapman Annex of Joint Base San Antonio-Lackland.\nAn Air Force spokeswoman, Stefanie \"Stevi\" Antosh, said it was more than one, but she didn't provide a number.\nAir Force trainees participate in a combat simulation at the Chapman Training Annex of Joint Base San Antonio-Lackland.\nSAPD is investigating the incident as an “aggravated assault with deadly weapon.”What is the Chapman Training Annex?\nAuthorities closed the Chapman Annex gate for a few hours, but it reopened around 9:40 a.m. Saturday."}, {"id": "ac4a59b9-8300-4aed-a31f-254f144e8298", "title": "Hypocrisy and the  Tamil Genocide Day  monument - EDITORIAL - Opinion", "date": "2024-08-21 04:30", "url": "https://www.dailymirror.lk/opinion/Hypocrisy-and-the-Tamil-Genocide-Day-monument-EDITORIAL/172-289783", "domain": "dailymirror.lk", "domain_classification": "Unknown", "message": "On Friday 16 August, Foreign Minister Ali Sabry summoned the Canadian Ambassador and protested the laying of the foundation stone for a so-called ‘Tamil Genocide Monument’ at Chinguacousy Park in Brampton Canada.\nSabry reiterated the so-called genocide was based on “malicious disinformation” and lacked validation from any responsible national or international authority.\nOver 200,000 Tamil civilians were held hostage by the LTTE on the tiny strip of land area of approximately 2 - 3 sq miles, as the final battle was being fought.\nDuring the battle, the LTTE too killed several civilians who attempted to break free from its clutches.\nYet Canada has yet to condemn Israeli actions in the Gaza Strip, much less construct a monument against Israeli genocide in Palestine."}, {"id": "b87175c6-e12b-436f-8945-df01cc63ceb4", "title": "The Dune MMO is scheduled to come out in early 2025", "date": "2024-08-21 00:15", "url": "https://www.polygon.com/gamescom/442183/dune-mmo-survival-game-release-date-gamescom-2024", "domain": "polygon.com", "domain_classification": "Unknown", "message": "Developer Funcom released an in-depth look at Dune: Awakening game as part of Gamescom Opening Night Live on Tuesday.\nAs shown in the presentation, you start as a nameless poisoner who must survive the scorching dessert heat and monstrous sand worms.\nJust like with anything Dune, spice is the name of the game.\nIt’s a precious commodity and the key to power in the larger world of the game.\nAs far as warfare goes, it looks like anything from flamethrowers to mischievously summoning sand sand worms is fair game."}, {"id": "9d1db63e-76e0-4ff0-b138-6614a0ced805", "title": "WW2 - Frontlines", "date": "2024-08-21 04:15", "url": "https://www.tvguide.co.uk/schedule/2177ecea-bc89-5929-899c-fa9a30975089/ww2-frontlines", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "WW2 - FrontlinesU&Yesterday 10:00 AM to 11:00 AM Wednesday 21 August Share Add toCalendar +Iwo Jima Season 1 Episode 7 of 8 S Subtitles Audio DescriptionA look back at the Battle of Iwo Jima, in which a quarter of all the US Marines who died in the Second World War were killedWW2 - Frontlines airs on U&Yesterday at 10:00 AM, Wednesday 21 August .\n(Subtitles, audio description.)"}, {"id": "cfef5ef5-cc0c-48fa-bbbf-3598403cfb53", "title": "Amazon Games and Glowmade Reveal King of Meat at Gamescom 2024", "date": "2024-08-21 01:00", "url": "https://wccftech.com/amazon-games-and-glowmade-reveal-king-of-meat-at-gamescom-2024/", "domain": "wccftech.com", "domain_classification": "Unknown", "message": "This game is being developed by Glowmade and published by Amazon Games, titled King of Meat.\nHigh fantasy meets glitz, glamor, and media infatuation with modern-day celebrity in this wacky game.\nIf it isn't apparent by now, the obsession is the survival game show that you participate in, named King of Meat.\nAt the moment, King of Meat has no planned release date, with the Steam page saying \"coming soon.\"\nIn addition, you can customize your character however you like and choose your outfits, accessories, and emotes to show off your confidence as a contender in King of Meat."}, {"id": "a0bca39a-7c46-4948-a7fd-5d84c34b6219", "title": "Awakening of the Rebellion 2 . 8 mod for Star Wars : Empire at War : Forces of Corruption", "date": "2024-08-21 02:30", "url": "https://www.moddb.com/mods/awakening-of-the-rebellion-2", "domain": "moddb.com", "domain_classification": "Unknown", "message": "We have redone the speed and turning of all air units, so that they require a lot more room to operate.\nAlong with that aircraft will also miss small ground targets more and their weapons are really only effective at the target they are designed to hit.\nShielded higher-tier air units will require a more dedicated Anti Air counter to take down.\nThanks to a discovery by the Thrawn’s Revenge team, we now know that infantry units in galactic conquest were being tracked individually.\nThe Rebellion also now has its Infiltrator Academy brought back from the base game, and produces units based on the main ground base level."}, {"id": "83602c91-1e40-48ce-abbe-d8540b1ec872", "title": "Last key bridge in Kursk region struck as Ukraine attempts to sever Russia supply lines - 21 - Aug - 2024", "date": "2024-08-21 03:00", "url": "https://home.nzcity.co.nz/news/article.aspx?id=405097", "domain": "home.nzcity.co.nz", "domain_classification": "Unknown", "message": "As Ukraine's incursion into Russian territory enters its third week, key bridges have been coming under attack.\nAnalysts say these were part of critical supply lines for Russian troops defending the area.\nAccording to the Ukrainian Air Force, Russian military bloggers and officials, they have all come under attack.\nWhat Ukraine is trying to achieveAnalysts say it appears Ukraine is attempting to isolate the stretch of Kursk territory which lies just west of the invasion zone.\nBy targeting the bridges, Ukraine was cutting off logistical supplies to Russian forces deployed in Donetsk Oblast in eastern Ukraine."}, {"id": "b24367b1-5252-42b0-8f37-dc8fb4f30121", "title": "Sniper Elite : Resistance announced", "date": "2024-08-21 02:00", "url": "https://nichegamer.com/sniper-elite-resistance-announced/", "domain": "nichegamer.com", "domain_classification": "Unknown", "message": "Rebellion Developments has announced Sniper Elite: Resistance, the latest entry in their popular Sniper franchise.\nSniper Elite: Resistance is launching sometime in 2025 for Windows PC (via Steam and the Epic Games Store), Xbox One, Xbox Series X|S, PS4, PS5, and Xbox Game Pass.\nHere’s a rundown on the new game, plus a trailer:Sniper Elite: Resistance tells a gripping new standalone story that runs in parallel with Sniper Elite 5.\nOffering the unparalleled sniping mechanics, stealth and tactical third-person combat you would expect from the franchise, Sniper Elite: Resistance turns the attention towards the hidden war, far from the front lines, deep within the heart of occupied France.\nLocate a unique Propaganda poster in each of the main campaign’s levels to unlock a Propaganda Mission where you become a Resistance Fighter."}, {"id": "1b95d321-9bfb-41ef-b4fc-2086714c5892", "title": "PM Modi Poland trip : Will it help in boosting ties between the two nations ? – Firstpost", "date": "2024-08-21 04:15", "url": "https://www.firstpost.com/explainers/pm-narendra-modi-poland-trip-new-delhi-warsaw-ties-ukraine-war-13806539.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "India and Poland maintained bilateral ties but it missed the strategic depth as before in 1979.\nDespite a dip in ties, Poland is India’s largest trading and investment partner in Central and Eastern Europe.\nAdvertisementModi’s visit to PolandModi is the first Indian PM to visit Poland after Morarji Desai in 1979.\nNew Delhi’s similar move was “reflective of the desire to expand two-way defence ties”, PTI reported citing unnamed sources.\nHowever, it is hoped that PM Modi’s push will give it the required push and take bilateral ties to a higher level,” a source told ThePrint."}, {"id": "9a2c0b45-3d6c-4f30-9574-d1c81950117c", "title": "Defense Budget Talks Reignite Debate Over Military Draft for Women", "date": "2024-08-21 02:00", "url": "https://www.theepochtimes.com/article/defense-budget-talks-reignite-debate-over-military-draft-for-women-5706526", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "The $910 billion bill would require women to be drafted into service, but has limitations on which combat roles they could join.\nScott Olson/Getty ImagesThe $910 billion bill would require women to be drafted into service, but has limitations on which combat roles they could join.\nBut given time-tested differences between the sexes’ physical aptitudes, this is all but certain to require adjusting physical standards, they say.\nJunger said that adding women not subject to the same physical requirements could lead to many more complaints and harm unit morale and cohesion.\n“Military service generally requires strenuous activity and austere living conditions, which men are generally more capable of tolerating than women."}, {"id": "8ed75846-ccd6-4cce-bf94-1a7390b02ff6", "title": "Hands - on Preview : Sid Meier Civilization VII", "date": "2024-08-21 01:45", "url": "https://www.destructoid.com/hands-on-preview-sid-meiers-civilization-vii/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "And my roughly three hours of hands-on playtime with Civilization 7 only furthered that sentiment.\nHe kicked off our hands-on preview by telling us about the vision for Civilization 7.\nInstead of just making “another Civilization” game, the team instead chose a new element of focus: History Comes in Layers.\nA full campaign in Civilization 7 will expand across these three ages, allowing the player to change their Civilization at the start of each new wave.\nSid Meier’s Civilization VII is set to release on February 11, 2025 on PC, Xbox One, Xbox Series X|S, PlayStation 4, PlayStation 5, and Nintendo Switch."}, {"id": "2435fb1b-368e-4d37-b9b7-4ed745b5c317", "title": "IDF Recovers 6 Deceased Hostages In Gaza Rescue Mission", "date": "2024-08-21 03:15", "url": "https://www.oann.com/newsroom/idf-recovers-6-deceased-hostages-in-gaza-rescue-mission/", "domain": "oann.com", "domain_classification": "Unknown", "message": "(Photo by JACK GUEZ/AFP via Getty Images)OAN Staff Blake Wolf4:04 PM – Tuesday, August 20, 2024The Israel Defense Forces (IDF) has recovered six deceased Israeli hostages in a southern Gaza rescue operation on Monday.\nAdvertisement“Overnight our forces returned the bodies of six of our hostages that had been held by the murderous Hamas terrorist organization,” said Israeli Prime Minister Benjamin Netanyahu.\n“I would like to thank the brave IDF and ISA fighters and commanders for their heroism and determined action.\n“This was a complex rescue operation that was conducted both above and below ground.\n“The immediate return of the remaining 109 hostages can only be achieved through a negotiated deal."}, {"id": "1ce68502-1e0a-4792-90f3-c910b2f2f6e4", "title": "Philippine military steps up security , loyalty protocols to prevent data leaks", "date": "2024-08-21 00:30", "url": "https://www.scmp.com/week-asia/politics/article/3275230/philippine-military-steps-security-loyalty-protocols-prevent-data-leak-adversaries", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "The Philippine military is strengthening its security measures and personnel loyalty protocols to prevent the leak of sensitive information to adversaries following the recent guilty plea of a US intelligence officer for selling classified data.\nA video screen grab shows US Army Sergeant Korbein Schultz during an interview at Fort McCoy, Wisconsin, in August 2021.\nOnce approved, the agreement will create new protocols for both countries to safeguard top-secret military information and early detection systems for potential threats in the West Philippine Sea.\n“To prevent this, the [Armed Forces of the Philippines] must strengthen all aspects of personnel management, ranging from education, doctrine, leadership, and training.\nNational Security Council Assistant Director General Jonathan Malaya on Monday confirmed some members of China’s Ministry of State Security were operating in the country."}, {"id": "994e7fa8-c5a4-4fb4-bceb-f889548086b7", "title": "Air Force Floats Light Stealth Fighter Concept As Its Heavy Fighter Program May Be In Jeopardy", "date": "2024-08-21 00:30", "url": "https://www.yahoo.com/news/air-force-floats-light-stealth-232150746.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The light fighter concept is shown during a presentation by Chief of Staff of the Air Force, Gen. David W. Allvin, at the Global Air and Space Chiefs Conference, held in London.\nPerhaps the most interesting aspect of the notional light fighter concept, however, is the timing of its appearance.\nOn the other hand, there have also been suggestions that the Air Force should consider procuring an entirely different future fighter.\nBrown Jr., when he was Pacific Air Forces commander, disembarks an F-16 at Kunsan Air Base, South Korea, in October 2019.\nThis further raises the question of whether a program as ambitious as a new light crewed fighter is even viable, regardless of the final unit cost and how that compares with the NGAD crewed fighter."}, {"id": "b7e2ca78-5139-403a-a1e2-f45abacdb106", "title": "Augustana names new assistant VP of marketing", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/augustana-names-assistant-vp-marketing-211048873.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Augustana College has a new assistant vice president.\nThe college announced that Irene Karedis Borys will be the assistant vice president of marketing and brand communication.\nBorys was vice president of client experience and integrator for The Childress Agency and started at Augustana on August 19.\nIrene Karedis Borys (Augustana College)Borys will lead the college’s Office of Communication and Marketing, a team of 12 staff members who work in enrollment marketing, brand strategy, campus and alumni communications, media engagement and event management.\nBorys will oversee the planning, development and execution of the college’s marketing and brand initiatives as assistant vice president, with primary responsibility to shape the college’s brand and promotion strategy."}, {"id": "b237346d-06a9-4a70-9ebe-167b9b43c1e3", "title": "Poking the bear - Newspaper", "date": "2024-08-21 04:30", "url": "https://www.dawn.com/news/1853706/poking-the-bear", "domain": "dawn.com", "domain_classification": "Local - Asia", "message": "Fast forward to 2024, and none of the officially tolerated press or TV outlets can be expected to seriously fault the authorities for this month’s swift foray into Russian territory by Ukrainian troops.\nThe region’s name should also resonate with anyone familiar with the key events of World War II.\nBut whatever the follies and fallacies of Moscow and Kyiv, this is not World War II, and it’s crucial to all humanity that it does not turn into World War III.\nHowever, the consequences of the Ukrainian advance into Russian territory remain unclear, and the messaging from Kyiv about its motivation has been somewhat muddled.\nMight that work, or will Putin’s instinct be to exact revenge, for which Ukrainian civilians may pay the biggest price?"}, {"id": "c883e6ad-ae6a-45b9-b345-54772b3903d7", "title": "Launch YC : Ares Industries - Building low - cost cruise missiles ðŸš€", "date": "2024-08-21 04:00", "url": "https://www.ycombinator.com/launches/Ler-ares-industries-building-low-cost-cruise-missiles", "domain": "ycombinator.com", "domain_classification": "Unknown", "message": "Hello, we’re Alex and Devan, and we’re building the low-cost cruise missiles the United States needs!\nWhat we’re buildingAres is building a new class of anti-ship cruise missiles.\nExisting anti-ship cruise missiles are low-volume, multi-million dollar, 3,000 lb behemoths meant to take out large cruisers and destroyers.\nBut Chinese shipbuilding capability is far superior to ours, and we can’t make enough anti-ship missiles to counter.\nWe believe our vision for anti-ship cruise missiles can help fill the munitions gap that the US faces."}, {"id": "c3dbb880-50d4-44fe-a071-82a826d3deb0", "title": "Russian soldier defects to Ukraine after spying for resistance group for months", "date": "2024-08-21 01:30", "url": "https://krdo.com/news/2024/08/20/russian-soldier-defects-to-ukraine-after-spying-for-resistance-group-for-months/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "By Eve Brennan, Olga Voitovych, Anna Chernova and Kostyantyn Hak, CNN(CNN) — A Russian soldier has defected to Ukraine, according to the Freedom for Russia Legion, the “I Want to Live Project,” and the Defense Intelligence of Ukraine.\n),” the Freedom for Russia Legion said.\nEscaping the Storm unit, Silver “activated explosive devices” in the unit’s headquarters, seriously injuring the commander and several senior officers, according to the legion.\nCNN is unable to verify this claim but has reached out to the Russian Ministry of Defense for comment.\nThe Defense Intelligence said Ukraine was able to obtain valuable intelligence on the location, number, and intentions of Russian forces “in a particular frontline area” because of the interaction with Silver."}, {"id": "a414cd5e-ddab-472c-91cd-b03b2ef95dee", "title": "Tim Walz Said His Kids Were  Born Through  IVF . That Not True . ", "date": "2024-08-21 00:30", "url": "https://freebeacon.com/elections/tim-walz-said-his-kids-were-born-through-ivf-thats-not-true/", "domain": "freebeacon.com", "domain_classification": "Unknown", "message": "Democratic vice presidential nominee Tim Walz, already under fire for embellishing his military service, misrepresented the fertility treatments his wife received to have children.\nVance], I wouldn’t have a family because of IVF,\" Walz said in a video posted by the Kamala Harris campaign on Aug. 9.\nGwen Walz detailed the fertility treatment in a statement to CNN, and the Harris campaign defended Walz’s inconsistent statements on the issue.\nHe was using commonly understood shorthand for fertility treatments,\" said Harris campaign spokeswoman Mia Ehrenberg.\n\"For Tim Walz, the IVF Political Battles are Personal,\" reads a Time headline, and the website Motherly posted a story headlined \"Tim Walz's Personal IVF Story Made Me Feel Seen.\""}, {"id": "09b0e0e9-a223-48b2-a1c1-d22d5d6b368e", "title": "Israel Waits on the Edge of War | The Jewish Press - JewishPress . com | Vic Rosenthal | 17 Av 5784 – Wednesday , August 21 , 2024", "date": "2024-08-21 02:30", "url": "https://www.jewishpress.com/blogs/abu-yehuda/israel-waits-on-the-edge-of-war/2024/08/21/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "At the same time, the Biden-Harris administration is trying to force Israel to accept a cease-fire agreement with Hamas.\nPressure on Israel is multifaceted, including both carrots and sticks.\nThe sticks include slowdowns in delivery of promised munitions and threats to abandon Israel in the event that the war blows up into a major regional conflict.\nAt this point, the US has warned the Iranian regime against carrying out its planned revenge attack against Israel or allowing its various proxies, especially Hezbollah, from doing anything that might cause Israel to abandon the negotiations for a cease-fire deal.\nIt is in their interest to avoid a confrontation with Israel now, before their nuclear umbrella unfolds, and while Israel is at peak readiness."}, {"id": "cee3dbe0-166d-4ea9-8bff-dc8d3fbce827", "title": "El Paso manufacturer awarded $92+ million Army contract", "date": "2024-08-21 03:00", "url": "https://kvia.com/news/2024/08/20/el-paso-manufacturer-awarded-92-million-army-contract/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "EL PASO, Texas (KVIA) -- The Defense Logistics Agency Troop Support has awarded El Paso garment manufacturer ReadyOne Industries a $92,406,100 contract to make advanced combat pants for the U.S. Army over the next five years.\n“We are honored to receive this five-year contract from the Defense Logistics Agency,” said Craig Wellons, President and COO of ReadyOne Industries.\n“This award not only reaffirms our dedication to delivering advanced, high-quality combat gear for the U.S.\"The contract's ordering period will run until August 14, 2029."}, {"id": "64621094-4ec3-4e73-8766-984d6e5b12a0", "title": "You are not prepared for this SteelSeries WoW collection", "date": "2024-08-21 02:00", "url": "https://www.androidheadlines.com/2024/08/you-are-not-prepared-for-this-steelseries-wow-collection.html", "domain": "androidheadlines.com", "domain_classification": "Unknown", "message": "SteelSeries and World of Warcraft have a long and storied history that dates back to the age of vanilla WoW.\nBehold, the new SteelSeries World of Warcraft collection that any adventurer traveling the lands of Azeroth would be proud to stumble upon.\nSo the launch of the new SteelSeries collection of peripherals is in part to commemorate that massive achievement.\nThe World of Warcraft SteelSeries collection launches in SeptemberI know you probably want to get your hands on these gaming peripherals and accessories right away.\nSteelSeries is continuing this tradition, only this time every peripheral in the WoW collection comes with some sweet in-game loot."}, {"id": "07851ee0-2bc9-47ab-b2e2-5d4e670b56c1", "title": "Texas Longhorn fan ranks SEC fight songs", "date": "2024-08-21 02:45", "url": "https://longhornswire.usatoday.com/lists/texas-longhorn-fan-ranks-the-sec-fight-songs/", "domain": "longhornswire.usatoday.com", "domain_classification": "Unknown", "message": "Fight songs unify with a common tune everyone knows and can sing and cheer together.\nFor alumni, fight songs instill a sense of nostalgia.\nTypically a rousing short song played by the school’s band, fans have been singing along to fight songs for decades.\nThe first official fight song dates back to 1885 when T. J. Hurley wrong “For Boston” for Boston College.\nAlso Check out: Texas Longhorn fan ranks the SEC football helmets"}, {"id": "70566d49-4978-4cd1-8e5c-e7cdc1f2d7f5", "title": "Worthplaying |  Call Of Duty : Black Ops 6  Shows Off 7 Mins Of Footage From Most Wanted Campaign Mission", "date": "2024-08-21 02:45", "url": "https://worthplaying.com/article/2024/8/20/news/143250-call-of-duty-black-ops-6-shows-off-7-mins-of-footage-from-most-wanted-campaign-mission-trailer/", "domain": "worthplaying.com", "domain_classification": "Unknown", "message": "The Call of Duty: Black Ops 6 campaign features dynamic moment-to-moment gameplay, featuring different mission styles with spectacular action-packed set pieces, high-stakes heists and high-secret espionage activities.\nA brand-new Call of Duty: Black Ops 6 Campaign Mission - \"Most Wanted,\" was just revealed at Gamescom during Opening Night Live!\nExpect to complete many of the mission objectives across the Black Ops 6 Campaign with a degree of freedom and choice, and this is no exception.\nPlay the Most Wanted mission as part of the signature Black Ops 6 Campaign, this October 25!\nTwo days after Call of Duty: NEXT, on Friday August 30 at 10AM PT, get your first taste of the next-level action coming to Call of Duty: Black Ops 6 with the Black Ops 6 Multiplayer Beta."}, {"id": "74b0332c-269b-4489-8e9d-751fc6913afa", "title": "Doctors can stop severe bleeding  in second with newly approved trauma product", "date": "2024-08-21 02:00", "url": "https://www.yahoo.com/news/doctors-stop-severe-bleeding-seconds-231809762.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The U.S. Food and Drug Administration (FDA) has approved a novel treatment that is designed to stop severe bleeding in a matter of seconds.\nFirst responders, paramedics and combat medics can use the gel to rapidly stop severe blood loss from wounds due to gunshots, stabbings or other traumatic events.\nThere are currently many gauzes, powders and sponges used to stop bleeding, but they have limitations, according to Landolina.\nREAD ON THE FOX NEWS APPThe U.S. Food and Drug Administration has approved TRAUMAGEL, a novel treatment that is designed to stop severe bleeding in a matter of seconds.\nOriginal article source: Doctors can stop severe bleeding ‘in seconds’ with newly approved trauma product"}, {"id": "bebace02-c36e-47dd-91ac-154b76ccc660", "title": "Internet companies fight against corruption", "date": "2024-08-21 01:45", "url": "http://usa.chinadaily.com.cn/a/202408/21/WS66c53c47a31060630b92418d.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "China's leading internet companies, including Douyin, Tencent and Meituan, have ramped up efforts to combat internal corruption this year, underscoring a zero-tolerance policy toward fraudulent and corrupt activities.\nAccording to the report, Douyin investigated 125 cases of fraudulent activities during the first six months of the year.\nIn February, Tencent released its 2023 anti-fraud report, which disclosed that over 70 cases of rule violations were addressed last year.\nCorruption cases often involve employees working in upstream supply chains and downstream sales channels of the internet firms.\nDouyin also emphasized its commitment to continuously improving its systems and intensifying efforts to combat fraudulent activities, including commercial bribery and embezzlement."}, {"id": "276c9baf-60cd-40a2-bb71-6e383076e99d", "title": "Internet companies fight against corruption", "date": "2024-08-21 03:00", "url": "http://europe.chinadaily.com.cn/a/202408/21/WS66c53c47a31060630b92418d.html", "domain": "europe.chinadaily.com.cn", "domain_classification": "Unknown", "message": "China's leading internet companies, including Douyin, Tencent and Meituan, have ramped up efforts to combat internal corruption this year, underscoring a zero-tolerance policy toward fraudulent and corrupt activities.\nAccording to the report, Douyin investigated 125 cases of fraudulent activities during the first six months of the year.\nIn February, Tencent released its 2023 anti-fraud report, which disclosed that over 70 cases of rule violations were addressed last year.\nCorruption cases often involve employees working in upstream supply chains and downstream sales channels of the internet firms.\nDouyin also emphasized its commitment to continuously improving its systems and intensifying efforts to combat fraudulent activities, including commercial bribery and embezzlement."}, {"id": "1e25c739-2586-4a75-8e0c-7b8d4a25b0bf", "title": "", "date": "2024-08-21 00:30", "url": "http://www.israelnationalnews.com/news/394917", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Last night (Monday), the Paratrooper Brigade Combat Team, including the soldiers of the 75th Battalion and the Yahalom Unit, in a joint operation with the ISA, completed the operation to rescue the bodies of hostages in the Khan Yunis area.\nIn the operation, the bodies of hostages Nadav Popplewell, Yagev Buchshtab, Avraham Munder, Yoram Metzger, Haim Perry and Alexander Dancyg, were rescued and returned to the State of Israel.\nPopplewell, Metzger, and Perry were announced murdered in June, and Dancyg and Buchstab were reported murdered last month.\nDuring the operation, the forces located a tunnel shaft about 10 meters deep leading to an underground tunnel route where the bodies of the hostages were found.\nThe soldiers of the Yahalom Unit and the ISA investigated the route and neutralized the obstructions, blast doors, weapons, explosives and hideouts used by the terrorists."}, {"id": "c776a1ec-f981-4139-9978-c9f14a920202", "title": "Israel says it recovered bodies of 6 hostages in Gaza", "date": "2024-08-21 01:45", "url": "https://www.bostonglobe.com/2024/08/20/world/israel-says-it-recovered-bodies-6-hostages-gaza/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Of the roughly 250 people Israeli authorities say were taken hostage during the Hamas-led Oct. 7 attack, Israeli forces have so far rescued only seven hostages alive.\nJERUSALEM — Israeli forces recovered the bodies of six Israeli hostages from the southern Gaza Strip in an overnight operation, the Israeli military said Tuesday, highlighting the plight of the scores of captives remaining in the Palestinian enclave.\nWeeks later, the Israeli military said it was examining the possibility that the three hostages had been killed while Israeli forces were operating in the Khan Younis area.\nThe military said Israeli forces scanned the route and noticed that part of the tunnel’s concrete lining was loose.\nThe Israeli military has shrunk that zone repeatedly as it presses its assault."}, {"id": "4b80a521-ea40-4aee-b969-df706bf79369", "title": "Has Africa become a battleground for the new cold war ? It China vs America in Mother Continent – Firstpost", "date": "2024-08-21 02:15", "url": "https://www.firstpost.com/world/has-africa-become-a-battleground-for-the-new-cold-war-its-china-vs-america-in-mother-continent-13806603.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "The US-led West might have missed the trick but China’s Africa story begins in the 1950s, when Western powers rivalled, at times one another, to maintain their superiority in Africa.\nChina — along with India — vouched for freedom and self-reliance of African countries through several channels and platforms including the most-famous Bandung conference hosted by Indonesia.\nReutersSeven decades later, the communist China’s heft and growing presence in Africa have set up a race of one-upmanship in the Mother Continent.\nWhy call it a new cold warThe intensifying rivalry, particularly between China and the US over the African continent, bears striking resemblances to the Cold War of the 20th century.\nChina earlier policy of non-political interference helped it edge out the Western countries in developing cooperation with African countries."}, {"id": "ee0f4e05-d21d-4f6d-a882-371200c78cd0", "title": "The Challenge Johnny Bananas shares unaired footage of his Season 40 toast", "date": "2024-08-21 00:30", "url": "https://www.monstersandcritics.com/tv/reality-tv/the-challenges-johnny-bananas-shares-unaired-footage-of-his-season-40-toast/", "domain": "monstersandcritics.com", "domain_classification": "Unknown", "message": "Fans were likely surprised when Johnny Bananas, who was in the cast of Season 40, Battle of the Eras, didn’t give the toast he typically does when on the show.\nBananas gave a toast celebrating The Challenge’s 40 seasons and former castmatesTaking to his Instagram, Bananas and The Ringer Reality TV shared the unaired toast he gave for Battle of the Eras.\nRachel spoke about her Season 40 toast and women driving The Challenge ratingsLast week, Rachel shared a video clip about how she gave the traditional toast for The Challenge: Battle of the Eras.\nHowever, she said her good friend Tina Barta encouraged her to do a Season 40 toast.\nThat carried over to Season 40, as did storylines featuring rivals Cara Maria Sorbello and Laurel Stucky or Amanda Garcia and Tori Deal."}, {"id": "e84c90b2-ecb5-4fd7-b3fe-807ad1b74004", "title": "Dino Death Match", "date": "2024-08-21 04:15", "url": "https://www.tvguide.co.uk/schedule/9ae35a9b-7ca3-5e7e-bba4-1952cf423592/dino-death-match", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Dino Death MatchNational Geographic WILD HD 10:00 AM to 11:00 AM Wednesday 21 August Share Add toCalendar +Dino Death MatchDocumentary examining fossilised remains of two dinosaurs locked in combat, which may provide evidence of a previously unknown species of predatorDino Death Match airs on National Geographic WILD HD at 10:00 AM, Wednesday 21 August .\nLearn more about Dino Death Match and other education/science/factual topics on our factual page"}, {"id": "f0cd8279-c2f1-48a4-b5cf-d7451fd3f584", "title": "What the papers say – August 21", "date": "2024-08-21 00:30", "url": "https://www.standard.co.uk/news/uk/mike-lynch-svengoran-eriksson-italian-daily-express-daily-mail-b1177598.html", "domain": "standard.co.uk", "domain_classification": "Unknown", "message": "* FIRST NAME* LAST NAME* EMAIL Your email address* PASSWORD Must be at least 6 characters, include an upper and lower case character and a number Show* YEAR OF BIRTH You must be at least 18 years old to create an account 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 1996 1995 1994 1993 1992 1991 1990 1989 1988 1987 1986 1985 1984 1983 1982 1981 1980 1979 1978 1977 1976 1975 1974 1973 1972 1971 1970 1969 1968 1967 1966 1965 1964 1963 1962 1961 1960 1959 1958 1957 1956 1955 1954 1953 1952 1951 1950 1949 1948 1947 1946 1945 1944 1943 1942 1941 1940 1939 1938 1937 1936 1935 1934 1933 1932 1931 1930 1929 1928 1927 1926 1925 1924 1923 1922 1921 1920 1919 1918 1917 1916 1915 1914 1913 1912 1911 1910 1909 1908 1907 1906* Required fieldsI would like to be emailed about offers, events and updates from Evening Standard.\nRead our privacy noticeCREATE ACCOUNTI'LL TRY LATERAlready have an account?\nSIGN INBy clicking Create Account you confirm that your data has been entered correctly and you have read and agree to our Terms of use , Cookie policy and Privacy policy .\nThis site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."}, {"id": "d2a811df-32c6-4787-ae19-12982864e94b", "title": "US and South Korea begin military drills aimed at stren ... ", "date": "2024-08-21 01:00", "url": "https://accesswdun.com/article/2024/8/1258398", "domain": "accesswdun.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — U.S. and South Korean troops kicked off a large-scale exercise Monday aimed at strengthening their combined defense capabilities against nuclear-armed North Korea, which again accused the allies of practicing an invasion.\nThe U.S. and South Korean militaries did not immediately react to the North Korean Foreign Ministry statement.\nAbout 19,000 South Korean military personnel will participate in the drills, which will be held concurrently with civil defense and evacuation drills from Monday through Thursday that will include programs based on North Korean nuclear attack scenarios.\nThe drills could trigger a belligerent response from North Korea, which has been flaunting its growing weapons program and issuing verbal threats of nuclear conflicts against Washington and Seoul.\nDuring last year’s Ulchi Freedom Shield exercises, North Korea conducted ballistic missile tests that it described as simulating “scorched earth” nuclear strikes on South Korean targets."}, {"id": "aca531e6-87e0-42d7-8f24-3e1df2f5eb65", "title": "Lessons to grow the local stock market from fantasyland Great Eastern - Income Insurance union", "date": "2024-08-21 02:45", "url": "https://www.businesstimes.com.sg/opinion-features/lessons-grow-local-stock-market-fantasylands-great-eastern-income-insurance-union", "domain": "businesstimes.com.sg", "domain_classification": "Unknown", "message": "Fears of a hard landing for the United States economy sent stock markets in the US, Europe and Asia, including Singapore, plunging in early August.\nStill, a slowing US economy may not hurt Singapore businesses that much.\nMany local businesses can count on growth in South-east Asia and a resilient domestic economy, where the government has ample fiscal firepower to fuel growth.\nMoreover, lowering of interest rates in the US and elsewhere to combat slowing economic growth will help many businesses by reducing financing costs and share prices of listed entities as investors apply lower discount rates to future earnings.\nAlso, many local stocks are generally defensive and pay good dividends."}, {"id": "5a18bf81-dde7-4b2c-9b02-7c7ade071dde", "title": "Worthplaying |  Marvel Rival Adds Captain America And Winter Soldier To Its Roster , Gets December Release Date", "date": "2024-08-21 02:45", "url": "https://worthplaying.com/article/2024/8/20/news/143257-marvel-rivals-adds-captain-america-and-winter-soldier-to-its-roster-gets-december-release-date-trailer/", "domain": "worthplaying.com", "domain_classification": "Unknown", "message": "NetEase Games and Marvel Games announced that Marvel Rivals will officially launch on December 6, 2024 with all heroes free to play.\nBoth Captain America and the Winter Soldier will also join the roster, bringing their unique skills and powers to Marvel Rivals.\nMarvel Rivals is set to bring the fight to this year’s gamescom with a series of captivating events and exclusive content.\nMarvel Rivals lets you tear down walls to open shortcuts across the map or destroy a building’s foundation to collapse it on your foes.\nMarvel Rivals is coming to PS5, Xbox Series X|S and PC (Steam / Epic Games Store) on December 6, 2024."}, {"id": "37528831-0eda-44b9-a22f-6ba30933a980", "title": "Simon - Pop | TV Guide", "date": "2024-08-21 00:30", "url": "https://www.tvguide.co.uk/schedule/60ee89df-8937-59a0-8dd7-7f3c44c7aedb/simon", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "SimonPop 6:50 AM to 7:00 AM Wednesday 21 August Share Add toCalendar +The Battle of Superheroes Season 4 Episode 6 of 52After a big argument, Simon and Gaspard drop the key to their cabin in a big puddle.\nAnd in a blink they start imagining they'll have to dive into the puddle, which inevitably becomes a huge ocean, to find the key to their secret base camp.\nSimon airs on Pop at 6:50 AM, Wednesday 21 August ."}, {"id": "3f22a89d-6c1c-41f6-9fbf-2e8dbfc8e660", "title": "Tuesday Final Word", "date": "2024-08-21 04:30", "url": "https://hotair.com/ed-morrissey/2024/08/20/tuesdays-final-word-n3793440", "domain": "hotair.com", "domain_classification": "Unknown", "message": "Clearing the tabs while Democrats clear their throats ...===Men and women get their prayer rooms too, don’t worry!\nInstead, Biden ended up talking after most Americans had gone to bed, and given the nature of his speech, Democrats are probably better off for it.\nBut AOC’s address — and Democrats’ celebration of it — has betrayed the party’s true direction with Harris at the helm.\nEd: It's not so much her speech at the convention but the choice slot the DNC assigned it.\n\"That will be the vision under President Harris,\" he added."}, {"id": "0c79b63b-77bc-4461-bd04-51dfe27d9502", "title": "Golden Knights sign veteran winger to PTO", "date": "2024-08-21 04:30", "url": "https://www.yardbarker.com/nhl/articles/golden_knights_sign_veteran_winger_to_pto/s1_14825_40773319", "domain": "yardbarker.com", "domain_classification": "Unknown", "message": "The Vegas Golden Knights have signed forward Tanner Pearson to a professional tryout agreement.\nHe scored 13 points in those outings — a career-low in years he played in more than 20 games.\nThe move to Montreal ended Pearson’s stretch of five years with the Canucks, where he managed 114 points across 221 games.\nThe bulk of that scoring came in his first year in Vancouver, when Pearson managed a career-high 45 points in 69 games.\nIt continued the streak of 40-point scoring that he carried through six years with the Los Angeles Kings."}, {"id": "c08b59db-d56b-4ed6-858a-c2b8e8408af7", "title": "RFJ Jr considering joining forces with Trump in US presidential election", "date": "2024-08-21 02:30", "url": "https://www.jpost.com/us-elections/article-815630", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Independent US presidential candidate Robert F. Kennedy Jr. is considering ending his campaign to join forces with Republican rival Donald Trump, Kennedy's running mate said in an interview posted online on Tuesday.\n\"Or we walk away right now and join forces with Donald Trump,\" she told Los Angeles media company Impact Theory.\nThe interview, recorded on Monday, came days before Harris is to formally accept the Democratic nomination at the DNC, according to CNBC.\n\"I like him, and I respect him,\" Trump told the network in an interview after a campaign stop in Michigan.\nIn the interview released on Tuesday, Shanahan said Trump had taken an interest in their healthcare policies, making it worth exploring \"a unity party.\""}, {"id": "377e3dbe-6103-4fc0-9026-cbe7c404f76d", "title": "Overwatch 2 fans feel frustrated with Season 12 skin choices", "date": "2024-08-21 01:45", "url": "https://www.destructoid.com/overwatch-2-fans-feel-frustrated-with-season-12s-skin-choices/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Season 12 of Overwatch 2 is themed heavily around Egyptian gods, but Egyptian heroes like Ana and Pharah aren’t getting the spotlight.\nAnother Developer Update from Blizzard briefly goes over the team’s decision to give Reaper the Anubis skin.\nDespite this season’s theme, Egyptian heroes Ana and Pharah only had one skin each revealed in the Season 12 trailer.\nThe Pharah skin won’t even be available in the Battle Pass, instead being obtained from the shop.\nEspecially since this season is brimming with potential for Ana, Pharah, Ramattra, and Venture."}, {"id": "dc1a67be-c734-4938-8259-4de474380dd0", "title": "Ukraine Incursion : A Multi - Nation Operation", "date": "2024-08-21 01:30", "url": "https://www.devdiscourse.com/article/law-order/3058407-ukraines-incursion-a-multi-nation-operation", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Ukraine's incursion into Russia's Kursk region was orchestrated with the involvement of intelligence agencies from the United States, Britain, and Poland, Russia's foreign intelligence agency reported, as cited by the newspaper Izvestia on Wednesday.\nAccording to Izvestia, the Foreign Intelligence Service stated, 'The Ukrainian Armed Forces operation in the Kursk region was prepared with the participation of the U.S., UK, and Polish intelligence services.'\nThe service also disclosed that the units involved had undergone combat coordination in training centers located in the UK and Germany.\nWhile the Foreign Intelligence Service maintains it has 'reliable information' on these claims, it did not provide any supporting evidence to substantiate the assertions.\n(With inputs from agencies.)"}, {"id": "54d20659-951c-485f-b243-83f9acb4ffac", "title": "Jewish Home launching Employee Grocery Store", "date": "2024-08-21 00:15", "url": "https://www.yahoo.com/news/jewish-home-launching-employee-grocery-215708949.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ROCHESTER, N.Y. (WROC) — In an effort to combat the rising cost of living, Jewish Home, a local retirement community, is opening what it calls an Employee Grocery Store.\nJewish Home officials say the increasing cost of gas, utilities, and rent over the years has led to food insecurity for many, and they want to help.\nThe grocery store will be open at least twice per month and stocked with staples, fresh produce, frozen goods, and more.\nEligible hourly employees will be able to fill two large bags of food essentials at no cost.\n“It’s honestly wonderful,” Morgan Porach from Jewish Home said."}, {"id": "7028c2ad-9b98-4dea-8b12-94787158599c", "title": "145 - pound Prospect Christian Carr discusses UFC aspirations  I can compete with anybody in the world on any given day  ", "date": "2024-08-21 04:30", "url": "https://mymmanews.com/145-pound-prospect-christian-carr-discusses-ufc-aspirations-i-can-compete-with-anybody-in-the-world-on-any-given-day/", "domain": "mymmanews.com", "domain_classification": "Unknown", "message": "Interview with Christian Carr belowChristian Carr (3-1) discusses his featherweight fight against Ricardo Jimenez (1-5-1) at Art of War on October 4th.\nChristian also spoke about how he got into combat sports, why he hasn’t fought since December and his long-term goal of making it to the UFC.\n“My goal is definitely to fight in the UFC.\nI think I can compete with anybody in the world on any given day.\nContinuing to get better as a fight and show I’m one of the best fighters in my area, currently."}, {"id": "f7a36b75-fe37-4566-8a97-7bfd9c4bad08", "title": "Jewish Home launches free employee grocery store", "date": "2024-08-21 00:15", "url": "https://13wham.com/news/local/jewish-home-launches-free-employee-grocery-store", "domain": "13wham.com", "domain_classification": "Unknown", "message": "The is celebrating the grand opening of its employee grocery store, stocked with everything from fresh produce to frozen food, all free for employees.\nThe store will be open at least twice a month and eligible hourly employees can fill up to two large bags of food at no cost.\nJewish Hope officials hope it will help combat food insecurity due to the increased cost of goods like gas, utilities and rent.\n\"We have a very strong culture of empathy and compassion within the Jewish Home,\" said Michael King, president and CEO.\n\"We know that food insecurity is real and is a palpable fear for many of our employees."}, {"id": "8c33a234-2aa5-4d68-a6b0-b295c1e8d68c", "title": "Africa Gears Up for Mpox Vaccination Rollout", "date": "2024-08-21 03:00", "url": "https://www.devdiscourse.com/article/health/3058013-africa-gears-up-for-mpox-vaccination-rollout", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "In a significant move to combat the spread of mpox, the Democratic Republic of Congo (DRC) and several other African nations are poised to begin vaccinations.\nJean Kaseya, the director general of the Africa Centres for Disease Control and Prevention (Africa CDC), confirmed that the vaccination drive will commence imminently.\n\"We didn't start vaccinations yet.\nEnd of next week vaccines will start to arrive in DRC and other countries,\" Kaseya informed reporters.\nThis development marks a critical step in the fight against the viral infection as health officials ensure that all logistical and preparatory measures are thoroughly completed before the rollout."}, {"id": "08a6e038-2142-4496-90a8-6820073e481c", "title": "WWE NXT : Aug . 20 , 2024", "date": "2024-08-21 01:30", "url": "https://www.wwe.com/shows/wwenxt/2024-08-20", "domain": "wwe.com", "domain_classification": "Unknown", "message": "With the win, the team known as \"Fraxiom\" will officially challenge Chase U for the NXT Tag Team Title at No Mercy.\nCatch WWE action on Peacock, WWE Network, FOX, USA Network, Sony India and more.\nCatch WWE action on Peacock, WWE Network, FOX, USA Network, Sony India and more.\n#WWENXTOTM's Jaida Parker is officially heading to NXT No Mercy where she'll challenge Roxanne Perez for the NXT Women's Championship.\nCatch WWE action on Peacock, WWE Network, FOX, USA Network, Sony India and more."}]