[{"id": "ea0ad76b-c2d5-4ffc-ae9e-f61be5ef788e", "title": "Israel and Hezbollah exchange fire over Lebanon", "date": "2024-08-25 06:15", "url": "https://nypost.com/2024/08/25/world-news/israel-and-hezbollah-exchange-fire-over-lebanon/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Israel launched a series of airstrikes in southern Lebanon early Sunday in an attempt to stop a missile attack by Hezbollah — which later fired rockets into Israel’s northern area.\n7 Rockets are fired over the Israel-Lebanon border as Israel counter-attacked a Hezbollah assault in the Middle East on Sunday.\nDavid Saranga/X7 This photo shows a Hezbollah UAV intercepted by Israeli air forces over north Israel on August 25, 2024.\nDavid Saranga/XDespite the preventative attack, Hezbollah went forward with its plan and launched a major barrage of missiles on northern Israel.\nREUTERS7 Smoke billows from the site of an Israeli airstrike on Zibqin in southern Lebanon on August 25, 2024."}, {"id": "80635b62-0d5a-4c58-8d76-c6d73db3ec6e", "title": "Hezbollah launches rockets and drones into Israel as part of retaliation for senior commander assassination", "date": "2024-08-25 14:15", "url": "https://saudigazette.com.sa/article/645058/World/Hezbollah-launches-rockets-and-drones-into-Israel-as-part-of-retaliation-for-senior-commanders-assassination", "domain": "saudigazette.com.sa", "domain_classification": "Unknown", "message": "BEIRUT — Lebanese group Hezbollah announced on Sunday that it had launched hundreds of rockets and drones deep into Israel as part of the “first phase” of its response to Tel Aviv's assassination of its senior commander, Fouad Shukr.\nIn a statement, Hezbollah declared that “the first stage of our response to Shukr's assassination has been successfully completed.\"\nThe group detailed that this initial phase involved targeting Israeli military barracks and sites to facilitate the passage of offensive drones towards deep targets within Israel.\nHezbollah dismissed Israeli claims of carrying out “preemptive strikes” as \"empty\" and inconsistent with the situation on the ground.\nIn response, the Israeli army stated that it had launched preemptive strikes in southern Lebanon to prevent the Hezbollah barrage."}, {"id": "5116328b-58c6-46d2-aa14-a8520a6915a7", "title": "Who Was Fuad Shukr , Hezbollah Commander Whose Death Sparked Today Conflict", "date": "2024-08-25 07:15", "url": "https://www.ndtv.com/world-news/who-was-fuad-shukr-hezbollah-commander-whose-death-sparked-todays-confict-6413101", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Lebanon- based militant group Hezbollah fired a large number of missiles at Israel on Sunday, retaliating for the assassination of their senior commander Fuad Shukr in Beirut last month.\nWhile Hezbollah denied involvement in that attack, Israel responded with targeted airstrikes, assassinating Fuad Shukr and Hamas leader Ismail Haniyeh.\nWho was Hezbollah commander Fuad Shukr?\nHe was a close associate of Imad Mughniyeh, Hezbollah's former military commander who was assassinated in Damascus in 2008.\nFuad Shukr served as a senior military commander in Hezbollah's forces in southern Lebanon and was a member of the group's highest military body, the Jihad Council."}, {"id": "80b001b8-3153-4bdb-93bb-4af1d69bb232", "title": "Major Israel - Hezbollah missile exchange kills three in Lebanon as region monitors for escalation", "date": "2024-08-25 13:00", "url": "https://www.news24.com/news24/world/news/major-israel-hezbollah-missile-exchange-kills-three-in-lebanon-as-region-monitors-for-escalation-20240825", "domain": "news24.com", "domain_classification": "Local - Africa", "message": "Hezbollah and Israel exchanged missile strikes in one of the biggest clashes along the Lebanon border in 10 months.\nDEVELOPING | Israel strikes Lebanon as Hezbollah launches 'first phase' response to chief's killingThree deaths were confirmed in Lebanon and none in Israel, where damage appeared to be limited.\nEarlier, Israel launched what it called ‘pre-emptive’ strikes on southern Lebanon.\nIsrael's security cabinet met at 07:00 (04:00 GMT) and the full cabinet is meeting on Sunday afternoon.\nHezbollah and Israel have been exchanging fire constantly ever since, while avoiding a major escalation as war rages in Gaza to the south."}, {"id": "1fc9a119-e54f-4d63-822c-1c32dd5d5aed", "title": "Hezbollah claims 320 rockets fired at Israel in  first phase  of retaliation", "date": "2024-08-25 07:15", "url": "https://www.ynetnews.com/article/s1wy74doa", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "Following theIDF's preemptive strike on southern Lebanon, Hezbollah issued two statements on Sunday morning, detailing what it described as the \"first phase\" of its response to theassassination of its military chief Fuad Shukr in Beirut"}, {"id": "07dd0d4d-0229-4c81-9ef1-332268887d79", "title": "Netanyahu warns strikes in Lebanon  not the final word  ", "date": "2024-08-25 13:45", "url": "https://www.rte.ie/news/2024/0825/1466577-middle-east-lebanon-israel/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu has warned that today's strikes in Lebanon were \"not the final word\" in his country's military campaign against Lebanese armed group Hezbollah.\nA Hezbollah UAV is intercepted by Israeli air forces over north IsraelOne Israeli navy soldier was killed and two wounded during combat.\nThe strikes destroyed thousands of launcher barrels, aimed mostly at northern Israel but also targeting some central areas, Israel's military said.\nDefense Minister Yoav Gallant declared a state of emergency and Foreign Minister Israel Katz said Israel would respond to developments on the ground but did not seek a full-scale war.\nA security source in Lebanon said at least 40 Israeli strikes had hit various towns in the country's south in one of the densest bombardments since hostilities began in October."}, {"id": "26856abe-0e1a-42dc-8fe3-5c6cc3449de1", "title": "Inside Israel dramatic dawn raid on Hezbollah Lebanon missile bases as WW3 looms - World News", "date": "2024-08-25 07:15", "url": "https://www.mirror.co.uk/news/world-news/inside-israels-dramatic-dawn-raid-33533888", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Israel's military says it is staging pre-emptive airstrikes inside Lebanon targeting positions of the Shiite militia Hezbollah in a major escalation that could threaten to develop into all-out war.\nThe Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIt said the operation was targeting \"a qualitative Israeli military target that will be announced later\" as well as \"enemy sites and barracks and Iron Dome (missile defence) platforms.\"\nImage: AFP via Getty Images) AFP via Getty Images)\"At his direction, senior U.S. officials have been communicating continuously with their Israeli counterparts,\" Savett added.\nRear Adm. Daniel Hagari, another Israeli military spokesman, said the military had struck in self-defense."}, {"id": "e3561c89-8325-4777-a288-f871c736a471", "title": "Hezbollah launches drone attacks into Israel , Southern Lebanon pounded", "date": "2024-08-25 07:45", "url": "https://www.albawaba.com/news/hezbollah-launches-drone-attacks-israel-1582680", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "UPDATELebanese Prime Minister Najib Mikati has called for an emergency ministerial committee meeting in light of the latest escalation in Southern Lebanon.\nThe statement comes as the Israeli Army announced launching dozens of airstrikes on southern Lebanon as a preemptive measure in response to Hezbollah's suspected plans to launch missiles toward Israel.\nOver forty airstrikes were carried out simultaneously by Israeli fighter planes against seventeen different cities and localities in southern Lebanon.\nIn a message addressed to the residents of Southern Lebanon in Arabic, the Israeli Army said: \"We are monitoring Hezbollah's preparations to carry out large-scale attacks on Israeli territory near your homes.\nIn response, Israeli armed forces announced targeting Hamas positions inside the Gaza Strip."}, {"id": "ad08cf10-9996-4b30-9e21-95d803cb75fd", "title": "Hezbollah launches missile barrage at Israel to avenge senior commander", "date": "2024-08-25 05:00", "url": "https://www.moneycontrol.com/news/world/hezbollah-launches-missile-barrage-at-israel-to-avenge-senior-commander-12806009.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "You are already a Moneycontrol Pro user."}, {"id": "25d0b96d-7686-4023-bf12-2fd9241e86a2", "title": "Hizbullah targets Israel with missile barrage in retaliation for death of senior commander", "date": "2024-08-25 07:45", "url": "https://www.irishtimes.com/world/middle-east/2024/08/25/israel-hizbullah-hamas-war-gaza-latest-news/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "One Israel navy soldier was killed and two wounded during combat in northern Israel on Sunday, the Israeli military said.\nIsrael’s minister for foreign affairs said the country did not seek a full-scale war.\nIsrael’s military said it had foiled a much larger attack with pre-emptive air strikes after assessing that Hizbullah was preparing to launch the barrage, using 100 jets to strike more than 40 Hizbullah launch sites in southern Lebanon.\nThe strikes destroyed thousands of launcher barrels, aimed mostly at northern Israel but also targeting some central areas, Israel’s military said.\nIsrael’s security cabinet met at 7am (4am Irish time) and the full cabinet is meeting on Sunday afternoon."}, {"id": "25caec98-db9b-432e-9582-aaf6a6f22977", "title": "Hezbollah launches missile barrage at Israel to avenge top commander", "date": "2024-08-25 07:30", "url": "http://www.koreaherald.com/view.php?ud=20240825050134", "domain": "koreaherald.com", "domain_classification": "Unknown", "message": "A view shows smoke and fire on the Lebanese side of the border with Israel, after Israel said it had noted armed group Hezbollah preparing to attack Israel and had carried out pre-emptive strikes on Hezbollah targets in Lebanon, as seen from Tyre, Sunday.\nIsraeli jets hit targets in Lebanon shortly before the strikes, as the military assessed that Hezbollah was preparing to begin the barrage, the military said.\nHezbollah said it had launched more than 320 Katyusha rockets toward Israel and hit 11 military targets.\n\"We have conducted precise strikes in Lebanon in order to thwart an imminent threat against the citizens of Israel.\nHezbollah fired missiles at Israel immediately after the Oct. 7 attacks by Hamas gunmen on Israel."}, {"id": "440a46de-3444-4e63-b58f-6e4a3fee31c7", "title": "Hezbollah launches missile barrage at Israel to avenge top commander", "date": "2024-08-25 08:00", "url": "https://www.odt.co.nz/news/world/hezbollah-launches-missile-barrage-israel-avenge-top-commander", "domain": "odt.co.nz", "domain_classification": "Unknown", "message": "A supporter holds a poster of Hezbollah's top commander Fuad Shukr during a ceremony to mark the first week since his death on August 6, 2024 in Beirut, Lebanon.\nIsraeli jets hit targets in Lebanon shortly before the strikes as the military assessed that Hezbollah was preparing to begin the barrage, the military said.\nHezbollah said it had launched more than 320 Katyusha rockets towards Israel and hit 11 military targets.\nForeign Minister Israel Katz said Israel would respond to developments on the ground but did not seek a full-scale war.\nHezbollah fired missiles at Israel immediately after the October 7 attacks by Hamas gunmen on Israel."}, {"id": "b88086d9-dc8f-4d1a-82c5-eb968e6443ca", "title": "Middle East crisis live : Hezbollah retaliates with hundreds of rockets after Israel launches airstrikes in Lebanon", "date": "2024-08-25 08:00", "url": "https://www.independent.co.uk/news/world/middle-east/israel-iran-attack-update-hezbollah-hamas-lebanon-b2601466.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Israel launched a series of nearly 40 airstrikes in southern Lebanon early on Sunday in what it described as a “preemptive attack” to prevent an imminent Hezbollah drone and rocket strike.\n“The IDF is striking terror targets in Lebanon from which Hezbollah was planning to launch attacks on Israeli civilians,” Israeli military spokesperson Daniel Hagari said, calling it a “self-defence act”.\nThe escalation came as mediated talks for a ceasefire in Gaza stalled and raised fears of a broader war in the region.\nIsrael and Hezbollah have been exchanging fire almost daily since the Israel started an air and ground war in Gaza on October 7, displacing tens of thousands of people on both sides of the border and edging the region closer to a regional war."}, {"id": "aba568ee-95b4-4c3e-a4db-0ff744fb44dd", "title": "Hezbollah launches missiles at Israel to avenge commander", "date": "2024-08-25 06:45", "url": "https://tribune.com.pk/story/2490833/hezbollah-launches-missiles-at-israel-to-avenge-commander", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "A view shows smoke and fire on the Lebanese side of the border with Israel, after Israel said it had noted armed group Hezbollah preparing to attack Israel and had carried out pre-emptive strikes on Hezbollah targets in Lebanon, as seen from Tyre, southern Lebanon August 25, 2024.\nIsraeli jets hit targets in Lebanon shortly before the strikes were launched as the military assessed that Hezbollah was preparing to begin the barrage.\nIn response to these threats, the IDF is striking terror targets in Lebanon,\" the Israel Defence Forces said in a statement.\nIt warned civilians in southern Lebanon to stay away from areas where Hezbollah operates.\nHezbollah and Israel have been exchanging fire constantly ever since, while avoiding a major escalation as war rages in Gaza to the south."}, {"id": "3022289d-f6ea-4265-8a48-9f178f783b87", "title": "Israel launches  pre - emptive  air strikes against Hezbollah", "date": "2024-08-25 07:15", "url": "https://www.dailymail.co.uk/news/article-13777625/Israel-launches-pre-emptive-air-strikes-against-Hezbollah-Lebanon.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Israel has launched a series of pre-emptive air strikes against Hezbollah in Lebanon in a major escalation amid plans for a large-scale attack.\nThe second set of strikes hit 'Hezbollah launchers in several areas in southern Lebanon to remove threats.'\nHezbollah Israel's comments that its strikes were pre-emptive were 'empty', claiming that they 'contradict the facts on the ground and will be refuted' later today.\nIn a message to his country, Netanyahu said: 'Early in the morning we identified Hezbollah's preparations to attack Israel.\nHis foreign minister, Israel Katz, later added that the nation 'will do whatever it takes to protect citizens.'"}, {"id": "a9ca91d2-d43e-4947-aa37-e10cd8918047", "title": "Israel hits back with airstrikes after Hezbollah rocket barrage", "date": "2024-08-25 07:15", "url": "https://www.euronews.com/2024/08/25/israel-hits-back-with-airstrikes-after-hezbollah-rocket-barrage", "domain": "euronews.com", "domain_classification": "Unknown", "message": "Israel launched a wave of airstrikes across southern Lebanon early on Sunday whilst Hezbollah fired hundreds of rockets and drones at it.\nThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nAt least three people were killed in the strikes on Lebanon, while there were no reports of casualties in Israel, although at least one house in Acre in northern Israel was damaged.\nThe Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel."}, {"id": "e09e2292-fd9e-4ce3-8119-724fdb7b993a", "title": "Israel stages heavy airstrikes on Lebanon as Hezbollah launches attack over slain top commander", "date": "2024-08-25 12:30", "url": "https://www.dailypioneer.com/2024/top-stories/israel-stages-heavy-airstrikes-on-lebanon-as-hezbollah-launches-attack-over-slain-top-commander.html", "domain": "dailypioneer.com", "domain_classification": "Unknown", "message": "The Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nAir raid sirens were reported throughout northern Israel, and Israel's Ben-Gurion international airport closed and diverted flights for approximately an hour due to the threat of attack.\nIsrael's Home Front Command has raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks, and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights."}, {"id": "e74a40d8-c1cd-402f-bca2-4573c19d8691", "title": "Israel stages heavy airstrikes on Lebanon as Hezbollah launches attack over slain top commander", "date": "2024-08-25 07:15", "url": "https://www.clickorlando.com/news/world/2024/08/25/israel-stages-heavy-airstrikes-on-lebanon-as-hezbollah-launches-attack-over-slain-top-commander/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "JERUSALEM – Israel launched a wave of airstrikes across southern Lebanon early Sunday in what it said was a preemptive strike to avert a large Hezbollah attack.\nRecommended VideosThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nIranian state media on Sunday played up the Hezbollah attack, calling it a success, but there was no immediate comment from Iranian officials."}, {"id": "d848f61c-57c5-45e9-a263-6449abaaa42e", "title": "Israel stages heavy airstrikes on Lebanon as Hezbollah launches attack over slain top commander", "date": "2024-08-25 07:00", "url": "https://www.wsls.com/news/world/2024/08/25/israel-stages-heavy-airstrikes-on-lebanon-as-hezbollah-launches-attack-over-slain-top-commander/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "JERUSALEM – Israel launched a wave of airstrikes across southern Lebanon early Sunday in what it said was a preemptive strike to avert a large Hezbollah attack.\nRecommended VideosThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nIranian state media on Sunday played up the Hezbollah attack, calling it a success, but there was no immediate comment from Iranian officials."}, {"id": "1b7a01de-0365-48b5-96d9-1eb2ce40b1fb", "title": "Israel stages heavy airstrikes on Lebanon as Hezbollah launches attack over slain top commander", "date": "2024-08-25 06:45", "url": "https://isp.netscape.com/news/world/story/0001/20240825/52056075daebc9aac6675043f64439ab", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Israel and Hezbollah trade heavy fire before pulling back, jolting a region braced for warJERUSALEM (AP) — Israel launched a wave of airstrikes across southern Lebanon early Sunday in what it said was a preemptive strike to avert a large Hezbollah attack.\nThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nIranian state media on Sunday played up the Hezbollah attack, calling it a success, but there was no immediate comment from Iranian officials."}, {"id": "95b2cfc9-d98a-4c94-840e-4f001fda1fa1", "title": "Middle East tinderbox : Israel is warned  not to open new front  after pummelling Lebanon with pre - emptive missile strikes - while Hezbollah launches hundreds of rockets and drones as regional tensions come to a head", "date": "2024-08-25 13:30", "url": "https://www.dailymail.co.uk/news/article-13777983/Middle-East-tinderbox-Israel-warned-not-open-new-pummelling-Lebanon-pre-emptive-missile-strikes-Hezbollah-launches-hundreds-rockets-drones-regional-tensions-come-head.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "The second set of strikes hit 'Hezbollah launchers in several areas in southern Lebanon to remove threats.'\nSeveral nations and international bodies have warned Hezbollah and Israel not to escalate tensions in the already precarious Middle East.\nHezbollah Israel's comments that its strikes were pre-emptive were 'empty', claiming that they 'contradict the facts on the ground and will be refuted' later today.\nIn a message to his country, Netanyahu said: 'Early in the morning we identified Hezbollah's preparations to attack Israel.\nHis foreign minister, Israel Katz, later added that the nation 'will do whatever it takes to protect citizens.'"}, {"id": "27a1ea86-16ea-43eb-a5c7-038faaa6d3b1", "title": "Battlefield shifting from Gaza to Lebanon ? Hezbollah , Israel exchange heavy strikes", "date": "2024-08-25 13:45", "url": "https://www.firstpost.com/world/battlefield-shifting-from-gaza-to-lebanon-hezbollah-israel-exchange-heavy-strikes-13808081.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "The battlefield is shifting from Gaza to Lebanon as Hezbollah and Israel engage in heavy strikes, with Hezbollah launching hundreds of rockets and Israel responding with extensive airstrikes on Hezbollah positions.\nThe strikes destroyed thousands of launcher barrels, aimed mostly at northern Israel but also targeting some central areas, Israel’s military said.\nDefense Minister Yoav Gallant declared a state of emergency and Foreign Minister Israel Katz said Israel would respond to developments on the ground but did not seek a full-scale war.\nHezbollah fired missiles at Israel immediately after the Oct. 7 attacks by Hamas gunmen on Israel.\nHezbollah and Israel have been exchanging fire constantly ever since, while avoiding a major escalation as war rages in Gaza to the south."}, {"id": "6c95e7ef-8f1e-43ad-8ef6-cbfc0b067547", "title": "Hezbollah launches missile barrage at Israel to avenge senior commander", "date": "2024-08-25 05:15", "url": "https://www.channelnewsasia.com/world/hezbollah-launches-missile-barrage-israel-avenge-senior-commander-4566406", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "Three deaths were confirmed in Lebanon and none in Israel, where damage appeared to be limited.\nHezbollah indicated it was not planning further strikes yet.\nA Hezbollah official said it had delayed its retaliation to give a chance for ongoing Gaza ceasefire talks and other \"political considerations\".\nIsrael's military said it had foiled a much larger attack with pre-emptive airstrikes on 40 launch sites after assessing that Hezbollah was preparing to launch the barrage.\nNetanyahu said Israel took pre-emptive action against Hezbollah, adding that air defences had intercepted all drones launched against a strategic target in central Israel."}, {"id": "6ec67ef4-4210-42d2-9b56-f75333a8dea1", "title": "Hezbollah launches missile barrage at Israel to avenge senior commander", "date": "2024-08-25 06:00", "url": "https://www.thedailystar.net/news/world/news/hezbollah-launches-missile-barrage-israel-avenge-senior-commander-3685911", "domain": "thedailystar.net", "domain_classification": "Unknown", "message": "Israeli jets hit targets in Lebanon shortly before the strikes were launched as the military assessed that Hezbollah was preparing to begin the barrage.\nIn response to these threats, the IDF is striking terror targets in Lebanon,\" the Israel Defence Forces said in a statement.\nExpectations of an escalation between the two sides had risen since a missile strike in the Israeli-occupied Golan Heights last month killed 12 youngsters and the Israeli military assassinated a senior Hezbollah commander in Beirut in response.\nHezbollah fired missiles at Israel immediately after the Oct. 7 attacks by Hamas gunmen on Israel.\nThat precarious balance appeared to shift after the strike in the Golan Heights, for which Hezbollah denied responsibility, and the subsequent assassination of Fuad Shukr, a senior military commander in Beirut."}, {"id": "43af3a18-11b9-4a95-ac06-85ea31521f96", "title": "Hezbollah launches missile barrage at Israel", "date": "2024-08-25 04:45", "url": "https://www.rte.ie/news/2024/0825/1466577-middle-east/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Israeli Prime Minister Benjamin Netanyahu has warned that today's strikes in Lebanon were \"not the final word\" in his country's military campaign against Lebanese armed group Hezbollah.\nA Hezbollah UAV is intercepted by Israeli air forces over north IsraelOne Israeli navy soldier was killed and two wounded during combat.\nThe strikes destroyed thousands of launcher barrels, aimed mostly at northern Israel but also targeting some central areas, Israel's military said.\nDefense Minister Yoav Gallant declared a state of emergency and Foreign Minister Israel Katz said Israel would respond to developments on the ground but did not seek a full-scale war.\nA security source in Lebanon said at least 40 Israeli strikes had hit various towns in the country's south in one of the densest bombardments since hostilities began in October."}, {"id": "d66f0a6f-c822-4852-b54b-2aefbf0f72cc", "title": "Hezbollah launches missile barrage at Israel to avenge senior commander", "date": "2024-08-25 07:15", "url": "https://www.asiaone.com/world/hezbollah-launches-missile-barrage-israel-avenge-senior-commander", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "In response to these threats, the IDF is striking terror targets in Lebanon,\" the Israel Defence Forces said in a statement.\nExpectations of an escalation between the two sides had risen since a missile strike in the Israeli-occupied Golan Heights last month killed 12 youngsters and the Israeli military assassinated a senior Hezbollah commander in Beirut in response.\nHezbollah fired missiles at Israel immediately after the Oct 7 attacks by Hamas gunmen on Israel.\nThat precarious balance appeared to shift after the strike in the Golan Heights, for which Hezbollah denied responsibility, and the subsequent assassination of Fuad Shukr, a senior military commander in Beirut.\nALSO READ: Israel says strike kills elite Hezbollah unit field commander"}, {"id": "c9593661-5ecb-413d-b95f-217ddbbf91e2", "title": "Major Israel - Hezbollah missile exchange as region watches for escalation", "date": "2024-08-25 13:00", "url": "https://www.rappler.com/world/middle-east/israel-lebanon-hezbollah-missile-exchange-august-25-2024/", "domain": "rappler.com", "domain_classification": "Unknown", "message": "The strikes destroyed thousands of launcher barrels, aimed mostly at northern Israel but also targeting some central areas, Israel’s military said.\nIsrael’s security cabinet met at 7 am (0400 GMT) and the full cabinet is meeting on Sunday afternoon.\nThe Israeli military told people to limit gatherings, a restriction it later lifted, and said people could go to work if they could reach air raid shelters quickly.\nAn Israeli strike on al-Tiri killed two other people according to a security source and a medical sources.\nHezbollah and Israel have been exchanging fire constantly ever since, while avoiding a major escalation as war rages in Gaza to the south."}, {"id": "09f572d8-b412-4ea0-ab41-a9db442a25c4", "title": "Israelis stage heavy airstrikes in Lebanon ; Hezbollah launches drone attack on Israel", "date": "2024-08-25 06:30", "url": "https://www.voanews.com/a/israel-says-it-is-staging-airstrikes-inside-lebanon-targeting-hezbollah/7756104.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael's Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' October 7 attack into Israel."}, {"id": "eabe777c-b0d4-4346-bbe0-5aea1a39461b", "title": "Israel stages heavy airstrikes on Lebanon as Hezbollah launches attack over slain top commander", "date": "2024-08-25 09:15", "url": "https://www.thestandard.com.hk/breaking-news/section/6/219762/Israel-stages-heavy-airstrikes-on-Lebanon-as-Hezbollah-launches-attack-over-slain-top-commander", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "The Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nLast week, Israel’s defense minister said he was moving more troops toward the Lebanese border in anticipation of possible fighting with Hezbollah.\nRear Adm. Daniel Hagari, another Israeli military spokesman, said the military had struck in self-defense.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "d0051a46-6dc1-418e-9778-30d56d567333", "title": "Hezbollah launches missiles at Israel , prompting airstrikes on Lebanon", "date": "2024-08-25 10:45", "url": "https://www.swissinfo.ch/eng/hezbollah-launches-missiles-at-israel,-prompting-airstrikes-on-lebanon/87434320", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "The strikes destroyed thousands of launcher barrels, aimed mostly at northern Israel but also targeting some central areas, Israel’s military said.\nIsrael’s security cabinet met at 7 a.m. (0400 GMT) and the full cabinet is meeting on Sunday afternoon.\nDefense Minister Yoav Gallant declared a state of emergency and Foreign Minister Israel Katz said Israel would respond to developments on the ground but did not seek a full-scale war.\nAn Israeli strike on al-Tiri killed two other people according to a security source and a medical sources.\nHezbollah and Israel have been exchanging fire constantly ever since, while avoiding a major escalation as war rages in Gaza to the south."}, {"id": "dbfb1e10-2373-4e30-8ee3-90b43ad38732", "title": "Hizbollah launches missiles at Israel , prompting airstrikes on Lebanon", "date": "2024-08-25 14:30", "url": "https://www.businesstimes.com.sg/international/hizbollah-launches-missiles-israel-prompting-airstrikes-lebanon", "domain": "businesstimes.com.sg", "domain_classification": "Unknown", "message": "Defence Minister Yoav Gallant declared a state of emergency and Foreign Minister Israel Katz said Israel would respond to developments on the ground but did not seek a full-scale war.\nA security source in Lebanon said at least 40 Israeli strikes had hit various towns in the country’s south in one of the densest bombardments since hostilities began in October.\nIt felt like the apocalypse.”Israel’s Army Radio, citing defence officials, said the military assessed that the Hizbollah barrage on northern Israel was “improvised” after the pre-emptive strike by Israeli jets on the Hizbollah launch sites.\nHizbollah fired missiles at Israel immediately after the Oct 7 attacks by Hamas gunmen on Israel.\nHizbollah and Israel have been exchanging fire constantly ever since, while avoiding a major escalation as war rages in Gaza to the south."}, {"id": "12987469-91ae-40e4-a63f-4f1838bc7b5e", "title": "Hezbollah launches missile barrage at Israel to avenge top commander", "date": "2024-08-25 07:30", "url": "https://www.timeslive.co.za/news/world/2024-08-25-hezbollah-launches-missile-barrage-at-israel-to-avenge-top-commander/", "domain": "timeslive.co.za", "domain_classification": "Unknown", "message": "Please click here to view our site optimised for your device."}, {"id": "a3da3d8a-afa8-46be-82e8-fc6a453669de", "title": "Russians launch missile strikes on Kharkiv and Chuhuiv", "date": "2024-08-25 06:45", "url": "https://www.yahoo.com/news/russians-launch-missile-strikes-kharkiv-010646185.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Russians launched a missile attack on cities of Kharkiv and Chuhuiv on the morning of 25 August.\nSource: Kharkiv Mayor Ihor Terekhov; Oleh Syniehubov, Head of Kharkiv Oblast Military AdministrationQuote from Terekhov: \"A powerful explosion has rung out in Kharkiv.\nQuote from Syniehubov: \"Kharkiv and the district: stay in shelters!\nUpdate: Later, Syniehubov said that the Russians had launched a missile attack on Kharkiv and Chuhuiv.\nQuote from Syniehubov: \"In Chuhuiv, the enemy struck the residential sector, a 4-year-old child was among the injured."}, {"id": "1bd2f735-a9cc-446f-a3a5-c4d1d4ce35c4", "title": "Hezbollah launches missile barrage at Israel to avenge top commander - World", "date": "2024-08-25 07:15", "url": "https://www.brecorder.com/news/40319177/hezbollah-launches-missile-barrage-at-israel-to-avenge-top-commander", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "Israeli jets hit targets in Lebanon shortly before the strikes as the military assessed that Hezbollah was preparing to begin the barrage, the military said.\nHezbollah said it had launched more than 320 Katyusha rockets towards Israel and hit 11 military targets.\nMost of the Israeli strikes were hitting targets in southern Lebanon but the military was ready to strike anywhere there was a threat, an Israeli military spokesperson said.\nThe Israeli military issued civil defence instructions limiting gatherings but authorising people to go to their workplaces as long as they were able to reach air raid shelters quickly.\nHezbollah fired missiles at Israel immediately after the Oct. 7 attacks by Hamas gunmen on Israel."}, {"id": "cdebcf9a-440b-4501-a3da-49b4b7f3fabb", "title": "Major Israel - Hezbollah missile exchange as region watches for escalation", "date": "2024-08-25 12:30", "url": "https://www.aol.com/israeli-military-says-jets-striking-023312090.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Israel's military said it had foiled a much larger attack with pre-emptive airstrikes on 40 launch sites after assessing that Hezbollah was preparing to launch the barrage.\nNetanyahu said Israel took pre-emptive action against Hezbollah, adding that air defences had intercepted all drones launched against a strategic target in central Israel.\nDefence Minister Yoav Gallant declared a state of emergency and Foreign Minister Israel Katz said Israel would respond to developments on the ground but did not seek a full-scale war.\n\"Israel should, as it did this morning, deliver a pre-emptive strike.\nHezbollah and Israel have been exchanging fire constantly ever since, while avoiding a major escalation as war rages in Gaza to the south."}, {"id": "765150e7-3fb3-4f06-8671-f5e40dfc2c9e", "title": "Israel and Hezbollah trade heavy fire before pulling back , jolting a region braced for war", "date": "2024-08-25 13:45", "url": "https://www.stltoday.com/news/nation-world/israel-and-hezbollah-trade-heavy-fire-before-pulling-back-jolting-a-region-braced-for-war/article_572418de-62c1-11ef-9612-1ff18349fa80.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "d937ca9a-bc34-47c2-a1c6-960ab78522f4", "title": "Major Israel - Hezbollah missile exchange as region watches for escalation", "date": "2024-08-25 12:30", "url": "https://www.swissinfo.ch/eng/major-israel-hezbollah-missile-exchange-as-region-watches-for-escalation/87434320", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "The strikes destroyed thousands of launcher barrels, aimed mostly at northern Israel but also targeting some central areas, Israel’s military said.\nIsrael’s security cabinet met at 7 a.m. (0400 GMT) and the full cabinet is meeting on Sunday afternoon.\nDefense Minister Yoav Gallant declared a state of emergency and Foreign Minister Israel Katz said Israel would respond to developments on the ground but did not seek a full-scale war.\nAn Israeli strike on al-Tiri killed two other people according to a security source and a medical sources.\nHezbollah and Israel have been exchanging fire constantly ever since, while avoiding a major escalation as war rages in Gaza to the south."}, {"id": "2f81fe55-5707-475f-a61b-701629a5de9d", "title": "Hezbollah launches missile barrage at Israel", "date": "2024-08-25 06:30", "url": "https://www.omanobserver.om/article/1158126/world/region/hezbollah-launches-missile-barrage-at-israel", "domain": "omanobserver.om", "domain_classification": "Unknown", "message": "Hezbollah launched hundreds of rockets and drones against Israel on Sunday in retaliation for the assassination of a senior commander in Beirut last month, the Iranian-backed movement said, as Israel's cabinet met to prepare a response.\nIsraeli jets hit targets in Lebanon shortly before the strikes as the military assessed that Hezbollah was preparing to begin the barrage, the military said.\nHezbollah said it had launched more than 320 Katyusha rockets towards Israel and hit 11 military targets.\nIt said the barrage had completed \"the first phase\" of its response to the assassination of Fuad Shukr, a senior commander, in Beirut but that the full response would take \"some time\".\nDefence Minister Yoav Gallant said Israel would do whatever necessary to defend itself."}, {"id": "e88130d9-829a-4b34-b73e-f6d94d952b5c", "title": "Fires Break Out on Abandoned Greek - Flagged Oil Tanker Sounion That Yemen Rebels Attacked in Red Sea", "date": "2024-08-25 03:00", "url": "https://www.theyeshivaworld.com/news/general/2308414/fires-break-out-on-abandoned-greek-flagged-oil-tanker-sounion-that-yemen-rebels-attacked-in-red-sea.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Fires broke out Friday on a Greek-flagged oil tanker previously attacked by Yemen’s Houthi rebels this week, with the vessel now appearing to be adrift in the Red Sea, authorities said.\nIt wasn’t immediately clear what had happened to the oil tanker Sounion, which had been abandoned by its crew on Thursday and reportedly anchored in place.\nThe British military’s United Kingdom Maritime Trade Operations center reported the fires in a note to mariners on Friday night.\nThe Sounion has 150,000 tons of crude oil aboard and represents a “navigational and environmental hazard,” the mission warned.\nOther missiles and drones have either been intercepted by a U.S.-led coalition in the Red Sea or failed to reach their targets."}, {"id": "e84f998f-ff51-48eb-90d1-310d65f16e70", "title": "Israel and Hezbollah trade heavy fire before pulling back", "date": "2024-08-25 12:45", "url": "https://abc11.com/post/israel-hezbollah-trade-heavy-fire-before-pulling-back-jolting-region-braced-war/15228648/", "domain": "abc11.com", "domain_classification": "Unknown", "message": "The heavy exchange of fire does not appear to have ignited a long-feared war, but the situation remains tense.\nPhil Taitt reports the heavy exchange of fire does not appear to have ignited a long-feared war, but the situation remains tense.\nThe heavy exchange of fire does not appear to have ignited a long-feared war, but the situation remains tense.\nThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel."}, {"id": "3b492293-4d0a-48f9-b711-f490c65b74b0", "title": "Israel , Hezbollah trade heavy fire before pulling back", "date": "2024-08-25 13:15", "url": "https://www.ctvnews.ca/world/israel-and-hezbollah-trade-heavy-fire-before-pulling-back-jolting-a-region-braced-for-war-1.7013486", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "59699392-fa98-4986-8365-7ba930120440", "title": "Israel and Hezbollah trade heavy fire before pulling back", "date": "2024-08-25 14:00", "url": "https://abc7news.com/post/israel-hezbollah-trade-heavy-fire-before-pulling-back-jolting-region-braced-war/15228648/", "domain": "abc7news.com", "domain_classification": "Unknown", "message": "The heavy exchange of fire does not appear to have ignited a long-feared war, but the situation remains tense.\nPhil Taitt reports the heavy exchange of fire does not appear to have ignited a long-feared war, but the situation remains tense.\nThe heavy exchange of fire does not appear to have ignited a long-feared war, but the situation remains tense.\nThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel."}, {"id": "04538b06-58bc-47d2-a1e8-76b667ce82b9", "title": "Israel and Hezbollah exchange heavy fire , raising fears of an all - out regional war", "date": "2024-08-25 09:15", "url": "https://www.local10.com/news/world/2024/08/25/israel-stages-heavy-airstrikes-on-lebanon-as-hezbollah-launches-attack-over-slain-top-commander/", "domain": "local10.com", "domain_classification": "Unknown", "message": "JERUSALEM – Israel launched a wave of airstrikes across southern Lebanon early Sunday in what it said was a preemptive strike to avert a large Hezbollah attack.\nThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nIranian state media on Sunday played up the Hezbollah attack, calling it a success, but there was no immediate comment from Iranian officials."}, {"id": "aa8341b9-5734-475d-8822-d4b04800d714", "title": "Major Israel - Hezbollah missile exchange as region watches for escalation", "date": "2024-08-25 13:45", "url": "https://www.stabroeknews.com/2024/08/25/news/world/major-israel-hezbollah-missile-exchange-as-region-watches-for-escalation/", "domain": "stabroeknews.com", "domain_classification": "Unknown", "message": "The strikes destroyed thousands of launcher barrels, aimed mostly at northern Israel but also targeting some central areas, Israel’s military said.\nIsrael’s security cabinet met at 7 a.m. (0400 GMT) and the full cabinet is meeting on Sunday afternoon.\nDefense Minister Yoav Gallant declared a state of emergency and Foreign Minister Israel Katz said Israel would respond to developments on the ground but did not seek a full-scale war.\nAn Israeli strike on al-Tiri killed two other people according to a security source and a medical sources.\nHezbollah and Israel have been exchanging fire constantly ever since, while avoiding a major escalation as war rages in Gaza to the south."}, {"id": "9f132df2-eb46-4702-ba59-de5b68d762f1", "title": "Israel and Hezbollah exchange heavy fire , raising fears of an all - out regional war", "date": "2024-08-25 09:15", "url": "https://www.news4jax.com/news/world/2024/08/25/israel-stages-heavy-airstrikes-on-lebanon-as-hezbollah-launches-attack-over-slain-top-commander/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "JERUSALEM – Israel launched a wave of airstrikes across southern Lebanon early Sunday in what it said was a preemptive strike to avert a large Hezbollah attack.\nRecommended VideosThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nIranian state media on Sunday played up the Hezbollah attack, calling it a success, but there was no immediate comment from Iranian officials."}, {"id": "df6091d6-ad7a-440a-a4db-7390139a4d18", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 13:00", "url": "https://www.mprnews.org/story/2024/08/25/npr-israel-airstrikes-lebanon-hezbollah", "domain": "mprnews.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "b3090edd-d9ba-44ae-8570-1c070a046735", "title": "Israel stages heavy airstrikes on Lebanon as Hezbollah launches attack over slain top commander", "date": "2024-08-25 06:00", "url": "http://www.sfchronicle.com/news/world/article/israel-says-it-is-staging-airstrikes-inside-19721365.php", "domain": "sfchronicle.com", "domain_classification": "Unknown", "message": "Ariel Schalit/AP Israeli Apache helicopters fly toward northern Israel, Sunday, Aug. 25, 2024.\nAriel Schalit/AP A damaged house is seen following an attack from Lebanon, in Acre, north Israel, Sunday, Aug. 25, 2024.\nThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nAdvertisement Article continues below this adIranian state media on Sunday played up the Hezbollah attack, calling it a success, but there was no immediate comment from Iranian officials."}, {"id": "8357df04-d028-4c76-8975-ef4dd12b9c19", "title": "Israel launches airstrikes on Hezbollah targets inside Lebanon", "date": "2024-08-25 05:15", "url": "https://www.watoday.com.au/world/middle-east/israel-says-it-is-launched-airstrikes-inside-lebanon-targeting-hezbollah-20240825-p5k54y.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "The heavy exchange of fire threatened to trigger an all-out war that could draw in the United States, Iran and militant groups across the region.\nIt could also torpedo efforts to forge a ceasefire in Gaza, where Israel has been at war with the Palestinian group Hamas, an ally of Hezbollah, for over 10 months.\nA Hezbollah UAV intercepted by Israeli air forces over north Israel.\nCredit: AFPThe Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nThe attacks came as Egypt hosted a new round of talks aimed at ending the Israel-Hamas war."}, {"id": "bf34a715-9a04-4983-85f0-57dca8070e93", "title": "Israel and Hezbollah trade heavy fire before pulling back", "date": "2024-08-25 13:30", "url": "https://abc30.com/post/israel-hezbollah-trade-heavy-fire-before-pulling-back-jolting-region-braced-war/15228648/", "domain": "abc30.com", "domain_classification": "Unknown", "message": "The heavy exchange of fire does not appear to have ignited a long-feared war, but the situation remains tense.\nPhil Taitt reports the heavy exchange of fire does not appear to have ignited a long-feared war, but the situation remains tense.\nThe heavy exchange of fire does not appear to have ignited a long-feared war, but the situation remains tense.\nThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel."}, {"id": "2951f515-5e49-4549-868f-199f7c506c02", "title": "Israeli Jets Strike Lebanon Amid Hezbollah Threats", "date": "2024-08-25 03:30", "url": "https://www.devdiscourse.com/article/business/3063219-israeli-jets-strike-lebanon-amid-hezbollah-threats", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Israeli jets launched strikes in Lebanon early Sunday after military assessments indicated that Hezbollah, backed by Iran, was preparing to fire rockets towards Israel.\nThe Israel Defence Forces (IDF) confirmed the operation, stating that it was in response to imminent threats from the terrorist organization.\nFlights in and out of Tel Aviv's Ben Gurion airport were suspended, and Israel's cabinet convened for an emergency meeting at 7 a.m. (0400 GMT), according to Israeli media.\nThe strikes occur amid heightened fears of escalation following a missile strike in the Israeli-occupied Golan Heights last month that killed 12 youngsters and the Israeli military's assassination of a senior Hezbollah commander in Beirut.\nThe IDF has advised civilians in southern Lebanon to avoid areas where Hezbollah operates and promised new civil defense instructions soon."}, {"id": "5095234e-ab3e-4cb1-aab9-6b071b793e85", "title": "Israel , Wheeling on Hezbollah , Sends as Many as 100 Warplanes in Preemptive Strike as Enemy Readied Its Attack With Rockets , Drones", "date": "2024-08-25 13:15", "url": "https://www.nysun.com/article/israel-hezbollah-exchange-heavy-fire-raising-fears-of-an-all-out-regional-war", "domain": "nysun.com", "domain_classification": "Unknown", "message": "The Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nAir raid sirens were reported throughout northern Israel, and Israel’s Ben-Gurion international airport closed and diverted flights for approximately an hour due to the threat of attack.\nAn Israeli military spokesman, Lieutenant Colonel Nadav Shoshani, said Hezbollah had intended to hit targets in northern and central Israel.\nHezbollah said its attack involved more than 320 Katyusha rockets aimed at multiple sites in Israel and a “large number” of drones.\nIt listed 11 bases, barracks, and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights."}, {"id": "a00687ce-8898-4272-ba11-5c8f272c24ad", "title": "Hezbollah launches missile barrage at Israel to avenge top commander", "date": "2024-08-25 07:45", "url": "https://www.koreatimes.co.kr:443/www/world/2024/08/501_381163.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "The Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command has raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks, and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "f73d5461-989d-489e-a5a5-7254ef2b1e1a", "title": "Sumy Oblast Got Pounded 74 Times Over Saturday", "date": "2024-08-25 06:00", "url": "https://menafn.com/1108597391/Sumy-Oblast-Got-Pounded-74-Times-Over-Saturday", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm)The adversary continues pounding Sumy city and the surrounding with artillery, mortar, drones, and glide bombs, with 74 occurring over Saturday, August 24.\n\"The Russians have pounded border areas and communities in Sumy Oblast 74 times, with 182 explosions recorded over the day,\" the post says.\nVelykopysarivka community: was pounded with artillery (33 explosions), mortars (7 explosions), FPV drones (1 explosion), glide bombs (4 explosions).\nKhotyn community: was attacked with glide bombs (2 explosions), mortars (3 explosions), FPV drones (2 explosions).\nShalyhine community: was pounded with FPV drones (4 explosions), mortars (2 explosions)."}, {"id": "c960e917-f7b4-4cd1-9567-171c80edc967", "title": "Israel and Hezbollah trade heavy fire before pulling back , jolting a region braced for war", "date": "2024-08-25 14:00", "url": "https://www.stcatharinesstandard.ca/news/world/middle-east/israel-and-hezbollah-trade-heavy-fire-before-pulling-back-jolting-a-region-braced-for-war/article_4c57ad59-5172-5a11-95d0-587890735286.html", "domain": "stcatharinesstandard.ca", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "b90f8f9d-aa8e-476e-8fb1-7bdc3cddce72", "title": "Israel Launches Preemptive Strikes In Lebanon Just Before Hezbollah Carried Out Retribution Barrage ( Updated ) ", "date": "2024-08-25 07:15", "url": "https://www.yahoo.com/news/israel-launches-preemptive-strikes-lebanon-052823031.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "(Photo by Jalaa MAREY / AFP) (Photo by JALAA MAREY/AFP via Getty Images)The Israel Defense Forces (IDF) say they launched preemptive strikes on Hezbollah targets in Lebanon.\nBREAKING:At least 100 rockets have been fired towards northern Israel from Lebanon in response to the Israeli attack.\nThis photo taken from a position in northern Israel shows a Hezbullah UAV over north Israel on August 25, 2024.\n(Photo by Jalaa MAREY / AFP) JALAA MAREYAt least one home in northern Israel was damaged by a Hezbollah rocket.\nMost of these launchers were aimed toward northern Israel and some were aimed toward central Israel."}, {"id": "c1d2bd46-f44a-4c5e-bd3e-c52b78a6ec09", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 12:45", "url": "https://www.kalw.org/npr-news/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "kalw.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "caf727a9-d1c0-4664-9b60-f455945459ca", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 13:15", "url": "https://www.capeandislands.org/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "capeandislands.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "957b8b91-0bc6-42ba-b0f0-6ad7124f5ee7", "title": "Israel and Hezbollah exchange heavy fire , raising fears of an all - out regional war", "date": "2024-08-25 09:30", "url": "https://www.yakimaherald.com/news/nation_and_world/world/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-an-all-out-regional-war/article_98879496-5be6-594c-933e-ae519da6199a.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "11b037c4-1c70-46ec-9bb3-1ac04a7c4c8f", "title": "Israel PM Netanyahu warns strikes in Lebanon  not the final word  ", "date": "2024-08-25 14:15", "url": "https://www.channelnewsasia.com/world/israel-pm-netanyahu-warns-strikes-lebanon-hezbollah-not-final-word-4566826", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "JERUSALEM: Israeli Prime Minister Benjamin Netanyahu warned that Sunday's (Aug 25) strikes in Lebanon were \"not the final word\" in his country's military campaign against Lebanese armed group Hezbollah.\nThis is another step towards changing the situation in the north and safely returning our residents to their homes.\nAnd, I repeat, this is not the final word,\" Netanyahu told a Cabinet meeting.\n\"Additionally, the IDF (Israeli military) intercepted all the drones that Hezbollah launched at a strategic target in central Israel,\" he said, without identifying what the target was.\nIsraeli media reported the target Hezbollah aimed to strike was the headquarters of the Israeli Mossad spy agency near Tel Aviv."}, {"id": "f6991248-7ff0-495c-b6f7-f963335344da", "title": "4 killed , 6 injured in Israeli airstrikes on Lebanon", "date": "2024-08-25 12:45", "url": "http://www.china.org.cn/world/Off_the_Wire/2024-08/25/content_117386682.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "You are here:视频播放位置 下载安装Flash播放器BEIRUT, Aug. 25 (Xinhua) -- Three Hezbollah members and one member of the Amal Movement were killed, with six others wounded on Sunday following Israeli bombings in southern Lebanon, Lebanese military sources told Xinhua.\nThe sources, who requested anonymity, reported that two Hezbollah members died in an airstrike targeting a house in al-Tiri, a village in southern Lebanon's central border area.\nAnother Hezbollah member was killed and three others were wounded in an Israeli raid on the outskirts of Deir Seryan in the eastern border area.\nAdditionally, a member of the Amal Movement was killed in an Israeli drone strike on a car in Khiam, a village in the southeast.\nTensions along the Lebanon-Israel border have intensified since an Israeli raid on the southern suburbs of Beirut on July 30, which killed seven Hezbollah members, including senior military commander Fouad Shokor."}, {"id": "dc9f9bc7-8a75-43e4-a988-9fa7fac5cb62", "title": "Five significant escalations between Hezbollah and Israel since October", "date": "2024-08-25 13:15", "url": "https://www.thenationalnews.com/news/mena/2024/08/25/five-significant-escalations-between-hezbollah-and-israel-since-october/", "domain": "thenationalnews.com", "domain_classification": "Local - Middle East", "message": "Hezbollah launched attacks on Israeli positions on October 8, in support of its Palestinian ally Hamas in Gaza.\nAt the time, he was the most senior Hezbollah official killed since the war started.\nHezbollah named its commander killed in the Israeli strike as Sami Abdallah – also known as Abu Taleb.\n4) Israel assassinates top Hezbollah commanderIn July, Israel assassinated Hezbollah's top military commander Fouad Shukr in a strike on Beirut's suburbs, only the second time the Lebanese capital has been targeted since October.\nMr Shukr is the most senior Hezbollah commander to be killed since Mustafa Badreddine was assassinated in Syria in 2016."}, {"id": "1434df28-af56-4f4f-a17d-08b2e65af370", "title": "What to know about the heavy exchange of fire between Israel and Lebanon Hezbollah", "date": "2024-08-25 10:30", "url": "https://www.ajc.com/news/nation-world/what-to-know-about-the-heavy-exchange-of-fire-between-israel-and-lebanons-hezbollah/HYRAOCQGRVFJLP7CQLOBQAHWUE/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "3a1a358c-4e4a-45c0-82ad-24ae785b35e1", "title": "Israel Pre - Emptive Airstrikes on Hezbollah Escalate Tensions", "date": "2024-08-25 05:00", "url": "https://www.devdiscourse.com/article/politics/3063245-israels-pre-emptive-airstrikes-on-hezbollah-escalate-tensions", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "In a bid to prevent a potential barrage of rocket attacks, Israel launched an extensive series of airstrikes in southern Lebanon early Sunday, targeting the Hezbollah militant group.\nThe operation, described by Israel as a pre-emptive strike, has raised the specter of a broader regional conflict that could undermine efforts to broker a cease-fire in Gaza.\nShortly after the strike, Hezbollah responded by launching a large-scale drone attack on what it described as a significant Israeli military target.\nTensions along the Israel-Lebanon border have been escalating, with Israel's defense minister ordering additional troops to the area.\nIsrael's military spokesperson, Rear Adm. Daniel Hagari, stated that the airstrikes were a defensive measure aimed at neutralizing threats from Hezbollah, which he accused of jeopardizing civilian lives on both sides of the border."}, {"id": "a9648a32-5bce-45d7-b5d4-3891cca63f0f", "title": "Israel hits locations in Lebanon as Hezbollah launches attack", "date": "2024-08-25 09:00", "url": "https://www.mercurynews.com/2024/08/24/israel-hits-locations-in-lebanon-as-hezbollah-launches-attack/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "The attacks came as Egypt hosts a new round of talks aimed at ending Israel’s war with Hamas, now in its 11th month.\nRear Adm. Daniel Hagari, the top Israeli military spokesman, said “dozens” of warplanes were striking targets in southern Lebanon.\nSocial media footage showed what appeared to be strikes in southern Lebanon.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas’ Oct. 7 attack into Israel.\nIsrael and Hezbollah have been exchanging fire nearly daily, displacing tens of thousands of people on both sides of the border."}, {"id": "fa60cd29-566a-465a-bb4f-ebc3e785966e", "title": "Israel - Lebanon latest : IDF strikes Hezbollah targets", "date": "2024-08-25 09:00", "url": "https://www.thetimes.com/world/europe/article/israel-strike-lebanon-hezbollah-latest-news-r8jsnmkqv", "domain": "thetimes.com", "domain_classification": "Unknown", "message": "Hezbollah fires more than 300 rockets on Israel in ‘phase one’ of attackIsrael has said it conducted a string of strikes against Hezbollah targets across southern Lebanon this morning after detecting plans for a significant attack on its territory.\nIsrael and Hezbollah ‘exchange messages to prevent escalation’Israel and Hezbollah exchanged messages with one another on Sunday, via intermediaries, to prevent further escalation, two diplomats told Reuters.\nSome 100 Israeli Air Force fighter jets pre-emptively struck to remove the threats,” Hagari said.\nIt joins Virgin Atlantic and Royal Jordanian in suspending operations following the fighting in southern Lebanon this morning.\nThe Houthis have promised retaliation for Israeli strikes on the port city of Hodeida on July 20."}, {"id": "75c7d82f-7490-4f4a-bf2b-33a4b18fadb4", "title": "Israel stages heavy airstrikes on Lebanon as Hezbollah launches attack over slain top commander", "date": "2024-08-25 06:15", "url": "https://www.reviewjournal.com/news/nation-and-world/israel-stages-heavy-airstrikes-on-lebanon-as-hezbollah-launches-attack-over-slain-top-commander-3147006/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "JERUSALEM — Israel launched a wave of airstrikes across southern Lebanon early Sunday in what it said was a preemptive strike to avert a large Hezbollah attack.\nThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas’ Oct. 7 attack into Israel.\nIranian state media on Sunday played up the Hezbollah attack, calling it a success, but there was no immediate comment from Iranian officials."}, {"id": "f9bfddd8-fc97-4c5d-b8bb-66b85a956da0", "title": "Israel launches mass airstrikes against Hezbollah in Lebanon sparking WW3 fears", "date": "2024-08-25 07:45", "url": "https://www.mirror.co.uk/news/world-news/breaking-israel-launches-mass-airstrikes-33533820", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "Image: AFP via Getty Images) AFP via Getty Images)The Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nHezbollah said its attack involved more than 320 Katyusha rockets aimed at multiple sites in Israel and a “large number” of drones.\nIt listed 11 bases, barracks, and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nRear Adm. Daniel Hagari, another Israeli military spokesman, said the military had struck in self-defense.\n“We can see that Hezbollah is preparing to launch an extensive attack on Israel, while endangering the Lebanese civilians,” he added, without providing details."}, {"id": "e3a570fd-d05f-4fe9-a9e0-ed02077b2909", "title": "Israel launches  pre - emptive  strikes in Lebanon as Hezbollah begins  first phase  of ... ", "date": "2024-08-25 10:30", "url": "https://www.lbc.co.uk/news/hezbollah-retaliates-rocket-barrage-israel-pre-emptive-strike/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "Israel launches 'pre-emptive' strikes in Lebanon as Hezbollah begins 'first phase' of retaliation with rocket barrageIsrael launched a series of intense airstrikes in southern Lebanon early on Sunday.\nPicture: GettyBy Emma SoteriouIsrael has launched 'pre-emptive' strikes in Lebanon as Hezbollah began its 'first phase' of retaliation with a huge rocket barrage.\nThe army said they were pre-emptive strikes against Hezbollah, which had been planning to launch a heavy barrage of rockets and missiles towards Israel.\nIsrael launches 'pre-emptive' strikes in Lebanon as Hezbollah begins 'first phase' of retaliation with rocket barrageLast week, Israel's defence minister said he was moving more troops towards the Lebanese border in anticipation of possible fighting with the group.\nPicture: GettyHezbollah began attacking Israel almost immediately after the war with Hamas erupted on October 7 with a Hamas cross-border attack."}, {"id": "026546ef-a4db-409f-8457-07b748f5367e", "title": "Israel says it carried out  pre - emptive  airstrikes in Lebanon - as Hezbollah fires back", "date": "2024-08-25 07:15", "url": "https://news.sky.com/story/israel-carries-out-attacks-in-lebanon-as-hezbollah-hits-back-13202914", "domain": "news.sky.com", "domain_classification": "International", "message": "Israel has launched a wave of \"pre-emptive\" airstrikes in southern Lebanon against Hezbollah - as the militant group said it had fired drones and hundreds of rockets.\nWarning sirens sounded in northern Israel and explosions were heard as the military's Iron Dome aerial defence system shot down missiles from southern Lebanon.\nIn Israel, military spokesman Lieutenant Colonel Nadav Shoshani said initial assessments found \"very little damage\" but that the military remained on high alert.\nIt also said it identified a terrorist cell operating in Khiam in southern Lebanon.\nThe spectre hanging over Lebanon and Israel is what happened in 2006, when Hezbollah and Israel went toe to toe in a full-scale war."}, {"id": "5fb5fe3a-8d2d-4e3b-811f-68acf38a4538", "title": "What to know about the heavy exchange of fire between Israel and Lebanon Hezbollah", "date": "2024-08-25 13:45", "url": "https://economictimes.indiatimes.com/news/defence/what-to-know-about-the-heavy-exchange-of-fire-between-israel-and-lebanons-hezbollah/articleshow/112783295.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Find this comment offensive?\nChoose your reason below and click on the Report button.\nThis will alert our moderators to take actionNameReason for reporting:Foul languageSlanderousInciting hatred against a certain community"}, {"id": "317e5aa5-d502-40d0-8d8a-ff7041641791", "title": "What to know about the heavy exchange of fire between Israel and Lebanon Hezbollah", "date": "2024-08-25 13:45", "url": "https://abcnews.go.com/International/wireStory/heavy-exchange-fire-israel-lebanons-hezbollah-113131848", "domain": "abcnews.go.com", "domain_classification": "International", "message": "The Israeli strikes killed three militants in Lebanon, while there were no reports of casualties on the Israeli side.\nTwo Hezbollah fighters and a militant from an allied group were killed, and two people were wounded in the strikes on Lebanon.\nHezbollah began firing rockets and drones at Israel shortly after the outbreak of the war in Gaza, which was triggered by Hamas' surprise attack into Israel on Oct. 7.\nAn all-out war between Israel and Hezbollah could spiral into a region-wide conflict.\nIran is a patron of Hezbollah, Hamas and other militant groups in Syria, Iraq and Yemen."}, {"id": "8e0d67d6-827a-455c-b05d-a8ab3b163784", "title": "What to know about the heavy exchange of fire between Israel and Lebanon Hezbollah", "date": "2024-08-25 13:30", "url": "https://www.local10.com/news/world/2024/08/25/what-to-know-about-the-heavy-exchange-of-fire-between-israel-and-lebanons-hezbollah/", "domain": "local10.com", "domain_classification": "Unknown", "message": "Israel and Lebanon’s Hezbollah on Sunday launched their heaviest exchange of fire after months of strikes and counterstrikes that have raised fears of an all-out war.\nThe Israeli strikes killed three militants in Lebanon, while there were no reports of casualties on the Israeli side.\nIsrael says around 100 warplanes launched airstrikes targeting thousands of rocket launchers across southern Lebanon to thwart an imminent Hezbollah attack.\nHow likely is an all-out war between Israel and Hezbollah?\nIran is a patron of Hezbollah, Hamas and other militant groups in Syria, Iraq and Yemen."}, {"id": "919c08b4-f251-45f8-a9fb-ba434c6b0f93", "title": "Israeli airstrikes target Hezbollah in Lebanon – NBC Los Angeles", "date": "2024-08-25 05:45", "url": "https://www.nbclosangeles.com/news/national-international/israeli-airstrikes-target-hezbollah-lebanon/3495525/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "The Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command has raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks, and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nRear Adm. Daniel Hagari, another Israeli military spokesman, said the military had struck in self-defense."}, {"id": "90aaeaa0-0a5c-444c-8e07-01abffdcd736", "title": "What to know about the heavy exchange of fire between Israel and Lebanon Hezbollah", "date": "2024-08-25 14:15", "url": "https://www.news-gazette.com/news/nation-world/what-to-know-about-the-heavy-exchange-of-fire-between-israel-and-lebanons-hezbollah/article_f30d4ac1-dc37-592c-b001-3d0167b3446c.html", "domain": "news-gazette.com", "domain_classification": "Unknown", "message": "What to know about the heavy exchange of fire between Israel and Lebanon's HezbollahIsrael and Lebanon’s Hezbollah have launched their heaviest exchange of fire after months of strikes and counterstrikes, raising fears of an all-out war that could potentially draw in the United States, Iran and militant groups across the region"}, {"id": "dcdd594f-b0e2-453e-b57a-95438b9701d9", "title": "What to know about the heavy exchange of fire between Israel and Lebanon Hezbollah", "date": "2024-08-25 14:30", "url": "https://www.bostonglobe.com/2024/08/25/nation/israel-lebanon-hezbollah-things-to-know/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Lebanese authorities said the Israeli strikes killed three people, while there were no reports of casualties on the Israeli side.\nIsrael says around 100 warplanes launched airstrikes targeting thousands of rocket launchers across southern Lebanon to thwart an imminent Hezbollah attack.\nHezbollah and Hamas are allies, each backed by Iran, and Hezbollah has portrayed the attacks as an act of solidarity with the Palestinians.\nBeirut’s southern suburbs, and towns and villages across southern Lebanon, where Hezbollah’s main strongholds are located, would likely be flattened.\nIran is a patron of Hezbollah, Hamas and other militant groups in Syria, Iraq and Yemen."}, {"id": "85c3ef04-bfb4-48db-af9d-3bb962a36789", "title": "Israeli airstrikes target Hezbollah in Lebanon – NBC Connecticut", "date": "2024-08-25 05:45", "url": "https://www.nbcconnecticut.com/news/national-international/israeli-airstrikes-target-hezbollah-lebanon/3370775/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "The Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command has raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks, and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nRear Adm. Daniel Hagari, another Israeli military spokesman, said the military had struck in self-defense."}, {"id": "72be6b77-3e05-47f5-8538-e29b161fbdb9", "title": "Israel Hezbollah War : Self - Defence : Israel Says Fired On Lebanon To Prevent Hezbollah Attack", "date": "2024-08-25 05:00", "url": "https://www.ndtv.com/world-news/israel-hezbollah-war-self-defence-israel-says-fired-on-lebanon-to-prevent-hezbollah-attack-6412754", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Israel today said that is launched strikes inside Lebanon as a \"self-defence act\" to prevent a Hezbollah attack on civilians, Israel Defense Forces spokesperson Daniel Hagari said.\n\"The IDF identified the Hezbollah terrorist organization preparing to fire missiles and rockets toward Israeli territory.\nIsrael's international Ben Gurion airport has canceled all take-offs and landings for several hours, the country's airport authority said.\nHezbollah fired missiles at Israel immediately after the October 7 attacks by Hamas gunmen on Israel.\nHezbollah and Israel have been exchanging fire constantly ever since, while avoiding a major escalation as war rages in Gaza to the south."}, {"id": "995da3ef-e265-478e-9cda-fe35b70372e0", "title": "Hezbollah launches missile barrage at Israel to avenge top commander", "date": "2024-08-25 07:45", "url": "https://thesun.my/world/hezbollah-launches-missile-barrage-at-israel-to-avenge-top-commander-FK12905011", "domain": "thesun.my", "domain_classification": "Unknown", "message": "Israeli jets hit targets in Lebanon shortly before the strikes as the military assessed that Hezbollah was preparing to begin the barrage, the military said.\nHezbollah said it had launched more than 320 Katyusha rockets towards Israel and hit 11 military targets.\nThe Israeli military issued civil defence instructions limiting gatherings but authorising people to go to their workplaces as long as they were able to reach air raid shelters quickly.\nALSO READ: Hezbollah says launched ‘squadrons of drones’ at Israel after Sidon attackHezbollah fired missiles at Israel immediately after the Oct. 7 attacks by Hamas gunmen on Israel.\nHezbollah and Israel have been exchanging fire constantly ever since, while avoiding a major escalation as war rages in Gaza to the south."}, {"id": "d0fa5f8d-2a35-4919-bd09-3d656df81eec", "title": "Israel - Hezbollah War , Conflict Live Updates : Israel Strikes Lebanon To Prevent  Large - Scale  Hezbollah Attack As Middle East Tensions Rise", "date": "2024-08-25 05:00", "url": "https://www.ndtv.com/world-news/israel-hezbollah-war-conflict-live-updates-israel-strikes-lebanon-to-prevent-large-scale-hezbollah-attack-as-middle-east-tensions-rise-6412787", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Aug 25, 2024 16:44 (IST) Hamas Says Hezbollah Strikes 'Slap In The Face' For IsraelPalestinian Islamist movement Hamas on Sunday hailed strikes by Lebanon's Hezbollah against Israel, calling it a \"strong and focused response\".\nAug 25, 2024 10:27 (IST) Israel Defence Minister Briefs US Counterpart On Hezbollah AttackIsrael Defence Miniser Yoav Gallant has briefed US Secretary of Defence Lloyd Austin on the Hezbollah attacks.\nAug 25, 2024 10:25 (IST) Israel Declares 48-Hour State Of Emergency After Hezbollah StrikesIsrael has announced a 48-hour nationwide state of emergency after its launched what it called pre-emptive strikes in Lebanon.\nAug 25, 2024 10:01 (IST) Israel, Hezbollah Conflict Live Updates: Hezbollah Calls \"First Phase\" Of Attack \"Total Success\"Hezbollah has said the \"first phase\" of attack on Israel has ended with \"total success\".\nAug 25, 2024 09:51 (IST) Israel, Hezbollah Conflict: \"Self-Defence,\" Says Israel On Striking HezbollahIsrael today said it launched strikes inside Lebanon as a \"self-defence act\" to prevent a Hezbollah attack on its civilians."}, {"id": "9b657713-88c4-4a66-9f3b-ace216977fd3", "title": "Israeli planes hit Hezbollah targets in Lebanon", "date": "2024-08-25 09:15", "url": "https://www.northernpen.ca/israeli-planes-hit-hezbollah-targets-in-lebanon/", "domain": "northernpen.ca", "domain_classification": "Unknown", "message": "Rocket explosions on the Lebanese border as seen from IsraelThe Israeli military says its warplanes are striking Hezbollah targets in Lebanon after detecting moves to fire missiles and rockets into Israel.\n“In a defensive action to eliminate these threats, the IDF (Israel Defense Forces) is striking terrorist targets,” said IDF spokesman Daniel Hagari.\nIsrael says Lebanese citizens have been warned to evacuate immediately from areas where the Iran-backed Shiite Muslim group Hezbollah is operating.\nShortly after, Hezbollah said it launched a large-scale drone strike on Israel in response to the killing of the group’s senior military commander last month."}, {"id": "f9449174-3c53-4154-84f8-b8dbe64345a0", "title": "IDF Attacks 250 Hezbollah Targets In Southern Lebanon", "date": "2024-08-25 06:30", "url": "https://www.i24news.tv/en/news/israel-at-war/artc-idf-attacks-250-hezbollah-targets-in-southern-lebanon", "domain": "i24news.tv", "domain_classification": "Unknown", "message": "In response to Hezbollah's widespread attack against northern Israel on Sunday, the Israel Defense Forces attacked thousands of Hezbollah targets in Lebanon, the military said on Sunday.\nAmong the Hezbollah targets attacked were those in Sidon, about 30 miles from the Israeli border.\n\"During the attack, the IDF hit about 250 targets of Hezbollah,\" i24NEWS Yossi Yehoshua reported.\nIt contained its response and did not continue towards Beirut despite the presence of many targets with precision missiles there.\"\nFurthermore, an Israeli warplane allegedly launched an attack on the village of Al-Mansouri, located in the western part of southern Lebanon."}, {"id": "31687db6-bc66-43ce-9c4a-283ecd4c0b6d", "title": "Israel strikes Hezbollah targets in Lebanon", "date": "2024-08-25 07:30", "url": "https://www.thetimes.com/world/europe/article/israel-strikes-hezbollah-targets-in-lebanon-r8jsnmkqv", "domain": "thetimes.com", "domain_classification": "Unknown", "message": "Hezbollah fires more than 300 rockets on Israel in ‘phase one’ of attackIsrael has said it conducted a string of strikes against Hezbollah targets across southern Lebanon this morning after detecting plans for a significant attack on its territory.\nIsrael and Hezbollah ‘exchange messages to prevent escalation’Israel and Hezbollah exchanged messages with one another on Sunday, via intermediaries, to prevent further escalation, two diplomats told Reuters.\nSome 100 Israeli Air Force fighter jets pre-emptively struck to remove the threats,” Hagari said.\nIt joins Virgin Atlantic and Royal Jordanian in suspending operations following the fighting in southern Lebanon this morning.\nThe Houthis have promised retaliation for Israeli strikes on the port city of Hodeida on July 20."}, {"id": "2302125c-16dd-4701-9f38-07490d5a75c8", "title": "Israel attacks Hezbollah targets in Lebanon , pre - empting  extensive attack  ", "date": "2024-08-25 13:30", "url": "https://www.thejc.com/news/israel/israel-attacks-hezbollah-targets-in-lebanon-pre-empting-extensive-attack-v6eule2x", "domain": "thejc.com", "domain_classification": "Unknown", "message": "The IDF launched a pre-emptive strike on Hezbollah targets in Southern Lebanon early on Sunday, after detecting preparations on the Iranian proxy’s part to launch an “extensive” attack.\nApproximately 100 Israeli warplanes launched simultaneous strikes on some 40 Hezbollah targets, destroying over 6,000 missiles and drones, according to the IDF.\nIDF fighter jets have just struck additional Hezbollah launchers in several areas in southern Lebanon and a terrorist cell operating in the area of Khiam in southern Lebanon.\n“All the launchers that were targeted were destroyed and Israel [anticipates] a harsh response from Hezbollah,” the official said.\nRockets fired from southern Lebanon are intercepted by Israel's Iron Dome air defence system over the Upper Galilee region in northern Israel on August 23, 2024."}, {"id": "6f426597-78f1-4f6b-91c6-0d12f3d7e80a", "title": "What to know about the heavy exchange of fire between Israel and Lebanon Hezbollah", "date": "2024-08-25 12:30", "url": "https://www.aol.com/know-heavy-exchange-fire-between-094439861.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "Israel and Lebanon's Hezbollah on Sunday launched their heaviest exchange of fire after months of strikes and counterstrikes that have raised fears of an all-out war.\nThe Israeli strikes killed three militants in Lebanon, while there were no reports of casualties on the Israeli side.\nIsrael says around 100 warplanes launched airstrikes targeting thousands of rocket launchers across southern Lebanon to thwart an imminent Hezbollah attack.\nHow likely is an all-out war between Israel and Hezbollah?\nIran is a patron of Hezbollah, Hamas and other militant groups in Syria, Iraq and Yemen."}, {"id": "a96dbcf5-01b2-47d1-b8b5-f947ef4aba1f", "title": "Israeli airstrikes target Hezbollah in Lebanon – NBC New York", "date": "2024-08-25 04:45", "url": "https://www.nbcnewyork.com/news/national-international/israeli-airstrikes-target-hezbollah-lebanon/5734527/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "The Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command has raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks, and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nRear Adm. Daniel Hagari, another Israeli military spokesman, said the military had struck in self-defense."}, {"id": "a0742cc9-ed69-4f5e-a1c4-b07304149b7f", "title": "Israeli airstrikes target Hezbollah in Lebanon – NBC Chicago", "date": "2024-08-25 05:15", "url": "https://www.nbcchicago.com/news/national-international/israeli-airstrikes-target-hezbollah-lebanon/3531409/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "The Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command has raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks, and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nRear Adm. Daniel Hagari, another Israeli military spokesman, said the military had struck in self-defense."}, {"id": "09f65a36-190b-4d77-bfce-147f000a802a", "title": "Ben Gurion airport reopens after brief suspension", "date": "2024-08-25 12:45", "url": "https://www.albawaba.com/news/ben-gurion-airport-reopens-after-brief-1582755", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "JERUSALEMTel Aviv's Ben Gurion International Airport reopened Sunday morning after a brief suspension following the Israeli military's massive air raid on southern Lebanon, which it called a \"preemptive strike\" against Hezbollah.\nThe Israeli Broadcasting Corporation reported that the airport's operations are back to normal following a brief suspension, with some flights redirected to nearby airports, but no further details are provided.\nOn Sunday morning, Israel's Army Radio reported that the military conducted an air raid in Lebanon with 100 warplanes targeting more than 200 sites.\nThe Israeli army began its preemptive strike around 4:30 a.m., just 30 minutes before the planned Hezbollah attack, it added.\nAccording to the Ben Gurion International Airport website, some flights have been canceled and others suffered disruptions by the temporary closure on Sunday morning."}, {"id": "530877c8-e35c-49f8-aa68-477ffa3bd325", "title": "Israeli airstrikes target Hezbollah in Lebanon – NBC 6 South Florida", "date": "2024-08-25 05:15", "url": "https://www.nbcmiami.com/news/national-international/israeli-airstrikes-target-hezbollah-lebanon/3400582/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "The Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command has raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks, and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nRear Adm. Daniel Hagari, another Israeli military spokesman, said the military had struck in self-defense."}, {"id": "37b6cab0-9920-4930-b713-fa040e5033d3", "title": "What to know about the heavy exchange of fire between Israel and Lebanon Hezbollah", "date": "2024-08-25 14:00", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/what-to-know-about-the-heavy-exchange-of-fire-between-israel-and-lebanons-hezbollah/article_5510f1ef-1896-51bc-87d3-92a8638f785c.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "What to know about the heavy exchange of fire between Israel and Lebanon's HezbollahIsrael and Lebanon’s Hezbollah have launched their heaviest exchange of fire after months of strikes and counterstrikes, raising fears of an all-out war that could potentially draw in the United States, Iran and militant groups across the region"}, {"id": "604fa166-85e3-467d-b7cc-1197a099d9d4", "title": "Israel and Hezbollah say they dont want war - but they are both ready for it", "date": "2024-08-25 10:45", "url": "https://www.bbc.co.uk/news/articles/cjw398njqj4o", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "This morning's exchange of strikes between Israel and Hezbollah appears to be a significant escalation.\nThe Israeli military says around 100 fighter jets carried out what it described as pre-emptive strikes on Hezbollah targets across southern Lebanon on Sunday morning.\nHezbollah later fired rockets and missiles into northern Israel.\nIf that 100 figure is correct, it would be the largest Israeli attack on Lebanon since the full-scale war between Israel and Hezbollah in 2006.\nIn the end Hezbollah said it had fired more than 300 rockets and missiles targeting military facilities in northern Israel, where air raid sirens have been sounding."}, {"id": "22da5aea-dd83-48ab-8e26-1f90e45682f8", "title": "Israel stages heavy airstrikes on Lebanon as Hezbollah launches attack over slain top commander", "date": "2024-08-25 07:00", "url": "https://www.kold.com/2024/08/25/israelis-stage-heavy-airstrikes-lebanon-hezbollah-launches-drone-attack-israel/", "domain": "kold.com", "domain_classification": "Unknown", "message": "JERUSALEM (AP) — Israel launched a wave of airstrikes across southern Lebanon early Sunday in what it said was a preemptive strike to avert a large Hezbollah attack.\nThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas’ Oct. 7 attack into Israel.\nIranian state media on Sunday played up the Hezbollah attack, calling it a success, but there was no immediate comment from Iranian officials."}, {"id": "df445257-1bf1-4403-a66e-d3345a5c2af1", "title": "Israel stages heavy airstrikes on Lebanon as Hezbollah launches attack over slain top commander", "date": "2024-08-25 07:00", "url": "https://www.wgauradio.com/news/world/israel-stages-heavy/QHGEY5DIKBBCTH3RXBJMRWNWHY/", "domain": "wgauradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "e6b890c4-65ea-4c3c-b7a8-feefb402bb29", "title": "  Mission accomplished : Hezbollah fires barrages of rockets , drones against Israeli targets", "date": "2024-08-25 07:00", "url": "https://www.presstv.ir/Detail/2024/08/25/732007/Lebanon-Israel-Hezbollah-rockets-drones-retaliation-airstrikes", "domain": "presstv.ir", "domain_classification": "Unknown", "message": "Hezbollah has fired barrages of rockets and drones towards targets lying in the northern part of the occupied Palestinian territories in retaliation for Israel’s assassination of a senior military commander of the resistance group last month.\n“Our military operation for today has been completed and accomplished,” it said.\nEarlier, the regime staged scores of airstrikes against southern Lebanon, alleging that it was seeking to “pre-empt” a “large-scale” retaliation by Hezbollah.\nThe Israeli regime has been staging numerous sporadic attacks against southern Lebanon since October 7, when it launched a genocidal war on the Gaza Strip.\nHezbollah has launched a series of strikes against Israeli positions in retaliation for the regime’s aggression against Lebanon and in solidarity with Palestinians in Gaza."}, {"id": "8727f212-b7b8-4623-bab6-3c66b9d05b7a", "title": "Hezbollah launches missiles at Israel , prompting air strikes on Lebanon", "date": "2024-08-25 14:15", "url": "https://www.channelnewsasia.com/world/hezbollah-israel-missile-airstrikes-avenge-senior-commander-assassination-4566406", "domain": "channelnewsasia.com", "domain_classification": "Unknown", "message": "Three deaths were confirmed in Lebanon and none in Israel, where damage appeared to be limited.\nHezbollah indicated it was not planning further strikes yet.\nA Hezbollah official said it had delayed its retaliation to give a chance for ongoing Gaza ceasefire talks and other \"political considerations\".\nIsrael's military said it had foiled a much larger attack with pre-emptive airstrikes on 40 launch sites after assessing that Hezbollah was preparing to launch the barrage.\nNetanyahu said Israel took pre-emptive action against Hezbollah, adding that air defences had intercepted all drones launched against a strategic target in central Israel."}, {"id": "e9f4c6fb-6020-4f41-8a39-62d8b97c44ed", "title": "Israel stages heavy airstrikes on Lebanon as Hezbollah launches attack over slain top commander", "date": "2024-08-25 06:30", "url": "https://kvia.com/news/2024/08/24/israel-says-it-is-staging-airstrikes-inside-lebanon-targeting-the-shiite-militia-hezbollah/", "domain": "kvia.com", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles.\nIsrael’s Home Front Command raised the alert level across northern Israel before later lifting restrictions in most areas.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas’ Oct. 7 attack into Israel.\nIranian state media on Sunday played up the Hezbollah attack, calling it a success, but there was no immediate comment from Iranian officials."}, {"id": "55fc31d6-0fcc-4a61-adf1-8172cba8b067", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 07:45", "url": "https://www.wuwf.org/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "wuwf.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "db8a4719-21fb-484a-87f9-a39403f5782d", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 07:30", "url": "https://www.kmuw.org/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "kmuw.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "868740b5-66c5-4015-a04d-f471cab2b8de", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 07:30", "url": "https://www.kdlg.org/as-heard-on-npr/2024-08-24/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "kdlg.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "c53942f6-d4e9-423d-b127-a94e44503057", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 07:30", "url": "https://news.prairiepublic.org/news-from-npr/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "news.prairiepublic.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "ed32fb69-3cab-4199-a00d-800009ff3e0a", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:00", "url": "https://www.wlrn.org/npr-breaking-news/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "wlrn.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "81211a95-9114-4598-bb24-1c0a4e02f7a8", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:00", "url": "https://www.wyomingpublicmedia.org/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "wyomingpublicmedia.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "e90a5623-0e01-4e8b-9a1c-eb949c8da757", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:00", "url": "https://www.wyso.org/npr-news/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "wyso.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "e26ed56d-65d3-4a8b-9e69-c65c65f65dd2", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:00", "url": "https://www.kawc.org/npr-news/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "kawc.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "7b1baa91-0a76-43ce-b81f-7a04b0155254", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:00", "url": "https://www.wcbe.org/npr-news/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "wcbe.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "d8d70cb2-983a-4801-b520-b385cda6a936", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:30", "url": "https://www.northernpublicradio.org/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "northernpublicradio.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "083eed59-5efa-4f9b-bfdb-e671d7759c8d", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:30", "url": "https://www.kjzz.org/npr-top-stories/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "kjzz.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "35beec8f-e1e9-4088-b2b3-ba3e10597dc1", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:30", "url": "https://www.wdiy.org/npr-news/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "wdiy.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "95112307-6914-40ad-9902-d16e52a13617", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:30", "url": "https://www.tspr.org/npr-news/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "tspr.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "0263f2ba-d2bf-4b65-b76b-3a91f42361eb", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:15", "url": "https://www.aspenpublicradio.org/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "aspenpublicradio.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "4047d368-a979-44d2-be34-54f0c991c6f4", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:15", "url": "https://www.wncw.org/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "wncw.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "f78a4f7a-9623-4c07-8997-1ab64f7245dd", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:15", "url": "https://www.wmuk.org/npr-news/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "wmuk.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "8122acaa-9030-441e-9ec6-c0951ec03eb6", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 08:00", "url": "https://news.wgcu.org/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "news.wgcu.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "bac76fbf-4972-4562-97c4-8ba98d1a54d8", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 08:00", "url": "https://www.wsiu.org/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "wsiu.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "36fe6bf0-5e6f-4616-ad17-e6e966dc7547", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 08:00", "url": "https://www.wkyufm.org/news/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "wkyufm.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "5f0311fe-3e14-4f2b-9406-1c567b3b23ed", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 08:00", "url": "https://www.wprl.org/npr-news/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "wprl.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "ade1b064-d11c-4180-8bd4-b10dcce20a22", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 08:00", "url": "https://www.kacu.org/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "kacu.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "27a7156c-fed8-4490-9d10-8e6de9726a37", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:00", "url": "https://www.kunc.org/npr-news/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "kunc.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "95c2a6ec-22dc-47b8-84cd-744b2c19e274", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 09:00", "url": "https://www.wutc.org/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "wutc.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "d5a296f8-915b-46d1-8cac-60a4f94ed099", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 08:45", "url": "https://www.iowapublicradio.org/news-from-npr/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "iowapublicradio.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "760ff50c-4969-4888-a4b7-a9801e7b7d2b", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 08:45", "url": "https://www.krwg.org/national-news/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "krwg.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "ebc4b975-9e40-4996-8420-2b1a7bce8151", "title": "Israel launches heavy airstrikes on Hezbollah targets in southern Lebanon", "date": "2024-08-25 08:00", "url": "https://www.kvnf.org/npr-news/2024-08-25/israel-launches-heavy-airstrikes-on-hezbollah-targets-in-southern-lebanon", "domain": "kvnf.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "118a3b45-7e2c-4087-bc62-bea1d633a1b0", "title": "Alert : Israel Ready for Retaliation from Iran or Hezbollah", "date": "2024-08-25 13:00", "url": "https://dailystar.com.lb/israel-ready-retaliation-iran-hezbollah/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "Israel announced on Saturday that its military is on high alert for potential retaliatory strikes from Hezbollah or Iran, following the recent targeted killings of key figures in these groups.\nReports in Israeli media suggest that assessments are being made about the possibility of an imminent attack by Hezbollah.\nBoth Hezbollah and Iran have been issuing threats of retaliation after a series of attacks resulted in the deaths of prominent leaders within Iran-backed militant groups.\nWhen questioned about these threats, Israel Defense Forces (IDF) spokesman Daniel Hagari emphasized that the military is fully prepared for any potential attacks from either Hezbollah or Iran.\nEarlier this week, the bodies of six Israeli hostages were recovered from tunnels in Gaza during an Israeli military operation in Khan Younis."}, {"id": "f4198e7c-92f7-4e86-b293-0d59e87514ed", "title": "Israel stages heavy airstrikes on Lebanon as Hezbollah launches attack over slain top commander", "date": "2024-08-25 06:30", "url": "https://www.kelownadailycourier.ca/news/world_news/article_49d5689a-7b0c-5003-aeb8-b62531c16831.html", "domain": "kelownadailycourier.ca", "domain_classification": "Unknown", "message": "We're always interested in hearing about news in our community.\nLet us know what's going on!"}, {"id": "848b0532-f7e7-48d7-9dee-3f8e1460e046", "title": "What to know about the heavy exchange of fire between Israel and Lebanon Hezbollah - LocalNews8 . com", "date": "2024-08-25 12:45", "url": "https://localnews8.com/news/national-world/ap-national/2024/08/25/what-to-know-about-the-heavy-exchange-of-fire-between-israel-and-lebanons-hezbollah/", "domain": "localnews8.com", "domain_classification": "Unknown", "message": "Associated PressIsrael and Lebanon’s Hezbollah on Sunday launched their heaviest exchange of fire after months of strikes and counterstrikes that have raised fears of an all-out war.\nThe Israeli strikes killed three militants in Lebanon, while there were no reports of casualties on the Israeli side.\nIsrael says around 100 warplanes launched airstrikes targeting thousands of rocket launchers across southern Lebanon to thwart an imminent Hezbollah attack.\nHow likely is an all-out war between Israel and Hezbollah?\nIran is a patron of Hezbollah, Hamas and other militant groups in Syria, Iraq and Yemen."}, {"id": "26ca3104-0db0-44ff-8a6a-e9804aa088b6", "title": "Israel aims strikes at Lebanon as Hezbollah launches attack over commander death", "date": "2024-08-25 08:30", "url": "https://www.belfasttelegraph.co.uk/news/world-news/israel-aims-strikes-at-lebanon-as-hezbollah-launches-attack-over-commander-death/a325964513.html", "domain": "belfasttelegraph.co.uk", "domain_classification": "Unknown", "message": "The Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles towards Israel.\nAir raid sirens were reported throughout northern Israel, and Israel’s Ben-Gurion international airport closed and diverted flights for approximately an hour due to the threat of attack.\nIsrael’s Home Front Command has raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nIt listed 11 bases, barracks, and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas’s October 7 attack into Israel."}, {"id": "c255fbcb-91ee-4ceb-81dc-e5f778a40b15", "title": "Israel stages heavy airstrikes in Lebanon targeting Hezbollah", "date": "2024-08-25 06:30", "url": "https://www.deccanchronicle.com/israel-stages-heavy-airstrikes-in-lebanon-targeting-hezbollah", "domain": "deccanchronicle.com", "domain_classification": "Unknown", "message": "Jerusalem: Israel launched airstrikes inside Lebanon early Sunday that its military said targeted positions of the Shiite militia Hezbollah.\nIn a statement, the Israeli military accused Hezbollah of \"preparing to file missiles and rockets toward Israeli territory.\"\n\"In a self-defense act to remove these threats, the (Israeli military) is striking terror targets in Lebanon, from which Hezbollah was planning to launch their attacks on Israeli civilians,\" Israeli military spokesman, Rear Adm. Daniel Hagari, said.\nSirens sounded in northern Israel soon after the warning.\nIsraeli media cited the Israel Airports Authority for the news."}, {"id": "898540aa-848f-4053-8932-e48729363b54", "title": "", "date": "2024-08-25 08:45", "url": "http://www.israelnationalnews.com/news/395130", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The Hezbollah terrorist organization reportedly planned to launch a number of precision-guided missiles at the Glilot area where the Mossad headquarters and 8200 Intelligence Unit base are located.\nApproximately 100 IAF fighter jets, directed by IDF intelligence, struck and destroyed thousands of Hezbollah rocket launcher barrels that were located and embedded in southern Lebanon.\nSome 6,000 rockets, UAVs and launchers that Hezbollah had planned to fire at Israel were destroyed.\nPrime Minister Benjamin Netanyahu said at the start of a political-security cabinet meeting at the Kirya this morning, \"This morning we identified Hezbollah preparations to attack Israel.\nIn consensus with the Defense Minister and the IDF Chief-of-Staff, we directed the IDF to initiate action to eliminate the threat.\""}, {"id": "c34cfc84-4f47-4cd0-9146-4606ef8a0bca", "title": "Israel Gaza War Live Updates : Israel stages heavy airstrikes in Lebanon , Hezbollah launches more than 320 Katyusha rockets", "date": "2024-08-25 05:15", "url": "https://timesofindia.indiatimes.com/world/middle-east/israel-hamas-war-live-updates-airstrike-gaza-ceasefire-palestine-khalil-al-hayya-al-shifa-hospital-deir-el-balah/liveblog/112769624.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "16:31 (IST) Aug 25The exchange of fire does not appear to have set off a long-feared war, but tensions remain high.\nHezbollah began firing rockets and drones at Israel shortly after the outbreak of the war in Gaza, which was triggered by Hamas' surprise attack into Israel on October 7.\nHezbollah and Hamas are allies, each backed by Iran, and Hezbollah has portrayed the attacks as an act of solidarity with the Palestinians.\nIn northern Israel, 23 soldiers and 26 civilians have been killed by strikes from Lebanon.\nHezbollah officials have said the group does not seek a wider war but is prepared for one."}, {"id": "cd90e2a1-779d-4677-9dd7-410ebf043c86", "title": "What is Hezbollah , the Iranian - backed group that could go to all - out war against Israel ? ", "date": "2024-08-25 13:45", "url": "https://www.independent.co.uk/news/world/middle-east/hezbollah-lebanon-israel-attack-gaza-hamas-b2601546.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Please try again later {{ /verifyErrors }}Israel launched a wave of airstrikes across southern Lebanon early Sunday in what it said was a preemptive strike on Hezbollah.\nThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nBelow, we look at who the Hezbollah group is and why they are involved in this conflict.\nHezbollah and Israel fought a monthlong war that ended in a draw but Israeli bombardment wreaked widespread destruction in southern Lebanon.\nHezbollah's military capabilities have also surged, and it has played a key role in the Syrian civil war, keeping President Bashar al-Assad in power."}, {"id": "b0b5efc2-4b38-45f2-8bab-f5eb2258d711", "title": "Israel stages heavy airstrikes on Lebanon as Hezbollah launches attack over slain top commander", "date": "2024-08-25 06:30", "url": "https://kdhnews.com/news/world/israel-stages-heavy-airstrikes-on-lebanon-as-hezbollah-launches-attack-over-slain-top-commander/article_73aa0208-6369-5b74-821d-1c4f0323e968.html", "domain": "kdhnews.com", "domain_classification": "Unknown", "message": "The attack largely affected internal systems, so the response to the public was sufficient.\nResidents trying to access impacted areas, like collections, were informed of a problem.\nThe city was not very forthcoming and slow to respond to questions from the media.\nA cyberattack is a serious situation.\nIt’s hard to say what the proper response should have been in this instance."}, {"id": "9e03fe0c-9387-4e9d-a89f-04f06a45fa06", "title": "Israel says it is staging airstrikes inside Lebanon targeting the Shiite militia Hezbollah", "date": "2024-08-25 03:30", "url": "https://www.aol.com/israel-says-staging-airstrikes-inside-022301955.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "JERUSALEM (AP) — Israel launched a wave of airstrikes across southern Lebanon early Sunday in what it said was a preemptive strike to avert a large Hezbollah attack.\nThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel.\nIranian state media on Sunday played up the Hezbollah attack, calling it a success, but there was no immediate comment from Iranian officials."}, {"id": "ec152f7a-d6be-4eaa-863f-7a0b69bfe6d8", "title": "Dont cry for Gaza , Madam Vice President . ", "date": "2024-08-25 10:45", "url": "https://www.ruthfullyyours.com/2024/08/25/dont-cry-for-gaza-madam-vice-president/", "domain": "ruthfullyyours.com", "domain_classification": "Unknown", "message": "Don’t cry for Gaza, Madam Vice President.\nAt the Democratic National Convention in Chicago, Vice President Kamala Harris took the time to criticize Israel for its conduct of the war in the Gaza Strip, based on her vast military experience.\nHamas intentionally places its fighters in schools and hospitals, courting civilian deaths for propaganda.\nAll of the casualty figures from Gaza come from its Health Ministry, which is controlled by Hamas.\nDon’t cry for Gaza, Madam Vice President."}, {"id": "62b38e73-3f37-4891-805b-f3e73cd90671", "title": "Israel says it is staging airstrikes inside Lebanon targeting the Shiite militia Hezbollah", "date": "2024-08-25 06:00", "url": "https://www.newsday.com/news/nation/israel-lebanon-gaza-palestinians-hezbollah-k38166", "domain": "newsday.com", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nIsraeli Apache helicopters fly toward northern Israel, Sunday, Aug. 25, 2024. Credit: AP/Ariel SchalitLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "0354774e-a84d-4a17-ba89-96e52b1ce228", "title": "Israel launches pre - emptive strikes on Lebanon ahead of huge Hezbollah drone and rocket attack", "date": "2024-08-25 06:30", "url": "https://www.theguardian.com/world/article/2024/aug/25/israel-pre-emptive-strikes-lebanon-huge-hezbollah-drone-and-rocket-attack", "domain": "theguardian.com", "domain_classification": "International", "message": "Israel has carried out airstrikes in Lebanon in what it described as a pre-emptive action before a planned large-scale Hezbollah attack, and Hezbollah launched a drone and rocket salvo against northern Israel, in a significant escalation of a simmering cross-border conflict.\nOne person was reported to have died in the Israeli airstrikes early on Sunday morning, with at least four injured in southern Lebanon.\nTwo injuries were reported in northern Israel as a result of Hezbollah strikes, which the Israeli military said had caused limited damage.\nHezbollah fighters are known to use the heavily forested areas of south Lebanon for cover as they carry out attacks against Israel.\n​​“Minister Gallant and Secretary Austin discussed the importance of avoiding regional escalation,” the Israeli defence ministry said in a statement."}, {"id": "0446e33d-eef1-47cf-b858-f2c3851a1c07", "title": "Israel says it is staging airstrikes inside Lebanon targeting the Shiite militia Hezbollah – Winnipeg Free Press", "date": "2024-08-25 03:30", "url": "https://www.winnipegfreepress.com/world/2024/08/24/israel-says-it-is-staging-airstrikes-inside-lebanon-targeting-the-shiite-militia-hezbollah", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "JERUSALEM (AP) — Israel launched a wave of airstrikes across southern Lebanon early Sunday in what it said was a preemptive strike to avert a large Hezbollah attack.\nThe Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles.\nIsrael’s Home Front Command raised the alert level across northern Israel before later lifting restrictions in most areas.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas’ Oct. 7 attack into Israel.\nIranian state media on Sunday played up the Hezbollah attack, calling it a success, but there was no immediate comment from Iranian officials."}, {"id": "142b43c9-80fe-48ce-af26-86ccff246d0e", "title": "Israelis stage airstrikes in Lebanon as Hezbollah launches drone attack", "date": "2024-08-25 06:30", "url": "https://www.lbc.co.uk/world-news/9771c554a78e458586e8738722f33ed8/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "The army said Hezbollah was planning to launch a heavy barrage of rockets and missiles towards Israel.\nThe Iranian-backed group had been promising to retaliate for Israel’s assassination of a top commander late last month.\nAir raid sirens were reported throughout northern Israel, and Israel’s Ben-Gurion International Airport began diverting incoming flights and delaying takeoffs.\nThe attack came as Egypt hosts a new round of talks aimed at ending Israel’s war against Hamas, now in its 11th month.\nHezbollah began attacking Israel almost immediately after the war with Hamas erupted on October 7 with a Hamas cross-border attack."}, {"id": "f643440c-84a4-4f58-ab06-59efbf14356f", "title": "Israel Netanyahu vows strikes in Lebanon  not the end  as Hezbollah retaliates - Middle East live", "date": "2024-08-25 13:45", "url": "https://www.independent.co.uk/news/world/middle-east/israel-strikes-hezbollah-lebanon-rockets-iran-gaza-b2601537.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Israeli prime minister Benjamin Netanyahu has vowed that the latest exchange of strikes with Hezbollah in southern Lebanon is “not the end of the story”.\nIsrael launched a series of nearly 40 airstrikes in southern Lebanon early on Sunday in what it described as a “preemptive attack” to prevent an imminent Hezbollah drone and rocket strike.\nHezbollah, which had vowed retaliation for Israel's assassination of one of its top commanders in Beirut last month, responded anyway, hitting military sites and Iron Dome platforms with over 320 drones and rockets.\nIsrael and Hezbollah have been exchanging fire almost daily since Israel started a retaliatory air and ground war in Gaza on 7 October, after Hamas launched an incursion into Israel, killing 1,200 people and taking more than 250 captive, around hald of which are still being held hostage."}, {"id": "ef4980dd-4485-47a3-a189-cb4f515417a6", "title": "Polish journalist injured in Russian attack on Kramatorsk – photo", "date": "2024-08-25 12:45", "url": "https://www.yahoo.com/news/polish-journalist-injured-russian-attack-101700812.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Polish citizen Monika Andruszewska has been injured as a result of a Russian missile strike on Kramatorsk, Donetsk Oblast.\nSource: European Pravda with reference to Polsat NewsDetails: Russian troops attacked Kramatorsk on the night of Sunday, 24-25 August.\nHe said that three people were injured in the Russian strike – journalists, citizens of Ukraine, the United States and the United Kingdom.\nIn addition, it became known that Andruszewska, who covers Russia's war against Ukraine, was injured in the attack.\nThe prosecutor's office reports that Russian troops allegedly hit it with an Iskander-M missile."}, {"id": "6cc40cfb-2e21-441b-b534-aab1d8c24b92", "title": "WW3 fears with Middle East at  the brink of all - out conflict  after Israel - Hezbollah air strike", "date": "2024-08-25 13:00", "url": "https://www.dailystar.co.uk/news/ww3-fears-middle-east-the-33534273", "domain": "dailystar.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailSomething went wrong, please try again later.\n(Image: POOL/AFP via Getty Images)It’s now feared this major escalation in tensions could trigger all-out war, dragging in the United States, Iran and militant groups across the region.\nChris Hughes, The Mirror’s Defence and Security Editor, agreed that this morning’s air strikes could spark a wider conflict."}, {"id": "40e0c3c8-4c36-46fe-aade-727f5e623482", "title": "UN coordinator urge Israel and Hezbollah to cease fire", "date": "2024-08-25 12:45", "url": "https://www.albawaba.com/news/un-coordinator-urge-israel-and-hezbollah-1582765", "domain": "albawaba.com", "domain_classification": "Unknown", "message": "U.N. Special Coordinator for Lebanon Jeanine Hennis-Plasschaert and the U.N. Interim Force in Lebanon (UNIFIL) on Sunday called on Israel and Hezbollah to “cease fire and refrain from further escalatory action,” in light of the “worrying developments across the Blue Line since the early morning.”“A return to the cessation of hostilities, followed by the implementation of U.N. Security Council resolution 1701, is the only sustainable way forward,” a joint statement said.\n“We will continue our contacts to strongly urge for de-escalation,” it added.\nIsrael launched a wave of airstrikes across southern Lebanon early Sunday in what it said was a preemptive strike on Hezbollah, as the Lebanese group said it had launched hundreds of rockets and drones to avenge the killing of Fouad Shukur, its top military chief, who was killed in an Israeli airstrike on Beirut’s southern suburbs weeks ago.\nThe heavy exchange of fire came amid mounting fears of an all-out war that could draw in the United States, Iran and its militant allies across the region."}, {"id": "95a7e280-728b-494b-9325-bdda897015cb", "title": "Israel and Hezbollah exchange heavy fire , raising fears of an all - out regional war", "date": "2024-08-25 09:15", "url": "https://santamariatimes.com/ap/international/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-an-all-out-regional-war/article_32c395c0-0ea8-5543-8f95-491f0e2b7e1f.html", "domain": "santamariatimes.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "c9966351-2e1e-4333-b10b-a01056cd5dfd", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 10:45", "url": "https://www.interlochenpublicradio.org/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "interlochenpublicradio.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "2b70c4cf-0f73-4cef-ae7a-94b5f5c5e033", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 10:45", "url": "https://www.wvxu.org/news-from-npr/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "wvxu.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "6a4b4a9e-e59d-481d-b436-bea6b592ea85", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 10:45", "url": "https://www.wrkf.org/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "wrkf.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "5bed3843-6cb6-45fc-b420-90b81219f8c8", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 12:30", "url": "https://www.kvpr.org/npr-news/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "kvpr.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "4182b847-bb9f-4933-90ff-dfb9725178ce", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 10:30", "url": "https://www.wemu.org/npr-national-news/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "wemu.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "ccf3017a-3fc0-4302-8fee-72235a4f1d2c", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 10:30", "url": "https://www.wknofm.org/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "wknofm.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "2cb87b3f-5b2a-4893-80c4-f4cb6b7cf0dc", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 10:30", "url": "https://www.mynspr.org/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "mynspr.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "70078364-a17c-4283-a4c0-cf1592e87238", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 12:30", "url": "https://news.prairiepublic.org/news-from-npr/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "news.prairiepublic.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "62ad1155-24d1-4dc8-be42-d9cf3bd01afd", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 12:30", "url": "https://www.wprl.org/npr-news/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "wprl.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "baea2ef7-d8e0-4ef2-a13b-9330357d06d7", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 10:45", "url": "https://www.wbfo.org/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "wbfo.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "c74444bf-7158-4e57-bdda-fa290cf94be8", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 10:45", "url": "https://www.klcc.org/npr-world-news/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "klcc.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "31725c08-75e1-4f17-b12a-f94792c58895", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 10:30", "url": "https://www.ksut.org/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "ksut.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "df573a29-746b-447f-a72f-d263e8445389", "title": "Israel and Hezbollah exchange heavy fire , raising fears of an all - out regional war", "date": "2024-08-25 10:30", "url": "https://www.thesunchronicle.com/news/nation_world/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-an-all-out-regional-war/article_a2ca8e4d-3815-585a-a88d-fbd887b3f4b4.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "0b42fe35-c04f-4b7a-aa6f-8ff092f4f7cd", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 10:30", "url": "https://www.wglt.org/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "wglt.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "fc595997-66e1-4cd9-9311-2f27a329f6c6", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 11:00", "url": "https://www.kedm.org/npr-news/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "kedm.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "388cefe9-7d19-48b7-acc5-efb023fd1d6c", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 11:00", "url": "https://www.kzyx.org/npr-news/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "kzyx.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "f10ae36a-8299-4261-85cf-9f89a0ef5334", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 10:00", "url": "https://www.kyuk.org/2024-08-24/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "kyuk.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "c16a3f27-de80-4d6d-93b6-0f7f4914000b", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 13:45", "url": "https://www.krwg.org/national-news/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "krwg.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "809768ee-c86a-48d6-a877-bea847c65e59", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 12:45", "url": "https://www.apr.org/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "apr.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "6326f24c-5467-435e-acce-4eca4f987540", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 13:30", "url": "https://www.hppr.org/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "hppr.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "4a1bbc84-22d1-4e6f-b2a3-f1967e755893", "title": "Israel and Hezbollah exchange heavy fire , raising fears of a regional war", "date": "2024-08-25 14:00", "url": "https://www.aspenpublicradio.org/2024-08-25/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-a-regional-war", "domain": "aspenpublicradio.org", "domain_classification": "Unknown", "message": "The Israeli military said it struck because Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nIsrael’s Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said Hezbollah had intended to hit targets in northern and central Israel.\nIt listed 11 bases, barracks and military positions that it said it targeted in northern Israel and the Israeli-annexed Golan Heights.\nHezbollah began attacking Israel almost immediately after the start of the war in Gaza, which was triggered by Hamas' Oct. 7 attack into Israel."}, {"id": "1e893fed-eba6-4e37-b841-d9038f94dd5e", "title": "Preemptive Attack Struck Hezbollah Launchers Programmed to Fire at 5 AM | The Jewish Press - JewishPress . com | David Israel | 21 Av 5784 – Sunday , August 25 , 2024", "date": "2024-08-25 09:45", "url": "https://www.jewishpress.com/news/middle-east/hezbollah/preemptive-attack-struck-hezbollah-launchers-programmed-to-fire-at-5-am/2024/08/25/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Photo Credit: GPOIsrael conducted a preemptive strike against missile launchers in Lebanon that were set to target Tel Aviv at 5 AM, the NY Times reported Sunday morning, citing Western intelligence sources.\nIsrael is now bracing for a potentially severe retaliation from Hezbollah, especially in the north.\nAccording to Channel 12, the IDF took out 6000 aerial Hezbollah weapons that were meant to be launched at Israel, including, rockets, missiles, and drones.\nFrom Metro Tel Aviv south, there are no restrictions on gatherings, workplaces, or educational activities.\nHezbollah announced it had begun an “initial response” to the Israeli assassination of its chief of staff Fuad Shukr in late July."}, {"id": "60ab9f30-bb73-4ba0-bf10-90044d35a170", "title": "Israel Declares 48 - Hour Emergency After Lebanon Strikes Spike Middle East Tensions ; US Ready To Defend Ally", "date": "2024-08-25 05:00", "url": "https://www.news18.com/world/israel-declares-48-hour-emergency-after-lebanon-strikes-escalate-tensions-us-ready-to-defend-ally-9027147.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "The Israeli military said its fighter jets attacked thousands of Hezbollah rocket launchers in south Lebanon on Sunday that were aimed at northern and central Israel.\nAs the “pre-emptive Israeli strikes” escalated tensions in the region, Defence Minister Yoav Gallant announced a 48-hour nationwide state of emergency.\nHezbollah in turn “fired hundreds of rockets and UAVs towards northern Israel”, most of them after Israel launched its attack, Israeli military spokesperson Lieutenant-Colonel Nadav Shoshani told reporters.\n“I hereby declare a special situation on the home front in other areas of the country.\n“We have conducted precise strikes in Lebanon in order to thwart an imminent threat against the citizens of Israel,” Gallant told Austin, according to the statement."}, {"id": "ad71b109-0519-4466-9eeb-dffd0a2ad3a4", "title": "Israelis stage airstrikes in Lebanon as Hezbollah launches drone attack", "date": "2024-08-25 09:30", "url": "https://jerseyeveningpost.com/morenews/worldnews/2024/08/25/israelis-stage-airstrikes-in-lebanon-as-hezbollah-launches-drone-attack/", "domain": "jerseyeveningpost.com", "domain_classification": "Unknown", "message": "The army said Hezbollah was planning to launch a heavy barrage of rockets and missiles towards Israel.\nThe Iranian-backed group had been promising to retaliate for Israel’s assassination of a top commander late last month.\nAir raid sirens were reported throughout northern Israel, and Israel’s Ben-Gurion International Airport began diverting incoming flights and delaying takeoffs.\nThe attack came as Egypt hosts a new round of talks aimed at ending Israel’s war against Hamas, now in its 11th month.\nHezbollah began attacking Israel almost immediately after the war with Hamas erupted on October 7 with a Hamas cross-border attack."}, {"id": "b457ceca-37c1-4665-a4f8-43ee30b8eafa", "title": "Live updates : Israel launches strikes against Hezbollah targets in Lebanon", "date": "2024-08-25 05:45", "url": "https://www.nbcnews.com/news/world/live-blog/live-updates-israel-launches-strikes-hezbollah-lebanon-rcna168111", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "In a call today with U.S. Defense Secretary Lloyd Austin, Israeli Minister of Defense Yoav Gallant explained Israel's military action as preemptive and designed to protect its citizens.\nGallant declared a \"special situation on the home front\" in response to the back-and-forth strikes with Iran-backed Hezbollah militants, saying the move can restrict gatherings to increase Israelis' safety during the battle.\n“We have conducted precise strikes in Lebanon in order to thwart an imminent threat against the citizens of Israel,\" he told Austin.\n\"We are closely following developments in Beirut, and we are determined to use all the means at our disposal in order to defend our citizens.\"\nBoth men discussed the importance of avoiding regional escalation in Israel's ongoing war with Hamas militants in Gaza, with whom Iran and Hezbollah sympathize, according to the defense ministry."}, {"id": "fd1d08c2-f29e-4a0c-a8f9-d11a0b2dd376", "title": "Israel and Hezbollah have good reason to avoid war – but it remains possible", "date": "2024-08-25 13:00", "url": "https://www.theguardian.com/world/article/2024/aug/25/israel-and-hezbollah-have-good-reason-to-avoid-war-but-it-remains-possible", "domain": "theguardian.com", "domain_classification": "International", "message": "If Israel and Hezbollah wanted an all-out war it would have happened a long time ago.\nThe Israel Defense Forces (IDF) were clearly taking far more care over civilian casualties in Lebanon than they have in Gaza.\nFor its part, Hezbollah’s leadership has assets to protect in Lebanon, political and economic, that would be devastated in a war with Israel.\nJust because neither Israel nor Hezbollah wants a war now, does not mean it is not going to happen, however.\nThe Biden administration’s principal aim since 7 October – and principal achievement, US officials argue – has been to prevent the Gaza war becoming a regional conflagration."}, {"id": "96024507-d8fb-466f-b4b1-8c2c8a87e6ce", "title": "Israel attacks southern Lebanon , Hezbollah launches rockets at Israel", "date": "2024-08-25 07:15", "url": "https://www.aljazeera.com/news/2024/8/25/israel-launches-attacks-on-lebanon-hezbollah-launches-rockets-at-israel", "domain": "aljazeera.com", "domain_classification": "International", "message": "Israel says it attacked southern Lebanon to ‘preempt’ a Hezbollah attack on northern Israeli towns.\nEarlier on Sunday, Israel said it had launched airstrikes on southern Lebanon in a “preemptive” attack when it detected Hezbollah’s preparation to attack northern Israel.\nIsrael’s Ben Gurion airport was temporarily closed in the early hours of the morning, while reports emerged of some injuries in northern Israel.\nThe Israeli army also announced a series of restrictions on civilians in northern Israel and the Golan Heights.\nNo diplomatic settlement, however, appears to be taking form and “Israel is determined to change rules of engagement” that would allow a return of all Israelis who were evacuated from northern Israel, said Nader."}, {"id": "afabdd08-ecb8-4bd6-93bd-76d6aedcae66", "title": "Israel and Hezbollah have good reason to avoid war – but it remains possible", "date": "2024-08-25 13:00", "url": "https://www.aol.co.uk/news/israel-hezbollah-good-reason-avoid-120604619.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Smoke billows from the site of an Israeli airstrike on Zibqin in southern Lebanon on Sunday, amid escalating cross-border tensions.\nPhotograph: Kawnat Haju/AFP/Getty ImagesIf Israel and Hezbollah wanted an all-out war it would have happened a long time ago.\nThe Israel Defense Forces (IDF) were clearly taking far more care over civilian casualties in Lebanon than they have in Gaza.\nJust because neither Israel nor Hezbollah wants a war now, does not mean it is not going to happen, however.\nThe Biden administration’s principal aim since 7 October – and principal achievement, US officials argue – has been to prevent the Gaza war becoming a regional conflagration."}, {"id": "4566e693-a221-4a62-8a08-d643309f6cb8", "title": "Israel and Hezbollah trade heavy fire before pulling back , jolting a region braced for war", "date": "2024-08-25 10:30", "url": "https://www.ajc.com/news/nation-world/israel-and-hezbollah-exchange-heavy-fire-raising-fears-of-an-all-out-regional-war/F3CKQ5AG5FCVXPA2E6ZO2QNRLY/", "domain": "ajc.com", "domain_classification": "Unknown", "message": "AJC - Logo - Main logo_ddn_tag_Site JN with Tagline logo-sns_tag_SiteOur apologies, unfortunately our website is currently unavailable in most European countries due to GDPR rules."}, {"id": "3dfcae58-a43b-4536-bbab-b4129aa19203", "title": "", "date": "2024-08-25 13:45", "url": "http://www.israelnationalnews.com/news/395134", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The Hezbollah terrorist organization planned to strike a facility of strategic importance in the Tel Aviv area, possibly Ben Gurion Airport, before its attack was thwarted by a pre-emptive Israeli strike Sunday morning, an intelligence source told the media.\nHezbollah published a statement in which it claimed that 320 rockets had been launched at \"military targets\" in Israeli territory.\nThe number of rockets that have been launched so far at enemy positions has exceeded 320.\"\nEarlier, it was reported that Hezbollah planned to launch a number of precision-guided missiles at the Glilot area where the Mossad headquarters and 8200 Intelligence Unit base are located.\nHezbollah was reportedly preparing to launch about 6,000 rockets and drones at Israel."}, {"id": "57d7d4c5-8274-4aeb-9fa5-045181ba2de0", "title": "Ukraine Foreign Ministry calls on world to punish Russia for attack on Kramatorsk where journalists were injured", "date": "2024-08-25 13:15", "url": "https://www.pravda.com.ua/eng/news/2024/08/25/7471804/", "domain": "pravda.com.ua", "domain_classification": "Unknown", "message": "Ukraine's Ministry of Foreign Affairs has called for the punishment of Russia for the attack on Kramatorsk on Saturday, which resulted in the injury of foreign media journalists.\nAdvertisement:Quote from the spokesperson: \"Another heinous and deliberate Russian strike hit Kramatorsk's residential areas last night, injuring foreign media journalists in a hotel...\nIn total, a team of six Reuters members was staying at the Sapphire Hotel, which was hit by the shelling.\nEarlier, it was reported that Polish journalist Monika Andruszewska, who has been covering the war in Ukraine since 2014, was injured in the attack.\nAdvertisement:Vadym Filashkin, the Head of the Donetsk Oblast Military Administration, said that three people were injured in the Russian attack – journalists, citizens of Ukraine, the United States and the United Kingdom."}, {"id": "5d51007e-9c8c-433e-9b96-1a5f97fb31d7", "title": "Israel , Hezbollah Trade Heavy Fire", "date": "2024-08-25 12:45", "url": "https://www.newser.com/story/355099/israel-hezbollah-trade-heavy-fire.html", "domain": "newser.com", "domain_classification": "Unknown", "message": "As the AP reports, it could also torpedo efforts to forge a ceasefire in Gaza, where Israel has been at war with Hezbollah ally Hamas.\nThe Israeli military said Hezbollah was planning to launch a heavy barrage of rockets and missiles toward Israel.\nAir raid sirens were reported throughout northern Israel, and Israel's Ben-Gurion international airport closed and diverted flights for approximately an hour due to the threat of attack.\nIsrael's Home Front Command raised the alert level in northern Israel and encouraged people to stay near bomb shelters.\nLt. Col. Nadav Shoshani, an Israeli military spokesman, said initial assessments found \"very little damage\" in Israel, but that the military remained on high alert."}, {"id": "92cf0df8-e433-476e-b930-fd8cdffb040e", "title": "Bharat Electronics Ltd . Secures Orders Worth 695 Crore for Advanced Defence Equipment – Indian Defence Research Wing", "date": "2024-08-25 05:00", "url": "https://idrw.org/bharat-electronics-ltd-secures-orders-worth-695-crore-for-advanced-defence-equipment/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Bharat Electronics Ltd. Secures Orders Worth 695 Crore for Advanced Defence Equipment| BySOURCE: AFIBharat Electronics Ltd. (BEL), a state-run defense equipment manufacturer in India, has announced the securing of new orders valued at ?695 crore.\nThese orders encompass a wide range of advanced defense technologies, including Combat Management Systems, Communication Equipment, Stabilized Optronic Pedestals, and various upgrades, spares, and services.\nCommunication Equipment: Modern warfare requires seamless communication across different platforms and environments.\nUpgrades, Spares, and Services: Alongside new equipment, the orders also include various upgrades to existing systems, supply of spares, and maintenance services.\nThis ensures the longevity and operational readiness of the defense equipment, aligning with the Indian military’s strategy of modernizing and maintaining its current arsenal."}, {"id": "7ac5c50a-413b-4423-b7c1-314a101eb151", "title": "Defining terrorism begins with common sense | COMMENTARY", "date": "2024-08-25 07:45", "url": "https://www.reviewjournal.com/opinion/commentary-defining-terrorism-begins-with-common-sense-3146968/", "domain": "reviewjournal.com", "domain_classification": "Unknown", "message": "The world is complicated, and sometimes there are layers of complications that lie on top of social, political and religious issues.\nI worry that many people are distracted by the ideological noise that swirls around us and quite unintentionally become enablers of terrorism.\nAccepting this definition would demand that you condemn every country in history and every political, social or religious movement.\nIt is the intentional killing of the innocent to make a social, political or religious point.\nRepresentatives of Hamas sometimes claim that no Israelis are innocent, so their attacks cannot be terrorism."}, {"id": "af66e4e2-bbcb-4361-b7db-8ee18c50d3a4", "title": "Sciutto Grills John Spencer on Civilian Deaths in Gaza", "date": "2024-08-25 00:30", "url": "https://www.mediaite.com/tv/cnns-jim-sciutto-grills-west-points-john-spencer-on-defense-of-civilian-deaths-in-gaza-others-are-looking-at-the-same-data/", "domain": "mediaite.com", "domain_classification": "Unknown", "message": "CNN’s Jim Sciutto grilled John Spencer, the chair of Urban Warfare Studies at the Modern War Institute at West Point, as to why his assessment of the civilian death toll in Israeli military operations in Gaza is consistently different from that of other military analysts.\n“Wes Bryant, special operations with a joint terminal, he was a joint terminal attack controller during the U.S. war on terror,” Scuitto noted.\nSCIUTTO: John, in fairness, I’m quoting – I’m quoting to you someone who is quite aware of the law war.\nHe worked in special operations for the U.S. military in the joint terminal attack – as a joint terminal attack controller, making exactly those decisions.\nAnd he examined not the data about U.S. military interactions prior, but Israeli military activity in Gaza."}, {"id": "87870c7a-c57c-4f49-aba4-e1f4c2a00adf", "title": "US approves sale of anti - submarine warfare sonobuoys to India for $52 . 8 million", "date": "2024-08-25 05:00", "url": "https://www.moneycontrol.com/news/india/us-agrees-to-sell-52-8-million-worth-of-anti-submarine-warfare-equipment-to-india-12805992.html", "domain": "moneycontrol.com", "domain_classification": "Unknown", "message": "Follow us on:US approves sale of anti-submarine warfare sonobuoys to India for $52.8 million"}, {"id": "d85769cd-6b71-408e-9d9d-94700a480d16", "title": "", "date": "2024-08-25 04:45", "url": "https://www.israelnationalnews.com/news/395121", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "It was explained to him that not only would that not happen, but evacuating the Philadelphi Corridor would enable the flood of enormous quantities of weapons.\nThe security establishment claims that if Israel now leaves the Philadelphi Corridor and the smuggling resumes, the IDF will be able to return and retake control of the corridor.\nBoots on the groundIn light of all this, there is no substitute for a physical Israeli presence along the corridor to prevent smuggling.\nIf the overall military control that is needed to combat terror is to be in Israel’s hands, Israel needs to maintain control of all of Gaza’s borders, including the Philadelphi Corridor.\nSecond, lasting Israeli control of the Philadelphi Corridor is what will preclude Hamas control of the strategic passage."}, {"id": "72cb2800-360c-43fc-8956-3354ef3dfb6f", "title": "", "date": "2024-08-25 07:00", "url": "http://www.israelnationalnews.com/news/395121", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "It was explained to him that not only would that not happen, but evacuating the Philadelphi Corridor would enable the flood of enormous quantities of weapons.\nThe security establishment claims that if Israel now leaves the Philadelphi Corridor and the smuggling resumes, the IDF will be able to return and retake control of the corridor.\nBoots on the groundIn light of all this, there is no substitute for a physical Israeli presence along the corridor to prevent smuggling.\nIf the overall military control that is needed to combat terror is to be in Israel’s hands, Israel needs to maintain control of all of Gaza’s borders, including the Philadelphi Corridor.\nSecond, lasting Israeli control of the Philadelphi Corridor is what will preclude Hamas control of the strategic passage."}, {"id": "cc5e4bf0-5506-4be6-9339-456c34aadd11", "title": "", "date": "2024-08-25 13:45", "url": "http://www.israelnationalnews.com/news/395144", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "Over the past few months, the 16th Brigade, 10th Brigade, and 454th Brigade under the command of the 252nd Division have been operating in the Central Gaza Strip Corridor.\nIn the activity of the 6310th Reconnaissance Battalion, during a search of a building where terrorists were located, the soldiers Sergeant First Class (res.)\nEvyatar Atuar z\"l, Sergeant First Class (res.)\nGen. Yehuda Vach told the troops: \"I am proud of you, proud to command over you, proud of the soldiers' spirit and intensity - we march forward.\"\nUnderground, the troops located and dismantled strategic tunnel routes used by the enemy, connecting the southern and northern parts of the Gaza Strip."}, {"id": "6eaeaa24-dcdb-4493-93bd-2e530beccd79", "title": "AWEIL Showcases Cutting - Edge Weapons at  Pratigya 2024  Exhibition in Bhiwani , Haryana – Indian Defence Research Wing", "date": "2024-08-25 13:45", "url": "https://idrw.org/aweil-showcases-cutting-edge-weapons-at-pratigya-2024-exhibition-in-bhiwani-haryana/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "AWEIL Showcases Cutting-Edge Weapons at “Pratigya 2024” Exhibition in Bhiwani, Haryana| BySOURCE: AFIThe “Pratigya 2024” exhibition, held from August 22 to August 24 in Bhiwani, Haryana, provided a comprehensive platform for defense organizations and technology innovators to showcase their latest advancements.\nAmong the participants was Advanced Weapons and Equipment India Limited (AWEIL), a prominent player in India’s defense sector, known for its expertise in the design and manufacture of advanced weapon systems.\nAWEIL’s exhibition highlighted its commitment to advancing India’s defense capabilities through innovation and indigenous development.\nAt the “Pratigya 2024” exhibition, AWEIL showcased a wide range of its cutting-edge weaponry and defense equipment, demonstrating the company’s technological prowess and its ongoing efforts to strengthen India’s defense infrastructure.\nAWEIL’s commitment to refining this platform is evident in the continuous improvements and innovations presented at “”Pratigya 2024″,” showcasing the potential for enhanced battlefield effectiveness."}, {"id": "78e35e27-884a-49a3-a053-6764f55fb096", "title": "US approves sale of anti - submarine warfare Sonobuoys to India estimated at $52 . 8 million", "date": "2024-08-25 07:30", "url": "https://www.livemint.com/news/india/us-approves-sale-of-anti-submarine-warfare-sonobuoys-to-india-estimated-at-52-8-million-11724560041686.html", "domain": "livemint.com", "domain_classification": "Unknown", "message": "The United States has approved a potential sale of anti-submarine warfare equipment to India on August 24.\nSecretary of State Antony Blinken has given the green light for a Foreign Military Sale of sonobuoys and related gear to India, estimated at $52.8 million.\nThe Defence Security Cooperation Agency (DSCA) has notified Congress of this proposed sale, which includes various types of sonobuoys and associated technical support.\nThe proposed sale aligns with the broader context of strengthening US-India defense ties.\nDuring a recent four-day visit to the United States, Indian Defence Minister Rajnath Singh met with key US officials and visited naval facilities."}, {"id": "3b3684b5-6e7a-4c64-9e9f-a7a74a5dde67", "title": "Israel has rediscovered the power of the preemptive strike", "date": "2024-08-25 11:00", "url": "https://www.yahoo.com/news/israel-rediscovered-power-preemptive-strike-101719465.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Has war between Israel and Hezbollah started?\nThat conflagration, which took place exactly 50 years before October 7, was the closest Israel has come to destruction.\nThe White House may have forgotten the meaning of deterrent in enforcing global stability, but Israel does not have that luxury.\nThe Six Day War of 1967, by contrast, was the archetypal moment of Israeli military genius.\nBut in the Israeli military mind, decision-making takes place within the two poles of the Yom Kippur War and the war of Six Days."}, {"id": "3059b2f5-c74f-46b2-95b2-03b33c0327fb", "title": "Israel has rediscovered the power of the preemptive strike", "date": "2024-08-25 13:45", "url": "https://www.telegraph.co.uk/news/2024/08/25/israel-has-rediscovered-the-power-of-the-preemptive-strike/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Princess of Wales seen with family at church for first time since cancer announcement"}, {"id": "ac02d23b-9941-4036-98f8-177a73e21e17", "title": "Israel has rediscovered the power of the preemptive strike", "date": "2024-08-25 10:45", "url": "https://www.aol.co.uk/news/israel-rediscovered-power-preemptive-strike-101719199.html", "domain": "aol.co.uk", "domain_classification": "Unknown", "message": "Hezbollah unmanned aerial vehicle (UAV) crossing from Lebanon gets intercepted by an Israeli fighter jet over an area near the Lebanon-Israel borderHas war between Israel and Hezbollah started?\nThat conflagration, which took place exactly 50 years before October 7, was the closest Israel has come to destruction.\nThe White House may have forgotten the meaning of deterrent in enforcing global stability, but Israel does not have that luxury.\nThe Six Day War of 1967, by contrast, was the archetypal moment of Israeli military genius.\nBut in the Israeli military mind, decision-making takes place within the two poles of the Yom Kippur War and the war of Six Days."}, {"id": "68e411be-7882-4e30-ad61-ce63ba784c58", "title": "Bonnie Watson Coleman Brazen Anti - Israel Bias", "date": "2024-08-25 06:45", "url": "https://townhall.com/columnists/jonathanfeldstein/2024/08/25/bonnie-watson-colemans-brazen-anti-israel-bias-n2643769", "domain": "townhall.com", "domain_classification": "Unknown", "message": "On July 31, I received an email from my Congresswoman, Bonnie Watson Coleman (NJ-12), about her important July activities.\nWatson Coleman crossed a red line with “facts” that even Hamas did not have the hubris to suggest.\nAdvertisementWhether deliberately and maliciously, or from ignorance and bias, when speaking of food, Watson Coleman wants to have her cake and eat it too.\nWatson Coleman claims, “Schools, homes, hospitals, and mosques, all have been destroyed and 85 percent of the population has been displaced.” Whoa!\nAdvertisementBonnie Watson Coleman is neither a lawyer, a foreign policy expert, nor an intellectual."}, {"id": "bd01b09b-52db-4e74-b0fa-06c043797c75", "title": "Lack of International Cooperation in AMCA Program a Risky Gamble ? – Indian Defence Research Wing", "date": "2024-08-25 13:45", "url": "https://idrw.org/lack-of-international-cooperation-in-amca-program-a-risky-gamble/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Lack of International Cooperation in AMCA Program a Risky Gamble ?\nThe AMCA program, a key project for India’s defense modernization efforts, aims to develop an indigenous 5th Generation stealth fighter jet to bolster the Indian Air Force’s capabilities.\nBoeing and Safran, two leading global aerospace companies, have previously offered to collaborate on the AMCA program.\nTheir offers were contingent upon India selecting their fighter jets under its tender for 114 jets in the Multi-Role Fighter Aircraft (MRFA) competition.\nAn international collaboration could provide the necessary buffer against such risks, ensuring that the AMCA program progresses smoothly and within its intended time frame."}, {"id": "304fd30c-f4dd-4441-96f0-0b08e858b558", "title": "Caprock Chronicles : The Battle at Red River", "date": "2024-08-25 09:15", "url": "https://www.yahoo.com/news/caprock-chronicles-battle-red-river-084128635.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "This is the third of a series of articles that commemorate the Red River War, which occurred 150 years ago this year.\nHe had hoped that one quick decisive battle would end the Red River War, but that was not to be.\nMiles returned to the site on the Red River where they had spent the previous night.\nThe next day Miles ordered Captain Wyllys Lyman to return to Camp Supply with several wagons for the badly needed supplies.\nThis article originally appeared on Lubbock Avalanche-Journal: Caprock Chronicles: The Battle at Red River"}, {"id": "39ddbc81-ce50-4aec-b2c0-744c9912a76d", "title": "Zelensky Advisor Urges Bulgaria : Supply Weapons to Avoid Troop Deployment - Novinite . com", "date": "2024-08-25 12:45", "url": "https://www.novinite.com/articles/227951/Zelensky", "domain": "novinite.com", "domain_classification": "Unknown", "message": "Mykhailo Podolyak, advisor to the President of Ukraine, has urged Bulgaria to provide more weapons to avoid sending troops, reports OFFNews.\nIn a discussion with Bessarabian Bulgarian journalist Tanya Staneva, Podolyak emphasized the importance of advanced weaponry over the deployment of personnel.\nPodolyak remarked that the recent Kursk offensive underscored the significance of having sufficient weapons rather than additional troops.\nThe Kursk offensive showed that there is no need for people meaning, if we have the necessary amount of weapons.\nStaneva relayed Podolyak’s appreciation for Bulgaria’s military support, noting its critical role in aiding Ukraine."}, {"id": "9a464a10-eb80-4bbb-911f-851f228f1bbd", "title": "Shoplifters & Scammers : At War with the Law", "date": "2024-08-25 06:30", "url": "https://www.tvguide.co.uk/schedule/0b6b750d-5032-58c3-975f-e6af9a931d51/shoplifters-and-scammers-at-war-with-the-law", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "Shoplifters & Scammers: At War with the Law5STAR 12:00 PM to 1:00 PM Sunday 25 August Share Add toCalendar +Episode 20 S SubtitlesDocumentary following shopping centre security teams who are locked in a cat and mouse battle to catch criminalsShoplifters & Scammers: At War with the Law airs on 5STAR at 12:00 PM, Sunday 25 August .\n(Subtitles.)\nLearn more about Shoplifters & Scammers: At War with the Law and other education/science/factual topics on our factual page"}, {"id": "8431e224-0d0e-482b-b9d4-59242794e1dc", "title": "Ukraine Loses 1 , 900 Troops in Special Operation Zone in Past Day", "date": "2024-08-25 12:45", "url": "https://sputnikglobe.com/20240825/ukraine-loses-1900-troops-in-special-operation-zone-in-past-day-1119902005.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240825/ukraine-loses-1900-troops-in-special-operation-zone-in-past-day-1119902005.htmlUkraine Loses 1,900 Troops in Special Operation Zone in Past DayUkraine Loses 1,900 Troops in Special Operation Zone in Past DaySputnik InternationalThe Ukrainian armed forces have lost 1,900 servicepeople in the special operation zone over the past 24 hours, the Russian Defense Ministry said on Sunday.\n2024-08-25T11:27+00002024-08-25T11:27+00002024-08-25T11:27+0000russia's special operation in ukrainerussian armyrussian armed forcesukrainian crisisukrainekhersonhigh mobility artillery rocket system (himars)https://cdn1.img.sputnikglobe.com/images/sharing/article/eng/1119902005.jpg?1724585270Ukrainian formations lost up to 130 personnel in the areas of operations of Russia's Northern grouping in the Sumy and Kharkov regions.\nMeanwhile, the Southern grouping improved its positions along the frontline, causing Ukrainian forces to lose up to 630 servicepeople and a US-supplied Abrams main battle tank, the ministry said in a bulletin.\nRussian forces also targeted a temporary deployment area for foreign mercenaries as well as clusters of enemy manpower and military hardware in 147 areas.\nhttps://sputnikglobe.com/20240824/distress-and-confusion-what-does-ukraine-seek-to-achieve-by-attacking-russian-nuclear-plants-1119897699.htmlukrainekhersonSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 602024Sputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Newsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Sputnik International feedback@sputniknews.com +74956456601 MIA „Rossiya Segodnya“ 252 60Sputnik Internationalrussian armed forces, ukraine crisis, russian army, russian special operation ukraine, russian special military operation ukraine"}, {"id": "3a47d963-9e9b-4a54-83ed-86540c563d83", "title": "India , US look forward to working together : Defence Minister Rajnath Singh", "date": "2024-08-25 04:45", "url": "https://economictimes.indiatimes.com/news/defence/india-us-look-forward-to-working-together-defence-minister-rajnath-singh/articleshow/112774823.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelWashington: India and the US look forward to working together and benefiting from each other's experiences, Defence Minister Rajnath Singh has said, as he visited a top American naval surface warfare facility in Maryland.\nSingh is in the US on a four-day official visit to further boost the comprehensive global strategic partnership between the US and India.\n\"Visited the Naval Surface Warfare Centre at Carderock and witnessed the pathbreaking experiments at the facility,\" Singh said in a post on X.\n\"We share a vision of a free and open Indo-Pacific, and our defence cooperation continues to grow stronger and stronger,\" Austin said.\nThere will be no adverse impact on US defence readiness as a result of this proposed sale, the statement said."}, {"id": "511834ee-beb3-4a0f-a6f5-d3870052ddac", "title": "India , US Look Forward To Working Together And Benefiting From Each Other Experiences : Rajnath Singh", "date": "2024-08-25 05:00", "url": "https://www.news18.com/world/india-us-look-forward-to-working-together-defence-minister-rajnath-singh-9027140.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "India and the US look forward to working together and benefiting from each other’s experiences, Defence Minister Rajnath Singh has said, as he visited a top American naval surface warfare facility in Maryland.\n“We share a vision of a free and open Indo-Pacific, and our defence cooperation continues to grow stronger and stronger,” Austin said.\nThe Defence Security Cooperation Agency delivered the required certification notifying Congress of this possible sale on Friday.\nThe implementation of this proposed sale will not require the assignment of any additional US government or contractor representatives to India.\nThere will be no adverse impact on US defence readiness as a result of this proposed sale, the statement said."}, {"id": "a0ea0bf0-7225-4e44-9771-f4145f2f53c4", "title": "Press Briefing by IDF Spokesperson RAdm . Daniel Hagari - August 24 , 2024", "date": "2024-08-25 06:15", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240824-idf01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Daniel Hagari- August 24, 2024IDF Press ReleaseAugust 24, 202424.08.24IDFThis evening, we are updating that four IDF reservist soldiers fell in combat on the Netzarim Corridor over the weekend.\nEvyatar Atuar z\"l, Sergeant First Class (res.)\nIn a separate incident, yesterday evening, four terrorists opened fire on a position where IDF troops were stationed.\nOver the past week and throughout the weekend, IDF troops continue to engage in combat across all arenas—southern, northern, and in Judea and Samaria.\nIn the north, IDF troops continue to operate with determination and strength against Hezbollah."}, {"id": "7f21d286-451f-4589-b48d-b76722afdb61", "title": "HYD : IDF Announces Death Of Soldier Killed In Southern Gaza – The Yeshiva World", "date": "2024-08-25 12:45", "url": "https://www.theyeshivaworld.com/news/israel-news/2308546/hyd-idf-announces-death-of-soldier-killed-in-southern-gaza.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "The IDF on Sunday morning announced the death of a soldier who was killed in battle in the southern Gaza Strip.\nHe was killed by an explosive device detonated by Hamas terrorists in Khan Younis.\nA soldier from the 401st Armored Brigade’s 601st Engineering Battalion was seriously wounded in the same incident.\nHis death increases the toll of IDF soldiers killed in the ground war in Gaza to 337 and the number of soldiers killed since October 7 to 700.\nOn Motzei Shabbos and Friday, the IDF announced the deaths of four soldiers killed in Gaza, three by an explosive device detonated by Hamas terrorists in Gaza City and one in a battle with Hamas terrorists in the Netzarim Corridor."}, {"id": "3655faa2-0dbc-439a-937d-df8c021313b3", "title": "What is Hezbollah and how powerful is its military ? ", "date": "2024-08-25 07:15", "url": "https://news.sky.com/story/what-is-hezbollah-how-powerful-is-its-military-and-will-it-play-a-role-in-war-breaking-out-in-the-middle-east-12999375", "domain": "news.sky.com", "domain_classification": "International", "message": "The attacks from both sides come following the death of top Hezbollah military commander Fuad Shukr, who was killed in a strike in Beirut's southern suburbs in July.\nLatest updates: Hezbollah attacks Israel as Israeli jets hit targets in LebanonImage: Skies over the Lebanese side of the border with Israel following the latest attacks.\nHezbollah is a well-equipped military force of substantial size - but it also has significant sway over Lebanon.\nYou can use the buttons below to amend your preferences to enable Spreaker cookies or to allow those cookies just once.\nTo view this content you can use the button below to allow Spreaker cookies for this session only."}, {"id": "a8c7fe0f-8ff9-40cb-b4bc-70ab06c7bf95", "title": "History : 82nd Airborne cavalry units at Fort Liberty case colors indefinitely", "date": "2024-08-25 11:00", "url": "https://www.yahoo.com/news/history-82nd-airborne-cavalry-units-090432501.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "FORT LIBERTY — Cavalry units in the 82nd Airborne Division have started inactivating, the division announced on its social media pages this month.\nParatroopers with the 3rd Squadron, 73rd Cavalry Regiment participate in a unit inactivation ceremony Aug. 9, 2024.\n3rd SquadronSocial media posts from the division stated that the 3rd Squadron, 73rd Cavalry Regiment cased its colors during an Aug. 9 inactivation ceremony.\nThe 82nd Airborne Division has three squadrons under its 73rd Cavalry Regiment at Fort Liberty — the 1st Squadron, 3rd Squadron and 5th Squadron.\nThe 1st Squadron, 73rd Cavalry Regiment cases its colors during a July 31, 2024, unit inactivation ceremony at Fort Liberty."}, {"id": "0ae6780b-0414-42ad-a868-dca76b1d3aec", "title": "Defence Minister visits Naval Surface Warfare Centre in US", "date": "2024-08-25 09:30", "url": "https://news.webindia123.com/news/Articles/World/20240825/4228534.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Defence Minister Rajnath Singh, as a part of his ongoing tour to the US, visited the William B Morgan Large Cavitation Channel (LCC) in the Naval Surface Warfare Centre (NSWC) at Memphis, Tennessee, a statement by the Ministry of Defence said on Sunday.\nThe LCC is one of the world's largest and most technically-advanced water tunnel facility for testing submarines, torpedoes, naval surface ships, and propellers.\nIn a post on X, the Defence Ministry posted, \"Raksha Mantri Shri Rajnath Singh visits Naval Surface Warfare Centre in US.\"\nhttps://x.com/DefenceMinIndia/status/1827587234528207022 Singh was accompanied by the Ambassador of India to the US, the Director General, Naval Operations from the Indian Navy and DRDO Defence Technology Counsellor, among others.\nIn another statement, the Defence Ministry also stated, \"Jet engines to munitions: Rajnath Singh meets US NSA Jake Sullivan, India and US to speed up co-production\"."}, {"id": "a3d9bcff-6c1c-4c38-91f8-fcd171d5c4e7", "title": "3 reasons to watch The First Slam Dunk on Netflix in August", "date": "2024-08-25 13:15", "url": "https://www.digitaltrends.com/movies/the-first-slam-dunk-netflx-reasons-to-watch/", "domain": "digitaltrends.com", "domain_classification": "Unknown", "message": "The First Slam Dunk, a Japanese animated sports film, has finally bounced its way onto Netflix.\nThe First Slam Dunk is based on Takehiko Inoue’s landmark manga series, Slam Dunk, from the 1990s.\nRecommended VideosIn honor of The First Slam Dunk on Netflix, here are three reasons to watch.\nThe First Slam Dunk depicts conflict with Hisashi, a former bully who must earn the trust of his squad.\nThe First Slam Dunk is now streaming on Netflix."}, {"id": "893fae35-35f3-4a04-b33a-9d28c39fbf66", "title": "  India , US look forward to work together ...: Defence Minister Rajnath Singh visits Naval Surface Warfare Centre at Carderock", "date": "2024-08-25 05:15", "url": "https://www.thestatesman.com/india/india-us-look-forward-to-work-together-defence-minister-rajnath-singh-visits-naval-surface-warfare-centre-at-carderock-1503335477.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "Defence Minister Rajnath Singh visited the Naval Surface Warfare Centre at Carderock on Saturday and witnessed the experiments being conducted and the facilities available at the centre.\nIn a post on X, he shared, “Visited Naval Surface Warfare Centre at Carderock and witnessed the pathbreaking experiments at the facility.\nAdvertisementRajnath Singh highlighted that ‘partnership’ and ‘joint efforts’ are the two keywords that differentiate India’s defence industry partnership with other nations.\nIn addition, a few Indian companies, such as ideaForge, Tata Sons and Tsecond, along with senior leaders from The Cohen Group attended the interaction with the Defence Minister.\nThey held wide-ranging discussions on bilateral defence cooperation, industrial collaboration, regional security and other international issues."}, {"id": "e2b55d3e-ce50-4eb3-b0d6-0ae1630ed60d", "title": "Takeaways from the AP review of Tim Walz descriptions of his military record", "date": "2024-08-25 12:30", "url": "https://www.yahoo.com/news/takeaways-aps-review-tim-walzs-115345944.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Takeaways from the AP's review of Tim Walz's descriptions of his military recordWASHINGTON (AP) — Democratic vice presidential nominee Tim Walz served in the National Guard for 24 years, rising through the enlisted ranks and receiving an honorable discharge.\nA look at the findingsRank matters“I’m a retired command sergeant major,” Walz said in 2006 as he campaigned to unseat the six-term Republican in Minnesota’s 1st Congressional District.\nWalz served briefly as a command sergeant major, but that was not the rank he held at retirement.\nThat distinction -– serving as a command sergeant major, but not retiring in that position –- may seem minor to civilians.\nKnown as an E-9 in military parlance, a command sergeant major is the pinnacle of achievement in the Army’s enlisted corps."}, {"id": "b6f9d1ca-22cc-4b41-8409-d426dd5cbf38", "title": "Takeaways from the AP review of Tim Walz descriptions of his military record", "date": "2024-08-25 12:45", "url": "https://www.kob.com/politics-news/takeaways-from-the-aps-review-of-tim-walzs-descriptions-of-his-military-record/", "domain": "kob.com", "domain_classification": "Unknown", "message": "A look at the findingsRank matters“I’m a retired command sergeant major,” Walz said in 2006 as he campaigned to unseat the six-term Republican in Minnesota’s 1st Congressional District.\nWalz served briefly as a command sergeant major, but that was not the rank he held at retirement.\nThat distinction -– serving as a command sergeant major, but not retiring in that position –- may seem minor to civilians.\nKnown as an E-9 in military parlance, a command sergeant major is the pinnacle of achievement in the Army’s enlisted corps.\n“The rank of command sergeant major, that E-9 rank, is sacred."}, {"id": "557a5379-169d-41d3-a086-52845847a4c8", "title": "Egypt warns visiting US general on Lebanon risk", "date": "2024-08-25 13:45", "url": "https://www.yahoo.com/news/egypt-warns-visiting-us-general-125841774.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "CAIRO (Reuters) - Egyptian President Abdel Fattah al-Sisi warned America's top general during a meeting on Sunday of the dangers of a major conflict in Lebanon.\nBrown, chairman of the Joint Chiefs of Staff, arrived in Egypt hours after a significant missile exchange between Israel and Lebanese Hezbollah.\nBrown’s spokesperson said the U.S. general discussed ways \"to deter the conflict from broadening\" during the meetings.\nPrior to his Egypt trip, Brown met Jordan's Chairman of the Joint Chiefs Maj. Gen. Yousef Al-Huneiti in Amman.\nBeyond the dangers of a major escalation between Israel and Lebanon, U.S. officials are keeping a close eye out for any military moves by Iran."}, {"id": "0b418bcf-eb27-49b6-9b6d-955093321fb8", "title": "His Own Words : Why RFK Jr now Backs Trump", "date": "2024-08-25 10:45", "url": "https://www.ruthfullyyours.com/2024/08/25/his-own-words-why-rfk-jr-now-backs-trump/", "domain": "ruthfullyyours.com", "domain_classification": "Unknown", "message": "His Own Words: Why RFK Jr now Backs Trumphttps://quadrant.org.au/opinion/america/2024/08/his-own-words-why-rfk-jr-now-backs-trump/On Friday (US time) the unthinkable came to pass: A Kennedy, the closest America gets to political royalty, endorsed Donald Trump.\nLacking confidence that its candidate could win at the voting booth, the DNC waged continual legal warfare against both President Trump and myself.\nIt deployed DNC-aligned judges to throw me — and other candidates — off the ballot and to throw President Trump in jail.\nHow did the Democratic Party choose a candidate that has never done an interview or debate during the entire election cycle?\nThese are the principal causes that persuaded me to leave the Democratic Party, and then as an Independent, and now throw my support to President Trump."}, {"id": "550d4f9b-b03d-4822-bede-31a713b4e5aa", "title": "Gaza ceasefire talks in Cairo stall without progress", "date": "2024-08-25 06:45", "url": "https://tribune.com.pk/story/2490832/gaza-ceasefire-talks-in-cairo-stall-without-progress", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Gaza ceasefire and hostage negotiators discussed new compromise proposals in Cairo on Saturday, seeking to bridge gaps between Israel and Hamas, but there was no indication of progress after hours of talks.\n\"The talks in Cairo didn’t make any progress.\nThe Cairo talks came as the humanitarian situation in Gaza deteriorated, with malnutrition soaring and polio discovered in the Palestinian enclave.\nThe Hamas delegation returned to Doha, Qatar, after the briefing on the round of talks ended, the Palestinian official said.\nHamas has accused Israel of going back on things it had previously agreed to in the talks, which Israel denies."}, {"id": "812a229f-b9bf-4e74-8b08-b2db91b66570", "title": "Takeaways from the AP review of Tim Walz descriptions of his military record", "date": "2024-08-25 13:15", "url": "https://abcnews.go.com/Politics/wireStory/takeaways-aps-review-tim-walzs-descriptions-military-record-113132632", "domain": "abcnews.go.com", "domain_classification": "International", "message": "A look at the findings“I’m a retired command sergeant major,” Walz said in 2006 as he campaigned to unseat the six-term Republican in Minnesota’s 1st Congressional District.\nWalz served briefly as a command sergeant major, but that was not the rank he held at retirement.\nThat distinction -– serving as a command sergeant major, but not retiring in that position –- may seem minor to civilians.\nKnown as an E-9 in military parlance, a command sergeant major is the pinnacle of achievement in the Army’s enlisted corps.\n“The rank of command sergeant major, that E-9 rank, is sacred."}, {"id": "5848bfa1-4fd7-4132-b2bf-ed73d3956836", "title": "Sunita Williams And Butch Wilmore : The Two Astronauts Stuck In Space", "date": "2024-08-25 13:15", "url": "https://www.ndtv.com/world-news/sunita-williams-and-butch-wilmore-the-two-astronauts-stuck-in-space-6414168", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Barry \"Butch\" Wilmore and Sunita \"Suni\" Williams are both former military test pilotsTwo veteran NASA astronauts with a combined 500 days of previous spaceflight were the first crew launched into space on Boeing's Starliner space capsule, in a June 5 test flight from Florida.\nNow Barry \"Butch\" Wilmore and Sunita \"Suni\" Williams, both former military test pilots, will not return to Earth until early next year on a SpaceX vehicle.\nBefore his Starliner mission, Wilmore had logged 178 days in space and completed four spacewalks.\nLike Wilmore, Williams first flew to the space station aboard a space shuttle and made a return visit as a Soyuz passenger riding along with two cosmonauts.\nBefore her Starliner mission to ISS, Williams had spent a total of 322 days in space."}, {"id": "62344f16-b506-4f66-931e-5e151d95e92d", "title": "Who are the first astronauts to fly aboard Boeing Starliner ? ", "date": "2024-08-25 09:00", "url": "https://dunyanews.tv/en/Technology/832958-who-are-the-first-astronauts-to-fly-aboard-boeings-starliner", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Who are the first astronauts to fly aboard Boeing's Starliner?\nTechnology Technology Who are the first astronauts to fly aboard Boeing's Starliner?\nBefore his Starliner mission, Wilmore had logged 178 days in space and completed four spacewalks.\nLike Wilmore, Williams first flew to the space station aboard a space shuttle and made a return visit as a Soyuz passenger riding along with two cosmonauts.\nBefore her Starliner mission to ISS, Williams had spent a total of 322 days in space."}, {"id": "2991c282-56ae-46cd-9e82-9b023a312f25", "title": "Hezbollah targets 11 Israeli military sites in  first phase  of retaliatory attack", "date": "2024-08-25 06:00", "url": "https://news.sky.com/story/hezbollah-targets-11-israeli-military-sites-in-first-phase-of-retaliatory-attack-13202914", "domain": "news.sky.com", "domain_classification": "International", "message": "Israel has launched a wave of \"pre-emptive\" airstrikes in southern Lebanon against Hezbollah - as the militant group said it had fired drones and hundreds of rockets.\nWarning sirens sounded in northern Israel and explosions were heard as the military's Iron Dome aerial defence system shot down missiles from southern Lebanon.\nIn Israel, military spokesman Lieutenant Colonel Nadav Shoshani said initial assessments found \"very little damage\" but that the military remained on high alert.\nIt also said it identified a terrorist cell operating in Khiam in southern Lebanon.\nThe spectre hanging over Lebanon and Israel is what happened in 2006, when Hezbollah and Israel went toe to toe in a full-scale war."}, {"id": "2f18f5c5-bed5-4b86-a676-2146827666df", "title": "  A sick old man from Red Square who ... : What Ukraine President Zelenskyy said about Putin in I - Day speech", "date": "2024-08-25 03:30", "url": "https://timesofindia.indiatimes.com/world/europe/a-sick-old-man-from-red-square-who-what-ukraine-president-zelenskyy-said-about-putin-in-i-day-speech/articleshow/112773856.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Volodymyr Zelenskyy during the Ukraine 's 33rd Independence Day speech called Russian President Putin a 'sick old man' who threatens everyone of nuclear attack.\n\"A sick old man from Red Square who constantly threatens everyone with the red button will not dictate any of his red lines to us,\" Zelenskyy said in a video on the Telegram.Additionally, he announced a new Ukrainian \" drone missile \" called Palianytsia , which he claimed would bring the war back to Russia .\n\"Our enemy will ... know what the Ukrainian way for retaliation is.\n\"It will be very difficult for Russia, difficult to even pronounce what exactly has hit it,\" said Zelenskyy.Despite Russia's relentless attacks on Ukraine with missiles and drones since the invasion began in February 2022, Moscow has condemned Ukraine's drone strikes as acts of terrorism.\n\"We are touched to see how the PT-91 Twardy tanks, given by Poland (to Ukraine) more than one year ago, are defending today Ukraine on the battlefields, fighting in the Kursk region,\" he said."}, {"id": "aea8c3f4-a66c-4e26-9646-14cf64942595", "title": "Taking a stand against the wiles of the enemy : An eyeball to eyeball confrontation", "date": "2024-08-25 03:30", "url": "https://www.thestandard.co.zw/religion-zone/article/200031407/taking-a-stand-against-the-wiles-of-the-enemy-an-eyeball-to-eyeball-confrontation", "domain": "thestandard.co.zw", "domain_classification": "Unknown", "message": "The word “wiles” is one of three key words you must know and understand when studying the subject of spiritual warfare.\nThe word wiles is taken from the Greek word methodos.\nThe word wiles (methodos) is often translated to carry the idea of something that is cunning, crafty, subtle, or full of trickery.\nThe word wiles (methodos) plainly means that the enemy travels on one road, one lane, or one avenue.\nFirst, the word “wiles” (methodos) explicitly tells us that the devil travels with a road or on a road."}, {"id": "e40afcd5-8c08-47c4-81cb-1fc9da88a615", "title": "Who are the first astronauts to fly aboard Boeing Starliner ? ", "date": "2024-08-25 09:30", "url": "https://www.khaleejtimes.com/world/who-are-the-first-astronauts-to-fly-aboard-boeings-starliner", "domain": "khaleejtimes.com", "domain_classification": "Unknown", "message": "The Starliner capsule sprang leaks and some of its thrusters failed, so their mission at the International Space Station has been extended by months.\nHe also served as a Navy test pilot and flight instructor before joining the Nasa astronaut corps in 2000.\nBefore his Starliner mission, Wilmore had logged 178 days in space and completed four spacewalks.\nLike Wilmore, Williams first flew to the space station aboard a space shuttle and made a return visit as a Soyuz passenger riding along with two cosmonauts.\nBefore her Starliner mission to ISS, Williams had spent a total of 322 days in space."}, {"id": "55d968a1-0d33-4038-8e09-9719734d7f0c", "title": "Caio Borralho scores late knockdown to win wild UFC Vegas 96 main event against Jared Cannonier", "date": "2024-08-25 07:15", "url": "https://www.mmafighting.com/2024/8/25/24227826/ufc-vegas-96-results-caio-borralho-scores-late-knockdown-to-outlast-jared-cannonier-wild-main-event", "domain": "mmafighting.com", "domain_classification": "Unknown", "message": "All three judges scored the fight for Borralho, with two giving the surging 185-pounder four of the five rounds.\nAs the action resumed, Cannonier landed a nice left hook, but Borralho delivered a pair of brutal calf kicks that were quite effective.\nCannonier landed a heavy right hand that saw Borralho’s face change, followed by a nice combination.\nThe final round was a battle of attrition, with both fighters feeling the effects of the previous 20 minutes.\nCannonier has now dropped two straight, including a TKO loss to Nassourdine Imavov in the main event of UFC Louisville in June."}, {"id": "a654f010-7603-43b1-a345-b15d378a329f", "title": "Paris 2024 Paralympics : Everything You Need to Know", "date": "2024-08-25 13:00", "url": "https://www.telecomasia.net/blog/paris-2024-paralympics-everything-you-need-to-know/", "domain": "telecomasia.net", "domain_classification": "Unknown", "message": "In this article, we will take you through everything you need to know about the Summer Paralympics.\nParis 2024 ParalympicsWhen are the Paralympics?\nThe Paralympic Games Paris 2024 will kick off on Wednesday, August 28, through September 8, 2024, with the Opening Ceremony set to be held at the Place de la Concorde.\nThe Paris 2024 Paralympics will feature around 4,400 athletes participating in 28 paralympic sports sanctioned by the IPC, comprising 22 summer sports and six winter sports.\nParis 2024 Paralympic VenuesWhere to Watch the Opening of the Paris 2024 Paralympic GamesInterested fans of the Paris 2024 Paralympics can find information about their broadcasting partners and how to watch their favorite athletes in Paris from anywhere in the world at the link below."}, {"id": "28ffd953-e4cb-4831-b8a2-6d84573875b2", "title": "Millions of Shiite Muslim pilgrims head to Iraq Karbala to mark the death of Imam Hussein", "date": "2024-08-25 04:45", "url": "https://dunyanews.tv/en/World/832844-millions-of-shiite-muslim-pilgrims-head-to-iraqs-karbala-to-mark-the-", "domain": "dunyanews.tv", "domain_classification": "Unknown", "message": "Millions of Shiite Muslim pilgrims head to Iraq's Karbala to mark the death of Imam HusseinWorld World Millions of Shiite Muslim pilgrims head to Iraq's Karbala to mark the death of Imam HusseinMillions of Shiite Muslim pilgrims head to Iraq’s Karbala to mark the death of Imam HusseinFollow on Updated On: Sun, 25 Aug 2024 08:34:46 PKTKARBALA, Iraq (AP) — Millions of Shiite Muslims packed the streets of the Iraqi city of Karbala on Saturday on their annual pilgrim to mark the death of Prophet Muhammad’s grandson, Hussein, who became a symbol of resistance when he refused to pledge allegiance to the Umayyad caliphate, leading to his death in battle during the tumultuous first century of Islam’s history.\nTahseen Al-Khafaji, head of the Iraqi security media cell, said that more than 3 million pilgrims had entered the country as of Friday, amid tight security measures.\nHussein’s death exacerbated the schism between Islam’s two main sects, Sunni and Shiite.\nOn Saturday, the rhythmic sound of pilgrims pounding their chests and heads as they circled the Imam Hussein Shrine filled the air.\n“Everything we offer is to commemorate and serve our Master (Hussein),” said Hussein Ali, a volunteer in Baghdad."}, {"id": "133d2621-534a-4898-b5af-2ba7c2a72e89", "title": "From Sublime to Ridiculous – Russia T - 80  Super Turtle Tank  ", "date": "2024-08-25 06:45", "url": "https://www.kyivpost.com/post/37897", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Initially these took the form of improvised crude grills, frames and screens to protect their turrets and other vulnerable parts.\nOver time, the cages became bigger, eventually covering most of the vehicle, with reports that anti-drone grills were being fitted to newly built tanks and APCs in the factory.\nThey were quickly dubbed “turtle tanks.”The concept caught on and the “turtle shells” became more intricate and extensive.\nRussian milblogger Zvezdanews posted a video on Telegram on Aug. 21 showing what is described as the “king of barbecues” and what the military issues website Military Recognition.com called a Super Turtle Tank.\nAccording to Zvezdanews, the super turtle is a T-80 main battle tank (MBT) already fitted with a cope cage, to which a second protective box has been added covering the whole vehicle."}, {"id": "5195c9ba-2d52-406f-8689-5050c9a8848f", "title": "Rajnath invites American defence companies to set up manufacturing units in India", "date": "2024-08-25 13:45", "url": "https://www.thestatesman.com/india/rajnath-invites-american-defence-companies-to-set-up-manufacturing-units-in-india-1503335566.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "Defence Minister Rajnath Singh underlined the various emerging co-development and co-production opportunities in the defence sector in India due to the progressive reforms undertaken by the Modi government.\nHe invited foreign original equipment manufacturers, including from the United States, to set up manufacturing units in India, develop joint ventures and also to make India their alternate export base.\nThe defence minister was interacting with the senior leadership of US defence companies in Washington last night.\nAdvertisementMr Singh highlighted that ‘Partnership’ and ‘Joint Efforts’ are the two keywords that differentiate India’s defence industry partnership with other nations.\nIn addition, few Indian companies such as ideaForge, Tata Sons and Tsecond, along with senior leaders from The Cohen Group attended the interaction with the defence minister."}, {"id": "85bdefe0-8cae-4b64-94b7-2502b1fd071a", "title": "Bawumia cautions security agencies to guard against Misinformation , Disinformation", "date": "2024-08-25 09:15", "url": "https://www.myjoyonline.com/bawumia-cautions-security-agencies-to-guard-against-misinformation-disinformation/", "domain": "myjoyonline.com", "domain_classification": "Unknown", "message": "He has therefore called on all stakeholders, including the Military and other security agencies, to be alert and vigilant to avoid falling for fake and misleading material that could lead to unnecessary actions.\nHowever, we find ourselves in an era of intense misinformation and disinformation campaigns targeted at both the civil populace, you the Armed Forces and the government.\nThrough this, we can equally position the Armed Forces, Sister Security agencies and allied armed forces to better defend Ghana and our respective friendly countries effectively,” he emphasized.\nTherefore, you must understand the importance of collaborative efforts in realizing national security objectives or operational goals.\nThese further shed light on the essence of joint operations as well as the key roles allies, multi-national agencies, sister security agencies and governmental organisations play in achieving set objectives."}, {"id": "cbfccb1b-ad47-496f-b474-2a02cc2bcec4", "title": "Why Does the IAF C - 130J Have a Chin - Mounted FLIR Star SAFIRE III EO / IR ? – Indian Defence Research Wing", "date": "2024-08-25 13:45", "url": "https://idrw.org/why-does-the-iafs-c-130j-have-a-chin-mounted-flir-star-safire-iii-eo-ir/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Why Does the IAF’s C-130J Have a Chin-Mounted FLIR Star SAFIRE III EO/IR?\n| BySOURCE: AFIThe Indian Air Force (IAF) equips its C-130J Super Hercules transport aircraft with the chin-mounted FLIR Star SAFIRE III EO/IR (Electro-Optical/Infrared) sensor system to enhance the aircraft’s operational capabilities.\nThe FLIR Star SAFIRE III is a multi-sensor system that integrates advanced electro-optical and infrared imaging technologies.\nLaser Designation and Rangefinding: The Star SAFIRE III can designate targets with a laser and provide precise range measurements.\nThe chin-mounted FLIR Star SAFIRE III EO/IR system on the IAF’s C-130J significantly enhances the aircraft’s versatility and effectiveness in a wide range of missions."}, {"id": "d2120755-5294-4a9e-ba0f-d4a4c3d390f8", "title": "BBC Antiques Roadshow guest lost for words as  dirty  car boot sale paintings worth fortune", "date": "2024-08-25 07:45", "url": "https://www.mirror.co.uk/tv/tv-news/antiques-roadshow-chinese-paintings-bbc-33532060", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "An Antiques Roadshow guest was left lost for words when she discovered the true value of a pair of paintings she wasn't exactly fond ofAn Antiques Roadshow guest was simply gobsmacked when a pair of unloved paintings hidden away in her loft for 14 years turned out to be worth a small fortune.\nBBC's Antiques Roadshow saw expert David Battle at Ightham Mote in Ivy Hatch as he examined two peculiar paintings brought by a lady visitor.\nImage: BBC) BBC)She added that her son-in-law fancied them to be mid 18th Century Indian artefacts, jokingly claiming his supposed expertise in the field.\nDespite the lack of details about the origin of the paintings or their purchase price, Battle revealed her son-in-law's assessment was \"completely wrong\".\nAntiques Roadshow can be viewed on BBC One and BBC iPlayer."}, {"id": "ec688c1f-abbf-4f9d-a06f-ab3d2cb21f74", "title": "Zelensky gamble : Could two citie fate lead to Ukraine war endgame ? ", "date": "2024-08-25 06:45", "url": "https://www.heraldscotland.com/politics/24540513.zelenskys-gamble-two-cities-fate-lead-ukraine-war-endgame/", "domain": "heraldscotland.com", "domain_classification": "Unknown", "message": "These two cities, Pokrovsk in Ukraine and Kursk in Russia, have now become the two new epicentres of this war.\nA family cries as they see their grandmother leaving on a train, to a safer part of Ukraine, they too will leave tomorrow, at the train station in Pokrovsk, Ukraine, 23 August.\n“In fact, by concentrating efforts here, Russian troops have recently captured more land per week than at any point since May,” Rothrock added.\nIt has also brought the war toRussian territory, turning the tables more than two years after Russia invaded Ukraine.\n“On my instructions, the Kursk city administration identified key points for placing concrete modular shelters in crowded places,” he said."}, {"id": "903fe687-4b10-417f-87cf-8c4149b4ab38", "title": "Israel Distances Itself From Blacklisted Pegasus Sypware Maker NSO : World News", "date": "2024-08-25 13:45", "url": "https://www.rashtranews.com/israel-distances-itself-from-blacklisted-pegasus-sypware-maker-nso-world-news/", "domain": "rashtranews.com", "domain_classification": "Unknown", "message": "An investigation by 17 media organisations published in July said NSO’s Pegasus software had targeted smartphones of journalists, rights activists and government officials in several countries.\nThe company sends its products abroad under licences from Israel’s Defence Ministry, which has launched its own probe of the company’s practices after the alleged software misuse emerged.\nNo results have been announced and Israel has given no indication so far that it was considering limiting the scope of NSO’s exports.\nNSO says it only sells its products to law enforcement and intelligence agencies and takes steps to curb abuse.\n(Except for the headline, this story has not been edited by RashtraNews.com and is published from a syndicated feed.)"}, {"id": "50576cd2-6986-4988-af08-2b66476b94c9", "title": "NASA astronauts who will spend extra months at space station are veteran Navy pilots", "date": "2024-08-25 06:30", "url": "https://abc7.com/post/nasa-astronauts-will-spend-extra-months-space-station-are-veteran-navy-pilots/15227706/", "domain": "abc7.com", "domain_classification": "Unknown", "message": "NASA astronauts who will spend extra months at space station are veteran Navy pilotsNASA decided Saturday it's too risky to bring two astronauts Butch Wilmore and Suni Williams from ISS back to Earth in Boeing's troubled new capsule.\nNASA decided Saturday it's too risky to bring two astronauts Butch Wilmore and Suni Williams from ISS back to Earth in Boeing's troubled new capsule.\nNASA decided Saturday it's too risky to bring two astronauts Butch Wilmore and Suni Williams from ISS back to Earth in Boeing's troubled new capsule.\nCAPE CANAVERAL, Florida -- The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts."}, {"id": "91024580-6872-4793-b32f-86576b78fdbd", "title": "Moscow and Kyiv Swap Prisoners of War as Ukraine Marks Independence Anniversary", "date": "2024-08-25 03:00", "url": "https://www.theyeshivaworld.com/news/general/2308408/moscow-and-kyiv-swap-prisoners-of-war-as-ukraine-marks-independence-anniversary.html", "domain": "theyeshivaworld.com", "domain_classification": "Unknown", "message": "Russia and Ukraine exchanged over 100 prisoners of war each on Saturday as Kyiv marked its third Independence Day since Moscow’s full-scale invasion.\nThere have also been isolated reports of abuse of Russian soldiers, mostly during capture or transit to internment sites.\nLast January, Russia and Ukraine exchanged hundreds of prisoners of war in the biggest single release.\nTwo people were killed in a Russian drone attack, and one further person in shelling, in the northeastern Sumy region.\nIndependence Day commemorationsUkraine marked its 33rd Independence Day Saturday as its war against Russia’s aggression reaches a 30-month milestone."}, {"id": "0c2c08c1-0203-4645-bd78-a2cd525b5389", "title": "Who are the two NASA astronauts stranded at the International Space Station ? ", "date": "2024-08-25 03:00", "url": "https://www.necn.com/news/national-international/who-are-the-two-nasa-astronauts-stranded-at-the-international-space-station/3317324/", "domain": "necn.com", "domain_classification": "Unknown", "message": "The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\nThe six NASA astronauts aboard the International Space Station celebrated the beginning of the Paris Olympics with a weightless recreation of the torch relay and some of their favorite Olympic sports.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "12877fb5-7a1b-4357-9dbb-9c7599f97f5d", "title": "1 Terrorist Killed In Ongoing Encounter At J & K Baramulla District – Indian Defence Research Wing", "date": "2024-08-25 05:00", "url": "https://idrw.org/1-terrorist-killed-in-ongoing-encounter-at-jks-baramulla-district/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "1 Terrorist Killed In Ongoing Encounter At J&K’s Baramulla District| BySOURCE: IANSOne terrorist was killed on Saturday in an encounter with the security forces in J&K’s Baramulla district.\nEarlier, an exchange of firing took place between the security forces and the terrorists in the Watergam area of Baramulla district.\n“In the exchange of firing, one terrorist was killed and his weapon was recovered from the encounter site.\nSecurity forces including the army, paramilitary forces and local police have been aggressively carrying out anti-terrorism operations in J&K for the last three months.\nOver 300 additional companies of paramilitary forces are being deployed to augment the strength of the already existing security forces in J&K to secure the democratic process."}, {"id": "3b012616-5aed-4456-a383-ec9dece540f6", "title": "NASA astronauts who will spend extra months at the space station are veteran Navy pilots", "date": "2024-08-25 03:00", "url": "https://www.stripes.com/theaters/us/2024-08-24/astronaut-nasa-navy-pilots-14967783.html", "domain": "stripes.com", "domain_classification": "Unknown", "message": "(Chris O’Meara/AP)CAPE CANAVERAL, Fla. — The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\nSuni WilliamsWilliams, 58, is the first woman to serve as a test pilot for a new spacecraft.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "13c33685-5613-446a-8ea2-e0cf8e3fad62", "title": "What Just Happened Between Israel And Hezbollah ? | HuffPost united kingdom Politics", "date": "2024-08-25 10:45", "url": "https://www.huffingtonpost.co.uk/entry/what-just-happened-between-israel-and-hezbollah_uk_66cad6c4e4b03a649d3671aa", "domain": "huffingtonpost.co.uk", "domain_classification": "Unknown", "message": "This photo taken from a position in northern Israel shows a Hezbollah UAV intercepted by Israeli air forces on August 25, 2024.\nHezbollah later confirmed it had attacked Israel in the first phase of a plan against its neighbouring country.\nIsrael declared a 48-hour state of emergency early on Sunday morning, restricting civilian movement, while sirens sounded across northern Israel.\nHowever, Israel said it is not looking for “an all-out war” in the Middle East, according to foreign minister Israel Katz.\nHezbollah has denied that Israel’s strikes were “pre-emptive” and played down Israel’s claim that its strikes had caused significant damage."}, {"id": "667ded9e-3572-4583-a414-7db751265fb1", "title": "Lawsuit challenges mask ban in New York county , claiming discrimination against disabled people", "date": "2024-08-25 09:00", "url": "https://www.yahoo.com/news/lawsuit-challenges-mask-ban-york-062804957.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Republican-controlled Nassau County Legislature passed the bill on Aug. 5, and it was signed into law on Aug. 14.\n\"This mask ban poses a direct threat to public health and discriminates against people with disabilities,\" the disability rights group's executive director Timothy A. Clune said in a statement.\nNASSAU COUNTY BANS MASKS IN PUBLIC TO CURB VIOLENT CRIME, PROTESTSA disability rights organization has sued to block the Nassau County, New York, mask ban that prohibits face coverings in public except for health and religious reasons.\nThe plaintiffs say they are now fearful of harassment and potential arrest due to the new mask ban.\nOriginal article source: Lawsuit challenges mask ban in New York county, claiming discrimination against disabled people"}, {"id": "eb40ed4f-3b4c-45fb-b611-9038614a8cb2", "title": "Pentagon Wants to Use Special Ops to Train Taiwan for New Fight", "date": "2024-08-25 13:00", "url": "https://www.businessinsider.com/using-special-ops-to-train-taiwan-others-for-new-fights-2024-8", "domain": "businessinsider.com", "domain_classification": "Unknown", "message": "New Authorities for Special OperatorsIn America's last war, special operations forces were the go-to option for military commanders and policymakers.\nThe fighting against insurgents and terrorists in the conflicts in Afghanistan, Iraq, and Syria was ideal for special operations forces.\nUS ArmyOne of the more valuable capabilities of the US special operations community is its ability to train and equip others to fight.\nSimilarly, in Central and South America, Green Berets have trained local militaries to fend off Communist insurgents.\nThe Chinese military will use everything at its disposal, including special operations forces and intelligence operatives."}, {"id": "a5fc694d-2e26-4df6-9e3d-f709348a8e3a", "title": "NASA astronauts who will spend extra months at the space station are veteran Navy pilots", "date": "2024-08-25 00:00", "url": "https://www.ksat.com/tech/2024/08/24/nasa-astronauts-who-will-spend-extra-months-at-the-space-station-are-veteran-navy-pilots/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "(AP Photo/Chris O'Meara, File)CAPE CANAVERAL, Fla. – The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\nSuni WilliamsWilliams, 58, is the first woman to serve as a test pilot for a new spacecraft.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "e9ee973c-0cdd-4796-bef6-32809286a42a", "title": "NASA astronauts who will spend extra months at the space station are veteran Navy pilots", "date": "2024-08-25 00:00", "url": "https://www.clickondetroit.com/tech/2024/08/24/nasa-astronauts-who-will-spend-extra-months-at-the-space-station-are-veteran-navy-pilots/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "(AP Photo/Chris O'Meara, File)CAPE CANAVERAL, Fla. – The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\nSuni WilliamsWilliams, 58, is the first woman to serve as a test pilot for a new spacecraft.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "980c58f5-ef29-4dbc-89b6-166e5d29a6ca", "title": "Russia loses 1 , 190 more soldiers in war against Ukraine", "date": "2024-08-25 08:00", "url": "https://www.yahoo.com/news/russia-loses-1-190-more-052054186.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia loses 1,190 more soldiers in war against UkraineRussian forces have lost 1,190 more soldiers (both killed and wounded), 5 tanks and 47 artillery systems over the past 24 hours.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 25 August 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 607,680 (+1,190) military personnel;8,547 (+5) tanks;16,631 (+11) armoured combat vehicles;17,396 (+47) artillery systems;1,171 (+2) multiple-launch rocket systems;936 (+1) air defence systems;367 (+0) fixed-wing aircraft;328 (+0) helicopters;14,095 (+31) strategic and tactical UAVs;2,444 (+0) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;23,475 (+92) vehicles and tankers;2,928 (+17) special vehicles and other equipment.\nSupport UP or become our patron!"}, {"id": "17907e88-f1b8-4947-b535-c3313c0d048a", "title": "Who are the two NASA astronauts stranded at the International Space Station ? ", "date": "2024-08-25 04:45", "url": "https://www.nbcnewyork.com/news/national-international/who-are-the-two-nasa-astronauts-stranded-at-the-international-space-station/5734428/", "domain": "nbcnewyork.com", "domain_classification": "Unknown", "message": "The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\nThe six NASA astronauts aboard the International Space Station celebrated the beginning of the Paris Olympics with a weightless recreation of the torch relay and some of their favorite Olympic sports.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "0caa54d5-483c-4842-9a2e-d3995f8cc735", "title": "  Stuck In Space  - NASA Tells 2 Astronauts Theyll Be At International Space Station Until February", "date": "2024-08-25 09:15", "url": "https://www.klove.com/news/tech-science/stuck-in-space-nasa-tells-2-astronauts-theyll-be-at-international-space-station-until-february-51699", "domain": "klove.com", "domain_classification": "Unknown", "message": "CAPE CANAVERAL, Fla. (AP) — The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\n[Photo Credit: NASA via AP] NASA Astronauts BoeingSuni WilliamsWilliams, 58, is the first woman to serve as a test pilot for a new spacecraft.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "7e473c2a-5c35-4f24-87d4-f06a7246ea09", "title": "Who are the two NASA astronauts stranded at the International Space Station ? ", "date": "2024-08-25 05:15", "url": "https://www.nbcchicago.com/news/national-international/who-are-the-two-nasa-astronauts-stranded-at-the-international-space-station/3531397/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\nThe six NASA astronauts aboard the International Space Station celebrated the beginning of the Paris Olympics with a weightless recreation of the torch relay and some of their favorite Olympic sports.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "7b8d068d-05be-439b-9f8a-4c4b997015e8", "title": "Manhunt under way after fire and explosion outside synagogue in southwest France", "date": "2024-08-25 01:00", "url": "https://www.euronews.com/my-europe/2024/08/25/manhunt-under-way-after-fire-and-explosion-outside-synagogue-in-southwest-france", "domain": "euronews.com", "domain_classification": "Unknown", "message": "ADVERTISEMENTPolice in France say they have arrested a man suspected of starting fires and causing an explosion outside a synagogue in the country’s southwest.\nFrench media said the suspect was shot and injured by police after he opened fire on the officers who came to arrest him in the city of Nîmes.\nPeople outside the Beth Yaacov synagogue in La Grande Motte, August 24, 2024 Screenshot from AP video 4513970Firefighters discovered additional fires at two entrances to the synagogue.\nFive people, including the rabbi, who were present in the synagogue complex at the time of the attack were unharmed.\n\"Once again, French Jews have been targeted and attacked because of their beliefs,\" Attal said after meeting with local officials and the synagogue staff."}, {"id": "c7cda1db-06f3-44dc-820b-e87011dedb48", "title": "Russia , Ukraine exchange POWs | The Arkansas Democrat - Gazette - Arkansa Best News Source", "date": "2024-08-25 10:45", "url": "https://www.arkansasonline.com/news/2024/aug/25/russia-ukraine-exchange-pows/", "domain": "arkansasonline.com", "domain_classification": "Unknown", "message": "KYIV, Ukraine -- Russia and Ukraine exchanged more than 200 prisoners of war each on Saturday as Kyiv marked its third Independence Day since Moscow's full-scale invasion.\nThe Russian Defense Ministry said the 115 Russian soldiers had been captured in the Kursk region, where Ukrainian forces launched their surprise offensive into Russia two weeks ago.\nThe ministry said the soldiers were in Belarus but would be taken to Russia for medical treatment and rehabilitation.\nNeither Ukraine nor Russia discloses how many POWs there are in total.\nThere have also been isolated reports of abuse of Russian soldiers, mostly during capture or transit to internment sites."}, {"id": "9edf2275-d7bf-44d7-b33f-9a6303a4bbb8", "title": "Drone described by Ukraine as  a completely new class of weapon  hits Russia for the first time", "date": "2024-08-25 09:15", "url": "https://news.yahoo.com/news/ukraine-reveals-attack-drone-hit-160003727.html", "domain": "news.yahoo.com", "domain_classification": "Unknown", "message": "Drone described by Ukraine as ‘a completely new class of weapon’ hits Russia for the first timeThe Palianytsia is a highly manoeuvrable, fast drone fitted with a jet engine and powerful warheadUkraine has used a new class of domestically-produced drone to attack Russia for the first time, Volodymyr Zelensky confirmed on Saturday.\nThe Ukrainian president described the Palianytsia drone-missile as a “completely new class of weapon” that will pound targets inside Russia until Vladimir Putin withdraws his troops from Ukraine.\n“On August 24, the Defence Intelligence of Ukraine (DIU) servicemen successfully struck a field ammunition depot located near Ostrogozk, Voronezh region of Russia,” Ukraine’s military intelligence agency said.\nIt is the seventh such exchange the UAE has mediated since Russia invaded Ukraine in February 2022.\nSpeaking about the weapon on Ukrainian Independence Day, Volodymyr Zelensky said: “This is our new method of retaliation against the aggressor."}, {"id": "08d57534-97ed-4a25-b502-30b8bdb5caf4", "title": "Who are the two NASA astronauts stranded at the International Space Station ? ", "date": "2024-08-25 05:15", "url": "https://www.nbcmiami.com/news/national-international/who-are-the-two-nasa-astronauts-stranded-at-the-international-space-station/3400570/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\nThe six NASA astronauts aboard the International Space Station celebrated the beginning of the Paris Olympics with a weightless recreation of the torch relay and some of their favorite Olympic sports.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "8b953deb-be75-4cee-a56d-b0e317babded", "title": "Cornel West must appear on Michigan ballot , judge says", "date": "2024-08-25 13:30", "url": "https://www.foxnews.com/politics/cornel-west-must-appear-michigan-ballot-judge-says", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "Presidential candidate Cornel West must appear on voting ballots in Michigan, a state judge ruled on Saturday.\nThe Michigan Bureau of Elections had notified West's campaign of the discrepancies in an August 16 letter.\nThe campaign responded by arguing that the Michigan Democratic Party was weaponizing technicalities in an effort to remove West from the ballot.\nDespite the victory, West's campaign is facing similar challenges in states across the country.\nCLICK HERE TO GET THE FOX NEWS APPThe ballot battle comes as Vice President Harris remains in a neck-and-neck battle with former President Trump."}, {"id": "f7ec3a70-183e-4377-80f8-36a7949d3132", "title": "Volodymyr Zelensky vows more  retribution  for Russia , POWs exchanged - World", "date": "2024-08-25 07:15", "url": "https://www.brecorder.com/news/40319181/volodymyr-zelensky-vows-more-retribution-for-russia-pows-exchanged", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "KYIV: Ukrainian President Volodymyr Zelensky vowed more “retribution” against Russia on Saturday as he celebrated Independence Day near where his forces launched a surprise offensive into Russian territory two weeks ago.\n“What the enemy brought to our land has now returned to its home”, he said, adding that Russia will “know what retribution is”.\nWhile it has visibly rattled Moscow, Ukraine’s Kursk operation has not slowed Russia’s advance in eastern Ukraine.\nZelensky has said the Kursk offensive bolstered Ukraine’s “exchange fund” of captured Russian soldiers to trade.\nUkraine has been seeking to distance itself from the Russian church since 2014 and those efforts have accelerated since Russia’s 2022 invasion."}, {"id": "3f1e14b8-83fd-4833-af46-edfd5b9d36de", "title": "", "date": "2024-08-25 13:45", "url": "http://www.israelnationalnews.com/news/395143", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The IDF confirmed on Sunday that Petty Officer 1st Class David Moshe Ben Shitrit, a sailor in the Israeli Navy's 914th Fleet was killed Sunday morning during combat in northern Israel.\nThe IDF added that during the incident two soldiers from the Navy's 914th Fleet were lightly and moderately injured.\nA Navy and IAF inquiry into the incident found that an Iron Dome interceptor missile was launched toward a Hezbollah UAV.\nThe missile hit the aft deck of the Dvora-class patrol craft.\n\"David loved the country and was determined to serve the people of Israel and fight for it."}, {"id": "c6c9cf41-8835-4e27-a3e9-dae04c8aa16f", "title": "NASA astronauts who will spend extra months at the space station are veteran Navy pilots", "date": "2024-08-25 03:30", "url": "https://www.whec.com/national-world/nasa-astronauts-who-will-spend-extra-months-at-the-space-station-are-veteran-navy-pilots/", "domain": "whec.com", "domain_classification": "Unknown", "message": "CAPE CANAVERAL, Fla. (AP) — The two astronauts who will spend extra time at the International Space Station are Navy test pilots who have ridden out long missions before.\nHe joined the Navy, becoming a test pilot and racking up more than 8,000 hours of flying time and 663 aircraft carrier landings.\nWilmore flew to the International Space Station in 2009 as the pilot of shuttle Atlantis, delivering tons of replacement parts.\nBecause of her own diverse background, she jumped at the chance to go to Russia to help behind the scenes with the still new International Space Station.\nShe returned to the space station in 2012, this time serving as its commander."}, {"id": "4e95f41e-50a1-4b82-aa49-bd88bf5d8e35", "title": "Zelensky Vows More  Retribution  for Russia , POWs Exchanged", "date": "2024-08-25 06:45", "url": "https://www.kyivpost.com/post/37921", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Ukrainian President Volodymyr Zelensky vowed more \"retribution\" against Russia on Saturday as he celebrated Independence Day near where his forces launched a surprise offensive into Russian territory two weeks ago.\n\"What the enemy brought to our land has now returned to its home\", he said, adding that Russia will \"know what retribution is\".\nWhile it has visibly rattled Moscow, Ukraine's Kursk operation has not slowed Russia's advance in eastern Ukraine.\nZelensky has said the Kursk offensive bolstered Ukraine's \"exchange fund\" of captured Russian soldiers to trade.\nMoscow released images of young-looking men on a bus, saying it freed 115 servicemen \"taken prisoner in the Kursk region\"."}, {"id": "98a6f062-620b-405c-b8e3-31f0837cc393", "title": "The Pentagon wants to use special operators in new ways to train Taiwan and others for a different kind of fight", "date": "2024-08-25 14:00", "url": "https://www.yahoo.com/news/pentagon-wants-special-operators-ways-122501205.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The Pentagon wants to use special operators in new ways to train Taiwan and others for a different kind of fightThe Pentagon wants to use special operators in new ways to train Taiwan and others for a different kind of fightThe Pentagon wants more leeway from Congress to support US-aligned nations like Taiwan.\nToday, special operators are limited in the kind of training and equipment that they can provide to partner forces.\nNew Authorities for Special OperatorsIn America's last war, special operations forces were the go-to option for military commanders and policymakers.\nThe fighting against insurgents and terrorists in the conflicts in Afghanistan, Iraq, and Syria was ideal for special operations forces.\nThe Chinese military will use everything at its disposal, including special operations forces and intelligence operatives."}, {"id": "59332997-b178-401f-bf97-5a10b16283e5", "title": "DOJ sues RealPage , alleging software contributed to meteoric rents", "date": "2024-08-25 02:30", "url": "https://www.kxxv.com/us-news/housing/doj-sues-realpage-alleging-software-contributed-to-meteoric-rents", "domain": "kxxv.com", "domain_classification": "Unknown", "message": "The lawsuit is being filed alongside attorneys general from eight states, including California and North Carolina.\nThe DOJ believes that this algorithm helped get landlords on the same page, undercutting competition that would usually help keep prices lower.\n\"Competing landlords agree to submit to RealPage on a daily basis their most sensitive nonpublic information, including rental rates, lease terms and projected vacancies.\nAs both sides move to the next phase, Jaafar says RealPage has a battle ahead.\nWhat RealPage is going to have to do is just fight this and fight this in the public spectrum,\" said Jaafar."}, {"id": "8dd4dd9c-17b7-4f31-bbd0-9aa0fddfd255", "title": "India , Indonesia call for strengthening intl . cooperation to combat terrorism", "date": "2024-08-25 13:45", "url": "https://www.thestatesman.com/world/india-indonesia-call-for-strengthening-intl-cooperation-to-combat-terrorism-1503335581.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "India and Indonesia, two large countries in the Indo-Pacific, have strongly condemned terrorism in all its forms and manifestations and emphasised the need for strengthening international cooperation to combat the menace in a comprehensive and sustained manner.\nThey also condemned the use of terrorist proxies for cross-border terrorism.\nAdvertisementThe two sides exchanged views on the domestic, regional and global terrorism threat assessment.\nThey exchanged views on cooperation in regional, global and multilateral fora such as the UN, ASEAN Regional Forum (ARF) and Association of Southeast Asian Nations(ASEAN) to combat global terrorism.\n”The ongoing cooperation in counter-terrorism is an important element of the India-Indonesia partnership,” the Ministry of External Affairs said."}]