[{"id": "be6037fb-d188-45f6-9403-98c13207b7d2", "title": "British coalition conducts airstrike on Yemen port city : Houthi TV | Central India Premier English Daily", "date": "2024-08-16 04:45", "url": "https://www.centralchronicle.com/british-coalition-conducts-airstrike-on-yemens-port-city-houthi-tv/", "domain": "centralchronicle.com", "domain_classification": "Unknown", "message": "Sanaa, Aug 16 (UNI) The U.S.-British coalition conducted an airstrike on Yemen’s Red Sea port city of Hodeidah on Thursday evening, according to Houthi-run al-Masirah TV.\nThe strike reportedly targeted the northwestern al-Salif district, but details on casualties were not immediately available.\nResidents on social media reported a significant explosion near a Houthi-controlled site.\nThe Houthis control much of northern Yemen, including parts of the Red Sea coast.\nSince November, the Houthis have targeted Israeli-linked ships, citing “solidarity with Palestinians in Gaza.” In response, the U.S.-British naval coalition has carried out regular air raids and missile strikes against Houthi positions since January, with limited success."}, {"id": "9e4887fc-3cfe-45cb-adea-ea5df7043734", "title": "Britain  must let Ukraine use its Storm Shadow missiles to hit targets inside Russia  after Challenger - 2 tanks were used to great effect in surprise cross - border incursion", "date": "2024-08-16 09:30", "url": "https://www.dailymail.co.uk/news/article-13749653/Britain-let-Ukraine-use-Storm-Shadow-missiles-hit-targets-inside-Russia-Challenger-2-tanks-used-great-effect-surprise-cross-border-incursion.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Ukrainian officers fighting in the Kursk offensive have implored Britain to green-light the use of Storm Shadow missiles to strike targets deep into Russia.\nBritish-made weaponry has reportedly been used to great effect by Kyiv's troops in their foray into Russia already.\nSeveral Challenger-2 tanks are believed to have forged across the border as part of the invasion force - though Russian military bloggers gloated yesterday that drones had successfully destroyed one of the British-made vehicles used in the offensive.\nLantushenko's pleas for Storm Shadow missiles came a day after Ukrainian President Volodymyr Zelensky claimed drones are simply not enough to destroy key Russian military infrastructure and hammer home his advantage in Kursk.\nStorm Shadow missiles are seen attached to the hard points of a Eurofighter TyphoonStorm Shadow missiles, accurate to beyond 150 miles, have already been used by Ukraine to hit targets in Russian-occupied territory to great effect."}, {"id": "b48b11a1-c5a4-4f66-a4fd-4f5d3fe47120", "title": "Diplomacy takes center stage as Iran holds off retaliation against Israel", "date": "2024-08-16 03:30", "url": "https://www.cbsnews.com/news/diplomacy-takes-center-stage-as-iran-holds-off-retaliation-against-israel/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "U.S. assessments are that Iran will not seek to disrupt ongoing cease-fire negotiations in Doha aimed at ending the Hamas-Israel war.\nThose technical talks could stretch into the weekend, but it is unclear how long Iran and its proxies may hold off.\nA U.S. official confirmed to CBS News that Israel was responsible for Haniyeh's killing, though Israel has not publicly acknowledged it.\nA U.K. official told CBS News, \"Our core focus is diplomatic efforts and de-escalation.\nA French official also told CBS News, \"We've been calling on all actors in the region to de-escalate."}, {"id": "c548388a-25b1-428e-8a3e-56c81f1bc07f", "title": "Iran debating whether to use force against Israel or run covert operation CBS", "date": "2024-08-16 08:00", "url": "https://tass.com/world/1829857", "domain": "tass.com", "domain_classification": "Unknown", "message": "Iran continues to weigh options of retaliating against Israel for the assassination of Hamas Politburo chief Ismail Haniyeh in Tehran, CBS reported, citing multiple sources.\nAccording to them, the Islamic Republic has been debating whether to launch a massive attack on Israel or whether to carry out \"a covert intelligence operation,\" the US television channel said.\nThe Israel Defense Forces then said that it had deflected the strike.\nBritish, US and French troops stationed in the Middle East helped Israel in downing Iranian projectiles.\nBritish and French officials also told CBS that their militaries will be ready \"to defend Israel, and we remain in constant touch with the US and allies on potential scenarios.\""}, {"id": "6fcece36-6a40-4978-987d-d2afe60f5311", "title": "Israel pounds Gaza ahead of ceasefire talks", "date": "2024-08-16 05:00", "url": "https://www.naharnet.com/stories/en/307277-israel-pounds-gaza-ahead-of-ceasefire-talks", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Israeli air strikes targeted Gaza on Wednesday ahead of ceasefire talks that the United States hopes will stop Iran striking Israel in retaliation for the killing of a Hamas leader.\nAhead of Thursday's ceasefire talks, a Hamas official said the Islamist movement was \"continuing its consultations with the mediators\".\nBiden said on Tuesday that a Gaza ceasefire deal could deter Iran from attacking Israel.\nHis envoy for the conflict, Amos Hochstein, was in Beirut on Wednesday where he warned the clock was ticking for a Gaza ceasefire.\nMilitants also seized 251 people, 111 of whom are still held captive in Gaza, including 39 Israel says are dead."}, {"id": "c85f2963-08ec-4110-a1d3-c2170bd3bd96", "title": "Dozens of Israeli settlers attack West Bank village", "date": "2024-08-16 07:45", "url": "https://www.dailymail.co.uk/news/article-13749455/Dozens-Israeli-settlers-attack-West-Bank-village-burn-cars-kill-Palestinian-violence-condemned-mediators-hold-new-round-talks-end-war-Gaza.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Dozens of Israeli settlers surged into a Palestinian village in the West Bank yesterday, burning cars and killing at least one person, Israeli authorities admitted yesterday.\nShocking footage circulated on social media showed houses and cars smouldering after being set alight by Molotov cocktails thrown by the Israeli settlers.\nThe fatal attacks came hours after an Israeli airstrike in the West Bank killed two other young Palestinians.\nMore than 600 Palestinians in the West Bank have been killed since October 7, most of whom died as a result of incursions by Israeli settlers.\nThe White House, whose diplomats are now engaged in a fresh round of ceasefire talks with international mediators, declared Israeli settlers' attacks in the West Bank 'unacceptable' and insisted they 'must stop.'"}, {"id": "51cf8999-ae96-417f-8b14-9e5c5f8240f7", "title": "Washington bias a major cause of rising tensions in the Middle East - united states ", "date": "2024-08-16 01:30", "url": "http://usa.chinadaily.com.cn/a/202408/16/WS66be8be1a3104e74fddba372.html", "domain": "usa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "This photo taken on Oct 11, 2023 shows the US Capitol building in Washington, D.C., the United States.\nBut it's time these Western leaders accepted that their double standard and hypocrisy are the major cause of the escalating hostilities and tensions in the Middle East.\nWhile most of the UN Security Council members condemned Haniyeh's assassination, the representatives of the US and the United Kingdom exposed their bias against Iran by blaming Teheran for the killing.\nOn Tuesday, US Ambassador to the UN Linda Thomas-Greenfield told the Security Council that Washington aims \"to turn the temperature down\" in the Middle East.\nBut she should know that the US' biased policy in the Middle East, its hypocrisy and double standard are a major stumbling block to peace and stability in the region."}, {"id": "96a013df-4083-4542-9b43-1973b4751d67", "title": "Washington bias a major cause of rising tensions in the Middle East", "date": "2024-08-16 01:45", "url": "http://africa.chinadaily.com.cn/a/202408/16/WS66be8be1a3104e74fddba372.html", "domain": "africa.chinadaily.com.cn", "domain_classification": "Unknown", "message": "This photo taken on Oct 11, 2023 shows the US Capitol building in Washington, D.C., the United States.\nBut it's time these Western leaders accepted that their double standard and hypocrisy are the major cause of the escalating hostilities and tensions in the Middle East.\nWhile most of the UN Security Council members condemned Haniyeh's assassination, the representatives of the US and the United Kingdom exposed their bias against Iran by blaming Teheran for the killing.\nOn Tuesday, US Ambassador to the UN Linda Thomas-Greenfield told the Security Council that Washington aims \"to turn the temperature down\" in the Middle East.\nBut she should know that the US' biased policy in the Middle East, its hypocrisy and double standard are a major stumbling block to peace and stability in the region."}, {"id": "5101a1f1-7e10-4325-ba64-3d5b8d6d7f49", "title": "Casualty Toll Of Russian Attack On Enterprise In Kharkiv Region Rises", "date": "2024-08-16 01:30", "url": "https://menafn.com/1108560797/Casualty-Toll-Of-Russian-Attack-On-Enterprise-In-Kharkiv-Region-Rises", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The number those as a result of a Russian on a civil enterprise in the village of Prylokotne of the Kupiansk district in Kharkiv region has increased to six.\nThat's according to the press service of the Kharkiv Regional Prosecutor's Office , Ukrinform reports.\n\"The number of injured has increased to six.\nA 47-year-old man - also an employee of the enterprise that was hit by the enemy airstrike - sought medical assistance,\" the update reads.\nRussian strike kills two in, Donetsk regionAs Ukrinform reported earlier, on August 15, at around 15:20, the Russian invasion forces launched airstrikes on the village of Prykolotne in the Kupiansk district, hitting a civil enterprise."}, {"id": "99193cf2-d4eb-4934-89cf-3bb06a40d7a7", "title": "Iran Update , August 15 , 2024 | Institute for the Study of War", "date": "2024-08-16 06:30", "url": "https://www.understandingwar.org/backgrounder/iran-update-august-15-2024", "domain": "understandingwar.org", "domain_classification": "Unknown", "message": "Iran Update, August 15, 2024Johanna Moore, Kelly Campa, Kathryn Tyson, Carolyn Moorman, Annika Ganzeveld, Robert Moore, and Nicholas CarlInformation Cutoff: 2:00pm ETThe Iran Update provides insights into Iranian and Iranian-sponsored activities abroad that undermine regional stability and threaten US forces and interests.\nIran is likely trying to build operational surprise ahead of its expected attack on Israel.\nIran has taken similar approaches in previous attacks, such as the large-scale Iranian drone and missile attack on Israel in April 2024 and the Iranian missile attack on US forces in Iraq in January 2020.\nThe US, Egyptian, Israeli, and Qatari officials met in Doha for the latest round of ceasefire-hostage negotiations on August 15.\n[28]Key Takeaways:Iran: Iran is likely trying to build operational surprise ahead of its expected attack on Israel."}, {"id": "9b926627-f35a-470d-ba72-bb89bca60edf", "title": "", "date": "2024-08-16 03:45", "url": "https://www.israelnationalnews.com/news/394709", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "White House National Security Council spokesman John Kirby told CNN on Thursday that US intelligence indicates that Iran has not backed down from its threat to attack Israel.\nThere have been conflicting reports as to whether Tehran will attack Israel in retaliation for the elimination of Hamas political leader Ismail Haniyeh on July 31.\nOn Tuesday, three senior Iranian officials told Reuters that Iran could delay or cancel its planned attack against Israel if this week's ceasefire talks between Israel and Hamas are successful.\nLater in the day, US President Joe Biden said that he expects Iran to back down from its threats to attack Israel if a ceasefire deal with Hamas is reached this week.\n“That’s my expectation,” Biden told reporters when asked if he believes Iran will not strike if a deal is signed."}, {"id": "6bd35b4f-d7d6-48f1-8264-b80f2fa2d9aa", "title": "Ukraine surprise advance into Russia a dilemma for Biden", "date": "2024-08-16 00:30", "url": "https://www.bbc.co.uk/news/articles/cql365ld002o", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "The same goes for White House policy on Ukrainian attacks into Russian territory.\nFor many months President Zelensky pleaded for permission to strike at military targets in Russia that facilitated attacks into Ukraine.\n\"We're not authorising strikes 200 miles into Russia and we're not authorising strikes on Moscow, on the Kremlin.\"\nSince then, Mr Zelensky, along with some European allies and some Democrats in Washington, have urged the US to further “untie” Ukraine’s hands.\nThe words he used in June suggested that Ukraine’s limits were “in proximity to the border”."}, {"id": "3d4f73c1-b6b5-478b-a2e5-1e57dfea4afb", "title": "A closer look at Hezbollah tunnel threat", "date": "2024-08-16 01:30", "url": "https://www.10news.com/world/middle-east/a-closer-look-at-hezbollahs-tunnel-threat", "domain": "10news.com", "domain_classification": "Unknown", "message": "Some Israeli analysts say Hezbollah's tunnel network is even more extensive than the one built by Hamas.\nThis could prove significant because it could help Hezbollah maintain resupply routes from Iraq and Syria in the event of an all-out war.\nThe tunnel network would make it very difficult to preemptively attack Hezbollah's stock of rockets and missiles, which is far larger than that of Hamas.\nIt has spent much of the last two decades preparing for a potential war, with assistance from Iran, Syria and Russia.\n\"We're not counting on anything when it comes to Iran and the possibility of some sort of an attack,\" Kirby said."}, {"id": "a56a38f4-fed6-4dd5-aa7d-7d281f066eb5", "title": "Fed - Up With Games , Hamas Reportedly Sits Out Talks", "date": "2024-08-16 03:15", "url": "https://sputnikglobe.com/20240816/actions-speak-louder-than-words-fed-up-with-games-hamas-reportedly-sits-out-talks-1119784915.html", "domain": "sputnikglobe.com", "domain_classification": "Unknown", "message": "https://sputnikglobe.com/20240816/actions-speak-louder-than-words-fed-up-with-games-hamas-reportedly-sits-out-talks-1119784915.html'Actions Speak Louder Than Words': Fed-Up With Games, Hamas Reportedly Sits Out Talks'Actions Speak Louder Than Words': Fed-Up With Games, Hamas Reportedly Sits Out TalksSputnik InternationalDan Kovalik, a human rights activist and author joined Political Misfits on Thursday to discuss the ongoing tensions in the Middle East.\n2024-08-16T01:00+00002024-08-16T01:00+00002024-08-16T01:01+0000analysismiddle eastbenjamin netanyahujoe bidenisraelhamasirangenocidewar crimesethnic cleansinghttps://cdn1.img.sputnikglobe.com/img/07e8/08/10/1119786720_0:170:3072:1898_1920x0_80_0_0_27452c654fabdad4d9ba27d0aacfa8a0.jpgCeasefire talks in the Middle East have resumed with the US, Israel, Egypt and Qatar reportedly making an appearance without representation being made from Hamas.\nSo, obviously, the people of Gaza need a ceasefire,” Kovalik explained.\nAccording to one report, the practice became so common amongst Israeli soldiers that it could be considered a “protocol”.\nUS President Joe Biden acknowledged the influence that the ceasefire deal will have on Iran’s threats and admitted that the process to a ceasefire deal is “getting harder” but said he is “not giving up”.“Again, Iran acts in very constrained ways."}, {"id": "9edcec0a-bfc6-4659-a3a1-f12e52af91ec", "title": "Russian attack on Sumy Oblast kills 1 , injures 3", "date": "2024-08-16 01:15", "url": "https://www.yahoo.com/news/russian-attack-sumy-oblast-kills-235000089.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russian forces attacked 11 communities in Sumy Oblast on Aug. 15, killing one and injuring three people, the Sumy Oblast Military Administration reported.\nThe security situation in Sumy Oblast became more tense with the start of Ukraine's cross-border incursion into neighboring Kursk Oblast in Russia, which began on Aug. 6.\nSumy Oblast borders Russia's Bryansk, Kursk, and Belgorod oblasts.\nCivilians in Sumy Oblast within 20 kilometers (12 miles) of the border with Kursk Oblast are now subject to restrictions on movement due to increasing Russian attacks, according to the General Staff of Ukraine's Armed Forces.\nRead also: Russia partially deploying its forces to Kursk Oblast, exact number is unknown, White House saysWe’ve been working hard to bring you independent, locally-sourced news from Ukraine."}, {"id": "ce323442-1ca8-49e2-ba29-181643f6d4c1", "title": "Ex - Israeli min . mocks Netanyahu , urges him to  be brave  ", "date": "2024-08-16 00:30", "url": "https://www.dailysabah.com/world/mid-east/ex-israeli-min-mocks-netanyahu-urges-him-to-be-brave", "domain": "dailysabah.com", "domain_classification": "Unknown", "message": "A new round of Gaza cease-fire and prisoner swap talks began Thursday in the Qatari capital Doha to reach an agreement between Israel and Hamas.\nHamas said on Wednesday that it will participate in the upcoming Gaza cease-fire and hostage swap talks if Israel provides a clear commitment to implement U.S. President Joe Biden's proposal.\nBut mediation efforts have been stalled due to Netanyahu’s refusal to meet Hamas’ demands to stop the war.\nFlouting a U.N. Security Council resolution demanding an immediate cease-fire, Israel has faced international condemnation amid its continued brutal offensive on Gaza since an Oct. 7, 2023 attack by Hamas.\nOver 10 months into the Israeli onslaught, vast tracts of Gaza lie in ruins amid a crippling blockade of food, clean water and medicine."}, {"id": "7581decb-a1b8-4312-8f0c-dbf606681797", "title": "Russia blames US for Nord Stream attack , vows retaliation", "date": "2024-08-16 07:00", "url": "https://www.jpost.com/breaking-news/article-815003", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Russia's ambassador to Washington said on Friday that Ukraine would not have attacked the Nord Stream gas pipelines without the tacit approval of the United States, and that Russia would identify and punish those behind the attack.\nThe Wall Street Journal reported on Thursday that Ukraine's top military commander approved the 2022 attack on the gas pipelines despite a warning from the US Central Intelligence Agency to Ukrainian President Volodymyr Zelenskiy not to carry out the bombing.\n\"They seek to shift all responsibility to their Ukrainian puppets,\" Russian Ambassador Anatoly Antonov said in a statement on Nord Stream.\n\"We will seek to identify the real perpetrators of the bombing and punish them.\""}, {"id": "dcee2383-422d-481e-b783-cc92b0495eda", "title": "Mediators hold new Gaza cease - fire talks and hope to head off a wider war - Boston News , Weather , Sports", "date": "2024-08-16 04:30", "url": "https://whdh.com/news/mediators-hold-new-gaza-cease-fire-talks-and-hope-to-head-off-a-wider-war/", "domain": "whdh.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to run into Friday.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza."}, {"id": "77a699d0-d85a-43d3-98f2-d74078793cc2", "title": "Mediators hold new Gaza cease - fire talks", "date": "2024-08-16 03:30", "url": "https://www.sunstar.com.ph/network/mediators-hold-new-gaza-cease-fire-talks-and-hope-to-head-off-a-wider-war", "domain": "sunstar.com.ph", "domain_classification": "Unknown", "message": "A cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely.\nMore recently, Hamas has objected to what it says are new Israeli demands to maintain a presence along the Gaza-Egypt border and a road dividing northern and southern Gaza.\nIsraeli and Palestinian media said that masked settlers stormed the village of Jit in the northern West Bank, setting homes and cars on fire."}, {"id": "ad52a0bd-2b26-4fd4-8004-1d0d2cb872ce", "title": "Secret Service OKs plan for Trump to continue outdoor rallies", "date": "2024-08-16 01:00", "url": "https://thesun.my/world/secret-service-oks-plan-for-trump-to-continue-outdoor-rallies-CN12867713", "domain": "thesun.my", "domain_classification": "Unknown", "message": "WASHINGTON: The U.S. Secret Service has approved a new plan for Republican presidential candidate Donald Trump to continue outdoor rallies in the wake of a July assassination attempt, the Washington Post reported on Thursday.\nThe Secret Service did not immediately respond to a request for comment on the Washington Post report.\nFBI officials have yet to identify a motive for the suspected shooter, 20-year-old Thomas Crooks, who was shot dead by a Secret Service agent after opening fire.\nFollowing the attack, the Secret Service recommended that Trump avoid large outdoor events.\nTrump subsequently said he would continue outdoor rallies and that the Secret Service had “agreed to substantially step up their operation” to protect him."}, {"id": "ea58c869-c9fe-4653-8efe-990dbb3a9960", "title": "Diplomacy intensifies to halt the Israel - Hamas war and prevent wider regional conflict", "date": "2024-08-16 09:30", "url": "https://www.durangoherald.com/articles/diplomacy-intensifies-to-halt-the-israel-hamas-war-and-prevent-wider-regional-conflict/", "domain": "durangoherald.com", "domain_classification": "Unknown", "message": "Any Iranian attack would have devastating consequences for the region.”Lammy and French Foreign Minister Stéphane Séjourné were expected hold a joint meeting with Israeli Foreign Minister Israel Katz and Strategic Affairs Minister Ron Dermer.\nThe United States, Qatar and Egypt began a new round of talks Thursday, meeting with an Israeli delegation in Qatar.\nIsrael’s devastating retaliatory offensive has killed 40,005 Palestinians, Gaza’s Health Ministry said Thursday, without saying how many were militants.\nIsrael’s military spokesperson, Rear Adm. Daniel Hagari, said Thursday that Israel had killed more than 17,000 Hamas militants in Gaza in the war, without providing evidence.\nIn the West Bank, 633 Palestinians have been killed by Israeli fire — most by Israeli raids into Palestinian cities and towns."}, {"id": "25c08a9c-1039-4610-a0bf-2561efd2478e", "title": "Judge finds Callum Cameron guilty for murder of mother Carol Cameron", "date": "2024-08-16 04:00", "url": "https://www.smh.com.au/national/western-australia/carol-was-stabbed-62-times-on-friday-her-son-was-found-guilty-20240816-p5k2zr.html", "domain": "smh.com.au", "domain_classification": "Local - Oceania", "message": "Callum Cameron woke his mother up on the night of August 10, 2020, to tell her he was overdosing on drugs and needed help.\nCarol Cameron, 63, was a former nurse.\nCallum Cameron stabbed his mum 63 times in a drug-induced psychosis.\nCredit: FacebookAfter they arrived, he stabbed her 62 times in an attack so violent and disturbing a jury was spared the details in a judge-only trial.\nBut on Friday a Supreme Court judge found the 31-year-old guilty of her murder despite his claims he could not remember it."}, {"id": "2cd2e33e-e23c-49e2-aad4-426ff0b142a0", "title": "Judge finds Callum Cameron guilty for murder of mother Carol Cameron", "date": "2024-08-16 04:00", "url": "https://www.theage.com.au/national/western-australia/carol-was-stabbed-62-times-on-friday-her-son-was-found-guilty-20240816-p5k2zr.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "Callum Cameron woke his mother up on the night of August 10, 2020, to tell her he was overdosing on drugs and needed help.\nCarol Cameron, 63, was a former nurse.\nCallum Cameron stabbed his mum 63 times in a drug-induced psychosis.\nCredit: FacebookAfter they arrived, he stabbed her 62 times in an attack so violent and disturbing a jury was spared the details in a judge-only trial.\nBut on Friday a Supreme Court judge found the 31-year-old guilty of her murder despite his claims he could not remember it."}, {"id": "577542ff-e072-493d-af6d-4d6bc96d8fea", "title": "Diplomacy intensifies to halt the Israel - Hamas war and prevent wider regional conflict", "date": "2024-08-16 07:00", "url": "https://www.bostonglobe.com/2024/08/16/world/diplomacy-intensifies-halt-israel-hamas-war-prevent-wider-regional-conflict/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "JERUSALEM (AP) — International diplomacy to prevent the war in Gaza from spreading into a wider regional conflict intensified Friday, with the British and French foreign ministers making a joint trip to Israel while internationally mediated cease-fire talks in Qatar were expected to enter their second day.\nAdvertisementLammy and French Foreign Minister Stéphane Séjourné were expected hold a joint meeting with Israeli Foreign Minister Israel Katz and Strategic Affairs Minister Ron Dermer.\nThe United States, Qatar and Egypt began a new round of talks Thursday, meeting with an Israeli delegation in Qatar.\nIsrael’s military spokesperson, Rear Adm. Daniel Hagari, said Thursday that Israel had killed more than 17,000 Hamas militants in Gaza in the war, without providing evidence.\nIn the West Bank, 633 Palestinians have been killed by Israeli fire — most by Israeli raids into Palestinian cities and towns."}, {"id": "66936eff-63b5-4bc7-a32e-903504b25de7", "title": "Judge finds Callum Cameron guilty for murder of mother Carol Cameron", "date": "2024-08-16 04:45", "url": "https://www.watoday.com.au/national/western-australia/carol-was-stabbed-62-times-on-friday-her-son-was-found-guilty-20240816-p5k2zr.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "Callum Cameron woke his mother up on the night of August 10, 2020, to tell her he was overdosing on drugs and needed help.\nCarol Cameron, 63, was a former nurse.\nCallum Cameron stabbed his mum 63 times in a drug-induced psychosis.\nCredit: FacebookAfter they arrived, he stabbed her 62 times in an attack so violent and disturbing a jury was spared the details in a judge-only trial.\nBut on Friday a Supreme Court judge found the 31-year-old guilty of her murder despite his claims he could not remember it."}, {"id": "2e11ccb0-9618-4acc-b358-01e53887227f", "title": "Judge finds Callum Cameron guilty for murder of mother Carol Cameron", "date": "2024-08-16 04:00", "url": "https://www.brisbanetimes.com.au/national/western-australia/carol-was-stabbed-62-times-on-friday-her-son-was-found-guilty-20240816-p5k2zr.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Callum Cameron woke his mother up on the night of August 10, 2020, to tell her he was overdosing on drugs and needed help.\nCarol Cameron, 63, was a former nurse.\nCallum Cameron stabbed his mum 63 times in a drug-induced psychosis.\nCredit: FacebookAfter they arrived, he stabbed her 62 times in an attack so violent and disturbing a jury was spared the details in a judge-only trial.\nBut on Friday a Supreme Court judge found the 31-year-old guilty of her murder despite his claims he could not remember it."}, {"id": "92102431-9c2b-4379-b219-ec089586eb3c", "title": "He Was Looking For HIMARS Near Pokrovsk : SSU Detains Taxi Driver Who Spied For Russians", "date": "2024-08-16 00:45", "url": "https://menafn.com/1108560792/He-Was-Looking-For-HIMARS-Near-Pokrovsk-SSU-Detains-Taxi-Driver-Who-Spied-For-Russians", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) The Security Service of Ukraine (SSU) has detained a Russian informant who, under the guise of a taxi driver, was collecting intelligence for the invaders in Donetsk region, in particular, tracking the basing points of HIMARS missile systems in the Pokrovsk direction.\nAccording to Ukrinform, this was reported by the SSU .\nThe Russians needed the intelligence to prepare new offensive operations and missile strikes in this area of the frontline.\nTo collect the information needed by the invaders, the man travelled around the area under the guise of a taxi driver, asking his passengers for information in the dark.\nHe was an active user of a Russian telegram bot that collects information about the deployment of the Ukrainian Armed Forces on the eastern front."}, {"id": "4fd963bc-4181-4721-8a71-89cf229206f6", "title": "Israel - Hamas war latest : Day 2 of cease - fire talks in Qatar as mediators try to prevent regional war – Winnipeg Free Press", "date": "2024-08-16 09:15", "url": "https://www.winnipegfreepress.com/world/2024/08/16/israel-hamas-war-latest-day-2-of-cease-fire-talks-in-qatar-as-mediators-try-to-prevent-regional-war", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Internationally mediated cease-fire talks in Qatar are expected to enter their second day Friday in an effort to prevent the war in Gaza from spreading into a wider regional conflict.\nThough Hamas is not directly participating, representatives from Qatar and Egypt are engaged on their behalf.\nMeanwhile, Israel’s foreign minister is set to meet with his counterparts from the United Kingdom and France on Friday to discuss preventing regional escalation.\nThe new push for an end to the Israel-Hamas war comes as the Palestinian death toll in Gaza climbed past 40,000, according to Gaza health authorities.\nCease-fire talks set to enter Day 2 in DohaDOHA, Qatar — Qatar’s Foreign Ministry spokesperson Majed al Ansari said the cease-fire talks are still ongoing and will resume Friday."}, {"id": "ee2a4e5e-bf6d-4b7b-ab7e-a8b579b8aa4a", "title": "Diplomacy to prevent the Israel - Hamas war from spreading intensifies", "date": "2024-08-16 09:30", "url": "https://apnews.com/article/israel-palestinians-hamas-war-news-08-16-2024-cf0bb95a8a36cfabf1c6db8edf97c862", "domain": "apnews.com", "domain_classification": "International", "message": "Any Iranian attack would have devastating consequences for the region.”Lammy and French Foreign Minister Stéphane Séjourné were expected hold a joint meeting with Israeli Foreign Minister Israel Katz and Strategic Affairs Minister Ron Dermer.\nThe United States, Qatar and Egypt began a new round of talks Thursday, meeting with an Israeli delegation in Qatar.\nIsrael’s devastating retaliatory offensive has killed 40,005 Palestinians, Gaza’s Health Ministry said Thursday, without saying how many were militants.\nIsrael’s military spokesperson, Rear Adm. Daniel Hagari, said Thursday that Israel had killed more than 17,000 Hamas militants in Gaza in the war, without providing evidence.\nIn the West Bank, 633 Palestinians have been killed by Israeli fire — most by Israeli raids into Palestinian cities and towns."}, {"id": "ed09874c-d466-4c04-9839-47980f14f391", "title": "Diplomacy intensifies to halt the Israel - Hamas war – NBC4 Washington", "date": "2024-08-16 09:30", "url": "https://www.nbcwashington.com/news/national-international/diplomacy-intensifies-to-halt-israel-hamas-war-and-prevent-wider-conflict/3695647/", "domain": "nbcwashington.com", "domain_classification": "Unknown", "message": "Any Iranian attack would have devastating consequences for the region.”Lammy and French Foreign Minister Stéphane Séjourné were expected hold a joint meeting with Israeli Foreign Minister Israel Katz and Strategic Affairs Minister Ron Dermer.\nThe United States, Qatar and Egypt began a new round of talks Thursday, meeting with an Israeli delegation in Qatar.\nThe Israeli military says an airstrike hit a school and mosque in Gaza, where approximately 4,200 displaced people were reportedly seeking shelter.\nThe IDF says the school was the site of a Hamas command center, a claim which Hamas leadership has denied.\nIn the West Bank, 633 Palestinians have been killed by Israeli fire — most by Israeli raids into Palestinian cities and towns."}, {"id": "a29f1aa4-0f8a-4c4e-baa8-ca555195e9e8", "title": "Diplomacy intensifies to halt the Israel - Hamas war and prevent wider regional conflict", "date": "2024-08-16 07:30", "url": "https://www.clickorlando.com/news/world/2024/08/16/diplomacy-intensifies-to-halt-the-israel-hamas-war-and-prevent-wider-regional-conflict/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "Any Iranian attack would have devastating consequences for the region.”Lammy and French Foreign Minister Stéphane Séjourné were expected hold a joint meeting with Israeli Foreign Minister Israel Katz and Strategic Affairs Minister Ron Dermer.\nThe United States, Qatar and Egypt began a new round of talks Thursday, meeting with an Israeli delegation in Qatar.\nIsrael’s devastating retaliatory offensive has killed 40,005 Palestinians, Gaza’s Health Ministry said Thursday, without saying how many were militants.\nIsrael’s military spokesperson, Rear Adm. Daniel Hagari, said Thursday that Israel had killed more than 17,000 Hamas militants in Gaza in the war, without providing evidence.\nIn the West Bank, 633 Palestinians have been killed by Israeli fire — most by Israeli raids into Palestinian cities and towns."}, {"id": "d4b85238-01c1-41ea-9a56-6b60be10738f", "title": "NATO main battle tanks are operating inside Russia in Kursk offensive", "date": "2024-08-16 06:30", "url": "https://www.wsws.org/en/articles/2024/08/16/gyio-a16.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "Sky News reported Thursday that British Challenger 2 main battle tanks have been deployed inside Russia as part of the NATO-Ukrainian offensive against Russia’s Kursk region.\nChallenger 2 main battle tanks flying the Ukrainian flagThe United States, Britain and Germany have given Ukraine hundreds of Abrams, Challenger 2 and Leopard 2 main battle tanks.\nBut the report by Sky News is the first confirmation that these vehicles have been used inside the Russian border by Ukrainian troops.\nIn recent days, Ukrainian troops carried out attacks on the region of Belgarod, where evacuations have also taken place.\nNow, the claims by NATO to be waging a “defensive” war are falling by the wayside, and NATO weapons are being used directly to wage an offensive war inside of Russia."}, {"id": "601b73fc-615c-48d2-b7ef-ab246d3ecf75", "title": "Mediators hold cease - fire talks , hope to prevent wider war", "date": "2024-08-16 01:15", "url": "https://www.stltoday.com/news/nation-world/mideast-gaza-israel-cease-fire-talks/article_8586cbe3-c81f-5e6e-a0d4-c7ea3f6e5e60.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they’re expected to extend into Friday.\nHe said a lot of work remains given the complexity of the agreement and that negotiators were focusing on its implementation.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely."}, {"id": "59f599fd-ab30-4564-838a-1e46723bf196", "title": "Diplomacy intensifies to halt the Israel - Hamas war and prevent wider regional conflict", "date": "2024-08-16 09:30", "url": "https://www.whec.com/national-world/diplomacy-intensifies-to-halt-the-israel-hamas-war-and-prevent-wider-regional-conflict/", "domain": "whec.com", "domain_classification": "Unknown", "message": "Any Iranian attack would have devastating consequences for the region.”Lammy and French Foreign Minister Stéphane Séjourné were expected hold a joint meeting with Israeli Foreign Minister Israel Katz and Strategic Affairs Minister Ron Dermer.\nThe United States, Qatar and Egypt began a new round of talks Thursday, meeting with an Israeli delegation in Qatar.\nIsrael’s devastating retaliatory offensive has killed 40,005 Palestinians, Gaza’s Health Ministry said Thursday, without saying how many were militants.\nIsrael’s military spokesperson, Rear Adm. Daniel Hagari, said Thursday that Israel had killed more than 17,000 Hamas militants in Gaza in the war, without providing evidence.\nIn the West Bank, 633 Palestinians have been killed by Israeli fire — most by Israeli raids into Palestinian cities and towns."}, {"id": "6dacb24b-ed79-4cf3-b150-cd370dcaf66a", "title": "Mediators hold cease - fire talks , hope to prevent wider war", "date": "2024-08-16 01:30", "url": "https://omaha.com/news/nation-world/mideast-gaza-israel-cease-fire-talks/article_447c4624-f0bb-5f2d-b0b5-1df9e7c626de.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "White House National Security spokesperson John Kirby called the talks an important step and said they're expected to extend into Friday.\nHe said a lot of work remains given the complexity of the agreement and that negotiators were focusing on its implementation.\nA cease-fire in Gaza would likely calm tensions across the region.\nHamas is concerned that Israel will resume the war after the first batch of hostages is released.\nIsrael worries that Hamas will drag out the talks on releasing the remaining hostages indefinitely."}, {"id": "52bd8496-edd9-4f97-92f2-88588ad418e8", "title": "Diplomacy intensifies to halt the Israel - Hamas war and prevent wider regional conflict", "date": "2024-08-16 08:30", "url": "https://www.yakimaherald.com/news/nation_and_world/world/diplomacy-intensifies-to-halt-the-israel-hamas-war-and-prevent-wider-regional-conflict/article_cb6890b9-ae27-59a0-b1a1-b38fe2782ee7.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "7feff179-2302-4631-b729-2fd0d236ab2d", "title": "Pressure for deal builds ahead of new Gaza truce talks", "date": "2024-08-16 05:00", "url": "https://www.naharnet.com/stories/en/307280-pressure-for-deal-builds-ahead-of-new-gaza-truce-talks", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Pressure built for a Gaza ceasefire to be agreed at talks set to resume Thursday in Qatar to avert a wider war involving Iran, after months of fighting between Israel and Hamas militants.\nUS news website Axios, citing U.S. officials, reported that former president Donald Trump, who is seeking re-election, spoke with Netanyahu on Wednesday and discussed the Gaza hostage and ceasefire deal.\nAsked whether a ceasefire agreement in Gaza could stave off an Iranian attack on Israel, Biden said: \"That's my expectation.\"\nMilitants also seized 251 people, 111 of whom are still held captive in Gaza, including 39 the Israeli military says are dead.\nHezbollah said two of its fighters were killed, and the Israeli military said its air force had \"struck Hezbollah military structures.\""}, {"id": "c3976ac0-3250-4665-8e45-d71dcb5e9224", "title": "Secret Service approves bulletproof glass to shield Trump at outdoor rallies", "date": "2024-08-16 04:00", "url": "https://www.nbclosangeles.com/news/national-international/secret-service-approves-bulletproof-glass-to-shield-trump-at-outdoor-rallies/3489411/", "domain": "nbclosangeles.com", "domain_classification": "Unknown", "message": "The Secret Service will use ballistic glass to protect former President Donald Trump so that he can resume outdoor campaign events, according to two sources familiar with the planning and one Trump campaign official.\nThe official said the Secret Service is also increasing manpower and technology to mitigate threats around Trump during outdoor rallies, as well as more frequent threat analysis and prevention for all protective details, including counter-snipers and counter-surveillance.\nThe Secret Service faced intense scrutiny and criticism after a gunman fired multiple times at Trump during an outdoor rally on July 13 in Butler, Pa., wounding him and two rallygoers and killing one other.\nFormer Secret Service Director Kimberly Cheatle said after the shooting that she was bolstering the protective details of the candidates for president.\nTrump has not held an outdoor campaign event since the attempted assassination."}, {"id": "f96902d2-b068-464f-a469-580a88b73eb5", "title": "Palestinian death toll in Gaza exceeds 40 , 000 as peace talks renew", "date": "2024-08-16 06:45", "url": "http://www.china.org.cn/world/2024-08/16/content_117370652.htm", "domain": "china.org.cn", "domain_classification": "Unknown", "message": "视频播放位置 下载安装Flash播放器People mourn victims killed in an Israeli airstrike in Gaza City, on Aug. 12, 2024.\n[Photo/Xinhua]The Palestinian death toll from the ongoing Israeli attacks on the Gaza Strip has surpassed 40,000 as of Thursday, at a time when the Gaza ceasefire talks were set to resume in Qatar.\nIt took only five and a half months for the Palestinian death toll in the Gaza Strip to rise from 30,000 to 40,000.\nAccording to Gaza health authorities, an Israeli bombing of a field hospital in Deir al-Balah, central Gaza Strip, on July 27 resulted in at least 30 Palestinians killed and over 100 injured.\nThe Israel Defense Forces (IDF) said in a statement on Thursday that it is continuing operational activity in the Gaza Strip, \"eliminating terrorists and dismantling terrorist infrastructure.\""}, {"id": "855e0985-e8af-4ebe-9e77-9af1d76e25a7", "title": "Secret Service approves bulletproof glass to shield Trump at outdoor rallies", "date": "2024-08-16 02:00", "url": "https://www.nbcconnecticut.com/news/national-international/secret-service-approves-bulletproof-glass-to-shield-trump-at-outdoor-rallies/3364405/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "The Secret Service will use ballistic glass to protect former President Donald Trump so that he can resume outdoor campaign events, according to two sources familiar with the planning and one Trump campaign official.\nThe official said the Secret Service is also increasing manpower and technology to mitigate threats around Trump during outdoor rallies, as well as more frequent threat analysis and prevention for all protective details, including counter-snipers and counter-surveillance.\nThe Secret Service faced intense scrutiny and criticism after a gunman fired multiple times at Trump during an outdoor rally on July 13 in Butler, Pa., wounding him and two rallygoers and killing one other.\nFormer Secret Service Director Kimberly Cheatle said after the shooting that she was bolstering the protective details of the candidates for president.\nTrump has not held an outdoor campaign event since the attempted assassination."}, {"id": "1612b67c-4965-44d4-893a-932d0c7c61ea", "title": "Secret Service approves bulletproof glass to shield Trump at outdoor rallies", "date": "2024-08-16 04:00", "url": "https://www.nbcphiladelphia.com/news/national-international/secret-service-approves-bulletproof-glass-to-shield-trump-at-outdoor-rallies/3945228/", "domain": "nbcphiladelphia.com", "domain_classification": "Unknown", "message": "The Secret Service will use ballistic glass to protect former President Donald Trump so that he can resume outdoor campaign events, according to two sources familiar with the planning and one Trump campaign official.\nThe official said the Secret Service is also increasing manpower and technology to mitigate threats around Trump during outdoor rallies, as well as more frequent threat analysis and prevention for all protective details, including counter-snipers and counter-surveillance.\nThe Secret Service faced intense scrutiny and criticism after a gunman fired multiple times at Trump during an outdoor rally on July 13 in Butler, Pa., wounding him and two rallygoers and killing one other.\nFormer Secret Service Director Kimberly Cheatle said after the shooting that she was bolstering the protective details of the candidates for president.\nTrump has not held an outdoor campaign event since the attempted assassination."}, {"id": "227c0d3e-8325-4a12-9915-4e87c9e1f6b3", "title": "Report points at Kyiv role in Nord Stream blasts ; Ukraine denies", "date": "2024-08-16 01:15", "url": "https://timesofindia.indiatimes.com/world/europe/report-points-at-kyiv-role-in-nord-stream-blasts-ukraine-denies/articleshow/112554076.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "Ukrainian presidential adviser Mykhailo Podolyak Thursday denied his country's involvement in explosions which damaged the Nord Stream 2 gas pipeline .\nThe pipelines, transporting gas under the Baltic Sea, were ruptured by explosions in Sept 2022.\nHowever, Ukraine blamed Russia.\n\"Such an act can only be carried out with extensive technical and financial resources ... and who possessed all this at the time of the bombing?\nOnly Russia,\" Podolyak said."}, {"id": "cdbd8403-9c99-4e00-a9c9-5b90bd960696", "title": "Secret Service approves bulletproof glass to shield Trump at outdoor rallies", "date": "2024-08-16 03:00", "url": "https://www.nbcmiami.com/news/national-international/secret-service-approves-bulletproof-glass-to-shield-trump-at-outdoor-rallies/3393631/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "The Secret Service will use ballistic glass to protect former President Donald Trump so that he can resume outdoor campaign events, according to two sources familiar with the planning and one Trump campaign official.\nThe official said the Secret Service is also increasing manpower and technology to mitigate threats around Trump during outdoor rallies, as well as more frequent threat analysis and prevention for all protective details, including counter-snipers and counter-surveillance.\nThe Secret Service faced intense scrutiny and criticism after a gunman fired multiple times at Trump during an outdoor rally on July 13 in Butler, Pa., wounding him and two rallygoers and killing one other.\nFormer Secret Service Director Kimberly Cheatle said after the shooting that she was bolstering the protective details of the candidates for president.\nTrump has not held an outdoor campaign event since the attempted assassination."}, {"id": "a69da43b-ac2a-46c3-b8c5-574fac3424ec", "title": "Lebanon Is Two States for One People – and Both of Them Are Waiting for Hezbollah - Middle East News", "date": "2024-08-16 03:45", "url": "https://www.haaretz.com/middle-east-news/2024-08-16/ty-article/.premium/lebanon-is-two-states-for-one-people-and-both-of-them-are-waiting-for-hezbollah/00000191-57e5-db91-a7dd-77edf0330000", "domain": "haaretz.com", "domain_classification": "Local - Middle East", "message": "\"Journey, we're embarking on a journey, let's do the whole world in a single day.\nTo the west, to the east, perhaps there's no difference.\nIt doesn't matter where we go.\nWhat matters is that we're on a journey and we'll do the whole world in a single day.\""}, {"id": "88e07ce9-801b-4ef4-bf3f-33dc826641d4", "title": "Hezbollah delays attack on Israel due to negotiations in Qatar - report", "date": "2024-08-16 07:00", "url": "https://www.jpost.com/breaking-news/article-814996", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "Hezbollah may plan to hold off on a retaliatory attack against Israel while negotiations for a hostage deal are underway in Qatar, a source close to Hezbollah told the Washington Post, Army Radio reported Friday morning.\nHowever, in the backdrop of hostage deal negotiations in Qatar that began on Thursday, the source said the group believes retaliation can wait as it \"is not urgent or time-bound.\"\nAccording to the source, Hezbollah does not want to be responsible for disrupting a possible deal.\n\"Hezbollah will not launch its retaliation during the Qatar talks because the party does not want to be held accountable for disrupting the talks or a potential deal,\" the source said.\nHostage deal talks show promiseThe talks for a hostage deal, which are continuing on Friday, involve CIA Director William J. Burns and White House Middle East Coordinator Brett McGurk."}, {"id": "d96ee88a-9569-4cbb-871e-edf6b4f01956", "title": "Ukraine Pivot Changes the Narrative in Russia war ; Outcome Remains Unclear | United States Institute of Peace", "date": "2024-08-16 00:00", "url": "https://www.usip.org/publications/2024/08/ukraines-pivot-changes-narrative-russias-war-outcome-remains-unclear", "domain": "usip.org", "domain_classification": "Unknown", "message": "Three Questions to WatchCan Ukraine’s strike into Russia’s Kursk region force Russia to slow its attacks in Ukraine’s Donbas?\nIn recent weeks, Russia has made slow, steady advances in Ukraine’s eastern Donbas region, threatening the towns of Niu-York, Pokrovsk and Chasiv Yar.\nUkraine’s latest conscription efforts have proven unpopular and a weary population has questioned whether continuing the war makes sense.\nThe Russian illegal annexation of Donetsk and Luhansk (and Ukraine’s Kherson and Zaporizhia provinces) codified this reality in Russian minds.\nUkraine’s recent attack into Russia’s internationally recognized territory may seem less distinct or new to those Russians who have fully imbibed Putin’s worldview."}, {"id": "475b6c20-46ea-4dcb-a4ef-65ae2e8810c5", "title": "Russia diplomat says Ukraine wouldnt have attacked Nord Stream without US approval", "date": "2024-08-16 06:15", "url": "https://www.yahoo.com/news/russia-diplomat-says-ukraine-wouldnt-055302125.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "\"They seek to shift all responsibility to their Ukrainian puppets,\" Russian Ambassador Anatoly Antonov said in a statement on Nord Stream.\nRussia has repeatedly said that attack on Nord Stream was carried out by the United States and Britain.\nThe New York Times, The Washington Post and the Wall Street Journal have reported that Ukraine - which has repeatedly denied involvement - was behind the attack.\nUkrainian presidential adviser Mykhailo Podolyak on Thursday denied his country was involved, and pointed the finger at Russia.\nAntonov said that there was no way that Ukraine would attack Nord Stream without \"the wink\" from Washington."}, {"id": "c814f09e-6720-498f-ab75-c74ed97dd1f3", "title": "Russia diplomat says Ukraine wouldnt have attacked Nord Stream without US approval", "date": "2024-08-16 06:30", "url": "https://www.thestar.com.my/news/world/2024/08/16/russia-diplomat-says-ukraine-wouldn039t-have-attacked-nord-stream-without-us-approval", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "MOSCOW (Reuters) - Russia's ambassador to Washington said on Friday that he did not believe Ukraine would have attacked the Nord Stream gas pipelines without the tacit approval of the United States, and that Russia would identify and punish those behind the attack.\n\"They seek to shift all responsibility to their Ukrainian puppets,\" Russian Ambassador Anatoly Antonov said in a statement on Nord Stream.\nRussia has repeatedly said that attack on Nord Stream was carried out by the United States and Britain.\nThe New York Times, The Washington Post and the Wall Street Journal have reported that Ukraine - which has repeatedly denied involvement - was behind the attack.\nAntonov said that there was no way that Ukraine would attack Nord Stream without \"the wink\" from Washington."}, {"id": "c66e8b7f-a030-4256-9d70-5ec200d9e539", "title": "Russia diplomat says Ukraine wouldnt have attacked Nord Stream without US approval", "date": "2024-08-16 06:30", "url": "https://www.marketscreener.com/quote/currency/US-DOLLAR-RUSSIAN-ROUBLE--2370597/news/Russia-diplomat-says-Ukraine-wouldn-t-have-attacked-Nord-Stream-without-US-approval-47668279/", "domain": "marketscreener.com", "domain_classification": "Unknown", "message": "MOSCOW (Reuters) - Russia's ambassador to Washington said on Friday that he did not believe Ukraine would have attacked the Nord Stream gas pipelines without the tacit approval of the United States, and that Russia would identify and punish those behind the attack.\n\"They seek to shift all responsibility to their Ukrainian puppets,\" Russian Ambassador Anatoly Antonov said in a statement on Nord Stream.\nRussia has repeatedly said that attack on Nord Stream was carried out by the United States and Britain.\nThe New York Times, The Washington Post and the Wall Street Journal have reported that Ukraine - which has repeatedly denied involvement - was behind the attack.\nAntonov said that there was no way that Ukraine would attack Nord Stream without \"the wink\" from Washington."}, {"id": "ee02463c-1f44-480c-a7b2-78b042840a9a", "title": "Russia diplomat says Ukraine wouldnt have attacked Nord Stream without US approval", "date": "2024-08-16 07:00", "url": "https://www.swissinfo.ch/eng/russia-diplomat-says-ukraine-wouldn", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Russia diplomat says Ukraine wouldn’t have attacked Nord Stream without US approvalreuters_tickers2 minutesMOSCOW (Reuters) – Russia’s ambassador to Washington said on Friday that he did not believe Ukraine would have attacked the Nord Stream gas pipelines without the tacit approval of the United States, and that Russia would identify and punish those behind the attack.\n“They seek to shift all responsibility to their Ukrainian puppets,” Russian Ambassador Anatoly Antonov said in a statement on Nord Stream.\n“We will seek to identify the real perpetrators of the bombing and punish them.”Russia has repeatedly said that attack on Nord Stream was carried out by the United States and Britain.\nThe New York Times, The Washington Post and the Wall Street Journal have reported that Ukraine – which has repeatedly denied involvement – was behind the attack.\nAntonov said that there was no way that Ukraine would attack Nord Stream without “the wink” from Washington."}, {"id": "36c55469-989d-4718-b89f-ea9255778995", "title": "Risk of regional war hangs over Gaza ceasefire talks", "date": "2024-08-16 09:30", "url": "https://www.bbc.co.uk/news/articles/c20rxr3pr50o", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "If the leaks to local papers are true, even Israel’s defence chiefs are urging Prime Minister Benjamin Netanyahu to make a deal and agree a ceasefire in Gaza.\nSince Israel’s negotiators last made the trip to the Qatari capital for talks, the stakes - and the pressures - have only grown.\nIn Israel, the relatives of hostages still held in Gaza are calling this the “last chance” to get some of them out alive.\nIn Gaza, the Hamas-run health ministry - whose figures have been used by the UN and Israel in the past - says the number of people killed in Israeli operations there since the war began has now passed 40,000.\nThe US believes a truce in Gaza could help calm the entire region."}, {"id": "4bb920bf-6e67-47c7-9914-54b5d93df09a", "title": "Taylor Swift excitement eclipses security fears for Wembley fans", "date": "2024-08-16 08:00", "url": "https://www.asiaone.com/world/taylor-swift-excitement-eclipses-security-fears-wembley-fans", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "LONDON — Fans arriving at Taylor Swift's concert in London on Thursday (Aug 15) said solidarity among fellow Swifties was helping to dispel any security concerns they had after her Vienna concerts were cancelled last week.\n\"Fancy meeting you here at Wembley Stadium, London,\" she told 92,000 cheering fans at the stadium, according to video clips posted on social media.\nIggy Wilde, 28, said she had never considered selling her ticket after the security scare in Vienna.\nFans arriving in Wembley, dressed in sequins and cowboy hats, had their forearms covered in friendship bracelets ready to swap with other Swifties.\nShe bought the London tickets from a friend after failing to find affordable tickets anywhere else."}, {"id": "d853d7fb-955b-4a62-8a0e-d38dc0dfc724", "title": "Lamine Yamal father was stabbed after being  tricked  into meeting", "date": "2024-08-16 01:00", "url": "https://www.dailymail.co.uk/news/article-13748711/lamine-yamal-dad-stabbing-tricked-meeting-men-claims.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Barcelona star Lamine Yamal's father was stabbed after being tricked into meeting up with four men who fooled him into thinking they wanted to 'make peace' following a confrontation hours earlier, it was claimed last night.\nThe four members of the same family surrounded the Spanish international's father and started to punch and kick him before one allegedly stabbed him, the paper reported.\nWednesday night's stabbing in a car park in Mataro north of Barcelona followed an incident around 3pm earlier the same day.\nMounir spent a night in intensive care at Germans Trias i Pujol Hospital in Barcelona before being transferred to a normal ward.\nBarcelona president Joan Laporta was among those who visited him on Wednesday night in hospital following the stabbing."}, {"id": "d75de257-147b-40be-849d-9d8b86e2f88f", "title": "Gaza ceasefire talks resume as death toll exceeds 40 , 000", "date": "2024-08-16 06:45", "url": "https://www.rte.ie/news/middle-east/2024/0816/1465251-israel-gaza/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Palestinian killed as Israeli settlers attack West Bank villageSeparately, dozens of Israeli settlers, some wearing masks, attacked a Palestinian village near the city of Qalqilya in the occupied West Bank, burning cars and killing at least one person, authorities said.\nThe White House said late last night attacks by settlers on Palestinian civilians in the West Bank were \"unacceptable and must stop\".\nThree-month-old baby Rim was orphaned in an Israeli strike in Khan Younis and is now being looked after by her auntThe Israeli military said police and army units intervened and arrested one Israeli.\nThe White House said late yesterday that attacks by Israeli settlers on Palestinian civilians in the West Bank were \"unacceptable and must stop\".\nGaps include the presence of Israeli troops in Gaza, the sequencing of a hostage release and restrictions on the free movement of civilians from southern to northern Gaza."}, {"id": "b124aad7-f699-48f0-98c0-2940c207be8a", "title": "Butler SWAT operator shot delayed Trump rally gunman before Secret Service killed him : report", "date": "2024-08-16 05:00", "url": "https://www.cbsnews.com/pittsburgh/news/butler-swat-operator-trump-rally-gunman/", "domain": "cbsnews.com", "domain_classification": "Unknown", "message": "A report from Louisiana Congressman Clay Higgins said a Butler SWAT operator shot the gun of the gunman, Thomas Matthew Crooks, from about 100 yards away.\nThe shot delayed the shooter long enough for a United States Secret Service sniper to take the fatal shot.\nTwo weeks earlier, acting Secret Service Director Ronald Rowe Jr. testified before Congress.\nLocal law enforcement working the rally said they told the Secret Service they did not have the manpower to do it.\n\"Why do you think they did not take former president Trump off the stage?\""}, {"id": "85723e1e-f6e5-4423-afbc-12e644e7e22b", "title": "The Latest Biden - Harris Betrayal of Israel Will Make Your Blood Run Cold", "date": "2024-08-16 04:15", "url": "https://www.frontpagemag.com/the-latest-biden-harris-betrayal-of-israel-will-make-your-blood-run-cold/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "The Biden-Harris regime is supposed to be an ally of Israel and occasionally sends signals to that effect, but its real loyalties are not hard to figure out.\nThe Biden-Harris regime is all about holding and increasing its power, and Israel is in the way of that aspiration right now.\nTo a regime that has never shown good faith and has repeatedly vowed the destruction of America as well as Israel?\nThe State Department was quick to deny the accuracy of the Kuwaiti report, and as damning as it is, that’s no surprise.\nAre those two dozen people suffering unimaginable horrors in Iranian prisons today because of the Biden-Harris regime’s anxiousness to betray Israel?"}, {"id": "98089c53-f091-4868-9cf2-b9fc5d8bb1aa", "title": "Palestinian death toll in Gaza exceeds 40 , 000 as peace talks renew", "date": "2024-08-16 01:45", "url": "http://en.people.cn/n3/2024/0816/c90000-20206452.html", "domain": "en.people.cn", "domain_classification": "Unknown", "message": "Palestinian death toll in Gaza exceeds 40,000 as peace talks renewXinhua) 08:09, August 16, 2024People mourn victims killed in an Israeli airstrike in the southern Gaza Strip city of Khan Younis, on Aug. 14, 2024.\n(Photo by Rizek Abdeljawad/Xinhua)GAZA, Aug. 15 (Xinhua) -- The Palestinian death toll from the ongoing Israeli attacks on the Gaza Strip has surpassed 40,000 as of Thursday, at a time when the Gaza ceasefire talks were set to resume in Qatar.\nIt took only five and a half months for the Palestinian death toll in the Gaza Strip to rise from 30,000 to 40,000.\nA man stands among the rubble after an Israeli airstrike in the Nuseirat refugee camp, central Gaza Strip, on Aug. 12, 2024.\nThe Israel Defense Forces (IDF) said in a statement on Thursday that it is continuing operational activity in the Gaza Strip, \"eliminating terrorists and dismantling terrorist infrastructure.\""}, {"id": "741f620b-be06-4e87-9d05-f20c667a454f", "title": "Housemaid negligently sets four - bedroom apartment on fire", "date": "2024-08-16 09:30", "url": "https://theeagleonline.com.ng/housemaid-negligently-sets-four-bedroom-apartment-on-fire/", "domain": "theeagleonline.com.ng", "domain_classification": "Unknown", "message": "A female housemaid has negligently set a four-bedroom flat of her employer on fire on Thursday in Ilorin, the Kwara State capital.\nThis was confirmed in a statement by Hassan Adekunle, Head, Department of Media and Publicity, Kwara State Fire Service.\nAdekunle said the maid was trying to light the gas cooker while liquefied gas had already saturated the kitchen.\nAccording to him, the incident happened at about 10:42am at 6, Phase 1, off Baba-Soja Street, Akerebiata, Ilorin East Local Government Area of Kwara State.\nHe added: “The fire crew responded immediately to prevent further destruction and upon arrival, the firefighters encountered a four-bedroom flat bungalow fully engulfed in flames."}, {"id": "11e7d71b-c56e-49f4-bf06-0007df073196", "title": "Watch : Russian Strategic Bomber Crashes In Siberia", "date": "2024-08-16 00:30", "url": "https://www.zerohedge.com/military/watch-russian-strategic-bomber-crashes-siberia", "domain": "zerohedge.com", "domain_classification": "Unknown", "message": "A Russian long-range strategic bomber has crashed over the Siberian region of Irkutsk in what was described as a routine flight.\nRussian state media was the first to report and confirm the crash, citing military officials.\n\"The plane crashed in an uninhabited area.\nIdentified as a nuclear-capable Tu-22M3 bomber, military officials say that the crash was due to technical malfunction.\nMore footage shows a plummeting plane which is on fire in Russia's far east...Reports that a Russian Tu-22M3 bomber crashed in Irkutsk Oblast, Russia tonight."}, {"id": "a0ece87b-ec96-4ff8-a1ac-195e477e3891", "title": "Ceasefire talks resume in Qatar as violence surges in Gaza", "date": "2024-08-16 09:30", "url": "https://www.hurriyetdailynews.com/ceasefire-talks-resume-in-qatar-as-violence-surges-in-gaza-199593", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Ceasefire talks resume in Qatar as violence surges in GazaDOHANegotiators seeking a Gaza ceasefire were scheduled to meet for a second day in Qatar on Friday, while top European diplomats were expected in Israel to stress the urgency of averting a wider war amid rising violence in Gaza.\nIsrael's main military supplier, the United States, has been mediating the talks with Qatar and Egypt.\nThe United States and its allies see the proposed Gaza truce as key to de-escalating soaring regional tensions, particularly with Iran.\nThe Gaza war has also drawn in Tehran-aligned groups in Iraq, Syria, and Yemen.\nThe Qatari foreign ministry said Gaza truce negotiations would continue on Friday."}, {"id": "eba75bc8-abb1-4d90-8393-5775e32cd07d", "title": "Court of Appeals reverses conviction for former Lexington High School student found guilty in 2014 deadly stabbing", "date": "2024-08-16 01:30", "url": "https://www.wistv.com/2024/08/15/court-appeals-reverses-conviction-former-lexington-high-school-student-found-guilty-2014-deadly-stabbing/", "domain": "wistv.com", "domain_classification": "Unknown", "message": "COLUMBIA, S.C. (WIS) - The South Carolina Court of Appeals reversed the conviction of a man who was found guilty in the deadly stabbing of a Dutch Fork High School student.\n“A mistrial is the equivalent of no trial and leaves the cause pending in the circuit court,” the South Carolina Court of Appeals said in court documents.\nIn reversing his conviction, the South Carolina Court of Appeals ordered the trial court to give Dennis a new immunity hearing.\nUltimately, the South Carolina Court of Appeals found the proper course was to remand for a new immunity hearing.\n“The circuit court is in the best position to assess witness credibility and make the necessary findings of fact,” said the South Carolina Court of Appeals in the court documents."}, {"id": "faca29f7-52a4-4e39-a189-44dd4e18c06e", "title": "US troops stationed in Middle East face growing number of attacks", "date": "2024-08-16 01:30", "url": "https://www.10news.com/world/middle-east/us-troops-stationed-in-middle-east-face-growing-number-of-attacks", "domain": "10news.com", "domain_classification": "Unknown", "message": "It was January 2020 and Iran-backed militias launched a barrage of ballistic missiles toward U.S. and coalition troops stationed at Al-Asad.\nThe number of attacks on U.S. troops accelerated after Oct. 7 of 2023 — the start of the Israel-Gaza war.\nWhen she emerged from her bunker after the attack, Hayden thought she was okay.\nThey are wounds that could potentially threaten more of the nation's troops as they come under increasing attack in the Middle East.\nThey said the injured troops were treated for smoke inhalation and traumatic brain injuries."}, {"id": "5e900c92-0f14-4954-8765-e337c4edaf46", "title": "  Dehumanising  conditions prevent aid reaching Gaza", "date": "2024-08-16 06:45", "url": "https://www.rte.ie/news/middle-east/2024/0816/1465243-gaza-icrc/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "\"I've worked in several conflict zones and the level of devastation is nothing I've ever seen before,\" Mr Schomburg told RTÉ News.\nHe said the biggest obstacle to the Red Cross providing humanitarian aid is the prevailing insecurity and unabated hostilities.\nHe described as \"mind boggling\" the logistical difficulties his teams encounter at border crossing, which prevents life-saving aid reaching those who need it.\nDescribing scenes at the hospital, Mr Schomburg became quite emotional saying: \"To see children with double amputations and severe burns, civilians that are so clearly not part of the fight, is difficult.\"\nHe said Gaza was not an easy place to live before the war but that people still had hope."}, {"id": "27eeb266-d886-4e17-87a5-7e0a573f3324", "title": "Wall Street Journal : Ukrainian President Zelensky approved Nord Stream pipeline attack", "date": "2024-08-16 06:30", "url": "https://www.wsws.org/en/articles/2024/08/16/dibd-a16.html", "domain": "wsws.org", "domain_classification": "Unknown", "message": "This was reported by the Wall Street Journal (WSJ) on August 14, citing several unnamed sources in the Ukrainian military apparatus.\nU.S. President Joe Biden shakes hands with Ukrainian President Volodymyr Zelensky in Paris, Friday, June 7, 2024.\nPresident Joe Biden even openly threatened an attack two weeks before the start of the Ukraine war.\nLike Zelensky, Zaluzhny could not take a single step without the consent of the US.\nThe real role of the American and German governments in the Nord Stream attack remains in the dark."}, {"id": "e94f2a00-e67e-4b58-8936-b0752bb4e95a", "title": "As Gaza toll passes 40 , 000 , the dead are buried in yards , streets , stacked graves", "date": "2024-08-16 09:30", "url": "https://www.theage.com.au/world/middle-east/as-gaza-toll-passes-40-000-the-dead-are-buried-in-yards-streets-tiered-graves-20240816-p5k2vv.html", "domain": "theage.com.au", "domain_classification": "Local - Oceania", "message": "Trucked back to Gaza, the bodies are often decomposed and unidentifiable, buried quickly in a mass grave.\n“This does not exist in Gaza.”Twenty-five members of Fares’ family were killed by an airstrike on October 13 in northern Gaza.\nThere’s no sign of Mohammed’s body, Jomaa said.\nJomaa said that come the end of the war, he plans to visit Gaza to search for Mira’s remains.\nSmashed graves and cemeteries off-limits Israeli evacuation orders cover much of Gaza, leaving some of the largest cemeteries off-limits."}, {"id": "ef13d2b9-7761-44f5-bf12-8aa7b72ce564", "title": "Russia Ukraine war latest : Kyiv troops seize largest Russian town yet as Zelensky hints at further offensives", "date": "2024-08-16 06:15", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-war-putin-kursk-offensive-challenger-2-b2597203.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Vladimir Putin’s forces appear to be moving several thousand troops to Kursk from occupied Ukraine to stabilise the surprise incursion launched by Kyiv’s force.\nUS officials told CNN that multiple brigade-sized elements made up of at least 1,000 troops appear to have shifted to the Kursk region from northeast Ukraine.\nHe added, however, that the move does not mean Russia has given up its own assaults in northeast Ukraine.\nBut Russian troops carrying out an offensive further east towards the town of Pokrovsk in Donetsk, with some notable success, are likely to be left to continue prosecuting that attack, they added."}, {"id": "e2c29cb2-d2b3-406d-957f-7aa47e5f4904", "title": "As Gaza toll passes 40 , 000 , the dead are buried in yards , streets , stacked graves", "date": "2024-08-16 09:30", "url": "https://www.brisbanetimes.com.au/world/middle-east/as-gaza-toll-passes-40-000-the-dead-are-buried-in-yards-streets-tiered-graves-20240816-p5k2vv.html", "domain": "brisbanetimes.com.au", "domain_classification": "Unknown", "message": "Trucked back to Gaza, the bodies are often decomposed and unidentifiable, buried quickly in a mass grave.\n“This does not exist in Gaza.”Twenty-five members of Fares’ family were killed by an airstrike on October 13 in northern Gaza.\nThere’s no sign of Mohammed’s body, Jomaa said.\nJomaa said that come the end of the war, he plans to visit Gaza to search for Mira’s remains.\nSmashed graves and cemeteries off-limits Israeli evacuation orders cover much of Gaza, leaving some of the largest cemeteries off-limits."}, {"id": "b9e9eb10-a5b9-41c8-9379-3d20de0a7f7d", "title": "Once a death - row inmate , this Oakland man will go free next year", "date": "2024-08-16 06:30", "url": "http://www.sfchronicle.com/bayarea/article/death-row-inmate-oakland-man-go-free-next-year-19659379.php", "domain": "sfchronicle.com", "domain_classification": "Unknown", "message": "All because of what Alameda County District Attorney Pamela Price said amounted to prosecutorial misconduct in the jury selection process three decades ago.\nThe jurors imposed a death sentence.\nDykes appealed his convictions and death sentence — first in state court, then in federal court, after the state Supreme Court upheld the case.\nIn a motion that sought a new sentence for Dykes, Price’s office described the prosecutors’ actions as prosecutorial misconduct, citing it as grounds for a new sentence for Dykes.\nAs part of the ongoing review of the county’s death sentences, the office reached a resolution in two other cases."}, {"id": "a37456ca-30bc-4073-a8f4-0b81ce2e1da1", "title": "Suspect arrested after convenience store employee stabbed", "date": "2024-08-16 03:15", "url": "https://www.yahoo.com/news/suspect-arrested-convenience-store-employee-003217359.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "SAN DIEGO (FOX 5/KUSI) — A man was arrested Thursday after a stabbing at a convenience store in downtown San Diego, authorities said.\nThe stabbing occurred around 1 p.m. at an A-Mart located at 1255 Imperial Avenue, the San Diego Police Department said in a news release.\nWhile store employees were removing the suspect from the store due to him being intoxicated and causing a disturbance, the suspect pulled out a knife and lunged at one of the employees, according to police.\nTransit security initially detained the suspect, identified as 36-year-old Juan Flores-Puga, who was then arrested by SDPD.\nFor the latest news, weather, sports, and streaming video, head to FOX 5 San Diego & KUSI News."}, {"id": "10296f12-c953-4503-9de3-a1369e1f73c8", "title": "Russia - Ukraine war LIVE : Explosions rock Crimea | World | News", "date": "2024-08-16 07:45", "url": "https://www.express.co.uk/news/world/1936762/russia-ukraine-war-live-explosions-crimea", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Vladimir Putin has transferred \"several thousand troops\" across the border into Russia in response to a surprise incursion by Ukrainian forces in the Kursk region in recent days, the White House has said.\nMeanwhile, massive explosions have rocked Crimea overnight, with pictures showing fires erupting and a bridge between the occupied Ukrainian peninsula and mainland Russia currently suspended to traffic.\nAdditionally, various Telegram channels reported explosions in Chornomorske and Kamianka, close to Simferopol, and air-raid warnings and shooting in Feodosiia.\nThe news comes as Ukraine seized around 1,000 square kilometres of internationally recognised Russian territory in the Kursk Oblast.\nThe attack - ongoing for more than a week - appears to have caught Vladimir Putin's forces by surprise as Moscow scrambles to respond."}, {"id": "dcb79997-aaf8-4d80-b4e2-a813760db5a3", "title": "Hours - long standoff in Eugene ends in officer - involved shooting", "date": "2024-08-16 06:45", "url": "https://kval.com/news/local/hours-long-standoff-in-eugene-ends-in-officer-involved-shooting", "domain": "kval.com", "domain_classification": "Unknown", "message": "An hours-long standoff in Eugene led to an officer involved shooting with a wanted suspect for attempted murder.\nIt when officers identified the suspect as someone wanted out of Portland.\nResidents witnessed the frightening two-and-a-half-hour standoff that ended with officers shooting the suspect - an incident continuing to echo throughout the community.\n\"We heard a bullhorn outside of our apartment saying, 'Put your hands outside the window,'\" recalls neighborhood resident Jonathan Guske.\nWithem-Breeding says police were standing on her property during what Withem-Breeding calls a terrifying standoff."}, {"id": "94e5a81a-a236-421a-8945-733d5a45f137", "title": "Call of Duty next set up of updates will shrink the game file size", "date": "2024-08-16 00:45", "url": "https://www.windowscentral.com/gaming/the-roadmap-to-black-ops-6-includes-new-optimizations-to-the-call-of-duty-experience-including-smaller-downloads-and-streamlined-menus", "domain": "windowscentral.com", "domain_classification": "Unknown", "message": "A new series of updates is set to deploy ahead of the launch of Call of Duty: Black Ops 6 in October.\nThe road to Black Ops 6 starts with MW3 Season 5.5Activision and the Call of Duty Team have shared a roadmap of updates to the Call of Duty HQ experience.\nPreparing for the Black Ops 6 Open BetaThe Call of Duty: Black Ops 6 open beta begins on August 30.\nCall of Duty: Black Ops 6 is available for preorder now.\nOur helpful guide can help you choose between the Vault Edition and Standard Editions of Black Ops 6."}, {"id": "ecd22ae7-f06b-4f05-96e8-8c98dc0cbc4d", "title": "China military AI detects secret radar links between South China Sea , Alaska and Guam", "date": "2024-08-16 06:30", "url": "https://www.thestar.com.my/tech/tech-news/2024/08/16/chinas-military-ai-detects-secret-radar-links-between-south-china-sea-alaska-and-guam", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "Chinese electronic warfare AI has detected mysterious signals that repeatedly show up in the South China Sea, Guam, the Marshall Islands and the Aleutian Islands near Alaska – and they appear to be coordinated.\nThey published their findings in a peer-reviewed paper in the Journal Of Terahertz Science And Electronic Information Technology in May.\nThis information helps the Chinese military better plan electronic warfare tasks such as electromagnetic suppression, deception, and jamming.\nThe electronic warfare AI works with other intelligence platforms, such as imaging satellites, to cross-check its findings.\nThe PLA’s electronic warfare equipment has made rapid progress in recent years, and its electronic warfare strategy has become proactive, while the United States sometimes finds itself on the defensive."}, {"id": "4dee8bfa-016f-468a-b2c5-d973ab773886", "title": "Consigliere Putin , Nato ha aiutato attacco di Kiev a Kursk  ", "date": "2024-08-16 08:00", "url": "https://www.giornaledibrescia.it/italia-e-estero/consigliere-putin-nato-ha-aiutato-attacco-di-kiev-a-kursk-tz7xlrw0", "domain": "giornaledibrescia.it", "domain_classification": "Unknown", "message": "ROMA, 16 AGO - La Nato e \"i servizi speciali occidentali\" sono direttamente coinvolti nella pianificazione dell'attacco dell'Ucraina alla regione russa di Kursk, secondo quanto asserisce il principale consigliere di Vladimir Putin, Nikolai Patrushev, citato da Tass.\n'E' stato l'Occidente a portare al potere la giunta criminale in Ucraina.\nI Paesi Nato hanno inviato armi e istruttori militari in Ucraina, continuano a fornire informazioni d'intelligence e controllano le azioni dei gruppi neonazisti.\nE l'operazione nella regione di Kursk è stata pianificata con la partecipazione della Nato e dei servizi speciali occidentali\", ha detto Patrushev."}, {"id": "a9c5186e-39d8-4875-a953-1e2a517d2df2", "title": "China military AI detects secret radar links between South China Sea , Alaska and Guam", "date": "2024-08-16 02:30", "url": "https://www.scmp.com/news/china/science/article/3274610/chinas-military-ai-detects-secret-radar-links-between-south-china-sea-alaska-and-guam", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "Chinese electronic warfare AI has detected mysterious signals that repeatedly show up in the South China Sea, Guam , the Marshall Islands and the Aleutian Islands near Alaska – and they appear to be coordinated.\nThey published their findings in a peer-reviewed paper in the Journal of Terahertz Science and Electronic Information Technology in May.\nThis information helps the Chinese military better plan electronic warfare tasks such as electromagnetic suppression, deception, and jamming.\nThe electronic warfare AI works with other intelligence platforms, such as imaging satellites, to cross-check its findings.\nThe PLA’s electronic warfare equipment has made rapid progress in recent years, and its electronic warfare strategy has become proactive, while the United States sometimes finds itself on the defensive."}, {"id": "d64121c1-52b5-49ce-9b05-acef71c94591", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities – Winnipeg Free Press", "date": "2024-08-16 04:45", "url": "https://www.winnipegfreepress.com/world/2024/08/15/ukraines-swift-push-into-the-kursk-region-shocked-russia-and-exposed-its-vulnerabilities", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "In more than a week of fighting, Russian troops are still struggling to drive out the invaders.\nThat includes a 245-kilometer (152-mile) section in the Kursk region.\nUkrainian troops faced no such obstacles entering the Kursk region.\nSyrskyi claims Ukrainian forces advanced across 1,000 square kilometers (390 square miles) of the Kursk region, although it’s not possible to independently verify what exactly Ukrainian forces effectively control.\nRussia responds, but slowlyThe Russian military command initially relied on warplanes and helicopters to try to stop the onslaught."}, {"id": "f95298e9-1530-49e1-a6a1-c54f644e559b", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities", "date": "2024-08-16 06:15", "url": "https://abcnews.go.com/International/wireStory/ukraines-swift-push-kursk-region-shocked-russia-exposed-112884154", "domain": "abcnews.go.com", "domain_classification": "International", "message": "In more than a week of fighting, Russian troops are still struggling to drive out the invaders.\nThat includes a 245-kilometer (152-mile) section in the Kursk region.\nUkrainian troops faced no such obstacles entering the Kursk region.\nSyrskyi claims Ukrainian forces advanced across 1,000 square kilometers (390 square miles) of the Kursk region, although it’s not possible to independently verify what exactly Ukrainian forces effectively control.\nKyiv remains tight-lipped about whether it intends to seek a foothold in the Kursk region or pull back into Ukrainian territory."}, {"id": "65cb5ea6-9df0-4941-bb89-43034555f9b8", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities", "date": "2024-08-16 07:00", "url": "https://www.ksat.com/news/2024/08/16/ukraines-swift-push-into-the-kursk-region-shocked-russia-and-exposed-its-vulnerabilities/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "In more than a week of fighting, Russian troops are still struggling to drive out the invaders.\nThat includes a 245-kilometer (152-mile) section in the Kursk region.\nUkrainian troops faced no such obstacles entering the Kursk region.\nSyrskyi claims Ukrainian forces advanced across 1,000 square kilometers (390 square miles) of the Kursk region, although it’s not possible to independently verify what exactly Ukrainian forces effectively control.\nRussia responds, but slowlyThe Russian military command initially relied on warplanes and helicopters to try to stop the onslaught."}, {"id": "0d0d4c9f-6812-4ca8-be4e-8584ad9aa7f5", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities", "date": "2024-08-16 07:00", "url": "https://www.clickorlando.com/news/2024/08/16/ukraines-swift-push-into-the-kursk-region-shocked-russia-and-exposed-its-vulnerabilities/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "In more than a week of fighting, Russian troops are still struggling to drive out the invaders.\nThat includes a 245-kilometer (152-mile) section in the Kursk region.\nUkrainian troops faced no such obstacles entering the Kursk region.\nSyrskyi claims Ukrainian forces advanced across 1,000 square kilometers (390 square miles) of the Kursk region, although it’s not possible to independently verify what exactly Ukrainian forces effectively control.\nRussia responds, but slowlyThe Russian military command initially relied on warplanes and helicopters to try to stop the onslaught."}, {"id": "65d44aeb-6b40-4f51-a248-5f9f81bbc939", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities", "date": "2024-08-16 06:30", "url": "https://www.wsls.com/news/2024/08/16/ukraines-swift-push-into-the-kursk-region-shocked-russia-and-exposed-its-vulnerabilities/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "In more than a week of fighting, Russian troops are still struggling to drive out the invaders.\nThat includes a 245-kilometer (152-mile) section in the Kursk region.\nUkrainian troops faced no such obstacles entering the Kursk region.\nSyrskyi claims Ukrainian forces advanced across 1,000 square kilometers (390 square miles) of the Kursk region, although it’s not possible to independently verify what exactly Ukrainian forces effectively control.\nRussia responds, but slowlyThe Russian military command initially relied on warplanes and helicopters to try to stop the onslaught."}, {"id": "5bbe1a58-0fb9-4c36-83f2-8200b8fbf1c1", "title": "Supercarrier USS George H . W . Bush Now Has First Of its Kind Drone Control Center", "date": "2024-08-16 02:15", "url": "https://www.yahoo.com/news/supercarrier-uss-george-h-w-011616791.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Bush (CVN-77) is now the first U.S. Navy supercarrier to have a complete dedicated Unmanned Air Warfare Center (UAWC).\nBush (CVN-77) is now the first U.S. Navy supercarrier to have a complete dedicated Unmanned Air Warfare Center (UAWC).\nNaval Air Systems Command (NAVAIR) announced the completion of George H.W.\nFurthermore, “CVN 77’s UAWC lays the foundation for how the U.S. Navy will operate and control unmanned aircraft, and perhaps other unmanned vehicles, with UMCS,” Capt.\nThe Navy has now taken a major step forward toward its larger uncrewed naval aviation vision with the completion of the new drone control center on the USS George H.W."}, {"id": "f83c5d0f-d96e-42b2-a8fe-71da32b1400a", "title": "Fighting Knights to appear at Goodrich Castle , Herefordshire", "date": "2024-08-16 06:30", "url": "https://www.herefordtimes.com/news/24511946.fighting-knights-appear-goodrich-castle-herefordshire/", "domain": "herefordtimes.com", "domain_classification": "Unknown", "message": "English Heritage will be welcoming some special guests to Goodrich Castle in Herefordshire this summer.\nOn the weekend of August 17 and 18, two chivalric warriors will be fighting for glory at Fighting Knights.\nThere will be interactive family activities for everyone to get involved in that will transport you back to the castle’s medieval heyday.\nEntry to Fighting Knights is included in the price of admission.\nFor more information on Goodrich Castle, visit www.english-heritage.org.uk."}, {"id": "eb92e3e8-1b29-4906-8188-567cc9458f11", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities | Nation", "date": "2024-08-16 09:30", "url": "https://www.yakimaherald.com/news/nation_and_world/nation/ukraine-s-swift-push-into-the-kursk-region-shocked-russia-and-exposed-its-vulnerabilities/article_4c97a77b-d67b-5d9c-a4de-0bfe0b105425.html", "domain": "yakimaherald.com", "domain_classification": "Unknown", "message": "A daring Ukrainian military push into Russia’s Kursk region has seen Kyiv’s forces seize scores of villages, attack air bases and force the evacuation of tens of thousands of civilians in what has become the largest attack on the country since World War II"}, {"id": "d5b766a3-d3ac-4789-ad4e-d7c28190de79", "title": "Russian Army Loses 1 , 330 Soldiers In Ukraine Over Past Day", "date": "2024-08-16 07:45", "url": "https://menafn.com/1108561403/Russian-Army-Loses-1330-Soldiers-In-Ukraine-Over-Past-Day", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- UkrinForm) Russia lost about 596,950 in Ukraine between February 24, 2022 and August 16, 2024, including 1,330 killed or wounded in action in the past 24 hours.\nThe General Staff of the of Ukraine said this in a post on , Ukrinform reports.\nSince the war began, Ukraine's defense forces have destroyed 8,496 Russian tanks (including 12 in the past day), 16,461 (+35) armored fighting vehicles, 16,927 (+59) artillery systems, 1,159 (+5) multiple rocket launchers, 922 anti-aircraft warfare systems, and 2,429 (+1) cruise missiles.\nThe Russian army also lost 367 warplanes, 328 helicopters, 13,659 (+61) tactical unmanned aerial systems, 28 warships/cutters, 1 submarine, 22,848 (+73) vehicles and fuel tankers, and 2,829 (+16) pieces of special equipment."}, {"id": "8e6ee729-8271-43dc-af7f-6ac3a4f9b939", "title": "Art and cultural property repatriation | Meaning , Laws , Museums , Examples , & Difficulties", "date": "2024-08-16 05:15", "url": "https://www.britannica.com/topic/art-and-cultural-property-repatriation", "domain": "britannica.com", "domain_classification": "Unknown", "message": "art and cultural property repatriationTable of Contentsart and cultural property repatriation, the return of art or other cultural objects to their country or culture of origin.\nProponents of repatriation see cultural objects as belonging to the countries or cultures where they were produced or, in the case of historical or archaeological materials, found.\nOpponents of repatriation see these materials as part of a universal human culture and argue that, because cultures are neither isolated nor fixed, repatriation proponents are perpetuating a narrow nationalism.\nProponents of repatriation view many of the foreign objects in Western museums as having been taken through illicit or immoral means.\nOpponents of repatriation contend that many of the objects were gathered in a way that was considered legal and moral at the time."}, {"id": "fead7218-3ed5-4ef1-94b1-3a75846adf12", "title": "Ottawa : Ukraine can use military equipment in Russia", "date": "2024-08-16 01:45", "url": "https://www.ctvnews.ca/politics/ukraine-can-use-canadian-military-equipment-inside-russia-ottawa-says-1.7002779", "domain": "ctvnews.ca", "domain_classification": "Unknown", "message": "OTTAWA -The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence says Canada places no geographic restrictions on military equipment donated to Ukraine.\nThe statement comes after Ukraine launched a surprise military offensive into Russia earlier this month.\nThe attack is unprecedented for its use of Ukrainian military units on Russian soil.\nOttawa has committed $4 billion in military assistance to Ukraine through 2029."}, {"id": "f4e1eb85-d5d5-45aa-b334-874531eb688d", "title": "Ukraine can use Canadian military equipment inside Russia , Ottawa says", "date": "2024-08-16 01:00", "url": "https://www.theglobeandmail.com/canada/article-ukraine-can-use-canadian-military-equipment-inside-russia-ottawa-says/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.David Smith/The Canadian PressThe federal government says the Ukrainian army can use military equipment provided by Canada inside Russia.\nA spokesperson for National Defence said Canada places no geographic restrictions on military equipment donated to Ukraine.\nThe statement was issued after Ukraine launched a surprise military offensive into Russia earlier this month.\nThe attack is unprecedented for its use of Ukrainian military units on Russian soil.\nOttawa has committed $4-billion in military assistance to Ukraine through 2029."}, {"id": "2845de91-c676-4fc9-ad40-13291b57f48d", "title": "Ukraine will use Kursk incursion to force Putin to retreat in shame , reveals Zelensky advisor", "date": "2024-08-16 06:15", "url": "https://www.independent.co.uk/news/world/europe/russia-kursk-ukraine-putin-response-zelensky-b2597210.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Ukrainian forces have steadily advanced across the border into the Kursk region, taking over towns and villages and forcing hundreds of thousands of ordinary Russians to flee their homes.\nUkrainian forces have also taken Russian soldiers as prisoners of war to use as bargaining chips for their own civilians previously taken by Putin’s troops.\n“There has to be a complex, a multitude of instruments to force Russia to stop this war,” he said.\n“One incursion is not going to be enough for Putin to realise that the war is not worth it.\nBut civilians in Ukraine’s Sumy region, which borders the Kursk area, have not been left unscathed as Russia continues to fire drones and missiles from afar."}, {"id": "302bebd6-adf7-4ea0-8311-f9eb90f5d05d", "title": "The Ukrainian endgame", "date": "2024-08-16 08:30", "url": "https://www.newstatesman.com/international-content/2024/08/the-ukrainian-endgame", "domain": "newstatesman.com", "domain_classification": "Unknown", "message": "But I struggle to see how Ukraine can recapture Russian occupied territories, just as I struggle to see how Russia can occupy more Ukrainian territories beyond a few villages.\nBefore Kursk grabbed the headlines, Russian troops had been pushed further into Ukrainian territory over the last couple of months, albeit realising only modest gains.\nUkraine has occupied the Kursk town of Sudzha, which is located close to where Russian gas enters the Ukrainian pipeline network.\nWhen the Nord Stream Baltic Sea pipelines were blown up two years ago, the Ukrainian gas continued to flow through the Sudzha transit point.\nRussia wants the four Ukrainian oblasts it unilaterally annexed in September 2022: Donetsk, Kherson, Luhansk and Zaporizhzhia."}, {"id": "468fa428-0300-4300-b74f-efd155cb6686", "title": "Fortnite update 31 . 00 patch notes - New content and fixes for Chapter 5 , Season 4 | Gaming | Entertainment", "date": "2024-08-16 01:00", "url": "https://www.express.co.uk/entertainment/gaming/1936741/fortnite-update-3100-patch-notes-chapter-5-season-4", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "UPDATE: Fortnite update 31.00 is available to download on all platforms.\nWhile the game remains offline for server maintenance, fans can download and install the latest update.\nOn the plus side, while the servers are down, you can at least download and install update 31.00.\nAnd judging by all the hype from Epic Games, the Season 4 update will be well worth checking out.\nREAD MORE: Fortnite Chapter 5, Season 4 release date, time, server maintenance, Battle Pass, new map locationsREAD MORE: Fortnite new season server downtime - Full maintenance schedule for Chapter 5, Season 4"}, {"id": "7d5ace6a-db7b-47b2-b5bb-9e0ef3e59b36", "title": "Japanese veteran confronts gruesome germ - warfare crimes in China", "date": "2024-08-16 07:45", "url": "http://en.people.cn/n3/2024/0816/c90000-20206842.html", "domain": "en.people.cn", "domain_classification": "Unknown", "message": "Out of the 3,607 registered members who served in Unit 731, only a few have acknowledged the historical facts, according to Jin.\nHe described the actions of Unit 731 in China as war crimes that have always haunted him.\nBefore his trip to China, Shimizu had delivered over 20 public speeches exposing Unit 731's germ-warfare crimes using his personal experiences and historical records.\n(Xinhua/Zhang Tao)The crimes committed by Unit 731 were among the most gruesome atrocities of the Japanese invasion of China during World War II.\nThe Chinese people remain profoundly dismayed by the revelations of the germ warfare conducted by Unit 731."}, {"id": "49183bfb-1300-4fa4-92d6-2f4051af07b4", "title": "Carew Castle to host weekend of weaponry and warfare", "date": "2024-08-16 08:00", "url": "https://www.westerntelegraph.co.uk/news/24518461.carew-castle-host-weekend-weaponry-warfare/", "domain": "westerntelegraph.co.uk", "domain_classification": "Unknown", "message": "Carew Castle's 'Weekend of Weaponry and Warfare' is set to return this bank holiday, with the Historia Normannis living history group taking visitors back to the 12th century.\nThis event, which is included with normal castle entry, will feature a medieval encampment, combat displays, and demonstrations of traditional skills.\nDaisy Hughes, manager of Carew Castle and Tidal Mill, said: \"We’re delighted to welcome Historia Normannis back to Carew this coming bank holiday.\n\"The Weekend of Weaponry and Warfare promises an unforgettable history lesson on the living conditions of a 12th century army on the march.\nFor more details and the full weekend schedule, visit the Carew Castle website."}, {"id": "dc483f97-db4f-4693-a970-48f64ce45b1f", "title": "British tanks used to drive back Putin forces during Ukraine incursion into Russia", "date": "2024-08-16 06:15", "url": "https://www.independent.co.uk/news/world/europe/ukraine-challenger-2-tanks-uk-russia-b2597207.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Please try again later {{ /verifyErrors }}British tanks have been used to force back Vladimir Putin’s troops during Ukraine’s audacious incursion into Russia.\n“It is inevitable that these things were going to be integrated into [Ukraine’s] military units and that they were going to be used.\nIf Russia is using fuel depots or command posts just over the border [in Kursk], they are legitimate targets under international law,” he said.\nView moreThe Ministry of Defence did not deny that Challenger 2 tanks have been used in Kursk, but said it would not comment on operational matters.\nA UK source confirmed that the tanks have been used, but it is still unclear exactly how many and when."}, {"id": "1c805d50-3b49-448b-8781-95d7d24b952c", "title": "The Lies of Tim Walz | Frontpage Mag", "date": "2024-08-16 04:15", "url": "https://www.frontpagemag.com/the-lies-of-tim-walz/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "Vance and Democrat Tim Walz marks the biggest controversy of its kind in 20 years.\nThe Swift Boat controversy of 20 years ago hurt Kerry politically, but there’s a big difference between his situation and that of Tim Walz.\nBut apparently, Walz wasn’t sufficiently proud of his achievement, so he lied about it in his curriculum vitae.\nValor describes courage or conspicuous gallantry, and I have not seen anything suggesting that Walz lied about receiving medals he did not earn.\nTim Walz did lie often."}, {"id": "6251348a-7d1c-473a-bc34-3ba052cb22d6", "title": "Warplanes : Ukraine Needs 128 F - 16s", "date": "2024-08-16 09:30", "url": "http://www.strategypage.com/htmw/htairfo/articles/2024081602541.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "August 16, 2024: As of late July, Ukraine has received 85 F-16s contributed by the Netherlands, Norway and Denmark.\nAfter that NATO was the only source of replacement aircraft and the first of 128 F-16s began arriving earlier in 2024.\nThere are several hundred European and American F-16s available for shipment to Ukraine and Ukraine is eager to get as many F-16s as they can.\nA growing number of Ukrainian pilots have completed their training in F-16s and deliveries of dozens of F-16s have begun.\nUntil Block 70 came along the most advanced F-16 was the F-16 Block 60."}, {"id": "af272c12-9aa1-4a8e-b23b-71179aac56e4", "title": "Hyped Modern Warfare 2 Remastered Multiplayer Mod Killed One Day Before Launch", "date": "2024-08-16 01:15", "url": "https://www.kotaku.com.au/2024/08/hyped-modern-warfare-2-remastered-multiplayer-mod-killed-one-day-before-launch/", "domain": "kotaku.com.au", "domain_classification": "Unknown", "message": "The highly anticipated fan mod for Call of Duty 4: Modern Warfare Remastered was focused on recreating and remastering the online multiplayer of Modern Warfare 2 for PC players.\nCoD4: MW Remastered launched in 2016 and included the original campaign as well as a remastered version of that game’s beloved multiplayer mode.\nHowever, when Modern Warfare 2 Remastered arrived in 2020, it only included the campaign and didn’t feature any online multiplayer.\nFor many players, this was extremely disappointing ,as MW2’s online multiplayer is considered by many CoD fans to be the best in the franchise’s history.\nSo many people bought MW Remastered because of the mod that it jumped into the top five best-selling games on Steam."}, {"id": "84269514-98bd-4b23-b32a-fd775ce82d18", "title": "Battle Lines : Diplomatic efforts to avoid full - scale war in the Middle East , Ukraine incursion into Russia", "date": "2024-08-16 07:00", "url": "https://www.telegraph.co.uk/world-news/2024/08/16/diplomatic-efforts-to-avoid-full-scale-war/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Across the world, from Europe to Asia, from the Americas to the Middle East, tensions are rising between nation states as the traditional alliances and alignments evolve in the 21st century.\nThis year sees war in Europe and the Middle East, and elections in major economies, from the US and the UK to Taiwan.\nInsurgencies flare in Yemen and Burma, tensions escalate in East Africa, and all around the world the international security architecture buckles under increasing pressure.\nBattle Lines, a new podcast from The Telegraph, combines on-the-ground reporting with analytical expertise to help the listener to better understand the course of world politics, wars and tensions, as fault lines grind and slip in an increasingly dangerous and confusing multipolar world.\nListen to Battle Lines using the audio player in this article or on Apple Podcasts, Spotify, Amazon Music, or your favourite podcast app."}, {"id": "1e8ff5e8-32a1-4fe7-b4a3-bc69015a005e", "title": "Ukraine Recap : Kursk Offensive Turns The Fortunes Of War On Their Head For Now At Least", "date": "2024-08-16 00:00", "url": "https://menafn.com/1108560780/Ukraine-Recap-Kursk-Offensive-Turns-The-Fortunes-Of-War-On-Their-Head-For-Now-At-Least", "domain": "menafn.com", "domain_classification": "Unknown", "message": "You can also subscribe to our fortnightly recap of expert analysis of the conflict in Ukraine.\nRead more: Ukraine war: Kursk offensive has taken the war into Russia and put Putin on the back foot – for nowPressure on PutinVladimir Putin, meanwhile, has been quick to label the operation as a“provocation requiring a counter-terrorist response”.\nUK prime minister, Keir Starmer, has made it clear that, apart from the long-range Storm Shadow cruise missiles, Ukraine is free to use the weapons supplied by Britain in any way it chooses.\nEPA-EFE/Gavril Grigorov/Sputnik/Kremlin poolThroughout the course of the war, Putin has reacted to any talk of the use of western weapons inside Russia with threats of escalation.\nThis will reportedly involve Tomahawk cruise missiles, SM-6 ballistic missiles and a new generation of hypersonic systems currently under development."}, {"id": "59420f0a-e827-42ad-874a-e183f0412705", "title": "US troops stationed in Middle East face growing number of attacks", "date": "2024-08-16 04:00", "url": "https://www.kjrh.com/world/middle-east/us-troops-stationed-in-middle-east-face-growing-number-of-attacks", "domain": "kjrh.com", "domain_classification": "Unknown", "message": "It was January 2020 and Iran-backed militias launched a barrage of ballistic missiles toward U.S. and coalition troops stationed at Al-Asad.\nThe number of attacks on U.S. troops accelerated after Oct. 7 of 2023 — the start of the Israel-Gaza war.\nWhen she emerged from her bunker after the attack, Hayden thought she was okay.\nThey are wounds that could potentially threaten more of the nation's troops as they come under increasing attack in the Middle East.\nThey said the injured troops were treated for smoke inhalation and traumatic brain injuries."}, {"id": "9f8dccb8-7bc1-483f-91d6-5ec0d4c16574", "title": "Viewpoint : We need a new approach to biotech regulations to avoid hijacking by bioterrorists", "date": "2024-08-16 08:30", "url": "https://geneticliteracyproject.org/2024/08/16/viewpoint-we-need-a-new-approach-to-biotech-regulations-to-avoid-hijacking-by-bioterrorists/", "domain": "geneticliteracyproject.org", "domain_classification": "Unknown", "message": "For instance, they could be used to create genetically enhanced biological agents that are more virulent or resistant to existing treatments.\nThe concerns around the societal impact and aligned ethical concerns of genetic engineering also extend to biological weapons.\nThis can include a genetically motivated carrier or delivery system or a genetically enhanced biological agent.\nThis can include a genetically motivated carrier or delivery system or a genetically enhanced biological agent.\nIncreasing the virulence of biological weapons through genetic engineering: Genetic engineering has long been considered a potential tool for creating more lethal biological warfare agents."}, {"id": "ffebceea-695f-486b-9b32-497b5b86db31", "title": "The Ukrainian August 2024 offensive : Some initial thoughts", "date": "2024-08-16 01:30", "url": "https://smallwarsjournal.com/jrnl/art/ukrainian-august-2024-offensive-some-initial-thoughts", "domain": "smallwarsjournal.com", "domain_classification": "Unknown", "message": "It is the most significant development in the Ukraine war in over a year.\nSome observations of the Ukrainian August offensive:The Ukrainians practiced good OPSEC – The offensive came as surprise to many observers in the West (including myself) and that’s good.\nIn this “You Tube” war where truth is hard to discern due to the exaggerated claims of everyone posting, the current Ukrainian offensive does appear to have done well in this regard.\nThe Ukrainians now hold Russian territory as a bargaining chip for negotiations – This is a huge development.\nProvides morale boost for Ukrainian forces, nation and international supporters – The success of this offensive has been a huge shot in the arm for Ukraine."}, {"id": "4bfe1fe3-d05f-46f0-af6c-ab680c7e4575", "title": "The Underwater Pipelines That Supplied Fuel For The Allied Invasion Of Normandy", "date": "2024-08-16 00:00", "url": "https://www.yahoo.com/news/underwater-pipelines-supplied-fuel-allied-232237301.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "This pipeline network, known as the Government Pipeline Storage System (GPSS) pipeline, formed the backbone of the PLUTO pipelines.\nThe PLUTO pipelines were not, it should be said, the main means by which petroleum was to be supplied to the continent in this scenario.\nLibrary of Congress via Wikimedia Commons A map of the PLUTO pipelines.\nWork on the PLUTO pipeline relied on the Allies capturing Cherbourg harbor intact in only eight days.\nIn May 1945, Churchill himself suggested that Operation PLUTO was “a wholly British achievement and a piece of amphibious engineering skill of which we may well be proud.”Ultimately, Operation PLUTO was less successful than the British authorities envisioned in 1942 and 1943."}, {"id": "393edebc-791f-48b1-a1cc-7b5501636acf", "title": "Royal Family LIVE :  Real danger  of Harry and Meghan Colombia trip | Royal | News", "date": "2024-08-16 07:45", "url": "https://www.express.co.uk/news/royal/1936750/royal-family-live-prince-harry-meghan-markle-colombia-trip-latest", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Meghan Markle gave a heartfelt speech about online safety at a panel discussion on Day 1 of her and Prince Harry's trip to Colombia.\nDuring her speech, Meghan urged social media trolls to \"think\" what their \"parents or grandparents taught them\" when it comes to making \"cruel\" comments online.\nThe Duchess said: \"Maybe your grandmother used to say it to you, ‘if you don’t have anything nice to say, don’t say anything at all’.\nThe digital age has almost created a culture where if you don’t have anything cruel to say, don't say anything at all.\nShe added: \"We should model how we want our kids to be raised and for the world in which we raise them."}, {"id": "bacf25eb-1bf7-4399-aa5c-b537173d3c5f", "title": "How united kingdom Challenger 2 tanks are helping Ukraine in Kursk incursion – Firstpost", "date": "2024-08-16 09:15", "url": "https://www.firstpost.com/explainers/how-uk-challenger-2-tanks-are-helping-ukraine-in-kursk-incursion-13805171.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "British Challenger 2 tanks are playing a key role in Ukraine’s audacious cross-border raid into Russia’s Kursk Oblast, marking a significant escalation in the conflict.\nThe Challenger 2 tanks have been sparingly used by Ukrainian forces, largely due to their specific design and operational limitations.\nFile Image/ReutersA Ukrainian Challenger 2 crew member, speaking to UK’s The Sun, described the tank as a “sniper rifle among tanks” due to its accuracy.\nAdvertisementAs of March 2024, Ukrainian media reported that only seven of the original 14 Challenger 2 tanks remain in combat-ready condition.\nFile Image/ReutersDespite their symbolic and tactical significance, the Challenger 2 tanks face operational challenges that limit their effectiveness."}, {"id": "b276dc2b-51f5-4363-ac0d-e8a1101b5ea9", "title": "The Challenge star Theo Campbell claims he and castmate  wanted to fight  during Season 40", "date": "2024-08-16 03:45", "url": "https://www.monstersandcritics.com/tv/reality-tv/the-challenge-star-theo-campbell-claims-he-and-castmate-wanted-to-fight-during-season-40/", "domain": "monstersandcritics.com", "domain_classification": "Unknown", "message": "Each squad would lose one man and one woman, based on the worst-performing competitors and whoever the daily challenge winners opted to send in against them.\nNurys and Theo finished last in the daily challenge, so they would automatically compete in their team’s eliminations.\nSince Horacio Gutierrez and Michele Fitzgerald were the Era 4 daily challenge winners, they decided who went against Nurys and Theo.\nLater, Paulie and Theo got in one another’s faces at The Challenge house, including that infamous kiss Paulie planted on Theo.\nViewers last saw Paulie on The Challenge: USA 2 on CBS, and Theo finally returned for The Challenge: World Championship on Paramount+."}, {"id": "a9ca07a3-85bc-4c02-b609-4dbf006a83c9", "title": "Hyped Modern Warfare Remastered Mod Killed 1 Day Before Launch", "date": "2024-08-16 02:15", "url": "https://kotaku.com/mw2-h2m-mod-activision-cease-and-desist-killed-steam-pc-1851623649", "domain": "kotaku.com", "domain_classification": "Unknown", "message": "The highly anticipated fan mod for Call of Duty 4: Modern Warfare Remastered was focused on recreating and remastering the online multiplayer of Modern Warfare 2 for PC players.\nThis Modern Warfare 3 Gameplay Feature Spices Up A Weak Campaign CC Share Subtitles OffEnglish view video This Modern Warfare 3 Gameplay Feature Spices Up A Weak CampaignThis Modern Warfare 3 Gameplay Feature Spices Up A Weak Campaign CC Share Subtitles OffEnglish This Modern Warfare 3 Gameplay Feature Spices Up A Weak CampaignCoD4: MW Remastered launched in 2016 and included the original campaign as well as a remastered version of that game’s beloved multiplayer mode.\nHowever, when Modern Warfare 2 Remastered arrived in 2020, it only included the campaign and didn’t feature any online multiplayer.\nSo many people bought MW Remastered because of the mod that it jumped into the top five best-selling games on Steam.\nCurrently, MW Remastered has a “mostly negative” review status on Steam."}, {"id": "4f05816a-d258-4ead-ae07-341d3720c376", "title": "Asia Pacific Wire and Cable Market to Reach USD 56 . 62 Billion", "date": "2024-08-16 08:15", "url": "https://www.openpr.com/news/3624826/asia-pacific-wire-and-cable-market-to-reach-usd-56-62-billion", "domain": "openpr.com", "domain_classification": "Unknown", "message": "Asia Pacific Wire and Cable Market to Reach USD 56.62 Billion by 2030, Driven by a 7.2% CAGR as per Stellar Market ResearchAsia Pacific Wire and Cable Markethttps://www.stellarmr.com/report/req_sample/asia-pacific-wire-and-cable-market/2355https://www.stellarmr.com/report/req_sample/asia-pacific-wire-and-cable-market/2355https://www.stellarmr.com/report/asia-pacific-wire-and-cable-market/2355https://www.stellarmr.com/report/APAC-Dry-Mix-Mortar-Market/1245https://www.stellarmr.com/report/APAC-Floor-Grinding-Machine-Market/1246https://www.stellarmr.com/report/APAC-In-Flight-Catering-Services-Market/1247https://www.stellarmr.com/report/Asia-Pacific-Insulin-Pump-Market/1248https://www.stellarmr.com/report/APAC-Architectural-Acoustic-Panels-Market/1249𝐄𝐬𝐭𝐢𝐦𝐚𝐭𝐞𝐝 𝐑𝐞𝐯𝐞𝐧𝐮𝐞 𝐆𝐫𝐨𝐰𝐭𝐡:𝐀𝐬𝐢𝐚 𝐏𝐚𝐜𝐢𝐟𝐢𝐜 𝐖𝐢𝐫𝐞 𝐚𝐧𝐝 𝐂𝐚𝐛𝐥𝐞 𝐌𝐚𝐫𝐤𝐞𝐭 size was valued at USD 34.8 Bn.\nby 2030, at a CAGR of 7.2%.𝐀𝐬𝐢𝐚 𝐏𝐚𝐜𝐢𝐟𝐢𝐜 𝐖𝐢𝐫𝐞 𝐚𝐧𝐝 𝐂𝐚𝐛𝐥𝐞 𝐌𝐚𝐫𝐤𝐞𝐭 𝐎𝐯𝐞𝐫𝐯𝐢𝐞𝐰:The Asia Pacific wire and cable market is experiencing robust growth, driven by several dynamic factors within the region's economic landscape.\nAdditionally, investments in smart networks are promoting more efficient use of energy resources.Infrastructure development is a major growth driver for the Asia Pacific wire and cable market.\n@𝐖𝐡𝐚𝐭 𝐢𝐬 𝐀𝐬𝐢𝐚 𝐏𝐚𝐜𝐢𝐟𝐢𝐜 𝐖𝐢𝐫𝐞 𝐚𝐧𝐝 𝐂𝐚𝐛𝐥𝐞 𝐌𝐚𝐫𝐤𝐞𝐭 𝐒𝐞𝐠𝐦𝐞𝐧𝐭𝐚𝐭𝐢𝐨𝐧?by VoltageLowHighExtra highby InstallationOverheadUndergroundby End UserAerospace & DefenceAutomotiveBuilding & ConstructionOil & GasEnergy & PowerIT & Telecommunication𝐒𝐨𝐦𝐞 𝐨𝐟 𝐭𝐡𝐞 𝐜𝐮𝐫𝐫𝐞𝐧𝐭 𝐩𝐥𝐚𝐲𝐞𝐫𝐬 𝐢𝐧 𝐭𝐡𝐞 𝐀𝐬𝐢𝐚 𝐏𝐚𝐜𝐢𝐟𝐢𝐜 𝐖𝐢𝐫𝐞 𝐚𝐧𝐝 𝐂𝐚𝐛𝐥𝐞 𝐌𝐚𝐫𝐤𝐞𝐭 𝐚𝐫𝐞:ASK Automotive Pvt.\n3, Kothrud, Pune,Pune, Maharashtra, 411029sales@stellarmr.com𝐀𝐛𝐨𝐮𝐭 𝐒𝐭𝐞𝐥𝐥𝐚𝐫 𝐌𝐚𝐫𝐤𝐞𝐭 𝐑𝐞𝐬𝐞𝐚𝐫𝐜𝐡:Stellar Market Research is a multifaceted market research and consulting company with professionals from several industries."}, {"id": "a5e7f471-d2ff-4337-92f8-b77e5fbc9ec2", "title": "Asia - Pacific Physical Security Market Set to Reach $90 , 954", "date": "2024-08-16 06:15", "url": "https://www.openpr.com/news/3624485/asia-pacific-physical-security-market-set-to-reach-90-954", "domain": "openpr.com", "domain_classification": "Unknown", "message": "Asia-Pacific dominated the video surveillance market, with China holding a significantly higher share.\nIn addition, China is home to some of the world's largest makers of video surveillance products, such as Division, Huawei, and Dahua.\nBy component, in 2019, the services segment dominated the Asia-Pacific physical security market size.\nCountry wise, the Asia-Pacific physical security market was dominated by China.\nAllied Market Research provides global enterprises as well as medium and small businesses with unmatched quality of \"Market Research Reports\" and \"Business Intelligence Solutions.\""}, {"id": "a87e52e5-c225-49a4-a961-026fae1a5468", "title": "Massive new Navy ship leaves San Diego Bay for its first sea trials", "date": "2024-08-16 00:00", "url": "https://www.sandiegouniontribune.com/2024/08/15/massive-new-navy-ship-leaves-san-diego-bay-for-its-first-sea-trials/", "domain": "sandiegouniontribune.com", "domain_classification": "Unknown", "message": "The USNS Robert E. Simanek, a 784-foot expeditionary sea base, left the General Dynamics-NASSCO shipyard in San Diego Bay on Wednesday for its first sea trial, considered an important step in preparing a vessel for full service.\nThe Simanek is the fifth ESB that NASSCO has built for the Navy, which intends to use the vessels to help deploy troops and equipment in areas of the world where the U.S. doesn’t have easy access to land bases and seaports.\nThe ship carries the designation USNS because it is a non-commissioned vessel that will be operated for the Navy by a civilian crew under the Military Sealift Command.\nNASSCO said the ship was named in honor of the late Robert Ernest Simanek, a private first class Marine who was awarded the Medal of Honor for shielding fellow Marines during a grenade attack in the Battle of Bunker Hill during the Korean War."}, {"id": "35f78b2e-5a0d-4d09-9d8e-71687903fe2d", "title": "Trump says presidential civilian award is  better  than top military honor whose recipients are  dead  or  hit  by bullets", "date": "2024-08-16 06:30", "url": "https://www.yahoo.com/news/trump-says-presidential-civilian-award-060540477.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Trump says presidential civilian award is 'better' than top military honor whose recipients are 'dead' or 'hit' by bulletsPresident Donald Trump presents Miriam Adelson, philanthropist and wife of billionaire Sheldon Adelson, with the Presidential Medal of Freedom in the East Room of the White House on Nov. 16, 2018.\n“I watched Sheldon sitting so proud in the White House when we gave Miriam the Presidential Medal of Freedom,\" Trump said at his New Jersey resort.\nIt’s the equivalent of the Congressional Medal of Honor,\" Trump continued, referring to the highest military honor bestowed for valor in combat.\n\"But civilian version, it’s actually much better because everyone [who] gets the Congressional Medal of Honor, they're soldiers.\nThey’re either in very bad shape because they’ve been hit so many times by bullets or they’re dead,\" Trump concluded."}, {"id": "1e389090-fb78-410f-bb4a-eebb105a6794", "title": "War Stocks Still a Buy $LMT $NOC $RTX $BA", "date": "2024-08-16 02:15", "url": "https://www.livetradingnews.com/225647-225647.html", "domain": "livetradingnews.com", "domain_classification": "Unknown", "message": "Stable Revenue Streams: Unlike many sectors, defense companies enjoy a relatively predictable revenue stream due to government contracts.\nThis scenario has investors eyeing defense stocks as a hedge against rising oil prices and broader conflict.\nThis scenario has investors eyeing defense stocks as a hedge against rising oil prices and broader conflict.\nMarket Sentiment:Recent posts on X (formerly Twitter) highlight a mixed sentiment but a clear trend towards defense stocks.\nAs long as geopolitical tensions persist, defense stocks are likely to remain a strategic choice for investors looking for resilience amidst global uncertainty."}, {"id": "87942f3d-a060-433a-a3a7-de20c0e9a7f4", "title": "Putin promised poorly - trained conscripts wouldnt be sent to war . Now the front line has come to them", "date": "2024-08-16 06:45", "url": "https://www.cnn.com/2024/08/16/europe/russia-putin-war-ukraine-intl-latam/", "domain": "cnn.com", "domain_classification": "International", "message": "CNN —Russian President Vladimir Putin made a big promise when he launched his war on Ukraine: conscripts would not be involved in combat.\nRussian conscripts called up for military service depart for garrisons from a recruitment centre in Bataysk, Russia on May 16, 2024.\nUkrainian military chief Oleksandr Syrskyi has said that Ukrainian troops have advanced 35 kilometers (21.7 miles) through Russian defenses since the incursion started.\nBut while there seems to be outrage over their deployment, this is not the first time Russian conscripts were found to be fighting in Putin’s war on Ukraine.\nThe Russian military then claimed the conscripts had been withdrawn and returned to Russia."}, {"id": "db9ad327-c161-4f07-abad-2c7e9e614fdf", "title": "Putin promised poorly - trained conscripts wouldnt be sent to war . Now the front line has come to them", "date": "2024-08-16 06:45", "url": "https://edition.cnn.com/2024/08/16/europe/russia-putin-war-ukraine-intl-latam/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "CNN —Russian President Vladimir Putin made a big promise when he launched his war on Ukraine: conscripts would not be involved in combat.\nRussian conscripts called up for military service depart for garrisons from a recruitment centre in Bataysk, Russia on May 16, 2024.\nUkrainian military chief Oleksandr Syrskyi has said that Ukrainian troops have advanced 35 kilometers (21.7 miles) through Russian defenses since the incursion started.\nBut while there seems to be outrage over their deployment, this is not the first time Russian conscripts were found to be fighting in Putin’s war on Ukraine.\nThe Russian military then claimed the conscripts had been withdrawn and returned to Russia."}, {"id": "d037cdca-b17b-4ae1-9e8d-d86091f48a6b", "title": "Ukraine swift push into the Kursk region shocked Russia and exposed its vulnerabilities", "date": "2024-08-16 05:15", "url": "https://www.wdio.com/front-page/world-national/ukraines-swift-push-into-the-kursk-region-shocked-russia-and-exposed-its-vulnerabilities/", "domain": "wdio.com", "domain_classification": "Unknown", "message": "In more than a week of fighting, Russian troops are still struggling to drive out the invaders.\nThat includes a 245-kilometer (152-mile) section in the Kursk region.\nUkrainian troops faced no such obstacles entering the Kursk region.\nSyrskyi claims Ukrainian forces advanced across 1,000 square kilometers (390 square miles) of the Kursk region, although it’s not possible to independently verify what exactly Ukrainian forces effectively control.\nRussia responds, but slowlyThe Russian military command initially relied on warplanes and helicopters to try to stop the onslaught."}, {"id": "e149f2a3-5473-4da1-858f-dbe0bc54a93b", "title": "JD Vance Joins Fellow Veterans to Torch Tim Walz for Stolen Valor at Pennsylvania VFW Post", "date": "2024-08-16 01:15", "url": "https://www.breitbart.com/politics/2024/08/15/jd-vance-joins-fellow-veterans-to-torch-tim-walz-for-stolen-valor-at-pennsylvania-vfw-post/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Tim Walz for lying about his military service at a Veterans of Foreign Wars (VFW) post in Pennsylvania on Thursday.\nJD Vance summarizes Freakish Timothy Walz's history of Stolen Valor🔥 Tim Walz said that he carried a weapon in war — he never went to war.\nWhile he was promoted provisionally to command sergeant major, he did not finish the requirements to retain or retire at that rank.\nAs then-command sergeant major of his unit, he was responsible for the enlisted troops in his battalion, about 100 soldiers.\nThis is not about disparaging anybody’s services, including Tim Walz."}, {"id": "cd7aaf62-8e80-48a1-b3b8-7d2dbb46d435", "title": "Wagner Group and the IRGC : The Rise of Self - Sustaining Military Proxies", "date": "2024-08-16 09:15", "url": "https://www.heritage.org/defense/commentary/wagner-group-and-the-irgc-the-rise-self-sustaining-military-proxies", "domain": "heritage.org", "domain_classification": "Unknown", "message": "And the Wagner Group appears to be following a similar path.\nThe Wagner Group is a private military company, owned by one man—Yevgeny Prigozhin.\nJust as the IRGC’s operations have spread from Iran to Syria and beyond, so have Wagner Group operations extended from Ukraine through much of Africa.\nA private military company is not the same as a state-run military, but there is nothing inherently unique about the Wagner Group that separates its activities from those of Iran’s IRGC.\nThe Wagner Group is believed to have been heavily involved with the 2014 Russian invasion and annexation of the Crimean Peninsula."}, {"id": "dfbaf685-0808-4e7f-ade3-ffddf0b12ab9", "title": "Zelenskyy says Ukrainian troops are consolidating control of Russian territory", "date": "2024-08-16 01:30", "url": "https://www.10news.com/world/europe/zelenskyy-says-ukrainian-troops-have-taken-full-control-of-the-russian-town-of-sudzha", "domain": "10news.com", "domain_classification": "Unknown", "message": "Ukrainian President Volodymyr Zelenskyy said Thursday that his country's troops had taken full control of Sudzha, the largest Russian town to fall to Ukraine's forces since the start of their cross-border incursion more than a week ago.\n“The more Russian military presence is destroyed in the border regions, the closer peace and real security will be for our state.\nMeanwhile, Russian forces are keeping up the pressure on the southern and eastern front lines, according to Ukrainian military officials.\nAs of Thursday, the Ukrainian military claims to be holding more than 80 towns and settlements in the Kursk region.\nRussian military bloggers reported that small Ukrainian mechanized groups have continued to probe Russian defenses."}, {"id": "7aa009df-7daf-4be1-be30-7e21a8eedc51", "title": "Cyber - attack could trigger ANZUS treaty , Australia , NZ leaders say", "date": "2024-08-16 03:15", "url": "https://www.9news.com.au/national/anthony-albanese-chris-luxor-affirm-australia-new-zealand-defend-each-other-cyber-attacks/b703d900-9ef3-480e-9d37-ede8feb6dee1", "domain": "9news.com.au", "domain_classification": "Unknown", "message": "A﻿ \"sufficiently severe\" cyber attack on either country could trigger a combined Australia-New Zealand defence response, the prime ministers of both countries said today.\nNew Zealand Prime Minister Christopher Luxon.\n(9News)Luxon confirmed ﻿that the alliance could \"come into play\" in the face of a \"sufficiently severe cyber attack\".\nA \"severe\" cyber attack could provoke a joint Australia-NZ defence response.\n\"Prime Minister Albanese and I agreed to engage closely on this,\" he said."}, {"id": "d38ed72d-60ca-4dab-8d6f-1881e71940a9", "title": "What does Chicago represent for the Democratic National Convention ? ", "date": "2024-08-16 00:30", "url": "https://www.aljazeera.com/news/longform/2024/8/15/what-does-chicago-represent-for-the-democratic-national-convention", "domain": "aljazeera.com", "domain_classification": "International", "message": "But for all the ways Chicago represents Democratic ideals, critics say it has also exemplified the party’s failings and divisions.\nLooming large over the upcoming Democratic National Convention is the spectre of an earlier convention in Chicago that ended in unrest and violence.\nStill, the party assembled in Chicago for its 1968 Democratic National Convention.\nHundreds of demonstrators are expected to gather outside the 2024 convention site to protest Democratic support for Israel’s war in Gaza.\nStill, Cowan said the current optimism surrounding the Harris-Walz campaign may overshadow any protests outside this year’s convention in Chicago."}, {"id": "181b1b02-4204-4118-bc13-a70f24e188ee", "title": "Vicky McClure fans  blown away  as family story aired on Who Do You Think You Are  saddest episode  ", "date": "2024-08-16 01:15", "url": "https://www.nottinghampost.com/news/celebs-tv/vicky-mcclure-fans-blown-away-9487052", "domain": "nottinghampost.com", "domain_classification": "Unknown", "message": "Invalid email Something went wrong, please try again later.\nOur free email updates are the best way to get headlines direct to your inboxSomething went wrong, please try again later.\nOverwhelmed by emotion, the actress broke down, saying: \"It's horrible, horrible, horrible.\"\nAnother shared their admiration: \"Wow, what a man Harry Millership was Rest easy, Harry.\nRIP Harry Millership."}, {"id": "1020b16c-b216-4cc1-8a69-8afb3a8b3954", "title": "LETTER | Tackle greed in Malaysia - the root of corruption", "date": "2024-08-16 04:45", "url": "https://www.malaysiakini.com/letters/715797", "domain": "malaysiakini.com", "domain_classification": "Unknown", "message": "Perhaps it is time to drop the label “corruption” and plainly call it “greed” instead.\nGreed for power, greed for money, greed for unaccounted wealth - greed indeed is the root cause fueling corruption in the country.\nWe need to carve a culture that not only frowns on greed but names and shames greed in its myriad forms that we see all too often in our country.\nUnless and until we have what it takes to expose greed, our war on corruption will remain merely a superficial dressing of a wound that has already taken root so deep in the Malaysian psyche.\nWe need to tackle greed to win this war on corruption."}, {"id": "efc2bd03-8ad3-4b44-9880-7c5d8a288417", "title": "Donnacha Ó Beacháin : Ukraine attack on Russia is risky , but it shows that Putin is not invincible", "date": "2024-08-16 07:00", "url": "https://www.thejournal.ie/readme/ukraine-going-into-russia-6464557-Aug2024/", "domain": "thejournal.ie", "domain_classification": "Unknown", "message": "In this asymmetrical war, Ukraine has regained the initiative after many months of stalemate.\nThis is a defensive measure intended to ease pressure on soldiers defending Ukraine and destroy Russian military capabilities.\nPutin chairs a meeting of government officials to discuss the Ukrainian military incursion in the Belgorod region at the presidential residence, August 12.\nIn the end, the answer to the question ‘who does Russia border?’ is: ‘Russia borders whoever it wants’”.\nUkraine has realised from the beginning that if they simply try to have a symmetric war fighting one to one against Russia, Russia would eventually win in any war of attrition."}, {"id": "6d1919e9-b57e-4025-a329-615b2c1fdbb2", "title": "Air Transportation : Surrounded Soldiers Resupplied by Drones", "date": "2024-08-16 09:30", "url": "http://www.strategypage.com/htmw/htairmo/articles/2024081602443.aspx", "domain": "strategypage.com", "domain_classification": "Unknown", "message": "August 16, 2024: From late April through June this year, a unit of Ukrainian troops surrounded by Russian forces was supplied solely by drones.\nEventually a relief force of Ukrainian troops broke through and enabled the surrounded soldiers to leave the fighting and get some rest.\nThe K-MAX drone can also carry up to four separate sling loads totaling 1,568 kg.\nThe A160T is a two ton helicopter, able to fly under remote control or under its own pre-programmed control.\nIt is unknown if TRV-150C was used for the recent incident where surrounded Ukrainian troops were resupplied by drones during a ten week battle."}, {"id": "08b19528-ad64-4acd-980b-a6bce1912d80", "title": "Sea Screamer : a family legacy of thrills and tradition in Panama City Beach", "date": "2024-08-16 04:45", "url": "https://www.wjhg.com/2024/08/16/sea-screamer-family-legacy-thrills-tradition-panama-city-beach/", "domain": "wjhg.com", "domain_classification": "Unknown", "message": "PANAMA CITY, Fla. (WJHG/WECP) - The Sea Screamer isn’t just any speedboat—it’s the world’s largest, and it’s making waves in Panama City Beach.\nBrought to the area by the Redmond family, this unique attraction offers a blend of thrills, education, and fun for all ages.\n“We play good music, we narrate, we talk about the history of Panama City Beach.\nGarrett Hine, another captain for the Sea Screamer, has a long history with the family.\nFrom dolphin sightings to unforgettable water gun battles, the Sea Screamer offers more than just a ride—it’s a tradition that continues to grow with each season."}, {"id": "3ba05f36-6ceb-4386-9f2e-57f95dfba626", "title": "Zelenskyy says Ukrainian troops have taken full control of the Russian town of Sudzha", "date": "2024-08-16 02:30", "url": "https://www.smdailyjournal.com/news/world/zelenskyy-says-ukrainian-troops-have-taken-full-control-of-the-russian-town-of-sudzha/article_8af1c98a-5b47-11ef-b620-93f23494d8d2.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "503e4587-c0b5-4405-9c2f-117b5b5d87ef", "title": "  Jewish Voices for Trump  coalition formed to combat antisemitism", "date": "2024-08-16 03:00", "url": "https://wset.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "wset.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey Thursday night as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "6dd33a4c-59da-4f28-bc05-a8627c383e31", "title": "  Theyre going loco , Trump says of pro - Palestine protesters", "date": "2024-08-16 04:15", "url": "https://wlos.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "wlos.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey Thursday night as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "4ebd843e-ba63-4b81-9b92-da933de5d968", "title": "Russia prioritises its offensive in Donetsk Oblast over defence near Kursk – ISW", "date": "2024-08-16 06:15", "url": "https://www.yahoo.com/news/russia-prioritises-offensive-donetsk-oblast-034646913.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Experts from the Institute for the Study of War have noted that the Russians continue to maintain a relatively high pace of offensive in Ukraine’s Donetsk Oblast, despite the operation of Ukraine's defence forces in Russia’s Kursk Oblast, and prioritise their offensive operations in Ukraine’s east overall.\nSource: ISWQuote: \"Russian forces are maintaining their relatively high offensive tempo in Donetsk Oblast, demonstrating that the Russian military command continues to prioritise advances in Ukraine’s east even as Ukraine is pressuring Russian forces within Kursk Oblast.\"\nQuote: \"Geolocated footage published on 14 and 15 August indicates that Russian forces recently advanced east of Pokrovsk within Hrodivka and southeast of Pokrovsk within Mykolaivka, Zhelanne and Orlivka, and ISW assesses that Russian forces likely seized Orlivka and Zhelanne.\"\nMore details: It was also reported that Russian troops had continued mechanised assaults near Donetsk over the past few weeks.\nQuote: \"ISW continues to assess that the Russian military command is pulling select elements of Russian irregular units from Donetsk Oblast to address the Ukrainian incursion in Kursk Oblast but will likely be extremely averse to pulling Russian military units engaged in combat from priority sectors in Donetsk Oblast out of concerns about slowing the tempo of Russian operations in these areas.\""}, {"id": "18ac6f07-96c9-4659-b4e4-1b1dccde8404", "title": "Israel has hit a wall in Gaza , some US officials say , as civilian deaths mount", "date": "2024-08-16 03:45", "url": "https://www.yahoo.com/news/israel-hit-wall-gaza-us-231345752.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel has hit a wall in Gaza, some US officials say, as civilian deaths mountWASHINGTON − Israel has achieved most of its battlefield aims against Hamas in Gaza, but is unlikely to eliminate the militant movement by continuing combat operations that have cost an estimated 40,000 lives, current and former U.S. officials say.\nIranian officials have said a Gaza cease-fire would temper their promised response to the assassination, which they blame on Israel.\nWhile U.S. arms sales continue, some officials are questioning whether Israel’s military has hit a wall in Gaza.\n“There is no such thing as total victory in the context of the Gaza war.\"\nThis article originally appeared on USA TODAY: Israel has hit a wall in Gaza, US officials say; deaths hit 40,000"}, {"id": "1addfb4e-39c5-47b0-8f9f-3b205c1d4959", "title": "  Theyre going loco , Trump says of pro - Palestine protesters", "date": "2024-08-16 03:00", "url": "https://ktul.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "ktul.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey Thursday night as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "6d07fddc-5de9-4f1b-bf85-561818c624a3", "title": "Echoes of  68 as Chicago convention looms for Democrats", "date": "2024-08-16 02:00", "url": "https://www.yahoo.com/news/echoes-68-chicago-convention-looms-013600799.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "\"It's not a twin, but an echo,\" David Farber, a University of Kansas history professor and author of the book \"Chicago '68,\" said of circumstances connecting the two conventions.\nHe pointed to the choice of Chicago as a way for Democrats to exorcise the demons of the past.\n\"I thought, 'Oh, the ghost of '68 is really over' -- and then all the protests broke out on university campuses over the Gaza-Israel situation\" and word came that massive demonstrations await the upcoming convention, Farber told AFP.\nAs AFP reported from Chicago just before the 1968 convention opened on August 26, the Democratic Party \"appears more divided than ever.\"\n\"It's more a story of contrasts,\" said historian Frank Kusch who wrote \"Battleground Chicago,\" a book about the 1968 convention."}, {"id": "1a038ed0-193f-45f6-8f3d-4c818746d420", "title": "Mastering Threats Beneath Waves", "date": "2024-08-16 02:00", "url": "https://www.miragenews.com/mastering-threats-beneath-waves-1297291/", "domain": "miragenews.com", "domain_classification": "Unknown", "message": "To help counteract this threat, two Royal Australian Navy sailors recently participated in the Royal Navy's advanced mine warfare course at HMS Collingwood in England.\nWarrant Officer Lockard and Chief Petty Officer Cochrane learned planning considerations, including how to identify areas likely to be mined, best patterns of search to identify targets and best available disposal methods.\n\"The course is designed for us to conduct practical planning for the execution of mine warfare operations,\" Warrant Officer Lockard said.\nBoth sailors are now qualified to work as mine warfare planners within maritime task groups.\n\"I am looking forward to using my new knowledge and skills to overcome challenges with mine countermeasures operations,\" Chief Petty Officer Cochrane said."}, {"id": "a9fa00e3-e65c-43a6-a084-5c73120bb17c", "title": "BBC Who Do You Think You Are ?: Vicky McClure emotional as she says ,  I feel like Im letting them down  ", "date": "2024-08-16 07:00", "url": "https://www.walesonline.co.uk/lifestyle/tv/bbc-who-you-think-you-29749917", "domain": "walesonline.co.uk", "domain_classification": "Unknown", "message": "I know that my great-grandad - I think his name was Harry, fought in the Second World War.\nHe was a prisoner of war in the Japanese war camps, and I believe he died out there, and he’s buried out there, as far as I know.\"\n(Image: BBC)Harry had been a coal miner in Yorkshire before he was called up to enlist as a soldier in the Second World War in 1940.\nDue to secrecy during the war, Harry and his regiment were provided a tropical kit, which would indicate they would be going east, but they weren’t told exactly where.\nIt would be one of the greatest defeats that Britain would suffer in the Second World War."}, {"id": "01a40cd5-8c2b-402f-9ec9-a14d6cf5775e", "title": "Ukraine cross - border incursion challenges Moscow war narrative – but will it shift Russian opinion ? ", "date": "2024-08-16 00:30", "url": "http://www.econotimes.com/Ukraines-cross-border-incursion-challenges-Moscows-war-narrative--but-will-it-shift-Russian-opinion-1684128", "domain": "econotimes.com", "domain_classification": "Unknown", "message": "The attack caught the Russian armed forces by surprise, and they have struggled to eject the Ukrainians from Russian territory.\nUkraine’s invasion of Kursk may shock the Russian leaders – and public – out of their complacency and disrupt the status quo.\nBeyond that crude “rally around the flag” effect, however, the Russian public has not shown any great enthusiasm for the war.\nIn that June poll, 65% blamed the West for starting the war, 11% blamed Ukraine, and only 6% blamed Russia.\nAdrejosons has found that indifference and acquiescence are the prevailing mood in the Russian public."}, {"id": "2ddcf67a-019a-4ddc-993c-4932774d1946", "title": "Big Brother 26 spoilers about who won the Endurance Challenge ( Wall Comp ) to become the Week 5 HOH", "date": "2024-08-16 08:00", "url": "https://www.monstersandcritics.com/tv/reality-tv/big-brother-26-spoilers-about-who-won-the-endurance-challenge-wall-comp-to-become-the-week-5-hoh/", "domain": "monstersandcritics.com", "domain_classification": "Unknown", "message": "The first Big Brother 26 Endurance Challenge was a dud.\nThe Live Feeds waited until after the West Coast had viewed the August 15 episode, and then everyone got to watch the challenge live.\nWho won the Wall Competition on Big Brother 26?\n#BB26 #BBLF pic.twitter.com/t89Id5Tygt — BBAmericaCedricBrooklyn Stan 💜PurpleMG🦋🏈🤘 (@PurpleMG7) August 16, 2024Full Endurance Challenge resultsBelow are the places each houseguest finished in the Endurance Challenge.\nMore from the Big Brother houseA prank war turned gross in the Big Brother house."}, {"id": "79b7dc85-e32b-4b36-a3a0-a52a5a600a03", "title": "  Jewish Voices for Trump  coalition formed to combat antisemitism", "date": "2024-08-16 02:30", "url": "https://fox11online.com/news/nation-world/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "fox11online.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey Thursday night as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "5b06a784-3c35-49bd-8b8a-48b3eb557263", "title": "Kyodo News Digest : Aug . 16 , 2024", "date": "2024-08-16 03:00", "url": "https://english.kyodonews.net:443/news/2024/08/090e6cfcd394-kyodo-news-digest-aug-16-2024.html", "domain": "english.kyodonews.net", "domain_classification": "Unknown", "message": "KYODO NEWS - 4 hours ago - 15:00 | All, World, JapanThe following is the latest list of selected news summaries by Kyodo News.\nThe Japan Meteorological Agency warned of violent winds, mudslides, high waves and flooding, as heavy rain will sharply increase the risk of disaster.\nThe 225-issue Nikkei Stock Average ended the morning session up 1,073.78 points, or 2.92 percent, from Thursday at 37,800.42.\n----------Japan team develops COVID treatment using synthetic immune cellsKYOTO - A research team in Japan has developed immune cells using embryonic stem cells of human origin to treat novel coronavirus infections.\n----------Thai coalition parties to nominate Thaksin's daughter as PM candidateBANGKOK - Thailand's ruling coalition on Thursday decided to nominate Paetongtarn Shinawatra, daughter of former Prime Minister Thaksin Shinawatra, as its candidate for prime minister, her party said."}, {"id": "9e5551b8-da0d-407e-8776-94aa89e31aca", "title": "Biden still believes he would beat Trump if hed stayed in the race : report", "date": "2024-08-16 01:15", "url": "https://www.yahoo.com/news/biden-still-believes-beat-trump-220005136.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "At the time he dropped out of the 2024 presidential race, President Biden believed he could beat former President Trump.\nThe Biden administration would support the elimination of taxes on tipped wages, an idea first proposed by former President Trump, the White House said.\nPresident Biden during the White House Creator Economy Conference in the Indian Treaty Room of the White House in Washington, DC, US, on Wednesday, Aug. 14, 2024.\nFox News Digital reached out to the White House for comment, but did not immediately receive a response.\nOriginal article source: Biden still believes he would beat Trump if he'd stayed in the race: report"}, {"id": "0ecc686b-b21d-4fc9-8008-d94bb0fa8fc0", "title": "Will Kursk attack change Russian public opinion on Ukraine war ? ", "date": "2024-08-16 07:45", "url": "https://www.rte.ie/brainstorm/2024/0816/1465255-kursk-attack-russia-public-opinion/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "The attack caught the Russian armed forces by surprise, and they have struggled to eject the Ukrainians from Russian territory.\nAn overconfident KremlinUkraine's invasion of Kursk may shock the Russian leaders – and public – out of their complacency and disrupt the status quo.\nBeyond that crude \"rally around the flag\" effect, however, the Russian public has not shown any great enthusiasm for the war.\nIn that June poll, 65% blamed the West for starting the war, 11% blamed Ukraine, and only 6% blamed Russia.\nAdrejosons has found that indifference and acquiescence are the prevailing mood in the Russian public."}, {"id": "92de340b-151f-4063-9aff-b4763a15bd1a", "title": "Russia loses another 1 , 330 soldiers in one day", "date": "2024-08-16 06:15", "url": "https://www.yahoo.com/news/russia-loses-another-1-330-045440763.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Russia loses another 1,330 soldiers in one dayStock photo: General Staff of the Armed Forces of UkraineUkraine’s Defence Forces are continuing to inflict losses on Russia as it has lost 1,330 soldiers, 59 artillery systems, 25 armoured combat vehicles and 12 tanks over the past day alone.\nSource: General Staff of the Armed Forces of Ukraine on FacebookDetails: The total combat losses of the Russian forces between 24 February 2022 and 16 August 2024 are estimated to be as follows [figures in parentheses represent the latest losses – ed.\n]:approximately 596,950 (+1,330) military personnel;8,496 (+12) tanks;16,461 (+35) armoured combat vehicles;16,927 (+59) artillery systems;1,159 (+5) multiple-launch rocket systems;922 (+0) air defence systems;367 (+0) fixed-wing aircraft;328 (+0) helicopters;13,659 (+61) strategic and tactical UAVs;2,429 (+1) cruise missiles;28 (+0) ships and boats;1 (+0) submarines;22,848 (+73) vehicles and tankers;2,829 (+16) special vehicles and other equipment.\nThe information is being confirmed.\nSupport UP or become our patron!"}, {"id": "00987da8-e5bd-415d-a3c2-4fcb238b44bd", "title": "This Day in History", "date": "2024-08-16 07:45", "url": "https://www.smdailyjournal.com/lifestyle/this-day-in-history/article_edf67788-58ef-11ef-b901-c349f44161cb.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle.\nA new puzzle every day, seven days a week!"}, {"id": "3f2ac3e4-6bfa-4ff4-810a-d16cdda557b6", "title": "  Jewish Voices for Trump  coalition formed to combat antisemitism", "date": "2024-08-16 02:00", "url": "https://kval.com/news/beyond-the-podium/jewish-voices-for-trump-coalition-formed-to-combat-antisemitism-2024-presidential-election-politics", "domain": "kval.com", "domain_classification": "Unknown", "message": "A 95-year-old Auschwitz survivor was among guests at an event in New Jersey Thursday night as former President Donald Trump launched following recent attacks on members of the Jewish community.\n\"They're going loco,\" Trump said of pro-Palestine protesters, using the Spanish word that means crazy or unhinged.\nIt’s with the Republican Party, and with President Donald J. Trump,\" the release continued.\n\"'Jewish Voices for Trump' comes together with one voice, to make sure that President Donald J. Trump becomes the next President of the United States.\"\nTrump, meanwhile, reportedly suggested Vice President Kamala Harris “doesn’t like Jewish people” even though her husband, second gentleman Doug Emhoff, is Jewish."}, {"id": "70ca4e0e-fba6-4ff0-acd7-9fd2e60bedcb", "title": "Ukraine says over 100 Russian soldiers surrendered in one go after being abandoned by their commanders in Kursk", "date": "2024-08-16 06:30", "url": "https://www.yahoo.com/news/ukraine-says-over-100-russian-053441659.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine says over 100 Russian soldiers surrendered in one go after being abandoned by their commanders in KurskUkraine says over 100 Russian soldiers surrendered in one go after being abandoned by their commanders in KurskUkraine said it seized 102 Russian soldiers on Wednesday in a single sweep in Kursk.\nUkrainian intelligence told local media that its special forces had seized a fortified Russian base in Kursk that day.\nUkraine said that its forces in Kursk captured 102 Russian soldiers in one sitting on Wednesday, marking the largest group it's taken prisoner since the war began.\nThey had \"made the right decision and surrendered,\" wrote the agency, which aims to persuade Russian troops to defect or desert.\nA caption for the video said the Russian soldiers had been abandoned by the commanders, alleging that the latter fled to avoid capture themselves."}, {"id": "3fc09cdf-0bfd-4bbd-af99-7840588b7084", "title": "Ukraine says over 100 Russian soldiers surrendered in one go after being abandoned by their commanders in Kursk", "date": "2024-08-16 06:30", "url": "https://www.yahoo.com/news/ukraine-says-over-100-russian-053441740.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukraine says over 100 Russian soldiers surrendered in one go after being abandoned by their commanders in KurskUkraine says over 100 Russian soldiers surrendered in one go after being abandoned by their commanders in KurskUkraine said it seized 102 Russian soldiers on Wednesday in a single sweep in Kursk.\nUkrainian intelligence told local media that its special forces had seized a fortified Russian base in Kursk that day.\nUkraine said that its forces in Kursk captured 102 Russian soldiers in one sitting on Wednesday, marking the largest group it's taken prisoner since the war began.\nThey had \"made the right decision and surrendered,\" wrote the agency, which aims to persuade Russian troops to defect or desert.\nA caption for the video said the Russian soldiers had been abandoned by the commanders, alleging that the latter fled to avoid capture themselves."}, {"id": "1f2a1cef-7c61-47fa-87d9-edd1d277fb04", "title": "Six Jews Youths Arrested Trying to Mark 19 Years Since Expulsion from Gaza | The Jewish Press - JewishPress . com | Jewish News Syndicate ( JNS ) | 12 Av 5784 – Friday , August 16 , 2024", "date": "2024-08-16 01:30", "url": "https://www.jewishpress.com/news/israel/settlements-israel/six-jews-youths-arrested-trying-to-mark-19-years-since-expulsion-from-gaza/2024/08/16/", "domain": "jewishpress.com", "domain_classification": "Unknown", "message": "Israeli security forces arrested six youths after dozens tried to breach the border with the Gaza Strip to conduct a Jewish prayer service there on Thursday morning.\nAdvertisementThe six who were detained were part of a group of some 40 people who tried to enter the Strip from the Erez Crossing with northern Gaza.\nThe attempt to enter the enclave came as resettlement activists marked 19 years since the military carried out Israel’s disengagement from the Gaza Strip, in which more than 8,000 Jews were forcibly removed from their homes.\n“Only a Jewish Gaza will remove the threats of missiles and hostage-taking from Gaza and bring security to the residents of the south and the entire country,” the anonymous Israeli worshipper continued.\n“If you mean resettling Gaza, … it was never in the cards, and I said so openly."}]