[{"id": "66c9cc64-ed6e-4445-b038-74a5b88e0bce", "title": "MTA members divided over union injection into debate over Israel - Hamas war", "date": "2024-05-18 00:15", "url": "https://www.bostonglobe.com/2024/05/17/metro/mta-anti-semitic-jewish-palestine/", "message": "Garcia’s support for the MTA withered with each new action, as she and other Jewish members repeatedly raised concerns about antisemitism.\nAdvertisementThe division over the Israel-Hamas war is pitting members against one another in the state’s largest teachers union.\nThe MTA is far from being alone in contending with differing viewpoints on the Israel-Hamas war among its members.\nThe MTA first officially waded into the Israel-Hamas war on Nov. 4, when its executive board called for a cease-fire between Israel and Hamas.\nMany Jewish members urged the MTA to scrap the webinar."}, {"id": "ae79e999-61b4-49e2-8070-aaa4635569d5", "title": "Guest Opinion : Showing up for those with whom we dont agree", "date": "2024-05-18 02:00", "url": "https://www.sentinelsource.com/opinion/op-ed/guest-opinion-showing-up-for-those-with-whom-we-dont-agree/article_f4ede4ea-2875-565d-aaf2-80d157606e49.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "76bd1f05-6dc4-43ff-85af-b506a759bf98", "title": "Faith leaders urge UCSD to bar Islamophobic speakers from campus", "date": "2024-05-18 02:15", "url": "https://www.yahoo.com/news/faith-leaders-urge-ucsd-bar-000819144.html", "message": "SAN DIEGO (FOX 5/KUSI) — A coalition of faith leaders gathered at UC San Diego on Friday to call on the university’s administration to do better to address Islamophobia on campus after a student organization hosted a controversial speaker known for anti-Muslim rhetoric.\nThe collective of faith leaders, which included Islamic, Christian and Jewish clergy, described his presence on campus as an exemplar of a larger rise in Islamophobia spurred by the Israel-Hamas war that has made Muslim UCSD students feel unsafe on campus.\n“We are here to tell the UCSD Administration, the chancellor, that these speakers are not welcome,” said Taha Hassane, imam of the Islamic Center of San Diego.\nHundreds of campus community members have also begun to call for Khosla’s resignation over his response to the encampment.\nFor the latest news, weather, sports, and streaming video, head to FOX 5 San Diego & KUSI News."}, {"id": "b65efeae-1460-4774-a6e8-8dde7a9ab27b", "title": "College Professors Are Being Fired for Activism on Gaza War", "date": "2024-05-18 04:45", "url": "https://theintercept.com/2024/05/16/university-college-professors-israel-palestine-firing/", "message": "That’s because many of the professors most supportive of Palestine don’t have jobs anymore.\nFrom campus to campus, professors have defended students’ right to protest, but when scholars themselves espouse support for Palestine and opposition to the Israeli state, professional consequences have frequently been grave.\nBy and large, professors facing job loss and suspensions over Palestine have brought these allegations into public view by speaking out themselves.\nAll of them have been in support of the Palestinian cause.”We are at the dawn of a “new McCarthyism,” Levy said.\nIn the last months, school administrators called in riot cops to clear student encampments and arrest thousands at Columbia University, City College of New York, Emerson College, Emory University, New York University, the University of Austin at Texas, and more."}]