[{"id": "7db02a79-42b9-4841-962f-300b42597b59", "title": "One Killed , 11 Wounded In Israeli Airstrikes On Lebanon", "date": "2024-08-20 02:15", "url": "https://menafn.com/1108577912/One-Killed-11-Wounded-In-Israeli-Airstrikes-On-Lebanon", "domain": "menafn.com", "domain_classification": "Unknown", "message": "(MENAFN- Nam News Network) BEIRUT/JERUSALEM, Aug 20 (NNN-NNA) – A member of Lebanese Hezbollah, was killed and 11 other people wounded yesterday, in Israeli in eastern and southern Lebanon, Lebanese military sources said.\nThe Israeli military confirmed in a statement that its aircraft hit Hussein Ali Hussein, identified by the Israeli military as a militant, in Deir Qanoun.\nHussein was a key member of Hezbollah's Rocket and Missile Unit in the area of Yarine in southern Lebanon, according to the Israeli military.\nThe injured were transported by ambulance to Tebnine Government Hospital in southern Lebanon,” said the sources.\nIn the Baalbek area of eastern Lebanon, six people were injured in an initial report, as a result of Israeli raids that targeted three Hezbollah sites, added the sources."}, {"id": "f9a42124-42ee-4251-9140-b4c5662e2e64", "title": "Watch : Explosions light up the sky as Israel strikes Hezbollah weapons depot", "date": "2024-08-20 11:30", "url": "https://www.telegraph.co.uk/world-news/2024/08/20/israel-air-strikes-lebanon-hezbollah-weapons-depot/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Fighter jets also targeted and killed Hussein Ali Hussein, a member of Hezbollah’s rocket and missile unit, in the area of Deir Qanoun, in southern Lebanon.\nHezbollah is yet to follow through on its threat to launch a significant attack on Israel in response to the assassination of Fuad Shukr, a top Hezbollah commander, in Beirut last month.\nThe terror group is seemingly waiting to see if Hamas and Israel agree a ceasefire deal, but Hezbollah continues to launch daily rocket and drone attacks at northern Israel.\nFor its part, Israel has expanded its areas of attacks in Lebanon.\nAn IDF official told The Telegraph that Israel believes Hassan Nasrallah, the Hezbollah leader, will still “react” to the killing of Shukr."}, {"id": "88c4f82a-fabd-452d-b7db-f37c40baac89", "title": "", "date": "2024-08-20 00:00", "url": "http://www.israelnationalnews.com/news/394872", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "IAF fighter jets on Monday evening struck a number of Hezbollah weapons storage facilities in the area of Beqaa in Lebanon.\nIn addition, an IAF aircraft eliminated the terrorist Hussein Ali Hussein in the area of Deir Qanoun in southern Lebanon.\nEarlier on Monday, IDF forces identified a terrorist cell operating from a Hezbollah military structure in the area of Tayibe in southern Lebanon.\nIAF fighter jets struck the structure in which the terrorists were operating.\nOvernight, Air Force fighter jets attacked Hezbollah military structures in the areas of Ayta al-Shaab, Beit Lif, and Houla in southern Lebanon."}, {"id": "a1c61ef6-daa9-41aa-ab90-76e1aacbc7bf", "title": "Hezbollah says Israeli forces suffer casualties after infiltration in Lebanon repelled", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240819-presstv09.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah says Israeli forces suffer casualties after infiltration in Lebanon repelledIran Press TVMonday, 19 August 2024 7:31 AMFighters from the Lebanese Hezbollah resistance movement have shelled and fired a barrage of rockets at a group of Israeli forces as they were attempting to sneak across the border from the northern part of the 1948 occupied territories into southern Lebanon.\nThe attack caused casualties and forced the Israeli troops to retreat, the resistance group noted.\nHezbollah fighters also targeted and destroyed spying devices at the Ruwaisat al-Alam site in the occupied Lebanese Kfar Shuba hills with artillery shells.\nHezbollah resistance forces also targeted espionage devices at the Misgav Am site, and shelled the Rahib site.\nTwo Israeli wars waged against Lebanon in 2000 and 2006 were met with strong resistance from Hezbollah, resulting in the retreat of the regime in both conflicts."}, {"id": "cb373d9b-131f-4b66-95d1-ec858822dc69", "title": "Blinken says Israel is prepared to compromise with Hamas to secure a deal to end the Gaza conflict boosting hopes of piece", "date": "2024-08-20 01:15", "url": "https://www.dailymail.co.uk/news/article-13759601/Blinken-says-Israel-prepared-compromise-Hamas-secure-deal-end-Gaza-conflict-boosting-hopes-piece.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Israel is prepared to compromise with Hamas to secure a deal to end the Gaza conflict, the US Secretary of State indicated last night.\nMr Blinken said last night: 'In a very constructive meeting, prime minister Netanyahu confirmed to me that Israel supports the bridging proposal.\nFor his part, Mr Netanyahu said the talks with Mr Blinken had been 'positive' and 'conducted in a good spirit'.\nToday, Mr Blinken is expected to travel to Egypt for further talks to end the fighting.\nIsrael is also braced for more suicide bombings by Hamas following a suicide bombing in Tel Aviv on Sunday."}, {"id": "10c00625-9a2a-4a2e-a249-d2fe40b19ed6", "title": "Militias Signal De - Escalation with the U . S ., Return to Cosmetic Israel Strikes", "date": "2024-08-20 00:00", "url": "https://www.washingtoninstitute.org/policy-analysis/militias-signal-de-escalation-us-return-cosmetic-israel-strikes", "domain": "washingtoninstitute.org", "domain_classification": "Unknown", "message": "The self-styled Iraqi \"resistance\" has hinted at a desire to end the tit-for-tat sequence of strikes with the United States and return to cost-free counter-Israel operations.\nIn that event our response will not be stopped by restrictions\" (Figure 1).This message followed another round of U.S. strikes the day before against militias belonging to the self-styled muqawama (resistance) (Figure 2).\nIran blames Israel for the assassination of Ismail Haniyeh right under its nose and may soon respond with military attacks.\nThe Tansiqiya seems to be warning the United States not to use Iraqi airspace to strike Iran if said retaliation unfolds.\n(See Militia Spotlight's attack tracker for a database covering this and other attacks in Iraq and Syria.)"}, {"id": "74e49c7c-e9f8-43d3-8b52-114a057bd44e", "title": "Israeli paratrooper killed after misfire by IDF jet", "date": "2024-08-20 10:00", "url": "https://www.thejc.com/news/israel/israeli-paratrooper-killed-after-misfire-by-idf-jet-k1yn2vsx", "domain": "thejc.com", "domain_classification": "Unknown", "message": "An Israel Defence Forces soldier was killed by a missile that malfunctioned during an airstrike in the southern Gaza Strip on Monday, the military announced.\nThe slain soldier was named as Lt. Shahar Ben Nun, 21, of the Paratrooper Brigade’s reconnaissance unit, from Petah Tikva.\nAccording to a preliminary probe, Israeli Air Force fighter jets fired two missiles at separate targets in the Khan Younis area early Monday morning.\nOne of the missiles malfunctioned and struck a multi-story building where the paratroopers were stationed, about 300m away from the intended target.\nIt comes after two Israeli soldiers were killed by a roadside bomb in central Gaza on Saturday."}, {"id": "34c36167-872e-4627-9977-bdde81915f6a", "title": "Israel Hits Hezbollah Arms Depots in Baalbek", "date": "2024-08-20 10:00", "url": "https://dailystar.com.lb/israel-hits-hezbollah-arms-depots-baalbek/", "domain": "dailystar.com.lb", "domain_classification": "Unknown", "message": "On Monday, Israel targeted Hezbollah’s weapons storage facilities deep within eastern Lebanon, according to a source close to Hezbollah, speaking with AFP.\nThis attack occurred far from the southern border, which has been a frequent site of clashes between Hezbollah and Israeli forces.\nThe individual, linked to the Iran-supported group, confirmed that the airstrikes were aimed at Hezbollah’s armories in the Bekaa region.\nAdditionally, Lebanon’s National News Agency reported that three locations in eastern Lebanon were hit by these “enemy Israeli raids” that evening.\nVideos captured at the site depicted a large blaze and several explosions resulting from the strike."}, {"id": "60f4777e-9488-4dc7-9a3c-dba643bf6e1e", "title": "Hezbollah carries out fresh drone , missile attacks on Zionist targets", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240819-irna02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah carries out fresh drone, missile attacks on Zionist targetsIRNA - Islamic Republic News AgencyAug 19, 2024Tehran, IRNA -- The Lebanese Hezbollah has launched a new round of drone and missile attacks on Zionist targets in the northern parts of the occupied territories, local media reported.\nIn a statement issued on Monday, Hezbollah announced that the attacks were conducted in support for the Palestinian resistance in the face of the Zionist invasion.\nThe statement said that Hezbollah fighters targeted a Zionist base with missiles.\nThe resistance group also launched another attack on Al Radar base, completely destroying the spy equipment of the facility.\nZionist media also reported today that Hezbollah drones conducted a strike against a building where the soldiers of the regime were gathering."}, {"id": "f38e89cc-50f9-4586-bba8-7bd9277164ca", "title": "Israel - Hamas war latest : Blinken says  complex issues ,  hard decision remain over cease - fire plan", "date": "2024-08-20 11:00", "url": "https://www.clickondetroit.com/news/2024/08/20/israel-hamas-war-latest-blinken-says-complex-issues-hard-decisions-remain-over-cease-fire-plan/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "He said there are still “complex issues” requiring “hard decisions by the leaders,” without offering specifics.\nThe kibbutz did not provide additional information and the Israeli military did not immediately confirm the information.\nPopplewell was declared dead by the Israeli military in June.\nIsrael’s military announced Buchshtav's death in July.\nAnother Israeli hostage dies in Hamas captivity, his village saysJERUSALEM — Another male hostage has died in Hamas captivity, his communal farming village announced Tuesday."}, {"id": "26466965-f5ce-4f66-b160-69e961ad64f0", "title": "Israel - Hamas war latest : Blinken says  complex issues ,  hard decision remain over cease - fire plan", "date": "2024-08-20 09:15", "url": "https://www.wsls.com/news/2024/08/20/israel-hamas-war-latest-blinken-says-complex-issues-hard-decisions-remain-over-cease-fire-plan/", "domain": "wsls.com", "domain_classification": "Unknown", "message": "He said there are still “complex issues” requiring “hard decisions by the leaders,” without offering specifics.\nThe kibbutz did not provide additional information and the Israeli military did not immediately confirm the information.\nPopplewell was declared dead by the Israeli military in June.\nIsrael’s military announced Buchshtav's death in July.\nAnother Israeli hostage dies in Hamas captivity, his village saysJERUSALEM — Another male hostage has died in Hamas captivity, his communal farming village announced Tuesday."}, {"id": "69bae435-4d32-40b3-a1f4-c102ff027f14", "title": "Report : Hezbollah response against Israel has become imminent", "date": "2024-08-20 14:30", "url": "https://www.naharnet.com/stories/en/307354-report-hezbollah-s-response-against-israel-has-become-imminent", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hezbollah’s “powerful” response to the Dahieh airstrike that killed its military chief Fouad Shukur and six other people “has become imminent, after mediators exhausted the chance to reach a ceasefire and exchange of captives in Gaza,” a Lebanese political leader said.\n“Hezbollah refrained from carrying out the decided strike over the past period to allow the mediators to finalize a settlement based on U.S. President Joe Biden’s initiative and Egypt and Qatar’s proposals, but Israeli PM Benjamin Netanyahu’s intransigence and his insistence on obstructing the negotiations … prevented the success of the Doha talks last week, and will also destroy the last chance to stop the war and return the captives during the Cairo discussions tomorrow,” the political leader told al-Joumhouria newspaper.\nThe Israel-Hezbollah clashes have killed 585 people in Lebanon since October 8, mostly Hezbollah fighters but also including at least 128 civilians, according to an AFP tally.\nOn the Israeli side, including in the annexed Golan Heights, 23 soldiers and 26 civilians have been killed, according to army figures.\nFears of an escalation have mounted since Hezbollah and Iran vowed to respond after an Israeli strike on Beirut last month killed Hezbollah commander Shukur, shortly before an attack in Tehran blamed on Israel killed Hamas political leader Ismail Haniyeh."}, {"id": "f16806be-a756-459a-b45e-c943daea31be", "title": "  Complex issues ,  hard decision remain over Israel - Hamas cease - fire plan : Antony Blinken", "date": "2024-08-20 10:00", "url": "https://www.thehindu.com/news/international/complex-issues-hard-decisions-remain-over-israel-hamas-cease-fire-plan-antony-blinken/article68545890.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "He said there are still “complex issues” requiring “hard decisions by the leaders,” without offering specifics.\nJERUSALEM — Israel’s military said that a barrage of 55 rockets from Lebanon has ignited fires in northern Israel.\nThe kibbutz did not provide additional information and the Israeli military did not immediately confirm the information.\nPopplewell was declared dead by the Israeli military in June.\nIsrael’s military did not immediately confirm the information."}, {"id": "2ac28de8-4314-4188-a96e-e5355de38782", "title": "Israel strikes deep in east Lebanon", "date": "2024-08-20 00:30", "url": "https://tribune.com.pk/story/2489424/israel-strikes-deep-in-east-lebanon", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Israel struck Hezbollah weapons depots on Monday deep in Lebanon's east, a source close to the group told AFP, in a raid confirmed by the Israeli military.\nIt came after an Israeli soldier was killed in northern Israel, amid 10 months of cross-border clashes between Iran-backed Hezbollah and Israel.\n\"Israeli strikes in the (eastern) Bekaa region targeted Hezbollah weapons depots,\" said the source close to Iran-backed Hezbollah, requesting anonymity due to the sensitivity of the matter.\nEarlier on Monday, the Israeli military said a member of its Bedouin Trackers Unit \"fell during combat in northern Israel\".\nIsrael's military said its air force struck \"Hezbollah terrorists\" in the Hula area and \"Hezbollah military structures\" elsewhere in south Lebanon."}, {"id": "6259c0b4-f49b-4d92-a71c-c66a7421d177", "title": "Hezbollah retaliates to Bekaa , Deir Qanoun strikes", "date": "2024-08-20 14:30", "url": "https://www.naharnet.com/stories/en/307362-hezbollah-retaliates-to-bekaa-deir-qanoun-strikes", "domain": "naharnet.com", "domain_classification": "Unknown", "message": "Hezbollah launched Tuesday several rocket salvos at a command center in north Israel, in response to an Israeli strike that targeted a car in Deir Qanoun in the Tyre district the previous day, killing a Hezbollah fighter.\nHezbollah said in a statement it targeted a command center in Ga'aton \"in response to the assassination in Deir Qanoun.\"\nThe Israeli military said it struck a Hezbollah \"rocket launcher\" in Beit Leef and a building used by Hezbollah in Aita al-Shaab.\nLater during the day, Hezbollah targeted the al-Marj post in northern Israel and surveillance equipment in the Jal al-Alam post.\nThe violence has killed 586 people in Lebanon, mostly Hezbollah fighters but also including at least 128 civilians, according to an AFP tally."}, {"id": "706a875c-b163-478d-82d1-a78f0b113c1a", "title": "Hezbollah foils Israeli infiltration attempt on south Lebanon", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240819-irna07.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Hezbollah foils Israeli infiltration attempt on south LebanonIRNA - Islamic Republic News AgencyAug 19, 2024Tehran, IRNA -- The Lebanese resistance movement Hezbollah says it has foiled an infiltration attempt by a group of Israeli forces on southern Lebanon.\nThe movement announced on Monday that Hezbollah fighters fired rockets and mortars at Israeli soldiers, forcing them to retreat.\nSeveral Israeli soldiers were killed and injured, Hezbollah said, without specifying.\nEarlier on Monday, the resistance movement launched drone strikes on several locations in the northern regions of the Israeli-occupied territories.\nThe Lebanese resistance movement says it aims to support the Palestinian people in the war-ravaged territory."}, {"id": "157e3e94-a3bf-4631-98af-006909d8dd67", "title": "Blinken says Israel has agreed to US proposal to close remaining gaps on ceasefire deal and calls on Hamas to do the same", "date": "2024-08-20 00:45", "url": "https://krdo.com/news/2024/08/19/blinken-says-israel-has-agreed-to-us-proposal-to-close-remaining-gaps-on-ceasefire-deal-and-calls-on-hamas-to-do-the-same/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "Despite the claims of Netanyahu’s agreement to the bridging proposal, there are still significant challenges before a deal can actually be reached.\nNot only has Hamas not agreed to the proposal but negotiators are still working on specific details on how an agreement would be implemented.\n“It is time for everyone to get to yes, and to not look for any excuses to say no,” Blinken said.\nHamas said the latest proposal didn’t include a permanent ceasefire and introduced new conditions on the exchange of prisoners, among other issues.\nIn the evening, an Israeli airstrike in central Gaza killed seven members of the same family, medical officials said."}, {"id": "549ae1bf-6263-4989-9a10-e0ccd5e9f96b", "title": "Israel recovers bodies of 6 hostages from Gaza as Blinken tries to advance cease - fire deal", "date": "2024-08-20 11:45", "url": "https://isp.netscape.com/news/world/story/0001/20240820/54dfaddce02c2d3cdf0415b140b3229c", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Blinken visits Gaza mediators in pursuit of cease-fire deal as Hamas, Israel signal challengesJERUSALEM (AP) — U.S. Secretary of State Antony Blinken was visiting fellow mediators Egypt and Qatar as he pressed ahead Tuesday with the latest diplomatic mission to secure a cease-fire in the war in Gaza, even as Hamas and Israel signaled that challenges remain.\nOver 100 hostages were released in exchange for Palestinians imprisoned in Israel during a weeklong cease-fire last year.\nAnother strike killed a mother and her five children in central Gaza.\nThe Israeli military said the strike targeted Hamas militants who had set up a command center inside the school and were planning and launching attacks.\nAssociated Press reporters Wafaa Shurafa in Deir al-Balah, Gaza Strip and Samy Magdy in Cairo contributed to this report."}, {"id": "dd67af60-6e67-4f39-baa3-03fc205e38be", "title": "Taylor Swift meets two young girls injured in Southport knife rampage", "date": "2024-08-20 00:00", "url": "https://www.dailymail.co.uk/news/article-13757901/taylor-swift-wembley-meet-southport-survivors.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Taylor Swift met two young girls at her Wembley gig who were injured in the Southport knife rampage.\nThe Shake It Off singer, 34, invited the two young girls backstage and posed for photos before one of her record breaking shows over the weekend.\nSwift reportedly reached out to the families of the Southport stabbing before she took to the stage at Wembley on Thursday with the gig said to be 'the hardest concert of her career' after the killings.\n'Taylor may not have spoken about Elsie Dot, Alice and Bebe on stage but she has reached out to their families,' an insider said.\nJust days later, Swift was then forced to cancel three gigs in Vienna after police uncovered a foiled ISIS terror plot."}, {"id": "8f656a34-89ba-4c2d-a6c4-e082e5229566", "title": "Republic of Korea - AH - 64E Apache Helicopters", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/wmd/library/news/rok/2024/rok-240819-dsca01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Republic of Korea - AH-64E Apache HelicoptersMedia/Public Contact: pm-cpa@state.govTransmittal No: 24-36WASHINGTON, August 19, 2024 -- The State Department has made a determination approving a possible Foreign Military Sale to the Republic of Korea of AH-64E Apache Helicopters and related elements of logistics and program support for an estimated cost of $3.5 billion.\nThe Defense Security Cooperation Agency delivered the required certification notifying Congress of this possible sale today.\nThe proposed sale will improve the Republic of Korea's capability to meet current and future threats by providing a credible force capable of deterring adversaries and participating in regional operations.\nThe proposed sale of this equipment and support will not alter the basic military balance in the region.\nThere will be no adverse impact on U.S. defense readiness as a result of this proposed sale."}, {"id": "df4d71b8-6e70-4af8-9bc1-efc1519baffb", "title": "Blinken : Current talks  maybe the last  opportunity for Gaza truce", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240819-voa03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Blinken: Current talks 'maybe the last' opportunity for Gaza truceBy VOA News August 19, 2024U.S. Secretary of State Antony Blinken said the latest Gaza cease-fire deal could be the last chance to secure the return of hostages and end the fighting between Hamas and Israel.\nLast month, an Israeli strike near Beirut killed Fuad Shukr, one of Hezbollah's top commanders, shortly before an attack in Tehran killed Hamas political leader Ismail Haniyeh.\nA cease-fire deal is viewed as a way to prevent a larger war in the region.\nHe said it's time for Israel and Hamas to agree to a truce.\nThe basic outline of a cease-fire deal remains the same."}, {"id": "902ef472-887a-4363-88ed-62f7ecf1a78f", "title": "Harris Denounces IDF Attack on Hamas Command - and - Control Center", "date": "2024-08-20 02:15", "url": "https://www.frontpagemag.com/harris-denounces-idf-attack-on-hamas-command-and-control-center/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "On August 10, the IDF fired three precision missiles at one part of the Al-Tabeen school in Gaza that was being used as a command-and-control center by Hamas.\nIt claimed that several of the 19 Hamas combatants the IDF said it had killed at the school had, in fact, been killed weeks before at other locations.\nThese are the figures, remember, put out by Hamas, which has a long record of lying about civilian casualties.\nIs that, as Kamala Harris insists, “far too many” civilian casualties?\nSo it is wrong to describe the latest attack as causing a “disproportionate” number of civilian casualties."}, {"id": "e31cae0a-b426-45fe-b919-b83e9e6845ca", "title": "King Charles meets families and survivors in Southport after dance class attack that ... ", "date": "2024-08-20 13:45", "url": "https://www.lbc.co.uk/news/king-charles-meets-southport-attack-survivors/", "domain": "lbc.co.uk", "domain_classification": "Unknown", "message": "King Charles meets families and survivors in Southport after dance class attack that killed three young girlsKing Charles met with survivors of the Southport attacks.\nPicture: AlamyBy Kit HerenKing Charles has arrived in Southport to meet the families and survivors of the deadly attack in July.\nBebe King, six, Elsie Dot Stancombe, seven, and Alice da Silva Aguiar, nine, died when a knifeman attacked a Taylor Swift dance class.\nThe three girls killed in the Southport stabbing attack are Bebe King, Elsie Dot Stancombe, and Alice Dasilva Aguiar.\nIt comes as Taylor Swift is said to have reached out to the Southport stabbing victims' families privately ahead of her Wembley gig."}, {"id": "5df8e9db-9386-4b55-8b86-cebc06157670", "title": "Taylor Swift Meets Young Girls Affected by Deadly Stabbing", "date": "2024-08-20 14:00", "url": "https://www.marieclaire.com/celebrity/taylor-swift-meets-girls-southport-stabbing-london/", "domain": "marieclaire.com", "domain_classification": "Unknown", "message": "Trigger warning: violenceTaylor Swift invited two young girls affected by the recent Southport, U.K. stabbing to meet her backstage at Wembley Stadium in London.\nA police officer receives flowers to lay at the scene of the deadly stabbing in Southport.\n(Image credit: Getty Images)The stabbing occurred on July 29 during a Taylor Swift-themed dance class in Southport, a town in the North of England.\nAfter the tragedy occurred, Swift wrote on her Instagram Stories, \"The horror of yesterday's attack in Southport is washing over me continuously, and I'm just completely in shock...\nTaylor Swift reacts to the Southport attack on Instagram."}, {"id": "1e37867d-e1b1-42c6-9e0c-b73da39dac4d", "title": "King Charles III To Visit Southport Three Weeks After Knife Attack", "date": "2024-08-20 11:00", "url": "https://www.news18.com/world/king-charles-iii-to-visit-southport-three-weeks-after-knife-attack-9021397.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "King Charles III will on Tuesday visit Southport in northwest England, Buckingham Palace announced, three weeks after a knife attack which killed three young girls sparked nationwide riots.\nThey will include local groups and faith leaders impacted by the violent disorder which hit Southport the day after the July 29 mass stabbing.\nThe meeting will include some of the surviving children who were present at the community centre targeted, as well as their families.\nAxel Rudakubana, who was aged 17 at the time, has been charged with murder and attempted murder over the stabbing spree.\nMore than a dozen English towns and cities saw unrest and riots in the week that followed the events in Southport."}, {"id": "479fad21-9be7-4116-973e-924d415d9553", "title": "Three weeks after knife attack , King Charles III to visit united kingdom riots epicentre", "date": "2024-08-20 11:15", "url": "https://www.firstpost.com/world/three-weeks-after-knife-attack-king-charles-iii-to-visit-uk-riots-epicentre-13806485.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "King Charles III will visit Southport on Tuesday to offer support following a fatal knife attack on July 29 and the subsequent riots.\nREUTERSKing Charles III will on Tuesday visit Southport in northwest England, Buckingham Palace announced, three weeks after a knife attack which killed three young girls sparked nationwide riots.\nAhead of those public engagements, Charles will meet privately with some of those impacted by the knife attack, which claimed the lives of three young girls and injured 10 others, including eight children.\nMore than a dozen English towns and cities saw unrest and riots in the week that followed the events in Southport.\nAdvertisementThe authorities have cited misinformation spread online that Rudakubana was a Muslim asylum seeker for fuelling the violence."}, {"id": "73c08929-ff7c-4ac3-bb8c-e2bbbec44064", "title": "Shock Attack - Daily Times", "date": "2024-08-20 09:30", "url": "https://dailytimes.com.pk/1218990/shock-attack/", "domain": "dailytimes.com.pk", "domain_classification": "Unknown", "message": "Two-and-a-half years after Russia launched its full-scale invasion of its neighbour, Ukraine turned the war on its head and launched a lightning attack on the Southern Kursk region.\nHowever, it is still unclear if he wants to use this as a bargaining chip to end the prolonged war.\nGoing by a giddy presser that saw him praise the incursion and claim that his country sought to “destroy as much Russian war potential as possible,” it could mean he is trying to find a suitable position to ensure local success as well as taking long-range strikes like Russian forces.\nWe may even hear ofmissile launches against civilian infrastructure and the Russian arsenal in the coming days, but how this bold gamble will impact regional stability cannot be ascertained as of now.\nIt is not every day that one sees a direct hit to a ruthless, strongman image projected by Russian President Vladimir Putin."}, {"id": "4e30724f-e4c3-43f2-9a96-9577503b6577", "title": "Blinken : Israel accepts US bridging proposal on Gaza cease - fire", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240819-voa01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Blinken: Israel accepts US bridging proposal on Gaza cease-fireBy Nike Ching August 19, 2024U.S. Secretary of State Antony Blinken said in Tel Aviv late Monday that Israeli Prime Minister Benjamin Netanyahu had accepted an American \"bridging proposal\" on a Gaza cease-fire deal, and that it was now up to Hamas to agree.\nMeanwhile, a polio vaccination campaign in Gaza is expected to move forward as planned in late August and September, regardless of the outcome of the latest cease-fire negotiations.\nPolio threatA planned polio vaccination campaign in Gaza is set to proceed later this month amid the growing threat of a reemergence of the virus.\nThis was separate from the latest American cease-fire proposal and separate from a permanent cease-fire that Hamas has demanded.\n\"Completing a successful polio vaccination campaign is quite challenging."}, {"id": "ecd68f72-1c49-44b2-b390-943d9d5e4ade", "title": "King Charles III to visit Southport three weeks after knife attack", "date": "2024-08-20 11:15", "url": "https://www.bssnews.net/international/204785", "domain": "bssnews.net", "domain_classification": "Unknown", "message": "SOUTHPORT, United Kingdom, Aug 20, 2024 (BSS/AFP) - King Charles III will onTuesday visit Southport in northwest England, Buckingham Palace announced,three weeks after a knife attack which killed three young girls sparkednationwide riots.\nThe monarch will meet members of the Southport community outside the townhall early in the afternoon, before then meeting regional leaders,representatives from the emergency services and others.\nThey will include local groups and faith leaders impacted by the violentdisorder which hit Southport the day after the July 29 mass stabbing.\nAhead of those public engagements, Charles will meet privately with some ofthose impacted by the knife attack, which claimed the lives of three younggirls and injured 10 others, including eight children.\nMore than a dozen English towns and cities saw unrest and riots in the weekthat followed the events in Southport."}, {"id": "2bbdebde-d900-4f6f-a358-068fca805bec", "title": "Man stabbed in neck at NYC subway station", "date": "2024-08-20 14:15", "url": "https://www.fox5ny.com/news/nyc-subway-stabbing-station-crime", "domain": "fox5ny.com", "domain_classification": "Unknown", "message": "A 52-year-old man was stabbed in the neck while inside a NYC subway station in East Harlem, the NYPD said.\nThe stabbing happened on Tuesday around 3:35 a.m. on the northbound 4 train platform inside the 96th Street and Lexington Avenue subway station.\nA man was stabbed in the neck while inside a NYC subway station, police said.\nA man was stabbed in the neck while inside a NYC subway station, police said.\n2 teens stabbed on NYC subway trainMeanwhile, two teens were stabbed last Thursday aboard a subway train, police said."}, {"id": "c575fe88-dc60-4081-b26a-3d4a6dd0f5fb", "title": "King visit to pay tribute to united kingdom stabbing victims", "date": "2024-08-20 10:00", "url": "https://www.canberratimes.com.au/story/8736780/kings-visit-to-pay-tribute-to-uk-stabbing-victims/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Three young girls were killed and others were wounded in the July 29 attack, which sparked the riots after online misinformation wrongly said it had been committed by an Islamist migrant."}, {"id": "46af113e-1163-4606-8cb5-1db0bffd8498", "title": "King visit to pay tribute to united kingdom stabbing victims", "date": "2024-08-20 10:00", "url": "https://www.canberratimes.com.au/story/8736780/kings-visit-to-pay-tribute-to-uk-stabbing-victims/?cs=14264", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "Three young girls were killed and others were wounded in the July 29 attack, which sparked the riots after online misinformation wrongly said it had been committed by an Islamist migrant."}, {"id": "e532022a-f1cc-40de-9b61-8de1666d31a9", "title": "Taylor Swift meets families of Southport stabbing victims before London concert", "date": "2024-08-20 09:30", "url": "https://tribune.com.pk/story/2489530/taylor-swift-meets-families-of-southport-stabbing-victims-before-london-concert", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "In a recent show at Wembley Stadium, London, Taylor Swift met with families affected by the tragic mass stabbing at a children's dance class in Southport this July.\nThe incident, which occurred on July 29, left three young girls dead and several others, including adults, injured.\nOne mother, who shared photos on TikTok, captured the moment Swift met her daughters backstage.\nThe images show Swift embracing the two young girls, with the older child wearing a bandage on her left forearm.\nThe biggest thankyou to @Taylor Swift and her mum for making the most magical night possible for us all 🫶🏻 thankyou for bringing Hope & Autumn pure happiness last night & always 💗💗💗.”@_samifoster You drew stars around my scars 💫🥹 …."}, {"id": "519b28d0-821b-4bad-be0f-28baa2acfc61", "title": "Taylor Swift Met With Survivors of the Southport Stabbings That Left 3 Girls Dead", "date": "2024-08-20 01:00", "url": "https://www.glamour.com/story/taylor-swift-met-with-survivors-of-the-southport-stabbings-that-killed-3-young-girls", "domain": "glamour.com", "domain_classification": "Unknown", "message": "Taylor Swift just made two fans’ dreams come true after they lived through a nightmare.\nOver the weekend, two young girls who survived the recent deadly stabbing at a Swift-themed yoga and dance class met with the 34-year-old pop star just before a London Eras Tour concert.\nThe rest of the Foster family also joined in for photos with Swift and her mom, Andrea.\nJust last month, three young girls were killed during a mass stabbing at the Swift-themed event in Southport, England, which took place on July 29.\nOne day later, Taylor Swift took to Instagram to address the heartbreaking crime."}, {"id": "49f1ede5-0147-45ff-92d0-25bf243d7287", "title": "Taylor Swift meets in London with survivors of stabbing", "date": "2024-08-20 09:00", "url": "https://www.ynetnews.com/culture/article/r1kq3hbs0", "domain": "ynetnews.com", "domain_classification": "Unknown", "message": "During the stabbing spree that took place during a dance workshop, two children were murdered and at least 11 people were injured.\n\"The horror of the attack that took place in Southport is overwhelming me constantly, and I am in absolute shock,\"the singer wrote"}, {"id": "b333e006-6353-4d5a-b3d3-568fe910ccbf", "title": "Is America buying nuclear weapons to win a war or to prevent one ? ", "date": "2024-08-20 11:30", "url": "https://thebulletin.org/2024/08/is-america-buying-nuclear-weapons-to-win-a-war-or-to-prevent-one/", "domain": "thebulletin.org", "domain_classification": "Unknown", "message": "The “why” and “how” of American nuclear weapons must be re-examined in consideration of emerging technologies that are complicating the logic underpinning nuclear strategy and policy.\nAre nuclear weapons being procured to win a war or to prevent one?\nThe development of nuclear weapons started an inflexible and entangled debate between what—to borrow almost anachronistic language—may be described as the “nuclear revolution” and the “nuclear superiority” schools of thought.\nThis debate matters because nuclear weapons policy really matters—and the emergence of disruptive military technologies has created new risks.\nIt’s time for the American nuclear policy community to have a long-overdue conversation about what, prescriptively, US nuclear weapons are for."}, {"id": "ce75c141-1be0-48b9-83d9-58e1bbd38450", "title": "Man , 64 , who is fighting for his life in hospital after triple Manchester stabbing is the husband of mother - of - four who died in same horrific incident", "date": "2024-08-20 02:00", "url": "https://www.dailymail.co.uk/news/article-13759683/Man-64-fighting-life-hospital-triple-Manchester-stabbing-husband-mother-four-died-horrific-incident.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "A mother-of-four has been stabbed to death outside her suburban home while her Christian preacher husband and a 17-year-old girl were left critically-injured in the horrific incident.\nPolice arrested a 22-year-old man on suspicion of murder, who detectives said was ‘known’ to the victims.\nThe family worshipped at Blessed Baptist Temple church, based in nearby Levenshulme, where Mr Obinim is church leader and trustee.\nIt is just so shocking and upsetting.’Police including armed officers were deployed to the scene and the suspect was apprehended in the area.\nDetective Superintendent Toby Facey, of Greater Manchester Police, said: ‘Our thoughts remain with those affected and their loved ones."}, {"id": "b67ccc6b-0feb-4885-a006-bc51803cd006", "title": "Lebanon lodges new complaint with UN Security Council over Israeli violations", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240819-presstv03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Lebanon lodges new complaint with UN Security Council over Israeli violationsIran Press TVMonday, 19 August 2024 4:45 PMLebanon has filed a new complaint with the UN Security Council (UNSC) against the Israeli regime's repeated violations of the Arab country's sovereignty.\nThe complaint, lodged through Permanent Mission of Lebanon to the United Nations in New York, pointed to Israeli pilots' breaking the sound barrier in the skies over Lebanese regions, including the capital Beirut.\n\"Israeli violations constitute a flagrant violation of Lebanon's sovereignty and airspace and Security Council Resolution 1701 (2006).\nHezbollah officials have repeatedly said they do not want a war with Israel while stressing that they are prepared in case it occurs.\nTwo Israeli wars waged against Lebanon in 2000 and 2006 were met with strong resistance from Hezbollah, resulting in the retreat of the regime in both conflicts."}, {"id": "508ad6c6-0345-4784-bce0-64f1a2486e83", "title": "Israeli Bedouin soldier killed in Hezbollah drone barrage", "date": "2024-08-20 02:15", "url": "https://news.webindia123.com/news/Articles/World/20240820/4226734.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Warrant Officer Mahmood Amaria, 45, from the Bedouin town of Ibtin, was killed in Monday morning's drone attack, the IDF said.\nNearly 80,000 Israelis were forced to evacuate their homes near the Lebanon border when Hezbollah began launching rockets and drones in October.\nHezbollah leaders have said they will continue the attacks to prevent Israelis from returning to their homes.\nThe attacks have killed 26 civilians and 19 soldiers on the Israeli side.\nIsraeli officials have been calling for Hezbollah to be disarmed and removed from southern Lebanon in accordance with UN Security Council resolution 1701, which ended the 2006 Second Lebanon War."}, {"id": "e3839587-2dd1-4e5f-ba13-cc7a91824a62", "title": "", "date": "2024-08-20 00:00", "url": "http://www.israelnationalnews.com/news/394865", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "It was cleared for publication on Monday evening that Lieutenant Shahar Ben Nun, aged 21, from Petah Tikva, a commander in the Paratroopers Reconnaissance Unit, Paratroopers Brigade, fell during combat in the southern Gaza Strip.\nBen Nun was killed by a bomb dropped by an israeli aircraft as a result of a malfunction in the plane's navigation system.\nDue to the malfunction, the jet missed its intended target by nearly 300 meters and struck an apartment close to where a group of soldiers were stationed.\nBen Nun was killed in the blast, and six other soldiers were lightly to moderately wounded.\nThe first bomb struck its target, but the second bomb missed and caused the explosion in which Ben Nun was killed."}, {"id": "399356c4-9d42-487f-ad6c-2ca5b2c2530c", "title": "Taylor Swift meets Southport victims during concert", "date": "2024-08-20 14:30", "url": "https://www.telegraph.co.uk/news/2024/08/19/taylor-swift-meets-southport-victims-during-concert/", "domain": "telegraph.co.uk", "domain_classification": "Local - Europe", "message": "Taylor Swift has met victims of the Southport attack at a concert in London.\nThe US pop star met two children hurt during the incident as they attended one of her gigs over the weekend.\nSwift, 34, is currently in London performing for five nights at Wembley Stadium as she closes the European leg of her Eras Tour.\nSwift ‘shaken to the core’ by attackAxel Rudakubana, 18, has been charged with three counts of murder and 10 counts of attempted murder over the incident.\nSwift is said to have reached out to the families of victims before she took to the stage at Wembley."}, {"id": "56bfb1b5-92a3-4dc0-bb6d-3fa242d83e2e", "title": "Harbor Commissioners To Revisit Discussion on Fireworks Ban", "date": "2024-08-20 00:45", "url": "https://wildrivers.lostcoastoutpost.com/2024/aug/19/harbor-commissioners-revisit-discussion-fireworks/", "domain": "wildrivers.lostcoastoutpost.com", "domain_classification": "Unknown", "message": "Crescent City Harbor commissioners will discuss how to go about addressing the problem at their meeting Tuesday, though at least one, Board President Harry Adams, says all fireworks should be banned.\nAdams said he drove around Crescent City at about 5 a.m. July 5 and what he found disgusted him.\nThe Harbor District is considering an ordinance banning all fireworks at the port — something Adams is arguing for.\nThey’re both due in court on Friday, according to the Del Norte County Superior Court calendar.\nThe Harbor District Board of Commissioners will meet at 2 p.m. in the Harbor District office at 101 Citizens Dock Road."}, {"id": "5d51e470-3472-4566-b761-0d122a7d533a", "title": "Taylor Swift London shows : Singer meets with girls injured in united kingdom Southport stabbing attack", "date": "2024-08-20 14:30", "url": "https://abc7chicago.com/post/taylor-swift-london-shows-singer-meets-girls-injured-uk-southport-stabbing-attack/15208469/", "domain": "abc7chicago.com", "domain_classification": "Unknown", "message": "Taylor Swift meets with girls injured in Southport stabbing attackLONDON -- Taylor Swift took time at a recent Eras Tour show at Wembley Stadium in London to greet two girls who were injured in a stabbing spree last month at a Swift-themed event for children in the United Kingdom.\nOne of the girls' moms shared a video on TikTok Monday showing the girls posing with Swift as well as her mom, Andrea, backstage.\nThe biggest thankyou to @Taylor Swift and her mum for making the most magical night possible for us all thankyou for bringing Hope & Autumn pure happiness last night & always ,\" the mom, Sami Foster, captioned the photos.\nA flyer for the two-hour event called it a \"Taylor Swift Yoga and Dance Workshop.\"\nThree young girls died in the stabbing spree and nine people were injured, according to police."}, {"id": "11b06894-9ad5-4506-a9f4-13aeeee37d3d", "title": "Israel recovers bodies of 6 hostages from Gaza as Blinken tries to advance cease - fire deal", "date": "2024-08-20 12:00", "url": "https://www.valleynewslive.com/2024/08/20/israeli-military-says-it-has-recovered-bodies-6-hostages-gaza-operation/", "domain": "valleynewslive.com", "domain_classification": "Unknown", "message": "Israel’s military said its forces recovered the bodies in an overnight operation in southern Gaza, without saying when or how the six died.\nOver 100 hostages were released in exchange for Palestinians imprisoned in Israel during a weeklong cease-fire last year.\nAnother strike killed a mother and her five children in central Gaza.\nThe Israeli military said the strike targeted Hamas militants who had set up a command center inside the school and were planning and launching attacks.\nAn Israeli airstrike in central Gaza killed five children and their mother, according to the nearby Al-Aqsa Martyrs Hospital, where an Associated Press reporter counted the bodies."}, {"id": "9cb94ecb-d792-4669-bfd4-d9e42a332ba7", "title": "Israel recovers bodies of 6 hostages from Gaza as Blinken tries to advance cease - fire deal", "date": "2024-08-20 14:00", "url": "https://www.delta-optimist.com/world-news/israel-recovers-bodies-of-6-hostages-from-gaza-as-blinken-tries-to-advance-cease-fire-deal-9372263", "domain": "delta-optimist.com", "domain_classification": "Unknown", "message": "The military said its forces recovered the bodies in an overnight operation in southern Gaza, without saying when or how the six died.\nAnother strike killed a mother and her five children in central Gaza.\nThe recovery of the remains is a blow to Hamas, which hopes to exchange hostages for Palestinian prisoners, an Israeli withdrawal and a lasting cease-fire.\nOver 100 hostages were released in exchange for Palestinians imprisoned in Israel during a weeklong cease-fire last year.\nAn Israeli airstrike in central Gaza killed five children and their mother, according to the nearby Al-Aqsa Martyrs Hospital, where an Associated Press reporter counted the bodies."}, {"id": "7571330c-8878-4830-a9e6-a638034ac564", "title": "Israel recovers bodies of 6 hostages from Gaza as Blinken tries to advance cease - fire deal", "date": "2024-08-20 11:30", "url": "https://santamariatimes.com/ap/international/israel-recovers-bodies-of-6-hostages-from-gaza-as-blinken-tries-to-advance-cease-fire/article_e5b16a94-16d7-50fc-b3aa-edb0ef00c19a.html", "domain": "santamariatimes.com", "domain_classification": "Unknown", "message": "U.S. Secretary of State Antony Blinken is visiting fellow mediators Egypt and Qatar as he presses ahead with the latest diplomatic mission to secure a cease-fire in the war in Gaza, even as Hamas and Israel signal that challenges remain"}, {"id": "167930e5-0309-497a-85b0-0294cad192b5", "title": "Ukrainian air defence responds to Russian attack near Kyiv", "date": "2024-08-20 08:15", "url": "https://www.yahoo.com/news/ukrainian-air-defence-responds-russian-030654123.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Ukrainian air defence was responding to a Russian attack on Kyiv Oblast during an air raid on the early morning of 20 August.\nSource: Serhii Popko, Head of Kyiv City Military Administration; Ukraine’s Air ForceQuote: \"The air-raid warning continues!\nAir defence systems are responding in the oblast, on the outskirts of Kyiv.\nDetails: Popko also said that the air-raid warning is linked to a threat of missile attacks.\nIn addition, the air-raid warning was issued in Chernihiv, Poltava, and Zhytomyr oblasts for the same reason."}, {"id": "3d1c0616-4fea-4010-9f5c-7a8296563dc6", "title": "Trump Says He Would Appoint Elon Musk To Cabinet If Elected", "date": "2024-08-20 00:30", "url": "https://www.yahoo.com/news/trump-says-appoint-elon-musk-235951798.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Trump Says He Would Appoint Elon Musk To Cabinet If ElectedFormer President Donald Trump plans to offer a job to his billionaire buddy Elon Musk if elected, Reuters reported on Monday.\nTrump said he would consider terminating it, and also be open to assigning a cabinet or advisory role to Musk, the Tesla Motors co-founder and CEO.\nHe’s a brilliant guy,” Trump said.\n“I think it would be great to just have a government efficiency commission that takes a look at these things and just ensures that taxpayer money...is spent in a good way,” Musk told Trump.\n“You’re the greatest cutter,” Trump told Musk during their conversation last week."}, {"id": "20386a32-253b-445f-a000-c5c8e580781d", "title": "US authorizes potential sale to S . Korea of Apache attack helicopters", "date": "2024-08-20 02:00", "url": "https://www.koreatimes.co.kr:443/www/nation/2024/08/205_380856.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "The United States has approved a potential sale to Korea of Apache attack helicopters and related logistical and other elements to help improve the Asian ally's defense capabilities, a government agency said Monday.\nThe Defense Security Cooperation Agency (DSCA) under the Department of Defense announced that the State Department has made the decision on the potential government-to-government Foreign Military Sale (FMS) estimated to cost $3.5 billion.\nKorea has made a request to buy up to 36 AH-64E Apache attack helicopters, 76 T700-GE-701D engines, 456 AGM-114R2 hellfire missiles, 152 AGM-179A joint air-to-ground missiles and 40 AAR-57 common missile warning systems among others, according to the agency.\n\"The proposed sale will improve the Republic of Korea's capability to meet current and future threats by providing a credible force capable of deterring adversaries and participating in regional operations,\" it added.\nDSCA delivered the certification notifying Congress of the possible sale earlier in the day as the sale requires congressional endorsement."}, {"id": "2efc2f7d-a9fe-428b-8403-61eab201c991", "title": "Stabbed : Man stabs minor cousin to death | Bhubaneswar News", "date": "2024-08-20 01:00", "url": "https://timesofindia.indiatimes.com/city/bhubaneswar/man-stabs-minor-cousin-to-death/articleshow/112638160.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "The girl was hospitalized but her life is not in danger, while her mother sustained minor injuries.\n22-year-old man stabbed to death after road rage in DelhiA 22-year-old man, Monu, was fatally stabbed by four men in Prasad Nagar, Delhi on August 15.\nUP man gets life for setting afire cousin who spurned himA fast-track court in Mainpuri sentenced a man to life imprisonment for murdering his 15-year-old cousin after she rejected his advances six years ago.\nThe girl identified her attacker before succumbing to her injuries, crucial in convicting Jitendra Kumar.\nBerhampur: A 13-year-old girl was stabbed to death by her cousin during a shradhh ceremony at the latter’s house in Jagannath Bihar under Bada Bazar police station limits here on Monday."}, {"id": "7cf2ea06-546f-4afc-bc48-bf54383d636e", "title": "Body of British Israeli hostage among six recovered from Gaza", "date": "2024-08-20 11:15", "url": "https://www.independent.co.uk/news/world/middle-east/british-israeli-hostage-recovered-gaza-death-b2598814.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}The body of a British-Israeli hostage is among six that have been recovered from the Gaza Strip, the Israeli military has said.\nIn a statement the Israeli army said that its forces reclaimed the bodies in an overnight operation in southern Gaza.\nIn May, Hamas released a video claiming that Mr Popplewell, who was among the 250 people taken hostage during its October 7 attack on Israel that killed around 1,200 people, died after being wounded in an Israeli airstrike in April.\nThe negotiations are progressing as Israel continues its offensive in the southern Gaza Strip, with further intense fire reported overnight in the city of Khan Younis."}, {"id": "b9914b94-05a9-4929-9654-acc09e462597", "title": "Russia hits energy infrastructure in airstrikes on Ukraine", "date": "2024-08-20 09:15", "url": "https://www.thestar.com.my/news/world/2024/08/20/russia-hits-energy-infrastructure-in-airstrikes-on-ukraine", "domain": "thestar.com.my", "domain_classification": "Unknown", "message": "KYIV (Reuters) -Russia hit energy infrastructure in northern Ukraine in an overnight missile and drone attack and caused a huge fire in the west of the country, resulting in an increase in chlorine levels in the air, Ukrainian officials said on Tuesday.\nRegional officials in the northeastern Sumy region bordering Russia said an energy facility was hit, causing blackouts for 72 settlements and more than 18,500 consumers.\nUkrainian energy facilities have come under nearly daily bombardment over the past six months as the war grinds on following Russia's full-scale invasion in February 2022.\nAn industrial facility was attacked in the western region of Ternopil during the latest bombardments, and a fuel reservoir was hit, officials said.\nMoscow has continued airstrikes since Ukrainian forces began an incursion into Russia's Kursk region on Aug. 6, and Russian forces have been gradually advancing in parts of eastern Ukraine."}, {"id": "db60710c-bb2c-49ae-a568-dadcb379386a", "title": "  A big miracle happened here : Eyewitness recounts Tel Aviv bombing", "date": "2024-08-20 12:30", "url": "https://www.jwire.com.au/a-big-miracle-happened-here-eyewitness-recounts-tel-aviv-bombing/", "domain": "jwire.com.au", "domain_classification": "Unknown", "message": "Browse > Home News / 'A big miracle happened here': Eyewitness recounts Tel Aviv bombing – J-Wire‘A big miracle happened here’: Eyewitness recounts Tel Aviv bombingRead on for articleIn the aftermath of Sunday night’s Tel Aviv terror attack, one of the worshippers in the Rashbi Synagogue that was apparently targeted recounted the scene.\nWe all panicked and immediately went outside — we only saw smoke, a truck on fire and, the smell of burning.\n“There was a big miracle here 10 meters from the synagogue,” Meshulam told TPS-IL.\nMiracle is the word everyone says.”Security cameras filmed a man wearing a blue backpack walking down Lehi Road in southern Tel Aviv when it exploded not far from the synagogue.\nHamas claimed responsibility for the bombing on Monday, saying it was carried out in cooperation with Palestinian Islamic Jihad."}, {"id": "ee1ad726-aedc-4528-8b1d-932481f014ea", "title": "Ukraine repels fifth Russian missile attack on Kyiv ... ", "date": "2024-08-20 06:00", "url": "https://www.newsincyprus.com/news/534565/ukraine-repels-fifth-russian-missile-attack-on-kyiv-in-august", "domain": "newsincyprus.com", "domain_classification": "Unknown", "message": "10 hours ago Cyprus Mail CyprusMail CoolRussia launched its fifth missile attack on Kyiv this month, Ukraine’s military said on Tuesday, with preliminary data showing air defence systems were again successful in repelling the strikes.\nThe missile attack followed a drone attack on Kyiv late on Monday, with preliminary information showing there was no damage or injuries as a result of either of the attacks, Kyiv’s military administration said on the Telegram messaging..."}, {"id": "e81dbcfe-8366-4586-99db-420def3932df", "title": "Deadly stabbing suspect from LaPorte captured after pursuit into St . Joseph County", "date": "2024-08-20 01:15", "url": "https://wsbt.com/news/local/deadly-stabbing-suspect-from-laporte-captured-after-pursuit-st-joseph-county-investigation-chase-man-victim-died-police-south-bend-north-liberty-jail-indiana", "domain": "wsbt.com", "domain_classification": "Unknown", "message": "A suspect in a deadly stabbing Monday morning in LaPorte was captured during a high-speed pursuit into St. Joseph County.\nAccording to LaPorte Police, officers were called to the 200 block of Lawndale Ave about a stabbing.\nPolice said a suspect in the stabbing was soon located in LaPorte County and fled into St. Joseph County with officers from multiple agencies giving chase.\nThe suspect is being held in the La Porte County Jail pending the possible filing of charges in the case, which remains under investigation, police said.\nPolice did not provide further details but will once the investigation moves further along in the process."}, {"id": "dd9eb09d-b511-431e-b9d9-6684c34aac8f", "title": "Teen stabbed , motorcycle driver shot dead in Hinigaran", "date": "2024-08-20 01:00", "url": "https://visayandailystar.com/teen-stabbed-motorcycle-driver-shot-dead-in-hinigaran/", "domain": "visayandailystar.com", "domain_classification": "Unknown", "message": "A Grade 12 student, whose identity was withheld by the police, was declared dead on arrival at a clinic at a medical clinic in Hinigaran town, on Sunday.\nThe 17-year-old victim succumbed to multiple wounds after he was stabbed by a still unidentified suspect in Barangay 4, Hinigaran, according to initial investigations of the town’s police.\nThe following day, a motorcycle driver was shot by an unidentified gunman at Purok Taytay Tanulo in Brgy.\nPolice investigations indicated that the 25-year-old victim was driving a motorcycle when a still unidentified suspect shot him at the back, with the bullet exiting his chest.\nThe victim died on the spot, when the responding members of Hinigaran Rescue Team arrived at the crime scene."}, {"id": "ab5b9a2f-0036-4220-8ce4-0e03ae336c45", "title": "Qassam , Al - Quds brigades claim responsibility for Tel Aviv operation", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240819-irna03.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Qassam, Al-Quds brigades claim responsibility for Tel Aviv operationIRNA - Islamic Republic News AgencyAug 19, 2024Tehran, IRNA -- The military wings of Palestinian resistance groups Hamas and Islamic Jihad have claimed responsibility for a resistance operation in Tel Aviv.\nIn a joint statement on Monday, the Al-Qassam Brigades of Hamas and the Al-Quds Brigades of Islamic Jihad said their \"martyrdom operations\" inside the occupied territories would return to the forefront as long as the Israeli regime's massacres and assassination policy continue.\nThe Israeli regime's internal security service Shin Bet (Shabak) and police said they were on high alert following the anti-Zionist operation on Sunday night.\nMeanwhile, the Popular Resistance Committees in Palestine hailed the operation, describing it as a significant intelligence and security failure for the Israeli regime.\nThey stated that the Tel Aviv operation marks the beginning of a new and unique phase in confronting the brutality of the Zionist enemy."}, {"id": "25a806eb-8744-4cb6-88b0-45136c8c2f98", "title": "Blinken says Israel backs US proposal in  last  chance for Gaza truce", "date": "2024-08-20 06:45", "url": "https://www.standardmedia.co.ke/asia/article/2001501288/blinken-says-israel-backs-us-proposal-in-last-chance-for-gaza-truce", "domain": "standardmedia.co.ke", "domain_classification": "Local - Africa", "message": "US Secretary of State Antony Blinken (C) walks after his arrival in Tel Aviv on August 18, 2024.\nIt's now incumbent on Hamas to do the same,\" Blinken told reporters in Tel Aviv.\nTel Aviv bombingLate on Sunday, soon after Blinken landed in the city, a rare bombing took place in Tel Aviv.\nIt came as Israel and Hamas traded blame for delays in reaching a truce deal.\nBlinken said Washington was working with Israel and expected they would have a vaccination plan \"in the coming weeks\"."}, {"id": "8fcbc2db-b91d-4beb-b161-acd019b92f63", "title": "Myanmar massacre :  My family died in front of my eyes  ", "date": "2024-08-20 00:15", "url": "https://www.bbc.com/news/articles/czx6w130q1ko", "domain": "bbc.com", "domain_classification": "International", "message": "'My family died in front of my eyes’: Harrowing tales from a Myanmar massacreBBC/Aamir Peerzada Nisar lost his family in the attack on the banks of this riverWarning: This article contains details some readers may find distressing.\nThey dropped bombs on us using drones.” Nisar was the only one of his family to survive.\nWhile most described the bombs being dropped by drones, a weapon increasingly being used in Myanmar, some said they were hit by mortars and gunfire.\nBut the conflict intensified faster than he expected, and on the morning of 5 August, the family decided to leave Myanmar.\nHandout The faces of four members of the same family who drowned crossing to safety"}, {"id": "47ff74cb-614b-4444-a13a-49ab92f46682", "title": "Israeli soldier , two Hizbollah fighters killed in clashes", "date": "2024-08-20 00:45", "url": "http://jordantimes.com/news/region/israeli-soldier-two-hizbollah-fighters-killed-clashes", "domain": "jordantimes.com", "domain_classification": "Unknown", "message": "Fire sweep over the Marjayoun plain in southern Lebanon near the border with Israel after being hit by Israeli shelling on August 16, 2024, amid the ongoing cross-border clashes between Israeli troops and Hizbollah fighters (AFP photo)BEIRUT, Lebanon — An Israeli soldier and two Hizbollah fighters were killed Monday in clashes, Israel's military and the Iran-backed Lebanese group said, the latest in a wave of cross-border violence.\nHizbollah and Iran vowed to respond after an Israeli strike last month on Beirut killed senior Hezbollah commander Fuad Shukr, hours before an attack in Tehran, blamed on Israel, killed Hamas political leader Ismail Haniyeh.\nThe Israeli military said Monday a member of its Bedouin Trackers Unit \"fell during combat in northern Israel\".\nIsrael's military said air forces struck \"Hezbollah terrorists\" in the Hula area and \"Hizbollah military structures\" elsewhere in south Lebanon.\n'Impunity'Hizbollah said that it responded to an Israeli \"attack and assassination\" in south Lebanon's Tyre area."}, {"id": "9bb872f3-6ffc-4983-8b83-c33c09624e57", "title": "Biden - Harris Admin Waives Sanctions on Iran Terror - Spreading State Broadcaster as Tehran Plots Israel Attack", "date": "2024-08-20 01:00", "url": "https://freebeacon.com/national-security/biden-harris-admin-waives-sanctions-on-irans-terror-spreading-state-broadcaster-as-tehran-plots-israel-attack/", "domain": "freebeacon.com", "domain_classification": "Unknown", "message": "It is the first time the Biden-Harris administration has renewed the waiver since Hamas launched its unprecedented attack on Israel, sparking war with Iranian proxies across the region.\nWhile past administrations have waived sanctions on the IRIB, starting with the Obama administration in 2014, the fresh waiver comes amid a unique period of Iranian aggression.\nIn the wake of the Oct. 7 attack by Iranian terrorist proxy Hamas, Tehran has launched increased attacks on American bases and personnel, as well as the Jewish state.\nThe Biden-Harris administration also waived IRIB sanctions in February 2023.\nSecretary of State Antony Blinken personally signed off on the new sanctions waiver, telling Congress that bypassing sanctions on Tehran \"is vital to the national security of the United States.\""}, {"id": "e3d55a0e-54bb-4bc0-8aad-13447bf5a9ab", "title": "King Charles to visit Southport today - weeks after horror stabbings and riots erupted | Royal | News", "date": "2024-08-20 11:45", "url": "https://www.express.co.uk/news/royal/1938015/king-charles-visit-southport-stabbings-attack-riots", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Tomorrow, he will host the bereaved families of the three girls killed in the attack in London.\nReacting to the tragedy on the night of the attack, the King said: \"My wife and I have been profoundly shocked to hear of the utterly horrific incident in Southport today.\nPrince William and Kate added: \"As parents, we cannot begin to imagine what the families, friends and loved ones of those killed and injured in Southport today are going through.\nBebe King, six, Elsie Dot Stancombe, seven, and Alice da Silva Aguiar, nine, were killed during the horror attack.\nDuring the disorder that erupted in the days that followed more than 80 police officers were injured responding to the violence."}, {"id": "169ee2f8-d3e9-4cff-9ee7-b4c299bcc65e", "title": "Man seriously injured in Elkhart stabbing", "date": "2024-08-20 01:15", "url": "https://wsbt.com/news/local/stabbing-investigation-man-seriously-injured-police-hospital-retrat-apartment-homes-toledo-road-elkhart-indiana", "domain": "wsbt.com", "domain_classification": "Unknown", "message": "Police in Elkhart have launched an investigation into a weekend stabbing that left one person hurt.\nIt happened Saturday around 10:30 p.m. at the Retreat Apartment Homes on Toledo Road.\nWhen officers arrived, they found a 61-year-old man inside the common area with stab wounds.\nThe victim was taken to the hospital with serious injuries, but he is expected to survive.\nAnyone with information on the stabbing is asked to contact police at (574)-295-7070 or Michiana Crime Stoppers at (574)-288-STOP."}, {"id": "32550f56-7fa7-40d3-a24d-19de8e1e92be", "title": "Gaza civil defence says Israel strike on school kills seven - World", "date": "2024-08-20 11:30", "url": "https://www.brecorder.com/news/40318398/gaza-civil-defence-says-israel-strike-on-school-kills-seven", "domain": "brecorder.com", "domain_classification": "Unknown", "message": "GAZA STRIP: Gaza’s civil defence agency said an Israeli strike hit a school in Gaza City on Tuesday, killing at least seven people, while the Israeli military said it struck a Hamas command centre.\nAFP was unable to independently verify the death toll at the school, which the Israeli military said was targeted because it housed a Hamas command and control centre.\nEarlier this month, the military had struck the Al-Tabieen School in Gaza City, which according to the civil defence agency killed 93 Palestinians.\nIn recent weeks, the military has struck several schools across Gaza, primarily in Gaza City, accusing them of housing Hamas command centres, which the Palestinian group denies.\nAntony Blinken heads to Egypt on Gaza truce pushMost of the dead in Gaza are women and children according to UN human rights office."}, {"id": "9bf8ad0c-9258-485b-9734-74260d68ba52", "title": "Florida woman who claimed she worked for God indicted for ambush murder of deputy", "date": "2024-08-20 01:30", "url": "https://www.foxnews.com/us/florida-woman-who-claimed-worked-god-indicted-ambush-murder-deputy", "domain": "foxnews.com", "domain_classification": "Unknown", "message": "FLORIDA WOMAN ARRESTED FOR AMBUSH MURDER IN KILLING OF DEPUTY, CLAIMED SHE WORKED FOR GODSulpizio was taken into custody on Aug. 5 at a hospital in Tavares, Florida, after being taken there for treatment on Aug. 2, when the crime occurred.\nMaster Deputy Sheriff Bradley Michael Link, 28, was killed in the shooting that Lake County Sheriff Peyton Grinnell described as an \"ambush.\"\nMaster Deputy Sheriff Harold Howell, 41, and Deputy First Class Stefano Gargano, 28, were injured in the attack.\nHe explained that the caller said a woman, later identified as Sulpizio, was attacking people and trespassing on their property.\n\"They identified Julie Sulpizio as their neighbor, but Julie states that she is 'Helen, under God's will.'\""}, {"id": "b99cd27c-2342-4c34-97a3-131cb0339241", "title": "  Sadistic  man fed live rabbit to pet terriers in  barbaric  act of cruelty", "date": "2024-08-20 11:30", "url": "https://www.leicestermercury.co.uk/news/local-news/sadisitic-man-fed-live-rabbit-9495247", "domain": "leicestermercury.co.uk", "domain_classification": "Unknown", "message": "Something went wrong, please try again later.\nInvalid email Something went wrong, please try again later.\nSomething went wrong, please try again later.\nA \"sadistic\" man filmed himself as he fed a live pet rabbit to his two Patterdale terriers.\nBut Palmer claimed in his police interview it was a wild rabbit with myxomatosis – a virus affecting rabbits – and he was trying to end its suffering."}, {"id": "5b92c70b-e481-416f-b8ed-a5c489b5fcf8", "title": "American Airlines halts Israel flights until March 2025 – NBC 5 Dallas - Fort Worth", "date": "2024-08-20 02:15", "url": "https://www.nbcdfw.com/news/local/american-airlines-suspends-israel-flights-until-2025/3624802/", "domain": "nbcdfw.com", "domain_classification": "Unknown", "message": "American Airlines is extending its suspension of flights to and from Tel Aviv due to escalating tensions following 10 months of the Israel-Hamas war in Gaza.\nTravel must be completed within a year of the original ticket date, and the difference in fare may apply.\nFollowing the outbreak of the Middle East war in October 2023, American Airlines halted all flights to and from Tel Aviv.\nDelta Airlines and United Airlines canceled flights at the start of the war but have since resumed operations.\nIn a separate incident, a woman in her 70s and an 80-year-old man were murdered, and two other men were injured in a stabbing attack in a Tel Aviv suburb, according to Israel's Magen David Adom rescue service."}, {"id": "dc3ed21f-a73d-49fd-83fc-b3c58a78f223", "title": "Myanmar massacre :  My family died in front of my eyes  ", "date": "2024-08-20 06:00", "url": "https://www.bbc.co.uk/news/articles/czx6w130q1ko", "domain": "bbc.co.uk", "domain_classification": "Local - Europe", "message": "Fayaz was carrying bags stuffed with whatever they had managed to grab.\nHis wife was carrying their six-year-old daughter, their eldest was running alongside them.\nBut he died while we were waiting for the bombing to stop.”Nisar* had also made it to the riverbank by about 17:00, having decided to escape with his mother, wife, son, daughter and sister.\nThey dropped bombs on us using drones.”Nisar was the only one of his family to survive.\nFayaz, his wife and daughters escaped and would eventually make it across the river."}, {"id": "1a5f3d5f-9928-454e-9d7a-d4cd501b2d9f", "title": "Jury finds parents of Texas student accused in deadly 2018 school shooting not negligent", "date": "2024-08-20 02:15", "url": "https://www.nbcnews.com/news/us-news/jury-parents-texas-student-deadly-2018-shooting-not-negligent-rcna167294", "domain": "nbcnews.com", "domain_classification": "Unknown", "message": "GALVESTON, Texas — The parents of a former student accused of killing 10 people in a 2018 school shooting near Houston cannot be held responsible for what happened, a jury decided Monday.\nJurors did, however, held Dimitrios Pagourtzis responsible and awarded families more than $300 million total in damages, including for pain and mental anguish.\nHe is being held at a state mental health facility.\nPagourtzis’ parents are not accused of any crime.\nDimitrios Pagourtzis used his mother’s .38 caliber handgun and one of his father’s shotguns during the shooting."}, {"id": "0788efda-72f1-4989-8bf7-0e1621200b89", "title": "Ahead of Modi Ukraine visit , Russian Navy chief meets CDS , Admiral Tripathi in India – Firstpost", "date": "2024-08-20 05:15", "url": "https://www.firstpost.com/world/ahead-of-modis-ukraine-visit-russian-navy-chief-meets-cds-admiral-tripathi-in-india-13806297.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Just ahead of PM Modi’s visit to Ukraine, Russia’s navy chief is on a four-day tour of India to bolster maritime defence cooperation between the two countries.\nread moreThe day the government announced Prime Minister Narendra Modi upcoming Poland and Ukraine visits, Russian Navy chief Admiral Alekseyevich Moiseyev landed in India.\nModi will visit Ukraine on August 23.\nThe visit aims to strengthen bilateral naval relations, as also to explore new avenues for naval cooperation,” the paper said.\n“The Indian Navy has also been interacting with the Russian Federation Navy in various multilateral fora viz."}, {"id": "e4706f34-d453-4c11-9e17-852b70e92871", "title": "Jury finds parents of Texas student accused in 2018 deadly school shooting not negligent", "date": "2024-08-20 01:00", "url": "https://www.theglobeandmail.com/world/article-jury-finds-parents-of-texas-student-accused-in-2018-deadly-school/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "The victims’ lawsuit sought to hold Dimitrios Pagourtzis and his parents, Antonios Pagourtzis and Rose Marie Kosmetatos, financially liable for the shooting at Santa Fe High School on May 18, 2018.\nJurors did, however, hold Dimitrios Pagourtzis responsible and awarded families more than $300-million total in damages, including for pain and mental anguish.\nIn April, Jennifer and James Crumbley were sentenced to at least 10 years in prison by a Michigan judge after becoming the first parents convicted in a U.S. mass school shooting.\nPagourtzis’ parents are not accused of any crime.\nDimitrios Pagourtzis used his mother’s .38 calibre handgun and one of his father’s shotguns during the shooting."}, {"id": "8b339306-6252-4915-9fa2-1013abbd6458", "title": "Iran targeted both Trump , Harris campaigns : US security agencies", "date": "2024-08-20 14:30", "url": "https://www.medianama.com/2024/08/223-iran-targeted-trump-harris-presidential-campaigns-security-agencies/", "domain": "medianama.com", "domain_classification": "Unknown", "message": "Explainer Briefly SlidesIran engaged in attempts to influence the US Presidential election, claimed American intelligence agencies on August 19, 2024.\n“Iran seeks to stoke discord and undermine confidence in our democratic institutions,” said the statement.\nAccording to the statement, Iranian operatives have targeted both presidential campaigns with cyber operations, social engineering and other efforts, including a recently reported cyber attack on former President Trump’s campaign.\nThe agencies observed that Iran is seeking access to individuals directly connected to presidential campaigns of both major political parties.\nFriendly relations with Iran remain a distant prospect even for current president Biden, due to the ongoing Israel-Hamas conflict."}, {"id": "5ad7397d-d771-4797-abcf-6904d2a66947", "title": "Rocket engine explodes during test launch from new spaceport in Scotland", "date": "2024-08-20 14:15", "url": "https://www.mymotherlode.com/news/europe/3410669/rocket-engine-explodes-during-test-launch-from-new-spaceport-in-scotland.html", "domain": "mymotherlode.com", "domain_classification": "Unknown", "message": "Rocket engine explodes during test launch from new spaceport in ScotlandLONDON (AP) — A rocket engine exploded during a test launch at a new spaceport in the Shetland Islands off northern Scotland, the rocket manufacturer said Tuesday.\nGerman manufacturer Rocket Factory Augsburg, or RFA, said no one was injured in the incident at SaxaVord Spaceport on the remote island of Unst on Monday evening.\nVideo of Monday’s test launch showed the engine exploding on the launchpad, with the entire structure engulfing in flames and thick smoke.\nIt is billed as western Europe’s only fully-licensed vertical rocket launch port.\nRFA was running tests there ahead of holding the U.K.’s first vertical rocket launch into orbit this autumn."}, {"id": "41670d8f-0f52-48ca-92f8-17bcd147f583", "title": "Blinken calls on Hamas to accept ceasefire proposal", "date": "2024-08-20 01:00", "url": "https://www.rte.ie/news/middle-east/2024/0819/1465594-middle-east/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Secretary of State Antony Blinken has urged Hamas to accept a US bridging proposal for a Gaza ceasefire and hostage release deal after what he said was a \"very constructive\" meeting with Israeli Prime Minister Benjamin Netanyahu.\nHamas accused Mr Netanyahu of \"thwarting the mediators' efforts\" and Turkey said Hamas envoys had told it that US officials were \"painting an overly optimistic picture\".\nAfter a new proposal was drawn up at those talks, Hamas now accuses Mr Netanyahu of obstruction.\nYesterday Mr Netanyahu reiterated that Hamas must be pressured.\nTherefore, the pressure should be directed at Hamas and (their leader Yahya) Sinwar, not at the Israeli government,\" Mr Netanyahu said at a cabinet meeting."}, {"id": "e465c5ab-cd1b-47c3-88b7-f680ace9c81a", "title": "Jury finds parents not negligent in 2018 school shooting", "date": "2024-08-20 01:00", "url": "https://www.stltoday.com/news/nation-world/crime-courts/guns-firearms-courts-children-texas/article_bf55dad2-f189-5554-a0da-ba6dc2c92d13.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "The parents of a former student accused of killing 10 people at a high school near Houston in 2018 do not bear financial responsibility for the shooting, a jury decided Monday.\nA lawsuit brought by victims and their families sought to hold Dimitrios Pagourtzis and his parents, Antonios Pagourtzis and Rose Marie Kosmetatos, accountable for the shooting at Santa Fe High School in 2018.\nDimitrios Pagourtzis, now 23, was charged with capital murder, but the criminal case has been on hold since November 2019, when he was declared incompetent to stand trial.\nIn April, Jennifer and James Crumbley were sentenced to at least 10 years in prison by a Michigan judge after becoming the first parents convicted in a U.S. mass school shooting.\nDimitrios Pagourtzis' parents are not accused of any crime."}, {"id": "efad0fb9-7a47-47d7-b982-f5cbf448a518", "title": "Jury finds parents of Texas student accused in 2018 deadly school shooting not negligent", "date": "2024-08-20 00:45", "url": "https://gazette.com/ap/national/jury-finds-parents-of-texas-student-accused-in-2018-deadly-school-shooting-not-negligent/article_07eaa305-d738-5fe4-8aac-5eca891c9d23.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "Jury finds parents of Texas student accused in 2018 deadly school shooting not negligentA Texas civil jury says the parents of a former student accused of killing 10 people in a 2018 Santa Fe high school shooting can’t be held responsible for what happened"}, {"id": "842a9492-f065-4696-8b6f-2a3ca80d8e4e", "title": "Hunter in Alaska recovering after being mauled by bear and shot amid effort to fend it off – Winnipeg Free Press", "date": "2024-08-20 02:15", "url": "https://www.winnipegfreepress.com/world/2024/08/19/hunter-in-alaska-recovering-after-being-mauled-by-bear-and-shot-amid-effort-to-fend-it-off", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "ANCHORAGE, Alaska (AP) — A hunter in Alaska was hospitalized after being mauled by a brown bear and shot during an effort to fend it off, authorities said Monday.\nThe bear attack occurred Saturday on the Kenai Peninsula, southwest of Anchorage, Alaska State Troopers said.\nIt was not immediately clear who fired the shot that struck him, troopers spokesman Tim DeSpain said in an email.\nDeSpain said the mauling occurred in a remote area off the Resurrection Pass trail.\nThe injured hunter, whose identity was not immediately released, was flown by helicopter to an Anchorage hospital."}, {"id": "1e8c2f42-c7af-4f9e-9ec4-9fb32d8ef12e", "title": "Agony mounts for patients in India doctor strike", "date": "2024-08-20 14:00", "url": "https://www.yahoo.com/news/agony-mounts-patients-india-doctors-121028460.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Patients queue in a subway near a hospital waiting to see a doctor in New Delhi amid a doctors' strike (Money SHARMA)In a dingy New Delhi pedestrian subway, patients waiting for treatment at nearby hospitals line the ground as queues grow with Indian doctors protesting the rape and murder of a colleague.\nDoctors' associations from government-run hospitals in many cities across India have launched strikes, cutting non-essential services.\nBut the protests have hit hard patients like Khatoon seeking free treatment in government-run hospitals because they are too poor to pay for private healthcare.\nDoctors have also been demanding the implementation of the Central Protection Act, a bill to protect healthcare workers from violence.\nSenior doctors are not coming to the hospital,\" Rosy, 35, said, sitting next to her husband, who has a colostomy bag."}, {"id": "b1b43699-c9dc-4d1a-b463-e0dc7d108143", "title": "Wrongful death lawsuit filed against man accused of killing Chicopee woman", "date": "2024-08-20 01:00", "url": "https://www.masslive.com/westernmass/2024/08/wrongful-death-lawsuit-filed-against-man-accused-of-killing-chicopee-woman.html", "domain": "masslive.com", "domain_classification": "Unknown", "message": "CHICOPEE — The criminal case of Jason Chapdelaine, who is facing a murder charge for allegedly stabbing to death his girlfriend Eileen Monaghan in April, is ongoing.\nHe is now also facing a civil case.\nMonaghan’s estate filed a wrongful death suit against Chapdelaine in June.\nThe complaint also named the Chicopee Contributory Retirement Board, which is named as a defendant only in a claim to allow funds in Chapdelaine’s city retirement account to go toward a judgment if there is one.\nLast week, the board filed a motion to dismiss the case."}, {"id": "ad2616fc-aa4a-4cbb-bc04-9cb4de716c25", "title": "Israel accepts US  bridging proposal  for Gaza ceasefire deal , Blinken says", "date": "2024-08-20 02:15", "url": "https://www.independent.co.uk/news/world/middle-east/israel-gaza-war-ceasefire-talks-blinken-netanyahu-b2598664.html", "domain": "independent.co.uk", "domain_classification": "Local - Europe", "message": "Mr Netanyahu’s office said the three-hour meeting was “held in a good atmosphere” and that Israel backed Washington’s proposal.\nOf those, some 110 are still believed to be in Gaza, though Israeli authorities say around a third are dead.\nSpeaking in Tel Aviv before meeting Mr Herzog, Mr Blinken said he was also working to de-escalate other regional tensions fuelled by the war in Gaza.\nMr Blinken acknowledged that it was a “fraught moment” for Israel, where there are concerns about potential attacks by Iran and Hezbollah.\nMr Blinken is due to visit Egypt on Tuesday."}, {"id": "39bbe22e-d944-45e1-80bc-692e106dd600", "title": "Jury finds parents not negligent in 2018 school shooting", "date": "2024-08-20 01:00", "url": "https://missoulian.com/news/nation-world/crime-courts/guns-firearms-courts-children-texas/article_7d752193-d3e1-530a-a3f1-300862bfcfb9.html", "domain": "missoulian.com", "domain_classification": "Unknown", "message": "The parents of a former student accused of killing 10 people at a high school near Houston in 2018 do not bear financial responsibility for the shooting, a jury decided Monday.\nA lawsuit brought by victims and their families sought to hold Dimitrios Pagourtzis and his parents, Antonios Pagourtzis and Rose Marie Kosmetatos, accountable for the shooting at Santa Fe High School in 2018.\nDimitrios Pagourtzis, now 23, was charged with capital murder, but the criminal case has been on hold since November 2019, when he was declared incompetent to stand trial.\nIn April, Jennifer and James Crumbley were sentenced to at least 10 years in prison by a Michigan judge after becoming the first parents convicted in a U.S. mass school shooting.\nDimitrios Pagourtzis' parents are not accused of any crime."}, {"id": "ecdf51a1-fe8f-40d3-b550-f86f7d9bb89c", "title": "Jury finds parents of Texas student accused in 2018 deadly school shooting not negligent", "date": "2024-08-20 01:30", "url": "https://lasvegassun.com/news/2024/aug/19/jury-finds-parents-of-texas-student-accused-in-201/", "domain": "lasvegassun.com", "domain_classification": "Unknown", "message": "Jury finds parents of Texas student accused in 2018 deadly school shooting not negligentJennifer Reynolds / The Galveston County Daily News via APGALVESTON, Texas — The parents of a former student accused of killing 10 people in a 2018 school shooting near Houston cannot be held responsible for what happened, a jury decided Monday.\nJurors did, however, hold Dimitrios Pagourtzis responsible and awarded families more than $300 million total in damages, including for pain and mental anguish.\nHe is being held at a state mental health facility.\nPagourtzis’ parents are not accused of any crime.\nDimitrios Pagourtzis used his mother’s .38 caliber handgun and one of his father’s shotguns during the shooting."}, {"id": "d0842be7-1086-4ae3-a866-34c652247b2e", "title": "3 family members stabbed after coming to man aid during attack in apartment parking lot on Crescent Park Drive , police say", "date": "2024-08-20 13:30", "url": "https://abc13.com/post/3-family-members-stabbed-after-coming-mans-aid-during-attack-apartment-parking-lot-crescent-park-drive-police-say/15208502/", "domain": "abc13.com", "domain_classification": "Unknown", "message": "3 family members stabbed after coming to man's aid during attack in apartment parking lot, HPD saysPolice said one man was being stabbed by suspects accused of intentionally crashing into his car.\nWhen his family members tried to step in to stop it, they were attacked, too.\nWhen his family members tried to step in to stop it, they were attacked, too.\nWhen his family members tried to step in to stop it, they were attacked, too.\nThree family members of the man reportedly came out to try and help, and that's when they were also stabbed."}, {"id": "0afe18d4-b08c-494b-8cf0-0d639e13ecfc", "title": "Jury finds parents of Texas student accused in 2018 deadly school shooting not negligent", "date": "2024-08-20 01:15", "url": "https://www.clickondetroit.com/news/national/2024/08/19/jury-finds-parents-of-texas-student-accused-in-2018-deadly-school-shooting-not-negligent/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "(Jennifer Reynolds/The Galveston County Daily News via AP, Pool)GALVESTON, Texas – The parents of a former student accused of killing 10 people at a high school near Houston in 2018 do not bear financial responsibility for the shooting, a jury decided Monday.\nA lawsuit brought by victims and their families sought to hold Dimitrios Pagourtzis and his parents, Antonios Pagourtzis and Rose Marie Kosmetatos, accountable for the shooting at Santa Fe High School in 2018.\nIn April, Jennifer and James Crumbley were sentenced to at least 10 years in prison by a Michigan judge after becoming the first parents convicted in a U.S. mass school shooting.\nPagourtzis’ parents are not accused of any crime.\nThey need to feel safe when they go to school,” Galveston County Court at Law Judge Jack Ewing said after the verdict was delivered."}, {"id": "0bc8592a-32f5-42b2-8d69-56a21f710794", "title": "r in Alaska recovering after being mauled by bear – NBC Connecticut", "date": "2024-08-20 06:00", "url": "https://www.nbcconnecticut.com/news/national-international/hunter-in-alaska-recovering-after-mauled-by-bear-and-shot-amid-effort-fend-it-off/3366765/", "domain": "nbcconnecticut.com", "domain_classification": "Unknown", "message": "A hunter in Alaska was hospitalized after being mauled by a brown bear and shot during an effort to fend it off, authorities said Monday.\nThe bear attack occurred Saturday on the Kenai Peninsula, southwest of Anchorage, Alaska State Troopers said.\nIt was not immediately clear who fired the shot that struck him, troopers spokesman Tim DeSpain said in an email.\nDeSpain said the mauling occurred in a remote area off the Resurrection Pass trail.\nThe injured hunter, whose identity was not immediately released, was flown by helicopter to an Anchorage hospital."}, {"id": "7cbc22df-e7a6-47c4-a059-c0e3245fca59", "title": "Rep . Ivey relishes new assignment on assassination task force", "date": "2024-08-20 01:00", "url": "https://www.yahoo.com/news/rep-ivey-relishes-assignment-assassination-230037565.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Rep. Glenn Ivey (D-4th), in a November 2023, file photo.\nIvey, who has been a prosecutor and a congressional investigator, said he is excited to be part of the task force investigating the July 13 assassination attempt on former President Donald Trump.\nIvey is one of six Democrats assigned to the 13-member special House task force that is investigating the shooting, which took place at a rally in Butler, Pa.\nDemocrats are also skeptical about the political motives of some of the Republican task force members.\nThe House task force is working even while Congress is on its summer recess, and is beefing up its staff, Ivey said."}, {"id": "582e4f5f-e8d4-41e3-bd1c-99aedef5e2fe", "title": "Jury finds parents of Texas student accused in 2018 deadly school shooting not negligent", "date": "2024-08-20 02:00", "url": "https://www.kiro7.com/news/jury-finds-parents/6PJF7TJU2JHBTIPRCCWJZJBPJ4/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "6d64be4e-5b45-4372-b3d7-fb9f4dae36f8", "title": "The largest hydrothermal explosions the world has ever known", "date": "2024-08-20 01:45", "url": "https://www.ksl.com:443/article/51100381/the-largest-hydrothermal-explosions-the-world-has-ever-known", "domain": "ksl.com", "domain_classification": "Unknown", "message": "Hydrothermal explosions, on the other hand, are far more common and more concerning than most people realize.\nJust a few months before the Biscuit Basin explosion, Poland said Yellowstone experienced another hydrothermal explosion in April, at Norris Geyser Basin.\nBut two of the largest hydrothermal explosions in Yellowstone's history are hidden in plain sight.\nThese colossal craters illustrate just how staggering and destructive hydrothermal explosions can be.\nAnd, no doubt, hydrothermal explosions will be part of the ongoing conversation about potential hazards."}, {"id": "304eb52b-2c1b-4c4c-ab34-7887aa552459", "title": "Jury finds parents of Texas student accused in 2018 deadly school shooting not negligent", "date": "2024-08-20 01:00", "url": "https://www.gjsentinel.com/news/us/jury-finds-parents-of-texas-student-accused-in-2018-deadly-school-shooting-not-negligent/article_c230a0d6-efb9-50fa-9007-6df7f09db8e7.html", "domain": "gjsentinel.com", "domain_classification": "Unknown", "message": "Rose Marie Kosmetatos, left, and her husband, Antonios Pagourtzis, parents of accused Santa Fe High School shooter Dimitrios Pagourtzis, listen to their attorneys discuss a motion Friday, Aug. 16, 2024, during their civil trial in Galveston County Court No.\n3 Judge Jack Ewing's courtroom at the Galveston County Courthouse in Galveston, Texas."}, {"id": "796b5eef-f680-429d-9fd0-6b672802f15e", "title": "Prevention Of Violence : Call for passage of Bill protecting doctors gains momentum | Bhubaneswar News", "date": "2024-08-20 01:00", "url": "https://timesofindia.indiatimes.com/city/bhubaneswar/call-for-passage-of-bill-protecting-doctors-gains-momentum/articleshow/112638255.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "We also published the following articles recentlyKolkata doctor rape-murder: Resident doctors' strike leads to disruptions in medical services at Lucknow hospitalsPatients at King George's Medical University, SGPGI, and RMLIMS faced severe disruptions as resident doctors went on strike following the death of a colleague at RG Kar Medical College.\nKolkata doctor murder-rape: Doctors continue protest at RG Kar Medical College and HospitalStudents and junior doctors at RG Kar Medical College in Kolkata protested the alleged rape and murder of a female colleague on August 9.\nMaha resident doctors body goes on strike today against docs rape-murder in KolkataThe BJ Medical College wing of Maharashtra's resident doctors halted all elective services to support nationwide protests following the rape and murder of a trainee doctor in Kolkata.\nThe protests, led by the Federation of Resident Doctors Association, called for improved security measures, a transparent investigation, and better working conditions.\n“If we do not work in a safe environment, our confidence will go down,” Yadav said."}, {"id": "f31a96fe-21f3-4fb7-a892-6a3d265b8932", "title": "Jury finds parents not negligent in 2018 school shooting", "date": "2024-08-20 12:30", "url": "https://poststar.com/news/nation-world/crime-courts/guns-firearms-courts-children-texas/article_f8764306-a1ad-53ba-8552-573859a42daf.html", "domain": "poststar.com", "domain_classification": "Unknown", "message": "The parents of a former student accused of killing 10 people at a high school near Houston in 2018 do not bear financial responsibility for the shooting, a jury decided Monday.\nA lawsuit brought by victims and their families sought to hold Dimitrios Pagourtzis and his parents, Antonios Pagourtzis and Rose Marie Kosmetatos, accountable for the shooting at Santa Fe High School in 2018.\nDimitrios Pagourtzis, now 23, was charged with capital murder, but the criminal case has been on hold since November 2019, when he was declared incompetent to stand trial.\nIn April, Jennifer and James Crumbley were sentenced to at least 10 years in prison by a Michigan judge after becoming the first parents convicted in a U.S. mass school shooting.\nDimitrios Pagourtzis' parents are not accused of any crime."}, {"id": "48ba91ba-a81b-4c9b-a6c7-586008a5dacd", "title": "Bill Maher Calls Trump Shooting  One of My Favorite Days of 2024  ", "date": "2024-08-20 00:00", "url": "https://www.thewrap.com/bill-maher-trump-shot-assassination-matt-friend/", "domain": "thewrap.com", "domain_classification": "Unknown", "message": "Bill Maher called the day of the assassination attempt on former President Donald Trump one of his 2024 highlights, clarifying that he’s happy Trump wasn’t murdered — because that also meant that he’d still be able to poke fun at the Republican candidate.\n“That is going to be one of my favorite days from 2024 … Yeah, that day — it’d be different if he got killed.\nNo tragedy happened — well, for one guy,” the host and comedian said, referring to the death of a member of the crowd in the assassination attempt.\n“A guy shoots at Trump, the guy behind him gets shot and killed — that’s so Trump.\nBut they did have chain emails, so you could stir people up and go, ‘Hey, aren’t you mad about this?"}, {"id": "e651bb74-d1d0-434a-b151-79d3bfa4d3fe", "title": "Kursk attack proves Kremlin red lines are a bluff : Kyiv", "date": "2024-08-20 10:00", "url": "https://tribune.com.pk/story/2489476/kursk-attack-proves-kremlins-red-lines-are-a-bluff-kyiv", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "A satellite image shows a bridge collapsed over the Seym river in the Glushkovo district, following a Ukrainian strike in the Kursk region, Russia, August 17, 2024.\nRussia said a third bridge had been struck and damaged on the Seym River that winds through the Kursk region bordering northeastern Ukraine.\nMore than 121,000 people have been evacuated from nine border districts in the Kursk region, Russia's emergencies ministry said.\nPush towards PokrovskUkrainian forces face a tough battle near Pokrovsk, a transport hub for Ukrainian forces.\nGerman defence stocks fell on Monday after a newspaper said the finance ministry would not approve additional applications for Ukraine military aid because of budget constraints."}, {"id": "b1526abd-ca46-427c-85b0-820d3117ca77", "title": "China Condemns Killing of Hamas Leader", "date": "2024-08-20 02:15", "url": "https://www.frontpagemag.com/china-condemns-killing-of-hamas-leader/", "domain": "frontpagemag.com", "domain_classification": "Unknown", "message": "A report by United Press International recently indicated that China is virtually encouraging Iran to attack Israel.\nContrary to what Wang Yi told Ali Bagheri, Iran is hardly a representative of “peace” in the region.\nCommunist China is politically anti-Israel, as it is anti-American and anti-Western, despite its complex economic ties and cooperation with the West.\nIn 2021, China and Iran signed a $400 billion accord, creating a power shift that Forbes described as threatening Western interests.\nChina has also provided the Islamic Republic full membership in the BRICS group (Brazil, Russia, India, China and South Africa) and the Shanghai Cooperation Organisation (SCO)."}, {"id": "9c7693cb-6215-4670-95e7-8f4005d4d9a4", "title": "Israeli military recovers bodies of 6 hostages in Gaza during cease - fire negotiations", "date": "2024-08-20 12:00", "url": "https://www.wcti12.com/news/nation-world/israeli-military-recovers-bodies-of-6-hostages-in-gaza-during-cease-fire-negotiations-hamas-october-7-attack-mediators-us-arab-antony-blinken-middle-east-palestinian-prisoners-netanyahu-idf-israel-defense-forces", "domain": "wcti12.com", "domain_classification": "Unknown", "message": "The military said its forces recovered the bodies in an overnight operation in southern Gaza, without saying when or how the six died.\nThe recovery is a blow to Hamas, which hopes to exchange hostages for Palestinian prisoners, an Israeli withdrawal from Gaza and a .\nOver 100 hostages were released in exchange for Palestinians imprisoned in Israel during a weeklong cease-fire last year.\nAn Israeli airstrike in central Gaza early Tuesday killed five children and their mother, according to the nearby Al-Aqsa Martyrs Hospital, where an Associated Press reporter counted the bodies.\nThe hospital said the father, Alaa Abu Zeid, a schoolteacher, has been in Israeli detention for the last nine months."}, {"id": "6619bd24-f71e-4e6a-bab4-c8fddffdd5ff", "title": "Star Wars Boba Fett figure sells for £1m at auction to become most expensive toy ever", "date": "2024-08-20 11:00", "url": "https://www.dailystar.co.uk/news/latest-news/star-wars-boba-fett-figure-33500062", "domain": "dailystar.co.uk", "domain_classification": "Unknown", "message": "Get the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailNever miss any of the fun stuff.\nGet the biggest stories and wackiest takes from the Daily Star, including our special WTF Wednesday emailA rare Star Wars action figure sold for a whopping £1 million this week.\nREAD MORE: UK set for '200 Covid deaths per week' for years as doc says one thing could make it worseClick for more of the latest news from across the world from the Daily Star.\nPreviously, an L-slot Boba Fett prototype sold for over £412,000, making this prototype the most expensive of its kind ever sold.\nThis was the first time one had come up for auction, making it a once-in-a-lifetime opportunity to purchase this grailFor the latest breaking news and stories from across the globe from the Daily Star, sign up for our newsletters."}, {"id": "a3cc07b7-8a60-4977-a175-cd526caabd0b", "title": "Teenager accused of stabbing army chaplain further remanded in custody", "date": "2024-08-20 11:30", "url": "https://www.irishexaminer.com/news/courtandcrime/arid-41459461.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "The teenager, who cannot be identified as he is a minor, appeared by video-link at Galway District Court on Tuesday morning.\nHe told Judge Furlong that psychological services, which the judge requested be made available to the teenager, had not yet been provided.\nJudge Furlong told the 16-year-old that any bail application at this point was a matter for the High Court.\nSgt McNulty that Fr Murphy was not known to the accused and there was an ‘indiscriminate selection’ of the victim.\nHe told Judge Furlong that Fr Murphy is recovering after surgery in hospital."}, {"id": "98a72335-69b0-4779-a362-44e05637e83b", "title": "King visit to pay tribute to united kingdom stabbing victims", "date": "2024-08-20 10:00", "url": "https://www.singletonargus.com.au/story/8736780/kings-visit-to-pay-tribute-to-uk-stabbing-victims/", "domain": "singletonargus.com.au", "domain_classification": "Unknown", "message": "Three young girls were killed and others were wounded in the July 29 attack, which sparked the riots after online misinformation wrongly said it had been committed by an Islamist migrant."}, {"id": "07512ce5-29fb-47b7-bab0-6d6faa70606b", "title": "Israeli military recovers bodies of 6 hostages in Gaza during cease - fire negotiations", "date": "2024-08-20 14:00", "url": "https://katu.com/news/nation-world/israeli-military-recovers-bodies-of-6-hostages-in-gaza-during-cease-fire-negotiations-hamas-october-7-attack-mediators-us-arab-antony-blinken-middle-east-palestinian-prisoners-netanyahu-idf-israel-defense-forces", "domain": "katu.com", "domain_classification": "Unknown", "message": "The military said its forces recovered the bodies in an overnight operation in southern Gaza, without saying when or how the six died.\nThe recovery is a blow to Hamas, which hopes to exchange hostages for Palestinian prisoners, an Israeli withdrawal from Gaza and a .\nOver 100 hostages were released in exchange for Palestinians imprisoned in Israel during a weeklong cease-fire last year.\nAn Israeli airstrike in central Gaza early Tuesday killed five children and their mother, according to the nearby Al-Aqsa Martyrs Hospital, where an Associated Press reporter counted the bodies.\nThe hospital said the father, Alaa Abu Zeid, a schoolteacher, has been in Israeli detention for the last nine months."}, {"id": "1b927132-209c-4b6b-9040-2fb85b79a43c", "title": "Pentagon : US State Department OKs $3 . 5B sale of helicopters to South Korea", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/wmd/library/news/rok/2024/rok-240819-voa01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Pentagon: US State Department OKs $3.5B sale of helicopters to South KoreaBy VOA News August 19, 2024The U.S. State Department has approved a potential $3.5 billion sale of Apache helicopters, related equipment and missiles to South Korea, the Pentagon said Monday.\nWhile the State Department has approved the sale to South Korea, Congress must still sign off.\nThe announcement of the deal came on the same day the U.S. and South Korea began their annual joint military drills.\nThe South Korean leader has described North Korea as \"the most reckless and irrational country in the world.\"\nNorth Korea has regularly denounced the annual joint drills, accusing the U.S. and South Korea of practicing for an invasion of North Korea."}, {"id": "278f652b-1719-413b-a886-b67f823f7df2", "title": "Israeli military recovers bodies of 6 hostages in Gaza during cease - fire negotiations", "date": "2024-08-20 11:45", "url": "https://wjla.com/news/nation-world/israeli-military-recovers-bodies-of-6-hostages-in-gaza-during-cease-fire-negotiations-hamas-october-7-attack-mediators-us-arab-antony-blinken-middle-east-palestinian-prisoners-netanyahu-idf-israel-defense-forces", "domain": "wjla.com", "domain_classification": "Unknown", "message": "The military said its forces recovered the bodies in an overnight operation in southern Gaza, without saying when or how the six died.\nThe recovery is a blow to Hamas, which hopes to exchange hostages for Palestinian prisoners, an Israeli withdrawal from Gaza and a .\nOver 100 hostages were released in exchange for Palestinians imprisoned in Israel during a weeklong cease-fire last year.\nAn Israeli airstrike in central Gaza early Tuesday killed five children and their mother, according to the nearby Al-Aqsa Martyrs Hospital, where an Associated Press reporter counted the bodies.\nThe hospital said the father, Alaa Abu Zeid, a schoolteacher, has been in Israeli detention for the last nine months."}, {"id": "cadddf1e-54d9-4a1c-9daf-c1441deeb6c7", "title": "Napoleons Eagles 9 _ 5 file", "date": "2024-08-20 01:45", "url": "https://www.moddb.com/mods/napoleons-eagles/downloads/napoleons-eagles-9-5", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Follow the Emperor's Eagles from the first great victory of Castiglione to the last defeat of Waterloo.\nFollow the Emperor's Eagles from the first great victory of Castiglione to the last defeat of Waterloo.\nWe are proud to announce release of version 9.5 of the Napoleon's Eagles mode for NTW, also known as Historical Battles mod for NTW3.\nThis multiplayer mod has been part of NTW3 mod package from the very start and is now available as a stand-alone mod.\nThe mod is compatible with the version 9.5+ of NTW3 mod by the Lordz Modding Collective.The NE mod deals with the historical engagements of the Napoleonic Era."}, {"id": "acc531b7-fb9e-452b-898c-65df67f1034d", "title": "US and South Korea hold joint air drills to counter North Korea threat", "date": "2024-08-20 04:30", "url": "https://www.aol.com/us-south-korea-hold-joint-025623133.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "The drills are part of the annual Ulchi Freedom Shield exercises that are designed to boost the joint readiness of the South Korean and U.S. militaries against threats from North Korea, it said.\nAircraft on defensive patrol flights are being diverted to air combat scenarios under simulated drills involving mock enemy aircraft interdiction and cruise missile defence, it said.\nAircraft from two U.S. fighter wings based in South Korea are taking part, the air force said.\nThe United States stations 28,500 troops in the South for combined defence against nuclear-armed North Korea.\nNorth Korea routinely denounces the annual Ulchi Freedom Shield drills, which began on Monday and will run through to Aug. 29, for stoking tensions on the Korean peninsula, calling them rehearsals for a nuclear war."}, {"id": "73e1de5b-d9b7-40da-b299-fa02e67e1701", "title": "Russo - Ukraine War - 19 August 2024", "date": "2024-08-20 01:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-08-19.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\n\"To initiate a war of aggression... is not only an international crime; it is the supreme international crime differing only from other war crimes in that it contains within itself the accumulated evil of the whole.\"\nIn addition, 629 kamikaze drones were recruited and carried out over 3,400 shelling at the positions of Ukrainian troops and settlements.\nIn the Kharkiv direction, Russian forces five times attacked the defensive borders of Ukrainian warriors near lipcív and vovčans вавka.\nIn the Vremívs вихkomu direction, Russian forces carried out five assault actions, in particular towards Vodânogo."}, {"id": "cdbc436e-1ed7-4533-944a-3f5e93cd9a86", "title": "Former CIA director makes stop in Peoria , speaks about international wars", "date": "2024-08-20 01:00", "url": "https://www.yahoo.com/news/former-cia-director-makes-stop-221306290.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "PEORIA, Ill. (WMBD) — Leadership is important everywhere.\nThat’s the message of a special guest who spoke at a luncheon in East Peoria on Monday.\nHe mentions in his book why it is so important to be a good leader or have good leadership.\nHe also shared at the luncheon what is important about “strategic leadership.”“Now, strategic leadership is crucial in any endeavor,” he says.\n“CEO of Caterpillar is a strategic leader."}, {"id": "de09841c-916b-41b0-90e3-ea2fd75977d9", "title": "Democratic National Convention in 2024 reminiscent of Chicago DNC riots in 1968", "date": "2024-08-20 00:30", "url": "https://www.10news.com/politics/america-votes/democratic-national-convention-in-2024-reminiscent-of-chicago-dnc-riots-in-1968", "domain": "10news.com", "domain_classification": "Unknown", "message": "But when you look back at the Democratic National Convention in 1968, it takes you back to a time of national turmoil, political uncertainty and war.\n\"There was nothing like '68 where right on the floor of the convention you had, like, warring factions.\"\nPresident Johnson increased the number of American troops in Southeast Asia and by 1968, more than half a million troops were serving in Vietnam.\nThe Democratic Party did not look like it was in control of itself or could get control of anything,\" he said.\nThe anti-war movement and the protests at the DNC in 1968 introduced us to the Chicago Eight — they were the first to be indicted for conspiracy and crossing state lines to incite a riot."}, {"id": "9a303374-142e-41ac-8e04-9792055586db", "title": "Yoon calls for strengthening readiness against N . Korea  gray zone  provocations", "date": "2024-08-20 00:45", "url": "https://en.asiatoday.co.kr/view.php?key=20240820000924525", "domain": "en.asiatoday.co.kr", "domain_classification": "Unknown", "message": "1AsiaToday reporter Chun Hyun-binPresident Yoon Suk-yeol called for strengthening readiness against North Korea’s “gray zone” provocations, as South Korea and the United States kicked off their annual joint exercise on Monday.\n“Anti-state forces threatening the country’s liberal democracy are active everywhere in society,” he said.\nYoon stressed that internal forces threatening liberal democracy as anti-state forces, and ordered the establishment of a firm defense posture against the North.\n“We plan to significantly expand the South Korea-U.S. joint field training exercises,” he said.\n“Only a strong security posture can protect the safety of the people and liberal democracy.”"}, {"id": "dfbb23e2-b5f8-4d85-b177-f701643d865a", "title": "Reenactors and researchers recall San Antonio  first tragedy  ", "date": "2024-08-20 00:30", "url": "http://www.expressnews.com/news/texas/article/first-texas-revolution-1813-19659224.php", "domain": "expressnews.com", "domain_classification": "Unknown", "message": "The ceremony commemorated the 211th anniversary of the bloodiest battle in Texas history.\nThe ceremony commemorated the 211th anniversary of the bloodiest battle in Texas history.\nThe annual gathering commemorates the anniversary of the bloodiest battle in Texas history.\nARTHUR H. TRICKETT-WILE/SAN ANTONIO EXPRESS-NEWS Atascosa County Historical Commission Chairman Martin Gonzales bows his head in prayer Saturday at the Battle of Medina Symposium in Leming.\nARTHUR H. TRICKETT-WILE/SAN ANTONIO EXPRESS-NEWS Sons of the American Revolution in period costume fire a black-powder musket salute at Saturday’s annual Battle of Medina Symposium in Leming."}, {"id": "e20b9e38-e480-4054-8d90-69ec5920611b", "title": "Sgt . Yuval Ben Yakov legacy : Addressing antisemitism and unity", "date": "2024-08-20 00:15", "url": "https://www.jpost.com/opinion/article-815375", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "On October 7, 2023, the first day of the war triggered by Hamas’s barbaric attack on Israel, my son, Sgt.\nYuval Ben Yakov (z”l), fell heroically defending our country.\nFor decades, I have professionally supported the development of vital connections between Israel and Jewish communities.\nThe dangers of social mediaSocial media, widely and almost unrestrictedly spreading xenophobic and antisemitic content, only accelerates this process.\nIn recent years, notable incidents rooted in antisemitism have been documented in the US, EU, and many other regions."}, {"id": "172cc427-07f1-44b2-affe-9a2c4ec24376", "title": "Navy Installs New MQ - 25 Ground Control Station Aboard USS George HW Bush Carrier", "date": "2024-08-20 00:00", "url": "https://executivegov.com/2024/08/navy-installs-new-mq-25-ground-control-station-aboard-uss-george-hw-bush-carrier/", "domain": "executivegov.com", "domain_classification": "Unknown", "message": "The U.S. Navy has completed installing a new control room for the MQ-25 Stingray onboard the USS George H.W.\nBush aircraft carrier.\nCalled the Unmanned Air Warfare Center, the ground control station—a.k.a.\nAir vehicle pilots will use the UAWC to control the Stingray’s airborne operations moving forward.\nAccording to Unmanned Carrier Aviation Program Manager Capt."}, {"id": "5c7ec927-2462-4503-9d9e-b5ac4e4d2faa", "title": "How Ukraine turned the war on its head with surprise attack on southern Russia", "date": "2024-08-20 00:45", "url": "https://krdo.com/news/national-world/cnn-world/2024/08/18/how-ukraine-turned-the-war-on-its-head-with-surprise-attack-on-southern-russia/", "domain": "krdo.com", "domain_classification": "Unknown", "message": "Ukrainian forces also used detailed knowledge of the geography to launch the attack, using forest belts for cover and roads for speed.\nKey to their success: air defenses and supporting artillery, as well as jamming to prevent the Russian military from communicating.\nMany of its residents were sent scrambling on hair-raising escapes, some cursing the Russian military for abandoning them.\nAt the same time, the Ukrainians trained their attention on Russian reinforcements, wiping out one convoy of 14 Russian military vehicles near Rylsk with a missile attack.\nIf they can set robust defensive positions … they can stay inside Russian territory for a long time,” he said."}, {"id": "3ebc2a84-355a-4ccc-88de-93f86e1c97c6", "title": "Call of Duty : Modern Warfare 3 Adds The Crow Crossover in Season 5 Reloaded", "date": "2024-08-20 00:00", "url": "https://comicbook.com/gaming/news/call-of-duty-mw3-the-crow-crossover-ps5-xbox-pc/", "domain": "comicbook.com", "domain_classification": "Unknown", "message": "With Call of Duty: Modern Warfare 3 and Warzone, players have seen everything from The Boys to Cheech and Chong make an appearance in the hit first-person shooter franchise.\nOn August 21st, the team is dropping Season 5 Reloaded, the mid-season patch that brings a ton of new content to Call of Duty: Modern Warfare 3, including a big, new crossover skin.\nThe Crow is the latest media property to get a crossover in Call of Duty.\nThe Ghost Punk Pro Pack features a punk rock version of the popular Call of Duty character, while the Playmaker Pack features an all-gold Operator to celebrate the Call of Duty League.\nCall of Duty: Modern Warfare 3 and Warzone are available now on PlayStation, Xbox, and PC platforms."}, {"id": "e9fa7fb5-61e7-4ffc-8b56-71e625c6c21a", "title": "101st Airborne Division Conducts Medical Training Simulation during Historic Long - Range Air Assault Exercise - Clarksville Online", "date": "2024-08-20 00:30", "url": "https://www.clarksvilleonline.com/2024/08/19/101st-airborne-division-conducts-medical-training-simulation-during-historic-long-range-air-assault-exercise/", "domain": "clarksvilleonline.com", "domain_classification": "Unknown", "message": "Fort Johnson, LA – Soldiers from the 101st Airborne Division (Air Assault) executed a major training exercise on August 18th, 2024, showcasing their capabilities in a large-scale, long-range air assault (L2A2) operation at the Joint Regional Training Center (JRTC).\nIt marked a historic milestone for the division as it was the first rotation at JRTC for a Mobile Brigade Combat Team.\nThe training exercise was comprehensive, encompassing a medical training simulation where soldiers reacted to contact and treated casualties under realistic combat conditions.\nThe scenarios tested the division’s readiness to conduct large-scale, long-range air assault missions, a core capability for the 101st Airborne Division.\nKnown as the “Screaming Eagles,” the 101st Airborne Division has a storied history of executing airborne and air assault operations with precision and excellence."}, {"id": "26f5f4a0-5731-4b8d-bb0a-6cd308639e6c", "title": "Whitney Meldrum - Hanna", "date": "2024-08-20 11:30", "url": "https://www.afr.com/by/whitney-meldrum-hanna-p537lx", "domain": "afr.com", "domain_classification": "Unknown", "message": "Whitney Meldrum-HannaStrategic advisorWhitney Meldrum-Hanna is an adviser at General Strategic Group and former head of strategy at Pedestrian Group."}, {"id": "bd8e4fe6-06a1-48a1-aaa3-8eedd0268212", "title": "Catholic Teen from Brooklyn Identified 71 Years After MIA in Korean War", "date": "2024-08-20 03:00", "url": "https://thetablet.org/catholic-teen-from-brooklyn-identified-71-years-after-mia-in-korean-war/", "domain": "thetablet.org", "domain_classification": "Unknown", "message": "The image shows Raymond — a typical teen in post-World War II Brooklyn — wearing a white t-shirt under a dark cardigan.\nThe RCT moved north along the east side of the Chosin Reservoir, while the Marines set up along the west side.\nThe Battle of Chosin Reservoir had begun.\nUnbeknownst to MacArthur’s intelligence officers, the Chinese already controlled the rugged terrain overlooking the Chosin Reservoir when Raymond’s unit arrived.\nFive years later, he had the grim task of preventing a massacre of his men at the Chosin Reservoir, including an estimated 600 wounded."}, {"id": "76c4feac-3584-48c0-8da6-48c32f254fae", "title": "Ukraine Kursk gambit upends some old assumptions about Russia and the war", "date": "2024-08-20 09:45", "url": "https://www.cbc.ca/news/politics/ukraine-russia-kursk-putin-1.7298943", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Ukrainian servicemen sit inside their APC after returning from the Russian Kursk region, near the Russian-Ukrainian border, Sumy region, Ukraine, on Wednesday, Aug. 14, 2024.\n\"I would tell anybody who would listen to go attack where the Russians aren't,\" said Karber, who has close contacts in Ukraine's military establishment.\nLISTEN: Will Ukraine's Kursk campaign pay off?\nTwo and half years after Russia first invaded, Ukraine has launched what might be its boldest counterattack yet: a push into the Kursk region.\nA satellite image shows a bridge collapsed over the Seym river in the Glushkovo district following a Ukrainian strike in the Kursk region, Russia, on August 17, 2024."}, {"id": "5c7ba89c-d09e-4b12-87f5-f62532e43f67", "title": "Lithuania starts construction of military base for German troops near Russian border", "date": "2024-08-20 02:00", "url": "https://www.yahoo.com/news/lithuania-starts-construction-military-german-003659249.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Lithuania on Aug. 19 began construction of a military base that will house up to 4,000 combat-ready German troops, with completion expected by the end of 2027.\nThis marks the first permanent foreign deployment for the German military since World War II.\nGermany made the commitment to station troops in Lithuania, a NATO and European Union member bordering Russia, in 2023.\nAdditionally, around 1,000 more German military personnel and civilian contractors will be stationed at other locations in Lithuania.\nTo support ongoing defense needs, including the construction of the base, Prime Minister Ingrida Simonyte's government has raised taxes for the coming years."}, {"id": "98d183fd-e0cc-4a17-9f9f-ced18802c7b5", "title": "Marvel vs . Capcom Fighting Collection : Arcade Classics Clash of Super Heroes trailer", "date": "2024-08-20 00:45", "url": "https://nintendoeverything.com/marvel-vs-capcom-fighting-collection-arcade-classics-clash-of-super-heroes-trailer/", "domain": "nintendoeverything.com", "domain_classification": "Unknown", "message": "It’s time for another Marvel vs. Capcom Fighting Collection: Arcade Classics trailer, this time for Marvel vs. Capcom Clash of Super Heroes.\nLearn more about Marvel vs. Capcom Fighting Collection: Arcade Classics in the following overview:Dive into an action-packed lineup consisting of seven unique titles, including heavy hitters like X-Men Vs. Street Fighter, and Marvel vs. Capcom 2 New Age of Heroes.\nFor Capcom fans, fighting game enthusiasts, comic book and Super Hero aficionados, and everyone in between, Marvel vs. Capcom Fighting Collection: Arcade Classics offers a timeless celebration of a legacy fighting game series, delivering a diverse roster of iconic characters, enhanced features and competitive gameplay.\nSee the the Marvel vs. Capcom Fighting Collection: Arcade Classics trailer for Marvel vs. Capcom Clash of Super Heroes below.\nMarvel vs. Capcom Clash of Super Heroes TrailerMarvel vs. Capcom Fighting Collection: Arcade Classics launches on Switch in 2024."}, {"id": "052ff044-d151-476f-9a93-9f78e7624743", "title": "Ukraine Russia incursion may be hard to sustain : analysts", "date": "2024-08-20 14:00", "url": "https://www.yahoo.com/news/ukraines-russia-incursion-may-hard-115150083.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The incursion has covered 1,250 square kilometres (482 square miles) so far, according to Ukraine, while Russia says it has contained the Ukrainian attack.\nBut after rapid early advances, the Ukrainian attack has slowed as Russia deploys more solid defences.\nUkraine's position in Russia could become, over time, more fragile especially as Moscow's army continues to make steady gain in Ukraine.\n- Cautious allies -Ukraine's western allies have been reacting cautiously to the Ukrainian incursion, worried that their weapons could be used on Russian soil, possibly sparking a strong Russian reaction.\nBut Britain and western allies have put limits on the use of long-range missiles, such as the Storm Shadow cruise missile, to avoid escalating the conflict."}, {"id": "f6e60823-9dc3-48c6-98da-b004d9f71bcd", "title": "Ukraine - Russia war : Kursk attack shows Kremlin red lines are bluff , says Kyiv", "date": "2024-08-20 08:45", "url": "https://www.irishtimes.com/world/europe/2024/08/20/ukraine-russia-latest/", "domain": "irishtimes.com", "domain_classification": "Unknown", "message": "He said Ukraine, because of the restrictions imposed by allies, could not use the weapons at its disposal to hit some Russian military targets.\nHe urged allies to be bolder in their decisions about how to help Kyiv in the war.\nUkrainian forces face a tough battle near Pokrovsk, a transport hub for Ukrainian forces.\nHe said up to 600 people were leaving on a daily basis, and that municipal services could be cut off within a week as Russian forces close in.\nGerman defence stocks fell on Monday after a newspaper said the finance ministry would not approve additional applications for Ukraine military aid because of budget constraints."}, {"id": "c81e06e0-a05b-410e-955d-cf732d80e2a4", "title": "Everything new in Delta Force : Hawk Ops Summer Carnival Update", "date": "2024-08-20 02:00", "url": "https://www.destructoid.com/everything-new-in-delta-force-hawk-ops-summer-carnival-update/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Delta Force: Hawk Ops‘ Summer Carnival update has finally dropped, and it brings a lot to the table.\nThanks to the Summer Carnival update, we can play a new mode in Havoc Warfare.\nNew EventsMandelBrick Showdown is the first event of the Summer Carnival update that started on August 16 and ends on August 22 at 23:59 (UTC+0).\nLimited-Time event: Weekend CarnivalFrom August 16 to August 19, Weekend Carnival had a higher MandelBricks drop rate.\nThe ones we’ve mentioned below will help you level up weapons faster and benefit the gameplay experience:250K Tekniq Alloys3x Premium Weapon EXP Coins200x Ahsarah Gold CoinsThat’s all for the Delta Force: Hawk Ops Summer Carnival update."}, {"id": "5c247396-c917-4c5e-8ad1-4774d6ba7d90", "title": "Oregon Army Guard Soldiers Prepare to Deploy Overseas", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/military/library/news/2024/08/mil-240819-arnews01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Oregon Army Guard Soldiers Prepare to Deploy OverseasBy Sgt.\n1st Class Cory Grogan, Oregon Military Department Joint Forces Headquarters August 19, 2024SALEM, Ore. -- Oregon Army National Guard 41st Infantry Brigade Combat Team Soldiers were honored Aug. 16 as they prepared to deploy with the NATO-led Kosovo Force for a year-long mission.\n\"The 41st IBCT brings a robust set of capabilities to support the people of Kosovo.\nTo prepare for their deployment, the 41st IBCT will first undergo pre-mobilization training at Fort Cavazos, Texas, followed by additional training in Germany.\nGen. Daniel Hokanson, chief of the National Guard Bureau and member of the Joint Chiefs of Staff, also attended the ceremony."}, {"id": "4ec89494-11a1-4224-8ce1-8517e2025e8a", "title": "US approves $3 . 5 billion sale of Apache helicopters to South Korea", "date": "2024-08-20 01:15", "url": "https://www.defensenews.com/pentagon/2024/08/19/us-approves-35-billion-sale-of-apache-helicopters-to-south-korea/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The U.S. State Department on Monday approved the sale of up to 36 AH-64E Apache helicopters, logistics and support to South Korea in a deal worth $3.5 billion.\nSouth Korea would also buy up to 76 GE T700 engines, two installed in each helicopter, plus four more spares.\nAlong with the helicopters, South Korea also wants to buy hundreds of missiles to arm them — including 456 Hellfire Missiles, 6 Captive Air Training Missiles and 152 Joint Air-to-Ground Missiles.\nThe primary vendors for the proposed sale to South Korea are Boeing and Lockheed Martin.\nSouth Korea previously purchased 36 AH-64E Apaches in 2013, an order that was completed in early 2017."}, {"id": "8f9c5845-a253-4698-8e63-ac3db6c50109", "title": "Doctor Who Spin - Off Gets Production Update : Showrunner Russell T . Davies Shares Glimpse", "date": "2024-08-20 11:30", "url": "https://www.pinkvilla.com/entertainment/hollywood/doctor-who-spin-off-gets-production-update-showrunner-russell-t-davies-shares-glimpse-1340759", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "Recently, the announcement of a science-fiction spinoff has heightened the excitement, and showrunner Russell T. Davies has now provided a major update on this development.\nRussell Davis, co-producer of the series shared a tiny update about the series on his social media page.\nIn the recent San Diego Comic-Con, Russell Davis spoke about the spinoff, sharing every detail with fans.\nApart from this, Ncuti Gatwa, seen in the recent Doctor Who series (Fifteenth Doctor), is returning with a second season.\nALSO READ: Gugu Mbatha-Raw And Russell Tovey To Lead Doctor Who Spinoff: The War Between The Land And Sea?"}, {"id": "6745e6fd-d22d-4a17-9c55-80b84c89549d", "title": "Why WWE CM Punk Calling Himself A  Professional Wrestler  Pisses Drew McIntyre Off", "date": "2024-08-20 01:45", "url": "https://www.wrestlinginc.com/1646217/wwe-cm-punk-calling-professional-wrestler-pisses-drew-mcintyre-off/", "domain": "wrestlinginc.com", "domain_classification": "Unknown", "message": "Advertisement\"The thing that drives me most crazy is that he goes around masquerading, calling himself a professional wrestler.\nHe's no longer a professional wrestler.\nThere is nothing wrong with being an attraction, we need attractions, but don't f***ing say you're a professional wrestler if you're not a professional wrestler.\nI'm a professional wrestler.\"\nMcIntyre went off on Punk throughout the interview, saying Punk quit the company while McIntyre and the rest of the roster \"worked their a**** off 52 weeks a year.\""}, {"id": "265292fc-9f19-4866-8ece-ec38306de244", "title": "Links 8 / 20 / 2024 | naked capitalism", "date": "2024-08-20 11:45", "url": "https://www.nakedcapitalism.com/2024/08/links-8-20-2024.html", "domain": "nakedcapitalism.com", "domain_classification": "Unknown", "message": "NBERThe end of menopause: would women be healthier and happier if they menstruated for ever?\n*Sigh* This really underplays HRT as an alternative.\nHRT has been demonized for increasing cancer risk, but when started either before 60 or within two years of menopause, it reduces all factor mortality.\nAny increase in cancer incidence is more than offset by improvement in heart health.\nEric S:I wanted to submit a picture of our kitty, Skippy, for the antidote du jour."}, {"id": "47ce23ab-cc23-4996-aaa7-d9032443f6e0", "title": "Putin bluffing on retaliation threats , says Zelenskyy - as Ukraine takes more ground ... ", "date": "2024-08-20 01:00", "url": "https://www.heart.co.uk/news/uk-world/putin-bluffing-on-retaliation-threats-says-ze/", "domain": "heart.co.uk", "domain_classification": "Unknown", "message": "Putin bluffing on retaliation threats, says Zelenskyy - as Ukraine takes more ground in KurskThe Kremlin's threats of retaliation are a bluff, Ukraine's president Volodymyr Zelenskyy has claimed, with his country's forces now said to be in control of 90 settlements in the Russian border region of Kursk.\nRussian troops have steadily advanced towards the city in recent weeks.\nRussian presidential aide Yuri Ushakov said Moscow was not ready to hold peace talks with Ukraine for now, given the attack on Kursk.\nMeanwhile, Ukraine has demanded a full withdrawal of Russian troops from its territory before it sits down for any talks.\n(c) Sky News 2024: Putin bluffing on retaliation threats, says Zelenskyy - as Ukraine takes more ground in Kursk"}, {"id": "f43d6563-0390-43f9-8183-ea2282280f1c", "title": "Black Myth : Wukong review - ape escapades", "date": "2024-08-20 11:30", "url": "https://www.stuff.tv/review/black-myth-wukong-review/", "domain": "stuff.tv", "domain_classification": "Unknown", "message": "Stuff Verdict A stunning beacon for China’s future in AAA gaming, but Black Myth: Wukong is dragged down by bugs and frustrating design decisions.\nBlack Myth: Wukong could change that.\nIt’s an exquisite treat to behold, yet also surprisingly not limited to players with the fanciest rig; you can technically run Black Myth: Wukong on your PC with even the ageing GTX 1060.\nThere’s probably a version of Black Myth: Wukong that could have just been a straight-up action game, but the developer has decided to stubbornly place Soulsy constraints.\nBlack Myth: Wukong verdictBlack Myth: Wukong is as mesmerising as it is frustrating."}, {"id": "a1f22038-9667-4c3f-b66c-8ecbbe2cb509", "title": "Transnistrian Tanks Seen with Anti - Drone Grills", "date": "2024-08-20 11:45", "url": "https://www.kyivpost.com/post/37672", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "AdvertisementThe threat from first person view (FPV) kamikaze drone on the battlefield in Ukraine has seen both the Ukrainian and Russian military fitting similar technology.\nThe T-64 main battle tank was introduced into service by the USSR in the 1960s and has been widely used by several countries, including Russia and Ukraine.\nIt is 6.54 meters (21.5 feet), 3.41 meters (11.2 feet), and 2.17 meters (7.1 feet) high, and weighs around 38 tons.\nAdvertisementThe use of grills to protect tanks against drones in Ukraine has been adopted by other armed forces including that of Israel.\nThe Ukrainian military issues website, Militarnyi, reported that another of Russia’s regional allies, Belarus, was also equipping its T-72B tanks with grills."}, {"id": "5f7c412a-3f61-4f0c-a692-d19e7cc43757", "title": "Minister of National Defence Remarks at the Aerospace , Defence , and Security Expo ( ADSE ) ", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/wmd/library/news/canada/2024/canada-240819-canada01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Minister of National Defence Remarks at the Aerospace, Defence, and Security Expo (ADSE)National DefenceSpeechAugust 9, 2024Thanks, Tracy, for that kind introduction.\nWe are recapitalizing and rebuilding the Royal Canadian Air Force from top to bottom - and replacing almost all of the RCAF's core fleets.\nThis project is a prime example of how investments in defence are also investments in Canadian industry, Canadian workers and the Canadian economy.\nTaken together, these projects form the largest recapitalization and reinvestment in the Royal Canadian Air Force since the Second World War.\nAs our Air Force Commander is fond of saying, the Air Force of 2035 will look almost completely different from the Air Force of today."}, {"id": "f756b4c2-fe5a-4e20-90ef-9bc482a74cbb", "title": "  Chhaava  teaser : Vicky Kaushal unleashes battle as Chhatrapati Sambhaji Maharaj", "date": "2024-08-20 11:00", "url": "https://www.thestatesman.com/entertainment/bollywood/chhaava-teaser-vicky-kaushal-unleashes-battle-as-chhatrapati-sambhaji-maharaj-1503333438.html", "domain": "thestatesman.com", "domain_classification": "Unknown", "message": "The buzz is palpable as Vicky Kaushal and Rashmika Mandanna’s much-anticipated film, ‘Chhaava’, takes a giant leap forward with the release of its teaser.\nRevealed on Monday, the teaser offers a riveting glimpse into the historical drama that is set to showcase Vicky Kaushal in an electrifying role.\nIn the ‘Chhaava’ teaser, Vicky Kaushal brings to life the formidable Chhatrapati Sambhaji Maharaj, the son of the legendary Indian warrior Chhatrapati Shivaji Maharaj.\nShe also praised Vicky Kaushal, referring to him as “Maharaj,” and spoke fondly of their time working together, despite playful banter on set.\nFans and history enthusiasts alike are eagerly awaiting to see Vicky Kaushal and Rashmika Mandanna bring this epic story to life on the big screen."}, {"id": "47867f99-5a7e-46d9-b19f-ca7656d0d3e3", "title": "All Delta Force : Hawk Ops Operators , including classes and abilities", "date": "2024-08-20 02:00", "url": "https://www.destructoid.com/all-delta-force-hawk-ops-operators-including-classes-and-abilities/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Though Delta Force: Hawk Ops is still in the midst of its Alpha test, the tactical shooter offers a sizeable roster of Operators to choose from.\nRecommended VideosHavoc Warfare — Delta Force: Hawk Ops’ multiplayer game mode — deploys these units with gear, traits, and weapons to fit their respective jobs.\nAs you feel out your favored class and weapons, use our breakdown below of every Delta Force: Hawk Ops operator to learn who excels at what in better detail.\nHive-Tech Smoke Grenade tosses a smoke grenade that when hit by the Hive-Tech Pistol provides healing.\nThat’s all for Delta Force: Hawk Ops operators."}, {"id": "2846f7b2-7867-4bd0-bf3d-f2442023c83f", "title": "Lithuania to house combat - ready German troops , begins construction of base near Russia border", "date": "2024-08-20 11:15", "url": "https://www.firstpost.com/world/lithuania-to-house-combat-ready-german-troops-begins-construction-of-base-near-russia-border-13806503.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Germany committed to deploy troops in the NATO and European Union member, which borders Russia, last year.\nGerman Defence Minister Boris Pistorius compared the decision to the posting of allied forces in West Germany during the Cold War to defend Western Europe in case of a Soviet attack.\nAbout a thousand more German military and civilian contractors will be posted to other sites in Lithuania.\nDefence Minister Laurynas Kasciunas told reporters his ministry will award contracts for the rest of the works by the end of this year, when his government’s terms ends.\nAdvertisement“If we are not secure, there is no security for them,” Simonyte told reporters at the ceremony, referring to Germany."}, {"id": "0b1f2517-fb7d-46d0-b24f-da2bfde9a270", "title": "What if China gains control of Taiwan ? ", "date": "2024-08-20 07:30", "url": "https://news.webindia123.com/news/Articles/World/20240820/4226782.html", "domain": "news.webindia123.com", "domain_classification": "Unknown", "message": "Today, the fear is that China will invade Taiwan, overthrow a vibrant democracy and irreparably snap the so-called First Island Chain.\nTaiwan's annexation would disrupt Western techno-industrial supply chains for years to come, as China could control who it sold chips to.\nChina would likely be perceived as Asia's clear dominant power if it subsumed Taiwan, while managing to deter (or defeat) a US-led military intervention.\"\nChina would gain control of extremely sensitive military technology - after all, the USA is the Taiwan military's main benefactor and supplies advanced equipment - plus the USA would be less able to monitor Chinese military operations.\nAmerican policymakers must act urgently to deter PRC aggression and maximize capabilities to prevent China from coercively annexing Taiwan."}, {"id": "026b9af8-46da-4dd5-8a47-aa32ac4b2949", "title": "How to get Doctor Doom Arcane Gauntlets Mythic in Fortnite Chapter 5 , Season 4", "date": "2024-08-20 02:00", "url": "https://www.destructoid.com/how-to-get-doctor-dooms-arcane-gauntlets-mythic-in-fortnite-chapter-5-season-4/", "domain": "destructoid.com", "domain_classification": "Unknown", "message": "Fortnite Chapter 5, Season 4 marks the introduction of multiple powerful weapons like the War Machine set, Doctor Doom’s Monarch Pistol, and his Arcane Gauntlets.\nFortunately, although obtaining Doctor Doom’s Arcane Gauntlets is slightly challenging, they’re not luck-based like other weapons in the game.\nRecommended VideosDoctor Doom’s Arcane Gauntlets Mythic locationDoctor Doom’s Arcane Gauntlets are an exclusive drop from the Doombot boss in Castle Doom.\nOnce you get your hands on Doctor Doom’s Arcane Gauntlets, you can access its arsenal of attacks to get through the rest of the match.\nHow to damage opponents with Doctor Doom’s Arcane Gauntlets Mystical BombDuring the Fortnite x Marvel event, one of the kickstart quests asks you to damage opponents with Doctor Doom’s Arcane Gauntlets Mystical Bomb."}, {"id": "5be1d8c6-1096-4491-b0fd-9df94cd2ebfd", "title": "Alpha : Alia Bhatt and Sharvari to begin shooting for spy thriller next schedule in Kashmir ? ", "date": "2024-08-20 14:00", "url": "https://www.desimartini.com/movies/celebrities/alpha-alia-bhatt-and-sharvari-to-begin-shooting-for-spy-thrillers-next-schedule-in-kashmir/c6860b054c323/", "domain": "desimartini.com", "domain_classification": "Unknown", "message": "PAK vs BAN, 1st Test: Where can Indian fans watch Pakistan vs Bangladesh on TV, OTT and more"}, {"id": "b204be83-7455-4719-bc00-b5a7d29ee88e", "title": "Biden takes first ride in new Marine One as Sikorsky wraps delivery", "date": "2024-08-20 00:30", "url": "https://www.defensenews.com/air/2024/08/19/biden-takes-first-ride-in-new-marine-one-as-sikorsky-wraps-delivery/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The U.S. Marine Corps received the final batch of its 23 new VH-92A Patriot presidential transport helicopters last week, an air frame most famously known as Marine One when carrying America’s commander-in-chief.\nSikorsky, a subsidiary of Lockheed Martin, delivered the final VH-92A Patriot helicopter in a ceremony at the company’s Owego, N.Y., facility on Aug. 14, Lockheed and Naval Air Systems Command, or NAVAIR, said Monday.\nPresident Joe Biden on Monday took his first flight aboard the newest Marine One after years of delays to the program to replace the aging aircraft that carry the president and vice president.\nThe new Marine One helicopters, the VH-92A Patriot, are built by Sikorsky and are adaptations of the S-92 commercial helicopter.\nTwo of the 23 VH-92A helicopters will be used for testing, NAVAIR said, and the rest will be used for operations."}, {"id": "75b080d4-1615-4318-8a75-aad2c95f4a90", "title": "Blinken heads to Egypt , Qatar for ceasefire talks", "date": "2024-08-20 09:30", "url": "https://punchng.com/blinken-heads-to-egypt-qatar-for-ceasefire-talks/", "domain": "punchng.com", "domain_classification": "Unknown", "message": "US Secretary of State Antony Blinken headed to Egypt Tuesday for talks on a Gaza ceasefire as he pushes Hamas to accept a deal.\nBlinken, who met Israeli Prime Minister Benjamin Netanyahu in Jerusalem on Monday, will afterwards head to Qatar which along with Egypt is brokering negotiations for a truce in the 10-month Gaza conflict.\nHe will then head to meet Qatar’s emir, Sheikh Tamim bin Hamad Al-Thani, in Doha, the scene of ceasefire talks last week.\n“The United States is deeply committed to getting this job done, to getting it done now.”Blinken said on Monday that the ceasefire proposal could be the “last chance” as he raised pressure for a deal.\nA series of reports, however, say that Israel has raised new conditions in recent talks, including insisting on control of the Gaza border with Egypt that Israel seized from Hamas."}, {"id": "f430cc3b-01da-4a31-8614-c77fc34a8572", "title": "Sonic x Shadow Generations interview : Shadow the Hedgehog new Doom Powers detailed – PlayStation . Blog", "date": "2024-08-20 14:15", "url": "https://blog.playstation.com/2024/08/20/sonic-x-shadow-generations-interview-shadow-the-hedgehogs-new-doom-powers-detailed/", "domain": "blog.playstation.com", "domain_classification": "Unknown", "message": "Like thisThe launch of Sonic x Shadow Generations is coming fast this October, and everyone is curious to know more about Shadow the Hedgehog’s new Doom Powers!\nWhy are Shadow’s Doom Powers important to the story and gameplay?\nAs the name suggests, the Doom Powers draw energy from Black Doom, so that was taken into consideration in the design of all the Doom Powers.\nSonic x Shadow Generations is available for pre-order now starting at $49.99 on PlayStation 5 and PlayStation 4 consoles.\nTo learn more about various pre-order incentives, head to PlayStation Store or Sonic x Shadow Generations official website."}, {"id": "c4aeb311-1982-48d5-a7f1-1b107c3fb8ee", "title": "Walz introduced as  command sergeant major  at DNC meeting Walz reportedly does not clarify he retired as master sergeant", "date": "2024-08-20 00:30", "url": "https://www.theblaze.com/news/walz-introduced-as-command-sergeant-major-at-dnc-meeting-walz-reportedly-does-not-clarify-he-retired-as-master-sergeant", "domain": "theblaze.com", "domain_classification": "Unknown", "message": "\"I'm going to start with the title that's very important to me: the command sergeant major, Gov.\nShe also garbled another line and seemingly began to call Walz a \"command master sergeant,\" a rank which does not exist but could be an accidental portmanteau of \"command sergeant major\" and \"master sergeant,\" the rank at which Walz officially retired.\nAccording to the Post, Walz never clarified to AAPI Caucus meeting attendees that he retired as a master sergeant, not command sergeant major.\nThen, during his political career, he has also apparently repeatedly used the title command sergeant major, which could be misleading.\nHis discharge documents were later amended to say that he retired with the rank of master sergeant, not command sergeant major."}, {"id": "01f0b18a-d117-4b6f-ad66-7f7eb65da02b", "title": "Jack ODoherty - Bulletin of the Atomic Scientists", "date": "2024-08-20 11:30", "url": "https://thebulletin.org/biography/jack-odoherty/", "domain": "thebulletin.org", "domain_classification": "Unknown", "message": "Jack O’Doherty is a PhD student at the University of Leicester in the United Kingdom, researching US nuclear strategy and policy—specifically, disarming counterforce strategies.\nHe holds a BA in History and Politics and an MA in International Relations from University College Cork in Ireland.\nHis research interests include air and naval warfare, missile defense, anti-submarine warfare, and military science."}, {"id": "b645b01a-aa23-4b29-bb5d-fcfd87063e26", "title": "", "date": "2024-08-20 09:15", "url": "https://www.israelnationalnews.com/news/394896", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "In addition to the residential houses, the forces also destroyed sheep pens on both homesteads, and confiscated large quantities of equipment, including a solar panel array that provided electricity to the residents.\nThe homestead was established about a year and a half ago, east of the town of Michmas, and currently uses 2,500,000 square meters for agriculture and grazing.\nThe homestead is part of a series of Israeli farms stretching from Kochav Ya'akov in Binyamin to Hamra in the Jordan Valley.\nOr Meir is located on a ridge between Ofra and Givat Asaf, and boasts two flocks of sheep and 2,000,000 square meters of agricultural land.\n\"What happened here this morning is madness on every scale,\" residents declared."}, {"id": "8c55ff50-1933-4340-857f-0efd254adfd8", "title": "An elite Russian commander told Moscow troops that they would  go to heaven  if they died in Kursk", "date": "2024-08-20 10:00", "url": "https://www.yahoo.com/news/elite-russian-commander-told-moscows-081415595.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "An elite Russian commander told Moscow's troops that they would 'go to heaven' if they died in KurskAn elite Russian commander told Moscow's troops that they would 'go to heaven' if they died in KurskA Russian commander said that soldiers who died serving their country in Kursk would go to heaven.\nA Russian special forces unit commander told the parents of conscripts that their children would go to heaven if they died serving their country in Kursk.\nUkraine launched an offensive into Russia's Kursk region on August 6, taking both Russia and the West by surprise and forcing Russian President Vladimir Putin to divert some troops from Ukraine.\nFollowing the incursion, commander Apti Alaudinov said he observed parents demanding that their children be taken out of the combat zone.\nLast week, the country's intelligence said its forces in Kursk had captured 102 Russian soldiers."}, {"id": "d1237fde-e780-4ee0-9a30-a42eab75e1fa", "title": "Antimicrobial Resistance in Africa : A Growing Crisis with 27 . 3 Deaths per 100 , 000", "date": "2024-08-20 11:00", "url": "https://www.downtoearth.org.in/africa/amr-disproportionately-affects-africa-with-273-deaths-per-100000-africa-cdc", "domain": "downtoearth.org.in", "domain_classification": "Unknown", "message": "Despite the estimated $2-6 billion needed annually for an effective AMR response across Africa, current funding is only a tenth of that allocated to containing other major diseases.\nThis underfunding makes AMR a significant barrier to sustainable development, hindering progress toward the Sustainable Development Goals (SDG) and the African Union’s Agenda 2063.\nWithout timely intervention, this number is projected to reach 10 million by 2050, with Africa accounting for 4.5 million.\n\"Antimicrobial resistance is not just a health issue— it is a threat to our agrifood systems, food safety, food security, livelihoods and economies,” she said.\nTajudeen said that addressing AMR in Africa requires engaging all levels of society in a comprehensive and multi-sectoral approach."}, {"id": "4bca9b82-eba1-416d-bd7b-229d86b40650", "title": "DNC Makes Tim Walz Stolen Valor Concerns Even Worse", "date": "2024-08-20 02:15", "url": "https://townhall.com/tipsheet/rebeccadowns/2024/08/19/dnc-continues-the-theme-of-walzs-stolen-valor-n2643608", "domain": "townhall.com", "domain_classification": "Unknown", "message": "Ever since he was selected as Vice President Kamala Harris’ running mate, concerns with stolen valor have followed Gov.\nTim Walz (D-MN).\nAdvertisementA DNC meeting in Chicago erroneously referred to Walz as \"Command Sergeant Major\" when introducing him, a rank he never had.\n🚨STOLEN VALOR ALERT🚨Freakish Timothy Walz was just introduced the DNC \"AAPI Caucus Meeting\" as \"Command Sergeant Major.\"\n🔥JD Vance: \"The closest Tim Walz has ever come to combat is when he let rioters burn Minneapolis to the ground a few years ago.\""}, {"id": "50d498d9-3f1e-407e-9438-caf52f70ff1e", "title": "Russian Defence Ministry report on repelling an invasion attempt of the AFU on the territory of the Russian Federation ( 19 August 2024 ) ", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/wmd/library/news/ukraine/2024/08/ukraine-240819-russia-mod01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Russian Defence Ministry report on repelling an invasion attempt of the AFU on the territory of the Russian Federation (19 August 2024)19.08.2024The Armed Forces of the Russian Federation continue to repel the AFU attempt to invade the territory of the Russian Federation.\nAttacks launched by assault detachments in the direction of Olgovka, Russkoye Porechnoye, and Cherkasskoye Porechnoye were repelled.\nThe AFU losses amounted to one tank, one infantry fighting vehicle, two armoured fighting vehicles, and more than 25 Ukrainian troops, four AFU servicemen were taken prisoner.\nThe operation to neutralise the AFU units is in progress.\nDepartment for Media Affairs and InformationNEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "afeb0b5a-693a-45c5-99b7-d1655b653258", "title": "Pacific Fleet undergoes air defence training in base of operations in Vladivostok", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/08/russia-240819-russia-mod02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Pacific Fleet undergoes air defence training in base of operations in Vladivostok19.08.2024Ships for the close protection of a sea area of the Pacific Fleet fleet undergo air defence drills in the base of operations in VladivostokAir defence crews trained to prepare OSA SAM systems and AK-630 artillery system to fire to repel mock enemy air attacks, including small-size reconnaissance and attack unmanned aerial vehicles.\nThe personnel practise destroying aerial targets by 12.7-mm Utyos high-calibre machine guns at the different hights and distances.\nThe exercise was carried out in accordance with the Pacific Fleet's combat training plan.\nTime standards for classifying targets and making air defence assets ready for combat use were met with a rating of 'good'.\nPress Service of the Eastern Military DistrictNEWS LETTER Join the GlobalSecurity.org mailing list Enter Your Email Address"}, {"id": "cc8e648a-c2c1-48b1-8019-af2574e8b5a3", "title": "Air Force strengthens international ties in Exercise Red Flag in Alaska", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/wmd/library/news/australia/2024/australia-240819-audod02.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Air Force strengthens international ties in Exercise Red Flag in AlaskaIssued by Defence Media19 August 2024Royal Australian Air Force (RAAF) aircraft and personnel have landed in Alaska to take part in Exercise Red Flag, a large-scale air-combat exercise hosted by the United States Pacific Air Forces Command.\nThis year, RAAF F-35A Lightning IIs will team up with United States combat and support aircraft to face simulated peer adversaries and ground-based air-defence systems.\n\"Exercise Red Flag Alaska enables United States and allied aviators to refine their operational concepts, enhance their capabilities, and develop strategies that strengthen deterrence and maintain a competitive edge,\" Group Captain Douglas said.\n\"The goal of Red Flag is learning as a team,\" Group Captain Douglas said.\nThe exercise will involve more than 260 Australian personnel operating from Joint Base Elmendorf-Richardson and Eielson Air Force Base in Alaska from 19-30 August 2024."}, {"id": "92fbe88b-4df6-4416-8480-6b07cc7153a9", "title": "CRPF inspector killed , 18th security casualty in J & K since May | India News", "date": "2024-08-20 01:00", "url": "https://timesofindia.indiatimes.com/city/jammu/crpf-inspector-killed-18th-security-casualty-in-jk-since-may/articleshow/112634727.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "The region falls on a key axis connecting Kathua, Udhampur, and Doda, which has been a conduit for terrorists entering Kashmir valley.\nThe dense vegetation in the upper reaches of these districts provides natural cover for terrorists.The recent surge in violence in Jammu region has been attributed to “highly trained intruders” from Pakistan, who are working in small, mobile groups of three to four terrorists.\nOfficials said terrorists have shifted their tactics from suicide attacks to a “hit-and-run” guerilla strategy, engaging in jungle warfare.\nThis change in strategy has proved fatal for security forces in several instances.Armed with sophisticated weapons such as M4 carbines and armour-piercing bullets, these groups are also using advanced tech, including iridium satellite phones and thermal imaging devices.\nTheir ability to coordinate attacks has become a major challenge for security forces, particularly in the region’s remote and rugged terrain."}, {"id": "af8c6641-c507-4e54-925e-cb25004a33b2", "title": "For Gladiator II Joseph Quinn , All Roads Lead To The A List", "date": "2024-08-20 11:45", "url": "https://www.vogue.co.uk/article/joseph-quinn-interview", "domain": "vogue.co.uk", "domain_classification": "Unknown", "message": "It’s a rainy summer afternoon and Joseph Quinn is giving me a tour of the plants on his balcony.\nFresh from fleeing blood-thirsty aliens in A Quiet Place: Day One, he’s about to transform into the Human Torch for Marvel’s The Fantastic Four alongside Pedro Pascal and Vanessa Kirby.\nPedro is hilarious – he kept morale up – and Paul set the precedent by working incredibly hard.\nThat’s where film is at its most powerful.”Cotton jacket and jeans, MHL by Margaret Howell.\nPoplin shirt and striped tie, Margaret Howell."}, {"id": "4cb49d14-6605-4d20-99f0-9cb8e3bf9f69", "title": "Blinken to head to Egypt on Gaza truce push", "date": "2024-08-20 09:30", "url": "https://www.al-monitor.com/originals/2024/08/blinken-head-egypt-gaza-truce-push", "domain": "al-monitor.com", "domain_classification": "Unknown", "message": "\"The time has come to end the ongoing war,\" Sisi told Blinken, according to an Egyptian statement, warning of the consequences of \"the conflict expanding regionally\".\nIsraeli military operations in Hamas-ruled Gaza have continued throughout the truce talks.\nIn recent weeks across Gaza, Israel has struck numerous schools the military said were being used by militants.\nThe military said Israeli forces had retrieved the bodies of six hostages from the southern Gaza district of Khan Yunis.\nThe Biden framework would freeze fighting for an initial six weeks while Israeli hostages are exchanged for Palestinian prisoners in Israeli jails and humanitarian aid enters Gaza."}, {"id": "9d6f5cfe-c2fc-4a79-86f4-22de95242aed", "title": "Rings of Power : What to Remember Before Season 2 Launches", "date": "2024-08-20 12:30", "url": "https://time.com/7010539/the-rings-of-power-recap/", "domain": "time.com", "domain_classification": "Unknown", "message": "The Rings of Power is back with a second season on Prime Video Aug. 29.\nMeanwhile, another elf named Celebrimbor forged three of the titular rings of power in an attempt to keep the elves from losing their immortality.\nThere will be fallout from Galadriel being duped by SauronMorfydd Clark and Charlie Vickers in 'The Lord of the Rings: The Rings of Power' Prime VideoGaladriel began Season 1 as a canary in the coal mine.\nIsildur is presumed deadMaxim Baldry as Isildur in The Rings of Power Ross Ferguson—Prime VideoIsildur is a relatively minor character in Season 1.\nThe Rings of Power is barreling toward this battle, which will probably occur in the final season of the series."}, {"id": "5ce151c7-5749-4a81-8d28-ee2339edebde", "title": "Overwatch 2 Season 12 release time , launch date , update patch notes , Juno , Clash mode | Gaming | Entertainment", "date": "2024-08-20 01:00", "url": "https://www.express.co.uk/entertainment/gaming/1938149/overwatch-2-season-12-release-time-date-update-patch-notes-juno", "domain": "express.co.uk", "domain_classification": "Unknown", "message": "Titled New Frontiers, Overwatch 2 Season 12 has an August 20 release date and a 6pm BST UK launch time on PS5 , PlayStation 4, Xbox Series X |S, Xbox One, PC and Nintendo Switch .\nThe new season will be available alongside a big new update, which introduces a new character, game mode, rewards and lots more.\nPatch notes will be available prior to launch on August 20, so keep checking back for the full list of changes.\nIn addition to a new hero, Blizzard will also release a new \"adrenaline-pumping\" game mode called Clash.\nNeedless to say, a new season also means a new Battle Pass, complete with a host of free and premium rewards."}, {"id": "2b792c4a-c39a-4082-a567-af9653daec1e", "title": "Former Saudi official alleges Prince Mohammed forged king signature on Yemen war decree", "date": "2024-08-20 01:30", "url": "https://santamariatimes.com/ap/international/former-saudi-official-alleges-prince-mohammed-forged-kings-signature-on-yemen-war-decree/article_01b03ac0-78f6-5251-8f9e-393809004eee.html", "domain": "santamariatimes.com", "domain_classification": "Unknown", "message": "A former Saudi official has alleged that Saudi Arabia’s Crown Prince Mohammed bin Salman forged his father’s signature on the royal decree that launched the kingdom’s yearslong, stalemated war against Yemen’s Houthi rebels"}, {"id": "52a4c3fa-597e-4b01-81bb-eb8a5e10039b", "title": "Strengthening Russia Northern Fleet Capabilities is Priority in Arctic", "date": "2024-08-20 10:00", "url": "https://www.globalsecurity.org/wmd/library/news/russia/2024/08/russia-240819-sputnik01.htm", "domain": "globalsecurity.org", "domain_classification": "Unknown", "message": "Strengthening Russia's Northern Fleet Capabilities is Priority in Arctic - Kremlin AideSputnik News20240819MURMANSK, Russia (Sputnik) - Strengthening the combat readiness of the Northern Fleet against the background of the growing military presence of the West in the Arctic is one of the priorities of ensuring Russia's national interests in this region, Russian presidential aide Nikolai Patrushev said on Monday.\n\"Strengthening the capabilities of the armed forces of the Russian Federation, including increasing the combat readiness of the Northern Fleet... is one of the priorities of ensuring national interests in the Arctic,\" Patrushev said in Murmansk at a meeting on ensuring Russia's national interests in the Arctic.\nThe United States and its allies have blocked Russia's chairmanship of the Arctic Council, the aide noted.\n\"The United States and its allies have in fact blocked Russia's chairmanship of the Arctic Council,\" Patrushev said at the meeting.\n\"At the same time, we are ready to resume dialogue and constructive interaction and cooperation with the Arctic states in the interests of peaceful development of the Arctic based on respect for our national interests,\" he added."}, {"id": "7b8f4c07-74c4-460b-9bbf-ccf7f318dfae", "title": "India launches project to combat microplastic contamination in food", "date": "2024-08-20 09:30", "url": "https://www.khaleejtimes.com/world/asia/india-launches-project-to-combat-microplastic-contamination-in-food", "domain": "khaleejtimes.com", "domain_classification": "Unknown", "message": "Photo: ReutersPublished: Tue 20 Aug 2024, 9:10 AMFood safety authorities in India have launched an innovative project to combat the growing global threat of microplastic contamination in food.\nThe Food Safety and Standards Authority of India's (FSSAI) new project recognises the global prevalence of microplastics in food items, alerted by the FAO.\nThe project is called 'Micro-Plastics and Nano-Plastics as Emerging Food Contaminants: Establishing Validated Methodologies and Understanding the Prevalence in Different Food Matrices'.\nThe project's findings will help restrict the extent of microplastic contamination in food imports into India and the export of Indian food products.\n\"The findings will contribute to the global understanding of microplastic contamination, making Indian research an integral part of the global effort to combat this environmental challenge,\" the FSSAI said."}, {"id": "4d27f9ed-da8d-4a95-b91c-4444a42e61c5", "title": "Latest Articles", "date": "2024-08-20 01:15", "url": "https://freerepublic.com/tag/*/index?more=4259490", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "The nearly 300-page report on Biden family corruption matters for many reasons, the most important of which is to restore America’s standing in the world.With Joe Biden out as Democrats’ candidate for president, the House of Representatives’ report on the impeachment inquiry released this morning may give off a “What difference, at this point, does it make?” vibe.After all, even if the House votes to impeach the president, the Senate won’t convict him and he’ll be out of office and politics forever in January 2024.\nThe nearly 300-page report nonetheless matters for many reasons, the most important of which is..."}, {"id": "ca0b540b-24f3-4815-9fce-f831d10c6917", "title": "Sabalenka ousts No . 1 Swiatek to reach Cincinnati final against Pegula", "date": "2024-08-20 09:30", "url": "https://dailytimes.com.pk/1219014/sabalenka-ousts-no-1-swiatek-to-reach-cincinnati-final-against-pegula/", "domain": "dailytimes.com.pk", "domain_classification": "Unknown", "message": "Aryna Sabalenka squandered nine match points but defeated world number one Iga Swiatek 6-3, 6-3 on Sunday, breaking through to her first final at the WTA and ATP Cincinnati Open.\nFour-time Cincinnati semi-finalist Sabalenka will rise to second in the WTA rankings with a week to go before the start of the US Open.\nSabalenka will play Monday’s final against US sixth seed Jessica Pegula, a 6-2, 3-6, 6-3 winner over Spain’s Paula Badosa.\nSabalenka had a battle on her hands to close out her win, with Swiatek putting up a huge battle in the closing stages.\nI’m really happy with the win, especially against Iga,” said Sabalenka."}, {"id": "d8f1ddb5-31f1-465e-bc26-1190a2c9a516", "title": "Maria Branyas Morera , world oldest person , passes away at 117", "date": "2024-08-20 11:30", "url": "https://economictimes.indiatimes.com/news/new-updates/maria-branyas-morera-worlds-oldest-person-passes-away-at-117/articleshow/112653319.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "It seems like you're already an ETPrime member withLogin using your ET Prime credentials to enjoy all member benefitsLog out of your current logged-in account and log in again using your ET Prime credentials to enjoy all member benefits."}, {"id": "24989809-8a18-492b-9c2d-e5bdc480a98f", "title": "Wildfire Recovery Actions : Update 1", "date": "2024-08-20 00:30", "url": "https://www.alberta.ca/release.cfm?xID=908533E7FCC06-BBB5-779A-CB73F87152D2903D", "domain": "alberta.ca", "domain_classification": "Unknown", "message": "Wildfire Recovery Actions: Update 1Monday marks the fourth day Jasper residents have been able to return to the town.\nRecovery efforts are ongoing and will be ongoing in the weeks and months ahead.\nSignificant work has been done to combat wildfire activity across the province, resulting in the lowest number of wildfires since early July."}, {"id": "12e02cd8-3c36-4390-a7eb-df5f941e8bc2", "title": "28 - year - old Air Force Staff Sgt . dies in non - combat related incident : Air Force", "date": "2024-08-20 01:15", "url": "https://www.yahoo.com/news/28-old-air-force-staff-223241014.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A 28-year-old airman who was supporting Operation Inherent Resolve died in a non-combat related incident last Thursday, according to the Air Force.\nU.S. Air Force Staff Sgt.\n28-year-old Air Force Staff Sgt.\nAir crews from Hurlburt Field, Fla., secure their aircraft at Cannon Air Force Base, N.M. Oct. 3, 2013.\nREAD ON THE FOX NEWS APPOriginal article source: 28-year-old Air Force Staff Sgt."}, {"id": "92236fb5-058a-432a-9719-3ebc62e78dd8", "title": "RUTH SUNDERLAND : Mpox has given these three healthcare shares a shot in the arm ... but investors should be wary", "date": "2024-08-20 11:00", "url": "https://www.dailymail.co.uk/money/markets/article-13760317/RUTH-SUNDERLAND-Mpox-given-healthcare-shares-shot-arm-investors-wary.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Regardless of the morality, investors should proceed with caution: investing in companies whose shares have surged due to mpox is a risky proposition.\nBavarian NordicMuch of the mpox market mania has centred around this Danish company.\nThe 32-year-old company, which will announce its first-half results this week, has the advantage of having the only mpox vaccine with approval in the US and Europe.\nAs well as its mpox vaccine, it has others including ones for tick-borne encephalitis, rabies, cholera and typhoid.\nEmergent is hoping for approval from drugs regulators to use the smallpox vaccine to combat that ailment."}, {"id": "88a323ff-a6a6-49a4-b530-f25ef4028f55", "title": "Kansas will pay $50 , 000 to settle a suit over a transgender Highway Patrol employee firing", "date": "2024-08-20 01:15", "url": "https://freerepublic.com/focus/f-news/4259508/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "Kansas will pay $50,000 to settle a suit over a transgender Highway Patrol employee’s firingAP (on their own site) ^ | August 15, 2024 | JOHN HANNAPosted on by SalmanTOPEKA, Kan. (AP) — Kansas will pay $50,000 to settle a federal anti-discrimination lawsuit filed by a former state Highway Patrol employee who claimed to have been fired for coming out as transgender.\nTo: SalmanJust remember all this if someone reboots Highway Patrol or CHiPS.\nMarch; Berosus; Bockscar; BraveMan; cardinal4; ...by 12 posted onby SunkenCiv (The Demagogic Party is a collection of violent, rival street gangs.)\nIsaiah 5:20by 20 posted onby Vision (Woke is communism and it has no place in America.\nDisclaimer: Opinions posted on Free Republic are those of the individual posters and do not necessarily represent the opinion of Free Republic or its management."}, {"id": "1e1d8a21-9813-402b-98da-43ba012e6598", "title": "Feuds , Custody Wars , and Power Plays : The Chaos Unfolding on The Young and the Restless", "date": "2024-08-20 01:00", "url": "https://tvovermind.com/feuds-custody-wars-and-power-plays-the-chaos-unfolding-on-the-young-and-the-restless/", "domain": "tvovermind.com", "domain_classification": "Unknown", "message": "Meet Saim \"Info Junkie\" Azeem, your go-to connoisseur of all things newsworthy.\nSaim has an insatiable appetite for the latest headlines, and devours stories like they’re the finest cuisine.\nWhether it’s breaking news, politics, entertainment, or the bizarre, he has a knack for uncovering the hidden gems in every story."}, {"id": "40b1aafa-06dc-4285-998b-4e52cf2bcccc", "title": "Brad Pitt Eldest Shiloh Drops Last Name Amid Angelina Jolie Drama", "date": "2024-08-20 01:00", "url": "https://www.thedailybeast.com/brad-pitts-eldest-shiloh-drops-last-name-amid-angelina-jolie-drama", "domain": "thedailybeast.com", "domain_classification": "Unknown", "message": "Brad Pitt and Angelina Jolie’s eldest daughter Shiloh has officially dropped her father’s last name following her 18th birthday.\nSeveral of her siblings had already made efforts to distance themselves from Pitt amid his eight-year divorce battle with Jolie.\nDaughter Zahara—whom Pitt and Jolie adopted in 2005—appeared to drop Pitt from her last name in November when she pledged with the Alpha Kappa Alpha, Inc at the historically Black Spelman College in Atlanta.\nDaughter Vivienne—who Pitt and Jolie welcomed with her twin brother, Knox, in 2008—also appeared to drop Pitt when she was credited as “Vivienne Jolie” for her role as a production assistant on Broadway’s The Outsiders.\nPitt has not publicly commented about the name snubs amid his eight-year battle with Jolie over the financial details of their separation, but multiple media outlets have reported that he has has been estranged from his children since 2016."}, {"id": "dd33d1f6-fefc-4872-8c69-8951d8e8c3e4", "title": "AMERICA Prayer Vigil - August 20 , 2024 ( Prayer ) ", "date": "2024-08-20 11:00", "url": "https://freerepublic.com/focus/f-religion/4259535/posts", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "AMERICA Prayer Vigil - August 20, 2024 (Prayer)Posted on by JeanblJoin with fellow FREEPERS to pray for AMERICA: For those in Authority in Government, Family, Military, Business, Healthcare, Education, Churches, and the Media.\n~ 1 Timothy 2:1-2 Religion Forum Threads labeled [Prayer] are closed to debate of any kind.\nTo: JeanblAmen to every word of your anointed prayer, Dear Jeanbl, in Jesus Name.\nTo: JeanblAmen Lord, we pray that the evil leading our government and our culture would fall away.\n20 Put them in fear, O Lord;let the nations know that they are only human."}, {"id": "45efbd7f-befd-464b-9325-be87903e3704", "title": "Latest Articles", "date": "2024-08-20 00:00", "url": "https://freerepublic.com/tag/*/index?more=4259484", "domain": "freerepublic.com", "domain_classification": "Unknown", "message": "f you find a message that is consistent over time, through times of ease and times of challenge, and at each challenge in the real world this message is validated, reinforced, and found to be correct — is that a message you need to pay attention to?\nSince the Houthi joined a second front with the Gazans against Israel by attacking international shipping in the Red Sea and its approaches, the US Navy has led the international response and has been engaged in continuous combat operations facing almost all anti-ship weapons that any navy would expect to face in 2024...."}, {"id": "83299dd4-a320-44a1-8e08-a013704ee1ec", "title": "Mr Bates vs The Post Office among National Television Awards shortlisted shows", "date": "2024-08-20 00:30", "url": "https://www.standard.co.uk/showbiz/celebrity-news/tv-drama-michelle-keegan-netflix-national-television-awards-baby-reindeer-b1177369.html", "domain": "standard.co.uk", "domain_classification": "Unknown", "message": "Actress Jessica Gunning has also been nominated for the gong for her role as Martha Scott in dark comedy thriller Baby Reindee, in which her character stalks comedian Donny Dunn after he offers her a free cup of tea in the pub where he works."}, {"id": "20f46f1c-882d-4fe8-9d5d-d38a37bd1965", "title": "As the Democratic Convention opens in Chicago , lessons from an eerily similar year : 1968", "date": "2024-08-20 00:15", "url": "https://www.americamagazine.org/faith/2024/08/19/parallels-1968-2024-david-obrien-248537", "domain": "americamagazine.org", "domain_classification": "Unknown", "message": "Public events take place today in 2024 that are eerily comparable to situations in another critical year: 1968.\nThe Tet offensive in February indicated it was being lost, and news and photos of atrocities raised unfamiliar moral questions.\nMy memories, like the memories of Ms. Kearns and Mr. Goodwin, reveal traces of a long-standing American innocence.\nThe Vietnam War continued for over four more years, more brutal than ever.\nOur current situation, like 1968, is a moment when that kind of faith can make a difference in history and in our own memories."}, {"id": "abe95e6a-d668-4a1f-b592-86f9b995470c", "title": "Best Limp Bizkit Album -  Significant Other  vs .  $3 Bill YAll  ", "date": "2024-08-20 00:15", "url": "https://loudwire.com/better-limp-bizkit-album-significant-other-vs-three-dollar-bill-yall/", "domain": "loudwire.com", "domain_classification": "Unknown", "message": "Which is the better Limp Bizkit album - Significant Other or Three Dollar Bill, Y'All?\nThis week on Loudwire Nights, you get to have your say as this Limp Bizkit battle takes center stage in Chuck's Fight Club.\nLimp Bizkit got their start with 1997's Three Dollar Bill, Y'All, quickly establishing themselves as one of the top new voices in nu-metal.\nThen Significant Other gets the spotlight at 8PM on Tuesday, with the host then making a case for Three Dollar Bill, Y'All on Wednesday.\nJust this reminder, Loudwire Nights with Chuck Armstrong airs nightly starting at 7PM ET."}]