[{"id": "713f9050-4fcc-4482-87af-ffb35bda926d", "title": "Global Turmoil : Leaders in Crisis and Conflict Unfolding", "date": "2024-05-31 00:30", "url": "https://www.devdiscourse.com/article/politics/2956116-global-turmoil-leaders-in-crisis-and-conflict-unfolding", "message": "The decision marks a policy shift by Biden, who had steadfastly refused to allow Ukraine to use American weaponry for strikes inside Russia.\nNorth Korean leader Kim Jong Un guided the firing drill of 600mm \"super-large\" multiple rocket launchers on Thursday, state news agency KCNA reported.\nRegional Governor Oleh Syniehubov said at least two children were among the injured in the attack, which occurred at about midnight local time.\nAfter two days of deliberation, the 12-member jury pronounced Trump guilty on all 34 felony counts he faced.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)"}, {"id": "cf986969-3f40-489d-9d7a-04fca9ef3970", "title": "Israel is accused by the world too easily during the war - editorial", "date": "2024-05-31 03:30", "url": "https://www.jpost.com/opinion/article-804432", "message": "A targeted IDF strike was carried out in Rafah on Sunday, targeting two Hamas leaders, which seemingly led to an explosion that killed 45 civilians.\nBoth Rabia and Nagar were in a compound a mile away from the humanitarian zone that was created to keep Palestinians safe when Israel targeted the terrorists in a precise airstrike.\nBut one thing is clear from even the shortest of closer looks into what happened on Sunday: Israel did not intentionally kill dozens of Palestinian civilians.\nThe IDF – Israel as a whole, in fact – knows to own up to its mistakes and to reach conclusions that would change future actions accordingly.\nHowever, the world media and critics of Israel afford it even less credibility than they do a terrorist organization."}, {"id": "07fd09b5-9b67-4804-b27c-43322a345a4d", "title": "Joe Biden allows Ukraine to use US weapons to conduct limited strikes inside Russia", "date": "2024-05-31 04:00", "url": "https://www.irishtimes.com/world/us/2024/05/31/joe-biden-allows-ukraine-to-use-us-weapons-to-conduct-limited-strikes-inside-russia/", "message": "The Biden administration has decided to allow Ukraine to strike inside Russia with US-made weapons with the aim of blunting Russia’s attacks in the Kharkiv area, senior US officials said.\nPhotograph: Finbarr O’Reilly/The New York TimesUS president Joe Biden has authorised Ukraine to conduct limited strikes inside Russia with US-made weapons, opening what could well be a new chapter in the war for Ukraine, US officials said Thursday.\nBecause Kharkiv is so close to Russia, Ukraine’s president Volodymyr Zelenskyy repeatedly pressed Mr Biden and his aides for the right to strike back inside Russia.\nA senior US official in Washington said the administration’s policy prohibiting Ukraine from using US-made weapons for “long range” attacks inside Russia had not changed.\nIt was Gen Cavoli who conveyed the decision to Ukraine, officials said."}, {"id": "f17fc9eb-e674-4fa6-9feb-25a1b3baf22c", "title": "Russia Destroys Ukrainian Magura Unmanned Surface Vessel with FPV Drone", "date": "2024-05-31 01:00", "url": "https://theaviationist.com/2024/05/30/fpv-vs-magura/", "message": "But the Ukrainian loss was interesting and rare, as it was first documented destruction of a USV (Unmanned Surface Vessel) with a kamikaze UAV (Unmanned Aerial Vehicle).\nRussia has long suffered under menacing Ukrainian USV strikes in the Black Sea and around the Sevastopol naval harbor.\nUnmanned Kamikaze Boat, Destroyed by Unmanned Kamikaze AircraftThe video, that went around on several Russian and Ukrainian Telegram groups, showed what appears to be a quadcopter-type drone rapidly approaching the Magura V5 USV.\n“Possibly the first documented case of a strike with an FPV drone targeting an unmanned surface vehicle (USV).\nMagura V5The Magura V5, developed and manufactured by FTE SPETSTECHNOEXPORT, is 5.5-meters in length, 0.5-meters in height, can carry a payload of 320-kg to a distance of 800-km."}, {"id": "9ccc4f70-6940-4414-bc13-6e6975fafe85", "title": "Israel Intercepts Cruise Missile Launched From Iraq", "date": "2024-05-31 00:30", "url": "https://www.zerohedge.com/geopolitical/israel-intercepts-cruise-missile-launched-iraq", "message": "Time of Israel is describing \"cruise missiles\" fired from Iraq and shot down over northern Israel on Thursday.\nOther Israeli outlets pointed to a single cruise missile inbound over Israel and possibly accompanied by drones, however.\n\"Following the interceptions, the pro-Iranian militias in Iraq claimed to have launched drones towards Eilat,\" Israel National News (Arutz Sheva) reported.\n\"Earlier today, following sirens regarding a hostile aircraft infiltration in the Golan Heights area, the IDF intercepted a cruise missile that approached Israel from the east,\" the IDF said.\nWednesday saw an Israeli airstrike hit deep inside Syria, in Baniyas city, though it's unclear what the precise target was."}, {"id": "2d9910b2-e196-4e10-b4ac-b9425541c63c", "title": "North Korea Kim supervises firing drills simulating preemptive attacks on South Korea", "date": "2024-05-31 03:45", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/north-koreas-kim-supervises-firing-drills-simulating-preemptive-attacks-on-south-korea/articleshow/110578335.cms", "message": "The state media on Friday reported that these drills were intended to demonstrate North Korea 's capability for preemptive attacks on neighbouring South Korea .These firing exercises seem to refer to what South Korea identified as a barrage of ballistic missile test-launches conducted by North Korea on Thursday.\nExperts highlight that North Korea's large artillery rockets blur the lines between artillery systems and short-range ballistic missiles .\n\"KCNA accused South Korea of staging a \"clumsy counteraction of dangerous armed demonstration against the exercise of legitimate sovereign right\" of North Korea.\nHad it succeeded, North Korea would have placed its second spy satellite into orbit.The multiple rocket launchers are a significant part of North Korea's arsenal aimed at South Korea.\nSouth Korea's military had earlier reported that North Korea fired about 10 suspected ballistic missiles into the sea off its east coast.The unsuccessful spy satellite launch by North Korea was strongly condemned by the US, South Korea, and others."}, {"id": "7e456038-9237-4a41-95af-145bf789e987", "title": "Experts : Israel could have used smaller bombs in Gaza tent fire", "date": "2024-05-31 01:15", "url": "https://www.eastbaytimes.com/2024/05/30/defense-experts-israel-could-have-used-smaller-bombs-in-gaza-tent-fire/", "message": "They said the bombs used were likely U.S.-made.\nBased on those images and satellite photos of the debris field, two defense experts said the bombs used were likely U.S.-made 250-pound (113-kilogram) GBU-39 small-diameter bombs.\nThough they’re smaller than many other weapons the U.S. has provided to Israel, these bombs can still create a wide swath of damage.\nThe defense experts said Israel had better options to turn to than the GBU-39 when civilians were nearby.\nSunday’s strike shows that even the smaller 250-pound bombs the U.S. has continued to provide can be too large for use near densely packed refugee areas, Cancian said."}, {"id": "6a155084-d04c-4281-bc9b-0833c5afd70b", "title": "North Korea Kim supervises firing drills simulating preemptive attacks on South Korea", "date": "2024-05-31 01:00", "url": "https://abcnews.go.com/International/wireStory/north-koreas-kim-supervises-firing-drills-simulating-preemptive-110699061", "message": "North Korea says leader Kim Jong Un supervised firing drills involving nuclear-capable, multiple rocket launchers to show the country’s ability to carry out preemptive attacks on rival South KoreaSEOUL, South Korea -- North Korean leader Kim Jong Un supervised firing drills involving nuclear-capable, multiple rocket launchers to show the country’s ability to carry out preemptive attacks on rival South Korea, state media reported Friday.\nThe exercises appeared to be the ballistic missile test-launches that South Korea detected from near North Korea's capital on Thursday.\nThat refers to a South Korean aerial exercise performed hours before North Korea's failed spy satellite launch on Monday night.\nSouth Korea's military earlier said North Korea fired about 10 suspected ballistic missiles toward the sea off its east coast.\nNorth Korea's failed spy satellite launch drew strong condemnation from the U.S., South Korea and others because the U.N. bans any satellite launches by North Korea, viewing them as covers for testing missile technologies."}, {"id": "faa9008c-a2c6-4354-a758-187531cca156", "title": "North Korea Kim supervises firing drills simulating preemptive attacks on South Korea", "date": "2024-05-31 03:15", "url": "https://www.startribune.com/north-koreas-kim-supervises-firing-drills-simulating-preemptive-attacks-on-south-korea/600369872/", "message": "SEOUL, South Korea — North Korean leader Kim Jong Un supervised firing drills involving nuclear-capable, multiple rocket launchers to show the country's ability to carry out preemptive attacks on rival South Korea, state media reported Friday.\nThe exercises appeared to be the ballistic missile test-launches that South Korea detected from near North Korea's capital on Thursday.\nKCNA accused South Korea of staging a ''clumsy counteraction of dangerous armed demonstration against the exercise of legitimate sovereign right'' of North Korea.\nThat refers to a South Korean aerial exercise performed hours before North Korea's failed spy satellite launch on Monday night.\nSouth Korea's military earlier said North Korea fired about 10 suspected ballistic missiles toward the sea off its east coast."}, {"id": "00a8b133-e8ce-4c70-af5c-c70e64ab69d0", "title": "Israel could have used smaller weapons against Hamas to avoid deaths in Gaza tent fire , experts say", "date": "2024-05-31 02:45", "url": "https://www.nzherald.co.nz/world/israel-could-have-used-smaller-weapons-against-hamas-to-avoid-deaths-in-gaza-tent-fire-experts-say/5N64QUJQHFHXFG2P7HWOMKRDCQ/", "message": "They said the bombs used were likely US-made.\nPalestinians fleeing from the southern Gaza city of Rafah during an Israeli ground and air offensive.\nBased on those images and satellite photos of the debris field, two defence experts said the bombs used were likely US-made 113kg GBU-39 small-diameter bombs.\nThough they’re smaller than many other weapons the US has provided to Israel, these bombs can still create a wide swath of damage.\nThe Israelis have previously deployed drones to launch weapons that are smaller and more precise, Cancian said."}, {"id": "19f20911-ee72-4972-8e4b-a98f6199124a", "title": "North Korea Kim supervises firing drills simulating preemptive attacks on South Korea", "date": "2024-05-31 01:30", "url": "https://www.thespec.com/news/world/asia/north-koreas-kim-supervises-firing-drills-simulating-preemptive-attacks-on-south-korea/article_51766435-268f-5f13-b8de-f1f6675410d6.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "89940690-926a-4b38-a1fa-39f0c312971c", "title": "Israel could have used smaller weapons against Hamas to avoid deaths in Gaza tent fire , experts say", "date": "2024-05-31 00:00", "url": "https://isp.netscape.com/news/world/story/0001/20240530/ada219d17926a14ca8c179338d53d109", "message": "Israel could have used smaller weapons against Hamas to avoid deaths in Gaza tent fire, experts sayWASHINGTON (AP) — Defense experts who have reviewed debris images from an Israeli airstrike that ignited a deadly fire in a camp for displaced Palestinians questioned why Israel did not use smaller, more precise weapons when so many civilians were nearby.\nThey said the bombs used were likely U.S.-made.\nBased on those images and satellite photos of the debris field, two defense experts said the bombs used were likely U.S.-made 250-pound (113-kilogram) GBU-39 small-diameter bombs.\nThough they're smaller than many other weapons the U.S. has provided to Israel, these bombs can still create a wide swath of damage.\nThe defense experts said Israel had better options to turn to than the GBU-39 when civilians were nearby."}, {"id": "bfae5046-f853-4251-bcef-9b51e4e49af3", "title": "North Korea Kim supervises firing drills simulating preemptive attacks on South Korea – Winnipeg Free Press", "date": "2024-05-31 00:15", "url": "https://www.winnipegfreepress.com/world/2024/05/30/north-koreas-kim-supervises-firing-drills-simulating-preemptive-attacks-on-south-korea", "message": "SEOUL, South Korea (AP) — North Korean leader Kim Jong Un supervised firing drills involving nuclear-capable, multiple rocket launchers to show the country’s ability to carry out preemptive attacks on rival South Korea, state media reported Friday.\nThe exercises appeared to be the ballistic missile test-launches that South Korea detected from near North Korea’s capital on Thursday.\n(AP Photo/Lee Jin-man)KCNA accused South Korea of staging a “clumsy counteraction of dangerous armed demonstration against the exercise of legitimate sovereign right” of North Korea.\nSouth Korea’s military earlier said North Korea fired about 10 suspected ballistic missiles toward the sea off its east coast.\nIn this undated photo provided on Friday, May 31, 2024 by the North Korean government, North Korean leader Kim Jong Un supervises firing drills at an undisclosed place in North Korea."}, {"id": "ed3b379c-f6f7-4d67-b045-9449cc17c3f0", "title": "Biden Allows Ukraine To Use US Weapons To Attack Inside Russia In Highly Dangerous Escalation", "date": "2024-05-31 04:15", "url": "https://www.zerohedge.com/geopolitical/dangerous-shift-escalation-biden-allows-ukraine-use-us-weapons-attack-inside-russia", "message": "The same official stipulated that the policy of not allowing long-range strikes inside Russia \"has not changed.\"\nBut the official said Ukraine cannot use those weapons to hit civilian infrastructure or launch long-range missiles, such as the Army Tactical Missile System, to hit military targets deep inside Russia.\nA reporter followed up by asking if he meant the White House will now support Ukrainian attacks inside Russia.\nThe Biden administration gave a non-Ukrainian foreign intelligence service permission to strike inside Russia using sleeper cells 48 hours prior to the invasion.\nhttps://t.co/Kdnn2EgJfJ — Jack Murphy (@JackMurphyRGR) May 30, 2024Russian President Vladimir Putin warned earlier this week there will be \"major consequences\" if NATO countries support long-range strikes on Russian territory."}, {"id": "0446a3f6-b9b1-41b3-82a3-fb86a24c6cc8", "title": "US says Russia using N . Korea missiles in Ukraine", "date": "2024-05-31 04:15", "url": "https://www.yahoo.com/news/us-says-russia-using-n-033805832.html", "message": "\"Analysis confirms that Russia used ballistic missiles produced in North Korea in its war against Ukraine,\" the DIA said in a statement released with the report on Wednesday.\nSoo Kim, a former CIA analyst, told AFP the fact Russia was using North Korean missiles was not a surprise.\nThe Kremlin told Russian media this month that a return visit by Putin to North Korea was \"being prepared\".\nPutin last visited Pyongyang in 2000, just months after entering the Kremlin, for a meeting with Kim Jong Il, Kim Jong Un's father and predecessor.\nNorth Korea is barred by UN sanctions from any tests using ballistic technology."}, {"id": "9307f42a-52f8-49d2-ae68-9b91d8edb875", "title": "US says Russia using North Korea missiles in Ukraine", "date": "2024-05-31 04:15", "url": "https://timesofindia.indiatimes.com/world/us/us-says-russia-using-north-korea-missiles-in-ukraine/articleshow/110580155.cms", "message": "Clear evidenceWASHINGTON: Russia is using North Korean ballistic missiles in Ukraine , a new Pentagon report says, citing debris analysis to confirm long-standing allegations that Pyongyang has been sending weapons to Moscow.The report by the Pentagon's Defense Intelligence Agency used open-source imagery to confirm that debris found in Ukraine's Kharkiv region in January this year is from a short-range ballistic missile made in North Korea .\n\"Analysis confirms that Russia used ballistic missiles produced in North Korea in its war against Ukraine,\" the DIA said in a statement released with the report on Wednesday.\n\"They appear to provide clear evidence that these were used in the attack on Ukraine, and clearly demonstrate that the recent statement by Kim Yo Jong denying Russian arms transfer is blatantly false,\" Hong told AFP.North Korea's testing spree, which includes showing off the large-scale production and operational capabilities of its weaponry, \"seems to be part of efforts to supply additional weapons to Russia ahead of President (Vladimir) Putin's visit to North Korea,\" he added.South Korea's defense ministry told AFP it has no comment to give on the report.Soo Kim, a former CIA analyst, told AFP the fact Russia was using North Korean missiles was not a surprise.\n\"What's concerning, though, is the ongoing and uninhibited cooperation between the two nations,\" said Kim, who currently works in policy for LMI Consulting.\n\"As time passes and as the conflict unravels, the depth of cooperation is bound to become more extensive and diversified."}, {"id": "d4bb8599-fec5-47b6-b6de-bb490e6debae", "title": "Day 237 : Intensified Israeli Bombing Kills Dozens In Gaza", "date": "2024-05-31 01:30", "url": "https://imemc.org/article/day-237-intensified-israeli-bombing-kills-dozens-in-gaza/", "message": "On Thursday, Day 237 of the ongoing genocide in Gaza, the Israeli army intensified the bombing and shelling of various parts of the coastal enclave, killing and wounding dozens of Palestinians.\nThe Israeli army said one soldier was killed in northern Gaza and added that three soldiers were injured.\nMedia sources said the army fired many artillery shells at homes and buildings in northern Gaza, including Beit Lahia and Jabalia, entire residential blocks, and even centers and tents used by displaced families.\nAt least two Palestinians were killed, and many were injured, when the army fired a missile at displaced families near the Tuwam junction, in northern Gaza.\nMedical sources said at least nineteen Palestinians were killed, and dozens injured, in repeated bombings and shelling of various parts of Rafah, Thursday."}, {"id": "d0dd29ce-5338-4329-809f-9fb1f42aa408", "title": "US says Russia using N . Korea missiles in Ukraine", "date": "2024-05-31 04:00", "url": "https://www.digitaljournal.com/world/us-says-russia-using-n-korea-missiles-in-ukraine/article", "message": "“Analysis confirms that Russia used ballistic missiles produced in North Korea in its war against Ukraine,” the DIA said in a statement released with the report on Wednesday.\nSoo Kim, a former CIA analyst, told AFP the fact Russia was using North Korean missiles was not a surprise.\nThe Kremlin told Russian media this month that a return visit by Putin to North Korea was “being prepared”.\nPutin last visited Pyongyang in 2000, just months after entering the Kremlin, for a meeting with Kim Jong Il, Kim Jong Un’s father and predecessor.\nNorth Korea is barred by UN sanctions from any tests using ballistic technology."}, {"id": "3af3c114-d9e0-4ec9-a3ef-2dbe55d8485f", "title": "Man Stabbed With A Machete In Times Square | NewsRadio 1450 / 1370 WKIP", "date": "2024-05-31 01:00", "url": "https://1450wkip.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "7d722ce6-3023-480f-8060-7cd033aba8a6", "title": "Man Stabbed With A Machete In Times Square | News Talk 1090 WKBZ - AM", "date": "2024-05-31 01:00", "url": "https://newstalk1090.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "8364a6cb-277b-4fc8-b7bd-5e8272c1dcac", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:00", "url": "https://1150wima.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "5b6ede1c-4bf2-4c69-9c66-ca4e09be597a", "title": "Man Stabbed With A Machete In Times Square | News Radio 103 . 1 and 810 WGY", "date": "2024-05-31 01:15", "url": "https://wgy.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "ca8c1916-01f3-46f2-b933-4a80330a2bc5", "title": "Man Stabbed With A Machete In Times Square | KOA 850 AM & 94 . 1 FM", "date": "2024-05-31 01:15", "url": "https://koacolorado.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "d75f9397-57d1-456b-8ea8-6742978d11f7", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 00:15", "url": "https://kste.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "fde2199d-296b-40b3-96d4-ed42b4d02bc2", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:15", "url": "https://55krc.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "bea2e6d3-e210-4c4c-a42c-6b4475bdf9f6", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:15", "url": "https://kfbk.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "edbdd321-8961-4645-bc28-42ceac23275c", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:15", "url": "https://wvoc.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "0938dc9b-c064-4a37-b72d-0c553b4dcb91", "title": "Man Stabbed With A Machete In Times Square | PowerTalk 1460 AM & 101 . 1 FM", "date": "2024-05-31 00:45", "url": "https://powertalk1460.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "c8105537-b3bf-4136-86e4-475275256675", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 02:15", "url": "https://klvi.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "1f2947ab-bbbc-49ff-a0b1-557339bea172", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 00:45", "url": "https://600kcol.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "569a352a-cae8-4e9d-ae0d-521ea021d396", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:45", "url": "https://newsradio967.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "a858f2f8-2b0c-4647-b538-ff428e36d8d6", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:45", "url": "https://newsradio1470.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "e79a97aa-e90a-4e95-bc92-b9716e6ed6d2", "title": "Man Stabbed With A Machete In Times Square", "date": "2024-05-31 01:45", "url": "https://wmrn.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "bdf9d6e3-b6a5-4b8e-83f2-68a07c210c9c", "title": "Man Stabbed With A Machete In Times Square | NewsRadio WKCY", "date": "2024-05-31 01:45", "url": "https://newsradiowkcy.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "3afe6ed7-30bc-4502-a7d5-b7de7ad5d2c1", "title": "Man Stabbed With A Machete In Times Square | KFYR 550 AM / 99 . 7 FM", "date": "2024-05-31 01:45", "url": "https://kfyr.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "199205a2-a601-4178-bb99-4a8958ae24c6", "title": "Man Stabbed With A Machete In Times Square | NewsRadio 570 WKBN", "date": "2024-05-31 01:45", "url": "https://570wkbn.iheart.com/content/2024-05-30-man-stabbed-with-a-machete-in-times-square/", "message": "Authorities in New York City have detained three men allegedly involved in a brutal machete attack in Times Square on Thursday (May 30) morning.\nOfficials said that a man was stabbed in the legs outside of a McDonald's just after 10 a.m.\nThe victim was rushed to the hospital in stable condition and is expected to survive.\nInvestigators told WABC that they believe that the stabbing was the result of a turf dispute between people selling items in the popular tourist destination.\nOfficials said that the investigation remains ongoing and have asked anybody with information about the machete attack to contact Crime Stoppers by calling 1-800-577-TIPS."}, {"id": "14334130-331a-4412-aa91-d50325c1c908", "title": "Britain joins US in fresh strikes against Houthis in Yemen", "date": "2024-05-31 01:15", "url": "https://www.dailymail.co.uk/news/article-13478365/Britain-fresh-strikes-against-Houthis-Yemen.html", "message": "Britain has joined the US in fresh strikes against the Houthis in Yemen as more than a dozen targets have been blasted in the fifth wave of attacks.\nThe Ministry of Defence (MoD) confirmed strikes took place against the Iranian-backed terror group on Thursday as part of a response to assaults on cargo ships in the Red Sea and Gulf of Aden.\nBritish and American fighter jets as well as US ships hit a wide range of underground facilities, missile launchers, command and control sites, a Houthi vessel and other facilities, according to officials.\nThe US F/A-18 fighter jets launched from the USS Dwight D Eisenhower aircraft carrier in the Red Sea, officials said.\nPresident Joe Biden and other senior leaders have repeatedly warned that the US will not tolerate the Houthi attacks against commercial shipping."}, {"id": "b5a2edd9-5ebd-4a55-9250-a62c1f60229d", "title": "N . Korea Kim supervises rocket launcher test : state media", "date": "2024-05-31 04:00", "url": "https://www.digitaljournal.com/world/n-koreas-kim-supervises-rocket-launcher-test-state-media/article", "message": "A handout photo from North Korean state media shows the test-firing of the country's 600mm 'super-large' multiple rocket launcher system - Copyright KCNA VIA KNS/AFP STRNorth Korean state media on Friday released images of leader Kim Jong Un supervising tests of a multiple rocket launcher system, a day after Seoul accused Pyongyang of firing a volley of short-range ballistic missiles.\nThe photos showed Kim, in a brown leather jacket, smiling with uniformed generals as he supervised the simultaneous launch of what appeared to be 18 projectiles.\nThe test involved “super-large multiple rocket sub-units”, according to a report by the official Korean Central News Agency.\nImages from the drill showed the 600mm multiple launch rocket system (MLRS), which North Korea has said can be fitted with nuclear warheads.\nUS State Department spokesman Matthew Miller condemned the launches as “reckless behavior which poses a grave threat to the Korean Peninsula”."}, {"id": "4ffacccf-ac4a-428f-bbdd-3c13d5cd3a36", "title": "Deadly strikes on Kharkiv as Biden lets Ukraine use US arms inside Russia", "date": "2024-05-31 02:45", "url": "https://www.yahoo.com/news/deadly-strikes-kharkiv-biden-lets-020755856.html", "message": "Deadly strikes on Kharkiv as Biden lets Ukraine use US arms inside RussiaUS officials say President Joe Biden has lifted restrictions on Ukraine using US weapons on targets in Russian territory, but only to defend the Kharkiv region (SERGEY BOBOK)Russian strikes killed three people in the Ukrainian city of Kharkiv, authorities said Friday, after the United States had authorised Kyiv to use American weapons to hit targets inside Russia in defence of the region.\nBut that calculus changed after Russian forces launched a fresh offensive in the Kharkiv region this month.\nRussian strikes that hit a hardware superstore in the city last weekend killed 16 people.\nFrench President Emmanuel Macron had also insisted this week that Ukraine be allowed to \"neutralise\" bases in Russia used to launch strikes.\nBut experts say a recent weapons testing spree in North Korea may be for munitions destined for use in Ukraine."}, {"id": "7fa4773f-b49f-4652-8987-2383ed9d7f69", "title": "Deadly strikes on Kharkiv as Biden lets Ukraine use US arms inside Russia", "date": "2024-05-31 04:00", "url": "https://www.digitaljournal.com/world/deadly-strikes-on-kharkiv-as-biden-lets-ukraine-use-us-arms-inside-russia/article", "message": "A firefighter sprays water in a Kharkiv hardware store destroyed by a Russian strike earlier in the week.\nBut that calculus appears to have changed since Russian forces launched a fresh offensive in the Kharkiv region this month.\nKharkiv, Ukraine’s second-largest city, is located just across the border from Russia’s Belgorod and regularly comes under attack from Russian missiles.\nRussian strikes that hit a hardware superstore in the city last weekend killed 16 people.\nGerman Chancellor Olaf Scholz, however, remained less sure, saying Ukraine should act within the law — and Berlin had not supplied weapons that could hit Russia anyway."}, {"id": "c914f490-23e2-43af-bfb8-002cc1c92954", "title": "Deadly strikes on Kharkiv as Biden lets Ukraine use US arms inside Russia", "date": "2024-05-31 03:45", "url": "https://www.hurriyetdailynews.com/deadly-strikes-on-kharkiv-as-biden-lets-ukraine-use-us-arms-inside-russia-194118", "message": "Deadly strikes on Kharkiv as Biden lets Ukraine use US arms inside RussiaKIEVRussian strikes killed three people in the Ukrainian city of Kharkiv, the regional governor said early Friday, hours after the United States authorised Kiev to use American weapons to hit targets inside Russia in defense of the embattled region.\nBut that calculus appears to have changed since Russian forces launched a fresh offensive in the Kharkiv region this month.\nRussian strikes that hit a hardware superstore in the city last weekend killed 16 people.\nAhead of the NATO meeting, alliance chief Jens Stoltenberg had also said repeatedly that it was time for members to reconsider the limits on strikes inside Russia.\nGerman Chancellor Olaf Scholz, however, remained less sure, saying Ukraine should act within the law — and Berlin had not supplied weapons that could hit Russia anyway."}, {"id": "f1ccad35-2f06-4a7d-b782-486435618c4b", "title": "US says Russia using N . Korea missiles in Ukraine", "date": "2024-05-31 03:30", "url": "https://www.yahoo.com/news/us-says-russia-using-n-025352208.html", "message": "US says Russia using N. Korea missiles in UkraineThe report used open-source imagery to confirm that debris found in Ukraine's Kharkiv region (pictured) in January this year is from a short-range ballistic missile made in North Korea (SERGEY BOBOK)Russia is using North Korean ballistic missiles in Ukraine, a new Pentagon report says, citing debris analysis to confirm long-standing allegations that Pyongyang has been sending weapons to Moscow.\n\"Analysis confirms that Russia used ballistic missiles produced in North Korea in its war against Ukraine,\" the DIA said in a statement released with the report on Wednesday.\n\"North Korean missile debris was found throughout Ukraine,\" it added.\nThe Kremlin told Russian media this month that a return visit by Putin to North Korea was \"being prepared\".\nNorth Korea is barred by UN sanctions from any tests using ballistic technology."}, {"id": "d7661879-b1e9-4921-9536-d96f6fe60774", "title": "  Somebody has to die : Man accused of stabbing homeless man at Nashville bus stop", "date": "2024-05-31 01:00", "url": "https://www.wsmv.com/2024/05/30/somebody-has-die-man-accused-stabbing-homeless-man-nashville-bus-stop/", "message": "NASHVILLE, Tenn. (WSMV) - Metro Nashville police revealed frightening new details about the attack of a homeless man at a WeGo bus stop Thursday morning.\nWhen witnesses intervened to help the homeless man, Boswell allegedly said, “This guy needs to die,” and “Somebody has to die, I’m gonna kill you!”Previous Coverage: Man found stabbed at WeGo bus stop in EdgehillThe attack happened at a bus stop at the intersection of Edgehill Ave. and 12th Ave. S just after 5 a.m.\nMNPD has already investigated two separate shootings at the downtown bus terminal and an attack on a bus driver in May.\nThere are 5.4 million people who visit WeGo Central each year, and nearly 8 million riders annually.\nThere is security at WeGo Central 24/7, and they have 283 cameras in use to keep the facility safe."}, {"id": "b5d38934-cd38-48fd-bb21-542dab792446", "title": "US says Russia using N . Korea missiles in Ukraine", "date": "2024-05-31 04:00", "url": "https://www.digitaljournal.com/world/us-says-russia-using-n-korea-missiles-in-ukraine-2/article", "message": "“Analysis confirms that Russia used ballistic missiles produced in North Korea in its war against Ukraine,” the DIA said in a statement released with the report on Wednesday.\n“North Korean missile debris was found throughout Ukraine,” it added.\nSouth Korea accuses Pyongyang of sending thousands of containers of munitions to Russia, which would violate rafts of United Nations sanctions on both countries.\nThe Kremlin told Russian media this month that a return visit by Putin to North Korea was “being prepared”.\nNorth Korea is barred by UN sanctions from any tests using ballistic technology."}, {"id": "c79d0dee-67bb-4c08-aa63-86846adf4272", "title": "US says Russia using N Korea missiles in Ukraine", "date": "2024-05-31 04:30", "url": "https://www.hurriyetdailynews.com/us-says-russia-using-n-korea-missiles-in-ukraine-194126", "message": "US says Russia using N Korea missiles in UkraineWASHINGTONRussia is using North Korean ballistic missiles in Ukraine, a new Pentagon report says, citing debris analysis to confirm long-standing allegations that Pyongyang has been sending weapons to Moscow.\n\"Analysis confirms that Russia used ballistic missiles produced in North Korea in its war against Ukraine,\" the DIA said in a statement released with the report on Wednesday.\nThe Kremlin told Russian media this month that a return visit by Putin to North Korea was \"being prepared\".\nPutin last visited Pyongyang in 2000, just months after entering the Kremlin, for a meeting with Kim Jong Il, Kim Jong Un's father and predecessor.\nNorth Korea is barred by U.N. sanctions from any tests using ballistic technology."}, {"id": "b09d24c9-fc06-4d9a-a4ac-0a6cb32c3ea7", "title": "Russia S - 500 missile systems to usher in new era in air defense Defense TV - Military & Defense", "date": "2024-05-31 03:15", "url": "https://tass.com/defense/1796099", "message": "Russia’s S-500 Prometheus surface-to-air missile/anti-ballistic missile system will be a game changer for both Russia’s security and the global military landscape, protecting national airspace with unprecedented efficacy and reliability, according to Defense TV YouTube channel.\nThe channel’s authors emphasize the system’s increased range and its advanced missile and radar technologies.\nApart from that, the system is highly resistant to electronic interference, which ensures its reliability even under most complex scenarios on the battlefield.\n\"The secret sauce behind the S-500’s hypersonic killing abilities lies in its powerful radar and computer system,\" the channel says.\nThen Russian Defense Minister Sergey Shoigu said on April 23 that this year, the Russian air defense troops will receive the first S-500 air defense systems in two modifications: long-range surface-to-air missile systems and anti-ballistic missile defense complexes."}, {"id": "5631e1c3-e7ea-4d9d-84c7-18bc0d46e7de", "title": "Ukraine war latest : Russian ferry crossing , 4 patrol boats struck in Crimea , military says", "date": "2024-05-31 01:15", "url": "https://kyivindependent.com/ukraine-war-latest-11/", "message": "Russian troops also reportedly responded with chaotic fire from small arms and 30 mm cannons.\nThe Russian Defense Ministry claimed that Russian air defense downed eight long-range U.S.-supplied ATACMS (Army Tactical Missile System) missiles and eight drones overnight.\nUkraine hits Russian ferry crossing with ATACMS in Crimea, General Staff saysThe Ukrainian military struck the Russian Kerch ferry crossing in occupied Crimea overnight on May 30, the General Staff of Ukraine's Armed Forces reported.\nThe accumulation of ammunition supplies and degradation of Russian forces also reduced Russian offensive capabilities, Syrskyi wrote on Facebook.\nMoscow is forming another grouping of forces near Ukraine's northern border, President Volodymyr Zelensky said on May 26."}, {"id": "f7aa13c7-7fa0-492a-8862-1f72ac46515c", "title": "Machete attack in Times Square leaves man wounded", "date": "2024-05-31 00:30", "url": "https://www.amny.com/new-york/machete-attack-times-square-may-30-2024/", "message": "A police officer guards the blood-splattered scene of a machete attack in Times Square on May 30, 2024.\nThree people are in custody after a bloody machete attack in Times Square in broad daylight on Thursday afternoon.\nHours after the attack, blood could still be seen on the sidewalk adjacent to two nearby food carts; more traces of blood were found smeared on the roadway and even on the steel bollards.\nMembers of the Times Square Alliance worked to clean the gory scene as tourists watched on in disbelief.\nPolice sources confirmed that the three individuals connected to the attack were now in custody, with charges against them pending the results of the ongoing investigation."}, {"id": "825ea9cd-d70a-4985-9d6f-52ec4f33b18b", "title": "US and UK carry out strikes against Houthi targets in Yemen for first time in months", "date": "2024-05-31 01:30", "url": "https://us.cnn.com/2024/05/30/politics/us-uk-yemen-strikes/", "message": "CNN —The US and UK carried out a series of strikes against Houthi targets in Yemen on Thursday for the first time in more than three months, according to US Central Command.\nIn addition, the US unilaterally destroyed eight aerial attack drones over Yemen and the Red Sea.\nThe coalition strikes targeted 13 Houthi targets in parts of Yemen controlled by the Iran-backed terror group.\nThe last round of strikes occurred on February 24, as the US and UK targeted Houthi weapons and radar sites.\nThis week, the US destroyed Houthi missile launchers in Yemen and intercepted aerial attack drones."}, {"id": "90628a66-c444-4be7-bd9f-5eac8bdcff5c", "title": "Russian missile attack on Kyiv sparks fire , Ukraine military says", "date": "2024-05-31 03:45", "url": "https://www.swissinfo.ch/eng/russian-missile-attack-on-kyiv-sparks-fire%2c-ukraine-military-says/79185705", "message": "Russian missile attack on Kyiv sparks fire, Ukraine military says1 minute(Reuters) – A Russian missile attack on Kyiv sparked a fire in a non-residential building early on Friday, the head of the military administration of the Ukrainian capital said.\nAll missiles were destroyed on their approach to the city, Serhiy Popko, the head of Kyiv’s military administration, said on the Telegram messaging app.\nA fire broke out in a non-residential building in the Holosiivskyi district of the city as a result of falling debris, Popko said.\nThere was no immediate comment from Russia about the attack.\nMoscow denies targeting civilians in the war that has killed thousands since February 2022 when Russia launched its full-scale invasion on Ukraine."}, {"id": "66c742ca-f2b9-4e42-8741-f040d46d65d3", "title": "Kano mosque bombing death toll hits 21", "date": "2024-05-31 00:30", "url": "https://punchng.com/kano-mosque-bombing-death-toll-hits-21/", "message": "The death toll in the May 15 bombing of a mosque at Gadan village, Gezawa Local Government Area of Kano State, has risen to 21.\nThe PUNCH learnt on Thursday that four more victims of the incident had died, raising the figure to 21 from the 17 reported last week Tuesday, May 21.\nA total of 25 early-morning worshippers were injured in the mosque bombing attack.\nWhile one person died on the date of the incident, 20 have died at the Muhammed Specialists Hospital, Kano, where they had been receiving treatment, leaving only four surviving.\nThe Kano State Governor, Abba Yusuf, had ordered the prosecution of the bombing mastermind before the Shariah Court, vowing that he would not hesitate to sign the death warrant if the suspect is convicted and sentenced to death."}, {"id": "9f912b6a-a2db-4569-b6f9-f49d8a4fae63", "title": "Dynasty Warriors : Origins announced", "date": "2024-05-31 01:15", "url": "https://nichegamer.com/dynasty-warriors-origins-announced/", "message": "Publisher Koei Tecmo and developer Omega Force have announced Dynasty Warriors: Origins, what they’re teasing as a “new era of 1 vs. 1000” action.\nDynasty Warriors: Origins is in development for Windows PC (via Steam), Xbox Series X|S, and PlayStation 5.\n“For almost 30 years, the DYNASTY WARRIORS franchise has been built by delivering not only a sense of realism on the battlefield, but by the exhilarating action of 1 vs. 1,000 gameplay,” said Tomohiko Sho, DYNASTY WARRIORS: ORIGINS producer and Head of Omega Force, KOEI TECMO GAMES.\nCoordination with allied armies is key as players deploy battle tactics in real time while slicing through waves of soldiers in the most tension-filled fights in DYNASTY WARRIORS history!\nIn addition, for the first time in a DYNASTY WARRIORS title, the storyline will be told through the eyes of a “nameless hero”."}, {"id": "6d562632-2682-410d-9282-266367052f26", "title": "God of War Ragnarök is coming to PC", "date": "2024-05-31 01:15", "url": "https://blog.playstation.com/2024/05/30/god-of-war-ragnarok-is-coming-to-pc/", "message": "Like thisGod of War Ragnarök will be coming to PC on September 19, 2024!\nSanta Monica Studio’s development partner for God of War (2018) on PC, Jetpack Interactive, is back to help deliver the PC version of God of War Ragnarök.\nSuper ultra-widescreen supportEnjoy the breathtaking beauty of the Nine Realms in panoramic widescreen with 21:9 ultra-widescreen and 32:9 super ultra-widescreen support!\nIncludes God of War Ragnarök: ValhallaAt launch, God of War Ragnarök PC will include all our post-launch updates including a robust New Game+ mode and the God of War Ragnarök: Valhalla DLC.\nGod of War Ragnarök – Digital Deluxe EditionThe God of War Ragnarök Digital Deluxe Edition of the game includes:Full God of War Ragnarök game for PCfor PC Kratos Darkdale Armor ********** Atreus Darkdale Attire (cosmetic) *****(cosmetic) ***** Darkdale Blades Handles for the Blades of Chaos*****for the Blades of Chaos***** Darkdale Axe Grip for the Leviathan Axe*****for the Leviathan Axe***** Official God of War Ragnarök Digital SoundtrackDark Horse Digital Mini Artbook*****Unlock in-game items via story progression."}, {"id": "3c413554-c0db-4c73-927a-21dbf0fa7a98", "title": "God of War Ragnarok coming to PC in September", "date": "2024-05-31 01:15", "url": "https://nichegamer.com/god-of-war-ragnarok-coming-to-pc-in-september/", "message": "Publisher Sony Interactive Entertainment and developer Sony Santa Monica have announced God of War Ragnarok is coming to PC this fall.\nGod of War Ragnarok is coming to Windows PC (via Steam and the Epic Games Store) on September 19th.\nThe sequel to the critically acclaimed God of War (2018), God of War Ragnarök picks up with Fimbulwinter well underway.\nMASTER THYSELF IN GOD OF WAR RAGNARÖK: VALHALLAAvailable right at launch with your purchase of God of War Ragnarök is access to the God of War Ragnarök: Valhalla DLC for no additional cost!\nPC FEATURESPartnering with Jetpack Interactive once again, God of War Ragnarök on PC will harness the power of the platform to deliver an exceptional experience."}, {"id": "11fa8bcc-7b6d-4e06-93ee-b56dda74547f", "title": "God of War Ragnarok Launches on PC in September with DLSS 3 . 7 and FSR 3 . 1 , PSN Required", "date": "2024-05-31 01:15", "url": "https://wccftech.com/god-of-war-ragnarok-launches-on-pc-in-september-with-dlss-3-7-and-fsr-3-1/", "message": "Pre-orders for the PC version of God of War Ragnarok are now open.\nUpscaling technology - Full integration with NVIDIA RTX Deep Learning Super Sampling (DLSS), AMD FidelityFX Super Resolution (FSR), and Intel XeSS (Xe Super Sampling) will allow you to reach higher graphical settings and output resolutions.\n- Full integration with NVIDIA RTX Deep Learning Super Sampling (DLSS), AMD FidelityFX Super Resolution (FSR), and Intel XeSS (Xe Super Sampling) will allow you to reach higher graphical settings and output resolutions.\nSuper ultra-widescreen support - Enjoy the breathtaking beauty of the Nine Realms in panoramic widescreen with 21:9 ultra-widescreen and 32:9 super ultra-widescreen support!\nIncludes God of War Ragnarök: Valhalla At launch - God of War Ragnarök PC will include all our post-launch updates including a robust New Game+ mode and the God of War Ragnarök: Valhalla DLC."}, {"id": "6d4d5883-b180-4308-933a-ead29a49f935", "title": "Everything revealed in the May 2024 State of Play", "date": "2024-05-31 01:15", "url": "https://blog.playstation.com/2024/05/30/everything-revealed-in-the-may-2024-state-of-play/", "message": "Play VideoConcordToday’s State of Play revealed the first look at the gameplay, universe, and characters of Concord, as well as how and when you’ll be able to get your hands on the 5v5 character-driven, first-person multiplayer shooter.\nPlay VideoGod of War RagnarökGod of War Ragnarök will be coming to PC on September 19, 2024!\nIn a dedicated PS Blog post, Capcom introduces some of the monsters and characters, as well as more info on the hunter’s new mount.\nThe creators behind this psychological survival horror remake delve deeper into the new gameplay and narrative details on PS Blog.\nPlay VideoInfinity NikkiInfinity Nikki is an open-world dress-up adventure game coming to PS5, with a beta test due later this year."}, {"id": "8226b162-f94f-42ce-8bda-4cd5a6d44622", "title": "Worthplaying |  Dynasty Warriors : Origin Announced For PS5 , Xbox Series X|S And PC In 2025", "date": "2024-05-31 01:30", "url": "https://worthplaying.com/article/2024/5/30/news/142183-dynasty-warriors-origins-announced-for-ps5-xbox-series-xs-and-pc-in-2025-screens-trailer/", "message": "Throughout the game, players will be forced to act fast as the unprecedented size and scale of enemy armies overwhelm the battlefield.\nCoordination with allied armies is key as players deploy battle tactics in real time while slicing through waves of soldiers in the most tension-filled fights in Dynasty Warriors history!\nIn addition, for the first time in a Dynasty Warriors title, the storyline will be told through the eyes of a “nameless hero”.\n“For almost 30 years, the Dynasty Warriors franchise has been built by delivering not only a sense of realism on the battlefield, but by the exhilarating action of 1 vs. 1,000 gameplay,” said Tomohiko Sho, Dynasty Warriors: Origins producer and Head of Omega Force, KOEI TECMO GAMES.\n“With Dynasty Warriors: Origins, we return to these roots and deliver the non-stop action to not only our most loyal fans of the series, but to all game fans worldwide, delivering the most thrilling warfare we’ve ever been able to create!”Dynasty Warriors: Origins is coming to PS5, Xbox Series X|S and PC (Steam) in 2025."}, {"id": "57252551-4d48-4050-abc0-dc59be711906", "title": "Dynasty Warriors : Origins revealed for PS5 , out 2025", "date": "2024-05-31 01:15", "url": "https://blog.playstation.com/2024/05/30/dynasty-warriors-origins-revealed-for-ps5-out-2025/", "message": "Like thisWhen the original Dynasty Warriors debuted back in 1997, little did we know that 27 years later Koei Tecmo would be introducing an electrifying new entry into the series, ready to deliver Dynasty Warriors to the next generation of action gamers.\nDynasty Warriors: Origins unleashes the largest armies ever seen in the series while also introducing a new hero to the exhilarating 1 vs. 1,000 action that made the franchise famous.\nSince Dynasty Warriors 2 (the original Dynasty Warriors was a fighting game!\nAn original protagonist appearsBut that’s not all, as for the first time in Dynasty Warriors franchise history, we will depict the chaos of the Three Kingdoms from the eyes of a ‘nameless hero’.\nStay tuned for more information in the coming months as we reveal more about our new nameless hero and his fight for the Three Kingdoms before Dynasty Warriors: Origins is released in 2025."}, {"id": "149e5e6a-9e71-4d76-82a3-c52c251522d7", "title": "Call of Duty : Modern Warfare III Fallout Crossover Leaks", "date": "2024-05-31 01:15", "url": "https://www.playstationlifestyle.net/2024/05/30/call-of-duty-modern-warfare-iii-fallout-crossover-leaks/", "message": "While eyes turn to the upcoming Black Ops 6, Activision is still releasing content for Call of Duty: Modern Warfare III.\nCall of Duty: Modern Warfare III and Warzone getting Fallout collabThe leak includes a promotional image of the new Fallout-inspired Vault Dweller Tracer Pack and a short video showing the content.\nHowever, this may be the “Top Secret” collab teased in the official Modern Warfare III/Warzone Season 4 roadmap revealed last week.\nThe upcoming Modern Warfare III Vault Dweller Tracer Pack includes “Vault 141” jumpsuits for operators Price, Ghost, Soap, and Gaz.\nModern Warfare III and Warzone players can also get several loading screens and calling cards based on Fallout 4."}, {"id": "55511783-ee91-4731-a580-3df4b79d9ade", "title": "Germany Announces New €500 Million Weapons Package for Ukraine", "date": "2024-05-31 02:30", "url": "https://www.bnnbloomberg.ca/germany-announces-new-500-million-weapons-package-for-ukraine-1.2079327", "message": "(Bloomberg) -- Germany is providing as much as €500 million ($542 million) in additional military aid to Ukraine, including air-defense missiles, Defense Minister Boris Pistorius said.\n“We will continue to support you in this defensive struggle,” Pistorius said Thursday during a visit to Odesa, Ukraine, to meet Ukrainian Defense Minister Rustem Umerov, German broadcaster ARD reported.\nSome of the weapons are about to be delivered to Ukraine, Pistorius said.\nWhile Ukraine’s allies are stepping up efforts to send more air-defense assets, the US and Germany have been cautious about delivering weaponry that can hit targets inside Russia.\nPistorius said this month he wants Germany to deliver another €3.8 billion in military aid to Ukraine this year."}, {"id": "58a9f7b4-6ce9-4161-8604-1886e2b86d83", "title": "Innovation will keep Nigeria ahead of security threats – Tinubu", "date": "2024-05-31 00:30", "url": "https://punchng.com/innovation-will-keep-nigeria-ahead-of-security-threats-tinubu/", "message": "President Bola Tinubu has expressed optimism that Nigeria will prevail against adversaries undermining its peace and security.\nTinubu, represented by the President of the Senate, Godswill Akpabio, gave the assurance while inaugurating the headquarters of the Defence Intelligence Agency, in Abuja, on Thursday.\nHe said his confidence was anchored on the unwavering commitment of members of the Armed Forces of Nigeria and the intelligence agencies, including the Department of State Security, the Nigerian Intelligence Agency, and the Defence Intelligence Agency.\n“The entire nation is behind you and appreciates your sacrifices.”According to him, Nigeria is bedevilled by a myriad of security challenges across the six geopolitical zones of the entire nation.\nIn our bid to combat physical threats, we deploy the armed forces in almost all the states to assist the civil authorities."}, {"id": "1b204913-66b2-4ec2-877c-65debdbca650", "title": "God of War Ragnarok is Coming to PC on September 19", "date": "2024-05-31 01:30", "url": "https://gamingbolt.com/god-of-war-ragnarok-is-coming-to-pc-on-september-19", "message": "Recent leaks claimed that after Ghost of Tsushima, God of War Ragnarok would be the next big single-player first-party PlayStation game to make its way over to PC, and as expected, that announcement was made officially at Sony’s recent State of Play presentation.\nGod of War Ragnarok is coming to PC this September, along with its free roguelike DLC Valhalla.\nCheck out the PC version’s announcement trailer below.\nIn our review of God of War Ragnarok upon its 2022 release, we awarded it a score of 10/10, saying, “God of War Ragnarok surpasses its predecessor in every way.\nGod of War Ragnarok is currently available on PS5 and PS4."}, {"id": "14671275-674f-4790-a81f-23b1573d58bb", "title": "The Blackpool Combat Club  Book Club  Is On Hiatus , MLW To Honor Gary Juster", "date": "2024-05-31 03:45", "url": "https://www.ewrestlingnews.com/news/aew/the-blackpool-combat-clubs-book-club-is-on-hiatus-mlw-to-honor-gary-juster", "message": "The Blackpool Combat Club’s ‘book club’ has been on a bit of a hiatus in recent months, and Bryan Danielson recently spoke with Sports Illustrated to comment on the stable and its private book club.\nThe last six weeks, we haven’t been as deep into it as we were.”He continued, “Mox just recommended a book to me.\nIt’s something like Chosen Suffering, and that’s very apropos for both me and Mox and the BCC–choosing to suffer is what we enjoy.”Major League Wrestling (MLW) will honor Gary Juster at Battle Riot VI.\nLegendary wrestling promoter and executive Gary Juster will be honored this Saturday in Atlanta at the building he helped make famous: Center Stage.\nA key player in the success of WCW, Ring of Honor and MLW, Major League Wrestling is delighted to celebrate the extraordinary career of Mr. Juster as he is presented with a lifetime achievement award."}, {"id": "e5cb57f9-6360-4ce0-b52e-0fb14bb3b868", "title": "Marvel Rivals is coming to PS5 : Venom and Adam Warlock revealed , Closed Beta test announced for July", "date": "2024-05-31 01:15", "url": "https://blog.playstation.com/2024/05/30/marvel-rivals-is-coming-to-ps5-venom-and-adam-warlock-revealed-closed-beta-test-announced-for-july/", "message": "It’s Stephen Wu here, Producer of Marvel Rivals.\nWe know the players have been eagerly awaiting this news since we first unveiled Marvel Rivals back in March!\nI have to admit, developing Marvel Rivals has been a thrilling ride.\nSuper Powers Rather Than AbilitiesWe want every fan of Marvel Rivals to dive into a Super Hero world unlike ever before.\nMarvel Rivals lets you tear down walls to open shortcuts across the map or destroy a building’s foundation to collapse it on your foes."}, {"id": "5daef8e0-d5dc-4861-9aef-bc94cb4692a1", "title": "North Korea trash rains onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-31 03:45", "url": "https://www.theglobeandmail.com/world/article-north-koreas-trash-rains-onto-south-korea-balloon-by-balloon-heres/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government’s hard line policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafletting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications."}, {"id": "0e48b69d-781b-4ba1-91b9-aeec3db2f9b0", "title": "North Korea trash rains onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-31 01:30", "url": "https://www.startribune.com/north-koreas-trash-rains-down-onto-south-korea-balloon-by-balloon-heres-what-it-means/600369722/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government's hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nIn 2020, North Korea blew up an empty, South Korean-built liaison office on its territory in protest of South Korean civilian leafleting campaigns.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications."}, {"id": "1bfbd48f-2678-47c7-8bda-1936d0d978ac", "title": "Where Winds Meet brings superhuman , open - world martial arts adventure to PS5", "date": "2024-05-31 01:15", "url": "https://blog.playstation.com/2024/05/30/where-winds-meet-brings-superhuman-open-world-martial-arts-adventure-to-ps5/", "message": "Martial arts skills can also be acquired from observing and mimicking the behavior of animals.\nWhere Winds Meet, is set in the period in Chinese history known as the Five Dynasties and Ten Kingdoms.\nWhere Winds Meet has an oriental martial arts theme, and we attach great importance to the presentation of martial arts (Wuxia) elements in the game.\nWe hope to introduce players around the world to the unique charm of wuxia martial arts combat.\nPlease stay tuned for more news about Where Winds Meet for PlayStation 5."}, {"id": "aa44f3aa-cc35-49ae-8d45-73404890ba7c", "title": "WWII vet from Northern California flies to France to commemorate 80th anniversary of D - Day", "date": "2024-05-31 00:00", "url": "https://www.cbsnews.com/sacramento/news/dan-dougherty-wwii-veteran-d-day-80th-anniversary-france-flight/", "message": "WWII vet from Fairfield heads to France to commemorate D-DayWWII vet from Fairfield heads to France to commemorate D-DayWWII vet from Fairfield heads to France to commemorate D-DaySACRAMENTO – A Northern California World War II veteran is headed back to France to visit Normandy for the first time since the war.\nTo honor that anniversary, a number of World War II vets are being flown out to France next week.\nDougherty arrived in France several months after D-Day, but he was later part of the unit that liberated the Dachau concentration camp.\nEarlier in 2024, the sole living survivor from the sinking of the USS Arizona died at age 102.\nOnly about 119,000 of the 16.1 million Americans who served in WWII are alive today, according to the National World War II Museum."}, {"id": "62e81ac6-3419-4d32-abef-761526144f94", "title": "North Korea trash rains onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-31 02:15", "url": "https://www.smdailyjournal.com/news/world/north-koreas-trash-rains-onto-south-korea-balloon-by-balloon-heres-what-it-means/article_f2f1131a-7de9-51ac-83a5-98dacb110b96.html", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "d9c2b118-1af2-417b-a941-c1f015629af0", "title": "Why is North Korea sending balloons full of trash into South Korea ? – NBC Chicago", "date": "2024-05-31 02:45", "url": "https://www.nbcchicago.com/news/national-international/north-korea-sending-balloons-full-of-trash-south-korea/3451326/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government’s hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.\nBut it’s unclear whether and how aggressively the South Korean government can urge civil groups to refrain from sending balloons toward North Korea."}, {"id": "7bde7bcb-3477-4350-a90f-4faf96ad290b", "title": "Why is North Korea sending balloons full of trash into South Korea ? – NBC Connecticut", "date": "2024-05-31 02:45", "url": "https://www.nbcconnecticut.com/news/national-international/north-korea-sending-balloons-full-of-trash-south-korea/3302576/", "message": "The powerful sister of North Korean leader Kim Jong Un confirmed Wednesday that North Korea sent the balloons and attached trash sacks.\nExperts say the balloon campaigning is meant to stoke a division in South Korea over its conservative government’s hardline policy on North Korea.\nSince Tuesday night, about 260 balloons flown from North Korea have been discovered across South Korea.\nBut observers say outside experts can get such information more easily from North Korean defectors, their contacts in North Korea and Chinese border towns, and North Korean state publications.\nBut it’s unclear whether and how aggressively the South Korean government can urge civil groups to refrain from sending balloons toward North Korea."}, {"id": "4e37e84c-1b46-45e0-bc8d-60998361e74b", "title": "Trump Online MAGA Army Calls Guilty Verdict a Declaration of War", "date": "2024-05-31 01:45", "url": "https://www.wired.com/story/trump-guilty-verdict-online-maga-fanbase-war/", "message": "Images of an upside-down American flag—a symbol of distress that became co-opted by the 2020 Stop the Steal movement—flooded social media, as Trump supporters, fringe extremists, right-wing pundits, and politicians voiced their anger.\nEver since the trial began, pro-Trump commentators—and Trump himself—have been priming MAGA online ecosystems to claim foul play if the jury found him guilty.\nThe response to his felony conviction was predictably swift, with many characterizing it as a declaration of “war” from the “deep state.” Incendiary rhetoric about how the guilty verdict was a sign of America’s collapse reverberated from the mainstream right all the way to the fringes.\n“As of today, with this fake guilty verdict against Trump, America is no longer the United States,” wrote Joey Marianno, a pro-Trump political commentator, to his 466,000 followers on X.\n“Ladies and gentlemen, we see our republic on its deathbed right now,” said Jones, adding that he believed that “false-flag terror attacks blamed on Trump supporters angry about the verdict” were imminent."}, {"id": "be1c9c00-9e3e-43f3-ae54-ddb5d5f1290d", "title": "Israel warns the war in Gaza to last through end of 2024 | WND", "date": "2024-05-31 04:00", "url": "https://www.wnd.com/2024/05/israel-warns-war-gaza-last-end-2024/", "message": "(ZEROHEDGE) – Israel is warning that its military operation in Gaza will continue through at least the end of the year, in an assessment which is sure to shock and anger the growing chorus of international critics and countries.\nGet the hottest, most important news stories on the Internet – delivered FREE to your inbox as soon as they break!\nTake just 30 seconds and sign up for WND's Email News Alerts!\nThe same official stressed that the war cabinet had defined 2024 as \"a year of combat\" in the wake of the Oct.7 terror attack by Hamas and Islamic Jihad.\nRead the full story ›"}, {"id": "6d4170d3-3902-4c38-b7eb-1040626bc8f5", "title": "Why the Swedish and Finnish Air Forces are a powerful add to NATO", "date": "2024-05-31 03:15", "url": "https://news.yahoo.com/news/why-swedish-finnish-air-forces-213001204.html", "message": "Their forces and bases would complicate any Russian effort to conquer the Baltic states in NATO.\nFinland's F/A-18 Hornets — which used to be the US Navy's standard fighter — are already compatible with NATO air forces.\nThis puts several squadrons of stealth fighters on Russia's northern border, with the potential to penetrate and suppress Russian air defenses, and hit vital targets.\n\"Both Finland's and Sweden's proximity allows NATO air forces to stage closer to the Baltics.\nTheir air forces are vital for this Nordic push, and will become very useful to further deter and defend the increasingly contested arctic space with Russia.\""}, {"id": "8a380e12-03dd-40a6-ade2-75c6fb756de2", "title": "North Korea trash rains onto South Korea , balloon by balloon . Here what it means", "date": "2024-05-31 01:15", "url": "https://www.yakimaherald.com/news/nation_and_world/world/north-koreas-trash-rains-onto-south-korea-balloon-by-balloon-heres-what-it-means/article_1667004c-2b49-5a04-96bb-918372e5a0b9.html", "message": "Copyright 2024 The Associated Press.\nAll rights reserved.\nThis material may not be published, broadcast, rewritten or redistributed without permission."}, {"id": "cda9921b-fc94-498f-8b40-96d0592c98f7", "title": "Biden partially lifts ban on Ukraine using U . S . arms in strikes on Russian territory , US officials say", "date": "2024-05-31 00:30", "url": "https://lasvegassun.com/news/2024/may/30/biden-partially-lifts-ban-on-ukraine-using-us-arms/", "message": "Biden partially lifts ban on Ukraine using U.S. arms in strikes on Russian territory, US officials sayWASHINGTON — President Joe Biden has given Ukraine the go-ahead to use American weaponry to strike inside Russia for the limited purpose of defending Kharkiv, according to two U.S. officials familiar with the matter.\nThe officials, who requested anonymity to discuss the sensitive matter, underscored that the U.S. policy calling on Ukraine not to use American-provide long-range missiles and other munitions to strike inside Russia offensively has not changed.\nThe move comes as Ukrainian officials have stepped up calls on the U.S. administration to allow its forces to defend itself against attacks originating from Russian territory.\nUkrainian officials, most notably Ukrainian President Volodymyr Zelenskyy, have been increasingly vocal in making the case that the restriction was putting Ukrainian forces in an untenable situation as Russia has intensified attacks around the northeast Kharkiv region.\nThat position, Blinken noted, was a “hallmark” of the Biden administration's stance on Ukraine to “adapt and adjust” as needed."}, {"id": "6b8480af-a27c-496f-a00e-550520cc274e", "title": "LSU hosts memorial service on campus , honors former students , staff that served", "date": "2024-05-31 01:15", "url": "https://www.wbrz.com/news/lsu-hosts-memorial-service-on-campus-honors-former-students-staff-that-served", "message": "LSU hosts memorial service on campus, honors former students, staff that servedBATON ROUGE — LSU held a Memorial Day service Thursday for veterans — including former students, faculty and staff — who died in service of their country.\nThe ceremony was held at noon on the Parade Ground at the LSU War Memorial.\nThe public \"Ceremony in Silence\" observance will include a wreath-laying ceremony and \"Taps,\" the traditional military bugle march.\nLSU's memorial service is being held on the traditional date for Memorial Day — May 30 — when the holiday was first held in 1868.\n\"It's very important because a lot of people today don't realize, that haven't served in the military, fewer people do."}, {"id": "29c779ec-7e8b-4438-bc7e-b324a1c0e28d", "title": "Joe Biden partially lifts ban on Ukraine using US arms in strikes on Russian territory , US officials say", "date": "2024-05-31 00:45", "url": "https://www.nzherald.co.nz/world/joe-biden-partially-lifts-ban-on-ukraine-using-us-arms-in-strikes-on-russian-territory-us-officials-say/QZDCZZEOZZDCRECAPPWMBMRXXI/", "message": "An image of Russian President Vladimir Putin is displayed as US President Joe Biden speaks.\nPhoto / GettyAn image of Russian President Vladimir Putin is displayed as US President Joe Biden speaks.\nThe move comes as Ukrainian officials have stepped up calls on the US administration to allow its forces to defend itself against attacks originating from Russian territory.\nPresident Joe Biden shakes hands with Ukrainian President Volodymyr Zelenskyy as he welcomes him to the White House, December 2022.\nPresident Joe Biden shakes hands with Ukrainian President Volodymyr Zelenskyy as they meet in the Oval Office of the White House, Tuesday, Dec. 12, 2023, in Washington."}, {"id": "31962d62-cdf6-487b-b338-6be472bdffc0", "title": "God of War Ragnarök announced for PC with enhancements , launches in September", "date": "2024-05-31 00:30", "url": "https://www.neowin.net/news/god-of-war-ragnark-announced-for-pc-with-enhancements-launches-in-september/", "message": "However, one of the announcements was purely dedicated to PC, with another port being unveiled.\nConfirming previous leaks, Sony is finally bringing God of War Ragnarök to PC, less than two years after the title's launch on the PlayStation 4 and PlayStation 5 as an exclusive.\nThe PC version of Ragnarök is touting some nifty features much like other Sony ports too.\nDespite being a single-player experience, Sony makes it clear in the announcement that \"Account for PlayStation Network is required\" to play God of War Ragnarök.\nGod of War Ragnarök is out on Steam and the Epic Games Store on September 19, and pre-orders are available now."}, {"id": "88d80d5f-a526-4553-803b-d59883297c72", "title": "China , Russia know space weapons are needed ; US should too | Commentary", "date": "2024-05-31 04:00", "url": "https://www.postandcourier.com/opinion/commentary/space-weapons-united-states-china-russia/article_371bee8c-1d29-11ef-b0ee-e75e1b60f8ab.html", "message": "\"The stars will never be won by little minds,\" observed the great science fiction writer Robert Heinlein.\nIf we aren't careful, though, they just might be won by the scheming minds of governments hostile to the United States.\nRead moreLowry: Russia and China realize space weapons are essential to war.\nWe should too."}, {"id": "b8da8d49-4a3c-4859-88d4-7d0517e3cb2e", "title": "China defense ministry condemns US missile deployment in Philippines", "date": "2024-05-31 04:00", "url": "https://www.rappler.com/world/asia-pacific/china-defense-ministry-condemns-united-states-missile-deployment-philippines/", "message": "A Chinese defense ministry spokesman says Beijing remains highly vigilant and opposes the deployment, the first in the Indo-Pacific region.\nChina’s defense ministry on Thursday, May 30, strongly condemned the deployment of a US intermediate range missile system in the northern Philippines during military drills in April, saying it “brought huge risks of war into the region”.\nDefense Ministry spokesperson Wu Qian told a press briefing in Beijing that China remained highly vigilant and opposed the deployment, the first in the Indo-Pacific region.\nPlay VideoThe US said last month it had deployed its Typhon missile system to the Philippines as part of their Balikatan or “shoulder-to-shoulder” military drills.\nA Philippines military spokesperson could not be reached for comment on Thursday."}, {"id": "97ea46f9-35b9-4b93-b03e-7c8c1b0decc2", "title": "Biden to visit France for meeting with Macron", "date": "2024-05-31 02:45", "url": "https://www.columbian.com/news/2024/may/30/biden-to-visit-france-for-meeting-with-macron/", "message": "PARIS — French President Emmanuel Macron is set to host his U.S. counterpart Joe Biden next week as the two leaders seek to step up cooperation on Ukraine.\nBiden’s first state visit to France will take place on June 8 and reciprocates Macron’s trip to the U.S. in 2022, the French presidency said in a statement.\nThe two presidents will discuss the need for continued and unwavering support for Ukraine and stress the close coordination on international crisis to prepare the ground for the G-7 summit in Bari in June and the NATO summit in Washington in July.\nDays before the state visit, Biden is also due to attend the ceremony for the 80th anniversary of the battle of Normandy that led to the liberation of France and Europe in World War II.\nThe meeting comes as European allies have grown increasingly concerned about what would happen if the United States scales back its support for Ukraine, and how they could cover Ukraine’s financial and military needs."}, {"id": "0d66d00f-d02e-4a3a-8c72-0ca2aa315a26", "title": "Skydance Behemoth Releases Fall 2024 for PS VR2 , SteamVR , and Quest", "date": "2024-05-31 01:00", "url": "https://www.vgchartz.com/article/461180/skydances-behemoth-releases-fall-2024-for-ps-vr2-steamvr-and-quest/", "message": "Skydance's Behemoth Releases Fall 2024 for PS VR2, SteamVR, and Quest - News/ 312 Viewsby, posted 5 hours agoSkydance Interactive has announced Behemoth will launch for PlayStation VR2, SteamVR, and Meta Quest in Fall 2024.\nWhen you enter the Forsaken Lands, one thing is clear: You are not welcome here.\nThe Forsaken Lands are your gauntlet and your hunting ground.\nHunt or be huntedAlthough desolate at a glance, the Forsaken Lands are populated by marauders and zealots.\nOnly then will the darkest secrets of the Forsaken Lands be revealed…A life-long and avid gamer, William D'Angelo was first introduced to VGChartz in 2007."}, {"id": "2342a686-7b4b-4fe7-96ee-710236129bac", "title": "Worthplaying |  God Of War Ragnarök  Comes To PC In September , Feature Details", "date": "2024-05-31 01:30", "url": "https://worthplaying.com/article/2024/5/30/news/142178-god-of-war-ragnark-comes-to-pc-in-september-feature-details-trailer/", "message": "Includes God of War Ragnarök: Valhalla At launch, God of War Ragnarök PC will include all our post-launch updates including a robust New Game+ mode and the God of War Ragnarök: Valhalla DLC.\nGod of War Ragnarök – Digital Deluxe Edition The God of War Ragnarök Digital Deluxe Edition of the game includes: Full God of War Ragnarök game for PCKratos Darkdale Armor*****Atreus Darkdale Attire (cosmetic) *****Darkdale Blades Handles for the Blades of Chaos*****Darkdale Axe Grip for the Leviathan Axe*****Official God of War Ragnarök Digital SoundtrackDark Horse Digital Mini Artbook *****Unlock in-game items via story progression.God of War Ragnarök antagonists Thor will be voiced by Ryan Hurst (Opie in Sons Of Anarchy) while Richard Schiff (The West Wing, The Good Doctor) is cast for Odin.\nWhatever your choice of combat strategy, the enemies that await in God of War Ragnarök will be ready.\nIn God of War Ragnarök, you will be able to visit all nine!\nCurrently available for PS4 and PS5, God Of War Ragnarök is coming to PC on September 19, 2024."}]