[{"id": "d193910a-f4d2-4764-8145-1c0221407264", "title": "Zelensky and Other Top Ukrainian Leaders Narrowly Avoid Russian Assassination Attempt", "date": "2024-05-08 01:15", "url": "https://redstate.com/streiff/2024/05/07/zelensky-and-other-top-ukrainian-leaders-narrowly-avoid-russian-assassination-attempt-n2173898", "message": "Ukrainian Security Service operatives broke up a Russian plot Tuesday to assassinate President Volodymyr Zelensky and other senior political and military figures.\nAccording to the Wall Street Journal, this operation was tied to Russian President Vladimir Putin's inauguration and, I think, Thursday's Victory Day shindig.\nMalyuk said the plot was supposed to be a “gift” for Russian President Vladimir Putin ahead of his Tuesday inauguration for another six-year term.\nThis is not the first time Zelensky and other senior Ukrainian officials have been targeted for assassination.\nBACKGROUND: Russian Missile Narrowly Misses Motorcade Carrying Ukraine's Zelensky and Greece's Prime MinisterBudanov's assassination was timed to be close to the operation against Zelensky."}, {"id": "9e75739b-239e-4788-8845-86261ec07a10", "title": "Global Terror Threat Has Skyrocketed Due to Oct . 7 Hamas Attack , Gaza War , Experts Warn", "date": "2024-05-08 00:45", "url": "https://www.algemeiner.com/2024/05/07/global-terror-threat-has-skyrocketed-due-oct-7-hamas-attack-gaza-war-experts-warn/", "message": "The threat of terrorist attacks in the West has escalated in the wake of the Hamas terror group’s Oct. 7 massacre across southern Israel and amid the ensuing war in Gaza, according to experts who spoke with The Algemeiner.\nTerrorist groups are using Israel’s war against Hamas to encourage more attacks against the US, Guillot argued.\nExperts also noted the threat posed by Iran, which the US government has consistently deemed the world’s foremost state sponsor of terrorism.\n“The ongoing and primary terrorist threat is from the Iranian regime and its proxies,” said Marshall Wittman, a spokesperson for the American Israel Public Affairs Committee (AIPAC).\nMost of the outrages occurred after Oct. 7, during the ensuing Israel-Hamas war in Gaza."}, {"id": "f388e570-d2a1-4447-88b3-274411893748", "title": "Ukraine war briefing :  Rocket , drone , rocket  – alleged plots to kill Zelenskiy , Budanov | Ukraine", "date": "2024-05-08 01:30", "url": "https://www.theguardian.com/world/article/2024/may/08/ukraine-war-briefing-rocket-drone-rocket-alleged-plots-to-kill-zelenskiy-budanov", "message": "Two Ukrainian security officials have been detained over an alleged Russian assassination plot against Volodymyr Zelenskiy, Ukraine’s president.\nThe SBU named three FSB intelligence officers behind the operation as Maxim Mishustin, Dmytro Perlin and Aleksii Kornev.\nIn intercepted messages, Perlin referred to the missile attack on Budanov as a “big bird” and the drone as a “small bird”.\nUkrainian prosecutors say they have examined debris from 21 of around 50 North Korean ballistic missiles launched by Russia between late December and late February.\nRomania’s president, Klaus Iohannis, has said he is open to discussing sending a Patriot system to Ukraine after German appeals to EU and Nato member states."}, {"id": "7c222840-aa22-4180-b310-ecc6dfc51eff", "title": "UUV : Three Letters That Could Mean the Aircraft Carrier Age Is Over", "date": "2024-05-08 03:15", "url": "https://nationalinterest.org/blog/silk-road-rivalries/uuv-three-letters-could-mean-aircraft-carrier-age-over-210937", "message": "-However, the strategic potential of UUVs in modern naval warfare is becoming increasingly apparent, with their capabilities to perform dangerous and complex tasks like maritime surveillance, minehunting, and infrastructure protection.\nAccording to a report from Reuters, the Navy is now lagging in the development of unmanned vessels, because the Pentagon remains wedded to large-scale shipbuilding projects.\nThrough it all, it might be overlooking the future platforms of naval warfare.\nSwarms of small sea drones might also shield valuable crewed assets including aircraft carriers and submarines.\nJust as combat aircraft ended the battleship’s dominance, so UUVs could humble the aircraft carrier."}, {"id": "b8ea13fc-e29f-41ab-b8ca-cb0f8eebe56c", "title": "US halts bomb shipments to Israel amid concerns of full - scale Rafah invasion as Biden rift with Netanyahu deepens", "date": "2024-05-08 06:15", "url": "https://www.dailymail.co.uk/news/article-13394521/US-halts-bomb-shipments-Israel-amid-concerns-scale-Rafah-invasion-Bidens-rift-Netanyahu-escalates.html", "message": "The US paused a shipment of bombs to Israel last week over concerns that Israel was approaching a decision on launching a full-scale assault on the southern Gaza city of Rafah.\nThe U.S. has historically provided enormous amounts of military aid for Israel.\nA decision against Israel would further add to pressure on Biden to curb the flow of weapons and money to Israel´s military.\nThe package included more than $14 billion in military aid for Israel, though the stalled transfer was not related to that measure.\nIsrael, by contrast, has used the bomb frequently in the seven-month Gaza war."}, {"id": "02cb287d-3ffb-4272-a00d-e89380294e8e", "title": "Conservative Principles , Political Reality , and the War on Terrorism", "date": "2024-05-08 05:00", "url": "https://www.heritage.org/homeland-security/report/conservative-principles-political-reality-and-the-war-terrorism", "message": "And when the Taliban government there refused, the United States and its allies attacked.\nExplained in military terms, this was one campaign in the global war on terrorism.\nThis is essentially the position in which the United States found itself with Iraq.\nRemember that the head of the United Nations Disarmament Organization would have been Saddam Hussein's Iraq, and the head of the United Nations Commission on Human Rights is Libya.\nI doubt very much that, left to their own devices, our military war planners would have opted for the force configuration and flow that they used."}, {"id": "37e4eae6-a889-4c71-9570-afb19b7de2ec", "title": "A new plot to assassinate Ukraine president has come to light", "date": "2024-05-08 03:15", "url": "https://www.kasu.org/politics/2024-05-07/a-new-plot-to-assassinate-ukraines-president-has-come-to-light", "message": "But Ukraine's domestic intelligence agency says, this time, the plot was much more sophisticated.\nKAKISSIS: Ukraine's domestic intelligence agency also posted a video of an unnamed suspect - a gray-haired man in a gray parka.\nThe spokesman, Dekhtiarenko, says the Russians also planned to kill the heads of both the military and the domestic intelligence agencies.\nKAKISSIS: The Russian officer says, \"if you complete the task, you will have at least $50,000.\"\nHe called it a terrorist attack that was supposed to be a gift to Russian President Vladimir Putin for his inauguration on Tuesday."}, {"id": "d675996f-cbdf-4112-800f-e6718400a392", "title": "A new plot to assassinate Ukraine president has come to light", "date": "2024-05-08 03:00", "url": "https://www.kwit.org/2024-05-07/a-new-plot-to-assassinate-ukraines-president-has-come-to-light", "message": "But Ukraine's domestic intelligence agency says, this time, the plot was much more sophisticated.\nKAKISSIS: Ukraine's domestic intelligence agency also posted a video of an unnamed suspect - a gray-haired man in a gray parka.\nThe spokesman, Dekhtiarenko, says the Russians also planned to kill the heads of both the military and the domestic intelligence agencies.\nKAKISSIS: The Russian officer says, \"if you complete the task, you will have at least $50,000.\"\nHe called it a terrorist attack that was supposed to be a gift to Russian President Vladimir Putin for his inauguration on Tuesday."}, {"id": "31bb027a-162c-4361-b145-56bbbcd24d1f", "title": "A new plot to assassinate Ukraine president has come to light", "date": "2024-05-08 05:15", "url": "https://www.mynspr.org/2024-05-07/a-new-plot-to-assassinate-ukraines-president-has-come-to-light", "message": "But Ukraine's domestic intelligence agency says, this time, the plot was much more sophisticated.\nKAKISSIS: Ukraine's domestic intelligence agency also posted a video of an unnamed suspect - a gray-haired man in a gray parka.\nThe spokesman, Dekhtiarenko, says the Russians also planned to kill the heads of both the military and the domestic intelligence agencies.\nKAKISSIS: The Russian officer says, \"if you complete the task, you will have at least $50,000.\"\nHe called it a terrorist attack that was supposed to be a gift to Russian President Vladimir Putin for his inauguration on Tuesday."}, {"id": "46d83cb7-5d24-400d-8a41-6f43532fdfd6", "title": "Zelensky assassination plot by Russian agents foiled – Ya Libnan", "date": "2024-05-08 03:00", "url": "https://yalibnan.com/2024/05/08/zelensky-assassination-plot-by-russian-agents-foiled/", "message": "Kyiv has foiled an alleged Russian plot to assassinate Ukrainian President Volodymyr Zelensky, the country’s security service (SBU) said on Tuesday.\nThe SBU said it had exposed a network of agents from Russia’s Federal Security Service (FSB) who were “preparing the assassination of the president of Ukraine” and other senior Ukrainian officials.\nThe ContextUkraine said Zelensky has been targeted countless times since Russian President Vladimir Putin launched a full-scale invasion of the country in February 2022.\nTwo colonels of the State Security Service of Ukraine, which oversees Zelensky’s security, were detained.\nThe defendants have been detained on suspicion of committing high treason under martial law, and preparing for a terrorist attack."}, {"id": "8f0ad855-ee32-4532-98cb-009d1e8c4792", "title": "About Western pots and Indian kettles - The Statesman", "date": "2024-05-08 04:00", "url": "https://www.thestatesman.com/opinion/about-western-pots-and-indian-kettles-1503298204.html", "message": "Experienced diplomats and intelligence officials of all countries know that clandestine work is sometimes taken up in hostile countries.\nIn 1964, USA assisted efforts led to a coup to bring down the democratic government of Brazil led by President Joao Goulart.\nMohammad Mossadegh was a popular leader and Prime Minister of Iran, elected democratically in elections, keen to get more resources for helping his people by curbing the profits of oil multinationals.\nOver 15,000 of these armed militants later spread violent conflict in many other countries as well, while also attacking several US and western targets.\nHence it is evident that the most powerful Western countries have time and again intervened in other countries to disrupt democracies and to cause enormous human distress in other ways."}, {"id": "fe34d4ee-e013-4ed6-ac76-d4bd76f7b4f3", "title": "Immigrants , crime , crime rate , terrorism , order security | Homeland Security Newswire", "date": "2024-05-08 03:15", "url": "https://www.homelandsecuritynewswire.com/dr20240507-the-manufactured-crisis-of-migrant-terrorists-at-the-border", "message": "Reports that illegal border crossers who are on the terrorist watch list have been apprehended seem to validate these fears.\nSince late 2020, Border Patrol has encountered 357 foreigners on the terrorist watch list attempting to cross the southwest border illegally.\nBut being on the watch list does not necessarily indicate an intent to commit terrorism on U.S. soil—which is what the public actually cares about.\nAlmost 98 percent of all victims of foreign‐born terrorists were murdered in the 9/11 terror attacks—the deadliest in world history.\nThis is not to trivialize the threat posed by foreign‐born terrorists to the lives, liberty, and private property of Americans."}, {"id": "ca5eb224-b01f-4710-a84d-5f68dfdbdae6", "title": "Zelensky Assassination Plot : Ukraine Thwarts Alleged Russia - Backed Attempt", "date": "2024-05-08 01:00", "url": "https://foreignpolicy.com/2024/05/07/zelensky-assassination-plot-attempt-putin-russia-gordon-black-soldier/?tpcc=recirc_trending062921", "message": "Failed Hit on ZelenskyKyiv foiled what it said was a Russian-coordinated plot to assassinate senior Ukrainian officials, including President Volodymyr Zelensky, Ukraine’s security service announced on Tuesday.\nFederal authorities arrested two Ukrainian security officials on suspicion of treason, which carries a life sentence, and of preparing a terrorist act.\nRussian President Vladimir Putin provided no immediate response to the allegation.\nUkrainian officials said the suspects planned to kill Budanov before Orthodox Easter, which fell on May 5 this year, by providing information on his whereabouts to target him in a rocket and drone strike.\nKyiv usually remains tight-lipped about assassination attempts against senior officials, of which there have been several since Russia’s war against Ukraine began."}, {"id": "96783e34-8125-4aba-aeb6-56ae423e6c0f", "title": "Sette morti e diversi feriti in un raid di Israele su Gaza", "date": "2024-05-08 03:15", "url": "https://www.giornaledibrescia.it/italia-e-estero/sette-morti-e-diversi-feriti-in-un-raid-di-israele-su-gaza-khqfngug", "message": "GAZA, 08 MAG - Almeno sette persone sono rimaste uccise e diverse altre ferite oggi in un attacco aereo israeliano sulla città di Gaza, rende noto l'ospedale al-Ahli.\nL'agenzia di stampa palestinese Wafa afferma che il raid ha colpito un edificio residenziale nel quartiere orientale di Zeitoun.\nLe vittime apparterrebbero tutte alla stessa famiglia e tra loro ci sarebbero anche alcuni bambini, aggiunge la Wafa.\nIl bilancio dal 7 ottobre scorso nella Striscia di Gaza è di almeno 34.789 morti e 78.204 feriti, secondo il ministero della Sanità locale gestito da Hamas."}]