[{"id": "6c3243df-c835-4510-8ea7-23a077bc9139", "title": "July is the wettest in 70 years since Hurricane Hazel", "date": "2024-08-01 00:30", "url": "https://www.bramptonguardian.com/news/july-is-the-wettest-in-70-years-since-hurricane-hazel-breaks-rainfall-record-at-toronto/article_806bf38f-9cc9-5902-bae1-62e70c0a2121.html", "domain": "bramptonguardian.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaPostal Code"}, {"id": "78da8737-be9e-416e-b827-fc5b9d28b3de", "title": "Hanahan mayor warns and advises residents ahead of hurricane season peak", "date": "2024-08-01 06:30", "url": "https://abcnews4.com/news/local/hanahan-mayor-warns-and-advises-residents-ahead-of-hurricane-season-peak-nfip-pinopolis-dam-christie-rainwater-flooding-floods-community-rating-system-premium-lake-moultrie-cooper-river", "domain": "abcnews4.com", "domain_classification": "Unknown", "message": "Hanahan Mayor Christie Rainwater penned a letter to residents Tuesday acknowledging community concerns about flooding and hurricane preparedness, while also advising residents on how to best stay safe during a storm.\nRainwater also shared that the city has been attempting to obtain flood insurance premium discounts for residents via the National Flood Insurance Program's (NFIP) Community Rating System.\nPoints are then used to reduce flood insurance premiums for policyholders.\nThe Hanahan Mayor claimed that residents now receive a 20 percent discount on their flood insurance premiums due to participation in the Community Rating System.\nThe letter comes as hurricane season reaches its peak, prompting many Lowcountry governments and emergency organizations to increase preparations for a major storm."}, {"id": "ef03fa1f-9856-4a55-a5b3-69d8d25ea64b", "title": "Florida on alert for tropical downpours as models shift disturbance to Gulf of Mexico", "date": "2024-08-01 13:45", "url": "https://www.fox35orlando.com/news/florida-alert-tropical-downpours-models-shift-disturbance-gulf-mexico", "domain": "fox35orlando.com", "domain_classification": "Unknown", "message": "For several days, model forecasts consistently indicated that the tropical wave, now known as Invest 97L, would likely move into the Atlantic.\nHowever, by Thursday, the models have generally agreed that it will now track into the Gulf of Mexico.\nWhile the forecast intensity is still uncertain, we may see a tropical depression, tropical storm or potentially a hurricane.\nRegardless, this track places Florida on the dirty side of the system, which translates into numerous tropical downpours heading to Central Florida from late weekend into early next week.\nAs of Thursday morning, the NHC says the tropical wave has a medium (60%) chance for development over the next seven days."}, {"id": "4d679f18-454b-46fa-94f9-999e62c02cbd", "title": "Vermont Inundated as 1 - in - 1 , 000 - Year Rainfall Event Destroys Homes , Prompts Rescues", "date": "2024-08-01 00:45", "url": "https://www.ecowatch.com/vermont-flooding-2024.html", "domain": "ecowatch.com", "domain_classification": "Unknown", "message": "The aftermath of flash flooding on Red Village Road in Lyndonville, Vermont on July 30 2024.\nNearly eight inches of rain fell in only six hours in St. Johnsbury — considered a one in a thousand year event, CNN reported.\nI had no idea this was coming,” said one of the town’s residents Vanessa Allen, as reported by The Associated Press.\nLyndonville and St. Johnsbury, located near state capital Montpelier, got the brunt of the flooding.\nVermont Emergency Management said about two dozen rescues had been executed in the area by 10 swift-water rescue teams."}, {"id": "21dcd7a2-2612-43e9-b4d7-4d2edb36c5c7", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 02:15", "url": "https://www.pressdemocrat.com/article/news/vermont-man-evacuates-neighbors-during-flooding-weeks-after-witnessing-a-d/", "domain": "pressdemocrat.com", "domain_classification": "Unknown", "message": "A National Weather Service flood watch was in effect for central and northern Vermont from noon until midnight.\n“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding,” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nAlthough climate change has its impacts, special calculations are needed to determine exactly how much global warming is to blame, if at all, for any single extreme weather event.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "d8e1ae59-9825-4670-8773-a076ea5b3f49", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 04:15", "url": "https://www.kiro7.com/news/national/governor-calls-flood/KWBRCG3THJFPLBBRNTPZJWLPK4/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "f413aefb-2a20-4552-b7f8-f326e566a9d9", "title": "Light earthquake : M4 quake has struck near Yuzhno - Sakhalinsk in Russia", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-quake-has-struck-near-yuzhno-sakhalinsk-in-russia/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4 (ml/mb) was detected on Thursday, 140 km E of Yuzhno-Sakhalinsk, Russia (87 miles).\nEvent ids that are associated to the earthquake: us7000mzye.\nId of event: us7000mzye.\nExact time and date of earthquake 18/07/24 / 2024-07-18 05:53:25 / July 18, 2024 @ 5:53 am UTC/GMT.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 140 km E of Yuzhno-Sakhalinsk, Russia."}, {"id": "705f6bc5-69c9-40d1-a35a-448f723cbfe8", "title": "Light earthquake , 4 . 2 mag strikes near Bitung in Indonesia", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-2-mag-strikes-near-bitung-in-indonesia-8/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.2 (ml/mb) was reported 120 km E of Bitung, Indonesia (75 miles) on Friday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe 4.2-magnitude earthquake has occurred at 06:14:53 / 6:14 am (local time epicenter).\nThe epicenter of the earthquake was roughly 49.828 km (31 miles) below the earth’s surface.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 120 km E of Bitung, Indonesia."}, {"id": "280ae486-fc8b-4d75-9c9a-59d641780872", "title": "Light earthquake : M4 . 1 quake has struck near Ollagüe in Chile", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-m4-1-quake-has-struck-near-ollague-in-chile-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.1 (ml/mb) strikes 89 km WNW of Ollagüe, Chile (55 miles) on Wednesday.\nA tsunami warning has not been issued (Does not indicate if a tsunami actually did or will exist).\nThe earthquake occurred at a depth of 100.684 km (63 miles).\nExact location of earthquake, -69.0314° West, -20.8866° South, depth 100.684 km.\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 89 km WNW of Ollagüe, Chile."}, {"id": "607aa081-d37e-4de5-91d1-d5ff851ac88b", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 03:15", "url": "https://www.wsbradio.com/news/national/governor-calls-flood/KWBRCG3THJFPLBBRNTPZJWLPK4/", "domain": "wsbradio.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "93afd5f3-ac4b-4b2d-bb21-b16ec3c90066", "title": "Light earthquake , 4 . 6 mag strikes near the Kermadec Islands", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-6-mag-strikes-near-the-kermadec-islands-9/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.6 (ml/mb) was reported south of the Kermadec Islands (0 miles) on Tuesday.\nExact location of earthquake, longitude -178.1669 West, latitude -32.7492 South, depth = 10 km.\nEvent ids that are associated to the earthquake: us7000my2b.\nId of event: us7000my2b.\nRead more about the earthquake, Distances, Seismometer information, Date-Time, Parameters, Location and details about this quake, that has struck: south of the Kermadec Islands."}, {"id": "0e2c2464-5dd1-4a2e-a7ed-f939d489046b", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 03:00", "url": "https://isp.netscape.com/news/story/0001/20240801/7872348db84f506598624e9fb9c2ae40", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "A National Weather Service flood warning was in effect for parts of central and northeastern Vermont into Wednesday night.\n“This time, it’s especially bad after workers spent the past three weeks working furiously to recover from the last flooding, ” Gov.\nNearly three weeks ago, Pilbin watched helplessly as a man drowned after getting caught while driving through flooding caused by the remnants of Hurricane Beryl.\nAlthough climate change has its impacts, special calculations are needed to determine exactly how much global warming is to blame, if at all, for any single extreme weather event.\nWe can’t go anywhere.”The state experienced major flooding earlier in July caused by what was left of Hurricane Beryl."}, {"id": "08e261c8-55b9-41da-8b6c-f357dd61a97a", "title": "Do you rent ? You may be more vulnerable to climate - driven disasters", "date": "2024-08-01 10:00", "url": "https://www.wfae.org/energy-environment/2024-07-31/do-you-rent-you-may-be-more-vulnerable-to-climate-driven-disasters", "domain": "wfae.org", "domain_classification": "Unknown", "message": "Disasters cause a cascade of financial problems for rentersPeople who rent face unique challenges after weather disasters.\nAs a result, in the immediate aftermath of a disaster, renters often face huge bills, starting with rent itself.\nRyan Kellman / NPR / NPR A building lists towards the water along Big Pine Island Road in Matlacha, Fla., as the sun sets in June.\n“Disaster creates disaster,” James says.\nRyan Kellman / NPR / NPR After the storm Venus James and her husband relocated to outside Tampa."}, {"id": "fd09348d-5c31-4df2-b2e7-bd034b72d28b", "title": "Moderate earthquake , 5 mag has occurred near Panama", "date": "2024-08-01 04:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/moderate-earthquake-5-mag-has-occurred-near-panama-2/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A moderate earthquake with magnitude 5 (ml/mb) was detected on Thursday, south of Panama (0 miles).\nEvent ids that are associated to the earthquake: us6000nh8m.\nId of event: us6000nh8m.\nThe earthquake occurred at a depth of 10 km (6 miles).\nRead more about the earthquake, Seismometer information, Distances, Parameters, Date-Time, Location and details about this quake, that has occurred near: south of Panama."}, {"id": "d1436e6b-ac71-42af-9736-2d5775892252", "title": "Light earthquake , 4 . 3 mag has occurred near Zhangfeng in China", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-3-mag-has-occurred-near-zhangfeng-in-china/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake with magnitude 4.3 (ml/mb) was reported 6 kilometers (4 miles) from Zhangfeng in China on Friday.\nAll ids that are associated to the event: us6000nh53.\nThe earthquake occurred at a depth of 12.956 km (8 miles).\nEpicenter of the earthquake was 62 km (39 miles) from Bhamo (c. 47 900 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 6 km NE of Zhangfeng, China."}, {"id": "2e2503e2-e80d-4bab-922d-73948f49e963", "title": "Light earthquake 4 . 6 mag , 40 km E of Marihatag , Philippines", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-6-mag-40-km-e-of-marihatag-philippines/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.6 (ml/mb) has occurred on Thursday, 40 kilometers (25 miles) from Marihatag in Philippines.\nExact time and date of earthquake 18/07/24 / 2024-07-18 08:29:26 / July 18, 2024 @ 8:29 am UTC/GMT.\nThe earthquake occurred at a depth of 62.387 km (39 miles) below the earth’s surface.\nEarthquake epicenter was 71 km (44 miles) from Bislig (c. 67 600 pop), 63 km (39 miles) from Tandag (c. 29 000 pop), 84 km (52 miles) from Bah-Bah (c. 28 600 pop), 82 km (51 miles) from San Francisco (c. 18 500 pop), 64 km (40 miles) from Lianga (c. 13 600 pop), 64 km (39 miles) from Tagbina (c. 10 700 pop), 56 km (35 miles) from Hinatuan (c. 10 100 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 40 km E of Marihatag, Philippines."}, {"id": "7ffcb320-bf43-4bf2-a39c-b31fc7f55d20", "title": "Light earthquake , 4 . 2 mag was detected near Misawa in Japan", "date": "2024-08-01 09:30", "url": "https://www.earthquakenewstoday.com/2024/08/01/light-earthquake-4-2-mag-was-detected-near-misawa-in-japan/", "domain": "earthquakenewstoday.com", "domain_classification": "Unknown", "message": "A light earthquake magnitude 4.2 (ml/mb) strikes 56 kilometers (35 miles) from Misawa in Japan on Friday.\nExact time and date of earthquake 19/07/24 / 2024-07-19 08:08:08 / July 19, 2024 @ 8:08 am UTC/GMT.\nThe epicenter was at a depth of 60.438 km (38 miles).\nThe epicenter was 65 km (41 miles) from Hachinohe (c. 239 000 pop), 68 km (42 miles) from Mutsu (c. 49 200 pop), 56 km (35 miles) from Misawa (c. 42 800 pop).\nRead more about the earthquake, Seismometer information, Date-Time, Location, Distances, Parameters and details about this quake, recorded: 56 km NE of Misawa, Japan."}, {"id": "cd3e0c2a-f83a-40d5-aed9-08ee4f222e78", "title": "State Affairs committee looks into power outages after Hurricane Beryl", "date": "2024-08-01 02:30", "url": "https://www.fox7austin.com/news/state-affairs-committee-looks-power-outages-after-hurricane-beryl", "domain": "fox7austin.com", "domain_classification": "Unknown", "message": "Hurricane Beryl is gone and most of the power line repair work is done in Houston.\nOn Wednesday, members of the House State Affairs Committee brought back the CEO of CenterPoint Energy, Jason Wells, who issued another apology for how the power provider responded to the power outage.\nCommittee members expressed their frustration with the answers they've been getting, especially regarding how power poles are maintained.\nThose trees were not part of the CenterPoint vegetation reduction plan.\nWells told the committee more than 40 policy changes have been made, or are in the process of being implemented."}, {"id": "520d7487-30c5-4ca6-a76a-caae8f8e2a51", "title": "Severe Storms in the Southeast US Leave 1 Dead and Cause Widespread Power Outages", "date": "2024-08-01 04:30", "url": "https://www.theepochtimes.com/us/severe-storms-in-the-southeast-us-leave-1-dead-and-cause-widespread-power-outages-5697417", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "CANTON, Ga.—A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nWednesday’s remaining outages were most concentrated around the town of Ellijay in the north Georgia mountains.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city’s downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines."}, {"id": "8be91dc3-837c-48c3-8219-5f8a989419d2", "title": "Stormy Weather and Climate Change This Week", "date": "2024-08-01 07:15", "url": "https://scienceblogs.com/gregladen/2015/10/09/stormy-weather-and-climate-change-this-week", "domain": "scienceblogs.com", "domain_classification": "Unknown", "message": "And yes, that event was climate change enhanced in at least two ways, maybe three.\nAll in all, it is likely that South Carolina, the neighbor of the state that is famous for making climate change illegal, and who's congressional delegation refused to help the victims of Super Storm Sandy, got walloped by climate change.\nBut this is yet another case of the tropics breaking out of their usual pattern as a result, likely, of climate change combined with this year's ongoing El Nino.\nDisturbance Number 1, just getting going, has about a 50% chance of becoming a tropical storm over the next five days.\nIn case you were wondering about the climate change - hurricane link, this might be of interest to you:"}, {"id": "9862ca05-0c65-4a8e-b962-d3d5927eba00", "title": "Non - Shocking Update For Western Montana Bitterroot River", "date": "2024-08-01 00:30", "url": "https://newstalkkgvo.com/ixp/117/p/update-for-western-montanas-bitterroot-river/", "domain": "newstalkkgvo.com", "domain_classification": "Unknown", "message": "If anything should close a portion of a river to the public, that's probably as good of an example as any.\nClark Fork and Blackfoot River closures were lifted earlier this week.\nThe July 24 severe thunderstorm in the Missoula area caused extensive damage to power lines, trees, and property in the west-central Montana area.\nThe Aftermath of the Severe Thunderstorm in Missoula, Montana - July 2024 The National Weather Service cited 80 mph winds at the Missoula Montana Airport and over 100 mph winds at the apex of Mount Sentinel.\nPowerful winds left behind a path of broken trees, downed power lines, failing traffic lights, and debris as far as the eye can see."}, {"id": "2c2bdb94-7cf0-4ce3-bb42-81e2518499dc", "title": "Officials declare California wildfires have burned 5 times more area this year alone :  We are not just in a fire season , we are in a fire year  ", "date": "2024-08-01 00:30", "url": "https://www.yahoo.com/news/officials-declare-california-wildfires-burned-230000399.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Officials declare California wildfires have burned 5 times more area this year alone: 'We are not just in a fire season, we are in a fire year'Wildfires in California burned more than 300,000 acres through the third week of July.\nIt is still relatively early in California's wildfire season, but it is unfortunately already off to a roaring start.\nThrough the third week of July, the number of acres burned had nearly tripled the average of the past five years, according to Cal Fire.\nThere have been more than 4,000 wildland fires and over 2,500 structural fires in California so far.\nWhy is an active wildfire season in California important?"}, {"id": "309d932d-7b12-4d98-9ffc-26e69f64754a", "title": "Severe storms in Georgia and other Southeast US states leave 1 dead and cause widespread power outages", "date": "2024-08-01 04:45", "url": "https://www.wabe.org/severe-storms-in-georgia-and-other-southeast-us-states-leave-1-dead-and-cause-widespread-power-outages/", "domain": "wabe.org", "domain_classification": "Unknown", "message": "Severe storms in Georgia and other Southeast US states leave 1 dead and cause widespread power outagesA huge tree on Old St. Augustine Road rests on downed power lines in Tallahassee, Fla., Friday, May 10, 2024.\nPowerful storms with damaging high winds threatened several states in the Southeast early Friday.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city’s downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines."}, {"id": "632db217-a8d4-4392-909e-7373e9c1c157", "title": "A Vermont sheriff has lost his driveway to flood waters twice in one month", "date": "2024-08-01 00:30", "url": "https://www.bostonglobe.com/2024/07/31/metro/vermont-sheriff-has-lost-his-driveway-flood-waters-twice-one-month/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "Three weeks ago, the remains of Hurricane Beryl swept through northern Vermont, sending violent flood waters into homes and businesses and washing away roadways.\nJennifer Hemond said the couple’s home insurance does not cover flooding to a driveway.\nA National Weather Service flood watch was in effect for central and northern Vermont from noon until midnight.\nJennifer Hemond said a local group is trying to raise money to help residents in the Northeast Kingdom affected by the floods.\nJennifer Hemond said the challenges of the past month added to an already stressful time, as she worried about her husband’s health."}, {"id": "def3165b-ce93-45a4-b2f5-c06106c9679b", "title": "Vermont gets respite from flood warnings as US senator pushes for disaster aid package", "date": "2024-08-01 12:45", "url": "https://abcnews.go.com/US/wireStory/vermont-gets-respite-flood-warnings-us-senator-pushes-112470133", "domain": "abcnews.go.com", "domain_classification": "International", "message": "There were downpours Wednesday night in parts of Vermont and New Hampshire.\nIn Washington, Democratic U.S. Sen. Peter Welch asked Congress to pass a supplemental disaster aid package.\nAnd we need the help of all of us here because well, it’s Vermont this time, it may be New Hampshire next time.\nVermont experienced major flooding earlier in July caused by what was left of Hurricane Beryl.\nThe flooding destroyed roads and bridges and inundated farms, and it came exactly a year after a previous bout of severe flooding hit Vermont and several other states."}, {"id": "4d06009c-43a5-4791-9d61-23bc3c0a328d", "title": "Tropical depression may develop over the Gulf , NHC says | Hurricane Center", "date": "2024-08-01 14:00", "url": "https://www.theadvocate.com/baton_rouge/news/hurricane/tropical-depression-may-form-gulf-atlantic-hurricane-season/article_4dbc108d-83dd-592d-87a2-097996e9c65e.html", "domain": "theadvocate.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "2115ebcd-6e93-4eec-8732-51185ab2c71f", "title": "Tropical depression may develop over the Gulf , NHC says | Hurricane Center", "date": "2024-08-01 14:00", "url": "https://www.nola.com/news/hurricane/tropical-depression-may-form-gulf-atlantic-hurricane-season/article_ba1003be-4ffb-11ef-ba21-4397c99e789a.html", "domain": "nola.com", "domain_classification": "Unknown", "message": "Close Get email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}Email notifications are only sent once a day, and only if there are new matching items."}, {"id": "a25c98af-c259-4411-8460-a34f14a194c7", "title": "Charleston County prepares for severe storms with emergency exercise", "date": "2024-08-01 03:30", "url": "https://www.live5news.com/2024/07/31/charleston-county-prepares-severe-storms-with-emergency-exercise/", "domain": "live5news.com", "domain_classification": "Unknown", "message": "NORTH CHARLESTON, S.C. (WCSC) - Multiple agencies participated in Charleston County’s full-scale exercise to simulate a hurricane and determine the best response strategies.\nThe Charleston County emergency management team, plus more than 110 people from law enforcement, EMS and public works participated in an emergency exercise Wednesday at the Emergency Operations Center.\nEach year, county officials look at ways to not only add to their emergency plan but also refine it to ensure its effectiveness.\nInterim Director for Emergency Management for Charleston County Ben Webster explains how these exercises test their abilities.\n“It gets everyone in the same room, it gets everybody communicating, making sure that plan works, making sure that communication structure works and making sure that command structure works,” Webster said."}, {"id": "0bd57971-4ce7-4fd2-aef0-c8d38015d36a", "title": "IOP first responders take part in full - scale exercise to prepare for hurricanes", "date": "2024-08-01 00:00", "url": "https://www.yahoo.com/news/iop-first-responders-part-full-214815305.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "ISLE OF PALMS, S.C. (WCBD) – First responders on the Isle of Palms put their hurricane response skills to the test on Wednesday during a full-scale exercise involving an imaginary storm.\nIOP police officers busted through the doors of a room inside of the resort, which jumpstarted the exercise.\nFirst responders quickly tended to the four volunteers pretending to be victims who sustained injuries amid the chaos.\nAfter a few minutes, the helicopter landed, Maynard was loaded inside, and they were back in the air again, marking the end of the exercise.\nThe simulation was part of a larger multi-day exercise conducted by the Charleston County Emergency Management Department."}, {"id": "334e8276-85d3-4cc0-849c-0013bceb0fbc", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations – Winnipeg Free Press", "date": "2024-08-01 08:30", "url": "https://www.winnipegfreepress.com/arts-and-life/life/2024/08/01/b-c-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "A government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water “may cause rapid rises in river levels downstream along the Fraser River” south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA landslide along the Chilcotin River near Williams Lake, B.C.\nFlooding is a major concern after a landslide blocked the Chilcotin River in British Columbia's Interior.\nTHE CANADIAN PRESS/HO-Central Cariboo Search and Rescue *MANDATORY CREDIT *A flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope."}, {"id": "be9e83cc-00e9-4632-b943-b0c94a669a3d", "title": "Vermont gets respite from flood warnings as US senator pushes for disaster aid package", "date": "2024-08-01 13:45", "url": "https://wacotrib.com/ap/national/vermont-gets-respite-from-flood-warnings-as-us-senator-pushes-for-disaster-aid-package/article_122e61b1-8a8f-5245-b33a-4c4d32a702b5.html", "domain": "wacotrib.com", "domain_classification": "Unknown", "message": "There were downpours Wednesday night in parts of Vermont and New Hampshire.\nIn Washington, Democratic U.S. Sen. Peter Welch asked Congress to pass a supplemental disaster aid package.\nAnd we need the help of all of us here because well, it’s Vermont this time, it may be New Hampshire next time.\nVermont experienced major flooding earlier in July caused by what was left of Hurricane Beryl.\nThe flooding destroyed roads and bridges and inundated farms, and it came exactly a year after a previous bout of severe flooding hit Vermont and several other states."}, {"id": "7b3fcefe-a26c-47fb-bc53-48d1b32606f6", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 04:15", "url": "https://www.thewesterlysun.com/news/national/governor-calls-on-flood-weary-vermonters-to-stick-together-with-more-thunderstorms-on-the-horizon/article_78c587fe-f2a2-5b99-bdb6-d4578689eade.html", "domain": "thewesterlysun.com", "domain_classification": "Unknown", "message": "Vermont’s governor says the latest storms to hit the state have undone much of the cleanup and recovery work done since its last major bout of flooding only weeks ago, and he is calling on residents to “stick together” amid fears that more bad weather was on its way"}, {"id": "f7cb8cbe-6133-468e-b11c-32ad6e866fdf", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 04:00", "url": "https://www.krmg.com/news/national/governor-calls-flood/KWBRCG3THJFPLBBRNTPZJWLPK4/", "domain": "krmg.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "2f48b6d1-2bbf-4409-b0f2-8e266541509e", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 03:15", "url": "https://www.recorderonline.com/news/national_news/governor-calls-on-flood-weary-vermonters-to-stick-together-with-more-thunderstorms-on-the-horizon/article_74b3d0e2-8c17-5dc9-acdb-aaec5902f7da.html", "domain": "recorderonline.com", "domain_classification": "Unknown", "message": "Governor calls on flood-weary Vermonters to 'stick together' with more thunderstorms on the horizonVermont’s governor says the latest storm to the hit the state was “much worse than a punch or a kick,” and he is calling on residents to “stick together” with another round of bad weather on its way"}, {"id": "d0479e53-3a08-48aa-bfec-2fc3f0abfd9b", "title": "  A moving monster : How did the Jasper fire get so bad , so fast ? ", "date": "2024-08-01 00:00", "url": "https://www.kelownacapnews.com/national-news/a-moving-monster-how-did-the-jasper-fire-get-so-bad-so-fast-7465703", "domain": "kelownacapnews.com", "domain_classification": "Unknown", "message": "By Wednesday night, fires had reached Jasper, with flames and smoke so intense it forced first responders to briefly retreat.\nQuestions and accusations have followed, including from critics who argue Parks Canada and other government agencies did not do enough to protect Jasper.\nWhat were some of the major drivers of the Jasper wildfire?\nDespite the shortcomings, Parks Canada has become one of the most active agencies in Canada for prescribed burns, said Bourbonnais.\nBut he praised the preparedness in Jasper and said all requests for more wildfire support had been approved."}, {"id": "98abf99b-c846-42c2-8906-0484ae59ebb4", "title": "Valley News - Why does Vermont keep flooding ? It complicated , but experts warn it could become the norm", "date": "2024-08-01 01:00", "url": "https://www.vnews.com/Why-does-Vermont-keep-flooding-It-s-complicated-but-experts-warn-it-could-become-the-norm-56293929", "domain": "vnews.com", "domain_classification": "Unknown", "message": "Vermont is flooding.\nWarming atmosphereExtreme flooding conditions like these are often the result of random, short-term natural weather patterns heightened by long-term, human-caused climate change.\nWith climate change, storms are forming in a warmer atmosphere, making extreme rainfall a more frequent reality.\nHeavily manipulated riversVermont’s history of heavily manipulating its rivers and streams also plays a role in increased flooding, Vermont Agency of Natural Resources secretary Julie Moore said.\nA crumbling dam systemDams in Vermont are increasingly at risk as climate change brings heavier rains and more powerful storms."}, {"id": "f36f823e-7956-45e9-b93a-010c409612c9", "title": "Unrelenting heat to keep US sweating during final month of summer", "date": "2024-08-01 00:15", "url": "https://www.yahoo.com/news/unrelenting-heat-keep-us-sweating-214255793.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Unrelenting heat to keep US sweating during final month of summerThe scorching heat is expected to continue through the end of an already sweltering summer, according to NOAA’s latest climate forecast for August 2024.\nNOAA’s Climate Prediction Center issued its 30-day outlook for August – the final full month of summer – and it looks like Americans are in for much of the same above-average heat that has dominated this summer so far.\nPeople walk along the coast as the sun sets on the Pacific Ocean at Windansea Beach in La Jolla during a summer heat wave on July 23, 2024 in San Diego, California.\nAn active hurricane season in the Atlantic – with a possible new tropical system approaching the Southeast during the first week of August – could easily bring enough rain to exceed monthly normal precipitation for the final month of summer.\nOriginal article source: Unrelenting heat to keep US sweating during final month of summer"}, {"id": "def714f6-156c-4535-9d00-3462a9ae89f3", "title": "California experiencing most severe start to wildfire season in 16 years", "date": "2024-08-01 00:00", "url": "https://www.mercurynews.com/2024/07/31/california-experiencing-most-severe-start-to-wildfire-season-in-16-years/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "US reporter and former Marine freed by Russia in multi-country prisoner swap"}, {"id": "90323208-b989-47b2-b204-a2361ef96c24", "title": "Governor calls on flood - weary Vermonters to  stick together  with more thunderstorms on the horizon", "date": "2024-08-01 00:00", "url": "https://www.thesunchronicle.com/news/nation_world/governor-calls-on-flood-weary-vermonters-to-stick-together-with-more-thunderstorms-on-the-horizon/article_133e4194-fba2-595a-88dc-6bc888bea100.html", "domain": "thesunchronicle.com", "domain_classification": "Unknown", "message": "Vermont’s governor says the latest storms to hit the state have undone much of the cleanup and recovery work done since its last major bout of flooding only weeks ago, and he is calling on residents to “stick together” amid fears that more bad weather was on its way"}, {"id": "e8f8bc7a-e205-4807-a046-1289c1c31470", "title": "California experiencing most severe start to wildfire season in 16 years", "date": "2024-08-01 01:00", "url": "https://www.eastbaytimes.com/2024/07/31/california-experiencing-most-severe-start-to-wildfire-season-in-16-years/", "domain": "eastbaytimes.com", "domain_classification": "Unknown", "message": "Click to share on Facebook (Opens in new window)"}, {"id": "062b5a77-78dc-421e-bb5a-c2ecaba1411d", "title": "Unrelenting heat to keep US sweating during final month of summer", "date": "2024-08-01 04:45", "url": "https://nypost.com/2024/07/31/us-news/unrelenting-heat-to-keep-us-sweating-during-final-month-of-summer/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "The scorching heat is expected to continue through the end of an already sweltering summer, according to NOAA’s latest climate forecast for August 2024.\nNOAA’s Climate Prediction Center issued its 30-day outlook for August – the final full month of summer – and it looks like Americans are in for much of the same above-average heat that has dominated this summer so far.\nAugust US temperature outlookNOAA’s temperature outlook shows above-average temperatures across most of the contiguous US and the northeast half of Alaska.\nThe Plains, Southeast and Gulf Coast states are forecast to begin August with a heat wave bringing dangerous heat to those regions through next week.\nNOAA’s Climate Prediction Center issued its 30-day outlook for August – the final full month of summer – and it looks like Americans are in for much of the same above-average heat that has dominated this summer so far."}, {"id": "23e23cea-78f4-49d4-9c21-1b4889624011", "title": "House members demand solutions from CenterPoint in the wake of failures during Beryl – Houston Public Media", "date": "2024-08-01 00:45", "url": "https://www.houstonpublicmedia.org/articles/news/energy-environment/2024/07/31/495344/house-members-demand-solutions-from-centerpoint-in-the-wake-of-failures-during-beryl/", "domain": "houstonpublicmedia.org", "domain_classification": "Unknown", "message": "Screenshot/Texas HouseCenterPoint CEO Jason Wells faced another day of questioning from Texas lawmakers regarding the utility's response to Hurricane Beryl.\nCommittee Vice Chair Ana Hernandez (D-Houston) took Wells to task over the company's failures before, during, and after Beryl.\nThat included the question of how CenterPoint planned to accelerate its process of replacing wooden poles with more durable ones by the end of the hurricane season.\n\"It was a little over 3,000 poles,\" Wells said, \"and we have about 1.2 million on our distribution system, and we can do better, and we will do better by replacing those wooden poles with composite poles.\"\nFurther, Wells said the company expects to replace just 1,000 wooden poles with composite ones by year's end."}, {"id": "182d1979-efd9-4082-9528-4e7c5b32d796", "title": "Cape Fear residents prepare as tropical wave moves through the Caribbean", "date": "2024-08-01 03:30", "url": "https://www.wwaytv3.com/cape-fear-residents-prepare-as-tropical-wave-moves-through-the-caribbean/", "domain": "wwaytv3.com", "domain_classification": "Unknown", "message": "Cape Fear residents prepare as tropical wave moves through the CaribbeanLELAND, NC (WWAY) — Meteorologists are closely watching the Caribbean, as a tropical wave makes its way to the US.\nOn Wednesday, WWAY went to the Ace Hardware on Village Rd.\nFor now, its too early to tell if the wave will develop into tropical storm Debby, or if it will head toward the Cape Fear.\nWe do have the hurricane items that we usually bring out front,” Barker said.\nTo stay informed on the tropical wave, you can visit our daily forecast."}, {"id": "4c917ab6-d599-4055-98a7-5810f8dbc83c", "title": "Florida remains in storm potential path | News", "date": "2024-08-01 07:45", "url": "https://www.keysnews.com/news/florida-remains-in-storm-s-potential-path/article_2de8bad0-4f4b-11ef-9037-6be780c2e259.html", "domain": "keysnews.com", "domain_classification": "Unknown", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "8f7d1210-c5df-40dc-8e79-9aea621df3f8", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations | iNFOnews", "date": "2024-08-01 08:45", "url": "https://infotel.ca/newsitem/landslide-evacuation/cp1443944904", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "issues flood warning, watches after landslide blocks river, forces evacuationsA landslide along the Chilcotin River near Williams Lake, B.C.\nFlooding is a major concern after a landslide blocked the Chilcotin River in British Columbia's Interior.\nA government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope."}, {"id": "10013ed3-b97a-4828-84b0-b4a69b5bd469", "title": "Smoke Advisory extended ; monsoonal moisture arrives Thursday", "date": "2024-08-01 00:15", "url": "https://kesq.com/weather/local-forecast/2024/07/31/smoke-advisory-extended-monsoonal-moisture-arrives-thursday/", "domain": "kesq.com", "domain_classification": "Unknown", "message": "The Smoke Advisory has been extended for parts of Riverside County due to elevated fine particle pollution in the air from wildfire smoke.\nA ridge of high pressure to our east will expand west and begin to steer monsoonal moisture into Southern California.\nAny storm that develops could bring heavy rain, lightning, and gusty winds.\nThe storm chances decrease for the weekend but remain in the forecast for the mountains and deserts through the middle of next week.\nThis weekend will also bring more heat, prompting an Excessive Heat Watch to be issued for Saturday and Sunday."}, {"id": "08943f77-3527-4b5b-b116-7d7c4d6a7e0b", "title": "Caribbean conservationists urge greater focus on disaster risk management", "date": "2024-08-01 07:30", "url": "https://jamaica-gleaner.com/article/news/20240801/caribbean-conservationists-urge-greater-focus-disaster-risk-management", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "Caribbean conservationists are encouraging small island developing states (SIDS) to place greater attention on disaster risk management and prevention measures, so that the appropriate strategies are in place and actionable before the countries are devastated by natural disasters.\nSpeaking at a Global Conservation Connection webinar on Tuesday under the topic ‘Disaster Risk Management and Hurricanes in the Caribbean’, keynote speaker Dr Trevor Johnson Jr, from The Bahamas, a consultant with the Inter-American Development Bank and a regional disaster management specialist with the Pacific Disaster Center, stated that issues surrounding disaster management should be at the forefront of the agenda of all governments within the Caribbean region.\nHe argued that as disasters impacted every socio-economic sector, deliberate, laser-focused and pragmatic regional discourse is necessary, and that the issues of disaster risk management demand a full community approach.\n“Disaster risk management is everyone’s business,” he said.\nShe continued that St Lucia has had challenges with disaster risk management, particularly in the town of Soufrière, which is extremely vulnerable to hurricanes and storm surge damages."}, {"id": "dedbcf32-f3fe-4a21-a910-6c61ce55be07", "title": "Gulf Coast : Check your trees for storm readiness before the next storm hits", "date": "2024-08-01 01:15", "url": "https://www.yahoo.com/news/gulf-coast-check-trees-storm-225725306.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Gulf Coast: Check your trees for storm readiness — before the next storm hitsBALDWIN COUNTY, Ala. (WKRG) — It’s not “if” a hurricane will hit our area, it’s “when”.\nBefore that happens, experts ask that people look up and check if their trees can weather the storm.\nOkaloosa County suspect in spider’s death arrested“Whole trees came down right from the roots,” that was during Hurricane Sally and since then Jack Ruck has been concerned about some of his trees.\nNorah O’Donnell leaving as anchor of CBS evening newscast after electionHe brought that concern to a workshop where Certified Arborist and Extension Agent Joel Potter said now is the time to check your trees.\nThe root system is also very important but so is what’s above the roots."}, {"id": "9b57a28d-87c6-45c2-ae6c-d57e2450f736", "title": "Croatia reports its toughest day for firefighters as Balkan nations battle wildfires in a heat wave", "date": "2024-08-01 07:45", "url": "https://www.newsday.com/news/nation/balkans-wildfires-croatia-heat-wave-drought-u23758", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Croatia’s Firefighters’ Association said the demanding 24-hour period included responding to more than 100 fires with over 1,000 firefighters and 20 firefighting planes.\nIn North Macedonia, some 66 wildfires erupted over the past 24 hours.\nFirefighters gather near the wildfire in Tucepi, Croatia, late Tuesday, July 30, 2024.\nCountries like North Macedonia, Bulgaria and Albania have all sought help from abroad.\nFirefighters gather near the wildfire in Tucepi, Croatia, late Tuesday, July 30, 2024."}, {"id": "5800a325-127f-42a6-a622-e970f5c865fb", "title": "Megan Forecast : Turning up the heat and humidity", "date": "2024-08-01 03:15", "url": "https://www.10news.com/weather/san-diegos-weather-forecast-for-july-31-2024-turning-up-the-heat-and-humidity", "domain": "10news.com", "domain_classification": "Unknown", "message": "It's about to be feeling a lot more tropical in San Diego as monsoon flow returns bringing high humidity and a chance of showers and thunderstorms.\nHigh pressure over Texas will expand west, ushering in warmer and more humid conditions that will stick around well into next week.\nThe deserts will see the return of excessive heat with an Excessive Heat Watch issued for Saturday and Sunday.\nExpect high temperatures between 113 and 117 degrees and morning lows only dipping into the mid-80s to low-90s.\nThe high heat and above-normal temperatures are expected to last through at least August 9th, with less hot and humid conditions expected to follow."}, {"id": "3d6bb0e4-e6f3-4cda-aa8b-4964f022b3d7", "title": "Powerful bow echo slams Omaha with hurricane - force winds", "date": "2024-08-01 06:30", "url": "https://www.yahoo.com/news/powerful-bow-echo-slams-omaha-033020443.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "– Severe thunderstorms rocked eastern Nebraska and southwestern Iowa on Wednesday, causing widespread power outages in the Omaha metro area.\nTree damage after storms rolled through Omaha, Nebraska on July 31, 2024Wind gusts around Omaha's Eppley Airfield, the region’s busiest airport, reached 90 mph.\n\"The windstorm that struck the OPPD service territory caused power outages to 220,545 customers,\" OPPD stated Wednesday night.\nDespite the flurry of severe weather, local authorities did not report any deaths associated with the event.\nOriginal article source: Powerful bow echo slams Omaha with hurricane-force winds"}, {"id": "21764740-12ed-45ae-9ac8-79e5791bbb27", "title": "FIRST ALERT : Tropical development still likely this weekend or early next week", "date": "2024-08-01 02:45", "url": "https://www.wmbfnews.com/2024/07/31/first-alert-slow-tropical-development-expected-by-weekend/", "domain": "wmbfnews.com", "domain_classification": "Unknown", "message": "MYRTLE BEACH, SC (WMBF) - An area of disturbed weather continues to approach the Bahamas and may develop into a tropical depression or tropical storm by this weekend or early next week.\nDevelopment of this system is unlikely during the next couple of days while it moves west-northwestward over portions of the Greater Antilles.\nThe chance of development sits at 20% over the next two days and 60% over the next five days.\nRight now, a westward trend of this system looks to bring impacts closer to Florida or even the Gulf of Mexico next week.\nAreas in the Gulf of Mexico and near Florida should monitor this chance of development closely."}, {"id": "3331fa86-1953-4761-9977-58fb1f31855f", "title": "Met Office on weather triple whammy as thunderstorms , flooding , and 30C temperatures set to sweep united kingdom ", "date": "2024-08-01 01:45", "url": "https://www.mirror.co.uk/news/uk-news/met-office-weather-triple-whammy-33371511", "domain": "mirror.co.uk", "domain_classification": "Unknown", "message": "The Met Office has issued a yellow weather warning over thunderstorms that will bring heavy rainfall and the risk of flooding to parts of the UK on ThursdayBrace yourselves for a wild weather ride, as the Met Office is warning of thunderstorms and hail lashing parts of the UK today, amid scorching temperatures already reaching up to 30C in many parts.\nWith heatwave temperatures, storm clouds, and flooding on the horizon, some could see a triple whammy of extreme weather on Thursday.\nThis follows two days of heatwave temperatures, which has seen many in the UK finally get a taste of hot summer weather.\nImage: Getty Images) Getty Images)Central, southern, and eastern England, along with South Wales, are set to face scattered but intense showers and thunderstorms later on Thursday.\nTemperatures are set to soar up to 30C from Hampshire to north London, while western Scotland is expected to experience the day's coolest temperatures, ranging between 17C and 18C."}, {"id": "acbf21f2-25b0-4ce1-96ea-00318b6013d2", "title": "Wildfire safety tips from experts", "date": "2024-08-01 00:00", "url": "https://edition.cnn.com/travel/how-to-survive-avoid-wildfire/", "domain": "edition.cnn.com", "domain_classification": "Unknown", "message": "If you’re completely overrun by fire, take shelter inside your vehicle – you’re going to be much better off than outside of the vehicle.\nIf you’re trapped outside during a wildfireThe Oak Fire burns through trees on July 24, 2022, near Jerseydale, California.\nIf you're trapped outdoors in a fire, try to find downhill escape routes.\nJustin Sullivan/Getty ImagesIf you’re trapped outdoors with a wildfire approaching, call 911 and give them your exact location, Heggie said.\nMott said we should think ahead and prepare for wildfire but also “don’t worry yourself sick about it."}, {"id": "50a40d58-dd50-4916-a864-545945beee64", "title": "Alabama Closely Monitoring Possible Tropical Depression Formation", "date": "2024-08-01 05:45", "url": "https://953thebear.com/alabama-closely-monitoring-possible-tropical-depression-formation/", "domain": "953thebear.com", "domain_classification": "Unknown", "message": "As we move into the prime hurricane season months of August, September, and October, The Townsquare Media Weather Center will closely monitor conditions.\nWe are paying attention to a tropical wave with a 60 percent chance of developing over the next 7 days.\nGet our free mobile appTropical Wave PositionA well-defined tropical wave has entered the eastern Caribbean, generating a broad area of disorganized showers and thunderstorms currently impacting the Leeward Islands, the US and UK Virgin Islands, and Puerto Rico.\nNews, Local News, Alabama News, Weather, Local Weather, Alabama Weather, West Alabama Weather, Central Alabama Weather, Breaking News, Central Alabama Weather, Breaking News, National Weather Service in Birmingham, James Spann, National Hurricane Center, Hurricane Season, Tropical Wave, Tropical Depression, Tropical Storm, Hurricane, will there be a hurricane to impact Alabama, Chances of Alabama getting a Hurricane, Could a Hurricane impact the Gulf Coast, Tropical Storm National Hurricane Center loading...\n- Mary K. Weather ForecasterPossible Scenarios from The Weather ChannelI​t develops but curves sharply north, then northeast, keeping it away from the U.S. East Coast."}, {"id": "7abee1af-2ca6-4160-a5f2-608f59c5735d", "title": "Alabama Closely Monitoring Possible Tropical Depression Formation", "date": "2024-08-01 02:30", "url": "https://wtug.com/ixp/532/p/alabama-closely-monitoring-possible-tropical-depression-formation/", "domain": "wtug.com", "domain_classification": "Unknown", "message": "As we move into the prime hurricane season months of August, September, and October, The Townsquare Media Weather Center will closely monitor conditions.\nWe are paying attention to a tropical wave with a 60 percent chance of developing over the next 7 days.\nGet our free mobile appTropical Wave PositionA well-defined tropical wave has entered the eastern Caribbean, generating a broad area of disorganized showers and thunderstorms currently impacting the Leeward Islands, the US and UK Virgin Islands, and Puerto Rico.\nNews, Local News, Alabama News, Weather, Local Weather, Alabama Weather, West Alabama Weather, Central Alabama Weather, Breaking News, Central Alabama Weather, Breaking News, National Weather Service in Birmingham, James Spann, National Hurricane Center, Hurricane Season, Tropical Wave, Tropical Depression, Tropical Storm, Hurricane, will there be a hurricane to impact Alabama, Chances of Alabama getting a Hurricane, Could a Hurricane impact the Gulf Coast, Tropical Storm National Hurricane Center loading...\n- Mary K. Weather ForecasterPossible Scenarios from The Weather ChannelI​t develops but curves sharply north, then northeast, keeping it away from the U.S. East Coast."}, {"id": "792aa7e2-33ab-4caf-bc89-aa1fcf9f9f5b", "title": "Severe storms in the Southeast US leave 1 dead and caus ... ", "date": "2024-08-01 05:45", "url": "https://accesswdun.com/article/2024/7/1255330", "domain": "accesswdun.com", "domain_classification": "Unknown", "message": "CANTON, Ga. (AP) — A weather system that produced severe thunderstorms late into the night in the Southeast left one man dead in Georgia, caused damage in a South Carolina town and left hundreds of thousands of electricity customers without power for a time.\nPower outages in southeastern Tennessee and northern Georgia had declined to about 30,000 by Wednesday morning, down from more than 200,000 in Georgia alone.\nWednesday's remaining outages were most concentrated around the town of Ellijay in the north Georgia mountains.\nIn Orangeburg, South Carolina, straight-line winds caused damage in the city's downtown district, blowing down metal from roofs and wood from awnings of downtown businesses.\nOfficials across southeastern Tennessee and northern Georgia said roads were blocked Wednesday because of downed trees and power lines."}, {"id": "b5ebd7d6-69f4-40d1-a437-6e8326ef64c5", "title": "Strong - to - severe storms could snarl rush hour in Chicago area – NBC Chicago", "date": "2024-08-01 01:30", "url": "https://www.nbcchicago.com/weather/severe-storms-could-bring-damaging-winds-heavy-rain-to-chicago-area/3507798/", "domain": "nbcchicago.com", "domain_classification": "Unknown", "message": "The Chicago area could wake up to strong-to-severe thunderstorms on Thursday, with the National Weather Service’s Storm Prediction Center upgrading the region to a “slight” risk of severe weather.\nAny storms that do develop could still produce rain and gusty winds, but may not reach severe limits.\nThe threat of rain in the Chicago area could stick around into Friday, as an area of low-pressure spins over Lake Michigan, shifting winds out of the north and bringing a few different waves of rain to the region.\nIt isn’t likely severe weather will develop from that system, but some embedded storms could form.\nThe next chance of rain doesn’t emerge until Tuesday, with temperatures cooling off after that system moves through."}, {"id": "07a6775c-5dff-4bce-9a80-47ebc2225e8f", "title": "A Severe Thunderstorm Watch has Been Issued", "date": "2024-08-01 00:15", "url": "https://www.kcrg.com/2024/07/31/evening-storms-with-severe-weather-possible/", "domain": "kcrg.com", "domain_classification": "Unknown", "message": "CEDAR RAPIDS, Iowa (KCRG) - A Severe Thunderstorm Watch has been issued for our western counties until 1 a.m.Current severe weather alerts from the National Weather Service.\n(KCRG)Your First Alert: More severe storm chances late this evening into tonightStorms are likely tonight, with a threat of severe weather once again.\nThe Storm Prediction Center includes most of the viewing area in a slight risk for severe weather with this activity, with the chances somewhat higher in central and western Iowa.\nSevere Weather Outlook (KCRG)Storm Timing (KCRG)Flash flooding could develop in spots today with the potential for heavy rainfall.\nThe threat for severe weather looks lower, but be ready for a potential brief period of rain and some lightning to move through at times."}, {"id": "69a1a3fa-21d6-4f78-8868-edf114321b1d", "title": "Live updates : Storms blast Omaha , closing Eppley Airfield , leaving 191 , 000 without power", "date": "2024-08-01 00:15", "url": "https://omaha.com/news/local/weather/live-updates-storms-blast-omaha-closing-eppley-airfield-leaving-132-000-without-power/article_23542a4c-4f8b-11ef-9764-b3765d3f6210.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "Massive trees were downed, branches fell inside houses and neighborhoods roared with the sounds of chainsaws beginning to clear the damage.\nNeighbors helped each other drag tree branches out of the road and survey damage to houses, which included downed fences, dislodged shingles on roofs and massive tree branches that narrowly missed vehicles.\n7:20 p.m.| The current power outage figures rival previous, memorable widespread Omaha power outages.\nWater pooled on the ground, tree branches swayed and several different sirens sounded through downtown.\nAs of 6 p.m., 61,000 Omaha Public Power District customers were without power, according to OPPD's outage alerts."}, {"id": "c31d63e8-a541-40f1-9ce6-f8b86ac5673d", "title": "Live updates : Storms blast Omaha , closing Eppley Airfield , leaving 191 , 000 without power", "date": "2024-08-01 00:15", "url": "https://omaha.com/news/local/weather/live-updates-thunder-rattles-homes-132-000-without-power-as-severe-storms-hit-omaha/article_23542a4c-4f8b-11ef-9764-b3765d3f6210.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "Storms creating damaging wind gusts of 90 miles per hour, sideways rain and house-rattling thunder left at least 216,000 without power in the Omaha metro Wednesday evening, according to Omaha Public Power District's power outage alerts.\nNeighbors helped each other drag tree branches out of the road and survey damage to houses, which included downed fences, dislodged shingles on roofs and massive tree branches that narrowly missed vehicles.\n7:20 p.m.| The current power outage figures rival previous, memorable widespread Omaha power outages.\nWater pooled on the ground, tree branches swayed and several different sirens sounded through downtown.\nAs of 6 p.m., 61,000 Omaha Public Power District customers were without power, according to OPPD's outage alerts."}, {"id": "36e3ebcd-3645-41e1-8dbc-bf155614e5fc", "title": "In the US , Disasters Strike All Over the Country", "date": "2024-08-01 00:45", "url": "https://learningenglish.voanews.com/a/in-the-us-disasters-strike-all-over-the-country/7712635.html", "domain": "learningenglish.voanews.com", "domain_classification": "Unknown", "message": "But a study from the nonprofit Rebuild by Design and New York University says disasters happen everywhere across the country.\nThe study looks at information on hundreds of federally declared disasters from 2011 to about 2021.\nThe study finds that eight of the nine counties with the most federally declared disasters since 2011 are in Kentucky.\nDisasters in unexpected placesIn July 2022, at least 40 people died, and 300 homes were damaged when a flood struck Floyd County in eastern Kentucky.\nSince 2011, FEMA has paid more than $41 billion in aid following hurricanes, the most of any kind of disaster."}, {"id": "100d8401-41c5-471e-9ccd-e2807ca6c808", "title": "Tropical Track Shifts Toward Gulf - Louisiana Could Feel Effects", "date": "2024-08-01 11:15", "url": "https://talkradio960.com/ixp/33/p/tropical-track-shifts-toward-gulf-louisiana-could-feel-effects/", "domain": "talkradio960.com", "domain_classification": "Unknown", "message": "Forecasters with the National Hurricane Center have been monitoring a tropical wave as it moved across the Atlantic Ocean.\nHere is the track forecast from the early morning hours of July 31st.\nNHC.noaa.gov NHC.noaa.gov loading...Over the past 12 to 24 hours track model forecasts have shifted more to the west.\nOne tropical model is particularly troublesome as it suggests the system will enter the Gulf of Mexico, strengthen, and then approach the Florida Panhandle.\nBy the way, should the system earn a name as a tropical storm it would be called Debby."}, {"id": "c3e1d7d7-ecda-4a96-933f-a0b8a9a72aef", "title": "Live updates : Severe storms blast Omaha , leaving 216 , 000 without power", "date": "2024-08-01 00:45", "url": "https://omaha.com/news/local/weather/live-updates-severe-storms-blast-omaha-leaving-216-000-without-power/article_23542a4c-4f8b-11ef-9764-b3765d3f6210.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "The massive wind storm brought down trees and branches, knocked over power lines and lifted heavy objects.\nWeather service: 'Peaceful weekend ahead'5:11 a.m.| Storm recovery workers will have good weather in which to work, the National Weather Service in Valley said Thursday morning.\n7:20 p.m. | The current power outage figures rival previous, memorable widespread Omaha power outages.\nA flood advisory due to excessive rainfall is also in effect until 9:15 p.m., according to the weather service.\nAs of 6 p.m., 61,000 Omaha Public Power District customers were without power, according to OPPD's outage alerts."}, {"id": "e5747dc2-4fd7-424b-b048-efa397d48719", "title": "Canton to relocate fire department with federal funds after repeated flooding", "date": "2024-08-01 02:45", "url": "https://wlos.com/news/local/canton-relocate-fire-department-federal-funds-repeated-flooding-mayor-fire-chief-fire-station-town-hall-flood-plain-tropical-storm-hurricane-faciliyu", "domain": "wlos.com", "domain_classification": "Unknown", "message": "After a long wait, financial help for Canton is working its way through the U.S. Congress.\nA total of $5.8 million is in the pipeline in Washington, D.C. to come to Canton for the fire department to move out of the flood plain.\nIt was August 17, 2021, when remnants of Tropical Storm Fred swamped downtown Canton, including the fire station, nearby town hall and police department.\nThe height of the water inside the station is marked on the wall from Hurricane Ivan and Tropical Storms Frances and Fred.\n\"We had nine feet of water, 12 feet and then five feet last time with Fred,\" Wheeler said."}, {"id": "722ebde3-6bc0-48a1-b7c5-86f0a7ebf083", "title": "News Wrap : 1 dead in Colorado Stone Canyon wildfire", "date": "2024-08-01 02:15", "url": "https://www.wuft.org/shows/newshour/clip/news-wrap-1722463505", "domain": "wuft.org", "domain_classification": "Unknown", "message": "In our news wrap Wednesday, one person has been killed in a wildfire in Colorado, more storms are in the forecast as Vermont residents clean up the mess left by debilitating rain and flooding, Venezuelan President Maduro asked his country's Supreme Court to audit the contested presidential election and the Biden administration announced proposals aimed at stopping the flow of fentanyl from Mexico."}, {"id": "a90b1514-0d70-41bb-8b82-d39140152321", "title": "Technically at war , South Korea offers flood relief to North Korea", "date": "2024-08-01 11:00", "url": "https://www.firstpost.com/world/technically-at-war-south-korea-says-ready-to-offer-flood-relief-to-north-korea-13799678.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "South Korea is ready to provide North Korea with relief supplies for damage caused by recent heavy rainfall, South Korea’s Red Cross said on Thursday, marking a rare outreach under the administration of President Yoon Suk Yeol to its neighbour.\nNorth Korean leader Kim Jong Un personally inspected the flooded areas and expressed grave concern over the damage, state media said on Monday.\nThere is a possibility of “significant human casualties” in North Korea, a Unification Ministry official said on Thursday.\nNorth Korea has cut off all lines of official communication with the South.\nMore rain was forecast for Sinuiju on Thursday and early Friday, according to South Korea’s weather agency."}, {"id": "4e4b0e76-c0e8-4b41-8f4e-a3aab77da826", "title": "Wild flamingos spotted in Georgia", "date": "2024-08-01 06:15", "url": "https://www.foxcarolina.com/2024/08/01/wild-flamingos-spotted-georgia/", "domain": "foxcarolina.com", "domain_classification": "Unknown", "message": "“Now we have another new species on the island which is really cool,” amateur naturalist Joshua Wicker said.\nWhen Joshua Wicker and his family visited St. Simons Island a few weeks ago, they were tickled pink by what they saw.\n“They’re up on a big marsh on the inside of the island, and it was just like, ‘Oh there it is!’”During the trip, Wicker spotted five flamingos hanging out in the water.\nThis is Georgia,” Wicker thought when he first saw them.\nIf you’re interested in learning more about wildlife in the area, Joshua Wicker offers entertaining and educational videos on his page, Y’all, Be Looking!"}, {"id": "463d86d6-1238-4632-977e-5af77465f491", "title": "South Korea ? 14 new dams initiative sparks mixed reactions from residents , local governments", "date": "2024-08-01 08:15", "url": "https://www.koreatimes.co.kr:443/www/nation/2024/08/371_379797.html", "domain": "koreatimes.co.kr", "domain_classification": "Local - Asia", "message": "In regions frequently affected by torrential rains, the plan was welcomed, while significant concerns arose in areas that have previously experienced negative impacts from dam construction.\nThe 14 candidate sites for the dams include nine locations proposed by local governments and five selected by the ministry.\nMixed reactions to dam plansAreas that frequently suffer from flooding during torrential rains welcomed the government's dam initiative.\nSimilarly, local governments in Daegu and North Gyeongsang Province, which have long advocated for dam construction, are supportive of the new plans.\nEnvironmental groups are voicing strong opposition to the government's dam construction plan, questioning its effectiveness and warning of potential ecological damage."}, {"id": "ac0bc8d3-ae3d-4845-a347-11af225d4549", "title": "Update : Damaging winds anticipated with thunderstorms in Dale and Houston counties Wednesday", "date": "2024-08-01 04:15", "url": "https://www.al.com/weather-alerts/2024/07/update-quarter-sized-hail-and-damaging-winds-anticipated-with-thunderstorms-in-southeast-alabama-wed.html", "domain": "al.com", "domain_classification": "Unknown", "message": "The National Weather Service issued an updated severe thunderstorm warning at 7:11 p.m. on Wednesday in effect until 7:30 p.m. for Dale and Houston counties.\nThe weather service adds, \"For your protection move to an interior room on the lowest floor of a building.\nUnfortunately, lightning is responsible for claiming the lives of approximately 20 people annually, as reported by the weather service.\nMastering wet roads: Safety tips for heavy rainfallWhen heavy rain pours, the risk of flooding and treacherous roads rises.\nAdvance Local Weather Alerts is a service provided by United Robots, which uses machine learning to compile the latest data from the National Weather Service."}, {"id": "f375ddfa-74fc-40e8-9766-82a72f512341", "title": "Earthquakes equalize late , but Galaxy score in 89th minute , steal win", "date": "2024-08-01 08:15", "url": "https://www.mercurynews.com/2024/07/31/earthquakes-equalize-late-but-galaxy-score-in-89th-minute-to-steal-leagues-cup-win/", "domain": "mercurynews.com", "domain_classification": "Unknown", "message": "SAN JOSE — The San Jose Earthquakes certainly had opportunities for another season-defining Leagues Cup win against the LA Galaxy on Wednesday.\nSan Jose finally equalized in the 75th minute on Jeremy Ebobisse’s strike in the box, but Los Angeles responded with substitute Miguel Berry’s tap-in off a Miki Yamane assist in the 89th minute.\nSan Jose needs a Galaxy win of any kind to guarantee a spot in the Leagues Cup’s 32-team knockout round.\nBut if they can carry their increased quality of play from the Leagues Cup forward, things may be different down the stretch.\nYet it could be a step in the right direction, one that eventually leads to San Jose breathing rarefied air once again."}, {"id": "e5ade835-aa06-449b-b1bd-2bd66fddf17a", "title": "2 . 2 magnitude earthquake shakes Hunterdon County in New Jersey", "date": "2024-08-01 00:45", "url": "https://www.yahoo.com/news/2-2-magnitude-earthquake-shakes-215747519.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "TEWKSBURY TOWNSHIP, N.J. (PIX11) – Maria Hadley has had enough earthquakes for a while.\n“I woke my husband and I’m like, ‘earthquake!’ and he’s like, ‘what?’ I’m like, ‘earthquake!’ He goes, ‘you’re dreaming, go back to sleep.\n'”More New Jersey NewsAccording to the USGS, another earthquake struck early Wednesday in Tewksbury Township, just a few minutes away from Hadley’s home, registering at 2.2 magnitude.\nWhen a 4.8 magnitude earthquake rocked the northeast on April 5, many of her plates and fine china crashed to the ground.\nMore Local NewsIf you live in or around Tewksbury Township, you may be curious when all this seismic activity will end."}, {"id": "dbf71850-96a1-49f8-a227-d5bc665c6e0a", "title": "August begins with hot temperatures and a few isolated thunderstorms", "date": "2024-08-01 04:45", "url": "https://www.koaa.com/weather/august-begins-with-hot-temperatures-and-a-few-isolated-thunderstorms", "domain": "koaa.com", "domain_classification": "Unknown", "message": "Tonight's Forecast:Tonight will be mostly clear, but there will be some wildfire smoke in the air from fires in northern Colorado.\nPlains forecast: Low: 60s; High: 90s;Mostly sunny and hot, just shy of the triple digits in the eastern plains.\nWalsenburg and Trinidad forecast: Low: 60/60; High: 91/90;Mostly sunny for the first half of the day with hot temperatures.\nMountains forecast: Low: 40s/50s; High: 80s;The mountain valleys will be hot, with highs in the mid to upper-80s on Thursday.\nExtended outlook forecast:Friday will be similar to Thursday with hot temperatures, a hazy sky with wildfire smoke, and a chance of afternoon thunderstorms."}, {"id": "ba5b46c7-1e9a-49de-81ce-4825a8b0e3a9", "title": "Loudoun County farmers can apply for emergency drought aid", "date": "2024-08-01 00:30", "url": "https://www.yahoo.com/news/loudoun-county-farmers-apply-emergency-220216628.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "LOUDOUN COUNTY, Va. (DC News Now) — Farmers in Loudoun County are eligible for emergency loan assistance from the federal government due to the drought during this year’s growing season.\nU.S. Department of Agriculture (USDA) Secretary Thomas Vilsack declared Loudoun and 14 other Virginia counties as “primary natural disaster areas,” allowing the Farm Service Agency (FSA) to offer emergency loans and other assistance to farmers impacted by the drought.\nFarmers have eight months to apply for the loans.\nFarmers in Loudoun County specifically can also receive support through the Loudoun County Department of Economic Development and Virginia Cooperative Extension.\nFor the latest news, weather, sports, and streaming video, head to DC News Now | Washington, DC."}, {"id": "50f36bb3-9a4d-4f21-a07c-cc699c3aab8f", "title": "Alf Coleman Road close to completion", "date": "2024-08-01 02:15", "url": "https://www.wjhg.com/2024/07/31/alf-coleman-road-close-completion/", "domain": "wjhg.com", "domain_classification": "Unknown", "message": "PANAMA CITY BEACH, Fla. (WJHG/WECP) - Alf Coleman Road is nearing completion and it has been two hundred days in the making.\n“When rains come, that area does tend to flood, the road was a low point, so the water tended to collect on the road.\nBy raising the road, we now make sure that is passable during storm events, that important for emergency evacuation.\nWhile Panama City Officials said that the road should be fully complete in 30 to 60 days, there should be some road closures in the meantime.\nThe city also has plans to make the road four lanes in the early 2030s."}, {"id": "345ca905-8e84-470d-a2b6-06db6128298e", "title": "National Hurricane Center tracking possible tropical storm formation near Bahamas , Florida – ICSF", "date": "2024-08-01 08:30", "url": "https://www.icsf.net/newss/national-hurricane-center-tracking-possible-tropical-storm-formation-near-bahamas-florida/", "domain": "icsf.net", "domain_classification": "Unknown", "message": "A​ disturbance in the Atlantic continues to be watched for possible formation into a tropical storm, but there are multiple scenarios in play when it comes to the track of this system as it nears the Bahamas and the southeastern United States by this weekend.\nThe tropical wave that might eventually grow into a tropical depression or storm is located over the Leeward Islands, or near the “X” in the graphic below, according to the National Hurricane Center.\nC​omputer models suggest wind shear may be relatively light, and there’s plenty of warm ocean water ahead of this system to fuel its development near the Bahamas or the Gulf of Mexico.\nHowever, this rather large tropical disturbance will likely have to interact with land along the way, particularly Hispaniola and Cuba, but also possibly Florida.\nSo, it may take some time for one area of thunderstorms to persist over water, lower surface pressure and begin the process of developing a tropical depression, if that happens at all."}, {"id": "718c9208-0f33-4ca9-9ae1-474ff044a9db", "title": "Visitors to Rio Hondo were amazed , but these goats merely grazed", "date": "2024-08-01 07:00", "url": "https://www.dailynews.com/2024/07/31/visitors-to-rio-hondo-were-amazed-but-these-goats-merely-grazed/", "domain": "dailynews.com", "domain_classification": "Unknown", "message": "A girl feeds a goat a piece of cabbage during a meet-and-greet event for the animals at Rio Hondo College on Wednesday, July 31.\n(Photo by Raphael Richardson, Contributing Photographer)College officials pet a baby goat during a meet-and-greet event for the animals at Rio Hondo College on Wednesday, July 31.\n(Photo by Raphael Richardson, Contributing Photographer)A college official cradles a baby goat during a meet-and-greet event for the animals at Rio Hondo College on Wednesday, July 31.\n(Photo by Raphael Richardson, Contributing Photographer)A goat is fed a carrot during a meet-and-greet event for the animals at Rio Hondo College on Wednesday, July 31.\n(Photo by Raphael Richardson, Contributing Photographer) ExpandWild goats roamed the campus at Río Hondo College on Wednesday, July 31."}, {"id": "3d86bd2b-2dfe-4fe1-ba0a-31a32c85ec04", "title": "I Saw Twisters And Loved It But This One Aspect Really Impacted Me", "date": "2024-08-01 04:30", "url": "https://www.cinemablend.com/movies/loved-twisters-but-one-aspect-really-impacted-me", "domain": "cinemablend.com", "domain_classification": "Unknown", "message": "Twisters is a movie I never planned to watch, at least in the theater.\nTwisters could have simply been a fun movie about chasing tornadoes and tornado wrangling.\nThe film doesn’t really take a stand and go \"maybe if people stopped doing this, then maybe there would be fewer tornadoes.\"\nTwisters potential impact may justify its existence and maybe create a demand for more standalone sequels to '90s movies.\nCould you hold on to bars in a pool and really protect yourself from flying away during a storm??"}, {"id": "20502069-431e-4cfc-8c60-d442f033a937", "title": "Arson Suspect Arrested In Forest | News Radio 1190 KEX", "date": "2024-08-01 00:30", "url": "https://1190kex.iheart.com/content/2024-07-31-arson-suspect-arrested-in-forest/", "domain": "1190kex.iheart.com", "domain_classification": "Unknown", "message": "Bureau of Land Management law enforcement rangers recently caught an arsonist who ignited a small wildfire earlier this month.\nThey put out the fire and called the BLM once they determined it was located on BLM land in Lane County.\nBLM Law Enforcement in coordination with BLM contract deputies at the Lane County Sherif’s Office swiftly identified a suspect.\nAfter the confession, BLM law enforcement arrested the suspected, who was booked into the Lane County Jail.\n“We all need to be responsible visitors and take care of our public lands.”“Before venturing out to public lands, always check local fire restrictions,” Johnson continued."}, {"id": "f7049234-845f-4236-ba1b-305399c2407b", "title": "Arson Suspect Arrested In Forest | 106 . 7 The Eagle", "date": "2024-08-01 00:15", "url": "https://1067theeagle.iheart.com/content/2024-07-31-arson-suspect-arrested-in-forest/", "domain": "1067theeagle.iheart.com", "domain_classification": "Unknown", "message": "Bureau of Land Management law enforcement rangers recently caught an arsonist who ignited a small wildfire earlier this month.\nThey put out the fire and called the BLM once they determined it was located on BLM land in Lane County.\nBLM Law Enforcement in coordination with BLM contract deputies at the Lane County Sherif’s Office swiftly identified a suspect.\nAfter the confession, BLM law enforcement arrested the suspected, who was booked into the Lane County Jail.\n“We all need to be responsible visitors and take care of our public lands.”“Before venturing out to public lands, always check local fire restrictions,” Johnson continued."}, {"id": "64e361e6-f592-4d55-b382-abb8038ae7dd", "title": "Arson Suspect Arrested In Forest | Z100 Portland", "date": "2024-08-01 02:30", "url": "https://z100portland.iheart.com/content/2024-07-31-arson-suspect-arrested-in-forest/", "domain": "z100portland.iheart.com", "domain_classification": "Unknown", "message": "Bureau of Land Management law enforcement rangers recently caught an arsonist who ignited a small wildfire earlier this month.\nThey put out the fire and called the BLM once they determined it was located on BLM land in Lane County.\nBLM Law Enforcement in coordination with BLM contract deputies at the Lane County Sherif’s Office swiftly identified a suspect.\nAfter the confession, BLM law enforcement arrested the suspected, who was booked into the Lane County Jail.\n“We all need to be responsible visitors and take care of our public lands.”“Before venturing out to public lands, always check local fire restrictions,” Johnson continued."}, {"id": "1b073578-40f9-41a4-8940-d0f2035531f6", "title": "Arson Suspect Arrested In Forest", "date": "2024-08-01 03:00", "url": "https://jamn1075.iheart.com/content/2024-07-31-arson-suspect-arrested-in-forest/", "domain": "jamn1075.iheart.com", "domain_classification": "Unknown", "message": "Bureau of Land Management law enforcement rangers recently caught an arsonist who ignited a small wildfire earlier this month.\nThey put out the fire and called the BLM once they determined it was located on BLM land in Lane County.\nBLM Law Enforcement in coordination with BLM contract deputies at the Lane County Sherif’s Office swiftly identified a suspect.\nAfter the confession, BLM law enforcement arrested the suspected, who was booked into the Lane County Jail.\n“We all need to be responsible visitors and take care of our public lands.”“Before venturing out to public lands, always check local fire restrictions,” Johnson continued."}, {"id": "bcdc821b-eb01-464a-a2d1-d8984a8873c5", "title": "Arson Suspect Arrested In Forest | 105 . 9 The Brew", "date": "2024-08-01 03:15", "url": "https://1059thebrew.iheart.com/content/2024-07-31-arson-suspect-arrested-in-forest/", "domain": "1059thebrew.iheart.com", "domain_classification": "Unknown", "message": "Bureau of Land Management law enforcement rangers recently caught an arsonist who ignited a small wildfire earlier this month.\nThey put out the fire and called the BLM once they determined it was located on BLM land in Lane County.\nBLM Law Enforcement in coordination with BLM contract deputies at the Lane County Sherif’s Office swiftly identified a suspect.\nAfter the confession, BLM law enforcement arrested the suspected, who was booked into the Lane County Jail.\n“We all need to be responsible visitors and take care of our public lands.”“Before venturing out to public lands, always check local fire restrictions,” Johnson continued."}, {"id": "0dc8ce2b-2f0c-4202-9a45-559ac830aa92", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 08:45", "url": "https://www.squamishchief.com/national-news/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297544", "domain": "squamishchief.com", "domain_classification": "Unknown", "message": "A sudden release of water from the blocked Chilcotin River \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, the government says.\nA government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope.\nEvacuation orders issued Wednesday remain in place, covering 107 kilometres along both sides of the Chilcotin River, after the Cariboo Regional District said there was an immediate danger to life and safety due to flooding."}, {"id": "e10fdab6-2f94-4c10-a319-2de631d28e94", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 10:00", "url": "https://www.thompsoncitizen.net/national-news/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297544", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "A sudden release of water from the blocked Chilcotin River \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, the government says.\nA government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope.\nEvacuation orders issued Wednesday remain in place, covering 107 kilometres along both sides of the Chilcotin River, after the Cariboo Regional District said there was an immediate danger to life and safety due to flooding."}, {"id": "0299e001-ebbd-4504-8e57-547440567284", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 10:00", "url": "https://www.thompsoncitizen.net/the-mix/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297531", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "— British Columbia's Ministry of Land and Water says personnel are conducting assessments near a landslide that blocked the Chilcotin River in the province's Interior, including to understand risks that might exist downstream.\nA government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope.\nEvacuation orders issued Wednesday remain in place, covering 107 kilometres along both sides of the Chilcotin River, after the Cariboo Regional District said there was an immediate danger to life and safety due to flooding."}, {"id": "9b524b09-a463-4bc8-a5b5-5e45d7439b99", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 11:00", "url": "https://www.fitzhugh.ca/national-news/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297540", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "— British Columbia's Ministry of Land and Water says personnel are conducting assessments near a landslide that blocked the Chilcotin River in the province's Interior, including to understand risks that might exist downstream.\nA government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope.\nEvacuation orders issued Wednesday remain in place, covering 107 kilometres along both sides of the Chilcotin River, after the Cariboo Regional District said there was an immediate danger to life and safety due to flooding."}, {"id": "c2588823-495d-472a-bf28-99d5cc7a8fda", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 10:45", "url": "https://energeticcity.ca/2024/08/01/b-c-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations/", "domain": "energeticcity.ca", "domain_classification": "Unknown", "message": "Your Community, Your NewsDid you know that Energeticcity.ca is the only newsroom in Fort St. John with ALL of our staff based here?\nThat’s why you can trust us to deliver accurate, timely and reliable news when you need it most."}, {"id": "9b6df138-951b-4ae5-aeba-df4dca25b7dc", "title": "B . C . issues flood warning , watches after landslide blocks river , forces evacuations", "date": "2024-08-01 11:15", "url": "https://www.coastreporter.net/the-mix/bc-issues-flood-warning-watches-after-landslide-blocks-river-forces-evacuations-9297531", "domain": "coastreporter.net", "domain_classification": "Unknown", "message": "— British Columbia's Ministry of Land and Water says personnel are conducting assessments near a landslide that blocked the Chilcotin River in the province's Interior, including to understand risks that might exist downstream.\nA government statement says the landslide Wednesday blocked the river that feeds into the Fraser River, and a sudden release of water \"may cause rapid rises in river levels downstream along the Fraser River\" south to Hope, B.C.\nThe River Forecast Centre has issued a flood warning for the Chilcotin River upstream of the landslide and a flood watch downstream.\nA flood watch is also in place for the Fraser River from the Chilcotin River confluence to Hope as well as a high streamflow advisory for the Fraser River west of Hope.\nEvacuation orders issued Wednesday remain in place, covering 107 kilometres along both sides of the Chilcotin River, after the Cariboo Regional District said there was an immediate danger to life and safety due to flooding."}]