[{"id": "5238be53-f058-432e-9813-f8ba939cea2f", "title": "Genesis Prize Marks Tenth Anniversary by Honoring Barbra Streisand", "date": "2024-06-08 03:15", "url": "https://www.theautochannel.com/news/2024/06/07/1391209-genesis-prize-marks-tenth-anniversary-by-honoring-barbra-streisand.html", "message": "(https://www.genesisprize.org/honorees)Founder and Chairman of The Genesis Prize Foundation Stan Polovets said: \"The entire world knows and adores Barbra Streisand as a singer, actress, and director.\nBarbra Streisand stated: \"I am delighted to be honored by the special 10th Anniversary Genesis Prize and to work with The Genesis Prize Foundation to support organizations that acknowledge our shared humanity and seek to better our society.\nAll Genesis Prize laureates donate their $1 million prize to philanthropic causes.\nShe founded the Barbra Streisand Women's Heart Center at Cedars-Sinai to support research and raise awareness about women's heart disease.\nAbout The Genesis Prize FoundationThe Genesis Prize is a global award that celebrates Jewish achievement and contribution to humanity."}, {"id": "7004aaa0-1201-421e-89ea-b2bf6fcf05ef", "title": "Valley News - Dartmouth commencement marks end to trying , tumultuous year", "date": "2024-06-08 03:00", "url": "https://www.vnews.com/Sunday-s-commencement-marks-the-close-of-a-challenging-year-for-Dartmouth-55416821", "message": "Teevens, a Dartmouth alum with a national profile in football, was in many ways the charismatic face of the college.\nSo it came as something of a shock on Sept. 19 when news broke that Teevens, 66, had died, ushering in a season of grief on the Dartmouth campus.\nSurgeon General Vivek Murthy and all six of his living predecessors visited the Dartmouth campus in September for forums and events related to Beilock’s mental health and wellness initiative.\nAs a condition of their bail, the arrested Dartmouth students were banned from the Green and from entering Parkhurst Hall, the campus’ administrative building.\nThe governing board “supports the difficult decisions President Beilock made,” Chairperson Liz Lempres said by email Thursday."}]