[{"id": "672f3d46-79b2-4265-ace5-1aaa48bd3330", "title": "Letter : Israel started it", "date": "2024-06-08 08:15", "url": "https://www.unionleader.com/opinion/letters_to_editor/letter-israel-started-it/article_75d4ce76-fcd3-11ee-938f-ab6955982ae9.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "da85aecc-145d-42af-8acc-bd15848f3cb2", "title": "Russia blames US for deaths on its soil - Newspaper", "date": "2024-06-08 03:30", "url": "https://www.dawn.com/news/1838528/russia-blames-us-for-deaths-on-its-soil", "message": "ST PETERSBURG: Russia accused Ukraine on Friday of ‘using US-supplied rockets’ to kill women and children, in a region of southern Russia and added that “Washington is to blame”.\nThis is the first time Russia has stated that it holds the United States responsible for civilian deaths on its own soil.\nThis accusation follows warnings by President Vladimir Putin that the West is playing with fire and risking a global conflict by letting Ukraine fire Western-supplied weaponry into Russia.\nShe alleged this was ‘shortly’ after the United States ‘agreed for the first time’ to let Ukraine fire US-supplied weapons into Russia.\nThe eastern Lugansk border region is almost entirely under the control of Moscow, which has claimed its full annexation."}, {"id": "80c2cfaf-d4e3-46a4-ac83-24ca4dc19cbe", "title": "Media : Explosions reported across occupied Crimea", "date": "2024-06-08 02:45", "url": "https://www.yahoo.com/news/media-explosions-reported-across-occupied-012654335.html", "message": "Explosions were heard across Sevastopol in occupied Crimea overnight on June 8, the Telegram channel Crimean Wind reported.\nAt around 1:39 a.m. local time, residents of Balaklava, a settlement in the city of Sevastopol, reportedly heard explosions.\nThe Russian proxy leader in Sevastopol in occupied Crimea, Mikhail Razvozhayev, later claimed that the \"loud sounds\" residents heard in the Striletska Bay were the Russian forces destroying an \"unmanned boat.\"\nThe Crimean Wind alleged that residents of Sevastopol had their windows blown out by the explosion in the coastal area.\nEarlier this week, Ukraine's military carried out a naval strike in occupied Crimea overnight on June 6, destroying a Project 498 \"Saturn\" raiding tugboat."}, {"id": "7021241a-7e75-4015-ba29-702b2f2d4cd2", "title": "22 civilians killed by Ukrainian shelling : Russia", "date": "2024-06-08 06:00", "url": "https://www.prokerala.com/news/articles/a1537810.html", "message": "Moscow, June 8 : At least 22 civilians were killed as Ukrainian forces bombed a store in the village of Sadovoye in Russia's Kherson, region's Governor Vladimir Saldo said.\nSaldo said that on Friday, at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\nAccording to the Governor, the strike occurred twice, reports Xinhua news agency.\n\"The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,\" Saldo was quoted as saying in the report.\n\"After the first arrival, people from neighbouring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived."}, {"id": "e62ed704-202d-4296-a86c-9e5d2aa3fafb", "title": "Kremlin Claims Kyiv Strikes on Russian - Occupied Ukraine Kill 26", "date": "2024-06-08 09:15", "url": "https://www.kyivpost.com/post/33964", "message": "Ukrainian strikes on parts of the Russian-held Luhansk and Kherson regions killed 26 people and injured dozens more on Friday, occupation authorities said.\nBoth Ukrainian regions were among four Russia claimed to have annexed in September 2022 despite not fully controlling any of them following the full-scale invasion launched that February.\nAdvertisementSaldo condemned the “vile murder of civilians” made possible by Western arms deliveries to Ukraine.\nOver the last week, Russian troops “improved their positions along the front line and liberated the settlement of Paraskoviivka,” the ministry said.\nAdvertisementIn the central city of Nikopol in the Dnipropetrovsk region, Russian shelling killed a 71-year-old woman, the regional authorities said."}, {"id": "c4e61adf-88a1-4324-81fc-4ee70f493709", "title": "Two months after the strike on World Central Kitchen workers , U . S . still reviewing Israel investigation", "date": "2024-06-08 00:45", "url": "https://www.yahoo.com/news/two-months-strike-world-central-000024719.html", "message": "A man displays blood-stained British, Polish, and Australian passports after an Israeli airstrike in Deir al-Balah, Gaza, on April 1, 2024, killed seven World Central Kitchen workers.\nIn the aftermath of the strike on WCK aid workers, the group called for an independent inquiry into the deadly attack.\nAdministration officials have been quick to point out that Israel made some adjustments to its rules of operation based on the findings from its investigation into the WCK strike.\nThe pier was reattached to the beach in Gaza on Friday, according to U.S. Central Command, and the Biden administration expects aid deliveries to resume in the coming days.\nThe goal will be to move 500,000 pounds over the beach daily initially and then grow that over time, administration officials have said."}, {"id": "92dfa60c-8d36-4fbb-ae21-255fee1d2d93", "title": "Israel bombs another UN - run school in Gaza , a day after strike on school killed 33", "date": "2024-06-08 09:15", "url": "https://www.independent.ie/world-news/middle-east/israel-bombs-another-un-run-school-in-gaza-a-day-after-strike-on-school-killed-33/a1631676334.html", "message": "Palestinians look at the aftermath of the Israeli strike on a U.N.-run school that killed dozens of people in the Nusseirat refugee camp in the Gaza StripAn Israeli airstrike hit a U.N.-run school compound in northern Gaza on Friday, killing three people according to Palestinian emergency officials, a day after a similar strike on a school in Gaza's center killed at least 33 people.\nIn both airstrikes, the Israeli army said Hamas militants were operating from within the schools.\nThe Associated Press could not verify the claims."}, {"id": "931b35c6-a41f-4bfa-ba03-82b59b029388", "title": "Israel defends targeting UNRWA school after dozens killed", "date": "2024-06-08 00:00", "url": "https://www.thejc.com/news/israel/israel-defends-targeting-unrwa-school-after-dozens-killed-mxsxcryr", "message": "Dozens of civilians have reportedly been killed after Israel launched an air strike against a school that it claimed terrorists were hiding in.\nThe strike hit al-Sardi school, which is run by the Unrwa Palestinian refugee agency, in the early hours of Thursday morning.\nUS State Department spokesperson Matthew Miller said he had seen reports that 14 children had been killed in the blast.\nIn a statement, the IDF said they had carried out a \"precise strike on a Hamas compound embedded inside\" the school.\nThe ones there are children, playing.”Sam Rose, the director of planning for Unrwa, told The Guardian he was not surprised to see an IDF strike cause civilian causalities."}, {"id": "249acbfd-38f6-4a01-bf05-b03c4dbd029c", "title": "Israeli forces batter Gaza as tanks advance in Rafah - Newspaper", "date": "2024-06-08 03:30", "url": "https://www.dawn.com/news/1838536/israeli-forces-batter-gaza-as-tanks-advance-in-rafah", "message": "CAIRO: With a renewed ceasefire push stalled, Israel bombarded central and southern areas of Gaza Strip again on Friday, killing 28 Palestinians, and tank forces advanced to the western edges of Rafah.\nGaza health officials said two Palestinians had been killed and several wounded in western Rafah from tank shelling there.\nIn central Gaza, Palestinian medics said 15 people died overnight in Israeli bombardment.\nIn northern Gaza, three Palestinians were killed in an Israeli air strike on a Gaza City school building that was sheltering displaced families, rescue workers said.\nHamas said on Friday its fighters shelled militants in the central city of Deir al-Balah shelled a house where Israeli troops were barricaded, killing some and wounding others."}, {"id": "1f3d9de9-dce9-4022-84b9-9d7d9ed76582", "title": "Danish prime minister attacked in Copenhagen", "date": "2024-06-08 00:15", "url": "https://www.voanews.com/a/danish-prime-minister-attacked-in-copenhagen-/7647539.html", "message": "Danish Prime Minister Mette Frederiksen was struck on Friday by a man in a Copenhagen square, her office said, with EU chiefs quickly condemning the attack.\nThe Danish prime minister's office said in a statement to AFP that Frederiksen was \"shocked by the incident,\" but it did not provide further details.\n\"Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet in Copenhagen.\nOn May 15, Slovak Prime Minister Robert Fico was shot four times at close range as he greeted supporters after a government meeting in the central town of Handlova.\n\"I must say that it shakes all of us who are close to her,\" Danish Environment Minister Magnus Heunicke said in a post to social media."}, {"id": "0008ac53-53cb-4e90-9c3e-25ecf97310b0", "title": "UN set to add Israel , Hamas to  blacklist  over violations against children", "date": "2024-06-08 03:00", "url": "https://www.yahoo.com/news/un-set-add-israel-hamas-001446039.html", "message": "The United Nations secretary-general is set to describe Israel and Hamas as waging a war that violates children’s rights, moving the country to the body’s “blacklist” in an upcoming report to the Security Council.\nHamas and Palestinian Islamic Jihad will also be listed, according to a report by the Associated Press.\nIsrael has faced strong international criticism over the number of civilian deaths in the eight-month war with Hamas.\nMeanwhile, Israel claimed the attack was a “precise strike on a Hamas compound” inside the school.\nThe UN’s decision to include Israel in this report comes before Netanyahu is set to address a joint session of Congress on July 24th."}, {"id": "655d41d1-84fc-4e6d-967a-65fccf31dd6d", "title": "Israel pounds Gaza refugee camp as war enters 9th month", "date": "2024-06-08 00:30", "url": "https://www.omanobserver.om/article/1154798/world/region/israel-pounds-gaza-refugee-camp-as-war-enters-9th-month", "message": "Israeli forces bombarded a Gaza refugee camp on Friday after a deadly strike on a UN-run school there, as the war sparked by Hamas's unprecedented attack on Israel entered its ninth month.\nAl Aqsa Martyrs hospital in Deir al Balah, central Gaza, said at least 37 people were killed in Thursday's Israeli strike on the UN-run school in Nuseirat camp.\nThe Israeli military said its fighter jets killed nine \"fighters\" in three classrooms where about 30 militants from Hamas and IJ were hiding.\nWitnesses also reported Israeli strikes east of Deir al Balah and intensive fire from army vehicles near the Bureij camp, where a blaze was raging.\nThe Israeli military said it \"eliminated dozens of fighters\" in eastern Bureij and Deir al Balah."}, {"id": "c9633e0e-deef-4e91-b192-20ce5ae3bbca", "title": "Israel  disgusted  after being placed on UN list of countries failing to protect children", "date": "2024-06-08 05:00", "url": "https://www.sbs.com.au/news/article/israel-disgusted-after-being-placed-on-un-list-of-countries-failing-to-protect-children/msudim6nz", "message": "Key Points Israel will be included on the UN's annual list of countries it deems to be failing to protect children in war.\nThe upcoming inclusion of Israel on a UN list of countries and armed forces determined to be failing to protect children in war prompted a furious Israeli response Friday.\nIn central Gaza, Palestinian medics said at least 15 people died overnight in Israeli bombardments.\nAn Israeli strike on a Gaza school killed as many as 40 people, medics said.\nMore than 36,700 people have been killed in Gaza since 7 October, according to the health ministry in Gaza."}, {"id": "c3022ea4-b8d6-4912-9ff7-7a5686c349d2", "title": "Slovakia and Italy to vote today as bumper EU elections continue across the continent", "date": "2024-06-08 09:00", "url": "https://www.thejournal.ie/slovakia-elections-6401933-Jun2024/", "message": "POLLS HAVE OPENED in Slovakia as EU elections continue this morning, with voting to get underway in Italy later also.\nSlovakia’s elections take place under the shadow of last month’s shooting of Prime Minister Robert Fico.\nIn Ireland, counting is due to get underway later this morning in the local elections, with counting in the EU elections to kick off tomorrow morning.\nHistorically however, Slovakia registers low turnout in EU elections.\nItaly and the far-rightIn Italy, far-right Prime Minister Giorgia Meloni is hoping a strong showing from her party will strengthen her hand as a key EU powerbroker."}, {"id": "582f8f4d-6191-41ff-bbe9-5f722580c35f", "title": "Disinformation Campaign Exposed : Alleged Houthi Strike on USS Eisenhower Found Baseless", "date": "2024-06-08 05:00", "url": "https://trendydigests.com/2024/06/08/disinformation-campaign-exposed-alleged-houthi-strike-on-uss-eisenhower-found-baseless/", "message": "A cursory glance at social media over the past week might have you thinking the USS Eisenhower was damaged by a missile fired by the Houthis.\nThese false claims involved a video, uploaded to the social media platform X, which gained traction among users.\nThe footage, allegedly showing the Eisenhower on fire, has been identified as taken from a popular video game.\nMisinformation of this nature is not simply a matter of erroneous reporting; it might also forms a part of a disinformation campaign carefully orchestrated disinformation campaign to confuse those on social media.\nIt’s essential to note the Houthi military spokesperson Yahya Saree’s repeated allegations of successful strikes against the Eisenhower and accompanying warships."}, {"id": "953b7d46-b630-4b32-b1ac-ea2460ee9e9e", "title": "Russia Advanced Yasen - M Class Nuclear Submarine Is Headed For Cuba", "date": "2024-06-08 01:45", "url": "https://www.yahoo.com/news/russias-advanced-yasen-m-class-001237490.html", "message": "The Russian Navy frigate Admiral Gorshkov arrives in the port of Havana during a previous visit to Cuba on June 24, 2019.\nThe first-in-class Russian Navy Project 22350 frigate Admiral Gorshkov was sailing in the Caribbean in June 2019.\nLast July, for example, the Russian Navy sent the training class ship Perekop into Havana for a four-day visit.\nMinistry of Defense of RussiaSignificant, too, is the fact that the Kazan and the Admiral Gorshkov are notably modern and capable assets.\nEarlier this week, a senior U.S. official suggested that the current Russian Navy deployment might also include a port call in Venezuela."}, {"id": "7d159a33-5b1a-4209-a381-cb988742403d", "title": "22 civilians killed by Ukrainian shelling : Russia", "date": "2024-06-08 07:45", "url": "https://www.mangalorean.com/22-civilians-killed-by-ukrainian-shelling-russia/", "message": "22 civilians killed by Ukrainian shelling: RussiaMoscow: At least 22 civilians were killed as Ukrainian forces bombed a store in the village of Sadovoye in Russia’s Kherson, region’s Governor Vladimir Saldo said.\nSaldo said that on Friday, at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\nAccording to the Governor, the strike occurred twice, reports Xinhua news agency.\n“The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,” Saldo was quoted as saying in the report.\n“After the first arrival, people from neighbouring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived."}, {"id": "34f0313e-90c5-4d28-bc05-768f95d5b92f", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 00:30", "url": "https://www.koka.am/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "e735b7f7-9726-4624-8d38-e161170bb417", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 00:30", "url": "https://www.k101fm.net/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "cf03e862-63e5-4f23-b52f-0a16c39c899d", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 00:00", "url": "https://www.centralmoinfo.com/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "dde93078-2293-4e82-bc10-f5c013c41cdc", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 01:45", "url": "https://www.exploreseiowa.com/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "16f0171d-daab-49c2-a3f9-84fb5b403762", "title": "Israel - Gaza live updates : 3 killed , 15 injured in Israeli strike on another UNRWA school", "date": "2024-06-08 01:15", "url": "https://www.kdks.fm/syndicated-article/?id=1568278", "message": "All times Eastern:Jun 07, 12:58 PM3 dead, 15 injured in Israeli strike on another UNRWA school, shelterThree Palestinians were killed and 15 others were injured when Israeli forces struck an UNRWA school and shelter in Al-Shati refugee camp in northern Gaza Friday, according to statements from Hamas and the Israel Defense Forces.\n-ABC News’ Luis MartinezJun 06, 6:19 PM40 killed, dozens injured in Israeli strike on UNRWA schoolAt least 40 people were killed — 14 of whom were children — and at least 74 others were injured in the Israeli strike on an UNRWA school at the Nuseirat Refugee Camp, the Gaza Ministry of Health said Thursday.\nABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday."}, {"id": "f0b4fa30-8e21-48ee-af0b-1093deb47be3", "title": "Israel Bombs Another UN - Run School In Gaza , A Day After Strike On School Killed 33 – 710am KURV", "date": "2024-06-08 01:00", "url": "https://www.kurv.com/israel-bombs-another-un-run-school-in-gaza-a-day-after-strike-on-school-killed-33/", "message": "(AP)–An Israeli airstrike hit a U.N.-run school compound in northern Gaza on Friday, killing three people according to Palestinian emergency officials, a day after a similar strike on a school in Gaza’s center killed at least 33 people.\nIn both airstrikes, the Israeli army said Hamas militants were operating from within the schools.\nIsrael on Friday released the names of 17 militants it said were killed in Thursday’s strike.\nInternational pressure is mounting on Israel to limit civilian bloodshed in its war in Gaza, which completed its eighth month on Friday.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250."}, {"id": "70312740-0001-4cf0-b3be-2b1465e6f13d", "title": "Danish Prime Minister Frederiksen assaulted in Copenhagen", "date": "2024-06-08 00:00", "url": "https://www.euronews.com/my-europe/2024/06/07/danish-prime-minister-frederiksen-assaulted-in-copenhagen", "message": "The Prime Minister's office said she was \"beaten\" and \"left in shock\" but was able to walk away afterwards.\nADVERTISEMENTDanish Prime Minister Mette Frederiksen has been assaulted by an unknown man in Kultorvet, a central square in Copenhagen, Danish media has reported.\nFrench Prime Minister Emmanuel Macron posted that \"the attack on the Danish Prime Minister is unacceptable.\"\nLast month, Slovakia's Prime Minister survived an assassination attempt in the central Slovakian town of Handlová.\nSweden's Foreign Minister, Tobias Billström reacted to Friday's attack against Frederiksen on X saying that such an “absolutely terrible” attack should be strongly condemned."}, {"id": "e3ec036a-6602-442c-a7f0-e423db6a207f", "title": "Russia says 22 civilians killed by Ukrainian shelling - Xinhua", "date": "2024-06-08 04:45", "url": "https://english.news.cn/20240608/da664d6e03b44da7a62b6e0681672c8a/c.html", "message": "MOSCOW, June 8 (Xinhua) -- Ukrainian forces bombed a store in the village of Sadovoye in Russia's Kherson region twice on Friday, killing 22 civilians, the region's Governor Vladimir Saldo said.\nSaldo said that at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\n\"The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,\" Saldo was quoted as saying in the report.\n\"After the first arrival, people from neighboring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived.\nAmong the dead were two children,\" Saldo added."}, {"id": "41f31e89-49ad-48f1-8867-5834586d0101", "title": "Russia says 22 civilians killed by Ukrainian shelling | Central India Premier English Daily", "date": "2024-06-08 06:30", "url": "https://www.centralchronicle.com/russia-says-22-civilians-killed-by-ukrainian-shelling/", "message": "Moscow, June 8 (UNI) Ukrainian forces bombed a store in the village of Sadovoye in Russia’s Kherson region twice on Friday, killing 22 civilians, the region’s Governor Vladimir Saldo said.\nSaldo said that at the time of the attack, there were a significant number of customers and staff inside the store, according to a TASS report.\n“The first (strike) was delivered by a guided French aerial bomb, and the second by a well-known American HIMARS projectile,” Saldo was quoted as saying in the report.\n“After the first arrival, people from neighboring houses ran out to help the victims; after a short period of time, a HIMARS missile arrived.\nAmong the dead were two children,” Saldo added."}, {"id": "8df4987f-7fae-4016-a26d-f674b7b1ffc3", "title": "Danish PM  hit  by man in Copenhagen", "date": "2024-06-08 00:00", "url": "https://www.gjsentinel.com/news/national/danish-pm-hit-by-man-in-copenhagen/article_5a6b3885-2de4-5081-9543-4e8fead8f1dd.html", "message": "Friday NightSome clouds.\nA stray shower or thunderstorm is possible.\nSE winds at 10 to 20 mph, decreasing to 5 to 10 mph."}, {"id": "0123a827-4048-45fb-a1df-77fb5319f556", "title": "Israel - Gaza live updates : Dozens killed in IDF strike on UN school , agency says", "date": "2024-06-08 00:30", "url": "https://www.koka.am/syndicated-article/?id=1568164", "message": "ABC News has not confirmed if the weapons Israel received after Oct. 7 were used in the May 26 Rafah strike.\nEven the Indomie that he was eating was still here,” he said, describing the aftermath of the deadly Rafah strike.\n-ABC News’ Ellie KaufmanMay 27, 7:58 AMDozens killed, hundreds injured in Sunday Rafah strike, Gaza ministry saysForty-five people were killed and 249 were injured in an IDF strike on Rafah on Sunday, the Hamas-run Gaza Health Ministry said Monday.\nIDF officials said the strike had targeted “significant Hamas terrorists” who were operating in a Hamas compound.\n“A short while ago, an IDF aircraft struck a Hamas compound in Rafah in which significant Hamas terrorists were operating."}, {"id": "e2dddb63-ef73-498c-a290-7aa2b1112a31", "title": "Day After UN School Attack , IDF Brags About Striking Another Refugee Camp School", "date": "2024-06-08 00:00", "url": "https://truthout.org/articles/day-after-un-school-attack-idf-brags-about-striking-another-refugee-camp-school/", "message": "Israeli forces carried out the strike on the Al-Shati UN school just after killing at least 40 in an attack on Nuseirat.\nIsrael Defense Forces (IDF) bombed a UN school-turned-evacuation center in Al-Shati refugee camp, near Gaza City, as they carried out an intense series of bombardments on Friday.\nThis is the second time that Israel has struck a UN Relief and Works Agency for Palestine Refugees (UNRWA) school over the course of 48 hours.\nOn Thursday, Israeli forces deployed U.S.-made bombs in an attack that killed at least 40 Palestinians, including 14 children, in Nuseirat refugee camp.\nThe Nuseirat attack sparked widespread outrage, with humanitarian groups quickly denouncing it as a potential war crime."}, {"id": "d15ce8d8-31f3-4da9-b099-7398227d3deb", "title": "Danish PM  hit  by man in Copenhagen", "date": "2024-06-08 07:45", "url": "https://www.bssnews.net/news-flash/193929", "message": "COPENHAGEN, June 8, 2024 (BSS/AFP) - Danish Prime Minister Mette Frederiksen was \"hit\" on Friday by a man in a Copenhagen square, her office said, with EU chiefs quickly condemning the attack.\nThe Danish prime minister's office said in a statement to AFP that Frederiksen was \"shocked by the incident\", but did not provide further details.\n\"Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet in Copenhagen.\nCopenhagen police confirmed that an incident involving the prime minister had occurred but did not provide further details.\nIn 2019, Frederiksen became the country's youngest prime minister, and kept the post after emerging victorious in the 2022 general election."}, {"id": "210bd106-a75d-4efb-a1be-3f4c1e034d9f", "title": "While out on bail in BB gun shooting case , man charged with stabbing sex worker in Oakland over $60 dispute", "date": "2024-06-08 00:30", "url": "https://www.eastbaytimes.com/2024/06/07/while-out-on-bail-in-bb-gun-shooting-case-man-charged-with-stabbing-sex-worker-in-oakland-over-60-dispute/", "message": "OAKLAND — A man has been charged with stabbing a woman after allegedly offering her $60 for sex and trying to take it back, court records show.\nThe woman was stabbed in the abdomen on International Boulevard in Oakland on April 9, and required surgery, police say.\nRoughly two weeks earlier, the man had posted $30,000 bail to secure his release from Santa Rita Jail on charges of assault with a BB gun.\nThe BB gun shooting occurred at Monarch Bay Golf Course in San Leandro, according to court records.\nAs a result, his bail was revoked and a no-bail arrest warrant was issued, records show."}, {"id": "117f731d-92c9-4239-b6bb-a6f31d597d0f", "title": "Slovakia set for EU vote after PM shooting , Meloni Italy next", "date": "2024-06-08 07:45", "url": "https://www.bssnews.net/news/193941", "message": "Far-right Prime Minister Giorgia Meloni is hoping astrong showing from her party will strengthen her hand as a key EUpowerbroker.\nThe party opposes EU arms deliveries to Ukraine, calling itself a \"party ofpeace\" and railing against alleged \"warmongers\" in Brussels.\nPolls suggest Meloni's Fratelli d'Italia party looks set to claim 27 percentof the vote, equalling 22 seats, amid a broader surge of far-right groupsacross the EU.\nThe outsized influence of Meloni's party is all the more striking given thatduring the last EU polls in 2019 it won just 6.4 percent of the vote and sixseats.\nOverall, polls ahead of the vote suggested that far-right parties could claimaround a quarter of the 720 seats in the incoming EU parliament."}, {"id": "52ed12f9-9abf-4d0b-9ce3-a5fb547e7524", "title": "Israel - Hamas War Day 246 : What happening in Gaza , Middle East ? ", "date": "2024-06-08 03:30", "url": "https://www.jpost.com/israel-hamas-war/2024-06-08/live-updates-805413", "message": "(photo credit: FARS MEDIA CORPORATION/CC BY 4.0 (https://creativecommons.org/licenses/by/4.0)/VIA WIKIMEDIA COMMONS)The Islamic Resistance in Iraq claimed responsibility for the drone strikes launched on Saturday morning towards the northern Golan Heights, Israeli media reported Saturday.\n\"We targeted a vital objective within our occupied territories,\" their statement said.\n\"We will continue to destroy the enemy's strongholds in response to the Zionist massacres against defenseless Palestinian civilians.\""}, {"id": "cd3b07fb-2f09-4feb-ae1c-6b678da8646e", "title": "Danish PM  hit  by man in Copenhagen", "date": "2024-06-08 00:45", "url": "https://www.channelnewsasia.com/world/danish-prime-minister-mette-frederiksen-attacked-man-copenhagen-4395761", "message": "They added that while it was a \"strong push\", Frederiksen did not hit the ground.\n\"CONFUSED\"According to the witnesses, the prime minister then sat down at a nearby cafe.\n\"They had pacified him, and as he lay there, he looked confused and a little dazed,\" Jorgensen told the newspaper.\nMetsola urged the Danish head of government to \"keep strong\", while adding in a post on X that \"violence has no place in politics\".\n\"I strongly condemn this cowardly act of aggression,\" the European Council president said in a separate post on X."}, {"id": "e772c57c-33a3-4593-9de6-bdf48ca351fd", "title": "Danish Prime Minister Mette Frederiksen attacked by man in Copenhagen", "date": "2024-06-08 00:45", "url": "https://www.aol.com/danish-prime-minister-mette-frederiksen-203554001.html", "message": "Danish Prime Minister Mette Frederiksen was attacked by a man, who has since been arrested, in the capital city of Copenhagen on Friday, her office said in a statement to CNN.\n“Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet [public square] in Copenhagen.\nIt is unclear if the prime minister was hurt in the assault.\n“Deeply shocked by the outrageous attack on my colleague and friend, Prime Minister of Denmark Mette Frederiksen,” Latvian Prime Minister Evika Siliņa said in a post on X.\nFrederiksen, the leader of Denmark’s center-left Socialist Democratic party, has served as prime minister since 2019."}, {"id": "640277df-a46b-40ff-81f6-9a0c2917fd8f", "title": "Ukraine war briefing : Biden pledges $225m in new military aid while vowing US backs Kyiv  completely  | Ukraine", "date": "2024-06-08 04:15", "url": "https://www.theguardian.com/world/article/2024/jun/08/ukraine-war-briefing-biden-pledges-225m-in-new-military-aid-while-vowing-us-backs-kyiv-completely", "message": "Meeting the Ukrainian president in Paris, Biden told him: “You haven’t bowed down, you haven’t yielded at all, you continue to fight in a way that is … just remarkable.\nA Himars missile struck shortly afterwards as residents from neighbouring houses rushed to help the victims, Saldo told Russian media, putting the overall toll at 22 dead and 15 injured.\nWe are not like this,” the French president told reporters on Friday in Paris alongside Zelensky, in an apparent jab at critics including France’s far-right opposition.\nMacron also said he wanted to “finalise” the creation of a coalition of military instructors for Ukraine in the coming days.\nPutin’s legitimacy is recognised only by comrade Putin,” Zelenskiy said in Paris."}, {"id": "ed75c805-5ed4-4eb9-87f6-41335c3d0e5e", "title": "Danish Prime Minister Mette Frederiksen attacked in Copenhagen", "date": "2024-06-08 00:15", "url": "https://www.sbs.com.au/news/article/man-arrested-after-danish-prime-minister-mette-frederiksen-hit-in-copenhagen/qu5h09a5h", "message": "Danish Prime Minister Mette Frederiksen has walked away following an assault by a man in central Copenhagen.\nThe background: Frederiksen was \"hit\" on Friday evening (local time) at the public square of Kultorvet in Copenhagen, by a man who was subsequently arrested, her office said in a statement.\n\"The prime minister is shocked by the incident.\"\nThe attack on Mette Frederiksen comes two days before Danes head to the polls in the EU election.\nI must say that it shakes all of us who are close to her,\" Danish Environment Minister Magnus Heunicke said on X."}, {"id": "161150db-a880-473b-acd5-bfb61c56517b", "title": "Denmark Prime Minister Frederiksen assaulted in central Copenhagen , man arrested | World News", "date": "2024-06-08 06:30", "url": "https://indianexpress.com/article/world/denmark-prime-minister-frederiksen-assaulted-copenhagen-man-arrested-9379401/", "message": "Denmark's Prime Minister Mette Frederiksen walked away following an assault by a man in central Copenhagen on Friday and had no outward signs of harm, a local resident told Reuters.\n\"Prime Minister Mette Frederiksen was beaten on Friday evening at Kultorvet (square, red.)\nThe Prime Minister is shocked by the incident,\" her office said in a statement without giving further detail.\n\"She seemed a little stressed,\" Soren Kjergaard, who works as a barista on the square, told Reuters after seeing the prime minister being escorted away by security following the assault.\nThree weeks ago, Slovakia's Prime Minister Robert Fico was seriously injured in an assassination attempt."}, {"id": "1370d361-9a6e-4c8a-a661-99f445c04d68", "title": "German Manufacturer to Provide Ukraine with More Helicopter Protection Systems", "date": "2024-06-08 09:15", "url": "https://www.kyivpost.com/post/33950", "message": "The German defense manufacturer Hensoldt issued a press release on Wednesday, June 5 announcing that it had received a new order for its Airborne Missile Protection System (AMPS) to equip Ukraine’s helicopters.\nWhile Hensoldt’s statement did not give details of quantities or the value of the order, the Janes defense publication says it could be worth an eight-figure dollar amount.\nFollow our coverage of the war on the @Kyivpost_official.\nHensoldt previously delivered 16 of the AMPS self-protection kits for Ukrainian Armed Forces (AFU) helicopters for the first time in June 2023, working with the Czech firm Lom Praha as the system integrator.\nAdvertisementIt has not been declared which helicopters were fitted with AMPS in 2023, but Hensoldt told Janes that the new order was aimed at equipping a different platform or platforms than the previous order."}, {"id": "fda74b69-68c2-4019-a08d-38dbfe85c0d3", "title": "Israel says strike on UN Gaza school killed 17 militants", "date": "2024-06-08 07:45", "url": "https://www.bssnews.net/news/193963", "message": "The topic you are looking for was not found.\nWe sincerely apologize for the inconvenience."}, {"id": "122eec2a-e9aa-43de-b3b7-035782e9da50", "title": "Girl school blown up in Kurram , KP", "date": "2024-06-08 08:15", "url": "https://tribune.com.pk/story/2470407/girls-school-blown-up-in-kurram-kp", "message": "Unidentified militants in the Khyber Pakhtunkhwa (KP) province blew up a girls' school on Saturday in the tribal district of Kurram, the express news reported.\nAccording to the local authorities, the militants fled the scene after throwing the grenade at the Aisha Siddiqa Girls' School, located within the jurisdiction of Marian Police Station in Central Kurram District.\nPrior to this attack, two more attacks were launched on girls' schools in North Wazrisitan and South Waziristan districts of KP.\nA senior member of the Wana Welfare Association in Peshawar alleged that the demands were coming from local Taliban, demanding a specific portion of funding from the school.\nDespite prior alerts to law enforcement agencies, no measures were taken to safeguard the school."}, {"id": "5a91ae4d-5b97-401d-a18e-d06833a35bdf", "title": "Danish PM  hit  by man in Copenhagen | The Manila Times", "date": "2024-06-08 04:15", "url": "https://www.manilatimes.net/2024/06/08/world/danish-pm-hit-by-man-in-copenhagen/1950514", "message": "COPENHAGEN, Denmark — Danish Prime Minister Mette Frederiksen was \"hit\" on Friday by a man in a Copenhagen square, her office said, with EU chiefs quickly condemning the attack.\n\"Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet in Copenhagen.\nDenmark's Prime Minister Mette Frederiksen holds a speech during the 175th anniversary of the first Danish Constitution in the Landsting Hall at Christiansborg, Copenhagen, on June 5, 2024.\nAFP PHOTO Denmark's Prime Minister Mette Frederiksen holds a speech during the 175th anniversary of the first Danish Constitution in the Landsting Hall at Christiansborg, Copenhagen, on June 5, 2024.\nCopenhagen police confirmed that an incident involving the prime minister had occurred but did not provide further details."}, {"id": "680325f6-016e-4d5f-a28e-cd9a08fc9a30", "title": "Denmark Prime Minister Frederiksen assaulted in central Copenhagen , man arrested", "date": "2024-06-08 02:45", "url": "https://www.moneycontrol.com/news/world/denmarks-prime-minister-frederiksen-assaulted-in-central-copenhagen-man-arrested-12743794.html", "message": "You are already a Moneycontrol Pro user."}, {"id": "efaf1839-0a0f-48a8-8413-804ea706fb5a", "title": "Slovaks and others go to the polls in EU elections under the shadow of an assassination attempt", "date": "2024-06-08 07:15", "url": "https://lasvegassun.com/news/2024/jun/07/slovaks-and-others-go-to-the-polls-in-eu-elections/", "message": "Slovaks and others go to the polls in EU elections under the shadow of an assassination attemptGeert Vanden Wijngaert / AP, filePRAGUE — Voters in Slovakia, Italy and other European Union nations are casting their ballots Saturday on the third day of elections for the European Parliament, with populist and far-right parties looking to make gains across the 27-member bloc.\nAlthough Fico didn’t talk directly about the vote, he attacked the European Union, suggesting he was a victim because of his views that differ sharply from the European mainstream.\nIn Italy, citizens aged 18 and above are casting ballots over two days to fill 76 European parliamentary seats, starting Saturday.\nVoters in Latvia, Malta, and the Czech Republic were also casting ballots Saturday.\nIn Slovakia, Fico’s Smer party is in a close race against the main opposition Progressive Slovakia, a pro-Western liberal party."}, {"id": "cd04c341-675e-4047-b41d-18cb94f1ba2d", "title": "Danish Prime Minister Mette Frederiksen attacked in Copenhagen", "date": "2024-06-08 09:30", "url": "https://timesofoman.com/article/146425-danish-prime-minister-mette-frederiksen-attacked-in-copenhagen", "message": "Copenhagen: Danish Prime Minister Mette Frederiksen was assaulted by a man in Copenhagen, according to a statement from her office to CNN.\n\"Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet [public square] in Copenhagen.\n\"Deeply shocked by the outrageous attack on my colleague and friend, Prime Minister of Denmark Mette Frederiksen,\" Latvian Prime Minister Evika Silina said in a post on X.\nShe went on to wish the prime minister strength and courage, saying she has plenty of both, CNN reported.\nThe attack on Frederiksen comes amidst heightened concerns surrounding political violence, notably underscored by the recent assassination attempt on Slovakian Prime Minister Robert Fico."}, {"id": "77cf88a9-9bf4-477c-b0a0-f2560fb02bd5", "title": "Denmark PM Mette Frederiksen assaulted in central Copenhagen , man arrested", "date": "2024-06-08 02:15", "url": "https://www.asiaone.com/world/denmark-pm-mette-frederiksen-assaulted-central-copenhagen-man-arrested", "message": "COPENHAGEN - Denmark's Prime Minister Mette Frederiksen walked away following an assault by a man in central Copenhagen on June 7 and had no outward signs of harm, a local resident told Reuters.\n\"Prime Minister Mette Frederiksen was beaten on Friday evening at Kultorvet (Red Square) in Copenhagen by a man who was subsequently arrested.\nThe Prime Minister is shocked by the incident,\" her office said, in a statement without giving further detail.\n[[nid:650708]]Three weeks ago, Slovakia's Prime Minister Robert Fico was seriously injured in an assassination attempt.\nDanish Minister of Environment Magnus Heunicke said on X: \"Mette is naturally shocked by the attack."}, {"id": "fa0f2d65-bb17-4856-9ac6-675ac0ad3a7f", "title": "Israel bombs another UN - run school in Gaza , a day after strike on school killed 33 - The Muslim News", "date": "2024-06-08 04:00", "url": "https://muslimnews.co.uk/news/palestine/israel-bombs-another-un-run-school-in-gaza-a-day-after-strike-on-school-killed-33/", "message": "In both airstrikes, the Israeli army said Hamas militants were operating from within the schools.\nIsrael on Friday released the names of 17 militants it said were killed in Thursday’s strike.\nIsrael launched the war after Hamas’ Oct. 7 attack, in which militants stormed into southern Israel, killed some 1,200 people — mostly civilians — and abducted about 250.\nOne of the names Israel listed as a militant was an 8-year-old boy, Shaheen Mahmoud Ibrahim Abu Sharif, according to the hospital records.\ncnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd cnd"}, {"id": "a118ddab-ee2e-4779-bd40-d186b00b75fc", "title": "Danish Prime Minister attacked in street", "date": "2024-06-08 04:45", "url": "https://www.odt.co.nz/news/world/danish-prime-minister-attacked-street", "message": "Danish Prime Minister Mette Frederiksen.\n\"Prime Minister Mette Frederiksen was beaten on Friday evening at Kultorvet (square, red.)\nThe Prime Minister is shocked by the incident,\" her office said in a statement without giving further detail.\nThree weeks ago, Slovakia's Prime Minister Robert Fico was seriously injured in an assassination attempt.\nDanish Minister of Environment Magnus Heunicke said on X: \"Mette is naturally shocked by the attack."}, {"id": "8ed38cad-9e90-4fb8-813d-9f51ce774130", "title": "Former San Marino estate of CIA chief John McCone sets sales record at $30M", "date": "2024-06-08 03:30", "url": "https://www.ocregister.com/2024/06/07/former-san-marino-estate-of-cia-chief-john-mccone-sets-sales-record-at-30m/", "message": "What homebuyers are asking in today’s high-price market"}, {"id": "80d9235a-c8b3-481b-a5da-65b44eb4cae7", "title": "Ukraine - Russia war live : Putin  invokes Cuban Missile Crisi as he moves  nuclear - capable  ships to Havana", "date": "2024-06-08 08:15", "url": "https://www.independent.co.uk/news/world/europe/russia-ukraine-war-live-putin-nuclear-threat-b2559075.html", "message": "Read our privacy policy Thanks for signing up to theBreaking News email {{ #verifyErrors }} {{ message }} {{ /verifyErrors }} {{ ^verifyErrors }} Something went wrong.\nPlease try again later {{ /verifyErrors }}Vladimir Putin is invoking the memory of the Cuban Missile Crisis by moving “nuclear-capable” warships to Cuba in a move intended to provoke the United States, a think tank warned.\nThe Admiral Gorshkov frigate, the Kazan nuclear-powered cruise missile submarine, the Academic Pashin replenishment oiler, and the Nikolai Chiker rescue tug will all be part of the visit, the US-based think tank Institute for the Study of War.\nIn 1962, former Russian premier Nikita Khrushchev moved nuclear missiles to Havana which led to an intense stand off between Moscow and Washington.\nMeanwhile, Putin has threatened to retaliate against Western countries that are allowing Ukraine to hit Russia with their long-range missiles."}, {"id": "42a0fa30-0a55-4bcc-b313-380d954f7f15", "title": "Danish PM Mette Frederiksen attacked in Copenhagen ; man arrested", "date": "2024-06-08 04:45", "url": "https://www.firstpost.com/world/danish-prime-minister-mette-frederiksen-attacked-denmark-13780082.html", "message": "Two witnesses present at Copenhagen Square told local newspaper BT that they had seen Frederiksen arrive at the square while they were sitting by a nearby fountain read moreA man allegedly hit Danish Prime Minister Mette Frederiksen at Denmark’s Copenhagen Square, leaving her “shocked by the incident”, her office said in a statement on Friday.\n“Prime Minister Mette Frederiksen was hit by a man Friday evening on Kultorvet in Copenhagen.\nThe man was subsequently arrested,” the statement to AFP said.\nAdvertisementTwo witnesses present at Copenhagen Square told local newspaper BT that they had seen Frederiksen arrive at the square while they were sitting by a nearby fountain.\n“They had pacified him, and as he lay there, he looked confused and a little dazed,” Jorgensen told the newspaper."}, {"id": "e16fca92-27d4-4855-8ea9-4cf37d87db3f", "title": "Woman arrested in Ohio in connection with deadly Lexington shooting", "date": "2024-06-08 00:15", "url": "https://www.wkyt.com/2024/06/07/woman-arrested-ohio-connection-with-deadly-lexington-shooting/", "message": "LEXINGTON, Ky. (WKYT) - One person has been arrested in connection with a deadly shooting near Bluegrass Community and Technical College.\nOn Tuesday, 48-year-old Antiono Taylor was shot multiple times on the 500 block of Newtown Pike.\nDetectives used the Real-Time Intelligence Center and Flock license plate readers to identify the suspect as 48-year-old Shawnika Gill.\nGill was arrested on June 7, 2024, in Hamilton County, Ohio, by the US Marshals Service Central KY Fugitive Task Force, the Southern Ohio Fugitive Apprehension Strike Team and the Hamilton County Sheriff’s Office.\nShe is currently being held at the Hamilton County Justice Center, awaiting extradition to Fayette County."}, {"id": "1ece5042-0192-4089-8987-8a9814acec2c", "title": "Victims of fatal Akihabara rampage remembered 16 years on", "date": "2024-06-08 09:30", "url": "https://www.japantimes.co.jp/news/2024/06/08/japan/crime-legal/akihabara-fatal-rampage-16-years/", "message": "Victims of a fatal rampage in Tokyo's busy Akihabara district in 2008 were remembered Saturday, the 16th anniversary of the indiscriminate attack, which left seven people dead and 10 others injured.\n\"There was a tense atmosphere,\" a 54-year-old from Yokohama said of the scene he saw soon after the incident.\n\"Although the death penalty was carried out (on the attacker), it didn't make any difference.\"\nIn the incident on June 8, 2008, the attacker, Tomohiro Kato, rammed a truck into the pedestrian zone near Akihabara Station, hitting passersby.\nHis death penalty became final at the Supreme Court in February 2015."}, {"id": "c44750a9-de1c-4c3f-a93e-3443bad06e39", "title": "Brandon Smith : False Flag On The Horizon ? The Strange Case Of The Destroyed Russian Nuclear Radar – Infinite Unknown", "date": "2024-06-08 03:30", "url": "https://infiniteunknown.net/2024/06/07/brandon-smith-false-flag-on-the-horizon-the-strange-case-of-the-destroyed-russian-nuclear-radar/", "message": "NATO has (until the past couple of days) enforced tight restrictions on how their weapons can be used by Ukraine.\nThat said, it’s not so much the weapons used that concerns me, it’s the specific targets that Ukraine supposedly chose.\nLet’s consider the ugly realities…First, the targeting of Russian nuclear defenses might make the Kremlin believe they are being prepped for a nuclear strike.\nNATO countries are now say they support Ukraine’s use of long range weapons inside Russia.\nI have no doubt that WWIII is the intended outcome of the confrontation between NATO and Russia in Ukraine."}, {"id": "0143a598-29a2-4b7b-a5a3-7050146aa8e4", "title": "How one party is winning perception warfare", "date": "2024-06-08 01:45", "url": "https://www.thenews.com.pk/print/1198161-how-one-party-is-winning-perception-warfare", "message": "Alas, perception warfare, aimed at influencing how people view an issue or event, is not what it used to be.\nNew school perception warfare tools: YouTube, launched in 2005, has 72 million users in Pakistan.\nTikTok, launched in 2016, has 18 million users, while Instagram, launched in 2010, has 16 million users.\nThere is only one political party in Pakistan that has successfully weaponized social media to spread manipulated information and narratives as part of its perception warfare strategy.\nThere is only one political party whose disinformation campaigns are successfully exploiting people’s emotions, such as fear, anger, or outrage."}, {"id": "ed210b11-d4c3-4f30-8fb6-7066776ac39a", "title": "  We need both communities , and we need them now more than ever . ", "date": "2024-06-08 03:30", "url": "https://www.jpost.com/diaspora/antisemitism/article-805237", "message": "We need both communities, and we need them now more than ever.”Elbaum detailed the rise in aliyah, noting that 85,000 Jews from Russia and Ukraine made aliyah to Israel through The Jewish Agency since the start of the Russia-Ukraine war.\nBrummer described the numerous ways in which the Ministry of Diaspora Affairs assists the Jewish community outside Israel.\nHe noted that the fight against antisemitism is about the resilience and strength of Jewish communities and education, and mentioned the importance of the online struggle against antisemitism.\nIn order to win, we need much more coordination and cooperation between all entities and organizations that deal with this sacred mission of combating antisemitism.\nHe praised the work of the Agency’s shlichim – young Israeli emissaries spending time educating and teaching young Jews in the Diaspora."}, {"id": "98a2108d-dccf-43c4-8919-2da5f67efdc3", "title": "Be Prepared To Meet Challenges Of Modern Warfare : Lt Gen Kumar Asks IMA Cadets", "date": "2024-06-08 07:30", "url": "https://www.dailyexcelsior.com/be-prepared-to-meet-challenges-of-modern-warfare-lt-gen-kumar-asks-ima-cadets/", "message": "Addressing the Passing out Parade of the IMA at the historic drill square as the reviewing officer, Lt Gen Kumar said technological advancement is constantly impacting the character of modern wars.\nLt Gen Kumar said the use of space, cyber and cognitive domains in warfare are contemporary realities.\nLt Gen Kumar exhorted all cadets to dedicate themselves to the service of the nation.\nAfter reviewing the Parade, Lt Gen Kumar laid wreaths and offered floral tributes to pay homage to the brave alumni of the IMA at the War Memorial.\nThe ‘Pipping Ceremony’, where the Officer Cadets don the ranks of Commissioned Officer, was carried out by their parents and loved ones."}, {"id": "3cf16cf7-1641-405e-8739-b146fcee3706", "title": "Air Weapons : Game of Drones", "date": "2024-06-08 07:30", "url": "http://www.strategypage.com/%5Chtmw%5Chtairw%5Carticles%5C202406070253.aspx", "message": "Female soldiers can excel as UAV operators while mostly avoiding the battlefield risk of death or injury.\nUnlike pilots of combat aircraft, UAV operators are much less likely to be put out of action by death, injury, or capture.\nUAV operators are relatively close to the front lines and exposed to some risk, but not nearly as much as pilots.\nUkrainian USV operations in the Black Sea forced the Russian Black Sea Fleet to withdraw to the eastern shore of the Black Sea.\nBecause of the USVs, Ukraine, which does not have a conventional navy, now controls most of the Black Sea."}, {"id": "8f1b51b0-56ff-455b-8611-4321f4fae46e", "title": "Tejas Mk1 / A : A Capable Contender in the Subcontinent Skies – Indian Defence Research Wing", "date": "2024-06-08 03:45", "url": "https://idrw.org/tejas-mk1-a-a-capable-contender-in-the-subcontinents-skies/", "message": "This article aims to shed light on the Tejas’ capabilities and their role in the Indian Air Force (IAF).\nThe narrative that the Tejas isn’t designed for specific opponents undermines its potential.\nThe Tejas Mk1/A, armed with advanced avionics, the Astra Mk1 missile, and a capable radar present a formidable challenge.\nWhile details remain undisclosed, it’s likely a combination of aircraft, including Mirage-2000s, and supporting assets like AWACS/AEW&C played a crucial role.\nThe Tejas Mk1/A is a capable platform that continues to evolve."}, {"id": "217207d6-1911-49ac-a6db-628214694d31", "title": "Five settings we would love to see Total War explore", "date": "2024-06-08 09:15", "url": "https://www.gamewatcher.com/news/five-settings-we-would-love-to-see-total-war-explore", "message": "About Fran J. RuizFran J. Ruiz is an English Studies survivor and a freelance writer for The Loadout, VG247, Space, The Escapist, and more.\nSpyro and Warcraft 3 are his all-timers.\nHe plays a bit of everything, from little-known indies to the biggest AAA releases, resulting in a backlog that never goes down."}, {"id": "3a128916-9e36-41e2-899c-c0bb8e3efb1e", "title": "Russo - Ukraine War - 07 June 2024", "date": "2024-06-08 00:30", "url": "https://www.globalsecurity.org/military/world/war/russo-ukraine-2024-06-07.htm", "message": "On 24 February 2022, Ukraine was suddenly and deliberately attacked by land, naval and air forces of Russia, igniting the largest European war since the Great Patriotic War.\nThroughout the day in the Sivers віkomu direction, Russian forces carried out two unsuccessful assault actions in the area of Bílogorivka.\nRussia does not give up trying to find the weak points in Ukrainian defense, with continuous assault attempts to infiltrate Ukrainian troops' combat.\nThe Defense Forces are taking measures to stabilize the situation and prevent Russian forces from advancing.\nIn the Vremívs завkomu direction, Russian forces tried to tie battles near Urožaynogo and Staromayors міkogo."}, {"id": "d0c57fb8-2b88-48e2-bc5c-20904b50497b", "title": "Metaphor : ReFantazio has over 40 persona - like archetypes to evolve and combine , still looks a lot like Persona ( complimentary ) ", "date": "2024-06-08 00:15", "url": "https://www.rockpapershotgun.com/metaphor-refantazio-has-over-40-persona-like-archetypes-to-evolve-and-combine-still-looks-a-lot-like-persona-complimentary", "message": "It’s easy to draw comparisons between Metaphor: ReFantazio and Persona, given that the upcoming RPG is in the works over at Persona makers Atlus and is built around a similar ‘transform into an awesome-looking robot/creature and do battle’ concept, but so far all those comparisons only serve to highlight just how damn good Metaphor: ReFantazio looks.\nThe RPG’s latest trailer out of tonight’s Summer Game Fest stream adds to that feeling, focusing on the archetypes used by party members in battle.\nThere’ll be over 40 archetypes in total to bring along in your party, the game’s devs confirmed, with different archetypes able to earn experience and possible evolve into stronger forms.\nI’ll be happy to oblige when Metaphor: ReFantazio arrives on Steam on October 11th.\nHit up our Summer Game Fest 2024 hub and our Day Of The Devs roundup for all the news worth caring about from the shows so far."}, {"id": "ee4befce-f023-46ed-b88d-e1e4dcc2c3c2", "title": "Ukraine Situation Report : Claims Fly Over Deadly ATACMS Missile Strike In Luhansk", "date": "2024-06-08 01:45", "url": "https://www.yahoo.com/news/ukraine-situation-report-claims-fly-003714888.html", "message": "Russia’s Defense Ministry on Friday accused Ukraine of using five ATACMS on residential buildings and other civilian structures in Luhansk, Reuters reported .\nVideo emerged on social media of what appears to be a First Person-View (FPV) drone attack on an electric substation in Russia's Kursk region.\nOf note is that in addition to the strike drone, another drone was hovering over the substation to capture the impact.\nThe German Donaustahl company introduced its Maus FPV drone earlier this week at the ILA 2024 Air Show in Berlin.\nUkraine's 46th Airmobile Brigade posted a compilation of FPV drone hits on Russian armor, including the so-called Turtle Tanks ."}, {"id": "9a128f29-37a8-4f60-ad2e-8b84c9d6ceaa", "title": "Prince William wife Princess Catherine is  better  and  would have loved  to have joined him at this year D - Day commemorations - 08 - Jun - 2024", "date": "2024-06-08 07:00", "url": "https://home.nzcity.co.nz/news/article.aspx?id=399858&fm=psp,tst", "message": "When one war survivor asked after William's wife amid her health fight, footage posted on X showed him replying: \"She is better, thanks.\nHe also told one woman at the event: \"My wife's grandmother did the same sort of thing as you.\nSpeaking to other veterans, William said: \"I found it very moving, all the stories and letters, even now 80 years later.\"\nWhen one veteran told William \"thank you\", the prince replied: \"No, we are here to thank you.\nBritish Prime Minister Rishi Sunak took to the stage and read veterans' letters at the event, which was also attended by Labour leader Sir Keir Starmer and UK Foreign Secretary Lord David Cameron."}, {"id": "e9c865b1-eb8d-4296-ac79-6c2283477d80", "title": "Amazing Seasun Games Reveals New Trailer for Mecha Break Game", "date": "2024-06-08 02:15", "url": "https://www.animenewsnetwork.com/news/2024-06-07/amazing-seasun-games-reveals-new-trailer-for-mecha-break-game/.211675", "message": "Amazing Seasun Games revealed a new trailer at Summer Games Fest for its Mecha Break game.\nFrom sketches on paper to colossal war machines in game — take a behind the scenes peek at some of the Strikers you can pilot in Mecha BREAK!\nAmazing Seasun Games describes the game:Mecha BREAK is a multiplayer mech game that allows players to choose from diverse mechs, customize appearances, and battle colossal war machines on treacherous terrain.\nThe game will launch for PlayStation 5, Xbox Series X|S, and PC via Steam .\nSource: Summer Games Fest livestream"}, {"id": "a1e4dae3-7708-472a-9236-9fb997ad61ba", "title": "Battle Vision Network is Capy spiritual successor to Might & Magic : Clash of Heroes", "date": "2024-06-08 00:00", "url": "https://www.engadget.com/battle-vision-network-is-capys-spiritual-successor-to-might--magic-clash-of-heroes-230547594.html", "message": "It’s called Battle Vision Network, and it’s heading to PC and mobile devices in 2025.\nBattle Vision Network feels like an encapsulation of Capy’s sensibilities over 20 years as an independent game studio.\nAnd finally, it’s a one-on-one puzzle fight, similar to Might & Magic: Clash of Heroes.\nIn the announcement video for BVN, director Dan Vader described the new game as a spiritual successor to Clash of Heroes with an emphasis on multiplayer combat.\nNetflix will distribute the iOS and Android versions of the game, meaning it should be available to all Netflix subscribers at no extra charge."}, {"id": "8edc3b7f-3351-4698-b1c7-963602c2c63f", "title": "Metaphor : ReFantazio Synthesis Allows for Combining Archetypes in Battle", "date": "2024-06-08 03:30", "url": "https://gamingbolt.com/metaphor-refantazios-synthesis-feature-allows-for-combining-archetypes-in-battle", "message": "Metaphor: ReFantazio, the next big RPG from Persona 5 director Katsura Hashino, is already a massive experience.\nHowever, its battle system has its intricacies, especially when factoring in the Archetypes.\nHowever, the highlight is perhaps Synthesis, which allows for combining two party members’ Archetypes.\nOf course, there’s Special Synthesis, where three characters can team up for massive damage, though the condition for activation changes based on the party composition.\nLaunching on October 11th, Metaphor: ReFantazio will be available for Xbox Series X/S, PS5, PS4 and PC."}, {"id": "1f1d09e0-eaeb-4287-814f-9d9e9f08da68", "title": "Discover Imber : The eerie  ghost village  near London abandoned in WWII , open just 20 days a year | Birmingham Live", "date": "2024-06-08 06:00", "url": "https://www.birminghammail.co.uk/travel/dangerous-ghost-village-abandoned-overnight-29282942", "message": "A tiny village just two hours away from Birmingham was once a bustling community of several hundred villagers.\nBut those living in Imber abandoned their homes after orders from the Ministry of Defence.\nOnly a small church, a handful of cottages, and a vicarage remain at the Wiltshire-based village, often dubbed 'the lost village'.\nA significant portion of the village and surrounding farmland had been strategically acquired by the Ministry of Defence before the war.\nToday, while the charm and mystery of its history are preserved in the church, the rest of the area is now dominated by rather 'unattractive' MOD training buildings."}, {"id": "928fd20c-09fa-48ac-8ddc-853218ed8466", "title": "Beyond blockbusters : Break from the mainstream with these indie games", "date": "2024-06-08 02:15", "url": "https://www.thestar.com.my/tech/tech-news/2024/06/08/beyond-blockbusters-break-from-the-mainstream-with-these-indie-games", "message": "In the game, players are in the shoes (or shell) of Kril, the hermit crab, as they battle through enemies and explore the briny depths while collecting ocean-borne microplastics as the primary in-universe currency.\nThis could be a broken glass bottle, a plastic cup, or an empty can, with 69 to discover.\n— Out of The Blue GamesAmerican ArcadiaPlatform: SteamPuzzle game fans can check out American Arcadia, a game set in a world stuck perpetually in 1970s Americana with a strong resemblance to The Truman Show.\nRather than rehashing the classic hospital management formula, Galacticraft developer Brightrock Games opted to spice things up by having players operate a hospital in space.\nRather than rehashing the classic hospital management formula, developer Brightrock Games opted to spice things up by having players operate a hospital in space."}, {"id": "c34e0854-90cd-41d8-b819-d4fe6f81f999", "title": "India MiG - 25 to MiG - 31 Upgrade : A Missed Opportunity or Wise Choice ? – Indian Defence Research Wing", "date": "2024-06-08 03:45", "url": "https://idrw.org/indias-mig-25-to-mig-31-upgrade-a-missed-opportunity-or-wise-choice/", "message": "India’s MiG-25 to MiG-31 Upgrade: A Missed Opportunity or Wise Choice?\nHowever, this prompts an interesting comparison with the Indian Air Force’s historical use of the MiG-25 and its subsequent decision regarding the MiG-31.\nThe MiG-25, known for its exceptional speed and high-altitude capabilities, was unrivaled in South Asia.\nHowever, with advancements in remote sensing satellites and synthetic aperture radar technology, the need for manned high-altitude reconnaissance decreased.\nIndia’s decision to prioritize the Su-30MKI over the MiG-31 reflects a strategic assessment of current and future operational requirements."}, {"id": "1c120b8b-7ef3-4ea8-b2f0-a3663220e3c0", "title": "Biden Publicly Apologises To Zelenskyy For Monthslong Congressional Holdup To Weapons That Let Russia Advance", "date": "2024-06-08 06:00", "url": "https://www.news18.com/world/biden-publicly-apologises-to-zelenskyy-for-monthslong-congressional-holdup-to-weapons-that-let-russia-advance-8925338.html", "message": "President Joe Biden on Friday for the first time publicly apologised to Ukraine for a monthslong congressional holdup in American military assistance that let Russia make gains on the battlefield.\n“It’s very important that in this unity, United States of America, all American people stay with Ukraine like it was during World War II,” Zelenskyy said.\nThe slow pace of delivery of pledged Western weaponry has long frustrated Zelenskyy, as has Biden’s hesitation over supplying more hardware for fear of provoking Russian President Vladimir Putin.\nThe U.S. will send about $225 million in military aid to Ukraine, Biden announced Friday.\nBiden and Zelenskyy attended the anniversary events of D-Day in Normandy, northern France, on Thursday, along with European leaders who have supported Kyiv’s efforts in the war."}, {"id": "9320e5d3-89a6-43a2-907b-5d72eb2f7f42", "title": "Everything We Saw At Summer Game Fest 2024", "date": "2024-06-08 03:00", "url": "https://kotaku.com/everything-we-saw-at-summer-game-fest-2024-1851527046", "message": "AdvertisementCuffbustCuffbust World Premiere Trailer | Summer Game Fest 2024If you’re looking for some cooperative prison break action as, um, koalas?\nAdvertisementBatman: Arkham ShadowBatman: Arkham Shadow World Premiere Trailer | Summer Game Fest 2024Batman arrives in the world of VR with Arkham Shadow.\nAdvertisementBlumhouse Games ShowcaseBlumhouse Games Interview and Trailer with Jason Blum and Louise Blain | Summer Game Fest 2024Blumhouse Games offered up a sizzle reel at Summer Game Fest showcasing a variety of different spooky titles, each with delightfully hellacious horror themes and set in different genres.\nAdvertisementPhantom Blade 0Phantom Blade Zero World Premiere Trailer | Summer Game Fest 2024Phantom Blade 0 got a new trailer as the last game on stage at this year’s Summer Game Fest.\nAdvertisementAnd that wraps everything we saw at Summer Game Fest 2024."}, {"id": "9d85f36e-22ba-4ee7-b556-9349e7588555", "title": "Biden apologizes to Zelenskyy for holdup on providing weapons", "date": "2024-06-08 00:00", "url": "https://www.theday.com/nation/20240607/biden-apologizes-to-zelenskyy-for-holdup-on-providing-weapons/", "message": "U.S. President Joe Biden shakes hands with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024.\n(AP Photo/Evan Vucci)U.S. President Joe Biden meets with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024.\n(AP Photo/Evan Vucci)U.S. President Joe Biden meets with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024.\n(AP Photo/Evan Vucci)U.S. President Joe Biden meets with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024.\n(AP Photo/Evan Vucci)U.S. President Joe Biden shakes hands with Ukrainian President Volodymyr Zelenskyy in Paris, Friday, June 7, 2024."}, {"id": "95a11b85-70bc-447f-b7a5-9eb5aa7a93b0", "title": "Biden Push To End The Gaza", "date": "2024-06-08 09:30", "url": "https://www.outlookindia.com/international/bidens-push-to-end-the-gaza-war", "message": "Palestinian civilians would return to their home in all areas of Gaza.\nHumanitarian assistance would be up to 600 trucks carrying aid to Gaza every day.\nThe second phase was for Israel and Hamas would negotiate the necessary arrangements to get to a permanent end to hostilities.\n\"There are a number of details to negotiate to move from phase one to phase two.\nThe last phase of this ambitious plan was reconstruction of Gaza."}, {"id": "60947cf2-e47c-43b0-94fd-6ae7c9e9b8f0", "title": "It Finally Here ! news - Empires of the Undergrowth", "date": "2024-06-08 00:00", "url": "https://www.indiedb.com/games/empires-of-the-undergrowth/news/its-finally-here6", "message": "Empires of the Undergrowth’s version 1.0 is now released, featuring the Matabele ants as the final focal species of the game, as well as the termites in a co-starring role.\nThe whole campaign is now playable start to finish, along with all of its challenge modes and a greatly expanded custom game offering.\nAfter the changes, read on to see our updated roadmap, showing where we intend to take the game now it has reached version 1.0.\nTake your enhanced colony into custom games, or repeat your colony’s journey with tougher challenges in New Game Plus - but this time you can take your formicarium upgrades into the mission with you!\nAnd if this is your first time playing Empires of the Undergrowth, welcome."}, {"id": "9cbff6f0-0b6e-434f-8c1e-e5414b5ef6b7", "title": "Congressman Jason Crow reenacts World War II parachute jump on D - Day", "date": "2024-06-08 04:15", "url": "https://www.cbsnews.com/colorado/news/congressman-jason-crow-reenacts-world-war-ii-parachute-jump-d-day/", "message": "Colorado Congressman Jason Crow leads jump over Normandy from C-47 that led invasion fleet on D-DayColorado Congressman Jason Crow leads jump over Normandy from C-47 that led invasion fleet on D-DayColorado Congressman Jason Crow leads jump over Normandy from C-47 that led invasion fleet on D-DayAs Americans continue to recognize the fallen members of D-Day from World War II, Congressman Jason Crow, an Army combat veteran who served in the 82nd Airborne Division and 75th Ranger Regiment, reenacted the parachute jump of D-Day in Normandy, France 80 years later.\nCBSCrow is currently in Normandy and was alongside 41 WWII veterans, honoring the sacrifice of the service members on D-Day.\nOn Friday with a bipartisan delegation of Congressional veterans, Crow jumped out of a WWII-era plane to honor those who made that same jump behind enemy lines 80 years ago.\nCrow issued a statement on the reenacted jump saying:\"Today, we remember thousands of America's best who were willing to give everything to defend freedom and democracy at home and abroad.\nNow, it's on us to honor their service and recommit to the values they fought to defend — freedom, equality, and democracy.\""}, {"id": "f5a86d48-1b7a-4884-8156-4cf35403149a", "title": "Delta Force : Hawk Ops hands - on preview – the original military shooter", "date": "2024-06-08 02:45", "url": "https://metro.co.uk/2024/06/07/delta-force-hawk-ops-hands-on-preview-original-military-shooter-20992107/", "message": "Delta Force: Hawk Ops – a blast from the past (Tencent)A modern multiplayer shooter with a late 90s heritage, the new Delta Force aims to make Chinese publisher Tencent a major force in the West.\nDelta Force: Hawk Ops is an attempt to recreate the vibe of NovaLogic’s games using modern technology.\nHawk Ops is Tencent’s first weapon in a (some would say overdue) bid to launch itself into the consciousness of gamers beyond China.\n‘But in the triple-A PC and console titles, we hope that Delta Force: Hawk Ops will be the first big success for us.\nMORE : Best new mobile games on iOS and Android – May 2024 round-upMORE : Best new mobile games on iOS and Android – April 2024 round-upMORE : Best new mobile games on iOS and Android – March 2024 round-up"}, {"id": "10858c32-4b56-4669-a236-1e0cb88fa210", "title": "Flags of our fathers resonate today", "date": "2024-06-08 04:00", "url": "https://www.unionleader.com/news/social_issues/flags-of-our-fathers-resonate-today/article_1ba462be-2414-11ef-9216-0b726ef1ec82.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "12fb171c-7c41-45dc-a582-f325f62c6aa2", "title": "Israeli forces batter central and south Gaza as tanks advance in Rafah", "date": "2024-06-08 03:30", "url": "https://www.japantimes.co.jp/news/2024/06/08/world/politics/israeli-forces-batter-gaza/", "message": "With a renewed cease-fire push in the eight-month-old Gaza war stalled, Israel bombarded central and southern areas again on Friday, killing at least 28 Palestinians, and tank forces advanced to the western edges of Rafah.\nU.S.-backed Qatari and Egyptian mediators have tried again this week to reconcile clashing demands preventing a halt to the hostilities, a release of Israeli hostages and Palestinians jailed in Israel, and an unrestricted flow of aid into Gaza to alleviate a humanitarian disaster.\nBut sources close to the talks said there were still no signs of a breakthrough.\nA month after rumbling into Rafah in what Israel said was an assault to wipe out Hamas' last intact combat units, tank-led forces have advanced to the southwest fringes of the city that skirts the Gaza Strip's border with Egypt, residents said."}, {"id": "cfb2596e-4e7b-4f19-b8da-02ead378a93e", "title": "Kingdom Come : Deliverance II Gets Saints and Sinners Trailer", "date": "2024-06-08 01:45", "url": "https://www.vgchartz.com/article/461336/kingdom-come-deliverance-ii-gets-saints-and-sinners-trailer/", "message": "Kingdom Come: Deliverance II Gets Saints and Sinners Trailer - News/ 286 Viewsby, posted 11 hours agoPublisher Deep Silver and developer Warhorse Studios have released a new trailer for the action RPG, Kingdom Come: Deliverance II, called Saints and Sinners.\nView the trailer below:Read details on the game below:Kingdom Come: Deliverance II is a thrilling action RPG, set amid the chaos of a civil war in 15th Century Bohemia.\nFrom bustling city streets to lush forests, discover this open-world Medieval Europe through an unforgettable adventure filled with action, thrill and wonder.\nA True RPG ExperienceYour actions shape Henry’s destiny and how the world will react to him.\nOn foot, horse or by stealth, you can specialize in elegant sword mastery, brutal blunt weapons or deadly ranged attacks."}, {"id": "efe1e663-9955-4676-83a2-679d4cef1556", "title": "Web of control", "date": "2024-06-08 03:30", "url": "https://www.thenews.com.pk/print/1197975-web-of-control", "message": "Icons of the popular social media platforms seen in this undated photo.\nPrevious actions – blocking of specific websites and social media platforms as well as restrictive and regressive legislation – had already raised alarms about government overreach.\nAnd instead of physical and tangible operations we now have info-warfare – all on social media.\nIn fact, starting with PECA, it has been one bad legislation after another when it comes to social media or anything linked to social media.\nWhether the PML-N or the PTI, both governments have been enthusiastic about curbing social media influence."}, {"id": "6f17aeaa-04cf-4dba-8da8-0f8f94cb3341", "title": "Navigating the Tensions : US Policy on Ukraine - Russia Conflict Amidst Escalation Fears", "date": "2024-06-08 06:30", "url": "https://trendydigests.com/2024/06/08/navigating-the-tensions-us-policy-on-ukraine-russia-conflict-amidst-escalation-fears/", "message": "However, amidst Ukraine’s pressing needs and the backdrop of Russian President Vladimir Putin’s veiled nuclear threats, the Biden administration’s policy has been subject to intense scrutiny and gradual shifts.\nThe recent decision by the US administration to allow Ukraine to use American-supplied weapons to strike targets within Russia marks a significant, albeit careful, policy escalation.\nDespite the risks, Ukraine’s attacks on Russian territory have raised concerns over the potential of nuclear escalation.\nThis nuanced approach underscores the administration’s attempt to balance between aiding Ukraine and restraining the conflict from spiraling into a broader war.\nAs the war progresses and Ukraine’s needs evolve, the policy has adapted, often incrementally, to the demands of the battlefield."}, {"id": "f135b0ca-609f-4d55-a7da-e7a4fe66796f", "title": "Black D - Day combat medic long - denied medal tenderly laid on Omaha Beach where he bled , saved lives", "date": "2024-06-08 04:00", "url": "https://isp.netscape.com/news/story/0001/20240608/10644ab8a4790794e810ace300cef418", "message": "Black D-Day combat medic's long-denied medal tenderly laid on Omaha Beach where he bled, saved livesOMAHA BEACH, France (AP) — A medal richly deserved but long denied to an African American combat medic wounded on Omaha Beach in the D-Day landings was tenderly laid Friday on the hallowed sands where he saved lives and shed blood.\nThe medal was awarded posthumously to Woodson this month — just ahead of the 80th anniversary of D-Day — following years of lobbying for more recognition of his achievement on that fateful day.\nKevin Braafladt explained to the soldiers that the next step would be the medal’s presentation to Woodson’s widow, 95-year-old Joann.\n“We want to be able to say that this medal came from Omaha Beach and was at the site of Woodson’s actions,” Braafladt said.\nUltimately, seven Black World War II troops were awarded the Medal of Honor in 1997."}, {"id": "9a83905b-d530-4744-a826-b0902896b61d", "title": "Will North Korea fly trash balloons into South Korea again ? A look at rising tensions between them | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-06-08 01:45", "url": "https://www.asahi.com/ajw/articles/15297954", "message": "FILE - South Korean soldier wearing protective gears checks the trash from a balloon presumably sent by North Korea, in Incheon, South Korea, on June 2, 2024.\nSouth Korean officials called the North Korean balloon campaign and other recent provocations “absurd, irrational” and vowed “unbearable” retaliation.\nAnalysts say the North's action was also likely designed to trigger a divide in South Korea over its conservative government's tough policy on North Korea.\nBut the North Korean balloons sent into South Korea in recent days carried only garbage, not political leaflets.\nIn 2015, when South Korea restarted loudspeaker broadcasts after a lapse of 11 years, North Korea fired artillery rounds across the border, prompting South Korea to return fire."}, {"id": "fa5ce832-2645-4de2-961a-156cd5f670cd", "title": "Warhammer vet  grimdark femme miniatures Kickstarter shatters goal", "date": "2024-06-08 00:15", "url": "https://www.polygon.com/24173689/john-blanche-morderin-grimdark-femmes-kickstarter-release-date-price", "message": "John Blanche left an indelible mark on science fiction, high fantasy, and the world of gaming as a whole with his iconic art depicting the Warhammer and Warhammer 40,000 universes.\nNow, after 46 years at Games Workshop, he’s stepping out on his own with a new line of miniatures.\nLaunched quietly on Tuesday, the Kickstarter campaign for his inaugural Mörderin line launched with four exquisite “grimdark femmes miniatures.” Unsurprisingly, the project has crushed its funding goal.\nGrid View Image: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheImage: John BlancheThe Mörderin line began as a series of Blanche artworks, rendered in his unique style with its graceful lines and deep shadows.\nFor this project, Blanche’s figures are being produced by Zealot Miniatures in Siocast thermoplastic."}, {"id": "093322a3-054f-4854-9670-198d23dcc88f", "title": "Biden , Macron and Zelensky escalate war threats against Russia at D - Day commemoration", "date": "2024-06-08 04:45", "url": "https://www.wsws.org/en/articles/2024/06/08/aizj-j08.html", "message": "U.S. President Joe Biden shakes hands with Ukrainian President Volodymyr Zelensky in Paris, Friday, June 7, 2024.\n[AP Photo/Evan Vucci]The day after the official commemoration of the 80th anniversary of the Allies’ D-Day landings in Normandy during World War II, Ukrainian President Volodymyr Zelensky met US President Joe Biden and French President Emmanuel Macron for continuing ceremonies in France.\nThese meetings come at a dangerous point in the two-year-old war between NATO and Russia in Ukraine.\nThe invocations of the Normandy landings to justify the NATO war with Russia are political lies based on historical falsifications.\nNevertheless, over the course of yesterday, Biden and Macron announced vast new grants of weapons to the Ukrainian army to escalate the war with Russia."}, {"id": "22651a8d-1f72-497f-abf4-9ba06064860a", "title": "Black D - Day combat medic long - denied medal tenderly laid on Omaha Beach where he bled , saved lives", "date": "2024-06-08 04:15", "url": "https://www.clickondetroit.com/news/national/2024/06/07/black-d-day-combat-medics-long-denied-medal-tenderly-laid-on-omaha-beach-where-he-bled-saved-lives/", "message": "The medal was awarded posthumously to Woodson this month — just ahead of the 80th anniversary of D-Day — following years of lobbying for more recognition of his achievement on that fateful day.\nThe soldiers all saluted, still and quiet under blue skies, when U.S. First Army Command Sgt.\nKevin Braafladt explained to the soldiers that the next step would be the medal’s presentation to Woodson’s widow, 95-year-old Joann.\n“We want to be able to say that this medal came from Omaha Beach and was at the site of Woodson’s actions,” Braafladt said.\nUltimately, seven Black World War II troops were awarded the Medal of Honor in 1997."}, {"id": "b14140bd-7396-450a-bd2b-09dcc17fd952", "title": "Zelenskyy welcomes French promises of warplanes to help fight Russia", "date": "2024-06-08 00:30", "url": "https://www.foxnews.com/world/zelenskyy-welcomes-french-promises-warplanes-help-fight-russia", "message": "Ukrainian President Volodomyr Zelenskiy said on Friday he hoped to see French-supplied warplanes in Ukrainian skies soon after President Emmanuel Macron said France planned to provide it Mirage 2000-5 fighter jets.\nFRENCH WARPLANES AND TRAININGThe Mirage 2000-5 is a multi-role, single-engine jet fighter.\nNo, because we have no right to lose,\" Zelenskiy told the lawmakers.\nCLICK HERE TO GET THE FOX NEWS APPUkraine's military leaders admit that the battlefield situation on the eastern front has deteriorated.\nTwo years of war have sapped Ukraine's ammunition and manpower and a failed counter-offensive last year sank morale."}, {"id": "c3529e48-941b-49b7-a5c2-a9b3f8a920ba", "title": "Deadly landmines pose hidden threat in Libyan capital", "date": "2024-06-08 01:00", "url": "https://www.citizen.co.za/news/news-world/deadly-landmines-hidden-threat-libya/", "message": "Deadly landmines pose hidden threat in Libyan capitalThe southern suburbs, where three children were injured, have been the 'scene of all wars since 2011 until today'.\nHundreds of deadly landmines and unexploded ordanance still litter parts of Libya after years of fighting, posing a constant danger to civilians, especially children, long after the conflict.\n(Photo by Mahmud TURKIA / AFP)Hundreds of deadly landmines and unexploded ordnance still litter parts of Libya after years of fighting, posing a constant danger to civilians, especially children, long after the conflict.\nThe southern suburbs, where the three children were injured, have been the “scene of all wars since 2011 until today”, said Farhat.\nBut it will come too late for Farhat’s son Mohamed, who was wounded in the head by shrapnel from the blast."}, {"id": "09c14229-581c-4e46-ae7d-feee1b1141e5", "title": "From crusaders to bankers", "date": "2024-06-08 08:15", "url": "https://tribune.com.pk/story/2470336/from-crusaders-to-bankers", "message": "The Middle Ages have provided the history enthusiasts with a story that can hardly be rivaled — the story of the Knights Templar.\nThe history of the Knights Templar can be traced back to the early half of the twelfth century, following the sack of Jerusalem in 1099.\nThey also provided banking to fellow crusaders and travellers to protect their money and wealth and facilitate the transfer of capital.\nThe Order of the Knights Templar became extremely wealthy and powerful, as they were granted the responsibility of protecting the holy land.\nHowever, the growth of the Knights Templar was going to be sure to bring out the resistance of other religious orders and kings."}, {"id": "5d39eb8c-baba-4633-a0b0-7fc1f8b16285", "title": "Donald Trump says media scrutiny affecting son Barron", "date": "2024-06-08 08:00", "url": "https://www.thenews.com.pk/latest/1198197-donald-trump-says-media-scrutiny-affecting-son-barron", "message": "— Reuters/FileFormer United States president Donald Trump said his hush-money trial and the media scrutiny are affecting his 18-year-old son, Yahoo reported.\nEarlier in an interview with Fox, talking about his family, Trump said: \"I think in many ways it's tougher on my family than it is on me.\"\nTrump, who is the Republican presidential nominee, stated before the election that he feels his family wants him to take on the challenge.\nThe ex-president said that he believes his family wants him to fight the battle.\nMy family loves this country, and I think they feel I do a good job,\" said Trump."}, {"id": "010f34e7-5c41-4a50-8961-4a0a85fe444e", "title": "Biden to meet Macron after D - Day democracy warnings", "date": "2024-06-08 02:15", "url": "https://www.yahoo.com/news/biden-meet-macron-d-day-014913186.html", "message": "US President Joe Biden was to meet his French counterpart Emmanuel Macron Saturday on a state visit to France, after warning of the need to preserve American democracy and live up to the example of World War II heroes.\nBiden is due to meet Macron for talks at the Elysee Palace in Paris followed by a state banquet given in his honour, with Ukraine's battle against the Russian invasion the dominant topic.\n\"The rangers who scaled this cliff did not know they would change the world but they did,\" said Biden.\nMeeting Zelensky in Paris after the speech, Biden pledged his support for Ukraine and announced another $225 million in aid to Kyiv.\nZelensky thanked him for the \"tremendous support\", comparing it to the United States coming to Europe's aid during World War II."}, {"id": "f3ca1315-258f-4e85-a183-3b9e2dbe508a", "title": "This Tank Weighs Just Over 8 Tons : The Lightest Tanks in Today Militaries", "date": "2024-06-08 06:15", "url": "https://biztoc.com/x/fc3508b21538e190", "message": "Modern tanks are frightening machines, capable of dominating a battlefield.\nSince their invention, these armored combat vehicles have been used in various ways, from breaking up enemy lines to making it easier to drop allies into the middle of battle.\nWhile heavy tanks are intimidating and full of fighting power, there are lighter versions that serve a slightly different…This story appeared on 247wallst.com , ."}, {"id": "a0e07f57-f7e5-4f71-8062-1a26e6f9efc8", "title": "Switch eShop charts - June 8 , 2024", "date": "2024-06-08 09:00", "url": "https://nintendoeverything.com/switch-eshop-charts-june-8-2024/", "message": "This week’s Switch eShop charts are as follows:All Games1.\nLittle Kitty, Big City5.\nSuper Mario Bros. Wonder10.\nMario Party Superstars13.\nLittle Kitty, Big City3."}, {"id": "43dab6b5-972f-45c6-897f-da33e8a118dd", "title": "  You cant fight your way to peace : from a 20 - year - old Israeli to a 99 - year - old Briton , eight conscientious objectors on why they refused to serve in the army | Ethics", "date": "2024-06-08 07:45", "url": "https://www.theguardian.com/world/article/2024/jun/08/you-cant-fight-your-way-to-peace-from-a-20-year-old-israeli-to-a-99-year-old-briton-eight-conscientious-objectors-on-why-they-refused-to-serve-in-the-army", "message": "I went to university to defer military service, then decided to refuse it.\nI had been raised to believe that military service wasn’t only an obligation, but my duty.\nThis man was placed in military prison – I went to visit him every week and we became close friends.\nOn 5 April, I went to the military conscription centre in Samut Prakan province.\nI spent a week in military prison: my cell had no bed, so I slept on my jacket."}, {"id": "5d822447-42e3-4e00-abc0-087e6cce0ac2", "title": "  You cant fight your way to peace : from a 20 - year - old Israeli to a 99 - year - old Briton , eight conscientious objectors on why they refused to serve in the army", "date": "2024-06-08 08:00", "url": "https://www.aol.co.uk/news/t-fight-way-peace-20-070040266.html", "message": "I went to university to defer military service, then decided to refuse it.\nI had been raised to believe that military service wasn’t only an obligation, but my duty.\nThis man was placed in military prison – I went to visit him every week and we became close friends.\nOn 5 April, I went to the military conscription centre in Samut Prakan province.\nI spent a week in military prison: my cell had no bed, so I slept on my jacket."}, {"id": "2f07c503-1f20-4a68-9125-f5ee169b986e", "title": "The End Of BLHeli _ 32 : Long Live AM32 ? ", "date": "2024-06-08 09:00", "url": "https://hackaday.com/2024/06/07/the-end-of-blheli_32-long-live-am32/", "message": "As the ESC determines a lot of the performance characteristics of a drone, it has its own firmware, which for (FPV) drones is overwhelmingly BLHeli, specifically the 32-bit version (BLHeli_32).\nNow the Norwegian company (BLHeli AS) behind this closed source firmware has thrown in the towel, citing illegal use of its firmware by sanctioned countries like Russia for purposes like warfare.\nSo far the GitHub repository is still online, featuring binary images for BLHeli_32, as well as the open source BLHeli (8-bit Atmel/Silabs) firmware and BLHeli_S (multirotor 8-bit Silabs) firmware.\nDue to the open source nature of these earlier projects forks already exist, such as BlueJay for BLHeli_S, and with the AM32 project there is an open source 32-bit ESC alternative.\nFor 8-bit platforms it would thus seem that even with BLHeli_32 vanishing there is no impact at all, while for 32-bit platforms AM32 seems to be largely a drop-in solution."}, {"id": "27210e5d-38b9-4c56-9bfa-c3377f27cdb9", "title": "The Verdict", "date": "2024-06-08 01:45", "url": "https://www.independent.com/2024/06/07/the-verdict/", "message": "For a few on January 6, 2021, it was trauma and death, Donald Trump’s first open assault on the Republic.\nHe will debase and tear apart any cornerstone or guidepost of this nation to regain his access to power.\nDid the Republicans, in 2020, follow the Constitution and the law, excepting without malice the election results?\nOr did they attack the law, incited by the criminal deceit of Donald Trump, as he’s doing today?\nAny person, public voice, entity, or institution opposing or speaking out against Donald Trump will be hounded and persecuted and punished."}]