[{"id": "cad1536a-684c-445f-9115-3b751b892729", "title": "Ukraine unveils its deadly new drone boat set", "date": "2024-06-18 01:30", "url": "https://www.dailymail.co.uk/news/article-13540513/Ukraine-unveils-deadly-new-drone-boat-set-strike-fear-hearts-Russias-Black-Sea-Fleet-kamikaze-Stalker-372-mile-range-race-speeds-46mph-sea.html", "domain": "dailymail.co.uk", "domain_classification": "Unknown", "message": "Ukraine has unveiled a deadly new set of drone boats which it plans to use to devastating effect against Russia’s Black Sea Fleet.\nThe kamikaze Stalker 5.0 vehicle has a 372-mile operational range and can race at speeds of 46mph over the sea thanks to its 60-horsepower speedboat engine.\nUkrainian officials first made details of the unmanned vessel, which can carry explosive payloads of up to 150kg, public at the Black Sea Security Forum.\nIn March, one of Putin's most modern warships, The $65mn Sergey Kotov, which only came into service in 2022, was reportedly struck by an exploding kamikaze sea drone attack near Feodosia, in occupied Crimea.\nHowever, The SBU's stand out attack remains its experimental kamikaze drone hit on Vladimir Putin's £3 billion bridge linking Russia to Crimea, which triggered a huge explosion."}, {"id": "f0be25c1-f36c-4ad4-88da-79e05dcf174e", "title": "Netanyahu disbands war cabinet as pressure grows on Israel northern border", "date": "2024-06-18 05:30", "url": "https://www.euractiv.com/section/global-europe/news/netanyahu-disbands-war-cabinet-as-pressure-grows-on-israels-northern-border/", "domain": "euractiv.com", "domain_classification": "Unknown", "message": "Netanyahu is now expected to hold consultations about the Gaza war with a small group of ministers, including Defence Minister Yoav Gallant and Strategic Affairs Minister Ron Dermer who had been in the war cabinet.\nThe Israeli military said on Monday it had killed a senior operative in one of Hezbollah’s rocket and missile sections in the area of Selaa in southern Lebanon.\nNetanyahu had faced demands from the nationalist-religious partners in his coalition, Finance Minister Bezalel Smotrich and National Security Minister Itamar Ben-Gvir, to be included in the war cabinet.\nThe forum was formed after Gantz joined Netanyahu in a national unity government at the start of the Gaza war in October.\nGantz and Eisenkot both left the government last week, over what they said was Netanyahu’s failure to form a strategy for the Gaza war."}, {"id": "36a3c946-c310-4ffa-b854-1aab1f2adc08", "title": "Netanyahu disbands war cabinet as pressure grows on Israel northern border", "date": "2024-06-18 04:15", "url": "https://www.swissinfo.ch/eng/netanyahu-disbands-war-cabinet-as-pressure-grows-on-israel", "domain": "swissinfo.ch", "domain_classification": "Unknown", "message": "Netanyahu disbands war cabinet as pressure grows on Israel’s northern border5 minutesBy James MackenzieJERUSALEM (Reuters) -Israeli Prime Minister Benjamin Netanyahu has dissolved the six-member war cabinet, an Israeli official said on Monday, in a widely expected move following the departure from government of centrist former general Benny Gantz.\nNetanyahu is now expected to hold consultations about the Gaza war with a small group of ministers, including Defence Minister Yoav Gallant and Strategic Affairs Minister Ron Dermer who had been in the war cabinet.\nThe forum was formed after Gantz joined Netanyahu in a national unity government at the start of the Gaza war in October.\nGantz and Eisenkot both left the government last week, over what they said was Netanyahu’s failure to form a strategy for the Gaza war.\nIsrael’s offensive has killed more than 37,000 Palestinians, according to Palestinian health ministry figures, and destroyed much of Gaza."}, {"id": "01194dfb-272f-4ca3-a01a-6accf6341841", "title": "Israel - Hamas : Benjamin Netanyahu disbands war cabinet after Benny Gantz quits government", "date": "2024-06-18 02:45", "url": "https://www.watoday.com.au/world/middle-east/benjamin-netanyahu-disbands-war-cabinet-after-key-partner-bolts-from-government-20240618-p5jmkt.html", "domain": "watoday.com.au", "domain_classification": "Unknown", "message": "Jerusalem: Israeli Prime Minister Benjamin Netanyahu has dissolved the six-member war cabinet, an Israeli official said, following the departure from government of centrist former general Benny Gantz.\nNetanyahu is now expected to hold consultations about the Gaza war with a small group of ministers, including Defence Minister Yoav Gallant and Strategic Affairs Minister Ron Dermer who had been in the war cabinet.\nIsraeli Prime Minister Benjamin Netanyahu speaks during a news conference in Tel Aviv, Israel.\nCredit: APThe move was announced as US special envoy Amos Hochstein visited Jerusalem, seeking to calm the situation on the disputed border with Lebanon, where Israel said tensions with the Iran-backed Hezbollah militia were bringing the region close to a wider conflict.\nThe Israeli military said it had killed a senior operative in one of Hezbollah’s rocket and missile sections in the area of Selaa in southern Lebanon this week."}, {"id": "9c02e536-3682-438c-b709-0784726497b9", "title": "U . S . Navy Rescues Crew of Greek Ship that Houthis Attacked", "date": "2024-06-18 05:00", "url": "https://www.breitbart.com/national-security/2024/06/17/u-s-navy-rescues-crew-of-greek-ship-that-houthis-attacked/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Most of the Tutor’s two dozen crew members are Filipino.\n“Despite these senseless attacks on innocent mariners just doing their job, the Philippine Sea crew stand ready to help preserve safety of life at sea, always,” said Capt.\n(Yes, the commanding officer of the Philippine Sea is named “Captain Liberty.”)One member of the Tutor’s crew is reportedly missing.\nThe Philippine Department of Migrant Workers (DMW) said Philippine Embassy officials met the rescued crew members in the Bahrain port city of Manama.\nThe DMW said the repatriated crew members are traveling in the company of Labor Attache Hector Cruz and are expected home in the Philippines by Monday afternoon."}, {"id": "cd751f37-5c3c-41fb-9945-f872f46a3320", "title": "U . S . Navy Rescues Crew of Greek Ship that Houthis Attacked", "date": "2024-06-18 02:00", "url": "https://www.breitbart.com/middle-east/2024/06/17/u-s-navy-rescues-crew-of-greek-ship-that-houthis-attacked/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "Most of the Tutor’s two dozen crew members are Filipino.\n“Despite these senseless attacks on innocent mariners just doing their job, the Philippine Sea crew stand ready to help preserve safety of life at sea, always,” said Capt.\n(Yes, the commanding officer of the Philippine Sea is named “Captain Liberty.”)One member of the Tutor’s crew is reportedly missing.\nThe Philippine Department of Migrant Workers (DMW) said Philippine Embassy officials met the rescued crew members in the Bahrain port city of Manama.\nThe DMW said the repatriated crew members are traveling in the company of Labor Attache Hector Cruz and are expected home in the Philippines by Monday afternoon."}, {"id": "e6f4877a-99b7-47b5-9af1-faaa3df265f5", "title": "Ukraine robot boats are rewriting the rules of naval warfare", "date": "2024-06-18 06:15", "url": "https://www.defenseone.com/ideas/2024/06/ukraines-usvs-write-new-rules-asymmetric-naval-warfare/397430/", "domain": "defenseone.com", "domain_classification": "Unknown", "message": "Ukraine’s use of aerial drones and robot boats are hampering Russian naval operations in the Black Sea and rewriting the playbook for war planners concerned with maritime chokepoints.\nUkraine helped usher in a new phase of asymmetrical warfare at sea with an October 2022 attack on Russia’s primary naval base in Sevastopol.\nIn the future, Ukrainian USVs might shoot back – in May, Ukraine showed off a new USV outfitted with two R-73 air-to-air missiles.\nStrategists around the world have taken note of the changing dynamics at play in the Black Sea and the implications for flashpoints elsewhere.\nThe battle in the Black Sea is far from won, but serves as a defining moment for the evolution of Ukraine’s maritime force."}, {"id": "cd605cd7-e34c-47b4-a0b6-d516f9620543", "title": "2024 NBA Draft FAQ : Top prospects , trade chips , Bronny James", "date": "2024-06-18 05:15", "url": "https://www.yardbarker.com/nba/articles/2024_nba_draft_faq_top_prospects_trade_chips_bronny_james/s1_13132_40497753", "domain": "yardbarker.com", "domain_classification": "Unknown", "message": "With the 2023-24 NBA season officially behind us, attention turns to the NBA Draft, which will be held on June 26 and 27.\nIn preparation for the two-day event, here are the answers to some of the biggest questions regarding the 2024 NBA Draft.\nThe second round of the 2024 NBA Draft, live from ESPN's Seaport District Studios in lower Manhattan, begins on June 27 at 4 p.m.\n1 overall pick after winning the NBA Draft Lottery for the first time in franchise history.\nThe full 2024 NBA Draft order, courtesy of Tankathon, can be found here."}, {"id": "e143bc33-5d2b-4186-b7c9-cee63b354b1a", "title": "Newly Elected Mayor Assassinated In Southern Mexico", "date": "2024-06-18 03:00", "url": "https://dailycaller.com/2024/06/17/salvador-villalva-flores-mayor-assassinated-southern-mexico/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "A newly elected mayor was assassinated Monday in Southern Mexico, The Associated Press (AP) reported.\nSalvador Villalva Flores, the recently elected mayor of a small coastal town in Guerrero, Mexico, was assassinated, according to AP.\nThis assassination is part of a disturbing trend of violence targeting political figures in Mexico.\nData Civica, a human rights organization, noted that around 34 political candidates were murdered in the months leading up to and following the June elections, AP reported.\nElected in 2021, Sanchez was ambushed and shot 19 times by gunmen from a white truck outside a gym before they fled the scene, CBS News reported."}, {"id": "3eb1bf19-ef13-467c-8e2b-1505da78407b", "title": "U . S . designates Iran - aligned Ansar Allah al - Awfiya as terrorist organization", "date": "2024-06-18 07:45", "url": "https://www.upi.com/Top_News/US/2024/06/18/designates-Ansar-Allah-al-Awfiya/7961718690969/", "domain": "upi.com", "domain_classification": "Unknown", "message": "The State Department under U.S. Secretary of State Antony Blinken on Monday designated the Iran-aligned Harakat Ansar Allah al-Awfiya as a terrorist organization.\nFile Photo by NATO Press/UPI | License PhotoJune 18 (UPI) -- The United States has designated Iraq-based Harakat Ansar Allah al-Awfiya as a terrorist organization as the Biden administration cracks down Iran proxy militias amid Israel's war in Gaza.\nThe U.S. State Department sanctioned the Iran-backed group as a Specially Designated Global Terrorist organization along with its 46-year-old secretary general, Muzhir Ma'lak al-Sa'idi.\nHarakat Ansar Allah al-Awfiya is part of the Islamic Resistance in Iraq, which has claimed responsibility for several recent attacks from Iraq and Syria targeting U.S. military, including a January drone strike that killed three U.S. service members in Jordan.\nThe U.S. State Department said Harakat Ansar Allah al-Awfiya was involved in the strike."}, {"id": "609f26eb-0615-4cfc-91f1-fecb43dd942f", "title": "U . S . tests Minuteman III nuclear ICBMs amid heightened geopolitical tensions – NaturalNews . com", "date": "2024-06-18 08:15", "url": "https://www.naturalnews.com/2024-06-17-us-tests-minuteman-iii-nuclear-icbms.html", "domain": "naturalnews.com", "domain_classification": "Unknown", "message": "U.S. tests Minuteman III nuclear ICBMs amid heightened geopolitical tensionsIn a series of routine exercises, the United States military conducted two tests of intercontinental ballistic missiles (ICBMs).\nHowever, concerns linger within Washington regarding the aging Minuteman III system, which first became operational in the 1970s.\nAdmiral Charles Richard, head of U.S. Strategic Command (USSTRATCOM), has previously voiced worries about the technical limitations of the Minuteman III, citing outdated documentation and maintenance difficulties.\nIn response to these challenges, the Pentagon recently awarded a $405 million contract to Boeing for the maintenance and service of the Minuteman III missiles.\nMore related stories:Ben Armstrong: Russia’s new NUCLEAR MISSILE test a WARNING to America."}, {"id": "3653a5fa-3afc-4c94-b7a1-fd309830efb3", "title": "Authorities across U . S . grapple with rash of violence in final days of spring", "date": "2024-06-18 00:30", "url": "https://www.columbian.com/news/2024/jun/17/authorities-across-u-s-grapple-with-rash-of-violence-in-final-days-of-spring/", "domain": "columbian.com", "domain_classification": "Unknown", "message": "Communities across the country are grappling with a rash of violence in the final days of spring that included at least four mass shootings in one weekend, and continued Monday with stabbings outside an Indiana strip mall.\nOn Saturday, a lone gunman opened fire at a recreational splash pad in suburban Detroit, injuring nine people including an 8-year-old who was shot in the head.\nIn Texas, fatal gunfire broke out at a Juneteenth celebration, with two people pronounced dead.\nOther shootings and stabbings, in locations from Massachusetts to Indiana, marred the days before spring turns to summer as sweltering heat takes hold in many regions.\nChris Dennison, a sociology professor at the University of Buffalo who researches crime, said the arrival of seasonable weather presents more opportunities for crime and violence, amid heightened concerns about mental health issues and destructive outcomes."}, {"id": "c2dfb9c0-75cc-4bec-a839-0e09a50b7156", "title": "  Youve stabbed me , I love you  – Mother walks free after stabbing boyfriend after night out", "date": "2024-06-18 05:30", "url": "https://www.expressandstar.com/news/crime/2024/06/18/youve-stabbed-me-i-love-you-mother-walks-free-after-stabbing-boyfriend-after-night-out/", "domain": "expressandstar.com", "domain_classification": "Unknown", "message": "Chelsea Leigh Smith, 26, attacked her then partner in his Walsall flat on Saturday, March 23, this year after a night out.\nRing doorbell footage captured the lead up and aftermath of the attack, with Smith screaming at her boyfriend and then him screaming before shouting: \" You've f****** stabbed me, I love you.\"\nHer partner then staggered downstairs covering the walls of Oak Court, on the Yew Tree estate, in blood as he went and was found by police officers.\nHe told officers Smith had stabbed him and was still in the flat, he was then taken to hospital for his wounds.\nThe stabbing happened at Oak Court, Yew Tree estate, WalsallOfficers then arrested Smith, who denied any involvement in her partner's injuries."}, {"id": "bcbd3d3a-b8b5-4891-bde8-3f5152347bb1", "title": "IDF general tells troops to continue Rafah operation until Hamas is defeated", "date": "2024-06-18 00:30", "url": "https://signalscv.com/2024/06/idf-general-tells-troops-to-continue-rafah-operation-until-hamas-is-defeated/", "domain": "signalscv.com", "domain_classification": "Unknown", "message": "By Aldgra FredlyContributing WriterThe Israel Defense Forces vowed to continue military operations in Rafah until the Hamas terrorist group is defeated.\nThis followed an explosion in southern Gaza that killed eight Israeli soldiers.\nIDF Southern Command chief Maj. Gen. Yaron Finkelman said at a Saturday meeting with commanders in Rafah that they must continue their fight against Hamas as the explosion is being investigated.\nThe crossing has had a bottleneck since Israeli ground troops moved into Rafah in early May.\nHamas terrorists killed approximately 1,200 people and abducted more than 250 hostages during their attack on Israel on Oct. 7, 2023."}, {"id": "461b3698-6b7a-40b8-8c0c-affe8a4a4927", "title": "U . S . Navy Rescues Crew from Vessel Struck by Houthis", "date": "2024-06-18 04:00", "url": "https://seapowermagazine.org/u-s-navy-rescues-crew-from-vessel-struck-by-houthis/", "domain": "seapowermagazine.org", "domain_classification": "Unknown", "message": "By Carrier Strike Group Two Public Affairs | June 16, 2024RED SEA –Sailors assigned to the Dwight D. Eisenhower Carrier Strike Group (IKECSG) airlifted the crew of a merchant vessel attacked by Iranian-backed Houthis in the Red Sea, June 15.\nThe Liberian-flagged, Greek-owned bulk cargo carrier M/V Tutor was struck by an Iranian-back Houthi uncrewed surface vessel (USV) while sailing in the international waters of the Southern Red Sea, June 12.\nA helicopter from Helicopter Maritime Strike Squadron (HSM) 74 airlifted 24 civilian mariners from Tutor to Ticonderoga-class guided-missile cruiser USS Philippine Sea (CG 58).\nFrom there, helicopters from Helicopter Sea Combat Squadron (HSC) 7 transported the group to USS Dwight D. Eisenhower (CVN 69).\n“It’s humbling to watch the Strike Group provide assistance and rescue the crew of M/V Tutor,” said Rear Adm. Marc Miguez, commander, IKECSG, Carrier Strike Group 2."}, {"id": "bc38a6ec-d3a2-45a1-ae07-85b2666728d1", "title": "Netanyahu dissolves influential War Cabinet", "date": "2024-06-18 02:45", "url": "https://www.stltoday.com/news/nation-world/netanyahu-dissolves-influential-war-cabinet-after-key-partner-bolted-from-government/article_8efa87a0-3fb8-57fe-92df-b57ae4fa0d65.html", "domain": "stltoday.com", "domain_classification": "Unknown", "message": "TEL AVIV, Israel — Israeli Prime Minister Benjamin Netanyahu dissolved the influential war Cabinet that oversaw the fighting in Gaza, a government spokesperson said Monday, days after a key member of the body bolted from the government over frustration with the Israeli leader's handling of the war.\nThe move to scrap the war Cabinet comes as Israel faces more pivotal decisions.\nThe Israeli military said it tracked just two missiles fired Monday from Lebanon, and they did not enter Israeli territory.\nFormer army chief and fellow party member Gadi Eisenkot left the war Cabinet, where he had observer status.\nWithout the support of Gantz's party, Netanyahu is expected to be more beholden to far-right allies."}, {"id": "5b53be25-990a-4311-bf03-8bcf3e6cbf55", "title": "Authorities across US grapple with a rash of violence in final days of spring", "date": "2024-06-18 02:45", "url": "https://www.kiro7.com/news/national/authorities-across/BCWAJAPAC3GLWOOVYBDNYLAM4U/", "domain": "kiro7.com", "domain_classification": "Unknown", "message": "We’re Sorry!\nThis website is unavailable in your location.\nError 451It appears you are attempting to access this website from a country outside of the United States, therefore access cannot be granted at this time."}, {"id": "6dfe2afe-f65e-4ec5-a380-f66f7cb7c411", "title": "Netanyahu dissolves influential War Cabinet", "date": "2024-06-18 00:30", "url": "https://omaha.com/news/nation-world/netanyahu-dissolves-influential-war-cabinet-after-key-partner-bolted-from-government/article_c1cf1bd9-a896-5bad-9edd-3733e6994e79.html", "domain": "omaha.com", "domain_classification": "Unknown", "message": "TEL AVIV, Israel — Israeli Prime Minister Benjamin Netanyahu dissolved the influential war Cabinet that oversaw the fighting in Gaza, a government spokesperson said Monday, days after a key member of the body bolted from the government over frustration with the Israeli leader's handling of the war.\nThe move to scrap the war Cabinet comes as Israel faces more pivotal decisions.\nThe Israeli military said it tracked just two missiles fired Monday from Lebanon, and they did not enter Israeli territory.\nFormer army chief and fellow party member Gadi Eisenkot left the war Cabinet, where he had observer status.\nWithout the support of Gantz's party, Netanyahu is expected to be more beholden to far-right allies."}, {"id": "c2e08e65-8d86-46c4-8897-9b97534d87a9", "title": "Authorities across US grapple with a rash of violence in final days of spring", "date": "2024-06-18 09:15", "url": "https://www.cleveland19.com/2024/06/18/authorities-across-us-grapple-with-rash-violence-final-days-spring/", "domain": "cleveland19.com", "domain_classification": "Unknown", "message": "(AP) - Communities across the country are grappling with a rash of violence in the final days of spring that included at least four mass shootings in one weekend, and continued Monday with stabbings outside an Indiana strip mall.\nOn Saturday, a lone gunman opened fire at a recreational splash pad in suburban Detroit, injuring nine people, including an 8-year-old who was shot in the head.\nOther shootings and stabbings, in locations from Massachusetts to Indiana, marred the days before spring turns to summer as sweltering heat takes hold in many regions.\nThe rash of violence is a counterpoint to FBI data pointing to a sharp drop in violent crime nationwide earlier this year.\nA splash pad is a recreational area with a nonslip surface where people can play in fountains and water sprays."}, {"id": "73227ca8-03a2-453e-9fe0-b6595725a56b", "title": "US recognition of Iraq group as terror org is significant", "date": "2024-06-18 09:15", "url": "https://www.jpost.com/middle-east/iran-news/article-806698", "domain": "jpost.com", "domain_classification": "Local - Middle East", "message": "The US Department of State designated an Iraqi-based terrorist group on June 17.\nThis is important because it shows the US continues to be focused on the threat of Iranian-backed militias in Iraq.\nThe Iranian-backed groups in Iraq carried out more than 100 attacks on US forces in Iraq and Syria from October through January.\nThe Iranian-backed groups in Iraq have sought to increase their attacks on Israel.\nIt was not clear if this was linked to the Iraqi groups."}, {"id": "5641be06-da42-4606-b732-9c6bcb22f004", "title": "Netanyahu dissolves influential War Cabinet after key partner bolts from govt | World News", "date": "2024-06-18 06:00", "url": "https://jamaica-gleaner.com/article/world-news/20240618/netanyahu-dissolves-influential-war-cabinet-after-key-partner-bolts-govt", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "The move to scrap the War Cabinet comes as Israel faces more pivotal decisions.\nThe lull continued even after Israeli military officials said they killed a key operative in Hezbollah’s rocket and missile department, Mohammed Ayoub, in a drone attack on Monday morning.\nThe Israeli military said it tracked just two missiles fired Monday from Lebanon, and they did not enter Israeli territory.\nFormer army chief and fellow party member Gadi Eisenkot left the War Cabinet, where he had observer status.\nWithout the support of Gantz’s party, Netanyahu is expected to be more beholden to far-right allies."}, {"id": "80110290-0239-410c-b8be-3712ac94b038", "title": "Netanyahu dissolves influential war Cabinet after key partner bolted from government", "date": "2024-06-18 05:30", "url": "https://isp.netscape.com/news/world/story/0001/20240618/76b4e165609bb3f0716c8599a83efa99", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "Netanyahu dissolves influential war Cabinet after key partner bolted from governmentTEL AVIV, Israel (AP) — Israeli Prime Minister Benjamin Netanyahu dissolved the influential war Cabinet that has overseen the fighting in Gaza, a government spokesperson said Monday, days after a key member of the body bolted from the government over frustration with the Israeli leader's handling of the war.\nThe move to scrap the war Cabinet comes as Israel faces more pivotal decisions.\nThe Israeli military said it tracked just two missiles fired Monday from Lebanon, and they did not enter Israeli territory.\nFormer army chief and fellow party member Gadi Eisenkot left the war Cabinet, where he had observer status.\nWithout the support of Gantz's party, Netanyahu is expected to be more beholden to far-right allies."}, {"id": "85757d6d-ff01-460e-81ff-d0f7fda70948", "title": "  I whispered in her ear , asking her to tell my sister , my mother , I love them : A letter from Gaza", "date": "2024-06-18 04:45", "url": "https://www.irishexaminer.com/opinion/commentanalysis/arid-41418175.html", "domain": "irishexaminer.com", "domain_classification": "Unknown", "message": "My mother died when I was six, so my big sister Samar became like my mother.\nPalestinian medics surround a baby wounded in the Israeli bombardment of Khan Younis in Gaza on Saturday, October 21, 2023.\nIt was so full of love, with my grandmother, my sister Samar, and my brother Mohammed.\nPicture: Abed Khaled/APBut I did not find Massah, nor her mother — my sister — not her father, not her aunts.\nI whispered in her tiny ear, asking her to tell my sister, my mother, that I love them dearly, and yearn for our reunion."}, {"id": "a2ba7282-eeb2-43ca-a479-7f322ce843fc", "title": "12 - y - o injured in shooting at Ocho Rios High", "date": "2024-06-18 06:00", "url": "https://jamaica-gleaner.com/article/lead-stories/20240618/12-y-o-injured-shooting-ocho-rios-high", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "A 12-year-old female student has been admitted to the St Ann’s Bay Regional Hospital after being shot during an incident at the Ocho Rios High School in St Ann on Monday.\nReports are that a 14-year-old male student of a Pineapple, Ocho Rios address took a .23 pistol to school to show off to classmates.\nSenior Superintendent of Police Dwight Powell, the commanding officer for the St Ann Police Division, noted that Ocho Rios High is one of the institutions that have bought into the Safe Schools Programme.\nIt is unclear what impact this shooting incident will have on the programme at Ocho Rios High.\n“We are probing this shooting incident and we are following leads as to how and by what means the student came in possession of the firearm,” Powell said on Monday."}, {"id": "a3709666-dc40-4615-88d4-f08e96d0c829", "title": "Netanyahu dissolves influential War Cabinet after key partner bolted from government | News , Sports , Jobs", "date": "2024-06-18 03:15", "url": "https://www.mauinews.com/wire/?category=5187&ID=329154", "domain": "mauinews.com", "domain_classification": "Unknown", "message": "The move to scrap the War Cabinet comes as Israel faces more pivotal decisions.\nThe lull continued even after Israeli military officials said they killed a key operative in Hezbollah’s rocket and missile department, Mohammed Ayoub, in a drone attack on Monday morning.\nThe Israeli military said it tracked just two missiles fired Monday from Lebanon, and they did not enter Israeli territory.\nFormer army chief and fellow party member Gadi Eisenkot left the War Cabinet, where he had observer status.\nWithout the support of Gantz’s party, Netanyahu is expected to be more beholden to far-right allies."}, {"id": "eda1fe13-c96f-4581-bbd1-c79f8c396480", "title": "  They Chop Us Up Like Meat  – Ukraine at War Update for June 18", "date": "2024-06-18 06:45", "url": "https://www.kyivpost.com/post/34442", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "Great to be back in the 🇺🇸 and meet @POTUS to prepare our #NATOSummit in July, where we will strengthen support to #Ukraine.\nOther Topics of Interest ISW Russian Offensive Campaign Assessment, June 17, 2024 Latest from the Institute for the Study of War.\nNow we are already collecting the second batch of drones, which is soon to be sent to Ukraine,” Spruds told the military new site ArmyInform.\n“The increased tax burden on businesses will almost certainly restrict future investment and growth of non-military sectors,” the update reads.\nLatest Defence Intelligence update on the situation in Ukraine – 16 June 2024."}, {"id": "7e9a9aae-eea0-455d-a0a9-e9e777c2b062", "title": "Investigation reveals Israel Gaza strikes wipe out generations of families", "date": "2024-06-18 07:00", "url": "https://www.hurriyetdailynews.com/investigation-reveals-israels-gaza-strikes-wipe-out-generations-of-families-197555", "domain": "hurriyetdailynews.com", "domain_classification": "Unknown", "message": "Investigation reveals Israel’s Gaza strikes wipe out generations of familiesGAZA STRIPThe Associated Press has shared an investigation into the increasing casualty count from Israel's attacks on Gaza, revealing that at least 60 Palestinian families lost at least 25 members between October and December.\nNearly a quarter of those families lost more than 50 family members in those weeks.\nIn the last two decades, 10 members of his family were killed in Israeli strikes.\nIn the 51-day war of 2014, the number of families that lost three or more members was less than 150.\nTogether, the strikes killed more than 500 people, including the two bombings that wiped out the Salems and three others that killed 30 members of the al-Agha family."}, {"id": "d3638193-807f-40a9-858c-103be840bf55", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 04:45", "url": "https://www.yahoo.com/news/shooter-killed-5-colorado-lgbtq-041407133.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "a431dd10-c309-42f4-b43e-831c804fade0", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 04:45", "url": "https://abcnews.go.com/US/wireStory/shooter-killed-5-colorado-lgbtq-club-set-plead-111205523", "domain": "abcnews.go.com", "domain_classification": "International", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "82543c44-809d-4b8d-af96-1932608be836", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 05:30", "url": "https://www.startribune.com/shooter-who-killed-5-at-a-colorado-lgbtq-club-set-to-plead-guilty-to-federal-hate-crimes/600374248/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "d9346c66-fb6b-4ecc-bc1a-337350a9c189", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 06:45", "url": "https://www.ksat.com/news/2024/06/18/shooter-who-killed-5-at-a-colorado-lgbtq-club-set-to-plead-guilty-to-federal-hate-crimes/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "6284c2c1-b665-4979-933b-cd946d3cca8a", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 08:15", "url": "https://www.clickondetroit.com/news/2024/06/18/shooter-who-killed-5-at-a-colorado-lgbtq-club-set-to-plead-guilty-to-federal-hate-crimes/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "1c97911e-e71d-4d61-a35b-81356cd60ca8", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes – Winnipeg Free Press", "date": "2024-06-18 05:00", "url": "https://www.winnipegfreepress.com/world/2024/06/17/shooter-who-killed-5-at-a-colorado-lgbtq-club-set-to-plead-guilty-to-federal-hate-crimes", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nAldrich also pleaded no contest to hate crimes in that case.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "a18f9fb8-9499-4d0d-abc6-9c9d701ffe32", "title": "US sanctions suppliers of weapons parts for Houthis", "date": "2024-06-18 04:00", "url": "http://www.israelnationalnews.com/news/391698", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The United States on Monday imposed new sanctions aimed at cutting off weapons, supplies and funding to the Iranian-backed Houthis rebels.\nThe sanctions were placed on two individuals and five entities that have facilitated weapons procurement for the Houthis, as well as an individual, a company and a vessel that have helped with commodities shipments, “the sale of which provides an important funding stream to the Houthis that aids in their weapons procurement,” the Treasury statement said.\nSeveral of the designated entities are based in China or procure materials for weapons from companies in China, according to the Treasury.\nIn the wake of the uptick in Houthi attacks, the US formed a coalition , made up of more than 20 countries, aimed at safeguarding commercial traffic in the Red Sea from attacks by the Houthis.\nIn mid-January, with support from other countries, the US and Britain targeted just under 30 Houthi locations with 150 different weapons."}, {"id": "e70a9e52-6beb-4ebe-aea1-c29f279692fe", "title": "US sanctions suppliers of weapons parts for Houthis", "date": "2024-06-18 02:45", "url": "https://www.israelnationalnews.com/news/391698", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "The United States on Monday imposed new sanctions aimed at cutting off weapons, supplies and funding to the Iranian-backed Houthis rebels.\nThe sanctions were placed on two individuals and five entities that have facilitated weapons procurement for the Houthis, as well as an individual, a company and a vessel that have helped with commodities shipments, “the sale of which provides an important funding stream to the Houthis that aids in their weapons procurement,” the Treasury statement said.\nSeveral of the designated entities are based in China or procure materials for weapons from companies in China, according to the Treasury.\nIn the wake of the uptick in Houthi attacks, the US formed a coalition , made up of more than 20 countries, aimed at safeguarding commercial traffic in the Red Sea from attacks by the Houthis.\nIn mid-January, with support from other countries, the US and Britain targeted just under 30 Houthi locations with 150 different weapons."}, {"id": "5fa115be-a5c7-4fc3-a3ff-aacb90fc71c1", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 08:15", "url": "https://www.news4jax.com/news/2024/06/18/shooter-who-killed-5-at-a-colorado-lgbtq-club-set-to-plead-guilty-to-federal-hate-crimes/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "3048311c-14a7-42aa-806f-5143c8910da3", "title": "Israel warns of  devastating consequence as spike in fire with Lebanon risks wider conflict – NBC 6 South Florida", "date": "2024-06-18 00:45", "url": "https://www.nbcmiami.com/news/business/money-report/israel-warns-of-devastating-consequences-as-spike-in-fire-with-lebanon-risks-wider-conflict/3339287/", "domain": "nbcmiami.com", "domain_classification": "Unknown", "message": "A senior U.S. adviser will travel to Israel in a bid to simmer tensions at the Lebanon border, where recent rains of missiles have reignited the risk of a broader conflict.\nAmos Hochstein, a senior diplomatic adviser to the administration of U.S. President Joe Biden, is expected in Israel on Monday, an Israeli official told NBC News.\nOver the past week, Lebanese militant group Hezbollah has ramped up hostilities and cross-border missile attacks against targets in northern Israel, according to Israel Defense Forces and the Hezbollah-aligned al-Manar news outlet.\nIt comes amid a ramp-up in attacks by Hezbollah in recent weeks following repeat offensives against its neighbor since October.\n\"Israel will take the necessary measures to protect its civilians, until security along our border with Lebanon is restored."}, {"id": "a2095bcc-7840-48f1-9b31-8901864e1d4a", "title": "Shooter who killed 5 at a Colorado LGBTQ+ club set to plead guilty to federal hate crimes", "date": "2024-06-18 05:15", "url": "https://www.kob.com/news/us-and-world-news/shooter-who-killed-5-at-a-colorado-lgbtq-club-set-to-plead-guilty-to-federal-hate-crimes/", "domain": "kob.com", "domain_classification": "Unknown", "message": "Aldrich, now 24, is already serving life in prison after pleading guilty to state charges last year.\nFederal prosecutors have focused on proving that the attack at Club Q — a sanctuary for LGBTQ+ people in the mostly conservative city — was premeditated and fueled by bias.\nU.S. District Judge Charlotte Sweeney, the first openly gay federal judge in Colorado, will decide whether to accept it.\nLess than a month before the shooting, Aldrich coordinated a spam email campaign against a former work supervisor who is gay, according to recent court filings by prosecutors.\nHate Crimes Prevention Act, which expanded federal law in 2009 to include crimes motivated by sexual orientation, gender identity or disability."}, {"id": "1318efa8-a910-42c1-9bdb-c4648e32f353", "title": "Authorities across US grapple with a rash of violence in final days of spring", "date": "2024-06-18 08:45", "url": "https://www.fox19.com/2024/06/18/authorities-across-us-grapple-with-rash-violence-final-days-spring/", "domain": "fox19.com", "domain_classification": "Unknown", "message": "(AP) - Communities across the country are grappling with a rash of violence in the final days of spring that included at least four mass shootings in one weekend, and continued Monday with stabbings outside an Indiana strip mall.\nOn Saturday, a lone gunman opened fire at a recreational splash pad in suburban Detroit, injuring nine people, including an 8-year-old who was shot in the head.\nOther shootings and stabbings, in locations from Massachusetts to Indiana, marred the days before spring turns to summer as sweltering heat takes hold in many regions.\nThe rash of violence is a counterpoint to FBI data pointing to a sharp drop in violent crime nationwide earlier this year.\nA splash pad is a recreational area with a nonslip surface where people can play in fountains and water sprays."}, {"id": "09317687-a413-4c90-a22a-843057d830cb", "title": "NewsBusters Podcast : Alex Wagner Whines About Biden Debate In Advance", "date": "2024-06-18 06:30", "url": "https://newsbusters.org/blogs/nb/tim-graham/2024/06/17/newsbusters-podcast-alex-wagner-whines-about-biden-debate-advance", "domain": "newsbusters.org", "domain_classification": "Unknown", "message": "On Friday night, MSNBC host Alex Wagner whined that Donald Trump will be held to a much lower standard than Biden during the debates.\nJournalist Susan Glasser agreed, saying the MAGA base doesn't hold Trump \"accountable\" like...well, hostile leftist Democrat journalists.\nIf they did, it would be to satisfy viewers further to the left than Biden.\nThey are upset that Donald Trump's voters don't judge Trump in the same way that leftist MSNBC hosts judge Trump.\nBut earlier, Tapper asked Sen. Murphy if it was appropriate for President Biden to criticize the Supreme Court as \"out of kilter\" with public opinion."}, {"id": "ff996d4a-0aab-4684-b52e-6d9d04968404", "title": "NewsBusters Podcast : Alex Wagner Whines About Biden Debate In Advance", "date": "2024-06-18 06:15", "url": "https://www.newsbusters.org/blogs/nb/tim-graham/2024/06/17/newsbusters-podcast-alex-wagner-whines-about-biden-debate-advance", "domain": "newsbusters.org", "domain_classification": "Unknown", "message": "On Friday night, MSNBC host Alex Wagner whined that Donald Trump will be held to a much lower standard than Biden during the debates.\nJournalist Susan Glasser agreed, saying the MAGA base doesn't hold Trump \"accountable\" like...well, hostile leftist Democrat journalists.\nIf they did, it would be to satisfy viewers further to the left than Biden.\nThey are upset that Donald Trump's voters don't judge Trump in the same way that leftist MSNBC hosts judge Trump.\nBut earlier, Tapper asked Sen. Murphy if it was appropriate for President Biden to criticize the Supreme Court as \"out of kilter\" with public opinion."}, {"id": "f7b0843f-4263-4fe6-a032-7a7bea850fed", "title": "RIGHT SPEAK : RU Attack on 8 Fronts , Fighting Continues on 6 of Them ; Half of C - Clashes On Pokrovsk Front ; UKR Gradually Pushing RU out of Kharkiv Oblast ; Drones Attacked 4 Regions of RU Federation ; UKR  prepares ground  for Attacks on Crimea ...", "date": "2024-06-18 07:15", "url": "http://www.rightspeak.net/2024/06/ru-attack-on-8-fronts-fighting.html", "domain": "rightspeak.net", "domain_classification": "Unknown", "message": "Blog Archive: Jun 2024 (90) May 2024 (153) Apr 2024 (149) Mar 2024 (155) Feb 2024 (145) Jan 2024 (156) Dec 2023 (155) Nov 2023 (150) Oct 2023 (155) Sep 2023 (150) Aug 2023 (155) Jul 2023 (155) Jun 2023 (150) May 2023 (155) Apr 2023 (150) Mar 2023 (155) Feb 2023 (140) Jan 2023 (155) Dec 2022 (156) Nov 2022 (150) Oct 2022 (155) Sep 2022 (150) Aug 2022 (155) Jul 2022 (154) Jun 2022 (150) May 2022 (155) Apr 2022 (150) Mar 2022 (155) Feb 2022 (140) Jan 2022 (156) Dec 2021 (156) Nov 2021 (150) Oct 2021 (155) Sep 2021 (150) Aug 2021 (155) Jul 2021 (155) Jun 2021 (150) May 2021 (155) Apr 2021 (150) Mar 2021 (155) Feb 2021 (140) Jan 2021 (155) Dec 2020 (155) Nov 2020 (150) Oct 2020 (158) Sep 2020 (150) Aug 2020 (130) Jul 2020 (124) Jun 2020 (120) May 2020 (124) Apr 2020 (120) Mar 2020 (124) Feb 2020 (116) Jan 2020 (125) Dec 2019 (126) Nov 2019 (120) Oct 2019 (124) Sep 2019 (120) Aug 2019 (125) Jul 2019 (124) Jun 2019 (120) May 2019 (123) Apr 2019 (121) Mar 2019 (124) Feb 2019 (112) Jan 2019 (125) Dec 2018 (126) Nov 2018 (120) Oct 2018 (124) Sep 2018 (121) Aug 2018 (124) Jul 2018 (125) Jun 2018 (120) May 2018 (124) Apr 2018 (121) Mar 2018 (124) Feb 2018 (112) Jan 2018 (123) Dec 2017 (124) Nov 2017 (124) Oct 2017 (141) Sep 2017 (135) Aug 2017 (138) Jul 2017 (137) Jun 2017 (134) May 2017 (138) Apr 2017 (135) Mar 2017 (139) Feb 2017 (129) Jan 2017 (143) Dec 2016 (135) Nov 2016 (138) Oct 2016 (142) Sep 2016 (128) Aug 2016 (133) Jul 2016 (136) Jun 2016 (138) May 2016 (164) Apr 2016 (311) Mar 2016 (348) Feb 2016 (320) Jan 2016 (348) Dec 2015 (314) Nov 2015 (338) Oct 2015 (363) Sep 2015 (358) Aug 2015 (399) Jul 2015 (374) Jun 2015 (331) May 2015 (337) Apr 2015 (319) Mar 2015 (320) Feb 2015 (271) Jan 2015 (286) Dec 2014 (254) Nov 2014 (238) Oct 2014 (287) Sep 2014 (267) Aug 2014 (259) Jul 2014 (260) Jun 2014 (238) May 2014 (241) Apr 2014 (228) Mar 2014 (240) Feb 2014 (217) Jan 2014 (263) Dec 2013 (226) Nov 2013 (254) Oct 2013 (256) Sep 2013 (252) Aug 2013 (263) Jul 2013 (261) Jun 2013 (251) May 2013 (250) Apr 2013 (221) Mar 2013 (193) Feb 2013 (164) Jan 2013 (157) Dec 2012 (155) Nov 2012 (240) Oct 2012 (526) Sep 2012 (411) Aug 2012 (394) Jul 2012 (284) Jun 2012 (229) May 2012 (213) Apr 2012 (213) Mar 2012 (253) Feb 2012 (269) Jan 2012 (298) Dec 2011 (273) Nov 2011 (219) Oct 2011 (204) Sep 2011 (201) Aug 2011 (236) Jul 2011 (217) Jun 2011 (211) May 2011 (206) Apr 2011 (215) Mar 2011 (215) Feb 2011 (186) Jan 2011 (215) Dec 2010 (107) Nov 2010 (98) Oct 2010 (55)"}, {"id": "29167d1b-fdca-4951-ab33-02ec59a7b248", "title": "Video Shows Russian Tank Hit by Mine Finished Off by Drone", "date": "2024-06-18 06:45", "url": "https://www.kyivpost.com/post/34430", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "The exact location of the incident and the type of drone used to destroy the Russian tank were not specified and Kyiv Post was unable to independently verify the time and place of the footage.\nA video circulating on social media reportedly captures a Russian tank being blown up by a mine and then finished off with a well-aimed strike by a Ukrainian drone .\nThe video initially shows the tank detonating after hitting a mine, followed by a powerful explosion, apparently caused by a Ukrainian drone strike.\nThe value of new T-72 tank ranges from between $3 - 4 million, depending on the configuration, while an older Soviet T-72 can cost as little as half a million dollars.\nThe 68th Jaeger Brigade, a veteran formation of the War in Ukraine, previously shared a video showing the destruction of a Russian tank company in eastern Ukraine."}, {"id": "d3b1d5fd-128e-466a-bd23-aba331c09c7a", "title": "Petroleum storage tanks on fire in Russia Rostov Oblast", "date": "2024-06-18 03:45", "url": "https://www.yahoo.com/news/petroleum-storage-tanks-fire-russias-025309368.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Several oil storage tanks in the town of Azov in Russia's southwestern Rostov region caught fire overnight on June 18 following a drone strike, Vasily Golubev, the regional governor, said.\nThe town of Azov, situated 16 kilometers (9.9 miles) from the Azov Sea, is home to 81,924 people.\nRostov Oblast borders Ukraine to the southeast.\nOn June 14, a drone attack in the city of Morozovsk in Russia's Rostov Oblast caused a fire and disruptions to the local power supply.\nKyiv officials say these attacks are carried out to undermine Russia's military operations and retaliate against Moscow's strikes on Ukrainian energy infrastructure."}, {"id": "975bcf70-f26d-438a-81df-64cc9eab78ed", "title": "Report : North Korea Added 20 Nukes to Its Arsenal in 2023", "date": "2024-06-18 02:00", "url": "https://www.breitbart.com/politics/2024/06/17/report-north-korea-added-20-nukes-to-its-arsenal-in-2023/", "domain": "breitbart.com", "domain_classification": "Unknown", "message": "North Korea is believed to possess 50 nuclear weapons – 20 more than in the past year, the Stockholm International Peace Research Institute (SIPRI) revealed in its annual report published on Monday on global militaries.\nIn its section on North Korea, SIPRI warned that evidence suggests communist dictator Kim Jong-un is “putting new emphasis” on Pyongyang’s nuclear assets.\n“It also completed the development of at least two types of land-attack cruise missile (LACM) designed to deliver nuclear weapons.”In 2023, SIPRI estimated that North Korea possessed 30 assembled warheads.\nNorth Korea has not tested a nuclear weapon since 2017 but regularly threatens to use its nuclear weapons against South Korea, in which it is in a state of formal war halted only by an armistice agreement signed in 1953.\nSouth Korea reacted to the trash balloons by reinstalling massive loudspeakers in the Demilitarized Zone (DMZ) used to broadcast hours of content – including news of South Korea, political messages, and Korean pop music – to the North."}, {"id": "c15e69b5-ace6-46f4-971d-f50615c122e1", "title": "Woman wanted in connection to fatal April stabbing arrested , DC police say", "date": "2024-06-18 04:30", "url": "https://www.yahoo.com/news/woman-wanted-connection-fatal-april-014552884.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Woman wanted in connection to fatal April stabbing arrested, DC police sayWASHINGTON (DC News Now) — A woman who was wanted by the Metropolitan Police Department (MPD) for a fatal stabbing that happened in April was arrested Monday.\nOfficers responded to the 1300 block of Peabody Street NW just after 11:20 p.m. on April 5 after receiving reports of an unconscious person inside an apartment.\nShe was charged with First Degree Murder while Armed – Felony Murder.\nMPD said she would be extradited to Washington, D.C.\nFor the latest news, weather, sports, and streaming video, head to DC News Now | Washington, DC."}, {"id": "8730687e-584d-4e8c-8f38-f48d800c76d2", "title": "Taiwan keeping watch after Chinese submarine surfaces in Taiwan Strait | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-06-18 08:45", "url": "https://www.asahi.com/ajw/articles/15309918", "domain": "asahi.com", "domain_classification": "Unknown", "message": "(REUTERS)TAIPEI--Taiwan’s defense minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.\nThe narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defense Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan’s defense ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "050ca5df-2628-4046-aaa4-69959a8b9819", "title": "Sentry Aloha 24 - 2 : Joint Forces Showcase Advanced Combat Training", "date": "2024-06-18 08:00", "url": "https://theaviationist.com/2024/06/18/sentry-aloha-24-2-joint-forces-showcase-advanced-combat-training/", "domain": "theaviationist.com", "domain_classification": "Unknown", "message": "Exercise Sentry Aloha is a training drill hosted by the Hawaii Air National Guard’s 154th Wing.\nAircraft operations were conducted at various locations on the islands of Oahu, Hawaii, including Marine Corps Base Hawaii and Ellison Onizuka Kona International Airport at Keāhole.\nBlue Air fighters were employed in various scenarios, including protecting the A-10s during close air support operations in the Pohakuloa Training Area.\nCAS (Close Air Support) activities were managed by the airmen of the 25th Air Support Operations Squadron.\nit also provided an opportunity to develop specialized mission qualification training for participating fighter squadrons."}, {"id": "fa68fab5-0379-4182-86d9-ec086d5f055c", "title": "James Bond : 007 # 6 - Comic Book Preview", "date": "2024-06-18 06:30", "url": "https://www.flickeringmyth.com/comic-book-preview-james-bond-007-6-2/", "domain": "flickeringmyth.com", "domain_classification": "Unknown", "message": "Dynamite Entertainment releases James Bond: 007 #6 on Wednesday, and we have the official preview of the issue for you below; check it out…As time runs out for 007 to stop the deployment of the STALVODA compound, he does what any good agent would do when faced with hopeless odds — he calls in an airstrike!\nUnfortunately, there is still the small matter of being stuck at ground zero when it arrives… Meanwhile, the snake in the grass at MI6 finally reveals himself — but is it too late for Bond to do anything about it?\nFeaturing a suitably steely cover by DAVE JOHNSON (100 Bullets, Superman: Red Son, Deadpool) and iconic interiors by RAPHA LOBOSCO (James Bond: Black Box), the finale of “Your Cold, Cold Heart” marks a milestone for first-time Bond author GARTH ENNIS and caps off a decade of James Bond comics at Dynamite!\nJames Bond: 007 #6 goes on sale on June 19th, priced $4.99."}, {"id": "513fc536-2bb2-416d-a833-ed6bce59edbc", "title": "Killer Reveals Beheaded Tech CEO Last Words In Court", "date": "2024-06-18 03:00", "url": "https://dailycaller.com/2024/06/17/tyrese-haspil-fahim-saleh-ceo-last-words-court/", "domain": "dailycaller.com", "domain_classification": "Unknown", "message": "The suspect revealed the final words of the slain tech CEO in court Monday, New York Post reported.\nTyrese Haspil, 25, admitted to killing his former boss, tech CEO Fahim Saleh, during his Manhattan Supreme Court trial.\nHaspil, previously Saleh’s trusted protégé, described the July 2020 attack, according to the New York Post.\nI remember tasing him in the back,” Haspil recounted calmly, New York Post reported.\nHis defense is pushing for a downgraded charge of manslaughter, according to the New York Post."}, {"id": "ff3b2814-eb33-4161-8752-465f2e740ba6", "title": "Taiwan keeping watch after Chinese submarine surfaces in Taiwan Strait", "date": "2024-06-18 03:15", "url": "https://www.yahoo.com/news/taiwan-keeping-watch-chinese-submarine-025558775.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "The narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defence Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nMilitary experts say the strategic waters off Taiwan's southwestern shores, where the largely shallow Taiwan Strait descends in depth, provide submarines a location for an ambush, making it a hot spot for militaries including China, Taiwan and the United States.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "7d7c8486-b291-40b3-b010-ea1ec574da6c", "title": "Altered image falsely shared as  US aircraft carrier damaged by Huthi attack  ", "date": "2024-06-18 03:00", "url": "https://www.yahoo.com/news/altered-image-falsely-shared-us-023433648.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A satellite image of an aircraft carrier has been altered to add a crater to its flight deck and then shared in social media posts that presented it as evidence of damage caused by Yemen's Huthi rebels.\n\"The Eisenhower CVN-69 Nimitz-class aircraft carrier is said to have been attacked by the Huthi armed forces,\" read a simplified Chinese X post shared on June 3, 2024.\nSimilar posts sharing the manipulated imagery racked up over two million views after they were shared on X here and here, YouTube, and on Weibo.\nThe claim was also shared in English and Thai while AFP has previously debunked similar posts in Arabic.\nNo hole was visible in the deck of the ship in the Google Earth image."}, {"id": "9f8d1307-e999-4a08-a9bd-3bb24db6bac9", "title": "Taiwan keeping watch after Chinese submarine surfaces in Taiwan Strait", "date": "2024-06-18 08:00", "url": "https://economictimes.indiatimes.com/news/defence/taiwan-keeping-watch-after-chinese-submarine-surfaces-in-taiwan-strait/articleshow/111079026.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our Economic Times WhatsApp channelTAIPEI: Taiwan's defence minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.The narrow strait that separates Taiwan from China is a frequent source of tension.\n\"We must be fully alert to China's continued military harassment and grey zone threats and must always understand China's constant salami-slicing attempts to unilaterally change the status quo,\" Koo said.\n\"We must be alert at all times, but not panic nor be apathetic, and calmly deal with the situation in the strait,\" he added.\n\"We won't be the one provoking, and call on China not to be a troublemaker.\n\"Taiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "f84d0a9a-072b-45b7-a15e-e101f9b20000", "title": "Taiwan keeping watch after Chinese submarine surfaces in Taiwan Strait", "date": "2024-06-18 04:45", "url": "https://www.aol.com/taiwan-keeping-watch-chinese-submarine-025558557.html", "domain": "aol.com", "domain_classification": "Unknown", "message": "By Ben Blanchard and Yimou LeeTAIPEI (Reuters) -Taiwan's defence minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.\nThe narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defence Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "68a8bd17-72cb-4785-b5d0-6246d1aca951", "title": "Taiwan on High Alert : Chinese Nuclear Submarine Surfaces in Sensitive Strait", "date": "2024-06-18 09:15", "url": "https://www.devdiscourse.com/article/law-order/2986432-taiwan-on-high-alert-chinese-nuclear-submarine-surfaces-in-sensitive-strait", "domain": "devdiscourse.com", "domain_classification": "Unknown", "message": "Taiwan's defence minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.\nThe narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defence Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "161a2b68-1b1a-49aa-be69-e483ec61f9f0", "title": "For magistrates and judges , danger always lurks in the shadows", "date": "2024-06-18 03:30", "url": "https://nation.africa/kenya/news/for-magistrates-and-judges-danger-always-lurks-in-the-shadows--4661356", "domain": "nation.africa", "domain_classification": "Local - Africa", "message": "That a gun attack inside a courtroom was not far-fetched had been evident as late as four months earlier.\nHe is now a Supreme Court judge.\nWeeks earlier, Justice Mwilu and three Supreme Court judges had nullified that year’s presidential elections.\nJustice Nzioka was preparing a judicial report on the 2013 ethnic bloodletting in Tana River County, which implicated top police, political, intelligence and military officials in the mass murders.\nThe assassination of magistrates, judges and court officials, while rare in Kenya, is common in other countries, including the USA, India and Philippines."}, {"id": "ef838f81-158b-40e0-9585-f8699ca35703", "title": "First Visuals : Nikhil Gupta Extradited To US In Pannun  Murder  Plot Case", "date": "2024-06-18 04:45", "url": "https://www.timesnownews.com/world/us/us-news/first-visuals-nikhil-gupta-extradited-to-us-in-gurpatwant-singh-pannun-murder-plot-case-article-111070802", "domain": "timesnownews.com", "domain_classification": "Unknown", "message": "Visuals of Nikhil Gupta who was extradited to the US Photo : ANINew Delhi: The Czech Republic Police has released the visuals of Nikhil Gupta , an Indian national, being extradited to the United States for his alleged involvement in a murder-for-hire plot against Sikh extremist Gurpatwant Singh Pannun on American soil.\nGupta was extradited to the US on June 14 (Monday) from the Czech Republic following his arrest in Prague a year ago.\nCharges Against Nikhil GuptaAccording to authorities in the United States, Nikhil Gupta is said to have claimed involvement in the movement of international narcotics and trafficking.\nAuthorities in the Czech Republic arrested Gupta on June 30 this year in accordance with an extradition treaty between the US and the Czech Republic.\nThrough his attorney, Nikhil Gupta has also denied the charges and said he has been \"unfairly charged\"."}, {"id": "1191897a-b2a5-42cb-92da-daabcd0906b5", "title": "Mass shootings this weekend : Michigan splash pad shooting may or may not fit mass shooting definition , depending on who you ask", "date": "2024-06-18 00:30", "url": "https://abc7chicago.com/post/mass-shootings-weekend-michigan-splash-pad-shooting-may-not-fit-definition-depending/14966842/", "domain": "abc7chicago.com", "domain_classification": "Unknown", "message": "What is a mass shooting?\nThat depends on who you askThere are still misunderstandings about what constitutes a mass shooting and why.\nThere are still misunderstandings about what constitutes a mass shooting and why.\nThere are still misunderstandings about what constitutes a mass shooting and why.\nMore than two, simply in my view, would be a mass shooting,\" former longtime Orland Park Police Chief Tim McCarthy told the I-Team."}, {"id": "964d2e53-dc61-4fd3-960a-ea29281ea401", "title": "One man dead , another wounded in Staten Island knife fight", "date": "2024-06-18 01:15", "url": "https://www.nydailynews.com/2024/06/17/one-man-dead-another-wounded-in-staten-island-knife-fight/", "domain": "nydailynews.com", "domain_classification": "Unknown", "message": "One man was killed and another was wounded in a Staten Island knife fight Monday, police and sources said.\nThe men, ages 41 and 37, got into a fight at the corner of Broad and Gordon Sts.\nBoth men, armed with knives, took swipes at each other until eventually the older man was stabbed in the chest and the younger in the leg, sources said.\nMedics rushed the 41-year-old man to Staten Island University Hospital, but he could not be saved.\nThe younger man was taken to Richmond University Medical Center, where he was expected to survive his injuries."}, {"id": "710776c0-574a-436d-a9a1-0cebb3b7d37a", "title": "Taiwan keeping watch after Chinese submarine surfaces in Taiwan Strait", "date": "2024-06-18 04:00", "url": "https://gazette.com/news/us-world/taiwan-keeping-watch-after-chinese-submarine-surfaces-in-taiwan-strait/article_5e5f0b70-b880-51ad-8636-cd054b9a0a75.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "By Ben Blanchard and Yimou LeeTAIPEI (Reuters) -Taiwan's defence minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.\nThe narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defence Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "8e751d66-8081-4f48-bf42-2b4f3255b9a6", "title": "Woodstock woman accused of stabbing little brother guilty on all counts", "date": "2024-06-18 00:45", "url": "https://www.fox5atlanta.com/news/cherokee-county-woman-accused-stabbing-little-brother-guilty-all-counts", "domain": "fox5atlanta.com", "domain_classification": "Unknown", "message": "articleA Woodstock woman who was accused of stabbing her little brother so severely that she punctured his lung was found guilty on all counts.\nShe was charged with stabbing her brother in his left chest, abdomen and shoulder with a knife that she grabbed from her purse during an argument.\nWoodstock and Cherokee County officials provided lifesaving treatment for the teen who was rushed to the hospital with a punctured left lung.\nIt resulted in a collapsed lung, a lacerated blood vessel in the lung and bruising and lacerations to the lung.\nA Cherokee County jury heard from six witnesses from the State, including her brother, their mother, three law enforcement officers and the trauma surgeon, and one witness from the Defense, Williams."}, {"id": "e7383002-2f0f-485d-942f-97e89a2fec4e", "title": "Taiwan Keeping Watch After Chinese Submarine Surfaces", "date": "2024-06-18 05:15", "url": "https://www.marinelink.com/news/taiwan-keeping-watch-chinese-submarine-514549", "domain": "marinelink.com", "domain_classification": "Unknown", "message": "Taiwan's defence minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.\nThe narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defence Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "1ac8a911-7add-4676-a849-59e5a156143a", "title": "Putin hails N . Korea support for Ukraine war ahead of Pyongyang visit", "date": "2024-06-18 05:15", "url": "https://www.ewn.co.za/2024/06/18/putin-hails-n-koreas-support-for-ukraine-war-ahead-of-pyongyang-visit", "domain": "ewn.co.za", "domain_classification": "Unknown", "message": "SEOUL - Russian President Vladimir Putin on Tuesday hailed North Korea for \"firmly supporting\" Moscow's war in Ukraine ahead of a visit to Pyongyang set to boost defence ties between the two nuclear-armed countries.\nHistoric allies since North Korea's founding after World War II, Moscow and Pyongyang have drawn closer after Russia's invasion of Ukraine in 2022, with Putin increasingly isolated internationally and looking for friends.\nPutin's trip has triggered \"concern\" in Washington after the Pentagon said last month debris analysis proved North Korean ballistic missiles were already being fired on Ukraine's battlefields.\nBoth countries are under rafts on UN sanctions, Pyongyang since 2006 over banned nuclear and ballistic missile programs, and Moscow over the invasion of Ukraine.\n\"We know North Korean ballistic missiles are still being used to hit Ukrainian targets [and] there could be some reciprocity here that could affect security on the Korean peninsula,\" he said."}, {"id": "73adeeba-a3e8-41e9-bf1a-5644e6910948", "title": "Drone strike ignites oil depot fires in Russia Rostov region", "date": "2024-06-18 06:00", "url": "https://tribune.com.pk/story/2472255/drone-strike-ignites-oil-depot-fires-in-russias-rostov-region", "domain": "tribune.com.pk", "domain_classification": "Unknown", "message": "Several oil storage tanks caught fire following a drone attack early Tuesday in Azov, a town located in Russia's southern Rostov region.\nVasily Golubev, the governor of Rostov region adjacent to Ukraine, stated on Telegram that initial reports indicate no casualties.\nThe Russian Ministry of Emergency Situations reported on Telegram that the fire had spread over an area of 5,000 cubic meters.\nUkraine, which lacks the vast arsenal of missiles available to Moscow, has focused on making long-range drones to strike targets deep inside Russia.\nUkraine has recently increased the frequency of its attacks on Russian soil, particularly against oil refineries."}, {"id": "b732c364-f0e3-4822-a559-8899bb3bb2a7", "title": "Highly anticipated thriller  No Way Out : The Roulette  set to premiere on July 31", "date": "2024-06-18 06:15", "url": "https://www.allkpop.com/article/2024/06/highly-anticipated-thriller-no-way-out-the-roulette-set-to-premiere-on-july-31", "domain": "allkpop.com", "domain_classification": "Unknown", "message": "Featuring a stellar cast including Cho Jin-Woong, Yoo Jae Myung, Kim Moo Yeol, Yum Jung Ah, Sung Yoo Bin, Greg Hsu, Lee Kwang Soo, and Kim Sung Cheol, the highly anticipated mystery thriller 'No Way Out: The Roulette' is set to premiere on Wednesday, July 31 KST.\n'No Way Out: The Roulette' centers around a fierce battle triggered by a 20 billion won bounty placed on the life of notorious criminal Kim Guk Ho, who has just been released after 13 years.\nThe drama promises to depict an intense, inescapable struggle among those desperate to claim the reward.\nThe newly released teaser poster captivates with its depiction of the nationwide bounty, highlighting a flyer featuring Kim Guk Ho's face amidst scattered money, with the chilling message, \"Kill the heinous criminal Kim Guk Ho!\"\n'No Way Out: The Roulette,' with its unprecedented cast and bold theme of a nationwide assassination contract, promises to deliver unpredictable plot twists and intense genre thrills, making it one of the most highly anticipated series of 2024."}, {"id": "6989a0ea-f1ef-4ef6-b4c8-9a28258c3cab", "title": "GA woman convicted of stabbing 17 - year - old brother during argument in 2022", "date": "2024-06-18 02:45", "url": "https://www.yahoo.com/news/ga-woman-convicted-stabbing-17-015800203.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "GA woman convicted of stabbing 17-year-old brother during argument in 2022A Cherokee County jury convicted a Woodstock woman of stabbing her younger brother in 2022.\nA jury deliberated about four hours before convicting Taeja Janae Williams on Friday, June 14.\n[DOWNLOAD: Free WSB-TV News app for alerts as news breaks]On Dec. 21, 2022, Woodstock police responded to a 911 call reporting a stabbing.\nOfficers determined that following a verbal argument inside their home, Williams, then age 20, stabbed her brother, then age 17, in his left chest, left abdomen, and left shoulder.\nThe jury viewed 48 exhibits, including the knife and other physical evidence, plus photos taken during the investigation."}, {"id": "6285835e-e49a-44e3-a605-803393293d0d", "title": "Man pleads guilty to stabbing bodyboarder at Pacific Palms | The Scone Advocate", "date": "2024-06-18 03:15", "url": "https://www.sconeadvocate.com.au/story/8666285/man-pleads-guilty-to-stabbing-bodyboarder-at-pacific-palms/?cs=305", "domain": "sconeadvocate.com.au", "domain_classification": "Unknown", "message": "Billy Jo James Brown, 36, was expected to face a trial in Taree District Court this week after he pleaded not guilty to causing grievous bodily harm with intent over the stabbing of Mr Duck at a holiday park on the Lakes Way just after midnight on November 28."}, {"id": "e41eaf96-524c-499c-a1a9-ab9ad934dc8f", "title": "Man pleads guilty to stabbing bodyboarder at Pacific Palms | Newcastle Herald", "date": "2024-06-18 05:00", "url": "https://www.newcastleherald.com.au/story/8666285/man-pleads-guilty-to-stabbing-bodyboarder-at-pacific-palms/?cs=305", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "Billy Jo James Brown, 36, was expected to face a trial in Taree District Court this week after he pleaded not guilty to causing grievous bodily harm with intent over the stabbing of Mr Duck at a holiday park on the Lakes Way just after midnight on November 28."}, {"id": "171ec55a-73f7-45b4-b467-8d2cdfaa72cd", "title": "Man pleads guilty to stabbing bodyboarder at Pacific Palms | Newcastle Herald", "date": "2024-06-18 02:00", "url": "https://www.newcastleherald.com.au/story/8666285/man-pleads-guilty-to-stabbing-bodyboarder-at-pacific-palms/", "domain": "newcastleherald.com.au", "domain_classification": "Unknown", "message": "Billy Jo James Brown, 36, was expected to face a trial in Taree District Court this week after he pleaded not guilty to causing grievous bodily harm with intent over the stabbing of Mr Duck at a holiday park on the Lakes Way just after midnight on November 28."}, {"id": "0e057c23-6788-4329-a94a-5f4996fe9eac", "title": "Man pleads guilty to stabbing bodyboarder at Pacific Palms | Great Lakes Advocate", "date": "2024-06-18 03:00", "url": "https://www.greatlakesadvocate.com.au/story/8666285/man-pleads-guilty-to-stabbing-bodyboarder-at-pacific-palms/?cs=305", "domain": "greatlakesadvocate.com.au", "domain_classification": "Unknown", "message": "Billy Jo James Brown, 36, was expected to face a trial in Taree District Court this week after he pleaded not guilty to causing grievous bodily harm with intent over the stabbing of Mr Duck at a holiday park on the Lakes Way just after midnight on November 28."}, {"id": "05cc2f45-381c-4e1a-b899-088b5ef7289e", "title": "Man pleads guilty to stabbing bodyboarder at Pacific Palms | Muswellbrook Chronicle", "date": "2024-06-18 03:00", "url": "https://www.muswellbrookchronicle.com.au/story/8666285/man-pleads-guilty-to-stabbing-bodyboarder-at-pacific-palms/?cs=305", "domain": "muswellbrookchronicle.com.au", "domain_classification": "Unknown", "message": "Billy Jo James Brown, 36, was expected to face a trial in Taree District Court this week after he pleaded not guilty to causing grievous bodily harm with intent over the stabbing of Mr Duck at a holiday park on the Lakes Way just after midnight on November 28."}, {"id": "6d93c53a-160f-4aa9-9122-ed8601dd34c6", "title": "Man pleads guilty to stabbing bodyboarder at Pacific Palms | The Singleton Argus", "date": "2024-06-18 02:45", "url": "https://www.singletonargus.com.au/story/8666285/man-pleads-guilty-to-stabbing-bodyboarder-at-pacific-palms/?cs=305", "domain": "singletonargus.com.au", "domain_classification": "Unknown", "message": "Billy Jo James Brown, 36, was expected to face a trial in Taree District Court this week after he pleaded not guilty to causing grievous bodily harm with intent over the stabbing of Mr Duck at a holiday park on the Lakes Way just after midnight on November 28."}, {"id": "b65e8a5f-d734-4ca9-95f9-e6128a44f241", "title": "Man pleads guilty to stabbing bodyboarder at Pacific Palms | Camden Haven Courier", "date": "2024-06-18 04:30", "url": "https://www.camdencourier.com.au/story/8666285/man-pleads-guilty-to-stabbing-bodyboarder-at-pacific-palms/?cs=305", "domain": "camdencourier.com.au", "domain_classification": "Unknown", "message": "Billy Jo James Brown, 36, was expected to face a trial in Taree District Court this week after he pleaded not guilty to causing grievous bodily harm with intent over the stabbing of Mr Duck at a holiday park on the Lakes Way just after midnight on November 28."}, {"id": "97173f7b-3344-46f6-9e5d-cf43c11df185", "title": "  Will pursue his defence vigorously , ensure he receives full due process : US Attorney of Pannun  murder plot  accused Nikhil Gupta – Indian Defence Research Wing", "date": "2024-06-18 05:00", "url": "https://idrw.org/will-pursue-his-defence-vigorously-ensure-he-receives-full-due-process-us-attorney-of-pannun-murder-plot-accused-nikhil-gupta/", "domain": "idrw.org", "domain_classification": "Unknown", "message": "Nikhil Gupta has been accused by US federal prosecutors of plotting with an Indian government official to kill Gurpatwant Singh Pannun.\nNew Delhi has firmly dissociated itself from the plot against Pannun, saying it is against Indian government’s policy.\nIn November last year, US Justice Department officials announced charges against Gupta after he was arrested in June 2023 in the Czech Republic.\nThe purported hitman was offered USD 100,000 to murder the separatist leader, the Justice Department claimed.\nThe charges contained in the indictment are merely accusations, and the defendant is presumed innocent unless and until proven guilty, the Justice Department stated in a release."}, {"id": "ed1355a9-04a3-4f9e-8646-fa7003bdc619", "title": "Nikhil Gupta : Indian Accused In Khalistani Terrorist Murder Plot Produced In US Court", "date": "2024-06-18 03:45", "url": "https://www.ndtv.com/india-news/nikhil-gupta-indian-charged-in-khalistani-terrorist-case-pleads-not-guilty-in-us-court-5912640", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Gupta was produced before a federal court in New York on Monday, where he pleaded not guilty, according to his attorney, Jeffrey Chabrowe.\nFederal prosecutors alleged that CC-1 recruited Gupta in May 2023 to orchestrate the assassination in the US.\nCC-1 subsequently agreed, in dealings brokered by Gupta, to pay the UC USD 1,00,000 to murder the victim.\nAround June 20, 2023, CC-1 sent Gupta a news article about the victim and messaged him \"(i)t's (a) priority now\", the prosecutors alleged.\nIndia has publicly said a high-level inquiry is looking into the evidence shared by the US in the alleged plot to kill Pannun."}, {"id": "d0f1f6e7-5e01-44e9-b0a6-20df0020bcc4", "title": "Court documents show that a man accused of repeatedly stabbing a pregnant woman in Mira Mesa over the weekend has drug and mental health problems . San Diego police have arrested Cole Klemke , 27 , for attacking the 25 - year - old woman , who he did...", "date": "2024-06-18 02:45", "url": "https://www.nbcsandiego.com/news/man-who-stabbed-pregnant-woman-has-history-of-drug-mental-health-issues-court-docs/3543461/", "domain": "nbcsandiego.com", "domain_classification": "Unknown", "message": "Court documents show that a San Diego man accused of repeatedly stabbing a pregnant woman in Mira Mesa over the weekend has drug and mental health problems.\nGet San Diego local news, weather forecasts, sports and lifestyle stories to your inbox.\nSign up for NBC San Diego newsletters.\n(San Diego Police Department)San Diego resident Johanus Porter said he remains alert whenever he's out in public.\nSan Diego police received a recording from a camera late Monday afternoon."}, {"id": "8438244b-369b-4796-9eec-4a9e830f3ed1", "title": "Nikhil Gupta , accused in plot to kill Sikh separatist Pannun , pleads not guilty in US court", "date": "2024-06-18 02:00", "url": "https://www.dnaindia.com/world/report-nikhil-gupta-accused-in-plot-to-kill-sikh-separatist-pannun-pleads-not-guilty-in-us-court-3093782", "domain": "dnaindia.com", "domain_classification": "Unknown", "message": "Nikhil Gupta, accused in plot to kill Sikh separatist Pannun, pleads not guilty in US courtWhile speaking to reporters, Gupta's US-based lawyer, attorney Jeffrey Chabrowe said that they would file a bail application at a later date, meaning Gupta will continue to be detained for now.\nIndian national Nikhil Gupta, suspected by the US of involvement in an unsuccessful plot to kill the India-designated pro-Khalistani terrorist Gurpatwant Singh Pannun on American soil pleaded not guilty on Monday (local time) at a federal court in the US.\nGupta arrived at the Manhattan Federal Courthouse in New York City at 12:30 PM (local time) and has pleaded not guilty in court.\nNikhil Gupta has been accused by US federal prosecutors of plotting with an Indian government official to kill Gurpatwant Singh Pannun.\nNew Delhi has firmly dissociated itself from the plot against Pannun, saying it is against the Indian government's policy."}, {"id": "48ac96c0-88bc-4e30-b645-7316a730812e", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 05:15", "url": "https://www.bostonglobe.com/2024/06/17/world/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-second-time-this-month/", "domain": "bostonglobe.com", "domain_classification": "Unknown", "message": "It said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South’s military observed increased North Korean construction activities along their heavily armed border to install suspected anti-tank barriers, reinforce roads and plant land mines.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nAdvertisementThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "8c6a25ce-1a9f-4c5a-9b84-f9287826753a", "title": "Hamas is devolving from a terror army to a guerilla force", "date": "2024-06-18 04:00", "url": "http://www.israelnationalnews.com/news/391700", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "“Hamas has no chance of standing against the IDF’s power on the battlefield, and therefore shifted to guerrilla tactics,” he said.\nFrom these hiding spots, said Inbar, Hamas fighters launch attacks on Israeli forces, aiming to inflict casualties and avoid direct confrontation.\nHamas is employing classic, age-old tactics of guerilla warfare,” Roggio said.\nThis depletion has forced Hamas to adapt its strategy, avoiding prolonged skirmishes with Israeli forces and instead focusing on hit-and-run attacks, according to the report.\nPeter Lerner, a spokesperson for the IDF, noted in the report that the IDF is adapting to Hamas’s transformation."}, {"id": "fdce29b4-04ab-40fb-a8c2-cfda2d6282fa", "title": "Hamas is devolving from a terror army to a guerilla force", "date": "2024-06-18 06:30", "url": "https://www.israelnationalnews.com/news/391700", "domain": "israelnationalnews.com", "domain_classification": "Unknown", "message": "“Hamas has no chance of standing against the IDF’s power on the battlefield, and therefore shifted to guerrilla tactics,” he said.\nFrom these hiding spots, said Inbar, Hamas fighters launch attacks on Israeli forces, aiming to inflict casualties and avoid direct confrontation.\nHamas is employing classic, age-old tactics of guerilla warfare,” Roggio said.\nThis depletion has forced Hamas to adapt its strategy, avoiding prolonged skirmishes with Israeli forces and instead focusing on hit-and-run attacks, according to the report.\nPeter Lerner, a spokesperson for the IDF, noted in the report that the IDF is adapting to Hamas’s transformation."}, {"id": "8ed7e5b0-fbb6-45a5-bbfc-6a6d41f51472", "title": "South Korean soldiers fire warning shots after North Korean troops", "date": "2024-06-18 04:30", "url": "https://apnews.com/article/north-korea-south-korea-border-tensions-warning-shots-2aa0eaef30dbc5801d5e787205b577a0", "domain": "apnews.com", "domain_classification": "International", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe work has gone on uninterrupted despite several explosions caused by mines that killed or injured an unspecified number of North Korean soldiers, said the South’s Joint Chiefs of Staff.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "469bbe7d-8909-4865-824a-d4afcdca12c1", "title": "South Korean Soldiers Fire Warning Shots after North Korean Troops Intrude for 2nd Time This Month", "date": "2024-06-18 07:00", "url": "https://www.newsmax.com/world/globaltalk/north-korea-south-korea-border-tensions-warning-shots/2024/06/18/id/1169098/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activities after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nThe Joint Chiefs of Staff said that Tuesday’s incident occurred in a different area along the central frontline region.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "2fc7f578-a38f-4130-824d-672e5b51bb0c", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 08:15", "url": "https://www.newsday.com/news/nation/north-korea-south-korea-border-tensions-warning-shots-x16337", "domain": "newsday.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire.\nSouth Korean soldiers fired warning shots after North Korean troops briefly violated the tense border earlier this week, South Korea's military said Tuesday, as the rivals are embroiled in Cold War-style campaigns like balloon launches and propaganda broadcasts."}, {"id": "0930689c-2bfa-4cfd-87ef-9c3ab9c1bb22", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:15", "url": "https://www.news4jax.com/news/world/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "In this undated photo provided on Tuesday, June 18, 2024, by South Korea Defense Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(South Korea Defense Ministry via AP)SEOUL – South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "b9164ad9-cec7-48fb-bfea-3983de078efb", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 06:00", "url": "https://www.theweek.in/wire-updates/international/2024/06/18/fgn15-koreas-ld-tensions.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Seoul, Jun 18 (AP) South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border on Tuesday for the second time this month, South Korea's military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South's military didn't spot any suspicious activities after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nThe Joint Chiefs of Staff said that Tuesday's incident occurred in a different area along the central frontline region.\nIt said it doesn't believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "7175a2e0-ffe3-401d-8deb-a84ec428381f", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:30", "url": "https://www.smdailyjournal.com/news/world/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this/article_cd05d3f8-f236-57f6-a3ab-0a29d3055957.html", "domain": "smdailyjournal.com", "domain_classification": "Unknown", "message": "Premium SubscriptionAs low as $8.25 per weekPremium Includes:-- Access to the Daily Journal’s e-Edition: a digital replica of our daily newspaper including crossword puzzles, games, comics, classifieds and ads.\nYou can download a digital replica of the Daily Journal for offline reading.\nYou can also clip & download articles or images from the e-edition to share with others The most recent 90 issues are available at any given time.\n-- Unlimited access to our award-winning online content-- Commenting access on all stories as a valued member of the DJ community-- NEW!\nAccess to our online-only digital crossword puzzle."}, {"id": "7b36aae2-a97e-48b7-b1fa-bbe62d106062", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for second time this month", "date": "2024-06-18 04:15", "url": "https://www.theglobeandmail.com/world/article-south-korean-soldiers-fire-warning-shots-after-north-korean-troops/", "domain": "theglobeandmail.com", "domain_classification": "Local - Americas", "message": "South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activities after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nThe Joint Chiefs of Staff said that Tuesday’s incident occurred in a different area along the central front line region.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "ad835905-b1b1-44e6-aa63-646bb2cf4a14", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 06:45", "url": "https://www.ksat.com/news/world/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/", "domain": "ksat.com", "domain_classification": "Unknown", "message": "In this undated photo provided on Tuesday, June 18, 2024, by South Korea Defense Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(South Korea Defense Ministry via AP)SEOUL – South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "1a83b479-3227-42e1-8dea-c76895da7ede", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 05:30", "url": "https://www.local10.com/news/world/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/", "domain": "local10.com", "domain_classification": "Unknown", "message": "In this undated photo provided on Tuesday, June 18, 2024, by South Korea Defense Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(South Korea Defense Ministry via AP)SEOUL – South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "802890fb-934f-4b77-ba23-6727b22faee3", "title": "US aircraft carrier captain playfully counters Houthi false online claims of hitting his ship | News , Sports , Jobs", "date": "2024-06-18 03:15", "url": "https://www.mauinews.com/wire/?category=5187&ID=329141", "domain": "mauinews.com", "domain_classification": "Unknown", "message": "The Houthis and social media accounts supporting them repeatedly have falsely claimed they hit or even sank the carrier in the Red Sea.\nWhile on board for about a day and a half, journalists escorted by sailors crisscrossed the nuclear-powered ship’s 1,092-foot (332-meter) length.\n“The whole intent of the social media outreach was to connect with families, to bring them closer to the ship,” Hill said.\n“My sailors, my ships are priceless — that’s not a calculus I want a captain to have,” said Capt.\nBut Hill said his sailors remained ready to fight and he remained ready to continue to captain in his style."}, {"id": "71539ebb-7559-49df-bba6-68feb020e70b", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 06:30", "url": "https://www.clickorlando.com/news/world/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/", "domain": "clickorlando.com", "domain_classification": "Unknown", "message": "In this undated photo provided on Tuesday, June 18, 2024, by South Korea Defense Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(South Korea Defense Ministry via AP)SEOUL – South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "65598ac8-4220-41b0-9cd7-59df178ce47f", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 05:30", "url": "https://isp.netscape.com/news/world/story/0001/20240618/2aa0eaef30dbc5801d5e787205b577a0", "domain": "isp.netscape.com", "domain_classification": "Unknown", "message": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this monthSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe work has gone on uninterrupted despite several explosions caused by mines that killed or injured an unspecified number of North Korean soldiers, said the South’s Joint Chiefs of Staff.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "aaf97236-20b0-4f63-be62-7f663b1a6711", "title": "How many F - 35s to buy ? Draft defense bills disagree", "date": "2024-06-18 00:45", "url": "https://www.defensenews.com/air/2024/06/17/how-many-f-35s-to-buy-draft-defense-bills-disagree/", "domain": "defensenews.com", "domain_classification": "Unknown", "message": "The Air Force’s FY25 budget proposal requested money to buy 42 F-35As, and the Navy and Marine Corps budgets would buy 13 F-35Bs and 13 F-35Cs.\nThe House’s version of the NDAA would drastically slash F-35 purchases, cutting the initial order down to 58.\nThe Air Force said those older Block 20 F-22s are not combat-capable and would cost too much to prepare for a fight.\nHe previously covered leadership and personnel issues at Air Force Times, and the Pentagon, special operations and air warfare at Military.com.\nHe has traveled to the Middle East to cover U.S. Air Force operations."}, {"id": "7cfce01a-659f-4cca-85ed-30dcd2df6dcf", "title": "Taiwan military drones unlikely to hasten US  hellscape  against mainland Chinese attack", "date": "2024-06-18 06:45", "url": "https://www.scmp.com/news/china/politics/article/3267023/taiwan-drones-unlikely-hasten-us-hellscape-against-mainland-chinese-attack", "domain": "scmp.com", "domain_classification": "Local - Asia", "message": "The report said private contractors will provide second-generation short-range uncrewed aerial vehicles (UAVs), as well as miniature, target acquisition, surveillance, ship-based and land-based drones for military use.\nTaiwanese soldiers deploy an unmanned aerial vehicle during a drill simulating defence of an attack from the Chinese mainland.\nAccording to Lu, Taiwan is intensifying its efforts to keep pace with the mainland and the US, both of which are extensively using UAVs.\nBeijing regards Taiwan as part of China, to be reunited with the mainland by force, if necessary.\n“The military will continue to acquire various types of drones through multiple channels to rapidly build combat capabilities for defence operations,” he said."}, {"id": "105a304d-251e-4371-b2d9-fe1d874063d6", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 03:30", "url": "https://www.yahoo.com/news/south-korean-soldiers-fire-warning-030408052.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "A North Korean military guard post is seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(AP Photo/Ahn Young-joon)SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "7fce34b0-1186-4e9e-8df6-b99ddfa39ca4", "title": "South Korean Soldiers Fire Warning Shots After North Korean Troops Intrude for 2nd Time This Month", "date": "2024-06-18 04:30", "url": "https://www.news18.com/world/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month-8935837.html", "domain": "news18.com", "domain_classification": "Unknown", "message": "South Korean soldiers on Tuesday fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activities after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire.\nThe South’s military said it has been observing increased North Korean construction activity in frontline border areas, such as installing suspected anti-tank barriers, reinforcing roads and planting land mines."}, {"id": "6e4bd1bd-f288-4bf2-bd1b-aedf4577cd0b", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:15", "url": "https://www.voanews.com/a/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/7660116.html", "domain": "voanews.com", "domain_classification": "Unknown", "message": "\"Dozens of North Korean troops crossed the Military Demarcation Line today... (and) retreated northwards after warning shots\" were fired, a JCS official said.\nNorth Korean soldiers tasked with reinforcing the border had suffered \"multiple casualties from repeated landmine explosion incidents\" but they \"appear to be recklessly pressing ahead with the operations,\" the official said.\n\"North Korea's activities seem to be a measure to strengthen internal control, such as blocking North Korean troops and North Koreans from defecting to the South,\" the JCS official said.\n\"North Korea is not laying mines across the entire frontline, but rather in areas that are easily observable by the South.\nAhn Chan-il, a defector-turned-researcher who runs the World Institute for North Korea Studies, told AFP that the North Korean military was trying to survey the border area to install more barriers."}, {"id": "3bb70363-e361-486a-a9fc-338c871b3878", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 03:30", "url": "https://www.startribune.com/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/600374230/", "domain": "startribune.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nThe work has gone on uninterrupted despite several explosions caused by mines that killed or injured an unspecified number of North Korean soldiers, said the South's Joint Chiefs of Staff.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South's military didn't spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn't believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "e26e8f44-324a-4e66-8be8-6913637d721f", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 03:45", "url": "https://www.clickondetroit.com/news/world/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/", "domain": "clickondetroit.com", "domain_classification": "Unknown", "message": "In this undated photo provided on Tuesday, June 18, 2024, by South Korea Defense Ministry, North Korean soldiers work at an undisclosed location near the border area, as seen from a South Korean guard area.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(South Korea Defense Ministry via AP)SEOUL – South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "eaf613d5-c331-4717-a467-61c29bb687b0", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month | iNFOnews", "date": "2024-06-18 05:45", "url": "https://infotel.ca/newsitem/as-koreas-tensions/cp1699135774", "domain": "infotel.ca", "domain_classification": "Unknown", "message": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this monthVisitors gather to watch North Korean side from the Unification Observation Post in Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(AP Photo/Ahn Young-joon)Original Publication Date June 17, 2024 - 8:06 PMSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "4f831461-b6a2-4ebf-9dda-d8def94ef2e2", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month – Winnipeg Free Press", "date": "2024-06-18 03:45", "url": "https://www.winnipegfreepress.com/world/2024/06/17/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month", "domain": "winnipegfreepress.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nA North Korean military guard post is seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nA North Korean military guard post, top, and a South Korean post, bottom, are seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said."}, {"id": "811d152d-837d-4204-bbcc-d98c83ac37ce", "title": "Taiwan President Tells Military Cadets to Be Ready to Defend Island Sovereignty", "date": "2024-06-18 03:00", "url": "https://www.theepochtimes.com/china/taiwan-president-tells-military-cadets-to-be-ready-to-defend-islands-sovereignty-5670037", "domain": "theepochtimes.com", "domain_classification": "Unknown", "message": "‘Only with sovereignty can there be a country, and only with Taiwan can there be the Republic of China,’ Taiwanese President Lai Ching-te said.\n“The highest mission is to bravely shoulder the important responsibility of protecting Taiwan and maintaining peace and stability across the Taiwan Strait,” President Lai said.\nThe ROC Military Academy, previously known as the Whampoa Military Academy, was founded in China on June 16, 1924.\nIn his speech, President Lai pledged to strengthen the island’s national defense, continue pushing for defense reform, and improve the military’s combat effectiveness.\n“We reaffirm that maintaining peace and stability across the Taiwan Strait is indispensable to international security and prosperity."}, {"id": "800c5c34-a559-4963-8de6-d5b4cf65e0d6", "title": "South Korea fires warning shots after North Korea soldiers cross border", "date": "2024-06-18 04:00", "url": "https://timesofindia.indiatimes.com/world/rest-of-world/south-korean-fires-warning-shots-after-north-korean-soldiers-cross-border/articleshow/111071797.cms", "domain": "timesofindia.indiatimes.com", "domain_classification": "Local - Asia", "message": "South Korean forces fired warning shots after North Korean troops breached the heavily guarded military demarcation line close to the border on Tuesday, according to a report from the Yonhap news agency which cited information from the country's Joint Chiefs of Staff.\nSouth Korean soldiers responded by broadcasting warnings and firing warning shots, prompting the North Korean soldiers to retreat.\nFollowing the incident, the South's military did not observe any further suspicious activities.This incident follows a similar incident that occurred on June 11, when South Korean soldiers fired warning shots to deter another group of North Korean soldiers who briefly crossed the MDL.\nAccording to the Joint Chiefs of Staff, Tuesday's incident took place in a different area along the central frontline region.\nThe South's military believes that the North Korean soldiers did not intentionally intrude across the border, and the North did not return fire.In recent weeks, the South's military has observed an increase in North Korean construction activity along the frontline border areas."}, {"id": "ff6ac7e8-567c-4cfa-a0f0-e3b7a690f461", "title": "SKorea soldiers fire shots after NKorea troops intrude", "date": "2024-06-18 05:30", "url": "https://www.canberratimes.com.au/story/8666684/skorea-soldiers-fire-shots-after-nkorea-troops-intrude/?cs=14232", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "The South also fired warning shots last Tuesday after another group of North Korean soldiers briefly crossed the MDL.\nThe Joint Chiefs of Staff said that Tuesday's incident occurred in a different area along the central frontline region.\nIt said it doesn't believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "01818074-ba57-4c86-9122-f8339fb008e2", "title": "UK Conservative Party braces for brutal civil war", "date": "2024-06-18 03:45", "url": "https://www.politico.eu/article/uk-general-election-conservative-party-tories-rishi-sunak-successor/", "domain": "politico.eu", "domain_classification": "Unknown", "message": "Some activists fear the prospect of a Donald Trump-style takeover by radically-minded right-wingers sympathetic to the upstart Nigel Farage, leader of the rival Reform UK party.\nOthers speculate that an electoral collapse on this scale could threaten the very existence of the near-200-year-old Conservative Party.\nThat means the coming battle to pick Sunak’s successor will be one which defines the Conservatives’ future for years to come.\n“The stakes couldn’t be higher,” said Tim Bale, professor of politics at Queen Mary University London, and author of “The Conservative Party after Brexit.”“The contest between the two sides has the potential to really catch fire.”Under current party rules it will be down to those remaining Tory MPs who manage to hold onto their seats on July 4 to whittle down the various leadership candidates to a shortlist of two, before grassroots party members pick the winner in a final head-to-head ballot.\nThat gives Tory MPs an outsized role in shaping the party’s future — meaning that exactly who keeps their seat at the election, and who fails to do so, will be key to the outcome."}, {"id": "f1f53844-2b88-4539-a30e-0112543e7889", "title": "US Navy showcases Sea Hunter Unmanned Surface Vehicle at LA Fleet Week", "date": "2024-06-18 04:00", "url": "https://seapowermagazine.org/us-navy-showcases-sea-hunter-unmanned-surface-vehicle-at-la-fleet-week/", "domain": "seapowermagazine.org", "domain_classification": "Unknown", "message": "By Program Executive Office Unmanned and Small Combatants (PEO USC) Public AffairsLOS ANGELES — The U.S. Navy showcased Sea Hunter, part of the U.S. Navy’s unmanned surface vehicles (USV) prototype fleet, during Los Angeles Fleet Week, May 22-27.\n“We welcomed the opportunity to showcase Sea Hunter at this year’s LA Fleet Week and to highlight our work in unmanned technology,” said Capt.\nMatthew Lewis, program manager of the Unmanned Maritime Systems program office.\nLast August, Sea Hunter was one of four USV prototypes to operate in Integrated Battle Program 23.2, the Navy’s third multi-domain unmanned capabilities exercise.\nDuring the exercise, Sea Hunter and three additional USVs transited to Japan and Australia for testing, operations with manned warships and experiments with advanced payloads."}, {"id": "006a6535-cf1b-40cd-9835-4220a915d713", "title": "South Korea Fires Warning Shots after North Korean Troops Intrude", "date": "2024-06-18 08:00", "url": "https://time.com/6989649/south-north-korea-fire-warning-shots-border-tensions/", "domain": "time.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe South’s military observed increased North Korean construction activities along their heavily armed border to install suspected anti-tank barriers, reinforce roads and plant land mines.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nRead More: Why China, Russia, and North Korea Joining Forces in the Indo-Pacific Isn’t a Prelude to WarThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "409137ef-4adc-49cf-9056-4f6c956ec3fb", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month – Brandon Sun", "date": "2024-06-18 04:45", "url": "https://www.brandonsun.com/world/2024/06/17/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month", "domain": "brandonsun.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nA North Korean military guard post is seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nA North Korean military guard post, top, and a South Korean post, bottom, are seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said."}, {"id": "2ea6c1be-7e30-4b4b-baaa-a96acc80c3d0", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:45", "url": "https://www.pentictonherald.ca/news/world_news/article_de5a7c0a-ceb8-5d62-9f55-2e9d5a0679fe.html", "domain": "pentictonherald.ca", "domain_classification": "Unknown", "message": "We're always interested in hearing about news in our community.\nLet us know what's going on!"}, {"id": "d4e9ca62-9c23-4329-8d37-7955fdc79e96", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:45", "url": "https://www.airdriecityview.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month-9098278", "domain": "airdriecityview.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe work has gone on uninterrupted despite several explosions caused by mines that killed or injured an unspecified number of North Korean soldiers, said the South’s Joint Chiefs of Staff.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "ad734bbd-fddd-44e7-9150-378896492f36", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:15", "url": "https://toronto.citynews.ca/2024/06/17/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month/", "domain": "toronto.citynews.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe work has gone on uninterrupted despite several explosions caused by mines that killed or injured an unspecified number of North Korean soldiers, said the South’s Joint Chiefs of Staff.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "f2e937ac-2009-44cd-b618-bd09cf73cd0e", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:15", "url": "https://www.tricitynews.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month-9098283", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "976c76df-5dea-4e9f-bf20-9696e5e0b56e", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:15", "url": "https://www.newwestrecord.ca/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month-9098283", "domain": "newwestrecord.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "e265f358-7dbd-4577-912c-8b52a533b3d9", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:00", "url": "https://www.richmond-news.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month-9098283", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "bba591bd-1e94-448a-b86d-dc905dec21e6", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:30", "url": "https://www.stalbertgazette.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-2nd-time-this-month-9098278", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe work has gone on uninterrupted despite several explosions caused by mines that killed or injured an unspecified number of North Korean soldiers, said the South’s Joint Chiefs of Staff.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "c9e0c967-4e8a-49d0-ac82-e025bf1e79ec", "title": "Why the Royal Newfoundland Regiment was  so lucky  to have Padre Thomas Nangle", "date": "2024-06-18 09:15", "url": "https://www.cbc.ca/player/play/video/9.6424924", "domain": "cbc.ca", "domain_classification": "Unknown", "message": "Why the Royal Newfoundland Regiment was ‘so lucky’ to have Padre Thomas NangleNewsDuration 1:23Thomas Nangle was a priest in St. John’s who ministered to many of the same men with whom would later head into battle.\nBut historian Gary Browne says Nangle’s greatest act of service may have come after the war.\nOn June 25, CBC will air a special documentary about Newfoundland’s National War Memorial.\nIn this excerpt, Browne speaks about Nangle’s heroism."}, {"id": "24e41ac7-d638-4110-85dd-2788ebe6a449", "title": "Indian Astrologer Stands By Prediction , Claims World War 3 Is Days Away", "date": "2024-06-18 05:00", "url": "https://www.ndtv.com/offbeat/indian-astrologer-stands-by-prediction-claims-world-war-3-is-days-away-5913389", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "An Indian astrologer, dubbed \"New Nostradamus\", is gaining attention after predicting that the start of World War III is mere days away.\nNow, he has claimed that Tuesday, June 18, has the strongest planetary stimulus to trigger World War III.\nSpeaking to the outlet, Mr Kumar said that he used the Vedic astrology chart which is based on Hindu culture to make his predictions.\n\"Watch the developing war scenario in hotspots across the globe as days pass by,\" Mr Kumar said as per the New York Post.\nFor 2024, Nostradamus has even predicted that the climate crisis would get worse."}, {"id": "606f26df-f77d-4745-b340-071ada88d196", "title": "Where heroes lie - The Hindu", "date": "2024-06-18 04:30", "url": "https://www.thehindu.com/education/where-heroes-lie/article68277098.ece", "domain": "thehindu.com", "domain_classification": "Local - Asia", "message": "“Well, that’s just the way colonisers bulldozed their way everywhere changing things without anyone’s consent,” shrugged Amma, just as they reached their destination in a taxi.\nThe Japanese were stopped from making their way to the plains of India during the battle of Kohima in April 1944.\nIt is said the British and Indian side lost around 4000 men and the Japanese 7000,” noted Appa.\nAs we were ruled by the British, their war became our war and it came to our doorstep at this very place we are standing,” said Appa.\nThey reached the epitaph near the entrance:When You Go Home, Tell Them of Us and Say,/For Your Tomorrow, We Gave Our Today."}, {"id": "ae81cbb1-7403-4afe-86c8-4ef9cf9c9c9a", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for 2nd time this month", "date": "2024-06-18 04:00", "url": "http://www.middletownpress.com/news/world/article/south-korean-soldiers-fire-warning-shots-after-19519481.php", "domain": "middletownpress.com", "domain_classification": "Unknown", "message": "South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said."}, {"id": "5b5b0575-71a7-45b3-8387-9bdf67acf2ef", "title": "Taiwan keeping watch after Chinese submarine surfaces in Taiwan Strait", "date": "2024-06-18 08:00", "url": "https://www.thestandard.com.hk/breaking-news/section/3/217527/Taiwan-keeping-watch-after-Chinese-submarine-surfaces-in-Taiwan-Strait", "domain": "thestandard.com.hk", "domain_classification": "Unknown", "message": "REUTERS/Stringer/File PhotoTaiwan's defence minister said on Tuesday that they have a \"grasp\" of the situation after pictures appeared online of a Chinese nuclear submarine surfacing in the sensitive Taiwan Strait near Taiwanese fishermen.\nThe narrow strait that separates Taiwan from China is a frequent source of tension.\nTaiwan reports Chinese warplanes and warships operating there on a daily basis, as Beijing seeks to assert its sovereignty claims against the democratically governed island.\nAsked about the submarine, Taiwan Defence Minister Wellington Koo said they have a \"grasp\" of the intelligence situation, but declined to say how they were monitoring it or give details.\nTaiwan detected 20 Chinese military planes and seven vessels around the island in the past 24 hours, Taiwan's defence ministry said in its daily report on Chinese military activities on Tuesday morning."}, {"id": "3dcf0452-b79a-43e8-bc75-bd034a90537c", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 06:00", "url": "https://www.kelownadailycourier.ca/news/world_news/article_9ea627ad-8549-5b89-aed0-16bf476f528b.html", "domain": "kelownadailycourier.ca", "domain_classification": "Unknown", "message": "We're always interested in hearing about news in our community.\nLet us know what's going on!"}, {"id": "68ca124c-5295-4292-88ba-86bd72e4ec8a", "title": "Remains of War of 1812 soldiers returned", "date": "2024-06-18 08:00", "url": "https://www.upi.com/Archives/1988/07/01/Remains-of-War-of-1812-soldiers-returned/3924583732800/", "domain": "upi.com", "domain_classification": "Unknown", "message": "FORT ERIE, Ontario -- Flag-draped caskets containing the remains of 28 American soldiers killed and buried in Canada during the War of 1812 have been returned to U.S. soil.\nDark clouds hung overhead as Canadian, American and British flags flew at half-staff over Old Fort Erie, where American and Canadian forces engaged in battle 176 years ago, during an hourlong repatriation ceremony Thursday.\nAdvertisementGeorge Hees, minister of Veteran Affairs for Canada, transferred responsibility for the skeletal remains to Thomas Niles, U.S.\n'There can be no truer an epilogue to the War of 1812,' Hees said.\nFort Erie Mayor Heinz Hummel noted that 'since the guns became silent' after the War of 1812, Canada and the U.S. have 'lived in peace.'"}, {"id": "be536051-82b6-4717-9ce6-47154c6598b5", "title": "World War 3 : Will World War III start today or on June 29 ? Here what  Indian Nostradamu predicts", "date": "2024-06-18 05:45", "url": "https://economictimes.indiatimes.com/news/new-updates/will-world-war-iii-start-today-or-on-june-29-heres-what-indian-nostradamus-predicts/articleshow/111074006.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "Global Tensions and the Astrologer's JustificationA Comparison with Nostradamus's Prophetic VisionsHow does the world end according to Nostradamus?\nHe views the Vedic astrology chart as a \"map of our karma,\" using planetary alignments to pinpoint significant events.\n\"Kumar's prophecy gains credence from recent global events.\nNostradamus, in his work \"Les Propheties\" (\"The Prophecies\"), is believed to have foreseen events for the year 2024, including severe weather events, global turmoil, and even a new pope.\nSo, watch the developing war scenario in hotspots across the globe as days pass by.”"}, {"id": "ddb84d05-503b-40c2-b94c-b555474116ed", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 07:30", "url": "https://www.tricitynews.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "tricitynews.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "0ee33f3e-40ed-4870-a1d3-5b808dd6eb22", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 07:30", "url": "https://www.fitzhugh.ca/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098278", "domain": "fitzhugh.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "b07167a4-6b91-4628-9f83-f4886ff6d49f", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 08:15", "url": "https://www.richmond-news.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "richmond-news.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "78a11e7d-d3ca-4c5d-970f-c37e83f3f0e7", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 08:45", "url": "https://www.airdriecityview.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098278", "domain": "airdriecityview.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe work has gone on uninterrupted despite several explosions caused by mines that killed or injured an unspecified number of North Korean soldiers, said the South’s Joint Chiefs of Staff.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "4bc2a9f4-3127-4d3b-9a3b-941c6122ddb9", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 08:45", "url": "https://www.stalbertgazette.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098278", "domain": "stalbertgazette.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nThe work has gone on uninterrupted despite several explosions caused by mines that killed or injured an unspecified number of North Korean soldiers, said the South’s Joint Chiefs of Staff.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "a3ba52fb-4326-40e2-9447-f5a655ea097e", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 06:45", "url": "https://www.burnabynow.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "burnabynow.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "92b77585-cc4f-4555-a15f-c2c464be3ed8", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 06:45", "url": "https://www.thereminder.ca/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "thereminder.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "e1aa4c55-9afc-4504-a7cf-6dff18898cfc", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 07:15", "url": "https://www.piquenewsmagazine.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "piquenewsmagazine.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "86b423d9-7048-4cc2-a0f0-2793282b07f3", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 08:00", "url": "https://www.thompsoncitizen.net/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "thompsoncitizen.net", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "728379b4-b98e-4124-8ade-de3c0e2c7e77", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 08:00", "url": "https://www.princegeorgecitizen.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098278", "domain": "princegeorgecitizen.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "4254ca93-3c6a-4b80-93bf-57d040e002ba", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 06:00", "url": "https://www.prpeak.com/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "prpeak.com", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "03089c3d-96dd-46ba-b4fd-135a5f82fd33", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 09:00", "url": "https://www.newwestrecord.ca/world-news/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month-9098283", "domain": "newwestrecord.ca", "domain_classification": "Unknown", "message": "SEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nSEOUL, South Korea (AP) — South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said.\nIt said the North Korean soldiers retreated after the South broadcasts warnings and fired warning shots and the South’s military didn’t spot any suspicious activity after that.\nThe South also fired warning shots on June 11 after another group of North Korean soldiers briefly crossed the MDL.\nIt said it doesn’t believe the North Korean soldiers intruded the border intentionally and that the North did not return fire."}, {"id": "ce42a9e9-f607-4cef-9bdd-592cb62de6ad", "title": "FirstUp : Putin in North Korea after 24 years , Modi to address farmers in Varanasi ... Top headlines today", "date": "2024-06-18 02:30", "url": "https://www.firstpost.com/explainers/firstup-putin-in-north-korea-after-24-years-modi-to-address-farmers-in-varanasi-top-headlines-today-13783329.html", "domain": "firstpost.com", "domain_classification": "Unknown", "message": "Russian president Vladimir Putin is set to visit North Korea this week for the first time in 24 years.\nReutersRussian President Vladimir Putin will visit North Korea today for the first time in 24 years.\nPutin will then visit Vietnam on 19 and 20 June, the Kremlin said.\nThis momentous event marked the end of monarchical rule in Egypt and the establishment of a republic led by President Muhammad Naguib.\nThe revolution, spearheaded by the Free Officers Movement, sought to modernise Egypt, end British influence, and address social inequalities."}, {"id": "73cc4ae9-e3b1-42bc-b2a5-c074a8fc7c1e", "title": "IAF To Get More Power With Gen - 5 Fighter", "date": "2024-06-18 04:30", "url": "https://www.rediff.com/news/special/iaf-to-get-more-power-with-gen-5-fighter/20240618.htm", "domain": "rediff.com", "domain_classification": "Unknown", "message": "IMAGE: A model of the 5th Generation Advanced Medium Combat Aircraft.\nPhotograph: ANI PhotoThe US has its F-22 Raptor, and F-35 Lightning II; Russia has its Sukhoi-57; China has its J-20 Chengdu, and J-31 Shenyang -- all of them 5th-generation (Gen-5) combat aircraft built to rule the skies.\nWith the experience gained from building the Tejas light combat aircraft (LCA), New Delhi is pushing its aircraft production monopoly, Hindustan Aeronautics Limited, to join hands with the Defence Research and Development Organisation's Aeronautical Development Agency (ADA) to build an Indian Gen-5 fighter, dubbed the Advanced Medium Combat Aircraft (AMCA).\nIMAGE: Models of India's futuristic indigenous aircraft including the 5th Generation Advanced Medium Combat Aircraft, LCA Mark 2 and naval Twin Engine Deck-based fighter jet showcased at the India Pavilion at Aero India in Bengaluru.\nPhotograph: ANI PhotoEngines for super-cruisingAnother key AMCA design challenge is to develop an indigenous, 'super-cruising' engine."}, {"id": "54db2332-971a-47ab-b272-f801924d7967", "title": "Here what will happen to Aemond Targaryen on  House of the Dragon , if it follows his fate in the book", "date": "2024-06-18 02:45", "url": "https://www.businessinsider.in/entertainment/news/heres-what-will-happen-to-aemond-targaryen-on-house-of-the-dragon-if-it-follows-his-fate-in-the-book/articleshow/111067549.cms", "domain": "businessinsider.in", "domain_classification": "Unknown", "message": "Ewan Mitchell as Aemond Targaryen in \"House of the Dragon\" season two.\nOllie Upton/HBOAemond Targaryen starts \"House of the Dragon\" season two fresh off the murder of his nephew.\nAemond Targaryen is off to a rough — or excellent, depending on how you look at it — start on \"House of the Dragon\" season two.\nHis uncle, Daemon Targaryen, contracts two would-be assassins — known to book readers as Blood and Cheese — to kill Aemond in retaliation for Lucerys' murder.\nEwan Mitchell as Aemond Targaryen in \"House of the Dragon\" season two."}, {"id": "8b598f26-fbe6-4905-8cce-94e2ec05d03a", "title": "James May 20th Century - Dave", "date": "2024-06-18 03:30", "url": "https://www.tvguide.co.uk/schedule/4eef8f69-0035-5066-afd4-b5f84bec57ea/james-mays-20th-century", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "James May's 20th CenturyDave 9:30 AM to 10:00 AM Tuesday 18 June Share Add toCalendar +Take Cover!\nSeason 1 Episode 4 of 6 S SubtitlesThe presenter examines which ideas had the biggest influence on warfare in the last century, by taking a look at the difficulty of hitting targets from a biplane and flying an RAF jet.\nHe also discovers the qualities of camouflage paint and tries to use infrared cameras to search out a group of soldiersJames May's 20th Century airs on Dave at 9:30 AM, Tuesday 18 June .\n(Subtitles.)\nTopics News ➝ Current Affairs Documentary"}, {"id": "f35166ec-964c-4814-a7a7-7a245aa17d34", "title": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this month", "date": "2024-06-18 08:30", "url": "https://lethbridgeherald.com/news/world-news/2024/06/18/south-korean-soldiers-fire-warning-shots-after-north-korean-troops-intrude-for-a-2nd-time-this-month/", "domain": "lethbridgeherald.com", "domain_classification": "Unknown", "message": "South Korean soldiers fire warning shots after North Korean troops intrude for a 2nd time this monthBy Kim Tong-hyung, The Associated Press on June 18, 2024.\nA North Korean military guard post is seen from Paju, South Korea, near the border with North Korea, Tuesday, June 18, 2024.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\nSouth Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals' land border Tuesday for the second time this month, South Korea's military said.\n(AP Photo/Ahn Young-joon)SEOUL, South Korea (AP) – South Korean soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month, South Korea’s military said."}, {"id": "c8c210e8-ce2e-4896-9151-f9a04963f205", "title": "IMRA - Monday , June 17 , 2024 IDF COS Ridicules Ben Gvir For Questioning Efficacy of Spatial Security In Tactical Pause", "date": "2024-06-18 04:00", "url": "http://www.imra.org.il/story.php?id=74180", "domain": "imra.org.il", "domain_classification": "Unknown", "message": "Ben Gvir was concerned that this daily 11 hour \"window\" would be exploitedby Hamas and others.\nRather than seriously address Ben Gvir's remarks, the Chief of Staffridiculed Ben Gvir for asking questions given that Ben Gvir had not servedas a commander in the IDF.\nMinister Avi Dichter joined in by suggesting that Ben Gvir should simplyaccept what the COS said.\nBen Gvir: We saw who was wrong before 7.10 and who was right when he wantedto constantly carry out targeted eliminations.\nSource:Security Cabinet - Moriah Asraf & Doron Kadosh23,167 subscribersMoriah Asraf & Doron KadoshDoron - 053-8312637Moriah - 050-4617948________________________________________IMRA - Independent Media Review and AnalysisSince 1992 providing news and analysis on the Middle East with a focus onArab-Israeli relationsWebsite: www.imra.org.il"}, {"id": "4ee451ee-1f9c-40d2-a312-553d4f7e3dd5", "title": "Russia - Ukraine War : Delhi Court Denies Bail to Man Accused of Trafficking Indians to Russia for War Roles", "date": "2024-06-18 04:30", "url": "https://www.newsx.com/national/russia-ukraine-war-delhi-court-denies-bail-to-man-accused-of-trafficking-indians-to-russia-for-war-roles/", "domain": "newsx.com", "domain_classification": "Unknown", "message": "A Delhi court has rejected the bail plea of Michael Elangovan Anthony, a Mumbai resident, accused of trafficking Indian citizens to Russia to serve in combat roles against Ukraine.\nThe court, presided over by Special Judge Atul Krishna Agrawal, highlighted the seriousness of the charges and the potential risk of evidence tampering if Anthony were released on bail.\nThe CBI’s investigation revealed that these individuals were deployed in active war zones against their will, putting their lives in severe jeopardy.\nThe court’s decision to deny bail was significantly influenced by the potential for Anthony to obstruct the ongoing investigation.\nThe judge emphasized the need to prevent any interference with the collection of further evidence and to avoid any assistance to other accused individuals still evading the law."}, {"id": "c9060620-1f83-48d6-a681-3c61e435d17f", "title": "June 17th - 2024 Presidential Politics - Resistance Day 1246", "date": "2024-06-18 03:00", "url": "https://theconservativetreehouse.com/blog/2024/06/17/june-17th-2024-presidential-politics-resistance-day-1246/comment-page-4/", "domain": "theconservativetreehouse.com", "domain_classification": "Unknown", "message": "In an effort to keep the Daily Open Thread a little more open topic we are going to start a new daily thread for “Presidential Politics”.\nPlease use this thread to post anything relating to the JoeBama Administration and Presidency.\n“This is no small thing, to restore a republic after it has fallen into corruption.\nAnd if we do not try, it most certainly won’t be done.\nThe Founders’ Republic, and the larger war for western civilization, will be lost.”“But I tell you this: We will not go gently into that bloody collectivist good night."}, {"id": "a0a09d22-ef90-4c6e-b189-306a56121aa7", "title": "The war between Russia and Ukraine Is Set to Grind on as a Peace Conference Packs Little Punch", "date": "2024-06-18 00:45", "url": "https://www.newsmax.com/globaltalk/russia-ukraine-war/2024/06/17/id/1168998/", "domain": "newsmax.com", "domain_classification": "Unknown", "message": "It did not zero in on the bedrock — and seemingly intractable, for now — issue: Ukrainian land occupied by invading Russian forces.\nKyiv rejected those proposals as “absurd.”Zelenskyy has previously presented a 10-point peace formula that, among other things, demands the expulsion of all Russian forces from Ukraine and accountability for war crimes.\nRussia, after more than two years of fighting, has so far been unable to deliver a knockout punch and is looking abroad for help to fuel its war effort.\nWestern military analysts say Russia’s army lacks quality due to losses of junior officers in the fighting.\nThat means the Kremlin’s forces have difficulty generating momentum at scale, allowing Ukraine to hold them to incremental gains for now."}, {"id": "6158a755-aba1-422d-adfb-2b386afe7a34", "title": "How the secret US anti - vax operation disrupted Sinovac distribution", "date": "2024-06-18 08:00", "url": "https://global.chinadaily.com.cn/a/202406/18/WS66712be7a31095c51c50985d_1.html", "domain": "global.chinadaily.com.cn", "domain_classification": "Unknown", "message": "Reuters identified 300 accounts on X (Twitter) matching descriptions shared by former US military officials familiar with the Philippines operation.\nMost social media accounts were created in the summer of 2020 and centered on the slogan #Chinaangvirus.\nThe anti-vax effort started in spring of 2020 expanding beyond Southeast Asia before it was terminated in mid-2021.\nSome of the set of fake social media accounts used by the US military \"were active for more than five years,\" according to Reuters.\nWhen the US military anti-vax operation kicked in, there were fewer than 20,000 detected cases in the country."}, {"id": "2d3ddc9d-15b6-4547-8593-e397b1310e12", "title": "PHOTOS : Soldiers recreate Utah Beach in annual obstacle course drill at Fort Carson", "date": "2024-06-18 03:15", "url": "https://gazette.com/military/fort-carson/photos-soldiers-recreate-utah-beach-in-annual-obstacle-course-drill-at-fort-carson/collection_d946ef55-b7df-596b-9aa6-e2d9a66c3915.html", "domain": "gazette.com", "domain_classification": "Unknown", "message": "You have permission to edit this collection."}, {"id": "becca24c-55f2-472c-8cdc-15d88abafdab", "title": "Trash balloons and psychological warfare", "date": "2024-06-18 06:15", "url": "https://asianews.network/trash-balloons-and-psychological-warfare/", "domain": "asianews.network", "domain_classification": "Unknown", "message": "In fact, many experts believe propaganda broadcasting from the West as part of psychological warfare during the Cold War was instrumental in bringing down the Soviet Union and the Communist bloc in Eastern Europe.\nIn recent days, Pyongyang has sent hundreds of balloons filled with trash, including used toilet paper and cigarette butts, to the South.\nIn return, Seoul also decided to engage in psychological warfare.\nIn fact, anti-Pyongyang activists sent dozens of leaflet balloons recently in reaction to the North’s rubbish balloons.\nIn any case, Seoul should not rule out the possibility of engaging in old-style psychological warfare because it can work as a very viable bargaining chip."}, {"id": "38e72646-756a-476c-9889-4bc165e106a1", "title": "War between Russia and Ukraine set to grind on as a diplomatic conference packs little punch", "date": "2024-06-18 03:30", "url": "https://www.adn.com/nation-world/2024/06/17/war-between-russia-and-ukraine-set-to-grind-on-as-a-diplomatic-conference-packs-little-punch/", "domain": "adn.com", "domain_classification": "Unknown", "message": "Ukrainian President Volodymyr Zelenskyy walks during the Summit on peace in Ukraine, in Obbürgen, Switzerland, Sunday, June 16, 2024.\nIt did not resolve the bedrock — and seemingly intractable, for now — issue: Ukrainian land occupied by invading Russian forces.\nZelenskyy has previously presented a 10-point peace formula that, among other things, demands the expulsion of all Russian forces from Ukraine and accountability for war crimes.\nIt also faces challenges with insufficient manpower and a lack of fortifications, offering Russia the chance to make battlefield gains this summer.\nThat means the Kremlin’s forces have difficulty generating momentum at scale, allowing Ukraine to hold them to incremental gains for now."}, {"id": "e507bf34-8552-4fea-8ae6-a70702c88820", "title": "Before his summit with North Korea Kim , Putin vows theyll beat sanctions together – The Denver Post", "date": "2024-06-18 04:15", "url": "https://www.denverpost.com/2024/06/17/before-his-summit-with-north-koreas-kim-putin-vows-theyll-beat-sanctions-together/", "domain": "denverpost.com", "domain_classification": "Unknown", "message": "Both Pyongyang and Moscow have denied accusations about North Korean weapons transfers, which would violate multiple U.N. Security Council sanctions Russia previously endorsed.\nU.S. and South Korean officials have said they are discussing options for a new mechanism for monitoring the North.\nEarlier this year, Putin sent Kim a high-end Aurus Senat limousine, which he had shown to the North Korean leader when they met in September.\nObservers said the shipment violated a U.N. resolution banning the supply of luxury items to North Korea.\nAfter North Korea, the Kremlin said Putin will also visit Vietnam on Wednesday and Thursday for talks that are expected to be focused on trade."}, {"id": "a7ed52fd-4e73-4565-a80d-472193aba50c", "title": "$10b crime fight boost", "date": "2024-06-18 06:00", "url": "https://jamaica-gleaner.com/article/lead-stories/20240618/10b-crime-fight-boost", "domain": "jamaica-gleaner.com", "domain_classification": "Unknown", "message": "Simpson’s presentation showcased the extensive efforts and substantial investments being made to improve crime fighting in Jamaica.\nAnother significant investment shared by the technical director on Monday was the state-of-the-art forensic pathology autopsy suite, on Orange Street, downtown Kingston, valued at $650 million, which he said is 98 per cent complete.\nA total of 63 sites are now connected to the microwave system, with a total investment of $1.5 billion.\nThe total investment, he revealed, represents $19.2 billion.\nSimpson pointed out that the multidimensional nature of the crime problem in Jamaica requires an integrated, multifaceted, and sustained response."}, {"id": "39f85db9-2b38-40fb-b7da-0f8f1304a6c9", "title": "Before his summit with North Korea Kim , Putin vows theyll beat sanctions together", "date": "2024-06-18 04:15", "url": "https://www.news4jax.com/news/world/2024/06/18/before-his-summit-with-north-koreas-kim-putin-vows-theyll-beat-sanctions-together/", "domain": "news4jax.com", "domain_classification": "Unknown", "message": "Both Pyongyang and Moscow have denied accusations about North Korean weapons transfers, which would violate multiple U.N. Security Council sanctions Russia previously endorsed.\nEarlier this year, Putin sent Kim a high-end Aurus Senat limousine, which he had shown to the North Korean leader when they met in September.\nObservers said the shipment violated a U.N. resolution banning the supply of luxury items to North Korea.\nSouth Korea’s military said soldiers fired warning shots to repel North Korean soldiers who temporarily crossed the rivals’ land border Tuesday for the second time this month.\nAfter North Korea, the Kremlin said Putin will also visit Vietnam on Wednesday and Thursday for talks that are expected to be focused on trade."}, {"id": "2b23f628-1e5d-42bb-b3ad-0ab1280a7049", "title": "Before his summit with North Korea Kim Putin vows theyll beat sanctions together", "date": "2024-06-18 06:00", "url": "https://www.theweek.in/wire-updates/international/2024/06/18/fgn16-nkorea-ld-russia.html", "domain": "theweek.in", "domain_classification": "Unknown", "message": "Both Pyongyang and Moscow have denied accusations about North Korean weapons transfers, which would violate multiple UN Security Council sanctions Russia previously endorsed.\nEarlier this year, Putin sent Kim a high-end Aurus Senat limousine, which he had shown to the North Korean leader when they met for a summit in September.\nObservers said the shipment violated a UN resolution banning the supply of luxury items to North Korea.\nMoscow's ties with North Korea weakened after the 1991 Soviet collapse.\nAfter North Korea, the Kremlin said Putin will also visit Vietnam on Wednesday and Thursday for talks that are expected to be focused on trade."}, {"id": "cc71af27-1912-4585-b621-cb870fbfa411", "title": "Ian McKellen Hospitalized After Falling Off Stage During West End Performance of Player Kings", "date": "2024-06-18 00:45", "url": "https://www.theatermania.com/news/ian-mckellen-hospitalized-after-falling-off-stage-during-west-end-performance-of-player-kings_1743281/", "domain": "theatermania.com", "domain_classification": "Unknown", "message": "Ian McKellen has been hospitalized after falling of the stage during a performance of Player Kings in the West End.\nAccording to spectators, McKellen, 85, fell off the front of the stage after losing his footing during the first act of the show, crying out in pain and halting the performance.\nAudience members were then evacuated with front-of-house staff tending to the actor as the house lights came up.\nThe event seemingly took place during the climactic battle that comes just before the intermission of the piece, a truncated version of Shakespeare’s Henry IV plays.\nThe show is due to tour after its run in the West End."}, {"id": "94632813-51b6-48da-bfab-8c0a03788d0b", "title": "EDITORIAL : Ukraine summit should be a start for negotiations to end the war | The Asahi Shimbun : Breaking News , Japan News and Analysis", "date": "2024-06-18 08:45", "url": "https://www.asahi.com/ajw/articles/15309657", "domain": "asahi.com", "domain_classification": "Unknown", "message": "Wrapping up the Summit on Peace in Ukraine, Ukrainian President Volodymyr Zelenskyy holds a news conference in Burgenstock, Switzerland, on June 16.\nThe reason the dialogue for peace has not progressed is solely due to Russia’s adamant refusal of calls for halting its relentless aggression against Ukraine.\nPutin effectively made unilateral demands for territorial cession by Ukraine, which are equivalent to a refusal to engage in dialogue.\nSwitzerland, the host country, narrowed the agenda for the Ukraine peace summit to three items: the safety of nuclear energy and installations; global food security; and issues related to deported and unlawfully displaced Ukrainian children and prisoners of war.\nDespite their critical stances toward Russia’s war, quite a few emerging countries remain distrustful and wary of the United States and Europe since they have arbitrarily imposed economic sanctions on Russia."}, {"id": "a82a441d-3b9e-4996-a7c8-fd59e5bedbcd", "title": "2024 Toyota RAV4 Hybrid vs BYD Sealion 6 : Spec battle", "date": "2024-06-18 05:30", "url": "https://www.canberratimes.com.au/story/8666746/2024-toyota-rav4-hybrid-vs-byd-sealion-6-spec-battle/?cs=34616", "domain": "canberratimes.com.au", "domain_classification": "Unknown", "message": "But the automotive world rarely stands still, and more than 20 manufacturers are now vying for supremacy in one of the most competitive segments going around."}, {"id": "5e58a971-14de-4565-9509-1a266633bc8c", "title": "Putin vows theyll beat sanctions together before his summit with North Korea Kim Jong Un", "date": "2024-06-18 07:15", "url": "https://nypost.com/2024/06/18/world-news/putin-vows-theyll-beat-sanctions-together-before-his-summit-with-north-koreas-kim-jong-un/", "domain": "nypost.com", "domain_classification": "Unknown", "message": "Putin, who will be making his first visit to North Korea in 24 years, said he highly appreciates its firm support of his invasion of Ukraine.\nBoth Pyongyang and Moscow have denied accusations about North Korean weapons transfers, which would violate multiple UN Security Council sanctions Russia previously endorsed.\nEarlier this year, Putin sent Kim a high-end Aurus Senat limousine, which he had shown to the North Korean leader when they met for a summit in September.\nObservers said the shipment violated a UN resolution banning the supply of luxury items to North Korea.\nAfter North Korea, the Kremlin said Putin will also visit Vietnam on Wednesday and Thursday for talks that are expected to be focused on trade."}, {"id": "a4c62bde-7e95-47ac-9f67-7101f668060b", "title": "NATO Countries Hold Talks to Deploy More Nuclear Weapons", "date": "2024-06-18 06:45", "url": "https://www.kyivpost.com/post/34446", "domain": "kyivpost.com", "domain_classification": "Unknown", "message": "NATO countries are discussing putting their nuclear weapons on alert as part of a nuclear deterrent due to the threat from Russia and China, NATO Secretary General Jens Stoltenberg said in an interview with The Telegraph.\nAccording to SIPRI experts, nuclear weapons have not played such a prominent role since the Cold War.\nThe exercises will focus on joint training of units of the Russian and Belarusian armed forces to deploy tactical nuclear weapons.\nAdvertisementNon-strategic nuclear weapons, also known as tactical nuclear weapons, are designed for use on the battlefield.\nWhile they may not be as potentially devastating as strategic nuclear weapons, which can destroy entire cities, they still have the potential to be highly destructive, far more so than the two nuclear weapons used on cities in Japan at the end of World War II."}, {"id": "804d615c-3ee5-45ae-bc79-1a67c292b42e", "title": "Space Arms Race May Be Underway It Comes With Enormous Risks", "date": "2024-06-18 02:45", "url": "https://menafn.com/1108341344/Space-Arms-Race-May-Be-Underway-It-Comes-With-Enormous-Risks", "domain": "menafn.com", "domain_classification": "Unknown", "message": "Author: Olumba E. Ezenwa(MENAFN- The Conversation) As conflict rages on Earth, an arms race may be underway in outer space.\nThe potential weaponisation of space has raised fears among many that the freedom to explore and use outer space peacefully is being eroded.\nWeaponising spaceMilitary interests, assets and personnel have always been at the forefront of exploring and using outer space.\nAleks49/ShutterstockThe weaponisation of space presents a significant threat to the inclusiveness and shared benefits of exploring and using outer space.\nRenewed cooperation among the world's leading powers and support for the UN framework are critical to guaranteeing the peaceful and inclusive exploration and use of outer space."}, {"id": "db337fda-1017-4b01-9f62-cff9da754fba", "title": "Space arms race may be underway", "date": "2024-06-18 07:15", "url": "http://www.econotimes.com/Space-arms-race-may-be-underway--it-comes-with-enormous-risks-1679721", "domain": "econotimes.com", "domain_classification": "Unknown", "message": "As conflict rages on Earth, an arms race may be underway in outer space.\nThe potential weaponisation of space has raised fears among many that the freedom to explore and use outer space peacefully is being eroded.\nWeaponising spaceMilitary interests, assets and personnel have always been at the forefront of exploring and using outer space.\nAleks49/ShutterstockThe weaponisation of space presents a significant threat to the inclusiveness and shared benefits of exploring and using outer space.\nThe threat posed by an arms race in space must be realised and addressed."}, {"id": "ce7efaa2-6c72-40f9-bd59-418781a507d9", "title": "Gaza Fighting Subsides As Israel Declares  Pause  To Facilitate Aid Flow", "date": "2024-06-18 07:15", "url": "https://www.ndtv.com/world-news/gaza-fighting-subsides-as-israel-declares-pause-to-facilitate-aid-flow-5913246", "domain": "ndtv.com", "domain_classification": "Unknown", "message": "Israel struck Gaza on Monday and witnesses reported blasts in the besieged territory's south, but fighting had largely subsided on the second day of an army-declared \"pause\" to facilitate aid flows.\nThe daytime \"pause\" for aid deliveries around a southern Gaza route, announced at the weekend by Israel's military, appeared to be holding on Monday.\nIsrael's retaliatory offensive aimed at eliminating Hamas has killed at least 37,347 people in Gaza, also mostly civilians, according to the territory's health ministry.\nFighting 'as planned'Troops were still operating in Rafah and central Gaza, reporting \"close-quarters combat\" that killed several militants, the military said.\nBiden's plan would bring an initial six-week pause to fighting and Hamas would free hostages in exchange for the release of Palestinian prisoners held by Israel."}, {"id": "f4063104-bc04-4411-a61a-549ad14fc607", "title": "Baldwin midwife anti - vax effort was a danger to public health", "date": "2024-06-18 00:30", "url": "https://www.newsday.com/opinion/editorials/fake-vaccines-baldwin-midwife-jeanette-breen-immunization-ijy7ye2r", "domain": "newsday.com", "domain_classification": "Unknown", "message": "Last week's Newsday analysis of state Department of Health records unveiled the breathtaking scope of Breen's fraud.\nLocal health officials previously said that 397 Nassau County students and 273 Suffolk County students had vaccine records through Breen deemed fraudulent.\nThe State Health Department was right to bar unvaccinated students from school until they provided new proof of immunization.\nHealth Department officials recently have tried to make it easier for parents to get children vaccinated by widening the number of people who can administer them.\nMeanwhile, state education officials must deactivate Breen's midwife license and prescription certifications; she should not be practicing health care."}, {"id": "d6c86240-157e-4e89-80d4-b6d8f6bb979d", "title": "Lull in Gaza fighting despite blasts in south", "date": "2024-06-18 00:45", "url": "https://www.yahoo.com/news/lull-gaza-fighting-despite-blasts-001114490.html", "domain": "yahoo.com", "domain_classification": "Unknown", "message": "Israel's retaliatory offensive aimed at eliminating Hamas has killed at least 37,347 people in Gaza, also mostly civilians, according to the territory's health ministry.\nOn Monday witnesses told AFP they could hear blasts in the centre and west of the southernmost city of Rafah.\n- Fighting 'as planned' -Troops were still operating in Rafah and central Gaza, reporting \"close-quarters combat\" that killed several militants, the military said.\nMahmud Basal, spokesman for Gaza's civil defence agency, said that apart from the deadly Gaza City strikes, \"the other areas of the Gaza Strip are somewhat calm\".\nBiden's plan would bring an initial six-week pause to fighting and Hamas would free hostages in exchange for the release of Palestinian prisoners held by Israel."}, {"id": "2dd821e7-422b-4025-bb64-84531c398956", "title": "F - 15C - Cyst - addon - Ace Combat 04 : Shattered Skies", "date": "2024-06-18 08:45", "url": "https://www.moddb.com/games/ace-combat-04/addons/f-15c-cyst", "domain": "moddb.com", "domain_classification": "Unknown", "message": "Danger takes wing again, as Namco's breakneck flight simulation launches again for more harrowing dogfights and critical mission strikes in Ace Combat 4: Shattered Skies.\nBut this assignment requires a more powerful arsenal than ever before — and with the overpowering might of the PlayStation 2 computer entertainment system locked and loaded, Ace Combat 4: Shattered Skies aims to deliver the most firepower yet in the series."}, {"id": "7f00eba8-fea3-4f9a-9ed5-c127dab5b575", "title": "UK approval of arms exports to Israel plunged at start of Gaza war", "date": "2024-06-18 03:15", "url": "https://www.asiaone.com/world/uk-approval-arms-exports-israel-plunged-start-gaza-war", "domain": "asiaone.com", "domain_classification": "Unknown", "message": "The United States and Germany both increased arms sales to Israel after the start of the war with Hamas.\nThis compares with the government approving £20 million of arms sales to Israel for the same period in 2022, including small arms ammunition and components for combat aircraft, according to government data.\nMembers of Britain's parliament and human rights groups have criticised the government for the lack of public information about arms sales to Israel since the start of the conflict.\nHe has resisted calls to halt arms transfers to Israel but has said the government adheres to a \"very careful licencing regime\".\nBritain is expected to provide information about arms sales to Israel in the first half of this year in the coming months."}, {"id": "40c01e32-bcf4-4cba-a88d-ab975b61500e", "title": "SpongeBob SquarePants - Nickelodeon HD", "date": "2024-06-18 04:15", "url": "https://www.tvguide.co.uk/schedule/e4ef66fb-7de2-5922-8931-78c9c8000047/spongebob-squarepants", "domain": "tvguide.co.uk", "domain_classification": "Unknown", "message": "SpongeBob SquarePantsNickelodeon HD 10:00 AM to 10:31 AM Tuesday 18 June Share Add toCalendar +20, 000 Patties Under the Sea/The Battle of Bikini Bottom S SubtitlesIt's a battle of the restaurants in '20,000 Patties Under The Sea', and then in 'The Battle Of Bikini Bottom', Patrick and SpongeBob discover that they have very different views about cleanliness.\nSpongeBob SquarePants airs on Nickelodeon HD at 10:00 AM, Tuesday 18 June .\n(Subtitles.)"}, {"id": "8499c4c3-fd58-41a2-970e-0d58e9217fdb", "title": "Lull in Gaza fighting despite blasts in south", "date": "2024-06-18 08:45", "url": "https://www.rte.ie/news/world/2024/0618/1455259-gaza-middle-east-israel/", "domain": "rte.ie", "domain_classification": "Unknown", "message": "Israeli forces have struck Gaza with witnesses reporting blasts in the besieged territory's south, but fighting has largely subsided on the second day of an army-declared \"pause\" to facilitate the flow of aid.\nYesterday, witnesses told AFP they could hear blasts in the centre and west of the southernmost city of Rafah.\nHumanitarian aid for Gaza waiting to be loaded into trucks at the Kerem Shalom border crossingAt least one strike hit Bureij refugee camp in central Gaza, residents said.\nTroops were still operating in Rafah and central Gaza, reporting \"close-quarters combat\" that killed several militants, the military said.\nArmed with drums, horns and placards calling for fresh elections, thousands of protesters old and young called for a ceasefire to bring the remaining Gaza hostage's home."}, {"id": "983dabf2-a54b-49fb-bfe9-3d814b4b3f7b", "title": "Henry Cavill Confirms First Child With Girlfriend Natalie Viscuso On Father Day ; Asks For Tips", "date": "2024-06-18 06:15", "url": "https://www.pinkvilla.com/entertainment/hollywood/henry-cavill-confirms-first-child-with-girlfriend-natalie-viscuso-on-fathers-day-asks-for-tips-1317484", "domain": "pinkvilla.com", "domain_classification": "Unknown", "message": "Actor Henry Cavill took to Instagram to share how he has been celebrating Father’s Day this year in the wake of him expecting his first child with girlfriend Natalie Viscuso.\nIn a post where the star can be spotted sitting near a baby crib, Cavill alluded to the pregnancy in the caption.\nHis girlfriend Natalie Viscuso reposted Cavill’s post on her story, with an additional text that read, \"Happy Father's Day to the soon-to-be father of my first child!\nAdvertisementHenry Cavill and Natalie Viscuso's relationshipCavill and Viscuso confirmed their relationship on Instagram in April 2021, as they both shared snapshots of them playing chess on their profiles.\nThe star has multiple projects lined up, including In the Grey, a thriller helmed by frequent collaborator Guy Ritchie."}, {"id": "5cd1f966-cf7f-443c-9436-8d06aac49e3f", "title": "Peter Dutton wants voters to forget about the future and embrace a Vonnegut - like fatalism . It wont end well | Peter Lewis", "date": "2024-06-18 02:00", "url": "https://www.theguardian.com/australia-news/commentisfree/article/2024/jun/18/peter-dutton-labor-government-vape-ban", "domain": "theguardian.com", "domain_classification": "International", "message": "The Nationals are leaning into big tobacco’s last-ditch attempt to replenish its dying enterprise by vowing to block laws to stop a new generation taking up new generation cancer sticks.\nThis week’s Essential Report shows that while the argument has some resonance with younger voters, the majority have not fallen for the libertarian smokescreen.\nWhat seems like a massive political misstep by the opposition has a specific target: the actual target.\nWhen the future is reduced to an abstract number it’s so much harder to bring it to life and make it consequential.\nFor more information see our Newsletters may contain info about charities, online ads, and content funded by outside parties."}, {"id": "1f6964fb-87a2-46ff-bf59-2b4781bb1939", "title": "HAL shares rally 6 % as Ministry of Defence to procure  Prachand  helicopters", "date": "2024-06-18 06:15", "url": "https://economictimes.indiatimes.com/markets/stocks/news/hal-shares-rally-6-as-ministry-of-defence-to-procure-prachand-helicopters/articleshow/111075773.cms", "domain": "economictimes.indiatimes.com", "domain_classification": "Unknown", "message": "(You can now subscribe to our(You can now subscribe to our ETMarkets WhatsApp channelShares of Hindustan Aeronautics surged nearly 6% to its all-time high of Rs 5,484.20 on BSE in Tuesday's trade as the company announced that the Ministry of Defence has issued a request for proposal (RFP) to procure 156 Light Combat Helicopters from the company.The tender’s value is said to be worth around Rs 50,000 crore, the largest single order given for the acquisition of choppers to an Indian company.Out of the total number of helicopters named ‘Prachand’, 90 will be procured for the Indian Army while 66 for the Indian Air Force, stated HAL in its filing to the exchanges.The Army and Air Force will get the `Prachand’ helicopters that have been designed specifically for Indian conditions and have shown good performance at super high altitude areas during trials in Ladakh.\n\"This helicopter is equipped with requisite agility, maneuverability, extended range, high altitude performance and around-the-clock, all-weather combat capability to perform roles of Combat Search and Rescue (CSAR), Destruction of Enemy Air Defence (DEAD), Counter Insurgency (CI) operations, against slow-moving aircraft and Remotely Piloted Aircraft (RPAs), high altitude bunker busting operations, Counter Insurgency operations in jungle and urban environments and support to ground forces,” said officials to ET.The tender will pave the way for HAL to offer a techno-commercial bid that will then be negotiated with the defence ministry before being finalized.\nHAL is the sole company given the tender, which is being processed under the Single Vendor Contract (SVC) route.The indigenous content by value for the choppers is likely to cross the 55% mark initially and will be progressively increased in the coming years.\nIn 2022, the government had placed orders for 15 Light Combat Helicopters on HAL, at a cost of Rs 3,887 crore, which included infrastructure sanctions worth Rs 377 crore."}]