[{"id": "c9400fc5-3aab-452f-90e6-e6dc3ebb0295", "title": "Aon releases global catastrophe numbers for Q1", "date": "2024-04-30 13:30", "url": "https://www.insurancebusinessmag.com/us/news/catastrophe/aon-releases-global-catastrophe-numbers-for-q1-487163.aspx", "message": "Meanwhile, global disasters in the quarter claimed over 1,500 lives, a figure considerably below the long-term average.\nThe deadliest was the Noto earthquake, which resulted in 245 fatalities.\nThis was closely followed by severe flooding in the Democratic Republic of the Congo and Congo, which took 240 lives in January, and the catastrophic wildfires in Chile that claimed 131 lives the following month."}, {"id": "920c967e-abbc-4a9c-b905-c9da8943d02a", "title": "If a Tsunami Hit Massachusetts Here Is What Would Happen", "date": "2024-04-28 20:30", "url": "https://wsbs.com/ixp/519/p/massachusetts-tsunami-preparation-safety/", "message": "If you lived through the devastating tsunamis in Indonesia and Japan, the televised images of loss of life and wreckage immediately come to mind when you hear the word.\nIn April of 2024, Indonesia issued a tsunami alert, evacuating thousands after a volcano erupted on a remote island.\nThe state has calculated how many hospitals, bridges and pieces of infrastructure sit in danger of tsunami destruction.\nThe report did not indicate whether the Commonwealth has yet succeeded in organizing a comprehensive tsunami warning system for coastline residents.\nIt's important to remember that while a tsunami event could cripple waterfront parts of Massachusetts, historically, they are a rare occurrence in this part of the country."}, {"id": "5e8dfa37-1c45-4c58-b985-d86691b9393f", "title": "If a Tsunami Hit Massachusetts Here Is What Would Happen", "date": "2024-04-28 17:15", "url": "https://wnaw.com/ixp/519/p/massachusetts-tsunami-preparation-safety/", "message": "If you lived through the devastating tsunamis in Indonesia and Japan, the televised images of loss of life and wreckage immediately come to mind when you hear the word.\nIn April of 2024, Indonesia issued a tsunami alert, evacuating thousands after a volcano erupted on a remote island.\nThe state has calculated how many hospitals, bridges and pieces of infrastructure sit in danger of tsunami destruction.\nThe report did not indicate whether the Commonwealth has yet succeeded in organizing a comprehensive tsunami warning system for coastline residents.\nIt's important to remember that while a tsunami event could cripple waterfront parts of Massachusetts, historically, they are a rare occurrence in this part of the country."}, {"id": "be6165c7-fe69-4733-b0f0-783d361adf16", "title": "Scientists consider a Category 6 for mega - hurricane era", "date": "2024-04-28 18:00", "url": "https://www.stltoday.com/news/nation-world/weather/severe-weather-storms-hurricane-categories/article_26febba9-40aa-5d0a-9ca2-110235e05131.html", "message": "In 1973, the National Hurricane Center introduced the Saffir-Simpson scale, a five-category rating system that classified hurricanes by wind intensity.\nAt the bottom of the scale was Category 1, for storms with sustained winds of 74 to 95 mph.\nPatricia, which made landfall near Jalisco, Mexico, in October 2015, is the most powerful tropical cyclone ever recorded in terms of maximum sustained winds.\nThe category scale measures only sustained wind speeds, which is just one of the threats a major storm presents.\nThe Saffir-Simpson scale is a relic of an earlier age in forecasting, Brennan said."}, {"id": "b0ea976f-be5c-405f-afb9-03f1217ac216", "title": "Scientists consider a Category 6 for mega - hurricane era | News", "date": "2024-04-28 16:30", "url": "https://www.wfmz.com/news/severe-weather-storms-hurricane-categories/article_04ef91c9-9c70-572e-84e4-ce243fc42295.html", "message": "In 1973, the National Hurricane Center introduced the Saffir-Simpson scale, a five-category rating system that classified hurricanes by wind intensity.\nAt the bottom of the scale was Category 1, for storms with sustained winds of 74 to 95 mph.\nPatricia, which made landfall near Jalisco, Mexico, in October 2015, is the most powerful tropical cyclone ever recorded in terms of maximum sustained winds.\nThe category scale measures only sustained wind speeds, which is just one of the threats a major storm presents.\nThe Saffir-Simpson scale is a relic of an earlier age in forecasting, Brennan said."}, {"id": "6e92bd96-3c6d-408b-b064-9ea96f9814ea", "title": "How B . C . is mobilizing for  challenging  wildfire season", "date": "2024-04-29 16:30", "url": "https://www.cbc.ca/news/canada/british-columbia/bc-wildfire-season-2024-preparations-1.7182227", "message": "Wildfire season is here.\nWildfire Service.\nWildfire Service helicopter at the scene of a grass fire in Kamloops, B.C., on April 20.\nPreventionFire officials are putting an emphasis on owners consulting the FireSmart program to protect their properties before and during the wildfire season.\nAnd even with all this preparation, Perry said it's going to take decades of work for the province to be truly prepared for wildfire season."}, {"id": "a00f41e8-1c00-4401-b52a-7ccf7f37ae19", "title": "Africa : UN Officials Urge Swift Action to Tackle El Niño - Induced Extreme Weather", "date": "2024-04-30 10:15", "url": "https://allafrica.com/stories/202404300108.html", "message": "Top UN officials called on Monday for swift action to combat the El Niño extreme weather events that are currently devastating southern Africa and other regions with flooding and drought.\nAround 40 to 50 million people are currently affected in 16 countries, said Reena Ghelani, the new Climate Crisis Coordinator for the El Niño/La Niña Response.\nDrought rippling across southern AfricaIn southern Africa, severe drought has led to many countries declaring a state of emergency.\nClose Sign up for free AllAfrica Newsletters Get the latest in African news delivered straight to your inbox Top Headlines International Organisations Africa Climate By submitting above, you agree to our privacy policy.\nGains have been made in tackling El Niño-induced consequences around the world, including by developing drought-resistant crops, she said."}, {"id": "a6aa84db-2d54-4542-8ee4-62dd090bd80d", "title": "Help on the way for north Minneapolis neighborhood prone to extreme flooding", "date": "2024-04-28 15:45", "url": "https://www.startribune.com/help-on-the-way-for-north-minneapolis-neighborhood-prone-to-extreme-flooding/600362239/", "message": "The little neighborhood of Cleveland on Minneapolis' North Side experiences big flooding whenever it rains too hard or fast.\nNow, the city's priority list is informed by data that suggest that flood-prone areas of the north Minneapolis neighborhoods of Jordan and Cleveland are in the most critical need of better storm water management.\nPlanners toured the neighborhood with residents earlier this month and aim to propose storm water management and street reconstruction conceptual designs by this fall.\nThe core reason for 35th Avenue's flooding is a lack of storm water storage.\n\"Everybody wants the neighborhood to stay nice and clean, so it's really frustrating when it happens and is just such a nightmare,\" Spears said."}, {"id": "14a21585-8d1b-45f9-a8a0-b3003af0bf48", "title": "UN officials urge swift action to tackle El Niño - induced extreme weather", "date": "2024-04-30 05:15", "url": "https://www.manilatimes.net/2024/04/29/world/un-news/un-officials-urge-swift-action-to-tackle-el-nio-induced-extreme-weather/1944038", "message": "Top UN officials called on Monday for swift action to combat the El Niño extreme weather events that are currently devastating southern Africa and other regions with flooding and drought.\nWMO/Fouad AbdeladimAround 40 to 50 million people are currently affected in 16 countries, said Reena Ghelani, the new Climate Crisis Coordinator for the El Niño/La Niña Response.\nDrought rippling across southern AfricaIn southern Africa, severe drought has led to many countries declaring a state of emergency.\n\"These El Niño impacts are deepening around the world,\" she said, pointing to findings in the recently released 2024 Global Report on Food Crises.\nGains have been made in tackling El Niño-induced consequences around the world, including by developing drought-resistant crops, she said."}, {"id": "132eb8dd-5752-4dff-bccf-507977981353", "title": "County Flood District receives $19M for Highway 89 fire - flood mitigation", "date": "2024-04-28 20:30", "url": "https://azdailysun.com/news/local/county-flood-district-receives-19m-for-highway-89-fire-flood-mitigation/article_6ed15360-0363-11ef-9ff2-cff633932163.html", "message": "State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington Washington D.C. West Virginia Wisconsin Wyoming Puerto Rico US Virgin Islands Armed Forces Americas Armed Forces Pacific Armed Forces Europe Northern Mariana Islands Marshall Islands American Samoa Federated States of Micronesia Guam Palau Alberta, Canada British Columbia, Canada Manitoba, Canada New Brunswick, Canada Newfoundland, Canada Nova Scotia, Canada Northwest Territories, Canada Nunavut, Canada Ontario, Canada Prince Edward Island, Canada Quebec, Canada Saskatchewan, Canada Yukon Territory, CanadaZip Code"}, {"id": "63cf38c1-c2e3-4976-a88d-33ef8c20ced5", "title": "Extreme weather forecast to get even worse in Texas", "date": "2024-04-29 16:30", "url": "https://fortune.com/2024/04/29/texas-extreme-weather-increase-john-nielsen-gammon-climatologist-future-trends/", "message": "Texas has had more than its share of extreme weather events in the past few years, with severe temperatures (both hot and cold), wildfires, and droughts.\nA new report from the Texas state climatologist at Texas A&M University, Dr. John Nielsen-Gammon, predicts significant increases in days that top 100-degrees, which could lead to even more extreme weather events.\nThe Future Trends of Extreme Weather in Texas report looks at future trends through 2036.\nExtreme rainfall is also a risk in some areas.\nThe report, which acknowledges the uncertainties of long-term forecasting, was funded by Texas 2036, a nonpartisan public-policy nonprofit that was named for the state’s upcoming bicentennial."}, {"id": "46122ebe-3b3a-4831-b7e8-33fc543b5911", "title": "UN officials urge swift action to tackle El Niño - induced extreme weather", "date": "2024-04-30 01:45", "url": "https://www.globalissues.org/news/2024/04/29/36600", "message": "Around 40 to 50 million people are currently affected in 16 countries, said Reena Ghelani, the new Climate Crisis Coordinator for the El Niño/La Niña Response.\nDrought rippling across southern AfricaIn southern Africa, severe drought has led to many countries declaring a state of emergency.\nRecalling a recent trip to the region, Ms. Ghelani said February was the hottest in a century.\n“These El Niño impacts are deepening around the world,” she said, pointing to findings in the recently released 2024 Global Report on Food Crises.\nGains have been made in tackling El Niño-induced consequences around the world, including by developing drought-resistant crops, she said."}, {"id": "94feb93e-321d-4815-9785-2fb20a7f3e90", "title": "Hurricane Ian damage totals hit $21 . 4 billion", "date": "2024-04-29 18:00", "url": "https://www.mysuncoast.com/2024/04/29/hurricane-ian-damage-totals-hit-214-billion/", "message": "SARASOTA, Fla. (WWSB) - Hurricane Season is a little over a month away and the damage from Hurricane Ian two years ago is still being repaired.\nNew numbers are in and they are showing losses totaling nearly $21.4 billion dollars.\nThis comes from more than 776,000 claims, most of them involving residential property and auto damage.\nThe Category 4 storm made landfall in September of 2022 causing significant damage across the state including here on the Suncoast.\nThe Florida Office of Insurance Regulation (​ WWSB - Producers ​ The Florida Office of Insurance Regulation)Copyright 2024 WWSB."}, {"id": "a4a0e153-0aa6-41af-9ff2-d4f04cac5fa0", "title": "Indonesia 6 . 5 - magnitude Garut Earthquake Damages 41 Houses , BPBD Says", "date": "2024-04-28 16:15", "url": "https://en.tempo.co/read/1861712/indonesias-6-5-magnitude-garut-earthquake-damages-41-houses-bpbd-says", "message": "TEMPO.CO, Jakarta - The 6.5-magnitude earthquake that jolted Garut District, West Java Province, Indonesia, on Saturday (April 27) evening, has resulted in at least 41 damaged houses, according to the district's Regional Disaster Mitigation Agency (BPBD).\n\"Based on latest reports, the earthquake damaged 41 houses and one health facility, namely Pameungpeuk Hospital,\" Head of Garut BPBD Aah Anwar Saefuloh remarked in Garut on Sunday, April 28, 2024.\nCurrently, our personnel are conducting patrols in the entire area of Garut to provide assistance to people following the earthquake and keep the situation conducive, he stated.\n\"The modeling results show that this earthquake does not have the potential to cause a tsunami,\" the head of the BMKG Earthquake and Tsunami Center Daryono said in Bandung, West Java, on Sunday.\nAccording to reports, the earthquake was also felt by residents of other regions, including Bandung, Pangandaran, and Tasikmalaya."}, {"id": "b08b82e9-49b2-48cb-8b61-3ffcd363196e", "title": "BNPB records 267 houses damaged following Garut M6 . 2 earthquake", "date": "2024-04-29 08:30", "url": "https://en.antaranews.com/news/312072/bnpb-records-267-houses-damaged-following-garuts-m62-earthquake", "message": "BNPB records 267 houses damaged following Garut's M6.2 earthquakeBandung (ANTARA) - At least 267 houses were reportedly affected by the 6.2-magnitude earthquake that rattled Garut District, West Java Province, on Saturday (April 27) evening, the National Disaster Mitigation Agency (BNPB) stated.\n\"As of Monday at 4 a.m. local time, we have recorded 267 affected houses in total,\" Head of BNPB's Center for Disaster Data, Information, and Communication, Abdul Muhari, noted in the agency's statement received in Bandung on Monday.Muhari remarked that the regional disaster mitigation agencies (BPBDs) of quake-hit regions had been working to assess the extent of damage and identify other impacts of the earthquake.According to Muhari, the BNPB has registered eight severely damaged houses, 56 houses with medium-level damage, and 191 mildly damaged houses.\nHe also revealed that another 12 houses were affected, albeit not providing any details on the level of the damage.\n\"We have yet to receive reports on casualties following the 6.2-magnitude earthquake,\" he concluded.\nTranslator: Rubby J, Tegar NurfitraEditor: Aditya Eko Sigit WicaksonoCopyright © ANTARA 2024"}, {"id": "e31b6465-4564-45e1-a4ff-ff6b8cf8a98d", "title": "6 . 5 - magnitude quake hits Papua New Guinea : USGS", "date": "2024-04-29 04:15", "url": "https://www.tbsnews.net/world/65-magnitude-quake-hits-papua-new-guinea-usgs-828226", "message": "A strong 6.5-magnitude earthquake hit northern Papua New Guinea early Monday, but there was no threat of a tsunami, US seismologists said.\nThe epicentre of the quake, which hit at 0656 local time (2056 GMT), was roughly 110 kilometres (68 miles) east-southeast of Kimbe on the island of New Britain, at a depth of 64 kilometres, the US Geological Survey said.\nThe Pacific Tsunami Warning Centre said in a statement that there was \"no tsunami threat\".\nThere were no immediate local reports of damage.\nThe region was rattled last month when at least five people were killed and an estimated 1,000 homes destroyed following a magnitude 6.9 earthquake."}, {"id": "4142ea90-41f2-4911-80f4-d0bd07094ac6", "title": "Op - Ed : Federal budget 2024 misses the mark on water - related investments", "date": "2024-04-29 23:30", "url": "https://www.canadianunderwriter.ca/insurance/op-ed-federal-budget-2024-misses-the-mark-on-water-related-investments-1004245740/", "message": "In the lead-up to the federal government’s 2024 budget, there was hope for investments in water management and water-related infrastructure to help address some of these issues.\nFires and droughtsThe budget is light on details — and critical infrastructure investments — regarding the management of fires and droughts.\nRegardless, the 2024 budget looks unlikely to drastically improve the situation, and droughts and fires are probably going to keep getting worse in the years to come.\nHousing and wastewaterThe third major water-related aspect we examined in the 2024 budget concerned housing and water management in the built environment.\nHopefully this funding can be used to improve aging storm water infrastructure across the country as cities increase in density."}, {"id": "4a84075c-d99f-4afb-88c3-2b25a751533b", "title": "More severe storms , tornadoes poised to pounce on central US this week", "date": "2024-04-29 17:00", "url": "https://www.yahoo.com/news/more-severe-storms-tornadoes-poised-151419877.html", "message": "Severe weather and the likelihood of more tornadoes will return to the central United States, spanning Tuesday, Wednesday and Thursday, AccuWeather meteorologists warn.\nSadly, several people were killed, including an infant, in the violent storms and tornadoes from Friday to Sunday.\nClose to 500 incidents of severe weather occurred, including more than 125 tornadoes.\nThe overall threat of severe weather Tuesday afternoon and evening will extend as far to the south as west-central Texas.\nUnlock advanced, hyperlocal severe weather alerts when you subscribe to Premium+ on the AccuWeather app."}, {"id": "2188cc19-a503-4891-ad97-51523c8ee6e1", "title": "More severe weather expected in central U . S . this week", "date": "2024-04-30 01:00", "url": "https://www.upi.com/Top_News/US/2024/04/29/severe-storms-tornadoes-forecast-central-states/3271714416357/", "message": "Severe weather and the likelihood of more tornadoes will return to the central United States, spanning Tuesday, Wednesday and Thursday, AccuWeather meteorologists warn.\nMany of the same areas that were rocked and devastated by severe weather and flash flooding in recent days may be hit again or at least under the threat of severe weather, including tornadoes.\nClose to 1,000 incidents of severe weather occurred, including more than 125 tornadoes.\nThe overall threat of severe weather Tuesday afternoon and evening will extend as far to the south as west-central Texas.\nThe threat of severe weather will continue from the second storm system Thursday."}, {"id": "14cb53f8-7cad-4269-8646-04680a7aba49", "title": "46 killed as dam bursts in flood - hit Kenya - Newspaper", "date": "2024-04-30 02:15", "url": "https://www.dawn.com/news/1830509/46-killed-as-dam-bursts-in-flood-hit-kenya", "message": "Scores of people have been killed over the March-May wet season in Kenya as heavier than usual rainfall pounds East Africa, compounded by the El Nino weather pattern.\nThe deluge cut off a road, uprooted trees, washed away homes and sent vehicles flying, devastating the village of Kamuchiri.\nThe disaster occurred at Old Kijabe dam, a hillside barrier formed naturally over decades after railway construction work by Kenya’s former British colonial rulers.\nHis comments came after a crowded boat capsized at the weekend in flooded Tana River county in eastern Kenya.\nTurmoil across the regionThe weather has also wreaked havoc in neighbouring Tanzania, where 155 people have been killed in flooding and landslides."}, {"id": "5184b40d-12f4-4101-86a2-c2bfb817dbc0", "title": "Dozens killed as dam bursts in flood - hit Kenya", "date": "2024-04-29 14:00", "url": "https://www.benningtonbanner.com/news/national/dozens-killed-as-dam-bursts-in-flood-hit-kenya/article_72e5b74b-b189-5c97-9dea-ca14f76a44cf.html", "message": "Scores of people have been killed over the March-May wet season in Kenya as heavier than usual rainfall pounds East Africa, compounded by the El Nino weather pattern.\nJoyce Ncece, chief officer for disaster management in Nakuru County, told AFP on Monday evening that there were 46 bodies at the mortuary, but warned that the number could increase.\nThe Kenyan government spokesman said Monday that 103 people had lost their lives in floods since March, in a statement that did not mention the dam disaster.\nMonday's dam tragedy comes six years after a similar accident at Solai, also in Nakuru county, killed 48 people, sending millions of litres of muddy waters raging through homes and destroying power lines.\nEl Nino is a naturally occurring climate pattern typically associated with increased heat worldwide, leading to drought in some parts of the world and heavy rains elsewhere."}, {"id": "5e2e308e-4dd9-4d9c-a278-37ca57616c1c", "title": "Kenya floods : Scores missing after weeks of heavy rain", "date": "2024-04-30 12:45", "url": "https://www.cnn.com/2024/04/30/africa/kenya-nairobi-flooding-missing-people-intl/", "message": "Mai Mahiu, Kenya CNN —At least 91 people are missing after heavy flooding across Kenya’s capital, Nairobi, the government said Tuesday, after weeks of heavy rain and flash floods ravaged parts of the country.\nSome 76 people are missing after flooding near the hard hit town of Mai Mahiu, northwest of Nairobi.\nResidents gather at the river bed to search for missing people in Mai Mahiu on Monday.\nKenya has registered heavy rain since mid-March but downpours have intensified over the past week, leading to mass flooding which has killed dozens of people.\nHeavy rains have also affected Tanzania and Burundi."}, {"id": "e7d1ff35-0468-4678-a1bb-10ac20abec34", "title": "Sierra Stages Presents HURRICANE DIANE For One Night Only In May", "date": "2024-04-30 01:00", "url": "https://www.broadwayworld.com/sacramento/article/Sierra-Stages-Presents-HURRICANE-DIANE-For-One-Night-Only-In-May-20240429", "message": "Sierra Stages will present Hurricane Diane.\nPresented as an installation of Theater by the Book, Hurricane Diane runs one night only on Wednesday, May 15 at the Nevada Theatre in downtown Nevada City, CA.\nHurricane Diane kicks off with a devilish premise: What if the god Dionysus manifests in the form of a hot lesbian landscaper (aka Diane) and attempts to save the Earth by converting us into a cult of permaculture?\nAs part of Sierra Stages' Theatre by the Book series, the play will be performed with script in and and will show one night only.\nTickets can be purchased online at the Sierra Stages website."}, {"id": "67a3118f-b359-496a-a7a4-3078b8b6a50f", "title": "Asthma risks on the rise due to climate change", "date": "2024-04-29 14:00", "url": "https://www.healio.com/news/pulmonology/20240429/asthma-risks-on-the-rise-due-to-climate-change", "message": "Back to HealioKey takeaways:Multiple outcomes of climate change contribute to asthma development and worsening.\nHealio spoke with Johnson to learn more about how climate change is specifically impacting patients with asthma, ways that climate change is contributing to health disparities and what actions everybody can take against climate change.\nAir pollutionAs a result of climate change, pollution from manmade sources like industry and transportation is on the rise, and this in turn has heightened the risk for asthma and asthma exacerbations.\nWhen asked how clinicians can act against climate change, Johnson emphasized the importance of education.\nClinicians should make sure they discuss how climate change impacts asthma with their patients, so they are more aware of the risks."}, {"id": "3541597b-bbf2-4188-9397-cbfe21fa1562", "title": "Florida leaders prepare for hurricane season , encourage residents to do the same", "date": "2024-04-29 22:45", "url": "https://www.wcjb.com/2024/04/29/florida-leaders-prepare-hurricane-season-encourages-residents-do-same/", "message": "TALLAHASSEE, Fla. (WCJB/Gray Florida Capital Bureau) - State leaders are planning to make sure they are ready for the upcoming hurricane season.\nFlorida Division of Emergency Management Kevin Guthrie is preparing to activate the emergency operations center several times this summer.\nHurricane season never really ends for Guthrie.\nGuthrie said recent changes in preparing for hurricane season are paying off.\nThe state has several resources online to help people make a plan for this hurricane season."}, {"id": "7490a156-b7f9-495b-b7f6-5f8aad54d11f", "title": "Large hail , damaging winds , tornadoes threaten KC area as severe weather returns", "date": "2024-04-30 13:45", "url": "https://www.yahoo.com/news/large-hail-damaging-winds-tornadoes-131201306.html", "message": "Powerful thunderstorms are expected to sweep through the Kansas City region Tuesday, bringing the threat of large hail, damaging winds and maybe a tornado or two, the National Weather Service said.\nThe Storm Prediction Center has placed Kansas City, Des Moines, Topeka and Lawrence under an enhanced risk of severe weather.\nNational Weather Service in Kansas CityAnother round of severe weather in forecastTuesday’s weather will kick off a stormy period for the Kansas City area.\nWeather watches and warningsA live data feed from the National Weather Service containing official weather warnings, watches, and advisory statements.\nSources: NOAA, National Weather Service, NOAA GeoPlatform and Esri."}, {"id": "49e8400d-24ed-4bbe-ad54-eb13a8a01c9c", "title": "Dozens killed as dam bursts in flood - hit Kenya", "date": "2024-04-29 15:00", "url": "https://www.terradaily.com/afp/240429124551.72tk07ze.html", "message": "Dozens killed as dam bursts in flood-hit KenyaMai Mahiu, April 29 (AFP) Apr 29, 2024At least 45 people died when a makeshift dam burst its banks near a town in Kenya's Rift Valley in the early hours of Monday, police said, as torrential rains and floods battered the country.\nResidents said the accident occurred in the dead of night near Mai Mahiu, in Nakuru county, sending water gushing down a hill and engulfing everything in its path.\nA senior officer at Nakuru County police headquarters told AFP by phone that 45 bodies had been recovered so far, while Nakuru governor Susan Kihika said 110 people were being treated in hospital.\nMonday's dam tragedy comes six years after a similar accident at Solai, also in Nakuru county, killed 48 people, sending millions of litres of muddy waters raging through homes and destroying power lines.\nEl Nino is a naturally occurring climate pattern typically associated with increased heat worldwide, leading to drought in some parts of the world and heavy rains elsewhere."}, {"id": "4aca77e7-7b91-49e5-9d4f-86e628669665", "title": "Struggling To Maintain Cultural Resources Against Climate Change Impacts", "date": "2024-04-28 16:00", "url": "https://www.nationalparkstraveler.org/2024/04/struggling-maintain-cultural-resources-against-climate-change-impacts-0", "message": "But his pastoral life turned in 1994 when Congress designated the Mojave National Preserve and began curtailing grazing after more than a century.\nFrom 2012-2015, the National Park Service spent $300,000 burying the ship beneath 16,000 sandbags to prevent erosion.\nFire has impacted other historic resources too, said David R. Nichols, the preserve’s archaeologist and cultural resources manager.\nThe cultural sites “conveyed a distinct feeling of experiencing life in the late 19th early 20th centuries.\nThe Biden administration is funding efforts to protect other cultural sites in the park system from climate change impacts."}, {"id": "a54a2a45-9c17-41fc-9a97-3be3a06fabb6", "title": "Hundreds of houses damaged , eight injured in West Java earthquake", "date": "2024-04-29 07:00", "url": "https://asianews.network/hundreds-of-houses-damaged-eight-injured-in-west-java-earthquake/", "message": "According to the Meteorology, Climatology and Geophysics Agency (BMKG), a magnitude-6.2 earthquake rocked the region at 11:29 p.m. on Saturday.\nThe epicenter of the quake was located about 156 kilometers southwest of Garut, West Java at a depth of 70 kilometers below sea level.\nThe quake produced a shock that affected several cities and regencies in West Java, including the Banjar municipality and the Garut, Bandung, Tasikmalaya and Sukabumi regencies.\nThe disaster agency also recorded that some public facilities such as mosques and schools in Sukabumi and Tasikmalaya regencies sustained damage from the earthquake, according to reports from the West Java Disaster Mitigation Agency (BPBD).\nThere weren’t any foreshocks and there won’t be any aftershocks,” BMKG earthquake and tsunami center head Daryono said in a statement on Sunday."}, {"id": "32df9ec2-4e0e-4650-84ee-77441b6305c9", "title": "Kenya searches for more than 90 missing after floods", "date": "2024-04-30 10:15", "url": "https://www.timeslive.co.za/news/africa/2024-04-30-kenya-searches-for-more-than-90-missing-after-floods/", "message": "Please click here to view our site optimised for your device."}, {"id": "2b5fbfe5-5abc-469d-a303-0d993122d862", "title": "Save money and reduce stress : How to build your hurricane kit one week at a time", "date": "2024-04-29 17:00", "url": "https://www.news4jax.com/news/morning-show/2024/04/29/save-money-and-reduce-stress-how-to-build-your-hurricane-kit-one-week-at-a-time/", "message": "The practical must-haves for your emergency hurricane kitJACKSONVILLE, Fla. – As we approach the 2024 hurricane season, we are helping you build your emergency kit one week at a time so you can spread out the cost and not rush at the last minute.\nFEMA recommends that you have a kit that includes one gallon of water per person, per day, for three to five days, and a two-week supply of nonperishable food if you do not plan to evacuate.\nInterested in the weather beyond the daily forecast?\nEmail Address Sign up for our Weather Authority Insider newsletterAlso, basic storm survival items like a flashlight with batteries, first aid kit, manual can opener, duct tape and a multi-purpose tool, like a utility knife.\nBut emergency management experts recommend spreading out your hurricane kit shopping by just adding items to your weekly grocery run."}, {"id": "6f9313d4-f31f-411f-a3fd-47d6e2945dc7", "title": "Evacuation alert lifted for Burgess Creek wildfire area", "date": "2024-04-29 21:15", "url": "https://www.wltribune.com/local-news/evacuation-alert-lifted-for-burgess-creek-wildfire-area-7351208", "message": "Wildfire classified as being held as cooler weather moves into regionThe evacuation alert issued for the Burgess Creek wildfire area has been lifted by the Cariboo Regional District Emergency Operations Centre (EOC).\nA combination of cooler weather and precipitation, along with a full response from the BCWS, has the Burgess Creek wildfire now classified as being held as of April 29.\nMadison Dahl, fire information officer with BCWS, said more than 120 crew members are still on scene putting out hot spots at Burgess Creek but that number is expected to decrease throughout the week.\nThe CRD noted an evacuation alert or order may need to be reissued if it is deemed necessary, and that residents must be prepared if the area receives a future evacuation order or alert on short notice.\nREAD MORE: Wildfire between Williams Lake, Quesnel grows to 1,600 hectares"}, {"id": "c4fa5954-b3ff-4569-b1fc-0faca98fb3db", "title": "Evacuation alert lifted for Burgess Creek wildfire area", "date": "2024-04-29 23:30", "url": "https://www.clearwatertimes.com/local-news/evacuation-alert-lifted-for-burgess-creek-wildfire-area-7351208", "message": "Wildfire classified as being held as cooler weather moves into regionThe evacuation alert issued for the Burgess Creek wildfire area has been lifted by the Cariboo Regional District Emergency Operations Centre (EOC).\nA combination of cooler weather and precipitation, along with a full response from the BCWS, has the Burgess Creek wildfire now classified as being held as of April 29.\nMadison Dahl, fire information officer with BCWS, said more than 120 crew members are still on scene putting out hot spots at Burgess Creek but that number is expected to decrease throughout the week.\nThe CRD noted an evacuation alert or order may need to be reissued if it is deemed necessary, and that residents must be prepared if the area receives a future evacuation order or alert on short notice.\nREAD MORE: Wildfire between Williams Lake, Quesnel grows to 1,600 hectares"}, {"id": "2ef6f415-174e-467f-9ba1-b659df2248dc", "title": "Forecast : Threat for severe storms returns to Iowa Tuesday", "date": "2024-04-30 12:15", "url": "https://siouxcityjournal.com/news/state-regional/weather/weather-forecast-iowa-storms-wind-hail/article_f1529954-592d-5aef-aed6-677d10473a92.html", "message": "Showers and storms are likely during the afternoon and evening today in Iowa.\nDamaging wind and hail are expected in spots and tornadoes and flooding can't be ruled out.\nGet all the details on the hazards and storm timing in our latest forecast video."}, {"id": "48d6ab1f-125d-41e2-9f59-85e93061f4be", "title": "NJ earthquake aftershocks pass 140 with surprisingly big tremor", "date": "2024-04-28 16:30", "url": "https://nj1015.com/nj-earthquake-aftershocks-pass-140-with-surprisingly-big-tremor/", "message": "🔴 2.9 magnitude aftershock hit Hunterdon County🔴 2nd biggest aftershock since April 5 earthquake🔴 Unlike most aftershocks, people reported feeling this oneTEWKSBURY — More than three weeks since New Jersey's April 5 earthquake, aftershocks continue to shake up the Garden State.\nA 2.9 magnitude aftershock was confirmed in Hunterdon County on Saturday morning.\nAn aftershock of 3.7 magnitude was measured just minutes after the 4.8 magnitude tremor on April 5.\nRELATED: NJ house deemed unsafe to live after earthquakeThe relatively big aftershock Saturday morning bucks the trend of most aftershocks since April 5 being too small to feel.\n\"Another NJ earthquake."}, {"id": "6264cfc1-7277-4ebe-999a-20d85c7ec486", "title": "Lafayette Homeowners Urged To View Their Home on Flood Map", "date": "2024-04-29 20:15", "url": "https://talkradio960.com/ixp/36/p/lafayette-flood-maps/", "message": "(Lafayette, Louisiana) - Louisiana weather patterns are about as predictable as winning lottery numbers.\nMonths after the flooding, FEMA updated flood maps were issued for Lafayette parish.\nThe level of relevance can increase or decrease the cost of your flood insurance.\nFEMA's FIRM (Flood Insurance Rate Map) for Lafayette is available at Lafayettela.gov.\nYou can check current flood maps or dig into historical flood maps to see if your home's risk has changed over the years."}, {"id": "ad5e7719-37ec-4d39-8aab-48fd854a7fbc", "title": "Ruang volcano erupts again in Indonesia , no tsunami warning issued", "date": "2024-04-30 10:00", "url": "https://www.albawaba.com/news/ruang-volcano-erupts-again-indonesia-no-tsunami-warning-issued-1563801", "message": "ANKARAA volcano in Indonesia’s Ruang Island again erupted early Tuesday, but no tsunami warning has so far been issued, local media reported.\nThe Center for Volcanology and Geological Disaster Mitigation said that the volcano erupted again in the North Sulawesi Province, Kompas TV reported.\nThe height of ash observed due to the eruption of Mount Ruang was approximately 2,000 meters above the peak, it said.\nThe government has already decided to relocate the residents of Ruang Island, North Sulawesi, affected by the Mount Ruang eruption since April 16.\nSince April 16, volcanic eruptions in Indonesia’s North Sulawesi left dozens of flights canceled, affecting thousands of passengers, as authorities closed the Sam Ratulangi Airport."}, {"id": "4f30c475-3b4a-497b-a499-195757b33b0c", "title": "UN expresses solidarity with Kenya following deadly floods", "date": "2024-04-30 01:45", "url": "https://www.globalissues.org/news/2024/04/29/36597", "message": "The Secretary-General extended his condolences and solidarity to the families of the victims and to the people and Government of Kenya.\nThe heavy rains began in March, killing more than 100 people across the country since then.\nThis season's flash flooding follows similarly heavy rains that began late last year, affecting almost 600,000 people.\nWhat worries me is how Kenya is currently facing a climate emergency that it did not cause; drought and floods,\" said Dr. Jackson.\nMeanwhile, UNHCR in Kenya said the heavy rains are causing serious flooding and displacement at the Dadaab refugee camps, located in the north."}, {"id": "9f94e181-8f0d-4f5a-bd52-85302201c033", "title": "Kenya searches for more than 90 missing after floods", "date": "2024-04-30 11:30", "url": "http://www.channelafrica.co.za/sabc/home/channelafrica/news/details?id=7c3d3c85-2f88-4cc5-9e3c-9e085bcc1bab&title=Kenya%20searches%20for%20more%20than%2090%20missing%20after%20floods", "message": "At least 46 people were killed this Monday morning in a mudslide and flash floods in Mai Mahiu town in central Kenya, the Ministry said in a situation report, an increase of one on the previous death toll.\nSurvivors in Mai Mahiu described an onslaught of water that carried away houses, cars and railway tracks.\nFifty-three more people in Mai Mahiu were reported missing, the Interior Ministry said, while the Kenya Red Cross said its tracing desk had reports of 76 missing.\nIn all, at least 169 people have died across Kenya from heavy rains and flooding since last month.\nAt least 120 people were killed in Kenya late last year by flooding caused by the El Nino weather phenomenon."}, {"id": "47f98168-2310-494a-947b-cbd46a267f39", "title": "Kenya rescuers look for more than 90 missing after floods kill 46", "date": "2024-04-30 09:00", "url": "https://www.dailysabah.com/world/africa/kenya-rescuers-look-for-more-than-90-missing-after-floods-kill-46", "message": "Kenyan rescuers were scrambling Tuesday to find at least 91 people missing in heavy flooding across the country, the Interior Ministry said.\nSurvivors in Mai Mahiu described an onslaught of water that carried away houses, cars and railway tracks.\nA woman and a man take mud and water out of their house in an area heavily affected by torrential rains and flash floods in Mai Mahiu, Kenya, April 29, 2024.\n(AFP Photo)Fifty-three more people in Mai Mahiu were reported missing, the Interior Ministry said, while the Kenya Red Cross said its tracing desk had reports of 76 missing.\nAt least 120 people were killed in Kenya late last year by flooding caused by the El Nino weather phenomenon."}, {"id": "4a8c02f3-b87a-4c48-be5a-1980a61af698", "title": "Climate shocks bring devastating drought to southern Africa doorstep", "date": "2024-04-30 09:45", "url": "https://www.theeastafrican.co.ke/tea/science-health/climate-shocks-bring-drought-to-southern-africa-s-doorstep-4608000", "message": "Kenya and its neighbours in the northeast of the continent are now facing severe flooding, also linked to El Niño climate patterns.\nIt is associated with increased rainfall, often causing flooding in the Horn of Africa and the southern United States of America, and unusually dry and warm conditions in southeast Asia, Australia and southern Africa.\nAid agencies say 4.4 million Malawians are already reeling from the effects of the El Nino-induced drought after the maize crop was hit by below-normal rainfall and high temperatures.\n“The Southern Africa region is expected to have a supply gap for staple cereals following the expected below-average harvest,” reads the forecast.\nMore than just a climate shockChikwe Mbweeda, CARE Zambia country director, said this year’s drought was more than just a climate shock."}, {"id": "b474900d-6d38-45a1-9518-c36d64d89e7c", "title": "West Java residents should be adaptive in mitigating earthquakes : BMKG", "date": "2024-04-30 13:15", "url": "https://en.antaranews.com/news/312195/west-java-residents-should-be-adaptive-in-mitigating-earthquakes-bmkg", "message": "West Java residents should be adaptive in mitigating earthquakes: BMKGJakarta (ANTARA) - The Meteorology, Climatology, and Geophysics Agency (BMKG) called on West Java residents to be adaptive and proactive in mitigating potential earthquakes, as the region is prone to the disaster.\nContinuous rains can cause dams to burst and lead to flooding.\n\"This occurred in Garut (West Java) and the Banten Province in the past.\nHence, there is a need for tighter vigilance and supervision of the soil condition in areas prone to landslides and floods,\" she stated.\nTranslator: Sugiharto P, KenzuEditor: Azis KurmalaCopyright © ANTARA 2024"}, {"id": "f6e18794-0909-470c-90d3-116827269b71", "title": "How Hot Will It Be in Houston This Summer ? | Houstonia Magazine", "date": "2024-04-29 13:00", "url": "https://www.houstoniamag.com/news-and-city-life/2024/04/summer-heat-prediction", "message": "The summer will be hot, of course, but how hot exactly is the question.\nTo add insult to injury, a drought blanketing much of the region necessitated city-wide water conservation efforts, while air-conditioning units worked overtime to provide relief from the oppressive hot weather.\n“Every summer is hot in Houston, it’s just a matter of, relative to average, how hot is it?” Lanza says.\nThat’ll give us a hint of what at least the first half of summer might be like.”Lanza says there’s a chance the start of summer could be quite hot, mirroring the brutal heat of recent years.\n“The Gulf is always going to be warm enough for hurricanes but the entire Atlantic is just really, really warm,” Lanza says."}, {"id": "c605bdd1-caae-48b2-956b-05f00070fb5d", "title": "Tornado in China Guangdong Province Kills at Least 5 , Dozens Injured : State Media", "date": "2024-04-29 03:45", "url": "https://www.theepochtimes.com/china/tornado-in-chinas-guangdong-province-kills-at-least-5-dozens-injured-state-media-5639246", "message": "The tornado reportedly hit the Guangdong Province capital in the south of the country at around 3 p.m. Local time (2 a.m. EST) on Saturday, according to China’s official Xinhua news agency.\nThe Chinese province of Guangdong is the most populous in the country, and is home to almost 130 million people.\nHowever, reports of severe weather phenomena in China have been mounting in recent years.\nThe same month, several other provinces, including Shandong and Guangdong experienced severe flooding , resulting in homes and businesses submerged in water, which led to widespread closures of schools and businesses throughout.\nIn August 2020, severe and continuous rain caused deadly landslides in the country’s Sichuan province , resulting in an unconfirmed number of casualties."}, {"id": "ae5bee72-716e-46a4-9325-299dc8365682", "title": "2 dead , including infant , after nighttime tornadoes rip through Oklahoma", "date": "2024-04-28 17:30", "url": "https://komonews.com/news/nation-world/2-dead-including-infant-after-nighttime-tornadoes-rip-through-oklahoma-severe-weather-wx-storms-gov-kevin-stitt-state-of-emergency-national-weather-service-damage-destruction-downed-trees-power-lines", "message": "Four people have died in Oklahoma after tornadoes ripped through the state Saturday night.\nDefinitely the most damage since I've been governor that I've seen,\" he said during the briefing.\nAccording to the National Weather Service, at least 20 tornadoes touched down in North Texas and Oklahoma.\nThis will temporarily suspend requirements for size and weight permits of oversized vehicles that transport materials and supplies for recovery efforts, relief and power restoration.\nKay County Emergency Management reported that several power poles were broken, and there were several miles of broken trees northwest of Newkirk."}, {"id": "2bcfc053-9dec-4603-86a7-9f6ad6adefae", "title": "Dozens killed as dam bursts in flood - hit Kenya", "date": "2024-04-29 11:00", "url": "https://gulfnews.com/world/africa/dozens-killed-as-dam-bursts-in-flood-hit-kenya-1.102386791", "message": "Residents said the accident occurred in the dead of night near Mai Mahiu, in Nakuru county, sending water gushing down a hill and engulfing everything in its path.\nOn Saturday, officials said 76 people had lost their lives in Kenya since March, with over 130,000 displaced.\nSchools have been forced to remain shut following mid-term holidays, after the education ministry announced Monday it would postpone their reopening to May 6 due to “ongoing heavy rains”.\nMonday’s dam disaster comes six years after a similar accident at Solai, also in Nakuru county, killed 48 people, sending millions of litres of muddy waters raging through homes and destroying power lines.\nEl Nino is a naturally occurring climate pattern typically associated with increased heat worldwide, leading to drought in some parts of the world and heavy rains elsewhere."}, {"id": "5968c6ed-290e-40e0-967c-7d5724dec8f0", "title": "2 dead , including infant , after nighttime tornadoes rip through Oklahoma", "date": "2024-04-28 16:30", "url": "https://local12.com/news/nation-world/2-dead-including-infant-after-nighttime-tornadoes-rip-through-oklahoma-severe-weather-wx-storms-gov-kevin-stitt-state-of-emergency-national-weather-service-damage-destruction-downed-trees-power-lines", "message": "Four people have died in Oklahoma after tornadoes ripped through the state Saturday night.\nDefinitely the most damage since I've been governor that I've seen,\" he said during the briefing.\nAccording to the National Weather Service, at least 20 tornadoes touched down in North Texas and Oklahoma.\nThis will temporarily suspend requirements for size and weight permits of oversized vehicles that transport materials and supplies for recovery efforts, relief and power restoration.\nKay County Emergency Management reported that several power poles were broken, and there were several miles of broken trees northwest of Newkirk."}, {"id": "d9335b01-556b-4656-b39a-7686ead7d004", "title": "2 dead , including infant , after nighttime tornadoes rip through Oklahoma", "date": "2024-04-28 17:15", "url": "https://wset.com/news/nation-world/2-dead-including-infant-after-nighttime-tornadoes-rip-through-oklahoma-severe-weather-wx-storms-gov-kevin-stitt-state-of-emergency-national-weather-service-damage-destruction-downed-trees-power-lines", "message": "Four people have died in Oklahoma after tornadoes ripped through the state Saturday night.\nDefinitely the most damage since I've been governor that I've seen,\" he said during the briefing.\nAccording to the National Weather Service, at least 20 tornadoes touched down in North Texas and Oklahoma.\nThis will temporarily suspend requirements for size and weight permits of oversized vehicles that transport materials and supplies for recovery efforts, relief and power restoration.\nKay County Emergency Management reported that several power poles were broken, and there were several miles of broken trees northwest of Newkirk."}, {"id": "4274c08c-34e8-42d0-abcf-5080fcb381c5", "title": "Florence Council approves $1 . 8 million for stormwater projects", "date": "2024-04-30 04:45", "url": "https://wpde.com/news/local/florence-leaders-stormwater-projects-road-improvements-master-plan-budget-reduce-flooding-storm-water-community-help-special-meeting-south-carolina-april-29-2024", "message": "Amongst other things, the Stormwater Utility Enterprise Fund was on the agenda.\nAccording to officials, $1.8 million will go toward operations to reduce flooding in Florence.\nRELATED:Thirteen stormwater projects have been approved to begin construction.\nThat project is grant-funded and will affect areas near Timrod Park and Gulley Branch.\n\"One of the most exciting things I think, is the daylighting of Gulley Branch so that will be in the Timrod Park, in the actual park."}, {"id": "4f33c2b8-a16b-412b-b9f5-8bc575629d61", "title": "2 dead , including infant , after nighttime tornadoes rip through Oklahoma", "date": "2024-04-28 16:15", "url": "https://wwmt.com/news/nation-world/2-dead-including-infant-after-nighttime-tornadoes-rip-through-oklahoma-severe-weather-wx-storms-gov-kevin-stitt-state-of-emergency-national-weather-service-damage-destruction-downed-trees-power-lines", "message": "Four people have died in Oklahoma after tornadoes ripped through the state Saturday night.\nDefinitely the most damage since I've been governor that I've seen,\" he said during the briefing.\nAccording to the National Weather Service, at least 20 tornadoes touched down in North Texas and Oklahoma.\nThis will temporarily suspend requirements for size and weight permits of oversized vehicles that transport materials and supplies for recovery efforts, relief and power restoration.\nKay County Emergency Management reported that several power poles were broken, and there were several miles of broken trees northwest of Newkirk."}, {"id": "665de6c2-e1e3-44e6-b4e4-242582a7344b", "title": "2 dead , including infant , after nighttime tornadoes rip through Oklahoma", "date": "2024-04-28 16:15", "url": "https://abc6onyourside.com/news/nation-world/2-dead-including-infant-after-nighttime-tornadoes-rip-through-oklahoma-severe-weather-wx-storms-gov-kevin-stitt-state-of-emergency-national-weather-service-damage-destruction-downed-trees-power-lines", "message": "Four people have died in Oklahoma after tornadoes ripped through the state Saturday night.\nDefinitely the most damage since I've been governor that I've seen,\" he said during the briefing.\nAccording to the National Weather Service, at least 20 tornadoes touched down in North Texas and Oklahoma.\nThis will temporarily suspend requirements for size and weight permits of oversized vehicles that transport materials and supplies for recovery efforts, relief and power restoration.\nKay County Emergency Management reported that several power poles were broken, and there were several miles of broken trees northwest of Newkirk."}, {"id": "9fd00b27-3aed-4e04-8415-9f724f50c50a", "title": "2 dead , including infant , after nighttime tornadoes rip through Oklahoma", "date": "2024-04-28 16:30", "url": "https://katv.com/news/nation-world/2-dead-including-infant-after-nighttime-tornadoes-rip-through-oklahoma-severe-weather-wx-storms-gov-kevin-stitt-state-of-emergency-national-weather-service-damage-destruction-downed-trees-power-lines", "message": "Four people have died in Oklahoma after tornadoes ripped through the state Saturday night.\nDefinitely the most damage since I've been governor that I've seen,\" he said during the briefing.\nAccording to the National Weather Service, at least 20 tornadoes touched down in North Texas and Oklahoma.\nThis will temporarily suspend requirements for size and weight permits of oversized vehicles that transport materials and supplies for recovery efforts, relief and power restoration.\nKay County Emergency Management reported that several power poles were broken, and there were several miles of broken trees northwest of Newkirk."}, {"id": "47ac3ea0-5889-4fd8-9504-bcbd82f40e7a", "title": "2 dead , including infant , after nighttime tornadoes rip through Oklahoma", "date": "2024-04-28 16:15", "url": "https://turnto10.com/news/nation-world/2-dead-including-infant-after-nighttime-tornadoes-rip-through-oklahoma-severe-weather-wx-storms-gov-kevin-stitt-state-of-emergency-national-weather-service-damage-destruction-downed-trees-power-lines", "message": "Four people have died in Oklahoma after tornadoes ripped through the state Saturday night.\nDefinitely the most damage since I've been governor that I've seen,\" he said during the briefing.\nAccording to the National Weather Service, at least 20 tornadoes touched down in North Texas and Oklahoma.\nThis will temporarily suspend requirements for size and weight permits of oversized vehicles that transport materials and supplies for recovery efforts, relief and power restoration.\nKay County Emergency Management reported that several power poles were broken, and there were several miles of broken trees northwest of Newkirk."}, {"id": "7567eb97-e505-4999-b353-9eb7dc446ab0", "title": "CenterPoint proposes $2B  resiliency plan  for extreme weather", "date": "2024-04-29 23:00", "url": "http://www.houstonchronicle.com/business/energy/article/centerpoint-extreme-weather-plan-19421019.php", "message": "The utility company is proposing $2 billion in investments to strengthen its system against extreme weather and other risks.\nAdvertisement Article continues below this adGrid investmentsRyan said the opportunity to file a resiliency plan allows CenterPoint to present its long-term strategy to address future risks.\nOne would study, design and operate a program observing the performance of utility-scale microgrids, localized grids that can disconnect from the main grid, during extreme weather events such as hurricanes.\nAnother would pay a Houston city employee to oversee the implementation of projects related to power resiliency and energy efficiency.\nRhizome is helping a Texas utility with its resiliency filing, though Thadani declined to share which one."}, {"id": "500092d1-2c1d-4b17-97c6-ec3fbc2af51c", "title": "2 dead , including infant , after nighttime tornadoes rip through Oklahoma", "date": "2024-04-28 15:45", "url": "https://cbs12.com/news/nation-world/2-dead-including-infant-after-nighttime-tornadoes-rip-through-oklahoma-severe-weather-wx-storms-gov-kevin-stitt-state-of-emergency-national-weather-service-damage-destruction-downed-trees-power-lines", "message": "Four people have died in Oklahoma after tornadoes ripped through the state Saturday night.\nDefinitely the most damage since I've been governor that I've seen,\" he said during the briefing.\nAccording to the National Weather Service, at least 20 tornadoes touched down in North Texas and Oklahoma.\nThis will temporarily suspend requirements for size and weight permits of oversized vehicles that transport materials and supplies for recovery efforts, relief and power restoration.\nKay County Emergency Management reported that several power poles were broken, and there were several miles of broken trees northwest of Newkirk."}, {"id": "1e5a864e-de02-4c5e-a704-e514ab2021b3", "title": "Biden approves disaster declaration for Washington after January storms", "date": "2024-04-30 04:30", "url": "https://www.columbian.com/news/2024/apr/29/biden-approves-disaster-declaration-for-washington-after-january-storms/", "message": "President Joe Biden approved a federal disaster declaration on Sunday for several Washington counties following the January winter storms that caused widespread flooding, landslides, downed trees and power outages that affected over 100,000 people.\nWashington declared a state of emergency for the 16 counties in mid-March, saying the storms caused more than $30 million in damage.\nIn King County, the storms damaged schools, wastewater treatment centers and Swedish Health Services facilities.\nThe city of Port Angeles activated its emergency operations center on Jan. 8 as extreme cold set in, threatening vulnerable populations.\nA boil order was issued after a series of frozen pipes burst and major water lines broke."}, {"id": "235c0122-1494-4f1b-a9df-289558921425", "title": "Biden approves disaster declaration for WA after January storms", "date": "2024-04-30 00:15", "url": "https://www.yakimaherald.com/news/northwest/biden-approves-disaster-declaration-for-wa-after-january-storms/article_ee7584d1-0739-5370-b031-d0478860a2dc.html", "message": "Six-year-old Kander braves the high waves along 63rd Avenue Southwest on Jan. 9 in West Seattle.\n(Ellen M. Banner / The Seattle Times)"}, {"id": "490b2b04-0389-444c-ab8f-839f99473211", "title": "Cal Fire offers tips on home fire prevention – NBC Bay Area", "date": "2024-04-29 18:00", "url": "https://www.nbcbayarea.com/news/local/cal-fire-tips-home-fire-prevention/3523915/", "message": "\"Fires are mostly caused by the human factor,\" Cal Fire Battalion Chief Robert Carvalho.\nGet a weekly recap of the latest San Francisco Bay Area housing news.\nIn addition to these tips, Cal Fire emphasizes that defensible space is one of the most important ways to protect a home against fire.\n\"No stacks of wood next to the home,\" the battalion chief said.\nCal Fire is taking steps to get ready for the increased risk posed by warmer weather, the battalion chief said."}, {"id": "59f0a81b-9cac-4229-8e16-1c36cd94c213", "title": "2 dead , including infant , after nighttime tornadoes rip through Oklahoma", "date": "2024-04-28 17:30", "url": "https://khqa.com/news/nation-world/2-dead-including-infant-after-nighttime-tornadoes-rip-through-oklahoma-severe-weather-wx-storms-gov-kevin-stitt-state-of-emergency-national-weather-service-damage-destruction-downed-trees-power-lines", "message": "Four people have died in Oklahoma after tornadoes ripped through the state Saturday night.\nDefinitely the most damage since I've been governor that I've seen,\" he said during the briefing.\nAccording to the National Weather Service, at least 20 tornadoes touched down in North Texas and Oklahoma.\nThis will temporarily suspend requirements for size and weight permits of oversized vehicles that transport materials and supplies for recovery efforts, relief and power restoration.\nKay County Emergency Management reported that several power poles were broken, and there were several miles of broken trees northwest of Newkirk."}, {"id": "72fe12b3-dc25-4949-9391-7c869247ac67", "title": "Recent Floods Claim Eight Lives Over Three Days", "date": "2024-04-28 21:15", "url": "https://tolonews.com/index.php/afghanistan-188540", "message": "The State Ministry for Disaster Management Affairs reported that in the past three days, rainfall and flooding claimed the lives of eight individuals and injured three others.\nAccording to the ministry, the floods and rainfall also destroyed 140 homes and devastated 20 acres of agricultural land across 15 provinces.\nSeveral victims in Nangarhar said that recent floods and rainfall have caused them significant financial loss.\nWhen the flood comes, it reaches the town square and damages homes,” said Firooz, a victim from Parwan.\nThe Chamber of Agriculture and Livestock stated that to prevent damage from floods and rainfall, the Islamic Emirate should maintain certain measures."}]