[{"id": "43827b7d-8f33-4ae7-aee2-702af257d585", "title": "US Rep Proposes Cutting Funding to Harvard Over Protests", "date": "2024-05-20 02:15", "url": "https://sputnikglobe.com/20240519/us-rep-says-cutting-harvards-federal-funding-over-protests-should-be-on-the-table-1118532869.html", "message": "https://sputnikglobe.com/20240519/us-rep-says-cutting-harvards-federal-funding-over-protests-should-be-on-the-table-1118532869.htmlUS Rep Says Cutting Harvard's Federal Funding Over Protests Should Be ‘On The Table’US Rep Says Cutting Harvard's Federal Funding Over Protests Should Be ‘On The Table’Sputnik InternationalDemocratic Rep. Jake Auchincloss said during a televised interview that cutting funding to Harvard should be on the table for what he called \"antisemitism.\"\n2024-05-19T22:51+00002024-05-19T22:51+00002024-05-19T22:51+0000worldisraelamericansmichael herzogpalestinianspalestineadlharvardusfox newshttps://cdn1.img.sputnikglobe.com/img/107830/43/1078304325_0:54:1024:630_1920x0_80_0_0_f9cd001094c69ae36108ee2b3a9039ee.jpgRep. Jake Auchincloss (D-MA) said during a televised interview that cutting federal funding to Harvard should be “on the table” in response to what he claims is antisemitism on the campus of the Ivy League school.The comments come as Pro-Palestine protests have sprung up at college campuses across the Nation, including Harvard and other Ivy League schools.More than 70% of Democrats and 61% of all Americans support a permanent ceasefire in Gaza andTo support his assertion, Auchincloss pointed to the Anti-Defamation League’s (ADL) Campus Antisemitism Report Card which gave Harvard and 12 other top schools failing grades, judging them on three main criteria: “Jewish life on campus,” “incidents on campus” and “administrative actions and policies.”Harvard’s report notes that it has a high Jewish student population, extensive Jewish groups and support for Religious activities, Kosher dining and an official anti-boycott, divestment and sanctions (BDS) policy.The university nevertheless received an F from the ADL for what it describes as “high” levels of “Severe antisemitic and anti-Zionist incidents,” “Other antisemitic and anti-Zionist incidents,” “Hostile anti-Zionist student government activity,” “Hostile anti-Zionist groups” and “Antisemitic speakers or programs on campus.”It did not mention which groups or speakers it considered antisemitic.The ADL’s report card of the school focuses almost entirely on anti-Zionist and Pro-Palestinian protests, referencing both an April 2022 protest against an event that included Israel’s ambassador to the US Michael Herzog, as well as protests opposing Israel’s campaign in Gaza.It also mentions the tearing down of posters depicting Israeli hostages and a 1960s political cartoon published by a Palestinian student group that the ADL said was antisemitic.The protests at Harvard included many Jewish students and the Jewish Voice for Peace has been one of the principal organizers of the protests.\nLast week, the students agreed to end their protest after agreeing with the school’s administration to have a meeting addressing the student’s demands.Since the Hamas attack on Israel on October 7, during which roughly 1,000 Israelis were killed, more than 35,000 Palestinians have been killed, including more than 13,000 children.\nhttps://sputnikglobe.com/20240518/israeli-political-crisis-deepens-as-idf-failures-prompt-cabinet-resignation-threat-1118521853.htmlisraelpalestineSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 602024Ian DeMartinoIan DeMartinoNewsen_ENSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 601920 1080 true1920 1440 true1920 1920 trueSputnik International feedback@sputniknews.com +74956456601 MIA „Rosiya Segodnya“ 252 60Ian DeMartinoantisemitism on campus, harvard protests, jake auchincloss"}, {"id": "c1f89816-a9d5-4a6e-bd36-353b8e4e23e5", "title": "What it means to be brave today for Jews and Israelis - opinion", "date": "2024-05-20 01:00", "url": "https://www.jpost.com/israel-hamas-war/article-801761", "message": "All this talk of safety and security betrays a fundamental misunderstanding of the Jewish condition, Jewish history, and Jewish destiny (and really, that of humanity itself).\nBravery means letting go of “safetyism” and accepting the radical uncertainty which characterizes Jewish existence.\nAnd likewise, in the context of Israel, bravery starts by purging safetyism from our self-conception and how we let others talk about us.\nBravery means risking international disapproval – not for the sake of our safety and security, but for the sake of our values.\nAnd bravery means we ought to stop trying to adopt someone else’s story and instead start writing our own."}, {"id": "8a438129-e628-4e0f-a0ce-c8025a46cd91", "title": "  Strong community : Event recognizes Jewish American heritage , support for Israel", "date": "2024-05-20 04:15", "url": "https://www.newsday.com/long-island/nassau/israel-heritage-dll40qtk", "message": "When Israeli Defense Forces paratrooper Ira Kohler told his fellow soldiers he was heading home to Plainview after fighting for more than 100 days in Gaza and finishing his service, they begged him to reconsider.\nDon’t go home — antisemitism is on the rise,’ ” Kohler told hundreds of people who gathered Sunday at Plainview-Old Bethpage Park for a rally to show support for Israel in the ongoing war with Hamas.\n“I told them we had a strong community.”The event, which included speeches from elected officials and community leaders, as well as Kohler and Holocaust survivor Alfred Weinberg, was also designed to celebrate the contributions of the Jewish community during Jewish American Heritage Month.\n“We stand with Israel,” he told the crowd.\n“Hamas is standing between myself and my friend Omer,” Kohler said."}, {"id": "e8fec90a-0ade-4011-8829-70da87cf7267", "title": "Religious organizations host interfaith service for Wadee Alfayoumi", "date": "2024-05-20 05:30", "url": "https://dailynorthwestern.com/2024/05/20/city/interfaith-service-held-for-victim-killed-in-alleged-anti-palestinian-hate-crime-rallies-support-for-congressional-resolution/", "message": "On Sunday evening, the First United Methodist Church in Chicago, also known as the Chicago Temple, held an interfaith service in Alfayoumi’s memory and to urge people to support a U.S. House resolution that honors him.\nThe resolution advocates against hate crimes, Islamophobia, antisemitism, and anti-Palestinian and anti-Arab discrimination.\nThe dehumanization of Palestinians has resulted in the murder of Alfayoumi and other hate crimes, Khalil said.\nRosen said hate crimes do not occur in a vacuum but are a result of echo chambers.\nMozaffar said the nation needs to respond proactively to hate crimes to prevent its “character” from becoming shaped by what happened to Alfayoumi."}, {"id": "65c9f638-0ee9-43b5-8d4e-dfda6c8ea3cc", "title": "Pro - Palestinian protesters at Drexel ignore call to disband as arrests nationwide surpass 3 , 000", "date": "2024-05-20 22:15", "url": "https://www.startribune.com/pro-palestinian-protesters-at-drexel-ignore-call-to-disband-as-arrests-nationwide-approach-3000/600367290/", "message": "Pro-Palestinian protesters ignored a request by Drexel University's president to disband their encampment on Monday as arrests linked to campus demonstrations against the Israel-Hamas war surpassed the 3,000 mark nationwide.\nFry threatened disciplinary action against Drexel students participating in the protest.\nCampuses have been calmer recently, with fewer arrests, as students leave for summer break.\nNearby, on the University of Pennsylvania campus, university and city police arrested 19 demonstrators Friday night, including six Penn students.\nAs part of the agreement, Wesleyan protesters cleared their encampment on Monday, according to a school spokesperson."}, {"id": "1094ef77-1eab-4c9c-9531-d66470da8d61", "title": "Pro - Palestinian Protesters at Drexel Ignore Call to Disband as US Arrests Top 3 , 000", "date": "2024-05-20 23:00", "url": "https://www.newsmax.com/newsfront/israel-palestinians-campus-protests/2024/05/20/id/1165456/", "message": "Pro-Palestinian protesters ignored a request by Drexel University's president to disband their encampment on Monday as arrests linked to campus demonstrations against the Israel-Hamas war surpassed the 3,000 mark nationwide.\nIn a statement issued a day earlier, Drexel President John Fry said as many as 60 protesters were at the encampment, lambasting it as “intolerably disruptive to normal university operations.\"\nHe said there were \"serious concerns about the conduct of some participants, including distressing reports and images of protestors subjecting passersby to antisemitic speech, signs and chants.” Fry threatened disciplinary action against Drexel students participating in the protest.\nCampuses have been calmer recently, with fewer arrests, as students leave for summer break.\nNearby, on the University of Pennsylvania campus, university and city police arrested 19 demonstrators Friday night, including six Penn students."}, {"id": "2c5082de-6885-46a6-a4dc-1d6964df9c5f", "title": "Miriam Adelson Money Could Transform Trump 2024 Campaign", "date": "2024-05-20 13:30", "url": "https://nymag.com/intelligencer/article/miriam-adelson-trump-2024-campaign-donor-israel.html", "message": "Miriam Adelson is now 78 and worth $30 billion.\nShe and Sheldon donated $25 million to Trump’s super-PACs, understanding this would almost certainly enable them to mold Trump’s Israel policy.\nWhen Miriam was a child, her mother, Menucha Zimelson, carried a passport photo: an image of her sister, Adelson’s aunt.\nOne day, in 1989, while eating lunch at a Jewish deli in Brookline, Massachusetts, she ran into Sheldon Adelson, an acquaintance.\nAdelson’s largesse seemed to stir within the Trump family a desire to keep her happy."}]